{
  "source_file": "jnj-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2 — Management’s discussion and analysis of financial condition and results of operations\nResults of operations\nSales to customers\nAnalysis of consolidated sales\nFor the fiscal nine months of 2025, worldwide sales were $69.6 billion, a total increase of 5.0%, including an operational* increase of 4.7% as compared to 2024 fiscal nine months sales of $66.3 billion. Currency fluctuations had a positive impact of 0.3% for the fiscal nine months of 2025. In the fiscal nine months of 2025, acquisitions and divestitures had net positive impact of 1.2%, on worldwide operational sales growth, primarily related to CAPLYTA and Shockwave. In the fiscal nine months of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, on worldwide operational sales was approximately 6.1%. \nSales by U.S. companies were $39.6 billion in the fiscal nine months of 2025, which represented an increase of 6.6% as compared to the prior year. In the fiscal nine months of 2025, acquisitions and divestitures had net positive impact of 2.0% on U.S. operational sales growth, primarily related to CAPLYTA and Shockwave. In the fiscal nine months of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition on U.S. operational sales was approximately 7.1%. Sales by international companies were $30.1 billion, which represented an increase of 3.0%, including an operational increase of 2.3%, and a positive currency impact of 0.7% as compared to the fiscal nine months sales of 2024. In the fiscal nine months of 2025, the net impact of acquisitions and divestitures on international operational sales growth was a positive 0.1%. In the fiscal nine months of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, on international operational sales was approximately 5.0%.\nIn the fiscal nine months of 2025, sales by companies in Europe achieved growth of 4.2%, which included an operational increase of 1.5% and a positive currency impact of 2.7%. Sales by companies in the Western Hemisphere, excluding the U.S., achieved growth of 0.7%, which included an operational increase of 7.6% partially offset by negative currency impact of 6.9%. Sales by companies in the Asia-Pacific, Africa region achieved growth of 1.9%, including operational growth of 1.8% and a positive currency impact of 0.1%.\nFiscal nine months 2025\nsales by geographic region (in billions)\nFiscal nine months 2025\nsales by segment (in billions)\nNote: values may have been rounded\n*operational growth excludes the effect of translational currency\nForm 10-Q\n41\nTable of Contents\nFor the fiscal third quarter of 2025, worldwide sales were $24.0 billion, a total increase of 6.8%, which included operational growth of 5.4% and a positive currency impact of 1.4% as compared to 2024 fiscal third quarter sales of $22.5 billion. In the fiscal third quarter of 2025, the net impact of acquisitions and divestitures on worldwide operational sales growth was a positive 1.0%, related to CAPLYTA. In the fiscal third quarter of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, on worldwide operational sales was approximately 6.4%.\nSales by U.S. companies were $13.7 billion in the fiscal third quarter of 2025, which represented an increase of 6.2% as compared to the prior year. In the fiscal third quarter of 2025, the net impact of acquisitions and divestitures on U.S. operational sales growth was a positive 1.8%. In the fiscal third quarter of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition on U.S. operational sales was approximately 7.7%. Sales by international companies were $10.3 billion, a total increase of 7.6%, which included operational growth of 4.4% and a positive currency impact of 3.2%. In the fiscal third quarter of 2025, there was no net impact of acquisitions and divestitures on international operational sales growth. In the fiscal third quarter of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, on international operational sales was approximately 4.8%.\nIn the fiscal third quarter of 2025, sales by companies in Europe achieved growth of 10.7%, which included operational growth of 4.4% and a positive currency impact of 6.3%. Sales by companies in the Western Hemisphere, excluding the U.S., achieved growth of 4.9%, which included operational growth of 7.3% partially offset by a negative currency impact of 2.4%. Sales by companies in the Asia-Pacific, Africa region achieved growth of 4.0%, which included operational growth of 3.4% and a positive currency impact of 0.6%.\nQ3 2025\nSales by Geographic Region (in billions)\nQ3 2025\nSales by Segment (in billions)\nNote: values may have been rounded\n42\n \nTable of Contents\nAnalysis of sales by business segments\nInnovative Medicine\nInnovative Medicine segment sales in the fiscal nine months of 2025 were $44.6 billion, an increase of 4.7% as compared to the same period a year ago, with an operational increase of 4.5% and a positive currency impact of 0.2%. U.S. Innovative Medicine sales increased 6.7% as compared to the same period a year ago. International Innovative Medicine sales increased by 1.9%, including an operational increase of 1.3% and a positive currency impact of 0.6%.  In the fiscal nine months of 2025, the net impact of acquisitions and divestitures on the Innovative Medicine segment operational sales growth was a positive 1.1%, primarily related to CAPLYTA. In the fiscal nine months of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, was an approximate 10.1%, 11.3% and 8.7% on worldwide, U.S. and international Innovative Medicine segment operational sales, respectively.\nMajor Innovative Medicine therapeutic area sales — Fiscal Nine Months Ended\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nOncology\n$18,519\n$15,284\n21.2\n \n%\n20.6\n \n%\n0.6\n \n%\nCARVYKTI\n1,332\n629\n*\n*\n*\nDARZALEX\n10,448\n8,586\n21.7 \n21.3 \n0.4 \nERLEADA\n2,615\n2,215\n18.0 \n17.0 \n1.0 \nIMBRUVICA\n2,139\n2,307\n(7.3)\n(7.9)\n0.6 \nRYBREVANT/ LAZCLUZE\n(1)\n518 \n205 \n*\n*\n*\nTALVEY\n314 \n202 \n55.3 \n54.9 \n0.4 \nTECVAYLI\n494\n403\n22.6 \n22.5 \n0.1 \nZYTIGA/ abiraterone acetate\n383\n496\n(22.8)\n(23.4)\n0.6 \nOther Oncology\n276\n242\n14.0 \n13.6 \n0.4 \nImmunology\n11,868\n13,590\n(12.7)\n(12.6)\n(0.1)\nREMICADE\n1,398\n1,246\n12.2 \n12.7 \n(0.5)\nSIMPONI/ SIMPONI ARIA\n2,036\n1,607\n26.7 \n27.2 \n(0.5)\nSTELARA\n4,848\n8,012\n(39.5)\n(39.5)\n0.0 \nTREMFYA\n3,566\n2,721\n31.0 \n30.8 \n0.2 \nOther Immunology\n21\n3\n*\n*\n— \nNeuroscience\n5,722\n5,340\n7.2\n7.2\n \n0.0\n \nCAPLYTA\n(2)\n451\n—\n*\n*\n— \nCONCERTA/methylphenidate\n452\n482\n(6.3)\n(5.5)\n(0.8)\nINVEGA SUSTENNA/ XEPLION/ INVEGA TRINZA/ TREVICTA\n2,824\n3,159\n(10.6)\n(10.5)\n(0.1)\nSPRAVATO\n1,193\n780\n53.0 \n52.9 \n0.1 \nOther Neuroscience\n803\n920\n(12.7)\n(12.8)\n0.1 \nPulmonary Hypertension\n3,253\n3,190\n2.0\n \n1.8\n \n0.2\n \nOPSUMIT/ OPSYNVI\n1,682\n1,655\n1.7 \n1.4 \n0.3 \nUPTRAVI\n1,411\n1,352\n4.3 \n4.2 \n0.1 \nOther Pulmonary Hypertension\n160\n183\n(12.7)\n(12.9)\n0.2 \nInfectious Diseases\n2,434\n2,622\n(7.2)\n(8.3)\n1.1\n \nEDURANT/rilpivirine\n1,103\n950\n16.1 \n13.0 \n3.1 \nPREZISTA/ PREZCOBIX/ REZOLSTA/ SYMTUZA\n1,196\n1,305\n(8.3)\n(8.4)\n0.1 \nOther Infectious Diseases\n(3)\n135\n367\n(63.3)\n(63.2)\n(0.1)\nCardiovascular / Metabolism / Other\n2,842\n2,605\n9.1\n \n9.2\n \n(0.1)\nXARELTO\n1,946\n1,697\n14.7 \n14.7 \n— \nOther\n896\n908\n(1.3)\n(1.0)\n(0.3)\nTotal Innovative Medicine Sales\n$44,638\n$42,632\n4.7\n%\n4.5\n%\n0.2\n \n%\nForm 10-Q\n43\nTable of Contents\n*percentage greater than 100% or not meaningful\n(1)      \n Includes the sales of RYBREVANT and RYBREVANT + LAZCLUZE\n(2)     \n Acquired with Intra-Cellular Therapies on April 2, 2025\n(3)     \n Includes the Covid-19 Vaccine in 2024\nInnovative Medicine segment sales in the fiscal third quarter of 2025 were $15.6 billion, an increase of 6.8% as compared to the same period a year ago, including an operational increase of 5.3% and a positive currency impact of 1.5%. U.S. Innovative Medicine sales increased 6.0% as compared to the same period a year ago. International Innovative Medicine sales increased by 7.9%, including an operational increase of 4.3% and a positive currency impact of 3.6%. In the fiscal third quarter of 2025, the net impact of acquisitions and divestitures on the worldwide Innovative Medicine segment operational sales growth was a positive 1.6%, related to CAPLYTA. In the fiscal third quarter of 2025, the negative impact of the STELARA sales decline, due to biosimilar competition, was an approximate 10.7%, 12.0% and 8.6% on worldwide, U.S. and international Innovative Medicine segment operational sales, respectively.\nMajor Innovative Medicine therapeutic area sales — Fiscal Third Quarter Ended\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nOncology\n$6,529\n$5,380\n21.3\n \n%\n19.2\n \n%\n2.1\n \n%\nCARVYKTI\n524\n286\n83.5 \n81.4 \n2.1 \nDARZALEX\n3,672\n3,016\n21.7 \n19.9 \n1.8 \nERLEADA\n936\n790\n18.4 \n15.3 \n3.1 \nIMBRUVICA\n695\n753\n(7.8)\n(10.6)\n2.8 \nRYBREVANT/ LAZCLUZE\n(1)\n198\n89\n*\n*\n*\nTALVEY\n122\n75\n60.8 \n59.1 \n1.7 \nTECVAYLI\n177\n135\n31.3 \n29.9 \n1.4 \nZYTIGA/ abiraterone acetate\n113\n150\n(25.1)\n(26.8)\n1.7 \nOther Oncology\n94\n86\n9.7\n7.7\n2.0\nImmunology\n4,168\n4,621\n(9.8)\n(10.6)\n0.8\n \nREMICADE\n476\n419\n13.6 \n13.3 \n0.3 \nSIMPONI/ SIMPONI ARIA\n687\n516\n32.9 \n31.5 \n1.4 \nSTELARA\n1,570\n2,676\n(41.3)\n(42.0)\n0.7 \nTREMFYA\n1,424\n1,007\n41.3 \n40.1 \n1.2 \nOther Immunology\n12\n1\n*\n*\n—\nNeuroscience\n2,024\n1,755\n15.3\n \n14.6\n \n0.7\n \nCAPLYTA\n(2)\n240\n—\n*\n*\n— \nCONCERTA/ methylphenidate\n140\n142\n(1.4)\n(1.8)\n0.4 \nINVEGA SUSTENNA/ XEPLION/ INVEGA TRINZA/\n \nTREVICTA\n929\n1,049\n(11.3)\n(11.9)\n0.6 \nSPRAVATO\n459\n284\n61.5 \n60.8 \n0.7 \nOther Neuroscience\n256\n281\n(8.9)\n(10.2)\n1.3 \nPulmonary Hypertension\n1,115\n1,102\n1.1\n \n0.4\n \n0.7\n \nOPSUMIT/ OPSYNVI\n578\n583\n(0.8)\n(1.7)\n0.9 \nUPTRAVI\n484\n458\n5.6 \n5.0 \n0.6 \nOther Pulmonary Hypertension\n53\n60\n(13.1)\n(14.1)\n1.0 \nInfectious Diseases\n829\n836\n(0.9)\n(4.3)\n3.4\n \nEDURANT/rilpivirine\n385\n330\n16.4 \n9.5 \n6.9 \nPREZISTA/ PREZCOBIX/ REZOLSTA/\n \nSYMTUZA\n397\n449\n(11.6)\n(12.6)\n1.0 \nOther Infectious Diseases\n47\n56\n(17.5)\n(18.5)\n1.0 \nCardiovascular / Metabolism / Other\n899\n884\n1.7\n \n1.2\n \n0.5\n \nXARELTO\n635\n592\n7.4 \n7.4 \n— \nOther\n264\n292\n(9.8)\n(11.3)\n1.5 \nTotal Innovative Medicine Sales\n$15,563\n$14,580\n6.8\n%\n5.3\n%\n1.5\n \n%\n44\n \nTable of Contents\n*percentage greater than 100% or not meaningful\n(1)       \n Includes the sales of RYBREVANT and RYBREVANT + LAZCLUZE\n(2)     \n Acquired with Intra-Cellular Therapies on April 2, 2025\nOncology products achieved operational sales growth of 19.2% as compared to the same period a year ago. Strong sales of DARZALEX (daratumumab) were driven by continued share gains and market growth. Growth of ERLEADA (apalutamide) was due to market growth and continued share gains partially offset by the impact of Medicare Part D redesign. Increased sales of CARVYKTI (ciltacabtagene autoleucel) were driven by continued share gains and site expansion. Additionally, sales from the ongoing launches and share gains of TECVAYLI (teclistamab-cqyv), TALVEY (talquetamab-tgvs) and RYBREVANT (amivantamab)/LAZCLUZE (lazertinib) contributed to the growth. Growth was partially offset by ZYTIGA (abiraterone acetate) due to loss of exclusivity and IMBRUVICA (ibrutinib) declines due to competitive pressures and the impact of Medicare Part D redesign.\nImmunology products experienced an operational decline of 10.6% as compared to the same period a year ago primarily due to the decline of STELARA (ustekinumab) sales driven by the impact of biosimilar competition and Medicare Part D redesign. The growth of TREMFYA (guselkumab) was due to share gains and market growth partially offset by unfavorable patient mix and the impact of Medicare Part D redesign. The increase in SIMPONI/SIMPONI ARIA sales was primarily driven by the Merck, Sharp & Dohme return of rights in Europe in the fiscal fourth quarter of 2024. The increase in REMICADE (infliximab) sales was due to a one-time favorable patient mix adjustment and the Merck, Sharp & Dohme return of rights in Europe in the fiscal fourth quarter of 2024.\nSales of STELARA in the United States were approximately $6.7 billion in fiscal 2024. Third parties have filed abbreviated Biologics License Applications with the FDA seeking approval to market biosimilar versions of STELARA. The Company has settled certain litigation under the Biosimilar Price Competition and Innovation Act of 2009. According to patent settlement and license agreements, the Company expects continued launches of biosimilar versions of STELARA in Europe and the United States which will impact the Company’s sales of STELARA.\nNeuroscience products, which include sales of CAPLYTA (lumateperone) acquired with the Intra-Cellular Therapies (Intra-Cellular) acquisition on April 2, 2025, achieved operational growth of 14.6% as compared to the same period a year ago. Growth of SPRAVATO (esketamine) was driven by continued increased physician and patient demand. Growth was partially offset by the sales decline of INVEGA SUSTENNA / XEPLION / INVEGA TRINZA / TREVICTA primarily due to the impact of Medicare Part D redesign. \nPulmonary Hypertension products achieved operational sales growth of 0.4% as compared to the same period a year ago. The sales growth of UPTRAVI (selexipag) was driven by market growth and inventory dynamics partially offset by the impact of Medicare Part D redesign. The sales decline of OPSUMIT (macitentan)/ OPSYNVI (macitentan/tadalafil) was driven by the impact of Part D redesign and unfavorable patient mix, partially offset by share gains and market growth.\nInfectious disease products experienced an operational sales decline of 4.3% as compared to the same period a year ago primarily driven by declines across the portfolio partially offset by growth of EDURANT/rilpivirine.\nCardiovascular / Metabolism / Other products achieved operational growth of 1.2% as compared to the same period a year ago. The growth of XARELTO (rivaroxaban) sales was primarily driven by the impact of Medicare Part D redesign partially offset by continued share loss.\nThe Inflation Reduction Act (IRA) contains provisions that redesign the Medicare Part D benefit in various ways, including by shifting a greater portion of costs to manufacturers within certain coverage phases and replacing the Part D coverage gap discount program with a new manufacturer discounting program.\nThe Company maintains a policy that no end customer will be permitted direct delivery of product to a location other than the billing location. This policy impacts contract pharmacy transactions involving non-grantee 340B covered entities for most of the Company’s drugs, subject to multiple exceptions. Both grantee and non-grantee covered entities can maintain certain contract pharmacy arrangements under policy exceptions. The Company has been and will continue to offer 340B discounts to covered entities on all of its covered outpatient drugs, and it believes its policy will improve its ability to identify inappropriate duplicate discounts and diversion prohibited by the 340B statute. The 340B Drug Pricing Program is a U.S. federal government program requiring drug manufacturers to provide significant discounts on covered outpatient drugs to covered entities. \nForm 10-Q\n45\nTable of Contents\nMedTech\nThe MedTech segment sales in the fiscal nine months of 2025 were $25.0 billion, an increase of 5.6% as compared to the same period a year ago, with an operational increase of 5.3% and a positive currency impact of 0.3%. U.S. MedTech sales increased by 6.6%. International MedTech sales increased by 4.5%, including an operational increase of 3.9% and a positive currency impact of 0.6%. In the fiscal nine months of 2025, the net impact of acquisitions and divestitures on the MedTech segment operational sales growth was a positive 1.6%, primarily related to the Shockwave acquisition. \nMajor MedTech franchise sales — Fiscal Nine Months Ended\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nSurgery\n$7,493\n$7,338\n2.1\n%\n2.1\n%\n0.0\n \n%\nAdvanced\n3,402\n3,337\n1.9 \n1.8 \n0.1 \nGeneral\n4,092\n4,001\n2.3 \n2.3 \n0.0 \nOrthopaedics\n6,820\n6,843\n(0.3)\n(0.8)\n0.5\n \nHips\n1,235\n1,220\n1.3 \n0.9 \n0.4 \nKnees\n1,155\n1,147\n0.7 \n0.3 \n0.4 \nTrauma\n2,333\n2,285\n2.1 \n1.6 \n0.5 \nSpine, Sports & Other\n2,096\n2,191\n(4.3)\n(5.0)\n0.7 \nCardiovascular\n6,629\n5,645\n17.4\n \n17.1\n \n0.3\n \nElectrophysiology\n4,209\n3,946\n6.7 \n6.4 \n0.3 \nAbiomed\n1,291\n1,112\n16.1 \n15.5 \n0.6 \nShockwave \n(1)\n828\n306\n*\n*\n*\nOther Cardiovascular\n302\n281\n7.5 \n7.2 \n0.3 \nVision\n4,048\n3,843\n5.3\n \n4.8\n \n0.5\n \nContact Lenses/Other\n2,902\n2,796\n3.8 \n3.1 \n0.7 \nSurgical\n1,147\n1,048\n9.4 \n9.6 \n(0.2)\nTotal MedTech Sales\n$24,991\n$23,669\n5.6\n%\n5.3\n%\n0.3\n \n%\n*Percentage greater than 100% or not meaningful\n(1)\n Acquired on May 31, 2024\n46\n \nTable of Contents\nMedTech segment sales in the fiscal third quarter of 2025 were $8.4 billion, an increase of 6.8% as compared to the same period a year ago, which included operational growth of 5.6% and a positive currency impact of 1.2%. U.S. MedTech sales increased by 6.6%. International MedTech sales increased by 7.0%, including operational growth of 4.5% and a positive currency impact of 2.5%. In the fiscal third quarter of 2025, the net impact of acquisitions and divestitures on the MedTech segment operational sales growth was a negative 0.1%.\nMajor MedTech franchise sales — Fiscal Third Quarter Ended\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nSurgery\n$2,542\n$2,434\n4.4\n \n%\n3.3\n%\n1.1\n \n%\nAdvanced\n1,165\n1,109\n5.0 \n3.8 \n1.2 \nGeneral\n1,378\n1,325\n3.9 \n2.9 \n1.0 \nOrthopaedics\n2,274\n2,191\n3.8\n \n2.4\n \n1.4\n \nHips\n405\n381\n6.4 \n5.1 \n1.3 \nKnees\n377\n352\n7.0 \n5.6 \n1.4 \nTrauma\n793\n761\n4.2 \n2.9 \n1.3 \nSpine, Sports & Other\n698\n696\n0.3 \n(1.3)\n1.6 \nCardiovascular\n2,213\n1,966\n12.6\n \n11.6\n \n1.0\n \nElectrophysiology\n1,418\n1,279\n10.8 \n9.7 \n1.1 \nAbiomed\n423\n362\n16.8 \n15.6 \n1.2 \nShockwave\n278\n229\n21.2\n20.9\n0.3 \nOther Cardiovascular\n95\n96\n(0.7)\n(1.7)\n1.0 \nVision\n1,400\n1,300\n7.7\n \n6.1\n \n1.6\n \nContact Lenses/Other\n1,018\n968\n5.2 \n3.5 \n1.7 \nSurgical\n383\n333\n14.9 \n13.8 \n1.1 \nTotal MedTech Sales\n$8,430\n$7,891\n6.8\n%\n5.6\n%\n1.2\n \n%\nThe Surgery franchise achieved operational sales growth of 3.3% as compared to the prior year fiscal third quarter. The operational growth in Advanced Surgery was primarily due to the strength of the portfolio and commercial execution in Biosurgery and Endocutters. The growth was partially offset by competitive pressures in Energy and Endocutters and by the negative impact of China volume-based procurement. The operational growth in General Surgery was primarily driven by technology penetration and upgrades within the differentiated Wound Closure portfolio coupled with commercial execution, partially offset by softness in aesthetics outside the U.S. \nThe Orthopaedics franchise achieved operational sales growth of 2.4% as compared to the prior year fiscal third quarter. The operational growth in Hips was due to new product launches. The operational growth in Knees was driven by the strength of the ATTUNE portfolio and pull through related to the VELYS Robotic assisted solutions partially offset by trade inventory dynamics and the negative impact of China volume-based procurement. The operational growth in Trauma was primarily driven by recently launched products partially offset by trade inventory dynamics and the negative impact of China volume-based procurement. The operational sales decline in Spine, Sports & Other reflects competitive pressures and price pressures in the U.S. Early Interventional segment partially offset by U.S. spine new product innovations (TriAltis). All platforms were negatively impacted by revenue disruption from the previously announced Orthopaedics restructuring. \nSubsequent to the quarter, on October 14, 2025, the Company announced its intention to separate its Orthopaedics business.  The Company intends to explore multiple paths to effect the planned separation with a targeted completion within 18 to 24 months after the initial announcement.\nThe Cardiovascular franchise achieved operational sales growth of 11.6% as compared to the prior year fiscal third quarter. Abiomed sales growth was driven by the continued strong adoption of Impella 5.5 and Impella CP. Shockwave sales growth was driven by Coronary and Peripheral portfolios. Electrophysiology sales growth was driven by procedure growth, commercial execution, new product performance (VARIPULSE, TRUPULSE), strength in competitive mapping, and one-time impacts of installation and inventory, partially offset by competitive pressures in Pulsed Field Ablation catheters. \nForm 10-Q\n47\nTable of Contents\nThe Vision franchise achieved operational sales growth of 6.1% as compared to the prior year fiscal third quarter. The Contact Lenses/Other operational growth was driven by market growth, continued strong performance in the ACUVUE OASYS 1-Day family of products and continued strategic price actions. The Surgical operational growth was primarily driven by the continued strength of recent product innovations, robust demand and commercial execution.\nAnalysis of consolidated earnings before provision for taxes on income\nConsolidated earnings before provision for taxes on income for the fiscal nine months of 2025 was $27.6 billion representing 39.7% of sales as compared to $12.8 billion in the fiscal nine months of 2024, representing 19.3% of sales. The fiscal nine months of 2025 includes the reversal of approximately $7.0 billion, a significant portion of the previously accrued talc reserve. The fiscal nine months of 2024 includes charges for talc matters of approximately $5.1 billion.\nConsolidated earnings before provision for taxes on income for the fiscal third quarter of 2025 was $7.5 billion representing 31.2% of sales as compared to $3.3 billion in the fiscal third quarter of 2024, representing 14.9% of sales. The fiscal third quarter of 2024 includes charges for talc matters of approximately $2.0 billion. \nCost of products sold\n(Dollars in billions. Percentages in chart are as a percent to total sales)\nFiscal nine months Q3 2025 versus Fiscal nine months Q3 2024\nCost of products sold increased as a percent to sales driven by:\n•\nUnfavorable product mix driven by the decline of STELARA sales in the Innovative Medicine business\n•\nMacroeconomic factors in the MedTech business\n     partially offset by \n•\nNon-recurring, acquisition related fair value Inventory step-up of $0.2 billion associated with the Shockwave acquisition in the MedTech business in 2024.\nThe intangible asset amortization expense included in cost of products sold for the fiscal nine months of 2025 and 2024 was $3.4 billion in both periods.\nQ3 2025 versus Q3 2024\nCost of products sold decreased as a percent to sales primarily driven by:\n•\n Lower intangible asset amortization expense and favorable currency in the Innovative Medicine business\n•\nNon-recurring, acquisition related fair value Inventory step-up of $0.2 billion associated with the Shockwave acquisition in the MedTech business in 2024.\npartially offset by\n•\nUnfavorable product mix driven by the decline of STELARA sales in the Innovative Medicine business\n•\nMacroeconomic factors in the MedTech business\n48\n \nTable of Contents\nThe intangible asset amortization expense included in cost of products sold for the fiscal third quarters of 2025 and 2024 was $1.0 billion and $1.2 billion, respectively.\nSelling, marketing and administrative expenses \n \n(Dollars in billions. Percentages in chart are as a percent to total sales)\nFiscal nine months Q3 2025 versus Fiscal nine months Q3 2024\nSelling, Marketing and Administrative Expenses decreased as a percent to sales driven by:\n•\nCorporate administrative expense rationalization\n•\nPlanned leverage and phasing of investments in the Innovative Medicine business\npartially offset by \n•\nIncreased investment related to the acquisitions of Intra-Cellular (CAPLYTA) and Shockwave\nQ3 2025 versus Q3 2024\nSelling, Marketing and Administrative Expenses increased as a percent to sales primarily driven by:\n•\nIncreased investment related to the recent acquisition of Intra-Cellular (CAPLYTA) and commercial investment in recent product launches in the Innovative Medicine business\npartially offset by \n•\nExpense leveraging in the Medtech business\nResearch and development expense\nResearch and development expense by segment of business was as follows:\nFiscal Third Quarter Ended\nFiscal Nine Months Ended\n \n2025\n2024\n2025\n2024\n(Dollars in Millions)\nAmount\n% of Sales*\nAmount\n% of Sales*\nAmount\n% of Sales*\nAmount\n% of Sales*\nInnovative Medicine\n$2,944\n18.9\n%\n$4,213 \n28.9\n%\n$8,361\n18.7\n%\n$9,831\n23.1\n%\nMedTech\n728\n8.6 \n739 \n9.4 \n2,052\n8.2 \n2,103\n8.9 \nTotal research and development expense\n$3,672\n15.3\n%\n$4,952\n \n22.0\n%\n$10,413\n15.0\n%\n$11,934\n \n18.0\n%\nPercent increase/(decrease) over the prior year\n(25.8\n%)\n \n \n(12.7\n%)\n*As a percent to segment sales \nForm 10-Q\n49\nTable of Contents\nFiscal nine months Q3 2025 versus Fiscal nine months Q3 2024\nResearch and Development decreased as a percent to sales primarily driven by:\n•\nExpense of $1.25 billion to secure the global rights to the NM26 bispecific antibody (Yellow Jersey acquisition) in 2024\n•\nPlanned leverage and phasing of investments in the Innovative Medicine business\nQ3 2025 versus Q3 2024\nResearch and Development decreased as a percent to sales primarily driven by:\n•\nExpense of $1.25 billion to secure the global rights to the NM26 bispecific antibody (Yellow Jersey acquisition) in 2024\n•\nPhasing of investments in the Innovative Medicine business\nIn-process research and development (IPR&D) impairments\nIn the fiscal nine months of 2024, the Company recorded a charge of approximately $0.2 billion associated with the M710 (biosimilar) asset acquired with Momenta in 2020. There was also a partial impairment of this asset for $0.2 billion in the fiscal third quarter of 2023. This asset is now fully impaired.\nInterest (income) expense\nInterest (income) expense in the fiscal nine months of 2025 was net income of $62 million as compared to net income of $433 million in the fiscal nine months of 2024. Interest income in the fiscal nine months of 2025 decreased as compared to the prior year driven by lower interest rates earned on cash balances. Interest expense was higher due to a higher average debt balance at higher interest rates. Interest (income) expense in the fiscal third quarter of 2025 was net expense of $18 million as compared to net income of $99 million in the fiscal third quarter of 2024. Interest income in the fiscal third quarter of 2025 decreased as compared to the prior year driven by a lower average cash balance. Interest expense was higher due to a higher average debt balance. The balance of cash, cash equivalents and current marketable securities was $18.6 billion at the end of the fiscal third quarter of 2025 as compared to $20.3 billion at the end of the fiscal third quarter of 2024. The Company’s debt position was $45.8 billion as of September 28, 2025, as compared to $35.8 billion the same period a year ago.\nOther (income) expense, net*\nFiscal nine months Q3 2025 versus Fiscal nine months Q3 2024\nOther (income) expense, net for the fiscal nine months of 2025 reflected an increase in income of $12.6 billion as compared to the prior year primarily due to the following:\nFiscal Nine Months\n(Dollars in Billions)(Income)/Expense\nSeptember 28, 2025\nSeptember 29, 2024\nChange\nLitigation related\n(1)\n$\n(6.9)\n5.5 \n(12.4)\nEmployee benefit plan related\n(0.4)\n(0.7)\n0.3 \nChanges in the fair value/sale of securities\n(2)\n(0.3)\n0.4 \n(0.7)\nMonetization of royalty rights\n0.0 \n(0.3)\n0.3 \nAcquisition, Integration and Divestiture related\n0.4 \n0.7 \n(0.3)\nOther\n(0.5)\n(0.7)\n0.2 \nTotal Other (Income) Expense, Net\n$\n(7.7)\n4.9 \n(12.6)\n(1)\nThe fiscal nine months of 2025 includes the reversal of approximately $7.0 billion, a significant portion of the previously accrued talc reserve. The fiscal nine months of 2024 includes charges of approximately $5.1 billion for talc matters. For additional details related to talc refer to Note 11 to the Consolidated Financial Statements.\n(2)\nThe fiscal nine months of 2024 includes the loss on the completion of the debt for equity exchange of the retained stake in Kenvue\n50\n \nTable of Contents\nQ3 2025 versus Q3 2024\nOther (income) expense, net for the fiscal third quarter of 2025 reflected an increase in income of $2.3 billion as compared to the prior year primarily due to the following:\nFiscal Third Quarter\n(Dollars in Billions)(Income)/Expense\nSeptember 28, 2025\nSeptember 29, 2024\nChange\nAcquisition, Integration and Divestiture related\n$\n0.1 \n0.1 \n0.0 \nLitigation related\n(1)\n0.0 \n2.4 \n(2.4)\nMonetization of royalty rights\n0.0 \n(0.3)\n0.3 \nEmployee benefit plan related\n(0.1)\n(0.2)\n0.1 \nChanges in the fair value/sale of securities\n(0.4)\n0.0 \n(0.4)\nOther\n(0.1)\n(0.2)\n0.1\nTotal Other (Income) Expense, Net\n$\n(0.5)\n1.8\n(2.3)\n(1)\nThe fiscal third quarter of 2024 includes charges for talc matters of approximately $2.0 billion.  \n*Other (income) expense, net is the account where the Company records gains and losses related to the sale and write-down of certain investments in equity securities held by Johnson & Johnson Innovation - JJDC, Inc. (JJDC), changes in the fair value of securities, gains and losses on divestitures, gains and losses on sale of assets, certain transactional currency gains and losses, acquisition-related costs, litigation accruals and settlements, investment (income)/loss related to employee benefit plans, as well as royalty income.\nSegment income before tax\nIncome before tax by segment of business for the fiscal nine months were as follows:\nIncome Before Tax\nSegment Sales\nPercent of Segment Sales\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nSeptember 28, 2025\nSeptember 29, 2024\nSeptember 28, 2025\nSeptember 29, 2024\nInnovative Medicine\n$17,208\n$14,910\n$44,638\n$42,632\n38.6\n%\n35.0\n%\nMedTech\n3,912\n3,668\n24,991\n23,669\n15.7 \n15.5 \nSegment total\n21,120\n18,578\n69,629\n66,301\n30.3 \n28.0 \n(Income) Expenses not allocated to segments\n(1)\n(6,495)\n5,778\n \n \nEarnings before provision for taxes on income\n$27,615\n$12,800\n$69,629\n$66,301\n39.7\n%\n19.3\n%\n(1)\nAmounts not allocated to segments include interest (income) expense, certain litigation expenses and general corporate (income) expense. The fiscal nine months of 2025 includes the reversal of approximately $7.0 billion, a significant portion of the previously accrued talc reserve. The fiscal nine months of 2024 includes charges for talc matters of $5.1 billion. The fiscal nine months of 2024 includes a loss of approximately $0.4 billion related to the debt to equity exchange of the Company's remaining shares of Kenvue Common Stock. \nInnovative Medicine segment\nThe Innovative Medicine segment income before tax as a percent of sales in the fiscal nine months of 2025 was 38.6% versus 35.0% for the same period a year ago. The increase in the income before tax as a percent of sales for the fiscal nine months of 2025 as compared to the prior year was primarily driven by the following:\n•\nExpense of $1.25 billion to secure the global rights to the NM26 bispecific antibody (Yellow Jersey acquisition) in 2024\n•\nLitigation expense of $0.4 billion in 2024 primarily related to Risperdal Gynecomastia.\n•\nHigher favorable change in the fair value of securities of $0.1 billion in 2025 \n•\nLower amortization expense of $0.1 billion in 2025\n•\nAn In-process research and development impairment of $0.2 billion in 2024 related to the M710 (biosimilar) asset acquired with Momenta in 2020\n•\nRestructuring charge of $0.1 billion in 2024\nForm 10-Q\n51\nTable of Contents\npartially offset by \n•\nMonetization of royalty rights of $0.3 billion in 2024\n•\nUnfavorable Product mix and the impact of Medicare Part D redesign\n•\nIncreased investment related to the acquisition of Intra-Cellular (CAPLYTA)\nMedTech segment\nThe MedTech segment income before tax as a percent of sales in the fiscal nine months of 2025 was 15.7% versus 15.5% for the same period a year ago. The increase in the income before tax as a percent of sales for the fiscal nine months of 2025 was primarily driven by the following:\n•\nLower acquisition and integration related costs of $0.2 billion in 2025 versus $0.9 billion in 2024 primarily related to the Shockwave acquisition \n•\nGain on the sale of securities of $0.2 billion in 2025\npartially offset by\n•\nHigher restructuring related costs of $0.3 billion in 2025 versus $0.1 billion in 2024 \n•\nA gain of $0.2 billion related to the Acclarent divestiture in 2024\n•\nMacroeconomic factors in Cost of products sold\nIncome before tax by segment of business for the fiscal third quarters were as follows:\nIncome Before Tax\nSegment Sales\nPercent of Segment Sales\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nSeptember 28, 2025\nSeptember 29, 2024\nSeptember 28, 2025\nSeptember 29, 2024\nInnovative Medicine\n$6,446\n$4,482\n$15,563\n$14,580\n41.4\n%\n30.7\n%\nMedTech\n1,287\n1,059\n8,430\n7,891\n15.3 \n13.4 \nSegment total\n7,733\n5,541\n23,993\n22,471\n32.2 \n24.7 \n(Income) Expenses not allocated to segments\n(1)\n240\n2,203\n \n \nEarnings before provision for taxes on income\n$7,493\n$3,338\n$23,993\n$22,471\n31.2\n%\n14.9\n%\n(1)\nAmounts not allocated to segments include interest (income) expense, certain litigation expenses and general corporate (income) expense. The fiscal third quarter of 2024 includes charges for talc matters of $2.0 billion. For additional details related to talc refer to Note 11 to the Consolidated Financial Statements. \nInnovative Medicine segment\nThe Innovative Medicine segment income before tax as a percent of sales in the fiscal third quarter of 2025 was 41.4% versus 30.7% for the same period a year ago. The increase in the income before tax as a percent of sales for the fiscal third quarter of 2025 as compared to the prior year was primarily driven by the following:\n•\nExpense of $1.25 billion to secure the global rights to the NM26 bispecific antibody (Yellow Jersey acquisition) in 2024\n•\nLitigation expense of $0.4 billion in 2024 primarily related to Risperdal Gynecomastia\n•\nHigher favorable change in the fair value of securities of $0.1 billion in 2025\npartially offset by \n•\nMonetization of royalty rights of $0.3 billion in 2024\n•\nUnfavorable Product mix and the impact of Medicare Part D redesign\n•\nIncreased investment related to the acquisition of Intra-Cellular (CAPLYTA)\n52\n \nTable of Contents\nMedTech segment\nThe MedTech segment income before tax as a percent of sales in the fiscal third quarter of 2025 was 15.3% versus 13.4% for the same period a year ago. The increase in the income before tax as a percent of sales for the fiscal third quarter of 2025 as compared to the prior year was primarily driven by the following:\n•\nHigher acquisition and integration related costs of $0.2 billion in 2024 primarily related to the Shockwave acquisition\n•\nGain on the sale of securities of $0.2 billion in 2025 \n•\nLeveraging in Selling, Marketing and Administrative expenses\npartially offset by\n•\nMacroeconomic factors in Cost of products sold\n•\nHigher restructuring related costs of $0.1 billion in 2025\nRestructuring\nIn fiscal 2025, the company initiated a restructuring program of its Surgery franchise within the MedTech segment to simplify and focus operations by exiting certain non-strategic product lines and optimize select sites across the network. The pre-tax restructuring expense was $128 million in the fiscal third quarter of 2025, of which $35 million was recorded in Restructuring and $93 million in Other income and expense on the Consolidated Statement of Earnings. The pre-tax restructuring expense was $157 million in the fiscal nine months of 2025, of which $64 million was recorded in Restructuring and $93 million in Other income and expense on the Consolidated Statement of Earnings. The pre-tax restructuring expense in the\n \nfiscal third quarter and fiscal nine months of 2025 primarily included costs related to asset impairments as well as market and product exits. The estimated costs of the total program are between $0.9 billion - $1.0 billion and is expected to be substantially completed by the end of fiscal year 2026.\nIn fiscal 2023, the Company initiated a restructuring program of its Orthopaedics franchise within its MedTech segment to streamline operations by exiting certain markets, product lines and distribution network arrangements. The pre-tax restructuring expense was $40 million in the fiscal third quarter of 2025, of which $28 million was recorded in Restructuring and $12 million in Cost of products sold on the Consolidated Statement of Earnings primarily for costs related to market and product exits. The pre-tax restructuring expense was $145 million in the fiscal nine months of 2025, of which $80 million was recorded in Restructuring, $35 million in Cost of products sold and $30 million in Other (Income)/Expense on the Consolidated Statement of Earnings primarily for costs related to asset impairments as well as market and product exits. The pre-tax restructuring expense was immaterial in the fiscal third quarter of 2024 and $107 million in the fiscal nine months of 2024, and primarily included costs related to market and product exits. Total project costs of approximately $0.6 billion have been recorded since the restructuring was announced. The estimated costs of the total program are between $0.7 billion - $0.8 billion and will be substantially completed by the end of fiscal year 2025. \nIn fiscal 2023, the Company completed a prioritization of its research and development (R&D) investment within the Innovative Medicine segment to focus on the most promising medicines with the greatest benefit to patients. The pre-tax restructuring charge of $100 million in the fiscal nine months of 2024 included the termination of partnered and non-partnered program costs and asset impairments. The program was completed in the fiscal fourth quarter of 2024.\nFor further details related to the restructuring refer to Note 12 to the Consolidated Financial Statements. \nProvision for taxes on income\nThe worldwide effective income tax rate for the fiscal nine months was 21.5% in 2025 and 16.9% in 2024.\nOn December 15, 2022, the European Union (EU) Member States formally adopted the EU’s Pillar Two Directive, which generally provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Co-operation and Development (OECD) Pillar Two Framework that was supported by over 130 countries worldwide. Several EU and non-EU countries have enacted Pillar Two legislation with an initial effective date of January 1, 2024, with other aspects of the law effective in 2025 or later. While countries continue to enact new provisions or issue new regulations this could have an impact to the Company’s effective tax rate. The Company will continue to monitor further developments to determine any potential impact in the countries in which we operate, such as the recently announced understanding between the U.S. and the G7 of a side-by-side system that would fully exclude U.S. parented groups from certain provisions of the Pillar Two Framework.  \nFor further details related to the fiscal 2025 provision for taxes refer to Note 5 to the Consolidated Financial Statements. \nForm 10-Q\n53\nTable of Contents\nLiquidity and capital resources\nAcquisitions\n(net of cash acquired)\nProceeds from the disposal of assets/businesses, net\nDividends to shareholders\nCash flows\nCash and cash equivalents were $18.2 billion at the end of the fiscal third quarter of 2025 as compared with $24.1 billion at the end of fiscal year 2024. The primary sources and uses of cash that contributed to the $5.9 billion decrease were:\n(Dollars In Billions)\n24.1 \nQ4 2024 Cash and cash equivalents balance\n17.2 \nnet cash generated from operating activities\n(19.1)\nnet cash used for investing activities\n(4.2)\nnet cash used for financing activities\n0.2 \neffect of exchange rate changes on cash and cash equivalents\n$\n18.2 \nQ3 2025 Cash and cash equivalents\nIn addition, the Company had $0.3 billion in marketable securities at the end of the fiscal third quarter of 2025 and $0.4 billion at the end of fiscal year 2024.\nCash flow from operations of $17.2 billion was the result of:\n(Dollars In Billions)\n$\n21.7 \nNet earnings\n11.8 \nnon-cash expenses and other adjustments primarily for depreciation and amortization, stock-based compensation, deferred tax provision, charge for acquired in-process research and development assets and asset write-downs partially offset by the net gain on sale of assets/businesses\n(3.6)\nan increase in accounts receivable and inventories \n1.1 \nan increase in accounts payable and accrued liabilities \n(7.7)\nan increase in other current and non-current assets\n(6.2)\na decrease in other current and non-current liabilities\n0.1 \nrounding\n$\n17.2 \nNet cash flows from operations\n54\n \nTable of Contents\nCash flow used for investing activities of $19.1 billion was primarily from:\n(Dollars In Billions)\n$\n(3.0)\nadditions to property, plant and equipment\n0.4 \nproceeds from the disposal of assets/businesses, net\n(14.5)\nacquisitions, net of cash acquired\n(0.4)\nacquired in-process research and development assets/related milestones\n0.8 \nnet sales of investments\n(2.3)\ncredit support agreements activity, net\n(0.1)\nOther and rounding\n$\n(19.1)\nNet cash used for investing activities\nCash flow used for financing activities of $4.2 billion was primarily from: \n(Dollars In Billions)\n$\n(9.3)\ndividends to shareholders \n(4.0)\nrepurchase of common stock\n7.5 \nnet proceeds from short and long term debt\n1.8 \nproceeds from stock options exercised/employee withholding tax on stock awards, net\n(0.2)\ncredit support agreements activity, net\n$\n(4.2)\nNet cash used for financing activities\nThe following table summarizes income taxes paid net of tax refunds: \n(Dollars in Millions)\nSeptember 28, 2025\nDecember 29, 2024\nTotal U.S. \n(1)\n$\n3,740 \n4,156 \nTotal Foreign\n2,024 \n2,558 \nTotal income taxes paid net of tax refunds\n$\n5,764\n \n6,714\n \n(1)\nRepresents Federal and State taxes and includes TCJA foreign undistributed earnings payments of $2.5 billion in 2025 and $2.0 billion in 2024\nThe Company has access to substantial sources of funds at numerous banks worldwide and has the ability to issue up to $20 billion in Commercial Paper. Furthermore, in June 2025, the Company secured a new 364-day Credit Facility of $10 billion (expiration on June 24, 2026) which may be used for general corporate purposes including to support our commercial paper borrowings. Interest charged on borrowings under the credit line agreement is based on either Secured Overnight Financing Rate (SOFR) Reference Rate or other applicable market rate as allowed plus applicable margins. Commitment fees under the agreement are not material.  \nAs of September 28, 2025, the Company had cash, cash equivalents and marketable securities of approximately $18.6 billion and had approximately $45.8 billion of notes payable and long-term debt for a net debt position of $27.2 billion as compared to the prior year fiscal third quarter net debt position of $15.5 billion. In the fiscal first quarter of 2025, the Company issued senior unsecured notes for approximately $9.2 billion. The net proceeds from this offering were used to fund the Intra-Cellular Therapies, Inc. acquisition for approximately $14.5 billion which closed on April 2, 2025, and for general corporate purposes. For additional details on borrowings, see Note 4 to the Consolidated Financial Statements. The Company anticipates that operating cash flows, the ability to raise funds from external sources, borrowing capacity from existing committed credit facilities and access to the commercial paper markets will continue to provide sufficient resources to fund operating needs, including the Company’s remaining balance of approximately $3.8 billion related to talc matters, $2.0 billion related to the current portion of Corporate bonds due and the remaining approximately $1.1 billion to settle opioid litigation (See Note 11 to the Consolidated Financial Statements for additional details). In addition, the Company monitors the global capital markets on an ongoing basis and from time to time may raise capital when market conditions are favorable.\nForm 10-Q\n55\nTable of Contents\nDividends\nOn July 16, 2025, the Board of Directors declared a regular cash dividend of $1.30 per share, payable on September 9, 2025, to shareholders of record as of August 26, 2025. \nOn October 14, 2025, the Board of Directors declared a regular cash dividend of $1.30 per share, payable on December 9, 2025, to shareholders of record as of November 25, 2025. The Company expects to continue the practice of paying regular quarterly cash dividends.\nOther information\nNew accounting pronouncements\nRefer to Note 1 to the Consolidated Financial Statements for new accounting pronouncements.\nEconomic and market factors\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In September 2025, a majority of the Third Circuit panel denied Janssen’s appeal of the district court’s decision.\nThe Company operates in certain countries where the economic conditions continue to present significant challenges. The Company continues to monitor these situations and take appropriate actions. Inflation rates and currency exchange rates continue to have an effect on worldwide economies and, consequently, on the way the Company operates. The Company has accounted for operations in Venezuela, Argentina, Turkey and Egypt (beginning in the fiscal fourth quarter of 2024) as highly inflationary, as the prior three-year cumulative inflation rate surpassed 100%. In the face of increasing costs, the Company strives to maintain its profit margins through cost reduction programs, productivity improvements and periodic price increases.\nThe long-term implications of regional conflicts on the Company are difficult to predict. The financial impact of known existing conflicts in the fiscal third quarter of 2025 was not material. \nGovernments around the world consider various proposals to make changes to tax laws, which may include increasing or decreasing existing statutory tax rates. In connection with various government initiatives, companies are required to disclose more information to tax authorities on operations around the world, which may lead to greater audit scrutiny of profits earned in other countries. A change in statutory tax rate in any country would result in the revaluation of the Company’s deferred tax assets and liabilities related to that particular jurisdiction in the period in which the new tax law is enacted. This change would result in an expense or benefit recorded to the Company’s Consolidated Statement of Earnings. The Company closely monitors these proposals as they arise in the countries where it operates. Changes to the statutory tax rate may occur at any time, and any related expense or benefit recorded may be material to the fiscal quarter and year in which the law change is enacted. \nThe Company may be further impacted by the imposition of tariffs, trade protection measures or other policies adopted by any jurisdiction that favor domestic companies and technologies over foreign competitors.\nThe Company faces various worldwide health care changes that may continue to result in pricing pressures that include health care cost containment and government legislation relating to sales, promotions and reimbursement of health care products.\nChanges in the behavior and spending patterns of purchasers of healthcare products and services, including delaying medical procedures, rationing prescription medications, reducing the frequency of physician visits and foregoing healthcare insurance coverage, may continue to impact the Company’s businesses.\nThe Company faces regular intellectual property challenges from third parties, including generic and biosimilar manufacturers, seeking to manufacture and market generic and biosimilar versions of key pharmaceutical products prior to the expiration of the applicable patents. These challengers file Abbreviated New Drug Applications or abbreviated Biologics License Applications with the FDA or otherwise challenged the coverage and/or validity of the Company’s patents. In the event the Company is not successful in defending the patent claims challenged in the resulting lawsuits, generic or biosimilar versions of the products at issue may be introduced to the market, resulting in the potential for substantial market share and revenue losses for those products, and which may result in a non-cash impairment charge in any associated intangible asset. There is also risk that one or more competitors \n56\n \nTable of Contents\ncould launch a generic or biosimilar version of the product at issue following regulatory approval even though one or more valid patents are in place."
}