{
  "source_file": "jnj-20241229.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nGeneral\nJohnson & Johnson and its subsidiaries (the Company) have approximately 138,100 employees worldwide engaged in the research and development, manufacture and sale of a broad range of products in the healthcare field. Johnson & Johnson is a holding company, with operating companies conducting business in virtually all countries of the world. The Company’s primary focus is products related to human health and well-being. Johnson & Johnson was incorporated in the State of New Jersey in 1887.\nThe Chief Operating Decision Maker (CODM) is the Company's Chief Executive Officer (Principal Executive Officer). The Executive Committee is Johnson & Johnson’s senior leadership team responsible for setting the strategy and priorities of the Company and driving accountability at all levels. Within the strategic parameters provided by the Executive Committee, senior management groups at U.S. and international operating companies are each responsible for their own strategic plans and the day-to-day operations of those companies. \nSegments of business\nThe Company is organized into two business segments: Innovative Medicine and MedTech. Additional information required by this item is incorporated herein by reference to the narrative and tabular descriptions of segments and operating results under: Item 7. Management’s discussion and analysis of results of operations and financial condition of this Report; and Note 17 Segments of business and geographic areas of the notes to consolidated financial statements included in Item 8 of this Report.\nInnovative Medicine\nThe Innovative Medicine segment is focused on the following therapeutic areas: Immunology (e.g., rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease and psoriasis), Infectious Diseases (e.g., HIV/AIDS), Neuroscience (e.g., mood disorders, neurodegenerative disorders and schizophrenia), Oncology (e.g., prostate cancer, hematologic malignancies, lung cancer and bladder cancer), Cardiovascular and Metabolism (e.g., thrombosis, diabetes and macular degeneration) and Pulmonary Hypertension (e.g., Pulmonary Arterial Hypertension). Medicines in this segment are distributed directly to retailers, wholesalers, distributors, hospitals and healthcare professionals for prescription use. Key products in the Innovative Medicine segment include: REMICADE (infliximab), a treatment for a number of immune-mediated inflammatory diseases; SIMPONI (golimumab), a subcutaneous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis, active ankylosing spondylitis and moderately active to severely active ulcerative colitis; SIMPONI ARIA (golimumab), an intravenous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis and active ankylosing spondylitis and active polyarticular juvenile idiopathic arthritis (pJIA) in people 2 years of age and older; STELARA (ustekinumab), a treatment for adults and children with moderate to severe plaque psoriasis, for adults with active psoriatic arthritis, for adults with moderately to severely active Crohn's disease and treatment of moderately to severely active ulcerative colitis; TREMFYA (guselkumab), a treatment for adults with moderate to severe plaque psoriasis and active psoriatic arthritis and ulcerative colitis; EDURANT (rilpivirine), PREZISTA (darunavir) and PREZCOBIX/REZOLSTA (darunavir/cobicistat), antiretroviral medicines for the treatment of human immunodeficiency virus (HIV) in combination with other antiretroviral products and SYMTUZA (darunavir/cobicistat/emtricitabine/tenofovir alafenamide), a once-daily single tablet regimen for the treatment of HIV; CONCERTA (methylphenidate HCl) extended-release tablets CII, a treatment for attention deficit hyperactivity disorder; INVEGA SUSTENNA/XEPLION (paliperidone palmitate), for the treatment of schizophrenia and schizoaffective disorder in adults; INVEGA TRINZA/TREVICTA (paliperidone palmitate), for the treatment of schizophrenia in patients after they have been adequately treated with INVEGA SUSTENNA for at least four months; SPRAVATO (Esketamine), a nasal spray, used along with an oral antidepressant, to treat adults with treatment-resistant depression (TRD) and depressive symptoms in adults with major depressive disorder (MDD) with suicidal thoughts or actions; CARVYKTI (ciltacabtagene autoleucel), a chimeric antigen receptor (CAR)-T-cell therapy for the treatment of patients with relapsed/refractory multiple \n2024 Annual Report\n1\nmyeloma; ZYTIGA (abiraterone acetate), a treatment for patients with prostate cancer; ERLEADA (apalutamide), a next-generation androgen receptor inhibitor for the treatment of patients with prostate cancer; IMBRUVICA (ibrutinib), a treatment for certain B-cell malignancies, or blood cancers and chronic graft versus host disease; DARZALEX (daratumumab), a treatment for multiple myeloma; DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), a treatment for multiple myeloma and light chain (AL) Amyloidosis; TECVAYLI (teclistamab-cqyv), a ready-to-use bispecific antibody for adults with relapsed or refractory multiple myeloma who have received at least four prior lines of therapy; XARELTO (rivaroxaban), an oral anticoagulant for the prevention of deep vein thrombosis (DVT), which may lead to pulmonary embolism (PE) in patients undergoing hip or knee replacement surgery, to reduce the risk of stroke and systemic embolism in patients with nonvalvular atrial fibrillation, and for the treatment and reduction of risk of recurrence of DVT and PE to reduce the risk of major cardiovascular events in patients with coronary artery disease (CAD) and peripheral artery disease (PAD), for the treatment and secondary prevention of thromboembolism in pediatric patients, and for thromboprophylaxis in pediatric patients following the Fontan procedure; OPSUMIT (macitentan) as monotherapy or in combination, indicated for the long-term treatment of pulmonary arterial hypertension (PAH); UPTRAVI (selexipag), the only approved oral and intravenous, selective IP receptor agonist targeting a prostacyclin pathway in PAH. Many of these medicines were developed in collaboration with strategic partners or are licensed from other companies and maintain active lifecycle development programs.\nMedTech\nThe MedTech segment includes a broad portfolio of products used in the cardiovascular, orthopaedics, surgery, and vision categories. The Cardiovascular (previously referred to as Interventional solutions) portfolio includes electrophysiology products to treat heart rhythm disorders, the heart recovery portfolio (Abiomed) which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock, circulatory restoration products (Shockwave) for the treatment of calcified coronary artery disease (CAD) and peripheral artery disease (PAD), and neurovascular care that treats hemorrhagic and ischemic stroke. The Orthopaedics portfolio includes products and enabling technologies that support hips, knees, trauma, spine, sports, and others. The Surgery portfolios include advanced and general surgery technologies, as well as solutions that focus on breast aesthetics and reconstruction (Mentor). Vision products include ACUVUE brand contact lenses and TECNIS intraocular lenses for cataract surgery. These products are distributed to wholesalers, hospitals, and retailers and are used predominantly in the professional fields by physicians, nurses, hospitals, eye care professionals, and clinics.\nGeographic areas\nThe Company conducts business in virtually all countries of the world with the primary focus on products related to human health and well-being. The products made and sold in the international business include many of those described above under Segments of Business – Innovative Medicine and MedTech. However, the principal markets, products and methods of distribution in the international business vary with the country and the culture. The products sold in the international business include those developed in the U.S. and by subsidiaries abroad.\nInvestments and activities in some countries outside the U.S. are subject to higher risks than comparable U.S. activities because the investment and commercial climate may be influenced by financial instability in international economies, restrictive economic policies and political and legal system uncertainties.\nRaw materials\nRaw materials essential to the Company's business are generally readily available from multiple sources. Where there are exceptions, the temporary unavailability of those raw materials would not likely have a material adverse effect on the financial results of the Company.\nPatents\nThe Company's subsidiaries have made a practice of obtaining patent protection on their products and processes where possible. They own, or are licensed under, a significant number of patents in the U.S. and other countries relating to their products, product uses, formulations and manufacturing processes, which in the aggregate are believed to be of material importance to the Company in the operation of its businesses. The Company’s subsidiaries face patent challenges from third parties, including challenges seeking to manufacture and market generic and biosimilar versions of the Company's key pharmaceutical products prior to expiration of the applicable patents covering those products. Significant legal proceedings \n2\n \n \nand claims involving the Company's patent and other intellectual property are described in Note 19 Legal proceedings—Intellectual property of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\nSales of the Company’s largest product, collectively DARZALEX (daratumumab) and DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), accounted for approximately 13.1% of the Company's total revenues for fiscal 2024. Accordingly, the patents related to these products are believed to be material to the Company. Genmab A/S owns two patent families related to DARZALEX, and Janssen Biotech, Inc. has an exclusive license to those patent families. The two patent families both expire in the United States in 2029, and in Europe, compound/use patent protection in select countries extends to 2031/2032. Janssen Biotech, Inc. owns a separate patent portfolio related to DARZALEX FASPRO.\nSales of the Company’s second largest product, STELARA (ustekinumab) accounted for approximately 11.7% of the Company's total revenues for fiscal 2024. According to patent settlement and license agreements, the Company expects continued launches of biosimilar versions of STELARA in Europe and the United States in 2025 which will impact the Company’s sales of STELARA.\nTrademarks\nThe Company’s subsidiaries have made a practice of selling their products under trademarks and of obtaining protection for these trademarks by all available means. These trademarks are protected by registration in the U.S. and other countries where such products are marketed. The Company considers these trademarks in the aggregate to be of material importance in the operation of its businesses.\nSeasonality\nWorldwide sales do not reflect any significant degree of seasonality; however, spending has typically been heavier in the fourth quarter of each year than in other quarters. This reflects increased spending decisions, principally for advertising and research and development activity.\nCompetition\nIn all of their product lines, the Company's subsidiaries compete with companies both locally and globally. Competition exists in all product lines without regard to the number and size of the competing companies involved. Competition in research, both internally and externally sourced, involving the development and the improvement of new and existing products and processes, is particularly significant. The development of new and innovative products, as well as protecting the underlying intellectual property of the Company’s product portfolio, is important to the Company's success in all areas of its business. The competitive environment requires substantial investments in continuing research. \nEnvironment\nThe Company is subject to a variety of environmental laws and regulations in the United States and other jurisdictions. The Company believes that its operations comply in all material respects with applicable environmental laws and regulations. The Company’s compliance with these requirements is not expected to have a material effect upon its capital expenditures, cash flows, earnings or competitive position.\nRegulation\nThe Company’s businesses are subject to varying degrees of governmental regulation in the countries in which operations are conducted, and the general trend is toward increasingly stringent regulation and enforcement. The Company is subject to costly and complex U.S. and foreign laws and governmental regulations, and any adverse regulatory action may materially adversely affect the Company's financial condition and business operations. In the U.S., the pharmaceutical product and medical technology industries have long been subject to regulation by various federal and state agencies, primarily as to product safety, efficacy, manufacturing, advertising, labeling and safety reporting. The exercise of broad regulatory powers by the U.S. Food and Drug Administration (the U.S. FDA) continues to result in increases in the amounts of testing and documentation required for U.S. FDA approval of new drugs and devices and a corresponding increase in the expense of product introduction. Similar trends are also evident in major markets outside of the U.S. \n2024 Annual Report\n3\nThe medical device regulatory framework and the evolving privacy, data localization, and emerging cyber security laws and regulations around the world are examples of such increased regulation. Within the U.S., an increasing number of U.S. States have enacted comprehensive privacy laws, and federal regulators (e.g., the U.S. FDA, FTC and HHS) continue to stress the intersection of health and privacy as a compliance and enforcement priority. In the EU, multiple directives and laws (including NIS2, EHDS, the Data Act, the Cyber Resilience Act, and the AI Act) are rapidly changing privacy and cybersecurity compliance requirements while introducing new enforcement risks. In addition, China has introduced broad personal information protection and data security regulations, with more anticipated, thereby increasing China’s scrutiny of company compliance and data transfer practices. With other jurisdictions enacting similar privacy laws, local data protection authorities will force greater accountability on the collection, access and use of personal data in the healthcare industry. These laws can also restrict transfers of data across borders, potentially impacting how data-driven health care solutions are developed and deployed globally in a compliant manner. Moreover, as a result of the broad scale release and availability of Artificial Intelligence (AI) technologies such as generative AI, a global trend towards more comprehensive and nuanced regulation to ensure the ethical use, privacy, and security of AI is underway that includes standards for transparency, accountability, and fairness, which will require compliance developments or enhancements. \nThe regulatory agencies under whose purview the Company operates have administrative powers that may subject it to actions such as product withdrawals, recalls, seizure of products and other civil and criminal sanctions. In some cases, the Company’s subsidiaries may deem it advisable to initiate product recalls regardless of whether it has been required or directed to.\nThe U.S. FDA and regulatory agencies around the globe are also increasing their enforcement activities. If the U.S. FDA were to conclude that we are not in compliance with applicable laws or regulations, or that any of our pharmaceutical products or medical technologies are ineffective or pose an unreasonable safety risk, the U.S. FDA could ban such products, detain or seize adulterated or misbranded products, order a recall, repair, replacement, or refund of such products, withdraw approval for such products, refuse to grant pending applications for marketing authorization or require certificates of foreign governments for exports, and/or require us to notify health professionals and others that the products present unreasonable risks of substantial harm to the public health. The U.S. FDA may also assess civil or criminal penalties against us, our officers or employees and impose operating restrictions on a company-wide basis, or enjoin and/or restrain certain conduct resulting in violations of applicable law. The U.S. FDA may also recommend prosecution to the U.S. Department of Justice. Any adverse regulatory action, depending on its magnitude, may restrict us from effectively marketing and selling our products and limit our ability to obtain future clearances, classifications or approvals, and could result in a substantial modification to our business practices and operations. Equivalent enforcement mechanisms exist in different countries in which we conduct business.\nThe costs of human healthcare have been and continue to be a subject of study, investigation and regulation by governmental agencies and legislative bodies around the world. In the U.S., attention has been focused by states, regulatory agencies and Congress on prices, profits, overutilization and the quality and costs of healthcare generally. Laws and regulations have been enacted to require adherence to strict compliance standards and prevent fraud and abuse in the healthcare industry. There is increased focus on interactions and financial relationships between healthcare companies and healthcare providers. Various state and federal transparency laws and regulations require disclosures of payments and other transfers of value made to certain healthcare practitioners, including physicians, teaching hospitals, and certain non-physician practitioners. Federal and foreign laws governing international business practices require strict compliance with anti-bribery standards and certain prohibitions with respect to payments to any foreign government official. Payors and Pharmacy Benefit Managers (PBMs) are a potent force in the marketplace, and increased attention is being paid to the impact of PBM practices on healthcare cost and access in the U.S.\nOur business has been and continues to be affected by federal and state legislation that alters the pricing, coverage, and reimbursement landscape. At the federal level, in August 2022, President Biden signed into law the Inflation Reduction Act (IRA), which includes provisions that effectively authorize the government to establish prices for certain high-spend single-source drugs and biologics reimbursed by the Medicare program, starting in 2026 for Medicare Part D drugs and 2028 for Medicare Part B drugs. On August 29, 2023, the Centers for Medicare & Medicaid Services (“CMS”) published the first “Selected Drug” list, which includes XARELTO and STELARA as well as IMBRUVICA, which is developed in collaboration and co-commercialized in the U.S. with Pharmacyclics LLC, an AbbVie company. The Selected Drug list also included other medicines targeting disease states that are prevalent in the Medicare population. Although CMS published an explanation for how it determined prices for selected drugs in December 2024, uncertainty remains as to the methodology used to determine these prices. The IRA specifies a ceiling price but not a minimum price for selected drugs and does not require CMS to use a specific framework for determining selected drug prices. In any event, we anticipate that the selected products will be subjected to a government-established price for the Medicare population beginning in 2026.\n4\n \n \nThe IRA also contains provisions that impose rebates if certain prices increase at a rate that outpaces the rate of inflation, beginning October 1, 2022, for Medicare Part D drugs and January 1, 2023, for Medicare Part B drugs. Separate IRA provisions redesign the Medicare Part D benefit in various ways, including by shifting a greater portion of costs to manufacturers within certain coverage phases and replacing the Part D coverage gap discount program with a new manufacturer discounting program. Failure to comply with IRA provisions may subject manufacturers to various penalties, including civil monetary penalties.\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In April 2024, Janssen appealed the district court’s denial of its summary judgment motion to the Third Circuit.\nAdditionally, we expect continued scrutiny on drug pricing and government price reporting from Congress, agencies, and other bodies at the federal and state levels, which may result in additional regulations or other mechanisms to increase pricing transparency and controls. \nThere are a number of additional bills pending in Congress and healthcare reform proposals at the state level that would affect drug pricing, including in the Medicare and Medicaid programs. This changing legal landscape has both positive and negative impacts on the U.S. healthcare industry with much remaining uncertain as to how various provisions of federal and state law, and potential modification or repeal of these laws, will ultimately affect the industry. The IRA and any other federal or state legislative change could affect the pricing and market conditions for our products.\nIn addition, business practices in the healthcare industry have come under increased scrutiny, particularly in the U.S., by government agencies and state attorneys general, and resulting investigations and prosecutions carry the risk of significant civil and criminal penalties. Of note is the increased enforcement activity by data protection authorities in various jurisdictions, particularly in the European Union, where significant fines have been levied on companies for data breaches, violations of privacy requirements, and unlawful cross-border data transfers. In the U.S., the Federal Trade Commission has stepped up enforcement of data privacy with several significant settlements (including settlements concerning the downstream sharing of personal information and use and disclosure of personal health data) and there have been a material increase in class-action lawsuits linked to the collection and use of biometric data and use of tracking technologies.\nFurther, the Company relies on global supply chains, and production and distribution processes, that are complex, and subject to increasing regulatory requirements that may affect sourcing, supply and pricing of materials used in the Company's products. These processes also are subject to complex and lengthy regulatory approvals.\n2024 Annual Report\n5\nEmployees and human capital management\nAs of December 29, 2024 and December 31, 2023 the number of employees was approximately:\n2024\n2023\nEmployees\n(1)\n139,800 \n134,400 \nFull-time equivalent (FTE) positions\n(2)\n138,100 \n131,900 \n(1)\n“Employee” is defined as an individual working full-time or part-time, excluding fixed term employees, interns and co-op employees. Employee data may not include full population from more recently acquired companies and individuals on long-term disability are excluded. Contingent workers, contractors and subcontractors are also excluded. Shockwave has been included in the fiscal 2024 headcount in the above table.\n(2)\nFTE represents the total number of full-time equivalent positions and does not reflect the total number of individual employees as some work part-time.\nEmployees by region (in percentages)\nStrategy\nThe Company believes that its employees are critical to its continued success and are an essential element of its long-term strategy. Management is responsible for ensuring that its policies and processes reflect and reinforce the Company's desired corporate culture, including policies and processes related to strategy, risk management, and ethics and compliance. The Company’s human capital management strategy is built on three fundamental focus areas:\n•\nAttracting and recruiting top talent\n•\nDeveloping and retaining top talent\n•\nEmpowering and inspiring talent\nUnderpinning these focus areas are ongoing efforts to cultivate and foster a culture built on innovation, health, well-being and safety, inclusion and belonging where the Company's employees are encouraged to succeed both professionally and personally while helping the Company achieve its business goals.\nCulture and employee engagement\nAt Johnson & Johnson, employees are guided by Our Credo, which sets forth the Company's responsibilities to patients, consumers, customers, healthcare professionals, employees, communities and shareholders. Employees worldwide must adhere to the Company’s Code of Business Conduct, which sets fundamental requirements and serves as a foundation for the Company policies, procedures and guidelines, all of which provide additional guidance on expected employee behaviors in every market where it operates. The Company conducts global surveys that offer its employees the ability to provide feedback and valuable insight to help address potential human resources risks and identify opportunities to improve. In 2024, 94% of global employees across 73 countries participated in Our Credo Survey which was offered in 36 languages.\n6\n \n \nGrowth and development\nTo lead in the changing healthcare landscape, it is crucial that the Company continue to attract and retain top talent. In 2024, the Company's voluntary turnover rate was 6.3%. The Company believes that its employees must be equipped with the right knowledge and skills and be provided with opportunities to grow and develop in their careers. Accordingly, professional development programs and educational resources are available to all employees. The Company's objective is to foster a learning culture that helps shape each person’s unique career path while creating a robust pipeline of talent to deliver on the Company’s long-term strategies. In furtherance of this objective, the Company deploys a global approach to ensure development is for everyone, regardless of where they are on their career journey. To prioritize learning, the Company recently held Johnson & Johnson's second Global Learning Day. Employees were encouraged to set aside a full day to explore skill-building courses on J&J Learn, the new state-of-the-art learning platform.\nOur workforce\nAs stated in Our Credo, we are responsible to our employees who work with us throughout the world. The Company is committed to cultivating, fostering and advancing an inclusive, credo-based work environment for employees that recognizes and rewards based on merit. The Company is dedicated to the values in Our Credo and strives to meet the needs of its employees and stakeholders through compliance with law and the following evidence based strategies:\n•\nSustain a global workforce of individuals with many different backgrounds, abilities, cultures and perspectives \n•\nMaintain a work environment where each person’s dignity is respected and they have an opportunity to advance based on their merit\n•\nDrive innovation and growth with our business to serve markets around the world \nOur approach with respect to our workforce is guided by applicable laws, internal and external insights, global best practices and employee feedback.\nCompensation and benefits\nAs part of the Company's total rewards philosophy, the Company offers competitive compensation and benefits to attract and retain top talent. The Company is committed to fair treatment in its compensation and benefits for employees at all levels. The Company observes legal minimum wage provisions and exceeds them where possible. The Company's total rewards offerings include an array of programs to support its employees' well-being, including annual performance incentive opportunities, pension and retirement savings programs, health and welfare benefits, paid time off, leave programs, flexible work schedules and employee assistance programs. \nHealth, wellness and safety\nThe Company’s investment in employee health, well-being and safety is built on its conviction that advancing health for humanity starts with advancing the health of its employees. With the right awareness, focus, practices and tools, the Company works to ensure that all its employees around the world, as well as contingent workers, contractors and visitors to the Company's sites, can work safely. The Company has continuously expanded health and well-being programs throughout the Company and across the globe, incorporating new thinking and technologies to keep its offerings best-in-class and to help employees achieve their personal health goals. The programs and practices the Company provides—physical, mental, emotional and financial—help promote holistic employee health. The Company continues to address our employees needs through J&J Flex, a hybrid model that empowers the Company’s office-based employees to find a balance of in-person and remote work, while preserving the Company's culture and need for face-to-face engagement and leadership. \n2024 Annual Report\n7\nAvailable information\nThe Company’s main corporate website address is \nwww.jnj.com\n. The Company makes its SEC filings available on the Company’s website at \nwww.investor.jnj.com/financials/sec-filings\n, as soon as reasonably practicable after having been electronically filed or furnished to the SEC. The Company's SEC filings are also available at the SEC’s website at \nwww.sec.gov\n.\nInvestors and the public should note that the Company also announces information through its press releases and media statements at \nwww.jnj.com/mediacenter\n, \ninvestor.jnj.com\n and\n www.factsabouttalc.com\n. We use these websites to communicate with investors and the public about our products, litigation and other matters. It is possible that the information we post to these websites could be deemed to be material information. Therefore, we encourage investors and others interested in the Company to review the information posted to these websites in conjunction with \nwww.jnj.com\n, the Company's SEC filings, press releases, public conference calls and webcasts.\nIn addition, the Restated Certificate of Incorporation, as amended, Amended and Restated By-Laws, the written charters of the Audit Committee, the Compensation & Benefits Committee, the Nominating & Corporate Governance Committee, the Regulatory Compliance & Sustainability Committee, and the Science & Technology Committee of the Board of Directors, and the Company’s Principles of Corporate Governance, Code of Business Conduct (for employees), Code of Business Conduct & Ethics for Members of the Board of Directors and Executive Officers, and other corporate governance materials are available on the Company's website at \nwww.investor.jnj.com/governance/corporate-governance-overview\n \nand will be provided without charge to any shareholder submitting a written request, as provided above. The information on \nwww.jnj.com\n,\n investor.jnj.com \nand\n www.factsabouttalc.com\n is not, and will not be deemed, a part of this Report or incorporated into any other filings the Company makes with the SEC.\n8",
  "item7": "Item 7. Management’s discussion and analysis of results of operations and financial condition\nOrganization and business segments\nDescription of the company and business segments\nJohnson & Johnson and its subsidiaries (the Company) have approximately 138,100 employees worldwide engaged in the research and development, manufacture and sale of a broad range of products in the healthcare field. The Company conducts business in virtually all countries of the world with the primary focus on products related to human health and well-being.\nThe Company is organized into two business segments: Innovative Medicine and MedTech. The Innovative Medicine segment is focused on the following therapeutic areas: Immunology, Infectious Diseases, Neuroscience, Oncology, Pulmonary Hypertension, and Cardiovascular and Metabolism. Products in this segment are distributed directly to retailers, wholesalers, distributors, hospitals and healthcare professionals for prescription use. The MedTech segment includes a broad portfolio of products used in the Orthopaedic, Surgery, Cardiovascular (previously referred to as Interventional Solutions) and Vision fields. These products are distributed to wholesalers, hospitals and retailers, and used principally in the professional fields by physicians, nurses, hospitals, eye care professionals and clinics. \nThe Chief Operating Decision Maker (CODM) is the Company's Chief Executive Officer (Principal Executive Officer).The Executive Committee is Johnson & Johnson’s senior leadership team responsible for setting the strategy and priorities of the Company and driving accountability at all levels. Within the strategic parameters provided by the Executive Committee, senior management groups at U.S. and international operating companies are each responsible for their own strategic plans and the day-to-day operations of those companies.\nIn all of its product lines, the Company competes with other companies both locally and globally, throughout the world. Competition exists in all product lines without regard to the number and size of the competing companies involved. Competition in research, involving the development and the improvement of new and existing products and processes, is particularly significant. The development of new and innovative products, as well as protecting the underlying intellectual property of the Company's product portfolio, is important to the Company’s success in all areas of its business. The competitive environment requires substantial investments in continuing research. \nManagement’s objectives\nWith Our Credo as the foundation, the Company  believes health is everything. The Company's strength in healthcare innovation empowers us to build a world where complex diseases are prevented, treated, and cured, where treatments are smarter and less invasive, and solutions are personal. Through the Company's expertise in Innovative Medicine and MedTech, the Company is uniquely positioned to innovate across the full spectrum of healthcare solutions today to deliver the breakthroughs of tomorrow, and profoundly impact health for humanity.\nNew products introduced within the past five years accounted for approximately 25% of 2024 sales. In 2024, $17.2 billion was invested in research and development reflecting management’s commitment to create life-enhancing innovations and to create value through partnerships that will profoundly impact of health for humanity. \nOur approximately 138,100 employees are critical drivers of the Company’s success. Employees are empowered and inspired to lead with Our Credo and purpose as guides. This allows every employee to use the Company’s reach and size to advance the Company’s purpose, and to also lead with agility and urgency. Leveraging the extensive resources across the enterprise enables the Company to innovate and execute with excellence. This ensures the Company can remain focused on addressing the unmet needs of society every day and invest for an enduring impact, ultimately delivering value to its patients, consumers and healthcare professionals, employees, communities and shareholders.\n22\n \n \nResearch & \ndevelopment\nAcquisitions* \n(net of cash acquired)\nDividends paid \nper share\n*    Includes business combinations and asset acquisitions\nResults of operations\nAnalysis of consolidated sales\nFor discussion on results of operations and financial condition pertaining to the fiscal years 2023 and 2022 see the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023, Item 7. Management's discussion and analysis of results of operations and financial condition. Prior periods disclosed herein were recast to reflect the continuing operations of the Company. \nIn 2024, worldwide sales increased 4.3% to $88.8 billion as compared to an increase of 6.5% in 2023. These sales changes consisted of the following:\nSales increase/(decrease) due to:\n2024\n2023\nVolume\n5.9 \n%\n6.8 \n%\nPrice\n0.0 \n0.6 \nCurrency\n(1.6)\n(0.9)\nTotal\n4.3\n \n%\n6.5\n \n%\nThe net impact of acquisitions and divestitures on the worldwide sales growth was a positive impact of 0.5% in 2024 and a positive impact of 1.5% in 2023. \nSales by U.S. companies were $50.3 billion in 2024 and $46.4 billion in 2023. This represents increases of 8.3% in 2024 and 10.6% in 2023. In the fiscal 2024, acquisitions and divestitures had a net positive impact of 0.7% on the U.S. operational sales growth. Sales by international companies were $38.5 billion in 2024 and $38.7 billion in 2023. This represents a decrease of 0.5% in 2024 and an increase of 1.9% in 2023. In fiscal 2024, acquisitions and divestitures had a net positive impact of 0.2% on the international operational sales growth. In fiscal 2024, the impact of the Covid-19 Vaccine sales decline on the international operational sales was a negative 2.6%.\nThe five-year compound annual growth rates for worldwide, U.S. and international sales were 5.4%, 6.8% and 3.8%, respectively. The ten-year compound annual growth rates for worldwide, U.S. and international sales were 4.0%, 5.4% and 2.5%, respectively.\n2024 Annual Report\n23\nIn 2024, sales by companies in Europe experienced a decline of 1.0% as compared to the prior year, which included an operational decline of 0.6% and a negative currency impact of 0.4%. In fiscal 2024, the net impact of the Covid-19 Vaccine on the European regions change in operational sales was a negative 4.7%. Sales by companies in the Western Hemisphere, excluding the U.S., achieved growth of 3.6% as compared to the prior year, which included operational growth of 20.4%, and a negative currency impact of 16.8%. Sales by companies in the Asia-Pacific, Africa region experienced a decline of 1.2% as compared to the prior year, including operational growth of 2.3% offset by a negative currency impact of 3.5%.\nIn 2024, the Company utilized three wholesalers distributing products for both segments that represented approximately 20.5%, 15.6% and 12.3% of the total gross revenues. In 2023, the Company had three wholesalers distributing products for both segments that represented approximately 18.2%, 15.1% and 14.2% of the total gross revenues. \n2024 Sales by geographic region (in billions)\n2024 Sales by segment (in billions)\nNote: values may have been rounded\nAnalysis of sales by business segments\nInnovative Medicine segment\nInnovative Medicine segment sales in 2024 were $57.0 billion, an increase of 4.0% from 2023, which included operational growth of 5.7% and a negative currency impact of 1.7%. U.S. sales were $34.0 billion, an increase of 9.0%. International sales were $23.0 billion, a decrease of 2.5%, which included operational growth of 1.3% offset by a negative currency impact of 3.8%. In 2024, acquisitions and divestitures had a net negative impact of 0.1% on the operational sales growth of the worldwide Innovative Medicine segment. In fiscal 2024, the net impact of the Covid-19 Vaccine on the total Innovative Medicine and International change in operational sales was a negative 1.8% and 4.2%, respectively.\n24\n \n \nMajor Innovative Medicine therapeutic area sales:\n(Dollars in Millions)\n2024\n2023\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nTotal Immunology\n$17,828\n$18,052\n(1.2\n \n%)\n0.4\n \n%\n(1.6)\n%\nREMICADE\n1,605\n1,839\n(12.8)\n(11.4)\n(1.4)\nSIMPONI/SIMPONI ARIA\n2,190\n2,197\n(0.3)\n4.5 \n(4.8)\nSTELARA\n10,361\n10,858\n(4.6)\n(3.4)\n(1.2)\nTREMFYA\n3,670\n3,147\n16.6 \n18.1 \n(1.5)\nOther Immunology\n3\n11\n(74.1)\n(74.1)\n— \nTotal Infectious Diseases\n3,396\n4,418\n(23.1)\n(22.7)\n(0.4)\nCOVID-19 VACCINE\n198\n1,117\n(82.4)\n(82.4)\n0.0 \nEDURANT/rilpivirine\n1,272\n1,150\n10.6 \n10.6 \n0.0 \nPREZISTA/PREZCOBIX/REZOLSTA/SYMTUZA\n1,712\n1,854\n(7.7)\n(7.1)\n(0.6)\nOther Infectious Diseases\n214\n297\n(27.6)\n(25.0)\n(2.6)\nTotal Neuroscience\n7,115\n7,140\n(0.4)\n1.3\n \n(1.7)\nCONCERTA/methylphenidate\n641\n783\n(18.1)\n(15.1)\n(3.0)\nINVEGA SUSTENNA/XEPLION/INVEGA TRINZA/TREVICTA\n4,222\n4,115\n2.6 \n3.4 \n(0.8)\nSPRAVATO\n1,077\n689\n56.4 \n56.8 \n(0.4)\nOther Neuroscience\n1,175\n1,553\n(24.3)\n(20.7)\n(3.6)\nTotal Oncology\n20,781\n17,661\n17.7\n \n19.8\n \n(2.1)\nCARVYKTI\n963\n500\n92.7\n92.7\n0.0\nDARZALEX\n11,670\n9,744\n19.8 \n22.2 \n(2.4)\nERLEADA\n2,999\n2,387\n25.6 \n27.3 \n(1.7)\nIMBRUVICA\n3,038\n3,264\n(6.9)\n(5.2)\n(1.7)\nTECVAYLI\n549\n395\n38.8 \n39.8 \n(1.0)\nZYTIGA /abiraterone acetate\n631\n887\n(28.8)\n(25.0)\n(3.8)\nOther Oncology\n931\n484\n92.5\n94.3\n(1.8)\nTotal Pulmonary Hypertension \n4,282\n3,815\n12.3\n \n14.1\n \n(1.8)\nOPSUMIT\n2,184\n1,973\n10.7 \n11.9 \n(1.2)\nUPTRAVI\n1,817\n1,582\n14.9 \n16.1 \n(1.2)\nOther Pulmonary Hypertension\n281\n260\n7.9 \n18.3 \n(10.4)\nTotal Cardiovascular / Metabolism / Other\n3,562\n3,671\n(3.0)\n(2.6)\n(0.4)\nXARELTO\n2,373\n2,365\n0.3 \n0.3 \n— \nOther\n1,189\n1,306\n(8.9)\n(7.8)\n(1.1)\nTotal Innovative Medicine Sales\n$56,964\n54,759\n4.0\n \n%\n5.7\n \n%\n(1.7)\n%\n2024 Annual Report\n25\nImmunology products sales were $17.8 billion in 2024, representing a decrease of 1.2% as compared to the prior year. The decline of STELARA (ustekinumab) sales was driven by share loss primarily due to European biosimilar entrants. Lower sales of REMICADE (infliximab) was due to continued biosimilar competition. The growth of TREMFYA\n \n(guselkumab) was due to market growth and share gains.\nSales of STELARA in the United States were approximately $6.7 billion in fiscal 2024. Third parties have filed abbreviated Biologics License Applications with the FDA seeking approval to market biosimilar versions of STELARA. The Company has settled certain litigation under the Biosimilar Price Competition and Innovation Act of 2009. According to patent settlement and license agreements, the Company expects continued launches of biosimilar versions of STELARA in Europe and the United States in 2025 which will impact the Company’s sales of STELARA.\nBiosimilar versions of REMICADE have been introduced in the United States and certain markets outside the United States and additional competitors continue to enter the market. Continued infliximab biosimilar competition will result in a further reduction in sales of REMICADE.\nInfectious disease products sales were $3.4 billion in 2024, a decline of 23.1% as compared to the prior year primarily driven by a decline in COVID-19 vaccine revenue.\nNeuroscience products sales were $7.1 billion in 2024, representing a decrease of 0.4% as compared to the prior year primarily driven by a decline in Other Neuroscience. The decline was partially offset by the growth of SPRAVATO (esketamine) driven by the ongoing launch and increased physician and patient demand. \nOncology products achieved sales of $20.8 billion in 2024, representing an increase of 17.7% as compared to the prior year. Strong sales of DARZALEX (daratumumab) were driven by continued share gains and market growth. Growth of ERLEADA (apalutamide) was primarily due to continued share gains and market growth. Sales of CARVYKTI (ciltacabtagene autoleucel) were driven by continued share gains, capacity expansion and manufacturing efficiencies. Additionally, sales from the ongoing launches of TECVAYLI (teclistamab-cqyv), TALVEY (talquetamab-tgvs) and RYBREVANT (amivantamab), included in Other Oncology, contributed to the growth. Growth was partially offset by ZYTIGA (abiraterone acetate) due to loss of exclusivity and IMBRUVICA (ibrutinib) due to global competitive pressures. \nPulmonary Hypertension products sales were $4.3 billion, representing an increase of 12.3% as compared to the prior year. Sales growth of both OPSUMIT (macitentan) and UPTRAVI (selexipag) was driven by market growth and share gains. Growth in Other Pulmonary Hypertension was driven by OPSYNVI (macitentan/tadalafil). \nCardiovascular/Metabolism/Other products sales were $3.6 billion, a decline of 3.0% as compared to the prior year driven by declines in Other. \nThe Company maintains a policy that no end customer will be permitted direct delivery of product to a location other than the billing location. This policy impacts contract pharmacy transactions involving non-grantee 340B covered entities for most of the Company’s drugs, subject to multiple exceptions. Both grantee and non-grantee covered entities can maintain certain contract pharmacy arrangements under policy exceptions. The Company has been and will continue to offer 340B discounts to covered entities on all of its covered outpatient drugs, and it believes its policy will improve its ability to identify inappropriate duplicate discounts and diversion prohibited by the 340B statute. The 340B Drug Pricing Program is a U.S. federal government program requiring drug manufacturers to provide significant discounts on covered outpatient drugs to covered entities.\n26\n \n \nDuring 2024, the Company advanced its pipeline with several regulatory submissions and approvals for new drugs and additional indications for existing drugs as follows:\nProduct Name\n(Chemical Name)\nIndication\nUS\nApproval\nEU\nApproval\nUS\nFiling\nEU\nFiling\nBALVERSA (erdafitinib)\nTreatment of Patients with Locally Advanced or Metastatic Urothelial Carcinoma and Selected Fibroblast Growth Factor Receptor Gene Alterations (THOR)\n•\n•\nCARVYKTI (ciltacabtagene autoleucel)\nTreatment for Relapsed and Refactor multiple myeloma with 1-3 PL (CARTITUDE-4)\n•\n•\nDARZALEX (daratumumab)\nTreatment for frontline multiple myeloma transplant eligible (PERSEUS)\n•\n•\nDARZALEX (daratumumab)\nTreatment for frontline multiple myeloma transplant ineligible (CEPHEUS)\n•\n•\nDARZALEX (daratumumab)\nTreatment as subcutaneous monotherapy for high-risk smoldering multiple myeloma (AQUILA)\n•\n•\nEDURANT (rilpivirine)\nTreatment for pediatric patients (2-12 years old) with HIV\n•\n•\nIMBRUVICA (ibrutinib)\nTreatment for frontline MCL (Triangle)\n•\nnipocalimab\nTreatment for Generalized Myasthenia Gravis\n•\n•\nOPSUMIT (macitentan)\nTreatment for pediatric pulmonary arterial hypertension (TOMORROW)\n•\n•\nOPSYNVI (macitentan/tadalafil STCT)\nTreatment for pulmonary arterial hypertension\n•\n•\nREKAMBYS\nTreatment for Adolescents HIV\n•\nRYBREVANT (amivantamab)\nIn Combination with Chemotherapy for the First-Line Treatment of Adult Patients with Advanced Non-Small Cell Lung Cancer with Activating EGFR Exon 20 Insertion Mutations (PAPILLON)\n•\n•\nRYBREVANT (amivantamab)\nTreatment for subcutaneous (PALOMA-3)\n•\n•\nRYBREVANT / LAZCLUZE\nTreatment for Non-Small Cell Lung Cancer (MARIPOSA)\n•\n•\nRYBREVANT\nTreatment for Non-Small Cell Lung Cancer 2L (MARIPOSA-2)\n•\n•\nSIMPONI (golimumab)\nTreatment of Patients with Pediatric Ulcerative Colitis\n•\n•\nSPRAVATO (esketamine) monotherapy\nTreatment of Patients with Treatment Resistant Depression (TRD4005)\n•\nSTELARA (ustekinumab)\nTreatment of Patients with Pediatric Crohn's Disease\n•\nTREMFYA (guselkumab)\nTreatment of Patients with Ulcerative Colitis (QUASAR)\n•\n•\nTREMFYA (guselkumab)\nSubcutaneous Induction for treatment of patients with Ulcerative Colitis (ASTRO)\n•\nTREMFYA (guselkumab)\nSubcutaneous Induction for treatment of patients with Crohn's Disease (GRAVITI)\n•\n•\nTREMFYA (guselkumab)\nTreatment of Patients with Crohn's Disease (GALAXI)\n•\n•\nTREMFYA (guselkumab)\nTreatment of Patients with Pediatric Psoriasis\n•\nUPTRAVI (selexipag)\nTreatment of Patients with Pediatric Pulmonary Arterial Hypertension (SALTO)\n•\n2024 Annual Report\n27\nMedTech segment\nThe MedTech segment sales in 2024 were $31.9 billion, an increase of 4.8% from 2023, which included operational growth of 6.2% and a negative currency impact of 1.4%. U.S. sales were $16.3 billion, an increase of 6.9% as compared to the prior year. International sales were $15.5 billion, an increase of 2.6% as compared to the prior year, which included operational growth of 5.4% and a negative currency impact of 2.8%. In 2024, the net impact of acquisitions and divestitures on the MedTech segment worldwide operational sales growth was a positive 1.5% primarily related to the Shockwave acquisition. \nMajor MedTech franchise sales:\n(Dollars in Millions)\n2024\n2023\nTotal\nChange\nOperations\nChange\nCurrency\nChange\nSurgery\n$9,845\n \n10,037\n \n(1.9)\n%\n0.1\n \n%\n(2.0)\n%\nAdvanced\n4,488 \n4,671 \n(3.9)\n(2.0)\n(1.9)\nGeneral\n5,358 \n5,366 \n(0.2)\n2.0 \n(2.2)\nOrthopaedics\n9,158\n \n8,942\n \n2.4\n \n3.0\n \n(0.6)\nHips\n1,638 \n1,560 \n5.0 \n5.6 \n(0.6)\nKnees\n1,545 \n1,456 \n6.1 \n6.5 \n(0.4)\nTrauma\n3,049 \n2,979 \n2.3 \n2.9 \n(0.6)\nSpine, Sports & Other\n2,926 \n2,947 \n(0.7)\n(0.1)\n(0.6)\nCardiovascular \n(1)\n7,707\n \n6,350\n \n21.4\n \n22.8\n \n(1.4)\nElectrophysiology\n5,267 \n4,688 \n12.3 \n14.0 \n(1.7)\nAbiomed\n1,496 \n1,306 \n14.5\n14.9\n(0.4)\nShockwave \n(2)\n564 \n— \n*\n*\n— \nOther Cardiovascular\n380 \n356 \n6.9 \n8.4 \n(1.5)\nVision\n5,146\n \n5,072\n \n1.5\n \n3.0\n \n(1.5)\nContact Lenses/Other\n3,733 \n3,702 \n0.8 \n2.6 \n(1.8)\nSurgical\n1,413 \n1,370 \n3.2 \n4.3 \n(1.1)\nTotal MedTech Sales\n$31,857\n \n30,400\n \n4.8\n \n%\n6.2\n \n%\n(1.4)\n%\n(1)\nPreviously referred to as Interventional Solutions\n(2)\nAcquired on May 31, 2024\n*    Percentage greater than 100% or not meaningful\nThe Surgery franchise sales were $9.8 billion in 2024, representing a decrease of 1.9% from 2023. The decline in Advanced Surgery was primarily due to China volume-based procurement across all platforms and competitive pressures in Energy and Endocutters. This was partially offset by the strength of the portfolio and commercial execution in Biosurgery as well as the strength of new products in Endocutters. Growth in General Surgery was primarily driven by technology penetration and benefits from the differentiated Wound Closure portfolio as well as increased procedure volume. This growth was offset by the negative impact of currency and the Acclarent divestiture.\nThe Orthopaedics franchise sales were $9.2 billion in 2024, representing an increase of 2.4% from 2023. The fiscal 2024 includes a one-time revenue recognition timing change related to certain products across all Orthopaedic platforms in the U.S. which positively impacted the worldwide Orthopaedics franchise growth as well as the negative impact from the near-term revenue disruption related to the previously announced Orthopaedics restructuring. The growth in Hips reflects continued strength of the portfolio primarily in the Anterior approach, and global procedure growth. The growth in Knees was primarily driven by the ATTUNE portfolio, pull through related to the VELYS Robotic assisted solution and global procedure growth. Growth in Trauma was driven by the adoption of recently launched products. The decline in Spine, Sports & Other was primarily driven by competitive pressures and impacts from China volume-based procurement. This was partially offset by growth in the U.S. market.\n28\n \n \nThe Cardiovascular franchise, which includes sales from Shockwave Medical (Shockwave) acquired on May 31, 2024, achieved sales of $7.7 billion in 2024, representing an increase of 21.4% from 2023. Electrophysiology growth was driven by global procedure growth, new product performance and commercial execution. This was partially offset by the impacts of volume-based procurement in China and competitive pressures in Pulsed Field Ablation catheters in the U.S. Abiomed sales reflect the strength of all major commercialized regions driven by the continued adoption of Impella 5.5 and Impella RP. \nThe Vision franchise achieved sales of $5.1 billion in 2024, representing an increase of 1.5% from 2023. Contact Lenses/Other growth was primarily driven by price actions, continued strong performance in the ACUVUE OASYS 1-Day family of products (including recent launches), impacts from a one-time change in contract shipping terms in the U.S. and lapping of prior year impacts of Russian sanctions partially offset by U.S. distributor stocking dynamics. Surgical growth was primarily driven by the continued strength of recent innovations and commercial execution partially offset by China volume-based procurement and competitive pressures in the U.S. \nAnalysis of consolidated earnings before provision for taxes on income\nConsolidated earnings before provision for taxes on income was $16.7 billion and $15.1 billion for the years 2024 and 2023, respectively. As a percent to sales, consolidated earnings before provision for taxes on income was 18.8% and 17.7%, in 2024 and 2023, respectively.\nEarnings before provision for taxes\n(Dollars in billions. Percentages in chart are as a percent to total sales)\nCost of products sold and selling, marketing and administrative expenses:\nCost of products sold\nSelling, marketing & administrative\n(Dollars in billions. Percentages in chart are as a percent to total sales)\n2024 Annual Report\n29\nCost of products sold:\nCost of products sold decreased as a percent to sales driven by:\n•\nLower one-time COVID-19 vaccine supply network related exit costs in 2024 ($0 in 2024 versus $0.2 billion 2023) in the Innovative Medicine business\n•\nPrior year restructuring related excess inventory costs in the MedTech business \npartially offset by\n•\nThe fair value Inventory step-up of $0.4 billion related to the business combination accounting associated with Shockwave \nThe intangible asset amortization expense included in cost of products sold was $4.5 billion for both fiscal years 2024 and 2023.\nSelling, Marketing and Administrative expense:\nSelling, Marketing and Administrative Expenses increased as a percent to sales driven by:\n•\nIncreased commercial investment in the Innovative Medicine business\npartially offset by\n•\nOptimization efforts related to the residual costs associated with the Kenvue separation \nResearch and Development expense:\nResearch and development expense by segment of business was as follows:\n \n2024\n2023\n(Dollars in Millions)\nAmount\n% of Sales*\nAmount\n% of Sales*\nInnovative Medicine\n$13,529 \n23.8 \n%\n$11,963 \n21.8 \n%\nMedTech\n3,703 \n11.6 \n3,122 \n10.3 \nTotal research and development expense\n$17,232\n \n19.4\n \n%\n$15,085\n \n17.7\n \n%\nPercent increase/(decrease) over the prior year\n14.2 \n%\n \n6.7 \n%\n \n*As a percent to segment sales \nResearch and development activities represent a significant part of the Company's business. These expenditures relate to the processes of discovering, testing and developing new products, upfront payments and developmental milestones, improving existing products, as well as ensuring product efficacy and regulatory compliance prior to launch. The Company remains committed to investing in research and development with the aim of delivering high quality and innovative products. \nResearch and Development increased as a percent to sales primarily driven by:\n•\nAcquired in-process research & development expense of $1.25 billion to secure the global rights to the NM26 bispecific antibody (Yellow Jersey acquisition) and pipeline advancement in the Innovative Medicine business\n•\nAcquired in-process research & development expense of $0.5 billion from the V-Wave acquisition in the MedTech business\nIn-Process Research and Development Impairments (IPR&D): \nIn the fiscal year 2024, the Company recorded a charge of approximately $0.2 billion associated with the M710 (biosimilar) asset acquired as part of the acquisition of Momenta Pharmaceuticals in 2020. There was also a partial impairment of this asset for $0.2 billion in the fiscal 2023. This asset is now fully impaired.\nOther (Income) Expense, Net:\n Other (income) expense, net is the account where the Company records gains and losses related to the sale and write-down of certain investments in equity securities held by Johnson & Johnson Innovation - JJDC, Inc. (JJDC), changes in the fair value of securities, investment (income)/loss related to employee benefit programs, gains and losses on divestitures, certain transactional currency gains and losses, acquisition and divestiture related costs, litigation accruals and settlements, as well as royalty income.\n30\n \n \nOther (income) expense, net for the fiscal year 2024 reflected less expense of $1.9 billion as compared to the prior year primarily due to the following:\n(Dollars in Billions)(Income)/Expense\n2024\n2023\nChange\nLitigation related\n(1)\n$5.5\n6.9\n(1.4)\nAcquisition, Integration and Divestiture related\n(2)\n0.8\n0.3\n0.5\nChanges in the fair value of securities\n(3)\n0.3\n0.6\n(0.3)\nCOVID-19 vaccine manufacturing exit related costs\n0.1\n0.4\n(0.3)\nMonetization of royalty rights\n(0.3)\n0.0\n(0.3)\nEmployee benefit plan related\n(0.9)\n(1.4)\n0.5\nOther\n(0.8)\n(0.2)\n(0.6)\nTotal Other (Income) Expense, Net\n$4.7\n6.6\n(1.9)\n(1)\nThe fiscal years 2024 and 2023 include charges primarily for talc matters (See Note 19 to the Consolidated Financial Statements for more details). The fiscal year 2023 includes favorable intellectual property related litigation settlements of approximately $0.3 billion.\n(2)\nThe fiscal year 2024 is primarily related to the acquisition of Shockwave. The fiscal year 2023 is primarily related to the impairment of Ponvory and one-time integration costs related to the acquisition of Abiomed. \n(3)\nThe fiscal year 2024 includes the loss of $0.4 billion on the completion of the debt for equity exchange of the retained stake in Kenvue. The fiscal year 2023 includes $0.4 billion related to the unfavorable change in the fair value of the remaining stake in Kenvue and $0.4 billion related to the partial impairment of Idorsia convertible debt and the change in the fair value of the Idorsia equity securities held.\nInterest (Income) Expense:\n Interest income in the fiscal years 2024 and 2023 was $1.3 billion. Interest expense in the fiscal years 2024 and 2023 was $0.8 billion. Cash, cash equivalents and marketable securities totaled $24.5 billion at the end of 2024, and averaged $23.7 billion as compared to the cash, cash equivalents and marketable securities total of $22.9 billion and $22.6 billion average balance in 2023. The total debt balance at the end of 2024 was $36.6 billion with an average debt balance of $33.0 billion as compared to $29.3 billion at the end of 2023 and an average debt balance of $34.5 billion. The higher debt balance was due to the senior unsecured notes issued by the Company in the fiscal second quarter of 2024. The net proceeds from this offering were used to fund the Shockwave acquisition which closed on May 31, 2024 and for general corporate purposes. \nIncome before tax by segment\nIncome (loss) before tax by segment of business were as follows:\n \nIncome Before Tax\nSegment Sales\nPercent of Segment\nSales\n(Dollars in Millions)\n2024\n2023\n2024\n2023\n2024\n2023\nInnovative Medicine\n$18,919\n18,246\n56,964\n54,759\n33.2 \n%\n33.3 \nMedTech\n3,740\n4,669\n31,857\n30,400\n11.7 \n15.4 \nSegment earnings before tax\n(1)\n22,659\n22,915\n88,821\n85,159\n25.5 \n26.9 \nLess: Expenses not allocated to segments\n(2)\n5,972\n7,853\nWorldwide income before tax\n$16,687\n15,062\n88,821\n85,159\n18.8 \n%\n17.7 \n(1)\nSee Note 17 to the Consolidated Financial Statements for more details.\n(2)\nAmounts not allocated to segments include interest (income) expense and general corporate (income) expense. The fiscal years 2024 and 2023 include charges for talc matters of approximately $5.1 billion and $7.0 billion, respectively. The fiscal 2024 includes a loss of approximately $0.4 billion related to the debt to equity exchange of the Company's remaining shares of Kenvue Common Stock. The fiscal year 2023 includes an approximately $0.4 billion unfavorable change in the fair value of the retained stake in Kenvue.\n2024 Annual Report\n31\nInnovative Medicine segment:\nIn 2024, the Innovative Medicine segment income before tax as a percent to sales was 33.2% versus 33.3% in 2023. The decrease in the income before tax as a percent of sales was primarily driven by the following:\n•\nAcquired in-process research and development expense of $1.25 billion to secure the global rights to the NM26 bispecific antibody\n•\nLitigation expense of $0.4 billion in 2024, primarily related to Risperdal Gynecomastia, versus favorable litigation related items of $0.1 billion in 2023\n•\nIncreased research and development to advance the pipeline\n•\nIncreased commercial investment in selling and marketing expenses\npartially offset by \n•\nMonetization of royalty rights of $0.3 billion in 2024\n•\nLower one-time COVID-19 Vaccine related exit costs of $0.1 billion in 2024 versus $0.7 billion in 2023\n•\nLower amortization expense of $0.2 billion in 2024 versus 2023 \n•\nRestructuring charges of $0.1 billion in 2024 versus $0.5 billion in 2023\n•\nA gain of $0.1 billion in 2024 as compared to a loss of $0.4 billion in 2023 related to changes in the fair value of securities\nMedTech segment:\nIn 2024, the MedTech segment income before tax as a percent to sales was 11.7% versus 15.4% in 2023. The decrease in the income before tax as a percent to sales was primarily driven by the following:\n•\nAcquisition and integration related costs of $1.0 billion in 2024 (primarily related to the Shockwave acquisition) versus $0.2 billion in 2023 related to Abiomed\n•\nAcquired in-process research and development expense of $0.5 billion from the V-Wave acquisition in 2024\n•\nHigher amortization expense of $0.2 billion in 2024 related to Shockwave\npartially offset by\n•\nA gain of $0.2 billion related to the Acclarent divestiture in 2024\n•\nRestructuring related charge of $0.2 billion in 2024 versus $0.3 billion in 2023\nRestructuring:\n In the fiscal year 2023, the Company completed a prioritization of its research and development (R&D) investment within the Innovative Medicine segment to focus on the most promising medicines with the greatest benefit to patients. This resulted in the exit of certain programs within therapeutic areas. The R&D program exits are primarily in infectious diseases and vaccines including the discontinuation of its respiratory syncytial virus (RSV) adult vaccine program, hepatitis and HIV development. The pre-tax restructuring charge of approximately $0.1 billion in the fiscal year 2024 was recorded in Restructuring on the Consolidated Statement of Earnings, and included the termination of partnered and non-partnered development program costs, asset impairments and asset divestments. The pre-tax restructuring charge of approximately $0.5 billion in the fiscal year 2023, of which $449 million was recorded in Restructuring and $30 million was recorded in Cost of products sold on the Consolidated Statement of Earnings, and included the termination of partnered and non-partnered program costs and asset impairments. Total project costs of approximately $0.6 billion have been recorded since the restructuring was announced. The program was completed in the fiscal fourth quarter of 2024.\n32\n \n \nIn the fiscal year 2023, the Company initiated a restructuring program of its Orthopaedics franchise within the MedTech segment to streamline operations by exiting certain markets, product lines and distribution network arrangements. The pre-tax restructuring expense of $0.2 billion in the fiscal year 2024, of which $132 million was recorded in Restructuring and $35 million was recorded in Cost of products sold on the Consolidated Statement of Earnings, primarily included costs related to market and product exits. The pre-tax restructuring expense of $0.3 billion in the fiscal year 2023, of which $40 million was recorded in Restructuring and $279 million was recorded in Cost of products sold on the Consolidated Statement of Earnings, primarily included inventory and instrument charges related to market and product exits. Total project costs of approximately $0.5 billion have been recorded since the restructuring was announced. \nSee Note 20 to the Consolidated Financial Statements for additional details related to the restructuring programs.\nProvision for Taxes on Income:\n The worldwide effective income tax rate from continuing operations was 15.7% in 2024 and 11.5% in 2023. For discussion related to the fiscal year 2024 provision for taxes refer to Note 8 to the Consolidated Financial Statements. \nOn December 15, 2022, the European Union (EU) Member States formally adopted the EU’s Pillar Two Directive, which generally provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Co-operation and Development (OECD) Pillar Two Framework that was supported by over 130 countries worldwide. Several EU and non-EU countries have enacted Pillar Two legislation with an initial effective date of January 1, 2024, with other aspects of the law effective in 2025 or later. In the fiscal year 2024, the net impact of Pillar Two legislation was less than 1.0% to the Company’s effective tax rate. While countries continue to enact new provisions or issue new regulations, based on current guidance, the Company expects the net impact of Pillar Two in fiscal year 2025 to be up to 1.0% to the Company’s effective tax rate.\nLiquidity and capital resources\nLiquidity & cash flows\nCash and cash equivalents were $24.1 billion at the end of 2024 as compared to $21.9 billion at the end of 2023. \nThe primary sources and uses of cash that contributed to the $2.2 billion increase were:\n(Dollars in billions)\n$21.9\nQ4 2023 Cash and cash equivalents balance\n24.3\ncash generated from operating activities\n(18.6)\nnet cash used by investing activities\n(3.1)\nnet cash used by financing activities\n(0.4)\neffect of exchange rate and rounding\n$24.1\nQ4 2024 Cash and cash equivalents balance\nIn addition, the Company had $0.4 billion in marketable securities at the end of fiscal year 2024 and $1.1 billion at the end of fiscal year 2023. See Note 1 to the Consolidated Financial Statements for additional details on cash, cash equivalents and marketable securities.\nCash flow from operations of $24.3 billion was the result of:\n(Dollars In billions)\n$14.1\nNet Earnings\n8.4\nnon-cash expenses and other adjustments primarily for depreciation and amortization, stock-based compensation, asset write-downs and charges for acquired in-process research and development assets partially offset by net gain on sale of assets/businesses and the deferred tax provision\n1.7\na decrease in other current and non-current assets\n1.6\nan increase in accounts payable and accrued liabilities \n(1.5)\nan increase in accounts receivable and inventories \n$24.3\nCash flow from operations\n2024 Annual Report\n33\nCash flow used for investing activities of $18.6 billion was primarily due to:\n(Dollars in billions)\n$(4.4)\nadditions to property, plant and equipment\n(15.1)\nacquisitions, net of cash acquired\n0.7\nproceeds from the disposal of assets/businesses, net\n(1.8)\nacquired in-process research and development assets\n0.7\nnet sales of investments\n1.5\ncredit support agreements activity, net\n(0.2)\nother (including capitalized licenses and milestones)\n$(18.6)\nNet cash used for investing activities\nCash flow used for financing activities of $3.1 billion was primarily due to: \n(Dollars in billions)\n$(11.8)\ndividends to shareholders \n(2.4)\nrepurchase of common stock\n11.0\nnet proceeds from short and long-term debt\n0.8\nproceeds from stock options exercised/employee withholding tax on stock awards, net\n0.3\ncredit support agreements activity, net\n(1.0)\nsettlement of convertible debt acquired from Shockwave\n$(3.1)\nNet cash used for financing activities\nThe following table summarizes cash taxes paid net of refunds: \n(Dollars in Millions)\n2024\n2023\n2022\nU.S. Federal \n(1)\n$3,815\n4,722\n2,158\nU.S. State and Local taxes\n341\n236\n216\nTotal U.S.\n$4,156\n4,958\n2,374\nTotal Foreign\n2,558\n3,616\n2,849\nTotal cash taxes paid net of refunds\n$6,714\n$8,574\n$5,223\n(1)\nIncludes TCJA foreign undistributed earnings payments of $2.0 billion in fiscal year 2024, $1.5 billion in fiscal year 2023 and $0.8 billion in fiscal year 2022\nAs of December 29, 2024, the Company's notes payable and long-term debt was in excess of cash, cash equivalents and marketable securities. As of December 29, 2024, the net debt position was $12.1 billion as compared to the prior year of $6.4 billion. The debt balance at the end of 2024 was $36.6 billion as compared to $29.3 billion in 2023. In the fiscal second quarter of 2024, the Company issued senior unsecured notes for a total of $6.7 billion. For additional details on borrowings, see Note 7 to the Consolidated Financial Statements. The net proceeds from this offering were used to fund the Shockwave acquisition which closed on May 31, 2024, and for general corporate purposes. Considering recent market conditions, the Company has re-evaluated its operating cash flows and liquidity profile and does not foresee any significant incremental risk. The Company anticipates that operating cash flows, the ability to raise funds from external sources, borrowing capacity from existing committed credit facilities and access to the commercial paper markets will continue to provide sufficient resources to fund operating needs, including the Company's remaining balance to be paid on the agreement to settle opioid litigation for approximately $1.5 billion and the approximately $11.6 billion ($13.5 billion nominal) reserve for talc matters (See Note 19 to the Consolidated Financial Statements for additional details). In addition, the Company monitors the global capital markets on an ongoing basis and from time to time may raise capital when market conditions are favorable. \nOn May 8, 2023, Kenvue, completed an initial public offering (the IPO) resulting in the issuance of 198,734,444 shares of its common stock, par value $0.01 per share (the Kenvue Common Stock), at an initial public offering of $22.00 per share for net proceeds of $4.2 billion. The excess of the net proceeds from the IPO over the net book value of the Johnson & Johnson \n34\n \n \ndivested interest was $2.5 billion and was recorded to additional paid-in capital. As of the closing of the IPO, Johnson & Johnson owned approximately 89.6% of the total outstanding shares of Kenvue Common Stock and at July 2, 2023, the non-controlling interest of $1.3 billion associated with Kenvue was reflected in equity attributable to non-controlling interests in the consolidated balance sheet. \nOn August 23, 2023, Johnson & Johnson completed the disposition of an additional 80.1% ownership of Kenvue Common Stock through an exchange offer, which resulted in Johnson & Johnson acquiring 190,955,436 shares of the Company’s common stock in exchange for 1,533,830,450 shares of Kenvue Common Stock. The $31.4 billion of Johnson & Johnson common stock received in the exchange offer is recorded in Treasury stock. Following the exchange offer, the Company owned 9.5% of the total outstanding shares of Kenvue Common Stock that was recorded in other assets within continuing operations at the fair market value of $4.3 billion as of August 23, 2023 and $3.9 billion as of December 31, 2023.\nJohnson & Johnson divested net assets of $11.6 billion as of August 23, 2023, and the accumulated other comprehensive loss attributable to the Consumer Health business at that date was $4.3 billion. Additionally, at the date of the exchange offer, Johnson & Johnson decreased the non-controlling interest by $1.2 billion to record the deconsolidation of Kenvue. This resulted in a gain on the exchange offer of $21.0 billion that was recorded in Net earnings from discontinued operations, net of taxes in the consolidated statements of earnings for the fiscal third quarter of 2023. This one-time gain includes a gain of $2.8 billion on the Kenvue Common Stock retained by Johnson & Johnson. The gain on the exchange offer qualifies as a tax-free transaction for U.S. federal income tax purposes.\nOn May 15, 2024, the Company issued $3.6 billion aggregate principal amount of commercial paper and received $3.6 billion of net cash proceeds to be used for general corporate purposes. On May 17, 2024, the Company completed a Debt-for-Equity Exchange of its remaining 182,329,550 shares of Kenvue Common Stock for the outstanding Commercial Paper. Upon completion of the Debt-for-Equity Exchange, the Commercial Paper was satisfied and discharged and the Company no longer owns any shares of Kenvue Common Stock. This exchange resulted in a loss of approximately $0.4 billion recorded in Other (income) expense.\nThe following table summarizes the Company’s material contractual obligations and their aggregate maturities as of December 29, 2024: To satisfy these obligations, the Company intends to use cash from operations.\n(Dollars in Millions)\nTax Legislation\n(TCJA)\nDebt Obligations\nInterest on\nDebt Obligations\nTotal\n2025\n$2,536\n1,749\n1,075\n5,360\n2026\n—\n1,999\n1,030\n3,029\n2027\n—\n2,385\n1,021\n3,406\n2028\n—\n2,275\n977\n3,252\n2029\n—\n1,444\n922\n2,366\nAfter 2029\n—\n22,548\n8,921\n31,469\nTotal\n$2,536\n32,400\n13,946\n48,882\nFor tax matters, see Note 8 to the Consolidated Financial Statements. For the proposed talc settlement payments, see Note 19 to the Consolidated Financial Statements.\n2024 Annual Report\n35\nFinancing and market risk\nThe Company uses financial instruments to manage the impact of foreign exchange rate changes on cash flows. Accordingly, the Company enters into forward foreign exchange contracts to protect the value of certain foreign currency assets and liabilities and to hedge future foreign currency transactions primarily related to product costs. Gains or losses on these contracts are offset by the gains or losses on the underlying transactions. A 10% appreciation of the U.S. Dollar from the December 29, 2024 market rates would increase the unrealized value of the Company’s forward contracts by $0.2 billion. Conversely, a 10% depreciation of the U.S. Dollar from the December 29, 2024 market rates would decrease the unrealized value of the Company’s forward contracts by $0.2 billion. In either scenario, the gain or loss on the forward contract would be offset by the gain or loss on the underlying transaction, and therefore, would have no impact on future anticipated earnings and cash flows.\nThe Company hedges the exposure to fluctuations in currency exchange rates, and the effect on certain assets and liabilities in foreign currency, by entering into currency swap contracts. A 1% change in the spread between U.S. and foreign interest rates on the Company’s interest rate sensitive financial instruments would either increase or decrease the unrealized value of the Company’s swap contracts by approximately $1.5 billion. In either scenario, at maturity, the gain or loss on the swap contract would be offset by the gain or loss on the underlying transaction, and therefore, would have no impact on future anticipated cash flows.\nThe Company does not enter into financial instruments for trading or speculative purposes. Further, the Company has a policy of only entering into contracts with parties that have at least an investment grade credit rating. The counterparties to these contracts are major financial institutions and there is no significant concentration of exposure with any one counterparty. Management believes the risk of loss is remote. The Company entered into credit support agreements (CSA) with certain derivative counterparties establishing collateral thresholds based on respective credit ratings and netting agreements. See Note 6 to the Consolidated Financial Statements for additional details on credit support agreements.\nThe Company invests in both fixed rate and floating rate interest earning securities which carry a degree of interest rate risk. The fair market value of fixed rate securities may be adversely impacted due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. A 1% (100 basis points) change in spread on the Company’s interest rate sensitive investments would either increase or decrease the unrealized value of cash equivalents and current marketable securities by less than $8.0 million. \nThe Company has access to substantial sources of funds at numerous banks worldwide. In June 2024, the Company secured a new 364-day Credit Facility of $10 billion, which expires on June 25, 2025. Interest charged on borrowings under the credit line agreement is based on either Secured Overnight Financing Rate (SOFR) Reference Rate or other applicable market rate as allowed plus applicable margins. Commitment fees under the agreement are not material.\nTotal borrowings at the end of 2024 and 2023 were $36.6 billion and $29.3 billion, respectively. The increase in the borrowings was due to the issuance of new debt in 2024. In 2024, net debt (cash and current marketable securities, net of debt) was $12.1 billion compared to net debt of $6.4 billion in 2023. Total debt represented 34.0% of total capital (shareholders’ equity and total debt) in 2024 and 30.0% of total capital in 2023. Shareholders’ equity per share at the end of 2024 was $29.70 compared to $28.57 at year-end 2023.\nA summary of borrowings can be found in Note 7 to the Consolidated Financial Statements.\nDividends\nThe Company increased its dividend in 2024 for the 62\nnd\n consecutive year. Cash dividends paid were $4.91 per share in 2024 and $4.70 per share in 2023. \nOn January 2, 2025, the Board of Directors declared a regular cash dividend of $1.24 per share, payable on March 4, 2025 to shareholders of record as of February 18, 2025.\n36\n \n \nOther information\nCritical accounting policies and estimates\nManagement’s discussion and analysis of results of operations and financial condition are based on the Company’s consolidated financial statements that have been prepared in accordance with accounting principles generally accepted in the U.S. (GAAP). The preparation of these financial statements requires that management make estimates and assumptions that affect the amounts reported for revenues, expenses, assets, liabilities and other related disclosures. Actual results may or may not differ from these estimates. The Company believes that the understanding of certain key accounting policies and estimates are essential in achieving more insight into the Company’s operating results and financial condition. These key accounting policies include revenue recognition, income taxes, legal and self-insurance contingencies, valuation of long-lived assets, assumptions used to determine the amounts recorded for pensions and other employee benefit plans and accounting for stock based awards.\nRevenue Recognition:\n The Company recognizes revenue from product sales when obligations under the terms of a contract with the customer are satisfied; generally, this occurs with the transfer of control of the goods to customers. The Company's global payment terms are typically between 30 to 90 days. Provisions for certain rebates, sales incentives, trade promotions, coupons, product returns, discounts to customers and governmental clawback provisions are accounted for as variable consideration and recorded as a reduction in sales.\nProduct discounts granted are based on the terms of arrangements with direct, indirect and other market participants, as well as market conditions, including consideration of competitor pricing. Rebates and discounts are estimated based on contractual terms, historical experience, patient outcomes, trend analysis and projected market conditions in the various markets served. The Company evaluates market conditions for products or groups of products primarily through the analysis of wholesaler and other third-party sell-through and market research data, as well as internally generated information.\nSales returns are estimated and recorded based on historical sales and returns information. Products that have lost patent exclusivity, or that otherwise exhibit unusual sales or return patterns due to dating, competition or other marketing matters are specifically investigated and analyzed as part of the accounting for sales return accruals.\nSales returns allowances represent a reserve for products that may be returned due to expiration, destruction in the field, or in specific areas, product recall. In accordance with the Company’s accounting policies, the Company generally issues credit to customers for returned goods. The Company’s sales returns reserves are accounted for in accordance with the U.S. GAAP guidance for revenue recognition when right of return exists. Sales returns reserves are recorded at full sales value. Sales returns in the Innovative Medicine segment are almost exclusively not resalable. Sales returns for certain franchises in the MedTech segment are typically resalable but are not material. The Company infrequently exchanges products from inventory for returned products. The sales returns reserve for the total Company has been approximately 1.0% of annual net trade sales during the fiscal years 2024, 2023 and 2022.\nPromotional programs, such as product listing allowances are recorded in the same period as related sales and include volume-based sales incentive programs. Volume-based incentive programs are based on the estimated sales volumes for the incentive period and are recorded as products are sold. These arrangements are evaluated to determine the appropriate amounts to be deferred or recorded as a reduction of revenue. The Company also earns profit-share payments through collaborative arrangements of certain products, which are included in sales to customers. Profit-share payments were less than 2.0% of the total revenues in fiscal year 2024 and 2023, respectively, and less than 3.0% of the total revenues in the fiscal year 2022 and are included in sales to customers.\nIn addition, the Company enters into collaboration arrangements that contain multiple revenue generating activities. Amounts due from collaborative partners for these arrangements are recognized as each activity is performed or delivered, based on the relative selling price. Upfront fees received as part of these arrangements are deferred and recognized over the performance period. See Note 1 to the Consolidated Financial Statements for additional disclosures on collaborations.\nReasonably likely changes to assumptions used to calculate the accruals for rebates, returns and promotions are not anticipated to have a material effect on the financial statements. The Company currently discloses the impact of changes to assumptions in the quarterly or annual filing in which there is a material financial statement impact.\n2024 Annual Report\n37\nBelow are tables that show the progression of accrued rebates, returns, promotions, reserve for doubtful accounts and reserve for cash discounts by segment of business for the fiscal years ended December 29, 2024 and December 31, 2023.\nInnovative Medicine segment\n(Dollars in Millions)\nBalance at\nBeginning\nof Period\nAccruals\nPayments/\nCredits\n(2)\nBalance at\nEnd of\nPeriod\n2024\n \n \n \n \nAccrued rebates \n(1)\n$14,661\n52,786\n(51,667)\n15,780\nAccrued returns\n634\n845\n(355)\n1,124\nAccrued promotions\n6\n3\n(6)\n3\nSubtotal\n$15,301\n53,634\n(52,028)\n16,907\nReserve for doubtful accounts\n33\n14\n(6)\n41\nReserve for cash discounts\n111\n1,493\n(1,495)\n109\nTotal\n$15,445\n55,141\n(53,529)\n17,057\n2023\n \n \n \n \nAccrued rebates \n(1)\n$12,289\n47,523\n(45,151)\n14,661\nAccrued returns\n649\n332\n(347)\n634\nAccrued promotions\n1\n12\n(7)\n6\nSubtotal\n$12,939\n47,867\n(45,505)\n15,301\nReserve for doubtful accounts\n44\n0\n(11)\n33\nReserve for cash discounts\n110\n1,386\n(1,385)\n111\nTotal\n$13,093\n49,253\n(46,901)\n15,445\n(1)\nIncludes reserve for customer rebates of $187 million at December 29, 2024 and $165 million at December 31, 2023, recorded as a contra asset. \n(2)\nIncludes prior period adjustments\n38\n \n \nMedTech segment\n(Dollars in Millions)\nBalance at\nBeginning of\nPeriod\nAccruals\nPayments/\nCredits\nBalance at\nEnd of\nPeriod\n2024\n \n \n \n \nAccrued rebates\n(1)\n$1,455\n5,955\n(5,986)\n1,424\nAccrued returns\n125\n543\n(550)\n118\nAccrued promotions\n25\n62\n(65)\n22\nSubtotal\n$1,605\n6,560\n(6,601)\n1,564\nReserve for doubtful accounts\n133\n31\n(38)\n126\nReserve for cash discounts\n5\n92\n(91)\n6\nTotal\n$1,743\n6,683\n(6,730)\n1,696\n2023\n \n \n \n \nAccrued rebates\n(1)\n$1,470\n6,241\n(6,256)\n1,455\nAccrued returns\n134\n555\n(564)\n125\nAccrued promotions\n43\n74\n(92)\n25\nSubtotal\n$1,647\n6,870\n(6,912)\n1,605\nReserve for doubtful accounts\n125\n33\n(25)\n133\nReserve for cash discounts\n9\n96\n(100)\n5\nTotal\n$1,781\n6,999\n(7,037)\n1,743\n(1)\nIncludes reserve for customer rebates of $704 million at December 29, 2024 and $740 million at December 31, 2023, recorded as a contra asset.\nIncome Taxes:\n Income taxes are recorded based on amounts refundable or payable for the current year and include the results of any difference between U.S. GAAP accounting and tax reporting, recorded as deferred tax assets or liabilities. The Company estimates deferred tax assets and liabilities based on enacted tax regulations and rates. Future changes in tax laws and rates may affect recorded deferred tax assets and liabilities.\nThe Company has unrecognized tax benefits for uncertain tax positions. The Company follows U.S. GAAP, which prescribes a recognition threshold and measurement attribute for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. Management believes that changes in these estimates would not have a material effect on the Company's results of operations, cash flows or financial position.\nThe Company has recorded deferred tax liabilities on all undistributed earnings prior to December 31, 2017 from its international subsidiaries. The Company has not provided deferred taxes on the undistributed earnings subsequent to January 1, 2018 from certain international subsidiaries where the earnings are considered to be indefinitely reinvested. The Company intends to continue to reinvest these earnings in those international operations. If the Company decides at a later date to repatriate these earnings to the U.S., the Company would be required to provide for the net tax effects on these amounts. The Company estimates that the tax effect of this repatriation would be approximately $0.5 billion under currently enacted tax laws and regulations and at current currency exchange rates. This amount does not include the possible benefit of U.S. foreign tax credits, which may substantially offset this cost.\nSee Note 1 and Note 8 to the Consolidated Financial Statements for further information regarding income taxes.\nLegal and Self Insurance Contingencies: \nThe Company records accruals for various contingencies, including legal proceedings and product liability claims as these arise in the normal course of business. The accruals are based on management’s judgment as to the probability of losses and, where applicable, actuarially determined estimates. The Company has self insurance through a wholly-owned captive insurance company. In addition to accruals in the self insurance program, claims that exceed the insurance coverage are accrued when losses are probable and amounts can be reasonably estimated. \nThe Company follows the provisions of U.S. GAAP when recording litigation related contingencies. A liability is recorded when a loss is probable and can be reasonably estimated. \n2024 Annual Report\n39\nSee Notes 1 and 19 to the Consolidated Financial Statements for further information regarding product liability and legal proceedings.\nLong-Lived and Intangible Assets:\n The Company assesses changes, both qualitatively and quantitatively, in economic conditions and makes assumptions regarding estimated future cash flows in evaluating the value of the Company’s property, plant and equipment, goodwill and intangible assets. As these assumptions and estimates may change over time, it may or may not be necessary for the Company to record impairment charges.\nEmployee Benefit Plans:\n The Company sponsors various retirement and pension plans, including defined benefit, defined contribution and termination indemnity plans, which cover most employees worldwide. These plans are based on assumptions for the discount rate, expected return on plan assets, mortality rates, expected salary increases, healthcare cost trend rates and attrition rates. See Note 10 to the Consolidated Financial Statements for further details on these rates.\nStock Based Compensation:\n The Company recognizes compensation expense associated with the issuance of equity instruments to employees for their services. Based on the type of equity instrument, the fair value is estimated on the date of grant using either the Black-Scholes option valuation model or a combination of both the Black-Scholes option valuation model and Monte Carlo valuation model, and is expensed in the financial statements over the service period. The input assumptions used in determining fair value are the expected life, expected volatility, risk-free rate and expected dividend yield. For performance share units, the fair market value is calculated for the two component goals at the date of grant: adjusted operational earnings per share and relative total shareholder return. The fair values for the earnings per share goal of each performance share unit was estimated on the date of grant using the fair market value of the shares at the time of the award, discounted for dividends, which are not paid on the performance share units during the vesting period. The fair value for the relative total shareholder return goal of each performance share unit was estimated on the date of grant using the Monte Carlo valuation model. See Note 16 to the Consolidated Financial Statements for additional information.\nNew accounting pronouncements\nRefer to Note 1 to the Consolidated Financial Statements for recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted as of December 29, 2024.\n40\n \n \nEconomic and market factors\nThe Company is aware that its products are used in an environment where, for more than a decade, policymakers, consumers and businesses have expressed concerns about the rising cost of healthcare. In response to these concerns, the Company has a long-standing policy of pricing products responsibly. For the period 2014 - 2024, in the U.S., the weighted average compound annual growth rate of the Company’s net price increases for healthcare products (prescription and over-the-counter drugs, hospital and professional products) was below the U.S. Consumer Price Index (CPI).\nThe Company operates in certain countries where the economic conditions continue to present significant challenges. The Company continues to monitor these situations and take appropriate actions. Inflation rates continue to have an effect on worldwide economies and, consequently, on the way companies operate. The Company has accounted for operations in Argentina, Venezuela, Turkey and Egypt (beginning in the fiscal fourth quarter of 2024) as highly inflationary, as the prior three-year cumulative inflation rate surpassed 100%. This did not have a material impact to the Company's results in the period. In the face of increasing costs, the Company strives to maintain its profit margins through cost reduction programs, productivity improvements and periodic price increases.\nIn July 2023, Janssen Pharmaceuticals, Inc. (Janssen) filed litigation against the U.S. Department of Health and Human Services as well as the Centers for Medicare and Medicaid Services challenging the constitutionality of the IRA's Medicare Drug Price Negotiation Program. The litigation requests a declaration that the IRA violates Janssen’s rights under the First Amendment and the Fifth Amendment to the Constitution and therefore that Janssen is not subject to the IRA’s mandatory pricing scheme. The impact of the IRA on our business and the broader pharmaceutical industry remains uncertain, as litigation filed by Janssen and other pharmaceutical companies remains ongoing and while CMS has publicly announced the maximum fair price for each of the selected drugs, implementation of the program is still in progress. In April 2024, Janssen appealed the district court’s denial of its summary judgment motion to the Third Circuit.\nRussia-Ukraine War\nAlthough the long-term implications of Russia’s invasion of Ukraine are difficult to predict at this time, the financial impact of the conflict in the fiscal year 2024, including accounts receivable or inventory reserves, was not material. As of and for each of the fiscal years ending December 29, 2024 and December 31, 2023, the business of the Company’s Russian subsidiaries represented less than 1% of the Company’s consolidated assets and revenues. The Company does not maintain Ukraine subsidiaries subsequent to the Kenvue separation.\nIn March of 2022, the Company took steps to suspend all advertising, enrollment in clinical trials, and any additional investment in Russia. The Company continues to supply products relied upon by patients for healthcare purposes.\nConflict in the Middle East\nAlthough the long-term implications of the conflict in the Middle East are difficult to predict at this time, the financial impact of the conflict in the fiscal year 2024, including accounts receivable or inventory reserves, was not material. As of and for each of the fiscal years ending December 29, 2024 and December 31, 2023, the business of the Company’s Israel subsidiaries represented 1% of the Company’s consolidated assets and represented less than 1% of revenues.\nThe Company is exposed to fluctuations in currency exchange rates. A 1% change in the value of the U.S. Dollar as compared to all foreign currencies in which the Company had sales, income or expense in 2024 would have increased or decreased the translation of foreign sales by approximately $0.4 billion and net income by approximately $0.1 billion.\nGovernments around the world consider various proposals to make changes to tax laws, which may include increasing or decreasing existing statutory tax rates. In connection with various government initiatives, companies are required to disclose more information to tax authorities on operations around the world, which may lead to greater audit scrutiny of profits earned in other countries. A change in statutory tax rate in any country would result in the revaluation of the Company’s deferred tax assets and liabilities related to that particular jurisdiction in the period in which the new tax law is enacted. This change would result in an expense or benefit recorded to the Company’s Consolidated Statement of Earnings. The Company closely monitors these proposals as they arise in the countries where it operates. Changes to the statutory tax rate may occur at any time, and any related expense or benefit recorded may be material to the fiscal quarter and year in which the law change is enacted. \nThe Company faces various worldwide healthcare changes that may continue to result in pricing pressures that include healthcare cost containment and government legislation relating to sales, promotions, pricing and reimbursement of healthcare products.\n2024 Annual Report\n41\nChanges in the behavior and spending patterns of purchasers of healthcare products and services, including delaying medical procedures, rationing prescription medications, reducing the frequency of physician visits and foregoing healthcare insurance coverage may continue to impact the Company’s businesses.\nThe Company also operates in an environment increasingly hostile to intellectual property rights. Firms have filed Abbreviated New Drug Applications or Biosimilar Biological Product Applications with the U.S. FDA or otherwise challenged the coverage and/or validity of the Company's patents, seeking to market generic or biosimilar forms of many of the Company’s key pharmaceutical products prior to expiration of the applicable patents covering those products. In the event the Company is not successful in defending the patent claims challenged in the resulting lawsuits, generic or biosimilar versions of the products at issue will be introduced to the market, resulting in the potential for substantial market share and revenue losses for those products, and which may result in a non-cash impairment charge in any associated intangible asset. There is also a risk that one or more competitors could launch a generic or biosimilar version of the product at issue following regulatory approval even though one or more valid patents are in place.\nLegal proceedings\nJohnson & Johnson and certain of its subsidiaries are involved in various lawsuits and claims regarding product liability, intellectual property, commercial, employment, indemnification and other matters; governmental investigations; and other legal proceedings that arise from time to time in the ordinary course of business.\nThe Company records accruals for loss contingencies associated with these legal matters when it is probable that a liability will be incurred and the amount of the loss can be reasonably estimated. As of December 29, 2024, the Company has determined that the liabilities associated with certain litigation matters are probable and can be reasonably estimated. The Company has accrued for these matters and will continue to monitor each related legal issue and adjust accruals as might be warranted based on new information and further developments in accordance with ASC 450-20-25, Contingencies. For these and other litigation and regulatory matters discussed below for which a loss is probable or reasonably possible, the Company is unable to estimate the possible loss or range of loss beyond the amounts accrued. Amounts accrued for legal contingencies often result from a complex series of judgments about future events and uncertainties that rely heavily on estimates and assumptions including timing of related payments. The ability to make such estimates and judgments can be affected by various factors including, among other things, whether damages sought in the proceedings are unsubstantiated or indeterminate; scientific and legal discovery has not commenced or is not complete; proceedings are in early stages; matters present legal uncertainties; there are significant facts in dispute; procedural or jurisdictional issues; the uncertainty and unpredictability of the number of potential claims; ability to achieve comprehensive multi-party settlements; complexity of related cross-claims and counterclaims; and/or there are numerous parties involved. To the extent adverse awards, judgments or verdicts have been rendered against the Company, the Company does not record an accrual until a loss is determined to be probable and can be reasonably estimated.\nIn the Company's opinion, based on its examination of these matters, its experience to date and discussions with counsel, the ultimate outcome of legal proceedings, net of liabilities accrued in the Company's balance sheet, is not expected to have a material adverse effect on the Company's financial position. However, the resolution of, or increase in accruals for, one or more of these matters in any reporting period may have a material adverse effect on the Company's results of operations and cash flows for that period.\nSee Note 19 to the Consolidated Financial Statements included in Item 8 of this report for further information regarding legal proceedings.\nCommon stock\nThe Company’s Common Stock is listed on the New York Stock Exchange under the symbol JNJ. As of February 6, 2025, there were 114,147 record holders of Common Stock of the Company.",
  "item2": null
}