{
  "source_file": "kdp-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with our audited consolidated financial statements and notes thereto in our Annual Report.\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act, including, in particular, statements about the impact of future events, future financial performance, plans, strategies, business combinations, expectations, prospects, competitive environment, regulation, labor matters, supply chain issues, tariffs or trade wars and related uncertainty, inflation, and availability of raw materials. Forward-looking statements include all statements that are not historical facts and can be identified by the use of forward-looking terminology such as \"outlook,\" \"guidance,\" \"anticipate,\" \"enable,\" \"expect,\" \"believe,\" \"could,\" \"confident,\" \"estimate,\" \"feel,\" \"continue,\" \"ongoing,\" \"forecast,\" \"intend,\" \"may,\" \"on track,\" \"plan,\" \"positioned,\" \"potential,\" \"project,\" \"should,\" \"target,\" \"will,\" \"would,\" and similar words, phrases, or expressions and variations or negatives of these words in this Quarterly Report on Form 10-Q. We have based these forward-looking statements on our current views with respect to future events and financial performance.\nOur actual financial performance could differ materially from those projected in the forward-looking statements due to a variety of factors, including the inherent uncertainty of estimates, forecasts, and projections; global economic uncertainty or economic downturns; tariffs or the imposition of new tariffs, trade wars, barriers, or restrictions, or threats of such actions and related uncertainty; the risk that our financial performance may be better or worse than anticipated; the possibility that we are unable to successfully integrate GHOST into our business; risks related to the completion of the JDE Peet's Acquisition, the Preferred Investment, the JV Investment, or the Separation in the anticipated timeframe, or at all; additional risks associated with the JDE Peet's Acquisition and those geographies where JDE Peet's currently operates; our ability to successfully integrate JDE Peet's into our business, or that such integration may be more difficult, time-consuming, or costly than expected; constraints on management's attention to operating and growing our business during the execution of the JDE Peet's Acquisition and the Separation; the potential downgrade of our credit ratings as a result of debt incurred and/or assumed in connection with the JDE Peet's Acquisition; the possibility of negative impacts on business relationships in connection with the JDE Peet's Acquisition and the Separation; the risk that the JDE Peet's Acquisition and the Separation incur significant additional costs; the risk of potential litigation; negative effects of the announcement and pendency of the JDE Peet's Acquisition and the Separation on our share price; and the ability to achieve the anticipated strategic and financial benefits from the Separation. Given these uncertainties, you should not put undue reliance on any forward-looking statements. All of the forward-looking statements are qualified in their entirety by reference to the factors discussed under \"Risk Factors\" in Part I, Item 1A of our Annual Report, as well as our subsequent filings with the SEC. Forward-looking statements represent our estimates and assumptions only as of the date that they were made. We do not undertake any duty to update the forward-looking statements, and the estimates and assumptions associated with them, after the date of this Quarterly Report on Form 10-Q, except to the extent required by applicable securities laws.\nThis Quarterly Report does not constitute an offer, or any solicitation of any offer, to buy or subscribe for any securities in JDE Peet's. Any offer will be made only by means of an offer memorandum approved by the Dutch Authority for the Financial Markets. This Quarterly Report is not for release, publication, or distribution, in whole or in part, in or into, directly or indirectly, in any jurisdiction in which such release, publication, or distribution would be unlawful.\nThis Quarterly Report on Form 10-Q contains the names of some of our owned or licensed trademarks, trade names, and service marks, which we refer to as our brands. All of the product names included in this Quarterly Report on Form 10-Q are either our registered trademarks or those of our licensors.\n33\nTable of Contents\nOVERVIEW\nKDP is a leading beverage company in North America that manufactures, markets, distributes, and sells hot and cold beverages and single serve brewing systems. We have a broad portfolio of iconic beverage brands, including Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, and The Original Donut Shop, as well as the Keurig brewing system. Our beverage brands are some of the most recognized in North America, with significant consumer awareness levels and long histories that evoke strong emotional connections with consumers. We offer more than 125 owned, licensed, and partner brands, as well as powerful distribution capabilities. \nOur three operating and reportable segments are U.S. Refreshment Beverages, U.S. Coffee, and International.\nEXECUTIVE SUMMARY\nResults of Operations\nThird Quarter of 2025 as compared to Third Quarter of 2024\n(in millions, except Diluted EPS)\nKey Events During the Third Quarter of 2025\nAnnouncement of JDE Peet's Acquisition and Intended Separation of Beverage and Coffee Portfolios\nOn August 24, 2025, we entered into the JDE Peet's Acquisition Agreement. Refer to Note 2 of the Notes to our Unaudited Consolidated Financial Statements for additional information.\nOn August 25, 2025, we announced our intention to separate our beverage and coffee portfolios into two independent, publicly traded companies, subsequent to the closure of the JDE Peet's Acquisition. \n34\nTable of Contents\nReferences in tables below to percentage changes that are not meaningful are denoted by \"NM\". \nThird Quarter of 2025 Compared to Third Quarter of 2024 \nConsolidated Operations\n \nThird Quarter\nPercentage Change\n($ in millions, except per share amounts)\n2025\n2024\nNet sales\n$\n4,306\n \n$\n3,891 \n10.7 \n%\nCost of sales\n1,966\n \n1,751 \n12.3 \nGross profit\n2,340\n \n2,140 \n9.3 \nSelling, general, and administrative expenses\n1,344\n \n1,245 \n8.0 \nOther operating expense (income), net\n1\n \n(7)\nNM\nIncome from operations\n995\n \n902 \n10.3 \nInterest expense, net\n188\n \n106 \n77.4 \nOther income, net\n(45)\n(6)\nNM\nIncome before provision for income taxes\n852\n \n802 \n6.2 \nProvision for income taxes\n190\n \n186 \nNM\nNet income\n$\n662\n \n$\n616 \n7.5 \nEarnings per common share:\n \n \n \nBasic\n$\n0.49\n \n$\n0.45 \n8.9 \n%\nDiluted\n0.49\n \n0.45 \n8.9 \nGross margin\n54.3\n \n%\n55.0 \n%\n(70) bps\nOperating margin\n23.1\n \n23.2 \n(10) bps\nEffective tax rate\n22.3\n \n23.2 \n(90) bps\nSales Volume\nPercentage Change\nLRB\n0.3 \n%\nK-Cup pods\n(4.8)\nAppliances\n(24.5)\nNet Sales Drivers\nPercentage Change\nVolume / mix\n(1)\n6.4 \n%\nNet price realization\n4.2 \nFX\n0.1 \nTotal\n10.7 \n%\n(1)\nThe acquisition of GHOST contributed 4.4 percentage points to our consolidated volume / mix growth in the quarter.\n35\nTable of Contents\nGross profit increased 9.3% to $2,340 million for the third quarter of 2025. This performance primarily reflected the gross profit impact of net sales growth (14 percentage points), partially offset by the net impact from changes in ingredients, materials, and productivity, inclusive of tariffs (6 percentage points).\nSG&A expenses increased 8.0% to $1,344 million for the third quarter of 2025, primarily driven by increased transportation and warehousing expenses (2 percentage points) and higher labor costs (2 percentage points).\nIncome from operations increased 10.3% to $995 million for the third quarter of 2025, driven by increased gross profit, partially offset by higher SG&A expenses.\nInterest expense, net increased 77.4% to $188 million for the third quarter of 2025, driven by an unfavorable year-over-year change in unrealized mark-to-market activity (15 percentage points) and increased debt and higher financing costs (4 percentage points).\nOther income, net increased in the third quarter of 2025, reflecting net gains on our investments in unconsolidated affiliates of $30 million and unrealized gains on FX contracts of $28 million related to the JDE Peet's Acquisition, partially offset by an increase of approximately $20 million in our mandatory redemption liability for GHOST.\nThe effective tax rate decreased 90 bps to 22.3% for the third quarter of 2025, compared to 23.2% for the third quarter of 2024, primarily driven by a shift in the mix of income from higher tax jurisdictions to lower tax jurisdictions (110 bps) and a favorable comparison to a true-up of prior year tax provisions in the third quarter of 2024 (60 bps), partially offset by an increase in uncertain tax positions (80 bps).\nNet income increased 7.5%, to $662 million for the third quarter of 2025, primarily driven by increased income from operations.\nDiluted EPS increased 8.9% to $0.49 per diluted share for the third quarter of 2025 as compared to $0.45 in the third quarter of 2024.\n36\nTable of Contents\nResults of Operations by Segment\nThe following tables provide certain results of operations for our reportable segments for the third quarter of 2025 and 2024.\n \nThird Quarter\nPercentage Change\n(in millions)\n2025\n2024\nNet sales\n \n \nU.S. Refreshment Beverages\n$\n2,735\n \n$\n2,390 \n14.4 \n%\nU.S. Coffee\n991\n \n976 \n1.5 \nInternational\n580\n \n525 \n10.5 \nTotal net sales\n$\n4,306\n \n$\n3,891 \n10.7 \nIncome from operations\n \n \nU.S. Refreshment Beverages\n$\n802\n \n$\n722 \n11.1 \n%\nU.S. Coffee\n237\n \n254 \n(6.7)\nInternational\n153\n \n157 \n(2.5)\nUnallocated corporate costs\n(197)\n(231)\n(14.7)\nIncome from operations\n$\n995\n \n$\n902 \n10.3 \nOperating margin\nU.S. Refreshment Beverages\n29.3\n \n%\n30.2 \n%\n(90) bps\nU.S. Coffee\n23.9\n \n26.0 \n(210) bps\nInternational\n26.4\n \n29.9 \n(350) bps\nSales Volumes\nLRB\nK-Cup Pods\nAppliances\nU.S. Refreshment Beverages\n0.7 \n%\n— \n%\n— \n%\nU.S. Coffee\nNM\n(6.5)\n(26.5)\nInternational\n(1.4)\n5.9 \n(2.4)\nNet Sales\nVolume / Mix\n(1)\nNet Price Realization\nFX\nTotal\nU.S. Refreshment Beverages\n11.2 \n%\n3.2 \n%\n— \n%\n14.4 \n%\nU.S. Coffee\n(4.0)\n5.5 \n— \n1.5 \nInternational\n4.0 \n6.1 \n0.4 \n10.5 \n(1)\nThe acquisition of GHOST contributed 7.2 percentage points to our volume / mix growth in U.S. Refreshment Beverages in the quarter.\n37\nTable of Contents\nU.S. Refreshment Beverages\nSales volume increased 0.7% in the third quarter of 2025, led by growth in our energy portfolio, including the acquisition of GHOST, partially offset by softness in our still beverages portfolio.\nNet sales increased 14.4% to $2,735 million for the third quarter of 2025, led by volume / mix growth, including a benefit from the acquisition of GHOST, as well as higher net price realization.\nIncome from operations increased 11.1% to $802 million for the third quarter of 2025. This performance was led by the gross profit impact of net sales growth (26 percentage points), partially offset by increased transportation and warehousing expenses (4 percentage points), a net unfavorable change in ingredients, materials, and productivity, inclusive of tariffs (4 percentage points), higher labor costs (4 percentage points), the impact of a smaller earned equity achievement in 2025 compared to 2024 (1 percentage point) and increases in other manufacturing costs.\nU.S. Coffee\nAppliance volume decreased 26.5%, reflecting price elasticity impacts and continued retailer inventory management. K-Cup pod volume decreased 6.5%, reflecting category elasticity in response to price increases.\nNet sales increased 1.5% to $991 million for the third quarter of 2025, led by favorable net price realization, which was partially offset by unfavorable volume / mix.\nIncome from operations decreased 6.7% to $237 million for the third quarter of 2025, reflecting a net unfavorable change in ingredients, materials, and productivity, inclusive of tariffs (29 percentage points) and increased costs associated with productivity projects (6 percentage points), partially offset by the benefit of favorable net price realization (26 percentage points).\nInternational\nLRB sales volume decreased 1.4%. Appliance volumes decreased 2.4%, and K-Cup pod volumes increased 5.9%.\nNet sales increased 10.5% to $580 million in the third quarter of 2025, reflecting higher net price realization, volume / mix growth, and favorable FX translation.\nIncome from operations decreased 2.5%, to $153 million for the third quarter of 2025, as the benefit from the gross profit impact of the higher net price realization (20 percentage points) was more than offset by a net unfavorable impact from changes in ingredients, materials, and productivity (13 percentage points), increased transportation and warehousing expenses (4 percentage points), and increases in other manufacturing costs.\n38\nTable of Contents\nFirst Nine Months of 2025 Compared to First Nine Months of 2024 \nConsolidated Operations\n \nFirst Nine Months\nPercentage Change\n($ in millions, except per share amounts)\n2025\n2024\nNet sales\n$\n12,104\n \n$\n11,281 \n7.3 \n%\nCost of sales\n5,524\n \n5,029 \n9.8 \nGross profit\n6,580\n \n6,252 \n5.2 \nSelling, general, and administrative expenses\n3,892\n \n3,716 \n4.7 \nOther operating (income) expense, net\n(6)\n8 \nNM\nIncome from operations\n2,694\n \n2,528 \n6.6 \nInterest expense, net\n516\n \n488 \n5.7 \nOther income, net\n(52)\n(28)\nNM\nIncome before provision for income taxes\n2,230\n \n2,068 \n7.8 \nProvision for income taxes\n504\n \n483 \nNM\nNet income\n$\n1,726\n \n$\n1,585 \n8.9 \nEarnings per common share:\n \n \n \nBasic\n$\n1.27\n \n$\n1.16 \n9.5 \n%\nDiluted\n1.27\n \n1.16 \n9.5 \nGross margin\n54.4\n \n%\n55.4 \n%\n(100) bps\nOperating margin\n22.3\n \n22.4 \n(10) bps\nEffective tax rate\n22.6\n \n23.4 \n(80) bps\nSales Volume\nPercentage Change\nLRB\n1.2 \n%\nK-Cup pods\n(4.4)\nAppliances\n(19.2)\nNet Sales Drivers\nPercentage Change\nVolume / mix\n(1)\n5.0 \n%\nNet price realization\n3.1 \nFX\n(0.8)\nTotal\n7.3 \n%\n(1)\nThe acquisition of GHOST contributed 3.8 percentage points to our consolidated volume / mix growth in the first nine months of 2025.\n39\nTable of Contents\nGross profit increased 5.2% to $6,580 million for the first nine months of 2025. This performance primarily reflected the gross profit impact of net sales growth (8 percentage points), partially offset by a net unfavorable impact from changes in ingredients, materials, and productivity, inclusive of tariffs (4 percentage points).\nSG&A expenses increased 4.7% to $3,892 million for the first nine months of 2025, primarily driven by increased transportation and warehousing expenses (4 percentage points) and higher labor costs (1 percentage points).\nIncome from operations increased 6.6% to $2,694 million for the first nine months of 2025, primarily driven by increased gross profit, partially offset by higher SG&A expenses.\nInterest expense, net increased 5.7% to $516 million for the first nine months of 2025, primarily driven by increased debt and higher financing costs (10 percentage points), which was partially offset by a favorable change in unrealized mark-to-market activity (6 percentage points).\nOther income, net increased $24 million in the first nine months of 2025, reflecting net gains on our investments in unconsolidated affiliates of $55 million and unrealized gains on FX contracts of $28 million related to our intended acquisition of JDE Peet's, partially offset by an increase of approximately $60 million in our mandatory redemption liability for GHOST.\nThe effective tax rate decreased 80 bps to 22.6% for the first nine months of 2025, compared to 23.4% in the first nine months of 2024, led by a shift in the mix of income from higher tax jurisdictions to lower tax jurisdictions (140 bps), which was partially offset by an increase in uncertain tax positions (90 bps). \nNet income increased 8.9% to $1,726 million for the first nine months of 2025, driven primarily by increased income from operations.\nDiluted EPS increased 9.5% to $1.27 per diluted share for the first nine months of 2025 as compared to $1.16 in the first nine months of 2024.\n40\nTable of Contents\nResults of Operations by Segment\nThe following tables provide certain results of operations for our reportable segments for the first nine months of 2025 and 2024.\nFirst Nine Months\nPercentage Change\n(in millions)\n2025\n2024\nNet sales\nU.S. Refreshment Beverages\n$\n7,718\n \n$\n6,890 \n12.0 \n%\nU.S. Coffee\n2,816\n \n2,837 \n(0.7)\nInternational\n1,570\n \n1,554 \n1.0 \nTotal net sales\n$\n12,104\n \n$\n11,281 \n7.3 \nIncome from operations\n \n \nU.S. Refreshment Beverages\n$\n2,202\n \n$\n2,054 \n7.2 \n%\nU.S. Coffee\n672\n \n730 \n(7.9)\nInternational\n386\n \n419 \n(7.9)\nUnallocated corporate costs\n(566)\n(675)\n(16.1)\nTotal income from operations\n$\n2,694\n \n$\n2,528 \n6.6 \nOperating margin\nU.S. Refreshment Beverages\n28.5\n \n%\n29.8 \n%\n(130) bps\nU.S. Coffee\n23.9\n \n25.7 \n(180) bps\nInternational\n24.6\n \n27.0 \n(240) bps\nSales Volumes\nLRB\nK-Cup Pods\nAppliances\nU.S. Refreshment Beverages\n1.5 \n%\n— \n%\n— \n%\nU.S. Coffee\nNM\n(5.6)\n(21.1)\nInternational\n(0.2)\n3.1 \n(1.2)\nNet Sales\nVolume / Mix\n(1)\nNet Price Realization\nFX\nTotal\nU.S. Refreshment Beverages\n9.6 \n%\n2.4 \n%\n— \n%\n12.0 \n%\nU.S. Coffee\n(4.3)\n3.6 \n— \n(0.7)\nInternational\n1.9 \n5.2 \n(6.1)\n1.0 \n(1)\nThe acquisition of GHOST contributed 6.3 percentage points to our volume / mix growth in U.S. Refreshment Beverages in the first nine months of 2025.\n41\nTable of Contents\nU.S. Refreshment Beverages\nSales volume increased 1.5% for the first nine months of 2025, led by growth in our energy portfolio, including the acquisition of GHOST, and in carbonated soft drinks. These benefits were partially offset by softness in our still beverages portfolio.\nNet sales increased 12.0% to $7,718 million for the first nine months of 2025, led by volume / mix growth, including a benefit from the acquisition of GHOST, as well as higher net price realization.\nIncome from operations increased 7.2% to $2,202 million for the first nine months of 2025. This performance was led by the gross profit impact of net sales growth (21 percentage points), partially offset by increased transportation and warehousing expenses (6 percentage points), a net unfavorable impact from changes in ingredients, materials, and productivity, inclusive of tariffs (5 percentage points) higher labor costs (3 percentage points), and the impact of a smaller earned equity achievement in 2025 compared to 2024 (2 percentage points).\nU.S. Coffee\nAppliance volume decreased 21.1%, reflecting price elasticity impacts and continued retailer inventory management, and K-Cup pod volume decreased 5.6%, reflecting category elasticity in response to price increases.\nNet sales decreased 0.7% to $2,816 million for the first nine months of 2025, as higher net price realization was more than offset by unfavorable volume / mix.\nIncome from operations decreased 7.9% to $672 million for the first nine months of 2025, driven by a net unfavorable impact from changes in ingredients, materials, and productivity, inclusive of tariffs (19 percentage points) and increased costs associated with productivity projects (6 percentage points), partially offset by the benefit of higher net price realization (14 percentage points).\nInternational\nLRB sales volume was approximately flat. Appliance volumes decreased 1.2% and K-Cup pod volumes increased 3.1%.\nNet sales increased 1.0% to $1,570 million in the first nine months of 2025, reflecting higher net price realization and volume / mix growth, partially offset by unfavorable FX translation.\nIncome from operations decreased 7.9% to $386 million for the first nine months of 2025, as the benefit from the gross profit impact of the higher net price realization and volume/mix growth (23 percentage points) was more than offset by increased transportation and warehousing expenses (8 percentage points), a net unfavorable impact from changes in ingredients, materials, and productivity, inclusive of tariffs (7 percentage points), unfavorable FX impacts (5 percentage points), and increases in other manufacturing costs.\nCRITICAL ACCOUNTING ESTIMATES\nThe process of preparing our consolidated financial statements in conformity with U.S. GAAP requires the use of estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses. Critical accounting estimates are both fundamental to the portrayal of a company's financial condition and results and require difficult, subjective, or complex estimates and assessments. These estimates and judgments are based on historical experience, future expectations, and other factors and assumptions we believe to be reasonable under the circumstances. The most significant estimates and judgments are reviewed on an ongoing basis and revised when necessary. These critical accounting estimates are discussed in greater detail in Part II, Item 7 of our Annual Report.\n42\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nWe believe our financial condition and liquidity remain strong. We continue to manage all aspects of our business, including, but not limited to, monitoring the financial health of our customers, suppliers, and other third-party relationships, implementing gross margin enhancement strategies through our productivity initiatives, and developing new opportunities for growth, such as innovation and agreements with partners to distribute brands that are accretive to our portfolio.\nCash generated by our foreign operations is generally repatriated to the U.S. periodically as working capital funding requirements, where allowed. We do not expect restrictions or taxes on repatriation of cash held outside the U.S. to have a material effect on our overall business, liquidity, financial condition, or results of operations for the foreseeable future.\nJDE Peet's Acquisition\nIn connection with the JDE Peet's Acquisition, we entered into the Bridge Credit Agreement, which provides for a 364-day senior unsecured bridge loan facility in an aggregate amount not to exceed €16.2 billion. We expect to reduce or replace the Bridge Credit Agreement with permanent financing arrangements, which may include issuance of debt securities and other financing options as warranted, prior to the transaction close date. \nAs of September 30, 2025\n, the full amount of this facility remains available and undrawn. Refer to Note 3 of the Notes to our Unaudited Consolidated Financial Statements for additional information.\nOn October 26, 2025, we entered into the JV Commitment Letter, pursuant to the terms of which the JV Investors will make, subject to certain conditions, a strategic minority investment into the Pod Manufacturing JV, for an aggregate purchase price of $4 billion. On October 27, 2025, we entered into the Preferred Investment Agreement. The Preferred Investment Agreement provides for the issuance and sale of 3 million shares of Convertible Preferred Stock for an aggregate purchase price of $3 billion. The closings of the JV Investment and Preferred Investment are expected to occur concurrently with the closing of the JDE Peet's Acquisition, and the proceeds thereof will be used to partially finance the JDE Peet's Acquisition. Refer to Note 18 of the Notes to our Unaudited Consolidated Financial Statements for additional information.\nBridge Credit Agreement\nUpon the closing of the JV Investment and the Preferred Investment, the Bridge Credit Agreement will be reduced by an amount equal to the net proceeds from the JV Investment and Preferred Investment, subject to applicable de minimis exceptions.\n43\nTable of Contents\nPrincipal Sources of Capital Resources\nOur principal sources of liquidity are our existing cash and cash equivalents, cash generated from our operations, and borrowing capacity available under our 2025 Revolving Credit Agreement. Additionally, we have an uncommitted commercial paper program where we can issue unsecured commercial paper notes on a private placement basis. Based on our current and anticipated level of operations, we believe that our operating cash flows will be sufficient to meet our anticipated obligations for the next twelve months and thereafter for the foreseeable future. To the extent that our operating cash flows are not sufficient to meet our liquidity needs, we may utilize cash on hand or amounts available under our financing arrangements. From time to time, we may seek additional deleveraging, refinancing, or liquidity enhancing transactions, including entering into transactions to repurchase or redeem outstanding indebtedness or otherwise seek transactions to reduce interest expense, extend debt maturities, and improve our capital and liquidity structure.\nSources of Liquidity - Operations\nNet cash provided by operating activities decreased $91 million for the first nine months of 2025, as compared to the first nine months of 2024, driven by lower net income adjusted for non-cash items.\nSources of Liquidity - Financing\nRefer to Note 3 of the Notes to our Unaudited Consolidated Financial Statements for management's discussion of our financing arrangements.\nAs of September 30, 2025, we were in compliance with all debt covenants and we have no reason to believe that we will be unable to satisfy these covenants.\nWe also have an active shelf registration statement, filed with the SEC on August 15, 2025, which allows us to issue an indeterminate number or amount of common stock, preferred stock, debt securities, and warrants from time to time in one or more offerings at the direction of our Board.\nCredit Ratings\nOur credit ratings\n \nare as follows:\nRating Agency\nLong-Term Debt Rating\nCommercial Paper Rating\nOutlook\nDate of Last Change\nMoody's\nBaa1\nP-2\nRatings Under Review\nAugust 25, 2025\nS&P\nBBB\nA-2\nWatch Negative\nAugust 25, 2025\nAs a result of our announcement of the JDE Peet's Acquisition, as well as the corresponding Bridge Credit Agreement entered into for this anticipated transaction, Moody's and S&P have revised their outlook on our credit ratings. On August 25, 2025, Moody's placed KDP ratings under review for downgrade, and S&P has placed KDP on CreditWatch Negative.\n44\nTable of Contents\nThese debt and commercial paper ratings impact the interest we pay on our financing arrangements. A downgrade of one or both of our debt and commercial paper ratings could increase our interest expense and decrease the cash available to fund anticipated obligations.\nPrincipal Uses of Capital Resources\nOur capital allocation priorities are investing to grow our business both organically and inorganically, continuing to strengthen our balance sheet, and returning cash to shareholders through regular quarterly dividends and opportunistic share repurchases. We dynamically adjust our cash deployment plans based on the specific opportunities available in a given period, but over time we allocate capital to balance each of these priorities.\nRegular Quarterly Dividends\nWe have declared total dividends of $0.69 per share and $0.66 per share for the first nine months of 2025 and 2024, respectively.\nRepurchases of Common Stock\nOur Board authorized a four-year share repurchase program, ending December 31, 2025, of up to $4 billion of our outstanding common stock. We did not repurchase any common stock during the first nine months of 2025. As of September 30, 2025, $1,810 million \nremained available for repurchase under the authorized share repurchase program.\nCapital Expenditures\nPurchases of property, plant, and equipment were $338 million and $398 million for the first nine months of 2025 and 2024, respectively. \nCapital expenditures, which includes both purchases of property, plant, and equipment and amounts included in accounts payable and accrued expenses, primarily related to investments in manufacturing capabilities, both in the U.S. and internationally, for the first nine months of 2025 and 2024. Capital expenditures included in accounts payable and accrued expenses were  $151 million and $164 million for the first nine months of 2025 and 2024, respectively, which primarily related to these investments.\nInvestments in Unconsolidated Affiliates\nFrom time to time, we expect to invest in beverage startup companies or in brand ownership companies to grow our presence in certain product categories, or enter into various licensing and distribution agreements to expand our product portfolio. Our investments may involve acquiring a minority interest in equity securities of a company, in certain cases with a protected path to ownership at our future option.\nAcquisitions of Businesses and Purchases of Intangible Assets\nWe have invested in the expansion of our distribution network through transactions with strategic independent bottlers or third-party brand ownership companies to ensure competitive distribution scale. Additionally, from time to time, we acquire brand ownership companies to expand our portfolio. These transactions could be accounted for either as an acquisition of a business or as an asset acquisition, if the majority of the transaction price represents the acquisition of a single intangible asset. In the second quarter of 2025, we completed the Dyla acquisition. Refer to Note 2 of the Notes to our Unaudited Consolidated Financial Statements for additional information. Purchases of intangible assets were $16 million and $49 million for the first nine months of 2025 and 2024, respectively. \n45\nTable of Contents\nUncertainties and Trends Affecting Liquidity\nDisruptions in financial and credit markets, including those caused by inflation, global economic uncertainty or economic downturns, fluctuations in interest rates, or the imposition of new tariffs or changes to existing tariffs, trade wars, barriers or restrictions, or threats of such actions, and related uncertainty, may impact our ability to manage normal commercial relationships with our customers, suppliers, and creditors, and may also impact our ability to access liquidity through financial markets in a timely and cost-effective manner. These disruptions could have a negative impact on the ability of our customers to timely pay their obligations to us, thus reducing our cash flow, or the ability of our vendors to timely supply materials.\nCustomer and consumer demand for our products may also be impacted by the risk factors discussed under \"Risk Factors\" in Part 1, Item 1A of our Annual Report, as well as subsequent filings with the SEC, that could have a material effect on production, delivery, and consumption of our products, which could result in a reduction in our sales volume.\nRefer to \"Risk Factors\" in Part II, Item 1A below for additional risks and uncertainties related to the JDE Peet's Acquisition.\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nThe Notes are fully and unconditionally guaranteed by certain of our direct and indirect subsidiaries (the \"Guarantors\"), as defined in the indentures governing the Notes. The Guarantors are 100% owned either directly or indirectly by us and jointly and severally guarantee, subject to the release provisions described below, our obligations under the Notes. None of our subsidiaries organized outside of the U.S., any of the subsidiaries held by Maple Parent Holdings Corp. prior to the DPS Merger, or any of the subsidiaries acquired after the DPS Merger (collectively, the \"Non-Guarantors\") guarantee the Notes. The subsidiary guarantees with respect to the Notes are subject to release upon the occurrence of certain events, including the sale of all or substantially all of a subsidiary's assets, the release of the subsidiary's guarantee of our other indebtedness, our exercise of the legal defeasance option with respect to the Notes, and the discharge of our obligations under the applicable indenture.\nThe following schedules present the summarized financial information for Keurig Dr Pepper Inc. (the \"Parent\") and the Guarantors on a combined basis after intercompany eliminations; the Parent and the Guarantors' amounts due from and amounts due to Non-Guarantors are disclosed separately. The consolidating schedules are provided in accordance with the reporting requirements of Rule 13-01 under SEC Regulation S-X for the issuer and guarantor subsidiaries.\nSummarized financial information for the Parent and Guarantors follows:\n(in millions)\nFirst Nine Months of 2025\nNet sales\n$\n7,783\n \nGross profit\n3,993\n \nIncome from operations\n1,270\n \nNet income\n1,748\n \n(in millions)\nSeptember 30, 2025\nDecember 31, 2024\nCurrent assets\n$\n2,632\n \n$\n2,373 \nNon-current assets\n51,151\n \n49,827 \nTotal assets\n(1)\n$\n53,783\n \n$\n52,200 \nCurrent liabilities\n$\n5,433\n \n$\n6,101 \nNon-current liabilities\n22,131\n \n20,984 \nTotal liabilities\n(2)\n$\n27,564\n \n$\n27,085 \n(1)\nIncludes $14 million and $115 million of intercompany receivables due to the Parent and Guarantors from the Non-Guarantors as of September 30, 2025 and December 31, 2024, respectively. \n(2)\nIncludes $2,471 million and $1,997 million of intercompany payables due to the Non-Guarantors from the Parent and Guarantors as of September 30, 2025 and December 31, 2024, respectively.\n46\nTable of Contents"
}