{
  "source_file": "kdp-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.   BUSINESS\nOUR COMPANY\nKeurig Dr Pepper Inc. is a leading beverage company in North America that manufactures, markets, distributes, and sells hot and cold beverages and single serve brewing systems. KDP has a broad portfolio of iconic beverage brands, including Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, and The Original Donut Shop, as well as the Keurig brewing system. We have some of the most recognized beverage brands in North America, with significant consumer awareness levels and long histories that evoke strong emotional connections with consumers. We have a portfolio of more than 125 owned, licensed, and partner brands, as well as powerful distribution capabilities. \nKDP was created on July 9, 2018, through the combination of the business operations of Keurig, a leading producer of innovative single serve brewing systems and specialty coffee in the U.S. and Canada, and DPS, a company built over time through a series of strategic acquisitions that brought together iconic beverage brands in North America. Today, we trade on Nasdaq under the symbol KDP.\nOUR STRENGTHS AND STRATEGY\nOur strategic framework starts with our purpose to \nDrink Well. Do Good. \nWe aim to enhance the experience of every beverage occasion and to make a positive impact for people, communities, and the planet. Our vision is to be a total beverage leader, offering a beverage for every need, anytime, anywhere. We support our purpose and vision with five key strategies:\nChampion consumer-obsessed brand building.\n \nWe own a diverse portfolio of well-known beverage brands. Many of our brands enjoy high levels of consumer awareness, preference, and loyalty rooted in their rich heritage. This portfolio provides our customers with a wide variety of products to meet consumers' needs and provides us with a platform for growth and profitability. We drive growth in our business through investments in innovation, renovation, and marketing to support our portfolio of owned brands and partnerships with other leading beverage brands. We lead with deep consumer insights that inform our brand positioning and surface opportunities to address unmet needs. We have a robust innovation program, which is designed to meet consumers' changing flavor and beverage preferences and to grow our share of beverage occasions. \nAmplify our route-to-market advantage.\n \nWe have strategically-located distribution capabilities, which enable us to better align our operations with our customers and our sales channels, to ensure our products are available to meet consumer demand, to reduce transportation costs, and to have greater control over the timing and coordination of new product launches. We actively manage transportation of our products using our fleet (owned and leased) of approximately 7,100 vehicles in the U.S. and 2,200 in Mexico, as well as third party logistics providers. \nWith our Keurig.com website, we have a leading direct-to-consumer e-commerce platform which provides us insights and expertise in the e-commerce channel. We have been able to translate those insights and experiences to our LRB business as the number of fulfillment options that are better suited economically for beverages has evolved, leading to growth in the e-commerce channel. We continually invest in digital tools and capabilities as part of our route-to-market strategy, and as one element of a holistic digital transformation across KDP.\nShape our now and next beverage portfolio. \nWe have cultivated relationships with leading beverage brands to create long-term partnerships that enable us and our partners to benefit equitably in future value creation, and where appropriate, we bring these partner brands into our owned portfolio through acquisitions. We continually evaluate making investments in companies that fill in whitespace in our portfolio.\nGenerate fuel for growth. \nWe focus on critical transformational investments that drive continuous productivity and network optimization. We also maintain an emphasis on lean overheads in order to drive increasing operating leverage and fund our investments in our growth opportunities.\nDynamically allocate capital.\n \nOur highly efficient business model, focused on an optimized capital structure, gives us optionality to invest internally and pursue investments, partnerships, acquisitions, or other opportunities to continue to drive growth and create value.\n1\nTable of Contents\n \nOUR PRODUCTS AND OPERATING STRUCTURE\nWe are a leading integrated brand owner, manufacturer, and distributor of beverages in the U.S., Canada, Mexico, and the Caribbean. \nOperating and Reportable Segments\nAs of December 31, 2024, our operating structure consists of three operating and reportable segments: U.S. Refreshment Beverages, U.S. Coffee, and International. Segment financial data, including financial information about foreign and domestic operations, is included in Note 8 of the Notes to our Consolidated Financial Statements.\nU.S. Refreshment Beverages\nOur U.S. Refreshment Beverages segment is a brand owner, manufacturer, and distributor of LRBs in the U.S. In this segment, we manufacture and distribute beverage concentrates, syrups, and finished beverages of our brands to third-party bottlers, distributors, retailers, and, ultimately, the end consumer.\nWe manufacture beverage concentrates and syrups, which we then sell throughout the U.S. to third party bottlers or use them in our own manufacturing systems. Beverage concentrates, which are highly concentrated proprietary flavors, are combined with carbonation, water, sweeteners, and other ingredients, packaged in cans, bottles, or other packaging, and sold as a packaged beverage to retailers and, ultimately, the end consumer. Beverage concentrates are also manufactured into syrup, which is shipped to fountain customers, such as fast food restaurants, who mix the syrup with water and carbonation to create a finished beverage at the point of sale to consumers. Dr Pepper represents most of our fountain channel volume. \nWe manufacture and distribute finished beverages of our own beverage brands. Additionally, in order to maximize the size and scale of our manufacturing and distribution operations, we also distribute finished beverages for our partner brands and manufacture finished beverages for other third parties, including partners and private labels. We partner with other brands seeking effective route-to-market capabilities, including national selling and distribution scale. These brands can also give us exposure in certain markets to fast growing segments of the beverage industry in a capital-efficient manner. We sell finished beverages through our DSD and our WD systems, both of which include sales to all major retail channels.\nKey brands in this segment include Dr Pepper, Canada Dry, Mott’s, A&W, 7UP, Snapple, Sunkist soda, Squirt, C4 Energy, Hawaiian Punch, Electrolit, Core Hydration, Bai, Evian, Clamato, Yoo-Hoo, Vita Coco, and Big Red.\nU.S. Coffee\nOur U.S. Coffee segment is primarily a brand owner, manufacturer, and distributor of innovative single serve brewers, specialty coffee (including hot and iced varieties), and RTD coffee in the U.S. Our Keurig single serve brewers are aimed at changing the way consumers prepare and enjoy coffee and other beverages both at home and away from home in places such as offices, hotels, restaurants, cafeterias, and convenience stores. We create value by developing and selling our Keurig single serve brewers and by expanding Keurig brewer household adoption, which enables sales of specialty coffee and a variety of other specialty beverages in K-Cup pods (including hot and iced teas, hot cocoa, and other beverages) for use with Keurig brewers. We also compete in the broader coffee category through traditional whole bean and ground coffee in other package types, including bags, fractional packages, and cans, as well as RTD coffee beverages. We, together with our partners, are able to bring consumers high-quality coffee and other beverage experiences from the brands they love, all through the one-touch simplicity and convenience of Keurig brewers. \nWe manufacture and sell 100% of the K-Cup pods of our owned and licensed brands, including Green Mountain Coffee Roasters, The Original Donut Shop, and McCafé, to retailers, away from home channel participants, and end-use consumers. We manufacture K-Cup pods for our partner brands, who in turn sell them to retailers and consumers. Our partner brands include Starbucks, Dunkin', Folgers, and Peet's, among others. We have agreements for manufacturing, distributing, and selling K-Cup pods for tea under brands such as Celestial Seasonings and Bigelow. We produce and sell K-Cup pods for cocoa, including through a licensing agreement for the Swiss Miss brand, and hot apple cider, including under our own brand, Mott's. Generally, we are able to sell these partner brands to our away from home channel participants and directly to consumers through our website at www.keurig.com. We also participate in private label manufacturing arrangements. \n2\nTable of Contents\n \nOur U.S. Coffee segment manufactures K-Cup pods using freshly roasted and ground coffee as well as tea, cocoa, and other products. We offer high-quality, responsibly sourced coffee, including certified single-origin, organic, flavored, limited edition, and proprietary blends. We carefully select our coffee beans and roast them to optimize their taste and flavor differences. We engineer and design most of our single serve brewers and utilize third-party contract manufacturers located in various countries in Asia for brewer appliance manufacturing. We distribute our brewers using third-party distributors, retail partners and directly to consumers through our website at www.keurig.com.\nInternational\nOur International segment includes:\n•\nSales in Canada, Mexico, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages, including sales of our own brands and third-party brands, to third-party bottlers, distributors, and retailers. Key beverage brands include Peñafiel, Clamato, Squirt, Canada Dry, Dr Pepper, Mott’s, and Crush.\n•\nSales in Canada from the manufacture and distribution of finished goods relating to our single serve brewers, K-Cup pods, and other coffee products to partners and retailers, as well as directly to consumer through our website at www.keurig.ca. Key K-Cup pod brands include McCafé, Tim Hortons, and Van Houtte, as well as other partner and private label brands.\nProduct Innovation and New Partnerships\nWe are focused on a robust innovation pipeline within our portfolio of products to build household penetration of our business. We regularly launch new brewers with new features and benefits, technological advances, sustainable attributes, and changes in aesthetics to provide a variety of options to suit individual consumer preferences. We also continuously innovate and renovate our portfolio of K-Cup pods and beverages to provide an expansive array of flavors. \nEffective December 31, 2024, we acquired a controlling interest in GHOST. Founded in 2016, GHOST is a lifestyle sports nutrition business with a portfolio anchored by GHOST Energy, a leading ready-to-drink energy brand. We initially purchased a 60% stake in GHOST, and we also entered into an agreement which requires us to buy the remaining 40% of GHOST in 2028.\nDuring 2024, we launched our Keurig K-Brew+Chill brewer that features Quick Chill Technology which delivers iced beverages at temperatures below 60 degrees straight from the brewer, as well as the ability to brew hot beverages. In addition, we announced our multi-year innovation agenda with the Keurig Alta brewer and K-Rounds plastic- and aluminum-free pods.\nWe debuted Canada Dry Fruit Splash, which partners classic ginger ale with cherry flavors and a splash of real fruit juice, as well as a limited edition offering of Dr Pepper Creamy Coconut. We launched Mott’s Active, a hydrating juice beverage for kids with naturally sourced electrolytes, no added sugar, and no artificial flavors, in Blastin’ Berry and Watermelon Burst. \nWe entered into new partnerships with The Brooklyn Roasting Company, Kahawa 1893, Killah Coffee, and Punk Bunny Coffee, among others, to provide their signature coffee blends in K-Cup pod format. \nWe expanded our partnership with Black Rifle Coffee Company to include a sales and distribution agreement for Black Rifle Energy. We also entered into an agreement with Nutrabolt to distribute Bloom RTD energy beverages. We began distributing under both of these agreements during the fourth quarter of 2024.\n3\nTable of Contents\n \nCUSTOMERS\nWe primarily serve the following types of customers: \nRetailers\nRetailers include supermarkets, hypermarkets, mass merchandisers, club stores, e-commerce retailers, office superstores, vending machines, fountains, grocery and drug stores, convenience stores, and other small outlets. Retailers purchase finished beverages, K-Cup pods, appliances, and accessories directly from us. Our portfolio of strong brands, operational scale and experience in the beverage industry has enabled us to maintain strong relationships with major retailers throughout the U.S., Canada, and Mexico. Our largest retailer, Walmart, represented approximately 16% of our consolidated net sales in 2024. Net sales to Walmart are included in all reportable segments.\nBottlers and Distributors\nIn the U.S. and Canada, we generally grant manufacturing and distribution licenses for our carbonated soft drinks to bottlers for specific geographic areas that are typically exclusive and long-term. These bottlers may be affiliated with Coca-Cola or with PepsiCo, or they may be independent. These agreements prohibit bottlers and distributors from selling the licensed products outside their exclusive territory and from selling any imitative products in that territory. Generally, we may terminate bottling and distribution agreements only for cause or change in control, and the bottler or distributor may terminate without cause upon giving certain specified notice and complying with other applicable conditions. These bottlers and distributor agreements may also contain provisions for fountain distribution rights, which are not exclusive for a territory, but generally do restrict bottlers from carrying imitative product in the territory. \nCertain other brands, such as Snapple, Bai, and Core, are licensed for distribution in various territories to bottlers and a number of smaller distributors such as beer wholesalers, wine and spirit distributors, independent distributors, and retail brokers. \nPartners\nWe have differentiated ourselves and the Keurig brand through our ability to create and sustain partnerships with other leading coffee, tea, and beverage brand companies through multi-year licensing and manufacturing agreements that best suit each brand's interests and strengths. Typically, we manufacture K-Cup pods on behalf of our partners, who in turn sell them to retailers.\nAway from Home Channel Participants\nWe distribute brewers, accessories, and K-Cup pods (owned, licensed, and partner brands) to away from home channel participants, which include office coffee distributors and hotel chains. \nEnd-use Consumers\nWe have robust e-commerce platforms at www.keurig.com and www.keurig.ca where end-use consumers can purchase brewers, accessories, K-Cup pods, and other coffee products, such as bagged traditional coffee and cold brew. \n4\nTable of Contents\n \nCOMPETITORS\nThe beverage industry is highly competitive and continues to evolve in response to changing consumer preferences. Competition is generally based on brand recognition, taste, quality, price, availability, selection, and convenience, among other factors. We compete with multinational corporations with significant financial resources. In our bottling and manufacturing operations, we also compete with a number of smaller bottlers and distributors and a variety of smaller, regional, and private label manufacturers. \nOur primary competitors include Coca-Cola, PepsiCo, Starbucks Corporation, The J.M. Smucker Company, The Kraft Heinz Company, and Nestlé S.A. Although these companies offer competing brands in categories we participate in, many are also our partners or customers, as they purchase beverage concentrates or K-Cup pods directly from us.\nMATERIAL RESOURCES \nRaw Materials\nThe principal raw materials we use in our business, which we commonly refer to as ingredients and materials, represent approximately 55% of our cost of sales and include green coffee, water, aluminum cans and ends, PET bottles and caps, including both virgin and rPET, CO\n2\n, sweeteners, paper products, K-Cup pod packaging materials, fruit, glass bottles and enclosures, cocoa, teas, juices, and other ingredients. We also use post-consumer recycled materials in the manufacturing of our single serve brewers. \nThe availability, quality, and costs of many of these materials have fluctuated, and may continue to fluctuate, over time. Additionally, under many of our supply arrangements for these raw materials, the price we pay fluctuates along with certain changes in indirect commodity costs, such as aluminum in the case of cans and ends, natural gas in the case of glass bottles, resin in the case of K-Cup pods, PET bottles and caps, corn in the case of sweeteners, and pulp in the case of paperboard packaging. \nWhen appropriate, we mitigate the exposure to volatility in the prices of certain commodities used in our production process and transportation to our customers through the use of various commodity derivative contracts or supplier pricing agreements. The intent of the contracts and agreements is to provide a certain level of predictability in our operating margins and our overall cost structure, while remaining in what we believe to be a competitive cost position. \nGreen Coffee\nWe develop and pursue direct relationships with farms, estates, cooperatives, cooperative groups, and exporters in order to purchase green coffee and to support our broader traceability and sustainable supply chain initiatives. We also purchase green coffee through outside brokers.\nEnergy and Transportation Costs\nIn addition to ingredients and packaging costs, we are significantly impacted by changes in fuel costs, which can also fluctuate substantially, due to the large truck fleet we operate in our distribution operations (reflected within SG&A expenses) and the energy costs consumed in the production process (reflected within cost of sales). \nWe are also significantly impacted by changes in other transportation costs, such as ocean freight and tariffs. Transportation costs associated with the transportation and import of certain raw materials and finished goods to our manufacturing and distribution facilities are reflected within cost of sales.\nIntellectual Property\nTrademarks and Patents\nWe possess a variety of intellectual property rights that are important to our business. We rely on a combination of trademarks, copyrights, patents, and trade secrets to safeguard our proprietary rights, including our brands, our technologies, and ingredient and production formulas for our products.\nWe own numerous trademarks in our portfolio within the U.S., Canada, Mexico, and other countries. Depending upon the jurisdiction, trademarks are valid as long as they are in use and/or their registrations are properly maintained. \n5\nTable of Contents\n \nIn many countries outside the U.S., Canada, and Mexico, the manufacturing and distribution rights to many of our CSD brands, including our Dr Pepper trademark and formula, are owned by third parties, including, in certain cases, competitors such as Coca-Cola.\nWe hold U.S. and international patents related to Keurig brewers and coffee pod technology. Of these, a majority are utility patents and the remainder are design patents. We view these patents as valuable assets but we do not view any single patent as critical to our success. We also have pending patent applications associated with our brewers and with coffee pod technology. We take steps that we believe are appropriate to protect such innovation. \nLicensing Arrangements\nWe license various trade names from our partners in order to manufacture and distribute K-Cup pods. Although these licenses vary in length and other terms, they generally are long-term, cover the entire U.S. and/or Canada, and may include royalty payments, upfront payments, or some combination of the two, to the partner in order to use their trade names to manufacture and/or distribute the K-Cup pods.\nWe license various trademarks from third parties, which generally allow us to manufacture and distribute certain products or brands throughout the U.S. and/or Canada and Mexico. For example, we license trademarks for Sunkist soda and Rose's from third parties. Although these licenses vary in length and other terms, they generally are long-term, cover the entire U.S. and/or Canada and Mexico and generally include a royalty payment to the licensor.\nFor beverages in emerging and fast growing categories where we may not currently have a brand presence, we license various trademarks from third party partners, which generally allow us to sell and distribute certain products or brands throughout the U.S., Canada, or Mexico. These partners view us as a distributor with strong route-to-market resources to grow their brands. Although these licenses vary in length and other terms, they generally are long-term and require a payment from the partner if the licensing agreement is terminated. In some instances, we make investments in these companies, which may include a path to acquire the company. As of December 31, 2024, our portfolio of partner brands included, but was not limited to, C4 energy drinks, Electrolit instant hydration beverages, evian water, Vita Coco coconut water, Polar Beverages seltzer water, La Colombe shelf-stable RTD coffee, Black Rifle Coffee Company energy drinks, and Peet's RTD coffee.\nSEASONALITY\nThe beverage market is subject to some seasonal variations. Our cold beverage sales are generally higher during the warmer months, while hot beverage sales are generally higher during the cooler months. Overall beverage sales can also be influenced by the timing of holidays and weather fluctuations. Sales of brewers and related accessories are generally higher during the second half of the year due to the holiday shopping season.\nHUMAN CAPITAL RESOURCES\nOur Employees\nWe have approximately 29,400 employees, primarily located in North America. In the U.S., we have approximately 22,400 employees, of which approximately 5,100 employees are covered by union collective bargaining agreements. In Mexico, we have approximately 5,300 employees, of which approximately 4,000 are covered by union collective bargaining agreements. In Canada, we have approximately 1,400 employees, with approximately 400 covered by union collective bargaining agreements. We also have approximately 300 employees in Europe and Asia.\nOur collective bargaining agreements generally address working conditions, as well as wage rates and benefits, and expire over varying terms over the next several years. We generally believe that these agreements can be renegotiated on terms satisfactory to us as they expire and that we have good relationships with our employees and any representative organizations for our unionized employees. \nOur compensation programs are designed to ensure that we attract and retain the right talent. We generally review and consider median market pay levels when assessing total compensation, but pay decisions are based on a more comprehensive set of considerations such as company performance, individual performance, experience, and internal equity. We continually monitor key talent metrics including employee engagement and employee turnover. \n6\nTable of Contents\n \nOur employee benefits programs strive to deliver competitive benefits that are effective in attracting and retaining talent, and that create a culture of well-being and inclusiveness, designed to support each team member’s unique needs. Our total package of benefits is designed to support the physical, mental, and financial health of our employees, and we currently provide access to medical, dental, vision, life insurance, retirement benefits, and disability benefits, as well as assistance with major life activities such as adoption, childbirth, and eldercare, among other benefits. \nOur Culture\nTogether with our employees, we created a set of core values that define how we work together and are the cornerstone of KDP's culture. We embrace a challenger mindset, which, together with our strategy and core values, are the unifying force for our team and guide our actions, each and every day. Our four core values are:\n•\nTeam First. \nWin together. Be the kind of person you want on your team.\n•\nDeliver Big.\n \nAchieve our commitments. Then push beyond the expected.\n•\nThink Bold. \nChallenge the usual. Dare to try something new.\n•\nBe Fearless and Fair.\n \nTell the truth with courage. Listen and act with respect. \nAdditionally, we have adopted a corporate code of conduct that applies to all of our employees, officers, and our Board, which lays the foundation for ethical behavior for our team. Our code of conduct is available on our website at http://www.keurigdrpepper.com.\nJust as each of our brands brings its own personality to our product portfolio, each of our employees brings their own unique set of experiences, perspectives, and flavor to our business. We believe that to best innovate and deliver for our consumers and customers, our workforce should represent them.\nEmployee Health and Safety\nKDP uses a wide variety of strategies and programs to support the health and safety of our employees. Our Environmental Health & Safety team considers all aspects of what our employees may encounter and works to minimize risk. Key to these efforts are data and preventive actions. KDP measures Lost Time Incident Rate, a reliable indication of Total Recordable Injuries Rate severity, and uses a risk reduction process that thoroughly analyzes injuries and near misses.\nOUR IMPACT\nAs a leading beverage company, we have the opportunity and responsibility to make a positive impact for people, communities, and planet. \nKDP Impact\n is our multi-year environmental, social, and governance agenda comprised of strategic initiatives that aim to make a positive impact with every drink. Rooted in action, realized through partnerships, and measured in results, we focus our commitments in the seven key impact areas where we can create meaningful change. These seven key impact areas are as follows:\n•\nClimate and nature action\n•\nWater use and stewardship \n•\nPackaging and circular economy\n•\nHuman rights, responsible sourcing, and supply chain livelihoods\n•\nConsumer health and well-being\n•\nEmployee health, safety, and well-being; and\n•\nCorporate governance and ethics.\nWe are committed to transparency and disclosure of our strategies, programs, progress, and governance. Our\n \nreport on our impact, which is issued annually, is available on our website at www.keurigdrpepper.com.\n7\nTable of Contents\n \nGOVERNMENTAL REGULATIONS ON OUR BUSINESS\nIn the normal course of our business, we are subject to a variety of federal, state, and local laws and regulations in the countries in which we do business. Regulations in the U.S., as well as jurisdictions including Canada, Mexico, and the European Union, apply to many aspects of our business, including our products and their ingredients, manufacturing, safety, labeling, transportation, packaging, advertising, and sale. For example, our products and their manufacturing, labeling, marketing, and sale in the U.S. are subject to various aspects of the Federal Food, Drug, and Cosmetic Act, the Federal Trade Commission Act, the Robinson-Patman Act, the Clayton Act, the Sherman Act, the Lanham Act, state consumer protection laws, and state warning and labeling laws, such as the state of California’s Safe Drinking Water and Toxic Enforcement Act of 1986.\nVarious countries, states, provinces, and other authorities have enacted eco-taxes, extended producer responsibility laws, deposit or reuse/refill mandates, fees on certain products or packaging, restrictions or bans on the use of certain types of packaging, including single-use plastics, and regulations on PFAS, and other chemicals of concern. Regulators have also expressed concerns about the processing and use of particular ingredients or additives in beverage products. Various jurisdictions have adopted, and others may seek to adopt, bans or restrictions on the use of certain ingredients or substances in products or packaging, as well as significant additional product labeling or warning requirements or limitations on the marketing or sale of our products because of what they contain or allegations that they cause adverse health effects. Certain cities and municipalities within the U.S. have passed various taxes on the distribution of sugar-sweetened and diet beverages, which are at different stages of enactment. We expect that legislation or regulations like those described above will continue to be proposed in the future at local, state and federal levels, both in the U.S. and elsewhere.\nOTHER INFORMATION\nWe are required to file annual, quarterly, and current reports, proxy statements and other information with the SEC. The SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at http://www.sec.gov.\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to the Exchange Act, are also available free of charge on our website at http://www.keurigdrpepper.com as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Information on any of our websites is not incorporated by reference in this document or any of our other filings with the SEC.\nMARKET AND INDUSTRY DATA\nThe market and industry data in this Annual Report on Form 10-K is from Circana, an independent industry source, and is based on retail dollar sales and sales volumes in 2024. Although we believe that this independent source is reliable, we have not verified the accuracy or completeness of this data or any assumptions underlying such data. Circana is a market information provider, primarily serving consumer packaged goods manufacturers and retailers. We use Circana data as our primary management tool to track market performance because it has broad and deep data coverage, is based on consumer transactions at retailers, and is reported to us weekly. Circana data provides measurement and analysis of marketplace trends such as market share, retail pricing, promotional activity, and distribution across various channels, retailers, and geographies. Measured categories provided to us by Circana include K-Cup pods, carbonated soft drinks, RTD teas and coffee, single serve and multi-serve juice and juice drinks, sports drinks, energy drinks, still waters, carbonated waters, and non-alcoholic mixers. Circana also provides data on other food items such as apple sauce. Circana data we present in this report is compiled from scanner transactions in key retail channels, including grocery stores, mass merchandisers (including Walmart), club stores (excluding Costco), drug chains, convenience stores, and gas stations. However, this data does not include the fountain or vending channels, or small independent retail outlets, which together represent a meaningful portion of the U.S. beverage market. This data does not include certain customers and e-commerce sales which represents a significant portion of our U.S. Coffee segment. Our market share data for our brewers is also based on information provided by Circana. The data presented for our brewers is based upon Circana’s Consumer Tracking Service for Coffeemakers in the U.S. and represents the twelve month period ended December 31, 2024.\n8\nTable of Contents",
  "item7": "ITEM 7.   MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThis section of this Annual Report on Form 10-K generally discusses the years ended December 31, 2024 and 2023 and year-over-year comparisons between the years ended December 31, 2024 and 2023. Discussions of the periods prior to the year ended December 31, 2023 that are not included in this Annual Report on Form 10-K are found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023 and the discussion therein for the year ended December 31, 2023 compared to the year ended December 31, 2022 is incorporated by reference into this Annual Report.\nThis Annual Report on Form 10-K contains the names of some of our owned or licensed trademarks, trade names and service marks, which we refer to as our brands. All of the product names included in this Annual Report on Form 10-K are either our registered trademarks or those of our licensors.\nOVERVIEW\nKDP is a leading beverage company in North America that manufactures, markets, distributes and sells hot and cold beverages and single serve brewing systems. We have a broad portfolio of iconic beverage brands, including Keurig, Dr Pepper, Canada Dry, Mott's, A&W, Peñafiel, Snapple, 7UP, Green Mountain Coffee Roasters, GHOST, Clamato, Core Hydration, and The Original Donut Shop. KDP has some of the most recognized beverage brands in North America, with significant consumer awareness levels and long histories that evoke strong emotional connections with consumers. We offer more than 125 owned, licensed, and partner brands, available nearly everywhere people shop and consume beverages through our sales and distribution network. \nKDP operates as an integrated brand owner, manufacturer, and distributor. We believe our integrated business model strengthens our route-to-market and provides opportunities for net sales and profit growth through the alignment of the economic interests of our brand ownership and our manufacturing and distribution businesses through both our DSD system and our WD system. We market and sell our products to retailers, including supermarkets, mass merchandisers, club stores, pure-play e-commerce retailers, and office superstores; to restaurants, hotel chains, office product and coffee distributors, and partner brand owners; and directly to consumers through our website. Our integrated business model enables us to be more flexible and responsive to the changing needs of our large retail customers and allows us to more fully leverage our scale and reduce costs by creating greater geographic manufacturing and distribution coverage.\nSEGMENTS\nOur operating and reportable segments are as follows:\n•\nThe U.S. Refreshment Beverages segment reflects sales in the U.S. from the manufacture and distribution of branded concentrates, syrup, and finished beverages, including the sales of our own brands and third-party brands, to third-party bottlers, distributors, and retailers.\n•\nThe U.S. Coffee segment reflects sales in the U.S. from the manufacture and distribution of finished goods relating to our K-Cup pods, single serve brewers, and other coffee products to partners, retailers, and directly to consumers through our Keurig.com website.\n•\nThe International segment reflects sales in international markets, including the following:\n◦\nSales in Canada, Mexico, the Caribbean, and other international markets from the manufacture and distribution of branded concentrates, syrup, and finished beverages, including sales of our own brands and third-party brands, to third-party bottlers, distributors, and retailers.\n◦\nSales in Canada from the manufacture and distribution of finished goods relating to our single serve brewers, K-Cup pods, and other coffee products.\n25\nTable of Contents\nVOLUME\nIn evaluating our performance, we use different volume measures for LRB and for K-Cup pods and appliances. \nFor LRB, we measure our sales volume in 288 fluid ounce equivalent cases.\n•\nFor beverage concentrates, we measure our sales volume as concentrate case sales for concentrates sold by us to our bottlers and distributors. A concentrate case is the amount of concentrate needed to make one case of 288 fluid ounces of finished beverage, the equivalent of 24 twelve ounce servings. It does not include any other component of the finished beverage other than concentrate.\n•\nFor packaged beverages, we measure volume as case sales to customers. A case sale represents a unit of measurement equal to 288 fluid ounces of packaged beverage sold by us. Case sales include both our owned brands and certain brands licensed to and/or distributed by us.\nFor our K-Cup pods and appliances, we measure our sales volume as the number of appliances and the number of individual K-Cup pods sold to our customers.\nEXECUTIVE SUMMARY \nFinancial Overview \nAs Reported, in millions (except Diluted EPS)\n26\nTable of Contents\nKey Events During and Subsequent to the Fourth Quarter of 2024\nOn October 23, 2024, we entered into a definitive agreement with GHOST, and certain other parties named therein, to acquire a controlling interest in GHOST. Founded in 2016, GHOST is a lifestyle sports nutrition business with a portfolio anchored by GHOST Energy, a leading ready-to-drink energy brand. \nUnder the terms of the agreement, we initially purchased a 60% stake in GHOST for aggregate consideration of approximately $1 billion on December 31, 2024. We also entered into an agreement requiring us to purchase the remaining equity interests in GHOST in 2028. The initial payment was funded primarily by proceeds drawn from the Term Loan Agreement. We also executed an agreement with GHOST and ABI which transfers the distribution rights for GHOST products from ABI to us, effective March 3, 2025, for a termination payment to ABI of $225 million which will be paid during the first quarter of 2025. Refer to Note 4 of the Notes to our Consolidated Financial Statements for additional information.\nOn January 31, 2025, we repaid the amount outstanding under the Term Loan Agreement using proceeds from commercial paper.\nUncertainties and Trends Affecting Our Business\nWe believe the North American beverage market is influenced by certain key trends and uncertainties. Refer to Item 1A, \nRisk Factors\n, as well as the \nUncertainties and Trends Affecting Liquidity and Capital Resources\n section below, for more information about risks and uncertainties facing us. \nRefer to Note 6 of the Notes to our Consolidated Financial Statements and Item 7A, \nQuantitative and Qualitative Disclosures About Market Risk\n for management's discussion of how we manage our exposure to commodity risk. \nRESULTS OF OPERATIONS\nWe eliminate from our financial results all intercompany transactions between entities included in our consolidated financial statements and the intercompany transactions with our equity method investees.\nReferences in the financial tables to percentage changes that are not meaningful are denoted by \"NM\".\n27\nTable of Contents\nFor the Year Ended December 31, 2024 Compared to the Year Ended December 31, 2023: \nConsolidated Operations\nThe following table sets forth our consolidated results of operations for the years ended December 31, 2024 and 2023: \n \nFor the Year Ended December 31,\nDollar\nPercentage\n(in millions, except per share amounts)\n2024\n2023\nChange\nChange\nNet sales\n$\n15,351\n \n$\n14,814 \n$\n537 \n3.6 \n%\nCost of sales\n6,822\n \n6,734 \n88 \n1.3 \nGross profit\n8,529\n \n8,080 \n449 \n5.6 \nSelling, general, and administrative expenses\n5,013\n \n4,912 \n101 \n2.1 \nImpairment of goodwill\n306\n \n—\n \n306 \nNM\nImpairment of other intangible assets\n412\n \n2 \n410 \nNM\nOther operating expense (income), net\n207\n \n(26)\n233 \nNM\nIncome from operations\n2,591\n \n3,192 \n(601)\n(18.8)\nInterest expense, net\n735\n \n496 \n239 \n48.2 \nImpairment of investments and note receivable\n2\n \n— \n2 \nNM\nOther (income) expense, net\n(60)\n(61)\n1 \nNM\nIncome before provision for income taxes\n1,914\n \n2,757 \n(843)\n(30.6)\nProvision for income taxes\n473\n \n576 \n(103)\n(17.9)\nNet income\n$\n1,441\n \n$\n2,181 \n$\n(740)\n(33.9)\n%\nEarnings per common share:\n \n \nBasic\n$\n1.06\n \n$\n1.56 \n$\n(0.50)\n(32.1)\n%\nDiluted\n1.05\n \n1.55 \n(0.50)\n(32.3)\n%\nGross margin\n55.6\n \n%\n54.5 \n%\n110 bps\nOperating margin\n16.9\n \n%\n21.5 \n%\n(460) bps\nEffective tax rate\n24.7\n \n%\n20.9 \n%\n380 bps\nSales Volume. \nThe following table provides the change in sales volume compared to the prior year:\nPercentage Change\nLRB\n1.8 \n%\nK-Cup pods\n0.8 \n%\nAppliances\n7.4 \n%\nNet Sales.\n \nNet sales increased $537 million, or 3.6%, to $15,351 million for the year ended December 31, 2024 compared to $14,814 million in the prior year. This performance reflected volume/mix growth of 2.7% and favorable net price realization of 1.2%, slightly offset by unfavorable impacts from FX translation of 0.3%.\nGross Profit.\n \nGross profit increased $449 million, or 5.6%, to $8,529 million for the year ended December 31, 2024 compared to $8,080 million in the prior year. This performance primarily reflected the gross profit impact of net sales growth (3 percentage points), a net benefit from changes in ingredients, materials, and productivity (2 percentage points), and earned equity from the achievement of milestones associated with certain distribution agreements (1 percentage point), partially offset by net increases in other manufacturing costs (1 percentage point).\nSelling, General and Administrative Expenses. \nSG&A expenses increased $101 million, or 2.1%, to $5,013 million for the year ended December 31, 2024 compared to $4,912 million in the prior year, led by increases in transportation and warehousing expenses (2 percentage points) and people costs (1 percentage point), partially offset by reduced costs associated with productivity projects (1 percentage point).\n28\nTable of Contents\nImpairment of Goodwill.\n Impairment of goodwill reflected a non-cash impairment charge of $306 million within the U.S. Warehouse Direct reporting unit in the U.S. Refreshment Beverages segment. Refer to Note 5 of the Notes to our Consolidated Financial Statements for further information.\nImpairment of Other Intangible Assets.\n Impairment of intangible assets reflected non-cash impairment charges of $412 million for intangible brand assets, primarily led by Snapple. Refer to Note 5 of the Notes to our Consolidated Financial Statements for further information.\nOther operating expense (income), net. \nOther operating (expense) income, net reflected an unfavorable change of $233 million for the year ended December 31, 2024, primarily driven by the accrued $225 million termination fee associated with ABI. Refer to Note 4 of the Notes to our Consolidated Financial Statements for further information.\nIncome from Operations.\n \nIncome from operations decreased $601 million, or 18.8%, to $2,591 million for the year ended December 31, 2024 compared to $3,192 million in the prior year, as our increase in gross profit (14 percentage points) was more than offset by the impacts of our non-cash impairment charges for goodwill and other intangible assets (22 percentage points) and the accrued termination fee associated with ABI (7 percentage points).\nInterest Expense, Net.\n Interest expense, net increased $239 million, or 48.2%, to $735 million for the year ended December 31, 2024 compared to $496 million for the prior year, primarily driven by increased debt and higher financing costs (32 percentage points) and an unfavorable year-over-year change in unrealized mark-to-market activity (17 percentage points). \nEffective Tax Rate. \nThe effective tax rate increased 380 bps to 24.7% for the year ended December 31, 2024, compared to 20.9% in the prior year, primarily driven by the impact of our non-cash goodwill impairment charge (270 bps) and the unfavorable comparison to the prior year tax benefit received from a non-cash adjustment (100 bps).\nNet Income.\n \nNet income decreased $740 million, or 33.9%, to $1,441 million for the year ended December 31, 2024 as compared to $2,181 million in the prior year.\nDiluted EPS. \nDiluted EPS decreased 32.3% to $1.05 per diluted share as compared to $1.55 in the prior year.\nResults of Operations by Segment\nThe following tables set forth net sales and income from operations for our reportable segments for the years ended December 31, 2024 and 2023, as well as the other amounts necessary to reconcile our total segment results to our consolidated results presented in accordance with U.S. GAAP:\nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nNet sales\nU.S. Refreshment Beverages\n$\n9,331\n \n$\n8,821 \nU.S. Coffee\n3,967\n \n4,071 \nInternational\n2,053\n \n1,922 \nTotal net sales\n$\n15,351\n \n$\n14,814 \nFor the Year Ended December 31,\n(in millions)\n2024\n2023\nIncome from Operations\n \n \nU.S. Refreshment Beverages\n$\n1,878\n \n$\n2,483 \nU.S. Coffee\n1,079\n \n1,158 \nInternational\n545\n \n475 \nUnallocated corporate costs\n(911)\n(924)\nTotal income from operations\n$\n2,591\n \n$\n3,192 \n29\nTable of Contents\nU.S. Refreshment Beverages\nThe following table provides selected information about our U.S. Refreshment Beverages segment’s results:\nFor the Year Ended December 31,\nDollar\nPercentage\n(in millions)\n2024\n2023\nChange\nChange\nNet sales\n$\n9,331\n \n$\n8,821 \n$\n510 \n5.8 \n%\nIncome from operations\n1,878\n \n2,483 \n(605)\n(24.4)\n%\nOperating margin\n20.1\n \n%\n28.1 \n%\n(800) bps\nSales Volume.\n Sales volumes for the year ended December 31, 2024 increased approximately 1.0% compared to the prior year period. Growth in carbonated soft drinks and the contributions from partnerships, such as Electrolit and C4, was partially offset by softness in our still beverages portfolio.\nNet Sales. \nNet sales increased 5.8% to $9,331 million in the year ended December 31, 2024, compared to $8,821 million in the prior year period, driven by favorable net price realization of 3.1% and volume/mix growth of 2.7%.\nIncome from Operations.\n Income from operations decreased $605 million, or 24.4%, to $1,878 million for the year ended December 31, 2024 compared to $2,483 million for the prior year period. This decrease was primarily driven by the non-cash goodwill and intangible impairment charges (29 percentage points) and the accrued termination fee associated with ABI (9 percentage points). Other drivers include the benefit to gross profit of net sales growth (13 percentage points), a net benefit from changes in ingredients, materials, and productivity (3 percentage points), and earned equity from the achievement of milestones associated with certain distribution agreements (3 percentage points), partially offset by increased transportation and warehousing expenses (3 percentage points).\nU.S. Coffee\nThe following table provides selected information about our U.S. Coffee segment’s results:\nFor the Year Ended December 31,\nDollar\nPercentage\n(in millions)\n2024\n2023\nChange\nChange\nNet sales\n$\n3,967\n \n$\n4,071 \n$\n(104)\n(2.6)\n%\nIncome from operations\n1,079\n \n1,158 \n(79)\n(6.8)\n%\nOperating margin\n27.2\n \n%\n28.4 \n%\n(120) bps\nSales Volume. \nK-Cup pod volume was flat for the year ended December 31, 2024 compared to the prior year period. Appliance volume increased 7.3% in the year ended December 31, 2024, driven by Keurig market share momentum and improving coffeemaker category trends.\nNet Sales.\n Net sales decreased 2.6% to $3,967 million for the year ended December 31, 2024 compared to $4,071 million in the prior year period, driven by unfavorable net price realization of 3.6%, partially offset by volume/mix growth of 1.0%.\nIncome from Operations.\n Income from operations decreased $79 million, or 6.8%, to $1,079 million for the year ended December 31, 2024, compared to $1,158 million in the prior year period, driven by the gross profit impact of the net sales decrease (11 percentage points), partially offset by a net benefit from changes in ingredients, materials, and productivity (3 percentage points).\n30\nTable of Contents\nInternational\nThe following table provides selected information about our International segment’s results:\nFor the Year Ended December 31,\nDollar\nPercentage\n(in millions)\n2024\n2023\nChange\nChange\nNet sales\n$\n2,053\n \n$\n1,922 \n$\n131 \n6.8 \n%\nIncome from operations\n545\n \n475 \n70 \n14.7 \n%\nOperating margin\n26.5\n \n%\n24.7 \n%\n180 bps\nSales Volume.\n The following table provides the percentage change in sales volumes for the International segment compared to the prior year period:\nPercentage Change\nLRB\n5.6 \n%\nK-Cup pods\n6.6 \nAppliances\n8.2 \nNet Sales. \nNet sales increased 6.8% to $2,053 million in the year ended December 31, 2024, compared to $1,922 million in the prior year period, reflecting volume/mix growth of 6.2% and higher net price realization of 3.0%, partially offset by unfavorable FX translation of 2.4%. \nIncome from Operations. \nIncome from operations increased $70 million, or 14.7%, to $545 million for the year ended December 31, 2024 compared to $475 million in the prior year period. This performance reflected the gross profit impact of volume/mix growth and higher net price realization (25 percentage points) and a net benefit from changes in ingredients, materials, and productivity (5 percentage points), partially offset by increased transportation and warehousing expenses (5 percentage points) and higher marketing investment (5 percentage points).\n31\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nWe believe our financial condition and liquidity remain strong. We continue to manage all aspects of our business, including, but not limited to, monitoring the financial health of our customers, suppliers, and other third-party relationships, implementing gross margin enhancement strategies through our productivity initiatives, and developing new opportunities for growth such as innovation and agreements with partners to distribute brands that are accretive to our portfolio.\nCash generated by our foreign operations is generally repatriated to the U.S. periodically as working capital funding requirements, where allowed. We do not expect restrictions or taxes on repatriation of cash held outside the U.S. to have a material effect on our overall business, liquidity, financial condition, or results of operations for the foreseeable future.\nThe following summarizes our cash activity for the years ended December 31, 2024, 2023, and 2022:\nPrincipal Sources of Capital Resources\nOur principal sources of liquidity are our existing cash and cash equivalents, cash generated from our operations, and borrowing capacity currently available under our Revolving Credit Agreement and our Term Loan Agreement. Additionally, we have an uncommitted commercial paper program where we can issue unsecured commercial paper notes on a private placement basis. Based on our current and anticipated level of operations, we believe that our operating cash flows will be sufficient to meet our anticipated obligations for the next twelve months and thereafter for the foreseeable future. To the extent that our operating cash flows are not sufficient to meet our liquidity needs, we may utilize cash on hand or amounts available under our financing arrangements, if necessary. At any time, and from time to time, we may seek additional deleveraging, refinancing, or liquidity enhancing transactions, including entering into transactions to repurchase or redeem outstanding indebtedness or otherwise seek transactions to reduce interest expense, extend debt maturities, and improve our capital and liquidity structure\n.\nSources of Liquidity - Operations\nNet cash provided by operating activities increased $890 million for the year ended December 31, 2024, as compared to the year ended December 31, 2023, driven by the favorable comparison in working capital versus the prior year period.\n32\nTable of Contents\nCash Conversion Cycle\nOur cash conversion cycle is defined as DIO and DSO less DPO. The calculation of each component of the cash conversion cycle is provided below:\nComponent\nCalculation (on a trailing twelve month basis)\nDIO\n(Average inventory divided by cost of sales) * Number of days in the period\nDSO\n(Accounts receivable divided by net sales) * Number of days in the period\nDPO\n(Accounts payable * Number of days in the period) divided by cost of sales and SG&A expenses\nThe following table summarizes our cash conversion cycle:\nDecember 31,\n2024\n2023\nDIO\n68\n \n71 \nDSO\n36\n \n34 \nDPO\n92\n \n113 \nCash conversion cycle\n12\n \n(8)\nOur cash conversion cycle increased 20 days to approximately 12 days as of December 31, 2024 as compared to (8) days as of December 31, 2023, which was primarily driven by the decrease in DPO, reflecting the reduction of payment terms for certain suppliers.\nAccounts Payable Program\nWe work with our suppliers to optimize our terms and conditions, which includes payment terms. Excluding our suppliers who require cash at date of purchase or sale, our current payment terms with our suppliers generally range from 10 to 360 days. We also enter into agreements with third party administrators to allow participating suppliers to track payment obligations from us, and, if voluntarily elected by the supplier, sell payment obligations from us to financial institutions. Suppliers can sell one or more of our payment obligations at their sole discretion and our rights and obligations to our suppliers are not impacted. We have no economic interest in a supplier’s decision to enter into these agreements and no direct financial relationship with the financial institutions. Our obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted. Refer to Note 2 of the Notes to our Consolidated Financial Statements for additional information on our obligations to participating suppliers.\nSources of Liquidity - Financing\nRefer to\n Note 3 of the Notes to our Consolidated Financial Statements for management's discussion of our financing arrangements.\nWe also have an active shelf registration statement, filed with the SEC on August 19, 2022, which allows us to issue an indeterminate number or amount of common stock, preferred stock, debt securities, and warrants from time to time in one or more offerings at the direction of our Board.\n33\nTable of Contents\nDebt Ratings\nOur credit ratings are as follows:\nRating Agency\nLong-Term Debt Rating\nCommercial Paper Rating\nOutlook\nMoody's\nBaa1\nP-2\nStable\nS&P\nBBB\nA-2\nStable\nThese debt and commercial paper ratings impact the interest we pay on our financing arrangements. A downgrade of one or both of our debt and commercial paper ratings could increase our interest expense and decrease the cash available to fund anticipated obligations.\nAs of December 31, 2024, we were in compliance with all debt covenants and we have no reason to believe that we will be unable to satisfy these covenants. \nPrincipal Uses of Capital Resources\nOur capital allocation priorities are investing to grow our business both organically and inorganically, continuing to strengthen our balance sheet, and returning cash to shareholders through regular quarterly dividends and opportunistic share repurchases. We dynamically adjust our cash deployment plans based on the specific opportunities available in a given period, but over time we allocate capital to balance each of these priorities.\nRegular Quarterly Dividends\nWe have declared total dividends of $0.89 per share and $0.83 per share for the years ended December 31, 2024 and 2023, respectively.\nRepurchases of Common Stock\nOur Board authorized a four-year share repurchase program, ending December 31, 2025, of up to $4 billion of our outstanding common stock. Repurchases and retirements of common stock, including payments on our share excise tax obligation, were $1,110 million and $706 million during the years ended December 31, 2024 and 2023, respectively. As of December 31, 2024, $1,810 million remained available for repurchase under the authorized share repurchase program.\nCapital Expenditures\nPurchases of property, plant, and equipment were $563 million and $425 million for the years ended December 31, 2024 and 2023, respectively. \nCapital expenditures, which includes both purchases of property, plant, and equipment and amounts included in accounts payable and accrued expenses, for the years ended December 31, 2024 and 2023, primarily related to investments in manufacturing capabilities, both in the U.S. and internationally. Capital expenditures included in accounts payable and accrued expenses were $220 million and $276 million for the years ended December 31, 2024 and 2023, respectively, which primarily related to these investments.\nInvestments in Unconsolidated Affiliates\nFrom time to time, we invest in beverage startup companies or in brand ownership companies to grow our presence in certain product categories, or enter into various licensing and distribution agreements to expand our product portfolio. Our investments generally involve acquiring a minority interest in equity securities of a company, in certain cases with a protected path to ownership at our future option. Investments in unconsolidated affiliates were $7 million and $316 million for the years ended December 31, 2024 and 2023, respectively.\n34\nTable of Contents\nAcquisitions of Businesses and Purchases of Intangible Assets\nWe have invested in the expansion of our DSD network through transactions with strategic independent bottlers or third-party brand ownership companies to enhance competitive distribution scale. From time to time, we additionally acquire brand ownership companies to expand our portfolio. These transactions could be accounted for either as an acquisition of a business or as an asset acquisition, if the majority of the transaction price represents the acquisition of a single intangible asset. During the year ended December 31, 2024, we completed several acquisitions. Refer to Note 4 of the Notes to our Consolidated Financial Statements for further information about these acquisitions. Purchases of intangible assets were $59 million and $56 million for the years ended December 31, 2024 and 2023, respectively. \nRESIDUAL VALUE GUARANTEES\nWe have a number of leasing arrangements and one licensing arrangement with VIEs for which we are not the primary beneficiary. Each one of these arrangements contain an RVG. As of December 31, 2024, we have not recorded any liabilities as it is not probable that we will have to make any payments required under the RVGs. Refer to Note 19 of the Notes to our Consolidated Financial Statements for further information.\nUNCERTAINTIES AND TRENDS AFFECTING LIQUIDITY AND CAPITAL RESOURCES\nDisruptions in financial and credit markets, including those caused by global economic uncertainty and fluctuations in interest rates, may impact our ability to manage normal commercial relationships with our customers, suppliers, and creditors. These disruptions could have a negative impact on the ability of our customers to timely pay their obligations to us, thus reducing our cash flow, or the ability of our vendors to timely supply materials.\nCustomer and consumer demand for our products may also be impacted by the risk factors discussed under \"Risk Factors\" in Part 1, Item 1A in this Annual Report on Form 10-K, as well as subsequent filings with the SEC, that could have a material effect on production, delivery, and consumption of our products, which could result in a reduction in our sales volume. \nWe believe that the following events, trends and uncertainties may also impact liquidity: \n•\nOur ability to either repay existing debt maturities through cash flow from operations or refinance through future issuances of senior unsecured notes;\n•\nOur ability to access and/or renew our committed financing arrangements\n;\n•\nOur ability to issue unsecured uncommitted commercial paper notes on a private placement basis; \n•\nFuture mergers, acquisitions, or debt or equity investments, which may include brand ownership companies, regional bottling companies, distributors, and/or distribution rights to further extend our geographic coverage;\n•\nSeasonality and other variability in our operating cash flows, which could impact short-term liquidity; \n•\nOur continued payment of regular quarterly dividends;\n•\nFuture repurchases of our common stock or special dividends to drive total shareholder return;\n•\nOur continued capital expenditures;\n•\nFluctuations in our tax obligations; and\n•\nA potential significant downgrade in our credit ratings, which could limit i) our ability to issue debt at terms that are favorable to us, or ii) a financial institution's willingness to participate in our accounts payable program and reduce the attractiveness of the accounts payable program to participating suppliers who may sell payment obligations from us to financial institutions, which could impact our accounts payable program.\n35\nTable of Contents\nCRITICAL ACCOUNTING ESTIMATES\nThe process of preparing our consolidated \nfinancial\n statements in conformity with U.S. GAAP requires the use of estimates and judgments that affect the reported amounts of assets, liabilities, revenue, and expenses. Critical accounting estimates are both fundamental to the portrayal of a company’s financial condition and results and require difficult, subjective or complex estimates and assessments. These estimates and judgments are based on historical experience, future expectations and other factors and assumptions we believe to be reasonable under the circumstances. The most significant estimates and judgments are reviewed on an ongoing basis and revised when necessary. We have not made any material changes in the accounting methodology we use to assess or measure our critical accounting estimates. We have identified the items described below as our critical accounting estimates. We do not believe there is a reasonable likelihood that there will be a material change in the future estimates or assumptions we use in our critical accounting estimates. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to gains or losses that could be material to our consolidated financial statements. See Note 2 of the Notes to our Consolidated Financial Statements for a discussion of these and other accounting policies.\nImpairment Assessment of Goodwill and Other Indefinite Lived Intangible Assets\nWe conduct tests for impairment of our goodwill and our other indefinite lived intangible assets annually, as of October 1, or more frequently if events or circumstances indicate the carrying amount may not be recoverable. We use present value and other valuation techniques to make this assessment. If the carrying amount of goodwill or an intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. For purposes of impairment testing, we assign goodwill to the reporting unit that benefits from the synergies arising from each business combination, and we also assign indefinite lived intangible assets to our reporting units. \nOur reportable segments as of October 1, 2024 were:\n•\nU.S. Refreshment Beverages\n (reporting units: U.S. Beverage Concentrates, U.S. Warehouse Direct, and Direct Store Delivery)\n•\nU.S. Coffee\n (reporting unit: U.S. Coffee)\n•\nInternational\n (reporting units: Canada Beverage Concentrates, Canada Warehouse Direct, Canada Coffee, and Latin America Beverages)\nFor both goodwill and other indefinite lived intangible assets, we have the option to first assess qualitative factors to determine whether the fair value of either the reporting unit or indefinite lived intangible asset is \"more likely than not\" less than its carrying value, also known as a Step 0 analysis. \nIf a quantitative analysis is required:\n•\nThe impairment test for indefinite lived intangible assets encompasses calculating a fair value of an indefinite lived intangible asset and comparing the fair value to its carrying value. If the carrying value exceeds the estimated fair value, impairment is recorded.\n•\nThe impairment tests for goodwill include comparing fair value of the respective reporting unit with its carrying value, including goodwill and considering any indefinite lived intangible asset impairment charges.\nAs of October 1, 2024, we performed a quantitative analysis for goodwill and certain of our indefinite lived brand assets, whereby we used an income approach, or in some cases a combination of income and market based approaches, to determine the fair value of our assets, as well as an overall consideration of market capitalization and enterprise value. These types of analyses contain uncertainties because they require management to make assumptions and to apply judgment to estimate industry and economic factors and the profitability of future business strategies. These assumptions could be negatively impacted by various risks discussed in Item 1A, \nRisk Factors\n, in this Annual Report on Form 10-K.\n36\nTable of Contents\nCritical assumptions and estimates for quantitative analyses include revenue growth and profit performance over the next five year period, based on our strategic plan, as well as an appropriate discount rate and long-term growth rate, as applicable. Our strategic plan is updated as part of our annual planning process and is reviewed and approved by management, and includes assumptions related to macroeconomic conditions, competitive activities, productivity initiatives, and available market data. Discount rates are based on a weighted average cost of equity and cost of debt, adjusted with various risk premiums. Long-term growth rates are based on the long-term inflation forecast, industry and category growth trends, and the long-term economic growth potential. \nThe following table provides the range of rates used in the analysis as of October 1, 2024:\nRate\nMinimum\nMaximum\nDiscount rates\n7.0\n \n%\n9.5\n \n%\nLong-term growth rates\n—\n \n%\n3.5\n \n%\nThe following table shows the non-cash impairment charges that were recorded for goodwill and for indefinite lived brand assets for the years presented:\nYear Ended December 31, \n(in millions)\n2024\n2023\n2022\nGoodwill\n(1)\n$\n306\n \n$\n— \n$\n— \nIndefinite lived brand assets\n(2)\n412\n \n— \n472 \n(1)\nGoodwill attributed to the U.S. WD reporting unit was impaired by the amount its carrying value exceeded its fair value.\n(2)\nIndefinite lived brand assets, led primarily by Snapple for the year ended December 31, 2024, and Bai for the year ended December 31, 2022, were impaired to bring the respective carrying value equal to its fair value.\nSensitivity Analysis - Discount Rate\nFor goodwill, holding all other assumptions in the analysis constant, including the revenue and profit performance assumption, the effect of a 0.50% increase in the discount rate used to determine the fair value of the reporting units as of October 1, 2024, would result in additional non-cash impairment charges of $198 million to our U.S. WD reporting unit, but would not change our conclusion on any other reporting units.\nFor the indefinite-lived priority brand assets quantitatively assessed, holding all other assumptions in the analysis constant, including the revenue and profit performance assumption, the effect of a 0.50% increase in the discount rate used to determine the fair value of those assets as of October 1, 2024, would impact the amount of headroom over the carrying value of the following assets as follows (in millions):\nSelected Discount Rate\nDiscount Rate Increase of 0.50%\nHeadroom Percentage\nCarrying Value\nFair Value\nCarrying Value\nFair Value\nBrands\n0%\n(1)\n$\n280\n \n$\n280\n \n$\n1,730\n \n$\n1,620\n \nLess than 25%\n2,580\n \n2,900\n \n1,130\n \n1,290\n \n25 - 50%\n1,488\n \n2,160\n \n1,627\n \n2,210\n \nIn excess of 50%\n14,481\n \n34,490\n \n14,342\n \n31,650\n \n(1)\nCarrying value at the selected discount rate reflects the results of the annual impairment analysis recognized during the year ended December 31, 2024. \nSensitivity Analysis - Long-Term Growth Rate\nFor goodwill, holding all other assumptions in the analysis constant, including the discrete period revenue and profit performance assumptions as well as the discount rates, the effect of a 0.50% decrease in the long-term growth rate used to determine the fair value of the reporting units as of October 1, 2024, would result in additional non-cash impairment charges of $147 million to our U.S. WD reporting unit, but would not change our conclusion on any other reporting units. \n37\nTable of Contents\nFor the indefinite-lived priority brand assets quantitatively assessed, holding all other assumptions in the analysis constant, including the discrete period revenue and profit performance assumptions as well as the discount rates, the effect of a 0.50% decrease in the long-term revenue growth rate used to determine the fair value of those assets as of October 1, 2024, would impact the amount of headroom over the carrying value of the following assets as follows (in millions):\nSelected Long-Term Growth Rate\nLong-Term Growth Rate\n Decrease of 0.50%\nHeadroom Percentage\nCarrying Value\nFair Value\nCarrying Value\nFair Value\nBrands\n0%\n(1)\n$\n280 \n$\n280 \n$\n1,730 \n$\n1,660 \nLess than 25%\n2,580 \n2,900 \n1,130 \n1,310 \n25 - 50%\n1,488 \n2,160 \n1,627 \n2,240 \nIn excess of 50%\n14,481 \n34,490 \n14,342 \n32,150 \n(1)\nCarrying value at the selected long-term growth rate reflects the results of the annual impairment analysis recognized during the year ended December 31, 2024.\nRefer to Note 5 of the Notes to our Consolidated Financial Statements for additional information about our impairment assessments.\nRevenue Recognition\nWe recognize revenue when performance obligations under the terms of a contract with the customer are satisfied. Accruals for customer incentives, sales returns, and marketing programs are established for the expected payout based on contractual terms, volume-based metrics, and/or historical trends.\nOur customer incentives, sales returns, and marketing accrual methodology contains uncertainties because it requires management to make assumptions and to apply judgment regarding our contractual terms in order to estimate our customer participation and volume performance levels which impact the revenue recognition. Our estimates are based primarily on a combination of known or historical transaction experiences. Differences between estimated revenue and actual revenue are normally insignificant and are recognized into earnings in the period differences are determined.\nAdditionally, judgment is required to ensure the classification of the spend is correctly recorded as either a reduction from gross sales or advertising and marketing expense, which is a component of our SG&A expenses.\nA 10% change in the accrual for our customer incentives, sales returns and marketing programs would have affected our income from operations by $52 million for the year ended December 31, 2024.\nIncome Taxes\nWe establish income tax liabilities to remove some or all of the income tax benefit of any of our income tax positions based upon one of the following: \n•\nthe tax position is not “more likely than not” to be sustained, \n•\nthe tax position is “more likely than not” to be sustained, but for a lesser amount, or\n•\nthe tax position is “more likely than not” to be sustained, but not in the financial period in which the tax position was originally taken.\nOur liability for uncertain tax positions contains uncertainties because management is required to make assumptions and to apply judgment to estimate the exposures associated with our various tax positions.\n38\nTable of Contents\nOur income tax returns, like those of most companies, are periodically audited by domestic and foreign tax authorities. These audits include questions regarding our tax positions, including the timing and amount of deductions and the allocation of income among various tax jurisdictions. As these audits progress, events may occur that cause us to change our liability for uncertain tax positions. To the extent we prevail in matters for which a liability for uncertain tax positions has been established, or are required to pay amounts in excess of our established liability, our effective tax rate in a given financial statement period could be materially affected. An unfavorable tax settlement generally would require use of our cash and may result in an increase in our effective tax rate in the period of resolution. A favorable tax settlement may be recognized as a reduction in our effective tax rate in the period of resolution.\nBusiness Combinations\nWe record acquisitions using the purchase method of accounting. All of the assets acquired and liabilities assumed are recorded at fair value as of the acquisition date. The excess of the purchase price over the estimated fair values of the net tangible and intangible assets acquired is recorded as goodwill.\nThe application of the purchase method of accounting for business combinations requires management to make significant estimates and assumptions in the determination of the fair value of assets acquired and liabilities assumed, in order to properly allocate purchase price consideration between assets that are depreciated and amortized from goodwill. The fair value assigned to tangible and intangible assets acquired and liabilities assumed are based on management’s estimates and assumptions, as well as other information compiled by management, including valuations that utilize customary valuation procedures and techniques. Significant assumptions and estimates include, but are not limited to, the cash flows that an asset is expected to generate in the future, the appropriate weighted-average cost of capital, and the cost savings expected to be derived from acquiring an asset, if applicable.\nFurther, certain of our acquisitions may include other forms of consideration, including mandatorily redeemable liabilities and other earn-out arrangements. As of the acquisition date, we record such consideration, as applicable, at the estimated fair value of the expected future payments associated with the obligation. Any changes to the recorded fair value of the consideration are recognized in earnings in the period in which they occur.\nIf the actual results differ from the estimates and judgments used in these estimates, the amounts recorded in the financial statements may be exposed to potential impairment of the intangible assets and goodwill, as discussed in\n Impairment Assessment of Goodwill and Other Indefinite Lived Intangible Assets \nabove. \n39\nTable of Contents\nImpairment Assessment of Equity Method Investments Without Readily Determinable Fair Values\nEquity method investments are reviewed quarterly to determine whether a significant event or change in circumstances has occurred that may have an adverse effect on the fair value of each investment. When such events or changes occur, we evaluate the fair value compared to our carrying value of the investment. For investments in non-publicly traded companies, management’s assessment of fair value is based on various valuation methodologies, including the option pricing model when the investment is in a preferred class of security, discounted cash flows, market multiples, and the impact of our contractual terms with the investee, as appropriate. We consider the assumptions that we believe a market participant would use in evaluating estimated future cash flows when employing the discounted cash flow methodologies. The ability to accurately predict future cash flows, especially in emerging and developing markets, may impact the determination of fair value. In the event the fair value of an investment declines below our carrying value, management is required to determine if the decline in fair value is other than temporary. If management determines the decline is other than temporary, an impairment charge is recorded. \nInvestments in Variable Interest Entities\nWe hold equity investments in entities that are considered VIEs, including Nutrabolt and Chobani. We would be required to consolidate a VIE for which we are determined to be the primary beneficiary. To determine if we are the primary beneficiary of a VIE, we assess specific criteria and use judgment when determining if we have the power to direct the significant activities of the VIE and the obligation to absorb losses or receive benefits from the VIE that may be significant to the VIE. Factors considered include risk and reward sharing, voting rights, involvement in day-to-day capital and operating decisions, representation on a VIE’s governance structure, existence of unilateral kick-out rights exclusive of protective rights or voting rights, and level of economic disproportionality between us and the VIE’s other partner(s). \nWe have determined that we are not the primary beneficiary of any VIEs. Refer to Note 19 of the Notes to our Consolidated Financial Statements for additional information on our investments in VIEs.\nEFFECT OF RECENT ACCOUNTING PRONOUNCEMENTS\nRefer to Note 2 of the Notes to our Consolidated Financial Statements for a discussion of recently issued accounting standards and recently adopted provisions of \nU.S. GAAP\n.\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nThe Notes are fully and unconditionally guaranteed by certain of our direct and indirect subsidiaries (the \"Guarantors\"), as defined in the indentures governing the Notes. The Guarantors are 100% owned either directly or indirectly by us and jointly and severally guarantee, subject to the release provisions described below, our obligations under the Notes. None of our subsidiaries organized outside of the U.S., any of the subsidiaries held by Maple Parent Holdings Corp. prior to the DPS Merger, or any of the subsidiaries acquired after the DPS Merger (collectively, the \"Non-Guarantors\") guarantee the Notes. The subsidiary guarantees with respect to the Notes are subject to release upon the occurrence of certain events, including the sale of all or substantially all of a subsidiary's assets, the release of the subsidiary's guarantee of our other indebtedness, our exercise of the legal defeasance option with respect to the Notes, and the discharge of our obligations under the applicable indenture. \nThe following schedules present the summarized financial information for Keurig Dr Pepper Inc. (the “Parent”) and the Guarantors on a combined basis after intercompany eliminations; the Parent and the Guarantors' amounts due from and amounts due to Non-Guarantors are disclosed separately. The consolidating schedules are provided in accordance with the reporting requirements of Rule 13-01 under SEC Regulation S-X for the issuer and guarantor subsidiaries. \n40\nTable of Contents\nThe summarized financial information for the Parent and Guarantors were as follows:\n(in millions)\nFor the Year Ended December 31, 2024\nNet sales\n$\n9,720\n \nGross profit\n5,082\n \nIncome from operations\n600\n \nNet income attributable to KDP\n1,441\n \nDecember 31,\n(in millions)\n2024\n2023\nCurrent assets\n$\n2,373\n \n$\n1,957 \nNon-current assets\n49,827\n \n48,029 \nTotal assets\n(1)\n$\n52,200\n \n$\n49,986 \nCurrent liabilities\n$\n6,101\n \n$\n6,749 \nNon-current liabilities\n20,984\n \n16,689 \nTotal liabilities\n(2)\n$\n27,085\n \n$\n23,438 \n(1)\nIncludes $115 million and $56 million of intercompany receivables due to the Parent and Guarantors from the Non-Guarantors as of December 31, 2024 and December 31, 2023, respectively. \n(2)\nIncludes $1,997 million and $1,399 million of intercompany payables due to the Non-Guarantors from the Parent and Guarantors as of December 31, 2024 and December 31, 2023, respectively.\n41\nTable of Contents",
  "item2": null
}