{
  "source_file": "keys-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations (Unaudited)\nThe following discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto included elsewhere in this Form 10-Q and our Annual Report on Form 10-K. This report contains forward-looking statements which include, but are not limited to predictions, future guidance, projections, beliefs, and expectations about the company’s trends, seasonality, cyclicality and growth in, and drivers of, the markets we sell into, our strategic direction, earnings from our foreign subsidiaries, remediation activities, new solution and service introductions, the ability of our solutions to meet market needs, changes to our manufacturing processes, the use of contract manufacturers, the impact of government regulations on our ability to conduct operations, our liquidity position, our ability to generate cash from operations, growth in our businesses, our investments, the potential impact of adopting new accounting pronouncements, our financial results, our purchase commitments, our contributions to our pension plans, the selection of discount rates and recognition of any gains or losses for our benefit plans, our cost-control activities, savings and headcount reduction recognized from our restructuring programs and other cost saving initiatives, and other regulatory approvals, the integration of our completed acquisitions and other transactions, and our transition to lower-cost regions. The forward-looking statements involve risks and uncertainties that could cause Keysight’s results to differ materially from management’s current expectations. Such risks and uncertainties include, but are not limited to, the impact of global economic conditions such as inflation or potential recession, the impacts of increased trade tensions such as an imposition of or increase in tariffs and tightening of export control regulations, slowing demand for products or services, volatility in financial markets, reduced access to credit, changes in interest rates, the existence of political or economic instability, uncertainty related to the impact of national elections results in the U.S., U.K., and Europe, impacts of geopolitical tension and conflict in regions outside of the U.S., the impact of new and ongoing litigation, impacts related to net zero emissions commitments, and the impact of volatile weather caused by environmental conditions such as climate change. Our actual results could differ materially from the results contemplated by these forward-looking statements due to various factors, including but not limited to those risks and uncertainties discussed in Part II Item 1A and elsewhere in this Form 10-Q.\nBasis of Presentation\nThe financial information presented in this Form 10-Q is not audited and is not necessarily indicative of our future consolidated financial position, results of operations or cash flows. Our fiscal year-end is October 31, and our fiscal quarters end on January 31, April 30 and July 31. Unless otherwise stated, these dates refer to our fiscal year and fiscal quarter periods.\nOverview and Executive Summary\nKeysight Technologies, Inc. (“we,” “us,” “our,” “Keysight” or “the company”), incorporated in Delaware on December 6, 2013, is a global innovator in the computing, communications and electronics market, committed to advancing our customers’ business success by helping them solve critical challenges in the development and commercialization of their products and services. Our mission, “accelerating innovation to connect and secure the world,” speaks to the value we provide our customers in a world of ever-increasing technological complexity. We deliver this value through a broad range of design and test solutions that address the critical challenges our customers face in bringing their innovations to market on ever-shorter schedules.\n25\nTable of Contents\nWe invest in research and development (“R&D”) to align our business with available markets and position the company for growth. Our R&D efforts focus on the development of new software and hardware products, as well as improvements to existing products, and solutions aligned to the industries that we serve. We anticipate that we will continue to have significant R&D expenditures in order to maintain our competitive position with a continuous flow of innovative, high-quality software, solutions, products and services. We remain committed to investment in R&D and have focused our development efforts on strategic opportunities to capture future growth.\nImpact of U.S. government tariffs\nBeginning in the second quarter of fiscal 2025, the U.S. government announced tariffs on products from all countries and additional reciprocal tariffs on certain countries. In response, China and other countries announced retaliatory tariffs against certain imports from the United States. There have been recent changes effective August 1, 2025, resulting in broad-based increases in tariff rates. These tariffs have impacted our financial results for the three and nine months ended July 31, 2025. We continue to closely monitor and assess the potential impact of these tariffs on our results and take actions across multiple vectors to reduce the impact. This multipronged mitigation approach spans our global manufacturing footprint and sourcing strategies, as well as pricing and cost actions. For additional discussion of risks related to tariffs and trade relations, please refer to the risk factor, in Part II, Item 1A. Risk Factors.\nThree and nine months ended July 31, 2025 and 2024\nTotal orders for the three and nine months ended July 31, 2025 were $1,340 million and $3,919 million, respectively, an increase of 7 percent and 6 percent, respectively, compared to the same periods last year. For the three and nine months ended July 31, 2025, foreign currency movements had a favorable impact of 1 percentage point and an immaterial impact on the year-over-year change, respectively. For the three and nine months ended July 31, 2025, acquisitions had an immaterial impact on the year-over-year change. For the three months ended July 31, 2025, orders increased in the Americas and Europe, partially offset by a decline in Asia Pacific. For the nine months ended July 31, 2025, orders increased across all regions.\nRevenue for the three and nine months ended July 31, 2025 was $1,352 million and $3,956 million, respectively, an increase of 11 percent and 7 percent, respectively, compared to the same periods last year. For the three and nine months ended July 31, 2025, foreign currency movements had a favorable impact of 2 percentage points and an immaterial impact on the year-over-year change, respectively. For the three and nine months ended July 31, 2025, acquisitions had an immaterial impact on the year-over-year change. For the three and nine months ended July 31, 2025, revenue increased in both the Communications Solutions Group (“CSG”) and the Electronic Industrial Solutions Group (“EISG”). Revenue from CSG and EISG represented 70 percent and 30 percent, respectively, of total revenue for the three months ended July 31, 2025. Revenue from CSG and EISG represented 69 percent and 31 percent, respectively, of total revenue for the nine months ended July 31, 2025.\nNet income for the three and nine months ended July 31, 2025 was $191 million and $617 million, respectively, compared to $389 million and $687 million, respectively, for the same periods last year. The decrease in net income for the three months ended July 31, 2025 was primarily driven by a prior year income tax benefit due to one-time discrete tax items, higher people related costs, net \nimpact of tariffs,\n losses on derivative instruments and higher acquisition and integration costs, partially offset by higher revenue and net gains on our equity investments. The decrease in net income for the nine months ended July 31, 2025 was primarily driven by a prior year income tax benefit due to one-time discrete tax items, higher people related costs, higher acquisition and integration costs and net \nimpact of tariffs\n, partially offset by higher revenue and net gains on our equity investments and derivative instruments.\nOutlook\nOur first-to-market solutions strategy enables customers to develop new technologies and accelerate innovation and provides a platform for Keysight's long-term growth. Our customers are expected to continue to make R&D investments in certain next-generation technologies and applications, including evolution of 5G, early 6G, high-speed data center networks and infrastructure, satellite networks, Artificial Intelligence (“AI”), industrial internet of things (“IoT”), defense modernization, and next generation electric vehicles and autonomous vehicles. We continue to engage actively with our customers and closely monitor the current macroeconomic environment, including tariffs, trade restrictions and tightening of export control regulations, monetary and fiscal policies, and geopolitical tensions. We remain confident in the long-term secular growth trends of our markets and our ability to outperform in a variety of market conditions.\nCritical Accounting Policies and Estimates\nThere were no material changes during the three and nine months ended July 31, 2025 to the critical accounting estimates described in “Management's Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\n26\nTable of Contents\nAdoption of New Accounting Pronouncements\nSee Note 1, “Overview and Summary of Significant Accounting Policies,” to the condensed consolidated financial statements for a description of new accounting pronouncements.\nCurrency Exchange Rate Exposure\nOur revenues, costs and expenses, and monetary assets and liabilities are exposed to changes in foreign currency exchange rates as a result of our global operating, investing and financing activities. We hedge revenues, expenses, and balance sheet exposures that are not denominated in the functional currencies of our subsidiaries on a short-term and anticipated basis. The result of the hedging has been included in the condensed consolidated balance sheet and condensed consolidated statement of operations. We experience some fluctuations within individual lines of the condensed consolidated balance sheet and condensed consolidated statement of operations because our hedging program is not designed to offset the currency movements in each category of revenues, expenses, monetary assets and liabilities. Our cash flow hedging program is designed to hedge short-term currency movements based on a rolling period of up to twelve months. Therefore, we are exposed to currency fluctuations over the longer term. To the extent that we are required to pay for all, or portions, of an acquisition price in foreign currencies, we may enter into foreign exchange contracts to reduce the risk that currency movements will impact the U.S. dollar cost of the transaction.\nResults from Operations - Three and nine months ended July 31, 2025 and 2024\nA summary of our results is as follows:\n \nThree Months Ended\nNine Months Ended\nYear-over-Year\n \nJuly 31,\nJuly 31,\nChange\n \n2025\n2024\n2025\n2024\nThree Months\nNine Months\n(in millions, except margin data)\nRevenue\n$\n1,352 \n$\n1,217 \n$\n3,956 \n$\n3,692 \n11%\n7%\nGross margin\n61.7\n%\n62.0\n%\n62.4\n%\n63.1\n%\n—\n(1) ppt\nResearch and development\n$\n250 \n$\n226 \n$\n749 \n$\n686 \n11%\n9%\nPercentage of revenue\n19\n%\n19\n%\n19\n%\n19\n%\n— \n—\nSelling, general and administrative\n$\n354 \n$\n329 \n$\n1,075 \n$\n1,052 \n7%\n2%\nPercentage of revenue\n26\n%\n27\n%\n27\n%\n28\n%\n(1) ppt\n(1) ppt\nOther operating expense (income), net\n$\n(4)\n$\n(5)\n$\n(15)\n$\n(10)\n(29)%\n54%\nIncome from operations\n$\n234 \n$\n205 \n$\n659 \n$\n603 \n14%\n9%\nOperating margin\n17.3\n%\n16.8\n%\n16.7\n%\n16.3\n%\n—\n— \nInterest income\n$\n31 \n$\n19 \n$\n71 \n$\n60 \n64%\n18%\nInterest expense\n$\n(28)\n$\n(21)\n$\n(68)\n$\n(61)\n35%\n12%\nOther income (expense), net\n$\n4 \n$\n10 \n$\n98 \n$\n15 \n(58)%\n583%\nIncome before taxes\n$\n241 \n$\n213 \n$\n760 \n$\n617 \n13%\n23%\nProvision (benefit) for income taxes\n$\n50 \n$\n(176)\n$\n143 \n$\n(70)\n—\n—\nNet income\n$\n191 \n$\n389 \n$\n617 \n$\n687 \n(51)%\n(10)%\nRevenue\nRevenue is recognized upon transfer of control of the promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services. Returns are recorded in the period received from the customer and historically have not been material.\n27\nTable of Contents\nThe following table provides the percentage change in revenue for the three and nine months ended July 31, 2025 by geographic region and the impact of foreign currency movements as compared to the same period last year.\nYear-over-Year Change\n \nThree Months Ended\nNine Months Ended\n \nJuly 31, 2025\nJuly 31, 2025\nGeographic Region\nActual\nCurrency Impact Favorable (Unfavorable)\nActual\nCurrency Impact Favorable (Unfavorable)\nAmericas\n13%\n—\n8%\n—\nEurope\n(2)%\n4 ppts\n(1)%\n1 ppt\nAsia Pacific\n15%\n2 ppts\n10%\n—\nTotal revenue\n11%\n2 ppts\n7%\n—\nRefer to the “Segment Overview” section of Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations for additional information on changes in revenue during the three and nine months ended July 31, 2025. \nGross Margin, Operating Margin and Income Before Taxes\nGross margin for the three months ended July 31, 2025 was flat compared to the same period last yea\nr, as the net impact of tariffs and higher people-related costs were offset by higher revenue volume and favorable pricing. \nGross margin for the nine months ended July 31, 2025 decreased 1 percentage point compared to the same period last yea\nr, primarily driven by the net impact of tariffs and unfavorable mix, partially offset by favorable pricing, higher revenue volume and lower restructuring costs.\nR&D expense for the three and nine months ended July 31, 2025 increased 11 percent and 9 percent, respectively, compared to the same periods last year, \nprimarily driven by continued investments in key growth opportunities in our end markets and leading-edge technologies and higher variable people-related costs. \nSelling, general and administrative expense for the three months ended July 31, 2025 increased 7 percent, compared to the same period last ye\nar, \nprimarily driven by\n higher acquisition and integration costs, people-related costs and infrastructure costs. S\nelling, general and administrative expense for the nine months ended July 31, 2025 increased 2 percent, compared to the same period last ye\nar, \nprimarily driven by\n higher acquisition and integration costs, people-related costs and travel costs, partially offset by lower infrastructure costs and amortization of acquisition-related balances.\nOther operating expense (income), net for the three and nine months ended July 31, 2025 was income of $4 million and $15 million, respectively, compared to income of $5 million and $10 million, respectively, for the same periods last year.\nOperating margin for the three and nine months ended July 31, 2025 was flat compared to the same periods last year, as the decrease in operating expenses as a percentage of revenue was offset by gross margin movements.\nInterest income for the three and nine months ended July 31, 2025 was $31 million and $71 million, respectively, compared to $19 million and $60 million, respectively, for the same periods last year and primarily relates to interest earned on our cash balances. Interest expense for three and nine months ended July 31, 2025 was $28 million and $68 million, respectively, compared to $21 million and $61 million, respectively, for the same periods last year and primarily relates to interest on our senior notes. The increase in interest expense for the three and nine months ended July 31, 2025 is primarily driven by interest expense and amortization of debt issuance costs related to our 2030 Senior Notes. (see Note 10, “ Debt,” for additional information).\nOther income (expense), net for the three and nine months ended July 31, 2025 was income of $4 million and $98 million, respectively, compared to income of $10 million and $15 million, respectively, for the same periods last year. The decrease in other income (expense), net for the three months ended July 31, 2025 is primarily driven by losses on derivative instruments (see Note 9, “Derivatives,” for additional information), partially offset by net gains on our equity investments and lower amortization of actuarial losses. The increase in other income (expense), net for the nine months ended July 31, 2025 is primarily driven by net gains on our equity investments, gains on derivative instruments (see Note 9, “Derivatives,” for additional information), and lower amortization of actuarial losses.\nAs of July 31, 2025 and 2024, our headcount was approximately 15,500 and 15,400, respectively.\n28\nTable of Contents\nIncome Taxes \nThe following table provides income tax details:\nThree Months Ended\nNine Months Ended\nJuly 31,\nJuly 31,\n \n2025\n2024\n2025\n2024\n(in millions, except percentages)\nIncome before taxes\n$\n241\n$\n213\n$\n760\n$\n617\nProvision (benefit) for income taxes\n$\n50\n$\n(176)\n$\n143\n$\n(70)\nEffective tax rate\n20.8\n%\n(81.9\n%)\n18.8\n%\n(11.2\n%)\nThe effective tax rate for the three and nine months ended July 31, 2025 was lower than the U.S. statutory federal income tax rate primarily due to a lower effective tax rate on foreign earnings, partially offset by U.S. taxes on those earnings and the impact of Pillar Two minimum taxes.\nIn July 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted into law in the U.S. The OBBBA includes numerous provisions that affect corporate taxation, including changes to bonus depreciation, the expensing of domestic research costs, and modifications to certain U.S. international tax rules. The company has analyzed the impacts of the OBBBA and reflected them in the current period. These impacts do not have a material effect on the tax rate for the three and nine months ended July 31, 2025. The majority of the tax law changes will take effect in future years.\nThe Organization for Economic Cooperation and Development (“OECD”) reached agreement among certain member countries to implement a global minimum tax framework, commonly referred to as Pillar Two, which established a minimum 15 percent income tax rate. Various countries have passed legislation to comply with the Pillar Two model rules. A subset of these rules became effective for Keysight in the current fiscal year. While we expect to meet transitional safe harbor requirements in most jurisdictions, there are a limited number of jurisdictions where we expect Pillar Two taxes to apply. The income tax provision for the three and nine months ended July 31, 2025 included the effects of Pillar Two taxes.\nThe income tax expense for the three and nine months ended July 31, 2025 was higher compared to the same periods last year primarily due to the inclusion of one-time discrete tax benefits from U.S. amended tax return filings in relation to the Global Intangible Low-Taxed Income (“GILTI”) tax regulations and the settlement of a Malaysia uncertain tax position in the three and nine months ended July 31, 2024. The income tax expense for the three and nine months ended July 31, 2025 included a net discrete expense of $\n1\n million and $\n11\n million, respectively. The income tax expense for the three and nine months ended July 31, 2024 included a net discrete benefit of $\n179\n million and $\n178\n million, respectively. The discrete tax expense for the three and nine months ended July 31, 2025 was higher compared to the same periods last year primarily due to one-time discrete tax benefits from U.S. amended tax return filings in relation to the GILTI tax regulations and the settlement of a Malaysia uncertain tax position in the three and nine months ended July 31, 2024.\nOn June 14, 2019, the U.S. Department of the Treasury (“Treasury”) issued final regulations relating to GILTI under IRC § 951A (the “tax regulations”). The tax regulations contained language that disallowed GILTI tax deductions for intangible asset amortization resulting from the Singapore restructuring completed in 2018. In the third quarter of 2024, we concluded that Treasury exceeded its regulatory authority and the intangible asset amortization should be deductible. We amended our U.S. federal income tax returns for the open tax years to claim the deduction and filed a lawsuit seeking a tax refund. See Note 13, “Commitments and Contingencies,” for additional information. The Singapore intangible assets will continue to be amortized for GILTI tax purposes until 2033. If we are ultimately unsuccessful in defending our refund claim, we will be required to reverse the benefit previously recorded, which would most likely result in a material increase in the effective tax rate and our income tax liability.\nKeysight benefits from tax incentives in several jurisdictions, most significantly in Singapore and Malaysia. The tax incentives provide lower rates of taxation on certain classes of income and require thresholds of investments and employment in those jurisdictions. The Malaysia tax incentive expires October 31, 2025. The Singapore tax incentive expires July 31, 2029. The impact of the tax incentives decreased income taxes by $\n49\n million for the nine months ended July 31, 2025.\nThe open tax years for the U.S. federal income tax return and most state income tax returns are from November 1, 2019 through the current tax year. Keysight’s U.S. federal income tax returns for 2020, 2021 and 2022 are currently under audit by the IRS. For the majority of our non-U.S. entities, the open tax years are from November 1, 2019 through the current tax year.\nAt this time, management does not believe that the outcome of any future or currently ongoing examination will have a material impact on our consolidated financial statements. We believe that we have adequate provisions for any adjustments that may result from tax examinations. However, the outcome of tax examinations cannot be predicted with certainty. Given the numerous tax years and matters that remain subject to examination in various tax jurisdictions, the ultimate resolution of current \n29\nTable of Contents\nand future tax examinations could be inconsistent with management’s current expectations. If that were to occur, it could have an impact on our effective tax rate in the period in which such examinations are resolved.\nWe are subject to income taxes in the U.S. and several countries globally. Changes in tax law, tax rates, or in the amount of earnings in countries with differing tax rates may affect certain deferred tax assets and liabilities recorded and our effective tax rate.\nIn June 2025, the United States and the other six countries that make up the G7 nations jointly announced that U.S. companies would be exempted from certain minimum taxes related to the OECD agreement, commonly referred to as Pillar Two. However, significant details regarding the G7 announcement remain uncertain and individual countries that have enacted the OECD agreement, including countries not within the G7, must amend their local legislation for the G7 announcement to become effective. We continue to closely monitor Pillar Two developments.\nWe do not recognize deferred taxes for temporary differences expected to impact the GILTI tax expense in future years. We recognize the tax expense related to GILTI in each year in which the tax is incurred.\nSegment Overview\nWe have two reportable operating segments, CSG and EISG. The profitability of each of the segments is measured after excluding share-based compensation expense, amortization of acquisition-related balances, acquisition and integration costs, restructuring costs, interest income, interest expense and other items.\nA significant portion of the segments' expenses arise from allocated corporate charges, expenses related to our centralized sales force, and global services, marketing and technology functions that are provided to the segments in order to realize economies of scale and to efficiently use resources. Corporate charges include legal, accounting, real estate, insurance, information technology, treasury and other corporate infrastructure expenses. Segment allocations are determined on a basis that we consider to be a reasonable reflection of the utilization of services provided to, or benefits received by, the segments. Newly acquired businesses are not allocated these charges until integrated into our shared services and corporate infrastructure.\nCommunications Solutions Group (“CSG”)\nCSG serves customers spanning the global commercial communications and aerospace, defense, and government end markets. The group’s solutions consist of electronic design and test software, instrumentation, systems, and related services. These solutions are used in the simulation, design, validation, manufacturing, installation, and optimization of communication systems in wireless, wireline, enterprise, and aerospace, defense, and government end markets. In addition, the group provides automated software test solutions to automatically identify, build, and execute tests critical to digital business success and a strong customer experience.\nRevenue\nThree Months Ended\nNine Months Ended\nYear- over-Year\nJuly 31,\nJuly 31,\nChange\n2025\n2024\n2025\n2024\nThree Months\nNine Months\n(in millions)\nTotal revenue\n$\n940 \n$\n847 \n$\n2,736 \n$\n2,526 \n11%\n8%\nCSG revenue for the three and nine months ended July 31, 2025 increased 11 percent and 8 percent, respectively, compared to the same periods last year. For the three and nine months ended July 31, 2025, foreign currency movements had a favorable impact of 1 percentage point and an immaterial impact on the year-over-year change. For the three and nine months ended July 31, 2025, acquisitions had an immaterial impact on the year-over-year change. For the three months ended July 31, 2025, revenue increased in the Americas and Asia Pacific, partially offset by a decline in Europe. For the nine months ended July 31, 2025, revenue increased in the Americas and Asia Pacific and was flat in Europe. Revenue increased in both the commercial communications and the aerospace, defense, and government end markets for the three and nine months ended July 31, 2025. The increase was primarily driven by higher investments in high-speed networks to support increasing demand for AI capabilities and higher investment in aerospace and defense solutions. Our customers continued their R&D investments in next-generation technologies and applications, including AI-driven data center expansion, ongoing 5G standards development and deployment, 400G/800G Ethernet, development of new communications technologies (e.g., 6G, Open Radio Access Networks, commercial non-terrestrial networks, quantum), high-speed networking and major defense and government programs worldwide.\nOur commercial communications end market revenue for the three and nine months ended July 31, 2025 increased 13 percent and 9 percent, respectively, year-over-year and represented 69 percent and 67 percent, respectively, of total CSG revenue. For the three months ended July 31, 2025, revenue increased in the Americas and Asia Pacific, partially offset by a decline in Europe. For the nine months ended July 31, 2025, revenue increased across all regions. The year-over-year increase \n30\nTable of Contents\nin revenue for the three and nine months ended July 31, 2025 was primarily driven by R&D investments in terabit solutions and expanding 400G/800G transceiver manufacturing capacity to meet rising demand for AI capabilities. We continued to see investments in high-speed networks due to increasing need for AI capabilities in the data center infrastructure ecosystem, which drove demand for our 400G/800G Ethernet solutions, both in R&D and manufacturing.\nOur aerospace, defense, and government end market revenue for the three and nine months ended July 31, 2025 increased 8 percent and 7 percent, respectively, year-over-year and represented 31 percent and 33 percent, respectively, of total CSG revenue. For the three and nine months ended July 31, 2025, revenue increased in the Americas and Asia Pacific partially offset by a decline in Europe. The year-over-year increase in revenue was primarily driven by strong growth in space and satellite solutions and continued investments in radar and spectrum operations.\nGross Margin and Operating Margin\nThree Months Ended\nNine Months Ended\nYear- over-Year\nJuly 31,\nJuly 31,\nChange\n2025\n2024\n2025\n2024\nThree Months\nNine Months\n(in millions, except margin data)\nGross margin\n66.7\n%\n67.0\n%\n67.2\n%\n67.8\n%\n—\n(1) ppt\nResearch and development\n$\n176\n$\n154\n$\n519\n$\n461\n14%\n13%\nSelling, general and administrative\n$\n210\n$\n194\n$\n609\n$\n587\n8%\n4%\nOther operating expense (income), net\n$\n(3)\n$\n(3)\n$\n(11)\n$\n(8)\n2%\n44%\nIncome from operations\n$\n246\n$\n223\n$\n722\n$\n672\n10%\n7%\nOperating margin\n26.1\n%\n26.3\n%\n26.4\n%\n26.6\n%\n—\n—\nGross margin for the three months ended July 31, 2025 was flat compared to the same period last year, as the \nnet impact of tariffs and higher people-related costs were offset by higher revenue volume and favorable pricing\n. Gross margin for the nine months ended July 31, 2025 decreased 1 percentage point compared to the same period last year, \nprimarily driven by the net impact of tariffs and unfavorable mix, partially offset by favorable pricing and higher revenue volume.\nR&D expense for the three and nine months ended July 31, 2025 increased 14 percent and 13 percent, respectively, compared to the same periods last year, \nprimarily driven by continued investments in key growth opportunities in our end markets and leading-edge technologies and higher variable people-related costs\n. \nSelling, general and administrative expense for the three months ended July 31, 2025 increased 8 percent compared to the same period last year, primarily driven by higher people-related costs and infrastructure costs. Selling, general and administrative expense for the nine months ended July 31, 2025 increased 4 percent compared to the same period last year, primarily driven by higher people-related and infrastructure costs, and incremental costs from acquired businesses.\nOther operating expense (income), net for the three months ended July 31, 2025 and 2024 was income of $3 million. Other operating expense (income), net for the nine months ended July 31, 2025 and 2024 was income of $11 million and $8 million, respectively.\nOperating margin for the three and nine months ended July 31, 2025 was flat compared to the same periods last year, as gross margin movements were offset by a decline in operating expenses as a percentage of sales.    \nElectronic Industrial Solutions Group (“EISG”)\nEISG serves customers across a diverse set of end markets focused on automotive and energy, semiconductor solutions, and general electronics. The group's solutions consist of electronic design, test and simulation software, instrumentation, systems, and related services. These solutions are used in the simulation, design, validation, manufacturing, installation, and optimization of electronic equipment. \n31\nTable of Contents\nRevenue\nThree Months Ended\nNine Months Ended\nYear-over-Year\nJuly 31,\nJuly 31,\nChange\n2025\n2024\n2025\n2024\nThree Months\nNine Months\n(in millions)\nTotal revenue\n$\n412 \n$\n370 \n$\n1,220 \n$\n1,166 \n11%\n5%\nEISG revenue for the three and nine months ended July 31, 2025 increased 11 percent and 5 percent, respectively, compared to the same periods last year. For the three and nine months ended July 31, 2025, foreign currency movements had a favorable impact of 2 percentage points and an immaterial impact on the year-over-year change, respectively. For the three and nine months ended July 31, 2025, acquisitions had an immaterial impact on the year-over-year change. For the three months ended July 31, 2025, revenue increased across all regions. For the nine months ended July 31, 2025, revenue increased in the Americas and Asia Pacific, partially offset by a decline in Europe. The revenue for the three months ended July 31, 2025 increased across all electronic industrial markets. The revenue increase for the nine months ended July 31, 2025 reflected mixed demand across the electronic industrial markets with an increase in semiconductor measurements and general electronics measurement, partially offset by a decline in automotive and energy. Despite macroeconomic uncertainties, customer engagement remained high in their key long-term strategic initiatives, including R&D for AI-driven demand for advanced semiconductor technologies, software-defined vehicles and autonomous driving, industrial IoT, digital health and fab capacity.\nGross Margin and Operating Margin\nThree Months Ended\nNine Months Ended\nYear-over-Year\nJuly 31,\nJuly 31,\nChange\n2025\n2024\n2025\n2024\nThree Months\nNine Months\n(in millions, except margin data)\nGross margin\n57.4\n%\n57.5\n%\n59.3\n%\n60.4\n%\n—\n(1) ppt\nResearch and development\n$\n65\n$\n62\n$\n190\n$\n186\n4%\n2%\nSelling, general and administrative\n$\n82\n$\n79\n$\n241\n$\n246\n3%\n(2)%\nOther operating expense (income), net\n$\n(2)\n$\n(3)\n$\n(5)\n$\n(3)\n(41)%\n85%\nIncome from operations\n$\n92\n$\n74\n$\n298\n$\n274\n24%\n8%\nOperating margin\n22.3\n%\n20.1\n%\n24.4\n%\n23.5\n%\n2 ppts\n1 ppt\nGross margin for the three months ended July 31, 2025 was flat compared to the same period last year, as the \nnet impact of tariffs and higher people-related costs were offset by higher revenue volume and favorable pricing\n.\n \nGross margin for the nine months ended July 31, 2025 decreased 1 percentage point compared to the same period last year,\n primarily driven by the net impact of tariffs and unfavorable mix, partially offset by favorable pricing.\nR&D expense for the three and nine months ended July 31, 2025 increased 4 percent and 2 percent, respectively, compared to the same periods last year,\n primarily driven by continued investments in key growth opportunities in our end markets and leading-edge technologies and higher variable people-related cost.\nSelling, general and administrative expense for the three months ended July 31, 2025 increased 3 percent compared to the same period last year, primarily driven by higher people-related costs and higher infrastructure costs\n. \nSelling, general and administrative expense for the nine months ended July 31, 2025 decreased 2 percent compared to the same period last year, primarily driven by lower infrastructure costs, partially offset by higher people-related costs\n.\nOther operating expense (income), net for the three months ended July 31, 2025 and 2024 was income of $2 million and $3 million, respectively. Other operating expense (income), net for the nine months ended July 31, 2025 and 2024 was income of $5 million and $3 million, respectively.\nOperating margin for the three months ended July 31, 2025 increased 2 percentage points compared to the same period last year, primarily driven by lower operating expenses as a percentage of revenue. Operating margin for the nine months ended July 31, 2025 increased 1 percentage point compared to the same period last year, primarily driven by lower operating expenses as a percentage of revenue, partially offset by gross margin declines.\n32\nTable of Contents\nFinancial Condition\nLiquidity and Capital Resources\nOur liquidity is affected by many factors, including normal ongoing operations of our business and fluctuations due to global economics and markets. Our cash balances are generated and held in many locations throughout the world. Under certain circumstances, U.S. and local government regulations may limit our ability to move cash balances to meet cash needs.\nOverview of Cash Flows\nOur key cash flow activities were as follows:\nNine Months Ended\nJuly 31,\n \n2025\n2024\n \n(in millions)\nNet cash provided by operating activities\n$\n1,184 \n$\n693 \nNet cash used in investing activities\n$\n(97)\n$\n(781)\nNet cash provided (used) in financing activities\n$\n487 \n$\n(753)\nOperating Activities\nCash flows from operating activities can fluctuate significantly from period to period due to working capital needs, the timing of payments for income taxes, variable pay, pension funding, and other items that impact reported cash flows.\nNet cash provided by operating activities increased $491 million during the nine months ended July 31, 2025 compared to the same period last year.\n•\nNet income for the nine months ended July 31, 2025 decreased $70 million compared to the same period last year. Non-cash adjustments to net income were $45 million lower, primarily due to a $37 million increase in deferred tax benefit, a $32 million increase in unrealized gains on equity and other investments, and a $4 million decrease in amortization, partially offset by a $18 million increase in share-based compensation expense, $4 million increase in excess and obsolete inventory-related charges, and $6 million increase in other non-cash expenses.\n•\nThe aggregate change in accounts receivable, inventory and accounts payable provided net cash of $181 million during the first nine months of fiscal 2025 compared to net cash provided of $75 million in the same period last year. The amount of cash flow generated from or used by the aggregate of accounts receivable, inventory and accounts payable depends upon the cash conversion cycle, which represents the number of days that elapse from the day we pay for the purchase of raw materials and components to the collection of cash from our customers and can be significantly impacted by the timing of shipments and purchases, as well as collections and payments in a period.\n•\nMovements in income taxes receivable provided net cash of $78 million during the first nine months of fiscal 2025 compared to net cash used of $161 million in the same period last year, primarily driven by a prior year income tax benefit due to one-time discrete tax items (see Note 5, “Income Taxes,” for additional information), partially offset by current year income tax accruals.\n•\nMovements in other assets and liabilities provided net cash of $40 million during the first nine months of fiscal 2025 compared to net cash used of $221 million in the same period last year, primarily driven by lower income and other tax payments, net of accruals (see Note 5, “Income Taxes,” for additional information), changes in derivative assets and liabilities (see Note 9, “Derivatives,” for additional information), lower payroll-related payments, net of accruals, changes in deferred revenue and other assets and liabilities.\nInvesting Activities\nOur investing activities primarily include investments in property, plant and equipment and acquisitions of businesses to support our strategy and growth.\nNet cash used in investing activities decreased $684 million during the nine months ended July 31, 2025 compared to the same period last year, primarily driven by $673 million, net of cash acquired, used in the prior year for payments towards acquisitions, including $477 million paid for acquisition of the controlling block of ESI Group SA (“ESI Group”) shares and $26 million decrease in cash used for purchases of property, plant and equipment, partially offset by a $15 million increase in cash used in other net investing activities.\n33\nTable of Contents\nFinancing Activities\nOur financing activities primarily include proceeds from issuance of common stock under employee stock plans, tax payments related to net share settlement of equity awards, issuances and repayment of debt and related costs, treasury stock repurchases, and transactions with non-controlling interests in partially owned consolidated subsidiaries.\nNet cash provided by financing activities increased $1,240 million during the nine months ended July 31, 2025 compared to the same period last year, primarily driven by $748 million of proceeds from the issuance of the 2030 Senior Notes, $458 million used in the prior year for the acquisition of the non-controlling interest in ESI Group, $24 million used in the prior year for repayment of debt assumed as part of the ESI Group acquisition and $11 million lower treasury stock repurchases.\nTreasury Stock Repurchases\nOn March 6, 2023, our board of directors approved a stock repurchase program authorizing the purchase of up to $1,500 million of the company’s common stock, of which $210 million remained as of July 31, 2025. The stock repurchase program may be commenced, suspended or discontinued at any time at the company’s discretion and does not have an expiration date. See “Issuer Purchases of Equity Securities” under Part II Item 2 for additional information.\nDebt and Debt Facilities\n \nJuly 31, 2025\nOctober 31, 2024\n \n(in millions)\nSenior Notes (par value)\n$\n2,550 \n$\n1,800 \nRevolving Credit Facility\n$\n750 \n$\n750 \nBridge Facility\n£\n752 \n£\n1,232 \nSenior Notes\n2030 Senior Notes\nIn April 2025, the company issued an aggregate principal amount of $750 million in unsecured senior notes (“2030 Senior Notes”). The 2030 Senior Notes were issued at 99.760 percent of their principal amount. The notes will mature on July 30, 2030 and bear interest at a fixed rate of 5.35 percent per annum. The interest is payable semi-annually on January 30 and July 30, commencing on January 30, 2026. We incurred issuance costs of $7 million in connection with the 2030 Senior Notes that, along with the debt discount, are being amortized to interest expense over the term of the senior notes. \nThere have been no changes to the principal, maturity, interest rates and interest payment terms of our other senior notes during the nine months ended July 31, 2025 as compared to the senior notes described in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nRevolving Credit Facility\nOn July 30, 2021, we entered into an amended and restated credit agreement (the “Revolving Credit Facility”), which provides a $750 million five-year unsecured revolving credit facility that expires on July 30, 2026. Borrowings under the facility bear an annual interest rate of SOFR + 1.1 percent including a facility fee of 0.1 percent per annum. In addition, the Revolving Credit Facility permits the company, subject to certain customary conditions, on one or more occasions to request to increase the total commitments under the Revolving Credit Facility by up to $250 million in the aggregate. We may use amounts borrowed under the Revolving Credit Facility for general corporate purposes. As of July 31, 2025 and October 31, 2024, we had no borrowings outstanding under the Revolving Credit Facility. We were in compliance with the covenants of the Revolving Credit Facility during the nine months ended July 31, 2025.\nBridge Facility\nOn March 28, 2024, we entered into a bridge credit agreement (the “Bridge Facility”) pursuant to which certain lenders agreed to provide a senior unsecured bridge credit facility of up to 1,350 million pounds sterling for the purpose of providing the financing to support a planned acquisition. On July 25, 2024, the Bridge Facility was decreased to 1,232 million pounds sterling. On May 8, 2025, the Bridge Facility was decreased to 752 million pounds sterling. In connection with this decrease, the net proceeds from the 2030 Senior Notes have been restricted to support a planned acquisition and are held in a designated money market fund. We incurred costs in connection with the Bridge Facility of $7 million that have been fully amortized to interest expense. As of July 31, 2025 and October 31, 2024, we had no borrowings outstanding under the Bridge Facility.\nSee Note 10, “Debt,” for additional information.\n34\nTable of Contents\nCash and cash requirements\nCash\n \nJuly 31, 2025\nOctober 31, 2024\n \n(in millions)\nCash, cash equivalents and restricted cash\n$\n3,397 \n$\n1,814 \nU.S.\n$\n2,217 \n$\n626 \nNon-U.S.\n$\n1,180 \n$\n1,188 \nCash, cash equivalents and restricted cash increased to $3,397 million as of July 31, 2025 from $1,814 million as of October 31, 2024 and included the proceeds from the 2030 Senior Notes. See Note 10, “Debt,” for additional information.\nOur cash and cash equivalents mainly consist of investments in institutional money market funds investments, short-term deposits held at major global financial institutions, and similar short duration instruments with original maturities of three months or less. We continuously monitor the creditworthiness of the financial institutions and money market fund asset managers with whom we invest our funds. We utilize a variety of funding strategies in an effort to ensure that our worldwide cash is available in the locations in which it is needed. Most significant international locations have access to internal funding through an offshore cash pool for working capital needs. In addition, a few locations that are unable to access internal funding have access to temporary local overdraft and short-term working capital lines of credit.\nCash requirements\nWe have cash requirements to support working capital needs, capital expenditures, business acquisitions, contractual obligations, commitments, principal and interest payments on debt, and other liquidity requirements associated with our operations. We generally intend to use available cash and funds generated from our operations to meet these cash requirements. In the event that additional liquidity is required, we may also borrow under the Revolving Credit Facility or Bridge Facility and/or issue new debt.\nOn March 28, 2024, we announced our intention to acquire the entire share capital of Spirent Communications PLC (“Spirent”) for cash consideration of 199 pence per Spirent share, which reflects a valuation of $1,463 million on a fully diluted basis. As contemplated in the scheme document published on April 25, 2024, Spirent’s Board of Directors authorized a dividend of 3.5 pence per share on June 26, 2025. The dividend was distributed to shareholders in July 2025. The completion of the Spirent acquisition is subject to customary closing conditions, including review by regulatory authorities. The China State Administration for Market Regulation’s review remains pending, and we expect to close the acquisition during the fourth quarter of fiscal year 2025, subject to the completion of such review.\nOn September 19, 2024, Keysight announced that it had entered into a definitive agreement with Synopsys, Inc. (“Synopsys”) to acquire Synopsys’ Optical Solutions Group (“OSG”), a leading developer of optical design and analysis software tools. The transaction is subject to customary closing conditions, including review by regulatory authorities and the successful closing of Synopsys’ acquisition of Ansys. While Synopsys’ acquisition of Ansys was completed on July 17, 2025, the China State Administration for Market Regulation’s review of Synopsys’ divestiture of OSG to Keysight remains pending. \nOur senior notes obligations increased to $2,550 million as of July 31, 2025 from $1,800 million as of October 31, 2024, and interest payable on our senior notes increased to $626 million as of July 31, 2025 from $453 million as of October 31, 2024, driven by issuance of the 2030 Senior Notes. See Note 10, “Debt,” for additional information.\nThere were no other material changes to the cash requirements from our Annual Report on Form 10-K for the fiscal year ended October 31, 2024.\nDuring the nine months ended July 31, 2025, there were no material changes to our uncertain tax positions from our Annual Report on Form 10-K for the fiscal year ended October 31, 2024. We believe that we have an adequate provision for any adjustments that may result from tax examinations. However, the outcome of tax examinations cannot be predicted with certainty. Given the numerous tax years and matters that remain subject to examination in various tax jurisdictions, the ultimate resolution of current and future tax examinations could be inconsistent with management’s current expectations.\nFor the remainder of fiscal 2025, we do not expect to contribute to our U.S. defined benefit plans and U.S. post-retirement benefit plan, and expect to contribute $3 million to our non-U.S. defined benefit plans. The amounts we contribute depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates and other factors. See Note 11, “Retirement Plans and Post-Retirement Benefit Plans,” for additional information.\nWe expect capital spending to be approximately $135 million in 2025, primarily for investments in capacity expansion and technology investments.\n35\nTable of Contents\nAs of July 31, 2025, we believe our cash and cash equivalents, cash generated from operations, and our ability to access capital markets and credit lines will satisfy our cash needs for the foreseeable future both globally and domestically."
}