{
  "source_file": "khc-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOverview\nObjective:\nThe following discussion provides an analysis of our financial condition and results of operations from management's perspective and should be read in conjunction with the condensed consolidated financial statements and related notes included in Item 1, \nFinancial Statements\n, of this Quarterly Report on Form 10-Q. Our objective is to also provide discussion of material events and uncertainties known to management that are reasonably likely to cause reported financial information not to be indicative of future operating results or of future financial condition and to offer information that provides an understanding of our financial condition, results of operations, and cash flows.\nDescription of the Company: \nWe manufacture and market food and beverage products, including condiments and sauces, cheese and dairy, meals, meats, refreshment beverages, coffee, and other grocery products throughout the world.\nWe manage our operating results through four operating segments: North America, Europe and Pacific Developed Markets (“EPDM” or “International Developed Markets”), West and East Emerging Markets (“WEEM”), and Asia Emerging Markets (“AEM”). We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nSee Note 17, \nSegment Reporting\n, in Item 1, \nFinancial Statements\n, for our financial information by segment.\nProposed Separation Transaction:\nOn September 2, 2025, we announced our plan to separate the Company into two independent, publicly traded companies through a tax-free spin-off. The Separation is expected to allow each company to have greater strategic and operational focus to better serve customers, customize capital allocation, and accelerate profitable growth. We currently expect to complete the Separation in the second half of 2026. See Part II. Items 1A. \nRisk Factors\n of this Quarterly Report on Form 10-Q for further discussion of risks relating to the Separation.\nAcquisitions and Divestitures:\nOn July 9, 2025, we entered into a definitive agreement to sell our infant and specialty food business in Italy, within our International Developed Markets segment, which is expected to close in the first quarter of 2026. In the first quarter of 2024, we closed the sale of the Russia Infant Transaction and the Papua New Guinea Transaction, both within Emerging Markets. See Note 5, \nAcquisitions and Divestitures\n, in Item 1, \nFinancial Statements\n, for additional information on divestiture activities.\nBusiness Trends and Items Affecting Comparability of Financial Results\nInflation, Supply Chain, and Tariff Impacts:\nDuring the nine months ended September 27, 2025, we experienced increased inflationary pressures compared to the prior year, due in part to the recent tariff and trade policy actions taken by the United States and foreign governments. We have incurred increased cost of products sold within a subset of our North America segment (primarily within our Coffee and Hydration platforms) due to the impacts of tariffs on certain raw materials currently sourced from outside of the U.S. and on certain products that are manufactured through our integrated supply chain that spans the U.S. and Canada.\nWhile these increased costs have had a negative impact on our results of operations, we have taken measures to mitigate the impact of this inflation through pricing actions, efficiency gains, and alternative sourcing. However, there has been, and we expect that there could continue to be, a difference between the timing of when these mitigative actions impact our results of operations and when the cost inflation is incurred. Additionally, the pricing actions we take have, in some instances, negatively impacted, and could continue to negatively impact, our market share. As the situation continues to remain fluid due to the rapidly changing global trade environment, we continue to evaluate the potential implications of these actions on our business.\nConsumer Trends:\nIn the second quarter of 2025, we announced our commitment to remove Food, Drug & Cosmetic (“FD&C”) colors from our U.S. portfolio of products before the end of 2027. Additionally, we have committed to ensuring that all new products launched in the U.S. will be free of FD&C colors. This initiative will impact a subset of the products sold within our North America segment, primarily within our Hydration and Desserts platforms. While we do not currently anticipate a significant impact to our input costs in our efforts to meet this commitment, our net sales, market share, or results of operations could be adversely affected if we are unsuccessful in our efforts to continue to satisfy consumer preferences.\n35\nRegulatory Landscape:\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law in the United States. The OBBBA includes, among other provisions, a broad range of changes to U.S. tax law, as well as changes to eligibility requirements for Supplemental Nutrition Assistance Program (“SNAP”) recipients. While OBBBA did not have a significant impact on our total tax provision as of September 27, 2025, we are still evaluating our position on the elective provisions of the law and the potential impacts of those elections on our financial statements.\nResults of Operations\nWe disclose in this report certain non-GAAP financial measures. These non-GAAP financial measures assist management in comparing our performance on a consistent basis for purposes of business decision-making by removing the impact of certain items that management believes do not directly reflect our underlying operations. For additional information and reconciliations to the most closely comparable financial measures presented in our condensed consolidated financial statements, which are calculated in accordance with U.S. GAAP see \nNon-GAAP Financial Measures.\nConsolidated Results of Operations\nSummary of Results:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions, except per share data)\n(in millions, except per share data)\nNet sales\n$\n6,237 \n$\n6,383 \n(2.3)\n%\n$\n18,588 \n$\n19,270 \n(3.5)\n%\nOperating income/(loss)\n1,025 \n(101)\n1,114.9 \n%\n(5,753)\n1,723 \n(433.9)\n%\nNet income/(loss)\n613 \n(290)\n311.4 \n%\n(6,496)\n614 \n(1,158.0)\n%\nNet income/(loss) attributable to common shareholders\n615 \n(290)\n312.1 \n%\n(6,497)\n613 \n(1,159.9)\n%\nDiluted EPS\n0.52 \n(0.24)\n316.7 \n%\n(5.47)\n0.50 \n(1,194.0)\n%\n Net Sales:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n6,237 \n$\n6,383 \n(2.3)\n%\n$\n18,588 \n$\n19,270 \n(3.5)\n%\nOrganic Net Sales\n(a)\n6,201 \n6,363 \n(2.5)\n%\n18,612 \n19,204 \n(3.1)\n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item.\nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nNet sales decreased 2.3% to $6.2 billion for the three months ended September 27, 2025 compared to $6.4 billion for the three months ended September 28, 2024, including the favorable impact of foreign currency (0.2 pp). Organic Net Sales decreased 2.5% to $6.2 billion for the three months ended September 27, 2025 compared to $6.4 billion for the three months ended September 28, 2024, primarily due to the unfavorable volume/mix (3.5 pp), which more than offset higher pricing (1.0 pp). Pricing was higher in each segment. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet sales decreased 3.5% to $18.6 billion for the nine months ended September 27, 2025 compared to $19.3 billion for the nine months ended September 28, 2024, including the unfavorable impact of foreign currency (0.4 pp). Organic Net Sales decreased 3.1% to $18.6 billion for the nine months ended September 27, 2025 compared to $19.2 billion for the nine months ended September 28, 2024, primarily due to the unfavorable volume/mix (3.9 pp), which more than offset higher pricing (0.8 pp). Pricing was higher in each segment. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\n36\nNet Income/(Loss):\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions)\n(in millions)\nOperating income/(loss)\n$\n1,025 \n$\n(101)\n1,114.9 \n%\n$\n(5,753)\n$\n1,723 \n(433.9)\n%\nNet income/(loss)\n613 \n(290)\n311.4 \n%\n(6,496)\n614 \n(1,158.0)\n%\nNet income/(loss) attributable to common shareholders\n615 \n(290)\n312.1 \n%\n(6,497)\n613 \n(1,159.9)\n%\nAdjusted Operating Income\n(a)\n1,106 \n1,330 \n(16.9)\n%\n3,581 \n3,975 \n(9.9)\n%\n(a)    Adjusted Operating Income is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item.\nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nOperating income/(loss) increased 1,114.9% to income of $1.0 billion for the three months ended September 27, 2025 compared to losses of $101 million for the three months ended September 28, 2024, primarily due to non-cash impairment losses that were $1.4 billion lower in the current year period. In addition to the impact of these non-cash impairment losses, operating income/(loss) decreased $267 million due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, increased SG&A, primarily due to increased advertising expenses, and unfavorable changes in unrealized losses/(gains) on commodity hedges. These unfavorable impacts to operating income/(loss) were partially offset by higher pricing.\nNet income/(loss) increased 311.4% to income of $613 million for the three months ended September 27, 2025 compared to losses of $290 million for the three months ended September 28, 2024. This increase was due to the favorable changes in operating income/(loss) factors discussed above, partially offset by higher income tax expense, unfavorable changes in other expense/(income), and higher interest expense.\n•\nOur effective tax rate for the three months ended September 27, 2025 was an expense of 24.0% on pre-tax income. Our effective tax rate for the three months ended September 28, 2024 was an expense of 2.5% on pre-tax loss, which included the net unfavorable effective tax rate impact of goodwill and intangible asset impairment losses of 22.9%. The year-over-year change in the effective tax rate for the three-month period was primarily driven by the impact of non-deductible goodwill impairments and a less favorable geographic mix of pre-tax income in various non-U.S. jurisdictions primarily due to the changes made to our corporate entity structure in December 2024.\n•\nOther expense/(income) was $22 million of income for the three months ended September 27, 2025 compared to $48 million of income for the three months ended September 28, 2024. This change was primarily driven by a $44 million net loss on the sale of a business recognized in the third quarter of 2025 associated with the Italy Infant Transaction, partially offset by an $18 million increase in interest income primarily due to interest earned on our available-for-sale securities.\nAdjusted Operating Income decreased 16.9% to $1.1 billion for the three months ended September 27, 2025 compared to $1.3 billion for the three months ended September 28, 2024, primarily due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, and increased SG&A, primarily due to increased advertising expenses. These unfavorable impacts more than offset higher pricing and the favorable impact of foreign currency (0.1 pp).\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nOperating income/(loss) decreased 433.9% to a loss of $5.8 billion for the nine months ended September 27, 2025 compared to income of $1.7 billion for the nine months ended September 28, 2024, primarily due to non-cash impairment losses that were $7.0 billion higher in the current year period. In addition to the impact of these non-cash impairment losses, operating income/(loss) decreased $457 million due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, and unfavorable changes in unrealized losses/(gains) on commodity hedges. These unfavorable impacts to operating income/(loss) were partially offset by higher pricing and decreased SG&A, primarily due to decreased advertising expenses and lower variable compensation expense.\n37\nNet income/(loss) decreased 1,158.0% to a loss of $6.5 billion for the nine months ended September 27, 2025 compared to income of $614 million for the nine months ended September 28, 2024. This decrease was due to the unfavorable changes in operating income/(loss) factors discussed above and higher interest expense, partially offset by lower income tax expense and favorable changes in other expense/(income).\n•\nOur effective tax rate for the nine months ended September 27, 2025 was an expense of 2.4% on pre-tax loss, which included the net unfavorable effective tax rate impact of non-deductible goodwill impairments of 24.8%. Our effective tax rate for the nine months ended September 28, 2024 was an expense of 43.9% on pre-tax income, which included the net unfavorable effective tax rate impact of goodwill and intangible asset impairment losses of 21.5%. The year-over-year change in the effective tax rate for the nine month period was primarily due to the impact of non-deductible goodwill impairments, and a less favorable geographic mix of pre-tax income in various non-U.S. jurisdictions.\n•\nOther expense/(income) was $120 million of income for the nine months ended September 27, 2025 compared to $56 million of income for the nine months ended September 28, 2024. This change was primarily driven by a $36 million increase in interest income in 2025 compared to 2024 primarily due to interest earned our available-for-sale securities, and a $44 million net loss on the sale of a business recognized in 2025 compared to a $78 million net loss on the sale of businesses in 2024.\nAdjusted Operating Income decreased 9.9% to $3.6 billion for the nine months ended September 27, 2025 compared to $4.0 billion for the nine months ended September 28, 2024, primarily due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, and the unfavorable impact of foreign currency (0.1 pp). These unfavorable impacts more than offset higher pricing and decreased SG&A, primarily due to decreased advertising expenses and lower variable compensation expense.\nDiluted EPS:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nDiluted EPS\n$\n0.52 \n$\n(0.24)\n316.7 \n%\n$\n(5.47)\n$\n0.50 \n(1,194.0)\n%\nAdjusted EPS\n(a)\n0.61 \n0.75 \n(18.7)\n%\n1.92 \n2.22 \n(13.5)\n%\n(a)    Adjusted EPS is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item. \nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nDiluted EPS increased 316.7% to $0.52 for the three months ended September 27, 2025 compared to $(0.24) for the three months ended September 28, 2024, primarily due to the net income/(loss) factors discussed above and the favorable impact of our common stock repurchases.\nFor the Three Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n$ Change\n% Change\nDiluted EPS\n$\n0.52 \n$\n(0.24)\n$\n0.76 \n316.7 \n%\nUnrealized losses/(gains) on commodity hedges\n0.02 \n— \n0.02 \nImpairment losses\n0.03 \n0.99 \n(0.96)\nSeparation costs\n0.01 \n— \n0.01 \nLosses/(gains) on sale of business\n0.04 \n— \n0.04 \nCertain significant discrete income tax items\n(0.01)\n— \n(0.01)\nAdjusted EPS\n(a)\n$\n0.61 \n$\n0.75 \n$\n(0.14)\n(18.7)\n%\nKey drivers of change in Adjusted EPS\n(a)\n:\nResults of operations\n$\n(0.14)\nInterest expense\n(0.01)\nOther expense/(income)\n0.02 \nEffective tax rate\n(0.02)\nEffect of common stock repurchases\n(b)\n0.01 \n$\n(0.14)\n(a)    Adjusted EPS is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item.\n38\n(b)    Includes the impact of the change in the weighted average shares of common stock outstanding, including dilutive effect, which is primarily due to shares purchased pursuant to our publicly announced share repurchase program. See Note 16, \nEarnings Per Share\n, for more information on our weighted average shares outstanding.\nAdjusted EPS decreased 18.7% to $0.61 for the three months ended September 27, 2025 compared to $0.75 for the three months ended September 28, 2024. This decrease was primarily due to lower Adjusted Operating Income, higher taxes on adjusted earnings, and higher interest expense, which more than offset the favorable changes in other expense/(income) and the favorable impact of our common stock repurchases.\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nDiluted EPS decreased 1,194.0% to $(5.47) for the nine months ended September 27, 2025 compared to $0.50 for the nine months ended September 28, 2024, primarily due to the net income/(loss) factors discussed above, which more than offset the favorable impact of our common stock repurchases.\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n$ Change\n% Change\nDiluted EPS\n$\n(5.47)\n$\n0.50 \n$\n(5.97)\n(1,194.0)\n%\nRestructuring activities\n0.01 \n— \n0.01 \nUnrealized losses/(gains) on commodity hedges\n— \n(0.02)\n0.02 \nImpairment losses\n7.30 \n1.69 \n5.61 \nSeparation costs\n0.01 \n— \n0.01 \nLosses/(gains) on sale of business\n0.04 \n0.05 \n(0.01)\nNonmonetary currency devaluation\n0.02 \n— \n0.02 \nCertain significant discrete income tax items\n0.01 \n— \n0.01 \nAdjusted EPS\n(a)\n$\n1.92 \n$\n2.22 \n$\n(0.30)\n(13.5)\n%\nKey drivers of change in Adjusted EPS\n(a)\n:\nResults of operations\n$\n(0.26)\nInterest expense\n(0.01)\nOther expense/(income)\n0.04 \nEffective tax rate\n(0.11)\nEffect of common stock repurchases\n(b)\n0.04 \n$\n(0.30)\n(a)    Adjusted EPS is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item.\n(b)    Includes the impact of the change in the weighted average shares of common stock outstanding, including dilutive effect, which is primarily due to shares purchased pursuant to our publicly announced share repurchase program. See Note 16, \nEarnings Per Share\n, for more information on our weighted average shares outstanding.\nAdjusted EPS decreased 13.5% to $1.92 for the nine months ended September 27, 2025 compared to $2.22 for the nine months ended September 28, 2024. This decrease was primarily due to lower Adjusted Operating Income, higher taxes on adjusted earnings, and higher interest expense, which more than offset the favorable impact of our common stock repurchases and favorable changes in other expense/(income).\n39\nResults of Operations by Segment\nWe manage our operating results through four operating segments. We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nManagement evaluates segment performance based on several factors, including net sales, Organic Net Sales, and Segment Adjusted Operating Income. Segment Adjusted Operating Income is defined as operating income/(loss) excluding, when they occur, the impacts of restructuring activities, deal costs, unrealized gains/(losses) on commodity hedges (the unrealized gains and losses are recorded in general corporate expenses until realized; once realized, the gains and losses are recorded in the applicable segment’s operating results), impairment losses, separation costs, and certain non-ordinary course legal and regulatory matters. Segment Adjusted Operating Income for Emerging Markets, which represents the aggregation of our WEEM and AEM operating segments, is defined and presented consistently with the Segment Adjusted Operating Income of our reportable segments — North America and International Developed Markets. Segment Adjusted Operating Income is a financial measure that can assist management and investors in comparing our performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect our underlying operations. Management also uses Segment Adjusted Operating Income to allocate resources.\nUnder highly inflationary accounting, the financial statements of a subsidiary are remeasured into our reporting currency (U.S. dollars) based on the legally available exchange rate at which we expect to settle the underlying transactions. Exchange gains and losses from the remeasurement of monetary assets and liabilities are reflected in other expense/(income) on our condensed consolidated statements of income, as nonmonetary currency devaluation, rather than accumulated other comprehensive income/(losses) on our condensed consolidated balance sheets, until such time as the economy is no longer considered highly inflationary. See Note 3, \nSignificant Accounting Policies\n, to the consolidated financial statements in our Annual Report on Form 10-K for the year ended December 28, 2024, for additional information. We apply highly inflationary accounting to the results of our subsidiaries in Venezuela, Turkey, and Egypt, which are all in Emerging Markets.\nNet Sales:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\n(in millions)\nNet sales:\nNorth America\n$\n4,641 \n$\n4,826 \n$\n13,886 \n$\n14,575 \nInternational Developed Markets\n895 \n882 \n2,609 \n2,622 \nEmerging Markets\n701 \n675 \n2,093 \n2,073 \nTotal net sales\n$\n6,237 \n$\n6,383 \n$\n18,588 \n$\n19,270 \nOrganic Net Sales:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\n(in millions)\nOrganic Net Sales\n(a)\n:\nNorth America\n$\n4,645 \n$\n4,826 \n$\n13,921 \n$\n14,575 \nInternational Developed Markets\n869 \n882 \n2,575 \n2,622 \nEmerging Markets\n687 \n655 \n2,116 \n2,007 \nTotal Organic Net Sales\n$\n6,201 \n$\n6,363 \n$\n18,612 \n$\n19,204 \n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item. \n40\nDrivers of the changes in net sales and Organic Net Sales for the three and nine months ended September 27, 2025 compared to the three and nine months ended September 28, 2024 were:\nNet Sales\nCurrency\nAcquisitions and Divestitures\nOrganic Net Sales\nPrice\nVolume/Mix\nFor the Three Months Ended\nNorth America\n(3.8)\n%\n0.0 pp\n0.0 pp\n(3.8)\n%\n0.4 pp\n(4.2) pp\nInternational Developed Markets\n1.6 \n%\n3.0 pp\n0.0 pp\n(1.4)\n%\n1.0 pp\n(2.4) pp\nEmerging Markets\n3.8 \n%\n(0.9) pp\n0.0 pp\n4.7 \n%\n4.0 pp\n0.7 pp\nKraft Heinz\n(2.3)\n%\n0.2 pp\n0.0 pp\n(2.5)\n%\n1.0 pp\n(3.5) pp\nNet Sales\nCurrency\nAcquisitions and Divestitures\nOrganic Net Sales\nPrice\nVolume/Mix\nFor the Nine Months Ended\nNorth America\n(4.7)\n%\n(0.2) pp\n0.0 pp\n(4.5)\n%\n0.4 pp\n(4.9) pp\nInternational Developed Markets\n(0.5)\n%\n1.3 pp\n0.0 pp\n(1.8)\n%\n0.5 pp\n(2.3) pp\nEmerging Markets\n0.9 \n%\n(4.0) pp\n(0.5) pp\n5.4 \n%\n4.5 pp\n0.9 pp\nKraft Heinz\n(3.5)\n%\n(0.4) pp\n0.0 pp\n(3.1)\n%\n0.8 pp\n(3.9) pp\nAdjusted Operating Income:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\n(in millions)\nSegment Adjusted Operating Income:\nNorth America\n$\n1,018 \n$\n1,237 \n$\n3,292 \n$\n3,793 \nInternational Developed Markets\n130 \n135 \n393 \n397 \nTotal Segment Adjusted Operating Income\n1,148 \n1,372 \n3,685 \n4,190 \nEmerging Markets\n79 \n84 \n278 \n232 \nGeneral corporate expenses\n(121)\n(126)\n(382)\n(447)\nRestructuring activities\n(6)\n— \n(10)\n— \nUnrealized gains/(losses) on commodity hedges\n(23)\n(3)\n(6)\n30 \nImpairment losses\n(35)\n(1,428)\n(9,301)\n(2,282)\nSeparation costs\n(17)\n— \n(17)\n— \nOperating income/(loss)\n1,025 \n(101)\n(5,753)\n1,723 \nInterest expense\n240 \n230 \n709 \n685 \nOther expense/(income)\n(22)\n(48)\n(120)\n(56)\nIncome/(loss) before income taxes\n$\n807 \n$\n(283)\n$\n(6,342)\n$\n1,094 \nNorth America:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n4,641 \n$\n4,826 \n(3.8)\n%\n$\n13,886 \n$\n14,575 \n(4.7)\n%\nOrganic Net Sales\n(a)\n4,645 \n4,826 \n(3.8)\n%\n13,921 \n14,575 \n(4.5)\n%\nSegment Adjusted Operating Income\n1,018 \n1,237 \n(17.8)\n%\n3,292 \n3,793 \n(13.2)\n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item. \nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nNet sales decreased 3.8% to $4.6 billion for the three months ended September 27, 2025 compared to $4.8 billion for the three months ended September 28, 2024. Organic Net Sales decreased 3.8% to $4.6 billion for the three months ended September 27, 2025 compared to $4.8 billion for the three months ended September 28, 2024, primarily due to unfavorable volume/mix (4.2 \n41\npp), which more than offset higher pricing (0.4 pp). Unfavorable volume/mix was primarily due to declines in coffee, cold cuts, frozen snacks, and certain condiments. Higher pricing was taken in certain categories to mitigate higher input costs, primarily in coffee.\nSegment Adjusted Operating Income decreased 17.8% to $1.0 billion for the three months ended September 27, 2025 compared to $1.2 billion for the three months ended September 28, 2024, primarily due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, increased SG&A, primarily due to increased advertising expenses, and the unfavorable impact of foreign currency (0.1 pp). These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing.\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet sales decreased 4.7% to $13.9 billion for the nine months ended September 27, 2025 compared to $14.6 billion for the nine months ended September 28, 2024, including the unfavorable impacts of foreign currency (0.2 pp). Organic Net Sales decreased 4.5% to $13.9 billion for the nine months ended September 27, 2025 compared to $14.6 billion for the nine months ended September 28, 2024, primarily due to unfavorable volume/mix (4.9 pp), which more than offset higher pricing (0.4 pp). Unfavorable volume/mix was primarily driven by declines in cold cuts, coffee, frozen snacks, desserts, and certain condiments. Higher pricing was taken in certain categories to mitigate higher input costs, primarily in coffee.\nSegment Adjusted Operating Income decreased 13.2% to $3.3 billion for the nine months ended September 27, 2025 compared to $3.8 billion for the nine months ended September 28, 2024, primarily due to inflationary pressures in commodity and manufacturing costs that outpaced our efficiency initiatives, unfavorable volume/mix, higher depreciation expense, and the unfavorable impact of foreign currency (0.1 pp). These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing and decreased SG&A, primarily due to decreased advertising expenses, and lower variable compensation expense.\nInternational Developed Markets:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n895 \n$\n882 \n1.6 \n%\n$\n2,609 \n$\n2,622 \n(0.5)\n%\nOrganic Net Sales\n(a)\n869 \n882 \n(1.4)\n%\n2,575 \n2,622 \n(1.8)\n%\nSegment Adjusted Operating Income\n130 \n135 \n(3.5)\n%\n393 \n397 \n(1.0)\n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item. \nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nNet sales increased 1.6% to $895 million for the three months ended September 27, 2025 compared to $882 million for the three months ended September 28, 2024, including the favorable impacts of foreign currency (3.0 pp). Organic Net Sales decreased 1.4% to $869 million for the three months ended September 27, 2025 compared to $882 million for the three months ended September 28, 2024, primarily due to unfavorable volume/mix (2.4 pp), which more than offset higher pricing (1.0 pp). Unfavorable volume/mix was primarily due to continued industry slowdowns in meals in the United Kingdom and pricing elasticity in New Zealand.\nSegment Adjusted Operating Income decreased 3.5% to $130 million for the three months ended September 27, 2025 compared to $135 million for the three months ended September 28, 2024, primarily due to unfavorable volume/mix and increased SG&A, primarily due to increased variable compensation expense and research and development costs. These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing and the favorable impact of foreign currency (4.1 pp).\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet sales decreased 0.5% to $2.6 billion for the nine months ended September 27, 2025 compared to $2.6 billion for the nine months ended September 28, 2024, including the favorable impacts of foreign currency (1.3 pp). Organic Net Sales decreased 1.8% to $2.6 billion for the nine months ended September 27, 2025 compared to $2.6 billion for the nine months ended September 28, 2024, primarily due to unfavorable volume/mix (2.3 pp), which more than offset higher pricing (0.5 pp). Unfavorable volume/mix was primarily due to continued industry slowdowns of meals in the United Kingdom and pricing elasticity in New Zealand.\n42\nSegment Adjusted Operating Income decreased 1.0% to $393 million for the nine months ended September 27, 2025 compared to $397 million for the nine months ended September 28, 2024, primarily due to unfavorable volume/mix and inflationary pressures in manufacturing and procurement costs that outpaced our efficiency initiatives. These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing, the favorable impact of foreign currency (2.8 pp), lower amortization expense, and decreased SG&A, primarily due to decreased advertising expenses.\nEmerging Markets:\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n701 \n$\n675 \n3.8 \n%\n$\n2,093 \n$\n2,073 \n0.9 \n%\nOrganic Net Sales\n(a)\n687 \n655 \n4.7 \n%\n2,116 \n2,007 \n5.4 \n%\nSegment Adjusted Operating Income\n(b)\n79 \n84 \n(6.5)\n%\n278 \n232 \n19.6 \n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures\n section at the end of this item. \n(b)    Segment Adjusted Operating Income for Emerging Markets, which represents the combination of our WEEM and AEM operating segments, is defined and presented consistently with the Segment Adjusted Operating Income of our reportable segments - North America and International Developed Markets.\nThree Months Ended September 27, 2025 Compared to the Three Months Ended September 28, 2024:\nNet sales increased 3.8% to $701 million for the three months ended September 27, 2025 compared to $675 million for the three months ended September 28, 2024, including the unfavorable impacts of foreign currency (0.9 pp). Organic Net Sales increased 4.7% to $687 million for the three months ended September 27, 2025 compared to $655 million for the three months ended September 28, 2024, primarily driven by higher pricing (4.0 pp) and favorable volume/mix (0.7 pp). Higher pricing was taken primarily in certain countries within WEEM to address inflationary pressures. Favorable volume/mix was primarily driven by Taste Elevation within our LATAM region, which more than offset unfavorable volume/mix in Indonesia.\nSegment Adjusted Operating Income decreased 6.5% to $79 million for the three months ended September 27, 2025 compared to $84 million for the three months ended September 28, 2024, primarily due to increased advertising expenses, higher procurement and logistics costs reflecting inflationary pressure in WEEM, unfavorable changes in allowances for trade receivables in Indonesia, higher depreciation expense, and the unfavorable impact of foreign currency (1.8 pp). These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing, reduced manufacturing costs primarily as a result of our efficiency initiatives, and favorable volume/mix.\nNine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet sales increased 0.9% to $2.1 billion for the nine months ended September 27, 2025 compared to $2.1 billion for the nine months ended September 28, 2024, including the unfavorable impacts of foreign currency (4.0 pp) and divestitures (0.5 pp). Organic Net Sales increased 5.4% to $2.1 billion for the nine months ended September 27, 2025 compared to $2.0 billion for the nine months ended September 28, 2024, primarily driven by higher pricing (4.5 pp) and favorable volume/mix (0.9 pp). Higher pricing was taken primarily in certain countries within WEEM to address inflationary pressures. Favorable volume/mix was primarily driven by Taste Elevation within LATAM, particularly in Brazil, which more than offset unfavorable volume/mix in Indonesia.\nSegment Adjusted Operating Income increased 19.6% to $278 million for the nine months ended September 27, 2025 compared to $232 million for the nine months ended September 28, 2024, primarily due to higher pricing, reduced manufacturing costs, primarily as a result of our efficiency initiatives, and favorable volume/mix. These favorable impacts to Segment Adjusted Operating Income more than offset increased SG&A, primarily due to increased advertising expenses, higher procurement and logistics costs reflecting inflationary pressure in WEEM, higher depreciation expense, and the unfavorable impact of foreign currency (4.9 pp).\nLiquidity and Capital Resources\nWe believe that cash generated from our operating activities, commercial paper programs, and our senior unsecured revolving credit facility (the “Senior Credit Facility”) will provide sufficient liquidity to meet our working capital needs, repayments of long-term debt, future contractual obligations, payment of our anticipated quarterly dividends, planned capital expenditures, restructuring expenditures, and contributions to our postemployment benefit plans for the next 12 months. An additional potential source of liquidity is access to capital markets. We intend to use our cash on hand and commercial paper programs for daily funding requirements.\n43\nCash Flow Activity for the Nine Months Ended September 27, 2025 Compared to the Nine Months Ended September 28, 2024:\nNet Cash Provided by/Used for Operating Activities:\nNet cash provided by operating activities was $3.1 billion for the nine months ended September 27, 2025 compared to $2.8 billion for the nine months ended September 28, 2024. This increase was primarily due to favorable changes in working capital, predominantly within inventory and accounts payable, as well as lower cash outflows from variable compensation in the 2025 period compared to the 2024 period. These impacts were partially offset by lower Adjusted Operating Income.\nNet Cash Provided by/Used for Investing Activities:\nNet cash used for investing activities was $1.6 billion for the nine months ended September 27, 2025 compared to $849 million for the nine months ended September 28, 2024. This change was primarily driven by the purchases of marketable securities, partially offset by proceeds received from the sale of marketable securities in the 2025 period, lower capital expenditures in the 2025 period compared to the 2024 period, and lapping our prior year payment to acquire the TGI Friday License. We expect 2025 capital expenditures to be approximately $950 million compared to the 2024 capital expenditures of $1.0 billion. Our 2025 capital expenditures are expected to be primarily driven by maintenance projects, investments in technology, capital investments focused on generating growth, including cost improvements, capacity expansion, and investments in warehouse.\nNet Cash Provided by/Used for Financing Activities:\nNet cash used for financing activities was $763 million for the nine months ended September 27, 2025 compared to $2.0 billion for the nine months ended September 28, 2024. This change was primarily driven by debt proceeds received from the issuance of the 2025 Notes in the current year period, increased cash flow hedge settlements, and decreased repurchases of common stock compared to the prior year period. See Note 15, \nCommitments, Contingencies, and Debt\n for additional information on our debt issuances.\nCash Held by International Subsidiaries:\nOf the $2.1 billion cash and cash equivalents on our condensed consolidated balance sheet at September 27, 2025, $1.1 billion was held by international subsidiaries.\nSubsequent to January 1, 2018, we consider the unremitted earnings of certain international subsidiaries that impose local country taxes on dividends to be indefinitely reinvested. For those undistributed earnings considered to be indefinitely reinvested, our intent is to reinvest these funds in our international operations, and our current plans do not demonstrate a need to repatriate the accumulated earnings to fund our U.S. cash requirements. The amount of unrecognized deferred tax liabilities for local country withholding taxes that would be owed, if repatriated, related to our 2018 through 2025 accumulated earnings of certain international subsidiaries is approximately $65 million.\nOur undistributed historic earnings in foreign subsidiaries through December 31, 2017 are currently not considered to be indefinitely reinvested. Our deferred tax liability associated with these undistributed historical earnings was insignificant at September 27, 2025 and December 28, 2024 and relates to local withholding taxes that would be owed when this cash is distributed.\nTrade Payables Programs:\nIn order to manage our cash flow and related liquidity, we work with our suppliers to optimize our terms and conditions, which\ninclude the extension of payment terms. We maintain agreements with third-party administrators that allow participating suppliers to track payment obligations from us, and, at the sole discretion of the supplier, sell one or more of those payment obligations to participating financial institutions. Our obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted. Our current payment terms with our suppliers, which we deem to be commercially reasonable, generally range from 0 to 250 days. All amounts due to participating suppliers are paid to the third party on the original invoice due dates, regardless of whether a particular invoice was sold. The amounts confirmed outstanding under these programs were $767 million at September 27, 2025 and $745 million at December 28, 2024. The amounts were included in accounts payable on our consolidated balance sheets. See Note 14, \nFinancing Arrangements\n, in Item 1, \nFinancial Statements\n, for additional information on our trade payables programs.\nBorrowing Arrangements:\nFrom time to time, we obtain funding through our commercial paper programs. We had no commercial paper outstanding at September 27, 2025, at December 28, 2024, or during the nine months ended September 27, 2025 or September 28, 2024.\nOur Senior Credit Facility provides for a revolving commitment of $4.0 billion through July 8, 2030. Subject to certain conditions, we may increase the amount of revolving commitments and/or add tranches of term loans in a combined aggregate amount of up to $1.0 billion.\nNo amounts were drawn on our Senior Credit Facility at \nSeptember 27, 2025\n or \nDecember 28, 2024\n, or during the \nnine months\n ended \nSeptember 27, 2025\n or \nSeptember 28, 2024.\n44\nOur credit agreement contains customary representations, warranties, and covenants that are typical for these types of facilities and could, upon the occurrence of certain events of default, restrict our ability to access our Senior Credit Facility.\n We were in compliance with all financial covenants as of \nSeptember 27, 2025\n.\nLong-Term Debt:\nOur long-term debt, including the current portion, was $21.2 billion at September 27, 2025 and $19.9 billion at December 28, 2024. This increase was primarily due to the issuance of the 2025 Notes, as well as changes in foreign currency exchange rates on our foreign-denominated debt, partially offset by the repayment of our 600 million euro senior notes due May 2025.\nIn the first quarter of 2025, KHFC, our 100% owned operating subsidiary, issued 600 million euro aggregate principal amount of 3.250% senior notes due March 2033, $500 million aggregate principal amount of 5.200% senior notes due March 2032, and $500 million aggregate principal amount of 5.400% senior notes due March 2035 (collectively, the “2025 Notes”). We used a portion of the net proceeds from the 2025 Notes to fund the 600 million euro senior notes that matured in May 2025 and expect to use the remaining net proceeds from the 2025 Notes for general corporate purposes, including our investment in certain marketable fixed-income debt securities that are classified as available-for-sale and to fund the repayment of outstanding indebtedness such as our $1.9 billion senior notes that mature in June 2026.\nWe have aggregate principal amounts of senior notes of approximately $1.9 billion maturing in June 2026.\nWe may from time to time seek to retire or purchase our outstanding debt through redemptions, tender offers, cash purchases, prepayments, refinancing, exchange offers, open market or privately negotiated transactions, Rule 10b5-1 plans, or otherwise.\nOur long-term debt contains customary representations, covenants, and events of default.\n We were in compliance with all financial covenants as of \nSeptember 27, 2025\n.\nSee Note 15, \nCommitments, Contingencies, and Debt\n, in Item 1, \nFinancial Statements\n, for additional information on our long-term debt activity, Note 12, \nFinancial Instruments\n, in Item 1, \nFinancial Statements\n, for additional information on our available-for-sale securities, and Note 16, \nDebt\n, to the consolidated financial statements in our Annual Report on Form 10-K for the year ended December 28, 2024 for additional information on our borrowing arrangements and long-term debt.\nEquity and Dividends:\nWe paid dividends on our common stock of $1.4 billion for the nine months ended September 27, 2025. Additionally, in the fourth quarter of 2025, our Board of Directors declared a cash dividend of $0.40 per share of common stock, which is payable on December 26, 2025 to stockholders of record on November 28, 2025.\nThe declaration of dividends is subject to the discretion of our Board of Directors and depends on various factors, including our net income, financial condition, cash requirements, future prospects, and other factors that our Board of Directors deems relevant to its analysis and decision making.\nOn November 27, 2023, we announced that the Board of Directors approved a share repurchase program authorizing the Company to purchase up to $3.0 billion, exclusive of fees, of the Company’s common stock through December 26, 2026. We are not obligated to repurchase any specific number of shares and the program may be modified, suspended, or discontinued at any time. Under the program, shares may be repurchased in open market transactions, including under plans complying with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended (the “Exchange Act”), privately negotiated transactions, transactions structured through investment banking institutions, or other means. We purchased no shares during the three months ended and 13.5 million shares during the nine months ended September 27, 2025 and had approximately $1.5 billion remaining authorization under the share repurchase program as of September 27, 2025. The share repurchase program is in addition to our share repurchases to offset the dilutive effect of equity-based compensation.\nAggregate Contractual Obligations:\nIn the first quarter of 2025, we issued the 2025 Notes, which mature between 2032 and 2035. See Note 15, \nCommitments, Contingencies and Debt\n, in Item 1, \nFinancial Statements\n, for additional information. There were no other material changes to our aggregate contractual obligations from those disclosed in our Annual Report on Form 10-K for the year ended December 28, 2024.\nSupplemental Guarantor Information:\nThe Kraft Heinz Company (as the “Parent Guarantor”) fully and unconditionally guarantees all the senior unsecured registered notes (collectively, the “KHFC Senior Notes”) issued by KHFC, our 100% owned operating subsidiary (the “Guarantee”). See Note 15, \nCommitments, Contingencies, and Debt\n, in Item 1, \nFinancial Statements\n, and Note 16, \nDebt\n, to the consolidated financial statements in our Annual Report on Form 10-K for the year ended December 28, 2024 for additional descriptions of these guarantees. \n45\nThe payment of the principal, interest and premium, when applicable, on the KHFC Senior Notes is fully and unconditionally guaranteed on a senior unsecured basis by the Parent Guarantor, pursuant to the terms and conditions of the applicable indenture. None of the Parent Guarantor’s subsidiaries guarantee the KHFC Senior Notes.\nThe Guarantee is the Parent Guarantor’s senior unsecured obligation and is: (i) \npari passu\n in right of payment with all of the Parent Guarantor’s existing and future senior indebtedness; (ii) senior in right of payment to all of the Parent Guarantor’s future subordinated indebtedness; (iii) effectively subordinated to all of the Parent Guarantor’s existing and future secured indebtedness to the extent of the value of the assets secured by that indebtedness; and (iv) effectively subordinated to all existing and future indebtedness and other liabilities of the Parent Guarantor’s subsidiaries. \nThe KHFC Senior Notes are obligations exclusively of KHFC and the Parent Guarantor and not of any of the Parent Guarantor’s other subsidiaries. Substantially all of the Parent Guarantor’s operations are conducted through its subsidiaries. The Parent Guarantor’s other subsidiaries are separate legal entities that have no obligation to pay any amounts due under the KHFC Senior Notes or to make any funds available therefor, whether by dividends, loans, or other payments. Except to the extent the Parent Guarantor is a creditor with recognized claims against its subsidiaries, all claims of creditors (including trade creditors) and holders of preferred stock, if any, of its subsidiaries will have priority with respect to the assets of such subsidiaries over its claims (and therefore the claims of its creditors, including holders of the KHFC Senior Notes). Consequently, the KHFC Senior Notes are structurally subordinated to all liabilities of the Parent Guarantor’s subsidiaries and any subsidiaries that it may in the future acquire or establish. The obligations of the Parent Guarantor will terminate and be of no further force or effect in the following circumstances: (i) (a) KHFC’s exercise of its legal defeasance option or, except in the case of a guarantee of any direct or indirect parent of KHFC, covenant defeasance option in accordance with the applicable indenture, or KHFC’s obligations under the applicable indenture have been discharged in accordance with the terms of the applicable indenture or (b) as specified in a supplemental indenture to the applicable indenture; and (ii) the Parent Guarantor has delivered to the trustee an officer’s certificate and an opinion of counsel, each stating that all conditions precedent provided for in the applicable indenture have been complied with. The Guarantee is limited by its terms to an amount not to exceed the maximum amount that can be guaranteed by the Parent Guarantor without rendering the Guarantee voidable under applicable law relating to fraudulent conveyance or fraudulent transfer or similar laws affecting the rights of creditors generally.\nThe following tables present summarized financial information for the Parent Guarantor and KHFC (as subsidiary issuer of the KHFC Senior Notes) (together, the “Obligor Group”), on a combined basis after the elimination of all intercompany balances and transactions between the Parent Guarantor and subsidiary issuer and investments in any subsidiary that is a non-guarantor.\nSummarized Statement of Income\nFor the Nine Months Ended\nSeptember 27, 2025\nNet sales\n$\n11,834 \nGross profit\n(a)\n4,363 \nIntercompany service fees and other recharges\n3,108 \nOperating income/(loss)\n758 \nEquity in earnings/(losses) of subsidiaries\n(6,421)\nNet income/(loss)\n(6,497)\nNet income/(loss) attributable to common shareholders\n(6,497)\n(a)    For the nine months ended September 27, 2025, the Obligor Group recorded $363 million of net sales to the non-guarantor subsidiaries and $46 million of purchases from the non-guarantor subsidiaries.\n46\nSummarized Balance Sheets\nSeptember 27, 2025\nDecember 28, 2024\nASSETS\nCurrent assets\n$\n4,895 \n$\n4,506 \nCurrent assets due from affiliates\n(a)\n147 \n445 \nNon-current assets\n5,689 \n5,848 \nGoodwill\n8,823 \n8,823 \nIntangible assets, net\n1,796 \n1,881 \nNon-current assets due from affiliates\n(b)\n28 \n28 \nLIABILITIES\nCurrent liabilities\n$\n4,757 \n$\n5,563 \nCurrent liabilities due to affiliates\n(a)\n1,548 \n1,924 \nNon-current liabilities\n21,266 \n22,846 \nNon-current liabilities due to affiliates\n(b)\n206 \n194 \n(a)    Represents receivables and short-term lending due from and payables and short-term lending due to non-guarantor subsidiaries.\n(b)    Represents long-term lending due from and long-term borrowings due to non-guarantor subsidiaries.\nCommodity Trends\nWe purchase and use large quantities of commodities, including dairy products, meats, sugar and other sweeteners, coffee beans, tomatoes, edible oils, eggs, fruits and vegetables, and wheat products to manufacture our products. In addition, we purchase and use significant quantities of plastics, resins, cardboard, glass and paper to package our products, and we use electricity, diesel fuel, and natural gas in the manufacturing and distribution of our products. We continuously monitor global supply and cost trends of these commodities.\nDuring the nine months ended September 27, 2025, we experienced increased commodity costs for coffee, meat, and eggs, while commodity costs for cheese and dairy, tomato products, edible oil and wheat products decreased. We manage commodity cost volatility primarily through pricing and risk management strategies including utilizing a range of commodity hedging techniques in an effort to limit the impact of price fluctuations on many of our principal raw materials. However, we do not fully hedge against changes in commodity prices, and our hedging strategies may not protect us from increases in specific raw material costs. As a result of these risk management strategies, our commodity costs may not immediately correlate with market price trends.\nSee our Annual Report on Form 10-K for the year ended December 28, 2024 for additional information on how we manage commodity costs.\nCritical Accounting Estimates\nOur significant accounting policies are described in Note 2, \nSignificant Accounting Policies\n, to the consolidated financial statements in our Annual Report on Form 10-K for the year ended December 28, 2024.\nWe prepare our condensed consolidated financial statements in conformity with U.S. GAAP. The preparation of these financial statements requires the use of estimates, judgments, and assumptions. Our critical accounting estimates and assumptions related to goodwill and intangible assets are described below. See Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, in our Annual Report on Form 10-K for the year ended December 28, 2024 for a discussion of our other critical accounting estimates and assumptions.\n47\nGoodwill and Intangible Assets:\nAs of September 27, 2025, we maintain 10 reporting units globally, six of which comprise our goodwill balance. These six reporting units had an aggregate goodwill carrying amount of $22.2 billion at September 27, 2025. Our indefinite-lived intangible asset balance primarily consists of a number of individual brands, which had an aggregate carrying amount of $34.1 billion at September 27, 2025.\nWe test our reporting units and brands for impairment annually, as of the first day of our third quarter, or more frequently if events or circumstances indicate it is more likely than not that the fair value of a reporting unit or brand is less than its carrying amount. Such events and circumstances could include a sustained decrease in our market capitalization, increased competition or unexpected loss of market share, increased input costs beyond projections, disposals of significant brands or components of our business, unexpected business disruptions (for example due to a natural disaster, pandemic, or loss of a customer, supplier, or other significant business relationship), unexpected significant declines in operating results, significant adverse changes in the markets in which we operate, changes in income tax rates, changes in interest rates, or changes in management strategy. We test reporting units for impairment by comparing the estimated fair value of each reporting unit with its carrying amount. We test brands for impairment by comparing the estimated fair value of each brand with its carrying amount. If the carrying amount of a reporting unit or brand exceeds its estimated fair value, we record an impairment loss based on the difference between fair value and carrying amount, in the case of reporting units, not to exceed the associated carrying amount of goodwill. See Note 8, \nGoodwill and Intangible Assets\n, in Item 1, \nFinancial Statements\n, for a discussion of the timing of the annual impairment test.\nFair value determinations require considerable judgment and are sensitive to changes in underlying assumptions, estimates, and market factors. Estimating the fair value of individual reporting units and brands requires us to make assumptions and estimates regarding our future plans, as well as industry, economic, and regulatory conditions, and to consider the market multiples of certain peer and guideline companies. These assumptions and estimates include estimated future annual cash flows (including net sales, cost of products sold, SG&A, depreciation and amortization, working capital, and capital expenditures), income tax considerations, discount rates, long-term growth rates, royalty rates, contributory asset charges, and other market factors. If current expectations of future growth rates and margins are not met, if market factors outside of our control change; such as discount rates, market capitalization, income tax rates, foreign currency exchange rates, or inflation, or if management’s expectations or plans otherwise change, including updates to our long-term operating plans, then one or more of our reporting units or brands might become impaired in the future. Additionally, any decisions to divest certain non-strategic assets could lead to future goodwill or intangible asset impairments.\nAs detailed in Note 8, \nGoodwill and Intangible Assets\n, in Item 1, \nFinancial Statements\n, we performed our 2025 Annual Impairment Test as of June 29, 2025, which was the first day of our third quarter of 2025. We concluded that the fair value of our reporting units and brands exceeded their carrying amounts and no impairment was recorded in the third quarter of 2025 as a result of the 2025 Annual Impairment Test. Our reporting units and brands that have 20% or less excess fair value over carrying amount as of the 2025 Annual Impairment Test have a heightened risk of future impairments if any assumptions, estimates, or market factors change in the future.\nOur reporting units that were determined to have less than 5% fair value over carrying amount as of our 2025 Annual Impairment Test had an aggregate goodwill carrying amount of $21.9 billion as of the 2025 Annual Impairment Test and included Elevation, HDM, Western Europe, MCCS, and Canada reporting units. Our Asia reporting unit had less than 20% fair value over carrying amount with an aggregate goodwill carrying amount of $314 million as of the 2025 Annual Impairment Test. Our reporting units that have 20% or less excess fair value over carrying amounts as of the 2025 Annual Impairment Test are considered at a heightened risk of future impairments and had an aggregate carrying amount of $22.2 billion. Our four remaining reporting units had no goodwill carrying amount at the time of the 2025 Annual Impairment Test.\nAs of the 2025 Annual Impairment Test, our \nKraft\n brand was determined to have less than 2% fair value over carrying amount, and had a carrying amount of $8.5 billion.\n \nOur brands that had over 2% but less than 10% fair value over carrying amount included \nLunchables, Bagel Bites, \nand\n Claussen \nand had an aggregate carrying amount of $1.2 billion as of the 2025 Annual Impairment Test. Our brands that had 10-20% fair value over carrying amount included \nVelveeta, Oscar Mayer, A1, Capri Sun, \nand\n Cool Whip \nand had an aggregate carrying amount of $5.3 billion as of the 2025 Annual Impairment Test.\n \nThe aggregate carrying amount of brands with fair value over carrying amount 20-50% was $17.0 billion as of the 2025 Annual Impairment Test. Although the remaining brands, with a carrying amount of $2.2 billion, have more than 50% excess fair value over carrying amount as of the 2025 Annual Impairment Test, these amounts are also susceptible to impairments if any assumptions, estimates, or market factors significantly change in the future. Our brands that have 20% or less excess fair value over carrying amounts as of the 2025 Annual Impairment Test are considered at a heightened risk of future impairments and had an aggregate carrying amount of $15.0 billion.\n48\nWe generally utilize the discounted cash flow method under the income approach to estimate the fair value of our reporting units. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual cash flows for each reporting unit (including net sales, cost of products sold, SG&A, depreciation and amortization, working capital, and capital expenditures), income tax rates, long-term growth rates, royalty rates, a discount rate that appropriately reflects the risks inherent in each future cash flow stream, and other market factors. We select the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and a consideration of market multiples of certain peer and guideline companies.\nWe utilize the excess earnings method under the income approach to estimate the fair value of certain of our largest brands. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual cash flows for each brand (including net sales, cost of products sold, and SG&A), contributory asset charges, income tax considerations, long-term growth rates, a discount rate that reflects the level of risk associated with the future earnings attributable to the brand, and management’s intent to invest in the brand indefinitely. We select the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and a consideration of market multiples of certain peer and guideline companies.\nWe utilize the relief from royalty method under the income approach to estimate the fair value of our remaining brands. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual sales for each brand, royalty rates (as a percentage of net sales that would hypothetically be charged by a licensor of the brand to an unrelated licensee), income tax considerations, long-term growth rates, a discount rate that reflects the level of risk associated with the future cost savings attributable to the brand, and management’s intent to invest in the brand indefinitely. We select the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and a consideration of market multiples of certain peer and guideline companies.\nThe discount rates, long-term growth rates, and royalty rates used to estimate the fair values of our reporting units and our brands with 20% or less excess fair value over carrying amount, as well as the goodwill or brand carrying amounts, as of the 2025 Annual Impairment Test for each reporting unit and brand were as follows:\nGoodwill Carrying Amount\n(in billions)\nDiscount Rate\nLong-Term Growth Rate\nRoyalty Rate\nMinimum\nMaximum\nMinimum\nMaximum\nMinimum\nMaximum\nReporting units\n$\n22.2 \n7.3 \n%\n11.8 \n%\n0.5 \n%\n4.0 \n%\nBrands\n(excess earnings method)\n11.3 \n8.5 \n%\n8.8 \n%\n0.5 \n%\n2.0 \n%\nBrands\n(relief from royalty method)\n3.7 \n8.8 \n%\n9.3 \n%\n0.5 \n%\n2.0 \n%\n7.0 \n%\n20.0 \n%\nAssumptions used in impairment testing are made at a point in time and require significant judgment; therefore, they are subject to change based on the facts and circumstances present at each annual and interim impairment test date. Additionally, these assumptions are generally interdependent and do not change in isolation. However, as it is reasonably possible that changes in assumptions could occur, as a sensitivity measure, we have presented the estimated effects of isolated changes in discount rates, long-term growth rates, and royalty rates on the fair values of our reporting units and brands with 20% or less excess fair value over carrying amount. These estimated changes in fair value are not necessarily representative of the actual impairment that would be recorded in the event of a fair value decline.\nIf we had changed the assumptions used to estimate the fair value of our reporting units and brands with 20% or less excess fair value over carrying amount, as a result of the 2025 Annual Impairment Test for each of these reporting units and brands, these isolated changes, which are reasonably possible to occur, would have led to the following increase/(decrease) in the aggregate fair value of these reporting units and brands (in billions):\nDiscount Rate\nLong-Term Growth Rate\nRoyalty Rate\n50-Basis-Point\n25-Basis-Point\n100-Basis-Point\nIncrease\nDecrease\nIncrease\nDecrease\nIncrease\nDecrease\nReporting units\n$\n(3.5)\n$\n4.0 \n$\n1.7 \n$\n(1.6)\nBrands (excess earnings method)\n(0.8)\n1.0 \n0.4 \n(0.3)\nBrands (relief from royalty method)\n(0.3)\n0.3 \n0.1 \n(0.1)\n$\n0.4 \n$\n(0.4)\n49\nDefinite-lived intangible assets are amortized on a straight-line basis over the estimated periods benefited. We review definite-lived intangible assets for impairment when conditions exist that indicate the carrying amount of the assets may not be recoverable. Such conditions could include significant adverse changes in the business climate, current-period operating or cash flow losses, significant declines in forecasted operations, or a current expectation that an asset group will be disposed of before the end of its useful life. We perform undiscounted operating cash flow analyses to determine if an impairment exists. When testing for impairment of definite-lived intangible assets held for use, we group assets at the lowest level for which cash flows are separately identifiable. If an impairment is determined to exist, the loss is calculated based on estimated fair value. Impairment losses on definite-lived intangible assets to be disposed of, if any, are based on the estimated proceeds to be received, less costs of disposal.\nSee Note 8, \nGoodwill and Intangible Assets\n, in Item 1, \nFinancial Statements\n, for our impairment testing results.\nNew Accounting Pronouncements\nSee Note 4, \nNew Accounting Standards\n, in Item 1, \nFinancial Statements\n, for a discussion of new accounting pronouncements.\nContingencies\nSee Note 15, \nCommitments, Contingencies, and Debt\n, in Item 1, \nFinancial Statements\n, for a discussion of our contingencies.\nNon-GAAP Financial Measures\nThe non-GAAP financial measures we provide in this report should be viewed in addition to, and not as an alternative for, results prepared in accordance with U.S. GAAP.\nTo supplement the condensed consolidated financial statements prepared in accordance with U.S. GAAP, we have presented Organic Net Sales, Adjusted Operating Income, and Adjusted EPS, which are considered non-GAAP financial measures. The non-GAAP financial measures presented may differ from similarly titled non-GAAP financial measures presented by other companies, and other companies may not define these non-GAAP financial measures in the same way. These measures are not substitutes for their comparable U.S. GAAP financial measures, such as net sales, net income/(loss), operating income(loss), diluted EPS, or other measures prescribed by U.S. GAAP, and there are limitations to using non-GAAP financial measures. \nManagement uses these non-GAAP financial measures to assist in comparing our performance on a consistent basis for purposes of business decision making by removing the impact of certain items that management believes do not directly reflect our underlying operations. We believe that Organic Net Sales, Adjusted Operating Income, and Adjusted EPS provide important comparability of underlying operating results, allowing investors and management to assess the Company’s operating performance on a consistent basis.\nManagement believes that presenting our non-GAAP financial measures is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating our results. We believe that the presentation of these non-GAAP financial measures, when considered together with the corresponding U.S. GAAP financial measures and the reconciliations to those measures, provides investors with additional understanding of the factors and trends affecting our business than could be obtained absent these disclosures.\nOrganic Net Sales is defined as net sales excluding, when they occur, the impact of currency, acquisitions and divestitures, and a 53rd week of shipments. We calculate the impact of currency on net sales by holding exchange rates constant at the previous year’s exchange rate, with the exception of highly inflationary subsidiaries, for which we calculate the previous year’s results using the current year’s exchange rate.\nAdjusted Operating Income is defined as operating income excluding, when they occur, the impacts restructuring activities, deal costs, separation costs, unrealized gains/(losses) on commodity hedges (the unrealized gains and losses are recorded in general corporate expenses until realized; once realized, the gains and losses are recorded in the applicable segment’s operating results), impairment losses, and certain non-ordinary course legal and regulatory matters.\nAdjusted EPS is defined as diluted EPS excluding, when they occur, the impacts of restructuring activities, deal costs, separation costs, unrealized losses/(gains) on commodity hedges, impairment losses, certain non-ordinary course legal and regulatory matters, losses/(gains) on the sale of a business, other losses/(gains) related to acquisitions and divestitures (e.g., tax and hedging impacts), nonmonetary currency devaluation (e.g., remeasurement gains and losses), debt prepayment and extinguishment (benefit)/costs, and certain significant discrete income tax items, and including, when they occur, adjustments to reflect preferred stock dividend payments on an accrual basis.\n50\nThe Kraft Heinz Company\nReconciliation of Net Sales to Organic Net Sales\n(dollars in millions)\n(Unaudited)\nNet Sales\nCurrency\nAcquisitions and Divestitures\nOrganic Net Sales\nPrice\nVolume/Mix\nThree Months Ended September 27, 2025\nNorth America\n$\n4,641 \n$\n(4)\n$\n— \n$\n4,645 \nInternational Developed Markets\n895 \n26 \n— \n869 \nEmerging Markets\n701 \n14 \n— \n687 \nKraft Heinz\n$\n6,237 \n$\n36 \n$\n— \n$\n6,201 \nThree Months Ended September 28, 2024\nNorth America\n$\n4,826 \n$\n— \n$\n— \n$\n4,826 \nInternational Developed Markets\n882 \n— \n— \n882 \nEmerging Markets\n675 \n20 \n— \n655 \nKraft Heinz\n$\n6,383 \n$\n20 \n$\n— \n$\n6,363 \nYear-over-year growth rates\nNorth America\n(3.8)\n%\n0.0 pp\n0.0 pp\n(3.8)\n%\n0.4 pp\n(4.2) pp\nInternational Developed Markets\n1.6 \n%\n3.0 pp\n0.0 pp\n(1.4)\n%\n1.0 pp\n(2.4) pp\nEmerging Markets\n3.8 \n%\n(0.9) pp\n0.0 pp\n4.7 \n%\n4.0 pp\n0.7 pp\nKraft Heinz\n(2.3)\n%\n0.2 pp\n0.0 pp\n(2.5)\n%\n1.0 pp\n(3.5) pp\n51\nThe Kraft Heinz Company\nReconciliation of Net Sales to Organic Net Sales\n(dollars in millions)\n(Unaudited)\nNet Sales\nCurrency\nAcquisitions and Divestitures\nOrganic Net Sales\nPrice\nVolume/Mix\nNine Months Ended September 27, 2025\nNorth America\n$\n13,886 \n$\n(35)\n$\n— \n$\n13,921 \nInternational Developed Markets\n2,609 \n34 \n— \n2,575 \nEmerging Markets\n2,093 \n(23)\n— \n2,116 \nKraft Heinz\n$\n18,588 \n$\n(24)\n$\n— \n$\n18,612 \nNine Months Ended September 28, 2024\nNorth America\n$\n14,575 \n$\n— \n$\n— \n$\n14,575 \nInternational Developed Markets\n2,622 \n— \n— \n2,622 \nEmerging Markets\n2,073 \n56 \n10 \n2,007 \nKraft Heinz\n$\n19,270 \n$\n56 \n$\n10 \n$\n19,204 \nYear-over-year growth rates\nNorth America\n(4.7)\n%\n(0.2) pp\n0.0 pp\n(4.5)\n%\n0.4 pp\n(4.9) pp\nInternational Developed Markets\n(0.5)\n%\n1.3 pp\n0.0 pp\n(1.8)\n%\n0.5 pp\n(2.3) pp\nEmerging Markets\n0.9 \n%\n(4.0) pp\n(0.5) pp\n5.4 \n%\n4.5 pp\n0.9 pp\nKraft Heinz\n(3.5)\n%\n(0.4) pp\n0.0 pp\n(3.1)\n%\n0.8 pp\n(3.9) pp\n52\nThe Kraft Heinz Company\nReconciliation of Operating Income/(Loss) to Adjusted Operating Income\n(dollars in millions)\n(Unaudited)\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\nOperating income/(loss)\n$\n1,025 \n$\n(101)\n$\n(5,753)\n$\n1,723 \nRestructuring activities\n6 \n— \n10 \n— \nUnrealized losses/(gains) on commodity hedges\n23 \n3 \n6 \n(30)\nImpairment losses\n35 \n1,428 \n9,301 \n2,282 \nSeparation costs\n17 \n— \n17 \n— \nAdjusted Operating Income\n$\n1,106 \n$\n1,330 \n$\n3,581 \n$\n3,975 \n53\nThe Kraft Heinz Company\nReconciliation of Diluted EPS to Adjusted EPS\n(Unaudited)\nFor the Three Months Ended\nFor the Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\nDiluted EPS\n$\n0.52 \n$\n(0.24)\n$\n(5.47)\n$\n0.50 \nRestructuring activities\n(a)\n— \n— \n0.01 \n— \nUnrealized losses/(gains) on commodity hedges\n(b)\n0.02 \n— \n— \n(0.02)\nImpairment losses\n(c)\n0.03 \n0.99 \n7.30 \n1.69 \nSeparation costs\n(d)\n0.01 \n— \n0.01 \n— \nLosses/(gains) on sale of business\n(e)\n0.04 \n— \n0.04 \n0.05 \nNonmonetary currency devaluation\n(f)\n— \n— \n0.02 \n— \nCertain significant discrete income tax items\n(g)\n(0.01)\n— \n0.01 \n— \nAdjusted EPS\n$\n0.61 \n$\n0.75 \n$\n1.92 \n$\n2.22 \n(a)    Gross expenses/(income) included in restructuring activities were expenses of $4 million ($1 million after-tax) for the three months and $18 million ($9 million after-tax) for the nine months ended September 27, 2025 and income of $7 million ($5 million after-tax) for the three months and $8 million ($6 million after-tax) for the nine months ended September 28, 2024 and were recorded in the following income statement line items:\n•\nCost of products sold included expenses of $2 million for the three months and $1 million for the nine months ended September 27, 2025 and expenses of $2 million for the nine months ended September 28, 2024; and\n•\nSG&A included expenses of $4 million for the three months and $9 million for the nine months ended September 27, 2025 and income of $2 million for the nine months ended September 28, 2024.\n•\nOther expense/(income) included income of $2 million for the three months and expenses of $8 million for the nine months ended September 27, 2025 and income of $7 million for the three months and $8 million for the nine months ended September 28, 2024\n(b)    Gross expenses/(income) included in unrealized losses/(gains) on commodity hedges were expenses of $23 million ($18 million after-tax) for the three months and $6 million ($5 million after-tax) for the nine months ended September 27, 2025 and expenses of $3 million ($2 million after-tax) for the three months and income of $30 million ($22 million after-tax) for the nine months ended September 28, 2024, and were recorded in cost of products sold.\n(c)    Gross impairment losses included the following:\n•\nGoodwill impairment losses of $35 million ($35 million after-tax) for the three months and $6.7 billion ($6.7 billion after-tax) for the nine months ended September 27, 2025 and $707 million ($659 million after-tax) for the three months and $1.6 billion ($1.5 billion after-tax) for the nine months ended September 28, 2024, which were recorded in SG&A;\n•\nIntangible asset impairment losses of $2.6 billion ($2 billion after-tax) for the nine months ended September 27, 2025 and $721 million ($541 million after-tax) for the three and nine months ended September 28, 2024, which were recorded in SG&A.\n(d)    Gross expenses recorded in separation costs were $17 million ($13 million after-tax) for the three and nine months ended September 27, 2025, and were recorded in SG&A.\n(e)    Gross expenses/(income) included in losses/(gains) on sale of business were expenses of $44 million ($44 million after-tax) for the three and nine months ended September 27, 2025 and expenses of zero ($4 million after-tax) for the three months and $78 million ($57 million after-tax) for the nine months ended September 28, 2024, and were recorded in other expense/(income).\n(f)    Gross expenses included in nonmonetary currency devaluation were $5 million ($5 million after-tax) for the three months and $26 million ($26 million after-tax) for the nine months ended September 27, 2025 and $3 million ($3 million after-tax) for the three months and $7 million ($7 million after-tax) for the nine months ended September 28, 2024, and were recorded in other expense/(income).\n(g)    Certain significant discrete income tax items were a benefit of $6 million for the three months and expenses of $10 million for the nine months ended September 27, 2025. The expense represents current period movement in the valuation allowance against deferred tax assets in our subsidiary in Brazil and adjustments recorded to the deferred tax asset and valuation allowance related to the transfer of business operations to a wholly-owned subsidiary in the Netherlands in December 2024.\n54"
}