{
  "source_file": "khc-20241228.htm",
  "form_type": "10-K",
  "item1": "Item 1.  Business. \nGeneral\nWe are driving transformation at The Kraft Heinz Company (Nasdaq: KHC), inspired by our Purpose, \nLet’s Make Life Delicious\n. Consumers are at the center of everything we do. With 2024 net sales of approximately $26 billion, we are committed to growing our iconic and emerging food and beverage brands on a global scale. We leverage our scale and agility to unleash the full power of Kraft Heinz across a portfolio of eight consumer-driven product platforms. As global citizens, we’re dedicated to making a sustainable, ethical impact while helping to feed the world in healthy, responsible ways.\nOn July 2, 2015, through a series of transactions, we consummated the merger of Kraft Foods Group, Inc. (“Kraft”) with and into a wholly-owned subsidiary of H.J. Heinz Holding Corporation (“Heinz”) (the “2015 Merger”). At the closing of the 2015 Merger, Heinz was renamed The Kraft Heinz Company, and H. J. Heinz Company changed its name to Kraft Heinz Foods Company (“KHFC”).\nWe operate on a 52- or 53-week fiscal year ending on the last Saturday in December in each calendar year. Unless the context requires otherwise, references to years and quarters contained herein pertain to our fiscal years and fiscal quarters. Our 2024 fiscal year was a 52-week period that ended on December 28, 2024, our 2023 fiscal year was a 52-week period that ended on December 30, 2023, and our 2022 fiscal year was a 53-week period that ended on December 31, 2022.\nReportable Segments: \nIn the first quarter of 2024, we divided our International segment into three operating segments — Europe and Pacific Developed Markets (“EPDM” or “International Developed Markets”), West and East Emerging Markets (“WEEM”), and Asia Emerging Markets (“AEM”) — to enable enhanced focus on the different strategies required for each of these regions as part of our long-term strategic plan. \nSubsequently, we manage our operating results through four operating segments. We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nSee Note 20, \nSegment Reporting\n, in Item 8,\n Financial Statements and Supplementary Data\n, for our geographic financial information by segment.\nResources\nTrademarks and Intellectual Property:\nOur trademarks are material to our business and are among our most valuable assets. Depending on the country, trademarks generally remain valid for as long as they are in use or their registration status is maintained. Significant trademarks by segment based on net sales in 2024 were:\nMajority Owned and Licensed Trademarks\nNorth America\nKraft, Oscar Mayer, Heinz, Philadelphia, Lunchables, Velveeta, Ore-Ida, Capri Sun*, Maxwell House, Kool-Aid, Jell-O\nInternational Developed Markets\nHeinz, Golden Circle, Wattie’s, Plasmon\nEmerging Markets\n(a)\nHeinz, ABC, Master, Quero, Kraft, Pudliszki\n(a)     Emerging Markets represents the aggregation of our WEEM and AEM operating segments.\n    \n*Used under license.\nWe sell certain products under brands we license from third parties. In 2024, brands used under licenses from third parties included \nCapri Sun\n packaged drink pouches for sale in our North America segment. We also grant certain licenses to third parties to use our intellectual property rights in select jurisdictions. In our agreements with an affiliate of Groupe Lactalis (“Lactalis”), we granted the other party various licenses to use certain of our and their respective intellectual property rights in perpetuity, including perpetual licenses for the \nKraft\n and \nVelveeta\n brands for certain cheese products.\nWe also own numerous patents worldwide. We consider our portfolio of patents, patent applications, patent licenses under patents owned by third parties, proprietary trade secrets, technology, know-how processes, and related intellectual property rights to be material to our operations. Patents, issued or applied for, cover inventions ranging from packaging techniques to processes relating to specific products and to the products themselves. While our patent portfolio is material to our business, the loss of one patent or a group of related patents would not have a material adverse effect on our business.\n1\nOur issued patents extend for varying periods according to the date of the patent application filing or grant and the legal term of patents in the various countries where patent protection is obtained. The actual protection afforded by a patent, which can vary from country to country, depends upon the type of patent, the scope of its coverage as determined by the patent office or courts in the country, and the availability of legal remedies in the country.\nRaw Materials and Packaging:\nWe manufacture (and contract for the manufacture of) our products from a wide variety of raw materials. We purchase and use large quantities of commodities, including dairy products, meat products, tomato products, sugar and other sweeteners, soybean and vegetable oils, coffee beans, wheat and processed grains, eggs, and other fruits and vegetables to manufacture our products. In addition, we purchase and use significant quantities of plastics, cardboard, resin, glass, and metal to package our products, and we use electricity, diesel fuel, and natural gas in the manufacturing and distribution of our products. For commodities that we use across many of our product categories we coordinate sourcing requirements and centralize procurement to leverage our scale. In addition, some of our product lines and brands separately source raw materials that are specific to their operations. We source these commodities from a variety of providers, ranging from large, international producers to smaller, local, independent sellers. Where appropriate, we seek to establish preferred purchaser status and have developed strategic partnerships with many of our suppliers with the objective of achieving favorable pricing and dependable supply for many of our commodities. The prices of raw materials that we use in our products are affected by external factors, such as global competition for resources, currency fluctuations, severe weather or global climate change, pandemics, geopolitical conflicts, consumer, industrial, or investment demand, and changes in governmental regulation and trade, tariffs, alternative energy, and agricultural programs. In 2024, we experienced moderate inflation in our supply chain costs compared to the prior year period, which we expect to continue through 2025. While inflationary pressures within procurement, manufacturing, and logistics costs had a negative impact on our results of operations, we experienced increased stability of these costs as compared to the prior year period.\nOur procurement teams monitor worldwide supply and cost trends so we can obtain ingredients and packaging needed for production at competitive prices. Although the prices of our principal raw materials can be expected to fluctuate, we believe there will be an adequate supply of the raw materials we use and that they are generally available from numerous sources. We use a range of hedging techniques in an effort to limit the impact of price fluctuations on many of our principal raw materials. However, we do not fully hedge against changes in commodity prices, and our hedging strategies may not protect us from increases in specific raw material costs. We actively monitor changes to commodity costs so that we can seek to mitigate the effect through pricing and other operational measures.\nResearch and Development\nOur research and development efforts focus on achieving the following four objectives:\n•\nproduct innovations, renovations, and new technologies to meet changing consumer needs, support our environmental and sustainability goals, and drive growth;\n•\nworld-class and uncompromising food safety, quality, and consistency;\n•\nsuperior, consumer-preferred product and package performance; and\n•\ncontinuous process, product, and supply chain optimization and productivity initiatives.\nCompetition\nOur products are sold in highly competitive marketplaces, including e-commerce retailers, large-format retailers, and discounters. Our competitors include large national and international food and beverage companies and numerous local and regional companies. We compete with both branded and private label products sold by retailers, wholesalers, and cooperatives. We compete on the basis of product innovation, price, product quality, nutritional value, service, taste, convenience, brand recognition and loyalty, effectiveness of marketing and distribution, promotional activity, and the ability to identify and satisfy changing consumer preferences. Improving our market position or introducing new products requires substantial advertising, promotional, and research and development expenditures.\n2\nSales\nSales and Customers:\nOur products are sold through our own sales organizations and through independent brokers, agents, and distributors to chain, wholesale, cooperative, and independent grocery accounts; convenience, value, and club stores; pharmacies and drug stores; mass merchants; foodservice distributors; and institutions, including hotels, restaurants, bakeries, hospitals, health care facilities, and government agencies. Our products are also sold online through various e-commerce platforms and retailers.\nWe have key customers in different regions around the world. In 2024, the five largest customers in our North America segment accounted for approximately 46% of North America segment net sales, the five largest customers in our International Developed Markets segment accounted for approximately 28% of International Developed Markets net sales, and the five largest customers in Emerging Markets accounted for approximately 12% of Emerging Markets net sales. Our largest customer, Walmart Inc., represented approximately 21% of our net sales in 2024, 2023, and 2022. Both of our reportable segments have sales to Walmart Inc.\nIn the first quarter of 2024, we changed the way we manage our product portfolio to align with our future growth strategy. As of December 28, 2024, we manage our sales portfolio through eight consumer-driven product platforms. A platform is a lens created for the portfolio based on a grouping of consumer needs and includes the following for Kraft Heinz: Taste Elevation, Easy Ready Meals, Substantial Snacking, Desserts, Hydration, Cheese, Coffee and Meats. \nTaste Elevation includes condiments, sauces, dressings, and spreads. Easy Ready Meals includes Kraft Mac & Cheese varieties, frozen potato products, and other frozen meals. Substantial Snacking includes Lunchables meal kits, frozen snacks, and pickles. Desserts includes dry packaged desserts, refrigerated ready to eat desserts, and other dessert toppings. Hydration includes ready to drink beverages, powdered beverages, and liquid concentrates. Cheese includes American sliced and recipe cheeses. Coffee includes mainstream coffee, coffee pods, and premium coffee. Meats includes cold cuts, bacon, and hot dogs.\nThe platforms are modular and configurable by reportable segment and market and help us to manage and organize our business effectively by providing insight into our various product categories and brands. Further, each platform is assigned a role within our business to help inform our resource allocation and investment decisions, which are made at the operating segment level. These roles include Accelerate, Protect, and Balance. The role of a platform may also vary by reportable segment and market.\nNet Sales by Platform:\nNet sales by platform as a percentage of consolidated net sales for the periods presented were:\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\nACCELERATE\nTaste Elevation\n44 \n%\n44 \n%\n41 \n%\nEasy Ready Meals\n18 \n%\n18 \n%\n19 \n%\nSubstantial Snacking\n5 \n%\n5 \n%\n6 \n%\nPROTECT\nDesserts\n4 \n%\n4 \n%\n4 \n%\nHydration\n9 \n%\n9 \n%\n9 \n%\nBALANCE\nCheese\n7 \n%\n7 \n%\n7 \n%\nCoffee\n3 \n%\n3 \n%\n3 \n%\nMeats\n8 \n%\n8 \n%\n9 \n%\nOther\n2 \n%\n2 \n%\n2 \n%\nSeasonality\nAlthough crops constituting certain of our raw food ingredients are harvested on a seasonal basis, the majority of our products are produced throughout the year.\nSeasonal factors inherent in our business change the demand for products, including holidays, changes in seasons, or other annual events. While these factors influence our quarterly net sales, operating income/(loss), and cash flows at the product level, unless the timing of such events shift period-over-period (e.g., a shift in Easter timing), this seasonality does not typically have a significant effect on our consolidated results of operations or segment results.\n3\nGovernment Regulation\nThe manufacture and sale of consumer food and beverage products is highly regulated. Our business operations, including the production, transportation, storage, distribution, sale, display, advertising, marketing, labeling, quality, and safety of our products and their ingredients, and our occupational safety, health, and privacy practices, are subject to various laws and regulations. In the United States, our activities are subject to regulation by various federal government agencies, including the Food and Drug Administration, Department of Agriculture, Federal Trade Commission, Department of Labor, Department of Commerce, and Environmental Protection Agency, as well as various state and local agencies. We are also subject to numerous laws and regulations outside of the United States in markets where our products are manufactured, distributed, or sold, including laws and regulations governing food safety, health and safety, anti-corruption, and data privacy. In our business dealings, we are also required to comply with the U.S. Foreign Corrupt Practices Act (“FCPA”), the U.K. Bribery Act, the U.S. Trade Sanctions Reform and Export Enhancement Act, and various other anti-corruption regulations in the regions in which we operate. We rely on legal and operational compliance programs, as well as in-house and outside counsel, to guide our businesses in complying with applicable laws and regulations. In addition, regulatory regime changes may add cost and complexity to our compliance efforts.\nEnvironmental Regulation:\nOur activities throughout the world are highly regulated and subject to government oversight regarding environmental matters. Various laws concerning the handling, storage, and disposal of hazardous materials and the operation of facilities in environmentally sensitive locations may impact aspects of our operations.\nIn the United States, where a significant portion of our business operates, these laws and regulations include the Clean Air Act, the Clean Water Act, the Resource Conservation and Recovery Act, and the Comprehensive Environmental Response, Compensation, and Liability Act (“CERCLA”). CERCLA imposes joint and several liability on each potentially responsible party. We are involved in a number of active proceedings in the United States under CERCLA (and other state actions under similar legislation) related to certain closed, inactive, or divested operations for which we retain liability. \nAs of December 28, 2024, we had accrued an amount we deemed appropriate for environmental remediation. Based on information currently available, we believe that the ultimate resolution of existing environmental remediation actions and our general compliance with environmental laws and regulations will not have a material effect on our earnings or financial condition. However, it is difficult to predict with certainty the potential impact of future compliance efforts and environmental remedial actions and, thus, future costs associated with such matters may exceed current reserves.\nHuman Capital Management\nWe are driven by our Purpose– \nLet’s make life delicious\n, our Company Dream—\nTo be the leader in elevating and creating food that makes you feel good, \nand our Values and Leadership Principles. Those elements represent the foundation upon which our culture is built. They represent the expectations we have for ourselves and the environment we aspire to create for our Company. We recognize that our ownership-centric culture is vital to our overall success and a key competitive advantage.\nOur people are at the heart of who we are at Kraft Heinz. We drive growth through high accountability, development and career opportunities, empowerment, and autonomy. We recognize and reward outstanding and differentiated performance at every level, creating a true spirit of ownership, ambition, and meritocracy. We strive to channel our employees’ passion, curiosity, and attitude to make an impact on our future and our legacy by leading as learners, acting as owners, and being change agents. Our Board of Directors (“Board”), through the Human Capital and Compensation Committee, oversees our human resources strategy and key policies.\nEngagement:\nWe are committed to attracting, developing, and retaining world-class talent and creating an engaging and inclusive culture that embodies our Purpose, Dream, Values, and Leadership Principles. As of December 28, 2024, Kraft Heinz had approximately 36,000 employees globally. Driven by our Value \nWe champion great people\n, we support our employees’ health, safety, and professional development and reward outstanding and differentiated performance at every level. Our rewards strategies (compensation, benefits, recognition, and wellbeing) aim to help our employees help themselves to LiveWell. LiveWell represents our total rewards offerings that are designed to attract and engage highly skilled and performance-oriented talent, meet individual and family needs, and inspire, celebrate, and engage our people and teams through enhanced interactions in moments that matter in an environment where employees feel productive, trusted, and empowered.\nGuided by our Values, we conduct a global engagement survey annually to provide employees with an opportunity to share anonymous feedback with management across a variety of topic areas. The results and comments are reviewed by the Board, senior leadership, managers, and human resources to help determine where changes are needed to support our people and teams.\n4\nOur November 2024 survey showed that we hit an all-time high for employee engagement since the 2015 Merger and achieved our aspiration to rank in the top-quartile on the Inclusion Index, which measures employees feeling like their opinions count, belonging and inclusive leadership.\nWe believe our culture is the secret sauce that sets us apart and drives our success. It is the key ingredient that unites us as a Community of Owners, fosters a sense of belonging, and inspires us to lead the future of food. It is the foundation of our employee value proposition.\nWe grow our people to grow our business. Our Employee Value Proposition is built on three core pillars:\n•\nWe develop people for greatness, unlocking their full potential through continuous learning and growth opportunities.\n•\nWe nurture an ownership-centric culture, encouraging people to act with autonomy and treat our business as their own.\n•\nWe drive impact by challenging the status quo, celebrating differences, and sparking innovation in pursuit of leading the future of food.\nOver the past decade, we have been on a journey to create a workplace that resembles the consumers that we serve and provide delicious innovations that better serve our people, business, and communities. We have made significant progress, learned a lot, and plan to build on our successes as we set the table for the future.\nWellbeing and Safety:\nOur employees’ health, safety, and wellbeing are a top priority. We establish and administer company-wide policies and processes to protect the health, safety, and security of our employees, subcontractors, and all those who visit our facilities, and to comply with applicable regulations. We review and monitor our performance closely to drive improvement. To help us evaluate how effective our safety efforts are in lowering incidents rates, we use a Total Recordable Incident Rate (“TRIR”). TRIR is a medical incident rate based on the U.S. Occupational Safety and Health Administration (“OSHA”) record-keeping criteria (injuries per 200,000 hours). Our TRIR globally was 0.39 in 2024 and 0.53 in 2023.\nOur global LiveWell program focuses on four wellbeing elements — physical, emotional, financial, and social health — and provides specific programs and resources to support our employees and their families within each of these areas.\nLearning and Development:\nThrough Ownerversity, our Kraft Heinz learning ecosystem, we provide learning opportunities for each of our employees, designed to inspire and grow talent within Kraft Heinz while developing employees’ skills and competencies to help them navigate their career journey. Our learning and development offerings are created to enable employees to live our Value \nWe dare to do better every day\n and own their personal learning and development. We believe this empowers employees to execute with excellence in their current role, accelerate their learning curves, and grow a great career. Through Ownerversity, employees have access to custom Kraft Heinz training, learning and development materials, and external content libraries and articles. \nRewards and Compensation:\nOur Total Rewards philosophy is to provide a meaningful and flexible spectrum of programs that equitably support our workforce and their families, and compliment Kraft Heinz’ strategy and values. Total Rewards includes compensation elements of base pay and wages and incentives, healthcare, savings and insurance plans, wellbeing plans, employee recognition programs, and other voluntary elected benefits. Kraft Heinz is a great place for those who dare to win in a challenging, meritocratic, ambitious, and engaging environment. We believe in ownership and meritocracy, recognizing and rewarding our people on their achievements and impact as they grow their careers with us. We aim for global consistency while respecting local market practices and employee preferences. The plans are designed to be market competitive and data-driven to promote our high-performance and results-oriented growth culture and realize our Purpose to \nMake Life Delicious\n for employees and their families. \nEthics and Transparency:\nThe Kraft Heinz Ethics Helpline is available to our partners, suppliers, customers, and consumers to ask questions or report potential violations of various policies and ethical guidelines, including our Code of Conduct, Supplier Guiding Principles, and Global Human Rights Policy. \nWe report more detailed information regarding our programs and initiatives related to our people and human capital management in our Environmental Social Governance Report. Our 2024 report, which provides our progress through 2023, is available on our website at \nwww.kraftheinzcompany.com/esg\n. The information on our website, including our ESG Report, is not, and shall not be deemed to be, a part of this Annual Report on Form 10-K or incorporated into any other filings we make with the Securities and Exchange Commission (“SEC”).\n5\nInformation about our Executive Officers\nThe following are our executive officers as of February 8, 2025:\nName and Title\nAge\nBusiness Experience in the Past Five Years\nCarlos Abrams-Rivera,\nChief Executive Officer and Director\n57\nChief Executive Officer (since December 2023); President Kraft Heinz (August to December 2023); Executive Vice President and President, North America (December 2021 to August 2023); and U.S. Zone President (February 2020 to December 2021). Executive Vice President and President, Campbell Snacks (May 2019 to February 2020), and President, Campbell Snacks (March 2018 to May 2019) at Campbell Soup Company (“Campbell”), a food and beverage company.\nAndre Maciel,\nExecutive Vice President and Global Chief Financial Officer\n50\nExecutive Vice President and Global Chief Financial Officer (since March 2022); Senior Vice President, U.S. Chief Financial Officer, and Head of Digital Transformation (September 2019 to March 2022); Managing Director, Continental Europe (January to August 2019); Chief Financial Officer, U.S. (2017 to January 2019); and Head of U.S. Commercial Finance (2015 to 2017).\nDiana Frost,\nGlobal Chief Growth Officer\n42\nGlobal Chief Growth Officer (since December 2023); Chief Growth Officer, North America (August to December 2023); Head of North America Disruption and Canada Chief Marketing Officer (January to August 2022); and Chief Growth Officer, Canada (September 2020 to December 2021). Head of Portfolio Transformation, Mars Wrigley (January 2019 to September 2020) at Mars, Incorporated, a multinational confections company.\nMarcos Eloi Lima,\nExecutive Vice President and Global Chief Procurement and Sustainability Officer\n47\nExecutive Vice President and Global Chief Procurement and Sustainability Officer (since December 2023); Executive Vice President and Global Chief Procurement Officer (December 2021 to December 2023); Chief Procurement Officer (October 2019 to December 2023); and Advisor in the area of procurement (July to October 2019). Vice President Procurement & Sustainability Middle Americas Zone (2016 to July 2019) at Anheuser-Busch InBev SA/NV (“AB InBev”), a multinational drink and brewing holdings company.\nPedro Navio,\nExecutive Vice President and President, North America\n44\nExecutive Vice President and President, North America (since December 2023); President – Taste, Meals, and Away From Home (March 2022 to December 2023); President, Latin America (November 2019 to February 2022); and President, Brazil (2017 to November 2019).\nCory Onell,\nExecutive Vice President and Chief Omnichannel Sales and Asian Emerging Markets Officer\n51\nExecutive Vice President and Chief Omnichannel Sales and Asian Emerging Markets Officer (since December 2023) and Chief Sales Officer, U.S. (August 2020 to December 2023). Senior Vice President and Head of U.S. Retail Sales (April to July 2020) at The J. M. Smucker Company, a food and beverage company. Senior Vice President, Sales (2017 to April 2020) at Campbell.\nFlávio Barros Torres,\nExecutive Vice President and Global Chief Supply Chain Officer\n55\nExecutive Vice President and Global Chief Supply Chain Officer (since December 2021); and Head of Global Operations (January 2020 to December 2021). Global Operations Vice President (2017 to 2019) at AB InBev.\nMelissa Werneck,\nExecutive Vice President and Global Chief People Officer\n52\nExecutive Vice President and Global Chief People Officer (since December 2021); Global Chief People Officer (2016 to December 2021); and Head of Global Human Resources, Performance and Information Technology (2015 to 2016).\nAngel Willis\nExecutive Vice President, Global General Counsel and Corporate Affairs Officer\n54\nExecutive Vice President, Global General Counsel and Corporate Affairs Officer (since November 2024); and Vice President, General Counsel and Secretary (January 2019 to November 2024) at Sealed Air Corporation, a global provider of packaging solutions.\n6\nAvailable Information\nOur website address is \nwww.kraftheinzcompany.com\n. We use our investor relations website, ir.kraftheinzcompany.com, as a routine channel for distribution of important, and often material, information about Kraft Heinz, including quarterly and annual earnings results and presentations, press releases and other announcements, webcasts, analyst presentations, investor days, sustainability initiatives, financial information, and corporate governance practices, as well as archives of past presentations and events. We encourage you to follow our investor relations website in addition to our filings with the SEC to receive timely information about the Company. The information on our website is not part of this Annual Report on Form 10-K and shall not be deemed to be incorporated by reference into this report or any other filings we make with the SEC. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, (the “Exchange Act”), are available free of charge on our website as soon as reasonably practicable after we electronically file them with, or furnish them to, the SEC. In addition, the SEC maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements, and other information regarding issuers, including Kraft Heinz, that are electronically filed with the SEC.",
  "item7": "Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOverview\nObjective:\nThe following discussion provides an analysis of our financial condition and results of operations from management's perspective and should be read in conjunction with the consolidated financial statements and related notes included in Item 8, \nFinancial Statements and Supplementary Data\n, of this Annual Report on Form 10-K. Our objective is to also provide discussion of material events and uncertainties known to management that are reasonably likely to cause reported financial information not to be indicative of future operating results or of future financial condition and to offer information that provides an understanding of our financial condition, results of operations, and cash flows.\nSee below for discussion and analysis of our financial condition and results of operations for 2024 compared to 2023 and for 2023 compared to 2022.\nDescription of the Company: \nWe manufacture and market food and beverage products around the world through our eight consumer-driven product platforms: Taste Elevation, Easy Ready Meals, Hydration, Meats, Cheeses, Substantial Snacking, Desserts, Coffee, and other grocery products.\nIn the first quarter of 2024, we divided our International segment into three operating segments — Europe and Pacific Developed Markets (“EPDM” or “International Developed Markets”), West and East Emerging Markets (“WEEM”), and Asia Emerging Markets (“AEM”) — to enable enhanced focus on the different strategies required for each of these regions as part of our long-term strategic plan. Subsequently, we manage our operating results through four operating segments. We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nSee Note 20, \nSegment Reporting\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for our financial information by segment.\nItems Affecting Comparability of Financial Results\nImpairment Losses:\nOur results of operations reflect goodwill impairment losses of $1.6 billion and intangible asset impairment losses of $2.0 billion in 2024. We recognized goodwill impairment losses of $510 million and intangible asset impairment losses of $152 million in 2023. We recognized goodwill impairment losses of $444 million, intangible asset impairment losses of $469 million, and net property, and plant, and equipment asset impairment losses of $86 million in 2022. See Note 8, \nGoodwill and Intangible Assets\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our goodwill and intangible asset impairment losses.\n53rd Week:\nWe operate on a 52- or 53-week fiscal year ending on the last Saturday in December in each calendar year. Our 2024 fiscal year was a 52-week period that ended on December 28, 2024, our 2023 fiscal year was a 52-week period that ended on December 30, 2023, and our 2022 fiscal year was a 53-week period that ended on December 31, 2022.\nAcquisitions and Divestitures:\nIn 2024, we closed the sale of our infant nutrition business in Russia (the “Russia Infant Transaction”) and the sale of 100% of the equity interests in our Papua New Guinea subsidiary (the “Papua New Guinea Transaction”), both within Emerging Markets. In 2022, we completed the Hemmer Acquisition within Emerging Markets, and the Just Spices Acquisition within our International Developed Markets segment. See Note 4, Acquisitions and Divestitures, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our acquisition and divestiture activities.\nInflation and Supply Chain Impacts:\nDuring the year ended December 28, 2024, we experienced moderate inflation in our supply chain costs compared to the prior year period, which we expect to continue through 2025. While inflationary pressures within procurement, manufacturing, and logistics costs had a negative impact on our results of operations, we experienced increased stability of these costs as compared to the prior year period. Further, we continue to take measures to mitigate the impact of this inflation through efficiency initiatives, pricing actions, and hedging strategies. However, there has been, and we expect that there could continue to be, a difference between the timing of when these beneficial actions impact our results of operations and when the cost inflation is incurred. Additionally, the pricing actions we have taken have, in some instances, negatively impacted, and could continue to negatively impact, our market share.\n26\nIncome Taxes:\nThe Organization for Economic Co-operation and Development (OECD), a global coalition of member countries, proposed a two-pillar plan that aims to ensure a fairer distribution of profits among countries and impose a floor on tax competition through the introduction of a global minimum tax of 15%. Many countries have enacted, or begun the process of enacting, laws based on the two-pillar plan proposals.\nAs part of our planning for the changes in the international tax environment, as well as to achieve greater operational synergies, we have enacted changes to our corporate entity structure which included a transfer of, and will result in the movement of, certain business operations to a wholly-owned subsidiary in the Netherlands resulting in a tax benefit of $3.0 billion recorded as a non-U.S. deferred tax asset in December 2024. The deferred tax asset was recognized as a result of the book and tax basis difference on the business transferred to the Netherlands subsidiary with the tax basis determined by reference to the fair value of the business. The determination of the estimated fair value of the transferred business is complex and requires the exercise of substantial judgment due to the use of subjective assumptions in the valuation method used by management. The associated valuation allowance of $0.6 billion is related to uncertainty in the Pillar Two legislative interpretation and is based on our latest assessment of the total tax benefit that is more likely than not to be realized. The recognition of our future tax benefits associated with this transaction is dependent upon the acceptance of the business valuation and tax basis step-up by the associated taxing authorities.\nThe legislative developments in conjunction with changes we made to our corporate entity structure are estimated to increase our cash tax rate by 2.0% to 3.0% and our effective tax rate by approximately 5.0%. The estimated rates could be impacted by the outcome of examinations by taxing authorities and future legislative developments.\nResults of Operations\nWe disclose in this report certain non-GAAP financial measures. These non-GAAP financial measures assist management in comparing our performance on a consistent basis for purposes of business decision-making by removing the impact of certain items that management believes do not directly reflect our underlying operations. For additional information and reconciliations to the most closely comparable financial measures presented in our consolidated financial statements, which are calculated in accordance with U.S. GAAP, see \nNon-GAAP Financial Measures.\nConsolidated Results of Operations\nSummary of Results:\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions, except per share data)\n(in millions, except per share data)\nNet sales\n$\n25,846 \n$\n26,640 \n(3.0)\n%\n$\n26,640 \n$\n26,485 \n0.6 \n%\nOperating income/(loss)\n1,683 \n4,572 \n(63.2)\n%\n4,572 \n3,634 \n25.8 \n%\nNet income/(loss)\n2,746 \n2,846 \n(3.5)\n%\n2,846 \n2,368 \n20.2 \n%\nNet income/(loss) attributable to common shareholders\n2,744 \n2,855 \n(3.9)\n%\n2,855 \n2,363 \n20.8 \n%\nDiluted EPS\n2.26 \n2.31 \n(2.2)\n%\n2.31 \n1.91 \n20.9 \n%\nNet Sales:\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n25,846 \n$\n26,640 \n(3.0)\n%\n$\n26,640 \n$\n26,485 \n0.6 \n%\nOrganic Net Sales\n(a)\n25,949 \n26,496 \n(2.1)\n%\n26,774 \n25,889 \n3.4 \n%\n(a) \n    \nOrganic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures \nsection at the end of this item. \nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nNet sales decreased 3.0% to $25.8 billion in 2024 compared to $26.6 billion in 2023, including the unfavorable impacts of foreign currency (0.7 pp) and acquisitions and divestitures (0.2 pp). Organic Net Sales decreased 2.1% to $25.9 billion in 2024 compared to $26.5 billion in 2023, primarily due to the unfavorable volume/mix (3.5 pp), which more than offset higher pricing (1.4 pp). Pricing was higher in North America and Emerging Markets, and flat in International Developed Markets. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\n27\nFiscal\n \nYear 2023 Compared to Fiscal Year \n2022\n:\nNet sales increased 0.6% to $26.6 billion in 2023 compared to $26.5 billion in 2022, including the unfavorable impacts of lapping a 53rd week of shipments in the prior period (1.8 pp), foreign currency (0.9 pp), and acquisitions and divestitures (0.1 pp). Organic Net Sales increased 3.4% to $26.8 billion in 2023 compared to $25.9 billion in 2022, primarily driven by higher pricing (8.9 pp), which more than offset unfavorable volume/mix (5.5 pp). Pricing was higher in all segments. Volume/mix in North America and International Developed Markets was unfavorable, while volume/mix in Emerging Markets was favorable.\nNet Income/(Loss):\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions)\n(in millions)\nOperating income/(loss)\n$\n1,683 \n$\n4,572 \n(63.2)\n%\n$\n4,572 \n$\n3,634 \n25.8 \n%\nNet income/(loss)\n2,746 \n2,846 \n(3.5)\n%\n2,846 \n2,368 \n20.2 \n%\nNet income/(loss) attributable to common shareholders\n2,744 \n2,855 \n(3.9)\n%\n2,855 \n2,363 \n20.8 \n%\nAdjusted Operating Income\n(a)\n5,360 \n5,297 \n1.2 \n%\n5,297 \n4,989 \n6.2 \n%\n(a)     Adjusted Operating Income is a non-GAAP financial measure. See the\n Non-GAAP Financial Measures \nsection at the end of this item. \nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nOperating income/(loss) decreased 63.2% to $1.7 billion in 2024 compared to $4.6 billion in 2023, due to non-cash impairment losses that were $3.0 billion higher in the current year period. The remaining change to operating income/(loss) was an increase of $118 million primarily driven by higher pricing, lower variable compensation expense, and lower procurement and logistics costs, due, in part, to the beneficial impact from our efficiency initiatives. These favorable impacts to operating income/(loss) were partially offset by unfavorable volume/mix, increased manufacturing expenses due to increased labor costs, and increased selling, general and administrative expenses (“SG&A”) due, in part, to investments in technology.\nNet income/(loss) decreased 3.5% to $2.7 billion in 2024 compared to $2.8 billion in 2023. This decrease was due to unfavorable changes in operating income/(loss) factors discussed above, which more than offset a lower effective tax rate in the current period and the favorable changes in other expense/(income). \n•\nOur effective tax rate was a benefit of 220.5% in 2024 compared to an expense of 21.7% in 2023. The year-over-year change in the effective tax rate was primarily driven by the recognition of a $3.0 billion non-U.S. deferred tax asset as a result of the movement of certain business operations to a wholly-owned subsidiary in the Netherlands and the geographic mix of pre-tax income in various non-U.S. jurisdictions. This benefit to our effective tax rate was partially offset by establishing a partial valuation allowance of $0.6 billion against the Netherlands deferred tax asset, establishing a full valuation allowance against Brazil net deferred tax assets, and non-deductible goodwill impairments.\n•\nOther expense/(income) was $85 million of income in 2024 compared to $27 million of expense in 2023. This change was primarily driven by $197 million of favorable changes in net pension and postretirement non-service cost/(benefit), partially offset by an $81 million net loss on the sale of businesses in 2024.\nAdjusted Operating Income increased 1.2% to $5.4 billion in 2024 compared to $5.3 billion in 2023, primarily driven by higher pricing, lower variable compensation expense, and lower procurement and logistics costs, due, in part, to the beneficial impact from our efficiency initiatives. These favorable impacts to Adjusted Operating Income were partially offset by unfavorable volume/mix, increased manufacturing expenses due to increased labor costs, increased SG&A due, in part, to investments in technology, and the unfavorable impact of foreign currency (0.4 pp).\n28\nFiscal\n \nYear 2023 Compared to Fiscal Year \n2022\n:\nOperating income/(loss) increased 25.8% to $4.6 billion in 2023 compared to $3.6 billion in 2022, primarily driven by higher pricing, the beneficial impact from our efficiency initiatives, lower non-cash impairment losses in the current year period ($251 million), and the impact of the securities class action lawsuit in the prior year period. These favorable impacts to operating income/(loss) were partially offset by higher commodity costs, including the impact of realized and unrealized gains and losses on commodity hedges, higher supply chain costs, reflecting inflationary pressure in manufacturing and procurement costs, unfavorable volume/mix, increased SG&A primarily for advertising expenses, and the decrease from lapping a 53rd week of shipments in the prior period.\nNet income/(loss) increased 20.2% to $2.8 billion in 2023 compared to $2.4 billion in 2022. This increase was driven by the operating income/(loss) factors discussed above and lower interest expense, which more than offset unfavorable changes in other expense/(income) and higher tax expense.\n•\nInterest expense was $912 million in 2023 compared to $921 million in 2022.\n•\nOur effective tax rate was 21.7% in 2023 compared to 20.2% in 2022. The year-over-year increase in the effective tax rate was due primarily to the decrease in deferred tax liabilities due to the merger of certain foreign entities and the revaluation of deferred tax balances due to changes in state tax laws in the prior year versus the current year.\n•\nOther expense/(income) was $27 million of expense in 2023 compared to $253 million of income in 2022. This change was primarily driven by $202 million of unfavorable changes in net pension and postretirement non-service cost/(benefit) due, in part, to the settlement of one of our U.K. defined benefit pension plans, which resulted in pre-tax losses of $162 million in 2023. Further, additional changes in other expense/(income) were driven by $179 million of unfavorable changes in foreign exchange losses/(gains). These unfavorable impacts to other expense/(income) were partially offset by $109 million of favorable changes in derivative losses/(gains).\nAdjusted Operating Income increased 6.2% to $5.3 billion in 2023 compared to $5.0 billion in 2022, primarily due to higher pricing and the beneficial impact from our efficiency initiatives, which more than offset higher commodity costs, including the impact of realized gains and losses on commodity hedges; higher supply chain costs, reflecting inflationary pressure in manufacturing, procurement, and logistics; unfavorable volume/mix; increased SG&A, primarily advertising expenses; the decrease from lapping a 53rd week of shipments in the prior period (2.2 pp); and the unfavorable impact of foreign currency (1.2 pp).\nDiluted Earnings Per Share (“EPS”):\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions, except per share data)\n(in millions, except per share data)\nDiluted EPS\n$\n2.26 \n$\n2.31 \n(2.2)\n%\n$\n2.31 \n$\n1.91 \n20.9 \n%\nAdjusted EPS\n(a)\n3.06 \n2.98 \n2.7 \n%\n2.98 \n2.78 \n7.2 \n%\n(a) \n    \nAdjusted EPS is a non-GAAP financial measure. See the\n Non-GAAP Financial Measures \nsection at the end of this item. \n29\nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nDiluted EPS decreased 2.2% to $2.26 in 2024 compared to $2.31 in 2023, primarily driven by the net income/(loss) factors discussed above and the favorable impact of our common stock repurchases.\nDecember 28, 2024\nDecember 30, 2023\n$ Change\n% Change\nDiluted EPS\n$\n2.26 \n$\n2.31 \n$\n(0.05)\n(2.2)\n%\nRestructuring activities\n0.01 \n0.16 \n(0.15)\nUnrealized losses/(gains) on commodity hedges\n(0.01)\n— \n(0.01)\nImpairment losses\n2.58 \n0.50 \n2.08 \nLosses/(gains) on sale of business\n0.05 \n— \n0.05 \nNonmonetary currency devaluation\n0.01 \n0.02 \n(0.01)\nCertain significant discrete income tax items\n(1.84)\n(0.01)\n(1.83)\nAdjusted EPS\n(a)\n$\n3.06 \n$\n2.98 \n$\n0.08 \n2.7 \n%\nKey drivers of change in Adjusted EPS\n(a)\n:\nResults of operations\n$\n0.04 \nEffect of common stock repurchases\n(b)\n:\n0.04 \nOther expense/(income)\n0.01 \nEffective tax rate\n(0.01)\n$\n0.08 \n(a)     Adjusted EPS is a non-GAAP financial measure. See the\n Non-GAAP Financial Measures \nsection at the end of this item. \n(b)     Includes the impact of the change in the weighted average shares of common stock outstanding, including dilutive effect, which is primarily due to shares purchased pursuant to our publicly announced share repurchase program. See Note 19, \nEarnings Per Share\n, in Item 8\n, \nFinancial Statements and Supplementary Data,\n \nfor more information on our weighted average shares outstanding.\nAdjusted EPS increased 2.7% to $3.06 in 2024 compared to $2.98 in 2023 primarily driven by higher Adjusted Operating Income, the favorable impact of our common stock repurchases, and favorable changes in other expense/(income), which more than offset higher taxes on adjusted earnings.\n30\nFiscal\n \nYear 2023 Compared to Fiscal Year 2022:\nDiluted EPS increased 20.9% to $2.31 in 2023 compared to $1.91 in 2022, primarily driven by the net income/(loss) factors discussed above.\nDecember 30, 2023\nDecember 31, 2022\n$ Change\n% Change\nDiluted EPS\n$\n2.31 \n$\n1.91 \n$\n0.40 \n20.9 \n%\nRestructuring activities\n0.16 \n0.05 \n0.11 \nUnrealized losses/(gains) on commodity hedges\n— \n0.04 \n(0.04)\nImpairment losses\n0.50 \n0.70 \n(0.20)\nCertain non-ordinary course legal and regulatory matters\n— \n0.13 \n(0.13)\nLosses/(gains) on sale of business\n— \n(0.01)\n0.01 \nOther losses/(gains) related to acquisitions and divestitures\n— \n(0.02)\n0.02 \nNonmonetary currency devaluation\n0.02 \n0.01 \n0.01 \nDebt prepayment and extinguishment (benefit)/costs\n— \n(0.03)\n0.03 \nCertain significant discrete income tax items\n(0.01)\n— \n(0.01)\nAdjusted EPS\n(a)\n$\n2.98 \n$\n2.78 \n$\n0.20 \n7.2 \n%\nKey drivers of change in Adjusted EPS\n(a)\n:\nResults of operations\n$\n0.27 \n53rd week\n(0.06)\nInterest expense\n0.03 \nOther expense/(income)\n(0.03)\nEffective tax rate\n(0.01)\n$\n0.20 \n(a)     Adjusted EPS is a non-GAAP financial measure. See the\n Non-GAAP Financial Measures \nsection at the end of this item. \nAdjusted EPS increased 7.2% to $2.98 in 2023 compared to $2.78 in 2022, primarily driven by higher Adjusted Operating Income and lower interest expense, which more than offset the decrease from lapping a 53rd week of shipments in the prior period, unfavorable changes in other expense/(income), and higher taxes on adjusted earnings.\nResults of Operations by Segment\nWe manage our operating results through four operating segments. We have two reportable segments defined by geographic region: North America and International Developed Markets. Our remaining operating segments, consisting of WEEM and AEM, are combined and disclosed as Emerging Markets.\nManagement evaluates segment performance based on several factors, including net sales, Organic Net Sales, and Segment Adjusted Operating Income. In the first quarter of 2024, certain measures utilized by management to evaluate segment performance changed, including a change from Segment Adjusted EBITDA to Segment Adjusted Operating Income in order to drive a stronger connection to our long-term strategic plan. Segment Adjusted Operating Income is defined as operating income/(loss) excluding, when they occur, the impacts of restructuring activities, deal costs, unrealized gains/(losses) on commodity hedges (the unrealized gains and losses are recorded in general corporate expenses until realized; once realized, the gains and losses are recorded in the applicable segment’s operating results), impairment losses, and certain non-ordinary course legal and regulatory matters. Segment Adjusted Operating Income for Emerging Markets, which represents the aggregation of our WEEM and AEM operating segments, is defined and presented consistently with the Segment Adjusted Operating Income of our reportable segments — North America and International Developed Markets. Segment Adjusted Operating Income is a financial measure that can assist management and investors in comparing our performance on a consistent basis by removing the impact of certain items that management believes do not directly reflect our underlying operations. Management also uses Segment Adjusted Operating Income to allocate resources. We have reflected this change from Segment Adjusted EBITDA to Segment Adjusted Operating Income in all historical periods presented.\n31\nUnder highly inflationary accounting, the financial statements of a subsidiary are remeasured into our reporting currency (U.S. dollars) based on the legally available exchange rate at which we expect to settle the underlying transactions. Exchange gains and losses from the remeasurement of monetary assets and liabilities are reflected in other expense/(income) on our consolidated statement of income, as nonmonetary currency devaluation, rather than accumulated other comprehensive income/(losses) on our consolidated balance sheet, until such time as the economy is no longer considered highly inflationary. See Note 2, \nSignificant Accounting Policies,\n in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information. We apply highly inflationary accounting to the results of our subsidiaries in Venezuela, Argentina, Turkey, Egypt, and Nigeria, which are all in Emerging Markets.\nNet Sales:\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\n(in millions)\nNet sales:\nNorth America\n$\n19,543 \n$\n20,126 \n$\n20,340 \nInternational Developed Markets\n3,535 \n3,623 \n3,401 \nEmerging Markets\n2,768 \n2,891 \n2,744 \nTotal net sales\n$\n25,846 \n$\n26,640 \n$\n26,485 \nOrganic Net Sales:\n2024 Compared to 2023\n2023 Compared to 2022\nDecember 28, 2024\nDecember 30, 2023\nDecember 30, 2023\nDecember 31, 2022\n(in millions)\n(in millions)\nOrganic Net Sales\n(a)\n:\nNorth America\n$\n19,570 \n$\n20,126 \n$\n20,191 \n$\n19,983 \nInternational Developed Markets\n3,522 \n3,623 \n3,631 \n3,315 \nEmerging Markets\n2,857 \n2,747 \n2,952 \n2,591 \nTotal Organic Net Sales\n$\n25,949 \n$\n26,496 \n$\n26,774 \n$\n25,889 \n(a)     Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures \nsection at the end of this item. \nDrivers of the changes in net sales and Organic Net Sales were:\nNet Sales\nCurrency\nAcquisitions and Divestitures\n53rd Week\nOrganic Net Sales\nPrice\nVolume/Mix\n2024 Compared to 2023\nNorth America\n(2.9)\n%\n(0.1) pp\n0.0 pp\n0.0 pp\n(2.8)\n%\n1.4 pp\n(4.2) pp\nInternational Developed Markets\n(2.4)\n%\n0.4 pp\n0.0 pp\n0.0 pp\n(2.8)\n%\n0.0 pp\n(2.8) pp\nEmerging Markets\n(4.3)\n%\n(6.2) pp\n(2.1) pp\n0.0 pp\n4.0 \n%\n3.5 pp\n0.5 pp\nKraft Heinz\n(3.0)\n%\n(0.7) pp\n(0.2) pp\n0.0 pp\n(2.1)\n%\n1.4 pp\n(3.5) pp\n2023 Compared to 2022\nNorth America\n(1.0)\n%\n(0.3) pp\n0.0 pp\n(1.7) pp\n1.0 \n%\n7.5 pp\n(6.5) pp\nInternational Developed Markets\n6.5 \n%\n(0.5) pp\n(0.7) pp\n(1.8) pp\n9.5 \n%\n15.6 pp\n(6.1) pp\nEmerging Markets\n5.4 \n%\n(6.6) pp\n(0.2) pp\n(1.7) pp\n13.9 \n%\n10.9 pp\n3.0 pp\nKraft Heinz\n0.6 \n%\n(0.9) pp\n(0.1) pp\n(1.8) pp\n3.4 \n%\n8.9 pp\n(5.5) pp\n32\nAdjusted Operating Income:\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\n \n(in millions)\nSegment Adjusted Operating Income:\nNorth America\n$\n5,111 \n$\n5,050 \n$\n4,735 \nInternational Developed Markets\n537 \n522 \n522 \nEmerging Markets\n321 \n376 \n319 \nGeneral corporate expenses\n(609)\n(651)\n(587)\nRestructuring activities\n(27)\n(60)\n(74)\nDeal costs\n— \n— \n(9)\nUnrealized gains/(losses) on commodity hedges\n19 \n(1)\n(63)\nImpairment losses\n(3,669)\n(662)\n(999)\nCertain non-ordinary course legal and regulatory matters\n— \n(2)\n(210)\nOperating income/(loss)\n1,683 \n4,572 \n3,634 \nInterest expense\n912 \n912 \n921 \nOther expense/(income)\n(85)\n27 \n(253)\nIncome/(loss) before income taxes\n$\n856 \n$\n3,633 \n$\n2,966 \nNorth America:\n2024 Compared to 2023\n2023 Compared to 2022\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n19,543 \n$\n20,126 \n(2.9)\n%\n$\n20,126 \n$\n20,340 \n(1.0)\n%\nOrganic Net Sales\n(a)\n19,570 \n20,126 \n(2.8)\n%\n20,191 \n19,983 \n1.0 \n%\nSegment Adjusted Operating Income\n5,111 \n5,050 \n1.2 \n%\n5,050 \n4,735 \n6.7 \n%\n(a)     Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures \nsection at the end of this item. \nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nNet sales decreased 2.9% to $19.5 billion in 2024 compared to $20.1 billion in 2023, including the unfavorable impacts of foreign currency (0.1 pp). Organic Net Sales decreased 2.8% to $19.6 billion in 2024 compared to $20.1 billion in 2023, primarily due to unfavorable volume/mix (4.2 pp), which more than offset higher pricing (1.4 pp). Higher pricing was primarily driven by increases to mitigate higher input costs. Unfavorable volume/mix was primarily due to shifts in consumer behavior due to economic uncertainty, a decline in \nLunchables\n, and a temporary plant closure.\nSegment Adjusted Operating Income increased 1.2% to $5.1 billion in 2024 compared to $5.1 billion in 2023, primarily driven by higher pricing, lower procurement and logistics costs due, in part, to the beneficial impact from our efficiency initiatives, and lower variable compensation expense. These favorable impacts to Segment Adjusted Operating Income were partially offset by unfavorable volume/mix, increased manufacturing expenses due to increased labor cost, increased SG&A due, in part, to investments in technology, increased depreciation expense, and the unfavorable impact of foreign currency (0.1 pp).\nFiscal\n \nYear 2023 Compared to Fiscal Year \n2022\n:\nNet sales decreased 1.0% to $20.1 billion in 2023 compared to $20.3 billion in 2022, including the decrease from lapping a 53rd week of shipments in the prior period (1.7 pp) and the unfavorable impacts of foreign currency (0.3 pp). Organic Net Sales increased 1.0% to $20.2 billion in 2023 compared to $20.0 billion in 2022, driven by higher pricing (7.5 pp), which more than offset unfavorable volume/mix (6.5 pp). Higher pricing was primarily driven by increases to mitigate higher input costs, particularly in the first half of 2023. Unfavorable volume/mix was primarily due to elasticity impacts from pricing actions and due, in part, to the reduction of Supplemental Nutrition Assistance Program (“SNAP”) benefits.\nSegment Adjusted Operating Income increased 6.7% to $5.1 billion in 2023 compared to $4.7 billion in 2022, primarily due to higher pricing and the beneficial impact from our efficiency initiatives, which more than offset higher commodity costs, including the impact of realized gains and losses on commodity hedges; unfavorable volume/mix; increased manufacturing expenses; increased SG&A, primarily due to advertising expense; the decrease from lapping a 53rd week of shipments in the prior period (2.3 pp); and the unfavorable impact of foreign currency (0.3 pp).\n33\nInternational Developed Markets:\n2024 Compared to 2023\n2023 Compared to 2022\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n3,535 \n$\n3,623 \n(2.4)\n%\n$\n3,623 \n$\n3,401 \n6.5 \n%\nOrganic Net Sales\n(a)\n3,522 \n3,623 \n(2.8)\n%\n3,631 \n3,315 \n9.5 \n%\nSegment Adjusted Operating Income\n537 \n522 \n3.0 \n%\n522 \n522 \n— \n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures \nsection at the end of this item. \nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nNet sales decreased 2.4% to $3.5 billion in 2024 compared to $3.6 billion in 2023, including the favorable impacts of foreign currency (0.4 pp). Organic Net Sales decreased 2.8% to $3.5 billion in 2024 compared to $3.6 billion in 2023, primarily due to unfavorable volume/mix (2.8 pp) while pricing remained flat. Unfavorable volume/mix was primarily due to a temporary pause in shipments as a result of a contract negotiation with certain customers in our Continental Europe region, and lower sales in New Zealand due to an inventory reduction by a regional customer.\nSegment Adjusted Operating Income increased 3.0% to $0.5 billion in 2024 compared to $0.5 billion in 2023, primarily driven by lower procurement and logistics costs due, in part, to the beneficial impact from our efficiency initiatives, lapping the prior year business disruption caused by Cyclone Gabrielle in Australia and New Zealand, lower variable compensation expense, and the favorable impact of foreign currency (1.8 pp). These favorable impacts to Segment Adjusted Operating Income were partially offset unfavorable volume/mix and increased inflationary pressures in manufacturing expenses.\nFiscal\n \nYear 2023 Compared to Fiscal Year \n2022\n:\nNet sales increased 6.5% to $3.6 billion in 2023 compared to $3.4 billion in 2022, including the unfavorable impacts of lapping a 53rd week of shipments in the prior period (1.8 pp), acquisitions and divestitures (0.7 pp), and foreign currency (0.5 pp). Organic Net Sales increased 9.5% to $3.6 billion in 2023 compared to $3.3 billion in 2022 driven by higher pricing (15.6 pp), which more than offset unfavorable volume/mix (6.1 pp). Higher pricing included increases across markets primarily to mitigate higher input costs. Unfavorable volume/mix was primarily due to the elasticity impacts from pricing actions, particularly in our Northern Europe region.\nSegment Adjusted Operating Income was flat year over year, at $522 million in both 2023 and 2022. Increases to Segment Adjusted Operating Income were primarily driven by higher pricing offset by higher supply chain costs, reflecting inflationary pressure in procurement, manufacturing, and logistics costs; unfavorable volume/mix; increased SG&A, primarily due to advertising expense; the unfavorable impact from a business disruption in Australia and New Zealand caused by Cyclone Gabrielle; the decrease from lapping a 53rd week of shipments in the prior period (1.5 pp); and the unfavorable impact of foreign currency (0.1 pp).\nEmerging Markets:\n2024 Compared to 2023\n2023 Compared to 2022\nDecember 28, 2024\nDecember 30, 2023\n% Change\nDecember 30, 2023\nDecember 31, 2022\n% Change\n(in millions)\n(in millions)\nNet sales\n$\n2,768 \n$\n2,891 \n(4.3)\n%\n$\n2,891 \n$\n2,744 \n5.4 \n%\nOrganic Net Sales\n(a)\n2,857 \n2,747 \n4.0 \n%\n2,952 \n2,591 \n13.9 \n%\nSegment Adjusted Operating Income\n321 \n376 \n(14.7)\n%\n376 \n319 \n17.6 \n%\n(a)    Organic Net Sales is a non-GAAP financial measure. See the \nNon-GAAP Financial Measures \nsection at the end of this item. \nFiscal\n \nYear 2024 Compared to Fiscal Year 2023:\nNet sales decreased 4.3% to $2.8 billion in 2024 compared to $2.9 billion in 2023, including the unfavorable impacts of foreign currency (6.2 pp) and acquisitions and divestitures (2.1 pp). Organic Net Sales increased 4.0% to $2.9 billion in 2024 compared to $2.7 billion in 2023, primarily driven by higher pricing (3.5 pp) and favorable volume/mix (0.5 pp). Higher pricing was taken primarily in our Eastern Europe and Middle East and Africa (“MEA”) regions to address higher input costs, which more than offset lower pricing in Brazil as a result of maintaining price gaps to competition. Favorable volume/mix within our Eastern Europe and MEA more than offset unfavorable volume/mix in Brazil and China.\n34\nSegment Adjusted Operating Income decreased 14.7% to $0.3 billion in 2024 compared to $0.4 billion in 2023, primarily due to higher supply chain costs reflecting inflationary pressures in our Eastern Europe and LATAM regions, the unfavorable impact of foreign currency (6.1 pp), and increased SG&A as a result of our investments in our go-to-market strategy, primarily in LATAM. These unfavorable impacts to Segment Adjusted Operating Income more than offset higher pricing, favorable volume/mix, and lower variable compensation expense.\nFiscal\n \nYear 2023 Compared to Fiscal Year \n2022\n:\nNet sales increased 5.4% to $2.9 billion in 2023 compared to $2.7 billion in 2022, including the unfavorable impacts of foreign currency (6.6 pp), lapping a 53rd week of shipments in the prior period (1.7 pp), and acquisitions and divestitures (0.2 pp). Organic Net Sales increased 13.9% to $3.0 billion in 2023 compared to $2.6 billion in 2022, driven by higher pricing (10.9 pp) and favorable volume/mix (3.0 pp). Higher pricing included increases across markets primarily to mitigate higher input costs. Volume/mix was favorable in our Eastern European countries and LATAM region, partially offset by unfavorable volume/mix in our Asia region.\nSegment Adjusted Operating Income increased 17.6% to $376 million in 2023 compared to $319 million in 2022, primarily driven by higher pricing and favorable volume/mix, partially offset by higher supply chain costs, reflecting inflationary pressure in LATAM and Eastern Europe regions; increased SG&A due, in part, to investments in advertising and research and development; the unfavorable impact of foreign currency (14.1 pp); increased depreciation expense; and the decrease from lapping a 53rd week of shipments in the prior period (2.7 pp).\nLiquidity and Capital Resources\nWe believe that cash generated from our operating activities, commercial paper programs, and Senior Credit Facility will provide sufficient liquidity to meet our working capital needs, repayments of long-term debt, future contractual obligations, payment of our anticipated quarterly dividends, planned capital expenditures, restructuring expenditures, and contributions to our postemployment benefit plans for the next 12 months. An additional potential source of liquidity is access to capital markets. We intend to use our cash on hand and commercial paper programs for daily funding requirements.\nAcquisitions and Divestitures:\nIn the first quarter of 2024, we consummated the Russia Infant Transaction for total cash consideration of approximately $25 million, and the Papua New Guinea Transaction for total cash consideration of approximately $22 million, which is to be paid incrementally over two years following the transaction closing date.\nIn the fourth quarter of 2022, we sold our business-to-business powdered cheese business to a third party, Kerry Group, for cash consideration of approximately $108 million (the “Powdered Cheese Transaction”). \nIn the second quarter of 2022, we acquired a majority of the outstanding equity interests of Companhia Hemmer Indústria e Comércio (“Hemmer”), a Brazilian food and beverage manufacturing company focused on the condiments and sauces category, from certain third-party shareholders (the “Hemmer Acquisition”) for cash consideration of approximately $279 million. \nIn the first quarter of 2022, we acquired 85% of the shares of Just Spices GmbH (“Just Spices”), a German-based company focused on direct-to-consumer sales of premium spice blends, from certain third-party shareholders (the “Just Spices Acquisition”) for cash consideration of approximately $243 million. In the third quarter of 2023, we completed the redemption of an additional 5% of the outstanding shares and in the second quarter of 2024, we completed the redemption of the remaining outstanding shares and wholly own Just Spices as of December 28, 2024.\nSee Note 4, \nAcquisitions and Divestitures\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our acquisitions and divestitures.\nCash Flow Activity for 2024 Compared to 2023:\nNet Cash Provided by/Used for Operating Activities:\nNet cash provided by operating activities was $4.2 billion for the year ended December 28, 2024 compared to $4.0 billion for the year ended December 30, 2023. This increase was primarily due to lapping the prior year cash payments associated with the settlement of the consolidated securities class action lawsuit and the current year conversion of certain plan assets related to the U.S. postretirement medical plan to cash, which were partially offset by higher cash outflows for variable compensation in the 2024 period compared to the 2023 period and increased cash taxes. See Note 15, \nCommitments and Contingencies\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our legal proceedings and See Note 11, \nPostemployment Benefits\n, in Item 8 for more additional information on our postemployment benefit plans activities.\n35\nNet Cash Provided by/Used for Investing Activities:\nNet cash used for investing activities was $1.0 billion for the year ended December 28, 2024 compared to net cash used for investing activities of $916 million for the year ended December 30, 2023. This change was primarily driven by our payments to acquire the TGI Friday License and increased capital expenditures. This was offset by proceeds from net investment hedge settlements. Our 2024 capital expenditures were primarily driven by maintenance projects, capital investments focused on generating growth, including capacity expansion, digital projects, and cost improvement projects, as well as capital investments in technology. We expect 2025 capital expenditures to be approximately $1.0 billion.\nNet Cash Provided by/Used for Financing Activities:\nNet cash used for financing activities was $3.0 billion for the year ended December 28, 2024 compared to $2.7 billion for the year ended December 30, 2023. This change was primarily due to increased common stock repurchases pursuant to our publicly announced share repurchase program, partially offset by reduced debt repayments in the current year period compared to the prior year.\nCash Flow Activity for 2023 Compared to 2022:\nNet Cash Provided by/Used for Operating Activities:\nNet cash provided by operating activities was $4.0 billion for the year ended December 30, 2023 compared to $2.5 billion for the year ended December 31, 2022. This increase was primarily driven by lower cash outflows in the current year for inventories, primarily related to stock rebuilding in the prior year, lower cash outflows in the current year for cash tax payments driven by cash taxes paid in 2022 related to the Cheese Transaction, higher Adjusted Operating Income in 2023, and lower interest payments in the current period due to the reduction of long-term debt throughout 2022. These impacts were partially offset by cash payments associated with the settlement of the consolidated securities class action lawsuit. See Note 15, \nCommitments and Contingencies\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our legal proceedings.\nNet Cash Provided by/Used for Investing Activities:\nNet cash used for investing activities was $916 million for the year ended December 30, 2023 compared to net cash used for investing activities of $1.1 billion for the year ended December 31, 2022. This change was primarily driven by payments for the Just Spices Acquisition and Hemmer Acquisition in 2022, partially offset by higher proceeds from the settlement of net investment hedges in the prior year period, proceeds from the Powdered Cheese Transaction in 2022, and higher capital expenditures in the current year period. We had 2023 capital expenditures of $1.0 billion compared to 2022 capital expenditures of $916 million. \nNet Cash Provided by/Used for Financing Activities:\nNet cash used for financing activities was $2.7 billion for the year ended December 30, 2023 compared to $3.7 billion for the year ended December 31, 2022. This change was primarily due to proceeds from the issuance of 600 million euro aggregate principal amount floating rate senior notes in 2023 and lower repayments of long-term debt in the current year period, partially offset by increased common stock repurchases primarily driven by our share repurchase program. \nSee Note 16, \nDebt\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our debt transactions and Note 18, \nCapital Stock\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our share repurchase program.\nCash Held by International Subsidiaries:\nOf the $1.3 billion cash and cash equivalents on our consolidated balance sheet at December 28, 2024, $781 million was held by international subsidiaries.\nSubsequent to January 1, 2018, we consider the unremitted earnings of certain international subsidiaries that impose local country taxes on dividends to be indefinitely reinvested. For those undistributed earnings considered to be indefinitely reinvested, our intent is to reinvest these funds in our international operations, and our current plans do not demonstrate a need to repatriate the accumulated earnings to fund our U.S. cash requirements. The amount of unrecognized deferred tax liabilities for local country withholding taxes that would be owed, if repatriated, related to our 2018 through 2024 accumulated earnings of certain international subsidiaries is approximately $80 million. Our undistributed historical earnings in foreign subsidiaries through December 31, 2017 are currently not considered to be indefinitely reinvested. Our deferred tax liability associated with these undistributed historical earnings was insignificant at December 28, 2024, December 30, 2023, and December 31, 2022, and relates to local withholding taxes that will be owed when this cash is distributed.\nTrade Payables Programs: \nIn order to manage our cash flow and related liquidity, we work with our suppliers to optimize our terms and conditions, which\n36\ninclude the extension of payment terms. We maintain agreements with third-party administrators that allow participating suppliers to track payment obligations from us, and, at the sole discretion of the supplier, sell one or more of those payment obligations to participating financial institutions. Our obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted. Our current payment terms with our suppliers, which we deem to be commercially reasonable, generally range from 0 to 250 days. All amounts due to participating suppliers are paid to the third party on the original invoice due dates, regardless of whether a particular invoice was sold. The amounts outstanding under these programs were $745 million at December 28, 2024 and $819 million at December 30, 2023. The amounts were included in trade payables on our consolidated balance sheets. See Note 14, \nFinancing Arrangements\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our trade payables programs.\nBorrowing Arrangements:\nFrom time to time, we obtain funding through our commercial paper programs. We had no commercial paper outstanding at December 28, 2024, December 30, 2023, and December 31, 2022. We had no commercial paper outstanding during the year ended December 28, 2024, and the maximum amount of commercial paper outstanding was $150 million during the year ended December 30, 2023 and $198 million during the year ended December 31, 2022.\nIn July 2022, together with KHFC, our 100% owned operating subsidiary, we entered into a new credit agreement (the “Credit Agreement”), which provides for a five-year senior unsecured revolving credit facility in an aggregate amount of $4.0 billion (the “Senior Credit Facility”) and replaced our then-existing credit facility (the “Previous Senior Credit Facility”). On September 27, 2024, we entered into an agreement to extend the maturity date of our Senior Credit Facility from July 8, 2028 to July 8, 2029. Subject to certain conditions, we may increase the amount of revolving commitments and/or add tranches of term loans in a combined aggregate amount of up to $1.0 billion.\nNo amounts were drawn on our Senior Credit Facility at December 28, 2024, December 30, 2023, or December 31, 2022. No amounts were drawn on our Senior Credit Facility during the years ended December 28, 2024, December 30, 2023 or December 31, 2022, or on the Previous Senior Credit Facility during the year ended December 31, 2022.\nOur credit agreement contains customary representations, warranties, and covenants that are typical for these types of facilities and could, upon the occurrence of certain events of default, restrict our ability to access our Senior Credit Facility. We were in compliance with all financial covenants as of December 28, 2024.\nLong-Term Debt:\nOur long-term debt, including the current portion, was $19.9 billion at December 28, 2024, $20.0 billion at December 30, 2023, and $20.1 billion at December 31, 2022. The decrease of debt in 2024 was primarily due to changes in foreign currency exchange rates on our foreign-denominated debt, as well as the 550 million euro aggregate principle amount of senior notes that were repaid at maturity in May 2024, partially offset by the issuance of the 2024 Notes. The decrease of debt in 2023 was primarily due to the repayment of 750 million euro aggregate principal amount of senior notes due in June 2023, which more than offset the issuance of 600 million euro aggregate principal amount of floating rate senior notes issued in May 2023.\nWe may from time to time seek to retire or purchase our outstanding debt through redemptions, tender offers, cash purchases, prepayments, refinancing, exchange offers, open market or privately negotiated transactions, Rule 10b5-1 plans, or otherwise.\nOur long-term debt contains customary representations, covenants, and events of default. We were in compliance with all financial covenants as of December 28, 2024.\nSee Note 16, \nDebt\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our long-term debt activity.\nEquity and Dividends:\nWe paid dividends on our common stock of $1.9 billion in 2024, and $2.0 billion in 2023 and 2022. Additionally, in the first quarter of 2025, our Board declared a cash dividend of $0.40 per share of common stock, which is payable on March 28, 2025 to stockholders of record on March 7, 2025.\nThe declaration of dividends is subject to the discretion of our Board and depends on various factors, including our net income, financial condition, cash requirements, future prospects, and other factors that our Board deems relevant to its analysis and decision making.\n37\nOn November 27, 2023, we announced that the Board approved a share repurchase program authorizing the Company to purchase up to $3.0 billion, exclusive of fees, of the Company’s common stock through December 26, 2026. We are not obligated to repurchase any specific number of shares and the program may be modified, suspended, or discontinued at any time. Under the program, shares may be repurchased in open market transactions, including under plans complying with Rule 10b5-1 under the Exchange Act, privately negotiated transactions, transactions structured through investment banking institutions, or other means. As of December 28, 2024, we had remaining authorization under the share repurchase program of approximately $1.9 billion. The share repurchase program is in addition to our share repurchases to offset the dilutive effect of equity-based compensation.\nAggregate Contractual Obligations:\nRelated to our current and long-term material cash requirements, the following table summarizes our aggregate contractual obligations at December 28, 2024, which we expect to primarily fund with cash from operating activities (in millions):\nMaterial Cash Requirements\n2025\n2026-2027\n20208-2029\n2030 and Thereafter\nTotal\nLong-term debt\n(a)\n$\n1,503 \n$\n5,366 \n$\n3,872 \n$\n21,188 \n$\n31,929 \nFinance leases\n(b)\n37 \n65 \n54 \n58 \n214 \nOperating leases\n(c)\n143 \n270 \n201 \n222 \n836 \nPurchase obligations\n(d)\n698 \n925 \n460 \n277 \n2,360 \nOther long-term liabilities\n(e)\n19 \n35 \n33 \n181 \n268 \nTotal\n$\n2,400 \n$\n6,661 \n$\n4,620 \n$\n21,926 \n$\n35,607 \n(a)    Amounts represent the expected cash payments of our long-term debt, including interest on variable and fixed rate long-term debt. Interest on variable rate long-term debt is calculated based on interest rates at December 28, 2024.\n(b)    Amounts represent the expected cash payments of our finance leases, including expected cash payments of interest expense.\n(c)    Operating leases represent the minimum rental commitments under non-cancellable operating leases net of sublease income.\n(d)    We have purchase obligations for materials, supplies, property, plant and equipment, and co-packing, storage, and distribution services based on projected needs to be utilized in the normal course of business. Other purchase obligations include commitments for marketing, advertising, capital expenditures, information technology, and professional services. Arrangements are considered purchase obligations if a contract specifies all significant terms, including fixed or minimum quantities to be purchased, a pricing structure, and approximate timing of the transaction. Several of these obligations are long-term and are based on minimum purchase requirements. Certain purchase obligations contain variable pricing components, and, as a result, actual cash payments are expected to fluctuate based on changes in these variable components. Due to the proprietary nature of some of our materials and processes, certain supply contracts contain penalty provisions for early terminations. We do not believe that a material amount of penalties is reasonably likely to be incurred under these contracts based upon historical experience and current expectations. \n(e)    Other long-term liabilities primarily consist of estimated payments for the one-time toll charge related to 2017 U.S. tax reform, as well as postretirement benefit commitments. Certain other long-term liabilities related to income taxes, insurance accruals, and other accruals included on the consolidated balance sheet are excluded from the above table as we are unable to estimate the timing of payments for these items.\nPension plan contributions were $7 million in 2024. We estimate that 2025 pension plan contributions will be approximately $6 million. Postretirement benefit plan contributions were $11 million in 2024. We estimate that 2025 postretirement benefit plan contributions will be approximately $11 million. During the fourth quarter of 2024, we amended our U.S. postretirement medical plan to establish a sub-trust to permit the payment of certain postretirement benefit plan contributions for active union employees using $150 million of the retiree plan surplus. See Note 11,\n Postemployment Benefits,\n in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information on our pension and postretirement plans.\nEstimated future contributions take into consideration current economic conditions, which at this time are expected to have minimal impact on expected contributions for 2025. Beyond 2025, we are unable to reliably estimate the timing of contributions to our pension or postretirement plans. Our actual contributions and plans may change due to many factors, including changes in tax, employee benefit, or other laws and regulations, tax deductibility, significant differences between expected and actual pension or postretirement asset performance or interest rates, or other factors. As such, estimated pension and postretirement plan contributions for 2025 have been excluded from the above table.\nAt December 28, 2024, the amount of net unrecognized tax benefits for uncertain tax positions, including an accrual of related interest and penalties along with positions only impacting the timing of tax benefits, was approximately $481 million. The timing of payments will depend on the progress of examinations with tax authorities. We are unable to make a reasonably reliable estimate as to if or when any significant cash settlements with taxing authorities may occur; therefore, we have excluded the amount of net unrecognized tax benefits from the above table.\nSupplemental Guarantor Information:\nThe Kraft Heinz Company (as the “Parent Guarantor”) fully and unconditionally guarantees all the senior unsecured registered notes (collectively, the “KHFC Senior Notes”) issued by KHFC, our 100% owned operating subsidiary (the “Guarantee”). See Note 16, \nDebt\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional descriptions of these guarantees.\n38\nThe payment of the principal, premium, and interest on the KHFC Senior Notes is fully and unconditionally guaranteed on a senior unsecured basis by the Parent Guarantor, pursuant to the terms and conditions of the applicable indenture. None of the Parent Guarantor’s subsidiaries guarantee the KHFC Senior Notes.\nThe Guarantee is the Parent Guarantor’s senior unsecured obligation and is: (i) \npari passu\n in right of payment with all of the Parent Guarantor’s existing and future senior indebtedness; (ii) senior in right of payment to all of the Parent Guarantor’s future subordinated indebtedness; (iii) effectively subordinated to all of the Parent Guarantor’s existing and future secured indebtedness to the extent of the value of the assets secured by that indebtedness; and (iv) effectively subordinated to all existing and future indebtedness and other liabilities of the Parent Guarantor’s subsidiaries.\nThe KHFC Senior Notes are obligations exclusively of KHFC and the Parent Guarantor and not of any of the Parent Guarantor’s other subsidiaries. Substantially all of the Parent Guarantor’s operations are conducted through its subsidiaries. The Parent Guarantor’s other subsidiaries are separate legal entities that have no obligation to pay any amounts due under the KHFC Senior Notes or to make any funds available therefor, whether by dividends, loans, or other payments. Except to the extent the Parent Guarantor is a creditor with recognized claims against its subsidiaries, all claims of creditors (including trade creditors) and holders of preferred stock, if any, of its subsidiaries will have priority with respect to the assets of such subsidiaries over its claims (and therefore the claims of its creditors, including holders of the KHFC Senior Notes). Consequently, the KHFC Senior Notes are structurally subordinated to all liabilities of the Parent Guarantor’s subsidiaries and any subsidiaries that it may in the future acquire or establish. The obligations of the Parent Guarantor will terminate and be of no further force or effect in the following circumstances: (i) (a) KHFC’s exercise of its legal defeasance option or, except in the case of a guarantee of any direct or indirect parent of KHFC, covenant defeasance option in accordance with the applicable indenture, or KHFC’s obligations under the applicable indenture have been discharged in accordance with the terms of the applicable indenture or (b) as specified in a supplemental indenture to the applicable indenture; and (ii) the Parent Guarantor has delivered to the trustee an officer’s certificate and an opinion of counsel, each stating that all conditions precedent provided for in the applicable indenture have been complied with. The Guarantee is limited by its terms to an amount not to exceed the maximum amount that can be guaranteed by the Parent Guarantor without rendering the Guarantee voidable under applicable law relating to fraudulent conveyance or fraudulent transfer or similar laws affecting the rights of creditors generally.\nThe following tables present summarized financial information for the Parent Guarantor and KHFC (as subsidiary issuer of the KHFC Senior Notes) (together, the “Obligor Group”), on a combined basis after the elimination of all intercompany balances and transactions between the Parent Guarantor and subsidiary issuer and investments in any subsidiary that is a non-guarantor.\nSummarized Statement of Income\nFor the Year Ended\nDecember 28, 2024\nNet sales\n$\n16,828 \nGross profit\n(a)\n6,489 \nIntercompany service fees and other recharges\n4,635 \nOperating income/(loss)\n1,053 \nEquity in earnings/(losses) of subsidiaries\n2,552 \nNet income/(loss)\n2,744 \nNet income/(loss) attributable to common shareholders\n2,744 \n(a)    In 2024, the Obligor Group recorded $455 million of net sales to the non-guarantor subsidiaries and $63 million of purchases from the non-guarantor subsidiaries.\n39\nSummarized Balance Sheets\nDecember 28, 2024\nASSETS\nCurrent assets\n$\n4,506 \nCurrent assets due from affiliates\n(a)\n445 \nNon-current assets\n5,848 \nGoodwill\n8,823 \nIntangible assets, net\n1,881 \nNon-current assets due from affiliates\n(b)\n28 \nLIABILITIES\nCurrent liabilities\n$\n5,563 \nCurrent liabilities due to affiliates\n(a)\n1,924 \nNon-current liabilities\n22,846 \nNon-current liabilities due to affiliates\n(b)\n194 \n(a)    Represents receivables and short-term lending due from and payables and short-term lending due to non-guarantor subsidiaries.\n(b)    Represents long-term lending due from and long-term borrowings due to non-guarantor subsidiaries.\nCommodity Trends\nWe purchase and use large quantities of commodities, including dairy products, meat products, tomato products, sugar and other sweeteners, soybean and vegetable oils, coffee beans, wheat and processed grains, eggs, and other fruits and vegetables to manufacture our products. In addition, we purchase and use significant quantities of plastics, cardboard, resin, glass, and metal to package our products, and we use electricity, diesel fuel, and natural gas in the manufacturing and distribution of our products. We continuously monitor worldwide supply and cost trends of these commodities.\nDuring the year ended December 28, 2024, we experienced increases in certain commodity costs, particularly for tomato products, and soybean and vegetable oils, while costs for dairy products and coffee decreased. We manage commodity cost volatility primarily through pricing and risk management strategies including utilizing a range of commodity hedging techniques in an effort to limit the impact of price fluctuations on many of our principal raw materials. However, we do not fully hedge against changes in commodity prices, and our hedging strategies may not protect us from increases in specific raw material costs. As a result of these risk management strategies, our commodity costs may not immediately correlate with market price trends.\nCritical Accounting Estimates\nNote 2, \nSignificant Accounting Policies\n, in Item 8, \nFinancial Statements and Supplementary Data\n, includes a summary of the significant accounting policies we used to prepare our consolidated financial statements. The following is a review of the more significant assumptions and estimates as well as accounting policies we used to prepare our consolidated financial statements.\nRevenue Recognition:\nOur revenues are primarily derived from customer orders for the purchase of our products. We recognize revenues as performance obligations are fulfilled when control passes to our customers. We record revenues net of variable consideration, including consumer incentives and performance obligations related to trade promotions, excluding taxes, and including all shipping and handling charges billed to customers (accounting for shipping and handling charges that occur after the transfer of control as fulfillment costs). We also record a refund liability for estimated product returns and customer allowances as reductions to revenues within the same period that the revenue is recognized. We base these estimates principally on historical and current period experience factors. We recognize costs paid to third-party brokers to obtain contracts as expenses as our contracts are generally less than one year.\nAdvertising, Consumer Incentives, and Trade Promotions:\nWe promote our products with advertising, consumer incentives, and performance obligations related to trade promotions. Consumer incentives and trade promotions include, but are not limited to, discounts, coupons, rebates, performance-based in-store display activities, and volume-based incentives. Variable consideration related to consumer incentive and trade promotion activities is recorded as a reduction to revenues based on amounts estimated as being due to customers and consumers at the end of a period. We base these estimates principally on historical utilization, redemption rates, and/or current period experience factors. We review and adjust these estimates at least quarterly based on actual experience and other information. \n40\nAdvertising expenses are recorded in SG&A. For interim reporting purposes, we charge advertising to operations as a percentage of estimated full year sales activity and marketing costs. We then review and adjust these estimates each quarter based on actual experience and other information. Our definition of advertising expenses includes advertising production costs, in-store advertising costs, agency fees, brand promotions and events, and sponsorships, in addition to costs to obtain advertising in television, radio, print, digital, and social channels. We recorded advertising expenses of $1,031 million in 2024, $1,071 million in 2023, and $945 million in 2022. We also incur market research costs, which are recorded in SG&A but are excluded from advertising expenses.\nGoodwill and Intangible Assets:\nAs of December 28, 2024, we maintain 12 reporting units, eight of which comprise our goodwill balance. These eight reporting units had an aggregate goodwill carrying amount of $28.7 billion at December 28, 2024. Our indefinite-lived intangible asset balance primarily consists of a number of individual brands, which had an aggregate carrying amount of $36.5 billion as of December 28, 2024.\nWe test our reporting units and brands for impairment annually as of the first day of our third quarter, or more frequently if events or circumstances indicate it is more likely than not that the fair value of a reporting unit or brand is less than its carrying amount. Such events and circumstances could include a sustained decrease in our market capitalization, increased competition or unexpected loss of market share, increased input costs beyond projections, disposals of significant brands or components of our business, unexpected business disruptions (for example due to a natural disaster, pandemic, or loss of a customer, supplier, or other significant business relationship), unexpected significant declines in operating results, significant adverse changes in the markets in which we operate, changes in income tax rates, changes in interest rates, or changes in management strategy. We test reporting units for impairment by comparing the estimated fair value of each reporting unit with its carrying amount. We test brands for impairment by comparing the estimated fair value of each brand with its carrying amount. If the carrying amount of a reporting unit or brand exceeds its estimated fair value, we record an impairment loss based on the difference between fair value and carrying amount, in the case of reporting units, not to exceed the associated carrying amount of goodwill.\nFair value determinations require considerable judgment and are sensitive to changes in underlying assumptions, estimates, and market factors. Estimating the fair value of individual reporting units and brands requires us to make assumptions and estimates regarding our future plans, as well as industry, economic, and regulatory conditions. These assumptions and estimates include estimated future annual net cash flows (including net sales, cost of products sold, SG&A, depreciation and amortization, working capital, and capital expenditures), income tax considerations, discount rates, long-term growth rates, royalty rates, contributory asset charges, and other market factors. If current expectations of future growth rates and margins are not met, if market factors outside of our control, such as discount rates, market capitalization, income tax rates, foreign currency exchange rates, or inflation, change, or if management’s expectations or plans otherwise change, including updates to our long-term operating plans, then one or more of our reporting units or brands might become impaired in the future. Additionally, any decisions to divest certain non-strategic assets has led, and could in the future lead, to goodwill or intangible asset impairments.\nAs detailed in Note 8, \nGoodwill and Intangible Assets\n, in Item 8,\n Financial Statements and Supplementary Data\n, we recorded impairment losses related to goodwill and indefinite-lived intangible assets. Our reporting units and brands that were impaired in 2024, 2023, and 2022 were written down to their respective fair values resulting in zero excess fair value over carrying amount as of the applicable impairment test dates. Accordingly, these and other reporting units and brands that had 20% or less excess fair value over carrying amount as of the 2024 annual impairment test have a heightened risk of future impairments if any assumptions, estimates, or market factors change in the future.\nReporting units with 10% or less fair value over carrying amount, including reporting units that were impaired as part of the 2024 annual impairment test, resulting in zero excess fair value over carrying value, had an aggregate goodwill carrying amount after impairment of $22.4 billion as of the 2024 annual impairment test and included Taste Elevation, Ready Meals and Snacking (“TMS”), Away from Home & Kraft Heinz Ingredients (“AFH”), Meat & Cheese (“MC”), Canada and North America Coffee (“CNAC”), and Continental Europe. Our Northern Europe reporting unit had 10-20% fair value over carrying amount with an aggregate goodwill carrying amount of $1.7 billion as of the 2024 annual impairment test. Our Hydration & Desserts (“HD”) and Asia reporting units had between 20-50% fair value over carrying amount with an aggregate goodwill carrying amount of $4.6 billion as of the 2024 annual impairment test. Our reporting units that have less than 5% excess fair value over carrying amount as of the 2024 annual impairment test are considered at a heightened risk of future impairments and include our TMS, Continental Europe, and AFH reporting units, which had an aggregate goodwill carrying amount of $19.0 billion. Our four remaining reporting units had no goodwill carrying amount at the time of the 2024 annual impairment test.\n41\nOur indefinite-lived brands with 10% or less fair value over carrying amount, comprised entirely of brands that were impaired within 2024, resulting in zero excess fair value over carrying amount, had an aggregate carrying amount of $2.6 billion as of the latest test for each brand and included \nOscar Mayer, Lunchables, Claussen\n, and \nWattie’s. \nBrands with 10-20% fair value over carrying amount had an aggregate carrying amount of $14.2 billion as of the latest test for each brand and included\n Kraft,\n \nVelveeta, A1, and Bagel Bites\n.\n \nThe aggregate carrying amount of brands with fair value over carrying amount between 20-50% was $2.8 billion as of the latest test for each brand. Although the remaining brands, with a carrying amount of $16.9 billion, have more than 50% excess fair value over carrying amount as of the latest test for each brand, these amounts are also susceptible to impairments if any assumptions, estimates, or market factors significantly change in the future. Our brands that have less than 5% excess fair value over carrying amount as of the latest test for each brand are considered at a heightened risk of future impairments and include our \nOscar Mayer, Lunchables, Claussen, \nand\n Wattie’s\n brands, which had an aggregate carrying amount of $2.6 billion. \nWe generally utilize the discounted cash flow method under the income approach to estimate the fair value of our reporting units. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual net cash flows for each reporting unit (including net sales, cost of products sold, SG&A, depreciation and amortization, working capital, and capital expenditures), income tax rates, long-term growth rates, royalty rates, a discount rate that appropriately reflects the risks inherent in each future cash flow stream, and other market factors. We selected the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and guideline companies.\nWe utilize the excess earnings method under the income approach to estimate the fair value of certain of our largest brands. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual net cash flows for each brand (including net sales, cost of products sold, and SG&A), contributory asset charges, income tax considerations, long-term growth rates, a discount rate that reflects the level of risk associated with the future earnings attributable to the brand, management’s intent to invest in the brand indefinitely, and other market factors. We selected the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and guideline companies.\nWe utilize the relief from royalty method under the income approach to estimate the fair value of our remaining brands. Some of the more significant assumptions inherent in estimating the fair values include the estimated future annual net sales for each brand, royalty rates (as a percentage of net sales that would hypothetically be charged by a licensor of the brand to an unrelated licensee), income tax considerations, long-term growth rates, a discount rate that reflects the level of risk associated with the future cost savings attributable to the brand, and management’s intent to invest in the brand indefinitely. We selected the assumptions used in the financial forecasts using historical data, supplemented by current and anticipated market conditions, estimated product category growth rates, management’s plans, and guideline companies.\nThe discount rates, long-term growth rates, and royalty rates (for our brands valued utilizing the relief from royalty method) used to estimate the fair values of our reporting units and our brands with 20% or less excess fair value over carrying amount, as well as the goodwill or brand carrying amounts, as of the latest test for each reporting unit and brand were as follows:\nGoodwill or Brands Carrying Amount\n(in billions)\nDiscount Rate\nLong-Term Growth Rate\nRoyalty Rate\nMinimum\nMaximum\nMinimum\nMaximum\nMinimum\nMaximum\nReporting units\n$\n24.1 \n7.8 \n%\n12.0 \n%\n1.3 \n%\n4.0 \n%\nBrands\n(excess earnings method)\n13.2 \n8.3 \n%\n8.6 \n%\n1.3 \n%\n1.8 \n%\nBrands\n(relief from royalty method)\n3.6 \n8.4 \n%\n9.3 \n%\n0.5 \n%\n2.0 \n%\n4.0 \n%\n20.0 \n%\nAssumptions used in impairment testing are made at a point in time and require significant judgment; therefore, they are subject to change based on the facts and circumstances present at each annual and interim impairment test date. Additionally, these assumptions are generally interdependent and do not change in isolation. However, as it is reasonably possible that changes in assumptions could occur, as a sensitivity measure, we have presented the estimated effects of isolated changes in discount rates, long-term growth rates, and royalty rates (for our brands valued utilizing the relief from royalty method) on the fair values of our reporting units and brands with 20% or less excess fair value over carrying amount. These estimated changes in fair value are not necessarily representative of the actual impairment that would be recorded in the event of a fair value decline.\n42\nIf we had changed the assumptions used to estimate the fair value of our reporting units and brands with 20% or less excess fair value over carrying amount, as a result of the latest test for each of these reporting units and brands, these isolated changes, which are reasonably possible to occur, would have led to the following increase/(decrease) in the aggregate fair value of these reporting units and brands (in billions):\nDiscount Rate\nLong-Term Growth Rate\nRoyalty Rate\n50-Basis-Point\n25-Basis-Point\n100-Basis-Point\nIncrease\nDecrease\nIncrease\nDecrease\nIncrease\nDecrease\nReporting units\n$\n(4.0)\n$\n4.7 \n$\n2.0 \n$\n(1.8)\nBrands (excess earnings method)\n(1.0)\n1.1 \n0.4 \n$\n(0.4)\nBrands (relief from royalty method)\n(0.2)\n0.3 \n0.1 \n(0.1)\n$\n0.3 \n$\n(0.3)\nDefinite-lived intangible assets are amortized on a straight-line basis over the estimated periods benefited. We review definite-lived intangible assets for impairment when conditions exist that indicate the carrying amount of the assets may not be recoverable. Such conditions could include significant adverse changes in the business climate, current-period operating or cash flow losses, significant declines in forecasted operations, or a current expectation that an asset group will be disposed of before the end of its useful life. We perform undiscounted operating cash flow analyses to determine if an impairment exists. When testing for impairment of definite-lived intangible assets held for use, we group assets at the lowest level for which cash flows are separately identifiable. If an impairment is determined to exist, the loss is calculated based on estimated fair value. Impairment losses on definite-lived intangible assets to be disposed of, if any, are based on the estimated proceeds to be received, less costs of disposal. \nSee Note 8, \nGoodwill and Intangible Assets\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for our impairment testing results.\nPostemployment Benefit Plans:\nWe maintain various retirement plans for the majority of our employees. These include pension benefits, postretirement health care benefits, and defined contribution benefits. The cost of these plans is charged to expense over an appropriate term based on, among other things, the cost component and whether the plan is active or inactive. Changes in the fair value of our plan assets result in net actuarial gains or losses. These net actuarial gains and losses are deferred into accumulated other comprehensive income/(losses) and amortized within other expense/(income) in future periods using the corridor approach. The corridor is 10% of the greater of the market-related value of the plan’s asset or projected benefit obligation. Any actuarial gains and losses in excess of the corridor are then amortized over an appropriate term based on whether the plan is active or inactive.\nFor our postretirement benefit plans, our 2025 health care cost trend rate assumption will be 6.2%. We established this rate based upon our most recent experience as well as our expectation for health care trend rates going forward. We anticipate the weighted average assumed ultimate trend rate will be 4.8%. The year in which the ultimate trend rate is reached varies by plan, ranging between the years 2027 and 2035. Assumed health care cost trend rates have a significant effect on the amounts reported for the health care plans.\nOur 2025 discount rate assumption will be 5.6% for service cost and 5.2% for interest cost for our postretirement plans. Our 2025 discount rate assumption will be 6.0% for service cost and 5.5% for interest cost for our U.S. pension plans and 5.9% for service cost and 5.3% for interest cost for our non-U.S. pension plans. We model these discount rates using a portfolio of high quality, fixed-income debt instruments with durations that match the expected future cash flows of the plans. Changes in our discount rates were primarily the result of changes in bond yields year-over-year.\nOur 2025 expected return on plan assets will be 6.3% (net of applicable taxes) for our postretirement plans. Our 2025 expected rate of return on plan assets will be 7.0% for our U.S. pension plans and 6.3% for our non-U.S. pension plans. We determine our expected rate of return on plan assets from the plan assets’ historical long-term investment performance, current and future asset allocation, and estimates of future long-term returns by asset class. We attempt to maintain our target asset allocation by re-balancing between asset classes as we make contributions and monthly benefit payments.\n43\nWhile we do not anticipate further changes in the 2025 assumptions for our U.S. and non-U.S. pension and postretirement benefit plans, as a sensitivity measure, a 100-basis-point change in our discount rate or a 100-basis-point change in the expected rate of return on plan assets would have the following effects, increase/(decrease) in cost (in millions): \nU.S. Plans\nNon-U.S. Plans\n100-Basis-Point\n100-Basis-Point\nIncrease\nDecrease\nIncrease\nDecrease\nEffect of change in discount rate on pension costs\n$\n8 \n$\n(10)\n$\n(3)\n$\n3 \nEffect of change in expected rate of return on plan assets on pension costs\n(28)\n28 \n(13)\n13 \nEffect of change in discount rate on postretirement costs\n— \n— \n(1)\n1 \nEffect of change in expected rate of return on plan assets on postretirement costs\n(8)\n8 \n— \n— \nIncome Taxes:\nWe compute our annual tax rate based on the statutory tax rates and tax planning opportunities available to us in the various jurisdictions in which we earn income. Significant judgment is required in determining our annual tax rate and in evaluating the uncertainty of our tax positions. We recognize a benefit for tax positions that we believe will more likely than not be sustained upon examination. The amount of benefit recognized is the largest amount of benefit that we believe has more than a 50% probability of being realized upon settlement. We regularly monitor our tax positions and adjust the amount of recognized tax benefit based on our evaluation of information that has become available since the end of our last financial reporting period. The annual tax rate includes the impact of these changes in recognized tax benefits. When adjusting the amount of recognized tax benefits, we do not consider information that has become available after the balance sheet date, however we do disclose the effects of new information whenever those effects would be material to our financial statements. Unrecognized tax benefits represent the difference between the amount of benefit taken or expected to be taken in a tax return and the amount of benefit recognized for financial reporting. These unrecognized tax benefits are recorded primarily within other non-current liabilities on the consolidated balance sheets.\nWe record valuation allowances to reduce deferred tax assets to the amount that is more likely than not to be realized. When assessing the need for valuation allowances, we consider future taxable income and ongoing prudent and feasible tax planning strategies. Should a change in circumstances lead to a change in judgment about the realizability of deferred tax assets in future years, we would adjust related valuation allowances in the period that the change in circumstances occurs, along with a corresponding increase or decrease to income. The resolution of tax reserves and changes in valuation allowances could be material to our results of operations for any period but is not expected to be material to our financial position.\nAs part of our planning for the changes in the international tax environment, as well as to achieve greater operational synergies, we have enacted changes to our corporate entity structure which included a transfer of and will result in the movement of certain business operations to a wholly-owned subsidiary in the Netherlands resulting in a tax benefit of $3.0 billion recorded as a non-U.S. deferred tax asset in December 2024. The deferred tax asset was recognized as a result of the book and tax basis difference on the business transferred to the Netherlands subsidiary with the tax basis determined by reference to the fair value of the business. In determining the fair value of the business transferred the Company utilized the discounted cash flow method under the income approach and in doing so, we made assumptions that have a significant impact on the fair value including, but not limited to, estimated future annual net cash flows (most significantly estimated future annual net sales), a discount rate that reflects the level of risk associated with the future cash flows of the business, long-term growth rates, income tax rates and other market factors. The associated valuation allowance of $0.6 billion is related to uncertainty in the Pillar Two legislative interpretation and is based on our latest assessment of the total tax benefit that is more likely than not to be realized. The recognition of our future tax benefits associated with this transaction is dependent upon the acceptance of the business valuation and tax basis step-up by the associated taxing authorities.\nNew Accounting Pronouncements\nSee Note 3, \nNew Accounting Standards\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for a discussion of new accounting pronouncements.\nContingencies\nSee Note 15, \nCommitments and Contingencies\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for a discussion of our contingencies.\nNon-GAAP Financial Measures\nThe non-GAAP financial measures we provide in this report should be viewed in addition to, and not as an alternative for, results prepared in accordance with U.S. GAAP.\n44\nTo supplement the consolidated financial statements prepared in accordance with U.S. GAAP, we have presented Organic Net Sales, Adjusted Operating Income, and Adjusted EPS, which are considered non-GAAP financial measures. The non-GAAP financial measures presented may differ from similarly titled non-GAAP financial measures presented by other companies, and other companies may not define these non-GAAP financial measures in the same way. These measures are not substitutes for their comparable U.S. GAAP financial measures, such as net sales, net income/(loss), operating income(loss), diluted EPS, or other measures prescribed by U.S. GAAP, and there are limitations to using non-GAAP financial measures. \nManagement uses these non-GAAP financial measures to assist in comparing our performance on a consistent basis for purposes of business decision making by removing the impact of certain items that management believes do not directly reflect our underlying operations. We believe that Organic Net Sales, Adjusted Operating Income, and Adjusted EPS provide important comparability of underlying operating results, allowing investors and management to assess the Company’s operating performance on a consistent basis.\nManagement believes that presenting our non-GAAP financial measures is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating our results. We believe that the presentation of these non-GAAP financial measures, when considered together with the corresponding U.S. GAAP financial measures and the reconciliations to those measures, provides investors with additional understanding of the factors and trends affecting our business than could be obtained absent these disclosures.\nOrganic Net Sales is defined as net sales excluding, when they occur, the impact of currency, acquisitions and divestitures, and a 53rd week of shipments. We calculate the impact of currency on net sales by holding exchange rates constant at the previous year’s exchange rate, with the exception of highly inflationary subsidiaries, for which we calculate the previous year’s results using the current year’s exchange rate. \nAdjusted Operating Income is defined as operating income excluding, when they occur, the impacts restructuring activities, deal costs, unrealized gains/(losses) on commodity hedges (the unrealized gains and losses are recorded in general corporate expenses until realized; once realized, the gains and losses are recorded in the applicable segment’s operating results), impairment losses, and certain non-ordinary course legal and regulatory matters.\nAdjusted EPS is defined as diluted EPS excluding, when they occur, the impacts of restructuring activities, deal costs, unrealized losses/(gains) on commodity hedges, impairment losses, certain non-ordinary course legal and regulatory matters, losses/(gains) on the sale of a business, other losses/(gains) related to acquisitions and divestitures (e.g., tax and hedging impacts), nonmonetary currency devaluation (e.g., remeasurement gains and losses), debt prepayment and extinguishment (benefit)/costs, and certain significant discrete income tax items, and including, when they occur, adjustments to reflect preferred stock dividend payments on an accrual basis.\n45\nThe Kraft Heinz Company\nReconciliation of Net Sales to Organic Net Sales\n(dollars in millions)\n(Unaudited)\nNet Sales\nCurrency\nAcquisitions and Divestitures\nOrganic Net Sales\nPrice\nVolume/Mix\n2024\nNorth America\n$\n19,543 \n$\n(27)\n$\n— \n$\n19,570 \nInternational Developed Markets\n3,535 \n13 \n— \n3,522 \nEmerging Markets\n2,768 \n(101)\n12 \n2,857 \nKraft Heinz\n$\n25,846 \n$\n(115)\n$\n12 \n$\n25,949 \n2023\nNorth America\n$\n20,126 \n$\n— \n$\n— \n$\n20,126 \nInternational Developed Markets\n3,623 \n— \n— \n3,623 \nEmerging Markets\n2,891 \n77 \n67 \n2,747 \nKraft Heinz\n$\n26,640 \n$\n77 \n$\n67 \n$\n26,496 \nYear-over-year growth rates\nNorth America\n(2.9)\n%\n(0.1) pp\n0.0 pp\n(2.8)\n%\n1.4 pp\n(4.2) pp\nInternational Developed Markets\n(2.4)\n%\n0.4 pp\n0.0 pp\n(2.8)\n%\n0.0 pp\n(2.8) pp\nEmerging Markets\n(4.3)\n%\n(6.2) pp\n(2.1) pp\n4.0 \n%\n3.5 pp\n0.5 pp\nKraft Heinz\n(3.0)\n%\n(0.7) pp\n(0.2) pp\n(2.1)\n%\n1.4 pp\n(3.5) pp\n46\nNet Sales\nImpact of Currency\nImpact of Acquisitions and Divestitures\nImpact of 53rd Week\nOrganic Net Sales\nPrice\nVolume/Mix\n2023\nNorth America\n20,126 \n(65)\n— \n— \n20,191 \nInternational Developed Markets\n3,623 \n(15)\n7 \n— \n3,631 \nEmerging Markets\n2,891 \n(88)\n27 \n— \n2,952 \nKraft Heinz\n26,640 \n(168)\n34 \n— \n26,774 \n2022\nNorth America\n20,340 \n— \n— \n357 \n19,983 \nInternational Developed Markets\n3,401 \n— \n30 \n56 \n3,315 \nEmerging Markets\n2,744 \n82 \n30 \n41 \n2,591 \nKraft Heinz\n26,485 \n82 \n60 \n454 \n25,889 \nYear-over-year growth rates\nNorth America\n(1.0)\n%\n(0.3) pp\n0.0 pp\n(1.7) pp\n1.0 \n%\n7.5 pp\n(6.5) pp\nInternational Developed Markets\n6.5 \n%\n(0.5) pp\n(0.7) pp\n(1.8) pp\n9.5 \n%\n15.6 pp\n(6.1) pp\nEmerging Markets\n5.4 \n%\n(6.6) pp\n(0.2) pp\n(1.7) pp\n13.9 \n%\n10.9 pp\n3.0 pp\nKraft Heinz\n0.6 \n%\n(0.9) pp\n(0.1) pp\n(1.8) pp\n3.4 \n%\n8.9 pp\n(5.5) pp\n47\nThe Kraft Heinz Company\nReconciliation of Operating Income/(Loss) to Adjusted Operating Income\n(in millions)\n(Unaudited)\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\nOperating income/(loss)\n1,683 \n4,572 \n3,634 \nRestructuring activities\n27 \n60 \n74 \nDeal costs\n— \n— \n9 \nUnrealized losses/(gains) on commodity hedges\n(19)\n1 \n63 \nImpairment losses\n3,669 \n662 \n999 \nCertain non-ordinary course legal and regulatory matters\n— \n2 \n210 \nAdjusted Operating Income\n$\n5,360 \n$\n5,297 \n$\n4,989 \n48\nThe Kraft Heinz Company\nReconciliation of Diluted EPS to Adjusted EPS\n(Unaudited)\nDecember 28, 2024\nDecember 30, 2023\nDecember 31, 2022\nDiluted EPS\n$\n2.26 \n$\n2.31 \n$\n1.91 \nRestructuring activities\n(a)\n0.01 \n0.16 \n0.05 \nUnrealized losses/(gains) on commodity hedges\n(b)\n(0.01)\n— \n0.04 \nImpairment losses\n(c)\n2.58 \n0.50 \n0.70 \nCertain non-ordinary course legal and regulatory matters\n(d)\n— \n— \n0.13 \nLosses/(gains) on sale of business\n(e)\n0.05 \n— \n(0.01)\nOther losses/(gains) related to acquisitions and divestitures\n(f)\n— \n— \n(0.02)\nNonmonetary currency devaluation\n(g)\n0.01 \n0.02 \n0.01 \nDebt prepayment and extinguishment (benefit)/costs\n(h)\n— \n— \n(0.03)\nCertain significant discrete income tax items\n(i)\n(1.84)\n(0.01)\n— \nAdjusted EPS\n$\n3.06 \n$\n2.98 \n$\n2.78 \n(a)    Gross expenses/(income) included in restructuring activities were expenses of $20 million ($18 million after-tax) in 2024, $225 million ($193 million after-tax) in 2023 and $74 million ($56 million after-tax) in 2022 and were recorded in the following income statement line items:\n•\nCost of products sold included expenses of $8 million in 2024, $57 million in 2023 and $27 million in 2022;\n•\nSG&A included expenses of $19 million in 2024, $3 million in 2023, and $47 million in 2022; and\n•\nOther expense/(income) included income of $7 million in 2024 and expenses of $165 million in 2023. The 2024 income and 2023 expenses primarily relate to the settlement of one of our U.K. defined benefit pension plans. See Note 11, \nPostemployment Benefits\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information.\n(b)    Gross expenses/(income) included in unrealized losses/(gains) on commodity hedges were income of $19 million ($15 million after-tax) in 2024, expenses of $1 million ($1 million after-tax) in 2023 and expenses of $63 million ($48 million after-tax) in 2022 and were recorded in cost of products sold.\n(c)    Gross impairment losses included the following:\n•\nGoodwill impairment losses of $1.6 billion ($1.6 billion after-tax) in 2024, $510 million ($510 million after-tax) in 2023, and $444 million ($444 million after-tax) in 2022, which were recorded in SG&A;\n•\nIntangible asset impairment losses of $2.0 billion ($1.6 billion after-tax) in 2024, $152 million ($116 million after-tax) in 2023, and $469 million ($358 million after-tax) in 2022, which were recorded in SG&A; and\n•\nProperty, plant and equipment asset impairment losses of $86 million ($65 million after-tax) in 2022, which were recorded in cost of products sold. \n(d)    Gross expenses included in certain non-ordinary course legal and regulatory matters were $2 million ($2 million after-tax) in 2023, and $210 million ($161 million after-tax) in 2022 and were recorded in SG&A. See Note 15, \nCommitments and Contingencies\n, in Item 8, \nFinancial Statements and Supplementary Data\n, for additional information.\n(e)    Gross expenses/(income) included in losses/(gains) on sale of business were expenses of $81 million ($60 million after-tax) in 2024, income of $4 million (expenses of $3 million after-tax) in 2023, and income of $25 million ($17 million after-tax) in 2022 and were recorded in other expense/(income). \n(f)    Gross expenses/(income) included in other losses/(gains) related to acquisitions and divestitures were income of $38 million ($29 million after-tax) in 2022 and were recorded in other expense/(income).\n(g)    Gross expenses included in nonmonetary currency devaluation were $16 million ($16 million after-tax) in 2024, $28 million ($28 million after-tax) in 2023, and $17 million ($17 million after-tax) in 2022 and were recorded in other expense/(income).\n(h)    Gross expenses/(income) included in debt prepayment and extinguishment (benefit)/costs were income of $38 million ($35 million after-tax) in 2022 and were recorded in interest expense.\n(i)    Certain significant discrete income tax items were a benefit of $2.2 billion in 2024 and $17 million in 2023. The benefit in 2024 represents the recognition of a foreign deferred tax asset ($3.0 billion) and an associated valuation allowance ($0.6 billion) related to the transfer of business operations to a wholly-owned subsidiary in the Netherlands, partially offset by establishing a valuation allowance against deferred tax assets in our subsidiary in Brazil. The benefit in 2023 represents the reversal of uncertain tax position reserves related to the U.S. Tax Cuts and Jobs Act resulting from a conclusion of the IRS’s income tax examination for the year 2017 and the lapsing of the statute of limitations for such year.\n49",
  "item2": null
}