{
  "source_file": "kim-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion a\nnd Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q, together with other statements and information publicly disseminated by the Company, contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The Company intends such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and includes this statement for purposes of complying with the safe harbor provisions. Forward-looking statements, which are based on certain assumptions and describe the Company’s future plans, strategies and expectations, are generally identifiable by use of the words “believe,” “expect,” “intend,” “commit,” “anticipate,” “estimate,” “project,” “will,” “target,” “plan,” “forecast” or similar expressions. You should not rely on forward-looking statements since they involve known and unknown risks, uncertainties and other factors which, in some cases, are beyond the Company’s control and could materially affect actual results, performance or achievements. Factors which may cause actual results to differ materially from current expectations include, but are not limited to, (i) financial disruption, changes in trade policies and tariffs, geopolitical challenges or economic downturn, including general adverse economic and local real estate conditions, (ii) the impact of competition, including the availability of acquisition or development opportunities and the costs associated with purchasing and maintaining assets, (iii) the inability of major tenants to continue paying their rent obligations due to bankruptcy, insolvency or a general downturn in their business, (iv) the reduction in the Company’s income in the event of multiple lease terminations by tenants or a failure of multiple tenants to occupy their premises in a shopping center, (v) the potential impact of e-commerce and other changes in consumer buying practices, and changing trends in the retail industry and perceptions by retailers or shoppers, including safety and convenience, (vi) the availability of suitable acquisition, disposition, development, redevelopment and merger opportunities, and the costs associated with purchasing and maintaining assets and risks related to acquisitions not performing in accordance with our expectations, (vii) the Company’s ability to raise capital by selling its assets, (viii) disruptions and increases in operating costs due to inflation and supply chain disruptions, (ix) risks associated with the development of mixed-use commercial properties, including risks associated with the development, and ownership of non-retail real estate, (x) changes in governmental laws and regulations, including, but not limited to, changes in data privacy, environmental (including climate change), safety and health laws, and management’s ability to estimate the impact of such changes, (xi) valuation and risks related to the Company’s joint venture and preferred equity investments and other investments, (xii) collectability of mortgage and other financing receivables, (xiii) impairment charges, (xiv) criminal cybersecurity attack disruptions, data loss or other security incidents and breaches, (xv) risks related to artificial intelligence, (xvi) impact of natural disasters and weather and climate-related events, (xvii) pandemics or other health crises, (xviii) our ability to attract, retain and motivate key personnel, (xix) financing risks, such as the inability to obtain equity, debt or other sources of financing or refinancing on favorable terms to the Company, (xx) the level and volatility of interest rates and management’s ability to estimate the impact thereof, (xxi) changes in the dividend policy for the Company’s common and preferred stock and the Company’s ability to pay dividends at current levels, (xxii) unanticipated changes in the Company’s intention or ability to prepay certain debt prior to maturity and/or hold certain securities until maturity, (xxiii) the Company’s ability to continue to maintain its status as a REIT for U.S. federal income tax purposes and potential risks and uncertainties in connection with its UPREIT structure, and (xxiv) other risks and uncertainties identified under Item 1A, “Risk Factors” in our Annual Report on Form 10-K for the year ended December 31, 2024. Accordingly, there is no assurance that the Company’s expectations will be realized. The Company disclaims any intention or obligation to update the forward-looking statements, whether as a result of new information, future events or otherwise. You are advised to refer to any further disclosures the Company makes in other filings with the Securities and Exchange Commission (“SEC”).\nThe following discussion should be read in conjunction with the accompanying Condensed Consolidated Financial Statements and Notes thereto. These unaudited financial statements include all adjustments which are, in the opinion of management, necessary to reflect a fair statement of the results for the interim periods presented, and all such adjustments are of a normal recurring nature.\nExecutive Overview\nKimco Realty Corporation and its subsidiaries (the “Parent Company”) operates as a Real Estate Investment Trust (“REIT”), of which substantially all of the Parent Company’s assets are held by, and substantially all of the Parent Company’s operations are conducted through, Kimco Realty OP, LLC (“Kimco OP”), either directly or through its subsidiaries, as the Parent Company’s operating company. The Parent Company is the managing member and exercises exclusive control over Kimco OP. As of September 30, 2025, the Parent Company owned 99.79% of the outstanding limited liability company interests (the “OP Units”) in Kimco OP. The terms “Kimco,” “the Company,” and “our” each refer to the Parent Company and Kimco OP, collectively, unless the context indicates otherwise. In statements regarding qualification as a REIT, such terms refer solely to Kimco Realty Corporation.\nThe Company is the leading owner and operator of high-quality, open-air, grocery-anchored shopping centers and mixed-use properties in the United States. The executive officers are engaged in the day-to-day management and operation of real estate exclusively with the Company, with nearly all operating functions, including leasing, asset management, maintenance, construction, legal, finance and accounting, administered by the Company. The Company’s mission is to create destinations for everyday living that inspire a sense of community and deliver value to our many stakeholders.\n\n\n42\n\n\n\n\n \n\n\nThe Company is a self-administered REIT and has owned and operated open-air shopping centers for over 60 years. The Company has not engaged, nor does it expect to retain, any REIT advisors in connection with the operation of its properties. As of September 30, 2025, the Company had interests in 564 U.S. shopping center properties, aggregating 100.4 million square feet of gross leasable area (“GLA”), located in 30 states. In addition, the Company had 67 other property interests, primarily including net leased properties, preferred equity investments, and other investments, totaling 5.5 million square feet of GLA. The Company’s ownership interests in real estate consist of its consolidated portfolio and portfolios where the Company owns an economic interest, such as properties in the Company’s investment real estate management programs, where the Company partners with institutional investors and also retains management.\nThe Company’s primary business objective is to be the premier owner and operator of open-air, grocery-anchored shopping centers, and a growing portfolio of mixed-use assets, in the U.S. The Company believes it can achieve this objective by:\n \n•\nincreasing the value of its existing portfolio of properties and generating higher levels of portfolio growth;\n•\nincreasing cash flows for reinvestment and/or for distribution to shareholders while maintaining conservative payout ratios;\n•\nmaintaining strong debt metrics and its A-/A-/Baa1 unsecured debt ratings;\n•\ncontinuing growth in desirable demographic areas with successful retailers, primarily focused on grocery anchors; and\n•\nincreasing the number of entitlements for residential use.\n \nOn September 15, 2025, S&P Global Ratings assigned the Company a rating of A- for its senior unsecured debt, assigned a BBB credit rating for its preferred stock, and assigned it a “stable” rating outlook.\nRPT Merger\nOn January 2, 2024, RPT Realty (“RPT”) merged with and into the Company, with the Company continuing as the surviving public company (the “RPT Merger”), pursuant to the definitive merger agreement between the Company and RPT, which was entered into on August 28, 2023. As a result of the RPT Merger, the Company acquired 56 open-air shopping centers, including 43 wholly owned and 13 joint venture assets, comprising 13.3 million square feet of gross leasable area, to the Company’s existing portfolio. The Company also obtained RPT’s 6% stake in a 49-property net lease joint venture.\nEconomic Conditions and Regulatory Updates\nThe economy continues to face challenges, which could adversely impact the Company and its tenants, including elevated inflation, fluctuations in interest rates, tenant bankruptcies, international tariffs or other trade restrictions, and government shutdowns. These factors could slow economic growth and materially increase the cost of goods and services offered by the Company’s tenants, leading to lower profits. To the extent our tenants are unable to pass these costs on to their customers, our tenants’ operations could be adversely impacted, which could result in tenant bankruptcies, amongst other things, and could weaken demand by those tenants for our real estate and adversely impact the Company. In addition, these challenges could negatively affect the overall demand for retail space, including the demand for leasable space in the Company’s properties. Any of these factors could materially adversely impact the Company’s business, financial condition, results of operations or stock price. The Company continues to monitor economic, financial, and social conditions and will assess its asset portfolio for any impairment indicators. If the Company determines that any of its assets are impaired, the Company would be required to take impairment charges, and such amounts could be material.\nOn July 4, 2025, the One Big Beautiful Bill Act (the “OBBBA”) was enacted into law, which included certain modifications to U.S. tax law, including certain provisions that affect the taxation of REITs and their investors. The OBBBA did not have a material impact on the Company’s financial position and/or results of operations.\n \n\n\n43\n\n\n\n\n \n\n\nResults of Operations\nComparison of the three and nine months ended September 30, 2025 and 2024\nThe following table presents the comparative results from the Company’s Condensed Consolidated Statements of Income for the three and nine months ended September 30, 2025, as compared to the corresponding periods in 2024 (in thousands, except per share data):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenues from rental properties, net\n\n\n \n\n\n$\n\n\n531,113\n\n\n \n\n\n \n\n\n$\n\n\n502,875\n\n\n \n\n\n \n\n\n$\n\n\n28,238\n\n\n \n\n\n \n\n\n$\n\n\n1,583,329\n\n\n \n\n\n \n\n\n$\n\n\n1,498,001\n\n\n \n\n\n \n\n\n$\n\n\n85,328\n\n\n \n\n\n\n\n\n\nManagement and other fee income\n\n\n \n\n\n \n\n\n4,748\n\n\n \n\n\n \n\n\n \n\n\n4,757\n\n\n \n\n\n \n\n\n \n\n\n(9\n\n\n)\n\n\n \n\n\n \n\n\n14,331\n\n\n \n\n\n \n\n\n \n\n\n13,616\n\n\n \n\n\n \n\n\n \n\n\n715\n\n\n \n\n\n\n\n\n\nOperating expenses\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRent (1)\n\n\n \n\n\n \n\n\n(4,164\n\n\n)\n\n\n \n\n\n \n\n\n(4,239\n\n\n)\n\n\n \n\n\n \n\n\n75\n\n\n \n\n\n \n\n\n \n\n\n(12,590\n\n\n)\n\n\n \n\n\n \n\n\n(12,744\n\n\n)\n\n\n \n\n\n \n\n\n154\n\n\n \n\n\n\n\n\n\nReal estate taxes\n\n\n \n\n\n \n\n\n(67,384\n\n\n)\n\n\n \n\n\n \n\n\n(64,996\n\n\n)\n\n\n \n\n\n \n\n\n(2,388\n\n\n)\n\n\n \n\n\n \n\n\n(203,854\n\n\n)\n\n\n \n\n\n \n\n\n(194,538\n\n\n)\n\n\n \n\n\n \n\n\n(9,316\n\n\n)\n\n\n\n\n\n\nOperating and maintenance (2)\n\n\n \n\n\n \n\n\n(92,434\n\n\n)\n\n\n \n\n\n \n\n\n(88,744\n\n\n)\n\n\n \n\n\n \n\n\n(3,690\n\n\n)\n\n\n \n\n\n \n\n\n(273,056\n\n\n)\n\n\n \n\n\n \n\n\n(262,267\n\n\n)\n\n\n \n\n\n \n\n\n(10,789\n\n\n)\n\n\n\n\n\n\nGeneral and administrative (3)\n\n\n \n\n\n \n\n\n(29,646\n\n\n)\n\n\n \n\n\n \n\n\n(33,850\n\n\n)\n\n\n \n\n\n \n\n\n4,204\n\n\n \n\n\n \n\n\n \n\n\n(96,485\n\n\n)\n\n\n \n\n\n \n\n\n(103,238\n\n\n)\n\n\n \n\n\n \n\n\n6,753\n\n\n \n\n\n\n\n\n\nImpairment charges\n\n\n \n\n\n \n\n\n(440\n\n\n)\n\n\n \n\n\n \n\n\n(375\n\n\n)\n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n \n\n\n \n\n\n(8,619\n\n\n)\n\n\n \n\n\n \n\n\n(4,277\n\n\n)\n\n\n \n\n\n \n\n\n(4,342\n\n\n)\n\n\n\n\n\n\nMerger charges\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(25,246\n\n\n)\n\n\n \n\n\n \n\n\n25,246\n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n(158,269\n\n\n)\n\n\n \n\n\n \n\n\n(144,688\n\n\n)\n\n\n \n\n\n \n\n\n(13,581\n\n\n)\n\n\n \n\n\n \n\n\n(473,045\n\n\n)\n\n\n \n\n\n \n\n\n(447,555\n\n\n)\n\n\n \n\n\n \n\n\n(25,490\n\n\n)\n\n\n\n\n\n\nGain on sale of properties\n\n\n \n\n\n \n\n\n3,705\n\n\n \n\n\n \n\n\n \n\n\n551\n\n\n \n\n\n \n\n\n \n\n\n3,154\n\n\n \n\n\n \n\n\n \n\n\n43,514\n\n\n \n\n\n \n\n\n \n\n\n944\n\n\n \n\n\n \n\n\n \n\n\n42,570\n\n\n \n\n\n\n\n\n\nOther income/(expense)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOther (expense)/income, net\n\n\n \n\n\n \n\n\n(2,362\n\n\n)\n\n\n \n\n\n \n\n\n10,284\n\n\n \n\n\n \n\n\n \n\n\n(12,646\n\n\n)\n\n\n \n\n\n \n\n\n757\n\n\n \n\n\n \n\n\n \n\n\n20,764\n\n\n \n\n\n \n\n\n \n\n\n(20,007\n\n\n)\n\n\n\n\n\n\nMortgage and other financing income, net\n\n\n \n\n\n \n\n\n12,375\n\n\n \n\n\n \n\n\n \n\n\n11,919\n\n\n \n\n\n \n\n\n \n\n\n456\n\n\n \n\n\n \n\n\n \n\n\n35,706\n\n\n \n\n\n \n\n\n \n\n\n19,189\n\n\n \n\n\n \n\n\n \n\n\n16,517\n\n\n \n\n\n\n\n\n\nGain/(loss) on marketable securities, net\n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n79\n\n\n \n\n\n \n\n\n \n\n\n(36\n\n\n)\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n(27,613\n\n\n)\n\n\n \n\n\n \n\n\n27,645\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(84,261\n\n\n)\n\n\n \n\n\n \n\n\n(76,216\n\n\n)\n\n\n \n\n\n \n\n\n(8,045\n\n\n)\n\n\n \n\n\n \n\n\n(245,842\n\n\n)\n\n\n \n\n\n \n\n\n(224,122\n\n\n)\n\n\n \n\n\n \n\n\n(21,720\n\n\n)\n\n\n\n\n\n\nBenefit/(provision) for income taxes, net\n\n\n \n\n\n \n\n\n875\n\n\n \n\n\n \n\n\n \n\n\n(128\n\n\n)\n\n\n \n\n\n \n\n\n1,003\n\n\n \n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n \n\n\n \n\n\n(72,355\n\n\n)\n\n\n \n\n\n \n\n\n72,400\n\n\n \n\n\n\n\n\n\nEquity in income of joint ventures, net\n\n\n \n\n\n \n\n\n26,967\n\n\n \n\n\n \n\n\n \n\n\n20,981\n\n\n \n\n\n \n\n\n \n\n\n5,986\n\n\n \n\n\n \n\n\n \n\n\n73,640\n\n\n \n\n\n \n\n\n \n\n\n63,413\n\n\n \n\n\n \n\n\n \n\n\n10,227\n\n\n \n\n\n\n\n\n\nEquity in (loss)/income of other investments, net\n\n\n \n\n\n \n\n\n(811\n\n\n)\n\n\n \n\n\n \n\n\n216\n\n\n \n\n\n \n\n\n \n\n\n(1,027\n\n\n)\n\n\n \n\n\n \n\n\n1,637\n\n\n \n\n\n \n\n\n \n\n\n9,468\n\n\n \n\n\n \n\n\n \n\n\n(7,831\n\n\n)\n\n\n\n\n\n\nNet income attributable to noncontrolling interests\n\n\n \n\n\n \n\n\n(2,280\n\n\n)\n\n\n \n\n\n \n\n\n(2,443\n\n\n)\n\n\n \n\n\n \n\n\n163\n\n\n \n\n\n \n\n\n \n\n\n(5,922\n\n\n)\n\n\n \n\n\n \n\n\n(6,693\n\n\n)\n\n\n \n\n\n \n\n\n771\n\n\n \n\n\n\n\n\n\nPreferred dividends, net\n\n\n \n\n\n \n\n\n(7,536\n\n\n)\n\n\n \n\n\n \n\n\n(7,961\n\n\n)\n\n\n \n\n\n \n\n\n425\n\n\n \n\n\n \n\n\n \n\n\n(22,775\n\n\n)\n\n\n \n\n\n \n\n\n(23,864\n\n\n)\n\n\n \n\n\n \n\n\n1,089\n\n\n \n\n\n\n\n\n\nNet income available to the Company's common\n   shareholders\n\n\n \n\n\n$\n\n\n130,239\n\n\n \n\n\n \n\n\n$\n\n\n128,022\n\n\n \n\n\n \n\n\n$\n\n\n2,217\n\n\n \n\n\n \n\n\n$\n\n\n410,803\n\n\n \n\n\n \n\n\n$\n\n\n220,883\n\n\n \n\n\n \n\n\n$\n\n\n189,920\n\n\n \n\n\n\n\n\n\nNet income available to the Company's common\n   shareholders:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiluted per common share\n\n\n \n\n\n$\n\n\n0.19\n\n\n \n\n\n \n\n\n$\n\n\n0.19\n\n\n \n\n\n \n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n0.60\n\n\n \n\n\n \n\n\n$\n\n\n0.32\n\n\n \n\n\n \n\n\n$\n\n\n0.28\n\n\n \n\n\n\n\n \n(1)\nRent expense relates to ground lease payments for which the Company is the lessee.\n(2)\nOperating and maintenance expense consists of property related costs, including repairs and maintenance costs, roof repair, landscaping, parking lot repair, snow removal, utilities, property insurance costs, security and various other property related expenses.\n(3)\nGeneral and administrative expense includes employee-related expenses (including salaries, bonuses, equity awards, benefits, severance costs and payroll taxes), professional fees, office rent, travel and entertainment costs and other company-specific expenses.\nNet income available to the Company’s common shareholders was $130.2 million for the three months ended September 30, 2025, as compared to $128.0 million for the comparable period in 2024. On a diluted per common share basis, Net income available to the Company’s common shareholders was $0.19 for both the three months ended September 30, 2025 and 2024.\n \nNet income available to the Company’s common shareholders was $410.8 million for the nine months ended September 30, 2025, as compared to $220.9 million for the comparable period in 2024. On a diluted per common share basis, net income available to the Company’s common shareholders for the nine months ended September 30, 2025 was $0.60 as compared to $0.32 for the comparable period in 2024.\nThe following describes the changes of certain line items included on the Company’s Condensed Consolidated Statements of Income that the Company believes changed significantly and affected Net income available to the Company’s common shareholders during the three and nine months ended September 30, 2025, as compared to the corresponding periods in 2024.\nRevenues from rental properties, net –\n \nThe increase in Revenues from rental properties, net of $28.2 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily from (i) a net increase in revenues from tenants of $14.4 million, primarily due to an increase in leasing activity and net growth in the current portfolio, (ii) an increase in revenues of $11.2 million due to properties acquired during 2025 and 2024 and (iii) an increase in net straight-line rental income of $3.7 million, primarily due to changes in reserves, partially offset by (iv) a decrease in revenues of $1.1 million due to dispositions during 2025 and 2024.\n\n\n44\n\n\n\n\n \n\n\nThe increase in Revenues from rental properties, net of $85.3 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily from (i) a net increase in revenues from tenants of $46.3 million, primarily due to an increase in leasing activity and net growth in the current portfolio, (ii) an increase in revenues of $33.3 million due to properties acquired during 2025 and 2024, (iii) an increase in lease termination fee income of $6.4 million and (iv) an increase in net straight-line rental income of $0.7 million, primarily due to changes in reserves, partially offset by (v) a decrease in revenues of $1.4 million due to dispositions during 2025 and 2024.\nReal estate taxes –\nThe increase in Real estate taxes of $9.3 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) an increase of $2.7 million due to properties acquired during 2025 and 2024, (ii) an overall increase in assessed values in the current portfolio and (iii) timing of real estate tax refunds.\nOperating and maintenance –\nThe increase in Operating and maintenance expense of $3.7 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) an increase in repairs and maintenance expense of $2.9 million and (ii) an increase of $1.7 million resulting from properties acquired during 2025 and 2024, partially offset by (iii) a decrease in insurance expense of $0.8 million.\nThe increase in Operating and maintenance expense of $10.8 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) an increase in repairs and maintenance expense of $6.3 million, (ii) an increase of $4.4 million resulting from properties acquired during 2025 and 2024, (iii) an increase of $1.3 million in snow removal costs and (iv) an overall increase in operating costs of $1.2 million, partially offset by (v) a decrease in insurance expense of $2.4 million.\nGeneral and administrative –\nThe decrease in General and administrative expense of $4.2 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) a decrease in employee-related benefit expenses of $3.2 million and (ii) a decrease in professional fees and corporate expenses of $0.9 million.\nThe decrease in General and administrative expense of $6.8 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) a decrease in employee-related benefit expenses of $5.5 million and (ii) a decrease in professional fees and corporate expenses of $1.1 million.\nImpairment charges –\n \nDuring the nine months ended September 30, 2025 and 2024, the Company recognized impairment charges related to adjustments to property carrying values of $8.6 million and $4.3 million, respectively, for which the Company’s estimated fair values were primarily based upon signed contracts or letters of intent from third-party offers. These adjustments to property carrying values were recognized in connection with the Company’s efforts to market certain properties and management’s assessment as to the likelihood and timing of such potential transactions. Certain of the calculations to determine fair values utilized unobservable inputs and, as such, were classified as Level 3 of the FASB’s fair value hierarchy.\nMerger charges –\n \nDuring the nine months ended September 30, 2024, the Company incurred costs of $25.2 million associated with the RPT Merger, primarily comprised of severance and professional and legal fees.\nDepreciation and amortization –\n \nThe increase in Depreciation and amortization of $13.6 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) an increase of $7.9 million due to depreciation commencing on certain redevelopment projects and tenant improvement projects that were placed into service during 2025 and 2024 and (ii) an increase of $6.5 million resulting from properties acquired during 2025 and 2024, partially offset by (iii) a net decrease of $0.8 million due to fully depreciated assets and write-offs, primarily from demolition, vacated tenants and dispositions during 2025 and 2024.\nThe increase in Depreciation and amortization of $25.5 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) an increase of $24.2 million due to depreciation commencing on certain redevelopment projects and tenant improvement projects that were placed into service during 2025 and 2024 and (ii) an increase of $19.9 million resulting from properties acquired during 2025 and 2024, partially offset by (iii) a net decrease of $18.6 million due to fully depreciated assets and write-offs, primarily from demolition, vacated tenants and dispositions during 2025 and 2024.\n\n\n45\n\n\n\n\n \n\n\nGain on sale of properties –\nDuring the nine months ended September 30, 2025, the Company disposed of two operating properties and three land parcels, in separate transactions, for an aggregate sales price of $71.6 million, which resulted in aggregate gains of $43.5 million. During the nine months ended September 30, 2024, the Company disposed of 11 operating properties and seven land parcels, in separate transactions, for an aggregate sales price of $254.1 million, which resulted in aggregate gains of $0.9 million.\nOther (expense)/income, net –\nThe change in Other (expense)/income, net of $12.6 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) a decrease of $5.5 million due to mark-to-market fluctuations of an embedded derivative liability, (ii) $3.1 million in higher costs associated with potential transactions for which the Company is no longer pursuing, (iii) a decrease in interest income of $1.9 million resulting from lower cash balances during 2025 as compared to 2024 and (iv) an increase in environmental remediation costs of $1.1 million.\nThe change in Other (expense)/income, net of $20.0 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) a decrease in interest income of $8.6 million resulting from lower cash balances during 2025 as compared to 2024, (ii) $4.1 million in higher costs associated with potential transactions for which the Company is no longer pursuing, (iii) a decrease of $1.6 million from insurance proceeds received during 2025 as compared to 2024, (iv) an increase in environmental remediation costs of $1.5 million, (v) a decrease in dividend income of $1.4 million, primarily due to the sale of the remaining shares of ACI common stock held by the Company during 2024, and (vi) a decrease of $1.2 million from settlement proceeds of a contract during 2024.\nMortgage and other financing income, net –\n \nThe increase in Mortgage and other financing income, net of $16.5 million for the nine months ended September 30, 2025, as compared to the corresponding periods in 2024, is primarily due to (i) the Company’s origination of new loan financings during 2025 and 2024 and (ii) a change in provision for credit losses net of recoveries collected of $2.6 million, partially offset by (iii) loan repayments during 2025 and 2024.\nGain/(loss) on marketable securities, net –\nThe change in Gain/(loss) on marketable securities, net of $27.6 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is due to mark-to-market fluctuations and the sale of the remaining shares of ACI common stock held by the Company during 2024.\nInterest expense –\n \nThe increase in Interest expense of $8.0 million and $21.7 million for the three and nine months ended September 30, 2025, respectively, as compared to the corresponding periods in 2024, is primarily due to (i) the issuance of unsecured notes and assumption of mortgage loans during 2025 and 2024, partially offset by (ii) the paydown of unsecured notes and repayment of mortgage loans during 2025 and 2024.\nBenefit/(provision) for income taxes, net –\n \nThe change in Benefit/(provision) for income taxes, net of $72.4 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to the Company’s sale of shares of ACI common stock during 2024, which generated taxable long-term capital gains. The Company retained the proceeds from the sale during 2024 and, as a result, recorded estimated federal and state income taxes on these gains.\nEquity in income of joint ventures, net –\n \nThe increase in Equity in income of joint ventures, net of $6.0 million for the three months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to a gain on change in control of $5.7 million from the purchase of an additional interest in an operating property.\nThe increase in Equity in income of joint ventures, net of $10.2 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to (i) higher gains of $5.1 million primarily due to a gain on change in control from the purchase of an additional interest in an operating property, (ii) higher equity in income of $2.6 million, primarily due to the restructuring of a joint venture, and (iii) a decrease in interest expense of $2.5 million.\n\n\n46\n\n\n\n\n \n\n\nEquity in (loss)/income of other investments, net –\n \nThe decrease in Equity in (loss)/income of other investments, net of $7.8 million for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, is primarily due to profit participation from the sale of properties within the Company’s Preferred Equity Program during 2024.\nTenant Concentration\nThe Company reduces its operating and leasing risks through diversification achieved by the geographic distribution of its properties and a large tenant base. As of September 30, 2025, the Company had interests in 564 U.S. shopping center properties, aggregating 100.4 million square feet of GLA, located in 30 states. At September 30, 2025, the Company’s five largest tenants were The TJX Companies, Ross Stores, Burlington Stores, Inc., Amazon/Whole Foods and Albertsons Companies, Inc., which represented 3.8%, 1.8%, 1.8%, 1.7% and 1.7%, respectively, of the Company’s annualized base rental revenues, including the proportionate share of base rental revenues from properties in which the Company has less than a 100% economic interest.\n \nLiquidity and Capital Resources\nThe Company’s capital resources include accessing the public debt and equity capital markets, unsecured term loans, mortgages and construction loan financing, and immediate access to the Credit Facility with bank commitments of $2.0 billion, which can be increased to $2.75 billion through an accordion feature.\n \nThe Company anticipates that net cash flow provided by operating activities, borrowings under its Credit Facility and the issuance of equity, public debt, as well as other debt and equity alternatives, will provide the necessary capital required by the Company. The Company will continue to evaluate its capital requirements for both its short-term and long-term liquidity needs, which could be affected by various risks and uncertainties, including, but not limited to, the effects of the current economic environment, interest rates, inflation, international tariffs or other trade restrictions, and other risks detailed in Part I, Item 1A. Risk Factors of our Annual Report on Form 10-K for the year ended December 31, 2024.\nThe Company’s cash flow activities are summarized as follows (in thousands):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nCash, cash equivalents and restricted cash, beginning of the period\n\n\n \n\n\n$\n\n\n689,731\n\n\n \n\n\n \n\n\n$\n\n\n783,757\n\n\n \n\n\n\n\n\n\nNet cash flow provided by operating activities\n\n\n \n\n\n \n\n\n861,644\n\n\n \n\n\n \n\n\n \n\n\n766,080\n\n\n \n\n\n\n\n\n\nNet cash flow used for investing activities\n\n\n \n\n\n \n\n\n(491,318\n\n\n)\n\n\n \n\n\n \n\n\n(91,855\n\n\n)\n\n\n\n\n\n\nNet cash flow used for financing activities\n\n\n \n\n\n \n\n\n(899,576\n\n\n)\n\n\n \n\n\n \n\n\n(667,938\n\n\n)\n\n\n\n\n\n\nNet change in cash, cash equivalents and restricted cash\n\n\n \n\n\n \n\n\n(529,250\n\n\n)\n\n\n \n\n\n \n\n\n6,287\n\n\n \n\n\n\n\n\n\nCash, cash equivalents and restricted cash, end of the period\n\n\n \n\n\n$\n\n\n160,481\n\n\n \n\n\n \n\n\n$\n\n\n790,044\n\n\n \n\n\n\n\nOperating Activities\nNet cash flow provided by operating activities for the nine months ended September 30, 2025 was $861.6 million, as compared to $766.1 million for the comparable period in 2024. The increase of $95.5 million is primarily attributable to:\n•\nadditional operating cash flow generated by operating properties acquired, partially offset by the disposition of operating properties during 2025 and 2024;\n•\nnew leasing, expansion and re-tenanting of core portfolio properties; and\n•\nmerger costs incurred in connection with the RPT Merger during 2024;\n•\noperating cash flow from new mortgage and other financing loans provided during 2025 and 2024; partially offset by\n•\nchanges in operating assets and liabilities due to timing of receipts and payments; and\n•\na decrease in distributions from the Company’s joint ventures programs.\nInvesting Activities\nNet cash flow used for investing activities was $491.3 million for the nine months ended September 30, 2025, as compared to $91.9 million for the comparable period in 2024.\nInvesting activities during the nine months ended September 30, 2025 primarily consisted of:\nCash inflows:\n•\n$71.8 million from the collection of mortgage and other financing receivables; \n•\n$58.2 million in proceeds from sale of two operating properties and three land parcels; and\n\n\n47\n\n\n\n\n \n\n\n•\n$19.8 million in reimbursements of investments in and advances to real estate joint ventures and other investments.\nCash outflows:\n \n•\n$252.0 million for investment in mortgage and other financing receivables related to new mortgage and other financing receivables;\n•\n$232.0 million for improvements to operating real estate, primarily related to re-tenanting, tenant improvements and redevelopment projects;\n•\n$144.4 million for acquisition/consolidation of two operating properties;\n•\n$8.4 million for investments in and advances to real estate joint ventures and other investments, primarily related to redevelopment projects within these portfolios; and\n•\n$5.9 million for investment in preferred stock and cost method investments.\nInvesting activities during the nine months ended September 30, 2024 primarily consisted of:\nCash inflows:\n•\n$301.5 million in proceeds from sale of marketable securities, primarily due to the sale of 14.2 million shares of ACI common stock;\n•\n$85.1 million from the collection of mortgage and other financing receivables;\n•\n$70.4 million in proceeds from the sale of 11 operating properties and seven land parcels; and\n•\n$25.1 million in reimbursements of investments in and advances to real estate joint ventures and other investments.\nCash outflows:\n•\n$213.4 million for improvements to operating real estate, primarily related to re-tenanting, tenant improvements and the Company’s active redevelopment pipeline;\n•\n$190.2 million for investment in mortgage and other financing receivables, primarily related to new mortgage and other financing receivables;\n•\n$149.1 million for the acquisition of RPT;\n•\n$10.0 million for a deposit on an acquisition of an operating property acquired in October 2024; and\n•\n$9.8 million for investments in and advances to real estate joint ventures and other investments, primarily related to redevelopment projects within these portfolios.\nAcquisition/Consolidation of Operating Real Estate –\nDuring the nine months ended September 30, 2025, the Company expended $144.4 million for the acquisition/consolidation of operating real estate properties. During the nine months ended September 30, 2024, the Company expended $149.1 million in conjunction with the RPT Merger. The Company anticipates spending up to approximately $25.0 million to $75.0 million towards the acquisition of, or the purchase of additional interests in, operating properties for the remainder of 2025. The Company intends to fund these potential acquisitions with net cash flow provided by operating activities, proceeds from property dispositions, and/or availability under its Credit Facility.\nImprovements to Operating Real Estate –\nDuring the nine months ended September 30, 2025 and 2024, the Company expended $232.0 million and $213.4 million, respectively, for improvements to operating real estate. These amounts consist of the following (in thousands):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRedevelopment and renovations\n\n\n \n\n\n$\n\n\n126,267\n\n\n \n\n\n \n\n\n$\n\n\n94,520\n\n\n \n\n\n\n\n\n\nTenant improvements and tenant allowances\n\n\n \n\n\n \n\n\n105,699\n\n\n \n\n\n \n\n\n \n\n\n118,921\n\n\n \n\n\n\n\n\n\nTotal improvements\n\n\n \n\n\n$\n\n\n231,966\n\n\n \n\n\n \n\n\n$\n\n\n213,441\n\n\n \n\n\n\n\n \nThe Company, on a selective basis, will redevelop projects or re-tenant its properties to maintain or enhance its competitive position in the marketplace. The Company is actively pursuing redevelopment opportunities within its operating portfolio, including residential and mixed-use components, which it believes will increase the overall value by bringing in new tenants and improving the assets’ value. The Company anticipates its capital commitment toward these redevelopment projects and re-tenanting efforts for the remainder of 2025 will be approximately $50.0 million to $100.0 million. The funding of these capital requirements will be from net cash flow provided by operating activities, proceeds from property dispositions, and/or availability under the Company’s Credit Facility.\n\n\n48\n\n\n\n\n \n\n\nFinancing Activities\nNet cash flow used for financing activities was $899.6 million for the nine months ended September 30, 2025, as compared to $667.9 million for the comparable period in 2024.\nFinancing activities during the nine months ended September 30, 2025 primarily consisted of:\nCash inflows:\n•\n$500.0 million in proceeds from issuance of unsecured notes; and\n•\n$40.0 million in proceeds from the Credit Facility.\nCash outflows:\n•\n$740.5 million for repayments of unsecured notes;\n•\n$531.1 million of dividends paid;\n•\n$58.8 million for repurchase of common stock;\n•\n$57.9 million in principal payments on debt (related to the repayment of debt on three encumbered properties), including normal amortization on rental property debt;\n•\n$24.4 million in principal payments under finance lease obligations for the acquisition of the fee interest in two properties;\n•\n$11.7 million in shares repurchased for employee tax withholding on equity awards;\n•\n$7.5 million in financing origination costs; and\n•\n$7.5 million for distribution and redemption of noncontrolling interests.\nFinancing activities during the nine months ended September 30, 2024 primarily consisted of:\nCash inflows:\n•\n$860.0 million in proceeds from issuance of unsecured term loans; and\n•\n$500.0 million in proceeds from issuance of unsecured notes.\nCash outflows:\n•\n$1.2 billion in repayments of unsecured notes;\n•\n$507.8 million of dividends paid;\n•\n$310.0 million in repayments of unsecured term loans;\n•\n$19.0 million in principal payments on debt (related to the repayment of debt on three encumbered properties), including normal amortization on rental property debt;\n•\n$15.3 million in shares repurchased for employee tax withholding on equity awards;\n•\n$13.9 million in redemption/distribution of noncontrolling interests; and\n•\n$7.0 million in financing origination costs related to new unsecured term loans and unsecured notes.\nThe Company continually evaluates its debt maturities and, based on management’s current assessment, believes it has viable financing and refinancing alternatives that will not materially adversely impact its expected financial results. As of September 30, 2025, the Company had consolidated floating rate debt totaling $52.9 million. The Company continues to pursue borrowing opportunities with large commercial U.S. and global banks, select life insurance companies and certain regional and local banks.\n \nDebt maturities for 2025 consist of $21.9 million of unconsolidated joint venture debt, assuming the utilization of extension options where available. The 2025 debt maturities on properties in the Company’s unconsolidated joint ventures are anticipated to be repaid through net cash flow provided by operating activities, debt refinancing, proceeds from sales, and/or partner capital contributions, as deemed appropriate.\nThe Company intends to maintain strong debt service coverage and fixed charge coverage ratios as part of its commitment to maintain its unsecured debt ratings. The Company may, from time to time, seek to obtain funds through additional common and preferred equity offerings, unsecured debt financings and/or mortgage/construction loan financings and other capital alternatives.\nThe Company utilizes the public debt and equity markets as its principal source of capital for its expansion needs through offerings of its public unsecured debt and equity. Proceeds from public capital market activities have been used for the purposes of, among other things, repaying indebtedness, acquiring interests in open-air, grocery anchored shopping centers and mixed-use assets, expanding and improving properties in the portfolio and other investments.\nDuring January 2023, the Company filed a shelf registration statement on Form S-3, which is effective for a term of three years, for future unlimited offerings, from time to time, of debt securities, preferred stock, depositary shares, common stock and common stock warrants. The Company, pursuant to this shelf registration statement may, from time to time, offer for sale its senior unsecured debt\n \n\n\n49\n\n\n\n\n \n\n\nsecurities for any general corporate purposes, including (i) funding specific liquidity requirements in its business, including property acquisitions, development and redevelopment costs and (ii) managing the Company’s debt maturities.\nDuring January 2023, the Company filed a post-effective amendment to a registration statement on Form S-8 for the Kimco Realty Corporation 2020 Equity Participation Plan (the “2020 Plan”), which was previously approved by the Company’s stockholders and is a successor to the Restated Kimco Realty Corporation 2010 Equity Participation Plan that expired in March 2020. The 2020 Plan provided for a maximum of 10.0 million shares of the Company’s common stock to be reserved for the issuance of stock options, stock appreciation rights, restricted stock, restricted stock units, performance awards, dividend equivalents, stock payments, deferred stock awards and long-term incentive plan units.\n \nDuring February 2025, the Company filed a registration statement on Form S-8 for the Kimco Realty Corporation 2025 Equity Participation Plan (the “2025 Plan”), which was approved by the Company’s stockholders on April 29, 2025 and is a successor to the 2020 Plan. The 2025 Plan provides for a maximum of 17.5 million shares of the Company’s common stock to be reserved for the issuance of stock options, stock appreciation rights, restricted stock, restricted stock units, performance awards, dividend equivalents, stock payments, deferred stock awards and long-term incentive plan units. At September 30, 2025, the Company had 16.8 million shares of common stock available for issuance under the 2025 Plan.\nPreferred Stock –\nThe Company’s Board of Directors authorized the repurchase of up to 891,000 depositary shares of Class L Preferred Stock, 1,047,000 depositary shares of Class M Preferred Stock, and 185,000 depositary shares of Class N Preferred Stock, representing an aggregate of up to 2,123 shares of the Company’s preferred stock, par value $1.00 per share, through February 28, 2026. During the nine months ended September 30, 2025, the Company repurchased the following preferred stock:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClass of Preferred Stock\n\n\n \n\n\nDepositary Shares \nRepurchased\n\n\n \n\n\n \n\n\nPurchase Price \n(in thousands)\n\n\n \n\n\n\n\n\n\nClass N\n\n\n \n\n\n \n\n\n58,342\n\n\n \n\n\n \n\n\n$\n\n\n3,481\n\n\n \n\n\n\n\nCommon Stock –\nDuring September 2023, the Company established an at-the-market continuous offering program (the “ATM Program”) pursuant to which the Company may offer and sell, from time-to-time, shares of its common stock, par value $0.01 per share, with an aggregate gross sales price of up to $500.0 million through a consortium of banks acting as sales agents, which is scheduled to expire September 15, 2026. Sales of the shares of common stock may be made, as needed, from time to time, in “at the market” offerings as defined in Rule 415 of the Securities Act of 1933, as amended, including by means of ordinary brokers’ transactions on the New York Stock Exchange or otherwise (i) at market prices prevailing at the time of sale, (ii) at prices related to prevailing market prices or (iii) as otherwise agreed to with the applicable sales agent. In addition, the Company may from time to time enter into separate forward sale agreements with one or more banks. The Company did not issue any shares under the ATM Program during the nine months ended September 30, 2025. As of September 30, 2025, the Company had $362.5 million available under this ATM Program.\nDuring February 2018, the Company established a common share repurchase program, which is scheduled to expire on February 28, 2026. Under this program, the Company may repurchase shares of its common stock, par value $0.01 per share, with an aggregate gross purchase price of up to $300.0 million. During the nine months ended September 30, 2025, the Company repurchased 3.0 million shares of common stock for an aggregate purchase price of $58.8 million (weighted average price of $19.61 per share). As of September 30, 2025, the Company had $166.0 million available under this common share repurchase program.\nSenior Notes –\nThe Company’s supplemental indenture governing its senior notes contains the following covenants, all of which the Company is compliant with:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCovenant\n\n\n \n\n\nMust Be\n\n\n \n\n\nAs of September 30, 2025\n\n\n\n\n\n\nConsolidated Indebtedness to Total Assets\n\n\n \n\n\n< 60%\n\n\n \n\n\n37%\n\n\n\n\n\n\nConsolidated Secured Indebtedness to Total Assets\n\n\n \n\n\n< 40%\n\n\n \n\n\n2%\n\n\n\n\n\n\nConsolidated Income Available for Debt Service to Maximum Annual Service Charge\n\n\n \n\n\n> 1.50x\n\n\n \n\n\n4.6x\n\n\n\n\n\n\nUnencumbered Total Asset Value to Consolidated Unsecured Indebtedness\n\n\n \n\n\n> 1.50x\n\n\n \n\n\n2.5x\n\n\n\n\n \nFor a full description of the various indenture covenants refer to the Indenture dated September 1, 1993; the First Supplemental Indenture dated August 4, 1994; the Second Supplemental Indenture dated April 7, 1995; the Third Supplemental Indenture dated June 2, 2006; the Fourth Supplemental Indenture dated April 26, 2007; the Fifth Supplemental Indenture dated as of September 24, 2009; the Sixth Supplemental Indenture dated as of May 23, 2013; the Seventh Supplemental Indenture dated as of April 24, 2014; and the Eighth Supplemental Indenture dated as of January 3, 2023, each as filed with the SEC. In connection with the merger with Weingarten Realty Investors (“Weingarten”), the Company assumed senior unsecured notes which have covenants that are similar to the Company’s\n \n\n\n50\n\n\n\n\n \n\n\nexisting debt covenants for its senior unsecured notes. Please refer to the form Indenture included in Weingarten’s Registration Statement on Form S-3, filed with the SEC on February 10, 1995, the First Supplemental Indenture, dated as of August 2, 2006 filed with Weingarten’s Current Report on Form 8-K dated August 2, 2006, and the Second Supplemental Indenture, dated as of October 9, 2012 filed with Weingarten’s Current Report on Form 8-K dated October 9, 2012, each as filed with the SEC. See the Exhibits Index to our Annual Report on Form 10-K for the year ended December 31, 2024 for specific filing information.\nIn June 2025, the Company issued $500.0 million in senior unsecured notes, which are scheduled to mature in February 2036 and accrue interest at a rate of 5.30% per annum. The Company utilized the net proceeds from this offering for the repayment of outstanding borrowings under the Credit Facility and other general corporate purposes.\nDuring the nine months ended September 30, 2025, the Company fully repaid the following notes payable (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nType\n\n\n \n\n\nDate Paid\n\n\n \n\n\nAmount Repaid\n\n\n \n\n\n \n\n\nInterest Rate\n\n\n \n\n\nMaturity Date\n\n\n\n\n\n\nUnsecured note\n\n\n \n\n\nJun-25\n\n\n \n\n\n$\n\n\n240.5\n\n\n \n\n\n \n\n\n3.85%\n\n\n \n\n\nJun-25\n\n\n\n\n\n\nUnsecured note\n\n\n \n\n\nFeb-25\n\n\n \n\n\n$\n\n\n500.0\n\n\n \n\n\n \n\n\n3.30%\n\n\n \n\n\nFeb-25\n\n\n\n\n \nCredit Facility –\nThe Company has a $2.0 billion Credit Facility with a group of banks. The Credit Facility is scheduled to expire in March 2027 with two additional six-month options to extend the maturity date, at the Company’s discretion, to March 2028. The Credit Facility can be increased to $2.75 billion through an accordion feature. The Credit Facility is a green credit facility tied to sustainability metric targets, as described in the agreement. The Credit Facility accrues interest at a rate of Adjusted Term SOFR, as defined in the terms of the Credit Facility, plus an applicable spread determined by the Company’s credit ratings. The interest rate can be further adjusted upward or downward based on the sustainability metric targets and the Company’s credit rating outlook, as defined in the agreement. As of September 30, 2025, the interest rate on the Credit Facility is Adjusted Term SOFR plus 68.5 basis points (4.96% as of September 30, 2025) after reductions for sustainability metrics achieved and an upgraded credit rating profile. Pursuant to the terms of the Credit Facility, the Company is subject to certain covenants. As of September 30, 2025, the Credit Facility had an outstanding balance of $40.0 million and no appropriations for letters of credit.\nPursuant to the terms of the Credit Facility, the Company, among other things, is subject to maintenance of various covenants. The Company is currently in compliance with these covenants. The financial covenants for the Credit Facility are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCovenant\n\n\n \n\n\nMust Be\n\n\n \n\n\nAs of September 30, 2025\n\n\n\n\n\n\nTotal Indebtedness to Gross Asset Value (“GAV”)\n\n\n \n\n\n< 60%\n\n\n \n\n\n36%\n\n\n\n\n\n\nTotal Priority Indebtedness to GAV\n\n\n \n\n\n< 35%\n\n\n \n\n\n2%\n\n\n\n\n\n\nUnencumbered Asset Net Operating Income to Total Unsecured Interest Expense\n\n\n \n\n\n> 1.75x\n\n\n \n\n\n4.4x\n\n\n\n\n\n\nFixed Charge Total Adjusted EBITDA to Total Debt Service\n\n\n \n\n\n> 1.50x\n\n\n \n\n\n4.0x\n\n\n\n\n \nTerm Loans –\nThe Company has $310.0 million of unsecured term loans ( the “Term Loans”) with a group of banks, which are scheduled to expire between November 2026 to February 2028. The Term Loans accrue interest at the rate of Adjusted Term SOFR plus an applicable spread determined by the Company’s credit rating outlook and sustainability metric targets, as described in the agreement. As of September 30, 2025, the interest rates on the Term Loans is Adjusted Term SOFR plus 81.0 basis points after reductions for an upgraded credit rating profile and sustainability metrics achieved. As of September 30, 2025, the Company had 20 swap rate agreements with various lenders swapping the interest rates on the Term Loans to all-in fixed rates ranging from 4.5793% to 4.7801%.\nThe Company has a $550.0 million unsecured term loan credit facility (the “Term Loan Credit Facility”) with a group of banks, which is scheduled to mature in January 2026 with three one-year options to extend the maturity date, at the Company’s discretion, to January 2029. The Term Loan Credit Facility accrues interest at a spread (currently 80.0 basis points after reductions for an upgraded credit rating profile) to the Adjusted Term SOFR Rate (as defined in the credit agreement) that fluctuates in accordance with changes in Kimco’s senior debt ratings. As of September 30, 2025, the Company had six swap rate agreements with various lenders swapping the overall interest rate on the $550.0 million Term Loan Credit Facility to an all-in fixed rate of 4.6122%. In October 2025, the Company exercised a one-year extension option to extend the maturity date to January 2027.\n \n\n\n51\n\n\n\n\n \n\n\nMortgages Payable –\nDuring the nine months ended September 30, 2025, the Company assumed $31.4 million of mortgage debt \n(including fair market value adjustment of $0.5 million) \nthrough the acquisition of an operating property and repaid $48.9 million of mortgage debt \n(including fair market value adjustment of $0.1 million) \nthat encumbered three operating properties.\nIn addition to the public equity and debt markets as capital sources, the Company may, from time to time, obtain mortgage financing on selected properties to partially fund the capital needs of its real estate re-development and re-tenanting projects. As of September 30, 2025, the Company had over 525 unencumbered property interests in its portfolio.\n \nLetters of Credit –\n \nThe Company has issued letters of credit in connection with the completion and repayment guarantees, primarily on certain of the Company’s redevelopment projects and guaranty of payment related to the Company’s insurance program. At September 30, 2025, these letters of credit aggregated $43.7 million.\nIn addition, the Company provides a guaranty for the payment of any debt service shortfalls on the Sheridan Redevelopment Agency issued Series A bonds, which are tax increment revenue bonds issued in connection with a development project in Sheridan, Colorado. These tax increment revenue bonds have a balance of $36.2 million outstanding at September 30, 2025. The bonds are to be repaid with incremental sales and property taxes and a public improvement fee (\"PIF\") to be assessed on current and future retail sales and, to the extent necessary, any amounts we may have to provide under a guaranty. The revenue generated from incremental sales, property taxes and PIF have satisfied the debt service requirements to date. The incremental taxes and PIF are to remain intact until the earlier of the payment of the bond liability in full or 2040.\nFunding Commitments –\n \nThe Company has investments with funding commitments of $30.9 million, of which $24.4 million has been funded as of September 30, 2025. In addition, the Company has mortgage and other financing receivables with undrawn loan advances of $42.8 million as of September 30, 2025.\nOther –\n \nThe Parent Company guarantees the unsecured debt instruments of Kimco OP, including the Credit Facility. These guarantees by the Parent Company are full, irrevocable, unconditional and absolute joint and several guarantees to the holders of each series of such unsecured debt instruments.\nIn connection with the construction of its development/redevelopment projects and related infrastructure, certain public agencies require posting of performance and surety bonds to guarantee that the Company’s obligations are satisfied. These bonds expire upon the completion of the improvements and infrastructure. As of September 30, 2025, the Company had $18.1 million in performance and surety bonds outstanding.\nDividends –\nIn connection with its intention to continue to qualify as a REIT for U.S. federal income tax purposes, the Company expects to continue paying regular dividends to its stockholders. These dividends will be paid from operating cash flows. The Company’s Board of Directors will continue to evaluate the Company’s dividend policy on a quarterly basis as it monitors sources of capital and evaluates the impact of the economy and capital markets availability on operating fundamentals. Since cash used to pay dividends reduces amounts available for capital investment, the Company generally intends to maintain a dividend payout ratio which reserves such amounts as it considers necessary for the expansion and renovation of shopping centers in its portfolio, debt reduction, the acquisition of interests in new properties and other investments as suitable opportunities arise and such other factors as the Board of Directors considers appropriate. Cash dividends paid for common and preferred stock for the nine months ended September 30, 2025 and 2024 were $531.1 million and $507.8 million, respectively.\nAlthough the Company receives substantially all of its rental payments on a monthly basis, it generally intends to continue paying dividends quarterly. Amounts accumulated in advance of each quarterly distribution will be invested by the Company in short-term money market or other suitable instruments. The Company’s objective is to establish a dividend level that maintains compliance with the Company’s REIT taxable income distribution requirements. On July 29, 2025, the Company’s Board of Directors declared a quarterly dividend with respect to the Company’s classes of cumulative redeemable preferred shares (Classes L, M and N), which were paid on October 15, 2025, to shareholders of record on October 1, 2025. In addition, the Company’s Board of Directors declared a quarterly cash dividend of $0.25 per common share, which was paid on September 19, 2025 to shareholders of record on September 5, 2025.\n\n\n52\n\n\n\n\n \n\n\nOn October 28, 2025, the Company’s Board of Directors declared quarterly dividends with respect to the Company’s classes of cumulative redeemable preferred shares (Classes L, M and N), which are scheduled to be paid on January 15, 2026, to shareholders of record on January 2, 2026. Additionally, the Company’s Board of Directors declared a quarterly cash dividend of $0.26 per common share, representing a 4.0% increase from the prior quarterly dividend of $0.25, payable on December 19, 2025 to shareholders of record on December 5, 2025.\n \nEffects of Inflation\nMany of the Company’s long-term leases contain provisions designed to help mitigate the adverse impact of inflation. Such provisions include clauses enabling the Company to receive payment of additional rent calculated as a percentage of tenants’ gross sales above pre-determined thresholds, which generally increase as prices rise, and/or as a result of escalation clauses, which generally increase rental rates during the terms of the leases. Such escalation clauses often include increases based upon changes in the consumer price index or similar inflation indices. In addition, many of the Company’s leases are for terms of less than 10 years, which permits the Company to seek to increase rents to market rates upon renewal. To assist in partially mitigating the Company’s exposure to increases in costs and operating expenses, including common area maintenance costs, real estate taxes and insurance, resulting from inflation, the Company’s leases include provisions that either (i) require the tenant to pay an allocable share of these operating expenses or (ii) contain fixed contractual amounts, which include escalation clauses, to reimburse these operating expenses.\n \nFunds From Operations (“FFO”)\nFFO is a supplemental non-GAAP financial measure utilized to evaluate the operating performance of real estate companies. NAREIT defines FFO as net income available to the Company’s common shareholders computed in accordance with GAAP, excluding (i) depreciation and amortization related to real estate, (ii) gains or losses from sales of certain real estate assets, (iii) gains and losses from change in control, (iv) impairment write-downs of certain real estate assets and investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity and (v) after adjustments for unconsolidated partnerships and joint ventures calculated to reflect FFO on the same basis. The Company also made an election, in accordance with the NAREIT Funds From Operations White Paper-2018 Restatement, to exclude from its calculation of FFO (i) gains and losses on the sale of assets and impairments of assets incidental to its main business and (ii) mark-to-market changes in the value of its equity securities. As such, the Company does not include gains/impairments on land parcels, mark-to-market gains/losses from derivatives/marketable securities, allowance for credit losses on mortgage receivables, gains/impairments on other investments or other amounts considered incidental to its main business in NAREIT defined FFO, including any applicable tax effect and noncontrolling interest.\n \nThe Company presents FFO available to the Company’s common shareholders as it considers it an important supplemental measure of our operating performance and believes it is frequently used by securities analysts, investors and other interested parties in the evaluation of REITs, many of which present FFO available to the Company’s common shareholders when reporting results. Comparison of our presentation of FFO available to the Company’s common shareholders to similarly titled measures for other REITs may not necessarily be meaningful due to possible differences in the application of the NAREIT definition used by such REITs.\nFFO is a supplemental non-GAAP financial measure of real estate companies’ operating performances, which does not represent cash generated from operating activities in accordance with GAAP, and therefore, should not be considered an alternative for net income or cash flows from operations as a measure of liquidity.\n\n\n53\n\n\n\n\n \n\n\nThe Company’s reconciliation of Net income available to the Company’s common shareholders to FFO available to the Company’s common shareholders is reflected in the table below (amounts presented in thousands, except per share data).\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet income available to the Company’s common \n   shareholders\n\n\n \n\n\n$\n\n\n130,239\n\n\n \n\n\n \n\n\n$\n\n\n128,022\n\n\n \n\n\n \n\n\n$\n\n\n410,803\n\n\n \n\n\n \n\n\n$\n\n\n220,883\n\n\n \n\n\n\n\n\n\nGain on sale of properties\n\n\n \n\n\n \n\n\n(3,705\n\n\n)\n\n\n \n\n\n \n\n\n(551\n\n\n)\n\n\n \n\n\n \n\n\n(43,514\n\n\n)\n\n\n \n\n\n \n\n\n(944\n\n\n)\n\n\n\n\n\n\nGain on sale of joint venture properties\n\n\n \n\n\n \n\n\n(5,803\n\n\n)\n\n\n \n\n\n \n\n\n(7\n\n\n)\n\n\n \n\n\n \n\n\n(6,587\n\n\n)\n\n\n \n\n\n \n\n\n(1,501\n\n\n)\n\n\n\n\n\n\nDepreciation and amortization - real estate related\n\n\n \n\n\n \n\n\n157,152\n\n\n \n\n\n \n\n\n \n\n\n143,482\n\n\n \n\n\n \n\n\n \n\n\n469,529\n\n\n \n\n\n \n\n\n \n\n\n443,836\n\n\n \n\n\n\n\n\n\nDepreciation and amortization - real estate joint ventures\n\n\n \n\n\n \n\n\n19,656\n\n\n \n\n\n \n\n\n \n\n\n21,218\n\n\n \n\n\n \n\n\n \n\n\n63,521\n\n\n \n\n\n \n\n\n \n\n\n64,161\n\n\n \n\n\n\n\n\n\nImpairment charges (including real estate joint ventures)\n\n\n \n\n\n \n\n\n2,340\n\n\n \n\n\n \n\n\n \n\n\n375\n\n\n \n\n\n \n\n\n \n\n\n10,519\n\n\n \n\n\n \n\n\n \n\n\n8,778\n\n\n \n\n\n\n\n\n\nProfit participation from other investments, net\n\n\n \n\n\n \n\n\n1,752\n\n\n \n\n\n \n\n\n \n\n\n377\n\n\n \n\n\n \n\n\n \n\n\n906\n\n\n \n\n\n \n\n\n \n\n\n(5,299\n\n\n)\n\n\n\n\n\n\nLoss/(gain) on derivative/marketable securities, net\n\n\n \n\n\n \n\n\n646\n\n\n \n\n\n \n\n\n \n\n\n(4,849\n\n\n)\n\n\n \n\n\n \n\n\n(1,802\n\n\n)\n\n\n \n\n\n \n\n\n25,922\n\n\n \n\n\n\n\n\n\n(Benefit)/provision for income taxes, net (1)\n\n\n \n\n\n \n\n\n(1,217\n\n\n)\n\n\n \n\n\n \n\n\n59\n\n\n \n\n\n \n\n\n \n\n\n(1,355\n\n\n)\n\n\n \n\n\n \n\n\n71,706\n\n\n \n\n\n\n\n\n\nNoncontrolling interests (1)\n\n\n \n\n\n \n\n\n(744\n\n\n)\n\n\n \n\n\n \n\n\n(738\n\n\n)\n\n\n \n\n\n \n\n\n(2,253\n\n\n)\n\n\n \n\n\n \n\n\n(2,367\n\n\n)\n\n\n\n\n\n\nFFO available to the Company’s common shareholders (3)\n\n\n \n\n\n$\n\n\n300,316\n\n\n \n\n\n \n\n\n$\n\n\n287,388\n\n\n \n\n\n \n\n\n$\n\n\n899,767\n\n\n \n\n\n \n\n\n$\n\n\n825,175\n\n\n \n\n\n\n\n\n\nWeighted average shares outstanding for FFO calculations:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBasic\n\n\n \n\n\n \n\n\n674,639\n\n\n \n\n\n \n\n\n \n\n\n671,231\n\n\n \n\n\n \n\n\n \n\n\n675,433\n\n\n \n\n\n \n\n\n \n\n\n670,851\n\n\n \n\n\n\n\n\n\nUnits\n\n\n \n\n\n \n\n\n3,576\n\n\n \n\n\n \n\n\n \n\n\n3,293\n\n\n \n\n\n \n\n\n \n\n\n3,297\n\n\n \n\n\n \n\n\n \n\n\n3,245\n\n\n \n\n\n\n\n\n\nConvertible preferred shares\n\n\n \n\n\n \n\n\n3,185\n\n\n \n\n\n \n\n\n \n\n\n4,265\n\n\n \n\n\n \n\n\n \n\n\n3,217\n\n\n \n\n\n \n\n\n \n\n\n4,265\n\n\n \n\n\n\n\n\n\nDilutive effect of equity awards\n\n\n \n\n\n \n\n\n732\n\n\n \n\n\n \n\n\n \n\n\n289\n\n\n \n\n\n \n\n\n \n\n\n762\n\n\n \n\n\n \n\n\n \n\n\n193\n\n\n \n\n\n\n\n\n\nDiluted (2)\n\n\n \n\n\n \n\n\n682,132\n\n\n \n\n\n \n\n\n \n\n\n679,078\n\n\n \n\n\n \n\n\n \n\n\n682,709\n\n\n \n\n\n \n\n\n \n\n\n678,554\n\n\n \n\n\n\n\n\n\nFFO per common share – basic\n\n\n \n\n\n$\n\n\n0.45\n\n\n \n\n\n \n\n\n$\n\n\n0.43\n\n\n \n\n\n \n\n\n$\n\n\n1.33\n\n\n \n\n\n \n\n\n$\n\n\n1.23\n\n\n \n\n\n\n\n\n\nFFO per common share – diluted (2) (3)\n\n\n \n\n\n$\n\n\n0.44\n\n\n \n\n\n \n\n\n$\n\n\n0.43\n\n\n \n\n\n \n\n\n$\n\n\n1.33\n\n\n \n\n\n \n\n\n$\n\n\n1.23\n\n\n \n\n\n\n\n \n(1)\nRelated to gains, impairments, depreciation on properties and gains/(losses) on sales of marketable securities and derivatives, where applicable.\n(2)\nReflects the potential impact of convertible preferred shares and certain units if converted to common stock at the beginning of the period. FFO available to the Company’s common shareholders would be increased by $2,186 and $2,464 for the three months ended September 30, 2025 and 2024, respectively. FFO available to the Company’s common shareholders would be increased by $6,233 and $7,370 for the nine months ended September 30, 2025 and 2024, respectively. The effect of other certain convertible units would have an anti-dilutive effect upon the calculation of FFO available to the Company’s common shareholders per share. Accordingly, the impact of such conversion has not been included in the determination of diluted FFO per share calculations.\n(3)\nIncludes merger-related charges of $25.2 million for the nine months ended September 30, 2024. \nSame Property Net Operating Income (“Same property NOI”)\nSame property NOI is a supplemental non-GAAP financial measure of real estate companies’ operating performance and should not be considered an alternative to net income in accordance with GAAP or as a measure of liquidity. The Company considers Same property NOI as an important operating performance measure frequently used by analysts and investors because it includes only the net operating income of operating properties that have been owned and stabilized by the Company for the entire current and prior year reporting periods. It excludes properties under redevelopment, development and pending stabilization; properties are deemed stabilized at the earlier of (i) reaching 90% leased or (ii) one year following a project’s inclusion in operating real estate. Same property NOI assists in eliminating disparities due to the development, redevelopment, acquisition and disposition of properties during the periods presented, and thus provides a more consistent performance measure for the comparison of the Company's properties.\n \n\n\n54\n\n\n\n\n \n\n\nSame property NOI is calculated using revenues from rental properties (excluding straight-line rent adjustments, lease termination fee income, net, and amortization of above/below-market rents), less charges for credit losses, operating and maintenance expense, real estate taxes and rent expense, plus the Company’s proportionate share of Same property NOI from unconsolidated real estate joint ventures, calculated on the same basis. The Company’s method of calculating Same property NOI available to the Company’s common shareholders, which may differ from methods used by other REITs and, accordingly, may not be comparable to such other REITs, discloses with and without the impact from development projects.\nThe following is a reconciliation of Net income available to the Company’s common shareholders to Same property NOI (in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet income available to the Company’s common shareholders\n\n\n \n\n\n$\n\n\n130,239\n\n\n \n\n\n \n\n\n$\n\n\n128,022\n\n\n \n\n\n \n\n\n$\n\n\n410,803\n\n\n \n\n\n \n\n\n$\n\n\n220,883\n\n\n \n\n\n\n\n\n\nAdjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nManagement and other fee income\n\n\n \n\n\n \n\n\n(4,748\n\n\n)\n\n\n \n\n\n \n\n\n(4,757\n\n\n)\n\n\n \n\n\n \n\n\n(14,331\n\n\n)\n\n\n \n\n\n \n\n\n(13,616\n\n\n)\n\n\n\n\n\n\nGeneral and administrative\n\n\n \n\n\n \n\n\n29,646\n\n\n \n\n\n \n\n\n \n\n\n33,850\n\n\n \n\n\n \n\n\n \n\n\n96,485\n\n\n \n\n\n \n\n\n \n\n\n103,238\n\n\n \n\n\n\n\n\n\nImpairment charges\n\n\n \n\n\n \n\n\n440\n\n\n \n\n\n \n\n\n \n\n\n375\n\n\n \n\n\n \n\n\n \n\n\n8,619\n\n\n \n\n\n \n\n\n \n\n\n4,277\n\n\n \n\n\n\n\n\n\nMerger charges\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n25,246\n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n158,269\n\n\n \n\n\n \n\n\n \n\n\n144,688\n\n\n \n\n\n \n\n\n \n\n\n473,045\n\n\n \n\n\n \n\n\n \n\n\n447,555\n\n\n \n\n\n\n\n\n\nGain on sale of properties\n\n\n \n\n\n \n\n\n(3,705\n\n\n)\n\n\n \n\n\n \n\n\n(551\n\n\n)\n\n\n \n\n\n \n\n\n(43,514\n\n\n)\n\n\n \n\n\n \n\n\n(944\n\n\n)\n\n\n\n\n\n\nOther expense/(income), net\n\n\n \n\n\n \n\n\n2,362\n\n\n \n\n\n \n\n\n \n\n\n(10,284\n\n\n)\n\n\n \n\n\n \n\n\n(757\n\n\n)\n\n\n \n\n\n \n\n\n(20,764\n\n\n)\n\n\n\n\n\n\nMortgage and other financing income, net\n\n\n \n\n\n \n\n\n(12,375\n\n\n)\n\n\n \n\n\n \n\n\n(11,919\n\n\n)\n\n\n \n\n\n \n\n\n(35,706\n\n\n)\n\n\n \n\n\n \n\n\n(19,189\n\n\n)\n\n\n\n\n\n\n(Gain)/loss on marketable securities, net\n\n\n \n\n\n \n\n\n(43\n\n\n)\n\n\n \n\n\n \n\n\n(79\n\n\n)\n\n\n \n\n\n \n\n\n(32\n\n\n)\n\n\n \n\n\n \n\n\n27,613\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n84,261\n\n\n \n\n\n \n\n\n \n\n\n76,216\n\n\n \n\n\n \n\n\n \n\n\n245,842\n\n\n \n\n\n \n\n\n \n\n\n224,122\n\n\n \n\n\n\n\n\n\n(Benefit)/provision for income taxes, net\n\n\n \n\n\n \n\n\n(875\n\n\n)\n\n\n \n\n\n \n\n\n128\n\n\n \n\n\n \n\n\n \n\n\n(45\n\n\n)\n\n\n \n\n\n \n\n\n72,355\n\n\n \n\n\n\n\n\n\nEquity in loss/(income) of other investments, net\n\n\n \n\n\n \n\n\n811\n\n\n \n\n\n \n\n\n \n\n\n(216\n\n\n)\n\n\n \n\n\n \n\n\n(1,637\n\n\n)\n\n\n \n\n\n \n\n\n(9,468\n\n\n)\n\n\n\n\n\n\nNet income attributable to noncontrolling interests\n\n\n \n\n\n \n\n\n2,280\n\n\n \n\n\n \n\n\n \n\n\n2,443\n\n\n \n\n\n \n\n\n \n\n\n5,922\n\n\n \n\n\n \n\n\n \n\n\n6,693\n\n\n \n\n\n\n\n\n\nPreferred dividends, net\n\n\n \n\n\n \n\n\n7,536\n\n\n \n\n\n \n\n\n \n\n\n7,961\n\n\n \n\n\n \n\n\n \n\n\n22,775\n\n\n \n\n\n \n\n\n \n\n\n23,864\n\n\n \n\n\n\n\n\n\nRPT same property NOI (1)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n606\n\n\n \n\n\n\n\n\n\nNon same property net operating income\n\n\n \n\n\n \n\n\n(26,504\n\n\n)\n\n\n \n\n\n \n\n\n(12,928\n\n\n)\n\n\n \n\n\n \n\n\n(70,034\n\n\n)\n\n\n \n\n\n \n\n\n(39,438\n\n\n)\n\n\n\n\n\n\nNon-operational expense from joint ventures, net\n\n\n \n\n\n \n\n\n21,003\n\n\n \n\n\n \n\n\n \n\n\n28,231\n\n\n \n\n\n \n\n\n \n\n\n74,913\n\n\n \n\n\n \n\n\n \n\n\n85,629\n\n\n \n\n\n\n\n\n\nSame property NOI\n\n\n \n\n\n$\n\n\n388,597\n\n\n \n\n\n \n\n\n$\n\n\n381,180\n\n\n \n\n\n \n\n\n$\n\n\n1,172,348\n\n\n \n\n\n \n\n\n$\n\n\n1,138,662\n\n\n \n\n\n\n\n(1)\nAmount represents the Same property NOI from RPT properties, not included in the Company's Net income available to the Company's common shareholders. \nSame property NOI increased by $7.4 million, or 1.9%, for the three months ended September 30, 2025, as compared to the corresponding period in 2024. This increase is primarily the result of (i) an increase of $7.8 million in minimum rent, primarily related to strong leasing activity, and (ii) an increase in other revenues of $1.2 million, partially offset by an increase in non-recoverable expenses of $1.3 million.\nSame property NOI increased by $33.7 million, or 3.0%, for the nine months ended September 30, 2025, as compared to the corresponding period in 2024. This increase is primarily the result of (i) an increase of $30.5 million in minimum rent, primarily related to strong leasing activity, and (ii) an increase in other revenues of $4.4 million, partially offset by an increase in non-recoverable expenses of $2.5 million.\nLeasing Activity\nDuring the nine months ended September 30, 2025, the Company executed 1,203 leases totaling 8.4 million square feet in the Company’s consolidated operating portfolio, comprised of 378 new leases and 825 renewals and options. The leasing costs associated with these new leases are estimated to aggregate $107.5 million, or $44.33 per square foot. These costs include $84.1 million of tenant improvements and $23.4 million of external leasing commissions. The average rent per square foot for (i) new leases was $22.96 and (ii) renewals and options was $20.76.\n\n\n55\n\n\n\n\n \n\n\nTenant Lease Expirations\nAt September 30, 2025, the Company has a total of 9,416 leases in its consolidated operating portfolio. The following table sets forth the aggregate lease expirations for each of the next ten years, assuming no renewal options are exercised. For purposes of the table, the Total Annual Base Rent Expiring represents annualized rental revenue, excluding the impact of straight-line rent, for each lease that expires during the respective year. Amounts in thousands, except for number of leases data:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ending \nDecember 31,\n\n\n \n\n\nNumber of Leases\n Expiring\n\n\n \n\n\n \n\n\nSquare Feet \nExpiring\n\n\n \n\n\n \n\n\nTotal Annual Base Rent Expiring\n\n\n \n\n\n \n\n\n% of Gross \nAnnual Rent\n\n\n \n\n\n\n\n\n\n(1)\n\n\n \n\n\n \n\n\n129\n\n\n \n\n\n \n\n\n \n\n\n464\n\n\n \n\n\n \n\n\n$\n\n\n8,864\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n\n\n\n\n2025\n\n\n \n\n\n \n\n\n137\n\n\n \n\n\n \n\n\n \n\n\n489\n\n\n \n\n\n \n\n\n$\n\n\n12,899\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n%\n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n1,078\n\n\n \n\n\n \n\n\n \n\n\n8,058\n\n\n \n\n\n \n\n\n$\n\n\n140,757\n\n\n \n\n\n \n\n\n \n\n\n9.3\n\n\n%\n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n1,381\n\n\n \n\n\n \n\n\n \n\n\n10,265\n\n\n \n\n\n \n\n\n$\n\n\n197,307\n\n\n \n\n\n \n\n\n \n\n\n13.0\n\n\n%\n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n1,429\n\n\n \n\n\n \n\n\n \n\n\n11,203\n\n\n \n\n\n \n\n\n$\n\n\n223,729\n\n\n \n\n\n \n\n\n \n\n\n14.8\n\n\n%\n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n1,287\n\n\n \n\n\n \n\n\n \n\n\n9,750\n\n\n \n\n\n \n\n\n$\n\n\n197,147\n\n\n \n\n\n \n\n\n \n\n\n13.0\n\n\n%\n\n\n\n\n\n\n2030\n\n\n \n\n\n \n\n\n1,132\n\n\n \n\n\n \n\n\n \n\n\n8,519\n\n\n \n\n\n \n\n\n$\n\n\n182,402\n\n\n \n\n\n \n\n\n \n\n\n12.0\n\n\n%\n\n\n\n\n\n\n2031\n\n\n \n\n\n \n\n\n685\n\n\n \n\n\n \n\n\n \n\n\n5,630\n\n\n \n\n\n \n\n\n$\n\n\n112,406\n\n\n \n\n\n \n\n\n \n\n\n7.4\n\n\n%\n\n\n\n\n\n\n2032\n\n\n \n\n\n \n\n\n461\n\n\n \n\n\n \n\n\n \n\n\n3,414\n\n\n \n\n\n \n\n\n$\n\n\n67,348\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n%\n\n\n\n\n\n\n2033\n\n\n \n\n\n \n\n\n473\n\n\n \n\n\n \n\n\n \n\n\n3,690\n\n\n \n\n\n \n\n\n$\n\n\n73,121\n\n\n \n\n\n \n\n\n \n\n\n4.8\n\n\n%\n\n\n\n\n\n\n2034\n\n\n \n\n\n \n\n\n434\n\n\n \n\n\n \n\n\n \n\n\n3,418\n\n\n \n\n\n \n\n\n$\n\n\n76,740\n\n\n \n\n\n \n\n\n \n\n\n5.1\n\n\n%\n\n\n\n\n\n\n2035\n\n\n \n\n\n \n\n\n375\n\n\n \n\n\n \n\n\n \n\n\n3,520\n\n\n \n\n\n \n\n\n$\n\n\n70,727\n\n\n \n\n\n \n\n\n \n\n\n4.7\n\n\n%\n\n\n\n\n \n(1)\nLeases currently under month-to-month lease or in process of renewal."
}