{
  "source_file": "klac-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nSPECIAL NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis report contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the “Securities Exchange Act”). All statements other than statements of historical fact may be forward-looking statements. You can identify these and other forward-looking statements by the use of words such as “may,” “will,” “could,” “would,” “should,” “expects,” “plans,” “anticipates,” “relies,” “believes,” “estimates,” “predicts,” “intends,” “potential,” “continues,” “thinks,” “seeks,” “commits”, or the negative of such terms, or other comparable terminology. Forward-looking statements also include the assumptions underlying or relating to any of the foregoing statements. Such forward-looking statements include those regarding, among others: the impact of tariffs on our business; forecasts of the future results of our operations, including profitability; orders for our products and capital equipment generally; sales of semiconductors; the investments by our customers in advanced technologies and new materials; growth of revenue in the semiconductor industry, the semiconductor capital equipment industry and our business; technological trends in the semiconductor industry; future developments or trends in the global capital and financial markets; our future product offerings and product features; the success and market acceptance of new products; timing of shipment of order backlog; our future product shipments and product and service revenues; our future gross margins; our future research and development (“R&D”) expenses and selling, general and administrative (“SG&A”) expenses; international sales and operations; our ability to maintain or improve our existing competitive position; success of our product offerings; creation and funding of programs for R&D; results of our investment in leading edge technologies; the effects of hedging transactions; the effect of the sale of trade receivables and promissory notes from customers; the effect of future compliance with laws and regulations; our future effective income tax rate; our recognition of tax benefits; the effects of any audits or litigation; future payments of dividends to our stockholders; the completion of any acquisitions of third parties, or the technology or assets thereof; benefits received from any acquisitions and development of acquired technologies; sufficiency of our existing cash balance, investments, cash generated from operations and the unfunded portion of our Revolving Credit Facility (as defined below in the “Revolving Credit Facility” section of “Liquidity and Capital Resources”) to meet our operating and working capital requirements, including debt service and payment thereof; future dividends, and stock repurchases; our compliance with the financial covenants under the Credit Agreement (as defined below in the “Revolving Credit Facility” section of “Liquidity and Capital Resources”) for our Revolving Credit Facility; the adoption of new accounting pronouncements; our repayment of our outstanding indebtedness; and our environmental, social and governance (“ESG”) related targets, goals and commitments.\nOur actual results may differ significantly from those projected in the forward-looking statements in this report. Factors that might cause or contribute to such differences include, but are not limited to:\n•\n Our vulnerability to a weakening in the condition of the financial markets and the global economy;\n•\nRisks related to our international operations;\n•\nEvolving Bureau of Industry and Security (“BIS”) of the U.S. Department of Commerce (“Commerce”) rules and regulations (the “BIS Rules”) and their impact on our ability to sell products to and provide services to certain customers in People’s Republic of China (“China”);\n•\nTariffs and other trade restrictions;\n•\nCostly intellectual property (“IP”) disputes that could result in our inability to sell or use the challenged technology;\n•\nRisks related to the legal, regulatory and tax environments in which we conduct our business;\n•\nDiffering stakeholder expectations, requirements and attention to ESG matters and the resulting costs, risks and impact on our business;\n•\nUnexpected delays, difficulties and expenses in executing against our environmental, climate, or other ESG targets, goals and commitments;\n•\nOur ability to attract, retain and motivate key personnel;\n•\nOur vulnerability to disruptions and delays at our third-party service providers;\n•\nCybersecurity threats, cyber incidents affecting our and our business partners\n’ s\nystems and networks;\n•\nOur inability to access critical information in a timely manner due to system failures;\n•\nRisks related to acquisitions, integrations, strategic alliances or collaborative arrangements;\n31\nTable of Contents\n•\nClimate change, earthquake, flood or other natural catastrophic events, public health crises or terrorism and the adverse impact on our business operations;\n•\nThe war between Ukraine and Russia, escalation of hostilities in the Middle East, and the significant military activity in those regions;\n•\nLack of insurance for losses and interruptions caused by terrorists and acts of war, and our self-insurance of certain risks including earthquake risk;\n•\nRisks related to fluctuations in foreign currency exchange rates;\n•\nRisks related to fluctuations in interest rates and the market values of our portfolio investments;\n•\nRisks related to tax and regulatory compliance audits;\n•\nAny change in taxation rules or practices and our effective tax rate;\n•\nCompliance costs with federal securities laws, rules, regulations, NASDAQ requirements, and evolving accounting standards and practices;\n•\nOngoing changes in the technology industry, and the semiconductor industry in particular, including future growth rates, pricing trends in end-markets, or changes in customer capital spending patterns; \n•\nOur vulnerability to a highly concentrated customer base;\n•\nThe cyclicality of the industries in which we operate; \n•\nOur ability to timely develop new technologies and products that successfully address changes in the industry;\n•\nRisks related to artificial intelligence (“AI”);\n•\nOur ability to maintain our technology advantage and protect proprietary rights;\n•\nOur ability to compete in the industry; \n•\nAvailability and cost of the materials and parts used in the production of our products; \n•\nOur ability to operate our business in accordance with our business plan;\n•\nRisks related to our debt and leveraged capital structure;\n•\nWe may not be able to declare cash dividends at all or in any particular amount; \n•\nLiability to our customers under indemnification provisions if our products fail to operate properly or contain defects or our customers are sued by third parties due to our products;\n•\nOur government funding for R&D is subject to audit, and potential termination or penalties;\n•\nWe may incur significant restructuring charges or other asset impairment charges or inventory write offs; \n•\nWe are subject to risks related to receivables factoring arrangements and compliance risk of certain settlement agreements with the government; and\n•\nRisks related to the Court of Chancery of the State of Delaware being the sole and exclusive forum for certain actions and proceedings.\nFor a more detailed discussion of these and other risk factors that might cause or contribute to differences from the forward-looking statements in this report, see Part II, Item 1A “Risk Factors” in this report as well as Part I, Item 1 “Business”, Part I, Item 1A \"Risk Factors\" and Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended June 30, 2025. You should carefully review these risks and also review the risks described documents we file from time to time with the Securities and Exchange Commission. You are cautioned not to place undue reliance on these forward-looking statements, and we expressly assume no obligation and do not intend to update the forward-looking statements in this report after the date hereof.\nEXECUTIVE SUMMARY\nWe are a leading supplier of process control and yield management solutions and services for the semiconductor and related electronics industries. Our broad portfolio of inspection and metrology products, and related service, software and other offerings, support R&D and manufacturing of integrated circuits (“IC”), wafers and reticles. Our products, services and expertise are used by our customers to measure, detect, analyze and resolve critical and nanometric level product defects, helping them to manage manufacturing process challenges and to obtain higher finish product yields at lower cost. We also offer advanced technology solutions to address various manufacturing needs of printed circuit boards (“PCB”), specialty semiconductor devices and other electronic components, including advanced packaging, light-emitting diode (“LED”), power devices, compound semiconductor, and data storage industries, as well as general materials research. In addition, our services business has grown consistently year-over-year and accounted for approximately 23% of our total revenues in the first quarter of fiscal 2026. Our services revenue, which is generated largely from recurring “subscription-like” contracts, increases the value of our contract offerings and extension of system lifetimes resulting from growth in legacy semiconductor markets.\n32\nTable of Contents\nWe are organized into three reportable segments as follows:\n•\nSemiconductor Process Control: a comprehensive portfolio of inspection, metrology and data analytics products as well as related service offerings that help IC manufacturers achieve target yields throughout the semiconductor fabrication process, from R&D to final volume production.\n•\nSpecialty Semiconductor Process: advanced vacuum deposition and etching process tools used by a broad range of specialty semiconductor customers.\n•\nPCB and Component Inspection: a range of inspection, testing and measurement, and direct imaging for patterning products used by manufacturers of PCBs, advanced packaging, microelectromechanical systems (“MEMS”) and other electronic components.\nThe semiconductor industry continues to experience significant market expansion and diversification. High-performance computing and data centers, fueled by widespread adoption of AI, are driving industry growth. We believe AI is a technology inflection point driving innovation and demand at the leading edge, and our portfolio of products is uniquely positioned to support leading-edge demand and the ongoing AI buildout. Our semiconductor customers generally operate in one or both of the major semiconductor device manufacturing markets: memory and foundry/logic. End-market demand drivers that are expected to continue to benefit KLA in the long term include adoption of extreme ultraviolet lithography (\"EUV\") in high volume manufacturing for Logic and DRAM memory (including high-bandwidth memory), which drives new process control requirements and growth in key markets for KLA. Demand for advanced semiconductor technologies, particularly evident in the 2-nanometer node, which is seeing higher levels of investment and process control intensity, continues to drive investments in AI. Increasing complexity and value of semiconductor packages, particularly for AI and high-performance computing applications, is also driving significant growth in our advanced packaging business. The digitization of all industries, including 5G markets, advances in healthcare and industrial applications, together with the increasing adoption of electric vehicles and intelligence in automobiles, are powering leading-edge design node technology investments and capacity expansions.\nWhile we continue to invest in technological innovation, factors such as delays from customers in adopting new chips and technology methods could impact process control capital intensity. Pushouts or cancellations of deliveries to our customers could cause earnings volatility, due to the timing of revenue recognition as well as increased risk of inventory-related charges. Geopolitical factors, such as government regulations and tariffs, have had an adverse impact on our results of operations. However, despite these headwinds, our gross margin and overall financial performance improved in the three months ended September 30, 2025 compared to the three months ended September 30, 2024.\nWe are continuously assessing the aggregate potential impact of government regulations and tariffs on our financial results and operations. See Part II, Item 1A \"Risk Factors\" below, and also Part I, Item 1A “Risk Factors” in our Annual Report on Form 10-K for our fiscal year ended June 30, 2025 for more information regarding how such actions by the U.S. government or another country could significantly impact our ability to provide our products and services to existing and potential customers, especially in China, and adversely affect our business, financial condition and results of operations.\nThe following table sets forth some of our key quarterly unaudited financial information:\n(Dollar amounts in thousands, except net income per share)\nThree Months Ended\nSeptember 30,\n2025\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nTotal revenues\n$\n3,209,696\n$\n3,174,741\n$\n3,063,029\n$\n3,076,851\n$\n2,841,541\nCosts of revenues\n$\n1,243,070\n$\n1,207,286\n$\n1,175,689\n$\n1,221,461\n$\n1,147,431\nGross margin\n61.3%\n62.0%\n61.6%\n60.3%\n59.6%\nNet income\n(1)(2)\n$\n1,121,040\n$\n1,202,849\n$\n1,088,416\n$\n824,527\n$\n945,851\nDiluted net income per share\n(3)\n$\n8.47\n$\n9.06\n$\n8.16\n$\n6.16\n$\n7.01\n__________________\n(1)\nFor the explanation why our net income increased to $1.12 billion in the three months ended September 30, 2025 compared to the three months ended September 30, 2024, refer to the “Results of Operations” section below, as the change is a result of movements in various income statement line items.\n(2)\nOur net income for the three months ended December 31, 2024 included pre-tax goodwill and purchased intangible assets impairment charges of $239.1 million. For additional details, refer to Note 6 “Goodwill and Purchased Intangible Assets” in the Notes to the Consolidated Financial Statements and Note 7 “Goodwill and Purchased Intangible Assets” to our Consolidated Financial Statements included in our Annual Report on Form 10-K for the fiscal year ended June 30, 2025.\n33\nTable of Contents\n(3)\nDiluted net income per share is computed independently for each of the quarters presented based on the weighted-average fully diluted shares outstanding for each quarter. Therefore, the sum of quarterly diluted net income per share information may not equal annual (or other multiple-quarter calculations of) diluted net income per share.\nWe continue to focus on returning cash to our investors, making $545.1 million in share repurchases and paying $254.0 million in dividends in the three months ended September 30, 2025. We increased the dividend in the fourth quarter of fiscal 2025 to $1.90 per share per quarter, which was our 16th consecutive annual dividend increase. Refer to the “Liquidity and Capital Resources” section below for more information on our strong cash flow generation and strategy of returning excess cash to our stockholders.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Condensed Consolidated Financial Statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions in applying our accounting policies that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. We base these estimates and assumptions on historical experience and evaluate them on an ongoing basis to ensure that they remain reasonable under current conditions. Actual results could differ from those estimates.\nThere have been no material changes in our critical accounting estimates since our Annual Report on Form 10-K for the fiscal year ended June 30, 2025. Refer to “Management’s Discussion and Analysis of Financial Condition and Results of Operations” contained in Part II, Item 7 of our Annual Report on Form 10-K for our fiscal year ended June 30, 2025 for a complete description of our critical accounting estimates.\nRecent Accounting Pronouncements\nFor a description of recent accounting pronouncements, including those recently adopted and the expected dates of adoption as well as estimated effects, if any, on our Condensed Consolidated Financial Statements of those not yet adopted, see Note 1 “Basis of Presentation” to our Condensed Consolidated Financial Statements.\nRESULTS OF OPERATIONS\nRevenues and Gross Margin\n \nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n(Dollar amounts in thousands)\n2025\n2024\nRevenues:\nProduct\n$\n2,465,006\n$\n2,197,389\n$\n267,617 \n12 \n%\nService\n744,690\n644,152\n100,538 \n16 \n%\nTotal revenues\n$\n3,209,696\n$\n2,841,541\n$\n368,155 \n13 \n%\nCosts of revenues\n$\n1,243,070\n$\n1,147,431\n$\n95,639 \n8 \n%\nGross margin\n61.3%\n59.6%\nOur business is affected by the concentration of our customer base and our customers’ capital equipment procurement schedules as a result of their investment plans. Our product revenues in any particular period are impacted by the amount of new orders we receive during that period and, depending upon the duration of manufacturing and installation cycles, in the preceding periods. Revenue is also impacted by average customer pricing, customer revenue deferrals associated with volume purchase agreements, the effect of fluctuations in foreign currency exchange rates, increased trade restrictions and the availability of government incentives for semiconductor capital investments.\n \nService revenues are generated from product maintenance and support services, as well as billable time and material service calls made to our customers. The amount of our service revenues is typically a function of the number of systems installed at our customers’ sites and the utilization of those systems, but it is also impacted by other factors, such as our rate of service contract renewals, the types of systems being serviced and fluctuations in foreign currency exchange rates. A significant portion of our revenues continues to be generated in Asia, where a substantial portion of the world’s semiconductor manufacturing capacity is located, and we expect that trend to continue.\nThe increase in total revenues by 13% in the \nthree months ended September 30, 2025\n compared to \nthe three months ended September 30, 2024\n is primarily attributable to the increase in our product revenues and is due to increased investments by leading edge foundries driven by the AI infrastructure buildout, increased demand for DRAM led by high-bandwidth \n34\nTable of Contents\nmemory, strong customer adoption of our advanced packaging portfolio of products, and strong demand for many of our products, especially those in our inspection portfolio.\nThe increase in service revenues by 16% in the \nthree months ended September 30, 2025\n compared to \nthe three months ended September 30, 2024\n is primarily attributable to the growth of our installed base.\nRevenues by segment\n(1)\n \nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n(Dollar amounts in thousands)\n2025\n2024\nRevenues:\nSemiconductor Process Control\n$\n2,899,392 \n$\n2,575,151 \n$\n324,241 \n13 \n%\nSpecialty Semiconductor Process\n119,755 \n128,334 \n(8,579)\n(7)\n%\nPCB and Component Inspection\n189,488 \n137,983 \n51,505 \n37 \n%\nTotal revenues for reportable segments\n$\n3,208,635 \n$\n2,841,468 \n$\n367,167 \n13 \n%\n________________\n(1)\nSegment revenues exclude corporate allocations and the effects of changes in foreign currency exchange rates. For additional details, refer to Note 16 “Segment Reporting and Geographic Information” to our Condensed Consolidated Financial Statements.\nThe primary factors impacting the performance of our segment revenues are summarized as follows:\n•\nRevenues from our \nSemiconductor Process Control\n segment during the three months ended September 30, 2025 increased by\n 13%, \ncompared to the three months ended September 30, 2024, primarily \ndue strong demand for many of our products, especially those in our inspection and metrology portfolios, along with higher service revenue from an increase in our installed base. Semiconductor Process Control segment revenues were approximately 90% of total company revenue in the three\n months ended September 30, 2025, which is consistent with the segment's approximately \n91% of total company revenues in the\n \nthree \nmonths ended September 30, 2024. \n•\nRevenues in the Specialty Semiconductor Process segment, which comprises etching and deposition solutions for advanced packaging and specialty semiconductor markets, during the \nthree\n months ended September 30, 2025 decreased by \n7%\n compared to the \nthree \nmonths ended September 30, 2024, primarily due to lower volume of products sold as a result of customer pushouts, partially offset by higher service revenue from an increase in our installed base. Specialty Semiconductor Process revenues were approximately \n4% of total revenues \nduring the \nthree\n months ended September 30, 2025 and approximately \n5% of total revenues during the\n \nthree \nmonths ended September 30, 2024.\n•\nRevenues in the PCB and Component Inspection\n segment during the three months ended September 30, 2025 \nincreased\n by 37% compared to the three months ended September 30, 2024\n, primarily \ndue to increased revenue from advanced packaging products related to AI, along with higher service revenue from an increasing number of tools in our installed base. The increase was slightly offset by a decrease in Display revenue, a business that we exited in the prior fiscal year. PCB and Component Inspection segment revenues were approximately 6% of total revenues during the three months ended September 30, 2025, and approximately 5% of total revenues during the three months ended September 30, 2024.\n35\nTable of Contents\nThe following is a summary of revenues by major product categories for the indicated periods:\n(Dollar amounts in thousands)\nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n2025\n2024\nRevenues:\nWafer Inspection\n$\n1,537,244 \n48 \n%\n$\n1,368,943 \n48 \n%\n$\n168,301 \n12 \n%\nPatterning\n667,427 \n21 \n%\n576,409 \n20 \n%\n91,018 \n16 \n%\nSpecialty Semiconductor Process\n100,219 \n3 \n%\n112,802 \n4 \n%\n(12,583)\n(11)\n%\nPCB and Component Inspection\n117,298 \n4 \n%\n72,908 \n3 \n%\n44,390 \n61 \n%\nServices\n744,690 \n23 \n%\n644,152 \n23 \n%\n100,538 \n16 \n%\nOther\n42,818 \n1 \n%\n66,327 \n2 \n%\n(23,509)\n(35)\n%\nTotal\n$\n3,209,696 \n100 \n%\n$\n2,841,541 \n100 \n%\n$\n368,155 \n13 \n%\nRevenues by region\nThe following is a summary of revenues by geographic region, based on ship-to location, for the indicated periods: \nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n(Dollar amounts in thousands)\n2025\n2024\nRevenues:\nChina\n$\n1,267,156 \n39.5 \n%\n$\n1,198,305 \n42.2 \n%\n$\n68,851 \n6 \n%\nTaiwan\n793,608 \n24.7 \n%\n461,991 \n16.3 \n%\n331,617 \n72 \n%\nKorea\n299,373 \n9.3 \n%\n238,673 \n8.4 \n%\n60,700 \n25 \n%\nNorth America\n297,907 \n9.3 \n%\n500,943 \n17.6 \n%\n(203,036)\n(41)\n%\nJapan\n295,209 \n9.2 \n%\n188,569 \n6.6 \n%\n106,640 \n57 \n%\nEurope and Israel\n150,976 \n4.7 \n%\n144,820 \n5.1 \n%\n6,156 \n4 \n%\nRest of Asia\n105,467 \n3.3 \n%\n108,240 \n3.8 \n%\n(2,773)\n(3)\n%\nTotal\n$\n3,209,696 \n100.0 \n%\n$\n2,841,541 \n100.0 \n%\n$\n368,155 \n13 \n%\nRevenues from our customers in Taiwan increased 72% in the three months ended September 30, 2025, compared to the three months ended September 30, 2024, due to increased investments in process control to meet leading-edge demand driven by innovation and growth of AI. The total revenue share from Taiwan increased to 24.7% from 16.3% and was the primary driver for our total revenue increase between the indicated periods. Revenues from our customers in China increased 6% in the three months ended September 30, 2025, compared to the three months ended September 30, 2024, primarily due to continuing legacy node demand, partially offset by the effects of U.S. export controls and regulations. Leading-edge project buildouts in foundry/logic by customers in Japan contributed to a 57% increase in revenues from this region between the indicated periods, while revenues from customers in North America decreased 41% due to lower shipments to foundry/logic customers.\nGross margin\nOur gross margin fluctuates with revenue levels and product mix and is affected by variations in costs related to manufacturing and servicing our products, including our ability to scale our operations efficiently and effectively in response to prevailing business conditions.\nThe following table summarizes the major factors that contributed to the changes in gross margin:\nGross Margin\nThree Months Ended\nSeptember 30, 2024\n59.6%\nRevenue volume of products and services\n0.6%\nMix of products and services sold\n1.8%\nManufacturing labor, overhead and efficiencies\n—%\nOther service and manufacturing costs\n(0.7)%\nSeptember 30, 2025\n61.3%\n36\nTable of Contents\nChanges in gross margin from revenue volume of products and services reflect our ability to leverage existing infrastructure to generate higher revenues. Changes in gross margin from the mix of products and services sold reflect the impact of changes within the composition of product and service offerings. Changes in gross margin from manufacturing labor, overhead and efficiencies reflect our ability to manage costs and drive productivity as we scale our manufacturing activity to respond to customer requirements and amortization of intangible assets. Manufacturing labor, overhead and efficiencies included higher employee-related costs due to increases in headcount offset by absorption benefits from stronger build plans. Changes in gross margin from other service and manufacturing costs include the impact of tariffs, customer support costs, including the efficiencies with which we deliver services to our customers, and the effectiveness with which we manage our production plans and inventory risk.\nResearch and Development\nR&D expenses may fluctuate with product development phases and project timing as well as our R&D efforts. As technological innovation is essential to our success, we may incur significant costs associated with R&D projects, including compensation for engineering talent, engineering material costs and other expenses.\n(Dollar amounts in thousands)\nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n2025\n2024\nR&D expenses\n$\n360,461\n$\n323,145\n$\n37,316 \n12 \n%\nR&D expenses as a percentage of total revenues\n11 \n%\n11 \n%\nR&D expenses during the three months ended September 30, 2025 increased compared to the three months ended September 30, 2024 primarily due to an increase in employee-related expenses of $25.6 million as a result of additional headcount as well as higher employee compensation and benefit costs and an increase in engineering project material costs of $11.7 million.\nOur future operating results will depend significantly on our ability to make products and provide services that have a competitive advantage in our marketplace. To do this, we believe that we must continue to make substantial and focused investments in our R&D. We remain committed to product development in new and emerging technologies.\nSelling, General and Administrative\nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n(Dollar amounts in thousands)\n2025\n2024\nSG&A expenses\n$\n268,988\n$\n251,042\n$\n17,946 \n7 \n%\nSG&A expenses as a percentage of total revenues\n8 \n%\n9 \n%\nSG&A expenses during the three months ended September 30, 2025 increased compared to the three months ended September 30, 2024 primarily due to increases in the following areas: supplies and materials expense of $7.4 million, facilities-related expense of $6.4 million, and depreciation expense of $4.3 million.\nRestructuring Charges\nRestructuring charges were $0.4 million and $2.9 million for the three months ended September 30, 2025 and 2024, respectively. For additional information, refer to Note 17 “Restructuring Charges” to our Condensed Consolidated Financial Statements.\nInterest Expense and Other Expense (Income), Net\nOther expense (income), net is comprised primarily of fair value adjustments and realized gains or losses on sales of marketable and non-marketable securities, gains or losses from revaluations of certain foreign currency denominated assets and liabilities as well as foreign currency contracts, interest-related accruals (such as interest and penalty accruals related to our tax obligations) and interest income earned on our invested cash, cash equivalents and marketable securities.\n(Dollar amounts in thousands)\nThree Months Ended September 30,\nQ1 FY26\nvs.\nQ1 FY25\n2025\n2024\nInterest expense\n$\n71,075\n$\n82,171\n$\n(11,096)\n(14)\n%\nOther expense (income), net\n$\n(43,374)\n$\n(40,935)\n$\n(2,439)\n(6)\n%\nInterest expense as a percentage of total revenues\n2 \n%\n3 \n%\nOther expense (income), net as a percentage of total revenues\n(1)\n%\n(1)\n%\n37\nTable of Contents\nInterest expense during the three months ended September 30, 2025 decreased compared to the three months ended September 30, 2024 primarily due to reduced interest expense following our $750.0 million debt repayment in the second quarter of fiscal 2025.\nThe change in other expense (income), net during the three months ended September 30, 2025 compared to the three months ended September 30, 2024 was primarily due to a net fair value gain of $8.7 million from an equity security and favorable foreign exchange fluctuations of $6.3 million, partially offset by lower interest income of $10.3 million.\nProvision for Income Taxes\nThe following table provides details of income taxes:\nThree Months Ended September 30,\n(Dollar amounts in thousands)\n2025\n2024\nIncome before income taxes\n$\n1,309,476\n$\n1,078,687\nProvision for income taxes\n$\n188,436\n$\n132,836\nEffective tax rate\n14.4 \n%\n12.3 \n%\nThe effective tax rate during the three months ended September 30, 2025 was higher compared to the three months ended September 30, 2024, primarily due to the impact of the One Big Beautiful Bill Act (“OBBBA”), also known as the Tax Relief for American Families and Workers Act of 2025 that was signed into law on July 4, 2025. The main impact of OBBBA for us in the year ending June 30, 2026, is restoring full expensing of domestic research expenses. The immediate expensing of domestic research is decreasing our taxable income, resulting in a lower cash tax liability and higher effective tax rate due to the reduction of our Foreign Derived Intangible Income benefit during the three months ended September 30, 2025.\nOur future effective income tax rate depends on various factors, such as tax legislation, the geographic composition of our pre-tax income, the amount of our pre-tax income as business activities fluctuate, non-deductible expenses incurred in connection with acquisitions, R&D credits as a percentage of aggregate pre-tax income, non-taxable or non-deductible increases or decreases in the assets held within our Executive Deferred Savings Plan, the tax effects of employee stock activity and the effectiveness of our tax planning strategies. We also continue to monitor the adoption of Pillar Two relating to the global minimum tax in each of our tax jurisdictions to evaluate its impact on our effective income tax rate. For some of the jurisdictions that have adopted Pillar Two in their tax legislation, it was effective for us beginning in our fiscal year ended June 30, 2025.\nFor discussions on tax examinations, assessments and certain related proceedings, see Note 12 “Income Taxes” to our Condensed Consolidated Financial Statements.\nLIQUIDITY AND CAPITAL RESOURCES\nAs of\nAs of\n(Dollar amounts in thousands)\nSeptember 30, 2025\nJune 30, 2025\nCash and cash equivalents\n$\n1,946,211\n$\n2,078,908\nMarketable securities\n2,737,380\n2,415,715\nTotal cash, cash equivalents and marketable securities\n$\n4,683,591\n$\n4,494,623\nPercentage of total assets\n29 \n%\n28 \n%\n \nThree Months Ended September 30,\n(In thousands)\n2025\n2024\nCash flows:\nNet cash provided by operating activities\n$\n1,161,591\n$\n995,238\nNet cash used in investing activities\n(409,988)\n(171,039)\nNet cash used in financing activities\n(881,799)\n(837,708)\nEffect of exchange rate changes on cash and cash equivalents\n(2,501)\n13,582\nNet increase (decrease) in cash and cash equivalents\n$\n(132,697)\n$\n73 \n38\nTable of Contents\nCash, Cash Equivalents and Marketable Securities\nAs of September 30, 2025, our cash, cash equivalents and marketable securities totaled $4.68 billion, compared to the $4.49 billion balance as of June 30, 2025. Refer to below discussions of sources and uses of cash during the three months ended September 30, 2025. As of September 30, 2025, $1.1 million of our $4.68 billion of cash, cash equivalents and marketable securities were held by our foreign subsidiaries and branch offices. We have recorded appropriate provisions for income or withholding taxes that may result from future repatriations of this balance.\nCash Flows Provided by Operating Activities\nWe typically finance our liquidity requirements through cash generated from our operations. Net cash provided by operating activities during the three months ended September 30, 2025 was $1.16 billion compared to $995.2 million during the three months ended September 30, 2024. This increase was primarily due to an increase in customer and other collections of approximately $515 million primarily driven by higher shipments; partially offset by increases in accounts payable payments of approximately $230 million and employee-related payments of approximately $55 million.\nCash Flows Used in Investing Activities\nNet cash used in investing activities during the three months ended September 30, 2025 was $410.0 million compared to $171.0 million during the three months ended September 30, 2024. This increase in cash used was primarily due to increases in net purchases of available-for-sale securities of $206.4 million, and capital expenditures of $35.5 million.\nCash Flows Used in Financing Activities\nNet cash used in financing activities during the three months ended September 30, 2025 was $881.8 million compared to $837.7 million during the three months ended September 30, 2024. This increase in cash used was primarily due to increases in payment of dividends and dividend equivalents of $55.9 million and tax withholding payments related to vested and released restricted stock units (“RSU”) of $8.9 million, partially offset by a decrease in common stock repurchases of $22.3 million.\nStock Repurchases\nThe shares of common stock repurchased under our stock repurchase program have reduced our basic and diluted weighted-average shares outstanding for the three months ended September 30, 2025 and 2024. The total amount of stock repurchases during the three months ended September 30, 2025 and 2024 were $545.1 million and $567.4 million, respectively. The stock repurchase program is intended, in part, to mitigate the potential dilutive impact related to our equity incentive plans and shares issued in connection with our Employee Stock Purchase Program as well as to return excess cash to our stockholders. As of September 30, 2025, an aggregate of $4.47 billion was available for repurchase under our stock repurchase program, which reflects an increase in the authorized repurchase amount of $5.00 billion in the fourth quarter of fiscal 2025.\nCash Dividends\nDuring the three months ended September 30, 2025, our Board of Directors declared a regular quarterly cash dividend of $1.90 per share on our outstanding common stock, which was paid on September 3, 2025 to our stockholders of record as of the close of business on August 18, 2025. During the same period in fiscal year ended June 30, 2025, our Board of Directors declared and paid a regular quarterly cash dividend of $1.45 per share on our outstanding common stock. The total amount of regular quarterly cash dividends and dividend equivalents paid during the three months ended September 30, 2025 and 2024 was $254.0 million and $198.1 million, respectively. The amount of accrued dividend equivalents payable for regular quarterly cash dividends on unvested RSUs with dividend equivalent rights as of September 30, 2025 and June 30, 2025 was $11.8 million and $13.3 million, respectively. These amounts will be paid upon vesting of the underlying unvested RSUs as described in Note 9 “Equity and Long-term Incentive Compensation Plans” to our Condensed Consolidated Financial Statements.\nSenior Notes\n As of September 30, 2025, we had an aggregate principal amount of senior, unsecured notes totaling $5.95 billion (collectively, “Senior Notes”) with due dates ranging from fiscal 2029 through fiscal 2063. For additional information on these Senior Notes, see Note 7 “Debt” to our Condensed Consolidated Financial Statements. As of September 30, 2025, we were in compliance with all of our covenants under the Indenture associated with the Senior Notes.\nRevolving Credit Facility\nWe have in place a Credit Agreement (“Credit Agreement”) for an unsecured Revolving Credit Facility (“Revolving Credit Facility”) with a maturity date of July 3, 2030 that allows us to borrow up to $1.50 billion. Subject to the terms of the \n39\nTable of Contents\nCredit Agreement, the Revolving Credit Facility may be increased by an amount up to $500.0 million in the aggregate. As of September 30, 2025, we had no outstanding borrowings under the Revolving Credit Facility. We were in compliance with all covenants under the Credit Agreement as of September 30, 2025 (the net leverage ratio was 0.57 to 1.00, compared to a maximum net leverage ratio of 3.25 to 1.00 on a quarterly basis covering the trailing four consecutive fiscal quarters for each fiscal quarter). Considering our current liquidity position, short-term financial forecasts and ability to prepay the Revolving Credit Facility, if necessary, we expect to continue to be in compliance with our financial covenants at the end of our fiscal year ending June 30, 2026.\nFor additional information on the Revolving Credit Facility, see Note 7 “Debt” to our Condensed Consolidated Financial Statements.\nMaterial Cash Requirements\nFor details regarding our debt and other material cash commitments, refer to Note 7 “Debt” and Note 14 “Commitments and Contingencies,” respectively, to our Condensed Consolidated Financial Statements. For additional details regarding our material cash requirements, refer to “Material Cash Requirements” in the “Liquidity and Capital Resources” section of Part II, Item 7 “Management's Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report Form on 10-K for the fiscal year ended June 30, 2025. \nOff-Balance Sheet Arrangements\nAs of September 30, 2025, we did not have any off-balance sheet arrangements that have or are reasonably likely to have a current or future effect on our financial position, changes in financial condition, revenues and expenses, results of operations, liquidity, capital expenditures or capital resources that are material to investors. Refer to Note 14 “Commitments and Contingencies” to our Condensed Consolidated Financial Statements for information related to indemnification obligations.\nWorking Capital\n \nWorking capital was $6.85 billion as of September 30, 2025, which represents an increase of $238.2 million compared to our working capital of $6.61 billion as of June 30, 2025. As of September 30, 2025, our principal sources of liquidity consisted of $4.68 billion of cash, cash equivalents and marketable securities, as well as $1.50 billion availability under our Revolving Credit Facility. Our liquidity may be affected by many factors, some of which are based on the normal ongoing operations of the business, spending for business acquisitions, and other factors such as uncertainty in the global and regional economies and the semiconductor, semiconductor-related and electronic device industries. Although cash requirements will fluctuate based on the timing and extent of these factors, we believe that cash generated from operations, together with the liquidity provided by existing cash and cash equivalents balances, marketable securities and our Revolving Credit Facility, will be sufficient to satisfy our liquidity requirements associated with working capital needs, capital expenditures, cash dividends, stock repurchases and other contractual obligations for at least the next 12 months.\nCredit Ratings\nOur credit ratings as of September 30, 2025 are summarized below:\nRating Agency\nRating\nFitch Inc.\nA\nMoody’s Investors Service\nA2\nS&P Global Ratings\nA-\nFactors that can affect our credit ratings include changes in our operating performance, the economic environment, conditions in the semiconductor and semiconductor capital equipment industries, our financial position, material acquisitions and changes in our business strategy."
}