{
  "source_file": "kmb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction\nThis Management's Discussion and Analysis (\"MD&A\") of Financial Condition and Results of Operations is intended to provide investors with an understanding of our recent performance, financial condition, cash flows and future prospects. The following MD&A should be read in conjunction with our Annual Report on Form 10-K for the year ended December 31, 2024 and the Unaudited Interim Condensed Consolidated Financial Statements and related notes contained in this Quarterly Report on Form 10-Q. \nOur analysis compares results for the \nthree and nine months ended September 30, 2025 to the same period in 2024. As discussed in the Notes to the Unaudited Interim Condensed Consolidated Financial Statements, the results and related assets and liabilities of the IFP Business are reported as discontinued operations. As a result, unless specifically stated, all discussions included below reflect continuing operations for all periods presented. Amounts are reported in millions of dollars, except per share amounts, unless otherwise noted. The following will be discussed and analyzed:\n•\nOverview of Business and Recent Developments\n•\nResults of Operations\n•\nLiquidity and Capital Resources\nThroughout this MD&A, we refer to financial measures that have not been calculated in accordance with accounting principles generally accepted in the U.S., or GAAP, and are therefore referred to as non-GAAP financial measures. We believe these measures provide our investors with additional information about our underlying results and trends, as well as insight to some of the financial measures used to evaluate management. For additional information and reconciliations to the most closely comparable financial measures presented in our Condensed Consolidated Financial Statements, which are calculated in accordance with U.S. GAAP, see \"Summary of Non-GAAP Financial Measures\" below.\nOverview of Business and Recent Developments\nWe are a global company focused on delivering products and solutions that provide better care for a better world, \nwith manufacturing facilities in 30 countries, including our equity affiliates, and products sold in more than 175 countries and territories. Our products are sold under well-known brands such as Kleenex, Scott, Huggies, Pull-Ups, Kotex and Depend. \nChanges to U.S. trade policy, including increasing tariffs on imports have led to significant volatility and uncertainty in global markets. We estimate that the incremental costs of the new tariffs that are currently in effect in the U.S., as well as in other markets in which we operate, to be approximately $100 in 2025, most of which will be incurred by the North America segment. We are continuing to evaluate these developments and our ability to offset a portion of these costs to mitigate the impact on our business, consolidated results of operations, and financial condition.\nInternational Family Care and Professional (\"IFP\") Transaction\nOn June 5, 2025, we announced that the Company will form a joint venture with Suzano S.A. (\"Suzano\") and Suzano International Holding B.V., a wholly-owned subsidiary of Suzano (\"Buyer\"), comprised of substantially all the operations of the Company's former IFP segment (the \"IFP Business\"). To facilitate this transaction, we entered into an Equity and Asset Purchase Agreement (the \"Purchase Agreement\") with Buyer, pursuant to which we will, among other things, effectuate a reorganization through the transfer of certain assets, liabilities and equity interests of the IFP Business to Kimberly-Clark IFP NewCo B.V., an indirect wholly-owned subsidiary of the Company (the \"Joint Venture\"). At the time of closing, which is expected to take place in mid-2026 and will only take place following the satisfaction of consultation requirements and customary closing conditions, including obtaining required regulatory approvals, Buyer will acquire a 51% interest in the Joint Venture for a purchase price of approximately $1.7 billion, subject to certain closing adjustments set forth in the Purchase Agreement, and we will retain a 49% equity interest (the \"IFP Transaction\"). As a result, the results of operations and applicable assets and liabilities of the IFP Business are reported as discontinued operations in the Company's financial statements for all periods presented and the Company has ceased depreciating and amortizing the long-lived assets of the IFP Business. See Item 1, Notes 1 and 3 to the Unaudited Interim Condensed Consolidated Financial Statements for further details.\nAs a result of the IFP Transaction discussed above and the changes to our reportable segments effective in the fourth quarter of 2024 (refer to our Annual Report on Form 10-K for further details), the Company's continuing operations are now organized into two reportable segments defined by geographic region: North America (\"NA\") \n21\nand International Personal Care (\"IPC\"). The results of the IFP Business, including certain costs that were previously allocated to the IPC segment that relate to assets or activities that are part of the IFP Transaction, are reported as discontinued operations and excluded from segment results for all periods presented. Additionally, certain operations and commercial activities of the former IFP segment retained by the Company are now reported in the NA and IPC segments. Further, Corporate and Other was updated for all periods presented to include the following:\n•\nOperations of the former IFP segment that were divested prior to the IFP Transaction and therefore not reported as discontinued operations.\n•\nCosts previously allocated to the former IFP segment that are not directly attributable to the operations included in the IFP Transaction and therefore are not reported as discontinued operations. \nSegments are described in greater detail in Item 1, Note 11 to the Unaudited Interim Condensed Consolidated Financial Statements.\n2024 Transformation Initiative \nThe 2024 Transformation Initiative is designed to sharpen our strategic focus through a new operating model that leverages three synergistic forces:\n•\nAccelerating pioneering innovation to capture significant growth available in our categories by investing in science and technology to satisfy unmet and evolving consumer needs;\n•\nOptimizing our margin structure to deliver superior consumer propositions and implement initiatives and deploy technology and data analytics designed to create a fast, adaptable, integrated supply chain with greater visibility that can deliver continuous improvement; and\n•\nWiring our organization for growth to drive agility, speed, and focused execution that extends our competitive advantages further into the future and improves the efficiency of our corporate and regional overhead cost structures.\nThe transformation is expected to impact our organization in all major geographies, and workforce reductions are expected to be in the range of 4%\n \nto 5%. Certain actions under the 2024 Transformation Initiative are being finalized for implementation, and accounting for such actions will commence when the actions are authorized for execution. The 2024 Transformation Initiative is expected to be completed by the end of 2026. Total pre-tax savings are expected to be $3.0 billion in gross productivity; inclusive of input cost and manufacturing cost savings, and $200 in selling, general and administrative expenses. Total costs are anticipated to be approximately $1.5 billion pre-tax. Cash costs are expected to be approximately 60% of that amount, primarily related to workforce reductions and other program costs. Expected non-cash charges are primarily related to incremental depreciation and asset write-offs, including losses associated with the expected exit of certain markets. For the three months ended September 30, 2025 and 2024, total 2024 Transformation Initiative charges were $62 pre-tax ($50 after-tax) and $124 pre-tax ($106 after-tax), respectively. For the nine months ended September 30, 2025 and 2024, total 2024 Transformation Initiative charges were $261 pre-tax ($222 after-tax), and $359 pre-tax ($257 after-tax), respectively. Through September 30, 2025, cumulative pre-tax charges for the 2024 Transformation Initiative were $718 ($561 after-tax). \nDivestiture Activity\nOn July 1, 2024, we completed the sale transaction of our former personal protective equipment (\"PPE\") business for total consideration of $635. Upon closure of the transaction, a pre-tax gain of $566 ($453 after-tax) was recognized in Other (income) and expense, net. This gain is net of transaction costs of $14 that were determined to be directly attributable to the sale transaction. \nWar in Ukraine\nConsistent with the humanitarian nature of our products, we manufacture and sell only essential items in Russia, such as baby diapers and feminine pads, which are critical to the health and hygiene of women, girls and babies. Beginning in March 2022, we significantly adjusted our business in Russia, substantially curtailing media, advertising and promotional activity and suspending capital investments, other than certain maintenance investments, in our sole manufacturing facility in Russia. Our Russia business has represented approximately 1% to 2% of our global net sales, operating profit and total assets. Our ability to continue our operations in Russia may change as the situation evolves. We have experienced high input costs, supply chain complexities, reduced consumer demand, restricted access to raw materials and production assets, and restricted access to financial institutions, as well as supply chain, professional services, monetary, currency, trade and payment/investment \n22\nsanctions and related controls. As the business, geopolitical and regulatory environment concerning Russia evolves, we may not be able to sustain the limited manufacture and sale of our products, and our assets may be partially or fully impaired. \nResults of Operations\nConsolidated Results\nSummary of Results\nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet Sales\n$\n4,150\n$\n4,144\n0.1 \n%\n$\n12,367\n$\n12,701\n(2.6)\n%\nGross Profit\n1,493\n1,564\n(4.5)\n%\n4,458\n4,844\n(8.0)\n%\nOperating Profit\n621\n1,026\n(39.5)\n%\n1,844\n2,280\n(19.1)\n%\nProvision for income taxes\n(248)\n(187)\n32.6 \n%\n(495)\n(395)\n25.3 \n%\nIncome from Continuing Operations\n344\n823\n(58.2)\n%\n1,258\n1,843\n(31.7)\n%\nIncome from Discontinued Operations, Net of Income Taxes\n110\n92\n19.6 \n%\n281\n283\n(0.7)\n%\nNet Income Attributable to Kimberly-Clark Corporation\n446\n907\n(50.8)\n%\n1,522\n2,098\n(27.5)\n%\nDiluted Earnings per Share from Continuing Operations\n1.01\n2.42\n(58.3)\n%\n3.73\n5.37\n(30.5)\n%\nDiluted Earnings per Share from Discontinued Operations\n0.33\n0.27\n22.2 \n%\n0.84\n0.84\n— \n%\nAdjusted Results - Continuing Operations\nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n% Change\n2025\n2024\n% Change\nAdjusted Gross Profit\n(a)\n$\n1,527\n$\n1,595\n(4.3)\n%\n$\n4,627\n$\n4,920\n(6.0)\n%\nAdjusted Operating Profit\n(a)\n683\n682\n0.1 \n%\n2,102\n2,171\n(3.2)\n%\nAdjusted Earnings per Share\n(a)\n1.45\n1.56\n(7.1)\n%\n4.70\n4.96\n(5.2)\n%\nAdjusted Effective Tax Rate\n(a)\n26.5\n%\n21.5\n%\n5.0 \n%\n22.6\n%\n21.7\n%\n0.9 \n%\n(a)    Adjusted amounts are non-GAAP financial measures. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to Non-GAAP measures.\nNet Sales\nDrivers of the changes in net sales were:\nPercent Change in Net Sales \nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\nThree Months Ended\n2.4\n0.3\n(0.2)\n(2.2)\n(0.1)\n0.1\n2.5\nNine Months Ended\n2.4\n0.1\n(0.9)\n(3.0)\n(1.2)\n(2.6)\n1.6\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the PPE business, the exit of the Company's private label diaper business in the United States, and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\nNet sales of $4.2 billion for the three months ended September 30, 2025 were in line with the prior year, as divestitures and business exits were offset by organic sales growth. Organic sales increased 2.5% driven by volume gains of 2.4%, while price and mix were relatively flat compared to the prior year. \nNet sales of $12.4 billion for the nine months ended September 30, 2025 declined 2.6%, primarily driven by divestitures and business exits and unfavorable currency impacts, partially offset by organic sales growth. Organic sales increased 1.6% driven by volume gains of 2.4%, partially offset by lower pricing.\n23\nGross and Operating Profits\nGross profit of $1.5 billion for the three months ended September 30, 2025 decreased 4.5%, while gross margin of 36.0% decreased 170 basis points. Gross margin in the current and prior year included approximately 80 basis points for charges related to the 2024 Transformation Initiative, primarily for incremental depreciation expense, workforce reductions and asset write-offs. The decline in gross profit was primarily due to unfavorable pricing net of cost inflation, including tariff impacts, and supply chain related investments, partially offset by gross productivity savings from integrated margin management of approximately $125.\nGross profit of $4.5 billion for the nine months ended September 30, 2025 decreased 8.0%, while gross margin of 36.0% decreased 210 basis points. Gross margin in the current and prior year included approximately 140 basis points and 60 basis points, respectively, for charges related to the 2024 Transformation Initiative, primarily for incremental depreciation expense, workforce reductions and asset write-offs. Excluding these charges, adjusted gross margin decreased 130 basis points to 37.4% primarily due to unfavorable pricing net of cost inflation, including tariff impacts, and supply chain related investments, partially offset by gross productivity savings from integrated margin management of approximately $325.\nOperating profit for the three and nine months ended September 30, 2025 was $621 and $1.8 billion, respectively, compared to $1.0 billion and $2.3 billion in the prior year. Results included charges related to the 2024 Transformation Initiative of $62 and $258 for the three and nine months ended September 30, 2025, respectively, and  $124 and $359 for the three and nine months ended September 30, 2024. Results in 2024 also included a $565 gain from the sale of our PPE business and charges of $97 for the impairment of intangible assets. Excluding these items, adjusted operating profit for the three and nine months ended September 30, 2025 was $683 and $2.1 billion, respectively, compared to $682 and $2.2 billion in the prior year. \nDrivers of the changes in adjusted operating profit were:\nPercent Change in Adjusted Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\n(a)\nCurrency Translation\nOther\n(b)\nTotal\n(c)\nThree Months Ended\n1.4\n(1.4)\n(7.1)\n(2.1)\n0.1\n9.2\n0.1\nNine Months Ended\n1.2\n(5.3)\n(7.5)\n1.0\n(0.8)\n8.2\n(3.2)\n(a)    Includes net impact of productivity initiatives, product and supply chain investments and other changes in cost of products sold.\n(b)    Includes impact of changes in product mix, marketing, research and general expenses and other (income) and expense, net.\n(c)    Adjusted Operating Profit is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\nAdjusted operating profit for the three months ended September 30, 2025 was in line with the prior year as lower adjusted gross profit discussed above, coupled with a 210 basis point impact from divestitures and business exits was offset by lower marketing, research and general expenses.\nThe decrease in adjusted operating profit for the nine months ended September 30, 2025 resulted from lower net sales and adjusted gross profit discussed above, coupled with a 400 basis point impact from divestitures and business exits and unfavorable currency impacts, partially offset by lower marketing, research and general expenses. \nIncome from Continuing Operations\nIncome from Continuing Operations for the three and nine months ended September 30, 2025 was $344 and $1.3 billion, respectively, compared to $823 and $1.8 billion in the prior year. Apart from the operating profit drivers discussed above, the decrease was primarily related to a higher effective tax rate and lower income from equity companies.\nOur share of net income of equity companies for the three and nine months ended September 30, 2025 was $46 and $137, respectively, compared to $48 and $172 for the prior year. The decrease for the nine months ended was primarily driven by Kimberly-Clark de Mexico, S.A.B. de C.V., due to unfavorable foreign currency effects, higher inputs costs and lower volumes, partially offset by pricing, productivity savings and lower general and administrative expenses. \nThe effective tax rate for the three and nine months ended September 30, 2025 was 45.4% and 30.6%, respectively, compared to 19.4% and 19.1% in the prior year. The increases in each period were primarily driven by incremental tax charges as a result of the One Big Beautiful Bill Act (“OBBBA”) relating to a valuation allowance on current and prior year U.S. foreign tax credits. The adjusted effective tax rate for the three and nine months ended \n24\nSeptember 30, 2025 was 26.5% and 22.6%, respectively, compared to 21.5% and 21.7% in the prior year. The increases were driven primarily by transitory impacts from OBBBA and the resolution of certain tax matters in the prior year. \nDiluted earnings per share for the three and nine months ended September 30, 2025 were $1.01 and $3.73, respectively, compared to $2.42 and $5.37 for the prior year. Adjusted diluted earnings per share for the three and nine months ended September 30, 2025 were $1.45 and $4.70, respectively, representing a 7.1% and 5.2% decrease compared to the prior year. The decrease was primarily driven by lower adjusted operating profit, higher income tax expense caused by OBBBA, and lower income from equity companies, which more than offset the benefits from lower dilutive shares outstanding.\nIncome from Discontinued Operations, Net of Income Taxes\nIncome from discontinued operations, net of income taxes for the three months ended September 30, 2025 was $110 compared to $92 in the prior year. The increase was driven by a reduction in depreciation and amortization expense of $30, partially offset by pre-tax separation costs of $17.\nIncome from discontinued operations, net of income taxes for the nine months ended September 30, 2025 was $281 compared to $283 in the prior year, as pre-tax separation charges of $50 were largely offset by a reduction in depreciation and amortization expense of $40. \nSegment Results\nDrivers of the changes in segment net sales and operating profit were:\nPercent Change in Segment Net Sales\nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\nThree Months Ended\nNA\n2.6\n(0.5)\n0.4\n(3.3)\n—\n(0.8)\n2.7\nIPC\n2.0\n1.6\n(1.5)\n(0.1)\n(0.1)\n1.9\n2.1\nNine Months Ended\nNA\n2.6\n(0.4)\n(0.2)\n(4.0)\n(0.2)\n(2.2)\n2.1\nIPC\n2.0\n1.0\n(2.2)\n(0.2)\n(3.0)\n(2.5)\n0.8\nPercent Change in Segment Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\n(d)\nCurrency Translation\nOther\n(e)\nTotal\nThree Months Ended\nNA\n0.1\n1.8\n(3.5)\n(5.0)\n(0.1)\n6.5\n(0.2)\nIPC\n4.3\n(10.5)\n(13.1)\n10.1\n0.5\n15.2\n6.5\nNine Months Ended\nNA\n0.2\n(0.9)\n(3.6)\n(1.6)\n(0.2)\n5.1\n(1.0)\nIPC\n5.1\n(14.7)\n(14.0)\n9.8\n(2.0)\n6.1\n(9.7)\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the PPE business, the exit of the Company's private label diaper business in the United States, and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\n(d)    Includes net impact of productivity initiatives, product and supply chain investments and other changes in cost of products sold.\n(e)    Includes impact of changes in product mix, marketing, research and general expenses and other (income) and expense, net.\n25\nNorth America\nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet Sales\n$\n2,714\n \n$\n2,735 \n(0.8)\n%\n$\n8,112\n \n$\n8,294 \n(2.2)\n%\nOperating Profit\n640\n \n641 \n(0.2)\n%\n1,973\n \n1,992 \n(1.0)\n%\nNet sales of $2.7 billion for the three months ended September 30, 2025 decreased 0.8% due to the exit of the private label diaper business in the US, partially offset by organic sales growth. Organic sales increased 2.7% primarily from volume gains of 2.6%, driven by Baby & Child Care, Adult & Fem Care and Professional categories. Net sales of $8.1 billion for the nine months ended September 30, 2025 decreased 2.2% from a combination of the sale of the PPE business and the exit of the private label diaper business in the US, partially offset by organic sales growth. Organic sales increased 2.1% driven by volume gains of 2.6%, with all categories growing volume, partially offset by lower pricing and mix. \nOperating profit for the three months ended September 30, 2025 of $640 was in line with the prior year, as impacts from divestitures and business exits (approximately 220 basis points) were offset by gross productivity savings and lower marketing, research and general expenses. Operating profit for the nine months ended September 30, 2025 of $2.0 billion decreased 1.0%, primarily due to divestitures and business exits (approximately 340 basis points), unfavorable pricing net of cost inflation, including tariff impacts, and supply chain related investments, partially offset by gross productivity savings and lower marketing, research and general expenses.\nInternational Personal Care\n \nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n% Change\n2025\n2024\n% Change\nNet Sales\n$\n1,436\n \n$\n1,409 \n1.9 \n%\n$\n4,255\n \n$\n4,362 \n(2.5)\n%\nOperating Profit\n214\n \n201 \n6.5 \n%\n597\n \n661 \n(9.7)\n%\nNet sales of $1.4 billion for the three months ended September 30, 2025 increased 1.9% primarily due to a 2.1% increase in organic sales. Organic sales benefited from volume and mix gains of 2.0% and 1.6%, respectively, driven by China, South Korea, Australia and Indonesia, partially offset by lower pricing. Net sales of  $4.3 billion for the nine months ended September 30, 2025 decreased 2.5% primarily driven by unfavorable currency impacts, partially offset by organic sales growth of 0.8%. The components of organic sales are consistent with the drivers discussed above.\nOperating profit for the three months ended September 30, 2025 of $214 increased 6.5% driven by gross productivity savings, volume and mix gains and lower marketing, research and general expenses, partially offset by unfavorable pricing net of cost inflation. Operating profit for the nine months ended September 30, 2025 of $597 decreased 9.7%, primarily due to unfavorable pricing net of cost inflation, supply chain related investments and currency impacts, partially offset by gross productivity savings and volume and mix gains. \nLiquidity and Capital Resources\nAs detailed in Item 1, Note 1 to the Unaudited Interim Condensed Consolidated Financial Statements, the Condensed Consolidated Statements of Cash Flows are presented on a consolidated basis for both continuing operations and discontinued operations. As a result, unless specifically stated, the following discussion reflects Kimberly Clark's consolidated results for all periods presented. \nCash Provided by Operations\nCash provided by operations was $1.8 billion during the nine months ended September 30, 2025 compared to $2.4 billion in the prior year. The decrease was driven by lower operating profit and timing impacts to working capital, including incremental restructuring and IFP Transaction separation cost payments of approximately $120. \n26\nInvesting\nCash used for investing was $650 during the nine months ended September 30, 2025 compared to cash provided by investing of $94 in the prior year. This change is primarily due to proceeds from asset and business dispositions of $649 in 2024, primarily reflecting the sale of our PPE business. During the nine months ended September 30, 2025, our capital spending was $741 compared to $512 in the prior year. We anticipate that full year capital spending will be approximately $1.0 to $1.2 billion, including incremental spending from the 2024 Transformation Initiative. \nFinancing\nCash used for financing was $1.6 billion during the nine months ended September 30, 2025 compared to $2.5 billion in the prior year. This decrease was primarily due to decreased share repurchases, coupled with an increase in U.S. commercial paper. During the nine months ended September 30, 2025, we repurchased 1.1 million shares of our common stock pursuant to our publicly announced share repurchase programs at a total cost of $140 through a broker in the open market. \nOur short-term debt, which consists of U.S. commercial paper with original maturities up to 90 days and/or other short-term debt issued by non-U.S. subsidiaries, was $421 as of September 30, 2025 (included in Debt payable within one year on the Condensed Consolidated Balance Sheets). The average month-end balance of short-term debt for the nine months ended September 30, 2025 was $257. These short-term borrowings provide supplemental funding to support our operations. The level of short-term debt generally fluctuates depending upon the amount of operating cash flows and the timing of customer receipts and payments for items such as dividends and income taxes.\nAs of September 30, 2025 and December 31, 2024, total debt from continuing operations was $7.3 billion and $7.4 billion, respectively. \nWe maintain a $2.0 billion revolving credit facility which expires in June 2028 and a $750 revolving credit facility which expires in May 2026. These facilities, currently unused, support our commercial paper program and would provide liquidity in the event our access to the commercial paper markets is unavailable for any reason.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented through 2027. We are expecting favorable cash tax impacts in the near and medium term as a result of the OBBBA. During the three months ended September 30, 2025, provisions within the OBBBA increased the Noncurrent deferred tax liability by approximately $200 primarily due to the valuation allowance recorded in the quarter and changes providing for the immediate deduction of previously capitalized research and development expenditures. \nWe have evaluated the effects of the Global anti-Base Erosion rules set forth by the Organization for Economic Co-Operation and Development, referred to as “Pillar 2,” which establishes a global minimum corporate tax rate of 15%. We have (1) determined that Pillar 2 legislation has been enacted in one or more of the jurisdictions in which the Company operates and the Company is within the scope of such legislation, (2) assessed such enacted legislation and, as applicable, the Transitional Safe Harbor provisions for Pillar 2 that apply, and (3) determined the impact will be immaterial to our financial results. We intend to file a Qualified Country-by-Country Report for the current year for each jurisdiction in which we intend to rely on the Transitional Country-by-Country Reporting Safe Harbor provisions.\nWe believe that our ability to generate cash from operations and our capacity to issue short-term and long-term debt are adequate to fund working capital, obligations related to our 2024 Transformation Initiative, capital spending, pension contributions, share repurchases, dividends and other needs for the foreseeable future. Further, we do not expect restrictions or taxes on repatriation of cash held outside of the U.S. to have a material effect on our overall business, liquidity, financial condition or results of operations for the foreseeable future.\nInformation Concerning Forward-Looking Statements\nCertain matters contained in this report concerning the business outlook, including raw material, energy and other input costs, our plans and expectations regarding the pending IFP Transaction, the anticipated charges and savings from the 2024 Transformation Initiative, cash flow and uses of cash, growth initiatives, innovations, marketing and other spending, net sales, anticipated currency rates and exchange risks, including the impact in Argentina and \n27\nTürkiye, effective tax rate, contingencies and anticipated transactions of Kimberly-Clark, including dividends, share repurchases and pension contributions, constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and are based upon management's expectations and beliefs concerning future events impacting Kimberly-Clark. There can be no assurance that these future events will occur as anticipated or that our results will be as estimated. Forward-looking statements speak only as of the date they were made, and we undertake no obligation to publicly update them.\nThe assumptions used as a basis for the forward-looking statements include many estimates that, among other things, depend on the achievement of future cost savings and projected volume increases. In addition, many factors outside our control, including risks and uncertainties around the pending IFP Transaction (including risks related to delays or failure to complete the proposed transaction, the incurrence of significant transaction and separation costs, adverse market reactions, regulatory or legal challenges, and operational disruptions), risks that we are not able to realize the anticipated benefits of the 2024 Transformation Initiative (including risks related to disruptions to our business or operations or related to any delays in implementation), war in Ukraine (including the related responses of consumers, customers, and suppliers and sanctions issued by the U.S., the European Union, Russia or other countries), government trade or similar regulatory actions (including current and potential trade and tariff actions affecting the countries where we operate and the resulting negative impacts on our supply chain, commodity costs, and consumer spending), pandemics, epidemics, fluctuations in foreign currency exchange rates, the prices and availability of our raw materials, supply chain disruptions, disruptions in the capital and credit markets, counterparty defaults (including customers, suppliers and financial institutions with which we do business), failure to realize the expected benefits or synergies from our acquisition and disposition activity, impairment of goodwill and intangible assets and our projections of operating results and other factors that may affect our impairment testing, changes in customer preferences, severe weather conditions, regional instabilities and hostilities (including the war in Israel), potential competitive pressures on selling prices for our products, energy costs, general economic and political conditions globally and in the markets in which we do business, as well as our ability to maintain key customer relationships, could affect the realization of these estimates.\nThe factors described under Item 1A, \"Risk Factors\" in our Annual Report on Form 10-K for the year ended  December 31, 2024, or in our other SEC filings, among others, could cause our future results to differ from those expressed in any forward-looking statements made by us or on our behalf. Other factors not presently known to us or that we presently consider immaterial could also affect our business operations and financial results.\nSUMMARY OF NON-GAAP FINANCIAL MEASURES\nThe following provides the reconciliation of the non-GAAP financial measures provided in this report to the most closely related GAAP measure. These measures include: Organic Sales Growth, Adjusted Gross Profit, Adjusted Operating Profit, Adjusted Earnings per Share, and Adjusted Effective Tax Rate. All discussions regarding non-GAAP financial measures reflect results from our continuing operations for all periods presented. \n•\nOrganic Sales Growth is defined as the change in Net Sales, as determined in accordance with U.S. GAAP, excluding the impacts of currency translation and divestitures and business exits. \n•\nAdjusted Gross and Operating Profit, Adjusted Earnings per Share, and Adjusted Effective Tax Rate are defined as Gross Profit, Operating Profit, Diluted Earnings per Share, and Effective Tax Rate, respectively, as determined in accordance with U.S. GAAP, excluding the impacts of certain items that management believes do not reflect our underlying operations, and which are discussed in further detail below. \nThe income tax effect of these non-GAAP items on the Company's Adjusted Earnings per Share is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment. The impact of these non-GAAP items on the Company’s effective tax rate represents the difference in the effective tax rate calculated with and without the non-GAAP adjustment on Income from Continuing Operations Before Income Taxes and Equity Interests and Provision for income taxes. \nWe use these non-GAAP financial measures to assist in comparing our performance on a consistent basis for purposes of business decision making by removing the impact of certain items that we do not believe reflect our underlying and ongoing operations. We believe that presenting these non-GAAP financial measures is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating our results. We believe that the presentation of these non-GAAP financial measures, when considered together with the corresponding U.S. \n28\nGAAP financial measures and the reconciliation to those measures, provides investors with additional understanding of the factors and trends affecting our business than could be obtained absent these disclosures. \nThese non-GAAP financial measures are not meant to be considered in isolation or as a substitute for the comparable GAAP measures, and they should be read only in conjunction with our Unaudited Interim Condensed Consolidated Financial Statements prepared in accordance with GAAP. There are limitations to these non-GAAP financial measures because they are not prepared in accordance with GAAP and may not be comparable to similarly titled measures of other companies due to potential differences in methods of calculation and items being excluded. We compensate for these limitations by using these non-GAAP financial measures as a supplement to the GAAP measures and by providing reconciliations of the non-GAAP and comparable GAAP financial measures. \nThe non-GAAP financial measures exclude the following items for the relevant time periods:\n•\n2024 Transformation Initiative - We initiated this transformation to create a more agile and focused operating structure that will accelerate our proprietary pipeline of innovation in right-to-win spaces and improve our growth trajectory, profitability, and returns on investment. See Item 1, Note 2 to the Unaudited Interim Condensed Consolidated Financial Statements for details.\n•\nU.S. Tax Reform Related Matters (OBBBA) - In the third quarter of 2025, we recognized a valuation allowance on prior year U.S. foreign tax credits as a result of provisions within the OBBBA that impact our ability to use credits.\n•\nIFP Repatriated Earnings – In 2025, in connection with the IFP Transaction, we recognized a deferred tax liability for certain permanently reinvested earnings from the IFP Business that are expected to be repatriated prior to the close of the transaction. \n•\nSale of PPE business - In 2024, we recognized a gain related to the sale of our PPE business. See Item 1, Note 4 to the Unaudited Interim Condensed Consolidated Financial Statements for details.\n•\nImpairment of intangible assets - In 2024, we recognized charges related to the impairment of certain intangible assets related to Softex and Thinx. See Item 1, Note 5 to the Unaudited Interim Condensed Consolidated Financial Statements for details.\nThe following tables provide a reconciliation of Organic Sales Growth from continuing operations:\nThree Months Ended September 30, 2025\nPercent change vs. the prior year period\nNA\nIPC\nTotal\nNet Sales Growth\n(0.8)\n1.9\n \n0.1\n \nCurrency Translation\n—\n \n0.1\n \n0.1\n \nDivestitures and Business Exits\n3.3\n \n0.1\n \n2.2\n \nOrganic Sales Growth\n(a)\n2.7\n \n2.1\n \n2.5\n \nNine Months Ended September 30, 2025\nPercent change vs. the prior year period\nNA\nIPC\nTotal\nNet Sales Growth\n(2.2)\n(2.5)\n(2.6)\nCurrency Translation\n0.2\n \n3.0\n \n1.2\n \nDivestitures and Business Exits\n4.0\n \n0.2\n \n3.0\n \nOrganic Sales Growth\n(a)\n2.1\n \n0.8\n \n1.6\n \n(a)    Table may not foot due to rounding.\n29\nThe following table provides a reconciliation of Adjusted Gross Profit from continuing operations:\nThree Months Ended\nSeptember 30\nNine Months Ended\nSeptember 30\n2025\n2024\n2025\n2024\nGross Profit\n$\n1,493\n \n$\n1,564 \n$\n4,458\n \n$\n4,844 \n2024 Transformation Initiative\n34\n \n31 \n169\n \n76 \nAdjusted Gross Profit\n$\n1,527\n \n$\n1,595 \n$\n4,627\n \n$\n4,920 \nThe following table provides a reconciliation of Adjusted Operating Profit from continuing operations:\nThree Months Ended\nSeptember 30\nNine Months Ended\nSeptember 30\n2025\n2024\n2025\n2024\nOperating Profit\n$\n621\n \n$\n1,026 \n$\n1,844\n \n$\n2,280 \n2024 Transformation Initiative\n62\n \n124 \n258\n \n359 \nSale of PPE Business\n—\n \n(565)\n—\n \n(565)\nImpairment of Intangible Assets\n—\n \n97 \n—\n \n97 \nAdjusted Operating Profit\n$\n683\n \n$\n682 \n$\n2,102\n \n$\n2,171 \nThe following table provides a reconciliation of Adjusted Earnings per Share from continuing operations:\nThree Months Ended\nSeptember 30\nNine Months Ended\nSeptember 30\n2025\n2024\n2025\n2024\nDiluted Earnings per Share\n$\n1.01\n \n$\n2.42 \n$\n3.73\n \n$\n5.37 \n2024 Transformation Initiative\n0.14\n \n0.31 \n0.64\n \n0.76 \nOBBBA\n0.29\n \n— \n0.29\n \n— \nIFP Repatriated Earnings\n0.01\n \n— \n0.04\n \n— \nSale of PPE Business\n—\n \n(1.34)\n—\n \n(1.34)\nImpairment of Intangible Assets\n—\n \n0.17 \n—\n \n0.17 \nAdjusted Earnings per Share\n(a)\n$\n1.45\n \n$\n1.56 \n$\n4.70\n \n$\n4.96 \n(a)    The non-GAAP adjustments included above are presented net of tax. The income tax effect of these non-GAAP items is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment. Refer to the Adjusted Effective Tax Rate reconciliation below for the tax effect of these adjustments on the Company's reported Provision for income taxes.\n30\nThe following tables provide a reconciliation of the continuing operations Adjusted Effective Tax Rate:\nThree Months Ended September 30\n2025\n2024\nIncome From Continuing Operations Before Income Taxes and Equity Interests\nProvision for Income Taxes\nIncome From Continuing Operations Before Income Taxes and Equity Interests\nProvision for Income Taxes\nAs Reported\n$\n546\n \n$\n(248)\n$\n962 \n$\n(187)\n2024 Transformation Initiative\n62\n \n(12)\n124 \n(18)\nOBBBA\n—\n \n96\n \n— \n— \nIFP Repatriated Earnings\n—\n \n3\n \n— \n— \nSale of PPE Business\n—\n \n—\n \n(565)\n112 \nImpairment of Intangible Assets\n—\n \n—\n \n97 \n(40)\nAs Adjusted\n$\n608\n \n$\n(161)\n$\n618 \n$\n(133)\nEffective Tax Rate\nAs Reported\n45.4\n%\n19.4\n%\nAs Adjusted\n26.5\n%\n21.5\n%\nNine Months Ended September 30\n2025\n2024\nIncome From Continuing Operations Before Income Taxes and Equity Interests\nProvision for Income Taxes\nIncome From Continuing Operations Before Income Taxes and Equity Interests\nProvision for Income Taxes\nAs Reported\n$\n1,616\n \n$\n(495)\n$\n2,066 \n$\n(395)\n2024 Transformation Initiative\n261\n \n(39)\n359 \n(102)\nOBBBA\n—\n \n96\n \n— \n— \nIFP Repatriated Earnings\n—\n \n13\n \n— \n— \nSale of PPE Business\n—\n \n—\n \n(565)\n112 \nImpairment of Intangible Assets\n—\n \n—\n \n97 \n(40)\nAs Adjusted\n$\n1,877\n \n$\n(425)\n$\n1,957 \n$\n(425)\nEffective Tax Rate\nAs Reported\n30.6\n%\n19.1\n%\nAs Adjusted\n22.6\n%\n21.7\n%"
}