{
  "source_file": "kmb-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nDescription of Kimberly-Clark\nKimberly-Clark Corporation was founded in 1872 and incorporated in Delaware in 1928. \nWe are a global company focused on delivering products and solutions that provide better care for a better world through product innovation and building o\nur brands. We are principally engaged in the manufacturing and marketing of a wide range of products made from natural or synthetic fibers and materials using advanced technologies in fibers, nonwovens and absorbency. Fueled by ingenuity, creativity, and an understanding of people's most essential needs, we create products that help individuals experience more of what's important to them. Our portfolio of brands, including Huggies, Kleenex, Scott, Kotex, Cottonelle, Poise, Depend, Andrex, Pull-Ups, GoodNites, Intimus, Plenitud, Sweety, Softex, Viva and WypAll, encompass five global daily-need product categories: Baby & Child Care, Adult Care, Feminine Care, Family Care, and Professional. We strive to use sustainable practices that support a healthy planet, build strong communities, and ensure our business will thrive for decades to come. Unless the context indicates otherwise, the terms \"Corporation,\" \"Kimberly-Clark,\" \"K-C,\" \"we,\" \"our\" and \"us\" refer to Kimberly-Clark Corporation and its consolidated subsidiaries.\nAmounts within this Annual Report on Form 10-K are reported in millions, except per share amounts, unless otherwise noted. \nBusiness Strategy and Segment Reporting\nDuring fiscal 2024, we announced our 2024 Transformation Initiative in order to create a more agile and focused operating structure that will accelerate our proprietary pipeline of innovation in right-to-win spaces and improve our growth trajectory, profitability, and returns on investment. This new operating structure leverages three synergistic forces:\n•\nAccelerating pioneering innovation to capture significant growth available in our product categories by investing in science and technology to satisfy unmet and evolving consumer needs;\n•\nOptimizing our margin structure to deliver superior consumer propositions and implement initiatives and deploy technology and data analytics designed to create a fast, adaptable, integrated supply chain with greater visibility that can deliver continuous improvement; and\n•\nWiring our organization for growth to drive agility, speed, and focused execution that extends our competitive advantages further into the future.\nAs part of this transformation, we realigned our internal operating and management structure to streamline our global supply chain and improve the efficiency of our corporate and regional overhead cost structures. As a result of this realignment, we manage and report our operations through three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). Further, our measure of segment profitability was changed to include the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. These changes had no impact on our previously reported consolidated net sales, operating profit, net income attributable to Kimberly-Clark or earnings per share. \nThese segments are described in greater detail in Item 8, Note 15 to the consolidated financial statements.\nDistribution and Customers\nProducts for household use are sold directly to supermarkets, mass merchandisers, drugstores, warehouse clubs, variety and department stores and other retail outlets, as well as through other distributors and e-commerce. Products for professional use are sold through distributors, directly to manufacturing, lodging, office building, food service, and high-volume public facilities, and through e-commerce.\nOur largest customer, Walmart Inc., represented approximately \n14\n% in 2024 and \n13\n% in 2023 and 2022 of our consolidated net sales. Net sales to Walmart Inc. were primarily in the NA segment.\n1\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nAcquisitions and Divestitures \nDuring the periods included within this Annual Report on Form 10-K, we completed the following acquisition and divestiture activity:\n•\n2024 - The sale of our personal protective equipment business which included Kimtech branded products such as gloves, apparel and masks, and KleenGuard branded products such as gloves, apparel, respirators and eyewear. This business and brands serve a variety of scientific and industrial industries globally. \n•\n2023 - The acquisition of the remaining shares of Thinx Inc. (“Thinx”), an industry leader in the reusable period and incontinence underwear category. \n•\n2023 - The sale of our Neve tissue brand and related consumer and professional tissue assets in Brazil. \nThese transactions are discussed in greater detail in Item 8, Note 3 to the consolidated financial statements.\nPatents and Trademarks\nWe own various patents and trademarks registered domestically and in many foreign countries. We consider the patents and trademarks that we own and the trademarks under which we sell certain of our products to be material to our business. Consequently, we seek patent and trademark protection by all available means, including registration.\nRaw Materials\nCellulose fiber, in the form of kraft pulp or fiber recycled from recovered waste paper, is the primary raw material for our tissue products, and in the form of fluff pulp, is a component of disposable diapers, training and youth pants, feminine pads and incontinence care products.\nPolypropylene and other synthetics and chemicals are the primary raw materials for manufacturing nonwoven fabrics, which are used in disposable diapers, training and youth pants, wet wipes, feminine pads, incontinence care products, and professional wipers and apparel. Superabsorbent materials are important components of disposable diapers, training and youth pants and incontinence care products. \nRaw materials are purchased from third parties, and we consider the supply to be adequate to meet the needs of our businesses. See Item 1A, \"Risk Factors.\"\nCompetition\nWe have several major competitors in most of our markets, some of which are larger and more diversified than us. The principal methods and elements of competition include brand recognition and loyalty, product innovation, quality and performance, price, and marketing and distribution capabilities. For additional discussion of the competitive environment in which we conduct our business, see Item 1A, \"Risk Factors.\"\nCorporate Responsibility and Sustainability\nBetter care for a better world begins with focusing on the health and safety of our customers, consumers, and employees; promoting the value of inclusion, equity and diversity within our business; and making efforts to protect the rights of workers across our supply chain. We believe we can make meaningful contributions through our business activities and operations to clean water and sanitation, climate action and responsible consumption and production. Our sustainability strategy puts our brand, supply chain and innovation teams to work with the goal of creating shared value by addressing relevant global challenges and is focused on addressing key climate-related risks and opportunities throughout our value chain. \n2\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nWe strive to make lives better while also working to help safeguard the earth’s natural ecosystems. We implement this effort by considering our sustainability goals during our business and capital planning processes, coordinating the priorities of our supply chain, brand and innovation teams, and establishing meaningful performance indicators. Our environmental priorities include reducing our use of new fossil fuel-based plastic, while enabling circular systems to recover the materials in our products and packaging; reducing our products’ use of natural forest fiber, while supporting forest biodiversity and forest dependent communities; reducing greenhouse gas emissions along our value chain, with goals approved by the Science Based Targets initiative (\"SBTi\"); and building resilience to water risk at our facilities and in our communities in water-stressed regions around the world. We have aligned our goals with the United Nations' Sustainable Development Goals framework. Progress on our strategy is outlined in our Global Sustainability reports.\nFor 2025 and 2026, we expect total capital expenditures for voluntary environmental controls or controls necessary to comply with legal requirements relating to the protection of the environment at our facilities to average approximately $60 on an annual basis. Total operating expenses for environmental compliance, including pollution control equipment operation and maintenance costs, governmental fees, and research and engineering costs, are expected to be approximately $115 in 2025 and $140 in 2026.\nTotal environmental capital expenditures and operating expenses are not expected to have a material effect on our total capital and operating expenditures, consolidated earnings or competitive position. Current environmental spending estimates could be modified as a result of changes in our plans or changes in legal requirements, including any requirements related to global climate change or other factors.\nRegulatory Compliance\nWe are subject to many laws and regulations across all the countries in which we do business, and we are particularly impacted by those relating to product safety, environmental protection and data privacy and protection. We are also subject to anti-corruption laws and regulations, such as the U.S. Foreign Corrupt Practices Act, and antitrust and competition laws and regulations that govern our dealings with suppliers, customers, competitors and government officials.\nWe are obligated to comply with regulations that cover product safety, efficacy, manufacturing, advertising, labeling and safety reporting. These include requirements that we provide a label that highlights perceived concerns about a product or warns consumers of risks of using our products. In some cases, it may be necessary to initiate product recalls if safety risks are considered to exist. All our facilities and other operations are subject to various environmental protection statutes and regulations, including those relating to the use of water resources and the discharge of wastewater. We are also subject to expanding laws and regulations related to sustainability-related matters, non-financial reporting and diligence, labor and employment, trade, taxation and data privacy and protection, including the European Union’s General Data Protection Regulation, Brazil's General Data Protection Law, China's Personal Information Protection Law, and the California Consumer Privacy Act of 2018. \nOur policy is to abide by all applicable laws and regulations, and we have internal programs in place to manage global compliance with these various requirements. We also expect that our many suppliers, consultants and other third parties working on our behalf share our commitment to compliance, and we have policies and procedures in place to manage these relationships, though they inherently involve a lesser degree of control over operations and governance. We monitor each of these areas for new or changed regulatory requirements, particularly in the rapidly evolving area of data privacy and protection. We have made, and plan to continue making, necessary expenditures for compliance with applicable laws and regulations; however, total capital expenditures and operating expenses related to compliance are not expected to have a material effect on our total capital and operating expenditures, consolidated earnings or competitive position.\n3\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nHuman Capital Management\nWe had approximately 38,000 employees as of December 31, 2024 in our consolidated operations. Approximately 35% of our employees were located in North America and the remainder were in approximately 60 countries outside of North America. Overall, approximately 55% of our workforce was directly involved in manufacturing and distribution operations.\nIn order to recruit, retain, develop, protect and fairly compensate our employees, we focus on the following four key areas: \n•\nHealth and safety – We strive to protect the health and safety of our employees. We create and administer company-wide policies and processes designed to protect our employees and to comply with applicable safety regulations. Health and safety training is regularly provided to our employees. We review and monitor our performance closely to drive continuous improvement in our safety programs. \n•\nDevelopment and employee engagement – Developing talent and leaders at all levels of the organization and engaging our employees is critical to our long-term success. We maintain talent and succession planning processes and have leadership and management development programs as well as broad learning opportunities to support career growth and skill advancement.\nWe also offer all employees the opportunity to join any of our Employee Resource Groups (\"ERGs\"). These groups foster professional development, social connectivity, and celebrate diversity throughout our company. Current ERGs provide community and insights into the perspectives and experiences of those with African, Hispanic, Latino, and Asian ancestry, women, and LGBTQ+, as well as parents, caregivers, people with disabilities, military veterans, and new employees. Our ERGs promote career development by allowing employees to connect with and learn from one another and help amplify our inclusion, equity and diversity efforts.\nIn regard to employee engagement, we hold regular Town Hall meetings where employees can ask questions of executives and make their voice heard. We host a series of conversations to drive employee and leadership engagement across a variety of topics on inclusion. We engage in continuous listening via global surveys, on an ongoing basis, that offer our employees the ability to provide feedback and valuable insights to help address potential issues and identify opportunities to improve and support employee engagement. \n•\nInclusion, equity and diversity – We believe our business success is tied to creating workplaces, communities and experiences where inclusion, equity and diversity are evident and thriving. We prioritize the need to cultivate a workforce where our employees are included and empowered to do their best work. Employing people from disparate backgrounds, cultures, and experiences amplifies our ability to gather insights, foster innovation and understand the culture, context, and mindset of consumers around the world. As a company who serves global consumers and communities, we work to cultivate a workforce comprised of people who look, think, and behave like the people who use our products – now and in the future. As such, we support workforce inclusion, equity and diversity and consider it a fundamental business strategy. The Management Development and Compensation Committee (“MDC”) of the Board of Directors is responsible for reviewing our inclusion, equity and diversity strategy.\n•\nCompensation and benefits – We provide market-based competitive compensation through our salary, annual incentive and long-term incentive programs and robust benefits packages that promote employee well-being across all aspects of their lives. Eligible employees are compensated for their contributions to our goals with both short-term cash incentives and long-term equity-based incentives. We also provide a variety of resources and services to help our employees plan for retirement. We believe the structure of our compensation packages provides the appropriate incentives to attract, retain and motivate our employees.\nThe MDC is responsible for establishing and administering the policies governing annual compensation and long-term compensation to ensure that the policies are designed to align compensation with our overall business strategy and performance.\n4\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nAvailable Information\nWe make financial information, news releases and other information available on our corporate website at \nwww.kimberly-clark.com\n. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge on this website as soon as reasonably practicable after we file these reports and amendments with, or furnish them to, the Securities and Exchange Commission (\"SEC\"). The information contained on or connected to our website is not incorporated by reference into this Annual Report on Form 10-K and should not be considered part of this or any other report filed with the SEC. Stockholders may also contact Stockholder Services, P.O. Box 612606, Dallas, Texas 75261-2606 to obtain a hard copy of these reports without charge.",
  "item7": "ITEM 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nIntroduction\nThis MD&A is intended to provide investors with an understanding of our recent performance, financial condition, cash flows and future prospects. This discussion and analysis compares 2024 results to 2023, with the exception of our segment results, which also compares 2023 results to 2022 as part of the change in our reportable segments discussed below. For a discussion that compares our consolidated 2023 results to 2022, see Management's Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of our 2023 Annual Report on Form 10-K. The reference to \"N.M.\" indicates that the calculation is not meaningful. Amounts are reported in millions, except per share amounts, unless otherwise noted.\nThe following will be discussed and analyzed:\n•\nOverview of Business\n•\nOverview of 2024 Results\n•\nBusiness Environment and Trends\n•\nResults of Operations and Related Information\n•\nLiquidity and Capital Resources\n•\nSummary of Non-GAAP Financial Measures\n17\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n•\nCritical Accounting Estimates\n•\nInformation Concerning Forward-Looking Statements\nThroughout this MD&A, we refer to financial measures that have not been calculated in accordance with accounting principles generally accepted in the U.S., or GAAP, and are therefore referred to as non-GAAP financial measures. We believe these measures provide our investors with additional information about our underlying results and trends, as well as insight to some of the financial measures used to evaluate management. For additional information and reconciliations to the most closely comparable financial measures presented in our consolidated financial statements, which are calculated in accordance with U.S. GAAP, see \"Summary of Non-GAAP Financial Measures\" below.\nOverview of Business and Recent Developments\nWe are a global company focused on delivering products and solutions that provide better care for a better world, \nwith manufacturing facilities in 30 countries, including our equity affiliates, and products sold in more than 175 countries and territories. Our products are sold under well-known brands such as Kleenex, Scott, Huggies, Pull-Ups, Kotex and Depend. \nIn operating our business, we seek to:\n•\ngrow our portfolio of brands through innovation, category development and commercial execution; \n•\nleverage our cost and financial discipline to fund growth and improve margins; and\n•\nallocate capital in value-creating ways. \n2024 Transformation Initiative \nOn March 27, 2024, we announced the 2024 Transformation Initiative designed to sharpen our strategic focus through a new operating model that leverages three synergistic forces:\n•\nAccelerating pioneering innovation to capture significant growth available in our categories by investing in science and technology to satisfy unmet and evolving consumer needs;\n•\nOptimizing our margin structure to deliver superior consumer propositions and implement initiatives and deploy technology and data analytics designed to create a fast, adaptable, integrated supply chain with greater visibility that can deliver continuous improvement; and\n•\nWiring our organization for growth to drive agility, speed, and focused execution that extends our competitive advantages further into the future.\nThe 2024 Transformation Initiative is intended to improve our focus on growth and reduce our structural cost base by realigning our internal operating and management structure to streamline our global supply chain and improve the efficiency of our corporate and regional overhead cost structures. The transformation is expected to impact our organization in all major geographies, and workforce reductions are expected to be in the range of 4%\n \nto 5%\n. \nCertain actions under the 2024 Transformation Initiative are being finalized for implementation, and accounting for such actions will commence when the actions are authorized for execution. The 2024 Transformation Initiative is expected to be completed by the end of 2026. Total pre-tax savings are expected to be $3.0 billion in gross productivity; inclusive of input cost and manufacturing cost savings, and $200 in selling, general and administrative expenses. Total costs are anticipated to be approximately $1.5 billion pre-tax. Cash costs are expected to be approximately half of that amount, primarily related to workforce reductions. Expected non-cash charges are primarily related to incremental depreciation and asset write-offs, including losses associated with the expected exit of certain markets. For the year ended December 31, 2024, total 2024 Transformation Initiative charges were $457 pre-tax ($339 after-tax).\n18\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nChange in Reportable Segments\nAs part of the 2024 Transformation Initiative and the realignment of our internal operating and management structure during the fourth quarter of 2024, we manage and report our operations through three reportable segments defined by geographic regions and product groupings: North America (\"NA\"), International Personal Care (\"IPC\") and International Family Care and Professional (\"IFP\"). Further, our measure of segment profitability was changed to include the effects of changes in exchange rates on monetary assets and liabilities for subsidiaries where we have adopted highly inflationary accounting. These changes reflect the manner in which our chief operating decision maker develops, executes and evaluates global strategies to drive growth and profitability. Segment results for the historical periods presented in these consolidated financial statements have been recast to reflect these changes. These changes had no impact on our previously reported consolidated net sales, operating profit, net income attributable to Kimberly-Clark or earnings per share. These segments are described in greater detail in Item 8, Note 15 to the consolidated financial statements.\nAcquisition and Divestiture Activity\nOn July 1, 2024, we completed the sale transaction that was announced on April 7, 2024, of our personal protective equipment (\"PPE\") business for total consideration of $635, including the initial purchase price of $640 less working capital and other closing adjustments of $5. The transaction included Kimtech branded products, such as gloves, apparel and masks, and KleenGuard branded products, such as gloves, apparel, respirators and eyewear, which serve a variety of scientific and industrial industries globally. Upon closure of the transaction, a pre-tax gain of $566 ($453 after-tax) was recognized in Other (income) and expense, net. This gain is net of transaction costs of $14 that were determined to be directly attributable to the sale transaction.\nOn February 24, 2022, we completed our acquisition of a majority and controlling share of Thinx Inc. (“Thinx”), an industry leader in the reusable period and incontinence underwear category, for total consideration of $181. Subsequently in 2023, we acquired the remaining outstanding ownership interests in Thinx for additional purchase consideration of $95. As the purchase of additional ownership in an already controlled subsidiary represents an equity transaction, no gain or loss was recognized in consolidated net income or comprehensive income. See Item 8, Note 3 to the consolidated financial statements for additional details.\nOn June 1, 2023, we completed the sale transaction of our Neve tissue brand and related consumer and professional tissue assets in Brazil for $212. Upon closure of the transaction, a gain of $74 pre-tax was recognized in Other (income) and expense, net. We incurred divestiture-related costs of $30 pre-tax which were recorded in Cost of products sold and Marketing, research and general expenses, resulting in a net benefit of $44 pre-tax ($26 after-tax). See Item 8, Note 3 to the consolidated financial statements for additional details.\nOverview of 2024 Results\n•\nNet sales of $20.1 billion declined 1.8% primarily due to unfavorable currency impacts and divestitures and business exits. Organic sales increased 3.2% driven by higher pricing, primarily in hyperinflationary economies, and volume and mix gains.\n•\nOperating Profit of $3.2 billion increased 36.9% while Net Income Attributable to Kimberly-Clark of $2.5 billion increased 44.3%. Results primarily benefited from higher gross margins and the gain on sale of our PPE business, partially offset by charges related to the 2024 Transformation Initiative. Prior year results were primarily impacted by charges related to the impairment of intangible assets.  \n•\nDiluted earnings per share were $7.55 compared to $5.21, an increase of 44.9%, reflective of the growth in net income. Results in 2024 included a net benefit of $0.25 for items not reflective of our ongoing operations compared with a net charge of $1.36 in the prior year. \n•\nWe continue to focus on generating cash flow and allocating capital to shareholders. Cash provided by operations was $3.2 billion in 2024. We raised our dividend in 2024 by 3.4%, the 52nd consecutive annual increase in our dividend, and altogether share repurchases and dividends in 2024 amounted to $2.6 billion.\nIn 2025, we will continue executing on our Powering Care growth strategy and its three strategic pillars: accelerate pioneering innovation, optimize our margin structure, and wire our organization for growth. Our first pillar focuses on \n19\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\ninvesting in our brands to enhance our competitive advantage by leveraging our best-in-class science and proprietary, category-shaping technologies for innovative product solutions that solve unmet consumer needs around the world. Our second pillar is driven by our supply chain transformation and investment in three key areas that will enhance our value chain and improve our margin structure: value stream simplification, network optimization, and scalable automation. Our third pillar is centered on making our enterprise stronger and faster while sharpening our portfolio focus and footprint on categories and markets with the greatest long-term potential. \nOur strong legacy of financial discipline supports our Powering Care growth strategy through consistent investment in our technologies and brands, sustained supply chain productivity and enhanced working capital efficiency. Our capital allocation approach prioritizes capital investments to drive growth in our business, a strong and growing dividend, value accretive acquisitions that can enhance our portfolio, and allocation of excess cash flow to share repurchases.\nWe are subject to risks and uncertainties, which can affect our business operations and financial results. See Item 1A, \"Risk Factors\" in this Form 10-K for additional information.\nBusiness Environment and Trends\nOur results of operations have been, and we expect them to continue to be, affected by the following factors and key trends, which may cause our future results of operations to differ from our historical results discussed under “Consolidated Results of Operations.”\nBirth Rate Trends\n - Sales of our baby and child care products are highly correlated with birth rate trends. In recent years, birth rate declines in key countries, including China, South Korea and the U.S., have pressured category volume growth rates. To help mitigate the effects of birth rate declines, we aim to drive sales growth at or ahead of category growth rates through innovation, premiumization, strong brand building plans and digital marketing investment as part of our growth strategy.\nCompetition\n - Our products are sold in a highly competitive global marketplace. Our competitors include global, regional and local manufacturers, including private label manufacturers which offer products that are typically sold at lower prices. In particular, private label market share has been increasing in the tissue category. Increased purchases of private label products could reduce net sales of our higher-margin products which would negatively impact our profitability. While the global marketplace in which we operate has always been highly competitive, we continue to experience increased concentration and the growing presence of large-format retailers, discounters and e-tailers. This market environment has resulted in increased pressure on pricing and other competitive factors, and we expect these pressures to continue in the coming year.\nPricing\n - Our net sales growth and profitability may be affected as we adjust prices to address market conditions. We adjust our product prices based on a number of variables including demand, the competitive environment, technological improvements, product innovations and changes in our raw material, distribution, energy and other input costs. Price changes may affect net sales, earnings and market share in the near term as the market adjusts to new pricing and other market conditions.\nOperating Costs\n - Our operating costs include raw materials, labor, selling, general and administrative expenses, general business taxes, currency impacts and financing costs. We manage these costs through cost saving and productivity initiatives, sourcing and hedging programs, and pricing actions. To remain competitive on our operating structure, we continue to work on programs to expand our profitability, including our 2024 Transformation Initiative. While we saw stabilization in input costs in 2024 with tailwinds in fiber, resin and energy, the overall cost basket remains elevated versus pre-pandemic levels. In 2025, we expect net input costs to be inflationary, including the impact from currency on our non-U.S. operations. \nEvolving Consumer Product and Shopping Preferences\n - The retail landscape in many of our markets continues to evolve due to the rapid growth of e-commerce retailers, changing consumer preferences (as consumers increasingly shop online) and the increased presence of alternative retail channels, such as subscription services and direct-to-consumer businesses. Changing consumer preferences also include increased concerns in regard to post-consumer waste and packaging materials and their impact on environmental sustainability. If we experience \n20\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nlower sales due to changes in consumer demand for our products, our earnings could decrease. We believe our strategic growth focus, sustainability initiatives, innovation pipeline and continued investment in e-commerce capabilities has us well positioned relative to these changing dynamics.\nVolatility of Global Markets\n - Our growth strategy depends in part on our ability to expand our international operations, including in emerging markets.  Some of these markets have greater political, economic and currency volatility and greater vulnerability to infrastructure and labor disruptions. Volatility in these markets affects our production costs and the demand for our products and may impact our supply chain and distribution networks. Volatility in global consumer demand, commodity costs and foreign currency exchange rates increased significantly over the past few years and is expected to continue in the near term.\nClimate Change\n - We operate in many regions around the world where our businesses could be disrupted by climate change. Our climate change risk categories include risks related to the transition to a lower-carbon economy (“Transition Risks”) and risks related to the physical impacts of climate change (“Physical Risks”). Transition Risks include increased costs of carbon emission, increased cost to produce products in compliance with future regulations, increased raw materials cost, shifts in customer/consumer values and other legal, regulatory and technological risks. \nP\nhysical Risks include the risk of direct damage to assets or supply chain disruption caused by severe weather events such as floods, storms, wildfires and droughts. We continue to progress toward our 2030 Sustainability Goals which include elements that aim for reductions in greenhouse gas emissions, use of natural forest fibers, use of plastics and use of water in water-stressed regions.\nWar in Ukraine\n - Consistent with the humanitarian nature of our products, we manufacture and sell only essential items in Russia, such as baby diapers and feminine pads, which are critical to the health and hygiene of women, girls and babies. Beginning in March 2022, we significantly adjusted our business in Russia, substantially curtailing media, advertising and promotional activity and suspending capital investments, other than certain maintenance investments, in our sole manufacturing facility in Russia. Our Russia business has represented approximately 1% to 2% of our net global sales, operating profit and total assets. Our ability to continue our operations in Russia may change as the situation evolves. We have experienced high input costs, supply chain complexities, reduced consumer demand, restricted access to raw materials and production assets, and restricted access to financial institutions, as well as supply chain, professional services, monetary, currency, trade and payment/investment sanctions and related controls. As the business, geopolitical and regulatory environment concerning Russia evolves, we may not be able to sustain the limited manufacture and sale of our products, and our assets may be partially or fully impaired. \n21\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nConsolidated Results of Operations\nThe following discussion and analysis compares our consolidated net sales, operating profit and other information for 2024 with 2023.\nYear Ended December 31\n2024\n2023\nChange\n2024 vs. 2023\nNet Sales\n$\n20,058\n$\n20,431\n(1.8)\n%\nGross Profit\n7,180\n7,032\n2.1 \n%\nOperating Profit\n3,210\n2,344\n36.9 \n%\nProvision for income taxes\n(565)\n(453)\n24.7 \n%\nNet Income Attributable to Kimberly-Clark Corporation\n2,545\n1,764\n44.3 \n%\nDiluted Earnings per Share\n7.55\n5.21\n44.9 \n%\nAdjusted Gross Profit\n(a)\n7,324\n7,047\n3.9 \n%\nAdjusted Operating Profit\n(a)\n3,237\n2,958\n9.4 \n%\nAdjusted Earnings per Share\n(a)\n7.30\n6.57\n11.1 \n%\nAdjusted Effective Tax Rate\n(a)\n23.0\n \n%\n23.2 \n%\n(0.2)\n%\n(a)    Adjusted amounts are Non-GAAP financial measures. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to Non-GAAP measures.\nNet Sales:\nDrivers of the changes in net sales were:\nPercent Change in Net Sales \nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\n2024 versus 2023\n0.8\n0.4\n1.9\n(1.2)\n(3.8)\n(1.8)\n3.2\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the Brazil tissue and professional business, sale of the PPE business and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\nNet sales of $20.1 billion for the year ended December 31, 2024 declined 1.8% primarily due to unfavorable currency impacts and divestitures and business exits. Excluding these items, organic growth was 3.2% driven by a 1.9% increase in price, primarily in hyperinflationary economies, coupled with volume and mix gains across all three reportable segments.  \nGross and Operating Profits\nGross profit of $7.2 billion for the year ended December 31, 2024 increased 2.1%, while gross margin of 35.8% increased 140 basis points. Gross margin in the current year included approximately 70 basis points for charges related to the 2024 Transformation Initiative. Excluding these charges, adjusted gross margin increased 200 basis points to 36.5% primarily due to gross productivity savings from integrated margin management of approximately $500 million, favorable pricing net of inflation and volume gains, partially offset by higher manufacturing costs.  \nOperating profit of $3.2 billion for the year ended December 31, 2024 increased 36.9%. Results in 2024 included a  $565 million gain from the sale of our PPE business, offset by charges of $456 million related to the 2024 Transformation Initiative and $136 million from the impairment of intangible assets and litigation and regulatory matters associated with a previously exited business. Results in 2023 included $658 million of charges from the impairment of intangible assets and a $44 million net benefit related to the sale of our Brazil tissue and professional business. Excluding these items, adjusted operating profit was $3.2 billion in 2024 and $3.0 billion in 2023.\n22\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDrivers of the changes in adjusted operating profit were:\nPercent Change in\nAdjusted Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\nCurrency Translation\nOther\n(a)\nTotal\n(b)\n2024 versus 2023\n1.6\n13.5\n(5.8)\n9.0\n(6.2)\n(2.7)\n9.4\n(a)    Includes impact of changes in product mix and marketing, research and general expenses.\n(b)    Adjusted Operating Profit is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\nAdjusted operating results benefited from higher adjusted gross profit discussed above, partially offset by unfavorable currency impacts, primarily due to hyperinflationary economies, and higher marketing, research and general expenses. \nNet Income and Diluted EPS\nNet income of $2.5 billion for the year ended December 31, 2024 increased 44.3% primarily due to the increase in operating profit discussed above. Net interest expense of $222 was largely in line with the prior year period. Our share of net income of equity companies was $216 million, an increase of 10.2% primarily driven by Kimberly-Clark de Mexico, S.A.B. de C.V., which benefited from volume, mix and pricing growth and productivity savings, partially offset by unfavorable foreign currency effects and higher general and administrative expenses. The effective tax rate was 19.3% in 2024 compared to 22.4% in 2023, with the decline primarily due to the net benefit of items not reflective of our underlying operations discussed in the section above. Excluding these benefits, the adjusted effective tax rate was 23.0% in 2024 compared to 23.2% in 2023. \nDiluted earnings per share of $7.55 for the year ended December 31, 2024 increased 44.9% reflective of the growth in net income discussed above. Adjusted earnings per share of $7.30 increased 11.1% primarily driven by higher adjusted operating profit.\nResults of Operations by Segment\nThe following presents the results of the Company’s reportable segments and compares our segment net sales, operating profit and other information for 2024 with 2023 and 2023 with 2022. Certain data from prior periods presented have been recast to reflect the changes in reportable segments noted above. \nDrivers of the changes in segment net sales and operating profit were:\nPercent Change in Segment Net Sales\nVolume\nMix/Other\nNet Price\nDivestitures and Business Exits\n(c)\nCurrency Translation\nTotal\n(a)\nOrganic\n(b)\n2024 versus 2023\nNA\n0.5\n0.5\n0.1\n(0.8)\n(0.1)\n0.2\n1.1\nIPC\n0.9\n0.5\n7.8\n(0.1)\n(12.2)\n(3.1)\n9.2\nIFP\n1.5\n0.3\n(2.0)\n(4.4)\n(1.2)\n(5.9)\n(0.2)\n2023 versus 2022\nNA\n0.3\n0.4\n4.3\n0.2\n(0.3)\n4.9\n5.0\nIPC\n(4.2)\n1.6\n7.9\n—\n(7.9)\n(2.6)\n5.3\nIFP\n(7.6)\n1.1\n9.3\n(3.9)\n(1.8)\n(2.9)\n2.8\n23\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nPercent Change in\nSegment Operating Profit\nVolume\nNet Price\nInput Costs\nOther Manufacturing Costs\n(d)\nCurrency Translation\nOther\n(e)\nTotal\n2024 versus 2023\nNA\n0.9\n0.4\n—\n1.9\n(0.1)\n(2.0)\n1.1\nIPC\n3.6\n73.0\n(33.3)\n8.3\n(27.8)\n0.7\n24.5\nIFP\n0.9\n(25.2)\n13.8\n54.9\n(2.7)\n(10.3)\n31.4\n2023 versus 2022\nNA\n(0.6)\n21.5\n5.5\n5.5\n(0.3)\n(12.8)\n18.8\nIPC\n(7.3)\n71.2\n(35.7)\n2.4\n(16.8)\n(19.5)\n(5.7)\nIFP\n(31.9)\n130.5\n(46.7)\n(30.5)\n(3.5)\n(5.8)\n12.1\n(a)    Total may not sum across due to rounding.\n(b)    Represents the change in net sales excluding the impacts of currency translation and divestitures and business exits. Organic Sales Growth is a non-GAAP financial measure. See \"Summary of Non-GAAP Financial Measures\" below for reconciliations of our GAAP to non-GAAP measures.\n(c)    Impact of the sale of the Brazil tissue and professional business, sale of the PPE business and other exited businesses and markets in conjunction with the 2024 Transformation Initiative.\n(d)    Includes net impact of productivity initiatives, product and supply chain investments and other changes in cost of products sold.\n(e)    Includes impact of changes in product mix and marketing, research and general expenses.\nNorth America\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n11,008\n \n$\n10,988 \n$\n10,470 \n0.2 \n%\n4.9 \n%\nOperating Profit\n2,534\n \n2,507 \n2,110 \n1.1 \n%\n18.8 \n%\n2024 versus 2023\nNet sales of $11.0 billion were flat as an increase in organic sales of 1.1% was largely offset by divestitures and business exits. Organic sales benefited from volume and mix gains, led by Baby & Child Care and Adult Care. \nOperating profit of $2.5 billion increased 1.1% primarily due to gross productivity savings and volume growth, partially offset by incremental manufacturing costs and higher advertising and promotion expenses. \n2023 versus 2022\nNet sales of $11.0 billion increased 4.9% primarily due to higher net selling prices across the entire product portfolio, led by Professional and Family Care. \nOperating profit of $2.5 billion increased 18.8% primarily due to favorable pricing net of inflation and gross productivity savings. These increases were partially offset by incremental advertising and promotion and research, selling and general expenses.   \nInternational Personal Care\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n5,715\n \n$\n5,899 \n$\n6,054 \n(3.1)\n%\n(2.6)\n%\nOperating Profit\n787\n \n632 \n670 \n24.5 \n%\n(5.7)\n%\n2024 versus 2023\nNet sales of $5.7 billion decreased 3.1% as unfavorable currency impacts of 12.2% were partially offset by a 9.2% increase in organic sales. Organic sales benefited from higher net selling prices of 7.8%, primarily from hyperinflationary economies, and volume growth of 0.9%, led by China. \n24\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nOperating profit of $787 million increased 24.5% primarily due to favorable pricing net of inflation and gross productivity savings, partially offset by unfavorable currency impacts and higher manufacturing costs. Pricing and unfavorable currency impacts were primarily driven by hyperinflationary economies. Other operating costs, namely incremental advertising investments, were largely offset by lower monetary losses from changes in exchange rates in highly inflationary economies. \n2023 versus 2022\nNet sales of $5.9 billion decreased 2.6% as unfavorable currency impacts of 7.9% were partially offset by a 5.3% increase in organic sales. Organic sales benefited from higher net selling prices of 7.9%, primarily from hyperinflationary economies, and product mix gains of 1.6%, partially offset by lower volumes.\nOperating profit of $632 million decreased 5.7% primarily due to unfavorable currency impacts, higher advertising and promotion expenses, and lower volumes, partially offset by favorable pricing net of inflation. Pricing and unfavorable currency impacts were primarily driven by hyperinflationary economies.    \nInternational Family Care & Professional\nYear Ended December 31\n% change\n% change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet Sales\n$\n3,335\n \n$\n3,544 \n$\n3,651 \n(5.9)\n%\n(2.9)\n%\nOperating Profit\n377\n \n287 \n256 \n31.4 \n%\n12.1 \n%\n2024 versus 2023\nNet sales of $3.3 billion decreased 5.9% primarily due to divestitures and business exits and unfavorable currency impacts. Organic sales were relatively flat as volume and mix gains were offset by lower pricing in Europe due to temporary energy surcharge-related price increases in the prior year.\nOperating profit of $377 million increased 31.4% driven by gross productivity savings, partially offset by unfavorable pricing net of inflation and higher research, selling and general expenses. \n2023 versus 2022\nNet sales of $3.5 billion decreased 2.9% primarily due to divestitures and business exits and unfavorable currency impacts, partially offset by organic sales. Organic sales benefited from an increase in net selling prices and product mix of 9.3% and 1.1%, respectively, partially offset by lower volumes reflecting expected elasticity from pricing actions. The increase in net selling prices was driven by temporary energy surcharge-related price increases.   \nOperating profit of $287 million increased 12.1% primarily due to favorable pricing net of inflation, partially offset by lower volumes and higher manufacturing costs.  \nLiquidity and Capital Resources\nCash Provided by Operations\nCash provided by operations for the year ended December 31, 2024 was $3.2 billion compared to $3.5 billion in the prior year. Cash flow from operations benefited from higher operating profit, excluding the effect of non-cash charges, however this increase was more than offset by changes in working capital relative to the prior year coupled with cash payments for the 2024 Transformation Initiative. The impact to cash from working capital was primarily driven by the timing of cash flows associated with the lapping of higher commodity and energy costs in prior periods.  \n25\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nObligations\nThe following table presents our total contractual obligations for which cash flows are fixed or determinable. \nTotal\n2025\n2026\n2027\n2028\n2029\n2030+\nLong-term debt\n$\n7,451 \n$\n566 \n$\n410 \n$\n606 \n$\n700 \n$\n704 \n$\n4,465 \nInterest payments on long-term debt\n2,814 \n272 \n252 \n246 \n223 \n189 \n1,632 \nOperating lease liabilities\n480 \n146 \n130 \n82 \n43 \n28 \n51 \nUnconditional purchase obligations\n2,188 \n1,507 \n427 \n226 \n10 \n3 \n15 \nOpen purchase orders\n2,338 \n1,885 \n412 \n28 \n6 \n3 \n4 \nTotal contractual obligations\n$\n15,271 \n$\n4,376 \n$\n1,631 \n$\n1,188 \n$\n982 \n$\n927 \n$\n6,167 \nThe unconditional purchase obligations are for the purchase of raw materials, primarily superabsorbent materials, pulp and utilities. Although we are primarily liable for payments on the above operating leases and unconditional purchase obligations, based on historic operating performance and forecasted future cash flows, we believe exposure to losses, if any, under these arrangements is not material.\nThe open purchase orders displayed in the table represent amounts for goods and services we have negotiated for delivery.\nThe table does not include amounts where payments are discretionary or the timing is uncertain. The following payments are not included in the table:\n•\nWe will fund our defined benefit pension plans to meet or exceed statutory requirements and currently expect to contribute approximately $15 to these plans in 2025. \n•\nOther postretirement benefit payments are estimated using actuarial assumptions, including expected future service, to project the future obligations. Based upon those projections, we anticipate making annual payments for these obligations of approximately $50 through 2034.\n•\nAccrued income tax liabilities for uncertain tax positions, deferred taxes and noncontrolling interests.\nInvesting\nCash used for investing for the year ended \nDecember 31, 2024 \nwas \n$100 compared to $418 in the prior year as capital spending in the current year was largely offset by proceeds from asset and business dispositions. Capital spending was $721 for the year ended December 31, 2024 compared to $766 in the prior year. Proceeds from asset and business dispositions of $651 primarily reflected the sale of our PPE business while prior year proceeds of $245 primarily reflected the sale of our Brazil tissue and professional business. We expect capital spending to be approximately $1.0 to $1.2 billion in 2025, including incremental spending from the 2024 Transformation Initiative.\nFinancing\nCash used for financing for the year ended December 31, 2024 was $3.2 billion compared to $2.4 billion in the prior year. This increase was primarily due to increased share repurchases, debt repayments and dividends paid. During 2024, we repurchased 7.2 million shares of our common stock at a cost of $1.0 billion through a broker in the open market, and paid $1.6 billion in dividends.\nWe issue long-term debt in the public market periodically. Proceeds from the offerings are used for general corporate purposes, including repayment of maturing debt or outstanding commercial paper indebtedness. See Item 8, Note 6 to the consolidated financial statements for details.\nOur short-term debt, which consists of U.S. commercial paper with original maturities up to 90 days and/or other similar short-term debt issued by non-U.S. subsidiaries, was $3 as of December 31, 2024 (included in debt payable within one year on the consolidated balance sheets). The average month-end balance of short-term debt for the year ended December 31, 2024 was $5. These short-term borrowings provide supplemental funding to support our operations. The level of short-term debt generally fluctuates depending upon the amount of operating cash flows and the timing of customer receipts and payments for items such as pension contributions, dividends and income taxes. \nWe maintain a \n$2.0 billion\n revolving credit facility which expires in \nJune 2028\n and \na $750 revolving credit \n26\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nfacility which expires in May 2025.\n \nThese facilities, currently unused, support our commercial paper program, and would provide liquidity in the event our access to the commercial paper markets is unavailable for any reason.\nAs of December 31, 2024, total debt was $7.4 billion compared to \n$8.0 billion\n as of December 31, 2023.\nIn October 2021, members of the Organization for Economic Co-operation and Development/G20 Inclusive Framework on Base Erosion and Profit Shifting Project (“Inclusive Framework”) agreed to a two-pillar solution to reform the international tax framework to realign international taxation with economic activities and value creation. Inclusive Framework members agreed to a coordinated system of Global anti-Base Erosion rules, referred to as Pillar 2, that are designed to ensure large multinational enterprises pay a minimum 15% level of tax on the income arising in each jurisdiction in which they operate. Many countries have formally implemented Pillar 2, and several other countries have draft legislation to implement this framework. The insignificant impact of Pillar 2 has been included in our consolidated financial statements. We will continue to monitor and evaluate new legislation and guidance, which could change our current assessment.\nWe believe that our ability to generate cash from operations and our capacity to issue short-term and long-term debt are adequate to fund working capital, capital spending, pension contributions, share repurchases, dividends and other needs for the foreseeable future. Further, we do not expect restrictions or taxes on repatriation of cash held outside of the U.S. to have a material effect on our overall business, liquidity, financial condition or results of operations for the foreseeable future.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with accounting principles generally accepted in the U.S. requires management to make significant estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of net sales and expenses during the reporting period. The critical accounting estimates we used in the preparation of the consolidated financial statements are those that are important both to the presentation of our financial condition and results of operations and require significant judgments by management with regard to estimates used. The critical judgments by management relate to accruals for sales incentives and trade promotion allowances, pension and other postretirement benefits, deferred income taxes and potential income tax assessments, and goodwill and other intangible assets. These critical accounting estimates have been reviewed with the Audit Committee of the Board of Directors.\nSales Incentives and Trade Promotion Allowances\nTrade promotion programs include introductory marketing funds such as slotting fees, cooperative marketing programs, temporary price reductions and other activities conducted by our customers to promote our products. Rebate and promotion accruals are based on estimates of the quantity of customer sales. Promotion accruals also consider estimates of the number of consumer coupons that will be redeemed and timing and costs of activities within the promotional programs. Generally, the estimated redemption value of consumer coupons and related expense are based on historical patterns of coupon redemption, influenced by judgments about current market conditions such as competitive activity in specific product categories, and the cost is recorded when the related revenue from customers is realized. Our related accounting policies are discussed in Item 8, Note 1 to the consolidated financial statements.\nEmployee Postretirement Benefits\nSubstantially all regular employees in the U.S. and the United Kingdom are covered by defined contribution retirement plans and certain U.S. and United Kingdom employees previously earned benefits covered by defined benefit pension plans that currently provide no future service benefit (the \"Principal Plans\"). Certain other subsidiaries have defined benefit pension plans or, in certain countries, termination pay plans covering substantially all regular employees. Our related accounting policies and account balances are discussed in Item 8, Note 8 to the consolidated financial statements.\nChanges in certain assumptions could affect pension expense and the benefit obligations, particularly the estimated long-term rate of return on plan assets and the discount rate used to calculate the obligations:\n27\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n•\nLong-term rate of return on plan assets\n. The expected long-term rate of return is evaluated on an annual basis. In setting these assumptions, we consider a number of factors including projected future returns by asset class relative to the target asset allocation. Actual asset allocations are regularly reviewed and they are periodically rebalanced to the targeted allocations when considered appropriate. \nAs of December 31, 2024, the Principal Plans had cumulative unrecognized investment and actuarial losses of approximately $1.0 billion. These unrecognized net losses may increase future pension expense if not offset by (i) actual investment returns that exceed the assumed investment returns, (ii) other factors, including reduced pension liabilities arising from higher discount rates used to calculate pension obligations, or (iii) other actuarial gains, and whether such accumulated actuarial losses at each measurement date exceed the \"corridor\" as required\n. \nIf the expected long-term rate of return on assets for the Principal Plans were lowered by 0.25%, the impact on annual pension expense would not be material in 2025\n.\n•\nDiscount rate\n. The discount (or settlement) rate used to determine the present value of our future U.S. pension obligation as of December 31, 2024 was based on a portfolio of high quality corporate debt securities with cash flows that largely match the expected benefit payments of the plan. For the United Kingdom plan, the discount rate was determined based on yield curves constructed from a portfolio of high quality corporate debt securities. Each year's expected future benefit payments were discounted to their present value at the appropriate yield curve rate to determine the pension obligations. If the discount rate assumptions for these same plans were reduced by 0.25%, the increase in annual pension expense would not be material in 2025, and the December 31, 2024 pension liability would increase by about $50.\n•\nOther assumptions\n. There are a number of other assumptions involved in the calculation of pension expense and benefit obligations, primarily related to participant demographics and benefit elections. \nPension expense for defined benefit pension plans is estimated to approximate $50 in 2025. Pension expense beyond 2025 will depend on future investment p\nerformance, our contributions to the pension trusts, changes in discount rates and various other factors related to the covered participants in the plans.\nSubstantially all U.S. retirees and employees have access to our unfunded health care and life insurance benefit plans. Changes in significant assumptions could affect the consolidated expense and benefit obligations, particularly the discount rate used to calculate the obligations and the health care cost trend rate:\n•\nDiscount rate\n. The determination of the discount rates used to calculate the benefit obligations of the plans is discussed in the pension ben\nefit section above, and the methodology for each country is the same as the methodology used to determine the discount rate for that country's pension obligation. If the discount rate assumptions for these plans were reduced by 0.25%, the impact to 2025 other postretirement benefit expense and the increase in the December 31, 2024 benefit liability would not be material. \n•\nHealth care cost trend rate\n. The health care cost trend rate is based on a combination of inputs including our recent claims history and insights from external advisers regarding recent developments in the health care marketplace, as well as projections of future trends in the marketplace.\nDeferred Income Taxes and Potential Assessments\nAs a global organization, we are subject to income tax requirements in various jurisdictions in the U.S. and internationally. Changes in certain assumptions related to income taxes could significantly affect consolidated results, particularly with regard to valuation allowances on deferred tax assets, undistributed earnings of subsidiaries outside the U.S. and uncertain tax positions. Our income tax related accounting policies, account balances and matters affecting income taxes are discussed in Item 8, Note 13 to the consolidated financial statements. \n•\nDeferred tax assets and related valuation allowances\n. We have recorded deferred tax assets related to, among other matters, income tax loss carryforwards, income tax credit carryforwards and capital loss carryforwards and have established valuation allowances against these deferred tax assets. These carryforwards are primarily in non-U.S. taxing jurisdictions and in certain states in the U.S. Foreign tax credits earned in the U.S. in current and prior years, which cannot be used currently, also give rise to net deferred tax assets. In determining the valuation allowances to establish against these deferred tax assets, \n28\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nmany factors are considered, including the specific taxing jurisdiction, the carryforward period, income tax strategies and forecasted earnings for the entities in each jurisdiction. A valuation allowance is recognized if, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred tax asset will not be realized.\n•\nUndistributed earnings\n. A\ns of December 31, 2024, we have accumulated undistributed earnings generated by our foreign subsidiaries of approximately $10.6 billion. Earnings of $3.4 billion were previously subject to U.S. federal income tax. Any additional taxes due with respect to such previously-taxed foreign earnings, if repatriated, would generally be limited to foreign and U.S. state income taxes. Deferred taxes have been recorded on $932 of earnings of foreign consolidated subsidiaries expected to be repatriated. We do not intend to distribute any remaining foreign earnings and therefore have not recorded deferred taxes for foreign and U.S. income taxes on such earnings. We consider any excess of the amount for financial reporting over the tax basis in our foreign subsidiaries to be indefinitely reinvested. The determination of deferred tax liabilities on the amount of financial reporting over tax basis or the remaining foreign earnings is not practicable.\n•\nUncertain tax positions\n. We record our global tax provision based on the respective tax rules and regulations for the jurisdictions in which we operate. Where we believe that a tax position is supportable for income tax purposes, the item is included in our income tax returns. Where treatment of a position is uncertain, a liability is recorded based upon the expected most likely outcome taking into consideration the technical merits of the position based on specific tax regulations and facts of each matter. These liabilities may be affected by changing interpretations of laws, rulings by tax authorities or the expiration of the statute of limitations.\nGoodwill and Other Intangible Assets\nGoodwill and other indefinite-lived intangible assets are not subject to amortization and are tested for impairment annually and whenever events or changes in circumstances indicate that impairment may have occurred. Intangible assets that are deemed to have finite lives are amortized over their useful lives, generally ranging from 4 to 20 years. We typically obtain the assistance of third-party valuation specialists to measure the acquisition date fair values of goodwill and other intangible assets acquired.\nEvents and conditions that could result in impairment include a sustained drop in the market price of our common shares, increased competition or loss of market share, obsolescence, product claims that result in a significant loss of sales or profitability over the product life, deterioration in macroeconomic conditions, or declining financial performance in comparison to projected results.\nGoodwill\nIn our evaluation of goodwill impairment, we have the option to first assess qualitative factors to determine whether it is more likely than not that the fair value of each reporting unit is more than its carrying value. Qualitative factors include macroeconomic, industry and competitive conditions, legal and regulatory environments, historical and projected financial performance, significant changes in the reporting unit and the magnitude of excess fair value over carrying amount from the previous quantitative impairment testing. If the qualitative assessment determines that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, then a quantitative impairment test to estimate fair value must be performed. When a quantitative test is considered necessary, estimates of fair value for goodwill impairment testing are determined based on a discounted cash flow model and a market-based approach. We use inputs from our long-range planning process to determine growth rates for sales and earnings. The other key estimates and factors used in the discounted cash flow model include, but are not limited to, discount rates, actual business trends experienced, commodity prices, foreign exchange rates, inflation and terminal growth rates.\nWe completed our required annual assessment of goodwill for impairment for all our reporting units using a qualitative assessment as of the first day of the third quarter of the year ended December 31, 2024, concluding that it was more likely than not that the fair value of each reporting unit significantly exceeded the respective carrying amounts. \n29\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nDuring the fourth quarter of 2024, our internal reporting and management structure changed, resulting in the identification of three new reportable segments defined by geographic regions and product groupings. Further, this reorganization resulted in changes to the composition of our reporting units.\nAs a result of our segment reorganization, we reassigned assets and liabilities to the applicable reporting units and allocated goodwill using a relative fair value approach. As this change in the composition of our reporting units was considered a goodwill triggering event, we performed an impairment test on both a pre- and post- reorganization basis. In both cases, we concluded there was no goodwill impairment as the fair value of each reporting unit significantly exceeded the respective carrying amounts. \nOther Intangible Assets\nWe evaluate the useful lives of our other intangible assets, primarily brands, to determine if they are finite or indefinite-lived. Reaching a determination on useful life requires significant judgments and assumptions regarding the future effects of obsolescence, demand, competition, other economic factors (such as the stability of the industry, known technological advances and expected changes in distribution channels), the level of required maintenance expenditures, and the expected lives of other related groups of assets.\nOur estimate of the fair value of our brand assets is based on a discounted cash flow model and a market-based approach using inputs which include projected revenues from our long-range plan, assumed royalty rates that could be payable if we did not own the brands, and a discount rate. The cash flows used in the discounted cash flow model are consistent with those we use in our internal planning, which gives consideration to actual business trends experienced and the long-term business strategy.\nWe performed our 2024 impairment assessment of our intangible assets as of the first day of the third quarter using a qualitative assessment. Other than discussed in Item 8, Note 4 to the consolidated financial statements, no additional impairment indicators were found to be present. \nNew Accounting Standards\nSee Item 8, Note 1 to the consolidated financial statements for a description of recent accounting standards and their anticipated effects on our consolidated financial statements.\nForward Looking Statements\nCertain matters contained in this report concerning the business outlook, including raw material, energy and other input costs, the anticipated charges and savings from the 2024 Transformation Initiative, cash flow and uses of cash, growth initiatives, innovations, marketing and other spending, net sales, anticipated currency rates and exchange risks, including the impact in Argentina and Türkiye, effective tax rate, contingencies and anticipated transactions of Kimberly-Clark, including dividends, share repurchases and pension contributions, constitute \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995 and are based upon management's expectations and beliefs concerning future events impacting Kimberly-Clark. There can be no assurance that these future events will occur as anticipated or that our results will be as estimated. Forward-looking statements speak only as of the date they were made, and we undertake no obligation to publicly update them.\nThe assumptions used as a basis for the forward-looking statements include many estimates that, among other things, depend on the achievement of future cost savings and projected volume increases. In addition, many factors outside our control, including the risk that we are not able to realize the anticipated benefits of the 2024 Transformation Initiative (including risks related to disruptions to our business or operations or related to any delays in implementation), war in Ukraine (including the related responses of consumers, customers, and suppliers and sanctions issued by the U.S., the European Union, Russia or other countries), pandemics, epidemics, fluctuations in foreign currency exchange rates, the prices and availability of our raw materials, supply chain disruptions, disruptions in the capital and credit markets, counterparty defaults (including customers, suppliers and financial institutions with which we do business), failure to realize the expected benefits or synergies from our acquisition and disposition activity, impairment of goodwill and intangible assets and our projections of operating results and other factors that may affect our impairment testing, changes in customer preferences, severe weather conditions, regional instabilities and hostilities (including the war in Israel), government trade or similar regulatory actions, \n30\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\npotential competitive pressures on selling prices for our products, energy costs, general economic and political conditions globally and in the markets in which we do business, as well as our ability to maintain key customer relationships, could affect the realization of these estimates.\nThe factors described under Item 1A, \"Risk Factors\" in this Annual Report on Form 10-K, or in our other SEC filings, among others, could cause our future results to differ from those expressed in any forward-looking statements made by us or on our behalf. Other factors not presently known to us or that we presently consider immaterial could also affect our business operations and financial results.\nSUMMARY OF NON-GAAP FINANCIAL MEASURES\nThe following provides the reconciliation of the non-GAAP financial measures provided in this report to the most closely related GAAP measure. These measures include: Organic Sales Growth, Adjusted Gross Profit, Adjusted Operating Profit, Adjusted Earnings per Share, and Adjusted Effective Tax Rate. \n•\nOrganic Sales Growth is defined as the change in consolidated Net Sales, as determined in accordance with U.S. GAAP, excluding the impacts of currency translation and divestitures and business exits. \n•\nAdjusted Gross and Operating Profit, Adjusted Earnings per Share, and Adjusted Effective Tax Rate are defined as consolidated Gross Profit, Operating Profit, Diluted Earnings per Share, and Effective Tax Rate, respectively, as determined in accordance with U.S. GAAP, excluding the impacts of certain items that management believes do not reflect our underlying operations, and which are discussed in further detail below. \nThe income tax effect of these non-GAAP items on the Company's Adjusted Earnings per Share is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment. The impact of these non-GAAP items on the Company’s effective tax rate represents the difference in the effective tax rate calculated with and without the non-GAAP adjustment on Income Before Income Taxes and Equity Interests and Provision for income taxes. \nWe use these non-GAAP financial measures to assist in comparing our performance on a consistent basis for purposes of business decision making by removing the impact of certain items that we do not believe reflect our underlying and ongoing operations. We believe that presenting these non-GAAP financial measures is useful to investors because it (i) provides investors with meaningful supplemental information regarding financial performance by excluding certain items, (ii) permits investors to view performance using the same tools that management uses to budget, make operating and strategic decisions, and evaluate historical performance, and (iii) otherwise provides supplemental information that may be useful to investors in evaluating our results. We believe that the presentation of these non-GAAP financial measures, when considered together with the corresponding U.S. GAAP financial measures and the reconciliation to those measures, provides investors with additional understanding of the factors and trends affecting our business than could be obtained absent these disclosures. \nThese non-GAAP financial measures are not meant to be considered in isolation or as a substitute for the comparable GAAP measures, and they should be read only in conjunction with our consolidated financial statements prepared in accordance with GAAP. There are limitations to these non-GAAP financial measures because they are not prepared in accordance with GAAP and may not be comparable to similarly titled measures of other companies due to potential differences in methods of calculation and items being excluded. We compensate for these limitations by using these non-GAAP financial measures as a supplement to the GAAP measures and by providing reconciliations of the non-GAAP and comparable GAAP financial measures. \nThe non-GAAP financial measures exclude the following items for the relevant time periods:\n•\n2024 Transformation Initiative - We initiated this transformation to create a more agile and focused operating structure that will accelerate our proprietary pipeline of innovation in right-to-win spaces and improve our growth trajectory, profitability, and returns on investment. Results in 2024 include charges related to this program. See Item 8, Note 2 to the consolidated financial statements for details.\n•\nSale of PPE Business - In 2024, we recognized a gain related to the sale of our PPE business. See Item 8, Note 3 to the consolidated financial statements for details.\n31\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\n•\nImpairment of Intangible Assets - In 2024 and 2023, we recognized charges related to the impairment of certain intangible assets related to Softex and Thinx. See Item 8, Note 4 to the consolidated financial statements for details.\n•\nLegal Expense - In 2024, we incurred certain costs related to litigation and regulatory matters for a previously exited business. \n•\nSoftex Tax Reserve Release - In 2024, we released a reserve for an uncertain tax position related to the prior year impairment of certain Softex intangible assets. \n•\nSale of Brazil Tissue and Professional Business - In 2023, we recognized a net benefit related to the sale of our Neve tissue brand and related consumer and professional tissue assets. See Item 8, Note 3 to the consolidated financial statements for details.\n•\nPension Settlements - In 2023, pension settlement charges were recognized related to lump-sum distributions from pension plan assets exceeding the total of annual service and interest costs resulting in a recognition of deferred actuarial losses.\nThe following tables provide a reconciliation of Organic Sales Growth:\nYear Ended December 31, 2024\nPercent change vs. the prior year period\nNA\nIPC\nIFP\nConsolidated\nNet Sales Growth\n0.2\n \n(3.1)\n(5.9)\n(1.8)\nCurrency Translation\n0.1\n \n12.2\n \n1.2\n \n3.8\n \nDivestitures and Business Exits\n0.8\n \n0.1\n \n4.5\n \n1.2\n \nOrganic Sales Growth\n1.1\n \n9.2\n \n(0.2)\n3.2\n \nYear Ended December 31, 2023\nPercent change vs. the prior year period\nNA\nIPC\nIFP\nConsolidated\nNet Sales Growth\n4.9 \n(2.6)\n(2.9)\n1.3 \nCurrency Translation\n0.3 \n7.9 \n1.8 \n2.8 \nDivestitures and Business Exits\n(0.2)\n— \n3.9 \n0.6 \nOrganic Sales Growth\n5.0 \n5.3 \n2.8 \n4.7 \nThe following table provides a reconciliation of Adjusted Gross Profit: \nYear Ended December 31\n2024\n2023\nGross Profit\n$\n7,180\n \n$\n7,032 \n2024 Transformation Initiative\n144\n \n— \nSale of Brazil Tissue and Professional Business\n—\n \n15 \nAdjusted Gross Profit\n$\n7,324\n \n$\n7,047 \n32\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe following table provides a reconciliation of Adjusted Operating Profit: \nYear Ended December 31\n2024\n2023\nOperating Profit\n$\n3,210\n \n$\n2,344 \n2024 Transformation Initiative\n456\n \n— \nSale of PPE Business\n(565)\n— \nImpairment of Intangible Assets\n97\n \n658 \nLegal Expense\n39\n \n— \nSale of Brazil Tissue and Professional Business\n—\n \n(44)\nAdjusted Operating Profit\n$\n3,237\n \n$\n2,958 \nThe following table provides a reconciliation of Adjusted Earnings per Share:\nYear Ended December 31\n2024\n2023\nDiluted Earnings per Share\n$\n7.55\n \n$\n5.21 \n2024 Transformation Initiative\n1.01\n \n— \nSale of PPE Business\n(1.34)\n— \nImpairment of Intangible Assets\n0.17\n \n1.36 \nLegal Expense\n0.11\n \n— \nSoftex Tax Reserve Release\n(0.20)\n— \nSale of Brazil Tissue and Professional Business\n—\n \n(0.08)\nPension Settlements\n—\n \n0.08 \nAdjusted Earnings per Share\n(a)\n$\n7.30\n \n$\n6.57 \n(a)    The non-GAAP adjustments included above are presented net of tax. The income tax effect of these non-GAAP items is calculated based upon the tax laws and statutory income tax rates applicable in the tax jurisdiction(s) of the underlying non-GAAP adjustment. Refer to the Adjusted Effective Tax Rate reconciliation below for the tax effect of these adjustments on the Company's reported Provision for income taxes.\n33\nKIMBERLY-CLARK CORPORATION\n - 2024 Annual Report\nThe following table provides a reconciliation of the Adjusted Effective Tax Rate:\nYear Ended December 31\n2024\n2023\nIncome Before Income Taxes and Equity Interests\nProvision for Income Taxes\nIncome Before Income Taxes and Equity Interests\nProvision for Income Taxes\nAs Reported\n$\n2,927\n \n$\n(565)\n$\n2,021 \n$\n(453)\n2024 Transformation Initiative\n457\n \n(118)\n— \n— \nSale of PPE Business\n(565)\n112\n \n— \n— \nImpairment of Intangible Assets\n97\n \n(40)\n658 \n(175)\nLegal Expense\n39\n \n(1)\n— \n— \nSoftex Tax Reserve Release\n—\n \n(67)\n— \n— \nSale of Brazil Tissue and Professional Business\n—\n \n—\n \n(44)\n18 \nPension Settlements\n—\n \n—\n \n35 \n(9)\nAs Adjusted\n$\n2,955\n \n$\n(679)\n$\n2,670 \n$\n(619)\nEffective Tax Rate:\nAs Reported\n19.3\n \n%\n22.4 \n%\nAs Adjusted\n23.0\n \n%\n23.2 \n%",
  "item2": null
}