{
  "item1": "Mexico (a substantial part central Mexico, well southeast northeast Mexico), Guatemala, Colombia (most country), Nicaragua, Costa Rica, Panama, Venezuela, Uruguay, Brazil (a major part states São Paulo Minas Gerais; states Mato Grosso do Sul, Paraná, Rio Grande do Sul, Santa Catarina; part states Goiás Rio de Janeiro), Argentina (federal capital Buenos Aires surrounding areas); Coca-Cola Europacific Partners plc (“CCEP”), which bottling distribution operations Andorra, Australia, Belgium, continental France, Germany, Great Britain, Iceland, Indonesia, Luxembourg, Monaco, Netherlands, New Zealand Pacific Islands, Norway, Papua New Guinea, Philippines, Portugal, Spain Sweden; Coca-Cola HBC AG (“Coca-Cola Hellenic”), which bottling distribution operations Armenia, Austria, Belarus, Bosnia Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Egypt, Estonia, Greece, Hungary, Italy, Latvia, Lithuania, Moldova, Montenegro, Nigeria, North Macedonia, Northern Ireland, Poland, Republic Ireland, Romania, Russia, Serbia, Slovakia, Slovenia, Switzerland Ukraine; Arca Continental, S.A.B. de C.V., which bottling distribution operations northern western Mexico, northern Argentina, Ecuador, Peru, state Texas part states New Mexico, Oklahoma Arkansas United States; Swire Coca-Cola Limited, which bottling distribution operations 11 provinces Shanghai municipality mainland China, Hong Kong, Taiwan, Cambodia, Laos, Thailand, Vietnam territories 13 states western United States. 2024, these five bottling partners combined represented 44% total worldwide unit case volume. Being bottler does not create legal partnership joint venture between us bottlers.",
  "item7": "Company recognizes interest penalties related unrecognized tax benefits line item income taxes consolidated statement income. Company $631 million $544 million interest penalties related unrecognized tax benefits accrued December 31, 2024 2023, respectively. these amounts, expense $87 million $48 million recognized 2024 2023, respectively. If Company prevail all uncertain tax positions, reversal accrual would benefit Company’s effective tax rate.",
  "item2": "Calculation not meaningful. Three Months Ended September 26, 2025 versus Three Months Ended September 27, 2024 During three months ended September 26, 2025, operating income $3,982 million, compared $2,510 million during three months ended September 27, 2024, increase $1,472 million, 59%. increase driven lower other operating charges favorable pricing initiatives, partially offset higher commodity costs unfavorable foreign currency exchange rate impact 4%. Fluctuations foreign currency exchange rates, including effects hedging activities, unfavorably impacted consolidated operating income 4% due stronger U.S."
}