{
  "source_file": "kr-20250816x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n​\nThe following analysis should be read in conjunction with the Consolidated Financial Statements.\n​\nCAUTIONARY STATEMENT\n​\nThis discussion and analysis contains certain forward-looking statements about our future performance. These statements are based on management’s assumptions and beliefs in light of the information currently available to it. Such statements are indicated by words such as “accelerate,” “achieve,” “affect,” “anticipate,” “believe,” “committed,” “confident,” “continue,” “could,” “drive,” “enable,” “ensure,” “estimate,” “expect,” “future,” “goals,” “initiatives,” “maintain,” “may,” “model,” “plan,” “position,” “strategy,” “target,” “trend,” and “will,” and similar words or phrases. These forward-looking statements are subject to uncertainties and other factors that could cause actual results to differ materially. These include the specific risk factors identified in “Risk Factors” in our Annual Report on Form 10-K for our last fiscal year and any subsequent filings, as well as those identified in this Form 10-Q.\n​\nVarious uncertainties and other factors could cause actual results to differ materially from those contained in the forward-looking statements. These include:\n​\n●\nThe extent to which our sources of liquidity are sufficient to meet our requirements may be affected by the state of the financial markets and the effect that such condition has on our ability to issue commercial paper at acceptable rates. Our ability to borrow under our committed lines of credit, including our bank credit facilities, could be impaired if one or more of our lenders under those lines is unwilling or unable to honor its contractual obligation to lend to us, or in the event that global pandemics, natural disasters or weather conditions interfere with the ability of our lenders to lend to us. Our ability to refinance maturing debt may be affected by the state of the financial markets. \n​\n●\nOur ability to achieve sales, earnings and incremental FIFO operating profit goals may be affected by: labor negotiations; potential work stoppages; changes in the unemployment rate; pressures in the labor market; changes in government-funded benefit programs; changes in the types and numbers of businesses that compete with us; pricing and promotional activities of existing and new competitors, and the aggressiveness of that competition; our response to these actions; the state of the economy, including interest rates, the inflationary, disinflationary and/or deflationary trends and such trends in certain commodities, products and/or operating costs; the geopolitical environment including wars and conflicts; unstable political situations and social unrest; changes in tariffs; the effect that fuel costs have on consumer spending; volatility of fuel margins; manufacturing commodity costs; supply constraints; diesel fuel costs related to our logistics operations; trends in consumer spending; the extent to which our customers exercise caution in their purchasing in response to economic conditions; the uncertainty of economic growth or recession; stock repurchases; changes in the regulatory environment in which we operate, along with changes in federal policy and at regulatory agencies; our ability to retain pharmacy sales from third-party payors; consolidation in the healthcare industry, including pharmacy benefit managers; our ability to negotiate modifications to multi-employer pension plans; natural disasters or adverse weather conditions; the effect of public health crises or other significant catastrophic events; the potential costs and risks associated with potential cyber-attacks or data security breaches; the success of our future growth plans; the ability to execute our growth strategy and value creation model, including continued cost savings, growth of our alternative profit businesses, and our ability to better serve our customers and to generate customer loyalty and sustainable growth through our strategic pillars of Fresh, \nOur Brands\n, personalization, and eCommerce; the outcome of litigation matters, including those relating to the terminated transaction with Albertsons; and the risks relating to or arising from our opioid litigation settlements, including the risk of litigation relating to persons, entities, or jurisdictions that do not participate in those settlements. \n​\n●\nOur ability to achieve these goals may also be affected by our ability to manage the factors identified above. Our ability to execute our financial strategy may be affected by our ability to generate cash flow.\n​\n18\n\n\n​\n●\nOur adjusted effective tax rate may differ from the expected rate due to changes in tax laws and policies, the status of pending items with various taxing authorities and the deductibility of certain expenses.\n​\nStatements elsewhere in this report and below regarding our expectations, projections, beliefs, intentions or strategies are forward-looking statements within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. While we believe that the statements are accurate, uncertainties about the general economy, our labor relations, our ability to execute our plans on a timely basis and other uncertainties described in this report and other reports that we file with the Securities and Exchange Commission could cause actual results to differ materially. We assume no obligation to update the information contained in this report unless required by applicable law.\n​\nOUR VALUE CREATION MODEL – DELIVERING CONSISTENT AND ATTRACTIVE TOTAL SHAREHOLDER RETURN\n​\nKroger’s proven value creation model is allowing us to deliver today and invest for the future. The foundation of our value creation model is our omnichannel retail business, including fuel and health and wellness. By executing on our go-to- market strategy built on the four pillars of Fresh, \nOur Brands\n, Personalization and eCommerce, we are creating a shopping experience that builds loyalty and grows sales. Our retail business generates traffic and data which accelerates growth in our high operating margin alternative profit businesses, like retail media. In turn, the value generated from these businesses enables us to reinvest back into our retail business.\n​\nWe are focused on enhancing our pillars and delivering an exceptional customer experience to accelerate this flywheel effect. By expanding our store network and improving our eCommerce capabilities, we expect to grow households and increase sales. Our model provides various ways to generate net earnings growth.\n​\nThis\n \nwill\n be \nachieved \nby:\n​\n●\nGrowing identical sales without fuel. Our plan involves maximizing growth opportunities in our retail business and is supported by continued strategic investments in our associates and greater value for our customers to ensure we deliver a full, fresh and friendly experience for every customer, every time. In an effort to serve more households, we will invest in major storing projects that allow us to increase both in store and eCommerce sales. As more and more customers incorporate eCommerce into their permanent routines, we expect eCommerce sales to grow at a double-digit rate – a faster pace than other food at home sales – over time; and\n​\n●\nExpanding operating margin through long-term initiatives in gross margin, growing alternative profit businesses and productivity and cost savings initiatives that are focused on simplifying our business and modernizing our ways of working. Together, these will enable us to improve operating margin, while balancing strategic price investments for customers and investments in associates to improve customer experience.\n​\nWe expect to continue to generate strong free cash flow and are committed to being disciplined with capital deployment in support of our value creation model and stated capital allocation priorities. Our first priority is to invest in the business through attractive high return opportunities that drive long-term sustainable net earnings growth. We are committed to maintaining our current investment grade debt rating and our net total debt to adjusted EBITDA ratio target range of 2.30 to 2.50. We also expect to continue to grow our dividend over time and return excess cash to shareholders via stock repurchases, subject to Board approval.\n​\nWe expect our value creation model will result in total shareholder return within our target range of 8% to 11% over time.\n​\n19\n\n\n​\nEXECUTIVE SUMMARY\n​\nKroger delivered another quarter of strong results, which demonstrates the clear and measurable progress we’ve made on our priorities – to simplify our organization, to improve the customer experience and to focus on work that creates the most value.  Sales growth has been strong, led by pharmacy, eCommerce and Fresh, and we are encouraged by the improvement in grocery volumes.  We are executing better in our stores and we are more focused on our core business and our core customer. We are moving with speed and we are simplifying the company.  \n​\n We continue to believe that our strategy focusing on Fresh, \nOur Brands\n and eCommerce will continue to resonate with customers and our resilient model positions us well to navigate the current environment.  We are focused on investments that will grow our core business and maximize return on invested capital over time, while remaining committed to maintaining our current investment grade rating, growing our dividend, subject to board approval, and returning excess capital to shareholders.  We are confident that by executing on these key priorities, we will generate long-term growth and attractive shareholder returns.\n​\nThe following table provides highlights of our financial performance:\n​\nFinancial Performance Data\n($ in millions, except per share amounts)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n​\n​\nTwo Quarters Ended\n​\n​\n​\nAugust 16,\n   \nPercentage\n   \nAugust 17,\n​\n​\nAugust 16,\n   \nPercentage\n   \nAugust 17,\n​\n​\n​\n2025\n​\nChange\n​\n2024\n​\n​\n2025\n​\nChange\n​\n2024\n​\nSales\n​\n$\n 33,940\n​\n 0.1\n%  \n$\n 33,912\n​\n​\n$\n 79,058\n​\n (0.2)\n%  \n$\n 79,181\n​\nSales without fuel\n​\n$\n 30,671\n​\n 1.3\n%  \n$\n 30,276\n​\n​\n$\n 71,449\n​\n 1.2\n%  \n$\n 70,587\n​\nIdentical sales excluding fuel and Adjusted Items\n(1)\n​\n​\n 3.4\n%  \nN/A\n​\n​\n 1.2\n%\n​\n​\n 3.3\n%  \nN/A\n​\n​\n 0.8\n%\nFIFO gross margin rate, excluding rent, depreciation and amortization, fuel and Adjusted Items, bps increase\n​\n​\n 0.39\n​\nN/A\n​\n​\n 0.42\n​\n​\n​\n 0.62\n​\nN/A\n​\n​\n 0.14\n​\nOG&A rate, excluding fuel and Adjusted Items, bps increase (decrease)\n​\n​\n (0.05)\n​\nN/A\n​\n​\n 0.65\n​\n​\n​\n 0.34\n​\nN/A\n​\n​\n 0.40\n​\nOperating profit\n​\n$\n 863\n​\n 5.9\n%  \n$\n 815\n​\n​\n$\n 2,185\n​\n 3.6\n%  \n$\n 2,109\n​\nAdjusted FIFO operating profit\n​\n$\n 1,091\n​\n 10.9\n%  \n$\n 984\n​\n​\n$\n 2,610\n​\n 5.1\n%  \n$\n 2,483\n​\nNet earnings attributable to The Kroger Co. \n​\n$\n 609\n​\n 30.7\n%  \n$\n 466\n​\n​\n$\n 1,475\n​\n 4.4\n%  \n$\n 1,413\n​\nAdjusted net earnings attributable to The Kroger Co.\n​\n$\n 695\n​\n 2.1\n%  \n$\n 681\n​\n​\n$\n 1,690\n​\n (2.2)\n%  \n$\n 1,728\n​\nNet earnings attributable to The Kroger Co. per diluted common share\n​\n$\n 0.91\n​\n 42.2\n%  \n$\n 0.64\n​\n​\n$\n 2.20\n​\n 14.0\n%  \n$\n 1.93\n​\nAdjusted net earnings attributable to The Kroger Co. per diluted common share\n​\n$\n 1.04\n​\n 11.8\n%  \n$\n 0.93\n​\n​\n$\n 2.53\n​\n 7.2\n%  \n$\n 2.36\n​\nDividends paid\n​\n$\n 211\n​\n 0.5\n%  \n$\n 210\n​\n​\n$\n 422\n​\n 0.5\n%  \n$\n 420\n​\nDividends paid per common share\n​\n$\n 0.32\n​\n 10.3\n%  \n$\n 0.29\n​\n​\n$\n 0.64\n​\n 10.3\n%  \n$\n 0.58\n​\nShare repurchases\n​\n$\n 22\n​\nN/A\n​\n$\n 13\n​\n​\n$\n 203\n​\nN/A\n​\n$\n 116\n​\nIncrease in total debt, including obligations under finance leases compared to prior fiscal year end\n​\n$\n 54\n​\nN/A\n​\n$\n 4\n​\n​\n$\n 54\n​\nN/A\n​\n$\n 4\n​\n(1)\nFor the first quarter of 2025, identical sales, excluding fuel, were adjusted to exclude stores involved in the labor disputes in Colorado.  Identical sales, excluding fuel, were excluded for the first four weeks of the first quarters of 2025 and 2024 for stores involved in this labor dispute. \n​\n20\n\n\n​\nOVERVIEW\n​\nNotable items for the second quarter and first two quarters of 2025 are:\n​\nShareholder Return\n​\n●\nNet earnings attributable to The Kroger Co. per diluted common share of $0.91 for the second quarter and $2.20 for the first two quarters of 2025.\n​\n●\nAdjusted net earnings attributable to The Kroger Co. per diluted common share of $1.04 for the second quarter and $2.53 for the first two quarters of 2025. This represents a 12% increase for the second quarter of 2025 compared to the second quarter of 2024 and a 7% increase for the first two quarters of 2025 compared to the first two quarters of 2024.\n​\n●\nAchieved operating profit of $863 million for the second quarter and $2.2 billion for the first two quarters of 2025. \n​\n●\nAchieved adjusted FIFO operating profit of $1.1 billion for the second quarter and $2.6 billion for the first two quarters of 2025. This represents an 11% increase for the second quarter of 2025 compared to the second quarter of 2024 and a 5% increase for the first two quarters of 2025 compared to the first two quarters of 2024.\n​\n●\nGenerated cash flows from operations of $3.7 billion for the first two quarters of 2025, which represents a 6% increase compared to the first two quarters of 2024.\n​\n●\nCash and temporary cash investments increased by $924 million from $4.0 billion as of fiscal year end 2024 to $4.9 billion as of August 16, 2025.\n​\n●\nReturned $625 million to shareholders from share repurchases and dividend payments in the first two quarters of 2025.\n​\nOther Financial Results\n​\n●\nIdentical sales, excluding fuel and Adjusted Items, increased 3.4% in the second quarter and 3.3% in the first two quarters of 2025.  Our sales growth was led by strong pharmacy, eCommerce and Fresh sales.\n​\n●\neCommerce sales increased 16% in the second quarter and 15% in the first two quarters of 2025, compared to the same periods of 2024. eCommerce sales include products ordered online and picked up at our stores and our Delivery and Ship solutions. Our Delivery solutions include orders delivered to customers from retail store locations, customer fulfillment centers and orders placed through third-party platforms. Our Ship solutions primarily include online orders placed through our owned platforms that are dispatched using mail service or third-party courier.  eCommerce sales growth was led by strong demand for our Delivery solutions. \n​\nSignificant Events\n​\n●\nDuring the first quarter of 2025, we recognized store closure costs of $100 million, $77 million net of tax, related to the planned closing of approximately 60 stores over the next 18 months. As a result of these store closures, we expect a modest financial benefit and we are committed to reinvesting these savings back into the customer experience. We will offer roles in other stores to all associates currently employed at the affected stores.\n​\n21\n\n\n​\n●\nDuring the first quarter of 2025, in addition to the recurring multi-employer pension contributions we make in the normal course of business, we contributed an incremental $60 million, $46 million net of tax, to multi-employer pension plans, helping stabilize future associate benefits and allowing us to pre-fund future requirements.  Total multi-employer pension contributions drove a 16 basis point increase in our operating, general and administrative expenses (“OG&A”) rate in the first two quarters of 2025, compared to the first two quarters of 2024 (the “2025 Multi-Employer Pension Contributions”).\n​\n●\nDuring the second quarter of 2025, we approved and implemented a plan to reduce our corporate administrative team by nearly 1,000 associates, resulting in a charge for severance and related benefits of $47 million, $37 million net of tax. This reorganization is expected to increase efficiency and reduce administrative costs, enabling us to reinvest back into our retail business.\n​\nUSE OF NON-GAAP FINANCIAL MEASURES\n​\nThe accompanying Consolidated Financial Statements, including the related notes, are presented in accordance with generally accepted accounting principles (“GAAP”). We provide non-GAAP measures, including First-In, First-Out (“FIFO”) gross margin, FIFO operating profit, adjusted FIFO operating profit, adjusted net earnings and adjusted net earnings per diluted share because management believes these metrics are useful to investors and analysts. These non- GAAP financial measures should not be considered as an alternative to gross margin, operating profit, net earnings and net earnings per diluted share or any other GAAP measure of performance. These measures should not be reviewed in isolation or considered as a substitute for our financial results as reported in accordance with GAAP.\n​\nWe calculate FIFO gross margin as FIFO gross profit divided by sales. FIFO gross profit is calculated as sales less merchandise costs, including advertising, warehousing and transportation expenses, but excluding the Last-In, First-Out (“LIFO”) charge, rent and depreciation and amortization. FIFO gross margin is an important measure used by management, and management believes FIFO gross margin is a useful metric to investors and analysts because it measures the merchandising and operational effectiveness of our go-to-market strategy.\n​\nWe calculate FIFO operating profit as operating profit excluding the LIFO charge. FIFO operating profit is an important measure used by management, and management believes FIFO operating profit is a useful metric to investors and analysts because it measures the operational effectiveness of our financial model.\n​\nThe adjusted net earnings, adjusted net earnings per diluted share and adjusted FIFO operating profit metrics are important measures used by management to compare the performance of core operating results between periods. We believe adjusted net earnings, adjusted net earnings per diluted share and adjusted FIFO operating profit are useful metrics to investors and analysts because they present more accurate year-over-year comparisons of our net earnings, net earnings per diluted share and FIFO operating profit because adjusted items are not the result of our normal operations. Net earnings for the first two quarters of 2025 include the following, which we define as the “2025 Adjusted Items”:\n​\n●\nCharges to OG&A of $100 million, $77 million net of tax, for store closures; $136 million, $102 million net of tax, for merger-related litigation and settlement charges; $22 million, $17 million net of tax, for opioid settlement charges and vendor reserves; $47 million, $37 million net of tax, for severance charge and related benefits and a credit to OG&A of $21 million, $16 million net of tax, for executive stock compensation for a former executive (the “2025 OG&A Adjusted Items”).\n​\n●\nA gain in other income (expense) of $37 million, $28 million net of tax, for the unrealized gain on investments (the “2025 Other Income (Expense) Adjusted Item”).\n​\n●\nA reduction to income tax expense of $7 million for executive stock compensation for a former executive income tax adjustment (the “2025 Income Tax Expense Adjusted Item”).\n​\n●\nA net charge to Sales, Merchandise costs and OG&A of $44 million, $33 million net of tax, for labor dispute charges (the “Labor Dispute”).\n​\n22\n\n\n​\nNet earnings for the second quarter of 2025 include the following, which we define as the “2025 Second Quarter Adjusted Items”:\n​\n●\nCharges to OG&A of $121 million, $92 million net of tax, for merger-related litigation and settlement charges and $47 million, $37 million net of tax, for severance charge and related benefits (the “2025 Second Quarter OG&A Adjusted Items”).\n​\n●\nA gain in other income (expense) of $56 million, $43 million net of tax, for the unrealized gain on investments (the “2025 Other Income (Expense) Second Quarter Adjusted Item”).\n​\nNet earnings for the first two quarters of 2024 include the following, which we define as the “2024 Adjusted Items”:\n​\n●\nCharges to OG&A of $323 million, $266 million net of tax, for merger related costs (the “2024 OG&A Adjusted Item”).\n​\n●\nA loss in other income (expense) of $105 million, $80 million net of tax, for the loss on investments (the “2024 Other Income (Expense) Adjusted Item”).\n​\n●\nA reduction to income tax expense of $31 million due to a held for sale income tax adjustment related to the sale of our Kroger Specialty Pharmacy business (the “2024 Income Tax Expense Adjusted Item”).\n​\nNet earnings for the second quarter of 2024 include the following, which we define as the “2024 Second Quarter Adjusted Items”:\n​\n●\nCharges to OG&A of $148 million, $123 million net of tax, for merger related costs (the “2024 Second Quarter OG&A Adjusted Item”).\n​\n●\nLosses in other income (expense) of $121 million, $92 million net of tax, for the unrealized loss on investments (the “2024 Second Quarter Other Income (Expense) Adjusted Item”).\n​\nPlease refer to the “Net Earnings per Diluted Share excluding the Adjusted Items” table below for reconciliations of certain non-GAAP financial measures reported in this Quarterly Report on Form 10-Q to the most comparable GAAP financial measures and related disclosure.\n​\n23\n\n\n​\nThe following table provides a reconciliation of net earnings attributable to The Kroger Co. to adjusted net earnings attributable to The Kroger Co. and a reconciliation of net earnings attributable to The Kroger Co. per diluted common share to adjusted net earnings attributable to The Kroger Co. per diluted common share, excluding the 2025 and 2024 Adjusted Items:\n​\nNet Earnings per Diluted Share excluding the Adjusted Items\n($ in millions, except per share amounts)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n​\nTwo Quarters Ended\n \n​\n   \nAugust 16,\n   \nAugust 17,\n   \nPercentage\n   \nAugust 16,\n   \nAugust 17,\n   \nPercentage\n   \n​\n​\n2025\n​\n2024\n​\nChange\n​\n2025\n​\n2024\n​\nChange\n \nNet earnings attributable to The Kroger Co.\n​\n$\n 609\n​\n$\n 466\n \n​\n​\n$\n 1,475\n​\n$\n 1,413\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(Income) expense adjustments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjustment for (gain) loss on investments\n(1)(2)\n​\n​\n (43)\n​\n​\n 92\n​\n​\n​\n​\n (28)\n​\n​\n 80\n​\n​\n​\nAdjustment for labor dispute charges\n(1)(3)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 33\n​\n​\n —\n​\n​\n​\nAdjustment for store closures\n(1)(4)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 77\n​\n​\n —\n​\n​\n​\nAdjustment for executive stock compensation for a former executive\n(1)(5)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n (16)\n​\n​\n —\n​\n​\n​\nAdjustment for merger-related costs\n(1)(6)\n​\n​\n —\n​\n​\n 123\n​\n​\n​\n​\n —\n​\n​\n 266\n​\n​\n​\nAdjustment for merger-related litigation and settlement charges\n(1)(7)\n​\n​\n 92\n​\n​\n —\n​\n​\n​\n​\n 102\n​\n​\n —\n​\n​\n​\nAdjustment for opioid settlement charges and vendor reserves\n(1)(8)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 17\n​\n​\n —\n​\n​\n​\nAdjustment for severance charge and related benefits\n(1)(9)\n​\n​\n 37\n​\n​\n —\n​\n​\n​\n​\n 37\n​\n​\n —\n​\n​\n​\nExecutive stock compensation for a former executive income tax adjustment\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n (7)\n​\n​\n —\n​\n​\n​\nHeld for sale income tax adjustment\n​\n \n —\n​\n \n —\n​\n​\n​\n \n —\n​\n​\n (31)\n​\n​\n​\n2025 and 2024 Adjusted Items\n​\n​\n 86\n​\n​\n 215\n​\n​\n​\n​\n 215\n​\n​\n 315\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet earnings attributable to The Kroger Co. excluding the Adjusted Items\n​\n$\n 695\n​\n$\n 681\n \n 2.1\n%  \n$\n 1,690\n​\n$\n 1,728\n \n (2.2)\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet earnings attributable to The Kroger Co. per diluted common share\n​\n$\n 0.91\n​\n$\n 0.64\n \n​\n​\n$\n 2.20\n​\n$\n 1.93\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n(Income) expense adjustments\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjustment for (gain) loss on investments\n(10)\n​\n​\n (0.06)\n​\n​\n 0.12\n​\n​\n​\n​\n (0.04)\n​\n​\n 0.10\n​\n​\n​\nAdjustment for labor dispute charges\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 0.05\n​\n​\n —\n​\n​\n​\nAdjustment for store closures\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 0.12\n​\n​\n —\n​\n​\n​\nAdjustment for executive stock compensation for a former executive\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n (0.03)\n​\n​\n —\n​\n​\n​\nAdjustment for merger-related costs\n(10)\n​\n​\n —\n​\n​\n 0.17\n​\n​\n​\n​\n —\n​\n​\n 0.37\n​\n​\n​\nAdjustment for merger-related litigation and settlement charges\n(10)\n​\n​\n 0.14\n​\n​\n —\n​\n​\n​\n​\n 0.16\n​\n​\n —\n​\n​\n​\nAdjustment for opioid settlement charges and vendor reserves\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n 0.03\n​\n​\n —\n​\n​\n​\nAdjustment for severance charge and related benefits\n(10)\n​\n​\n 0.05\n​\n​\n —\n​\n​\n​\n​\n 0.05\n​\n​\n —\n​\n​\n​\nExecutive stock compensation for a former executive income tax adjustment\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n (0.01)\n​\n​\n —\n​\n​\n​\nHeld for sale income tax adjustment\n(10)\n​\n​\n —\n​\n​\n —\n​\n​\n​\n​\n —\n​\n​\n (0.04)\n​\n​\n​\n2025 and 2024 Adjusted Items\n​\n \n 0.13\n​\n \n 0.29\n​\n​\n​\n \n 0.33\n​\n \n 0.43\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjusted net earnings attributable to The Kroger Co. per diluted common share\n​\n$\n 1.04\n​\n$\n 0.93\n \n 11.8\n%  \n$\n 2.53\n​\n$\n 2.36\n \n 7.2\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAverage number of common shares used in diluted calculation\n​\n \n 665\n​\n \n 727\n​\n​\n​\n \n 664\n​\n \n 728\n​\n​\n​\n​\n24\n\n\n​\nNet Earnings per Diluted Share excluding the Adjusted Items (continued)\n($ in millions, except per share amounts)\n​\n(1)\nThe amounts presented represent the after-tax effect of each adjustment, which was calculated using discrete tax rates.\n(2)\nThe pre-tax adjustments for (gain) loss on investments were $(56) in the second quarter of 2025 and $121 in the second quarter of 2024. The pre-tax adjustments for (gain) loss on investments were $(37) in the first two quarters of 2025 and $105 in the first two quarters of 2024.  \n(3)\nThe pre-tax adjustment for labor dispute charges was $44.\n(4)\nThe pre-tax adjustment for store closures was $100. \n(5)\nThe pre-tax adjustment for executive stock compensation for a former executive was $(21). \n(6)\nThe pre-tax adjustments for merger related costs were $148 in the second quarter of 2024 and $323 in the first two quarters of 2024.\n(7)\nThe pre-tax adjustments for merger-related litigation and settlement charges were $121 in the second quarter of 2025 and $136 in the first two quarters of 2025.\n(8)\nThe pre-tax adjustment for opioid settlement charges and vendor reserves was $22.\n(9)\nThe pre-tax adjustment for severance charge and related benefits was $47.\n(10)\nThe amount presented represents the net earnings (loss) per diluted common share effect of each adjustment.\n​\nRESULTS OF OPERATIONS\n​\nSales\nTotal Sales\n($ in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n​\n​\n​\n​\nTwo Quarters Ended\n \n​\n​\nAugust 16,\n​\nPercentage\n​\nAugust 17,\n​\nPercentage\n​\n​\n​\n​\nAugust 16,\n​\nPercentage\n​\nAugust 17,\n​\nPercentage\n \n​\n   \n2025\n  \nChange\n(1)\n   \n2024\n  \nChange\n(2)\n   \n​\n​\n​\n2025\n   \nChange\n(3)\n   \n2024\n  \nChange\n(4)\n   \nTotal sales to retail customers without fuel\n(5)\n​\n$\n 30,352\n​\n 1.2\n%  \n$\n 30,005\n​\n 1.2\n%  \n​\n​\n​\n$\n 70,753\n​\n 1.1\n%  \n$\n 69,973\n​\n 0.8\n%\nSupermarket fuel sales\n​\n​\n 3,269\n​\n (10.1)\n%  \n​\n 3,636\n​\n (8.0)\n%  \n​\n​\n​\n​\n 7,609\n​\n (11.5)\n%  \n​\n 8,594\n​\n (5.0)\n%\nOther sales\n(6)\n​\n​\n 319\n​\n 17.7\n%  \n​\n 271\n​\n 5.9\n%  \n​\n​\n​\n​\n 696\n​\n 13.4\n%  \n​\n 614\n​\n 6.4\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \nTotal sales \n​\n$\n 33,940\n​\n 0.1\n%  \n$\n 33,912\n​\n 0.2\n%  \n​\n​\n​\n$\n 79,058\n​\n (0.2)\n%  \n$\n 79,181\n​\n 0.2\n%\n(1)\nThis column represents the percentage change in the second quarter of 2025, compared to the second quarter of 2024.\n(2)\nThis column represents the percentage change in the second quarter of 2024, compared to the second quarter of 2023.\n(3)\nThis column represents the percentage change in the first two quarters of 2025, compared to the first two quarters of 2024.\n(4)\nThis column represents the percentage change in the first two quarters of 2024, compared to the first two quarters of 2023.\n(5)\neCommerce\n sales are included in the “Total sales to retail customers without fuel” line above.  eCommerce sales increased 16% in the second quarter and 15% in the first two quarters of 2025, compared to the same periods of 2024. eCommerce sales include products ordered online and picked up at our stores and our Delivery and Ship solutions. Our Delivery solutions include orders delivered to customers from retail store locations, customer fulfillment centers and orders placed through third-party platforms. Our Ship solutions primarily include online orders placed through our owned platforms that are dispatched using mail service or third-party courier. eCommerce sales growth was led by strong demand for our Delivery solutions, which grew by 19% in the second quarter and 20% in the first two quarters of 2025, compared to the same periods of 2024.\n(6)\nOther sales primarily relate to external sales at food production plants, third-party media revenue and data analytic services. The increase in the second quarter and first two quarters of 2025, compared to the same periods of 2024, is primarily due to an increase in external sales at food production plants and third-party media revenue.\n \n​\n25\n\n\n​\nTotal sales increased in the second quarter of 2025, compared to the second quarter of 2024, by 0.1%.  The increase was primarily due to an increase in total sales to retail customers without fuel, partially offset by a decrease in supermarket fuel sales and the sale of Kroger Specialty Pharmacy.  Total supermarket fuel sales decreased 10.1% in the second quarter of 2025, compared to the second quarter of 2024, primarily due to a decrease in the average retail fuel price of 7.0% and a decrease in fuel gallons sold of 3.3%. The decrease in the average retail fuel price was caused by a decrease in the product cost of fuel. Total sales, excluding fuel and Kroger Specialty Pharmacy, increased 3.8% in the second quarter of 2025, compared to the second quarter of 2024, which was primarily due to our identical sales increase, excluding fuel, of 3.4%. Identical sales, excluding fuel, for the second quarter of 2025, compared to the second quarter of 2024, increased primarily due to increased pharmacy, eCommerce and Fresh sales and increased spend per item, partially offset by a reduction in the number of items in basket. \n​\nTotal sales decreased in the first two quarters of 2025, compared to the first two quarters of 2024, by 0.2%.  The decrease was primarily due to a decrease in supermarket fuel sales and the sale of Kroger Specialty Pharmacy, partially offset by an increase in total sales to retail customers without fuel. Total supermarket fuel sales decreased 11.5% in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to a decrease in the average retail fuel price of 8.8% and a decrease in fuel gallons sold of 3.0%. The decrease in the average retail fuel price was caused by a decrease in the product cost of fuel. Total sales, excluding fuel, Kroger Specialty Pharmacy and the Labor Dispute, increased 3.7% in the first two quarters of 2025, compared to the first two quarters of 2024, which was primarily due to our identical sales increase, excluding fuel and the Labor Dispute, of 3.3%. Identical sales, excluding fuel and the Labor Dispute, for the first two quarters of 2025, compared to the first two quarters of 2024, increased primarily due to increased pharmacy, eCommerce and Fresh sales and increased spend per item, partially offset by a reduction in the number of items in basket.\n​\nWe calculate identical sales, excluding fuel, as sales to retail customers, including sales from all departments at identical supermarket locations and Delivery and Ship solutions. We define a supermarket as identical when it has been in operation without expansion or relocation for five full quarters.  We include Kroger Delivery sales from customer fulfillment centers in the identical sales calculation if the delivery occurs in an existing Kroger supermarket geography or when the location has been in operation for five full quarters. Although identical sales is a relatively standard term, numerous methods exist for calculating identical sales growth. As a result, the method used by our management to calculate identical sales may differ from methods other companies use to calculate identical sales. It is important to understand the methods used by other companies to calculate identical sales before comparing our identical sales to those of other such companies. Our identical sales results, excluding fuel, are summarized in the following tables. We used the identical sales, excluding fuel, dollar figures presented below to calculate percentage changes for the second quarter and first two quarters of 2025\n. \n​\n26\n\n\n​\nIdentical Sales\n($ in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n \n​\n​\nAugust 16,\n​\nPercentage\n​\nAugust 17,\n​\nPercentage\n \n​\n    \n2025\n    \nChange\n(1)\n    \n2024\n    \nChange\n(2)\n   \nExcluding Fuel\n \n$\n 30,019\n \n 3.4\n%  \n$\n 29,019\n \n 1.2\n%\n(1)\nThis column represents the percentage change in identical sales in the second quarter of 2025, compared to the second quarter of 2024.\n(2)\nThis column represents the percentage change in identical sales in the second quarter of 2024, compared to the second quarter of 2023. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nExcluding Adjusted Items\n(1)\n​\n​\n​\nTwo Quarters Ended\n \n​\n​\nAugust 16,\n​\nPercentage\n​\nAugust 17,\n​\nPercentage\n \n​\n    \n2025\n    \nChange\n(2)\n    \n2024\n    \nChange\n(3)\n \nExcluding Fuel\n \n$\n 69,785\n \n 3.3\n%  \n$\n 67,554\n \n 0.8\n%\n(1)\nIdentical sales, excluding fuel, were adjusted to exclude stores involved in the labor disputes in Colorado in the first quarter of 2025.  Identical sales, excluding fuel, were excluded for the first four weeks of the first quarters of 2025 and 2024 for stores involved in this labor dispute.\n(2)\nThis column represents the percentage change in identical sales in the first two quarters of 2025, compared to the first two quarters of 2024. \n(3)\nThis column represents the percentage change in identical sales in the first two quarters of 2024, compared to the first two quarters of 2023.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTwo Quarters Ended\n \n​\n​\nAugust 16,\n​\nPercentage\n​\nAugust 17,\n​\nPercentage\n \n​\n    \n2025\n    \nChange\n(1)\n    \n2024\n    \nChange\n(2)\n   \nExcluding Fuel\n \n$\n 70,045\n \n 3.2\n%\n$\n 67,885\n \n 0.8\n%\n(1)\nThis column represents the percentage change in identical sales in the first two quarters of 2025, compared to the first two quarters of 2024.\n(2)\nThis column represents the percentage change in identical sales in the first two quarters of 2024, compared to the first two quarters of 2023. \n​\nGross Margin, LIFO and FIFO Gross Margin\n​\nOur gross margin rates, as a percentage of sales, were 22.5% in the second quarter of 2025 and 22.1% in the second quarter of 2024. This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower gross margin rate, lower shrink, lower supply chain costs and decreased fuel sales, which have a lower gross margin rate, partially offset by increased pharmacy sales, which have a lower gross margin rate, increased promotional price investments and the LIFO charge.\n​\nOur gross margin rates, as a percentage of sales, were 22.8% in the first two quarters of 2025 and 22.0% in the first two quarters of 2024. This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower gross margin rate, lower shrink, lower supply chain costs and decreased fuel sales, which have a lower gross margin rate, partially offset by increased pharmacy sales, which have a lower gross margin rate, increased promotional price investments and the LIFO charge.\n​\n27\n\n\n​\nThe following table provides the calculation of gross profit and gross margin in accordance with GAAP:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n​\n​\nTwo Quarters Ended\n​\n​\n​\nAugust 16,\n​\n​\nAugust 17,\n​\n​\nAugust 16,\n​\n​\nAugust 17,\n​\n​\n​\n2025\n​\n​\n2024\n​\n​\n2025\n​\n​\n2024\n​\nSales\n​\n$\n 33,940\n​\n​\n$\n 33,912\n​\n​\n$\n 79,058\n​\n​\n$\n 79,181\n​\nMerchandise costs, including advertising, warehousing and transportation and LIFO charge, excluding rent and depreciation and amortization\n​\n​\n 26,130\n​\n​\n​\n 26,261\n​\n​\n​\n 60,681\n​\n​\n​\n 61,385\n​\nRent\n​\n​\n 13\n​\n​\n​\n 17\n​\n​\n​\n 31\n​\n​\n​\n 40\n​\nDepreciation and amortization\n​\n​\n 151\n​\n​\n​\n 135\n​\n​\n​\n 344\n​\n​\n​\n 316\n​\nGross profit\n​\n$\n 7,646\n​\n​\n$\n 7,499\n​\n​\n$\n 18,002\n​\n​\n$\n 17,440\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross margin\n​\n​\n 22.5\n%\n​\n​\n 22.1\n%\n​\n​\n 22.8\n%\n​\n​\n 22.0\n%\n​\nWe define FIFO gross margin as FIFO gross profit divided by sales. FIFO gross profit is calculated as sales less merchandise costs, including advertising, warehousing and transportation expenses, but excluding the LIFO charge, rent and depreciation and amortization.\n​\nOur LIFO charge was $62 million in the second quarter of 2025, compared to $21 million in the second quarter of 2024. Our LIFO charge was $102 million in the first two quarters of 2025, compared to $62 million in the first two quarters of 2024. Our increased LIFO charge reflects our expected annualized product cost inflation for 2025, compared to 2024.\n​\nOur fuel sales lower our FIFO gross margin rate due to the very low FIFO gross margin rate, as a percentage of sales, of fuel sales compared to non-fuel sales. Excluding the effect of fuel, our FIFO gross margin rate increased 39 basis points in the second quarter of 2025, compared to the second quarter of 2024.  This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower gross margin rate, lower shrink and lower supply chain costs, partially offset by increased pharmacy sales, which have a lower gross margin rate,\n \nand increased promotional price investments.  Excluding the effect of fuel and Kroger Specialty Pharmacy, our FIFO gross margin rate decreased 9 basis points in the second quarter of 2025, compared to the second quarter of 2024.\n​\nExcluding the effect of fuel and the Labor Dispute, our FIFO gross margin rate increased 62 basis points in the first two quarters of 2025, compared to the first two quarters of 2024.  This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower gross margin rate, lower shrink and lower supply chain costs, partially offset by increased pharmacy sales, which have a lower gross margin rate,\n \nand increased promotional price investments.  Excluding the effect of fuel, Kroger Specialty Pharmacy and the Labor Dispute, our FIFO gross margin rate increased 15 basis points in the first two quarters of 2025, compared to the first two quarters of 2024.\n​\nOperating, General and Administrative Expenses\n​\nOG&A expenses consist primarily of employee-related costs such as wages, healthcare benefit costs, retirement plan costs, utilities, and credit card fees. Rent expense, depreciation and amortization expense, and interest expense are not included in OG&A.\n​\nOG&A expenses, as a percentage of sales, were 17.6% in the second quarter of 2025 and 17.4% in the second quarter of 2024.  The increase in the second quarter of 2025, compared to the second quarter of 2024, resulted primarily from the effect of decreased fuel sales, which increases our OG&A rate, as a percentage of sales, the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, the 2025 Second Quarter OG&A Adjusted Items and increased incentive plan costs, partially offset by the 2024 Second Quarter OG&A Adjusted Item, continued execution of broad-based cost savings initiatives that drive administrative efficiencies, including store productivity, \nand a favorable comparison to the second quarter of 2024, related to hurricane costs and general liability claims.\n​\n28\n\n\n​\nOG&A expenses, as a percentage of sales, were 17.6% in the first two quarters of 2025 and 17.0% in the first two quarters of 2024. The increase in the first two quarters of 2025, compared to the first two quarters of 2024, resulted primarily from the effect of decreased fuel sales, which increases our OG&A rate, as a percentage of sales, the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, the 2025 Multi-Employer Pension Contributions, the 2025 OG&A Adjusted Items and increased healthcare costs, partially offset by the 2024 OG&A Adjusted Items and continued execution of broad-based cost savings initiatives that drive administrative efficiencies, including store productivity.\n​\nOur fuel sales lower our OG&A rate, as a percentage of sales, due to the very low OG&A rate, as a percentage of sales, of fuel sales compared to non-fuel sales. Excluding the effect of fuel, the 2025 Second Quarter OG&A Adjusted Items and the 2024 Second Quarter OG&A Adjusted Item, our OG&A rate decreased 5 basis points in the second quarter of 2025, compared to the second quarter of 2024. This decrease resulted primarily from continued execution of broad-based cost savings initiatives that drive administrative efficiencies, including store productivity, and a favorable comparison to the second quarter of 2024, related to hurricane costs and general liability claims, partially offset by the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, and increased incentive plan costs.\n​\nExcluding the effect of fuel, Kroger Specialty Pharmacy, the 2025 Second Quarter OG&A Adjusted Items and the 2024 Second Quarter OG&A Adjusted Item, our OG&A rate decreased 41 basis points in the second quarter of 2025, compared to the second quarter of 2024.\n​\nExcluding the effect of fuel, the 2025 OG&A Adjusted Items, the Labor Dispute and the 2024 OG&A Adjusted Items, our OG&A rate increased 34 basis points in the first two quarters of 2025, compared to the first two quarters of 2024. This increase resulted primarily from the sale of our Kroger Specialty Pharmacy business, which has a lower OG&A rate to sales, the 2025 Multi-Employer Pension Contributions and increased healthcare costs, partially offset by continued execution of broad-based cost savings initiatives that drive administrative efficiencies, including store productivity.\n​\nExcluding the effect of fuel, Kroger Specialty Pharmacy, the 2025 OG&A Adjusted Items, the Labor Dispute, the 2024 OG&A Adjusted Items and the 2025 Multi-Employer Pension Contributions, our OG&A rate decreased 9 basis points in the first two quarters of 2025, compared to the first two quarters of 2024.\n​\nRent Expense\n​\nRent expense remained relatively consistent, as a percentage of sales, for the second quarter and first two quarters of 2025, compared to the same periods of 2024.\n​\nDepreciation and Amortization Expense\n​\nDepreciation and amortization expense increased, as a percentage of sales, in the second quarter and first two quarters of 2025, compared to the same periods of 2024.  This increase was primarily due to the sale of our Kroger Specialty Pharmacy business, which has a lower depreciation & amortization rate to sales.\n​\nOperating Profit and FIFO Operating Profit\n​\nOperating profit was $863 million, or 2.54% of sales, for the second quarter of 2025, compared to $815 million, or 2.40% of sales, for the second quarter of 2024.  Operating profit, as a percentage of sales, increased 14 basis points in the second quarter of 2025, compared to the second quarter of 2024, primarily due to a higher FIFO gross margin rate, partially offset by increased OG&A, depreciation and amortization expenses and the LIFO charge, as a percentage of sales.\n​\nOperating profit was $2.2 billion, or 2.76% of sales, for the first two quarters of 2025, compared to $2.1 billion, or 2.66% of sales, for the first two quarters of 2024. Operating profit, as a percentage of sales, increased 10 basis points in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to a higher FIFO gross margin rate, partially offset by increased OG&A, depreciation and amortization expenses and the LIFO charge, as a percentage of sales.\n​\n29\n\n\n​\nFIFO operating profit was $925 million, or 2.73% of sales, for the second quarter of 2025, compared to $836 million, or 2.47% of sales, for the second quarter of 2024.  FIFO operating profit, as a percentage of sales, excluding the 2025 and 2024 Second Quarter Adjusted Items, increased 32 basis points in the second quarter of 2025, compared to the second quarter of 2024, primarily due to a higher FIFO gross margin rate, partially offset by increased OG&A and depreciation and amortization expenses, as a percentage of sales.\n​\nFIFO operating profit was $2.3 billion, or 2.89% of sales, for the first two quarters of 2025, compared to $2.2 billion, or 2.74% of sales, for the first two quarters of 2024.  FIFO operating profit, as a percentage of sales, excluding the 2025 and 2024 Adjusted Items, increased 15 basis points in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to a higher FIFO gross margin rate, partially offset by increased OG&A and depreciation and amortization expenses, as a percentage of sales.\n​\nSpecific factors contributing to the trends driving operating profit and FIFO operating profit identified above are discussed earlier in this section.\n​\nThe following table provides a reconciliation of operating profit to FIFO operating profit, and to Adjusted FIFO operating profit, excluding the 2025 and 2024 Adjusted Items:\n​\nOperating Profit excluding the Adjusted Items\n($ in millions)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSecond Quarter Ended\n​\nTwo Quarters Ended\n​\n​\nAugust 16,\n​\nAugust 17,\n​\nAugust 16,\n​\nAugust 17,\n​\n    \n2025\n    \n2024\n \n2025\n    \n2024\nOperating profit\n​\n$\n 863\n​\n$\n 815\n​\n$\n 2,185\n​\n$\n 2,109\nLIFO charge\n​\n​\n 62\n​\n​\n 21\n​\n​\n 102\n​\n​\n 62\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFIFO Operating profit\n​\n \n 925\n​\n​\n 836\n​\n​\n 2,287\n​\n \n 2,171\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjustment for merger-related costs\n(1)\n​\n​\n —\n​\n​\n 148\n​\n​\n —\n​\n​\n 323\nAdjustment for merger-related litigation and settlement charges\n​\n​\n 121\n​\n​\n —\n​\n​\n 136\n​\n​\n —\nAdjustment for opioid settlement charges and vendor reserves\n​\n​\n —\n​\n​\n —\n​\n​\n 22\n​\n​\n —\nAdjustment for labor dispute charges\n​\n​\n —\n​\n​\n —\n​\n​\n 44\n​\n​\n —\nAdjustment for store closures\n​\n​\n —\n​\n​\n —\n​\n​\n 100\n​\n​\n —\nAdjustment for executive stock compensation for a former executive\n​\n​\n —\n​\n​\n —\n​\n​\n (21)\n​\n​\n —\nAdjustment for severance charge and related benefits\n​\n​\n 47\n​\n​\n —\n​\n​\n 47\n​\n​\n —\nOther\n​\n​\n (2)\n​\n​\n —\n​\n​\n (5)\n​\n​\n (11)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2025 and 2024 Adjusted items\n​\n​\n 166\n​\n​\n 148\n​\n​\n 323\n​\n​\n 312\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAdjusted FIFO operating profit excluding the adjusted items above\n​\n$\n 1,091\n​\n$\n 984\n​\n$\n 2,610\n​\n$\n 2,483\n(1)\nMerger-related costs primarily include third-party professional fees and credit facility fees associated with the terminated merger with Albertsons Companies, Inc.\n​\nNet Interest Expense\n​\nNet interest expense totaled $144 million in the second quarter of 2025, compared to $84 million in the second quarter of 2024.  Net interest expense totaled $343 million in the first two quarters of 2025, compared to $207 million in the first two quarters of 2024.  This increase resulted primarily from increased average total outstanding debt in the first two quarters of 2025, compared to the first two quarters of 2024, from the net proceeds of the senior notes issuance during the third quarter of 2024, partially offset by increased interest income earned due to increased balances of cash and temporary cash investments in the first two quarters of 2025, compared to the first two quarters of 2024. \n​\n30\n\n\n​\nIncome Taxes\n​\nThe effective income tax rate was 21.0% for the second quarter of 2025 and 24.1% for the second quarter of 2024. The effective income tax rate was 21.2% for the first two quarters of 2025 and the first two quarters of 2024.  The effective income tax rate for the second quarter of 2025 equaled the federal statutory rate due to the effect of state income taxes being fully offset by the utilization of tax credits and deductions including the benefit from share-based payments.  The effective income tax rate for the first two quarters of 2025 differed from the federal statutory rate due to the effect of state income taxes, partially offset by the utilization of tax credits and deductions including the benefit from share-based payments, which includes the 2025 Income Tax Expense Adjusted Item. The effective income tax rate for the second quarter of 2024 differed from the federal statutory rate due to the effect of state income taxes, partially offset by the utilization of tax credits and deductions. The effective tax rate for the first two quarters of 2024 differed from the federal statutory rate due to the effect of state income taxes, partially offset by a tax benefit related to classifying Kroger Specialty Pharmacy as held for sale and the utilization of tax credits and deductions.\n​\nNet Earnings and Net Earnings Per Diluted Share\n​\nOur net earnings are based on the factors discussed in the Results of Operations section.\n​\nNet earnings of $0.91 per diluted share for the second quarter of 2025 represented an increase of 42% compared to net earnings of $0.64 per diluted share for the second quarter of 2024. \nExcluding the 2025 and 2024 Second Quarter Adjusted Items, a\ndjusted net earnings of $1.04 per diluted share for the second quarter of 2025 represented an increase of 12% compared to adjusted net earnings of $0.93 per diluted share for the second quarter of 2024\n.  The increase in adjusted net earnings per diluted share resulted primarily from increased adjusted FIFO operating profit, excluding fuel, lower income tax expense and lower common shares outstanding, partially offset by increased net interest expense and decreased fuel earnings\n.\n​\nNet earnings of $2.20 per diluted share for the first two quarters of 2025 represented an increase of 14% compared to net earnings of $1.93 per diluted share for the first two quarters of 2024. \nExcluding the 2025 and 2024 Adjusted Items, a\ndjusted net earnings of $2.53 per diluted share for the first two quarters of 2025 represented an increase of 7% compared to adjusted net earnings of $2.36 per diluted share for the first two quarters of 2024\n.  The increase in adjusted net earnings per diluted share resulted primarily from increased adjusted FIFO operating profit, excluding fuel, lower income tax expense and lower common shares outstanding, partially offset by increased net interest expense and decreased fuel earnings\n.\n​\n31\n\n\n​\nLIQUIDITY AND CAPITAL RESOURCES\n​\nCash Flow Information\n​\nThe following table summarizes our net increase in cash and temporary cash investments for the first two quarters of 2025 and 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n​\nTwo Quarters Ended\n​\n​\nAugust 16,\n​\nAugust 17,\n​\n​\n2025\n​\n2024\nNet cash provided by (used in)\n​\n​\n​\n​\n​\n​\nOperating activities\n​\n$\n 3,688\n​\n$\n 3,464\nInvesting activities\n​\n​\n (2,107)\n​\n​\n (1,905)\nFinancing activities\n​\n​\n (657)\n​\n​\n (642)\nNet increase in cash and temporary cash investments\n​\n$\n 924\n​\n$\n 917\n​\nNet cash provided by operating activities\n​\nWe generated $3.7 billion of cash from operations in the first two quarters of 2025 compared to $3.5 billion in the first two quarters of 2024. The increase in cash generated from operations was primarily due to the following:\n​\n●\nCash flows for receivables were more favorable for the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to an increase in pharmacy receivables at the end of the second quarter of 2024 compared to fiscal year end 2023, primarily due to the timing of cash receipts and increased Health and Wellness sales;\n​\n●\nCash flows from accrued expenses were more favorable for the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to the following:\n​\no\nA decrease in pharmacy related liabilities at the end of the second quarter of 2024, compared to fiscal year end of 2023, due to the timing of payments; and\n​\no\nAn increase in accrued severance liabilities at the end of the second quarter of 2025, compared to fiscal year end 2024;\n​\n●\nPartially offset by cash flows for accounts payable were less favorable in the first two quarters of 2025, compared to the first two quarters of 2024, due to an increase in accounts payable at the end of the second quarter of 2024, compared to fiscal year end 2023, primarily due to timing of payments and management’s focus on working capital improvements.\n​\nCash paid for interest increased in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to increased interest payments related to the $5.8 billion of senior notes issued in the third quarter of 2024 and not redeemed in the fourth quarter of 2024. Cash paid for taxes increased in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to applying a 2023 tax overpayment to reduce our estimated tax payments in 2024.\n​\nNet cash used by investing activities\n​\nInvesting activities used cash of $2.1 billion in the first two quarters of 2025 compared to $1.9 billion in the first two quarters of 2024. The amount of cash used by investing activities increased in the first two quarters of 2025, compared to the first two quarters of 2024, primarily due to a decrease in the proceeds from the sale of assets due to the sale of an equity method investment in the first two quarters of 2024, partially offset by a decrease in payments for property and equipment, including payments for lease buyouts, in the first two quarters of 2025, compared to the first two quarters of 2024 and the letter of credit drawdown by Ocado in the second quarter of 2025 under the Amended and Restated Partnership Framework Agreement.\n​\n32\n\n\n​\nNet cash used by financing activities\n​\nThe cash used for financing activities of $657 million in the first two quarters of 2025 was consistent with the cash used for financing activities of $642 million in the first two quarters of 2024.\n​\nCapital Investments\n​\nCapital investments, including changes in construction-in-progress payables and excluding the purchase of leased facilities, remained relatively consistent in the first two quarters of 2025, compared to the first two quarters of 2024, and totaled $2,030 million for the first two quarters of 2025, compared to $2,076 million for the first two quarters of 2024. During the rolling four quarter period ended with the second quarter of 2025, we opened, expanded, relocated or acquired 25 supermarkets and completed 203 remodels. We define a remodel as a project that is greater than or equal to a cost of $8 per square foot. Total supermarket square footage at the end of the second quarter of 2025 increased 0.3% from the end of the second quarter of 2024. Excluding mergers, acquisitions and operational closings, total supermarket square footage at the end of the second quarter of 2025 increased 1.1% over the end of the second quarter of 2024.\n​\nDebt Management\n​\nAs of August 16, 2025, we maintained a $2.75 billion (with the ability to increase by $2.0 billion), unsecured revolving credit facility that, unless extended, terminates on September 13, 2029. Outstanding borrowings under the credit facility, commercial paper borrowings and some outstanding letters of credit reduce funds available under the credit facility. As of August 16, 2025, we had no outstanding commercial paper and no borrowings under our revolving credit facility. The outstanding letters of credit that reduce funds available under our credit facility totaled $2 million as of August 16, 2025.\n​\nOur bank credit facility and the indentures underlying our publicly issued debt contain a financial covenant. As of August 16, 2025, we were in compliance with the financial covenant. Furthermore, management believes it is not reasonably likely that we will fail to comply with this financial covenant in the future.\n \n​\nTotal debt, including both the current and long-term portions of obligations under finance leases, increased $54 million as of August 16, 2025, compared to our fiscal year end 2024 debt of $17.9 billion due to a net increase in obligations under finance leases and property transactions. During the first two quarters of 2025, we did not have any payments or issuances of senior notes or borrowings or payments that occurred on our revolving credit facility.\n​\nCommon Share Repurchase Programs\n​\nFor the first two quarters of 2025, we invested $203 million to repurchase 3.0 million Kroger common shares at an average price of $68.21 per share. The shares repurchased in the first two quarters of 2025 were reacquired under a share repurchase program announced on December 6, 1999 to repurchase common shares to reduce dilution resulting from our employee stock option and long-term incentive plans, under which repurchases are limited to proceeds received from exercises of stock options and the tax benefits associated therewith (“1999 Repurchase Program”). \n​\nOn December 11, 2024, our Board of Directors approved a $7.5 billion share repurchase program to reacquire shares via open market purchase or privately negotiated transactions, including accelerated share repurchase (“ASR”) transactions, block trades, or pursuant to trades intending to comply with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended (the “December 2024 Repurchase Program”).\n​\nOn December 19, 2024, we entered into an ASR agreement with two financial institutions to reacquire, in aggregate, $5.0 billion in shares of Kroger common stock. The ASR agreement will be completed under the December 2024 Repurchase Program. During 2024, we funded $5.0 billion and received a $4.0 billion initial delivery of approximately 65.6 million Kroger common shares at an average price of $61.54 per share, which includes excise taxes related to the shares repurchased. The total number of shares purchased by the Company pursuant to the ASR agreement will be based on the average of the volume-weighted average prices of Kroger common shares on specified dates during the term of each ASR agreement, less a discount, and subject to adjustments pursuant to the terms and conditions of the ASR agreement. Final settlement under the ASR agreement is expected to occur in the third quarter of 2025.  \n​\n33\n\n\n​\nAs of August 16, 2025, there was $2.5 billion remaining under the December 2024 Repurchase Program, which reflects the reduction of the unsettled accelerated share repurchases of $1.0 billion and excludes excise tax on share repurchases in excess of issuances. Amounts available under the 1999 Repurchase Program are dependent upon option exercise activity. The authority remaining under the December 2024 Repurchase Program and the 1999 Repurchase Program do not have an expiration date but may be suspended or terminated by our Board of Directors at any time.\n​\nLiquidity Needs\n​\nWe held cash and temporary cash investments of $4.9 billion as of August 16, 2025. We actively manage our cash and temporary cash investments in order to internally fund operating activities, support and invest in our core businesses, make scheduled interest and principal payments on our borrowings and return cash to shareholders through cash dividend payments and share repurchases. Our current levels of cash, borrowing capacity and balance sheet leverage provide us with the operational flexibility to adjust to changes in economic and market conditions. We remain committed to our dividend, and growing our dividend over time, subject to Board approval, as well as share repurchase programs and we will evaluate the optimal use of any excess free cash flow, consistent with our capital allocation strategy.\n​\nWe expect to meet our short-term and long-term liquidity needs with cash and temporary cash investments on hand as of August 16, 2025, cash flows from our operating activities and other sources of liquidity, including borrowings under our commercial paper program and bank credit facility. Our short-term and long-term liquidity needs include anticipated requirements for working capital to maintain our operations, pension plan commitments, interest payments and scheduled principal payments of debt and commercial paper, servicing our lease obligations, self-insurance liabilities, capital investments, scheduled opioid settlement payments and other purchase obligations. We may also require additional capital in the future to fund organic growth opportunities, additional customer fulfillment centers, joint ventures or other business partnerships, property development, acquisitions, dividends and share repurchases. In addition, we generally operate with a working capital deficit due to our efficient use of cash in funding operations and because we have consistent access to the capital markets. We believe we have adequate coverage of our debt covenants to continue to maintain our current investment grade debt ratings and to respond effectively to competitive conditions.\n​\nFor additional information about our debt activity in the first two quarters of 2025, see Note 2 to the Consolidated Financial Statements.\n​\nCRITICAL ACCOUNTING ESTIMATES\n​\nWe have chosen accounting policies that we believe are appropriate to report accurately and fairly our operating results and financial position, and we apply those accounting policies in a consistent manner. Our critical accounting policies are summarized in Note 1 to our Consolidated Financial Statements included in our Annual Report on Form 10-K for the fiscal year ended February 1, 2025.\n​\nThe preparation of financial statements in conformity with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures of contingent assets and liabilities. We base our estimates on historical experience and other factors we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results could vary from those estimates. There has been no material change to our critical accounting estimates since the filing of our Annual Report on Form 10-K for the fiscal year ended February 1, 2025.\n​"
}