{
  "source_file": "kvue-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion contains forward-looking statements that involve risks and uncertainties. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions, and projections about our industry, business, and future financial results. Our actual results could differ materially from the results contemplated by these forward-looking statements due to a number of factors, including those discussed in Part I, Item 1A,“Risk Factors,” in our Annual Report on Form 10-K for the fiscal twelve months ended December 29, 2024 filed on February 24, 2025 with the SEC (the “Annual Report”), Part II, Item 1A, “Risk Factors,” included herein, and the section titled “Cautionary Note Regarding Forward-Looking Statements” included herein.\nThis discussion should be read in conjunction with our accompanying Condensed Consolidated Financial Statements for the fiscal three and nine months ended\n \nSeptember 28, 2025, which have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”) and the rules and regulations of the SEC for interim financial statements, and our audited consolidated financial statements for the fiscal twelve months ended December 29, 2024, which are included in the Annual Report. In our opinion, the Condensed Consolidated Financial Statements reflect all adjustments, consisting of normal and recurring adjustments, necessary for a fair statement of the financial condition, results of operations, and cash flows for the periods indicated. All currency amounts are expressed in U.S. dollars unless otherwise noted.\nUnless otherwise defined herein, capitalized terms related to the proposed Transaction used in this Management’s Discussion and Analysis of Financial Condition and Results of Operations have the meanings ascribed to them in the Notes to the Condensed Consolidated Financial Statements included in this Form 10-Q.\nOverview\nCompany Overview\nAt Kenvue, our purpose is to realize the extraordinary power of everyday care. As a global leader at the intersection of healthcare and consumer goods, we are the world’s largest pure-play consumer health company by revenue with $15.5 billion in Net sales in the fiscal year 2024. By combining the power of science with meaningful consumer insights and our digital strategy, we empower consumers to live healthier lives every day. Built on more than a century of heritage and trusted by generations, our differentiated portfolio of iconic brands—including Aveeno\n®\n, BAND-AID\n®\n Brand, Johnson’s\n®\n, Listerine\n®\n, Neutrogena\n®\n, Nicorette\n®\n, Tylenol\n®\n, and Zyrtec\n®\n—is backed by science and recommended by healthcare professionals, which further reinforces our consumers’ connections to our brands.\nOur portfolio includes Self Care, Skin Health and Beauty, and Essential Health products, allowing us to connect with consumers globally—in their daily rituals and the moments that matter most.\nOur global scale and the breadth of our brand portfolio are complemented by our well-developed capabilities and accelerated through our digital strategy, allowing us to dynamically capitalize on and respond to current trends impacting our categories and geographic markets.\nWith a sole focus on consumer health, our marketing organization operates efficiently by leveraging our precision marketing, e-commerce, and broader digital capabilities to develop unique consumer insights and further enhance the relevance of our brands. Similarly, our research and development organization combines these consumer insights with deep, multi-disciplinary scientific expertise, and engagement with healthcare professionals, to drive innovative new products, solutions, and experiences centered around consumer health.\nOur Business Segments\nWe operate our business through the following three reportable business segments:\n•\nSelf Care.\n Our Self Care product categories include: Cough, Cold, and Allergy; Pain Care; and Other Self Care (Digestive Health, Smoking Cessation, Eye Care, and Other). Major brands in the segment include Tylenol\n®\n, Motrin\n®\n, Nicorette\n®\n, Benadryl\n®\n, Zyrtec\n®\n, Zarbee’s\n®\n, ORSL\n®\n, Rhinocort\n®\n, and Calpol\n®\n.\n•\nSkin Health and Beauty.\n Our Skin Health and Beauty product categories include: Face and Body Care; and Hair, Sun, and Other. Major brands in the segment include Neutrogena\n®\n, Aveeno\n®\n, Dr.Ci:Labo\n®\n, OGX\n®\n, Le Petit Marseillais\n®\n, Lubriderm\n®\n, and Rogaine\n®\n.\n40\n•\nEssential Health. \nOur Essential Health product categories include: Oral Care; Baby Care; and Other Essential Health (Women’s Health, Wound Care, and Other). Major brands in the segment include Listerine\n®\n, Johnson’s\n®\n, BAND-AID\n®\n Brand, Stayfree\n®\n, o.b.\n®\n tampons, Carefree\n®\n, and Desitin\n®\n.\nFor additional information about our three reportable business segments, see Note 14, “Segments of Business,” to the Condensed Consolidated Financial Statements included herein.\nSeparation from J&J\nIn November 2021, J&J, our former parent company, announced its intention to separate its Consumer Health segment (the “Consumer Health Business”) into an independent publicly traded company (the “Separation”). Kenvue was incorporated in Delaware in February 2022, as a wholly owned subsidiary of J&J, to serve as the ultimate parent company of J&J’s Consumer Health Business. In April 2023, J&J completed the transfer of substantially all of the assets and liabilities of the Consumer Health Business to us and our subsidiaries. In May 2023, we completed an initial public offering (the “Kenvue IPO”) and began trading on the New York Stock Exchange under the ticker symbol “KVUE.” In July 2023, J&J announced an exchange offer (the “Exchange Offer”) under which its shareholders could exchange shares of J&J common stock for shares of our common stock owned by J&J. In August 2023, J&J completed the Exchange Offer, completing the Separation from J&J and transition to being a fully independent public company. In May 2024, J&J completed an additional exchange offer (the “Debt-for-Equity Exchange”) through which J&J exchanged indebtedness of J&J for shares of our common stock owned by J&J. Following the completion of the Debt-for-Equity Exchange, J&J did not own any shares of our common stock.\nWe are incurring certain non-recurring separation-related costs in connection with our establishment as a standalone public company (the “Separation-related costs”). Separation-related costs associated with information technology and other activities, primarily related to the disentanglement of systems and the discontinuance of certain information technology assets, are substantially completed. However, costs related to legal entity name changes and certain other separation-related activities are expected to continue for a longer period than originally anticipated. For additional information about the Separation, see Note 1, “Description of the Company and Summary of Significant Accounting Policies,” and Note 8, “Relationship with J&J,” to the Condensed Consolidated Financial Statements included herein.\nRelationship with J&J\nWe entered into the Separation Agreement and various other agreements with J&J for the purpose of effecting the Separation. These agreements provide a framework for our relationship with J&J and govern various interim and ongoing relationships between us and J&J that follow the completion of the Kenvue IPO. See Note 8, “Relationship with J&J,” to the Condensed Consolidated Financial Statements included herein for additional information on these agreements. \nKenvue Global and North America Headquarters\nOn April 20, 2023, we entered into a long-term lease for a newly renovated global and North America corporate headquarters building and a newly constructed research and development building in Summit, New Jersey (the “Global and North America Headquarters Lease”). In March 2025, we began operating out of the new global and North America corporate headquarters. The relocation to our new campus from multiple U.S.-based locations will continue through 2026 when the new research and development building is expected to be complete. When construction is completed, the campus will encompass approximately 290,000 square feet. The Global and North America Headquarters Lease collectively includes the lease associated with the global and North America corporate headquarters building, the lease associated with the land where the research and development building is under construction, and the lease associated with land used for amenities.\nOn February 21, 2024, we listed our former corporate headquarters in Skillman, New Jersey for sale, which met the criteria to be classified as held for sale at that date. The Skillman, New Jersey facility continues to meet the criteria for held for sale classification as of September 28, 2025. For the fiscal three months ended March 31, 2024, an impairment charge of $68 million was recorded on the held for sale asset associated with the former corporate headquarters in Skillman. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Impairment Charges—Assets Held for Sale,” to the Condensed Consolidated Financial Statements included herein for more information.\n41\nRecent Developments\nStrategic Review and Proposed Transaction with Kimberly-Clark\nIn July 2025, we announced that our Board of Directors (our “Board”) had previously initiated a comprehensive review of strategic alternatives and has established a strategic review committee (the “Strategic Review Committee”) to oversee the ongoing process. On November 2, 2025, following our Board’s review of strategic alternatives, our Board unanimously approved the execution of the Merger Agreement pursuant to which K-C will acquire all of the outstanding shares of the Company for a combination of stock and cash in a series of transactions, as described in Note 16, “Subsequent Events,” to the Condensed Consolidated Financial Statements included herein. Pursuant to the terms and subject to the conditions of the Merger Agreement, Company stockholders will receive the Merger Consideration consisting of 1) 0.14625 shares of K-C common stock and 2) $3.50 in cash for each share of the Company they own. Upon completion of the Transaction, current K-C stockholders are expected to own approximately 54%, and current Company stockholders are expected to own approximately 46% of the combined company on a fully diluted basis.\nThe Merger Agreement contains customary representations, warranties, covenants, and termination rights. The Transaction is expected to close in the second half of 2026 and is conditioned on the approval by the Company’s stockholders of a proposal to adopt the Merger Agreement and by K-C stockholders of a proposal to approve the issuance of K-C common stock in connection with the First Merger, as well as the satisfaction or waiver of other customary closing conditions, including the receipt of antitrust clearance in the United States and a number of foreign regulatory approvals. \nAcetaminophen Regulatory Developments\nIn September 2025, officials in the United States federal government alleged that in utero exposure to acetaminophen (the active ingredient in Tylenol\n®\n, an over-the-counter pain medication) may be associated with an increased risk of neurological conditions such as autism spectrum disorder and attention-deficit/hyperactivity disorder in children and cautioned against the use of Tylenol\n®\n by pregnant women. The U.S. Food and Drug Administration (“FDA”) also stated it initiated the process for a label change for acetaminophen and issued a notice to physicians. A third party, Informed Consent Action Network, filed a citizen petition regarding safety-related labeling changes for the use of over-the-counter acetaminophen-containing drug products during pregnancy. Our subsidiary, Kenvue Brands LLC, submitted its response to the citizen petition in October 2025, requesting that the FDA deny the petition. The foregoing actions may depress sales of acetaminophen and could result in an increased risk of future litigation containing similar claims. See Note 13, “Commitments and Contingencies,” to the Condensed Consolidated Financial Statements included herein for details regarding certain litigation matters that are currently pending related to acetaminophen.\nGoodwill\nDuring the fiscal three months ended September 28, 2025, there was a reassessment of the long-term outlook for the Skin Health and Beauty business. The revised outlook aimed to address slower growth in the broader skincare categories, as well as the recent decline in profitability of the Skin Health and Beauty reporting unit. We revised the internal forecasts to reflect the updated outlook. These changes in circumstances were determined to be a triggering event, which resulted in a quantitative interim impairment assessment of the fair value of the Skin Health and Beauty reporting unit.\nWe estimate the fair value of a reporting unit using a combination of a discounted cash flow model and a market-based approach. The discounted cash flow model relies on assumptions regarding revenue and net income growth rates, projected working capital needs, capital expenditures, and discount rates. Forecasted cash flows are discounted to present value to estimate the fair value. Under the market-based approach, we utilize the guideline public company method and market transaction method. These methods utilize valuation multiples derived from comparable publicly traded companies and relevant industry transactions, which are then applied to the reporting unit’s operating performance metrics. Based on the results of the assessment, the estimated fair value of the Skin Health and Beauty reporting unit exceeded the carrying value by approximately 10%; therefore, no impairment charge was recorded for the fiscal three months ended September 28, 2025. If all other assumptions were held constant, an increase of approximately 100 basis points in the selected discount rate would have resulted in an impairment charge. \nA decline in forecasted Net sales or net income, or adverse macroeconomic developments such as rising interest rates, could significantly reduce the excess between fair value and carrying value. We will continue to monitor the performance of the Skin Health and Beauty business; however, further deterioration of market conditions or an inability to execute on our strategies could lead to an impairment charge of the goodwill associated with the Skin Health and Beauty reporting unit in the future.\n42\nMacroeconomic Developments\nMacroeconomic developments, including changes in global trade policies, may adversely affect prevailing economic conditions and our business, results of operations, or financial condition. In 2025, the U.S. government issued executive orders imposing tariffs on goods imported into the United States. These actions, as well as retaliatory tariffs imposed by other countries on U.S. exports, are expected to increase supply chain costs in certain geographies and create economic uncertainty for consumers. While the situation is fluid, based on our preliminary analysis of the effects of the tariffs that have been implemented by the United States and retaliatory measures that are in effect as of the reporting date, we estimate incremental gross tariff exposure of approximately $150 million annualized. We continue to monitor the potential impacts that the increased tariffs and other trade restrictions may have on our business, and we continue to focus on internal mitigating actions to partially offset the impact.\nKey Factors Affecting Our Results\nWe believe that our performance and future success depend on a number of factors that present significant opportunities for us but also pose risks and challenges, including those discussed below, in Part I, Item 1A, “Risk Factors,” in our Annual Report, Part II, Item 1A, “Risk Factors,” included herein, and the section titled “Cautionary Note Regarding Forward-Looking Statements” included herein.\nRestructuring\nAs part of our continued transformation to a fit-for-purpose consumer company, during the fiscal year 2024, we began strategic initiatives intended to enhance organizational efficiencies and better position us for future growth (“Our Vue Forward”). To further Our Vue Forward, on May 6, 2024, our Board approved a multi-year initiative (the “2024 Multi-Year Restructuring Initiative”) to build on our strengths, improve our underlying information technology infrastructure, and optimize our cost structure by rebalancing resources to better position us for future growth. The 2024 Multi-Year Restructuring Initiative primarily includes global workforce reductions, changes in management structure, and the transition to centralized shared-service functions in lower-cost locations. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for further information.\nAcquisitions and Divestitures\nWe did not complete any significant acquisitions or divestitures during the fiscal three and nine months ended September 28, 2025 and September 29, 2024.\nLegal Proceedings\nSee Note 13, “Commitments and Contingencies,” to the Condensed Consolidated Financial Statements included herein for additional information regarding our current legal proceedings.\n43\nResults of Operations\nFiscal Three Months Ended September 28, 2025 Compared with Fiscal Three Months Ended September 29, 2024\nOur results for the fiscal three months ended September 28, 2025 and September 29, 2024 were as follows:\nFiscal Three Months Ended\nChange In Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nAmount\nPercent\nNet sales\n$\n3,764 \n$\n3,899 \n$\n(135)\n(3.5)\n%\nCost of sales\n1,538 \n1,617 \n(79)\n(4.9)\nGross profit\n2,226\n \n2,282\n \n(56)\n(2.5)\nSelling, general, and administrative expenses\n1,512 \n1,590 \n(78)\n(4.9)\nRestructuring expenses\n84 \n31 \n53 \n*\nOther operating expense, net\n1 \n7 \n(6)\n(85.7)\nOperating income\n629\n \n654\n \n(25)\n(3.8)\nOther expense (income), net\n10 \n(19)\n29 \n*\nInterest expense, net\n93 \n96 \n(3)\n(3.1)\nIncome before taxes\n526\n \n577\n \n(51)\n(8.8)\nProvision for taxes\n128 \n194 \n(66)\n(34.0)\nNet income\n$\n398\n \n$\n383\n \n$\n15\n \n3.9\n \n%\n* Calculation not meaningful.\nNet Sales\nNet sales were $3.8 billion and $3.9 billion for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $135 million, or 3.5%. Excluding the impact of favorable changes in foreign currency exchange rates of 1.0% and the reduction in Net sales related to divestitures of 0.1%, Organic sales (a non-GAAP financial measure as defined in “Segment Results—Organic Sales Change” below) decreased 4.4% driven by both volume-related decreases of 4.0% and unfavorable value realization (defined as price, including mix) of 0.4%. Volume-related decreases across segments were driven by changes in shipment timing as compared to the prior fiscal period in China and trade inventory reductions driven by retailer inventory management in the United States, as well as lower seasonal incidences impacting pediatric Pain Care and Allergy Care. Unfavorable value realization was driven by strategic price investments, primarily in Skin Health and Beauty. For additional information about the Net sales of our three reportable business segments, see “—Segment Results” below.\nThe following table presents a reconciliation of the change in U.S. GAAP Net sales to the change in Organic sales for the fiscal three months ended September 28, 2025 as compared to the fiscal three months ended September 29, 2024:\nFiscal Three Months Ended September 28, 2025 vs. September 29, 2024\nReported Net Sales Change\nImpact of Foreign Currency\nAcquisitions and Divestitures\nOrganic Sales Change\nTotal Organic Sales Change\nPrice/Mix\n(1)\nVolume\nTotal\n(3.5)\n%\n1.0\n \n%\n(0.1)\n%\n(4.4)\n%\n(0.4)\n%\n(4.0)\n%\n(1)\n Also referred to as value realization.\nCost of Sales\nCost of sales were $1.5 billion and $1.6 billion for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $79 million, or 4.9%. Gross profit margin expanded 60 basis points to 59.1% for the fiscal three months ended September 28, 2025 as compared to \n58.5%\n for the fiscal three months ended September 29, 2024. Changes in Cost of sales were primarily due to volume-related Net sales decreases. Changes in both Cost of sales and gross profit margin were also driven by gains attributable to the realization of benefits associated with our supply chain optimization initiatives, partially offset by net input cost inflation and the impact of tariffs imposed on goods imported into the United States. Changes in both Cost of sales and gross profit margin were also impacted by a reduction in stock-based compensation expense \n44\nattributable to a refinement to the methodology of our stock-based compensation expense allocations and forfeitures of unvested stock-based awards. Gross profit margin was also impacted by unfavorable\n \nvalue realization.\nSelling, General, and Administrative Expenses\nSelling, general, and administrative expenses were $1.5 billion and $1.6 billion for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $78 million, or 4.9%. Selling, general, and administrative expenses as a percentage of Net sales decreased 60 basis points to 40.2%\n \nfor the \nfiscal three months ended\n \nSeptember 28, 2025, as compared to 40.8% for the fiscal three months ended September 29, 2024. The decrease in Selling, general, and administrative expenses was primarily attributable to a $62 million decrease in Separation-related costs and savings from Our Vue Forward, partially offset by higher expenses related to brand support. The decrease was also driven by a reduction in stock-based compensation expense attributable to forfeitures of unvested stock-based awards, partially offset by a refinement to the methodology of our stock-based compensation expense allocations.\nRestructuring Expenses\nRestructuring expenses were $84 million and $31 million for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, an increase of $53 million. Restructuring expenses relate to costs incurred under Our Vue Forward and the increase was driven by higher information technology and project-related costs. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for additional information.\nOther Operating Expense, Net\nOther operating expense, net was $1 million and $7 million for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $6 million. Other operating expense, net for the fiscal three months ended September 28, 2025 and September 29, 2024 was driven by the $7 million and $11 million impact, respectively, of net economic benefit arrangements with J&J in connection with the Deferred Local Businesses (see Note 1, “Description of the Company and Summary of Significant Accounting Policies,” to the Condensed Consolidated Financial Statements included herein for additional information), partially offset by $8 million and $7 million, respectively, of royalty income. See Note 9, “Other Operating Expense, Net and Other Expense (Income), Net,” to the Condensed Consolidated Financial Statements included herein for additional information.\nOther Expense (Income), Net\nOther expense (income), net was $10 million and $(19) million for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a change of $29 million. Other expense (income), net for the fiscal three months ended September 28, 2025 was driven by $20 million of currency losses on transactions. Other expense (income), net for the fiscal three months ended September 29, 2024 was primarily driven by a $21 million gain recognized on the release of tax indemnification reserves that were no longer considered to be probable. See Note 9, “Other Operating Expense, Net and Other Expense (Income), Net,” to the Condensed Consolidated Financial Statements included herein for additional information.\nInterest Expense, Net\nInterest expense, net was $93 million and $96 million for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $3 million. Interest expense, net in both fiscal periods primarily consisted of interest expense, including amortization of discounts and debt issuance costs, recognized on the Senior Notes (as defined in Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein) and notes issued under our commercial paper program. See Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein for additional information.\nProvision for Taxes\nProvision for taxes was $128 million and $194 million for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $66 million. The decrease in Provision for taxes was primarily due to lower quarter-to-date pre-tax income and favorable return-to-provision adjustments. In addition, the worldwide effective income tax rates for the fiscal three months ended September 28, 2025 and September 29, 2024 were 24.3% and 33.6%, respectively. See Note 10, “Income Taxes,” to the Condensed Consolidated Financial Statements included herein for additional information.\n45\nSegment Results\nSegment profit is based on Operating income, excluding depreciation, amortization of intangible assets, Separation-related costs, restructuring expenses and operating model optimization initiatives, impairment charges, the impact of the conversion of stock-based awards, issuance of Founder Shares (as defined below), Other operating expense, net, and unallocated general corporate administrative expenses (referred to herein as “Segment adjusted operating income”), as the Chief Operating Decision Maker (the “CODM”) excludes these items in assessing segment financial performance. General corporate/unallocated expenses, which include expenses related to treasury, legal operations, and certain other expenses, along with gains and losses related to the overall management of our Company, are not allocated to the segments. In assessing segment performance and managing operations, the CODM does not review segment assets.\nSee Note 14, “Segments of Business,” to the Condensed Consolidated Financial Statements included herein for additional information.\n46\nFiscal Three Months Ended September 28, 2025 Compared with Fiscal Three Months Ended September 29, 2024\nThe following tables present Segment net sales and Segment adjusted operating income and the period-over-period changes in Segment net sales and Segment adjusted operating income for the fiscal three months ended September 28, 2025 and September 29, 2024. See Note 14, “Segments of Business,” to the Condensed Consolidated Financial Statements included herein for further details regarding Segment net sales and Segment adjusted operating income.\nFiscal Three Months Ended\nChange In Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nSelf Care\nSkin Health and Beauty\nEssential Health\nTotal\nSelf Care\nSkin Health and Beauty\nEssential Health\nTotal\nAmount\nPercent\nNet sales\n$\n1,564 \n$\n1,038 \n$\n1,162 \n$\n3,764 \n$\n1,625 \n$\n1,072 \n$\n1,202 \n$\n3,899 \n$\n(135)\n(3.5)\n%\nSegment adjusted Cost of sales\n(1)\n546 \n401 \n512 \n1,459 \n569 \n421 \n539 \n1,529 \n(70)\n(4.6)\nOther segment expense items\n(2)\n498 \n500 \n343 \n1,341 \n499 \n460 \n372 \n1,331 \n10 \n0.8 \nSegment adjusted operating income\n$\n520\n \n$\n137\n \n$\n307\n \n$\n964\n \n$\n557\n \n$\n191\n \n$\n291\n \n$\n1,039\n \n$\n(75)\n(7.2)\n%\nReconciliation to Income before taxes\nLess:\nDepreciation\n(3)\n75 \n94 \nAmortization of intangible assets\n(4)\n66 \n66 \nSeparation-related costs\n(5)\n17 \n85 \nRestructuring expenses and operating model optimization initiatives\n(6)\n97 \n38 \nConversion of stock-based awards\n(7)\n1 \n6 \nFounder Shares\n(8)\n(4)\n7 \nOther operating expense, net\n1 \n7 \nGeneral corporate/unallocated expenses\n82 \n82 \nOperating income\n$\n629\n \n$\n654\n \nOther expense (income), net\n10 \n(19)\nInterest expense, net\n93 \n96 \nIncome before taxes\n$\n526\n \n$\n577\n \n(1)\n We define Segment adjusted cost of sales as Cost of sales adjusted for amortization of intangible assets, Separation-related costs, conversion of stock-based awards, Founder Shares (as defined below), operating model optimization initiatives, and general corporate/unallocated expenses.\n(2)\n Other segment expense items for each reportable segment include brand support, employee-related costs, shipping and handling costs, research and development costs, and certain other operating expenses (income).\n(3)\n Depreciation consists of depreciation of property, plant, and equipment and amortization of integration and development costs capitalized in connection with cloud computing arrangements.\n47\n(4)\n Relates to the amortization of definite-lived intangible assets (primarily trademarks, trade names, and customer lists) over their estimated useful lives.\n(5)\n Separation-related costs includes depreciation expense on Separation-related assets for the fiscal three months ended September 29, 2024. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Separation-Related Costs,” to the Condensed Consolidated Financial Statements included herein for additional information regarding Separation-related costs.\n(6)\n Restructuring expenses and operating model optimization initiatives relate to the 2024 Multi-Year Restructuring Initiative. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for additional information.\n(7)\n Segment adjusted operating income excludes the impact of the conversion of stock-based awards that occurred on August 23, 2023. The adjustment represents the net impact of the gain on reversal of previously recognized stock-based compensation expense, offset by stock-based compensation expense recognized in the fiscal three months ended September 28, 2025 and September 29, 2024 relating to employee services provided prior to the Separation.\n(8)\n On August 25, 2023, our Compensation & Human Capital Committee approved equity grants to individuals employed by Kenvue as of October 2, 2023 (the “Founder Shares”). On October 2, 2023, the Founder Shares were granted to all Kenvue employees in the form of stock options and performance stock units (“PSUs”) to executive officers and either stock options and PSUs or restricted stock units (“RSUs”) to non-executive individuals.\nFiscal Three Months Ended\nChange in Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nAmount\nPercent\nAmount\nPercent\nAmount\nPercent\nSegment Net Sales\nSelf Care\n$\n1,564 \n41.5 \n%\n$\n1,625 \n41.7 \n%\n$\n(61)\n(3.8)\n%\nSkin Health and Beauty\n1,038 \n27.6 \n1,072 \n27.5 \n(34)\n(3.2)\nEssential Health\n1,162 \n30.9 \n1,202 \n30.8 \n(40)\n(3.3)\nSegment net sales\n$\n3,764\n \n100.0\n \n%\n$\n3,899\n \n100.0\n \n%\n$\n(135)\n(3.5)\n%\nSelf Care\n$\n520 \n$\n557 \n$\n(37)\n(6.6)\n%\nSkin Health and Beauty\n137 \n191 \n(54)\n(28.3)\nEssential Health\n307 \n291 \n16 \n5.5 \nSegment adjusted operating income\n(1)\n$\n964\n \n$\n1,039\n \n$\n(75)\n(7.2)\n%\n(1)\n Refer to the table above for the reconciliation of Segment adjusted operating income to Operating income and Income before taxes in the Condensed Consolidated Financial Statements.\nOrganic Sales Change\nWe define Organic sales, a non-GAAP financial measure, as Net sales excluding the impact of changes in foreign currency exchange rates and the impact of acquisitions and divestitures. We assess our Net sales performance by measuring the period-over-period change in Organic sales. Management believes reporting period-over-period changes in Organic sales provides investors with additional, supplemental information that is useful in assessing our results of operations by excluding the impact of certain items that we believe do not directly reflect our underlying operations.\nThe following table presents a reconciliation of the change in U.S. GAAP Net sales to the change in Organic sales for the fiscal three months ended September 28, 2025 as compared to the fiscal three months ended September 29, 2024:\nFiscal Three Months Ended September 28, 2025 vs. September 29, 2024\nReported Net Sales Change\nImpact of Foreign Currency\nAcquisitions and Divestitures\nOrganic Sales Change\nTotal Organic Sales Change\nPrice/Mix\n(1)\nVolume\nSelf Care\n(3.8)\n%\n1.5 \n%\n— \n%\n(5.3)\n%\n(0.3)\n%\n(5.0)\n%\nSkin Health and Beauty\n(3.2)\n0.6 \n(0.3)\n(3.5)\n(1.3)\n(2.2)\nEssential Health\n(3.3)\n0.9 \n— \n(4.2)\n0.1 \n(4.3)\nTotal\n(3.5)\n%\n1.0\n \n%\n(0.1)\n%\n(4.4)\n%\n(0.4)\n%\n(4.0)\n%\n(1)\n Also referred to as value realization.\n48\nSelf Care Segment\nSelf Care Segment Net Sales \nThe Self Care Segment Net sales were $1.6 billion for both the fiscal three months ended September 28, 2025 and September 29, 2024. For the fiscal three months ended September 28, 2025, Net sales decreased $61 million, or 3.8%, as compared to the fiscal three months ended September 29, 2024. Excluding the impact of favorable changes in foreign currency exchange rates of 1.5%, Organic sales decreased 5.3% driven by both volume-related decreases of 5.0% and unfavorable value realization of 0.3% attributable to strategic price investments. Volume-related decreases, primarily in China and the United States, were attributable to lower incidences of illnesses affecting pediatric Pain Care products and the impact of a softer season on Allergy Care products coupled with changes in shipment timing as compared to the prior fiscal period due to the impact of lower inventory replenishment following inventory builds in the prior year. Volume-related decreases were further impacted by trade inventory reductions driven by retailer inventory management in the United States.\nSelf Care Segment Adjusted Operating Income\nThe Self Care Segment adjusted operating income decreased by $37 million, or 6.6%, to $520 million for the fiscal three months ended September 28, 2025 as compared to the fiscal three months ended September 29, 2024. The decrease was primarily driven by volume-related Net sales decreases, net input cost inflation, and the impact of tariffs imposed on goods imported into the United States, partially offset by the realization of benefits associated with our supply chain optimization initiatives, savings from Our Vue Forward resulting in administrative expense reductions, and lower expenses related to brand support.\nSkin Health and Beauty Segment\nSkin Health and Beauty Segment Net Sales\nThe Skin Health and Beauty Segment Net sales were $1.0 billion and $1.1 billion for the fiscal three months ended September 28, 2025 and September 29, 2024, respectively, \na decrease of $34 million, or 3.2%\n. Excluding the impact of \nfavorable\n changes in foreign currency exchange rates of \n0.6%\n \nand the reduction in Net sales related to divestitures of 0.3%\n, Organic sales \ndecreased\n 3.5% driven by both volume-related \ndecreases\n of \n2.2% and unfavorable value realization of 1.3% attributable to strategic price investments. Volume-related decreases were attributable to changes in shipment timing as compared to the prior fiscal year due to the impact of lower inventory replenishment following inventory builds in the prior year in China. Volume-related decreases were further impacted by trade inventory reductions driven by retailer inventory management in the United States.\nSkin Health and Beauty Segment Adjusted Operating Income\nThe Skin Health and Beauty Segment \nadjusted operating income\n \ndecreased by $54 million, or 28.3%, to $137 million for the fiscal three months ended September 28, 2025 as compared to the fiscal three months ended September 29, 2024. The decrease was primarily driven by higher expenses related to brand support, volume-related Net sales decreases, net input cost inflation, unfavorable changes in foreign currency exchange rates, the impact of tariffs imposed on goods imported into the United States, and unfavorable value realization, partially offset by the realization of benefits associated with our supply chain optimization initiatives and savings from Our Vue Forward resulting in administrative expense reductions.\nEssential Health Segment\nEssential Health Segment Net Sales\nThe Essential Health Segment Net sales were $1.2 billion for both the fiscal three months ended September 28, 2025 and September 29, 2024. For the fiscal three months ended September 28, 2025, Net sales decreased \n$40 million\n, or 3.3%, as compared to the fiscal three months ended September 29, 2024. Excluding the impact of favorable changes in foreign currency exchange rates of 0.9%, Organic sales decreased 4.2% driven by both volume-related decreases of 4.3% and favorable value realization of 0.1%. Volume-related decreases were attributable to changes in shipment timing as compared to the prior fiscal period in North America and Asia Pacific, which included impacts from the timing of promotions in Oral Care in the United States. Volume-related decreases were further impacted by competitive pressures in Oral Care and trade inventory reductions driven by retailer inventory management in the United States.\n49\nEssential Health Segment \nAdjusted Operating Income\nThe Essential Health Segment adjusted operating income increased by $16 million, or 5.5%, to $307 million for the fiscal three months ended September 28, 2025 as compared to the fiscal three months ended September 29, 2024. The increase was primarily driven by lower expenses related to brand support, the realization of benefits associated with our supply chain optimization initiatives, and savings from Our Vue Forward resulting in administrative expense reductions, partially offset by volume-related Net sales decreases, net input cost inflation, unfavorable changes in foreign currency exchange rates, and the impact of tariffs imposed on goods imported into the United States.\nResults of Operations\nFiscal Nine Months Ended September 28, 2025 Compared with Fiscal Nine Months Ended September 29, 2024\nOur results for the fiscal nine months ended September 28, 2025 and September 29, 2024 were as follows:\nFiscal Nine Months Ended\nChange In Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nAmount\nPercent\nNet sales\n$\n11,344 \n$\n11,793 \n$\n(449)\n(3.8)\n%\nCost of sales\n4,689 \n4,904 \n(215)\n(4.4)\nGross profit\n6,655\n \n6,889\n \n(234)\n(3.4)\nSelling, general, and administrative expenses\n4,553 \n4,804 \n(251)\n(5.2)\nRestructuring expenses\n204 \n120 \n84 \n70.0 \nImpairment charges\n— \n578 \n(578)\n*\nOther operating expense, net\n19 \n29 \n(10)\n(34.5)\nOperating income\n1,879\n \n1,358\n \n521\n \n38.4\n \nOther expense, net\n26 \n6 \n20 \n*\nInterest expense, net\n281 \n283 \n(2)\n(0.7)\nIncome before taxes\n1,572\n \n1,069\n \n503\n \n47.1\n \nProvision for taxes\n432 \n332 \n100 \n30.1 \nNet income\n$\n1,140\n \n$\n737\n \n$\n403\n \n54.7\n \n%\n* Calculation not meaningful.\nNet Sales\nNet sales were $11.3 billion and $11.8 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $449 million, or 3.8%. Excluding the impact of unfavorable changes in foreign currency exchange rates of 0.5%, Organic sales decreased\n \n3.3% driven by both volume-related decreases of 2.7% and unfavorable value realization of 0.6%. Volume-related decreases\n \nacross segments were driven by changes in shipment timing as compared to the prior fiscal year in China and trade inventory reductions driven by retailer inventory management in the United States, as well as lower seasonal incidences impacting pediatric Pain Care, Allergy Care, and Cough and Cold. Unfavorable value realization was driven by strategic price investments, primarily in Skin Health and Beauty. For additional information about the Net sales of our three reportable business segments, see “—Segment Results” below.\n50\nThe following table presents a reconciliation of the change in U.S. GAAP Net sales to the change in Organic sales for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024:\nFiscal Nine Months Ended September 28, 2025 vs. September 29, 2024\nReported Net Sales Change\nImpact of Foreign Currency\nOrganic Sales Change\nTotal Organic Sales Change\nPrice/Mix\n(1)\nVolume\nTotal\n(3.8)\n%\n(0.5)\n%\n(3.3)\n%\n(0.6)\n%\n(2.7)\n%\n(1)\n Also referred to as value realization.\nCost of Sales\nCost of sales were $4.7 billion and $4.9 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $215 million, or 4.4%. Gross profit margin expanded 30 basis points to \n58.7%\n for the fiscal nine months ended September 28, 2025 as compared to \n58.4%\n for the fiscal nine months ended September 29, 2024. Changes in Cost of sales were primarily due to volume-related Net sales decreases. Changes in both Cost of sales and gross profit margin were also driven by gains attributable to the realization of benefits associated with our supply chain optimization initiatives, partially offset by net input cost inflation. Changes in both Cost of sales and gross profit margin were also impacted by a reduction in stock-based compensation expense attributable to a refinement to the methodology of our stock-based compensation expense allocations, forfeitures of unvested stock-based awards, and the vesting of stock-based awards. Gross profit margin was also impacted by unfavorable value realization.\nSelling, General, and Administrative Expenses\nSelling, general, and administrative expenses were $4.6 billion and $4.8 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $251 million, or 5.2%. Selling, general, and administrative expenses as a percentage of Net sales decreased\n \n60 basis points to 40.1% for the fiscal nine months ended September 28, 2025, as compared to 40.7% for the fiscal nine months ended September 29, 2024. The decrease in Selling, general, and administrative expenses was primarily attributable to a $138 million decrease in Separation-related costs and savings from Our Vue Forward. The decrease was also driven by a reduction in stock-based compensation expense attributable to forfeitures of unvested stock-based awards as well as the vesting of stock-based awards, partially offset by a refinement to the methodology of our stock-based compensation expense allocations.\nRestructuring Expenses\nRestructuring expenses were $204 million and $120 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, an increase of $84 million. Restructuring expenses relate to costs incurred under Our Vue Forward and the increase was driven by higher information technology and project-related costs. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for additional information.\nImpairment Charges\nImpairment charges were $578 million for the fiscal nine months ended September 29, 2024, which were driven by a non-cash charge of $488 million ($337 million after-tax) to adjust the carrying value of intangible assets and property, plant, and equipment related to the Dr.Ci:Labo\n®\n skin health business. The impairment was due primarily to revisions to internal forecasts for the business as a result of updates in our strategy to reach more consumers and appropriately address evolving market dynamics, including shifts in consumer sentiment in China as well as changing shopping patterns in the region. Impairment charges for the fiscal nine months ended September 29, 2024 were also driven by the impact of a $68 million non-cash impairment charge related to our former corporate headquarters in Skillman, New Jersey, which was classified as held for sale on February 21, 2024. Additionally, we recognized a non-cash impairment charge of $22 million related to certain software development assets. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Impairment Charges,” to the Condensed Consolidated Financial Statements included herein for additional information. There were no impairment charges recognized in the fiscal three months ended September 29, 2024 or in the fiscal nine months ended September 28, 2025.\n51\nOther Operating Expense, Net\nOther operating expense, net was $19 million and $29 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $10 million. Other operating expense, net for the fiscal nine months ended September 28, 2025 and September 29, 2024 was driven by the $35 million\n \nand\n \n$49 million impact, respectively, of net economic benefit arrangements with J&J in connection with the Deferred Local Businesses (see Note 1, “Description of the Company and Summary of Significant Accounting Policies,” to the Condensed Consolidated Financial Statements included herein for additional information), partially offset by $26 million and $24 million, respectively, of royalty income. See Note 9, “Other Operating Expense, Net and Other Expense (Income), Net,” to the Condensed Consolidated Financial Statements included herein for additional information.\nOther Expense, Net\nOther expense, net was $26 million and $6 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, an increase of $20 million. Other expense, net for the fiscal nine months ended September 28, 2025 was driven by $37 million of currency losses on transactions. Other expense, net for the fiscal nine months ended September 29, 2024 was driven by $31 million in losses on investments, partially offset by a $21 million gain recognized on the release of tax indemnification reserves that were no longer considered to be probable. See Note 9, “Other Operating Expense, Net and Other Expense (Income), Net,” to the Condensed Consolidated Financial Statements included herein for additional information.\nInterest Expense, Net\nInterest expense, net was $281 million and $283 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $2 million. Interest expense, net in both fiscal periods primarily consisted of interest expense, including amortization of discounts and debt issuance costs, recognized on the Senior Notes (as defined in Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein) and notes issued under our commercial paper program. See Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein for additional information.\nProvision for Taxes\nProvision for taxes was $432 million and $332 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, an increase of $100 million. The increase in Provision for taxes was primarily due to higher year-to-date pre-tax income, income tax benefits recognized during the fiscal nine months ended September 29, 2024 resulting from the impairment to the Dr.Ci:Labo\n® \nskin health business, the remeasurement of our state deferred tax liability recognized during the fiscal nine months ended September 29, 2024 as a result of a change in our state tax rate, and reduced income tax benefits derived from fewer releases of income tax reserves due to the expiration of certain statutes of limitations during the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024. The increase was partially offset by favorable return-to-provision adjustments, as well as a windfall on stock-based compensation recorded during the fiscal nine months ended September 28, 2025 as compared to a shortfall on stock-based compensation recorded during the fiscal nine months ended September 29, 2024. In addition, the worldwide effective income tax rates for the fiscal nine months ended September 28, 2025 and September 29, 2024 were 27.5% and 31.1%, respectively. See Note 10, “Income Taxes,” to the Condensed Consolidated Financial Statements included herein for additional information.\n52\nSegment Results\nFiscal Nine Months Ended September 28, 2025 Compared with Fiscal Nine Months Ended September 29, 2024\nThe following tables present Segment net sales and Segment adjusted operating income and the period-over-period changes in Segment net sales and Segment adjusted operating income for the fiscal nine months ended September 28, 2025 and September 29, 2024. See Note 14, “Segments of Business,” to the Condensed Consolidated Financial Statements included herein for further details regarding Segment net sales and Segment adjusted operating income.\nFiscal Nine Months Ended\nChange In Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nSelf Care\nSkin Health and Beauty\nEssential Health\nTotal\nSelf Care\nSkin Health and Beauty\nEssential Health\nTotal\nAmount\nPercent\nNet sales \n$\n4,786 \n$\n3,074 \n$\n3,484 \n$\n11,344 \n$\n4,958 \n$\n3,229 \n$\n3,606 \n$\n11,793 \n$\n(449)\n(3.8)\n%\nSegment adjusted Cost of sales\n(1)\n1,681 \n1,236 \n1,539 \n4,456 \n1,693 \n1,324 \n1,597 \n4,614 \n(158)\n(3.4)\nOther segment expense items\n(2)\n1,492 \n1,460 \n1,048 \n4,000 \n1,573 \n1,403 \n1,095 \n4,071 \n(71)\n(1.7)\nSegment adjusted operating income\n$\n1,613\n \n$\n378\n \n$\n897\n \n$\n2,888\n \n$\n1,692\n \n$\n502\n \n$\n914\n \n$\n3,108\n \n$\n(220)\n(7.1)\n%\nReconciliation to Income before taxes\nLess:\nDepreciation\n(3)\n226 \n238 \nAmortization of intangible assets\n(4)\n193 \n212 \nSeparation-related costs\n(5)\n79 \n231 \nRestructuring expenses and operating model optimization initiatives\n(6)\n232 \n146 \nImpairment charges\n(7)\n— \n578 \nConversion of stock-based awards\n(8)\n5 \n34 \nFounder Shares\n(9)\n4 \n24 \nOther operating expense, net\n19 \n29 \nGeneral corporate/unallocated expenses\n251 \n258 \nOperating income\n$\n1,879\n \n$\n1,358\n \nOther expense, net\n26 \n6 \nInterest expense, net\n281 \n283 \nIncome before taxes\n$\n1,572\n \n$\n1,069\n \n(1)\n We define Segment adjusted cost of sales as Cost of sales adjusted for amortization of intangible assets, Separation-related costs, conversion of stock-based awards, Founder Shares, operating model optimization initiatives, and general corporate/unallocated expenses.\n53\n(2)\n Other segment expense items for each reportable segment include brand support, employee-related costs, shipping and handling costs, research and development costs, and certain other operating expenses (income).\n(3)\n Depreciation consists of depreciation of property, plant, and equipment and amortization of integration and development costs capitalized in connection with cloud computing arrangements.\n(4)\n Relates to the amortization of definite-lived intangible assets (primarily trademarks, trade names, and customer lists) over their estimated useful lives.\n(5)\n Separation-related costs includes depreciation expense on Separation-related assets for the fiscal nine months ended September 29, 2024. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Separation-Related Costs,” to the Condensed Consolidated Financial Statements included herein for additional information regarding Separation-related costs.\n(6)\n Restructuring expenses and operating model optimization initiatives relate to the 2024 Multi-Year Restructuring Initiative. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for additional information.\n(7)\n Impairment charges for the fiscal nine months ended September 29, 2024 includes $488 million\n \nrecognized in relation to Dr.Ci:Labo\n®\n long-lived assets, $68 million recognized on the held for sale asset associated with the Company’s former corporate headquarters in Skillman, New Jersey, and $22 million recognized on certain software development assets. See Note 1, “Description of the Company and Summary of Significant Accounting Policies—Impairment Charges,” to the Condensed Consolidated Financial Statements included herein for additional information. \n(8)\n Segment adjusted operating income excludes the impact of the conversion of stock-based awards that occurred on August 23, 2023. The adjustment represents the net impact of the gain on reversal of previously recognized stock-based compensation expense, offset by stock-based compensation expense recognized in the fiscal nine months ended September 28, 2025 and September 29, 2024 relating to employee services provided prior to the Separation.\n(9)\n On August 25, 2023, our Compensation & Human Capital Committee approved the Founder Shares. On October 2, 2023, the Founder Shares were granted to all Kenvue employees in the form of stock options and PSUs to executive officers and either stock options and PSUs or RSUs to non-executive individuals.\nFiscal Nine Months Ended\nChange in Fiscal Period\nSeptember 28, 2025\nSeptember 29, 2024\nChange 2024 to 2025\n(Dollars in Millions)\nAmount\nPercent\nAmount\nPercent\nAmount\nPercent\nSegment Net Sales\nSelf Care\n$\n4,786 \n42.2 \n%\n$\n4,958 \n42.0 \n%\n$\n(172)\n(3.5)\n%\nSkin Health and Beauty\n3,074 \n27.1 \n3,229 \n27.4 \n(155)\n(4.8)\nEssential Health\n3,484 \n30.7 \n3,606 \n30.6 \n(122)\n(3.4)\nSegment net sales\n$\n11,344\n \n100.0\n \n%\n$\n11,793\n \n100.0\n \n%\n$\n(449)\n(3.8)\n%\nSelf Care\n$\n1,613 \n$\n1,692 \n$\n(79)\n(4.7)\n%\nSkin Health and Beauty\n378 \n502 \n(124)\n(24.7)\nEssential Health\n897 \n914 \n(17)\n(1.9)\nSegment adjusted operating income\n(1)\n$\n2,888\n \n$\n3,108\n \n$\n(220)\n(7.1)\n%\n(1)\n Refer to the table above for the reconciliation of Segment adjusted operating income to Operating income and Income before taxes in the Condensed Consolidated Financial Statements.\n54\nOrganic Sales Change\nThe following table presents a reconciliation of the change in U.S. GAAP Net sales to the change in Organic sales for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024:\nFiscal Nine Months Ended September 28, 2025 vs. September 29, 2024\nReported Net Sales Change\nImpact of Foreign Currency\nAcquisitions and Divestitures\nOrganic Sales Change\nTotal Organic Sales Change\nPrice/Mix\n(1)\nVolume\nSelf Care\n(3.5)\n%\n0.1 \n%\n— \n%\n(3.6)\n%\n— \n%\n(3.6)\n%\nSkin Health and Beauty\n(4.8)\n(0.6)\n(0.2)\n(4.0)\n(1.9)\n(2.1)\nEssential Health\n(3.4)\n(1.2)\n— \n(2.2)\n(0.2)\n(2.0)\nTotal\n(3.8)\n%\n(0.5)\n%\n—\n \n%\n(3.3)\n%\n(0.6)\n%\n(2.7)\n%\n(1)\n Also referred to as value realization.\nSelf Care Segment\nSelf Care Segment Net Sales \nThe Self Care Segment Net sales were $4.8 billion and $5.0 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $172 million, or 3.5%. Excluding the impact of favorable changes in foreign currency exchange rates of 0.1%, Organic sales decreased 3.6% driven by volume-related decreases\n \nof 3.6%, while value realization remained flat. Volume-related decreases, primarily in China and the United States, were primarily attributable to lower incidences of illnesses affecting pediatric Pain Care products, as well as the impact of a softer season on Allergy Care products and the most recent weak cough and cold season on Cough and Cold Products, coupled with changes in shipment timing as compared to the prior fiscal period due to the impact of lower inventory replenishment following inventory builds in the prior year. Volume-related decreases were partially offset by growth in Smoking Cessation in Europe, Middle East, and Africa.\nSelf Care Segment Adjusted Operating Income\nThe Self Care Segment adjusted operating income decreased by $79 million, or 4.7%, to $1,613 million for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024. The decrease was primarily driven by volume-related Net sales decreases, volume deleverage at internal manufacturing sites, unfavorable changes in foreign currency exchange rates, net input cost inflation, and the impact of tariffs imposed on goods imported into the United States, partially offset by the realization of benefits associated with our supply chain optimization initiatives, lower expenses related to brand support, and savings from Our Vue Forward resulting in administrative expense reductions.\nSkin Health and Beauty Segment\nSkin Health and Beauty Segment Net Sales\nThe Skin Health and Beauty Segment Net sales were $3.1 billion and $3.2 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $155 million, or 4.8%. Excluding the impact of unfavorable changes in foreign currency exchange rates of 0.6% and the reduction in Net sales related to divestitures of 0.2%, Organic sales decreased 4.0% driven by both volume-related decreases of 2.1% and unfavorable value realization of 1.9% attributable to strategic price investments. Volume-related decreases were attributable to changes in shipment timing as compared to the prior fiscal year due to the impact of lower inventory replenishment following inventory builds in the prior year in China, as well as trade inventory reductions driven by retailer inventory management in the United States. Volume-related decreases were further impacted by a softer sun season in the United States, market softness in Asia Pacific, and current fiscal year competitive pressures resulting in market share losses.\nSkin Health and Beauty Segment Adjusted Operating Income\nThe Skin Health and Beauty Segment adjusted operating income decreased by $124 million, or 24.7%, to $378 million for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024. The decrease \n55\nwas primarily driven by volume-related Net sales decreases, unfavorable value realization, higher expenses related to brand support, unfavorable changes in foreign currency exchange rates, net input cost inflation, and the impact of tariffs imposed on goods imported into the United States, partially offset by the realization of benefits associated with our supply chain optimization initiatives and savings from Our Vue Forward resulting in administrative expense reductions.\nEssential Health Segment\nEssential Health Segment Net Sales\nThe Essential Health Segment Net sales were $3.5 billion and $3.6 billion for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, a decrease of $122 million, or 3.4%. Excluding the impact of unfavorable changes in foreign currency exchange rates of 1.2%, Organic sales decreased 2.2% driven by both volume-related decreases of 2.0% and unfavorable value realization of 0.2% attributable to strategic price investments. Volume-related decreases were attributable to trade inventory reductions driven by retailer inventory management in the United States, primarily in Oral Care and Wound Care, as well as market deceleration in Oral Care in North America and competitive pressures in Oral Care in North America and Baby Care in Asia Pacific, partially offset by growth across product categories in Latin America.\nEssential Health Segment Adjusted Operating Income\nThe Essential Health Segment adjusted operating income decreased by $17 million, or 1.9%, to $897 million for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024. The decrease was primarily driven by volume-related Net sales decreases, unfavorable changes in foreign currency exchange rates, net input cost inflation, and the impact of tariffs imposed on goods imported into the United States, partially offset by the realization of benefits associated with our supply chain optimization initiatives and lower expenses related to brand support. Segment adjusted operating income margin increased by 0.4% for the fiscal nine months ended September 28, 2025 as compared to the fiscal nine months ended September 29, 2024\nLiquidity and Capital Resources\nCash Flows\nSummarized cash flow information for the fiscal nine months ended September 28, 2025 and September 29, 2024 were as follows:\nChange In Fiscal Period\nFiscal Nine Months Ended\nChange 2024 to 2025\n(Dollars in Millions)\nSeptember 28, 2025\nSeptember 29, 2024\nAmount\nPercent\nNet income\n$\n1,140 \n$\n737 \n$\n403 \n54.7 \n%\nNet changes in assets and liabilities\n$\n(365)\n$\n(833)\n$\n468 \n(56.2)\n%\nNet cash flows from operating activities\n$\n1,343 \n$\n976 \n$\n367 \n37.6 \n%\nNet cash flows used in investing activities\n$\n(361)\n$\n(293)\n$\n(68)\n23.2 \n%\nNet cash flows used in financing activities\n$\n(968)\n$\n(978)\n$\n10 \n(1.0)\n%\n* Calculation not meaningful.\nOperating Activities\nNet cash flows from operating activities were $1,343 million and $976 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, an increase of \n$367 million\n. The \nincrease\n was primarily attributable to net changes in working capital balances driven by Accounts payable and accrued liabilities due to the timing of payments and Trade receivables due to the timing of sales relative to collections.\nInvesting Activities\nNet cash flows used in investing activities were \n$361 million\n and $293 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, \nan increase\n of \n$68 million\n. Net cash flows used in investing activities were primarily driven by purchases of property, plant, and equipment in both the fiscal nine months ended September 28, 2025 and September 29, 2024.\n56\nFinancing Activities\nNet cash flows used in financing activities were \n$968 million\n and $978 million for the fiscal nine months ended September 28, 2025 and September 29, 2024, respectively, \na decrease\n of \n$10 million\n. Net cash flows used in financing activities for the fiscal nine months ended September 28, 2025 were primarily driven by $1,183 million of dividends paid, the $750 million repayment of the 5.50% Senior Notes due 2025 (as defined in Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein), and $197 million of payments made to purchase treasury stock, partially offset by \n$746 million\n of net proceeds from the issuance of the 4.85% Senior Notes due 2032 (as defined in Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein), and $324 million of net proceeds from the issuance of commercial paper under our commercial paper program. Net cash flows used in financing activities for the fiscal nine months ended September 29, 2024 were primarily driven by $1,159 million of dividends paid and $114 million of payments made to purchase treasury stock, partially offset by $258 million of net proceeds from the issuance of commercial paper under our commercial paper program.\nSources of Liquidity\nOur primary sources of liquidity are cash on hand, which consisted of Cash and cash equivalents of $1,139 million as of September 28, 2025, cash flows from operations, borrowing capacity under a revolving credit facility of $4.0 billion which expires in March 2029,\n \nand authorized commercial paper program issuance of $4.0 billion. Also, on February 24, 2025, we filed a registration statement on Form S-3 with the SEC under which from time to time we may sell securities. On May 22, 2025, we issued a series of senior unsecured notes maturing in 2032 in an aggregate principal amount of $750 million.\nAs of September 28, 2025, total debt was $8,973 million. As of September 28, 2025, we had $7,685 million of Senior Notes (as defined in Note 4, “Borrowings,” to the Condensed Consolidated Financial Statements included herein) outstanding, net of related discounts and debt issuance costs of $65 million, no amounts outstanding under our revolving credit facility, and $1,158 million of outstanding balances under our commercial paper program, net of a related discount of $2 million.\nOur ability to fund our operating needs will depend on our ability to continue to generate positive cash flows from operations and on our ability to obtain debt financing on acceptable terms or to issue additional equity or equity-linked securities. Based upon our history of generating positive cash flows, we believe our existing cash and cash generated from operations will be sufficient to service our current obligations for at least the next 12 months. \nManagement believes that our cash balances and funds provided by operating activities, along with borrowing capacity and access to capital markets, taken as a whole, provide adequate liquidity to meet all of our current and long-term obligations when due, including third-party debt, adequate liquidity to fund capital expenditures, and flexibility to meet investment opportunities that may arise. However, we cannot assure you that we will be able to obtain additional debt or equity financing on acceptable terms in the future.\nCash and cash equivalents increased by $69 million during the fiscal nine months ended September 28, 2025 to $1,139 million as of September 28, 2025, as compared to $1,070 million as of December 29, 2024. Cash and cash equivalents held by our foreign subsidiaries was $1,120 million and $1,044 million as of September 28, 2025 and December 29, 2024, respectively.\nRestructuring\nAs part of our continued transformation to a fit-for-purpose consumer company, during the fiscal year 2024, we began Our Vue Forward to enhance organizational efficiencies and better position Kenvue for future growth. To further Our Vue Forward, on May 6, 2024, our Board approved the 2024 Multi-Year Restructuring Initiative to build on our strengths, improve our underlying information technology infrastructure, and optimize our cost structure by rebalancing resources to better position us for future growth. The 2024 Multi-Year Restructuring Initiative is expected to result in pre-tax restructuring expenses and other charges totaling approximately $550 million. We planned to incur approximately $275 million in pre-tax restructuring expenses and other charges in each of fiscal year 2024 and fiscal year 2025. We incurred lower than expected spend in fiscal year 2024 due to the shift in timing of certain information technology and project-related costs to fiscal year 2025. Over the life of the initiative, a majority of the pre-tax expenses and other charges are expected to be paid in cash. These charges are expected to be funded primarily through cash flows generated from operations. We began to realize savings resulting from the 2024 Multi-Year Restructuring Initiative in fiscal year 2024, and we expect to realize the full extent of annualized pre-tax gross cost savings of approximately $350 million beginning in fiscal year 2026. In accordance with plan, we have largely reinvested savings realized inception-to-date in association with the 2024 Multi-Year Restructuring Initiative in future growth opportunities, including immediate reinvestment behind advertising, product promotion, and healthcare professional engagement. Our estimates of the costs of the initiative and the expected benefits are preliminary estimates and are subject to a number of \n57\nassumptions, including local law requirements in various jurisdictions. Actual charges may differ, possibly materially, from the estimates provided above. See Note 15, “Restructuring Expenses and Operating Model Optimization Initiatives,” to the Condensed Consolidated Financial Statements included herein for further information.\nDividends\nQuarterly dividends have been paid to our shareholders since the Kenvue IPO. A summary of cash dividends per share on the outstanding Kenvue common stock declared to shareholders by our Board and paid during the fiscal nine months ended September 28, 2025 is presented below:\nDeclaration Date\nRecord Date\nPayment Date\nPer Share Amount\nJanuary 16, 2025\nFebruary 12, 2025\nFebruary 26, 2025\n$0.205\nApril 16, 2025\nMay 14, 2025\nMay 28, 2025\n$0.205\nJuly 30, 2025\nAugust 13, 2025\nAugust 27, 2025\n$0.2075\nOn October 29, 2025, we announced that our Board declared a dividend of $0.2075 per share on our common stock. The dividend is payable on November 26, 2025 to shareholders of record as of the close of business on November 12, 2025.\nWe expect to continue to pay cash dividends on a quarterly basis. However, the declaration of dividends is subject to the discretion of our Board.\nFuture Cash Requirements\nWe expect our future cash requirements will relate to working capital, capital expenditures, restructuring and integration, compensation and benefit-related obligations, interest expense and debt service obligations, litigation costs, the return of capital to shareholders, including through the payment of any dividends, and other contractual obligations that arise in the normal course of business. We may also use cash to enter into business development transactions, such as licensing arrangements or strategic acquisitions.\nAs of September 28, 2025, we expect our primary cash requirements for fiscal year 2025 to include capital expenditures. We made payments of $365 million for purchases of property, plant, and equipment during the fiscal nine months ended September 28, 2025.\nFuture Litigation\nIn the ordinary course of business, we are involved in litigation, claims, government inquiries, investigations, charges, and proceedings. See Note 13, “Commitments and Contingencies,” to the Condensed Consolidated Financial Statements included herein for further details regarding certain matters that are currently pending. Our ability to successfully resolve pending and future litigation may adversely impact our financial condition, results of operations, or cash flows. \nOff-Balance Sheet Arrangements \nWe did not have during the periods presented, and we do not currently have, any off-balance sheet arrangements (as defined under the rules and regulations of the SEC) or any relationships with unconsolidated entities that have or are reasonably likely to have a material current or future effect on our financial condition, changes in financial condition, Net sales or expenses, results of operations, liquidity, cash requirements, or capital resources.\nOther Information\nDeferred Markets\nPursuant to the Separation Agreement, in order to ensure compliance with applicable law, to obtain necessary governmental approvals and other consents, and for other business reasons, we and J&J deferred certain transfers of assets and assumptions of liabilities of businesses in certain non-U.S. jurisdictions, including China, Malaysia, and Russia, until after the completion of the Kenvue IPO. On September 11, 2023, J&J transferred the equity interests in the majority of the Deferred Legal Entities (as defined in Note 1, “Description of the Company and Summary of Significant Accounting Policies,” to the Condensed Consolidated Financial Statements included herein) to the Company that previously had been consolidated as Variable Interest \n58\nEntities in the Condensed Consolidated Financial Statements. The Condensed Consolidated Financial Statements included herein include businesses in all jurisdictions in which we operate following the completion of the Separation, including any Deferred Local Business (as defined in Note 1, “Description of the Company and Summary of Significant Accounting Policies,” to the Condensed Consolidated Financial Statements included herein). For more information regarding Deferred Local Businesses, see “Risk Factors—Risks Related to Our Relationship with J&J—The transfer of certain assets and liabilities from J&J to us contemplated by the Separation has not been completed and may be significantly delayed or not occur at all” in our Annual Report and Note 1, “Description of the Company and Summary of Significant Accounting Policies,” to the Condensed Consolidated Financial Statements included herein.\nProvision for Taxes\nOn December 15, 2022, the European Union (“EU”) Member States formally adopted the EU’s Pillar Two Directive, which g\nenerally provides for a minimum effective tax rate of 15%, as established by the Organization for Economic Co-operation Development (“OECD”) Pillar Two Inclusive Framework that was supported by over 130 countries worldwide. The EU effective dates are January 1, 2024, and January 1, 2025, for different aspects of the directive. On July 17, 2023, the OECD published Administrative Guidance proposing certain safe harbors that effectively extend certain effective dates to January 1, 2027. The OECD continues to release additional guidance, including guidance on safe harbors for which we may qualify, and many countries have already implemented legislation consistent with the OECD Pillar Two Framework. Due to these new rules, our provision for taxes could be unfavorably impacted as the legislation becomes effective in countries in which we conduct business. However, based on our current analysis, currently enacted laws for Pillar Two do not have a significant impact on the \nCondensed Consolidated Financial Statements. \nWe are continuing to evaluate the Model Global Anti-Base Erosion Rules for Pillar Two and related legislation, and their potential impact on future periods. In addition, in January 2025, the United States issued an executive order expressing disagreement with certain aspects of the Pillar Two framework. In June 2025, the Group of Seven (“G7”) issued a statement supporting the exclusion of U.S. parented groups from certain aspects of Pillar Two in exchange for the U.S. not imposing certain retaliatory taxes. Although the executive order and G7 statement do not have a binding effect, we will continue to monitor any changes to the OECD Pillar Two framework and enacted Pillar Two legislation resulting from these negotiations."
}