{
  "source_file": "l-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nManagement’s discussion and analysis of financial condition and results of operations (“MD&A”) should be read in conjunction with our Consolidated Condensed Financial Statements included under Item 1 of this Report and the Consolidated Financial Statements, Risk Factors, and MD&A included in our Annual Report on Form 10-K for the year ended December 31, 2024. This MD&A is comprised of the following sections:\nPage\nNo.\n \n \nOverview\n43\nResults of Operations\n44\nConsolidated Financial Results\n44\nCNA Financial\n45\nBoardwalk Pipelines\n55\nLoews Hotels & Co\n58\nCorporate\n59\nLiquidity and Capital Resources\n60\nParent Company\n60\nSubsidiaries\n61\nInvestments\n62\nCritical Accounting Estimates\n66\nAccounting Standards Update\n67\nRecent Legislation\n67\nForward-Looking Statements\n67\nOVERVIEW\nLoews Corporation is a holding company and has four reportable segments comprised of three individual consolidated operating subsidiaries, CNA Financial Corporation (“CNA”), Boardwalk Pipeline Partners, LP (“Boardwalk Pipelines”) and Loews Hotels Holding Corporation (“Loews Hotels & Co”); and the Corporate segment. The Corporate segment is primarily comprised of Loews Corporation, excluding its consolidated operating subsidiaries, and the equity method of accounting for Altium Packaging LLC (“Altium Packaging”), an unconsolidated subsidiary. \nUnless the context otherwise requires, as used herein, the term “Company” means Loews Corporation including its  subsidiaries, the terms “Parent Company,” “we,” “our,” “us” or like terms mean Loews Corporation excluding its subsidiaries and the term “Net income (loss) attributable to Loews Corporation” means Net income (loss) attributable to Loews Corporation shareholders.\nWe rely upon our invested cash balances and distributions from our subsidiaries to generate the funds necessary to meet our obligations and to declare and pay any dividends to our shareholders. The ability of our subsidiaries to pay dividends is subject to, among other things, the availability of sufficient earnings and funds in such subsidiaries, applicable state laws, including in the case of the insurance subsidiaries of CNA, laws and rules governing the payment of dividends by regulated insurance companies \n(see Note 15 of th\ne Consolidated Financial Statements in our Annual Report on Form 10-K for the year ended December 31, 2024) and compliance with covenants in their respective loan agreements. Claims of creditors of our subsidiaries will generally have priority as to the assets of such subsidiaries over our claims and those of our creditors and shareholders. We are not responsible for the liabilities and obligations of our subsidiaries and there are no Parent Company guarantees. \n43\nTable of contents\nRESULTS OF OPERATIONS\nConsolidated Financial Results\nThe following table summarizes net income (loss) attributable to Loews Corporation by segment and the basic and diluted net income per share attributable to Loews Corporation for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions, except per share data)\n \n \n \n \n \nCNA Financial\n$\n371\n \n$\n259 \n$\n897\n \n$\n860 \nBoardwalk Pipelines\n94\n \n77 \n334\n \n268 \nLoews Hotels & Co\n(3)\n(8)\n25\n \n43 \nCorporate\n42\n \n73 \n9\n \n56 \nNet income attributable to Loews Corporation\n$\n504\n \n$\n401 \n$\n1,265\n \n$\n1,227 \n \n \n \nBasic net income per share\n$\n2.43\n \n$\n1.83 \n$\n6.03\n \n$\n5.55 \n \n \n \nDiluted net income per share\n$\n2.43\n \n$\n1.82 \n$\n6.03\n \n$\n5.54 \nNet income attributable to Loews Corporation for the three months ended \nSeptember 30, 2025\n was $504 million, or $2.43 per share, compared to net income of $401 million, or $1.82 per share in the comparable \n2024\n period. Net income attributable to Loews Corporation for the nine months ended \nSeptember 30, 2025\n was $1,265 million, or $6.03 per share, compared to net income of $1,227 million, or $5.54 per share in the comparable \n2024\n period. \nThe increase in net income attributable to Loews Corporation for the three months ended \nSeptember 30, 2025\n as compared to the comparable \n2024\n period was primarily driven by higher net income at CNA and Boardwalk Pipelines and improved results at Loews Hotels & Co, partially offset by lower investment income at the parent company. The increase at CNA is driven by improved underwriting results in CNA’s commercial property and casualty insurance operations primarily due to lower catastrophe losses, improved underlying underwriting results and higher net investment income. The increase at Boardwalk Pipelines is primarily due to increased revenues due to re-contracting at higher rates, recently completed growth projects and increased storage and parking and lending revenues. The improved results at Loews Hotels & Co is primarily due to higher equity income from the Universal Orlando Resort joint ventures and improved earnings at the Loews Arlington Hotel and Convention Center, partially offset by lower earnings at the Loews Miami Beach Hotel due to renovations at the property. Parent company investment income decreased due to lower investment income from the parent company trading portfolio.\nThe increase in net income attributable to Loews Corporation for the nine months ended September 30, 2025 as compared to the comparable 2024 period was primarily driven by higher net income at CNA and Boardwalk Pipelines, partially offset by lower net income at Loews Hotels & Co and lower investment income at the parent company. The increase at CNA is primarily due to lower catastrophe losses, higher net investment income and improved underlying underwriting results in CNA’s commercial property and casualty insurance operations, partially offset by unfavorable net prior year loss reserve development, including development related to legacy mass tort abuse reserves, and higher investment losses. The increase at Boardwalk Pipelines is primarily due to increased revenues from re-contracting at higher rates, recently completed growth projects and increased storage and parking and lending revenues. The decrease at Loews Hotels & Co is primarily due to higher interest expense. Parent company investment income decreased due to lower investment income from the parent company trading portfolio.\n44\nTable of contents\nCNA Financial\nThe following table summarizes the results of operations for CNA for the three and nine months ended September 30, 2025 and 2024 as presented in \nNote \n12\n \nof the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report. For further discussion of Net investment income and Investment gains (losses), see the Investments section of this MD&A.\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nInsurance premiums\n$\n2,783\n \n$\n2,593 \n$\n8,103\n \n$\n7,532 \nNet investment income\n638\n \n626 \n1,904\n \n1,853 \nInvestment losses\n(7)\n(10)\n(62)\n(42)\nNon-insurance warranty revenue\n393\n \n401 \n1,188\n \n1,212 \nOther revenues\n10\n \n8 \n28\n \n26 \nTotal\n3,817\n \n3,618 \n11,161\n \n10,581 \nExpenses:\n \n \nInsurance claims and policyholders’ benefits\n2,032\n \n2,019 \n6,144\n \n5,708 \nAmortization of deferred acquisition costs\n483\n \n457 \n1,423\n \n1,336 \nNon-insurance warranty expense\n377\n \n387 \n1,146\n \n1,169 \nOther operating expenses\n376\n \n362 \n1,107\n \n1,077 \nInterest\n36\n \n32 \n99\n \n101 \nTotal\n3,304\n \n3,257 \n9,919\n \n9,391 \nIncome before income tax\n513\n \n361 \n1,242\n \n1,190 \nIncome tax expense\n(110)\n(78)\n(266)\n(252)\nNet income\n403\n \n283 \n976\n \n938 \nAmounts attributable to noncontrolling interests\n(32)\n(24)\n(79)\n(78)\nNet income attributable to Loews Corporation\n$\n371\n \n$\n259 \n$\n897\n \n$\n860 \nThree Months Ended \nSeptember 30, 2025\n Compared to the Comparable 2024 Period\nNet income attributable to Loews Corporation\n \nincreased\n \n$112 million for the three months ended \nSeptember 30, 2025\n as compared with the comparable \n2024 period, driven by \nimproved underwriting results in \nCNA’s commercial property and casualty insurance operations primarily \ndue to lower catastrophe losses, improved underlying underwriting results and higher net investment income.\nNine Months Ended \nSeptember 30, 2025\n Compared to the Comparable 2024 Period\nNet income attributable to Loews Corporation\n increased $37 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period, primarily due to higher net investment income, lower catastrophe losses and improved underlying underwriting results in CNA’s commercial property and casualty insurance operations, partially offset by unfavorable net prior year loss reserve development, including development related to legacy mass tort abuse reserves, and higher investment losses. \n \n \nCNA’s Property & Casualty and Other Insurance Operations\nCNA’s commercial property and casualty insurance operations (“Property & Casualty Operations”) include its Specialty, Commercial and International lines of business. CNA’s Other Insurance Operations outside of Property & Casualty Operations include its long-term care business that is in run-off, certain corporate expenses, including interest on CNA’s corporate debt, and the results of certain property and casualty businesses in run-off, including CNA Re, asbestos and \n45\nTable of contents\nenvironmental pollution (“A&EP”), a legacy portfolio of excess workers’ compensation (“EWC”) policies and certain legacy mass tort reserves. We believe the presentation of CNA as one reportable segment is appropriate in accordance with applicable accounting standards on segment reporting. However, for purposes of this discussion and analysis of the results of operations, we provide greater detail with respect to CNA’s Property & Casualty Operations and Other Insurance Operations to enhance the reader’s understanding and to provide further transparency into key drivers of CNA’s financial results.\nIn assessing its insurance operations, CNA utilizes the core income (loss) financial measure. Core income (loss) is calculated by excluding investment gains or losses and gains or losses resulting from pension settlement transactions from net income (loss). In addition, core income (loss) excludes the effects of noncontrolling interests. The calculation of core income (loss) excludes investment gains or losses because they are generally driven by economic factors that are not necessarily reflective of CNA’s primary insurance operations. The calculation of core income (loss) excludes gains or losses resulting from pension settlement transactions as they result from decisions regarding CNA’s defined benefit pension plans which are unrelated to its primary insurance operations. Core income (loss) is deemed to be a non-GAAP financial measure and management believes some investors may find this measure useful to evaluate CNA’s insurance operations. Please see the non-GAAP reconciliation of net income (loss) to core income (loss) in this MD&A.\nIn evaluating the results of Property & Casualty Operations CNA utilizes the loss ratio, the underlying loss ratio, the expense ratio, the dividend ratio, the combined ratio and the underlying combined ratio. These ratios are calculated using GAAP financial results. The loss ratio is the percentage of net incurred claim and claim adjustment expenses to net earned premiums. The underlying loss ratio excludes the impact of catastrophe losses and development-related items from the loss ratio. Development-related items represent net prior year loss reserve and premium development, and includes the effects of interest accretion and change in allowance for uncollectible reinsurance. The expense ratio is the percentage of insurance underwriting and acquisition expenses, including the amortization of deferred acquisition costs, to net earned premiums. The dividend ratio is the ratio of policyholders’ dividends incurred to net earned premiums. The combined ratio is the sum of the loss ratio, the expense ratio and the dividend ratio. The underlying combined ratio is the sum of the underlying loss ratio, the expense ratio and the dividend ratio. The underlying loss ratio and the underlying combined ratio are deemed to be non-GAAP financial measures, and management believes some investors may find these ratios useful to evaluate CNA’s underwriting performance since they remove the impact of catastrophe losses which are unpredictable as to timing and amount, and development-related items as they are not indicative of current year underwriting performance.\nChanges in estimates of claim and claim adjustment expense reserves, net of reinsurance, for prior years are defined as net prior year loss reserve development within this MD&A. These changes can be favorable or unfavorable. Net prior year loss reserve development does not include the effect of any related acquisition expenses. Further information on CNA’s reserves is provided in Notes 4 and 5 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\nIn addition, renewal premium change, rate, retention and new business are also utilized in evaluating operating trends. Renewal premium change represents the estimated change in average premium on policies that renew, including rate and exposure changes. Rate represents the average change in price on policies that renew excluding exposure change. Exposure represents the measure of risk used in the pricing of the insurance product. The change in exposure represents the change in premium dollars on policies that renew as a result of the change in risk of the policy. Retention represents the percentage of premium dollars renewed, excluding rate and exposure changes, in comparison to the expiring premium dollars from policies available to renew. New business represents premiums from policies written with new customers and additional policies written with existing customers. Gross written premiums, excluding third-party captives, excludes business which is ceded to third-party captives, including business related to large warranty programs. \nCNA also uses underwriting gain (loss) and underlying underwriting gain (loss), calculated using GAAP financial results, to monitor insurance operations. Underwriting gain (loss) is deemed to be a non-GAAP financial measure and is calculated pretax as net earned premiums less total insurance expenses, which includes insurance claims and policyholders’ benefits, amortization of deferred acquisition costs and insurance related administrative expenses. Net income (loss) is the most directly comparable GAAP measure. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities, which are managed separately from its investing activities. Underlying underwriting gain (loss) is also deemed to be a non-GAAP financial measure, and represents pretax underwriting gain (loss) excluding catastrophe losses and development-related items. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities, excluding the impact of catastrophe losses, which are unpredictable as to timing and amount, and development-related items as they are not indicative of CNA’s current year underwriting performance.\n46\nTable of contents\nThe following tables present reconciliations of net income attributable to Loews Corporation to core income (loss), underwriting gain (loss) and underlying underwriting gain for t\nhe three and nine months \nended September 30, 2025 and 2024:\nThree Months Ended September 30, 2025\nSpecialty\nCommercial\nInternational\nProperty & Casualty\nOther Insurance Operations\nTotal\n(In millions)\nNet income (loss) attributable to Loews Corporation\n$\n159\n \n$\n211\n \n$\n41\n \n$\n411\n \n$\n(40)\n$\n371\n \nInvestment (gains) losses\n3\n \n4\n \n3\n \n10\n \n(4)\n6\n \nNoncontrolling interests\n14\n \n18\n \n3\n \n35\n \n(3)\n32\n \nCore income (loss)\n$\n176\n \n$\n233\n \n$\n47\n \n$\n456\n \n$\n(47)\n$\n409\n \nLess:\nNet investment income\n162\n \n192\n \n42\n \n396\n \nNon-insurance warranty revenue\n16\n \n16\n \nOther revenue (expense), including interest expense\n(15)\n(3)\n1\n \n(17)\nIncome tax expense on core income\n(47)\n(62)\n(24)\n(133)\nUnderwriting gain \n60\n \n106\n \n28\n \n194\n \nEffect of catastrophe losses\n39\n \n2\n \n41\n \nUnderlying underwriting gain\n$\n60\n \n$\n145\n \n$\n30\n \n$\n235\n \nThree Months Ended September 30, 2024\nNet income (loss) attributable to Loews Corporation\n$\n153 \n$\n121 \n$\n31 \n$\n305 \n$\n(46)\n$\n259 \nInvestment (gains) losses\n4 \n7 \n2 \n13 \n(6)\n7 \nPension settlement losses\n \n3 \n3 \nNoncontrolling interests\n14 \n11 \n3 \n28 \n(4)\n24 \nCore income (loss)\n$\n171 \n$\n139 \n$\n36 \n$\n346 \n$\n(53)\n$\n293 \nLess:\nNet investment income\n157 \n183 \n32 \n372 \nNon-insurance warranty revenue\n14 \n \n \n14 \nOther (revenue) expense, including interest expense\n(12)\n(3)\n8 \n(7)\nIncome tax expense on core income\n(47)\n(38)\n(16)\n(101)\nUnderwriting gain (loss)\n59 \n(3)\n12 \n68 \nEffect of catastrophe losses\n \n127 \n16 \n143 \nEffect of favorable development-related items\n \n \n(2)\n(2)\nUnderlying underwriting gain\n$\n59 \n$\n124 \n$\n26 \n$\n209 \n47\nTable of contents\nNine Months Ended September 30, 2025\nSpecialty\nCommercial\nInternational\nProperty & Casualty\nOther Insurance Operations\nTotal\n(In millions)\nNet income (loss) attributable to Loews Corporation\n$\n448\n \n$\n507\n \n$\n124\n \n$\n1,079\n \n$\n(182)\n$\n897\n \nInvestment losses\n16\n \n23\n \n2\n \n41\n \n8\n \n49\n \nNoncontrolling interests\n39\n \n45\n \n11\n \n95\n \n(16)\n79\n \nCore income (loss)\n$\n503\n \n$\n575\n \n$\n137\n \n$\n1,215\n \n$\n(190)\n$\n1,025\n \nLess:\nNet investment income\n483\n \n575\n \n114\n \n1,172\n \nNon-insurance warranty revenue\n42\n \n42\n \nOther revenue (expense), including interest expense\n(40)\n(10)\n12\n \n(38)\nIncome tax expense on core income\n(137)\n(153)\n(55)\n(345)\nUnderwriting gain \n155\n \n163\n \n66\n \n384\n \nEffect of catastrophe losses\n182\n \n18\n \n200\n \nEffect of unfavorable development-related items\n10\n \n54\n \n64\n \nUnderlying underwriting gain\n$\n165\n \n$\n399\n \n$\n84\n \n$\n648\n \nNine Months Ended September 30, 2024\nNet income (loss) attributable to Loews Corporation\n$\n457 \n$\n400 \n$\n106 \n$\n963 \n$\n(103)\n$\n860 \nInvestment (gains) losses\n19 \n28 \n1 \n48 \n(15)\n33 \nPension settlement losses\n \n3 \n3 \nNoncontrolling interests\n41 \n36 \n10 \n87 \n(9)\n78 \nCore income (loss)\n$\n517 \n$\n464 \n$\n117 \n$\n1,098 \n$\n(124)\n$\n974 \nLess:\nNet investment income\n461 \n534 \n95 \n1,090 \nNon-insurance warranty revenue\n43 \n \n \n43 \nOther (revenue) expense, including interest expense\n(40)\n(10)\n5 \n(45)\nIncome tax expense on core income \n(142)\n(125)\n(41)\n(308)\nUnderwriting gain\n195 \n65 \n58 \n318 \nEffect of catastrophe losses\n \n285 \n28 \n313 \nEffect of favorable development-related items\n(8)\n \n(5)\n(13)\nUnderlying underwriting gain\n$\n187 \n$\n350 \n$\n81 \n$\n618 \n48\nTable of contents\nProperty & Casualty Operations\nThe following tables summarize the results of CNA’s Property & Casualty Operations and provides the components to reconcile the combined ratio and loss ratio to the underlying combined ratio and underlying loss ratio for the three and nine\n months e\nnded September 30, 2025 and 2024.  \nThree Months Ended September 30, 2025\nSpecialty\n \nCommercial\n \nInternational\n \nTotal\n \n(In millions, except %)\nGross written premiums\n$\n1,700\n \n$\n1,569\n \n$\n322\n \n$\n3,591\n \nGross written premiums excluding third-party captives\n1,009\n \n1,559\n \n322\n \n2,890\n \nNet written premiums\n867\n \n1,251\n \n319\n \n2,437\n \nNet earned premiums\n881\n \n1,453\n \n344\n \n2,678\n \nUnderwriting gain\n60\n \n106\n \n28\n \n194\n \nNet investment income\n162\n \n192\n \n42\n \n396\n \nCore income\n176\n \n233\n \n47\n \n456\n \nOther performance metrics:\nLoss ratio\n60.6\n%\n66.1\n%\n59.1\n%\n63.4\n%\nExpense ratio\n32.5\n26.1\n32.7\n29.1\nDividend ratio\n0.2\n0.5\n0.3\nCombined ratio\n93.3\n%\n92.7\n%\n91.8\n%\n92.8\n%\nLess: Effect of catastrophe impacts\n2.7\n \n0.6\n \n1.5\n \nUnderlying combined ratio\n93.3\n%\n90.0\n%\n91.2\n%\n91.3\n%\nUnderlying loss ratio\n60.6\n%\n63.4\n%\n58.5\n%\n61.9\n%\nRate\n3\n%\n5\n%\n(6)%\n3\n%\nRenewal premium change\n4\n6\n(3)\n4\nRetention\n86\n \n79\n \n83\n \n81\n \nNew business\n$\n131\n \n$\n324\n \n$\n94\n \n$\n549\n \nThree Months Ended September 30, 2024\nGross written premiums\n$\n1,743 \n$\n1,547 \n$\n305 \n$\n3,595 \nGross written premiums excluding third-party captives\n982 \n1,538 \n305 \n2,825 \nNet written premiums\n862 \n1,221 \n277 \n2,360 \nNet earned premiums\n848 \n1,325 \n311 \n2,484 \nUnderwriting gain (loss)\n59 \n(3)\n12 \n68 \nNet investment income\n157 \n183 \n32 \n372 \nCore income\n171 \n139 \n36 \n346 \nOther performance metrics:\nLoss ratio\n60.1\n%\n72.0\n%\n62.5\n%\n66.7\n%\nExpense ratio\n32.7\n27.7\n33.6\n30.2\nDividend ratio\n0.2\n0.5\n0.3\nCombined ratio\n93.0\n%\n100.2\n%\n96.1\n%\n97.2\n%\nLess: Effect of catastrophe impacts\n9.6 \n5.1 \n5.8 \nLess: Effect of favorable development-related items\n(0.1)\n(0.7)\n(0.2)\nUnderlying combined ratio\n93.0\n%\n90.7\n%\n91.7\n%\n91.6\n%\nUnderlying loss ratio\n60.1\n%\n62.5\n%\n58.1\n%\n61.1\n%\nRate\n6\n%\n(2)%\n3\n%\nRenewal premium change\n2\n%\n8\n1\n5\nRetention\n89\n84\n82\n85\nNew business\n$\n129 \n$\n345 \n$\n73 \n$\n547 \n49\nTable of contents\nNine Months Ended September 30, 2025\nSpecialty\n \nCommercial\n \nInternational\n \nTotal\n \n(In millions, except %)\n \n \n \n \n \n \n \n \n \nGross written premiums\n$\n5,064\n \n$\n5,487\n \n$\n1,132\n \n$\n11,683\n \nGross written premiums excluding third-party captives\n2,952\n \n5,301\n \n1,132\n \n9,385\n \nNet written premiums\n2,601\n \n4,312\n \n976\n \n7,889\n \nNet earned premiums\n2,573\n \n4,235\n \n978\n \n7,786\n \nUnderwriting gain\n155\n \n163\n \n66\n \n384\n \nNet investment income\n483\n \n575\n \n114\n \n1,172\n \nCore income\n503\n \n575\n \n137\n \n1,215\n \n \nOther performance metrics:\nLoss ratio\n60.7\n%\n68.7\n%\n60.3\n%\n65.0\n%\nExpense ratio\n33.0\n26.9\n32.9\n29.7\nDividend ratio\n0.3\n0.5\n0.4\nCombined ratio\n94.0\n%\n96.1\n%\n93.2\n%\n95.1\n%\nLess: Effect of catastrophe impacts\n4.3\n \n1.8\n \n2.6\n \nLess: Effect of unfavorable development-related items\n0.4\n \n1.3\n0.8\n \nUnderlying combined ratio\n93.6\n%\n90.5\n%\n91.4\n%\n91.7\n%\nUnderlying loss ratio\n60.3\n%\n63.1\n%\n58.5\n%\n61.6\n%\nRate\n3\n%\n5\n%\n(4)%\n3\n%\nRenewal premium change\n4\n7\n(1)\n5\nRetention\n87\n \n82\n \n85\n \n83\n \nNew business\n$\n365\n \n$\n1,114\n \n$\n280\n \n$\n1,759\n \nNine Months Ended September 30, 2024\n \n \n \n \nGross written premiums\n$\n5,153 \n$\n5,160 \n$\n1,096 \n$\n11,409 \nGross written premiums excluding third-party captives\n2,846 \n5,022 \n1,096 \n8,964 \nNet written premiums\n2,511 \n4,017 \n896 \n7,424 \nNet earned premiums\n2,493 \n3,774 \n937 \n7,204 \nUnderwriting gain\n195 \n65 \n58 \n318 \nNet investment income\n461 \n534 \n95 \n1,090 \nCore income\n517 \n464 \n117 \n1,098 \n \nOther performance metrics:\nLoss ratio\n59.3\n%\n69.7\n%\n60.6\n%\n64.9\n%\nExpense ratio\n32.5\n28.1\n33.1\n30.3\nDividend ratio\n0.3\n0.5\n0.4\nCombined ratio\n92.1\n%\n98.3\n%\n93.7\n%\n95.6\n%\nLess: Effect of catastrophe impacts\n7.5 \n3.0 \n4.3 \nLess: Effect of favorable development-related items\n(0.3)\n(0.5)\n(0.2)\nUnderlying combined ratio\n92.4\n%\n90.8\n%\n91.2\n%\n91.5\n%\nUnderlying loss ratio\n59.6\n%\n62.2\n%\n58.1\n%\n60.8\n%\n \nRate\n1\n%\n6\n%\n4\n%\nRenewal premium change\n2\n8\n2\n%\n5\nRetention\n89\n84\n81\n85\nNew business\n$\n341 \n$\n1,117 \n$\n213 \n$\n1,671 \nThree Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nGross written premiums, excluding third-party captives, for Specialty increased $27 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention. Net written premiums for Specialty increased $5 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums for Specialty.\n50\nTable of contents\nGross written premiums for Commercial increased $22 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention and new business. Net written premiums for Commercial increased $30 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums for Commercial. \nGross written premiums for International increased $17 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, gross written premiums increased $9 million driven by higher new business partially offset by lower rate. Net written premiums for International increased $42 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, net written premiums increased $33 million for the three months ended September 30, 2025 as compared with the comparable 2024 period driven by a true-up due to a reduction in anticipated reinsurance costs for prior treaty terms in the third quarter of 2025. The increase in net earned premiums for the three months ended September 30, 2025 was consistent with the trend in net written premiums in recent quarters for International.\nCore income for Property & Casualty Operations increased $110 million for the three months ended September 30, 2025 as compared with the comparable 2024 period primarily due to lower catastrophe losses, improved underlying underwriting results and higher net investment income.\nCatastrophe losses for Property & Casualty Operations were $41 million for the three months ended September 30, 2025 as compared with $143 million for the comparable 2024 period, driven by severe weather related events. Catastrophe losses for the three months ended September 30, 2024 included $55 million for Hurricane Helene. For the three months ended September 30, 2025 and 2024, Specialty had no catastrophe losses, Commercial had catastrophe losses of $39 million and $127 million and International had catastrophe losses of $2 million and $16 million.\nFavorable net prior year loss reserve development for Property & Casualty Operations of $1 million and $5 million was recorded for the three months ended September 30, 2025 and 2024. For the three months ended September 30, 2025 and 2024, Specialty recorded no net prior year loss reserve development, Commercial recorded favorable net prior year loss reserve development of $1 million and $3 million and International recorded no net prior year loss reserve development and favorable net prior year loss reserve development of $2 million. Further information on net prior year loss reserve development is included in Note 4 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\nSpecialty’s combined ratio increased 0.3 points for the three months ended September 30, 2025 as compared with the comparable 2024 period due to a 0.5 point increase in the loss ratio, partially offset by a\n 0.2 point improvement\n in the expense ratio. The increase in the loss ratio was due to an increase in the underlying loss ratio. The improvement in the expense ratio was  primarily driven by higher net earned premiums. \nCommercial’s combined ratio improved 7.5 points for the three months ended September 30, 2025 as compared with the comparable 2024 period due to a 5.9 point improvement in the loss ratio and a 1.6 point improvement in the expense ratio. The improvement in the loss ratio was\n primarily due to lower catastrophes losses, which were 2.7 points of the loss ratio for the three months ended September 30, 2025, as compared with 9.6 points of the loss ratio in the comparable 2024 period, partially offset by an increase in the underlying loss ratio related to social inflation impacted lines. \nThe improvement in the expense ratio was primarily driven by a lower acquisition ratio and higher net earned premiums. \nInternational’s combined ratio improved 4.3 points for the three months ended September 30, 2025 as compared with the comparable 2024 period due to a 3.4 point improvement in the loss ratio and a 0.9 improvement in the expense ratio. The improvement in the loss ratio was primarily driven by lower catastrophe losses, which were 0.6 points of the loss ratio for the three months ended September 30, 2025, as compared with 5.1 points of the loss ratio in the comparable 2024 period, partially offset by no net prior year loss reserve development recorded in the current year period compared with favorable net prior year loss reserve development in the comparable 2024 period, and an increase in the underlying loss ratio. The improvement in the expense ratio was primarily driven by higher net earned premiums.\nNine Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nGross written premiums, excluding third-party captives, for Specialty increased $106 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention. Net written premiums for Specialty increased $90 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the nine months ended September 30, 2025 was consistent with the trend in net written premiums for Specialty.\n51\nTable of contents\nGross written premiums for Commercial increased $327 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period driven by favorable renewal premium change, inclusive of rate, partially offset by lower retention. Net written premiums for Commercial increased $295 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period. The increase in net earned premiums for the nine months ended September 30, 2025 was consistent with the trend in net written premiums for Commercial. \nGross written premiums for International increased $36 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, gross written premiums increased $38 million driven by higher new business and retention partially offset by lower rate. Net written premiums for International increased $80 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period. Excluding the effect of foreign currency exchange rates, net written premiums increased $77 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period driven by a true-up due to a reduction in anticipated reinsurance costs for prior treaty terms in the third quarter of 2025. The increase in net earned premiums for the nine months ended September 30, 2025 was consistent with the trend in net written premiums in recent quarters for International.\nCore income for Property & Casualty Operations increased $117 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period primarily due to higher net investment income, lower catastrophe losses and improved underlying underwriting results, partially offset by unfavorable net prior year loss reserve development.\nCatastrophe losses for Property & Casualty Operations were $200 million for the nine months ended September 30, 2025 as compared with $313 million for the comparable 2024 period, driven by severe weather related events. Catastrophe losses for the nine months ended September 30, 2024 included $55 million for Hurricane Helene. For the nine months ended September 30, 2025 and 2024, Specialty had no catastrophe losses, Commercial had catastrophe losses of $182 million and $285 million and International had catastrophe losses of $18 million and $28 million.\nUnfavorable net prior year loss reserve development for Property & Casualty Operations of $56 million and favorable net prior year loss reserve development of $24 million was recorded for the nine months ended September 30, 2025 and 2024. For the nine months ended September 30, 2025 and 2024, Specialty recorded unfavorable net prior year loss reserve development of $10 million and favorable net prior year loss reserve development of $8 million, Commercial recorded unfavorable net prior year loss reserve development of $46 million and favorable net prior year loss reserve development of $11 million and International recorded no net prior year loss reserve development and favorable net prior year loss reserve development of $5 million. Further information on net prior year loss reserve development is included in Note 4 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\nSpecialty’s combined ratio increased 1.9 points for the nine months ended September 30, 2025 as compared with the comparable 2024 period primarily due to a 1.4 point increase in the loss ratio and a 0.5 point increase in the expense ratio. The increase in the loss ratio was due to unfavorable net prior year loss reserve development recorded in the current year period and an increase in the underlying loss ratio primarily driven by continued pricing pressure in management liability lines. The increase in the expense ratio was driven by higher employee related and acquisition costs partially offset by higher net earned premiums.\nCommercial’s combined ratio improved 2.2 points for the nine months ended September 30, 2025 as compared with the comparable 2024 period due to a 1.2 point improvement in the expense ratio and a 1.0 point improvement in the loss ratio. The improvement in the expense ratio was driven by higher net earned premiums and a lower acquisition ratio. The improvement in the loss ratio was due to lower catastrophe losses, which were 4.3 points of the loss ratio for the nine months ended September 30, 2025 as compared with 7.5 points of the loss ratio for the comparable 2024 period, partially offset by unfavorable net prior year loss reserve development and an increase in the underlying loss ratio related to social inflation impacted lines\n. \nInternational’s combined ratio improved 0.5 points for the nine months ended September 30, 2025 as compared with the comparable 2024 period due to a 0.3 point improvement in the loss ratio and a 0.2 point improvement in the expense ratio. The improvement in the loss ratio was primarily driven by lower catastrophe losses, which were 1.8 points of the loss ratio for the nine months ended September 30, 2025 as compared with 3.0 points of the loss ratio for the comparable 2024 period, partially offset by no net prior year loss reserve development recorded in the current year period compared with favorable net prior year loss reserve development in the comparable 2024 period. The improvement in the expense ratio was primarily driven by higher net earned premiums.\n52\nTable of contents\nOther Insurance Operations\nThe following table summarizes the results of CNA’s Other Insurance Operations for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nNet earned premiums\n$\n106\n \n$\n110 \n$\n318\n \n$\n329 \nNet investment income\n242\n \n254 \n732\n \n763 \nCore loss\n(47)\n(53)\n(190)\n(124)\nThree Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nCore results for Other Insurance Operations improved $6 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. The improvement was primarily due to no net prior year loss reserve development in the current year as compared with a $17 million after tax charge in the comparable 2024 period related to unfavorable net prior year loss reserve development largely associated with legacy mass tort abuse reserves. \nFurther information on the net prior year loss reserve development is included in Note \n4\n of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report. The improvement in core results was partially offset by lower net investment income from limited partnerships. Both periods include assumption updates as a result of the annual long-term care reserve reviews completed in the third quarter of each year. \nThe cash flow assumption updates from the annual reserve review for the three months ended \nSeptember 30, 2025 and 2024\n resulted in a pretax increase in long-term care reserves of $7 million and $15 million. \nThe annual structured settlement reserve review resulted in a pretax increase in claim reserves of $2 million for the three months ended \nSeptember 30, 2025\n and a pretax reduction in claim reserves of $9 million for the three months ended  September 30, 2024.\nNine Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nCore results for Other Insurance Operations decreased $66 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period, primarily due to a $106 million after-tax charge related to unfavorable net prior year loss reserve development associated with legacy mass tort abuse reserves as compared with a $45 million after-tax charge in the comparable 2024 period. \nFurther information on net prior year loss reserve development is included in Note \n4\n of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report. Core results also reflect lower net investment income from limited partnerships for the \nnine months ended September 30, 2025 as compared with the comparable 2024 period. \nThe impact of the assumption updates as a result of\n the annual long-term care reserve reviews completed in the third quarter of each year is discussed in the three month summary above. \nFuture Policy Benefit Reserves\nAnnually in the third quarter, an actuarial analysis is performed on policyholder morbidity, persistency, premium rate actions and expense experience. This analysis, combined with judgment, informs the setting of updated cash flow assumptions used to estimate the liability for future policyholder benefits (“LFPB”).  \nFor further information on the long-term care reserving process see Note 1 of the Consolidated Financial Statements in our Annual Report on Form 10-K for the year ended December 31, 2024. \nThe table below summarizes the estimated pretax impact on CNA’s results of operations from various hypothetical revisions to its LFPB reserve assumptions. CNA has assumed that revisions to such assumptions would occur in each policy type, age and duration within each long-term care product. The impact of each sensitivity is discrete and does not reflect the impact one factor may have on another or the mitigating impact from management actions, which may include additional future premium rate increases. Although such hypothetical revisions are not currently required or anticipated, CNA believes they could occur based on past variances in experience and its expectations of the ranges of future \n53\nTable of contents\nexperience that could reasonably occur. Any actual adjustment would be dependent on the specific policies affected and, therefore, may differ from the estimates summarized below. The estimated impacts to results of operations in the table below are after consideration of any net premium ratio impacts.\nSeptember 30, 2025\nEstimated Reduction to Pretax Income\n(In millions)\n \n \n \nHypothetical revisions\n \nMorbidity: \n \n2.5% increase in morbidity\n$\n300\n \n5% increase in morbidity\n620\n \nPersistency:\n5% decrease in active life mortality and lapse\n$\n180\n \n10% decrease in active life mortality and lapse\n350\n \nPremium rate actions:\n25% decrease in anticipated future premium rate increases\n$\n30\n \n50% decrease in anticipated future premium rate increases\n50\n \nThe following table summarizes policyholder reserves for CNA’s Other Insurance Operations:\nSeptember 30, 2025\nClaim and claim adjustment expenses\nFuture policy benefits\nTotal\n(In millions)\nLong-term care\n$\n13,546\n \n$\n13,546\n \nStructured settlements and other\n$\n538\n \n538\n \nTotal\n538\n \n13,546\n \n14,084\n \nCeded reserves\n77\n \n77\n \nTotal gross reserves\n$\n615\n \n$\n13,546\n \n$\n14,161\n \nDecember 31, 2024\n(In millions)\nLong-term care\n$\n13,158 \n$\n13,158 \nStructured settlements and other\n$\n541 \n541 \nTotal\n541 \n13,158 \n13,699 \nCeded reserves\n81 \n81 \nTotal gross reserves\n$\n622 \n$\n13,158 \n$\n13,780 \nAs part of the annual reserve review, statutory long-term care reserve adequacy is evaluated by premium deficiency testing, by comparing carried statutory reserves with best estimate reserves, which incorporates best estimate discount rate and liability assumptions in its determination. Statutory margin is the excess of carried reserves over best estimate reserves. As of September 30, 2025, statutory long-term care margin increased to $1.5 billion from $1.4 billion.\n54\nTable of contents\nBoardwalk Pipelines\nA significant portion of Boardwalk Pipelines’ revenues is fee-based, being derived from capacity reservation charges under firm agreements with customers, which do not vary significantly period to period, but are impacted by longer term trends in its business such as changes in pricing on contract renewals and other factors as discussed in our Annual Report on Form 10-K for the year ended December 31, 2024. The pricing contained in the purchase and sales agreements associated with Boardwalk Pipelines’ ethane supply services is generally based on the same ethane commodity index, plus a fixed delivery fee. As a result, except for possible timing differences that may occur when volumes are purchased in one month and sold in another month, Boardwalk Pipelines’ ethane supply services, like its other businesses, has little to no direct commodity price exposure. For further information on Boardwalk Pipelines’ revenue recognition policies see Note 1 of the Consolidated Financial Statements in our Annual Report on Form 10-K for the year ended December 31, 2024. Boardwalk Pipelines’ operation and maintenance expenses are impacted by its compliance with the requirements of, among other regulations, the Pipeline and Hazardous Materials Safety Administration Mega Rule and Boardwalk Pipelines’ efforts to monitor, control and reduce emissions, as further discussed in Results of Operations of our MD&A included under Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024.\nCurrent Growth Projects\nBoardwalk Pipelines regularly reviews opportunities to expand its existing facilities and footprint to meet growing demand for transportation and storage services. Recent growth of liquefied natural gas export and power generation demand has led to growth projects for Boardwalk Pipelines. Through the date of this filing, Boardwalk Pipelines has growth projects for which it has executed precedent or long-term firm transportation agreements that are expected to increase capacity on its pipeline systems by an aggregate of 4.2 billion cubic feet per day (“Bcf/d”) at an aggregate cost of approximately $3.0 billion and are scheduled to be completed through 2029. These projects remain contingent upon, among other things, the receipt of required regulatory approvals and permits.\nThese projects have lengthy planning and construction periods and, as a result, will not contribute to Boardwalk Pipelines’ earnings and cash flows until they receive the required regulatory approvals and permits and are constructed and placed into service over the next several years. F\nor further discussion of capital expenditures and financing, please see Liquidity and Capital Resources: Subsidiaries of this MD&A. Boardwalk Pipelines’ cost and timing estimates for these projects are based on a variety of inputs such as contractor indicativ\ne bids, quotes on materials and internally-developed financial models, metrics and timelines and are subject to a variety of risks and uncertainties, including obtaining timely regulatory and permit approvals and the cost thereof, adverse weather conditions during construction, its ability to acquire and the cost of obtaining rights to construct and operate on land not owned by Boardwalk Pipelines, delays in obtaining and shortages and price increases for key materials (including pipe, compressor stations and related equipment), tariff implications and shortages and increased costs of qualified labor. Factors in the estimates include, among other things, those related to pipeline costs based on mileage, size and type of pipe, materials including compressors and related equipment, land, engineering and construction costs and timely receipt of all necessary permits and approvals. Actual costs and timing of in-service dates for Boardwalk Pipelines’ growth projects may differ, perhaps materially, from its estimates. In addition, failure to timely meet development milestones may result in, among other things, contractual counterparties having the ability to terminate contracts with Boardwalk Pipelines. Refer to Part I, Item 1A, Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2024 for additional risks associated with Boardwalk Pipelines’ growth projects and the related financing.\nThe below identifies Boardwalk Pipelines’ more significant growth projects:\nThe Kosciusko Junction Project (“Kosci project”) is expected to increase the capacity of Boardwalk Pipelines’ pipeline system by 1.2 Bcf/d through the addition of compression facilities, the installation of 110 miles of natural gas pipeline, and other system modifications. \nThe capacity for this project is supported by precedent agreements with utility customers, including two precedent agreements that were executed in July 2025\n. This project is designed to connect supply from the Haynesville, Utica/Marcellus and Fayetteville basins to markets in the southeast U.S. that are either tied into Boardwalk Pipelines’ existing pipeline systems or will be served through third-party pipeline interconnects. This project has an expected in-service date of the first half of 2029 and remains subject to Federal Energy Regulatory Commission (“FERC”) approval, acquisition of land rights, and receipt of environmental permits and authorizations.\nBoardwalk Pipelines executed two precedent agreements for the Southeast Compression for Utility Reliability Expansion Project (“SECURE project”), which is expected to increase the capacity of its pipeline system by 0.3 Bcf/d and provide additional transportation from west to east across its pipeline systems. This project is expected to increase the peak-day transmission capacity by increasing the horsepower at three existing compressor stations and constructing a new compressor station. This project supports growing energy demand and power generation needs, has an expected in-service \n55\nTable of contents\ndate of the first half of 2028, and remains subject to FERC approval and receipt of environmental permits and authorizations. \nThe Parks Line Upgrade and Sorrento Station Project (“PLUSS project”) is expected to increase the capacity of Boardwalk Pipelines’ pipeline system by approximately 0.2 Bcf/d of incremental capacity and is supported by precedent agreements to serve industrial and power markets in the Mississippi River corridor. As part of the project, Boardwalk Pipelines intends to add compression facilities, modify its pipelines and perform other system modifications on its pipeline systems. This project has an expected in-service date of the first half of 2028 and remains subject to FERC approval, acquisition of land rights, and receipt of environmental permits and authorizations.\nThe Eunice – Iowa project is expected to increase the capacity of Boardwalk Pipelines’ pipeline system by approximately 0.1 Bcf/d of incremental capacity to the Lake Charles, Louisiana area and is supported by three precedent agreements. The project has an expected in-service date of the first half of 2027 and consists of the addition of compression facilities. This project has been approved by FERC but remains subject to acquisition of land rights.\nThe Northeast Texas Power Plant Project is expected to increase the delivery capacity of Boardwalk Pipelines’ pipeline system by approximately 0.3 Bcf/d in Northeast Texas, through the construction of 16 miles of natural gas pipeline and a delivery meter that will connect to a power plant. The project is supported by a precedent agreement with a utility customer, is expected to be in-service the second half of 2027 and remains subject to FERC approval, acquisition of land rights and receipt of environmental permits and authorizations.\nThe Ohio Power Plant Project is expected to increase the delivery capacity of Boardwalk Pipelines’ pipeline system by approximately 0.3 Bcf/d in Hamilton County, Ohio, through the construction of seven miles of natural gas pipeline and a delivery meter that will connect to a power plant. The project is supported by a precedent agreement with a utility customer, is expected to be in-service the first half of 2028 and remains subject to FERC approval, acquisition of land rights and receipt of environmental permits and authorizations.\nThe Carnation project is expected to increase the capacity of Boardwalk Pipelines’ pipeline system by approximately 0.2 Bcf/d of incremental capacity in Hamilton County, Ohio, through the installation of a compressor unit and auxiliary equipment. This project is supported by a precedent agreement with a local distribution company and is expected to support regional energy needs. It has an expected in-service date of the second half of 2027 and remains subject to FERC approval and receipt of environmental permits and authorizations. \nIn October 2025, Boardwalk Pipelines executed a precedent agreement that is expected to increase the capacity of its pipeline system by approximately 1.5 Bcf/d through the construction of approximately 155 miles of natural gas pipeline and the addition of compression facilities. The Texas Gateway Project is designed to connect supply from the Katy and Carthage, Texas hubs for delivery to growing demand in Southwest Louisiana near Gillis and increase liquidity, supply security and flow assurance for liquified natural gas exporters, electric utilities, industrial users and natural gas producers. This project has an expected in-service date of the second half of 2029 and remains subject to FERC approval, acquisition of land rights, receipt of environmental permits and authorizations and other conditions precedent.\nIn addition to growth projects for which Boardwalk Pipelines has executed precedent agreements, it regularly considers other potential growth projects at earlier stages of development. Boardwalk Pipelines may from time to time make public disclosures regarding these potential projects, for instance, through announcements of open seasons for potential future capacity. In addition to the risks and uncertainties described above regarding the growth projects for which Boardwalk Pipelines has executed precedent agreements, these potential growth projects at earlier stages of development are subject to a variety of additional risks and uncertainties as Boardwalk Pipelines has not reached final investment decisions or secured executed precedent agreements for them. Therefore, these potential growth projects at earlier stages of development are highly speculative and may not be consummated as contemplated in any such public disclosures or at all.\nResults of Operations\nThe following table summarizes the results of operations for Boardwalk Pipelines for the three and nine months ended September 30, 2025 and 2024, as presented in Note 12 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report. Boardwalk Pipelines also utilizes a non-GAAP measure, earnings before interest, income tax expense, depreciation and amortization (“EBITDA”) as a financial measure to assess its operating and financial performance and return on invested capital. Management believes some investors may find this measure useful in evaluating Boardwalk Pipelines’ performance as EBITDA is a commonly used metric within the midstream industry.\n56\nTable of contents\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nOperating revenues and other\n$\n542\n \n$\n474 \n$\n1,697\n \n$\n1,466 \nInterest income\n4\n \n9 \n8\n \n22 \nTotal\n546\n \n483 \n1,705\n \n1,488 \nExpenses:\nOperating and other:\nOperating costs and expenses\n275\n \n225 \n810\n \n670 \nDepreciation and amortization\n107\n \n107 \n333\n \n321 \nInterest\n40\n \n47 \n119\n \n137 \nTotal\n422\n \n379 \n1,262\n \n1,128 \nIncome before income tax\n124\n \n104 \n443\n \n360 \nIncome tax expense\n(30)\n(27)\n(109)\n(92)\nNet income attributable to Loews Corporation\n$\n94\n \n$\n77 \n$\n334\n \n$\n268 \nEBITDA\n$\n267\n \n$\n249 \n$\n887\n \n$\n796 \nThree Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nNet income attributable to Loews Corporation\n and \nEBITDA increased\n $17 million and $18 million for the three months ended September 30, 2025 as compared with the comparable 2024 period, primarily due to the reasons discussed below. \nTotal revenues \nincreased\n $63 million for the three months ended September 30, 2025 as compared with the comparable 2024 period. Boardwalk Pipelines’\n transportation revenues increased $26 million, primarily due to re-contracting at higher rates and recently completed growth projects; storage, parking and lending revenues increased $9 million due to favorable market conditions which allowed for contracting at higher rates; and product sales revenues increased $33 million primarily due to higher ethane pricing in 2025.\nOperating and other expenses \nincreased\n $50 million for the three months ended September 30, 2025 as compared with the comparable 2024 period, primarily \nfrom higher product costs associated with higher ethane pricing, increased property taxes due to higher assessments and an increased asset base, and increased administrative and general costs due to higher employee-related and outside services costs.\nInterest expenses \ndecreased\n $7 million for the three months ended September 30, 2025 as compared with the comparable 2024 period \ndue to the pre-financing of a December 2024 debt maturity\n.\nNine Months Ended \nSeptember 30, 2025\n Compared to the Comparable \n2024\n Period\nNet income attributable to Loews Corporation\n and \nEBITDA \nincreased $66 million and $91 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period, primarily due to the reasons discussed below. \nTotal revenues increased $217 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period. Boardwalk Pipelines’\n transportation revenues increased $92 million, primarily due to re-contracting at higher rates, recently completed growth projects and higher utilization-based revenue; storage, parking and lending revenues increased $26 million due to favorable market conditions which allowed for contracting at higher rates; and product sales revenues increased $115 million primarily from higher volumes from the sale of ethane due to a customer outage in 2024, which impacted 2024 volumes, and higher ethane pricing in 2025.\nOperating and other expenses increased $152 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period, primarily \nfrom higher product costs associated with increased ethane product sales; increased depreciation and amortization expense and increased property taxes due to higher assessments and an increased asset base.\n57\nTable of contents\nInterest expenses decreased $18 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period \ndue to the pre-financing of a December 2024 debt maturity\n.\nNon-GAAP Reconciliation of Net Income Attributable to Loews Corporation to EBITDA \nThe following table reconciles net income attributable to Loews Corporation to EBITDA for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\nNet income attributable to Loews Corporation\n$\n94\n \n$\n77 \n$\n334\n \n$\n268 \nInterest, net \n36\n \n38 \n111\n \n115 \nIncome tax expense\n30\n \n27 \n109\n \n92 \nDepreciation and amortization\n107\n \n107 \n333\n \n321 \nEBITDA\n$\n267\n \n$\n249 \n$\n887\n \n$\n796 \nLoews Hotels & Co\nThe following table summarizes the results of operations for Loews Hotels & Co for the three and nine months ended September 30, 2025 and 2024, as presented in Note 12 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report. \nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nOperating revenue\n$\n180\n \n$\n195 \n$\n613\n \n$\n597 \nRevenues related to reimbursable expenses\n31\n \n31 \n97\n \n96 \nTotal\n211\n \n226 \n710\n \n693 \nExpenses:\nOperating and other\n163\n \n163 \n506\n \n487 \nReimbursable expenses\n31\n \n31 \n97\n \n96 \nDepreciation and amortization\n27\n \n24 \n75\n \n69 \nEquity income from joint ventures\n(25)\n \n(60)\n(59)\nInterest\n18\n \n17 \n52\n \n37 \nTotal\n214\n \n235 \n670\n \n630 \nIncome (loss) before income tax\n(3)\n(9)\n40\n \n63 \nIncome tax (expense) benefit\n \n1 \n(15)\n(20)\nNet income (loss) attributable to Loews Corporation\n$\n(3)\n$\n(8)\n$\n25\n \n$\n43 \nNet income (loss) attributable to Loews Corporation\n \nimproved \n$5 million\n and decreased\n $18 million for the three and nine months ended September 30, 2025 as compared with the comparable 2024 periods primarily due to the reasons discussed below.\n58\nTable of contents\nOperating revenues declined by $15 million\n and increased by\n $16 million and operating and other expenses were consistent with \nand increased by \n$19 million for the three and nine months ended September 30, 2025 as compared with the comparable 2024 periods. The decrease in operating revenues for the three-month period was primarily due to renovations at the Loews Miami Beach Hotel, which reduced the number of available and occupied room nights at the property, partially offset by higher revenues at the Loews Arlington Hotel and Convention Center. The increas\ne in operating revenues during the \nnine-\nmonth period was primarily due to higher average daily rates and higher food and beverage revenues, largely driven by the Loews Arlington Hotel and Convention Center being open for the entirety of 2025. These increases were partially offset by the decline in revenues associated with the Loews Miami Beach Hotel renovations. The increase in operating and other expenses for the nine-month period was primarily due to higher costs associated with the Loews Arlington Hotel and Convention Center and the termination of a contract with a minority owner in the first quarter of 2025.\nEquity income from joint ventures \nincreased\n $25 million\n and \n$1 million for the three and nine months ended September 30, 2025 as comp\nared with the comparable 2024 periods. Equity income from joint ventures was negatively impacted by i\nmpairment charges recorded at certain joint venture hotels, which reduced equity income by $9 million in the \nfirst quarter of 2025 and by $19 million in the third quarter of 2024. Excluding the impact of these charges, equity income from joint ventures increased $6 million \nand decreased $9 million for the three and nine months ended September 30, 2025 as compared with the comparable 2024 periods. The increase for the three-month period \nwas primarily driven by growth in the overall average daily rate and an increase in the number of occupied room nights at the Universal Orlando Resort, including those attributable to the three new hotels that opened earlier in 2025. The decrease for the nine-month period was primarily due to higher expenses, including pre-opening costs, depreciation and interest expense, related to these new hotels, as well as a reduction in net distributions, which reduced earnings at a Universal Orlando Resort joint venture, to support property improvement costs.\nDepreciation and amortization expense \nincreased \n$3 million\n and \n$6 million for the three and nine months ended September 30, 2025 as compared with the comparable 2024 pe\nriods. For the three-month period this increase was driven by accelerated depreciation of assets being replaced by renovations at certain properties. The increase for the nine-month period was also due to the Loews Arlington Hotel and Convention Center being open for the entirety of the 2025 period.\nInterest expense \nincreased \n$1 million\n and \n$15 million for the three and nine months ended September 30, 2025 as compared with the comparable 2024 perio\nds. For the nine-month period the increase is primarily due to \nlower capitalized interest on projects under development and higher interest rates on certain debt refinanced in 2024\n.\nCorporate\nCorporate operations consist primarily of investment income, interest expense and administrative costs at the Parent Company. Investment income includes earnings on cash and short-term investments held at the Parent Company to meet current and future liquidity needs, as well as results of the trading portfolio held at the Parent Company. Corporate also includes the equity method of accounting for Altium Packaging.\n \n59\nTable of contents\nThe following table summarizes the results of operations for Corporate for the three and nine months ended September 30, 2025 and 2024 as presented in Note 12 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nNet investment income\n$\n97\n \n$\n139 \n$\n144\n \n$\n202 \nExpenses:\n \n \nOperating and other\n21\n \n18 \n52\n \n58 \nEquity method loss\n3\n \n9 \n21\n \n15 \nInterest\n18\n \n18 \n54\n \n56 \nTotal\n42\n \n45 \n127\n \n129 \nIncome before income tax\n55\n \n94 \n17\n \n73 \nIncome tax expense\n(13)\n(21)\n(8)\n(17)\nNet income attributable to Loews Corporation\n$\n42\n \n$\n73 \n$\n9\n \n$\n56 \nNet income attributable to Loews Corporation\n \ndecreased\n \n$31 million and $47 million for \nthe \nthree and nine months ended September 30, 2025 as compared with the comparable 2024 periods. \nThe change in net \nincome\n for the three and \nnine\n month periods is primarily due to the reason discussed below.\nNet investment income for the Parent Company \ndecreased \n$42 million and\n \n$58 million for the\n three and nine \nmonths ended September 30, 2025 as compared with the comparable 2024 periods, primarily due to results from the trading portfolio.\nLIQUIDITY AND CAPITAL RESOURCES\nParent Company\nParent Company cash and investments, net of receivables and payables, totaled $3.6 billion at September 30, 2025 as compared to $3.3 billion at December 31, 2024. During the nine months ended \nSeptember 30, 2025\n, \nwe received $1.1 billion in cash dividends from our subsidiaries: $840 million from CNA, including a special cash dividend of $497 million, and distributions of $225 million from Boardwalk Pipelines. \nCash outflows during the nine months ended \nSeptember 30, 2025 \nincluded the payment of \n$706 million\n to fund treasury stock purchases and $39 million of cash dividends to our shareholders\n. As\n a holding company we depend on dividends from our subsidiaries and returns on our investment portfolio to fund our obligations. We also have an effective shelf registration statement on file with the Securities and Exchange Commission (“SEC”) under which we may publicly issue an unspecified amount of our debt, equity or hybrid securities from time to time. We are not responsible for the liabilities and obligations of our subsidiaries and there are no Parent Company guarantees. \nDepending on market and other conditions, we may purchase shares of our and our subsidiaries outstanding common stock in the open market \n(including, with respect to our common stock, in open market transactions that may or may not satisfy all of the conditions of the Rule 10b-18 voluntary safe harbor),\n in privately negotiated transactions or otherwise. During the nine months ended September 30, 2025, we purchased \n8.0 million\n shares of Loews Corporation common stock for \n$683 million\n. As of October 31, 2025, we repurchased \n0.3 million additional \nshares of Loews Corporation common stock in 2025 for \n$29 million. \nAs of October 31, 2025, there were 206,659,567 shares of Loews Corporation common stock outstanding.\nFuture uses of our cash may include purchases of our and our subsidiaries’ outstanding common stock, dividends, investing in our subsidiaries and/or to make opportunistic investments. The declaration and payment of future dividends to holders of our common stock will be at the discretion of our Board of Directors and will depend on many factors, including our earnings, financial condition and business needs.\n60\nTable of contents\nSubsidiaries\nCNA’s cash provided by operating activities was $1.9 billion for the nine months ended September 30, 2025 and 2024. \nThe cash provided by operating activities was driven by an increase in premiums collected and higher cash from investment earnings, offset by an increase in net claim payments and higher operating expenses. \nCNA paid cash dividends of $3.38 per share on its common stock, including a special cash dividend of $2.00 per share, during the nine months ended September 30, 2025. On October 31, \n2025\n, CNA’s Board of Directors declared a quarterly cash dividend of $0.46 per share, payable December 4, \n2025\n to shareholders of record on November 17, \n2025\n. CNA’s declaration and payment of future dividends is at the discretion of its Board of Directors and will depend on many factors, including CNA’s earnings, financial condition, business needs and regulatory constraints. CNA believes that its present cash flows from operating, investing and financing activities are sufficient to fund its current and expected working capital and debt obligation needs and does not expect this to change in the near term.\nDividends to CNA from Continental Casualty Company (“CCC”), a subsidiary of CNA, are subject to the insurance holding company laws of the State of Illinois, the domiciliary state of CCC. Under these laws, ordinary dividends, or dividends that do not require prior approval by the Illinois Department of Insurance, are determined based on the greater of the prior year’s statutory net income or 10% of statutory surplus as of the end of the prior year, as well as the timing and amount of dividends paid in the preceding 12 months. Additionally, ordinary dividends may only be paid from earned surplus, which is calculated by removing unrealized gains from unassigned surplus. As of September 30, 2025, CCC was in a positive earned surplus position. CCC paid dividends of $755 million and $635 million during the nine months ended September 30, 2025 and 2024. The actual level of dividends paid in any year is determined after an assessment of available dividend capacity, holding company liquidity and cash needs as well as the impact the dividends will have on the statutory surplus of the applicable insurance company.\nIn \nAugust of 2025\n, CNA completed a public offering of \n$500 million\n aggregate principal amount of its \n5.2%\n senior notes due \nAugust 15, 2035.\nCNA has an effective shelf registration statement on file with the SEC under which it may publicly issue an unspecified amount of debt, equity or hybrid securities from time to time.\nBoardwalk Pipelines’ cash provided by operating activities increased $98 million for the nine months ended September 30, 2025 as compared with the comparable 2024 period, primarily due to changes in net income. \nAs described in Current Growth Projects above, Boardwalk Pipelines is currently engaged in growth projects for which it has executed precedent or long-term firm transportation agreements. Through the date of this filing, the expected aggregate cost associated with these agreements is approximately $3.0 billion, which is expected to be spent through 2029. The majority of the capital expenditures for each of these projects is expected to be spent upon receiving FERC approval to begin construction, which is generally 12-18 months prior to the project’s expected in-service date. Boardwalk Pipelines expects to finance these growth projects through a combination of operating cash flows and the issuance of long-term debt, including borrowings under its revolving credit facility. Boardwalk Pipelines’ cost and timing estimates for these projects are subject to a variety of risks and uncertainties and are based on the factors described in Boardwalk Pipelines: Current Growth Projects in this MD&A. Actual costs and timing of in-service dates for Boardwalk Pipelines’ growth projects may differ, perhaps materially, from its estimates. Refer to Part I, Item 1A, Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2024 for additional risks associated with Boardwalk Pipelines’ growth projects and the related financing.\nThe nature of Boardwalk Pipelines’ existing growth projects will require it to enhance or modify its existing assets to accommodate increased operating pressures or changing flow patterns. Boardwalk Pipelines considers capital expenditures associated with the modification or enhancement of existing assets in the context of a growth project to be growth capital to the extent that the modification would not have been made in the absence of the growth project without regard to the condition of the existing assets.\nFor the nine months ended September 30, 2025 and 2024, Boardwalk Pipelines’ capital expenditures were $222 million and $292 million,\n consisting of growth capital expenditures of $98 million and $170 million and maintenance capital expenditures of $124 million and $122 million. \nAdditionally, as of \nSeptember 30, 2025\n, Boardwalk Pipelines has future capital commitments comprised of binding commitments under purchase orders for materials ordered but not received totaling approximately \n$273 million,\n \nwhich are expected to be settled through 2028.\n61\nTable of contents\nAs of September 30, 2025, \nBoardwalk Pipelines\n had the full borrowing capacity of $1.0 billion available under its revolving credit facility. The revolving credit facility has a borrowing capacity of $1.0 billion through May 27, 2027, and a borrowing capacity of $912 million from May 28, 2027 to May 26, 2028. As of September 30, 2025, Boardwalk Pipelines  has an effective shelf registration statement on file with the SEC under which it may publicly issue up to $900 million of debt securities, warrants or rights from time to time.\n Boardwalk Pipelines expects to retire the\n outstanding $550 million aggregate principal amount of its 6.0% debt in June 2026\n at maturity, through borrowings under its revolving credit facility or the issuance of debt securities. Boardwalk Pipelines believes that its existing capital resources, including its cash and cash equivalents, revolving credit facility and cash flows from operating activities, will be adequate to fund its anticipated obligations over the next twelve months.\nDuring the nine months ended September 30, 2025\n, Boardwalk Pipelines paid distributions of $225 million to the Company.\nLoews Hotels & Co, through its subsidiaries, has \nmortgage loans maturing beyond twelve months as of \nSeptember 30, 2025, \nwhich it may refinance before they mature. Refinancing any indebtedness, including loans of unconsolidated joint venture partnerships, may require Loews Hotels & Co to make principal pay downs, establish restricted cash reserves or provide guaranties of the subsidiary’s debt.\nINVESTMENTS\nInvestment activities of our non-insurance subsidiaries primarily consist of investments in fixed income securities, including short-term investments. The Parent Company portfolio also includes equity securities, including short sales and derivative instruments. Certain of these types of Parent Company investments generally have greater volatility, less liquidity and greater risk than fixed income investments and are included within Results of Operations – Corporate.\nThe Parent Company enters into short sales and invests in certain derivative instruments that are used for asset and liability management activities, income enhancements to its portfolio management strategy and to benefit from anticipated future movements in the underlying markets. If such movements do not occur as anticipated, significant losses may occur. Monitoring procedures include senior management review of daily reports of existing positions and valuation fluctuations to seek to ensure that open positions are consistent with the portfolio strategy.\nCredit exposure associated with non-performance by counterparties to derivative instruments is generally limited to the uncollateralized change in fair value of the derivative instruments recognized in the Consolidated Condensed Balance Sheets. The risk of non-performance is mitigated by monitoring the creditworthiness of counterparties and diversifying derivatives by using multiple counterparties. Collateral is occasionally required from derivative investment counterparties depending on the amount of the exposure and the credit rating of the counterparty.\nInsurance\nCNA maintains a large portfolio of fixed maturity and equity securities, including large amounts of corporate and government issued debt securities, residential and commercial mortgage-backed securities, other asset-backed securities and investments in limited partnerships which pursue a variety of long and short investment strategies across a broad array of asset classes. CNA’s investment portfolio supports its obligation to pay future insurance claims and provides investment returns which are an important part of CNA’s overall profitability.\n62\nTable of contents\nNet Investment Income\nThe significant components of CNA’s net investment income are presented in the following table. Fixed income securities, as presented, include both fixed maturity securities and non-redeemable preferred stock.\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nFixed income securities:\n \n \nTaxable fixed income securities\n$\n506\n \n$\n490 \n$\n1,510\n \n$\n1,446 \nTax-exempt fixed income securities\n44\n \n35 \n114\n \n109 \nTotal fixed income securities\n550\n \n525 \n1,624\n \n1,555 \nLimited partnership and common stock investments\n71\n \n80 \n225\n \n226 \nOther, net of investment expense\n17\n \n21 \n55\n \n72 \nNet investment income\n$\n638\n \n$\n626 \n$\n1,904\n \n$\n1,853 \nEffective income yield for the fixed income securities portfolio\n4.8\n%\n4.8\n%\n4.8\n%\n4.8\n%\nLimited partnership and common stock return for the period\n2.5\n%\n3.1\n%\n8.3\n%\n9.4\n%\nCNA’s net investment income \nincreased $12 million and\n \n$51 million\n for the three and nine months ended September 30, 2025 as compared with the comparable 2024 periods, driven by higher income from fixed income securities as a result of a larger invested asset base and favorable reinvestment rates.\n63\nTable of contents\nInvestment Gains (Losses)\nThe components of CNA’s investment gains (losses) are presented in the following table:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\n(In millions)\n \n \n \n \n \nInvestment gains (losses):\n \n \nFixed maturity securities:\n \n \nCorporate and other bonds\n$\n(6)\n$\n(17)\n$\n(55)\n$\n(38)\nStates, municipalities and political subdivisions\n1\n \n(1)\n(3)\nAsset-backed\n(5)\n(4)\n(12)\n(25)\nTotal fixed maturity securities\n(10)\n(22)\n(67)\n(66)\nNon-redeemable preferred stock\n4\n \n13 \n10\n \n25 \nDerivatives, short-term and other\n(1)\n(1)\n(5)\n(1)\nTotal investment losses\n(7)\n(10)\n(62)\n(42)\nIncome tax benefit\n1\n \n3 \n13\n \n9 \nAmounts attributable to noncontrolling interests\n1\n \n4\n \n3 \nInvestment losses attributable to Loews Corporation\n$\n(5)\n$\n(7)\n$\n(45)\n$\n(30)\nCNA’s pretax investment losses \nimproved\n $3 million for the three months ended September 30, 2025 as compared with the comparable 2024 period.\nCNA’s pretax investment losses increased $20 million for the \nnine months ended September 30, 2025\n as compared with the comparable 2024 period, driven by a lower favorable change in the fair value of non-redeemable preferred stock and higher net losses on disposals of fixed maturity securities, partially offset by lower impairment losses.\nFurther information on CNA’s investment gains and losses is set forth in Note 2 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\n64\nTable of contents\nPortfolio Quality\nThe following table presents the estimated fair value and net unrealized gains (losses) of CNA’s fixed maturity securities by rating distribution:\nSeptember 30, 2025\nDecember 31, 2024\n \nEstimated \nFair Value\nNet \nUnrealized Gains (Losses)\nEstimated \nFair Value\n Net \nUnrealized Gains \n(Losses)\n(In millions)\n \n \n \n \n \n \n \n \n \nU.S. Government, Government agencies and Government-sponsored enterprises\n$\n3,261\n \n$\n(251)\n$\n2,936 \n$\n(369)\nAAA\n4,128\n \n(136)\n3,010 \n(217)\nAA\n6,883\n \n(438)\n6,369 \n(567)\nA\n11,162\n \n(121)\n10,260 \n(379)\nBBB\n16,510\n \n(178)\n16,757 \n(729)\nNon-investment grade\n1,758\n \n(37)\n1,779 \n(64)\nTotal\n$\n43,702\n \n$\n(1,161)\n$\n41,111 \n$\n(2,325)\nAs of September 30, 2025 and December 31, 2024, 1% of CNA’s fixed maturity portfolio was rated internally. Additionally, as of September 30, 2025 and December 31, 2024, CNA assigned a AAA rating to $653 million and $199 million of municipal bonds that were either pre-refunded or backed by mortgage loans guaranteed by a U.S. government agency or sponsored enterprise.\nThe following table presents CNA’s available-for-sale fixed maturity securities in a gross unrealized loss position by ratings distribution:\nSeptember 30, 2025\nEstimated \nFair Value\nGross Unrealized Losses\n(In millions)\n \n \n \n \n \nU.S. Government, Government agencies and\n Government-sponsored enterprises\n$\n1,959\n \n$\n281\n \nAAA\n1,367\n \n248\n \nAA\n3,765\n \n633\n \nA\n5,049\n \n436\n \nBBB\n7,846\n \n627\n \nNon-investment grade\n705\n \n70\n \nTotal\n$\n20,691\n \n$\n2,295\n \n65\nTable of contents\nThe following table presents the maturity profile for these available-for-sale fixed maturity securities. Securities not due to mature on a single date are allocated based on weighted average life:\nSeptember 30, 2025\nEstimated \nFair Value\nGross Unrealized Losses\n(In millions)\n \n \n \n \n \nDue in one year or less\n$\n799\n \n$\n14\n \nDue after one year through five years\n5,977\n \n281\n \nDue after five years through ten years\n5,478\n \n594\n \nDue after ten years\n8,437\n \n1,406\n \nTotal\n$\n20,691\n \n$\n2,295\n \nDuration\nA primary objective in the management of CNA’s investment portfolio is to optimize return relative to the corresponding liabilities and respective liquidity needs. CNA’s views on the current interest rate environment, tax regulations, asset class valuations, specific security issuer and broader industry segment conditions as well as domestic and global economic conditions, are some of the factors that enter into an investment decision. CNA also continually monitors exposure to issuers of securities held and broader industry sector exposures and may from time to time adjust such exposures based on its views of a specific issuer or industry sector.\nA further consideration in the management of CNA’s investment portfolio is the characteristics of the corresponding liabilities and the ability to align the duration of the portfolio to those liabilities and to meet future liquidity needs, minimize interest rate risk and maintain a level of income sufficient to support the underlying insurance liabilities. For portfolios where future liability cash flows are determinable and typically long-term in nature, CNA segregates investments for asset/liability management purposes. The segregated investments support the long-term care and structured settlement liabilities in Other Insurance Operations. The effective durations of CNA’s fixed income securities and short-term investments are presented in the following table. Amounts presented are net of payable and receivable amounts for securities purchased and sold, but not yet settled.\nSeptember 30, 2025\nDecember 31, 2024\n \nEstimated \nFair Value\nEffective Duration (Years)\nEstimated\nFair Value\nEffective Duration (Years)\n(In millions of dollars)\n \n \n \n \n \n \n \nLife & Group\n$\n15,679\n \n9.8\n$\n14,915 \n9.8\nProperty & Casualty and other\n30,754\n \n4.6\n28,779 \n4.3\nTotal\n$\n46,433\n \n6.3\n$\n43,694 \n6.2\nCNA’s investment portfolio is periodically analyzed for changes in duration and related price risk. Certain securities have duration characteristics that are variable based on market interest rates, credit spreads and other factors that may drive variability in the amount and timing of cash flows. Additionally, CNA periodically reviews the sensitivity of the portfolio to the level of foreign exchange rates and other factors that contribute to market price changes. A summary of these risks and specific analysis on changes is included in the Quantitative and Qualitative Disclosures about Market Risk included under Item 7A of our Annual Report on Form 10-K for the year ended December 31, 2024.\nCRITICAL ACCOUNTING ESTIMATES\nCertain accounting policies require us to make estimates and judgments that affect the amounts reflected in the Consolidated Condensed Financial Statements. Such estimates and judgments necessarily involve varying, and possibly significant, degrees of uncertainty. Accordingly, certain amounts currently recorded or disclosed in the financial statements will likely be adjusted in the future based on new available information and changes in other facts and circumstances. \nSee \n66\nTable of contents\nthe Critical Accounting Estimates and the Insurance Reserves sections of our MD&A included under Item 7 of our Annual Report on Form 10-K for the year ended \nDecember 31, 2024\n for further information.\nACCOUNTING STANDARDS UPDATE\nFor a discussion of accounting standards updates that have been adopted, please read Note 1 of the Notes to Consolidated Condensed Financial Statements included under Item 1 of this Report.\nRECENT LEGISLATION\nOn July 4, 2025, H.R. 1, “An Act to provide for reconciliation pursuant to title II of H. Con. Res. 14,” commonly referred to as the One Big Beautiful Bill Act (“OBBBA”), was enacted. The OBBBA includes significant federal tax law changes which, among other impacts, modify and make permanent certain business tax provisions originally enacted in the 2017 Tax Cuts and Jobs Act. The provisions of the OBBBA have not had a material impact on the Company’s results of operations or financial condition. The OBBBA is subject to further clarification from the issuance of future technical guidance by the U.S. Department of Treasury. \nFORWARD-LOOKING STATEMENTS\nInvestors are cautioned that certain statements contained in this Report as well as in other of our and our subsidiaries’ SEC filings and periodic press releases and certain statements made by us and our subsidiaries and our and their officials in presentations or remarks may constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 (the “Act”). Forward-looking statements include, without limitation, any statement that does not directly relate to any historical or current fact and may project, indicate or imply future results, events, performance or achievements. Such statements may contain the words “expect,” “intend,” “plan,” “anticipate,” “estimate,” “believe,” “will be,” “will continue,” “will likely result,” and similar expressions. In addition, any statement concerning future financial performance (including future revenues, earnings or growth rates), ongoing business strategies or prospects, and possible actions taken by us or our subsidiaries are also forward-looking statements as defined by the Act. Forward-looking statements are based on current expectations and projections about future events and are inherently subject to a variety of risks and uncertainties, many of which are beyond our control, that could cause actual results to differ materially from those anticipated or projected.\nDevelopments in any of the risks or uncertainties facing us or our subsidiaries, including those described under Part I, Item 1A, Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2024 and in our and our subsidiaries’ other filings with the SEC, could cause our and our subsidiaries’ results to differ materially from results that have been or may be anticipated or projected. Given these risks and uncertainties, investors should not place undue reliance on forward-looking statements. Forward-looking statements speak only as of the date they are made and we and our subsidiaries expressly disclaim any obligation or undertaking to update these statements to reflect any change in expectations or beliefs or any change in events, conditions or circumstances on which any forward-looking statement is based."
}