{
  "item1": "Loews Corporation incorporated 1969 holding company. subsidiaries engaged following lines business: commercial property casualty insurance (CNA Financial Corporation, approximately 92% owned subsidiary); transportation storage natural gas natural gas liquids (Boardwalk Pipeline Partners, LP, wholly owned subsidiary); operation chain hotels (Loews Hotels Holding Corporation, wholly owned subsidiary). also own approximately 53% Altium Packaging LLC, unconsolidated subsidiary, which engaged manufacture rigid plastic packaging solutions. four reportable segments comprised three individual consolidated operating subsidiaries, CNA Financial Corporation, Boardwalk Pipeline Partners, LP Loews Hotels Holding Corporation; Corporate segment.",
  "item7": "Actual revenues recognized firm agreements 2024 (a) Firm agreements entered into 2024 Total projected operating revenues under committed firm agreements December 31, 2024 Reflects increase $114 million Boardwalk Pipelines’ actual 2024 revenues recognized fixed fees under firm agreements compared its expected 2024 revenues fixed fees under firm agreements, including agreements transportation, storage other services December 31, 2023, primarily due increase contract renewals higher rates occurred 2024. , Boardwalk Pipelines entered into $6.0 billion new firm agreements, which approximately 78% associated new growth projects executed 2024. firm agreements associated new growth projects, associated assets may not placed into commercial service until sometime future. Further, table above includes $3.8 billion estimated revenues anticipated under executed precedent transportation agreements growth projects subject regulatory approvals.",
  "item2": "CNA’s Property & Casualty Other Insurance Operations CNA’s commercial property casualty insurance operations (“Property & Casualty Operations”) include its Specialty, Commercial International lines business. CNA’s Other Insurance Operations outside Property & Casualty Operations include its long-term care business run-off, certain corporate expenses, including interest CNA’s corporate debt, results certain property casualty businesses run-off, including CNA Re, asbestos environmental pollution (“A&EP”), legacy portfolio excess workers’ compensation (“EWC”) policies certain legacy mass tort reserves. believe presentation CNA one reportable segment appropriate accordance applicable accounting standards segment reporting. However, purposes discussion analysis results operations, provide greater detail respect CNA’s Property & Casualty Operations Other Insurance Operations enhance reader’s understanding provide further transparency into key drivers CNA’s financial results."
}