{
  "source_file": "l-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business.\nLoews Corporation was incorporated in 1969 and is a holding company. Our subsidiaries are engaged in the following lines of business:\n•\ncommercial property and casualty insurance (CNA Financial Corporation, an approximately 92% owned subsidiary);\n•\ntransportation and storage of natural gas and natural gas liquids (Boardwalk Pipeline Partners, LP, a wholly owned subsidiary); and\n•\noperation of a chain of hotels (Loews Hotels Holding Corporation, a wholly owned subsidiary).\nWe also own approximately 53% of Altium Packaging LLC, an unconsolidated subsidiary, which is engaged in the manufacture of rigid plastic packaging solutions.\nWe have four reportable segments comprised of three individual consolidated operating subsidiaries, CNA Financial Corporation, Boardwalk Pipeline Partners, LP and Loews Hotels Holding Corporation; and the Corporate segment. The Corporate segment is comprised of Loews Corporation, excluding these subsidiaries, and the equity method of accounting for Altium Packaging LLC, an unconsolidated subsidiary. Additional financial information on each of our segments is included under Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”). \nCNA FINANCIAL CORPORATION\nCNA Financial Corporation (together with its subsidiaries, “CNA”) is an insurance holding company. CNA’s property and casualty and remaining life and group insurance operations are primarily conducted by Continental Casualty Company (“CCC”), The Continental Insurance Company, Western Surety Company, CNA Insurance Company Limited, Hardy Underwriting Bermuda Limited and its subsidiaries (“Hardy”) and CNA Insurance Company (Europe) S.A. CNA accounted for \n81.5%\n, 83.6% and 84.6% of our consolidated total revenue for the years ended December 31, 2024, 2023 and 2022.\nCNA’s insurance products primarily include commercial property and casualty coverages, including surety. CNA’s services include warranty, risk management, information services and claims administration. CNA’s products and services are primarily marketed through independent agents, brokers and managing general underwriters to a wide variety of \n5\nTable of Contents\ncustomers, including small, medium and large businesses, insurance companies, associations, professionals and other groups. The property and casualty insurance industry is highly competitive, both as it relates to rate and service. CNA competes with a large number of stock and mutual insurance companies, as well as other entities, for both distributors and customers.\nProperty & Casualty Operations\nCNA’s commercial property and casualty insurance operations (“Property & Casualty Operations”) includes its Specialty, Commercial and International lines of business.\nSpecialty\nSpecialty provides management and professional liability and other coverages through property and casualty products and services using a network of brokers, independent agencies and managing general underwriters. Specialty includes the following business groups:\nManagement & Professional Liability\n: Management & Professional Liability consists of the following coverages and products:\n•\nprofessional liability coverages and risk management services to various professional firms, including architects, real estate agents, accounting firms and law firms;\n•\ndirectors and officers (“D&O”), errors and omissions (“E&O”), employment practices, fiduciary, fidelity and cyber coverages. Specific areas of focus include small and mid-size firms, public as well as privately held firms and not-for-profit organizations;\n•\ninsurance products to serve the health care industry, including professional and general liability as well as associated casualty coverages. Key customer groups include aging services, allied medical facilities, dentists, physicians, nurses and other medical practitioners.\nSurety\n: Surety offers small, medium and large contract and commercial surety bonds. Surety provides surety and fidelity bonds in all 50 states.\nWarranty and Alternative Risks\n:\n \nWarranty and Alternative Risks provides extended service contracts and insurance products that provide protection from the financial burden associated with mechanical breakdown and other related losses, primarily for vehicles, portable electronic communication devices and other consumer goods. Service contracts are generally distributed by commission-based independent representatives and sold by auto dealerships and retailers in North America to customers in conjunction with the purchase of a new or used vehicle or new consumer goods. Additionally, CNA’s insurance companies may issue contractual liability insurance policies or guaranteed asset protection reimbursement insurance policies to cover the liabilities of these service contracts issued by affiliated entities or third parties.\nCommercial\nCommercial works with a network of brokers and independent agents to market a broad range of property and casualty insurance products to all types of insureds, targeting small business, construction, middle markets and other commercial customers. Property products include standard and excess property, marine and boiler and machinery coverages. Casualty products include standard casualty insurance products such as workers’ compensation, general and product liability, commercial auto, umbrella, and excess and surplus coverages. Most insurance programs are provided on a guaranteed cost basis; however, CNA also offers specialized loss-sensitive insurance programs and total risk management services relating to claim and information services to the large commercial insurance marketplace.\nInternational\nInternational underwrites property and casualty coverages on a global basis through a branch operation in Canada, a European business consisting of insurance companies based in the United Kingdom and Luxembourg and Hardy, CNA’s Lloyd’s of London (“Lloyd’s”) syndicate.\n6\nTable of Contents\nProperty & Casualty Structure\nCNA’s commercial property & casualty underwriting operations presence in the United States of America (“U.S.”) consists of field underwriting locations and centralized processing operations which handle policy processing, billing and collection activities and also act as call centers to optimize service. CNA’s claim operations presence in the U.S. consists of primary locations where it handles multiple claim types and key business functions, as well as regional claim offices which are aligned with CNA’s underwriting field structure. CNA also has property & casualty underwriting operations in Canada, the United Kingdom (“U.K.”) and Continental Europe, as well as access to business placed at Lloyd’s through Syndicate 382.\nOther Insurance Operations\nOther Insurance Operations include CNA’s run-off long-term care business as well as structured settlement obligations not funded by annuities related to certain property and casualty claimants, certain corporate expenses, including interest on CNA corporate debt, and certain property and casualty businesses in run-off, including CNA Re, A&EP, a legacy portfolio of excess workers’ compensation (“EWC”) policies and certain legacy mass tort reserves.\nRegulation\nCurrent Regulation:  \nThe insurance industry is subject to comprehensive and detailed regulation and supervision. Regulatory oversight by applicable agencies is exercised through review of submitted filings and information, examinations (both financial and market conduct), direct inquiries and interviews. Each domestic and foreign jurisdiction has established supervisory agencies with broad administrative powers relative to licensing insurers and agents, approving policy forms, establishing reserve requirements, prescribing the form and content of statutory financial reports and regulating capital adequacy and the type, quality and amount of investments permitted. Such regulatory powers also extend to premium rate regulations requiring rates not be excessive, inadequate or unfairly discriminatory. In addition to regulation of dividends by insurance subsidiaries, intercompany transfers of assets or payments may be subject to prior notice or approval by insurance regulators, depending on the size of such transfers and payments in relation to the financial position of the insurance subsidiaries making the transfers or payments.\nAs CNA’s insurance operations are conducted in both domestic and foreign jurisdictions, CNA is subject to a number of regulatory agency requirements applicable to a portion, or all, of CNA’s operations. These include but are not limited to, the State of Illinois Department of Insurance (which is CNA’s global group-wide supervisor), the U.K. Prudential Regulatory Authority and Financial Conduct Authority, the Office of Superintendent of Financial Institutions in Canada, the Luxembourg insurance regulator Commissariat aux Assurances and the Bermuda Monetary Authority.\nDomestic insurers are also required by state insurance regulators to provide coverage to certain insureds who would not otherwise be considered eligible by the insurers. Each state dictates the types of insurance and the level of coverage that must be provided to such involuntary risks. CNA’s share of these involuntary risks is mandatory and generally a function of its respective share of the voluntary market by line of insurance in each state.\nFurther, domestic insurance companies are subject to state guaranty fund and other insurance-related assessments. Guaranty funds are governed by state insurance guaranty associations which levy assessments to meet the funding needs of insolvent insurer estates. Other insurance-related assessments are generally levied by state agencies to fund various organizations including disaster relief funds, rating bureaus, insurance departments, and workers’ compensation second injury funds, and by industry organizations that assist in the statistical analysis and ratemaking process and CNA has the ability to recoup certain of these assessments from policyholders.\nAlthough the U.S. federal government does not currently directly regulate the business of insurance, federal legislative and regulatory initiatives can affect the insurance industry. These initiatives and legislation include proposals relating to terrorism and natural catastrophe exposures, federal financial services reforms and certain tax reforms.\nHardy, a specialized Lloyd’s underwriter, is also supervised by the Council of Lloyd’s, which is the franchisor for all Lloyd’s operations. The Council of Lloyd’s has wide discretionary powers to regulate Lloyd’s underwriting, such as establishing the capital requirements for syndicate participation. In addition, the annual business plan of each syndicate is subject to the review and approval of the Lloyd’s Franchise Board, which is responsible for business planning and monitoring for all syndicates.\n7\nTable of Contents\nCapital adequacy and risk management regulations, referred to as Solvency II, apply to CNA’s European operations and are enacted by the European Commission, the executive body of the European Union (“E.U.”). Additionally, the International Association of Insurance Supervisors (“IAIS”) continues to develop capital requirements as more fully discussed below.\nRegulation Outlook: \nThe IAIS has adopted a Common Framework (“ComFrame”) for the supervision of Internationally Active Insurance Groups (“IAIGs”) which is focused on the group-wide supervision of IAIGs, such as CNA. \nElements of ComFrame have been incorporated\n into regulatory guidelines issued by the National Association of Insurance Commissioners (“NAIC”) for application by regulators in the U.S. These additions were adopted for the purpose of streamlining group-wide supervision, further leveraging existing risk and solvency measures and applying them on a group-wide basis.\nThe NAIC has developed an approach to group capital regulation and solvency-monitoring activities using the Group Capital Calculation (“GCC”). While historically the U.S. regulatory regime was primarily based on legal entity regulation, the GCC quantifies risk across the insurance group. The GCC was adopted by the NAIC along with model legislative language and attendant regulations, which have been adopted in a number of U.S. states where IAIGs are domiciled, including Illinois. Alongside the GCC, the NAIC has also developed the Aggregation Method (“AM”) approach to assessing group capital as an alternative to the Insurance Capital Standard (“ICS”) developed by the IAIS. The AM is influenced by the GCC and calculated in a similar manner. In 2024, the IAIS concluded that the AM provides comparable outcomes to the ICS. While the AM will undergo further refinement as a part of the implementation process, the finding of comparability by the IAIS represents recognition of existing U.S. solvency regulation.\nIn addition, the U.S. and foreign regulatory environment in which CNA operates is continuously evolving, with both existing and prospective regulations that implicate aspects of its corporate governance, public disclosures and risk management, climate change, artificial intelligence and cybersecurity practices. \nProperties: \nCNA’s principal executive offices are based in Chicago, Illinois. CNA’s subsidiaries maintain office space in various cities throughout the United States and various countries. CNA leases all of its office space.\nBOARDWALK PIPELINE PARTNERS, LP\nBoardwalk Pipeline Partners, LP (together with its subsidiaries, “Boardwalk Pipelines”) is engaged in the business of transportation and storage of natural gas and natural gas liquids, olefins and other hydrocarbons (herein referred to together as “NGLs”). Boardwalk Pipelines also provides ethane supply and transportation services for industrial customers in Louisiana and Texas. Boardwalk Pipelines accounted for 11.8%, 10.3% and 10.3% of our consolidated total revenue for the years ended December 31, 2024, 2023 and 2022.\nA wholly owned subsidiary of ours, Boardwalk Pipelines Holding Corp. (“BPHC”) owns, directly and indirectly, 100% of the general partner and limited partnership interests of Boardwalk Pipelines.\nBoardwalk Pipelines operates in the midstream portion of the natural gas and NGLs industry, providing transportation and storage for those commodities. Boardwalk Pipelines also provides ethane supply and transportation services for industrial customers in Louisiana and Texas.\n Boardwalk Pipelines owns approximately \n14,315\n miles of natural gas and NGLs pipelines and underground storage caverns having aggregate capacity of approximately 199.5\n \nbillion cubic feet (“Bcf”) of working natural gas and 31.2 million barrels (“MMBbls”) of NGLs. Boardwalk Pipelines’ integrated natural gas pipeline and storage systems are located in the Gulf Coast region, Oklahoma, Arkansas, Tennessee, Kentucky, Illinois, Indiana and Ohio, and its NGLs pipelines and storage facilities are located in Louisiana and Texas. \nBoardwalk Pipelines’ principal natural gas and natural gas liquids businesses are described below:\nNatural Gas\nBoardwalk Pipelines’ natural gas business, which provides transportation, storage and PAL services for natural gas customers, consists of integrated interstate and intrastate natural gas pipelines and storage facilities. Boardwalk Pipelines owns and operates approximately 13,445 miles of interconnected natural gas pipelines, directly serving customers in thirteen states and indirectly serving customers throughout the northeastern and southeastern U.S. through numerous interconnections with unaffiliated pipelines. In \n2024\n, its natural gas pipeline systems transported approximately 3.7 trillion cubic feet of natural gas. Average daily throughput on Boardwalk Pipelines’ natural gas pipeline systems during \n2024\n was approximately 10.2 billion cubic feet (“Bcf”). Boardwalk Pipelines’ natural gas storage facilities are comprised of fourteen underground storage fields located in four states with aggregate working gas capacity of approximately 191.9 Bcf. \n8\nTable of Contents\nFollowing is a summary of the primary subsidiaries comprising Boardwalk Pipelines’ natural gas business:\nThe Gulf South Pipeline Company, LLC (“Gulf South”) pipeline system is located along the Gulf Coast in the states of Oklahoma, Texas, Louisiana, Mississippi, Alabama and Florida. Gulf South has ten natural gas storage facilities. The two natural gas storage facilities located in Louisiana and Mississippi have approximately 78.0 Bcf of working gas storage capacity and the eight salt dome natural gas storage caverns in Mississippi have approximately 46.0 Bcf of total storage capacity, of which approximately 29.6 Bcf is working gas capacity. Gulf South also owns undeveloped land which is suitable for up to five additional storage caverns. Gulf South is regulated by the FERC.\nThe Texas Gas Transmission, LLC (“Texas Gas”) pipeline system is a bi-directional pipeline, located in Louisiana, East Texas, Arkansas, Mississippi, Tennessee, Kentucky, Indiana and Ohio, with smaller diameter lines extending into Illinois. Texas Gas owns nine natural gas storage fields, of which it owns the majority of the working and base gas. Texas Gas is regulated by the FERC.\nOther: Boardwalk Pipelines has minor intrastate and natural gas pipeline assets in South Texas and Louisiana serving end-use, electric power generators and industrial customers.\nThe following table provides information for Boardwalk Pipelines’ natural gas assets owned and operated as of December 31, 2024:\nAssets\nMiles of\nPipeline\nAverage\nDaily\nThroughput\n(Bcf/d) (a)\nPeak-day\nDelivery\nCapacity\n(Bcf/d)\nWorking\nGas Storage\nCapacity\n(Bcf)\nGulf South\n7,180\n6.8\n10.9\n107.6\nTexas Gas\n6,000\n3.3\n6.3\n84.3\nOther Natural Gas\n265\n0.1\n(a)\nBcf per day (Bcf/d)\nNatural Gas Liquids\nBoardwalk Pipelines’ natural gas liquids business, which provides transportation and storage services for NGLs and supply services for ethane and brine customers, consists primarily of NGLs pipelines, salt dome storage facilities and brine infrastructure. Boardwalk Pipelines owns and operates approximately 870 miles of NGLs pipelines in Louisiana and Texas. In 2024, Boardwalk Pipelines’ natural gas liquids pipeline systems transported approximately 136.6 MMBbls of NGLs. Boardwalk Pipelines’ NGLs storage facilities consist of 11 salt-dome caverns located in Louisiana with an aggregate storage capacity of approximately 31.2 MMBbls. Boardwalk Pipelines also owns ten salt-dome caverns and related brine infrastructure located in Louisiana for use in providing brine supply services and to support the NGLs storage operations. Boardwalk Pipelines’ NGLs pipeline systems access the Gulf Coast petrochemical industry through operations at its Choctaw Hub in Louisiana and the Sulphur Hub in Louisiana. Boardwalk Pipelines accesses ethylene supplies in Texas, which it delivers to petrochemical-industry customers in Louisiana. Boardwalk Pipelines purchases ethane in Texas and Louisiana and utilizes its NGLs pipelines to supply ethane to customers in Texas and Louisiana. The majority of Boardwalk Pipelines’ natural gas liquids customers are industrial end-users.\nFollowing is a summary of the primary subsidiaries comprising Boardwalk Pipelines’\n natural gas liquids business:\nBoardwalk Louisiana Midstream, LLC (“Louisiana Midstream”) provides transportation and storage services for NGLs, primarily ethylene, and brine supply services for producers and consumers of petrochemicals through two hubs in southern Louisiana. These assets have approximately 47.8 MMBbls of salt dome storage capacity, including approximately 7.6 Bcf of working natural gas storage capacity, significant brine supply infrastructure, and approximately 310 miles of pipeline assets, including an extensive ethylene distribution system. \nLouisiana Midstream’s\n Choctaw pipeline network is a common carrier pipeline system situated along the Mississippi River Corridor that serves chemical complexes throughout southeastern Louisiana and provides connectivity to producers and consumers of ethylene. Through interconnections with Boardwalk Petrochemical Pipeline, LLC’s (“Boardwalk Petrochemical”) Evangeline Pipeline and other third-party pipelines, the system links ethylene producers in Texas and the Lake Charles area to the Mississippi River Corridor. \nLouisiana Midstream\n also owns eight salt-dome caverns and related \n9\nTable of Contents\nbrine infrastructure located on the Choctaw Hub for use in providing brine supply services and supporting its NGLs storage operations. \nLouisiana Midstream’s\n Sulphur pipeline network is located near Lake Charles, Louisiana, and is connected to local ethylene producers and consumers and area refineries. At the Sulphur Hub, \nLouisiana Midstream owns and operates\n five active storage caverns, which are currently in ethylene, ethane and propane service. \nBoardwalk Petrochemical owns and operates the Evangeline Pipeline, an approximately 180-mile bi-directional, common carrier, interstate ethylene pipeline that is capable of transporting approximately 4.8 billion pounds of ethylene per year between Texas and Louisiana, and interconnects with the ethylene distribution system and storage facilities at Louisiana Midstream’s Sulphur and Choctaw Hubs. The Evangeline Pipeline links ethylene producers and consumers from Texas to Louisiana.\nBoardwalk Ethane Pipeline Company, LLC (“Bayou Ethane”) owns and operates the Bayou Ethane Pipeline, an approximately 380-mile pipeline system originating in Texas, that transports ethane to Southeast Texas and to Louisiana. The Bayou Ethane Pipeline provides common carrier, interstate and intrastate transportation services and interconnects with Louisiana Midstream’s storage facilities at the Sulphur and Choctaw Hubs. The Bayou Ethane Pipeline has the ability to deliver approximately 55.0 MMBbls of ethane per year. Bayou Ethane provides ethane supply and transportation services for industrial customers in Louisiana and Texas. \nThe following table provides information for Boardwalk Pipelines’ natural gas liquids assets owned and operated as of December 31, 2024:\nAssets\nMiles of\nPipeline\nAnnual\nThroughput\n(MMBbls)\nWorking\nGas Storage\nCapacity\n(Bcf)\nLiquids\nStorage\nCapacity\n(MMBbls)\nLouisiana Midstream\n310\n60.2\n7.6\n31.2\nBoardwalk Petrochemical\n180\n36.3\nBayou Ethane\n380\n40.1\nIn 2024, Boardwalk Pipelines placed into service approximately $245 million of growth projects which represents approximately 0.4 Bcf per day of firm natural gas transportation capacity, additional capacity on its ethylene pipeline systems and increased storage capacity and reliability. Boardwalk Pipelines expects to spend a total of approximately $1.6 billion on its ongoing and announced growth projects, with expected in-service dates for these projects ranging from 2025-2029. These projects are expected to add over 2.0 Bcf per day of firm natural gas transportation capacity. These projects are expected to serve increased natural gas demand from electric power generation plants and industrial customers. Boardwalk Pipelines’ growth projects are secured by long-term firm contracts, though some are supported by executed precedent transportation agreements for projects that are subject to regulatory approvals.\nCustomers: \nBoardwalk Pipelines serves a broad mix of customers, including end-use customers, such as electric power generators, local distribution companies, industrial users and exporters of liquefied natural gas (“LNG”). Boardwalk Pipelines also contracts with other customers, including producers and marketers of natural gas and interstate and intrastate pipelines, who, in turn, provide transportation and storage services for end-users. These customers are located throughout the Gulf Coast, Midwest and Northeast regions of the U.S. Boardwalk Pipelines’ natural gas delivery markets have diversified over time, with increased deliveries to end-use customers, whereas, historically its natural gas delivery markets were primarily to other pipelines who then delivered to end-use customers.\nGovernmental Regulation: \nThe FERC regulates Boardwalk Pipelines’ interstate natural gas transmission operating subsidiaries under the Natural Gas Act of 1938 (“NGA”) and the Natural Gas Policy Act of 1978 (“NGPA”). The FERC regulates, among other things, the rates and charges for the transportation and storage of natural gas in interstate commerce and the construction, extension, enlargement or abandonment of facilities under its jurisdiction. Where required, Boardwalk Pipelines’ natural gas pipeline subsidiaries hold certificates of public convenience and necessity issued by the FERC covering certain of their facilities, activities and services. The maximum applicable rates that Boardwalk Pipelines’ FERC-regulated subsidiaries may charge for all aspects of the natural gas transportation services they provide, are established through the FERC’s cost-based rate-making process; however, the FERC also allows for discounted or negotiated rates as an alternative to cost-based rates. Key determinants in the FERC’s cost-based rate-making process are the costs of providing service, the volumes of gas being transported, the rate design, the allocation of costs between services, the capital structure and the rate of return a pipeline is permitted to earn. The maximum applicable rates that Boardwalk Pipelines may \n10\nTable of Contents\ncharge for storage services on Texas Gas, except for services associated with a portion of the working gas capacity on that system, are also established through the FERC’s cost-based rate-making process. The FERC has authorized Boardwalk Pipelines to charge market-based rates for its firm and interruptible storage services for the majority of its other natural gas storage facilities. None of Boardwalk Pipelines’ FERC-regulated entities currently have an obligation to file a new rate case. \nSome of Boardwalk Pipelines’ other subsidiaries transport natural gas in intrastate commerce under the rules and regulations established by the Texas Railroad Commission and in interstate commerce that is subject to FERC jurisdiction under Section 311 of the NGPA. The maximum rates for services are established under Section 311 of the NGPA and are generally subject to review every five years by the FERC. The rates and terms of service on Boardwalk Pipelines’ interstate ethane transportation pipeline are also subject to regulation by the FERC under, among other statutes, the Interstate Commerce Act (“ICA”) and the Energy Policy Act of 1992.\nOver time, the FERC may change, amend or announce that it will undertake a review of its existing policies. There were no major policy changes announced by the FERC during \n2024 that materially impacted \nBoardwalk Pipelines.\nThe FERC has authority to impose civil penalties for violations of the NGA and NGPA, and the implementing regulations thereunder, up to a maximum amount that is adjusted annually for inflation, which for \n2025\n is approximately $1.6 million per day per violation. Should Boardwalk Pipelines fail to comply with applicable statutes, rules, regulations and orders administered by the FERC, it could be subject to substantial penalties and fines, in addition to reputational damage.\nThe Surface Transportation Board (“STB”) regulates the rates Boardwalk Pipelines charges for interstate service on its ethylene pipeline systems. The Louisiana Public Service Commission (“LPSC”) regulates the rates Boardwalk Pipelines charges for intrastate service within the state of Louisiana on its petrochemical and NGLs pipelines. The STB and LPSC require that Boardwalk Pipelines’ transportation rates are reasonable and that its practices cannot unreasonably discriminate among its shippers.\nBoardwalk Pipelines is also regulated by the U.S. Department of Transportation (“DOT”) through the Pipeline and Hazardous Materials Safety Administration (“PHMSA”) under the Natural Gas Pipeline Safety Act of 1968, as amended (“NGPSA”) and the Hazardous Liquids Pipeline Safety Act of 1979, as amended (“HLPSA”). The NGPSA and HLPSA govern the design, installation, testing, construction, operation, replacement and management of interstate natural gas and NGLs pipeline facilities. Boardwalk Pipelines has authority from PHMSA to operate certain natural gas pipeline assets under issued permits with specific conditions that allow it to operate those pipeline assets at higher than normal operating pressures of up to 0.80 of the pipeline’s Specified Minimum Yield Strength (“SMYS”). Operating at these pressures allows these pipelines to transport all the existing natural gas volumes Boardwalk Pipelines has contracted for on those facilities with its customers. PHMSA retains discretion whether to grant or maintain authority for Boardwalk Pipelines to operate its natural gas pipeline assets at higher pressures and, in the event that PHMSA should elect not to allow Boardwalk Pipelines to operate at these higher pressures, it could affect its ability to transport all of its contracted quantities of natural gas on these pipeline assets, and Boardwalk Pipelines could incur significant additional costs to reinstate this authority or to develop alternate ways to meet its contractual obligations. PHMSA’s regulations also require transportation pipeline operators to implement integrity management programs to comprehensively evaluate certain high-risk areas, known as high consequence areas (“HCAs”) and moderate consequence areas (“MCAs”), along pipelines and take additional safety measures to protect people and property in these areas. The HCAs for natural gas pipelines are predicated on high-population density areas (which, for natural gas transmission lines, \ninclude Class 3 and 4 areas and, depending on the potential impacts of a risk event\n, may include Class 1 and 2 areas) whereas HCAs along Boardwalk Pipelines’ NGLs pipelines are based on high-population density areas, areas near certain drinking water sources and unusually sensitive ecological areas.\nLegislation has resulted in more stringent mandates for pipeline safety and has charged PHMSA with developing and adopting regulations that impose increased pipeline safety requirements on pipeline operators. In particular, the NGPSA and HLPSA were amended by the Pipeline Safety, Regulatory Certainty, and Job Creation Act of 2011 (“2011 Act”), the Protecting Our Infrastructure of Pipelines and Enhancing Safety Act of 2016 (“2016 Act”) and, most recently, the Protecting Our Infrastructure of Pipelines and Enhancing Safety Act of 2020 (“2020 Act”), each of which imposed increased pipeline safety obligations on pipeline operators. The 2011 Act increased the penalties for safety violations, established additional safety requirements for newly constructed pipelines and required studies of safety issues that could result in the adoption of new regulatory requirements by PHMSA for existing pipelines. The 2016 Act, among other things, required PHMSA to complete its outstanding mandates under the 2011 Act and develop new safety standards for natural gas storage facilities. The 2020 Act reauthorized PHMSA through fiscal year 2023 and directed the agency to move forward with several regulatory initiatives, including obligating operators of non-rural gas gathering lines and new and \n11\nTable of Contents\nexisting transmission and distribution pipeline facilities to conduct certain leak detection and repair programs and to require facility inspection and maintenance plans to align with those requirements. \nAs a result of the 2011 Act, the 2016 Act and the 2020 Act, PHMSA has issued a series of significant rulemakings for onshore gas transmission pipelines (e.g., relating to maximum allowable operating pressure (“MAOP”) reconfirmation and exceedance reporting, the integrity assessment of additional pipeline mileage and the consideration of seismicity as a risk factor in integrity management), and hazardous liquid transmission and gathering pipelines (e.g., expanding the reach of certain of PHMSA’s integrity management requirements, requiring the accommodation of in-line inspection tools by 2039 for certain pipelines, increasing annual, accident and safety-related conditional reporting requirements, and expanding the use of leak detection systems beyond HCAs). PHMSA also regulates the minimum safety requirements applicable to natural gas storage facilities, including wells, wellbore tubing and casing. In August 2022, PHMSA published a final rule that attempted to expand the Management of Change process, corrosion control requirements for gas transmission pipelines, requirements that operators ensure no conditions exist following an extreme weather event that could adversely affect the safe operation of the pipeline and repair criteria for non-HCAs. Five safety standards included in that rule were challenged by industry trade groups, and in August 2024, the U.S. Court of Appeals for the D.C. Circuit struck down four of the five challenged safety standards. In September 2023, PHMSA published a proposed rule that, if finalized, would enhance the safety requirements for gas distribution pipelines and would require updates to distribution integrity management programs, emergency response plans, operations and maintenance manuals and other safety practices.  These new and any future regulations adopted by PHMSA have imposed and may impose more stringent requirements applicable to integrity management programs and other pipeline safety aspects of Boardwalk Pipelines operations, which could cause it to incur increased capital and operating costs and operational delays.\nThe Department of Homeland Security’s Transportation Safety Administration (“TSA”) has issued a series of security directives between 2022 and 2024 applicable to major pipeline owners and operators intended to strengthen the industry’s overall cybersecurity posture in light of the evolving threat landscape and its potential impacts to U.S. critical infrastructure. The security directives require, among other things, that pipeline owners and operators designate a cybersecurity coordinator, establish and implement a Cybersecurity Implementation Plan; develop, maintain and test no less than annually through tabletop exercises a Cybersecurity Incident Response Plan; and establish a Cybersecurity Assessment Plan (“CAP”) including a schedule for assessing and auditing the CAP. The directives also contain requirements for reporting cybersecurity incidents and the results of certain assessments and audits. Boardwalk Pipelines has implemented tools, policies and practices designed to comply with the security directives. Other regulators, such as PHMSA and the Securities and Exchange Commission (“SEC”), have also established requirements for reporting certain cybersecurity incidents.\nBoardwalk Pipelines’ operations are also subject to extensive federal, state, and local laws and regulations relating to the protection of the environment and occupational health and safety. Such laws and regulations impose, among other things, restrictions, liabilities and obligations in connection with the generation, handling, use, storage, transportation, treatment and disposal of various substances including hazardous substances and waste and in connection with spills, releases, discharges and emissions of various substances into the environment. Environmental regulations also require that Boardwalk Pipelines’ facilities, sites and other properties be operated, maintained, abandoned and reclaimed to the satisfaction of applicable regulatory authorities. Occupational health and safety regulations establish standards protective of workers, both generally and within the pipeline industry.\nMany state and local governments where Boardwalk Pipelines operates also have, or are developing, similar environmental or occupational health and safety legal requirements governing many of the same types of activities, and those requirements can be more stringent than those adopted under federal laws and regulations. Failure to comply with these federal, state and local laws and regulations may result in the assessment of administrative, civil and criminal penalties, the imposition of corrective or remedial obligations, the incurrence of capital expenditures, the occurrence of delays, denials or cancellations in permitting or the development or expansion of projects and the issuance of orders enjoining performance of some or all of Boardwalk Pipelines’ operations in the affected areas.\nWhile the Biden Administration attempted to pursue additional actions to bolster environmental regulations, the future of these actions is uncertain. For example, the Biden Administration revised various rules to be more stringent, repealed various rules issued by the first Trump Administration, imposed restrictions on methane emissions from oil and gas operations and ground level ozone emission standards and took other actions to mitigate climate change and further limit greenhouse gas (“GHG”) emissions. In addition, in January 2023, the White House’s Council on Environmental Quality (“CEQ”) released guidance to assist federal agencies in assessing the GHG emissions and climate change effects of their proposed actions under the National Environmental Policy Act (“NEPA”). In May 2024, the CEQ published a final rule that, in the second and final “phase” of updates, revised the implementing regulations of the procedural provisions of NEPA and implemented amendments to NEPA included in the Fiscal Responsibility Act of 2023. The final rule was challenged by various states and the litigation remains ongoing. More recently, in November 2024, a panel of three judges \n12\nTable of Contents\non the U.S. Court of Appeals for the D.C. Circuit held that the CEQ lacks authority to issue NEPA regulations and followed with a statement by a majority of the judges suggesting that in future cases they may not rule similarly that the CEQ lacks rulemaking authority. In February 2025, the District Court for North Dakota also held that the CEQ lacks authority to issue NEPA regulations and vacated the CEQ’s 2024 “Phase 2” rule. Additionally, President Trump signed an energy-related Executive Order which included ordering the CEQ to propose rescinding its NEPA regulations. As a result, there is significant uncertainty with respect to current and future NEPA regulations. While Boardwalk Pipelines cannot predict the full impact of these developments, any legal challenges to NEPA reviews performed in connection with its projects may result in further permitting and approval delays. For more information, see Item 1A. Risk Factors of this Report.\nEnvironmental laws and regulations generally become stricter over time; however, Boardwalk Pipelines cannot predict how the recent change in presidential administrations will impact its regulatory obligations. Stricter environmental or worker safety laws, regulations or enforcement policies could significantly increase Boardwalk Pipelines’ operational or compliance costs and compliance with new or more stringent environmental legal requirements could delay or prohibit its ability to obtain permits for operations or require Boardwalk Pipelines to install additional pollution control equipment. For instance, the construction or expansion of pipelines often requires authorizations under the Clean Water Act, which authorizations may be subject to challenge. There is ongoing litigation with respect to the status and use of the U.S. Army Corps of Engineers (“the Corps”) Clean Water Act Section 404 Nationwide Permit (“NWP”) 12, which was issued in January 2021 and subsequently challenged by various environmental groups. Boardwalk Pipelines relies on NWP 12, alongside other NWPs, as blanket authority for construction, maintenance, repair and removal of pipelines. If NWP 12 is amended or revoked, Boardwalk Pipelines may be required to apply for one or more Individual Permits, which would require additional time and resources to obtain. The NWP process relies upon the Clean Water Act Section 401 certification process, which is also subject to ongoing litigation. In September 2023, the Environmental Protection Agency (“EPA”) finalized its Clean Water Act Section 401 Water Quality Certification Improvement Rule, effective in November 2023, which expanded the scope of certification authority. While the litigation is ongoing and the full extent and impact of these actions is unclear at this time, any disruption in Boardwalk Pipelines’ ability to obtain coverage under NWP 12 or other permits may result in increased costs and project delays if it is forced to seek individual permits from the Corps. There also continues to be uncertainty with respect to the federal government's jurisdictional reach under the Clean Water Act over “waters of the United States” (“WOTUS”), including wetlands, as the EPA and the Corps have pursued multiple rulemakings under different administrations since 2015 in an attempt to determine the scope of such reach. Most recently, in September 2023, the EPA issued a version of the WOTUS rule that, due to injunctions in certain states, is being implemented in only 24 states. Thus, the operative definition of WOTUS varies by state. However, Boardwalk Pipelines cannot predict what actions the Trump Administration may take with respect to any of these regulations and the timing with respect to the same. As a result, there is significant uncertainty with respect to wetlands regulation under the Clean Water Act at this time. \nHistorically, Boardwalk Pipelines’ environmental compliance costs have not had a material adverse effect on its business, but there can be no assurance that future compliance with existing requirements will not materially affect Boardwalk Pipelines, or that the current regulatory standards will not become more onerous in the future, resulting in more significant costs to maintain compliance and increased exposure to significant liabilities.\nClimate Change: \nClimate change continues to attract considerable public, governmental and scientific attention. As a result, numerous proposals have been made and are likely to continue to be made at the international, national, regional, state and local levels of government to monitor and limit emissions of GHGs. These efforts have included consideration of cap-and-trade programs, carbon taxes and GHG reporting and tracking programs, and regulations that directly limit GHG emissions from certain sources. Due to the nature of Boardwalk Pipelines’ business, its operations emit various types of GHGs. Boardwalk Pipelines seeks to carefully monitor its emissions and expects to incur additional costs to mitigate emissions. New legislation or regulations could increase the costs related to operating and maintaining its facilities. Depending on the particular law, regulation or program, Boardwalk Pipelines could be required to incur capital expenditures for installing new monitoring equipment or emission controls on its facilities, acquire and surrender allowances for GHG emissions, pay taxes or fees related to GHG emissions and/or administer and manage a more comprehensive GHG emissions program. While Boardwalk Pipelines may be able to include some or all of the increased costs in the rates charged by its pipelines, recovery of costs is not certain and would require the FERC’s approval of a rate mechanism designed to recover those costs.\nBoardwalk Pipelines recognizes that relative to certain other fossil fuels, natural gas has an important role in reducing GHG emissions and may act as a bridge to scaling up renewable energy or other alternative energy sources in the U.S. While Boardwalk Pipelines is seeking to reduce its GHG emissions, it cannot predict all risks that may be associated with climate change or other ESG matters. For more information, see Boardwalk Pipelines’ risk factor titled “\nBoardwalk \n13\nTable of Contents\nPipelines’ operations, and those of Boardwalk Pipelines’ customers, are subject to a series of risks regarding climate change” \nunder Item 1A.\nProperties: \nBoardwalk Pipelines is headquartered in leased office space located in Houston, Texas. Boardwalk Pipelines also leases office space in Owensboro, Kentucky. Boardwalk Pipelines’ operating subsidiaries own their respective pipeline systems in fee. However, substantial portions of these systems are constructed and maintained on property owned by others pursuant to rights-of-way, easements, permits, licenses or consents.\nLOEWS HOTELS HOLDING CORPORATION\nLoews Hotels Holding Corporation (together with its subsidiaries, “Loews Hotels & Co”) operates a chain of 25 hotels. Eleven of these hotels are owned by Loews Hotels & Co, twelve are owned by joint ventures in which Loews Hotels & Co has noncontrolling equity interests and two are managed for unaffiliated owners. Loews Hotels & Co’s earnings are derived from the operation of its owned hotels, its share of earnings in joint venture hotels and hotel management fees earned from both joint venture and managed hotels. Loews Hotels & Co accounted for \n5.3%\n, 5.4% and 5.1% of our consolidated total revenue for the years ended December 31, 2024, 2023 and 2022. The hotels are described below.\n14\nTable of Contents\nNumber of\nName and Location\nRooms\n \n \nOwned:\n \nLive! by Loews, Arlington, Texas*\n300\nLoews Arlington Hotel and Convention Center, Arlington, Texas\n888\nLoews Chicago Hotel, Chicago, Illinois\n400\nLoews Chicago O’Hare Hotel, Chicago, Illinois\n556\nLoews Coronado Bay Resort, Coronado, California\n440\nLoews Kansas City Hotel, Kansas City, Missouri\n800\nLoews Miami Beach Hotel, Miami Beach, Florida\n790\nLoews Philadelphia Hotel, Philadelphia, Pennsylvania\n581\nLoews Regency New York Hotel, New York, New York\n379\nLoews Vanderbilt Hotel, Nashville, Tennessee\n339\nLoews Ventana Canyon Resort, Tucson, Arizona*\n398\n \n \nJoint Venture:\n \nHard Rock Hotel at Universal Orlando, Orlando, Florida\n650\nLive! by Loews, St. Louis, Missouri\n216\nLoews Atlanta Hotel, Atlanta, Georgia\n414\nLoews Coral Gables Hotel, Coral Gables, Florida\n242\nLoews Hollywood Hotel, Hollywood, California\n628\nLoews Portofino Bay Hotel at Universal Orlando, Orlando, Florida\n750\nLoews Royal Pacific Resort at Universal Orlando, Orlando, Florida\n1,000\nLoews Sapphire Falls Resort at Universal Orlando, Orlando, Florida\n1,000\nUniversal Aventura Hotel, Orlando, Florida\n600\nUniversal Cabana Bay Beach Resort, Orlando, Florida\n2,200\nUniversal Endless Summer Resort – Dockside Inn and Suites, Orlando, Florida\n2,050\nUniversal Endless Summer Resort – Surfside Inn and Suites, Orlando, Florida\n750\n \n \nManaged:\n \nBisha Hotel and Residences, Toronto, Canada\n96\nLoews New Orleans Hotel, New Orleans, Louisiana\n285\n*\nLoews Hotels & Co has a controlling majority equity interest in this property.\nNote:    Five owned hotels and eight joint venture hotels are subject to land leases.\n15\nTable of Contents\nRecent Developments and Growth Projects:\n•\nIn 2024, Loews Hotels & Co completed the sale of Loews Minneapolis Hotel;\n•\nIn the first quarter of 2024, Loews Arlington Hotel and Convention Center in Arlington, Texas opened with 888 guestrooms and over 250,000 square feet of function space. In the fourth quarter of 2024, Loews Hotels & Co acquired the remaining outstanding noncontrolling interest in this property; \n•\nOn January 21, 2025, Universal Stella Nova Resort, a 750 guestroom hotel, opened. As with Loews Hotels & Co’s other properties at Universal Orlando, Loews Hotels & Co manages the hotel and has a noncontrolling joint venture equity interest in the hotel; and\n•\nIn 2025, Universal Terra Luna Resort, a 750 guestroom hotel, and Universal Helios Grand Hotel, a Loews Hotel, a 500 guestroom hotel, are expected to open at Universal Orlando. As with Loews Hotels & Co’s other properties at Universal Orlando, Loews Hotels & Co will serve as manager and have a noncontrolling joint venture equity interest in the hotels.\nProperties: \nLoews Hotels & Co’s principal executive offices are based in New York City, New York and it has a shared service center outside of Nashville, Tennessee. Loews Hotels & Co leases the office space in both of these locations.\n ALTIUM PACKAGING LLC\nAltium Packaging is a packaging solutions provider and manufacturer in North America. The business specializes in customized mid- and short-run packaging solutions, serving a diverse customer base in the pharmaceutical, dairy, household chemicals, food/nutraceuticals, industrial/specialty chemicals, water and beverage/juice industries. Altium Packaging develops, manufactures and markets a wide range of extrusion blow-molded and injection molded plastic containers. In addition, Altium Packaging manufactures commodity and differentiated plastic resins from recycled plastic materials. Altium Packaging sells its products throughout North America and its customers include a diverse customer base of many nationally recognized branded food, beverage, consumer products and pharmaceutical companies.\nHUMAN CAPITAL\nIncluding our consolidated subsidiaries, we employed approximately 13,000 persons at December 31, 2024. CNA employed approximately 6,500 persons. Boardwalk Pipelines employed approximately 1,300 persons, approximately 100 of whom were covered under collective bargaining agreements. Loews Hotels & Co employed approximately 5,100 persons, approximately 850 of whom were covered under collective bargaining agreements. We and our consolidated subsidiaries believe we have satisfactory labor relations. Separately, unconsolidated entities employ approximately 5,900 persons at properties managed by Loews Hotels & Co and approximately 4,000 persons at Altium Packaging.\nWe and our subsidiaries understand that seeking to hire qualified people and cultivate an engaging workplace is critical to our businesses’ long-term strategic success. Each of us has programs in place that are designed to help employees build their knowledge, skills and experience, as well as to guide their career development. We believe that by employing individuals with different backgrounds and experiences, we can better meet the diverse needs of our stakeholders.\nWe and our subsidiaries offer compensation and benefits packages that we believe are appropriate to each of our businesses. These packages may include 401k and other retirement plans, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off and family assistance programs, including paid family leave. We and CNA also offer stock-based compensation to certain management and other senior personnel as a way to align their interests with shareholders and attract and retain key talent.\n16\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nFirst\nBecame\nName\nPosition and Offices Held\nAge\nExecutive Officer\nMarc A. Alpert\nSenior Vice President, General Counsel and Secretary\n62\n2016\nRichard W. Scott\nSenior Vice President and Chief Investment Officer\n71\n2009\nKenneth I. Siegel\nSenior Vice President\n68\n2009\nAlexander H. Tisch\nVice President, Loews Corporation; President and Chief Executive Officer, Loews Hotels & Co\n46\n2023\nBenjamin J. Tisch\nPresident and Chief Executive Officer\n42\n2022\nJane J. Wang\nSenior Vice President and Chief Financial Officer\n43\n2022\nEach of Marc A. Alpert, Richard W. Scott and Kenneth I. Siegel has served in his current role at Loews Corporation for at least the past five years. \nAlexander H. Tisch has served as Vice President, Loews Corporation, since 2014. He has also served as an officer of Loews Hotels & Co since June 2017, where he was Executive Vice President, Chief Commercial and Development Officer from June 2017 until September 2020, President from September 2020 until December 2022, and President and Chief Executive Officer since January 2023.\nBenjamin J. Tisch served as a Vice President of Loews Corporation from 2014 until May 2022, as Senior Vice President, Corporate Development and Strategy of Loews Corporation from May 2022 until December 2024 and in his current role since January 2025.\nJane J. Wang served as a Vice President of Loews Corporation from 2014 until assuming her current role in May 2022.\nBenjamin J. Tisch is the son of James S. Tisch, Chairman of our Board, and the cousin of Alexander H. Tisch. Alexander H. Tisch is the nephew of James S. Tisch. None of our other executive officers or directors are related to any other. However, Andrew H. Tisch, a former director and current director emeritus, is the father of Alexander H. Tisch and the brother of James S. Tisch, and Jonathan M. Tisch, a former director and current director emeritus, is the cousin of Andrew H. Tisch and James S. Tisch.\nOfficers are elected annually and hold office until their successors are elected and qualified, and are subject to removal by the Board of Directors.\nAVAILABLE INFORMATION\nOur website address is www.loews.com. We make available, free of charge, through our website our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports, filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, as soon as reasonably practicable after these reports are electronically filed with or furnished to the SEC. Copies of our Code of Business Conduct and Ethics, Corporate Governance Guidelines, Audit Committee charter, Compensation Committee charter and Nominating and Governance Committee charter are also available on our website. Information on or accessible through our website is not incorporated by reference into this Report. This Annual Report on Form 10-K and our other SEC filings are also accessible through the SEC’s website at www.sec.gov.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOVERVIEW\nLoews Corporation is a holding company and has four reportable segments comprised of three individual consolidated operating subsidiaries, CNA Financial Corporation (“CNA”), Boardwalk Pipeline Partners, LP (“Boardwalk Pipelines”) and Loews Hotels Holding Corporation (“Loews Hotels & Co”); and the Corporate segment. The Corporate segment is primarily comprised of Loews Corporation, excluding its consolidated operating subsidiaries, and the equity method of accounting for Altium Packaging LLC (“Altium Packaging”), an unconsolidated subsidiary.\nUnless the context otherwise requires, as used herein, the term “Company” means Loews Corporation including its  subsidiaries, the terms “Parent Company,” “we,” “our,” “us” or like terms mean Loews Corporation excluding its subsidiaries and the term “Net income (loss) attributable to Loews Corporation” means Net income (loss) attributable to Loews Corporation shareholders.\nWe rely upon our invested cash balances and distributions from our subsidiaries to generate the funds necessary to meet our obligations and to declare and pay any dividends to our shareholders. The ability of our subsidiaries to pay dividends is subject to, among other things, the availability of sufficient earnings and funds in such subsidiaries, applicable state laws, including in the case of the insurance subsidiaries of CNA, laws and rules governing the payment of dividends by regulated insurance companies (see Note 15 of the Notes to Consolidated Financial Statements included under Item 8) and compliance with covenants in their respective loan agreements. Claims of creditors of our subsidiaries will generally have priority as to the assets of such subsidiaries over our claims and those of our creditors and shareholders. We are not responsible for the liabilities and obligations of our subsidiaries and there are no Parent Company guarantees.\nThe following discussion should be read in conjunction with Item 1A, Risk Factors, and Item 8, Financial Statements and Supplementary Data of this Form 10-K. For \na discussion of changes in results of operations comparing the years ended December 31, 2023 and 2022 for Loews Corporation and its subsidiaries see Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 6, 2024.\nRESULTS OF OPERATIONS\nConsolidated Financial Results\nThe following table summarizes net income (loss) attributable to Loews Corporation by segment and the basic and diluted net income per share attributable to Loews Corporation for the years ended December 31, 2024 and 2023:\nYear Ended December 31\n2024\n2023\n(In millions, except per share data)\n \n \n \n \n \nCNA Financial\n$\n879\n \n$\n1,094 \nBoardwalk Pipelines\n413\n \n283 \nLoews Hotels & Co\n70\n \n147 \nCorporate\n52\n \n(90)\nNet income attributable to Loews Corporation\n$\n1,414\n \n$\n1,434 \n \n \n \nBasic net income per share\n$\n6.42\n \n$\n6.30 \n \n \nDiluted net income per share\n$\n6.41\n \n$\n6.29 \n2024 Compared with 2023\nNet income attributable to Loews Corporation for 2024 was $1.4 billion, or $6.41 diluted net income per share, compared to net income attributable to Loews Corporation of \n$1.4 billion, or $6.29 diluted net income per share, in 2023. \n47\nTable of Contents\nNet income attributable to Loews Corporation for 2024 includes a $265 million after-tax and noncontrolling interests pension settlement charge for CNA.  \nExcluding CNA’s pension charge, net income attributable to Loews Corporation increased by 17% in 2024 compared to \n2023 due to increases in net income at CNA and Boardwalk Pipelines and increased net investment income at the parent company, partially offset by a decrease in net income at Loews Hotels & Co. The increase at CNA is primarily due to higher \nnet investment income driven by favorable returns from limited partnership and common stock investments and higher income from fixed income securities as a result of a larger invested asset base and favorable reinvestment rates and improved underlying underwriting results, partially offset by higher catastrophe losses. Boardwalk Pipelines’ results improved due to increased transportation revenues from higher re-contracting rates and recently completed growth projects, increased storage and parking and lending revenues and the contribution from the acquisition of Williams Olefins Pipeline Holdco LLC (“Bayou Ethane”) in 2023. Higher net investment income at the parent company is due to higher returns on equity securities. These increases were partially offset by lower net income at Loews Hotels & Co primarily due to higher depreciation and interest expenses related to the opening of the Loews Arlington Hotel and Convention Center in the first quarter of 2024 and lower equity income from joint ventures. In addition, Loews Hotels & Co’s results for 2023 included a gain of $36 million related to the acquisition of an additional equity interest in, and the consolidation of, a previously unconsolidated joint venture property. \nCNA Financial\nThe following table summarizes the results of operations for CNA for the years ended December 31, 2024 and 2023 as presented in Note\n \n20 of the Notes to Consolidated Financial Statements included under Item 8. For further discussion of Net investment income and Investment gains (losses), see the Investments section of this MD&A.\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nInsurance premiums\n$\n10,211\n \n$\n9,480 \nNet investment income\n2,497\n \n2,264 \nInvestment losses\n(81)\n(99)\nNon-insurance warranty revenue\n1,609\n \n1,624 \nOther revenues\n34\n \n30 \nTotal\n14,270\n \n13,299 \nExpenses:\n \n \nInsurance claims and policyholders’ benefits\n7,738\n \n7,068 \nAmortization of deferred acquisition costs\n1,798\n \n1,644 \nNon-insurance warranty expense\n1,547\n \n1,544 \nOther operating expenses\n1,843\n \n1,398 \nInterest\n133\n \n127 \nTotal\n13,059\n \n11,781 \nIncome before income tax\n1,211\n \n1,518 \nIncome tax expense\n(252)\n(313)\nNet income\n959\n \n1,205 \nAmounts attributable to noncontrolling interests\n(80)\n(111)\nNet income attributable to Loews Corporation\n$\n879\n \n$\n1,094 \n2024 Compared with 2023\nNet income attributable to Loews Corporation decreased $215 million for \n2024\n as compared with 2023. The decrease was \nprimarily due to a pension settlement charge of $265 million after-tax and noncontrolling interests and higher catastrophe losses, partially offset by higher net investment income driven by favorable returns from limited partnership and common stock investments and higher income from fixed income securities as a result of a larger invested asset base \n48\nTable of Contents\nand favorable reinvestment rates and improved underlying underwriting results. For more information on the pension settlement charge see\n Note 16 of the Notes to Consolidated Financial Statements included under Item 8.\nCNA’s Property & Casualty and Other Insurance Operations\nCNA’s commercial property and casualty insurance operations (“Property & Casualty Operations”) include its Specialty, Commercial and International lines of business. CNA’s Other Insurance Operations outside of Property & Casualty Operations include its long-term care business that is in run-off, certain corporate expenses, including interest on CNA’s corporate debt, and the results of certain property and casualty businesses in run-off, including CNA Re, asbestos and environmental pollution (“A&EP”), a legacy portfolio of excess workers’ compensation (“EWC”) policies and certain legacy mass tort reserves. CNA’s products and services are primarily marketed through independent agents, brokers and managing general underwriters to a wide variety of customers, including small, medium and large businesses, insurance companies, associations, professionals and other groups. We believe the presentation of CNA as one reportable segment is appropriate in accordance with applicable accounting standards on segment reporting. However, for purposes of this discussion and analysis of the results of operations, we provide greater detail with respect to CNA’s Property & Casualty Operations and Other Insurance Operations to enhance the reader’s understanding and to provide further transparency into key drivers of CNA’s financial results.\nIn assessing its insurance operations, CNA utilizes the core income (loss) financial measure. Core income (loss) is calculated by excluding investment gains or losses and gains or losses resulting from pension settlement transactions from net income (loss). In addition, core income (loss) excludes the effects of noncontrolling interests. The calculation of core income (loss) excludes investment gains or losses because they are generally driven by economic factors that are not necessarily reflective of CNA’s primary insurance operations. The calculation of core income (loss) excludes gains or losses resulting from pension settlement transactions as they result from decisions regarding CNA’s defined benefit pension plans which are unrelated to its primary insurance operations. Core income (loss) is deemed to be a non-GAAP financial measure and management believes some investors may find this measure useful to evaluate CNA’s insurance operations. Please see the non-GAAP reconciliation of net income (loss) to core income (loss) in this MD&A.\nIn evaluating the results of Property & Casualty Operations, CNA utilizes the loss ratio, the underlying loss ratio, the expense ratio, the dividend ratio, the combined ratio and the underlying combined ratio. These ratios are calculated using GAAP financial results. The loss ratio is the percentage of net incurred claim and claim adjustment expenses to net earned premiums. The underlying loss ratio excludes the impact of catastrophe losses and development-related items from the loss ratio. Development-related items represent net prior year loss reserve and premium development, and includes the effects of interest accretion and change in allowance for uncollectible reinsurance and deductible amounts. The expense ratio is the percentage of insurance underwriting and acquisition expenses, including the amortization of deferred acquisition costs, to net earned premiums. The dividend ratio is the ratio of policyholders’ dividends incurred to net earned premiums. The combined ratio is the sum of the loss ratio, the expense ratio and the dividend ratio. The underlying combined ratio is the sum of the underlying loss ratio, the expense ratio and the dividend ratio. The underlying loss ratio and the underlying combined ratio are deemed to be non-GAAP financial measures, and management believes some investors may find these ratios useful to evaluate CNA’s underwriting performance since they remove the impact of catastrophe losses which are unpredictable as to timing and amount, and development-related items as they are not indicative of current year underwriting performance.\nChanges in estimates of claim and claim adjustment expense reserves, net of reinsurance, for prior years are defined as net prior year loss reserve development within this MD&A. These changes can be favorable or unfavorable. Net prior year loss reserve development does not include the effect of any related acquisition expenses. Further information on CNA’s reserves is provided in Note 8 of the Notes to Consolidated Financial Statements included under Item 8.\nIn addition, renewal premium change, rate, retention and new business are also utilized in evaluating operating trends. Renewal premium change represents the estimated change in average premium on policies that renew, including rate and exposure changes. Rate represents the average change in price on policies that renew excluding exposure change. Exposure represents the measure of risk used in the pricing of the insurance product. The change in exposure represents the change in premium dollars on policies that renew as a result of the change in risk of the policy. Retention represents the percentage of premium dollars renewed, excluding rate and exposure changes, in comparison to the expiring premium dollars from policies available to renew. New business represents premiums from policies written with new customers and additional policies written with existing customers. Gross written premiums, excluding third-party captives, excludes business which is ceded to third-party captives, including business related to large warranty programs. \nCNA also uses underwriting gain (loss) and underlying underwriting gain (loss), calculated using GAAP financial results, to monitor insurance operations. Underwriting gain (loss) is deemed to be a non-GAAP financial measure and is calculated pretax as net earned premiums less total insurance expenses, which includes insurance claims and policyholders’ \n49\nTable of Contents\nbenefits, amortization of deferred acquisition costs and insurance related administrative expenses. Net income (loss) is the most directly comparable GAAP measure. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities which are managed separately from its investing activities. Underlying underwriting gain (loss) is also deemed to be a non-GAAP financial measure, and represents pretax underwriting gain (loss) excluding catastrophe losses and development-related items. Management believes some investors may find this measure useful to evaluate the profitability, before tax, derived from CNA’s underwriting activities, excluding the impact of catastrophe losses which are unpredictable as to timing and amount, and development-related items as they are not indicative of CNA’s current year underwriting performance.\nThe following tables present a reconciliation of net income attributable to Loews Corporation to core income (loss), underwriting gain (loss) and underlying underwriting gain (loss) for t\nhe years \nended \nDecember 31, 2024\n and \n2023\n:\n50\nTable of Contents\nYear Ended December 31, 2024\nSpecialty\nCommercial\nInternational\nProperty & Casualty\nOther Insurance Operations\nTotal\n(In millions)\nNet income (loss) attributable to Loews Corporation\n$\n608\n \n$\n603\n \n$\n140\n \n$\n1,351\n \n$\n(472)\n$\n879\n \nInvestment (gains) losses\n31\n \n44\n \n \n75\n \n(11)\n64\n \nPension settlement losses\n \n293\n \n293\n \nNoncontrolling interests\n55\n \n55\n \n13\n \n123\n \n(43)\n80\n \nCore income (loss)\n$\n694\n \n$\n702\n \n$\n153\n \n$\n1,549\n \n$\n(233)\n$\n1,316\n \nLess:\nNet investment income\n626\n \n733\n \n131\n \n1,490\n \nNon-insurance warranty revenue\n62\n \n \n \n62\n \nOther expense, including interest expense\n(53)\n(14)\n(10)\n(77)\nIncome tax expense on core income\n(190)\n(188)\n(44)\n(422)\nUnderwriting gain\n249\n \n171\n \n76\n \n496\n \nEffect of catastrophe losses\n \n318\n \n40\n \n358\n \nEffect of favorable development-related items\n(8)\n \n(6)\n(14)\nUnderlying underwriting gain\n$\n241\n \n$\n489\n \n$\n110\n \n$\n840\n \nYear Ended December 31, 2023\nNet income (loss) attributable to Loews Corporation\n$\n605 \n$\n539 \n$\n133 \n$\n1,277 \n$\n(183)\n$\n1,094 \nInvestment (gains) losses\n42 \n58 \n(2)\n98 \n(19)\n79 \nNoncontrolling interests\n61 \n55 \n14 \n130 \n(19)\n111 \nCore income (loss)\n$\n708 \n$\n652 \n$\n145 \n$\n1,505 \n$\n(221)\n$\n1,284 \nLess:\nNet investment income\n558 \n645 \n103 \n1,306 \nNon-insurance warranty revenue\n80 \n \n \n80 \nOther revenue (expense), including interest expense\n(52)\n(1)\n4 \n(49)\nIncome tax expense on core income\n(195)\n(174)\n(48)\n(417)\nUnderwriting gain\n317 \n182 \n86 \n585 \nEffect of catastrophe losses\n \n207 \n29 \n236 \nEffect of (favorable) unfavorable development-related items\n(12)\n(4)\n13 \n(3)\nUnderlying underwriting gain\n$\n305 \n$\n385 \n$\n128 \n$\n818 \n51\nTable of Contents\nProperty & Casualty Operations\nThe following tables summarize the results of CNA’s Property & Casualty Operations and provides the components to reconcile the combined ratio and loss ratio to the underlying combined ratio and underlying loss ratio for the years ended December 31, 2024 and 2023.\nYear Ended December 31, 2024\nSpecialty\n \nCommercial\n \nInternational\n \nTotal\n \n(In millions, except %)\n \n \n \n \n \n \n \n \n \nGross written premiums\n$\n6,932\n \n$\n6,964\n \n$\n1,483\n \n$\n15,379\n \nGross written premiums excluding third-party captives\n3,895\n \n6,816\n \n1,483\n \n12,194\n \nNet written premiums\n3,445\n \n5,469\n \n1,262\n \n10,176\n \nNet earned premiums\n3,361\n \n5,158\n \n1,256\n \n9,775\n \nUnderwriting gain\n249\n \n171\n \n76\n \n496\n \nNet investment income\n626\n \n733\n \n131\n \n1,490\n \nCore income\n694\n \n702\n \n153\n \n1,549\n \n \nOther performance metrics:\nLoss ratio\n59.5\n \n%\n68.3\n \n%\n60.9\n \n%\n64.3\n \n%\nExpense ratio\n32.8\n \n27.9\n \n33.1\n \n30.2\n \nDividend ratio\n0.3\n \n0.5\n \n0.4\n \nCombined ratio\n92.6\n \n%\n96.7\n \n%\n94.0\n \n%\n94.9\n \n%\nLess: Effect of catastrophe impacts\n6.2\n \n3.2\n \n3.6\n \nLess: Effect of favorable development-related items\n(0.3)\n(0.1)\n(0.4)\n(0.2)\nUnderlying combined ratio\n92.9\n \n%\n90.6\n \n%\n91.2\n \n%\n91.5\n \n%\nUnderlying loss ratio\n59.8\n \n%\n62.2\n \n%\n58.1\n \n%\n60.9\n \n%\n \nRate\n1\n \n%\n6\n \n%\n(1)\n%\n4\n \n%\nRenewal premium change\n2\n \n7\n \n5\n \nRetention\n89\n \n84\n \n82\n \n85\n \nNew business\n$\n462\n \n$\n1,512\n \n$\n288\n \n$\n2,262\n \nYear Ended December 31, 2023\n \n \n \n \nGross written premiums\n$\n7,113 \n$\n6,120 \n$\n1,485 \n$\n14,718 \nGross written premiums excluding third-party captives\n3,800 \n5,994 \n1,485 \n11,279 \nNet written premiums\n3,329 \n4,880 \n1,237 \n9,446 \nNet earned premiums\n3,307 \n4,547 \n1,176 \n9,030 \nUnderwriting gain\n317 \n182 \n86 \n585 \nNet investment income\n558 \n645 \n103 \n1,306 \nCore income\n708 \n652 \n145 \n1,505 \n \nOther performance metrics:\nLoss ratio\n58.2 \n%\n65.9 \n%\n61.4 \n%\n62.5 \n%\nExpense ratio\n32.0 \n29.6 \n31.2 \n30.7 \nDividend ratio\n0.2 \n0.5 \n0.3 \nCombined ratio\n90.4 \n%\n96.0 \n%\n92.6 \n%\n93.5 \n%\nLess: Effect of catastrophe impacts\n4.5 \n2.5 \n2.6 \nLess: Effect of (favorable) unfavorable development- \nrelated items\n(0.3)\n(0.1)\n1.1 \nUnderlying combined ratio\n90.7 \n%\n91.6 \n%\n89.0 \n%\n90.9 \n%\nUnderlying loss ratio\n58.5 \n%\n61.5 \n%\n57.8 \n%\n59.9 \n%\n \nRate\n \n7 \n%\n3 \n%\n5 \n%\nRenewal premium change\n1 \n%\n10 \n6 \n7 \nRetention\n88 \n84 \n83 \n85 \nNew business\n$\n481 \n$\n1,297 \n$\n302 \n$\n2,080 \n52\nTable of Contents\n2024 Compared with 2023\nGross written premiums, excluding third-party captives, for Specialty increased $95 million in \n2024\n as compared with 2023 driven by retention and favorable renewal premium change. Net written premiums for Specialty increased $116 million in \n2024\n as compared with 2023. The increase in net earned premiums was consistent with the trend in net written premiums for Specialty. \nGross written premiums for Commercial increased $844 million in \n2024\n as compared with 2023 driven by favorable renewal premium change, rate and higher new business. Net written premiums for Commercial increased $589 million in \n2024\n as compared with 2023. The increase in net earned premiums was consistent with the trend in net written premiums for Commercial.\nGross written premiums for International decreased $2 million in \n2024\n as compared with 2023. \nExcluding the effect of foreign currency exchange rates, gross written premiums decreased $14 million driven by lower new business and rate. \nNet written premiums for International increased $25 million in \n2024\n as compared with 2023. \nExcluding the effect of foreign currency exchange rates, net written premiums increased $21 million in 2024 as compared with \n2023\n driven by favorable adjustments on prior year reinsurance treaties, in the current year. \nThe increase in net earned premiums was consistent with the trend in net written premiums for International.\nCore income increased $44 million in \n2024\n as compared with 2023 driven by higher net investment income and improved underlying underwriting results, partially offset by higher catastrophe losses. \nCatastrophe losses were $358 million in \n2024\n as compared with $236 million in 2023, primarily driven by severe weather related events, including $71 million for Hurricane Helene and $33 million for Hurricane Milton in 2024. For \n2024\n and 2023, Specialty had no catastrophe losses, Commercial had catastrophe losses of $318 million and $207 million and International had catastrophe losses of $40 million and $29 million.\nFavorable net prior year loss reserve development of $31 million and $23 million was recorded in \n2024\n and 2023. In \n2024\n and 2023, Specialty recorded favorable net prior year loss reserve development of $9 million and $14 million, Commercial recorded favorable net prior year loss reserve development of $16 million and $22 million and International recorded favorable net prior year loss reserve development of $6 million and unfavorable net prior year loss reserve development of $13 million. Further information on net prior year loss reserve development is included in Note 8 of the Notes to Consolidated Financial Statements included under Item 8.\nSpecialty’s combined ratio increased 2.2 points in \n2024\n as compared with 2023 primarily due to a 1.3 point increase in the loss ratio and a 0.8 point increase in the expense ratio. The increase in the loss ratio was primarily due to an increase in the underlying loss ratio, primarily driven by continued pricing pressure in management liability lines over the last several quarters. The increase in the expense ratio was driven by lower net earned premium growth.\nCommercial’s combined ratio increased 0.7 points in \n2024\n as compared with 2023 due to a 2.4 point increase in the loss ratio partially offset by a 1.7 point improvement in the expense ratio.  The increase in the loss ratio was primarily driven by higher catastrophe losses, which were 6.2 points of the loss ratio in \n2024, \nas compared with 4.5 points of the loss ratio in 2023 and an increase in the underlying loss ratio, driven by the continuation of elevated loss cost trends in commercial auto and mix of business. The improvement in the expense ratio was primarily driven by higher net earned premiums.\nInternational’s combined ratio increased 1.4 points in \n2024\n as compared with 2023 due to a 1.9 point increase in the expense ratio partially offset by a 0.5 point improvement in the loss ratio. The increase in the expense ratio was driven by higher employee related costs and a favorable reinsurance acquisition related catch-up adjustment recorded in the prior year, partially offset by higher net earned premiums. The improvement in the loss ratio was primarily driven by favorable net prior year loss reserve development, partially offset by higher catastrophe losses. Catastrophe losses were 3.2 points of the loss ratio for \n2024\n, as compared with 2.5 points of the loss ratio for 2023. \n53\nOther Insurance Operations\nThe following table summarizes the results of CNA’s Other Insurance Operations for the years ended December 31, 2024 and 2023.\nYears Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nNet earned premiums\n$\n437\n \n$\n451 \nNet investment income\n1,007\n \n958 \nCore loss\n(233)\n(221)\n2024 Compared with 2023\nCore results decreased by $12 million in \n2024\n as compared with 2023. Results in 2024\n include higher corporate expenses as a result of continued investments in technology and an unfavorable non-economic impact related to the A&EP loss portfolio transfer (“LPT”). Results in 2024 also include a $62 million after-tax charge related to unfavorable net prior year loss reserve development for legacy mass tort claims as compared with a $56 million after-tax charge for legacy mass tort claims in 2023. Both years are inclusive of assumption updates as a result of the annual reserve review completed in the third quarter of each year. These decreases were partially offset by higher net investment income.\nThe application of retroactive reinsurance accounting to additional cessions to the A&EP LPT resulted in an after-tax charge of $6 million in 2024 compared to an after-tax benefit of $6 million in 2023, both of which have no economic impact. Further information on the A&EP LPT and net prior year loss reserve development is included in Note 8 of the Notes to Consolidated Financial Statements included under Item 8.\nThe cash flow assumption updates from the annual reserve review for 2024 and 2023 resulted in a pretax increase in long-term care reserves of $15 million and $8 million. The annual structured settlement reserve review resulted in a pretax reduction in claim reserves of $9 million and $6 million for 2024 and 2023.\n In addition, results in 2024 include a $16 million after-tax charge related to office consolidation as compared with a $19 million after-tax charge in 2023.\nBoardwalk Pipelines\nOverview\nBoardwalk Pipelines operates in the midstream portion of the natural gas and natural gas liquids (“NGLs”) industry, providing transportation and storage for those commodities. It also provides ethane supply and transportation services for industrial customers in Louisiana and Texas. Boardwalk Pipelines is not in the business of buying and selling natural gas and NGLs other than for system management purposes and to facilitate its ethane supply operations, but changes in natural gas and NGLs prices may impact the volumes of natural gas or NGLs transported and stored by its customers or the ethane supply requirements on its systems. \nThe pricing contained in the purchase and sales agreements associated with the supply services is generally based on the same ethane commodity index, plus a fixed delivery fee. Except for possible timing differences that may occur when volumes are purchased in one month and sold in another month, Boardwalk Pipelines’ ethane supply services, like its other businesses, have little to no direct commodity price exposure. \nDue to the capital-intensive nature of its business, Boardwalk Pipelines’ operating costs and expenses do not vary significantly based upon the volume of products transported, with the exception of \ncosts recorded in costs associated with service revenues. For further information on Boardwalk Pipelines’ revenue recognition policies see Note 1 of the \nNotes to Consolidated Financial Statements included under Item 8. Boardwalk Pipelines’ operations and maintenance expenses are impacted by its compliance with the requirements of, among other regulations, the Pipeline and Hazardous Materials Safety Administration Mega Rule (“Mega Rule”) and Boardwalk Pipelines’ efforts to monitor, control and reduce emissions, as further discussed below. \nBoardwalk Pipelines acquired \nWilliams Olefins Pipeline Holdco LLC (“Bayou Ethane”) \nin September 2023 and began providing ethane supply and transportation services. For more information see Note 2 of the Notes to Consolidated Financial Statements included under Item 8.\n54\nTable of Contents\nFirm Agreements\nA substantial portion of Boardwalk Pipelines’ transportation and storage capacity is contracted for under firm agreements. For the year ended December 31, 2024, approximately 86% of Boardwalk Pipelines’ revenues were derived from capacity reservation fees under firm contracts or from contracts with minimum volume commitments. The table below shows a rollforward of projected operating revenues under committed firm agreements in place as of December 31, 2023 to December 31, 2024, including agreements for transportation, storage, ethane supply and other services, over the remaining term of those agreements:\nAs of December 31, 2024\n \n(In millions)\n \n \n \nTotal projected operating revenues under committed firm agreements as of December 31, 2023\n$\n9,672 \nAdjustments for:\n \nActual revenues recognized from firm agreements in 2024 (a)\n(1,504)\nFirm agreements entered into in 2024\n6,016 \nTotal projected operating revenues under committed firm agreements as of December 31, 2024\n$\n14,184 \n(a)\nReflects an increase of $114 million in Boardwalk Pipelines’ actual 2024 revenues recognized from fixed fees under firm agreements as compared with its expected 2024 revenues from fixed fees under firm agreements, including agreements for transportation, storage and other services as of December 31, 2023, primarily due to an increase from contract renewals at higher rates that occurred in 2024.\nDuring \n2024\n, Boardwalk Pipelines entered into $6.0 billion of new firm agreements, of which approximately 78% were associated with new growth projects executed in \n2024. For firm agreements associated with new growth projects, the associated assets may\n not be placed into commercial service until sometime in the future. Further, the table above includes $3.8 billion of estimated revenues that are anticipated under executed precedent transportation agreements for growth projects that are subject to regulatory approvals. Each year, a portion of Boardwalk Pipelines’ firm transportation and storage agreements expire. The rates Boardwalk Pipelines is able to charge customers are heavily influenced by market trends (both short and longer term), including the available supply, geographical location of natural gas production, the competition between producing basins, competition with other pipelines for supply and markets, the demand for gas by end-users such as electric power generators, petrochemical facilities and LNG export facilities and the price differentials between the gas supplies and the market demand for the gas (basis differentials). As of December 31, 2024, Boardwalk Pipelines’ top ten customers under committed firm agreements comprised approximately 62% of its total projected operating revenues and the credit profile associated with Boardwalk Pipelines’ customers comprising the total projected operating revenues under committed firm agreements was 82% rated as investment grade, 3% rated as non-investment grade and 15% not rated.\nPipeline System Maintenance and Greenhouse Gases (“GHGs”) Emission Reduction Initiatives\nBoardwalk Pipelines incurs substantial costs for ongoing maintenance of its pipeline systems and related facilities, including those incurred for pipeline integrity management activities, equipment overhauls, general upkeep and repairs. These costs are not dependent on the amount of revenues earned from its transportation services. \nPHMSA has developed regulations that require transportation pipeline operators to implement integrity management programs to comprehensively evaluate certain high-risk areas, known as HCAs, and MCAs, along pipelines and take additional safety measures to protect people and property in these areas. The HCAs for natural gas pipelines are predicated on high-population density areas (which, for natural gas transmission lines, include Class 3 and 4 areas and, depending on the potential impacts of a risk event, may include Class 1 and 2 areas) whereas HCAs along Boardwalk Pipelines’ NGLs pipelines are based on high-population density areas, areas near certain drinking water sources and unusually sensitive ecological areas.\n These regulations have resulted in an overall increase in Boardwalk Pipelines’ ongoing maintenance costs, including maintenance capital and maintenance expense. \nPHMSA has issued a series of significant rulemakings for onshore gas transmission pipelines (e.g., relating to MAOP reconfirmation and exceedance reporting, the integrity assessment of additional pipeline mileage and the consideration of seismicity as a risk factor in integrity management). In August 2022, PHMSA published a final rule that attempted to expand the Management of Change process, corrosion control requirements for gas transmission pipelines, requirements that operators ensure no conditions exist following an extreme weather event that could adversely affect the safe operation of the pipeline, and repair criteria for non-HCAs. Five safety standards included in that rule were challenged by industry trade groups, and in August 2024, the U.S. Court of Appeals for the D.C. Circuit struck down four of the five challenged safety standards. In September 2023, PHMSA published a proposed rule that, if finalized, would \n55\nTable of Contents\nenhance the safety requirements for gas distribution pipelines and would require updates to distribution integrity management programs, emergency response plans, operations and maintenance manuals and other safety practices.\nDue to the nature of Boardwalk Pipelines’ business, its operations emit various types of GHGs. Boardwalk Pipelines seeks to monitor its emissions and expects to incur additional costs to mitigate emissions. New legislation or regulations could increase the costs related to operating and maintaining Boardwalk Pipelines’ facilities. Depending on the particular law, regulation or program, Boardwalk Pipelines could be required to incur capital expenditures for installing new monitoring equipment or emission controls on its facilities, acquire and surrender allowances for GHG emissions, pay taxes or fees related to GHG emissions and/or administer and manage a more comprehensive GHG emissions program.\nBoardwalk Pipelines has been focused on seeking to meet and, in certain instances, pursuing projects aimed at exceeding regulatory obligations (such as those found in the Clean Air Act (“CAA”)) by working to reduce emissions of regulated air pollutants, including methane, associated with its pipeline transportation and storage assets. For example, when selecting new compression equipment for growth or asset reliability projects, Boardwalk Pipelines considers air emissions as a component in the decision-making process and, when appropriate, places increased emphasis on equipment with emissions performance that exceeds applicable federal standards. Several of Boardwalk Pipelines’ reliability projects over the last few years have resulted in the replacement of older, higher-emitting compressor drivers with units equipped with advanced emission control systems. As a result, these projects have resulted in decreases in emissions of nitrogen oxides and other air pollutants. \nBoardwalk Pipelines has identified the reduction of GHG emissions as an area of focus and looks for opportunities to reduce emissions using a variety of strategies, including the following:\n•\nevaluating replacing older compression equipment with electric drive compression or new low emission, fuel efficient units when practical;\n•\nmodifying fuel systems on certain reciprocating compression equipment to lower fuel consumption and emissions;\n•\nconducting emissions surveys and performing maintenance and repairs on identified component leaks;\n•\nperforming annual leak surveys along Boardwalk Pipelines’ pipelines with the aid of helicopters and fixed-wing planes, and analytical field surveys when appropriate;\n•\nperforming measurement surveys on all of Boardwalk Pipelines’ compressor stations at least twice a year, exceeding Environmental Protection Agency (“EPA”) requirements; \n•\nusing optical gas imaging cameras to scan natural gas piping and components at Boardwalk Pipelines’ compressor stations to visualize any leaks in real time;\n•\ninstalling continuous monitoring emission detection equipment at certain compression stations;\n•\nemploying experts in air emissions to develop and monitor efforts in reducing emissions;\n•\nreducing methane emissions vented to the atmosphere from transmission pipeline blowdowns by using existing and portable compression and flaring when feasible;\n•\ninstalling repair sleeves and composite wraps where appropriate and practical to avoid pipeline blowdowns;\n•\nevaluating software tools to optimize our GHG emissions management system;\n•\nexploring options to replace high-bleed natural gas pneumatic devices with low or zero flow bleed devices; and\n•\nreducing methane emissions from rod packing seals on reciprocating compressors, where appropriate and practical.\nHowever, Boardwalk Pipelines cannot guarantee that it will be able to implement any of the opportunities it may review or explore, or, for any opportunities it chooses to implement, to implement them in their intended manner or within a specific timeframe or across all operational assets.\nThese new and any future regulations adopted by PHMSA and efforts to reduce GHG emissions are expected to cause Boardwalk Pipelines’ capital and operating costs to increase in 2025 and in future years, may cause Boardwalk Pipelines to experience operational delays and may result in potential adverse impacts to its ability to reliably serve its customers. For more information, see Item 1. Business and Item 1A. Risk Factors of this Report.\n56\nTable of Contents\nMaintenance costs may be capitalized or expensed, depending on the nature of the activities. For any given reporting period, the mix of projects that Boardwalk Pipelines undertakes will affect the amounts it records as property, plant and equipment on the Consolidated Balance Sheets or recognizes as expenses, which impact earnings. Boardwalk Pipelines began incurring costs to implement the Mega Rule’s requirements in 2021, and based on its current projections, it believes that these costs have stabilized. In 2025, Boardwalk Pipelines expects to spend approximately $504 million to maintain its pipeline systems, \ncomply with regulations and monitor, control and reduce its GHG emissions, of \nwhich approximately $203 million is expected to be maintenance capital. In \n2024\n, Boardwalk Pipelines spent $513 million on these matters, of which $202 million was recorded as maintenance capital.\nResults of Operations\nThe following table summarizes the results of operations for Boardwalk Pipelines for the years ended December 31, 2024 and 2023 as presented in Note 20 of the Notes to Consolidated Financial Statements included under Item 8. Boardwalk Pipelines also utilizes a non-GAAP measure, earnings before interest, income tax expense, depreciation and amortization (“EBITDA”) as a financial measure to assess its operating and financial performance and return on invested capital. Management believes some investors may find this measure useful in evaluating Boardwalk Pipelines’ performance as EBITDA is a commonly used metric within the midstream industry.\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nOperating revenues and other\n$\n2,034\n \n$\n1,625 \nInterest income\n31\n \n11 \nTotal\n2,065\n \n1,636 \nExpenses:\n \n \nOperating and other:\nOperating costs and expenses\n948\n \n696 \nDepreciation and amortization\n429\n \n412 \nInterest\n183\n \n155 \nTotal\n1,560\n \n1,263 \nIncome before income tax\n505\n \n373 \nIncome tax expense\n(92)\n(90)\nNet income attributable to Loews Corporation\n$\n413\n \n$\n283 \nEBITDA\n$\n1,086\n \n$\n929 \n2024 Compared with 2023\nNet income attributable to Loews Corporation and EBITDA increased \n$130 million\n and \n$157 million\n in 2024 as compared with \n2023\n, primarily due to the reasons discussed below. \nTotal revenues increased $429 million in \n2024\n as compared with 2023. Boardwalk Pipelines’\n transportation revenues increased $93 million, primarily due to re-contracting at higher rates and recently completed growth projects; storage, parking and lending revenues increased $31 million due to favorable market conditions which allowed for contracting at higher rates; product sales revenues from the sale of natural gas, ethylene and propane increased by $23 million due to opportunistic market conditions; and the Bayou Ethane acquisition contributed $262 million of incremental operating revenues, primarily resulting from ethane product sales.\nOperating costs and expenses increased $252 million in \n2024\n as compared with 2023 primarily reflecting operations of \nthe Bayou Ethane acquisition. Additionally, Boardwalk Pipelines’ operation and maintenance expenses increased primarily due to higher maintenance projects associated with compliance activities and administrative and general costs increased from higher employee-related costs.  \nDepreciation and amortization expenses increased $17 million in \n2024\n as compared with 2023 due to an increased asset base from recently completed growth projects and the Bayou Ethane acquisition\n.\n \n57\nTable of Contents\nInterest expenses increased $28 million in \n2024\n as compared with 2023, primarily due to the pre-financing of Boardwalk Pipeline’s $600 million of debt that matured on December 15, 2024.\nIncome tax expense increased $2 million in 2024 as compared with 2023, and includes a $36 million income tax benefit from an adjustment to deferred state income taxes for a rate reduction effective in 2025.  \nNon-GAAP Reconciliation of Net Income Attributable to Loews Corporation to EBITDA \nThe following table reconciles net income attributable to Loews Corporation to EBITDA for the years ended \nDecember 31, 2024\n and \n2023\n:\nYear Ended December 31\n2024\n2023\n(In millions)\nNet income attributable to Loews Corporation\n$\n413\n \n$\n283 \nInterest, net\n152\n \n144 \nIncome tax expense\n92\n \n90 \nDepreciation and amortization\n429\n \n412 \nEBITDA\n$\n1,086\n \n$\n929 \nLoews Hotels & Co\nThe following table summarizes the results of operations for Loews Hotels & Co for the years ended December 31, 2024 and 2023 as presented in Note\n \n20 of the Notes to Consolidated Financial Statements included under Item 8:\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nOperating revenue\n$\n806\n \n$\n678 \nGain on acquisition of a joint venture\n \n46 \nRevenues related to reimbursable expenses\n127\n \n128 \nTotal\n933\n \n852 \nExpenses:\nOperating and other\n653\n \n558 \nAsset impairments\n12 \nReimbursable expenses\n127\n \n128 \nDepreciation and amortization expense\n93\n \n69 \nEquity income from joint ventures\n(86)\n(129)\nInterest\n51\n \n14 \nTotal\n838\n \n652 \nIncome before income tax\n95\n \n200 \nIncome tax expense\n(25)\n(53)\nNet income attributable to Loews Corporation\n$\n70\n \n$\n147 \n58\nTable of Contents\n2024 Compared with 2023\nNet income attributable to Loews Corporation\n \ndecreased\n by $77 million in \n2024\n as compared with 2023. Results for 2023 include a gain of $46 million ($36 million after tax) related to the acquisition of an additional equity interest in, and the consolidation of, a previously unconsolidated joint venture property. \nOperating revenues improved by $128 million and operating expenses increased by $95 million in \n2024\n as compared with 2023. The increas\ne in operating revenues and operating expenses was primarily driven by the opening of the Loews Arlington Hotel and Convention Center in the first quarter of 2024. Operating revenues also improved due to higher occupancy levels at many city center hotels as a result of the continued recovery in group travel in 2024 as compared to 2023 and an increase in food and beverage revenues. Operating expenses also increased due to increased staffing costs as well as higher insurance expenses and property taxes.\nEquity income from joint ventures decreased $43 million in \n2024\n as compared to 2023. The decrease was driven by a reduction in overall occupancy levels at many joint venture hotels, particularly at the Universal Orlando Resort, in 2024 compared to 2023. Additionally, an impairment charge recorded at a joint venture property reduced Loews Hotels & Co’s equity income by $19 million in 2024. In addition, expenses at joint venture properties in 2024 increased as compared to 2023, largely due to increased staffing costs, as well as higher insurance expenses and property taxes.\nIn\n \n2023, Loews Hotels & Co recorded impairment charges of $12 million to reduce the carrying value of certain assets to their estimated fair value.\nDepreciation and amortization expense \nincreased \n$24 million in\n 2024 \nas compared with 2023, \nmainly due to the opening of the Loews Arlington Hotel and Convention Center in the first quarter of 2024.\nInterest expense for \n2024\n increased $37 million as compared with 2023 \nprimarily due to placing the \nLoews Arlington Hotel and Convention Center into service during the first quarter of 2024, after which Loews Hotels & Co no longer capitalized interest on that project\n.\nCorporate\nCorporate operations consist primarily of investment income, interest expense and administrative costs at the Parent Company. Investment income includes earnings on cash and short-term investments held at the Parent Company to meet current and future liquidity needs, as well as results of the trading portfolio held at the Parent Company. Corporate also includes the equity method of accounting for Altium Packaging.\nThe following table summarizes the results of operations for Corporate for the years ended December 31, 2024 and 2023 as presented in Note\n \n20 of the Notes to Consolidated Financial Statements included under Item 8:\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nRevenues:\n \n \nNet investment income\n$\n242\n \n$\n114 \nExpenses:\n \n \nOperating and other\n77\n \n120 \nEquity method loss\n28\n \n9 \nInterest\n74\n \n80 \nTotal\n179\n \n209 \nIncome (loss) before income tax\n63\n \n(95)\nIncome tax (expense) benefit\n(11)\n5 \nNet income (loss) attributable to Loews Corporation\n$\n52\n \n$\n(90)\n59\nTable of Contents\n2024 Compared with 2023\nNet income attributable to Loews Corporation\n \nincreased\n $142 million in \n2024\n as compared with 2023 primarily due to the reasons discussed below.\nNet investment income for the Parent Company \nincreased\n \n$128 million\n in \n2024\n as compared with 2023 primarily due to higher returns on equity-based investments.\nOperating and other expenses decreased \n$43 million\n in 2024 as compared with \n2023, primarily due to a settlement expense of $47 million in 2023 to recognize unrealized losses, which were included in AOCI, due to the termination of a defined benefit pension plan. For additional information see Note 16 of the Notes to Consolidated Financial Statements included under Item 8.\nLIQUIDITY AND CAPITAL RESOURCES\nParent Company\nParent Company cash and investments, net of receivables and payables, totaled $3.3 billion at December 31, 2024 as compared to $2.6 billion at December 31, 2023. In \n2024\n, \nwe received $1.3 \nbillion\n in cash dividends from our subsidiaries, including a special cash dividend of $497 million from CNA and distributions of $400 million from Boardwalk Pipelines. \nCash outflows in \n2024\n included the payment of $608 million to fund treasury stock purchases and $55 million of cash dividends to our shareholders. In the first quarter of 2025, we expect to receive cash dividends of $611 million from CNA and $75 million from Boardwalk Pipelines. As a holding company we depend on dividends from our subsidiaries and returns on our investment portfolio to fund our obligations. We also have an effective shelf registration statement on file with the Securities and Exchange Commission (“SEC”) under which we may publicly issue an unspecified amount of our debt, equity or hybrid securities from time to time. We are not responsible for the liabilities and obligations of our subsidiaries and there are no Parent Company guarantees.\nDepending on market and other conditions, we may purchase shares of our and our subsidiaries outstanding common stock in the open market, in privately negotiated transactions or otherwise. In \n2024\n, we purchased 7.7 million shares of Loews Corporation com\nmon stock. As of February 7, 2025, we had purchased an additional \n1.9\n million shares of Loews Corporation common stock in \n2025\n at an additional aggregate cost of $164 million. As of February 7, 2025\n, there were 212,861,300 shares of Loews Corporation common stock outstanding.\nLoews Corporation has a corporate credit and senior debt rating of A with a stable outlook from S&P Global Ratings (“S&P”) and a senior debt rating of A3 with a stable outlook from Moody’s Investors Service (“Moody’s”).\nFuture uses of our cash may include investing in our subsidiaries, new acquisitions, dividends and/or purchases of our and our subsidiaries’ outstanding common stock. The declaration and payment of future dividends to holders of our common stock will be at the discretion of our Board of Directors and will depend on many factors, including our earnings, financial condition and business needs.\nSubsidiaries\nCNA’s cash provided by operating activities was $2.6 billion in \n2024\n as compared with and $2.3 billion in 2023. \nThe increase in cash provided by operating activities was driven by an increase in premiums collected and higher earnings from fixed income securities, partially offset by an increase in net claim payments and higher operating expenses.\nCNA paid cash dividends of $3.76 per share on its common stock, including a special cash dividend of $2.00 per share, in \n2024\n. On February 7, 2025, CNA’s Board of Directors declared a quarterly cash dividend of $0.46 per share and a special cash dividend of $2.00 per share payable March 13, 2025 to shareholders of record on February 24, 2025. CNA’s declaration and payment of future dividends is at the discretion of its Board of Directors and will depend on many factors, including CNA’s earnings, financial condition, business needs and regulatory constraints. CNA believes that its present cash flows from operating, investing and financing activities are sufficient to fund its current and expected working capital and debt obligation needs and does not expect this to change in the near term.\nDividends to CNA from Continental Casualty Company (“CCC”), a subsidiary of CNA, are subject to the insurance holding company laws of the State of Illinois, the domiciliary state of CCC. Under these laws, ordinary dividends, or dividends that do not require prior approval by the Illinois Department of Insurance (the “Department”), are determined based on the greater of the prior year’s statutory net income or 10% of statutory surplus as of the end of the prior year, as well as the timing and amount of dividends paid in the preceding 12 months. Additionally, ordinary dividends may only be \n60\nTable of Contents\npaid from earned surplus, which is calculated by removing unrealized gains from unassigned surplus. As of December 31, 2024, CCC was in a positive earned surplus position. The maximum allowable dividend CCC could pay during 2025 that would not be subject to the Department’s prior approval is \n$1.1 billion\n, less dividends paid during the preceding twelve months measured at that point in time. CCC paid dividends of \n$995 million\n in \n2024\n. The actual level of dividends paid in any year is determined after an assessment of available dividend capacity, holding company liquidity and cash needs as well as the impact the dividends will have on the statutory surplus of the applicable insurance company.\nIn \nFebruary of 2024\n, CNA completed a public offering of \n$500 million\n aggregate principal amount of its \n5.1%\n senior notes due \nFebruary 15, 2034 and in May of 2024, CNA repaid at maturity the outstanding $550 million aggregate principal amount of its 4.0% senior notes.\nCNA has an insurer financial strength rating of A and senior debt rating of bbb+ from A.M. Best Company (“A.M. Best”), an insurer financial strength rating of A2 and senior debt rating of Baa2 from Moody’s, an insurer financial strength rating of A+ and senior debt rating of A- from S&P and an insurer financial strength rating of A+ and senior debt rating of BBB+ from Fitch. A.M. Best and Moody’s maintain positive outlooks across CNA’s insurer financial strength and senior debt ratings. A.M. Best revised its outlook on CNA’s ratings to positive from stable in December 2024. Moody’s revised its outlook on CNA’s ratings to positive from stable in November 2024. S&P and Fitch maintain stable outlooks across CNA’s insurer financial strength and senior debt ratings.\nCNA has an effective shelf registration statement on file with the SEC under which it may publicly issue an unspecified amount of debt, equity or hybrid securities from time to time.\nBoardwalk Pipelines’ cash provided by operating activities increased $83 million in \n2024\n compared to 2023, primarily due to changes in net income adjusted for depreciation and amortization.\nFor \n2024\n and 2023, Boardwalk Pipelines’ capital expenditures were $392 million and $382 million, consisting of growth capital expenditures of $190 million and $218 million and maintenance capital expenditures of $202 million and $164 million. During \n2023, Boardwalk Pipelines acquired Bayou Ethane for $355 million. See Boardwalk Pipelines: Pipeline System Maintenance and GHGs Emission Reduction Initiatives in this MD&A for further information about factors impacting Boardwalk Pipelines’ maintenance capital spending.\nBoardwalk Pipelines expects total capital expenditures to be approximately $269 million in 2025, including approximately $203 million for maintenance capital and $66 million related to growth projects. Boardwalk Pipelines \n expects to spend a total of approximately $1.6 billion on its ongoing and announced growth projects, with expected in-service dates for these projects ranging from 2025 to 2029. Refer to Boardwalk Pipelines in Part I, Item 1. Business of this Annual Report on Form 10-K for further information on Boardwalk Pipelines’ growth projects.\nBoardwalk Pipelines anticipates that its existing capital resources, including its cash and cash equivalents, revolving credit facility and cash flows from operating activities, will be adequate to fund its operations and capital expenditures for \n2025\n. Boardwalk Pipelines may seek to access the debt markets to fund some or all capital expenditures for growth projects or acquisitions, to refinance maturing debt or for general partnership purposes. As of February 7, 2025, \nBoardwalk Pipelines also has an effective shelf registration statement on file with the SEC under which it may publicly issue up to $900 million of debt securities, warrants or rights from time to time.\n \nIn \nFebruary of 2024\n, Boardwalk Pipelines completed a public offering of \n$600 million\n aggregate principal amount of its \n5.6%\n senior notes due \nAugust 1, 2034\n. \nThe net proceeds from this offering were used to retire $600 million of its 5.0% senior notes at maturity in December 2024. \nAs of December 31, 2024, \nBoardwalk Pipelines\n had no outstanding borrowings under its revolving credit facility and the full borrowing capacity of $1.0 billion available to it. \nIn \n2024\n, Boardwalk Pipelines paid distributions of $400 million to the Company.\nBoardwalk Pipelines has a senior debt rating of BBB with a stable outlook from S&P, a senior debt rating of Baa2 with a stable outlook from Moody’s and a senior debt rating of BBB with a stable outlook from Fitch.\nLoews Hotels & Co, through its subsidiaries, has \nmortgage loans maturing beyond twelve months as of \nDecember 31, 2024\n, which it may refinance before they mature. Refinancing any indebtedness, including loans of unconsolidated joint venture partnerships, may require Loews Hotels & Co to make principal pay downs, establish restricted cash reserves or provide guaranties of the subsidiary’s debt. Through the date of this Report, all Loews Hotels & Co’s subsidiaries are in compliance with their debt covenants.\n61\nTable of Contents\nLoews Hotels & Co refinanced $532 million in mortgage loans in 2024, all of which mature beyond twelve months as of \nDecember 31, 2024\n.\nIn 2024, Loews Hotels & Co acquired all the remaining outstanding noncontrolling equity interests of two owned and consolidated hotels for a total of \n$44 million. In addition, \nLoews Hotels & Co received aggregate proceeds of \n$23 million\n for the sale of an owned hotel.\n62\nTable of Contents\n \nCont\nractual Obligations\nWe and our subsidiaries have contractual obligations which arise in the ordinary course of business. For a discussion regarding the obligations related to our and our subsidiaries long-term debt see Note \n12\n of the Notes to Consolidated Financial Statements included under Item 8. For contractual payment obligations related to the claim and claim adjustment expense reserves and future policy benefit reserves see the table below: \nPayments Due by Period\nDecember 31, 2024\nTotal\nLess than\n \n1 year\n \n1-3 years\n3-5 years\nMore than \n5 years\n(In millions)\n \n \n \n \n \n \n \n \n \n \n \nClaim and claim adjustment expense\n reserves (a)\n$\n25,524\n \n$\n5,737\n \n$\n6,977\n \n$\n3,944\n \n$\n8,866\n \nFuture policy benefit reserves (b)\n27,028\n \n801\n \n1,570\n \n1,738\n \n22,919\n \n(a)\nThe claim and claim adjustment expense reserves reflected above are not discounted and represent CNA’s estimate of the amount and timing of the ultimate settlement and administration of gross claims based on its assessment of facts and circumstances known as of December 31, 2024. See the Insurance Reserves section of this MD&A for further information.\n(b)\nThe future policy benefit reserves reflected above are not discounted, include maintenance costs, represent CNA’s estimate of the ultimate amount and timing of the settlement of benefits net of expected premiums and are based on its assessment of facts and circumstances known as of December 31, 2024. Additional information on future policy benefit reserves is included in Note 1 of the Notes to Consolidated Financial Statements included under Item 8.\nFurther information on our commitments, contingencies and guarantees is provided in the Notes to Consolidated Financial Statements included under Item 8.\nINVESTMENTS\nInvestment activities of our non-insurance subsidiaries primarily consist of investments in fixed income securities, including short-term investments. The Parent Company portfolio also includes equity securities, including short sales and derivative instruments. Certain of these types of Parent Company investments generally have greater volatility, less liquidity and greater risk than fixed income investments and are included within Results of Operations – Corporate.\nThe Parent Company enters into short sales and invests in certain derivative instruments that are used for asset and liability management activities, income enhancements to its portfolio management strategy and to benefit from anticipated future movements in the underlying markets. If such movements do not occur as anticipated, significant losses may occur. Monitoring procedures include senior management review of daily reports of existing positions and valuation fluctuations to seek to ensure that open positions are consistent with the portfolio strategy.\nCredit exposure associated with non-performance by counterparties to derivative instruments is generally limited to the uncollateralized change in fair value of the derivative instruments recognized in the Consolidated Balance Sheets. The risk of non-performance is mitigated by monitoring the creditworthiness of counterparties and diversifying derivatives by using multiple counterparties. Collateral is occasionally required from derivative investment counterparties depending on the amount of the exposure and the credit rating of the counterparty.\nInsurance\nCNA maintains a large portfolio of fixed maturity and equity securities, including large amounts of corporate and government issued debt securities, residential and commercial mortgage-backed securities, other asset-backed securities and investments in limited partnerships which pursue a variety of long and short investment strategies across a broad array of asset classes. CNA’s investment portfolio supports its obligation to pay future insurance claims and provides investment returns which are an important part of CNA’s overall profitability.\n63\nTable of Contents\nNet Investment Income\nThe significant components of CNA’s net investment income are presented in the following table. Fixed income securities, as presented, include both fixed maturity securities and non-redeemable preferred stock.\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nFixed income securities:\n \n \nTaxable fixed income securities\n$\n1,940\n \n$\n1,798 \nTax-exempt fixed income securities\n144\n \n178 \nTotal fixed income securities\n2,084\n \n1,976 \nLimited partnership and common stock investments\n320\n \n202 \nOther, net of investment expense\n93\n \n86 \nNet investment income\n$\n2,497\n \n$\n2,264 \nEffective income yield for the fixed income securities portfolio\n4.8\n \n%\n4.7 \n%\nLimited partnership and common stock return for the period\n13.3\n \n%\n9.4 \n%\nCNA’s net investment income increased $233 million in \n2024\n as compared with 2023, driven by favorable limited partnership and common stock returns, as well as higher income from fixed income securities as a result of a larger invested asset base and favorable reinvestment rates.\nInvestment Gains (Losses)\nThe components of CNA’s investment gains (losses) are presented in the following table:\nYear Ended December 31\n2024\n2023\n(In millions)\n \n \n \n \n \nInvestment gains (losses):\n \n \nFixed maturity securities:\n \n \nCorporate and other bonds\n$\n(57)\n$\n(57)\nStates, municipalities and political subdivisions\n1\n \n10 \nAsset-backed\n(46)\n(44)\nTotal fixed maturity securities\n(102)\n(91)\nNon-redeemable preferred stock\n21\n \n4 \nDerivatives, short-term and other\n(12)\nTotal investment losses\n(81)\n(99)\nIncome tax benefit\n17\n \n20 \nAmounts attributable to noncontrolling interests\n5\n \n8 \nInvestment losses attributable to Loews Corporation\n$\n(59)\n$\n(71)\nCNA’s pretax investment losses decreased $18 million in \n2024\n as compared with 2023, driven by the favorable change in fair value of non-redeemable preferred stock and lower net losses on disposals of fixed maturity securities, partially offset by higher impairment losses.\nFurther information on CNA’s investment gains and losses is set forth in Note 3 of the Notes to Consolidated Financial Statements included under Item 8.\n64\nTable of Contents\nPortfolio Quality\nThe following table presents the estimated fair value and net unrealized gains (losses) of CNA’s fixed maturity securities by rating distribution:\nDecember 31, 2024\nDecember 31, 2023\n \nEstimated \nFair Value\n Net \nUnrealized Gains (Losses)\nEstimated \nFair Value\n Net \nUnrealized Gains\n(Losses)\n(In millions)\n \n \n \n \n \n \n \n \n \nU.S. Government, Government agencies and Government-sponsored enterprises\n$\n2,936\n \n$\n(369)\n$\n2,795 \n$\n(298)\nAAA\n3,010\n \n(217)\n2,727 \n(169)\nAA\n6,369\n \n(567)\n6,444 \n(420)\nA\n10,260\n \n(379)\n9,910 \n(223)\nBBB\n16,757\n \n(729)\n16,670 \n(744)\nNon-investment grade\n1,779\n \n(64)\n1,879 \n(119)\nTotal\n$\n41,111\n \n$\n(2,325)\n$\n40,425 \n$\n(1,973)\nAs of December 31, 2024 and 2023, 1% of CNA’s fixed maturity portfolio was rated internally. AAA rated securities included $0.2 billion of pre-funded municipal bonds as of December 31, 2024 and 2023.\nThe following table presents CNA’s available-for-sale fixed maturity securities in a gross unrealized loss position by ratings distribution:\nDecember 31, 2024\nEstimated \nFair Value\nGross Unrealized Losses\n(In millions)\n \n \n \n \n \nU.S. Government, Government agencies and Government-sponsored enterprises\n$\n2,567\n \n$\n373\n \nAAA\n1,830\n \n283\n \nAA\n4,257\n \n730\n \nA\n6,340\n \n582\n \nBBB\n11,548\n \n980\n \nNon-investment grade\n796\n \n92\n \nTotal\n$\n27,338\n \n$\n3,040\n \n65\nTable of Contents\nThe following table presents the maturity profile for these available-for-sale fixed maturity securities. Securities not due to mature on a single date are allocated based on weighted average life:\nDecember 31, 2024\nEstimated \nFair Value\nGross Unrealized Losses\n(In millions)\n \n \n \n \n \nDue in one year or less\n$\n1,390\n \n$\n16\n \nDue after one year through five years\n7,731\n \n366\n \nDue after five years through ten years\n7,762\n \n910\n \nDue after ten years\n10,455\n \n1,748\n \nTotal\n$\n27,338\n \n$\n3,040\n \nCommercial Real Estate\nCNA’s investment portfolio has exposure to the commercial real estate sector primarily through its fixed maturity securities and mortgage loan portfolios. The performance of these assets is dependent on a number of factors, including the performance of the underlying collateral (which is influenced by cash flows from underlying property leases), changes in the fair value of collateral, refinancing risk, and the creditworthiness of tenants of credit tenant loan properties (where lease payments directly service the loan).\nWithin CNA’s fixed maturity securities portfolio, its exposure is primarily through the commercial mortgage-backed securities portfolio and the corporate and other bonds portfolio, which contains obligations of real estate investment trust (“REIT”) issuers. Commercial mortgage-backed securities include both single asset, single borrower collateral that is securitized independently and conduit collateral that is securitized in diversified pools. \nThe following tables present the estimated fair value and net unrealized gains (losses) of CNA’s commercial mortgage-backed securities by property type and by ratings distribution:\nDecember 31, 2024\nDecember 31, 2023\nEstimated \nFair Value\nNet \nUnrealized Gains (Losses)\nEstimated \nFair Value\nNet \nUnrealized Gains\n(Losses)\n(In millions)\n \n \n \n \n \nCommercial mortgage-backed:\nSingle asset, single borrower:\nOffice\n$\n339\n \n$\n(43)\n$\n306 \n$\n(70)\nLodging\n271\n \n(8)\n227 \n(23)\nRetail\n268\n \n(10)\n283 \n(28)\nMultifamily\n50\n \n(1)\n59 \n(3)\nIndustrial\n42\n \n(3)\n93 \n(4)\nTotal single asset, single borrower\n970\n \n(65)\n968 \n(128)\nConduits (multi property, multi borrower pools)\n711\n \n(66)\n663 \n(95)\nTotal commercial mortgage-backed\n$\n1,681\n \n$\n(131)\n$\n1,631 \n$\n(223)\n66\nTable of Contents\nDecember 31, 2024\nDecember 31, 2023\nEstimated \nFair Value\nNet \nUnrealized Gains (Losses)\nEstimated \nFair Value\nNet \nUnrealized Gains\n(Losses)\n(In millions)\n \n \n \n \n \nCommercial mortgage backed:\nAAA\n$\n736\n \n$\n(14)\n$\n570 \n$\n(27)\nAA\n609\n \n(60)\n594 \n(95)\nA\n163\n \n(20)\n202 \n(30)\nBBB\n139\n \n(20)\n216 \n(45)\nNon-investment grade\n34\n \n(17)\n49 \n(26)\nTotal commercial mortgage-backed\n$\n1,681\n \n$\n(131)\n$\n1,631 \n$\n(223)\nThe following tables present the estimated fair value and net unrealized gains (losses) of the REIT issuer exposure within CNA’s corporate and other bonds portfolio by property type and by ratings distribution: \nDecember 31, 2024\nDecember 31, 2023\nEstimated \nFair Value\nNet \nUnrealized Gains (Losses)\nEstimated \nFair Value\nNet \nUnrealized Gains\n(Losses)\n(In millions)\n \n \n \n \n \nCorporate and other bonds - REITs:\nRetail\n$\n478\n \n$\n(18)\n$\n515 \n$\n(25)\nOffice\n239\n \n(12)\n250 \n(20)\nSelf-Storage\n98\n \n(5)\n85 \n(6)\nIndustrial\n93\n \n(3)\n99 \n(1)\nOther (a) \n387\n \n(10)\n367 \n(16)\nTotal corporate and other bonds - REITs\n$\n1,295\n \n$\n(48)\n$\n1,316 \n$\n(68)\n(a)\nOther includes a diversified mix of property type strategies including healthcare and apartments.\nDecember 31, 2024\nDecember 31, 2023\nEstimated \nFair Value\nNet \nUnrealized Gains (Losses)\nEstimated \nFair Value\nNet \nUnrealized Gains\n(Losses)\n(In millions)\n \n \n \n \n \nCorporate and other bonds - REITs:\nAA\n$\n6\n \n$\n10 \nA\n310\n \n$\n(6)\n285 \n$\n(3)\nBBB\n942\n \n(40)\n994 \n(64)\nNon-investment grade\n37\n \n(2)\n27 \n(1)\nTotal corporate and other bonds - REITs\n$\n1,295\n \n$\n(48)\n$\n1,316 \n$\n(68)\n67\nTable of Contents\nMortgage loans are commercial in nature and are carried at unpaid principal balance, net of unamortized fees and an allowance for expected credit losses. The allowance for expected credit losses is developed by assessing the credit quality of pools of mortgage loans in good standing using debt service coverage ratios (“DSCR”) and loan-to-value ratios (“LTV”). This assessment utilizes historical credit loss experience adjusted to reflect current conditions and reasonable and supportable forecasts. As of December 31, 2024 \nand 2023,\n the allowance for expected credit losses on CNA’s mortgage portfolio was $35 million, or 3.3% of its amortized cost basis. \nThe following table presents the amortized cost basis of mortgage loans by property type:\nDecember 31, 2024\nDecember 31, 2023\nAmortized Cost\nPercentage of Total\nAmortized Cost\nPercentage of Total\n(In millions, except %)\n \n \n \n \n \nMortgage loans:\nRetail\n$\n527\n \n50\n \n%\n$\n520 \n48 \n%\nOffice\n239\n \n22\n \n245 \n23 \nIndustrial\n123\n \n12\n \n124 \n12 \nOther\n165\n \n16\n \n181 \n17 \nTotal mortgage loans\n1,054\n \n100\n \n%\n1,070 \n100 \n%\nLess: Allowance for expected credit losses\n(35)\n(35)\nTotal mortgage loans - net of allowance\n$\n1,019\n \n$\n1,035 \nIn addition to the mortgage loan portfolio, CNA invests in securitized credit tenant loans and ground lease financings that are classified as fixed maturity securities and are largely investment grade quality. As of December 31, 2024 \nand 2023\n, these holdings had an estimated fair value of $471 million and $479 million, and net unrealized losses of $118 million and $87 million.\nCNA owns other fixed maturity securities which have exposure to cell towers, data centers and other collateral types that could be viewed as having real estate characteristics. CNA views these securities to have risks more similar to operating enterprises that do not share the same risks as the broader commercial real estate market. \nAdditionally, CNA does not have significant real estate exposure through its limited partnership portfolio. \nDuration\nA primary objective in the management of CNA’s investment portfolio is to optimize return relative to the corresponding liabilities and respective liquidity needs. CNA’s views on the current interest rate environment, tax regulations, asset class valuations, specific security issuer and broader industry segment conditions as well as domestic and global economic conditions, are some of the factors that enter into an investment decision. CNA also continually monitors exposure to issuers of securities held and broader industry sector exposures and may from time to time adjust such exposures based on its views of a specific issuer or industry sector.\nA further consideration in the management of CNA’s investment portfolio is the characteristics of the corresponding liabilities and the ability to align the duration of the portfolio to those liabilities and to meet future liquidity needs, minimize interest rate risk and maintain a level of income sufficient to support the underlying insurance liabilities. For portfolios where future liability cash flows are determinable and typically long-term in nature, CNA segregates investments for asset/liability management purposes. The segregated investments support the long-term care and structured settlement liabilities in Other Insurance Operations. \nThe effective durations of CNA’s fixed income securities and short-term investments are presented in the following table. Amounts presented are net of payable and receivable amounts for securities purchased and sold, but not yet settled.\n68\nTable of Contents\nDecember 31, 2024\nDecember 31, 2023\n \nEstimated \nFair Value\nEffective Duration (Years)\nEstimated\nFair Value\nEffective Duration (Years)\n(In millions of dollars)\n \n \n \n \n \n \n \n \n \nLife & Group\n$\n14,915\n \n9.8\n$\n15,137 \n10.2\nProperty & Casualty and other\n28,779\n \n4.3\n27,981 \n4.5\nTotal\n$\n43,694\n \n6.2\n$\n43,118 \n6.5\nCNA’s investment portfolio is periodically analyzed for changes in duration and related price risk. Certain securities have duration characteristics that are variable based on market interest rates, credit spreads and other factors that may drive variability in the amount and timing of cash flows. Additionally, CNA periodically reviews the sensitivity of the portfolio to the level of foreign exchange rates and other factors that contribute to market price changes. A summary of these risks and specific analysis on changes is included in the Quantitative and Qualitative Disclosures about Market Risk included under Item 7A.\nINSURANCE RESERVES\nThe level of reserves CNA maintains represents its best estimate, as of a particular point in time, of what the ultimate settlement and administration of claims will cost based on CNA’s assessment of facts and circumstances known at that time. Reserves are not an exact calculation of liability but instead are complex estimates that CNA derives, generally utilizing a variety of actuarial reserve estimation techniques, from numerous assumptions and expectations about future events, both internal and external, many of which are highly uncertain. As noted below, CNA reviews its reserves for each segment of its business periodically, and any such review could result in the need to increase reserves in amounts which could be material and could adversely affect our results of operations and equity and CNA’s equity, business and insurer financial strength and corporate debt ratings. Further information on reserves is provided in Notes 8 and \n9\n of the Notes to Consolidated Financial Statements included under Item 8.\nProperty and Casualty Claim and Claim Adjustment Expense Reserves\nCNA maintains loss reserves to cover its estimated ultimate unpaid liability for claim and claim adjustment expenses, including the estimated cost of the claims adjudication process, for claims that have been reported but not yet settled (case reserves) and claims that have been incurred but not reported (“IBNR”). IBNR includes a provision for development on known cases as well as a provision for late reported incurred claims. Claim and claim adjustment expense reserves are reflected as liabilities and are included on the Consolidated Balance Sheets under the heading “Insurance Reserves.” Adjustments to prior year reserve estimates, if necessary, are reflected in results of operations in the period that the need for such adjustments is determined. The carried case and IBNR reserves as of each balance sheet date are provided in the discussion that follows and in Note 8 of the Notes to Consolidated Financial Statements included under Item 8.\nThere is a risk that CNA’s recorded reserves are insufficient to cover its estimated ultimate unpaid liability for claims and claim adjustment expenses. Unforeseen emerging or potential claims and coverage issues are also difficult to predict and could materially adversely affect the adequacy of CNA’s claim and claim adjustment expense reserves and could lead to future reserve increases.\nIn addition, CNA’s property and casualty insurance subsidiaries also have actual and potential exposures related to A&EP claims, which could result in material losses. To mitigate the risks posed by CNA’s exposure to A&EP claims and claim adjustment expenses, CNA completed a transaction with National Indemnity Company (“NICO”), under which substantially all of CNA’s legacy A&EP liabilities were ceded to NICO effective January 1, 2010. See Note 8 of the Notes to the Consolidated Financial Statements included under Item 8 for further discussion about the transaction with NICO, its impact on CNA’s results of operations and the deferred retroactive reinsurance gains and the amount of remaining reinsurance limit.\n69\nTable of Contents\nEstablishing Property & Casualty Reserve Estimates\nIn developing claim and claim adjustment expense reserve estimates, CNA’s actuaries perform detailed reserve analyses that are staggered throughout the year. The data is organized at a reserve group level. A reserve group typically can be a line of business covering a subset of insureds such as commercial automobile liability for small or middle market customers, or it can be a particular type of claim such as construction defect. Every reserve group is reviewed at least once during the year, but most are reviewed more frequently. The analyses generally review losses gross of ceded reinsurance and apply the ceded reinsurance terms to the gross estimates to establish estimates net of reinsurance. In addition to the detailed analyses, CNA reviews actual loss emergence for all products each quarter.\nMost of CNA’s business can be characterized as long-tail. For long-tail business, it will generally be several years between the time the business is written and the time when all claims are settled. CNA’s long-tail exposures include commercial automobile liability, workers’ compensation, general liability, medical professional liability, other professional liability and management liability coverages, assumed reinsurance run-off and products liability. Short-tail exposures include property, commercial automobile physical damage, marine, surety and warranty. Property & Casualty Operations contain both long-tail and short-tail exposures. Other Insurance Operations contain long-tail exposures.\nVarious methods are used to project ultimate losses for both long-tail and short-tail exposures.\nThe paid development method estimates ultimate losses by reviewing paid loss patterns and applying them to accident or policy years with further expected changes in paid losses. Selection of the paid loss pattern may require consideration of several factors including the impact of economic, social and medical inflation on claim costs, the rate at which claims professionals make claim payments and close claims, the impact of judicial decisions, the impact of underwriting changes, the impact of large claim payments and other factors. Claim cost inflation itself may require evaluation of changes in the cost of repairing or replacing property, changes in the cost of medical care, changes in the cost of wage replacement, judicial decisions, legislative changes and other factors. Because this method assumes that losses are paid at a consistent rate, changes in any of these factors can affect the results. Since the method does not rely on case reserves, it is not directly influenced by changes in their adequacy.\nFor many reserve groups, paid loss data for recent periods may be too immature or erratic for accurate predictions. This situation often exists for long-tail exposures. In addition, changes in the factors described above may result in inconsistent payment patterns. Finally, estimating the paid loss pattern subsequent to the most mature point available in the data analyzed often involves considerable uncertainty for long-tail products such as workers’ compensation.\nThe incurred development method is similar to the paid development method, but it uses case incurred losses instead of paid losses. Since the method uses more data (case reserves in addition to paid losses) than the paid development method, the incurred development patterns may be less variable than paid patterns. However, selection of the incurred loss pattern typically requires analysis of all of the same factors described above. In addition, the inclusion of case reserves can lead to distortions if changes in case reserving practices have taken place, and the use of case incurred losses may not eliminate the issues associated with estimating the incurred loss pattern subsequent to the most mature point available.\nThe loss ratio method multiplies earned premiums by an expected loss ratio to produce ultimate loss estimates for each accident or policy year. This method may be useful for immature accident or policy periods or if loss development patterns are inconsistent, losses emerge very slowly or there is relatively little loss history from which to estimate future losses. The selection of the expected loss ratio typically requires analysis of loss ratios from earlier accident or policy years or pricing studies and analysis of inflationary trends, frequency trends, rate changes, underwriting changes and other applicable factors.\nThe Bornhuetter-Ferguson method using paid loss is a combination of the paid development method and the loss ratio method. This method normally determines expected loss ratios similar to the approach used to estimate the expected loss ratio for the loss ratio method and typically requires analysis of the same factors described above. This method assumes that future losses will develop at the expected loss ratio level. The percent of paid loss to ultimate loss implied from the paid development method is used to determine what percentage of ultimate loss is yet to be paid. The use of the pattern from the paid development method typically requires consideration of the same factors listed in the description of the paid development method. The estimate of losses yet to be paid is added to current paid losses to estimate the ultimate loss for each year. For long-tail lines, this method will react very slowly if actual ultimate loss ratios are different from expectations due to changes not accounted for by the expected loss ratio calculation.\nThe Bornhuetter-Ferguson method using incurred loss is similar to the Bornhuetter-Ferguson method using paid loss except that it uses case incurred losses. The use of case incurred losses instead of paid losses can result in development patterns that are less variable than paid patterns. However, the inclusion of case reserves can lead to distortions if changes \n70\nTable of Contents\nin case reserving have taken place, and the method typically requires analysis of the same factors that need to be reviewed for the loss ratio and incurred development methods.\nThe frequency times severity method multiplies a projected number of ultimate claims by an estimated ultimate average loss for each accident or policy year to produce ultimate loss estimates. Since projections of the ultimate number of claims are often less variable than projections of ultimate loss, this method can provide more reliable results for reserve groups where loss development patterns are inconsistent or too variable to be relied on exclusively. In addition, this method can more directly account for changes in coverage that affect the number and size of claims. However, this method can be difficult to apply to situations where very large claims or a substantial number of unusual claims result in volatile average claim sizes. Projecting the ultimate number of claims may require analysis of several factors, including the rate at which policyholders report claims to CNA, the impact of judicial decisions, the impact of underwriting changes and other factors. Estimating the ultimate average loss may require analysis of the impact of large losses and claim cost trends based on changes in the cost of repairing or replacing property, changes in the cost of medical care, changes in the cost of wage replacement, judicial decisions, legislative changes and other factors.\nStochastic modeling produces a range of possible outcomes based on varying assumptions related to the particular reserve group being modeled. For some reserve groups, CNA uses models which rely on historical development patterns at an aggregate level, while other reserve groups are modeled using individual claim variability assumptions supplied by the claims department. In either case, multiple simulations using varying assumptions are run and the results are analyzed to produce a range of potential outcomes. The results will typically include a mean and percentiles of the possible reserve distribution which aid in the selection of a point estimate.\nFor many exposures, especially those that can be considered long-tail, a particular accident or policy year may not have a sufficient volume of paid losses to produce a statistically reliable estimate of ultimate losses. In such a case, CNA’s actuaries typically assign more weight to the incurred development method than to the paid development method. As claims continue to settle and the volume of paid loss increases, the actuaries may assign additional weight to the paid development method. For most of CNA’s products, even the incurred losses for accident or policy years that are early in the claim settlement process will not be of sufficient volume to produce a reliable estimate of ultimate losses. In these cases, CNA may not assign much, if any, weight to the paid and incurred development methods. CNA may use the loss ratio, Bornhuetter-Ferguson and/or frequency times severity methods. For short-tail exposures, the paid and incurred development methods can often be relied on sooner primarily because CNA’s history includes a sufficient number of years to cover the entire period over which paid and incurred losses are expected to change. However, CNA may also use the loss ratio, Bornhuetter-Ferguson and/or frequency times severity methods for short-tail exposures.\nFor other more complex reserve groups where the above methods may not produce reliable indications, CNA uses additional methods tailored to the characteristics of the specific situation.\nPeriodic Reserve Reviews\nThe reserve analyses performed by CNA’s actuaries result in point estimates. Each quarter, the results of the detailed reserve reviews are summarized and discussed with CNA’s senior management to determine the best estimate of reserves. CNA’s senior management considers many factors in making this decision. CNA’s recorded reserves reflect its best estimate as of a particular point in time based upon known facts and circumstances, consideration of the factors cited above and its judgment. The carried reserve differs from the actuarial point estimate as discussed further below.\nCurrently, CNA’s recorded reserves are modestly higher than the actuarial point estimate. For Property & Casualty Operations, the difference between CNA’s reserves and the actuarial point estimate is primarily driven by uncertainty with respect to immature accident years, claim cost inflation, changes in claims handling, changes to the tort environment which may adversely affect claim costs and the effects from the economy. For CNA’s legacy A&EP liabilities, the difference between CNA’s reserves and the actuarial point estimate is primarily driven by the potential tail volatility of run-off exposures.\nThe key assumptions fundamental to the reserving process are often different for various reserve groups and accident or policy years. Some of these assumptions are explicit assumptions that are required of a particular method, but most of the assumptions are implicit and cannot be precisely quantified. An example of an explicit assumption is the pattern employed in the paid development method. However, the assumed pattern is itself based on several implicit assumptions such as the impact of inflation on medical costs and the rate at which claim professionals close claims. As a result, the effect on reserve estimates of a particular change in assumptions typically cannot be specifically quantified, and changes in these assumptions cannot be tracked over time.\n71\nTable of Contents\nCNA’s recorded reserves are management’s best estimate. In order to provide an indication of the variability associated with CNA’s net reserves, the following discussion provides a sensitivity analysis that shows the approximate estimated impact of variations in significant factors affecting CNA’s reserve estimates for particular types of business. These significant factors are the ones that CNA believes could most likely materially affect the reserves. This discussion covers the major types of business for which CNA believes a material deviation to its reserves is reasonably possible. There can be no assurance that actual experience will be consistent with the current assumptions or with the variation indicated by the discussion. In addition, there can be no assurance that other factors and assumptions will not have a material impact on CNA’s reserves.\nThe areas for which CNA believes a significant deviation to its net reserves is reasonably possible are (i) professional liability, management liability (including medical professional liability) and surety products (ii) workers’ compensation (iii) general liability and (iv) commercial auto liability.\nProfessional liability, management liability and surety products include U.S. professional liability coverages provided to various professional firms, including architects, real estate agents, small and mid-sized accounting firms, law firms and other professional firms. They also include D&O, E&O, employment practices, fiduciary, fidelity, cyber and surety coverages and medical liability. The most significant factor affecting reserve estimates for these liability coverages is claim severity. Claim severity is driven by the cost of medical care, the cost of wage replacement, legal fees, judicial decisions, legislative changes and other factors. Underwriting and claim handling decisions such as the classes of business written and individual claim settlement decisions can also affect claim severity. If the estimated claim severity increases by 9%, CNA estimates that net reserves would increase by approximately $500 million. If the estimated claim severity decreases by 3%, CNA estimates that net reserves would decrease by approximately $150 million. CNA’s net reserves for these products were approximately $5.8 billion as of December 31, 2024.\nFor workers’ compensation, since many years will pass from the time the business is written until all claim payments have been made, the most significant factor affecting workers’ compensation reserve estimates is claim cost inflation on claim payments. Workers’ compensation claim cost inflation is driven by the cost of medical care, the cost of wage replacement, expected claimant lifetimes, judicial decisions, legislative changes and other factors. If estimated workers’ compensation claim cost inflation increases by 100 basis points for the entire period over which claim payments will be made, CNA estimates that its net reserves would increase by approximately $250 million. If estimated workers’ compensation claim cost inflation decreases by 100 basis points for the entire period over which claim payments will be made, CNA estimates that its net reserves would decrease by approximately $250 million. Net reserves for workers’ compensation were approximately $3.5 billion as of December 31, 2024.\nFor general liability, the most significant factor affecting reserve estimates is claim severity. Claim severity is driven by changes in the cost of repairing or replacing property, the cost of medical care, the cost of wage replacement, judicial decisions, legislation and other factors. If the estimated claim severity for general liability increases by 6%, CNA estimates that its net reserves would increase by approximately $300 million. If the estimated claim severity for general liability decreases by 3%, CNA estimates that its net reserves would decrease by approximately $150 million. Net reserves for general liability were approximately $4.9 billion as of December 31, 2024.\nCommercial auto liability is also considered long-tail; however, both the frequency of claims and severity of loss assumptions for the latest few accident years are significantly influenced by social inflation, economic inflation, driving habits and attorney involvement. If these trends accelerate beyond expectations, there may be significant deviation in CNA’s net reserves.  If the estimated auto liability claim severity were to increase 5% and frequency were to increase 1% on the three most recent accident years, CNA estimates that its net reserves would increase by approximately $90 million.  CNA’s net reserves for commercial auto were approximately $1.2 billion as of \nDecember 31, 2024\n. \nGiven the factors described above, it is not possible to quantify precisely the ultimate exposure represented by claims and related litigation. As a result, CNA regularly reviews the adequacy of its reserves and reassesses its reserve estimates as historical loss experience develops, additional claims are reported and settled and additional information becomes available in subsequent periods. In reviewing CNA’s reserve estimates, CNA makes adjustments in the period that the need for such adjustments is determined. These reviews have resulted in CNA’s identification of information and trends that have caused CNA to change its reserves in prior periods and could lead to CNA’s identification of a need for additional material increases or decreases in claim and claim adjustment expense reserves, which could materially affect our results of operations and equity and CNA’s business and insurer financial strength and corporate debt ratings positively or negatively. See Note 8 of the Notes to the Consolidated Financial Statements included under Item 8 for additional information about reserve development.\n72\nTable of Contents\nThe following table summarizes gross and net carried reserves for CNA’s Property & Casualty Operations:\nDecember 31\n2024\n2023\n(In millions)\n \n \n \n \n \nGross Case Reserves\n$\n6,589\n \n$\n5,759 \nGross IBNR Reserves\n15,093\n \n14,184 \nTotal Gross Carried Claim and Claim Adjustment Expense Reserves\n$\n21,682\n \n$\n19,943 \n \nNet Case Reserves\n$\n5,573\n \n$\n4,978 \nNet IBNR Reserves\n12,761\n \n12,235 \nTotal Net Carried Claim and Claim Adjustment Expense Reserves\n$\n18,334\n \n$\n17,213 \nThe following table summarizes the gross and net carried reserves for other insurance businesses in run-off, including CNA Re and A&EP:\nDecember 31\n2024\n2023\n(In millions)\n \n \n \n \n \nGross Case Reserves\n$\n1,241\n \n$\n1,353 \nGross IBNR Reserves\n1,431\n \n1,333 \nTotal Gross Carried Claim and Claim Adjustment Expense Reserves\n$\n2,672\n \n$\n2,686 \n \nNet Case Reserves\n$\n120\n \n$\n129 \nNet IBNR Reserves\n268\n \n239 \nTotal Net Carried Claim and Claim Adjustment Expense Reserves\n$\n388\n \n$\n368 \n73\nTable of Contents\nLife & Group Policyholder Reserves\nCNA’s Life & Group business includes its run-off long-term care business as well as structured settlement obligations not funded by annuities related to certain property and casualty claimants. Long-term care policies may provide benefits for nursing homes, assisted living facilities and home health care subject to various daily and lifetime caps. Generally, policyholders must continue to make periodic premium payments to keep the policy in force and CNA has the ability to increase policy premiums, subject to state regulatory approval.\nCNA maintains future policy benefit reserves for its long-term care policies. Future policy benefit reserves for long-term care policies relate to policyholders that are currently receiving benefits, including claims that have been incurred but are not yet reported, as well as policyholders that are not yet receiving benefits. In developing the future policy benefit reserves, CNA’s actuaries perform a reserve review on an annual basis. During the annual review, historical policyholder morbidity, persistency, anticipated future premium rate increases and expense experience is reviewed and compared to the current best estimate actuarial assumption set for potential revision. On a quarterly basis, actuaries perform experience studies that monitor the appropriateness of best estimate actuarial assumptions against emerging experience to assess whether any updates to those assumptions are warranted. The determination of these reserves requires management to make estimates and assumptions about expected policyholder experience over the remaining life of the policies. Since policies may be in force for several decades, these assumptions are subject to significant estimation risk. Future policy benefit reserves are discounted as discussed in Note 1 to the Consolidated Financial Statements included under Item 8.\nIn addition, claim and claim adjustment expense reserves are maintained for CNA’s structured settlement obligations. In developing the claim and claim adjustment expense reserve estimates for CNA’s structured settlement obligations, CNA’s actuaries monitor mortality and expense experience on an annual basis. CNA’s recorded claim and claim adjustment expense reserves reflect CNA’s best estimate after incorporating the results of the most recent reviews. Claim and claim adjustment expense reserves for structured settlement obligations are discounted as discussed in Note 1 to the Consolidated Financial Statements included under Item 8.\nThe actuarial assumptions related to future policy benefit reserves for long-term care policies that management believes are subject to the most variability are morbidity, persistency and anticipated future premium rate increases. Morbidity is the frequency and severity of injury, illness, sickness and diseases contracted. Persistency is the percentage of policies remaining in force and can be affected by policy lapses, benefit reductions and death. Future premium rate increases are generally subject to regulatory approval, and therefore the exact timing and size of the approved rate increases are unknown. As a result of this variability, CNA’s long-term care reserves may be subject to material increases if actual experience develops adversely to its expectations.\nThe table below summarizes the estimated pretax impact on CNA’s results of operations from various hypothetical revisions to its liability for future policyholder benefits reserve assumptions. CNA has assumed that revisions to such assumptions would occur in each policy type, age and duration within each long-term care product. The impact of each sensitivity is discrete and does not reflect the impact one factor may have on another or the mitigating impact from management actions, which may include additional future premium rate increases. Although such hypothetical revisions are not currently required or anticipated, CNA believes they could occur based on past variances in experience and its expectations of the ranges of future experience that could reasonably occur. Any actual adjustment would be dependent on the specific policies affected and, therefore, may differ from the estimates summarized below. The estimated impacts to results of operations in the table below are after consideration of any net premium ratio impacts.\n74\nTable of Contents\nFor the year ended December 31, 2024\nEstimated Reduction to Pretax Income\n(In millions)\n \n \n \nHypothetical revisions\nMorbidity:\n2.5% increase in morbidity\n$\n290\n \n5% increase in morbidity\n590\n \nPersistency:\n5% decrease in active life mortality and lapse\n$\n160\n \n10% decrease in active life mortality and lapse\n310\n \nPremium rate actions:\n25% decrease in anticipated future premium rate increases\n$\n10\n \n50% decrease in anticipated future premium rate increases\n20\n \nAs part of the annual reserve review, statutory long-term care reserve adequacy is evaluated by premium deficiency testing, by comparing carried statutory reserves with best estimate reserves, which incorporates best estimate discount rate and liability assumptions in its determination. Statutory margin is the excess of carried reserves over best estimate reserves. As of September 30, 2024, statutory long-term care margin increased to $1.4 billion from $1.3 billion, primarily driven by a more favorable interest rate environment resulting in a higher yielding investment portfolio.\n \nThe following tables summarize policyholder reserves for CNA’s long-term care operations:\nDecember 31, 2024\nClaim and claim adjustment expenses\nFuture \npolicy benefits\nTotal\n(In millions)\n \n \n \n \n \n \n \nLong-term care\n$\n13,158\n \n$\n13,158\n \nStructured settlement and other\n$\n541\n \n541\n \nTotal\n541\n \n13,158\n \n13,699\n \nCeded reserves\n81\n \n81\n \nTotal gross reserves\n$\n622\n \n$\n13,158\n \n$\n13,780\n \nDecember 31, 2023\nLong-term care\n$\n13,959 \n$\n13,959 \nStructured settlement and other\n$\n582 \n582 \nTotal\n582 \n13,959 \n14,541 \nCeded reserves\n93 \n93 \nTotal gross reserves\n$\n675 \n$\n13,959 \n$\n14,634 \nCATASTROPHES AND RELATED REINSURANCE\nVarious events can cause catastrophe losses. These events can be natural or man-made, including hurricanes, tornadoes, windstorms, earthquakes, hail, severe winter weather, fires, floods, riots, strikes, civil unrest, cyber attacks, pandemics and acts of terrorism that produce unusually large aggregate losses. In most, but not all cases, CNA’s catastrophe losses from these events in the U.S. are defined consistent with the definition of the Property Claims Service (“PCS”). PCS defines a catastrophe as an event that causes damage of $25 million or more in direct insured losses to property and affects a significant number of policyholders and insurers. For events outside of the U.S., CNA defines a catastrophe as an industry recognized event that generates an accumulation of claims amounting to more than $1 million for the International line of business.\n75\nTable of Contents\nCatastrophes are an inherent risk of the property and casualty insurance business and have contributed to material period-to-period fluctuations in CNA’s results of operations and/or equity. Catastrophe losses, net of reinsurance, of $358 million and $236 million were recorded for the years ended December 31, 2024 and 2023. Catastrophe losses for the years ended December 31, 2024 and 2023 were driven by severe weather related events, including $71 million for Hurricane Helene and $33 million for Hurricane Milton in 2024.\nCNA uses various analyses and methods, including using one of the industry standard natural catastrophe models, to estimate hurricane and earthquake losses at various return periods and to inform underwriting and reinsurance decisions designed to manage its exposure to catastrophic events. CNA generally seeks to manage its exposure through the purchase of catastrophe reinsurance and utilize various reinsurance programs to mitigate catastrophe losses, including excess-of-loss occurrence and aggregate treaties covering property and workers’ compensation, a property quota share treaty and the Terrorism Risk Insurance Program Reauthorization Act of 2019 (“TRIPRA”), as well as individual risk agreements that reinsure from losses from specific classes or lines of business. CNA conducts an ongoing review of its risk and catastrophe reinsurance coverages and from time to time makes changes as it deems appropriate. The following discussion summarizes CNA’s most significant catastrophe reinsurance coverage at January 1, 2025.\nGroup North American Property Treaty\nCNA purchased corporate catastrophe excess-of-loss treaty reinsurance covering its U.S. states and territories and Canadian property exposures underwritten in its North American and European companies. The treaty has a term of June 1, \n2024\n to June 1, 2025 and provides coverage for the accumulation of covered losses from catastrophe occurrences above CNA’s per occurrence retention of $250 million up to $1.4 billion for all losses. Losses stemming from terrorism events are covered unless they are due to a nuclear, biological or chemical attack. All layers of the treaty provide for one full reinstatement.\nGroup Workers’ Compensation Treaty\nCNA also purchased corporate Workers’ Compensation catastrophe excess-of-loss treaty reinsurance for the period January 1, 2025 to January 1, 2026  providing $275 million of coverage for the accumulation of covered losses related to natural catastrophes above CNA’s per occurrence retention of $25 million. The treaty also provides $775 million of coverage for the accumulation of covered losses related to terrorism events above CNA’s per occurrence retention of $25 million. Of the $775 million in terrorism coverage, $200 million is provided for nuclear, biological, chemical and radiation events. All layers of the treaty provide for one full reinstatement.\nTerrorism Risk Insurance Program Reauthorization Act of 2019\nCNA’s principal reinsurance protection against large-scale terrorist attacks, including nuclear, biological, chemical or radiological attacks, is the coverage currently provided through TRIPRA which runs through the end of 2027. TRIPRA provides a U.S. government backstop for insurance-related losses resulting from any “act of terrorism,” which is certified by the Secretary of Treasury in consultation with the Secretary of Homeland Security for losses that exceed a threshold of $200 million industry-wide for the calendar year 2025. Under the current provisions of the program, in 2025 the federal government will reimburse 80% of CNA’s covered losses in excess of its applicable deductible up to a total industry program cap of $100 billion. CNA’s deductible is based on eligible commercial property and casualty earned premiums for the preceding calendar year. Based on \n2024\n earned premiums, CNA’s estimated deductible under the program is $1.2 billion for 2025. If an act of terrorism or acts of terrorism result in covered losses exceeding the $100 billion annual industry aggregate limit, Congress would be responsible for determining how additional losses in excess of $100 billion will be paid.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of the Consolidated Financial Statements in conformity with GAAP requires us to make estimates and assumptions that affect the amounts reported on the Consolidated Financial Statements and the related notes. Actual results could differ from those estimates.\nThe Consolidated Financial Statements and accompanying notes have been prepared in accordance with GAAP, applied on a consistent basis. We continually evaluate the accounting policies and estimates used to prepare the Consolidated Financial Statements. In general, our estimates are based on historical experience, evaluation of current trends, information from third party professionals and various other assumptions that we believe are reasonable under the known facts and circumstances.\n76\nTable of Contents\nWe consider the accounting policies discussed below to be critical to an understanding of our Consolidated Financial Statements as their application places the most significant demands on our judgment. Due to the inherent uncertainties involved with these types of judgments, actual results could differ significantly from estimates and may have a material adverse impact on our results of operations, financial condition, equity, business and/or CNA’s insurer financial strength and corporate debt ratings.\nInsurance Reserves\nInsurance reserves are established for both short and long-duration insurance contracts. Short-duration contracts are primarily related to property and casualty insurance policies where the reserving process is based on actuarial estimates of the amount of loss, including amounts for known and unknown claims. Long-duration contracts are primarily related to long-term care policies and the reserves are recorded as Future policy benefits reserves as discussed below. The reserve for unearned premiums represents the portion of premiums written related to the unexpired terms of coverage.\n \nIf the recorded reserves are insufficient to cover the estimated ultimate unpaid liability, an increase to the insurance reserves may be needed. \nThe reserving process is discussed in further detail in the Insurance Reserves section of this MD&A.\nLong Term Care Reserves\nFuture policy benefits reserves for long-term care policies are based on certain actuarial assumptions, including morbidity, persistency, anticipated future premium rate increases and expenses. The adequacy of the reserves is contingent upon actual experience and future expectations related to these key assumptions. If actual or expected future experience differs from these assumptions, the reserves may not be adequate, requiring an increase to reserves.\n \nThe reserves are discounted using upper-medium grade fixed income instrument yields as of each reporting date. In addition, regulatory approval may not be received for the level of premium rate increases requested. The reserving process is discussed in further detail in the Insurance Reserve section of this MD&A. \nReinsurance and Other Receivables\nExposure exists with respect to the collectibility of ceded property and casualty and life reinsurance to the extent that any reinsurer is unable to meet its obligations or disputes the liabilities CNA has ceded under reinsurance agreements. An allowance for doubtful accounts on reinsurance receivables is recorded on the basis of periodic evaluations of balances due from reinsurers, reinsurer financial strength rating and solvency, industry experience and current and forecast economic conditions. Further information on CNA’s reinsurance receivables is included in Note 17 of the Notes to Consolidated Financial Statements included under Item 8.\nAdditionally, exposure exists with respect to the collectibility of amounts due from customers on other receivables. An allowance for doubtful accounts is recorded on the basis of periodic evaluations of balances due, currently as well as in the future, historical business default data, management’s experience and current and forecast economic conditions.\nIf actual experience differs from the estimates made by management in determining the allowances for doubtful accounts on reinsurance and other receivables, net receivables as reflected on our Consolidated Balance Sheets may not be collected. Further information on CNA’s process for determining the allowance for doubtful accounts on reinsurance and insurance receivables is in Note 1 to the Consolidated Financial Statements included under Item 8.\nValuation of Investments and Impairment of Securities\nFixed maturity and equity securities are carried at fair value on the balance sheet. Fair value represents the price that would be received in a sale of an asset in an orderly transaction between market participants on the measurement date, the determination of which may require us to make a significant number of assumptions and judgments. Securities with the greatest level of subjectivity around valuation are those that rely on inputs that are significant to the estimated fair value and that are not observable in the market or cannot be derived principally from or corroborated by observable market data. These unobservable inputs are based on assumptions consistent with what we believe other market participants would use to price such securities. Further information on fair value measurements is included in Note 4 of the Notes to Consolidated Financial Statements included under Item 8.\nCNA’s fixed maturity securities are subject to market declines below amortized cost that may result in the recognition of impairment losses in earnings. Factors considered in the determination of whether or not an impairment loss is recognized in earnings include a current intention or need to sell the security or an indication that a credit loss exists. Significant judgment is required in the determination of whether a credit loss has occurred for a security. CNA considers all available evidence when determining whether a security requires a credit allowance to be recorded, including the financial condition \n77\nTable of Contents\nand expected near-term and long-term prospects of the issuer, whether the issuer is current with interest and principal payments, credit ratings on the security or changes in ratings over time, general market conditions, industry, sector or other specific factors and whether CNA expects to receive cash flows sufficient to recover the entire amortized cost basis of the security.\nCNA’s mortgage loan portfolio is subject to the expected credit loss model, which requires immediate recognition of estimated credit losses over the life of the asset and the presentation of the asset at the net amount expected to be collected. Significant judgment is required in the determination of estimated credit losses and any changes in CNA’s expectation of the net amount to be collected are recognized in earnings.\nFurther information on CNA’s process for evaluating impairments and expected credit losses is included in Note 1 of the Notes to Consolidated Financial Statements included under Item 8.\nACCOUNTING STANDARDS UPDATE\nFor a discussion of accounting standards updates that have been adopted, please read Note 1 of the Notes to Consolidated Financial Statements included under Item 8.",
  "item2": null
}