{
  "source_file": "ldos-20251003.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of Leidos Holdings, Inc.'s (\"Leidos\") financial condition, results of operations, and quantitative and qualitative discussion about business environment and trends should be read in conjunction with Leidos' condensed consolidated financial statements and related notes. \nThe following discussion contains forward-looking statements, including statements regarding our intent, belief or current expectations with respect to, among other things, trends affecting our financial condition or results of operations, backlog, our industry, the impact of our merger and acquisition activity, government budgets and spending, our business contingency plans, interest rates and uncertainties in tax due to new tax legislation or other regulatory developments. In some cases, forward-looking statements can be identified by words such as “will,” “expect,” “estimate,” “plan,” “potential,” “continue” or similar expressions. Such statements are not guarantees of future performance and involve risks and uncertainties and actual results may differ materially from those in the forward-looking statements as a result of various factors. Some of these factors include, but are not limited to, the risk factors set forth in our Annual Report on Form 10-K, as updated by the risk factor in this report under Part II, Item 1A. \"Risk Factors\" and as may be further updated in subsequent filings with the U.S. Securities and Exchange Commission. Due to such uncertainties and risks, you are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. We do not undertake any obligation to update these factors or to publicly announce the results of any changes to our forward-looking statements due to future events or developments.\nUnless indicated otherwise, references in this report to \"we,\" \"us\" and \"our\" refer collectively to Leidos and its consolidated subsidiaries.\nOVERVIEW\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 47,000 global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Our customers include the U.S. Department of Defense (\"DoD\"), the U.S. Intelligence Community, the U.S. Department of Homeland Security, the Federal Aviation Administration, the Department of Veterans Affairs, National Aeronautics and Space Administration and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. \nBUSINESS ENVIRONMENT AND TRENDS\nU.S. GOVERNMENT MARKETS\nDuring both the three and nine months ended October 3, 2025, and September 27, 2024, we generated approximately 87%, of total revenues from contracts with the U.S. government. Accordingly, our business performance is affected by the overall level of U.S. government spending, especially national security, homeland security and intelligence spending, and the alignment of our service and product offerings and capabilities with current and future budget priorities of the U.S. government.\nOn October 1, 2025, the federal government shutdown following the expiration of a continuing resolution. Congress is currently working to reopen the federal government and is engaged in ongoing negotiations. As a result of the government shutdown, we may experience reduced or delayed work on existing contracts and there may be delays in other government contracting actions and payments. Once the government reopens, Congress will resume consideration of the Fiscal Year 2026 appropriations bills, with the goal of completing them by the end of the current calendar year. \nLeidos Holdings, Inc.\n23\nTable of Contents\nPART I—FINANCIAL INFORMATION\nINTERNATIONAL MARKETS\nSales to customers in international markets represented approximately 8% of total revenues for both the three\n \nand\n \nnine months ended October 3, 2025, and September 27, 2024. Our international customers include foreign governments and their agencies. Our international business increases our exposure to international markets and the associated international regulatory, foreign currency exchange rate and geopolitical risks.\nChanges in international trade policies, including higher tariffs on imported goods and materials, may increase the cost of certain goods necessary to fulfill our contractual requirements and for internal purposes. We expect to recover certain portions of the increase to the cost of goods through contractual measures. While we continue to evaluate the tariff environment and potential impacts of higher tariffs, we currently do not expect them to have a significant effect on our business.\nRESULTS OF OPERATIONS\nThe following table summarizes our condensed consolidated results of operations for the periods presented:\nThree Months Ended\nNine Months Ended\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nRevenues\n$\n4,469\n \n$\n4,190 \n6.7\n%\n$\n12,967\n \n$\n12,297 \n5.4\n%\nOperating income\n535\n \n516 \n3.7\n%\n1,636\n \n1,406 \n16.4 \n%\nNon-operating expense, net\n(51)\n(46)\n10.9\n%\n(156)\n(142)\n9.9\n%\nIncome before income taxes\n484\n \n470 \n3.0\n%\n1,480\n \n1,264 \n17.1 \n%\nIncome tax expense\n(115)\n(108)\n6.5\n%\n(353)\n(295)\n19.7\n%\nNet income\n369\n \n362 \n1.9\n%\n1,127\n \n969 \n16.3 \n%\nNet income attributable to Leidos common stockholders\n$\n367\n \n$\n364 \n0.8\n%\n$\n1,121\n \n$\n970 \n15.6 \n%\nOperating margin\n12.0\n%\n12.3\n%\n12.6\n%\n11.4\n%\nSEGMENT AND CORPORATE RESULTS\nThree Months Ended\nNine Months Ended\nNational Security & Digital\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nRevenues\n$\n2,015\n \n$\n1,865 \n8.0\n%\n$\n5,765\n \n$\n5,471 \n5.4\n%\nOperating income\n191\n \n187 \n2.1\n%\n564\n \n545 \n3.5\n%\nOperating margin\n9.5\n%\n10.0\n%\n9.8\n%\n10.0\n%\nThe increase in revenues for the three months ended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to program wins, a net increase in volumes and $26 million of revenues recognized from the acquisition of Savanna Industries, Inc. (\"Kudu Dynamics\"), partially offset by the completion of certain contracts.\nThe increase in revenues for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins, a net increase in volumes on certain programs and $38 million of revenues recognized from the acquisition of Kudu Dynamics, partially offset by the completion of certain contracts.\nThe increase in operating income for the three months\n \nended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to program wins.\nThe increase in operating income for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins and a net increase in volumes, partially offset by the completion of certain contracts.\n24\nLeidos Holdings, Inc.\nTable of Contents\nPART I—FINANCIAL INFORMATION\nThree Months Ended\nNine Months Ended\nHealth & Civil\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nRevenues\n$\n1,301\n \n$\n1,225 \n6.2\n%\n$\n3,864\n \n$\n3,687 \n4.8\n%\nOperating income\n328\n \n287 \n14.3\n%\n938\n \n816 \n15.0\n%\nOperating margin\n25.2\n%\n23.4\n%\n24.3\n%\n22.1\n%\nThe increase in revenues and operating income for the three and nine months\n \nended October 3, 2025, as compared to the three and nine months\n \nended September 27, 2024, was primarily attributable to increased volumes and net write-ups on certain programs within the managed health services business. \nThree Months Ended\nNine Months Ended\nCommercial & International\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nRevenues\n$\n571\n \n$\n578 \n(1.2\n%)\n$\n1,705\n \n$\n1,648 \n3.5\n%\nOperating income\n38\n \n41 \n(7.3\n%)\n115\n \n64 \n79.7\n%\nOperating margin\n6.7\n%\n7.1\n%\n6.7\n%\n3.9\n%\nThe decrease in revenues for the three months ended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to the completion of certain contracts, partially offset by program wins.\nThe increase in revenues for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins and prior year write-downs on certain programs within our UK operations, partially offset by completion of certain programs and a net decrease in volumes. \nThe decrease in operating income for the three months\n \nended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to an increase in technological investments and operating costs, partially offset by a net increase in volumes, net write-ups on certain programs and product mix.\nThe increase in operating income for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable prior year write-downs on certain programs within our UK operations, program wins and product mix, partially offset by completion of certain contracts and an increase in technological investments and operating costs.\nThree Months Ended\nNine Months Ended\nDefense Systems\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nRevenues\n$\n582\n \n$\n522 \n11.5\n%\n$\n1,633\n \n$\n1,491 \n9.5\n%\nOperating income\n37\n \n37 \n—\n%\n112\n \n92 \n21.7\n%\nOperating margin\n6.4\n%\n7.1\n%\n6.9\n%\n6.2\n%\nThe increase in revenues for the three months ended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to a net increase in volumes and program wins, partially offset by the completion of certain contracts.\nThe increase in revenues for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins and a net increase in volumes, partially offset by the completion of certain contracts.\nWhile revenues increased for the three months\n \nended October 3, 2025, as compared to the three months ended September 27, 2024, operating income remained consistent. This was primarily attributable to higher material costs for production programs in their initial phases.\nThe increase in operating income for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to program wins and a decrease in amortization expense in the current year.\nLeidos Holdings, Inc.\n25\nTable of Contents\nPART I—FINANCIAL INFORMATION\nThree Months Ended\nNine Months Ended\nCorporate\n(dollars in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOctober 3,\n2025\nSeptember 27,\n2024\nPercent change\nOperating loss\n$\n(59)\n$\n(36)\n63.9\n%\n$\n(93)\n$\n(111)\n(16.2\n%)\nThe increase in operating loss for the three months ended October 3, 2025, as compared to the three months ended September 27, 2024, was primarily attributable to a $24 million increase in legal reserves and general and administrative expenses.\nThe decrease in operating loss for the nine months ended October 3, 2025, as compared to the nine months ended September 27, 2024, was primarily attributable to decreased legal fees, a $25 million insurance reimbursement for legal costs primarily incurred prior to fiscal year 2025 and lower acquisition and integration costs.\nNON-OPERATING EXPENSE, NET\nNon-operating expense, net for the three months ended October 3, 2025, was $51 million as compared to $46 million for the three months ended September 27, 2024. The increase was primarily driven by increased interest expense as a result of the two $500 million senior notes issued in February 2025.\nNon-operating expense, net for the nine months ended October 3, 2025, was $156 million as compared to $142 million for the nine months ended September 27, 2024. The increase was primarily driven by increased interest expense as a result of the two $500 million senior notes issued in February 2025 and unfavorable exchange rate movements.\nPROVISION FOR INCOME TAXES\nOn July 4, 2025, tax legislation was enacted in H.R.1 Reconciliation Act, commonly referred to as the One Big Beautiful Bill Act (the “OBBBA”) implementing several corporate tax law changes, including but not limited to, (1) restoring the immediate expensing of U.S. research and development costs; (2) allowing certain taxpayers an election to deduct the unamortized balance of U.S. research and development costs capitalized in prior years; and (3) reinstating one hundred percent bonus depreciation for eligible property. Based upon our interpretation of the law as currently enacted, we estimate that income taxes payable and net deferred taxes will be $270 million and $235 million, respectively, lower at January 2, 2026, than our estimates prior to the OBBBA enactment.\nFor the three months ended October 3, 2025, our effective tax rate was 23.8% compared to 23.0% for the three months ended September 27, 2024. The increase to the effective tax rate was primarily due to impacts from the OBBBA, partially offset by a decrease in valuation allowance compared to the prior year quarter.\nFor the nine months ended October 3, 2025, our effective tax rate was 23.9% compared to 23.3% for the nine months ended September 27, 2024. The increase to the effective tax rate was primarily due to impacts from the OBBBA.\nBOOKINGS AND BACKLOG\nEffective for the first quarter of fiscal 2025, we changed our backlog policy to include estimated future revenue on task orders expected to be awarded under sole source indefinite delivery/indefinite quantity (\"IDIQ\") contracts in our reported backlog. We believe this presentation provides enhanced visibility for investors and more accurately reflects the future revenues we expect to generate from our business. \nWe recorded net bookings worth an estimated $5.9 billion and $11.9 billion during the three\n \nand nine months ended October 3, 2025, respectively, as compared to $8.0 billion and $15.8 billion for the three\n \nand nine months ended September 27, 2024, respectively. \n26\nLeidos Holdings, Inc.\nTable of Contents\nPART I—FINANCIAL INFORMATION\nThe estimated value of our total backlog was as follows:\nOctober 3, 2025\nSeptember 27, 2024\n(1)\n(in millions)\nFunded\nUnfunded\nTotal\nFunded\nUnfunded\nTotal\nNational Security & Digital\n$\n3,203\n \n$\n23,246\n \n$\n26,449\n \n$\n3,323 \n$\n20,908 \n$\n24,231 \nHealth & Civil\n1,866\n \n9,043\n \n10,909\n \n1,536 \n10,002 \n11,538 \nCommercial & International\n2,549\n \n2,398\n \n4,947\n \n2,631 \n2,022 \n4,653 \nDefense Systems\n1,446\n \n3,905\n \n5,351\n \n1,602 \n3,489 \n5,091 \nTotal\n$\n9,064\n \n$\n38,592\n \n$\n47,656\n \n$\n9,092 \n$\n36,421 \n$\n45,513 \n(1) \nAmounts have been recast to include estimated future revenue on task orders expected to be awarded under sole source IDIQ contracts. As a result, unfunded backlog increased $4,952 million.\nBacklog at October 3, 2025, includes $149 million acquired through the acquisition of Kudu Dynamics within our National Security & Digital reportable segment.\nBacklog represents the revenues we expect to recognize under negotiated contracts and unissued task orders on sole source IDIQ contracts, to the extent we believe their execution and funding to be probable. Backlog does not include potential task orders expected to be awarded under multiple award IDIQ contracts.\nBacklog estimates are subject to change and may be affected by factors including modifications of contracts and foreign currency movements. \nLIQUIDITY AND CAPITAL RESOURCES\nOVERVIEW OF LIQUIDITY\nAs of October 3, 2025, we had $974 million in cash and cash equivalents. We have a senior unsecured revolving credit facility which can provide up to $1 billion in additional borrowing, if required. As of October 3, 2025, and January 3, 2025, there were no borrowings outstanding under the revolving credit facility.\nWe had outstanding debt of $4.7 billion at both October 3, 2025, and January 3, 2025. In February 2025, we issued and sold $500 million 5.40% and $500 million 5.50% senior unsecured notes maturing in March 2032 and March 2035, respectively. The annual interest rate is payable on a semi-annual basis. The proceeds from the issuance of the notes were used to retire the $500 million senior unsecured notes due May 2025 and repurchase $500 million outstanding shares of common stock in an accelerated share repurchase agreement (“ASR”) as discussed below.\nWe have a commercial paper program in which we may issue short-term unsecured commercial paper notes (\"Commercial Paper Notes\") and have maturities of up to 397 days from the date of issuance. As of October 3, 2025, and January 3, 2025, we did not have any Commercial Paper Notes outstanding.\nWe made principal payments on our debt of $455 million and $1,014 million during the three\n \nand nine months ended October 3, 2025, respectively, and $5 million and $14 million for the three\n \nand nine months ended September 27, 2024, respectively. The activity for the three months ended October 3, 2025, included a prepayment on our senior unsecured term loan of $450 million and the activity for the nine months ended October 3, 2025, also included a $500 million payment to discharge the $500 million notes due May 2025.\nOur senior unsecured term loan, senior unsecured notes and senior unsecured revolving facility contain financial covenants and customary restrictive covenants. We were in compliance with all financial covenants as of October 3, 2025.\nWe paid dividends of $51 million and $156 million during the three and nine months ended October 3, 2025, respectively, and $51 million and $155 million during the three and nine months ended September 27, 2024, respectively.\nStock repurchases of Leidos common stock may be made on the open market or in privately negotiated transactions with third parties including through ASR agreements. Whether repurchases are made and the timing and actual number of shares repurchased depends on a variety of factors including price, corporate capital requirements, other market conditions and regulatory requirements. Repurchases may be accelerated, suspended, delayed or discontinued at any time. \nLeidos Holdings, Inc.\n27\nTable of Contents\nPART I—FINANCIAL INFORMATION\nOn February 20, 2025, we entered into an ASR agreement with a financial institution to repurchase shares of our outstanding common stock. We paid $500 million to the financial institution and received an initial delivery of 3 million shares at an average price of $131.50 per share. In May 2025, we received the final delivery of 0.6 million shares related to the ASR agreement. The total number of shares that we received under the ASR agreement was based on the volume-weighted-average-price of $138.44 per share, net of a discount, for the period February 20, 2025, to May 20, 2025.\nThe purchase was recorded to \"Additional paid-in capital\" in the condensed consolidated balance sheets (see \"Note 8–Earnings Per Share\"). All shares delivered were immediately retired.\nWe made open market repurchases of our common stock for an aggregate purchase price of $100 million during both the three and nine months ended October 3, 2025, and $200 million and $450 million during the three and nine months ended September 27, 2024, respectively.\nOn July 4, 2025, tax legislation was enacted as part of the OBBBA, implementing several corporate tax law changes as described above within Results of Operations. We anticipate our federal and state tax payments will decrease by approximately $150 million in fiscal 2025, as compared to our estimates prior to the OBBBA enactment, primarily due to the decrease in our estimated 2025 taxable income related to these changes. The actual decrease may be impacted by future guidance or interpretive rules issued by the U.S. Treasury, among other factors. We will continue to assess the effects on our liquidity as tax legislation evolves. \nFor the next 12 months, we anticipate that we will be able to meet our liquidity needs, including servicing our debt, through cash generated from operations, available cash balances, borrowings from our commercial paper program and, if needed, sales of accounts receivable and borrowings from our revolving credit facility.\nSUMMARY OF CASH FLOWS\nThe following table summarizes cash flow information for the periods presented:\nThree Months Ended\nNine Months Ended\n(in millions)\nOctober 3,\n2025\nSeptember 27,\n2024\nOctober 3,\n2025\nSeptember 27,\n2024\nNet cash provided by operating activities\n(1)\n$\n711\n \n$\n647 \n$\n1,255\n \n$\n1,141 \nNet cash used in investing activities\n(36)\n(23)\n(372)\n(56)\nNet cash used in financing activities\n(595)\n(257)\n(788)\n(644)\n(1) Net cash provided by operating activities for the three and nine months ended September 27, 2024, was recast to reflect a change in the accounting policy, see \"Note 1–Basis of Presentation and Summary of Significant Accounting Policies.\"\nNet cash provided by operating activities increased $64 million during the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to an increase in tax benefits from the impacts of the OBBBA legislation and favorable changes in working capital, partially offset by the timing of payroll and employee benefit payments.\nNet cash provided by operating activities increased $114 million during the nine months ended October 3, 2025, when compared to the prior year. The increase was primarily due to an increase in tax benefits from the impacts of the OBBBA legislation, partially offset by the timing of payroll and employee benefit payments.\nNet cash used in investing activities increased $13 million for the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to higher capital expenditures and a $7 million payment related to the acquisition of Kudu Dynamics.\nNet cash used in investing activities increased $316 million for the nine months ended October 3, 2025, when compared to the prior year. The increase was primarily due to $292 million of net cash paid related to the acquisition of Kudu Dynamics and higher capital expenditures.\nNet cash used in financing activities increased $338 million for the three months ended October 3, 2025, when compared to the prior year quarter. The increase was primarily due to a $450 million prepayment on our senior unsecured term loan, partially offset by a $100 million decrease in stock repurchases in the current year quarter.\nNet cash used in financing activities increased $144 million for the nine months ended October 3, 2025, when compared to the prior year primarily due to a $150 million increase in stock repurchases, a $10 million increase in payments for debt activities, partially offset by a $11 million decrease in shares withheld for tax obligations.\n28\nLeidos Holdings, Inc.\nTable of Contents\nPART I—FINANCIAL INFORMATION\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have outstanding performance guarantees and cross-indemnity agreements in connection with certain aspects of our business. We also have letters of credit outstanding principally related to performance guarantees on contracts and surety bonds outstanding principally related to performance and subcontractor payment bonds as described in \"Note 11–Commitments and Contingencies\" of the notes to the condensed consolidated financial statements contained within this Quarterly Report on Form 10-Q. These arrangements have not had, and management does not believe it is likely that they will in the future have, a material effect on our liquidity, capital expenditures or capital resources, operations or financial condition.\nGUARANTOR AND ISSUER OF GUARANTEED SECURITIES\nLeidos Holdings, Inc. (“Guarantor”) has fully and unconditionally guaranteed the debt securities of its subsidiary, Leidos, Inc. (“Issuer”), that were issued pursuant to transactions that were registered under the Securities Act of 1933, as amended (collectively, the “Registered Notes”). The following is a list of the Registered Notes guaranteed by Leidos Holdings, Inc.\nSenior unsecured Registered Notes issued by Leidos, Inc.:\n$500 million 3.625% notes, due May 2025\n(1)\n$750 million 4.375% notes, due May 2030\n$1,000 million 2.300% notes, due February 2031\n$500 million 5.400% notes, due March 2032\n$750 million 5.750% notes, due March 2033\n$500 million 5.500% notes, due March 2035\n(1)\n \nThe $500 million senior unsecured notes were discharged as of April 4, 2025. \nLeidos Holdings, Inc. has also fully and unconditionally guaranteed debt securities of Leidos, Inc. that were issued pursuant to transactions that were not registered under the Securities Act of 1933, as amended. The following is a list of unregistered debt securities guaranteed by Leidos Holdings, Inc.\nSenior unsecured unregistered debt securities issued by Leidos, Inc.:\n$250 million 7.125% notes, due July 2032\n$300 million 5.500% notes, due July 2033\nAdditionally, Leidos, Inc. has fully and unconditionally guaranteed debt securities of Leidos Holding, Inc. that were issued pursuant to transactions that were not registered under the Securities Act of 1933, as amended. The following is a list of unregistered debt securities guaranteed by Leidos, Inc.\nSenior unsecured unregistered debt securities issued by Leidos Holdings, Inc.:\n$300 million 5.950% notes, due December 2040\nThe following summarized financial information includes the assets, liabilities and results of operations for the Guarantor and Issuer of the Registered Notes described above. Intercompany balances and transactions between the Issuer and Guarantor have been eliminated from the financial information below. Investments in the consolidated subsidiaries of the Issuer and Guarantor that do not guarantee the senior unsecured notes have been excluded from the financial information. Intercompany payables represent amounts due to non-guarantor subsidiaries of the Issuer.\nLeidos Holdings, Inc.\n29\nTable of Contents\nPART I—FINANCIAL INFORMATION\nBALANCE SHEET INFORMATION FOR THE GUARANTOR AND ISSUER OF REGISTERED NOTES\n(in millions)\nOctober 3,\n2025\nJanuary 3,\n2025\nTotal current assets\n$\n2,932\n \n$\n2,550 \nGoodwill\n5,673\n \n5,673 \nOther long-term assets\n1,263\n \n1,498 \nTotal assets\n$\n9,868\n \n$\n9,721 \nTotal current liabilities\n$\n2,087\n \n$\n2,677 \nLong-term debt, net of current portion\n4,632\n \n4,052 \nIntercompany payables\n4,282\n \n3,319 \nOther long-term liabilities\n865\n \n820 \nTotal liabilities\n$\n11,866\n \n$\n10,868 \nSTATEMENT OF OPERATIONS INFORMATION FOR THE GUARANTOR AND ISSUER OF REGISTERED NOTES\nNine Months Ended\n(in millions)\nOctober 3,\n2025\nRevenues, net\n$\n8,130\n \nOperating income\n666\n \nNet income attributable to Leidos common stockholders\n12\n \nCONTRACTUAL OBLIGATIONS AND COMMITMENTS\nWe are subject to a number of reviews, investigations, claims, lawsuits, other uncertainties and future obligations related to our business. For a discussion of these items, see \"Note 11–Commitments and Contingencies\" of the notes to the condensed consolidated financial statements contained within this Quarterly Report on Form 10-Q.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThere were no material changes to our critical accounting policies, estimates or judgments that would have a significant impact on earnings during the period covered by this report from those discussed in our Annual Report on Form 10-K for the year ended January 3, 2025. \nRECENTLY ADOPTED AND ISSUED ACCOUNTING STANDARDS\nFor a discussion of these items, see \"Note 1–Basis of Presentation and Summary of Significant Accounting Policies\" of the notes to the condensed consolidated financial statements contained within this Quarterly Report on Form 10-Q.\n30\nLeidos Holdings, Inc.\nTable of Contents\nPART I—FINANCIAL INFORMATION"
}