{
  "source_file": "ldos-20250103.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOUR COMPANY\nLeidos Holdings, Inc. (“Leidos”), a Delaware corporation, is a holding company whose direct 100%-owned subsidiary and principal operating company is Leidos, Inc. Leidos was founded in 1969 by physicist Dr. Robert Beyster. Since our founding 56 years ago, we have applied our expertise in science, research and engineering in rapidly-evolving technologies and markets to solve complex problems of global concern.\nWe use the terms “we,” “us” and “our” to refer collectively to Leidos Holdings, Inc. and its consolidated subsidiaries. Leidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 48,000, global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Applying our technically-advanced solutions to help solve our customers’ most difficult problems has enabled us to build strong relationships with key customers. Our customers include the U.S. Department of Defense (“DoD”), the U.S. Intelligence Community, the U.S. Department of Homeland Security (“DHS”), the Federal Aviation Administration (“FAA”), the Department of Veterans Affairs (“VA”), National Aeronautics and Space Administration (“NASA”) and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. With a focus on delivering mission-critical solutions, Leidos generated 87% of revenues for the fiscal year ended January 3, 2025, (“fiscal 2024”) from U.S. government contracts, either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government. Approximately 8% of our revenues are generated by entities located outside of the United States.\nBy leveraging expertise in multiple disciplines, tailoring our services and solutions to the particular needs of our targeted markets and using advanced analytics, we work to securely deliver services and solutions that not only meet customers’ current goals, but also support their future missions. \nFor additional discussion and analysis related to recent business developments, see “Business Environment and Trends” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II of this Annual Report on Form 10-K.\nOUR BUSINESS SEGMENTS\nBeginning in fiscal 2024, we realigned our business and operate in four reportable segments that are focused on specific, defined capability sets we bring to our customers. As a result of this change, prior year segment results and disclosures have been recast to reflect the current reportable segment structure. We now operate in the following reportable segments: National Security & Digital, Health & Civil, Commercial & International and Defense Systems. We also separately present the unallocated costs associated with corporate functions as Corporate. \nWe provide a wide array of scientific, engineering and technical services and solutions across these reportable segments. \nNATIONAL SECURITY & DIGITAL\nOur National Security & Digital business provides leading-edge and technologically advanced services, solutions and products, as well as mission software capabilities for defense and intelligence customers in the areas of cyber, logistics, security operations and decision analytics. We also deliver IT operations and digital transformation programs across all U.S. federal government customers. Our advanced capabilities include the delivery of technology-enabled services, mission software capabilities and IT modernization services. Our capabilities allow us to provide innovative technology solutions in software development, engineering & design, modeling & simulation, analytics, cyber security, intelligence analysis, linguistics and mission operations.\nu\nMission Software – We deliver trusted national security software for defense, intelligence, and homeland security customers. Our mission software aims to provide the decision advantage for protecting the homeland, securing critical infrastructure, enabling logistics and conducting multi-domain operations. The core of this capability offering is our Secure Development Operations approach that is designed to ensure our code is secure and assured from the start, enabling our mission partners to focus on execution.\nLeidos Holdings, Inc. Annual Report\n3\nTable of Contents\nPART I\nu\nMulti-Domain Solutions – We provide services by using artificial intelligence and machine learning to coordinate sea, ground, air and space rapidly and securely, helping our warfighters have the right information at the right time to take action with decision advantage. We apply an open architecture approach to digitally connect the joint force across air, land, sea, cyber and space domains in support of the DoD’s multi-domain operations through innovative solutions, essential services and enriched data management tools facilitating critical decision making.\nu\nCyber Operations – We offer full-spectrum cyber solutions to include offensive, defensive, and physical cyber operations. We drive new advances for our customers in the areas of Zero Trust, Cognitive Cyber, Quantum Cryptography, Identity, Credential and Access Management. We deliver global-scale cryptographic management solutions to protect our customers’ most critical information and assets.\nu\nIntelligence Analysis, Mission Support, and Global Logistics Services – We provide intelligence analysis, operational support, logistics operations, security, linguistics, force production, biometrics, Chemical, Biological, Radiological, Nuclear, and Explosives, energetics, and training. In addition, we deliver tailored IT services and solutions to our customers. We offer product support and lifecycle sustainment services to our customers, including planning and managing the cost and performance across the product’s lifecycle. We offer reverse engineering, classified manufacturing and design, and threat exploitation services to U.S. Intelligence Community customers. We use predictive analytics and AI to securely deliver transformational logistics to our customers. We provide a wide range of integrated logistics systems, including rapid procurement, inventory and facility management, and distribution systems.\nu\nDigital Modernization – We provide worldwide digital support for our nation’s largest and most critical infrastructure. We design, develop, implement and maintain IT environments to provide stability and flexibility to mission needs. Our capabilities support offerings including cybersecurity, data analytics, and operations and logistics. Our cybersecurity solutions help detect and manage the most sophisticated cyber threats. \nu\nDigital Transformation – We deliver secure, user-centric IT solutions in cloud computing, mobility, application modernization, DevOps, data center and network modernization, asset management, help desk operations and digital workplace enablement. We help our customers achieve their missions and business goals by delivering purpose-built solutions, cybersecurity as a standard, efficient project delivery and end-user satisfaction. We accelerate enterprise transformation using customizable roadmaps and repeatable processes, enabling customers to effectively use their resources and advance their objectives. Using our cyber expertise, we continually enhance our techniques and processes to build systems that operate resiliently in the face of evolving cyber threats. Leidos is modernizing enterprise IT in classified and unclassified environments, including programs with the FAA, NASA, U.S. Department of Justice, Internal Revenue Service, U.S. MINT, U.S. Department of Commerce, U.S. Federal Trade Commission, and U.S. Department of Housing and Urban Development.\nNational Security & Digital represented 44% of total revenues for fiscal 2024, 47% of total revenues for both the fiscal year ended December 29, 2023 (“fiscal 2023”) and the fiscal year ended December 30, 2022 (“fiscal 2022”).\nHEALTH & CIVIL\nOur Health & Civil business provides services and solutions to federal and commercial customers in the areas of public health, care coordination, life and environmental sciences and transportation. We are dedicated to delivering effective and affordable solutions that are responsible for the health and well-being of people, including service members and veterans. Our core capabilities include health information management services, managed health services, systems and infrastructure modernization, and life sciences research and development. We help customers achieve their missions and take on the connected world with data-driven insights, improved efficiencies and technological advantages. Health & Civil represented 30% of total revenues for fiscal 2024 and 27% of total revenues for both fiscal 2023 and fiscal 2022.\nu\nTransportation Solutions – Leidos is a trusted systems developer, service provider and integrator serving Air Navigation Service Providers around the world, including the FAA. We provide air traffic control systems that help manage the world’s most complex airspace. We deliver many of the FAA’s key automation systems and services, including the En Route Automation Modernization (“ERAM”), Advanced Technologies and Oceanic Procedures (“ATOP”), Time Based Flow Management, Terminal Flight Data Manager, Enterprise-Information Display System, Geo-7 and Future Flight Services. Leidos received 10 plus year extensions to the ERAM and ATOP contracts for continued delivery of the evolving National Airspace System needs. In addition, under the Mode S Beacon Replacement Systems contract, Leidos is supporting the replacement of the FAA’s Mode S Beacon Systems, which are secondary surveillance radar capable of providing surveillance and specific aircraft information necessary to support Air Traffic Control automation in all traffic environments. We also provide key air traffic control systems around the world, including New Zealand and South Korea.\n4\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nu\nHealth Mission Software\n – Leidos employs holistic-systems used for fielding applied technology solutions across the entire continuum of healthcare. We deliver a single, common electronic health record to both DoD and VA hospitals and treatment facilities worldwide. Our responsibilities range from integrating software for the electronic healthcare record vendor and dental record vendors to integrating picture archiving and communications software and more. We support cybersecurity across all integrated systems. We also provide enterprise IT solutions to the VA, National Institutes of Health (“NIH”), DoD and other federal health customers to help operate mission critical infrastructure reliably and at a reasonable cost. \nu\nManaged Health Services – We deploy a national footprint of health clinics and health providers to support care delivery services, including medical disability and behavioral health examinations for the VA, as well as serving other independent medical exam markets. We have developed unique capabilities in behavioral health management through many decades of experience with a special emphasis on substance abuse services and non-medical counseling. We believe that these capabilities can be expanded into other clinical adjacencies. Our managed health services activities leverage our IT and mission enablement capabilities, which underpin solutions we offer to our customers across all of our served markets.\nu\nClimate, Energy and Environment – We believe that we are trusted by government agencies with substantial environmental and sustainability driven-missions. We strive to ensure that our reputation across climate science, environmental management and operations, nuclear security, infrastructure management, mission support and IT modernization provides the applicable expertise needed to transform operations while modernizing aging infrastructure and maintaining environmental stewardship. We support the critical missions of the Department of Energy (“DoE”), National Nuclear Security Administration, and National Science Foundation. At the DoE Hanford site, we provide site-wide infrastructure management and operation, including oversight of land and logistics, public works, information technology, fleet transportation, environmental sustainability, and compliance, first responder services and future project planning. At the National Energy Technology Laboratory, we actively conduct and support fundamental and applied research efforts, including providing product and logistical support comprising strategic business development, technology transfer and agreements and education and outreach support for the effective and efficient execution of research programs. \nu\nLife Sciences Research & Development – We provide life science research and development support to the NIH, Center for Disease Control, Army Medical Research community and commercial biotech companies. Most notably, on behalf of the U.S. government and the public trust, we operate the Frederick National Laboratory for Cancer Research, where we employ thousands of scientists, technicians, administrators and support staff. Our professionals operate a wide range of leading-edge research and development laboratories in the areas of genetics and genomics, proteins and proteomics, advanced biomedical computing and information technology, biopharmaceutical development and manufacturing, nanotechnology characterization and clinical trials management. \nFrom the biomedical sciences to implementing and optimizing electronic health records and enabling providers to perform care coordination and population health management, Leidos is pioneering the use of the depth and breadth of systems integration principles, processes and technologies to transform the health industry’s evolution towards better quality and more efficient and effective care.\nCOMMERCIAL & INTERNATIONAL\nCommercial & International delivers a portfolio of products, services, and solutions aimed at securing national assets, modernizing energy and critical infrastructure, and enhancing mission outcomes. Our key customers include Investor-Owned Utilities, government agencies in the United Kingdom and Australia, the Transportation Security Administration, U.S. Customs & Border Protection (\"CBP\"), as well as airports and ports and borders authorities. We offer a broad range of capabilities, including design and engineering services, security products and solutions, digital modernization, mission software, logistics, and airborne solutions. Commercial & International represented 14% of total revenues for both fiscal 2024 and 2023, and 13% of total revenues for fiscal 2022.\nu\nEnergy Infrastructure – Leidos partners with utilities seeking reliable energy modernization solutions, demonstrated by our strong relationships and collaboration with over 75 investor-owned utilities. Our project portfolio spans large-scale energy initiatives across the United States, serving electric utilities, generation owners, and industrial clients. We support utilities and industrial customers in modernizing power delivery systems for enhanced reliability, implementing energy management strategies, advancing vehicle electrification, transforming digital infrastructure, and optimizing operational efficiency to meet evolving energy demands and market expectations. Our expertise spans power grid engineering and design, grid modernization, utility planning and consulting, energy management and efficiency, technical and financial consulting, and technology-driven innovation, including software and application development. \nLeidos Holdings, Inc. Annual Report\n5\nTable of Contents\nPART I\nu\nGlobal Security Products and Services – Leidos is a global leader in fully integrated security detection solutions, enhancing the safety of screening and checkpoints for aviation, ports, borders, and critical infrastructure worldwide. With over 30,000 products deployed across more than 120 countries, we lead the aviation screening equipment sector, including people scanners, computed tomography carry-on baggage scanners, checked baggage scanners, and explosive trace detectors. Leidos is also the primary supplier of mobile, non-intrusive inspection systems to CBP and other international customers. Our Ports & Borders solutions secure the flow of travel and trade by effectively detecting and mitigating threats across cargo, vehicles, and individuals. Our digital solution features a secure and scalable open-architecture platform that transforms airport security by integrating disparate devices and technologies into a unified management system. This holistic approach provides real-time data and automated controls, improving throughput and operational efficiency.\nu\nInternational – Leidos delivers a wide range of mission-focused services across multiple domains to address critical threats and provide innovative solutions to government agencies in the UK and Australia. Our core areas of expertise include Digital Modernization, Mission Software, Logistics, and Airborne Solutions. In the UK, we are a trusted partner of the Ministry of Defense, delivering logistics and transformation solutions, developing advanced biometric and smart border protection systems to enhance national security, and leading IT service management and transformation programs. In Australia, we provide secure, resilient, and innovative technology solutions that support the Defense sector’s modern warfighting capabilities. We also conduct aerial border surveillance and search-and-rescue operations, covering Australia’s exclusive economic zone and search-and-rescue region.\nDEFENSE SYSTEMS\nDefense Systems addresses threats facing our nation by rapidly prototyping and delivering advanced hardware, software, and integrated systems solutions for the U.S. Department of Defense, Army, Navy, Air Force, Space Force, Marine Corps, United States Special Operations Command, NASA, Defense Advanced Research Projects Agency, intelligence agencies, and international customers. We are heavily engaged in the top defense Research Development Test and Evaluation priorities that are driven by critical evolving threat-driven needs. Defense Systems provides services in the air, land, sea, space and cyberspace environments. The Defense Systems business is dedicated to delivering cost-effective solutions in the space, airborne, land, maritime and cyber domains and supporting critical missions worldwide. Defense Systems represented 12% of total revenues for both fiscal 2024 and 2023, and 13% of total revenues for fiscal 2022.\nu\nAirborne Systems – Leidos develops and integrates mission-enhancing airborne solutions, equipping government and Leidos-owned fixed-wing, rotary-wing, and unmanned aircraft with advanced sensors and processing systems. We execute airborne training, intelligence, surveillance, and reconnaissance missions as a service for the DoD, the U.S. Intelligence Community, and military services worldwide. Our key served markets include aircraft integration and operations, sensor and autonomous systems, and Multi-Domain Operation enablers, addressing diverse missions such as target identification, border security, and counter-narcotics operations. We design and integrate open-architecture sensing systems powered by advanced sensors, algorithms, and processing capabilities to meet complex mission requirements. Beyond integration, we deliver high-end solutions and services globally, providing intelligence analysis, operational support, and logistics. Leidos airborne also designs and manufactures low-cost, high-impact airborne effectors, including guided munitions (e.g. GBU-69), cruise missiles (e.g. Black Arrow), and components for air-to-air and air-to-ground missions. In the realm of autonomous systems, we develop innovative software and hardware solutions for unmanned aerial systems and autonomous platforms. Our unique autonomy algorithms enhance system capabilities, decision-making, alleviate the burden on warfighters, and enable seamless coordination between manned and autonomous platforms, ensuring mission success in dynamic environments.\nu\nLand Systems – We develop Integrated Air and Missile Defense systems, including the US Army Enduring Indirect Fire Protection Capability and AirShield systems. Enduring Shield is a ground-based, mobile system that defends against cruise missiles and unmanned aircraft systems. The system protects and defends critical civilian and military infrastructure, bridging the gap between tactical short range air defense and strategic systems. We are delivering systems for Initial Operational Test & Evaluation, and we are under contract to deliver systems in support of Guam Defense. AirShield delivers robust air defense while on the move, providing capabilities among the most advanced in the industry. The system employs advanced threat assessment along with kinetic and non-kinetic effectors that is designed to provide air defense against unmanned aerial vehicles, particularly in dynamic operational environments. We design and manufacture persistent surveillance radar systems, advanced sensors, and radio frequency seekers, including the associated advanced algorithms that accompany them. We use this expertise to provide military sensor and electronic system R&D services for our customers. \n6\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nu\nMaritime Systems – On and under the sea, we offer a wide range of capabilities. We continue to enhance our surface and subsurface autonomous and unmanned technologies to help make maritime operations safer and more efficient for government and industry by providing innovative platforms, software solutions for vessel control and autonomous behaviors, leading sensor systems, signal processing, communications hardware and software to support these vital missions. We are a market leader in submarine data collection technologies and anti-submarine warfare system installation and maintenance and are expanding our capabilities in these areas to meet market demand for this growing threat. We also provide prototyping and research and development support services to a wide variety of DoD customers from concept analysis to classified manufacturing. Our naval architecture services span the entire ship’s lifetime, from early-stage concept designs through detailed design, shipyard construction support, full lifecycle and sustainment support, ship alterations, service life extensions, and disposal. Our marine engineering involves a wide range of activities, beginning with concept and feasibility design and continues through land-based test sites, cyber and shock hardening of key components, detailed design, construction support, life-cycle support and into ship-alt design for service-life extensions.\nu\nAerospace Systems – We provide expertise in the design, manufacturing, and integration of space-based electro-optic infrared system, multi/hyperspectral, electronic warfare and signals intelligence, and communications payloads. In space we provide sensor, algorithm development and integrated payload capabilities to identify and track threats and cue defensive systems. We have developed and delivered full integrated small satellite systems and are under contract for payload deliveries on the Space Development Agency Wide Field of View Tranches 0, 1, and 2 programs. We manufacture structures and thermal protection systems for hypersonic boost-glide missiles, and we provide testing services for hypersonic vehicles. \nu\nCyber and Threat Systems - We offer reverse engineering, classified manufacturing and design, and threat exploitation services to a wide breadth of U.S. Intelligence Community customers. We model, simulate, and analyze cyber and electro-magnetic threats, develop threat emulators for range testing, and develop cyber-physical solutions.\nCORPORATE\nCorporate includes the operations of various corporate activities, certain expense items that are not reimbursed by our U.S. government customers and certain other expense items excluded from a reportable segment’s performance. \nACQUISITIONS AND DIVESTITURES\nDuring fiscal 2022, we completed the acquisition of Cobham Aviation Services Australia’s Special Mission business. See “Note 5—Acquisitions and Divestitures” in Part II of this Annual Report on Form 10-K for further information.\nDuring fiscal 2023, we completed an immaterial disposition of a business within our Defense Solutions segment. During fiscal 2022, we completed the disposition of Aviation & Missile Solutions LLC within our Defense Solutions segment. For further information, see “Note 5—Acquisitions and Divestitures” in Part II of this Annual Report on Form 10-K.\nKEY CUSTOMERS\nThe majority of our revenues are generated in the United States. Our consolidated revenues are largely attributable to prime contracts or to subcontracts with other contractors engaged in work for the U.S. government, with the remaining attributable to international customers, including the UK Ministry of Defence and Australian Department of Defence, and customers across a variety of commercial markets. Within the U.S. government, our revenues are diversified across many agencies, including various intelligence agencies, the U.S. Army, Navy and Air Force, U.S Space Force, DHS, Defense Information Security Agency, FAA, Transportation Security Administration, CBP, Defense Health Agency, VA, Department of Health and Human Services, NASA, National Science Foundation, DoE, the Environmental Protection Agency and research agencies such as Defense Advanced Research Projects Agency. \nThese customers have a number of subsidiary agencies that have separate budgets and procurement functions. Our contracts may be with the highest level of these agencies or with the subsidiary agencies of these customers.\nLeidos Holdings, Inc. Annual Report\n7\nTable of Contents\nPART I\nHUMAN CAPITAL\nEMPLOYEE AND WORKFORCE DEMOGRAPHICS\nAs of January 3, 2025, we employed approximately 48,000 full and part-time employees of whom approximately 42,600 are located in the United States and the remainder of which are located in approximately 50 countries worldwide. Approximately 37% of our employees have degrees in science, technology, engineering or mathematics fields, approximately 24% of our employees have advanced degrees, 52% of our employees possess U.S. security clearances and approximately 19% of our employees are military veterans.\nAs of January 3, 2025, our workforce consisted of the following:\nGender of global employees\n(1)\nMale\n65 \n%\nFemale\n35 \n%\n(1)\nBased on employees who self-identify.\nAge of global employees\nLess than 30 years\n15 \n%\n30-50 years\n48 \n%\nGreater than 50 years\n37 \n%\nEthnicity of U.S. employees\n(1)\nWhite\n59 \n%\nBlack\n14 \n%\nAsian/Indian\n10 \n%\nHispanic/Latino\n10 \n%\nOther\n4 \n%\nUndisclosed\n3 \n%\n(1)\nBased on employees who self-identify.\nCULTURE AND CORPORATE VALUES\nLeidos has adopted six values that help define its culture: integrity, inclusion, innovation, agility, collaboration and commitment. These values provide a roadmap for our workplace behavior and help guide our business decisions. They are a key component of our corporate culture and are part of our employees’ annual performance assessments. Our values are based on our commitment to do the right thing for our customers, our employees and our communities. Our values are demonstrated by our employees as they help our customers execute important missions in the world’s most complex markets. \nOur policies, procedures, training and communications form a comprehensive program that promotes a culture of integrity as a foundation for employee conduct. For the seventh consecutive year, the Ethisphere Institute named Leidos one of the World’s Most Ethical Companies in 2024.\nOur approach to workplace culture and employee development focuses on education and best practices for leaders and employees. Leidos has programs designed to promote our corporate values throughout the enterprise and with our senior leadership. Leaders, managers and employees of the Company are required to take annual training to reinforce our corporate values.\nWe continue to grow and expand our learning and upskilling tools to develop and enhance our employees technical and leadership skills to actively maintain our workplace culture. Company councils continue to champion and integrate Leidos values across the enterprise and are comprised of employees across our business areas and functions with oversight and guidance from executive leadership.\n8\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nTALENT ACQUISITION PRACTICES\nLeidos is committed to promoting hiring practices that are designed and executed to recruit, hire, train and retain best-in-class talent, including building a deep and broad pipeline of candidates. We leverage college campuses, military veteran resources, industry associations, and other sources to expand our outreach. Each year we also attend and sponsor national conferences and local career fairs that target our key market segments and talent.\nOur military veteran outreach program attracts, retains and supports current veterans, transitioning service members and military spouses. Our college campus outreach engages talent from multiple university sources.\nCAREER MOBILITY AND GROWTH\nWe have a strong focus on our employees’ career, flexibility and well-being. We embrace what makes Leidos great by advancing a culture that helps every employee achieve personal and professional success. This is part of our broader Employee Value Proposition to 'break limits' and a commitment to make Leidos an even better place to work. Leidos empowers and challenges employees to continuously seek, share and apply new knowledge, skills and behaviors. We recognize the value of a high-performing workforce where every member of the team has an opportunity to feel motivated, valued and fulfilled, and have a purposeful and long career at Leidos. We provide resources, development, and experiential learning to enable employees to grow, including a talent marketplace where employees can fill temporary roles to develop skills or provide additional assistance. We provide leaders with the knowledge, skills and resources needed to coach employees and enable employees’ career development.\nWe value and develop a future-ready workforce to meet customer needs and stay ahead of emerging technologies. We have a strong technical upskilling and reskilling program to develop, mobilize and retain talent. We offer formal programs to help employees earn many industry-standard professional and technical certifications. Additionally, we offer tuition reimbursement and certification exam reimbursement to full-time employees at accredited universities.\nOur Internal Mobility Program has a dedicated team that proactively focuses on the mobilization of our employees. We teach employees how to use the tools and resources available to them and help them gain visibility across the enterprise. We assist managers and recruiters in identifying internal candidates for their programs. \nWe conduct formal employee engagement surveys to listen to employees and develop customized strategies to drive engagement, inclusion and retention across the organization.\nWe invest in our current and future leaders in several ways. We provide a variety of leadership development programs, targeted for each level of leader, and numerous resources for leader development. Annually, we host a two-day Leadership Summit for approximately 350 of our most senior leaders to align our growth strategy and transformation initiatives.\nThrough our ongoing talent planning processes, we identify and develop high-potential employees for future roles. We create succession plans for all executive-level positions as well as for other roles throughout the organization considered vital to our success. In addition, we establish development and engagement plans for top talent that may include formal training, mentoring, coaching, sponsorship and experiential learning opportunities. \nHEALTH AND WORKPLACE SAFETY\nOur primary focus is on the health and safety of our employees, with the physical and mental well-being of our employees being top priority. To support the physical and mental well-being of our employees, we provide many well-being and mental health benefits to all employees, including access to our Employee Assistance Program, Headspace, Personify Health and meQuilibrium resources. These partners provide a multitude of free resources to assist employees with their mental, financial, and physical health.\nWe are a leader in the field of occupational health and safety (“OH&S”), and place a strong emphasis on these activities, both internally and on behalf of our customers. Internally, we emphasize direct management responsibility, corporate policies and procedures, OH&S program implementation, employee training and compliance assessments. Our corporate policies and procedures support compliance with OH&S regulations at work locations. We have a proactive compliance program of employee education, training, auditing and reporting that, through employee awareness and integration into our business operations, supports our commitment to a safe and healthy work environment. \nLeidos Holdings, Inc. Annual Report\n9\nTable of Contents\nPART I\nENVIRONMENTAL MATTERS\nOur operations are subject to various foreign, federal, state and local environmental protection and health and safety laws and regulations. In addition, our operations may become subject to future laws and regulations, including those related to climate change and environmental sustainability. See “Risk Factors” in this Annual Report on Form 10-K for further details. Although we do not currently anticipate that the costs of complying with, or the liabilities associated with, environmental laws will materially and adversely affect us, we cannot ensure that we will not incur material costs or liabilities in the future.\nRESEARCH AND DEVELOPMENT\nWe conduct research and development activities under customer-funded contracts and with company-funded research and development funds. Company-funded research and development includes independent research and development (“IR&D”) and commercial and international research and development. Company-funded research and development expenses are included in selling, general and administrative expenses. Our company-funded research and development expense was $150 million, $128 million and $116 million for fiscal 2024, 2023 and 2022, respectively, which as a percentage of consolidated revenues was 0.9% for fiscal 2024 and 0.8% for both fiscal 2023 and 2022. We charge expenses for research and development activities performed under customer contracts directly to those contracts.\nINTELLECTUAL PROPERTY RIGHTS\nOur technical services and products are not generally dependent upon patent protection, although we do selectively seek patent protection. We claim a proprietary interest in certain of our products, software programs, methodologies and know-\nhow. This proprietary information is protected in confidence as trade secrets, using non-disclosure and other definitive agreements. We selectively pursue opportunities to license or transfer our technologies to third parties.\nIn connection with the performance of services and solutions, the U.S. government has certain rights to inventions, data, software codes and related material that we develop under U.S. government-funded contracts and subcontracts. Generally, the U.S. government may disclose or license such information to third parties, including, in some instances, our competitors. In the case of some subcontracts that we perform, the prime contractor generally obtains rights to use the programs and products that we deliver under the subcontract to perform its prime contract obligations.\nCOMPETITION\nCompetition for contracts is significant, and we often compete against many well-established corporations with strong name and brand recognition. We also compete against smaller, more specialized companies that concentrate their resources in particular areas, the U.S. government’s own capabilities and federal non-profit contract research centers. Due to the diverse requirements of the U.S. government and our commercial customers, we frequently collaborate with other companies to compete for large contracts and bid against these same companies in other situations.\nOur principal competitors currently include the following companies: Accenture Federal Systems, Amentum Services Inc., BAE Systems, Booz Allen Hamilton Inc., CACI International Inc., Deloitte, General Dynamics Corporation, GovCIO, IBM, KBR Inc., L3Harris, Lockheed Martin Corporation, ManTech, Northrop Grumman Corporation, Optum, Parsons Corp, Peraton, Raytheon Technologies Corporation and SAIC. These companies span across sectors that include systems development and integration, engineering and technical services divisions of large defense contractors, diversified U.S. and international IT providers and contractors focused solely on technical services, supply chain management, other logistics services and major systems operations and maintenance, homeland security and health solutions. \nWe compete on various factors, including our technical expertise and qualified professional and/or security-cleared personnel, our ability to deliver innovative high value solutions in a timely manner, successful program execution, our understanding of our customers’ missions, the size and scale of our company and past performance credentials.\n10\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nCONTRACT PROCUREMENT\nOur business is heavily regulated, and we must comply with and are affected by laws and regulations relating to the formation, administration and performance of U.S. government and other contracts. The U.S. government procurement environment has evolved due to statutory and regulatory procurement reform initiatives. Today, U.S. government customers employ several contracting methods to purchase services and products. Budgetary pressures and reforms in the procurement process have caused many U.S. government customers to increasingly purchase services and products using contracting methods that give them the ability to select multiple contract winners or pre-qualify certain contractors to provide services or products on established general terms and conditions rather than through single-award contracts. The predominant contracting methods through which U.S. government agencies procure services and products include the following:\nu\nDefinitive Award Contracts. U.S. government agencies may procure services and products through single definitive award contracts which specify the scope of services or products purchased and identify the contractor that will provide the specified services or products. When an agency has a requirement, the agency will issue a solicitation or request for proposal to which interested contractors can submit a proposal. The bidding and selection process can take a year or more to complete. For the contractor, this method of contracting may provide greater certainty of the timing and amounts to be received at the time of contract award because it generally results in the customer contracting for a specific scope of services or products from the single definitive successful awardee.\nu\nIndefinite Delivery/Indefinite Quantity (“IDIQ”) Contracts.\n \nThe U.S. government uses IDIQ contracts to obtain commitments from contractors to provide certain services or products on pre-established terms and conditions. The U.S. government then issues task orders under the IDIQ contracts to purchase specific services or products. IDIQ contracts are awarded to one or more contractors following a competitive procurement process. Under a single-award IDIQ contract, all task orders under that contract are issued to the one contractor awarded the IDIQ. Under a multiple-award IDIQ contract, task orders are competitively bid by the contractors awarded the IDIQ. Multiple-award IDIQ contracts that are open for any government agency to use for procurement are commonly referred to as “government-wide acquisition contracts.” IDIQ contracts often have multi-\nyear terms and unfunded ceiling amounts, therefore enabling, but not committing, the U.S. government to purchase substantial amounts of services or products from one or more contractors. At the time an IDIQ contract is awarded (prior to the award of any task orders), a contractor may have limited or no visibility as to the ultimate amount of services or products that the U.S. government will purchase under the contract, and in the case of a multiple-award IDIQ contracts, the contractor from which such purchases may be made.\nu\nU.S. General Services Administration (“GSA”) Schedule Contracts. The GSA maintains listings of approved suppliers of services and products with agreed-upon prices for use throughout the U.S. government. In order for a company to provide services under a GSA Schedule contract, a company must be pre-qualified and awarded a contract by the GSA. When an agency uses a GSA Schedule contract to meet its requirements, the agency, or the GSA on behalf of the agency, conducts the procurement. The user agency, or the GSA on its behalf, evaluates the user agency’s requirements and initiates a competition limited to GSA Schedule qualified contractors. GSA Schedule contracts are designed to provide the user agency with reduced procurement time and lower procurement costs. Similar to IDIQ contracts, at the time a GSA Schedule contract is awarded, a contractor may have limited or no visibility as to the ultimate amount of services or products that the U.S. government will purchase under the contract.\nu\nOther Transaction Authority (“OTA”) agreements. Under certain circumstances, U.S. government agencies can enter into OTA agreements instead of traditional contracts. Agencies are explicitly authorized by Congress for specific uses, limitations or restrictions in the use of OTAs. In the case of DoD, the department is authorized to use OTAs to carry out basic, applied or advanced research projects, prototype development projects or follow-on production to initial prototype projects. OTA agreements are generally exempt from federal procurement regulations. These exemptions grant the U.S. government the flexibility to include, amend or exclude contract clauses and requirements that are mandatory in traditional procurements. OTA agreements also grant more flexibility to structure agreements in numerous ways, including joint ventures, partnerships or multiple agencies joining together to fund an agreement encompassing multiple providers.\nWe often team together with other companies to submit bids for large U.S. government procurements or other opportunities where we believe that the combination of services and products that we can provide as a team will help us win and perform the contract. Our relationships with our teammates, including whether we serve as the prime contractor or as a subcontractor, vary with each contract opportunity and typically depend on the program, contract or customer requirements, as well as the relative size, qualifications, capabilities, customer relationships and experience of our company and our teammates.\nLeidos Holdings, Inc. Annual Report\n11\nTable of Contents\nPART I\nContracting with the U.S. government also subjects us to substantial regulation and unique risks, including the U.S. government’s ability to cancel any contract at any time through a termination for the convenience. Most of our contracts have cancellation terms that would permit us to recover all or a portion of our incurred costs and fees for work performed prior to U.S. government termination for convenience. These regulations and risks are described in more detail below under “Business–Regulation” and “Risk Factors” in this Annual Report on Form 10-K.\nCONTRACT PAYMENT TYPES\nGenerally, the type of contract for our services and products is determined by or negotiated with the U.S. government and may depend on certain factors, including the type and complexity of the work to be performed, degree and timing of the responsibility to be assumed by the contractor for the costs of performance, the extent of price competition and the amount and nature of the profit incentive offered to the contractor for achieving or exceeding specified standards or goals. We generate revenues under several types of contracts, including the following:\nu\nCost-reimbursement contracts include cost-plus-fixed-fee, award-fee and incentive-fee contracts. These contracts provide for reimbursement of our direct contract costs and allocable indirect costs, plus a fee. These contracts are typically used when uncertainties involved in contract performance do not permit costs to be estimated with sufficient accuracy to use a fixed-price contract. Cost-reimbursement contracts generally subject us to lower risk but require us to use our best efforts to accomplish the scope of the work within a specified time and budget. Award and incentive fees are generally based on performance criteria such as cost, schedule, quality and/or technical performance. Award fees are determined and earned based on customer evaluation of the Company’s performance against contractual criteria. Incentive fees that are based on cost provide for an initially negotiated fee to be adjusted later, typically using a formula to measure performance against the associated criteria, based on the relationship of total allowable costs to total target costs. \nu\nFixed-price-incentive-fee (“FPIF”) contracts are substantially similar to cost-plus-incentive-fee contracts except they establish specified targets for cost and profit, a price ceiling (but not a profit ceiling or floor) and a profit adjustment formula. Under an FPIF contract, the allowable costs incurred are eligible for reimbursement but are subject to a cost-share arrangement, which affects profitability. Generally, if our costs exceed the contract target cost or are not allowable under the applicable regulations, we may not be able to obtain reimbursement for all costs and may have our fees reduced or eliminated.\nu\nTime-and-materials (“T&M”) contracts typically provide for negotiated fixed hourly rates for specified categories of direct labor plus reimbursement of other direct costs. This type of contract is generally used when there is uncertainty about the extent or duration of the work to be performed by the contractor at the time of contract award or it is not possible to anticipate costs with any reasonable degree of confidence. On T&M contracts, we assume the risk of providing appropriately qualified staff to perform these contracts at the hourly rates set forth in the contracts over the period of performance of the contracts.\nu\nFixed-price-level-of-effort (“FPLOE”) contracts are substantially similar to T&M contracts except they require a specified level of effort over a stated period of time on work that can be stated only in general terms. This type of contract is generally used when the contractor is required to perform an investigation or study in a specific research and development area and to provide a report showing the results achieved based on the level of effort. Payment is based on the effort expended rather than the results achieved.\nu\nFirm-Fixed-Price (“FFP”) contracts provide for a fixed price for specified products, systems and/or services. This type of contract is typically used when the customer acquires products and services on the basis of reasonably definitive specifications that allow parties to develop an estimate of the costs to complete the work. The price for a FFP contract is often determined through competitive bidding by multiple contractors vying for award of the contract, but the price may also be determined through price negotiations with the customer. These contracts offer us potential increased profits if we can complete the work at lower costs than planned, but FFP contracts increase our exposure to the risk of cost overruns.\nOur earnings and profitability may vary materially depending on changes in the proportionate amount of revenues derived from each type of contract, the nature of services or products provided, as well as the achievement of performance objectives, and the stage of performance at which the right to receive fees, particularly under incentive-fee and award-fee contracts, is finally determined. Cost-reimbursement and T&M contracts generally have lower profitability than FFP contracts. \n12\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART I\nSEASONALITY\nThe U.S. government’s fiscal year ends on September 30 of each year. While not certain, it is not uncommon for U.S. government agencies to award extra tasks or complete other contract actions in the timeframe leading up to the end of its fiscal year in order to avoid the loss of unexpended fiscal year funds, which may favorably impact our third fiscal quarter. In addition, our quarterly results may be impacted by the number of working days in a given quarter. We tend to generate less revenue from our labor services during the fourth quarter as a result of the holiday season.\nREGULATION\nWe are heavily regulated in most of the fields in which we operate. We provide services and products to numerous U.S. government agencies and entities, including to the DoD, the U.S. Intelligence Community and the DHS. When working with these and other U.S. government agencies and entities, we must comply with various laws and regulations relating to the formation, administration and performance of contracts. Some significant laws and regulations that affect us include:\nu\nthe Federal Acquisition Regulation (“FAR”) and supplements, including the DoD Federal Acquisition Regulation Supplement (“DFARS”), which regulate the formation, administration and performance of U.S. government contracts;\nu\nthe Truthful Cost or Pricing Data Act, which requires certification and disclosure of cost and pricing data in connection with certain contract negotiations;\nu\nthe Procurement Integrity Act, which regulates access to competitor bid and proposal information and government source selection information and our ability to provide compensation to certain former government officials;\nu\nthe Civil False Claims Act, which provides for substantial civil penalties for violations, including for submission of a false or fraudulent claim to the U.S. government for payment or approval;\nu\nthe False Statements Act, which imposes civil and criminal liability for making false statements to the U.S. government;\nu\nthe U.S. government Cost Accounting Standards (“CAS”), which imposes accounting requirements that govern our right to reimbursement under certain cost-based U.S. government contracts; and\nu\nThe International Trade in Arms Regulation (“ITAR”), which governs the manufacture, export, and temporary import of defense articles, the furnishing of defense services, and brokering activities involving items described on the U.S. munitions list.\nThese regulations impose a broad range of requirements, many of which are unique to government contracting, including various procurement, import and export, security, contract pricing and cost, contract termination and adjustment and audit requirements. Among other things, these laws and regulations:\nu\nrequire certification and disclosure of all cost and pricing data in connection with certain contract negotiations;\nu\ndefine allowable and unallowable costs and otherwise govern our right to reimbursement under various cost-type U.S. government contracts;\nu\nrequire compliance with U.S. government CAS;\nu\nrequire reviews by the Defense Contract Audit Agency (“DCAA”), Defense Contract Management Agency (“DCMA”) and other U.S. government agencies of compliance with government requirements for a contractor’s business systems;\nu\nrestrict the use and dissemination of and require the protection of unclassified contract-related information and information classified for national security purposes and the export of certain products and technical data; and\nu\nrequire us not to compete for work if an actual or potential organizational conflict of interest, as defined by these laws and regulations, related to such work exists and/or cannot be appropriately mitigated, neutralized or avoided.\nThe U.S. government may revise its procurement practices or adopt new contract rules and regulations at any time. In order to help ensure compliance with these complex laws and regulations, all of our employees are required to complete ethics and other compliance trainings relevant to their position.\nLeidos Holdings, Inc. Annual Report\n13\nTable of Contents\nPART I\nDATA PRIVACY AND SECURITY LAWS\nSome of our operations and service offerings involve access to and use by us of personal information and/or protected health information. These activities are regulated by extensive federal, state and international data privacy and security laws requiring organizations to, among other things, provide certain privacy protections and security safeguards for such information. For example, among others:\nu\nthe European Union’s (“EU’s”) General Data Protection Regulation (“GDPR”), which imposes compliance obligations for companies that process personal data of EU data subjects, necessitating investment into ongoing data protection activities and documentation requirements, and creates the potential for significant fines for noncompliance; \nu\nthe United Kingdom’s (“UK’s”) General Data Protection Regulation, (“U.K. GDPR”), which creates similar compliance obligations for companies that process personal data of UK data subjects as are imposed by the GDPR; \nu\nthe California Consumer Privacy Act, as amended by the California Privacy Rights Act (collectively, “CCPA”), which broadly defines personal information and provides expanded consumer privacy rights to natural persons residing in California, such as affording them the right to access and request deletion of their information and to opt out of certain sharing and sales of personal information; and\nu\nthe Health Insurance Portability and Accountability Act, as amended by the Health Information Technology for Economic and Clinical Health Act, which establishes privacy and security compliance obligations with respect to the processing of protected health information by covered entities and business associates, necessitating investment in technical and organizational compliance measures and creates the potential for substantial fines for noncompliance.\nThese regulations and related risks are described in more detail below under “Risk Factors” in this Annual Report on Form 10-K.\nCOMPANY WEBSITE AND INFORMATION\nOur corporate headquarters is located at 1750 Presidents Street, Reston, VA 20190 and our telephone number is (571) 526-6000. Our website can be accessed at www.leidos.com. The website contains information about our company and operations. Through a link on the Investor Relations section of our website, copies of each of our filings with the U.S. Securities and Exchange Commission (“SEC”) on Form 10-K, Form 10-Q and Form 8-K, and all amendments to those reports, can be viewed and downloaded free of charge as soon as reasonably practicable after the reports and amendments are electronically filed with or furnished to the SEC. The SEC also maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, including Leidos. The information on our website is not incorporated by reference into and is not a part of this Annual Report on Form 10-K.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of Leidos Holdings, Inc.’s (“Leidos”) financial condition, results of operations and quantitative and qualitative disclosures about business environment and trends and market risk should be read in conjunction with the consolidated financial statements and related notes included elsewhere in this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties, including those described under the heading “Forward-Looking Statements.\n”\n You should also review the disclosure under Part I, Item 1A, “Risk Factors” in this Annual Report on Form 10-K for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.\nUnless indicated otherwise, references in this report to “we,” “us” and “our” refer collectively to Leidos and its consolidated subsidiaries. \nOVERVIEW\nLeidos is an industry and technology leader serving government and commercial customers with smarter, more efficient digital and mission innovations. Headquartered in Reston, Virginia, with 48,000, global employees, we bring domain-specific capabilities, technologies and insights to customers in each of these markets by leveraging seven technical core capabilities: trusted mission artificial intelligence, cyber operations, digital modernization, mission software systems, integrated systems, mission operations, and rapid prototyping and manufacturing. Our customers include the U.S. Department of Defense (“DoD”), the U.S. Intelligence Community, the U.S. Department of Homeland Security, the Federal Aviation Administration, the Department of Veterans Affairs, National Aeronautics and Space Administration (“NASA”) and many other U.S. civilian, state and local government agencies, foreign government agencies and commercial businesses. Approximately 8% of our revenues are generated by entities located outside of the United States. \nBeginning in fiscal 2024, we realigned our business and operate in four reportable segments that are focused on specific, defined capability sets we bring to our customers. As a result of this change, prior year segment results and disclosures have been recast to reflect the current reportable segment structure. We now operate in the following reportable segments: National Security & Digital, Health & Civil, Commercial & International and Defense Systems. We also separately present the unallocated costs associated with corporate functions as Corporate. \nFor additional information regarding our reportable segments, see “Business” in Part I and “Note 20—Business Segments” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nOur significant initiatives include the following: \nu\nachieving annual revenue growth through internal collaboration and better leveraging of key differentiators across our company and the deployment of resources and investments into profitable growth markets;\nu\ncontinued improvement in our back-office infrastructure and related business processes for greater effectiveness and efficiency across all business functions; and\nu\ndisciplined deployment of our cash resources and use of our capital structure to enhance shareholder value while retaining an appropriate amount of financial leverage.\nSales Trend\n. For fiscal 2024, revenues increased $1.2 billion, or 8%, compared to fiscal 2023, the increase was primarily due to a net increase in volumes on certain programs and program wins, partially offset by the completion of certain contracts.\nFor fiscal 2023, revenues increased $1.0 billion, or 7%, compared to fiscal 2022, primarily due to program wins, a net increase in volumes on certain programs and a net increase in revenues attributable to our business acquisitions. The increase was partially offset by the completion of certain contracts.\nOperating Expenses and Income Trend\n. For fiscal 2024, operating expenses increased by $27 million, or less than 1%, compared to fiscal 2023. Operating margin for fiscal 2024 was 11% compared to 4% for fiscal 2023. Operating income was $1,827 million, a $1,206 million increase compared to fiscal 2023. The increase in operating income was primarily attributable to the impairment and restructuring charges of $689 million at the SES reporting unit in fiscal 2023 as compared to $11 million of impairment charges for the facility rationalization effort in fiscal 2024 (see \"Note 10—Leases\" of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K) and a net increase in volumes on certain programs.\n46\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II\nFor fiscal 2023, operating expenses increased by $1.5 billion, or 11%, compared to fiscal 2022. Operating margin for fiscal 2023 was 4.0% compared to 7.6% for fiscal 2022. Operating income was $621 million, a $467 million decrease compared to fiscal 2022. The decrease was primarily attributable to impairment and restructuring charges of $689 million at the SES reporting unit in fiscal 2023 (see “Note 8—Goodwill and Intangible Assets” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K). The decrease was partially offset by program wins, a net increase in volumes on certain programs and lower amortization expenses.\nFrom a macroeconomic perspective, our industry is under general competitive pressures associated with spending from our largest customer, the U.S. government, and requires a high level of cost management focus to allow us to remain competitive. Although the U.S. Presidential Administration has not indicated a desire to reduce spending in the defense and homeland security sectors, the likelihood, extent and duration of current spending levels in these areas remains unclear. We continue to review our cost structure against our anticipated sales and undertake cost management actions and efficiency initiatives where necessary.\nBUSINESS ENVIRONMENT AND TRENDS\nU.S. GOVERNMENT MARKETS\nWe generated approximately 87% of our total revenues from contracts with the U.S. government in fiscal 2024 and 2023 as compared to 86% of our total revenues from contracts with the U.S. government in fiscal 2022, either as a prime contractor or a subcontractor to other contractors engaged in work for the U.S. government. Revenues under contracts with the DoD and U.S. Intelligence Community, including subcontracts under which the DoD or the U.S. Intelligence Community is the ultimate purchaser, represented approximately 48%, 49% and 44% of our total revenues for fiscal 2024, 2023 and 2022, respectively. Accordingly, our business performance is affected by the overall level of U.S. government spending, especially national security, homeland security and intelligence spending, and the alignment of our service and product offerings and capabilities with current and future budget priorities of the U.S. government. \nOn December 21, 2024, the U.S. federal government avoided a shutdown by passing into law a continuing resolution that provides government funding through March 14, 2025. The continuing resolution gives lawmakers additional time to consider the 12 appropriations bills for government fiscal year 2025. Failure to pass the appropriations bills or another continuing resolution by March 14, 2025, will result in a partial or complete federal government shutdown.\nTrends in the U.S. government contracting process, including a shift towards multiple-awards contracts, in which certain contractors are preapproved using IDIQ and U.S. General Services Administration (“GSA”) contract vehicles, have increased competition for U.S. government contracts, reduced backlogs by shortening periods of performance on contracts and increased pricing pressure. We expect that a majority of the business that we seek in the foreseeable future will be awarded through a competitive bidding process. For more information on these risks and uncertainties, see “Risk Factors” in Part I of this Annual Report on Form 10-K.\nINTERNATIONAL MARKETS\nSales to customers in international markets represented approximately 8% of total revenues for fiscal 2024, as compared to 9% and 8% of total revenues for fiscal 2023 and 2022, respectively. Our international customers include foreign governments and their agencies. Our international business increases our exposure to international markets and the associated international regulatory, foreign currency exchange rate and geopolitical risks.\nChanges in international trade policies, including higher tariffs on imported goods and materials, may increase our procurement costs of certain IT hardware used both on our contracts and for internal use. However, we expect to recover certain portions of these higher tariffs through our cost-plus contracts. While we evaluate the impact of higher tariffs, currently, we do not expect tariffs to have a significant impact to our business.\nKEY PERFORMANCE MEASURES\nThe primary financial performance measures we use to manage our business and monitor results of operations are revenue, operating income, cash flows from operations and diluted earnings per share. Bookings and backlog are also useful measures for management and investors to evaluate our performance and potential future revenues. In addition, we consider business performance by contract type to be useful to management and investors when evaluating our operating income and margin performance.\nLeidos Holdings, Inc. Annual Report\n47\nTable of Contents\nPART II\nRESULTS OF OPERATIONS\nOur results of operations for the periods presented were as follows:\n \nYear Ended\n2024 to 2023\n2023 to 2022\n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent\nchange\nPercent\nchange\nRevenues\n$\n16,662\n \n$\n15,438 \n$\n14,396 \n8 \n%\n7 \n%\nCost of revenues\n13,864\n \n13,194 \n12,312 \n5 \n%\n7 \n%\nSelling, general and administrative expenses\n983\n \n942 \n951 \n4 \n%\n(1)\n%\nAcquisition, integration and restructuring costs\n16\n \n24 \n17 \n(33)\n%\n41 \n%\nGoodwill impairment charges\n—\n \n596 \n— \nNM\nNM\nAsset impairment charges\n11\n \n91 \n40 \n(88)\n%\n128 \n%\nEquity earnings of non-consolidated subsidiaries\n(39)\n(30)\n(12)\n(30)\n%\n(150)\n%\nOperating income\n1,827\n \n621 \n1,088 \n194 \n%\n(43)\n%\nNon-operating expense, net\n(188)\n(218)\n(202)\n(14)\n%\n(8)\n%\nIncome before income taxes\n1,639\n \n403 \n886 \nNM\n(55)\n%\nIncome tax expense\n(388)\n(195)\n(193)\n99 \n%\n1 \n%\nNet income\n1,251\n \n208 \n693 \nNM\n(70)\n%\nLess: net (loss) income attributable to non-controlling interest\n(3)\n9 \n8 \n(133)\n%\n13 \n%\nNet income attributable to Leidos common stockholders\n$\n1,254\n \n$\n199 \n$\n685 \nNM\n(71)\n%\nOperating margin\n11.0\n \n%\n4.0 \n%\n7.6 \n%\nNM - Not meaningful\nSEGMENT AND CORPORATE RESULTS\nYear Ended\n2024 to 2023\n2023 to 2022\nNational Security & Digital \n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent\nchange\nPercent\nchange\nRevenues\n$\n7,365\n \n$\n7,196 \n$\n6,745 \n2 \n%\n7 \n%\nOperating income\n720\n \n672 \n606 \n7 \n%\n11 \n%\nOperating margin\n9.8\n \n%\n9.3 \n%\n9.0 \n%\nThe increase in revenues for fiscal 2024 as compared to fiscal 2023, was primarily attributable to a net increase in volumes on certain programs, program wins and net write-ups, partially offset by the completion of certain contracts.\nThe increase in revenues for fiscal 2023 as compared to fiscal 2022, was primarily attributable to a net increase in volumes on certain programs and net write-ups, partially offset by the completion of certain contracts.\nThe increase in operating income for fiscal 2024 as compared to fiscal 2023, was primarily attributable to improved program execution on certain programs, a net increase in volumes and program wins, partially offset by the completion of certain contracts.\nThe increase in operating income for fiscal 2023 as compared to fiscal 2022, was primarily attributable to net write-ups on certain programs.\n48\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II\nYear Ended\n2024 to 2023\n2023 to 2022\nHealth & Civil\n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent change\nPercent change\nRevenues\n$\n5,015\n \n$\n4,238 \n$\n3,945 \n18 \n%\n7 \n%\nOperating income\n1,095\n \n574 \n448 \n91 \n%\n28 \n%\nOperating margin\n21.8\n \n%\n13.5 \n%\n11.4 \n%\nThe increase in revenues for fiscal 2024 as compared to fiscal 2023, was primarily attributable to a net increase in volumes and case complexity within the managed health services business, an increase in net write-ups on certain programs and program wins.\nThe increase in revenues for fiscal 2023 as compared to fiscal 2022, was primarily attributable to a net increase in volumes on certain programs and increased earnings from incentive awards. The increase was partially offset by a net decrease in the recovery of expenditures in the medical examination business and the completion of certain contracts.\nThe increase in operating income for fiscal 2024 as compared to fiscal 2023, was primarily attributable to an increase in volumes and case complexity within the managed health services business.\nThe increase in operating income for fiscal 2023 as compared to fiscal 2022, was primarily attributable to a net increase in earnings from incentive awards and a net increase in volumes on certain programs, partially offset by a net decrease in the recovery of expenditures in the medical examination business and the completion of certain contracts.\nYear Ended\n2024 to 2023\n2023 to 2022\nCommercial & International\n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent change\nPercent change\nRevenues\n$\n2,252\n \n$\n2,126 \n$\n1,900 \n6 \n%\n12 \n%\nOperating income (loss)\n104\n \n(560)\n131 \n119 \n%\nNM\nOperating margin\n4.6\n \n%\n(26.3)\n%\n6.9 \n%\nNM - Not meaningful\nThe increase in revenues for fiscal 2024 as compared to fiscal 2023, was primarily attributable to program wins and a net increase in volumes on certain programs, partially offset by the impact of write-downs on certain programs within our UK operations for which cost and schedule were rebaselined as well as the completion of certain programs.\nThe increase in revenues for fiscal 2023 as compared to fiscal 2022, was primarily attributable to a net increase in volumes on certain programs and a $94 million net increase in revenues related to our Cobham Special Mission acquisition made in the last quarter of fiscal 2022. The increase was partially offset by write-downs on certain programs and the completion of certain contracts.\nThe increase in operating income for fiscal 2024 as compared to fiscal 2023, was primarily driven by impairment and restructuring charges of $689 million at the SES reporting unit in fiscal 2023, program wins and a net increase in volumes, partially offset by the impact of write-downs on certain programs within our UK operations for which cost and schedule were rebaselined as well as the completion of certain programs. \nThe decrease in operating income for fiscal 2023 as compared to fiscal 2022, was primarily attributable to impairment and restructuring charges of $689 million at the SES reporting unit in fiscal 2023, and write-downs on certain programs. The decrease was partially offset by an increase in volumes on certain programs.\n \nYear Ended\n2024 to 2023\n2023 to 2022\nDefense Systems\n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent\nchange\nPercent\nchange\nRevenues\n$\n2,030\n \n$\n1,878 \n$\n1,806 \n8 \n%\n4 \n%\nOperating income\n94\n \n65 \n11 \n45 \n%\n491 \n%\nOperating margin\n4.6\n \n%\n3.5 \n%\n0.6 \n%\nLeidos Holdings, Inc. Annual Report\n49\nTable of Contents\nPART II\nThe increase in revenues for fiscal 2024 as compared to fiscal 2023, was primarily attributable to program wins and a net increase in volumes on certain programs, partially offset by the completion of certain contracts.\nThe increase in revenues for fiscal 2023 as compared to fiscal 2022, was primarily attributable to a net increase in volumes on certain programs and program wins, partially offset by the completion of certain contracts.\nThe increase in operating income for fiscal 2024 as compared to fiscal 2023, was primarily attributable to program wins and improved program execution on certain programs, partially offset by a one-time write-down related to program assets.\nThe increase in operating income for fiscal 2023 as compared to fiscal 2022, was primarily attributable a net increase in volumes on certain programs, partially offset by the completion of certain contracts.\n \nYear Ended\n2024 to 2023\n2023 to 2022\nCorporate\n(dollars in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nPercent\nchange\nPercent\nchange\nOperating loss\n$\n(186)\n$\n(130)\n$\n(108)\n(43)\n%\n(20)\n%\nThe increase in operating loss for fiscal 2024 as compared to fiscal 2023, was primarily attributable to an increase in research and development activities and general and administrative costs.\nThe increase in operating loss for fiscal 2023 as compared to fiscal 2022, was primarily attributable to higher legal costs, increased expenses in integration and restructuring activities, partially offset by the impact of foreign payroll tax reserves.\nNON-OPERATING EXPENSE, NET\nNon-operating expense, net decreased by $30 million for fiscal 2024 as compared to fiscal 2023, primarily due to higher interest income earned from higher cash balances.\nNon-operating expense, net increased by $16 million for fiscal 2023 as compared to fiscal 2022, primarily due to a net increase in interest expense driven by higher interest rates and refinancing activities.\nPROVISION FOR INCOME TAXES\nOur effective tax rate was 23.7%, 48.4% and 21.8% in fiscal 2024, 2023 and 2022, respectively. The effective tax rate for fiscal 2024 was favorably impacted primarily by federal research tax credits and lower state income taxes, partially offset by an increase in unrecognized tax benefits. The effective tax rate for fiscal 2023 was unfavorably impacted primarily by non tax deductible goodwill impairments. The effective tax rate for fiscal 2022 was favorably impacted primarily by federal research tax credits and excess tax benefits related to employee stock-based payment transactions.\nIn December 2021, the Organization for Economic Cooperation and Development enacted model rules for a new 15% global minimum tax framework (“Pillar Two”). Many governments around the world have enacted or are in the process of enacting Pillar Two legislation. The Pillar Two legislation became effective for certain jurisdictions beginning in fiscal 2024. We will continue to evaluate the impact of the rules as additional legislation gets enacted; however, there is not a material impact from jurisdictions where Pillar Two rules are currently in effect.\nBOOKINGS AND BACKLOG\nWe had net bookings of $23.4 billion and $16.5 billion during fiscal 2024 and 2023, respectively. Net bookings represent the estimated amount of revenue to be earned in the future from funded and unfunded contract awards that were received during the year, net of any adjustments to previously awarded backlog amounts. We calculate net bookings as the year’s ending backlog, plus the year’s revenues, less the prior year’s ending backlog and any impacts from foreign currency or acquisitions and divestitures.\nBacklog represents the estimated amount of future revenues to be recognized under negotiated contracts. We segregate our backlog into two categories as follows:\nu\nFunded Backlog. Funded backlog for contracts with the U.S. government represents the value on contracts for which funding is appropriated less revenues previously recognized on these contracts. Funded backlog for contracts with non-U.S. government entities and commercial customers represents the estimated value on contracts, which may cover multiple future years, under which we are obligated to perform, less revenues previously recognized on the contracts.\n50\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II\nu\nNegotiated Unfunded Backlog. Negotiated unfunded backlog represents estimated amounts of revenue to be earned in the future from contracts for which funding has not been appropriated and unexercised priced contract options. Negotiated unfunded backlog does not include unexercised option periods and future potential task orders expected to be awarded under IDIQ, GSA Schedule or other master agreement contract vehicles, with the exception of certain IDIQ contracts where task orders are not competitively awarded and separately priced but instead are used as a funding mechanism, and where there is a basis for estimating future revenues and funding on future anticipated task orders.\nThe estimated value of our segment backlog for the periods presented was as follows:\nJanuary 3, 2025\nDecember 29, 2023\n(in millions)\nFunded\nUnfunded\nTotal\nFunded\nUnfunded\nTotal\nNational Security & Digital\n$\n2,881\n \n$\n19,086\n \n$\n21,967\n \n$\n2,714 \n$\n15,113 \n$\n17,827 \nHealth & Civil\n1,456\n \n10,568\n \n12,024\n \n2,334 \n9,044 \n11,378 \nCommercial & International\n2,456\n \n1,901\n \n4,357\n \n2,567 \n1,105 \n3,672 \nDefense Systems\n1,616\n \n3,590\n \n5,206\n \n1,181 \n2,904 \n4,085 \nTotal\n$\n8,409\n \n$\n35,145\n \n$\n43,554\n \n$\n8,796 \n$\n28,166 \n$\n36,962 \nBookings and backlog fluctuate from period to period depending on our success rate in winning contracts and the timing of contract awards, renewals, modifications and cancellations, as well as foreign currency movements. Contract awards may be negatively impacted by ongoing industry-wide delays in procurement decisions and budget cuts by the U.S. government as discussed in “Business Environment and Trends” in this Annual Report on Form 10-K.\nWe expect to recognize a substantial portion of our funded backlog as revenues within the next 12 months. However, the U.S. government may cancel any contract at any time through a termination for the convenience of the U.S. government. In addition, certain contracts with commercial or non-U.S. government customers may include provisions that allow the customer to cancel at any time. Most of our contracts have cancellation terms that would permit us to recover all or a portion of our incurred costs and fees for work performed.\nCONTRACT TYPES\nOur earnings and profitability may vary materially depending on changes in the proportionate amount of revenues derived from each type of contract. For a discussion of the types of contracts under which we generate revenues, see “Business—Contract Types” in Part I of this Annual Report on Form 10-K. Revenues by contract type as a percentage of our total revenues for the periods presented were as follows:\n \nYear Ended\n \nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nCost-reimbursement and fixed-price-incentive-fee\n44\n \n%\n48 \n%\n50 \n%\nFirm-fixed-price\n43\n \n%\n39 \n%\n38 \n%\nTime-and-materials and fixed-price-level-of-effort \n13\n \n%\n13 \n%\n12 \n%\nTotal\n100\n \n%\n100 \n%\n100 \n%\nLeidos Holdings, Inc. Annual Report\n51\nTable of Contents\nPART II\nLIQUIDITY AND CAPITAL RESOURCES\nOVERVIEW OF LIQUIDITY\nAs of January 3, 2025, we had $943 million in cash and cash equivalents. We have a senior unsecured revolving credit facility which can provide up to $1.0 billion in additional borrowing, if required. As of January 3, 2025, and December 29, 2023, there were no borrowings outstanding under any revolving credit facility.\nWe had outstanding debt of $4.7 billion at both January 3, 2025, and December 29, 2023. In February 2023, we issued and sold $750 million 5.75% fixed-rate senior notes. The annual interest rate is payable on a semi-annual basis. In March 2023, we entered into a Credit Agreement with certain financial institutions, which provided for a senior unsecured term loan facility in an aggregate principal amount of $1.0 billion (the “Term Loan Facility”). The proceeds of the Term Loan Facility and cash on hand were used to repay in full all indebtedness, terminate all commitments and discharge all guarantees existing in connection with a predecessor $1.9 billion senior unsecured term loan facility and a senior unsecured revolving facility.\nAs of January 3, 2025, borrowings under our Credit Agreement were based on a Term Secured Overnight Financing Rate (“SOFR”) with a 0.10% Term SOFR adjustment and an applicable margin range from 1.00% to 1.50%. At January 3, 2025, the applicable margin for SOFR-denominated borrowings was 1.25%.\nWe have a commercial paper program in which we may issue short-term unsecured commercial paper notes (“Commercial Paper Notes”) that have maturities of up to 397 days from the date of issuance (see “Note 13—Debt” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K). As of January 3, 2025, and December 29, 2023, we did not have any commercial paper notes outstanding.\nWe made principal payments, excluding the impacts of our Commercial Paper Notes, on our debt of $18 million, $2,045 million and $545 million during fiscal 2024, 2023 and 2022, respectively. The activity for fiscal 2023 included a $1,210 million payment to discharge the $1.9 billion 5.77% senior unsecured term loan facility, a $498 million payment to discharge the $500 million 2.95% notes, due May 2023, and a principal repayment of $320 million to discharge the 364-day term loan credit agreement.\nOur credit facility, term loan facility, commercial paper notes and notes outstanding as of January 3, 2025, contain financial covenants and customary restrictive covenants. We were in compliance with all covenants as of January 3, 2025.\nWe paid dividends of $208 million, $201 million and $199 million for fiscal 2024, 2023 and 2022, respectively.\nWe may from time to time seek to retire or purchase our outstanding debt through cash purchases in the open market, privately negotiated transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\nStock repurchases of Leidos common stock may be made on the open market or in privately negotiated transactions with third parties including through accelerated share repurchase (“ASR”) agreements. Whether repurchases are made and the timing and actual number of shares repurchased depends on a variety of factors including price, corporate capital requirements, other market conditions and regulatory requirements. The repurchase program may be accelerated, suspended, delayed or discontinued at any time.\nDuring fiscal 2024 and 2023, we made open market repurchases of our common stock for an aggregate purchase price of $850 million and $225 million, respectively. There were no open market share repurchases in fiscal 2022.\nIn fiscal 2022, we entered into an ASR with a financial institution to repurchase shares of our outstanding common stock. We paid $500 million to the financial institution and received 4.8 million shares (see “Note 16—Earnings Per Share” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K). All shares delivered were immediately retired.\nFor the next 12 months, we anticipate that we will be able to meet our liquidity needs, including servicing our debt, through cash generated from operations, available cash balances, borrowings from our commercial paper program and, if needed, sales of accounts receivable and borrowings from our revolving credit facility.\n52\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II\nSUMMARY OF CASH FLOWS\nThe following table summarizes cash flow information for the periods presented:\n \nYear Ended\n(in millions)\nJanuary 3,\n2025\nDecember 29,\n2023\nDecember 30,\n2022\nNet cash provided by operating activities\n(1)\n$\n1,392\n \n$\n1,165 \n$\n992 \nNet cash used in investing activities\n(142)\n(211)\n(313)\nNet cash used in financing activities\n(1,084)\n(715)\n(865)\n(1)\nNet cash provided by operating activities during the year ended December 30, 2022, was recast to present the effect of foreign exchange rate changes on cash, cash equivalents and restricted cash as a separate line in the consolidated statements of cash flows.\nNet cash provided by operating activities increased $227 million for fiscal 2024 as compared to fiscal 2023. The increase was primarily due to higher earnings and favorable timing of payroll and employee benefit accruals.\nNet cash provided by operating activities increased $173 million for fiscal 2023 as compared to fiscal 2022. The increase was primarily due to faster collections on receivables and favorable timing of customer advance payments, partially offset by higher tax payments of $260 million mainly in connection with the TCJA provision.\nNet cash used in investing activities decreased $69 million for fiscal 2024 as compared to fiscal 2023. The decrease was primarily due to lower capital expenditures of $58 million in the current year.\nNet cash used in investing activities decreased $102 million for fiscal 2023 as compared to fiscal 2022. The decrease was primarily due to $190 million of cash paid in connection with our Cobham Special Mission acquisition from the prior year, partially offset with higher capital expenditures of $78 million in the current year.\nNet cash used in financing activities increased $369 million for fiscal 2024 as compared to fiscal 2023. The increase was primarily due to a $625 million increase in stock repurchases, a $35 million increase in shares withheld for tax obligations, partially offset by a decrease of $291 million in net payments made on debt activities.\nNet cash used in financing activities decreased $150 million for fiscal 2023 as compared to fiscal 2022. The decrease was primarily due a net decrease of $296 million in stock repurchases driven by the accelerated share repurchase agreement in the prior year and an increase of $1.4 billion in proceeds received from the issuance of debt in the current year, partially offset by an increase of $1.5 billion in payments of debt.\nOFF-BALANCE SHEET ARRANGEMENTS\nWe have outstanding performance guarantees and cross-indemnity agreements in connection with certain aspects of our business. We have letters of credit outstanding principally related to performance guarantees on contracts and surety bonds outstanding principally related to performance and subcontractor payment bonds as described in “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K. These arrangements have not had, and management does not believe it is likely that they will in the future have, a material effect on our liquidity, capital resources, operations or financial condition.\nCONTRACTUAL OBLIGATIONS\nOur future contractual obligations are related to debt, finance and operating leases, long-term liabilities under deferred compensation arrangements, purchase obligations for long-term purchases and service agreements and other liabilities. For more information, see “Note 10—Leases”, “Note 13—Debt”, “Note 19—Retirement Plans” and “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nWe have interest payments related to our outstanding debt and finance leases. As of January 3, 2025, future scheduled interest payments on our outstanding debt and finance leases were $208 million, expected to be paid in fiscal 2025 and $1.1 billion expected to be paid thereafter.\nAs of January 3, 2025, future payments on our deferred compensation arrangements and purchase obligations for long-term purchases and service agreements were $65 million, expected to be paid in fiscal 2025, and $371 million expected to be paid thereafter. Our future payments do not include $162 million of income tax liabilities, primarily as a result of uncertain tax positions, and the timing of such payments, if any, cannot be reasonably estimated. For additional information, see “Note 18—Income Taxes” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K. \nLeidos Holdings, Inc. Annual Report\n53\nTable of Contents\nPART II\nGUARANTORS AND ISSUERS OF GUARANTEED SECURITIES\nLeidos Holdings, Inc. (“Guarantor”) has fully and unconditionally guaranteed the debt securities of its subsidiary, Leidos, Inc. (“Issuer”), that were issued pursuant to transactions that were registered under the Securities Act of 1933, as amended (collectively, the “Registered Notes”). The following is a list of the Registered Notes guaranteed by Leidos Holdings, Inc. \nSenior unsecured Registered Notes issued by Leidos, Inc.:\n$500 million 3.625% notes, due May 2025\n$750 million 4.375% notes, due May 2030\n$1,000 million 2.300% notes, due February 2031\n$750 million 5.750% notes, due March 2033\nLeidos Holdings, Inc. has also fully and unconditionally guaranteed debt securities of Leidos, Inc. that were issued pursuant to transactions that were not registered under the Securities Act of 1933, as amended. The following is a list of unregistered debt securities guaranteed by Leidos Holdings, Inc.\nSenior unsecured unregistered debt securities issued by Leidos, Inc.:\n$250 million 7.125% notes, due July 2032\n$300 million 5.500% notes, due July 2033\nAdditionally, Leidos, Inc. has fully and unconditionally guaranteed debt securities of Leidos Holding, Inc. that were issued pursuant to transactions that were not registered under the Securities Act of 1933, as amended. The following is a list of unregistered debt securities guaranteed by Leidos, Inc.\nSenior unsecured unregistered debt securities issued by Leidos Holdings, Inc.:\n$300 million 5.950% notes, due December 2040\nThe following summarized financial information includes the assets, liabilities and results of operations for the Guarantor and Issuer of the Registered Notes described above. Intercompany balances and transactions between the Issuer and Guarantor have been eliminated from the financial information below. Investments in the consolidated subsidiaries of the Issuer and Guarantor that do not guarantee the senior unsecured notes have been excluded from the financial information. Intercompany payables represent amounts due to non-guarantor subsidiaries of the Issuer.\nBALANCE SHEET INFORMATION FOR THE GUARANTOR AND ISSUER OF REGISTERED NOTES\n(in millions)\nJanuary 3,\n2025\nTotal current assets\n$\n2,550\n \nGoodwill\n5,673\n \nOther long-term assets\n1,498\n \nTotal assets\n$\n9,721\n \nTotal current liabilities\n$\n2,677\n \nLong-term debt, net of current portion\n4,052\n \nIntercompany payables\n3,319\n \nOther long-term liabilities\n820\n \nTotal liabilities\n$\n10,868\n \n54\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II\nSTATEMENT OF OPERATIONS INFORMATION FOR THE GUARANTOR AND ISSUER OF REGISTERED NOTES\n(in millions)\nJanuary 3,\n2025\nRevenues, net\n$\n10,564\n \nOperating income\n807\n \nNet income attributable to Leidos common stockholders\n119\n \nCRITICAL ACCOUNTING ESTIMATES\nOur discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which are prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”). The preparation of these financial statements in accordance with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingencies at the date of the financial statements, as well as the reported amounts of revenues and expenses during the reporting periods. Management evaluates these estimates and assumptions on an ongoing basis. Our estimates and assumptions have been prepared by management on the basis of the most current and best available information. The results of these estimates form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results could differ from these estimates under different assumptions and conditions.\nWe have identified the following accounting policies as critical because they require significant judgments and assumptions about highly complex and inherently uncertain matters and the use of reasonably different estimates and assumptions could have a material impact on our results of operations or financial condition.\nu\nRevenue Recognition\nu\nGoodwill \nREVENUE RECOGNITION\nWe perform work under various types of contracts, which include FFP, T&M, FPLOE, cost-plus-fixed-fee, cost-plus-award-fee, cost-plus-incentive-fee and fixed-price-incentive-fee contracts. \nOn FFP contracts requiring system integration and cost-plus contracts with variable consideration, revenue is generally recognized over time using a method that measures the extent of progress towards completion of a performance obligation, principally using a cost-input method (referred to as the cost-to-cost method). Under the cost-to-cost method, revenue is recognized based on the proportion of total costs incurred to estimated total costs-at-completion (“EAC”), which require us to use estimates of the revenue and cost associated with the design, manufacture and delivery of our offerings and services. A performance obligation’s EAC includes all direct costs such as materials, labor, subcontract costs, overhead and a ratable portion of general and administrative costs. If the estimated cost of a performance obligation whose associated revenue is recognized using the cost-to-cost method exceeds the estimated transaction price, the entire amount of the loss is recognized in operations in the period the loss is known. \nSome of our cost-plus and fixed-price contracts contain award fees, incentive fees or other provisions that may either increase or decrease the transaction price. These variable amounts generally are awarded upon achievement of certain performance metrics, program milestones or cost targets and can be based upon customer discretion. We estimate variable consideration at the most probable amount that we expect to be entitled to, based on the assessment of the contract specific variable fee criteria, complexity of work and related risks, extent of customer discretion, amount of variable consideration received historically and the potential of significant reversal of revenue. \nWe allocate the transaction price of a contract to its performance obligations primarily based upon the proportional individual selling prices. The standalone selling price of the performance obligations is generally based on an expected cost-plus margin approach. For certain product sales, performance obligations may be allocated to a contract's transaction price based on prices observed in other standalone sales or the residual value method. Substantially all of our contracts do not contain a significant financing component, which would require an adjustment to the transaction price of the contract.\nFor the impacts of changes in estimates on our contracts, see “Note 3—Summary of Significant Accounting Policies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nLeidos Holdings, Inc. Annual Report\n55\nTable of Contents\nPART II\nGOODWILL \nGoodwill represents the excess of the fair value of consideration transferred, plus the fair value of any non-controlling interests in the acquiree, over the fair value of the net assets acquired and liabilities assumed as of the acquisition date. Goodwill is not amortized, but instead is tested annually, at the beginning of the fourth quarter, for impairment at the reporting unit level and may be tested more frequently if events or circumstances indicate that the carrying value may not be recoverable. As of January 3, 2025, and December 29, 2023, goodwill represented 46% and 48% of our total assets, respectively.\nWe may perform qualitative or quantitative analysis to test for impairment. Qualitative factors include macroeconomic, industry and market considerations, overall financial performance, industry, legal and other relevant events and factors affecting the reporting unit.\nOur quantitative analysis utilizes discounted cash flow models and market multiple valuation methods to estimate reporting unit fair values. Discounted cash flow analyses rely on significant judgment and assumptions about expected future cash flows, weighted-average cost of capital, discount rates, expected long-term growth rates and operating margins. These assumptions are based on estimates of future sales and earnings after considering such factors as general market conditions, customer budgets, existing firm and future orders, changes in working capital, long term business plans and recent operating performance. Market multiple analyses incorporate significant judgments and assumptions related to the selection of guideline public companies, our forecast earnings before interest, taxes, depreciation and amortization (“EBITDA”), forecast EBITDA of guideline public companies and control premium estimates. \nOperations of the Security Enterprise Solutions (“SES”) reporting unit rely heavily on the sales and servicing of security and detection products, which prior to fiscal 2024, have been negatively impacted due to delays in airline travel infrastructure projects as customer budgets recover from the pandemic. \nDuring fiscal 2023, the SES reporting unit refined its portfolio and made strategic business decisions to exit certain product offerings, as well as cease operations in certain countries in order to align the operations of the reporting unit with its strategic business plan. These decisions, along with the delays in airline travel infrastructure projects and higher than anticipated servicing costs, contributed to a significant reduction in the reporting unit’s forecasted revenue and cash flows.\nAccordingly, we recognized a non-cash goodwill impairment charge of $596 million for fiscal 2023 (see “Note 8—Goodwill and Intangible Assets” of the notes to the consolidated financial statements contained within this Annual Report on Form \n10-\nK). The goodwill impairment resulted in a lower difference between the fair value and carrying value for the SES reporting unit and therefore, in fiscal 2024, we performed a quantitative impairment analysis for the SES reporting unit, which resulted in no further impairment.\nIn fiscal 2024, we performed our annual test for impairment as of September 28, 2024, which resulted in no impairments being identified. \nCOMMITMENTS AND CONTINGENCIES\nWe are subject to a number of reviews, investigations, claims, lawsuits, other uncertainties and future obligations related to our business. For a discussion of these items, see “Note 10—Leases” and “Note 21—Commitments and Contingencies” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\nRECENTLY ADOPTED AND ISSUED ACCOUNTING PRONOUNCEMENTS\nFor a discussion of these items, see “Note 2—Accounting Standards” of the notes to the consolidated financial statements contained within this Annual Report on Form 10-K.\n56\nLeidos Holdings, Inc. Annual Report\nTable of Contents\nPART II",
  "item2": null
}