{
  "source_file": "lh-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nIn this Quarterly Report on Form 10-Q (Quarterly Report), Labcorp\n®\n Holdings Inc. together with its subsidiaries (Labcorp, LHI or the Company) has made, and from time to time may otherwise make in its public filings, press releases, and discussions by Company management, forward-looking statements concerning the Company’s operations, performance, and financial condition, as well as its strategic objectives. Some of these forward-looking statements relate to future events and expectations and can be identified by the use of forward-looking words such as “believes”, “expects”, “may”, “will”, “should”, “seeks”, “approximately”, “intends”, “plans”, “estimates”, or “anticipates” or the negative of those words or other comparable terminology. Such forward-looking statements speak only as of the time they are made and are subject to various risks and uncertainties and the Company claims the protection afforded by the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. Actual results could differ materially from those currently anticipated due to a number of factors in addition to those discussed elsewhere herein, including in the “Risk Factors” section of the Annual Report on Form 10-K, and in the Company’s other public filings, press releases, and discussions with Company management, including:\n1.\nchanges in government and third-party payer regulations, reimbursement, or coverage policies or other future reforms in the United States (U.S.) healthcare system (or in the interpretation of current regulations), new insurance or payment systems, including state, regional or private insurance cooperatives (e.g., health insurance exchanges) affecting governmental and third-party coverage or reimbursement for commercial laboratory testing, including the impact of the U.S. Protecting Access to Medicare Act of 2014;\n2.\nsignificant monetary damages, fines, penalties, assessments, refunds, repayments, damage to the Company’s reputation, unanticipated compliance expenditures, and/or exclusion or debarment from or ineligibility to participate in government programs, among other adverse consequences, arising from enforcement of anti-fraud and abuse laws and other laws applicable to the Company in jurisdictions in which the Company conducts business;\n3.\nsignificant fines, penalties, costs, unanticipated compliance expenditures, and/or damage to the Company’s reputation arising from the failure to comply with applicable privacy and security laws and regulations, including the U.S. Health Insurance Portability and Accountability Act of 1996, the U.S. Health Information Technology for Economic and Clinical Health Act, the European Union’s General Data Protection Regulation and similar laws and regulations in jurisdictions in which the Company conducts business;\n4.\nloss or suspension of a license or imposition of fines or penalties under, or future changes in, or interpretations of applicable licensing laws or regulations regarding the operation of clinical laboratories, the development and commercialization of laboratory-developed tests (LDTs), and the delivery of clinical laboratory test results, including, but not limited to, the U.S. Clinical Laboratory Improvement Act of 1967, the U.S. Clinical Laboratory Improvement Amendments of 1988, the European Union In Vitro Diagnostics Regulation, and similar laws and regulations in jurisdictions in which the Company conducts business;\n5.\npenalties or loss of license arising from the failure to comply with applicable occupational and workplace safety laws and regulations, including the U.S. Occupational Safety and Health Administration requirements, the U.S. Needlestick Safety and Prevention Act, and similar laws and regulations in jurisdictions in which the Company conducts business;\n6.\nfines, unanticipated compliance expenditures, suspension of manufacturing, enforcement actions, damage to the Company’s reputation, injunctions, or criminal prosecution arising from failure to maintain compliance with current good manufacturing practice regulations and similar requirements of various regulatory agencies in jurisdictions in which the Company conducts business;\n7.\nsanctions or other remedies, including fines, unanticipated compliance expenditures, enforcement actions, injunctions or criminal prosecution arising from failure to comply with the Animal Welfare Act or applicable national, state, and local laws and regulations in jurisdictions in which the Company conducts business;\n8.\nchanges in testing guidelines or recommendations by government agencies, medical specialty societies, and other authoritative bodies affecting the development, validation, approval, clearance, commercialization, or utilization of laboratory tests;\n9.\nchanges in and failure to comply with the applicable regulations of pharmaceutical and medical device regulators affecting the approval, availability of, and the selling and marketing of diagnostic tests, including LDTs, drug development, or the conduct of drug development and medical device and diagnostic studies and trials, including regulations and policies of the U.S. Food and Drug Administration, the U.S. Department of Agriculture, the Medicine \n22\nTABLE OF CONTENTS\nand Healthcare products Regulatory Agency in the United Kingdom, the National Medical Products Administration in China, the Pharmaceutical and Medical Devices Agency in Japan, the European Union, the European Medicines Agency, and similar regulations and policies of agencies in other jurisdictions in which the Company conducts business;\n10.\nchanges in government regulations or reimbursement pertaining to the pharmaceutical, biotechnology and medical device and diagnostic industries, changes in reimbursement of pharmaceutical products, or reduced spending on research and development by pharmaceutical, biotechnology and medical device, and diagnostic customers;\n11.\nliabilities that result from the failure to comply with corporate governance requirements;\n12.\nincreased competition, including price competition, potential reduction in rates in response to price transparency initiatives and consumerism, competitive bidding and/or changes or reductions to fee schedules, and competition from companies that do not comply with existing applicable laws or regulations or otherwise disregard compliance standards in the industry;\n13.\nchanges in payer mix or payment structure or process, including insurance carrier participation in health insurance exchanges, an increase in capitated reimbursement mechanisms, the impact of clearinghouses on the claims reimbursement process, the impact of a shift to consumer-driven health plans or plans carrying an increased level of member cost-sharing, and adverse changes in payer reimbursement or payer coverage policies (implemented directly or through a third-party utilization management organization) related to specific diagnostic tests, categories of testing, or testing methodologies;\n14.\nfailure to retain or attract business from managed care organizations (MCOs) as a result of changes in business models, including risk based or network approaches, out-sourced laboratory network management or utilization management companies, or other changes in strategy or business models by MCOs;\n15.\nfailure to obtain and retain new customers, an unfavorable change in the mix of testing services ordered, or a reduction in tests ordered, specimens submitted, or services requested by existing customers, and delays in payments from customers;\n16.\nconsolidation and convergence of customers, competitors, and suppliers, potentially causing material shifts in insourcing, utilization, pricing, reimbursement, and supply chain access;\n17.\nfailure to invest in or effectively develop and deploy new systems, system modifications or enhancements required in response to evolving market, business, and customer trends and needs;\n18.\ncustomers choosing to insource services that are or could be purchased from the Company;\n19.\nfailure to identify, successfully close, and effectively integrate and/or manage acquisitions of new businesses or failure to maintain key customers and/or employees as a result of uncertainty surrounding the integration of acquisitions;\n20.\ninability to achieve the expected benefits and synergies of newly acquired businesses, including due to items not discovered in the due diligence process, and the impact on the Company’s cash position, levels of indebtedness, and stock price;\n21.\ntermination, loss, delay, reduction in scope, or increased costs of contracts, including large contracts and multiple contracts;\n22.\nliability arising from errors or omissions in the performance of testing and other services or other contractual arrangements;\n23.\nchanges or disruption in the provision or transportation of services or supplies provided by third parties; or their termination for failure to follow the Company’s performance standards and requirements;\n24.\ndamage or disruption to the Company’s facilities;\n25.\ndamage to the Company’s reputation, loss of business, or other harm from acts of animal rights activists or potential harm and/or liability arising from animal research activities;\n26.\nadverse results in litigation matters;\n27.\ninability to attract, retain, and develop experienced and qualified personnel or the loss of significant personnel as a result of illness, increased competition for talent, wage growth, or other market factors beyond the Company’s control;\n28.\nfailure to develop or acquire licenses for new or improved technologies, such as point-of-care testing, mobile health technologies, and digital pathology, or potential use of new technologies by customers and/or consumers to perform their own tests;\n23\nTABLE OF CONTENTS\n29.\nsubstantial costs arising from the inability to commercialize newly licensed tests or technologies or to obtain appropriate coverage or reimbursement for such tests;\n30.\nfailure to obtain, maintain, and enforce intellectual property rights for protection of the Company’s offerings and defend against challenges to those rights;\n31.\nscope, validity, and enforceability of patents and other proprietary rights held by third parties that may impact the Company’s ability to develop, perform, or market the Company’s offerings or operate its business;\n32.\nbusiness interruption, receivables impairment, delays in cash collection impacting days sales outstanding, supply chain disruptions or inventory obsolescence, increases in material cost or other operating costs, or other impacts on the business due to natural disasters, including adverse weather, fires and earthquakes; geopolitical crises, including terrorism and war; public health crises and disease epidemics and pandemics, including, but not limited to the continued impact of COVID-19; and other events beyond the Company’s control;\n33.\ndiscontinuation or recalls of existing products used in the performance of testing;\n34.\na failure in the Company’s information technology systems, including with respect to testing turnaround time and billing processes, the failure of the Company or its third-party suppliers and vendors to maintain the security of business information or systems or to protect against cybersecurity incidents such as denial of service attacks, malware, ransomware, and computer viruses, delays or failures in the development and implementation of the Company’s automation platforms, or adverse effects from the use of or regulation of artificial intelligence and machine learning tools, any of which could result in a negative effect on the Company’s performance of services, a loss of business or increased costs, delays in cash collections, damages to the Company’s reputation, significant litigation exposure, an inability to meet required financial reporting deadlines, or the failure to meet future regulatory or customer information technology, data security and connectivity requirements;\n35.\nbusiness interruption, increased costs, and other adverse effects on the Company’s operations due to the unionization of employees, union strikes, work stoppages, general labor unrest or failure to comply with labor or employment laws;\n36.\nfailure to maintain the Company’s days sales outstanding levels, cash collections (in light of increasing levels of patient responsibility), profitability and/or reimbursement arising from unfavorable changes in third-party payer policies, payment delays introduced by third-party utilization management organizations, and increasing levels of patient payment responsibility;\n37.\nimpact on the Company’s revenues, cash collections, and the availability of credit for general liquidity or other financing needs arising from a significant deterioration in the economy or financial markets or in the Company’s credit ratings by Standard & Poor’s and/or Moody’s;\n38.\nfailure to maintain the expected capital structure for the Company, including failure to maintain the Company’s investment grade rating, or leverage ratio covenants under its revolving credit facility;\n39.\nchanges in reimbursement by foreign governments and foreign currency fluctuations;\n40.\ninability to obtain certain billing information from physicians, resulting in increased costs and complexity, a temporary disruption in receipts, and ongoing reductions in reimbursements and revenues;\n41.\nexpenses and risks associated with international operations, including, but not limited to, compliance with the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act, other applicable anti-corruption laws and regulations, trade sanction laws and regulations, and economic, political, legal, and other operational risks associated with foreign jurisdictions;\n42.\nfailure to achieve expected efficiencies, benefits, and savings in connection with the Company’s business process improvement initiatives;\n43.\nchanges in tax laws and regulations or changes in their interpretation;\n44.\nchanging global economic conditions and government and regulatory changes; and\n45.\nrisks associated with the impacts and expected benefits and costs of the completed spin-off of the Company’s former clinical development and commercialization services business (Spin-off) Fortrea Holdings Inc. (Fortrea), including but not limited to factors that could adversely affect the Company’s ability to realize the expected benefits of the Spin-off or the failure of the Spin-off to qualify as a tax-free transaction for U.S. federal income tax purposes.\nExcept as may be required by applicable law, the Company undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. Given these uncertainties, one should not put undue reliance on any forward-looking statements.\n24\nTABLE OF CONTENTS\nGENERAL (dollars in millions)\nFor the three months ended September 30, 2025, the Company’s revenues were $3,563.5, an increase of 8.6% from $3,282.0 for the corresponding period in 2024. The 8.6% increase for the three months ended September 30, 2025, as compared to the corresponding period in 2024, was due to organic revenue of 6.2%, acquisitions, net of divestitures, of 1.7%, and favorable foreign currency translation of 0.7%.\nFor the nine months ended September 30, 2025, the Company’s revenues were $10,435.9, an increase of 7.8% from $9,679.5 for the corresponding period in 2024. The 7.8% increase for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, was due to organic revenue of 4.6%, acquisitions, net of divestitures, of 3.0%, and favorable foreign currency translation of 0.3%.\nThe Company defines organic growth as the change in revenue excluding the year-over-year impact of acquisitions, divestitures, and currency. Acquisition and divestiture impact is considered for a 12-month period following the closing of each transaction. \nOn June 30, 2023, the Company completed the Spin-off. The Transition Services Agreement (TSA) dated June 29, 2023 between Fortrea and Laboratory Corporation of America Holdings (LCAH) expired on June 30, 2025, and all services provided under the TSA terminated on or before the expiration date.\nOn July 4, 2025, the U.S. government enacted into law the One Big Beautiful Bill Act (OBBBA), which includes provisions addressing regulations and federal funding affecting healthcare. These provisions include, but are not limited to, changes to Medicaid and the Affordable Care Act, and could lead to revised regulatory requirements and reduced federal funding. As a result of these changes, the Company could experience a decline in utilization of its diagnostic testing services due to a reduction in overall insurance coverage, which may cause the Company’s revenue to decrease. However, the Company currently believes any such reduction would not likely have a material impact on its results of operations in future periods. The potential impacts described above represent the Company’s assessment at this time, and the Company will continue to evaluate the impact of the OBBBA on its business and operations as the legislation’s provisions continue to become effective through 2028.\nRESULTS OF OPERATIONS (dollars in millions)\nThe following tables present the financial measures that management considers to be the most significant indicators of the Company\n’\ns performance.\nRevenues\nThree Months Ended September 30,\n2025\n2024\nChange\nDx\n$\n2,769.6 \n$\n2,553.5 \n8.5 \n%\nBLS\n799.1 \n737.7 \n8.3 \n%\nIntercompany eliminations and other\n(5.2)\n(9.2)\n43.5 \n%\nTotal\n$\n3,563.5 \n$\n3,282.0 \n8.6\n%\nDx revenues for the three months ended September 30, 2025, were $2,769.6, an increase of 8.5% over $2,553.5 in the third quarter of 2024. The increase was primarily due to organic revenue of 6.3% and acquisitions, net of divestitures, of 2.2%.\nDx total volume, measured by requisitions, increased by 4.7% as organic volume increased by 3.5% and acquisition volume, net of divestitures, contributed 1.2%. Price/mix increased by 3.7% primarily due to organic growth of 2.8% and acquisitions, net of divestitures, of 1.0%.\nBLS revenues for the three months ended September 30, 2025, were $799.1, an increase of 8.3% over $737.7 in the third quarter of 2024. The increase was due to organic growth of 5.3% and favorable foreign currency translation of 3.0%.\nCost of Revenues\nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nCost of revenues\n$\n2,538.4 \n$\n2,377.6 \n6.8 \n%\nCost of revenues as a % of revenues\n71.2 \n%\n72.4 \n%\n \nCost of revenues increased 6.8% during the three months ended September 30, 2025, as compared with the corresponding period in 2024. Cost of revenues as a percentage of revenues during the three months ended September 30, 2025, decreased to 71.2% as compared to 72.4% in the corresponding period in 2024. This decrease was primarily due to operational efficiencies and the impact from revenue growth, including the performance of Invitae.\n25\nTABLE OF CONTENTS\nSelling, General, and Administrative Expenses\n \nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nSelling, general, and administrative expenses\n$\n552.4 \n$\n568.6 \n(2.9)\n%\nSelling, general, and administrative expenses as a % of revenues\n15.5 \n%\n17.3 \n%\n \nSelling, general, and administrative expenses as a percentage of revenues were 15.5% and 17.3% during the three months ended September 30, 2025, and 2024, respectively. The decrease was primarily due to the impact from revenue growth, including the performance of Invitae, and a decrease in costs related to the Spin-off of Fortrea.\nAmortization of Intangibles and Other Assets\nThree Months Ended September 30,\n2025\n2024\nChange\nAmortization of intangibles and other assets\n$\n69.5 \n$\n63.7 \n9.1 \n%\nThe increase in amortization of intangibles and other assets primarily reflects additional amortization for assets acquired subsequent to September 30, 2024.\nGoodwill and Other Asset Impairments\nThree Months Ended September 30,\n2025\n2024\nChange\nGoodwill and other asset impairments\n$\n0.7 \n$\n— \n100.0 \n%\nThe impairment charges for the three months ended September 30, 2025, were due to the write-off of certain capitalized software costs. \nRestructuring and Other Charges\n \nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nRestructuring and other charges\n$\n5.9 \n$\n18.0 \n(66.4)\n%\nDuring the three months ended September 30, 2025, the Company recorded net restructuring and other charges of $5.9. The charges were comprised of $4.2 related to severance and other personnel costs, $1.8 in facility-related costs, and $0.2 in contract termination costs. The charges were adjusted by the reversal of a previously established liability of $0.2 in unused severance and other personnel costs and $0.1 in unused facility-related costs.\nDuring the three months ended September 30, 2024, the Company recorded net restructuring and other charges of $18.0. The charges were comprised of $19.3 related to severance and other personnel costs. The charges were adjusted by the reversal of a previously established liability of $1.2 in unused severance and other personnel costs and $0.1 in unused facility-related costs.\nInterest Expense\nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nInterest expense\n$\n56.0 \n$\n50.4 \n10.9 \n%\nFor the three months ended September 30, 2025, interest expense increased 10.9% as compared with the corresponding period in 2024. The increase was primarily due to higher weighted-average interest rates and an increase in the average amount of total debt outstanding during the three months ended September 30, 2025, when compared to the three months ended September 30, 2024.\nEquity Method Loss, Net\n \nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nEquity method loss, net\n$\n(5.2)\n$\n(0.5)\n(948.7)\n%\n Equity method loss, net represents the Company’s ownership share in joint venture partnerships along with equity investments in other companies in the healthcare industry. The increase in Equity method loss, net for the three months ended September 30, 2025, as compared with the corresponding period in 2024, was primarily due to the loss recognized from the SYNLAB investment that closed in the first quarter of 2025.\n26\nTABLE OF CONTENTS\nOther, Net\n \nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nOther, net\n$\n(1.9)\n$\n4.3 \n(143.8)\n%\nThe change in Other, net for the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, is primarily due to the TSA expiration resulting in a $18.4 decrease of fees charged to Fortrea for the three months ended September 30, 2025, as compared with the corresponding period in 2024, related to administrative and information technology systems support. The costs to provide these transition services are included in Operating income, but the service fees are included in Other, net. In addition, there were investment gains of $2.3, recorded during the three months ended September 30, 2025, compared to investment losses of $1.6 for the corresponding period of 2024. Foreign currency transaction losses of $4.9 were recognized for the three months ended September 30, 2025, as compared to losses of $10.0 for the corresponding period of 2024.\nProvision for Income Taxes\nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nProvision for income taxes\n$\n75.5 \n$\n41.0 \n83.9 \n%\nProvision for income taxes as a % of earnings before taxes\n22.4 \n%\n19.5 \n%\n \nThe increase in the effective tax rate for the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, was primarily attributable to the jurisdictional mix of earnings.\nOperating Results by Segment\n \nThree Months Ended September 30,\n \n \n2025\n2024\nChange\nDx segment operating income\n$\n450.4 \n$\n387.4 \n16.3 \n%\nDx segment operating margin\n16.3 \n%\n15.2 \n%\n1.1 \n%\nBLS segment operating income\n132.2 \n120.9 \n9.4 \n%\nBLS segment operating margin\n16.5 \n%\n16.4 \n%\n0.2 \n%\nSegment operating income\n582.6 \n508.3 \n14.6 \n%\nGeneral corporate and unallocated expenses\n(109.9)\n(172.5)\n(36.3)\n%\nAmortization of intangibles and other assets\n(69.5)\n(63.7)\n9.1 \n%\nGoodwill and other asset impairments\n(0.7)\n— \n(100.0)\n%\nRestructuring and other charges\n(5.9)\n(18.0)\n(66.4)\n%\nTotal Operating income\n$\n396.6 \n$\n254.1 \n56.1 \n%\nDx segment operating income was $450.4 for the three months ended September 30, 2025, an increase of $63.0 over operating income of $387.4 in the corresponding period of 2024, and Dx segment operating margin increased 110 basis points year-over-year. The increase in operating income and operating margin was primarily due to organic demand, including the performance of Invitae, as well as slight favorability from weather during the three months ended September 30, 2025, as compared to the corresponding period of 2024.\nBLS segment operating income was $132.2 for the three months ended September 30, 2025, an increase of $11.3 over operating income of $120.9 in the corresponding period of 2024, and BLS segment operating margin increased 20 basis points year-over-year. The increase in operating income was primarily due to an increase in organic demand.\nGeneral corporate and unallocated expenses are comprised primarily of administrative services such as executive management, human resources, legal, finance, corporate affairs, and information technology. General corporate and unallocated expenses were $109.9 for the three months ended September 30, 2025, a decrease of $62.6 compared to corporate expenses of $172.5 in the corresponding period of 2024, primarily due to decreases in acquisition-related costs and costs related to the Spin-off of Fortrea.\nRevenues\nNine Months Ended September 30,\n2025\n2024\nChange\nDx\n$\n8,148.0 \n$\n7,558.1 \n7.8 \n%\nBLS\n2,305.2 \n2,155.6 \n6.9 \n%\nIntercompany eliminations and other\n(17.3)\n(34.2)\n49.4 \n%\nTotal\n$\n10,435.9 \n$\n9,679.5 \n7.8\n%\n27\nTABLE OF CONTENTS\nDx revenues for the nine months ended September 30, 2025, were $8,148.0, an increase of 7.8% over $7,558.1 during the nine months ended September 30, 2024. The increase was due to organic revenue of 4.1% and acquisitions, net of divestitures, of 3.8%, partially offset by unfavorable foreign currency translation of 0.1%.\nDx total volume, measured by requisitions, increased by 4.2% as organic volume increased by 2.6% and acquisition volume, net of divestitures, contributed 1.6%. Price/mix increased by 3.6% due to acquisitions, net of divestitures, of 2.2% and organic growth of 1.5%, partially offset by unfavorable foreign currency translation of 0.1%.\nBLS revenues for the nine months ended September 30, 2025, were $2,305.2, an increase of 6.9% over $2,155.6 during the nine months ended September 30, 2024. The increase was due to organic growth of 5.2% and favorable foreign currency translation of 1.7%.\nCost of Revenues\nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nCost of revenues\n$\n7,416.6 \n$\n6,951.4 \n6.7 \n%\nCost of revenues as a % of revenues\n71.1 \n%\n71.8 \n%\n \nCost of revenues increased 6.7% during the nine months ended September 30, 2025, as compared with the corresponding period in 2024. Cost of revenues as a percentage of revenues during the nine months ended September 30, 2025, decreased to 71.1% as compared to 71.8% in the corresponding period in 2024. This decrease was primarily due to growth in demand as the Company leveraged the growth of its revenues and operational efficiencies, including the performance of Invitae.\nSelling, General, and Administrative Expenses\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nSelling, general, and administrative expenses\n$\n1,677.7 \n$\n1,634.8 \n2.6 \n%\nSelling, general, and administrative expenses as a % of revenues\n16.1 \n%\n16.9 \n%\n \nSelling, general, and administrative expenses as a percentage of revenues were 16.1% and 16.9% during the nine months ended September 30, 2025, and 2024, respectively. The decrease was primarily due to growth in demand as the Company leveraged the growth of its revenues and a decrease in costs related to the Spin-off of Fortrea, partially offset by higher personnel costs and the impact from Invitae.\nAmortization of Intangibles and Other Assets\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nAmortization of intangibles and other assets\n$\n207.4 \n$\n186.0 \n11.5 \n%\nThe increase in amortization of intangibles and other assets primarily reflects additional amortization for assets acquired subsequent to September 30, 2024.\nGoodwill and Other Asset Impairments\nNine Months Ended September 30,\n2025\n2024\nChange\nGoodwill and other asset impairments\n$\n0.7 \n$\n2.5 \n(71.7)\n%\nThe impairment charges for the nine months ended September 30, 2025, were due to the write-off of certain capitalized software costs. The impairment charges for the nine months ended September 30, 2024, were primarily due to the decommissioning of a robotic asset.\nRestructuring and Other Charges\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nRestructuring and other charges\n$\n16.4 \n$\n34.6 \n(52.6)%\nDuring the nine months ended September 30, 2025, the Company recorded net restructuring and other charges of $16.4. The charges were comprised of $21.2 related to severance and other personnel costs, $15.3 in contract termination costs, and $9.1 in facility-related costs. The charges were adjusted by the reversal of a previously established liability of $27.6 in unused facility-related costs and $1.6 in unused severance and other personnel costs.\n28\nTABLE OF CONTENTS\nDuring the nine months ended September 30, 2024, the Company recorded net restructuring and other charges of $34.6. The charges were comprised of $34.4 related to severance and other personnel costs and $1.8 in facility-related costs. The charges were adjusted by the reversal of a previously established liability of $1.2 in unused severance and other personnel costs and $0.4 in unused facility-related costs.\nInterest Expense\nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nInterest expense\n$\n169.1 \n$\n144.9 \n16.7 \n%\nFor the nine months ended September 30, 2025, interest expense increased 16.7% as compared with the corresponding period in 2024. The increase was primarily due to higher weighted-average interest rates and an increase in the average amount of total debt outstanding during the nine months ended September 30, 2025, when compared to the nine months ended September 30, 2024.\nEquity Method Loss, Net\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nEquity method loss, net\n$\n(7.2)\n$\n(0.7)\n(878.9)\n%\nEquity method loss, net represents the Company’s ownership share in joint venture partnerships along with equity investments in other companies in the health care industry. The increase in Equity method loss, net for the nine months ended September 30, 2025, as compared with the corresponding period in 2024, was primarily due to the loss recognized from the SYNLAB investment that closed in the first quarter of 2025.\nOther, net\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nOther, net\n$\n(35.6)\n$\n43.8 \n(181.2)\n%\n The change in Other, net for the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, is primarily due to the TSA expiration resulting in a $59.9 decrease of fees charged to Fortrea for the nine months ended September 30, 2025, as compared with the corresponding period in 2024, related to administrative and information technology systems support. The costs to provide these transition services are included in Operating income, but the service fees are included in Other, net. In addition, there were investment losses of $32.4, recorded during the nine months ended September 30, 2025, compared to investment losses of $7.3 for the corresponding period of 2024.\nProvision for Income Taxes\nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nProvision for income taxes\n$\n204.1 \n$\n172.2 \n18.5 \n%\nProvision for income taxes as a % of earnings before taxes\n22.3 \n%\n22.2 \n%\n \nThe increase in the effective tax rate for the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, was primarily attributable to the jurisdictional mix of earnings.\nOperating Income by Segment\n \nNine Months Ended September 30,\n \n \n2025\n2024\nChange\nDx segment operating income\n$\n1,360.7 \n$\n1,246.8 \n9.2 \n%\nDx segment operating margin\n16.7 \n%\n16.5 \n%\n0.2 \n%\nBLS segment operating income\n362.4 \n328.2 \n10.4 \n%\nBLS segment operating margin\n15.7 \n%\n15.2 \n%\n0.5 \n%\nSegment operating income\n1,723.1 \n1,575.0 \n9.4 \n%\nGeneral corporate and unallocated expenses\n(381.5)\n(481.7)\n(20.8)\n%\nAmortization of intangibles and other assets\n(207.4)\n(186.0)\n11.5 \n%\nGoodwill and other asset impairments\n(0.7)\n(2.5)\n(71.7)\n%\nRestructuring and other charges\n(16.4)\n(34.6)\n(52.6)\n%\n Operating income\n$\n1,117.1 \n$\n870.2 \n28.4 \n%\n29\nTABLE OF CONTENTS\nDx segment operating income was $1,360.7 for the nine months ended September 30, 2025, an increase of $113.9 over operating income of $1,246.8 in the corresponding period of 2024, and Dx segment operating margin increased 20 basis points year-over-year. The increase in operating margin was primarily due to increased demand.\nBLS segment operating income was $362.4 for the nine months ended September 30, 2025, an increase of $34.2 over operating income of $328.2 in the corresponding period of 2024, and BLS segment operating margin increased 50 basis points year-over-year. The increase in operating margin was primarily due to increased organic demand and operating efficiencies, partially offset by higher personnel costs.\nGeneral corporate expenses are comprised primarily of administrative services such as executive management, human resources, legal, finance, corporate affairs, and information technology. Corporate expenses were $381.5 for the nine months ended September 30, 2025, a decrease of $100.2 over corporate expenses of $481.7 in the corresponding period of 2024, primarily due to decreases in costs related to the Spin-off of Fortrea and acquisition-related costs.\nLIQUIDITY AND CAPITAL RESOURCES (dollars in millions, except per share data)\nThe Company’s cash-generating capability and financial condition typically have provided ready access to capital markets. The Company’s principal source of liquidity is operating cash flow, supplemented by proceeds from debt offerings. The Company’s senior unsecured revolving credit facility is further discussed in Note 6 Debt to the Company’s Condensed Consolidated Financial Statements.\nThe Company’s cash flows were as follows:\n \nNine Months Ended September 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n1,026.3 \n$\n808.6 \nNet cash used for investing activities\n(804.1)\n(1,157.2)\nNet cash (used for) provided by financing activities\n(1,166.6)\n1,326.6 \nEffect of exchange rate changes on Cash and cash equivalents\n23.8 \n2.5 \nNet (decrease) increase in Cash and cash equivalents\n$\n(920.6)\n$\n980.5 \nCash and Cash Equivalents\nCash and cash equivalents at September 30, 2025, and 2024, totaled $598.1 and $1,517.3, respectively. Cash and cash equivalents consist of highly liquid instruments, such as time deposits, and other money market investments, which have original maturities of three months or less.\nCash Flows from Operating Activities\nDuring the nine months ended September 30, 2025, the Company’s operations provided $1,026.3 of cash as compared to $808.6 during the same period in 2024. The $217.7 increase in cash provided by operations in 2025 as compared with the corresponding 2024 period was primarily due to higher earnings.\nCash Flows from Investing Activities\n \nNet cash used for investing activities for the nine months ended September 30, 2025, was $804.1 as compared to $1,157.2 for the nine months ended September 30, 2024. The decrease in cash used for investing activities for the nine months ended September 30, 2025, as compared to the corresponding period in 2024, was primarily due to a decrease in business acquisitions and lower capital expenditures, partially offset by the investment in SYNLAB during the nine months ended September 30, 2025.\nCapital expenditures were $310.6 and $377.8 for the nine months ended September 30, 2025, and 2024, respectively. Capital expenditures for the nine months ended September 30, 2025, were 3.0% of revenues, primarily in connection with projects to support growth in the Company’s core businesses, facility expansion and updates, and further acquisition integration activities.\nCash Flows from Financing Activities\n \nNet cash used for financing activities for the nine months ended September 30, 2025, was $1,166.6 as compared to net cash provided by financing activities of $1,326.6 for the nine months ended September 30, 2024. The change in cash flows from financing activities for the nine months ended September 30, 2025, as compared to the nine months ended September 30, 2024, was primarily due to a decrease of proceeds from senior note offerings of $2,000.0, an increase in senior note payments of $400.0, a decrease of proceeds from the Company’s accounts receivable securitization facility of $75.0, and an increase in common stock repurchases of $50.0.\n30\nTABLE OF CONTENTS\nIn addition to Cash and cash equivalents, at September 30, 2025, the Company had $1,000.0 of available borrowings under its revolving credit facility, which, as amended on June 27, 2025, expires in 2030. Under the Company’s credit facilities and indentures relating to the Company’s senior notes, the Company is subject to negative covenants limiting subsidiary indebtedness and certain other covenants typical for investment grade-rated borrowers, and with respect to the credit facilities, the Company is required to maintain certain leverage ratios. The Company was in compliance with all covenants under the credit facilities and the indentures related to the Company’s outstanding senior notes as of September 30, 2025. The Company expects that it will remain in compliance with all covenants associated with its existing debt obligations for the next 12 months.\nAt September 30, 2025, the Company had outstanding authorization from its board of directors (Board) to purchase up to $1,055.4 maximum value of Company common stock, par value $0.10 per share (Common Stock). The repurchase authorization has no expiration date.\nFor the nine months ended September 30, 2025, the Company paid $181.4 in Common Stock dividends. On October 8, 2025, the Company announced a cash dividend of $0.72 per share of Common Stock, or approximately $60.6 in the aggregate. The dividend will be payable on December 11, 2025, to stockholders of record of all issued and outstanding shares of Common Stock at the close of business on November 26, 2025. The declaration and payment of any future dividends will be at the discretion of the Board.\nGuarantor Information\nIn 2024, the Company, LCAH and U.S. Bank Trust Company, National Association (the Trustee) entered into a seventeenth supplemental indenture (the Seventeenth Supplemental Indenture) to the indenture, dated as of November 19, 2010, between LCAH and the Trustee (2010 Indenture). In addition, the Company, LCAH and the Trustee entered into the 2024 Indenture on September 23, 2024 (the 2024 Indenture, together with the 2010 Indenture, the Indentures). The Seventeenth Supplemental Indenture, among other things, provides for the full and unconditional guarantee by the Company of LCAH’s obligations under the 2010 Indenture, and each series of senior unsecured notes issued and outstanding thereunder, and the 2024 Indenture provides for the full and unconditional guarantee by the Company of LCAH’s obligations, and each series of senior unsecured notes issued and outstanding, thereunder (collectively, the Labcorp Holdings Guarantees). Also, the Indentures permit the Company to satisfy LCAH’s reporting obligations so long as the Labcorp Holdings Guarantees remain in place and the Company’s Condensed Consolidated Financial Statements and other information comply with the requirements of Rule 3-10 of Regulation S-X.\nAt September 30, 2025, there was $3,096.6 and $2,000.0 aggregate principal amount of issued and outstanding senior notes of LCAH, issued under the 2010 Indenture and the 2024 Indenture, respectively, that are fully and unconditionally guaranteed by the Company. Accordingly, pursuant to Rule 3-10 of Regulation S-X, separate consolidated financial statements of LCAH have not been presented. As permitted under Rule 13-01(a)(4)(vi) of Regulation S-X, the Company has excluded the summarized financial information for LCAH because the assets, liabilities, and results of operations of LCAH are not materially different than the corresponding amounts in the Company’s Condensed Consolidated Financial Statements and management believes such summarized financial information would be repetitive and would not provide incremental value to investors. \nCredit Ratings\nThe investment grade debt ratings from Moody’s and S&P Global Ratings contribute to the Company’s ability to access capital markets.\nOff-balance Sheet Arrangements\nThe Company does not have any variable interest entities or special purpose entities whose financial results are not included in the Company’s Condensed Consolidated Financial Statements and the Company does not have any off-balance sheet financing other than normal, short-term leases and letters of credit.\nOther Commercial Commitments\nThe Company has outstanding debt instruments. At September 30, 2025, the Company had total future payments of $5,622.0, with $500.4 of payments due within 12 months, which the Company anticipates refinancing in future periods.\nThe Company has leases for patient service centers, laboratories and testing facilities, clinical facilities, general office spaces, vehicles, and office and laboratory equipment. At September 30, 2025, the Company had total future payments for short-term and long-term leases of $1,159.5, with payments of $230.3 due within 12 months.\nIn connection with the pending acquisitions of select assets of the outreach business from Community Health Systems, Inc. (CHS) and select clinical laboratory assets from Empire City Laboratories, Inc. (Empire City), the Company expects to pay up to $445.0, which includes $85.0 of consideration contingent on performance. Subject to customary closing conditions and applicable regulatory approvals, the Company expects the acquisitions of select assets from CHS and Empire City to close in \n31\nTABLE OF CONTENTS\nthe fourth quarter of 2025 and the first quarter of 2026, respectively. See Note 3 Business Acquisitions and Dispositions to the Company’s Condensed Consolidated Financial Statements for additional information.\nAt September 30, 2025, the Company had provided letters of credit aggregating approximately $103.3, primarily in connection with certain insurance programs which are renewed annually.\nBased on current and projected levels of cash flows from operations, coupled with availability under its revolving credit facility, the Company believes it has sufficient liquidity to meet both its anticipated short-term and long-term cash needs for the next 12 months and the reasonably foreseeable future; however, the Company continually reassesses its liquidity position in light of market conditions and other relevant factors.\nCRITICAL ACCOUNTING ESTIMATES\nThere have been no material changes to the critical accounting estimates that appear in Part II - Item 7 of the Company's Annual Report on Form 10-K for the year ended December 31, 2024.\nIMPACT OF RECENT ACCOUNTING PRONOUNCEMENTS\nThe impact of recent accounting pronouncements, if any, is discussed in Note 1 Basis of Financial Statement Presentation to the Condensed Consolidated Financial Statements."
}