{
  "item1": "BLS segment operating income BLS provides drug development, medical device CDx development solutions early-stage research clinical development, along support crop protection chemical testing, through its ED Central Laboratory Services businesses. Its customers comprised pharmaceutical, biotechnology, medical device, diagnostic companies across world. global network operations, BLS offers deep expertise early development clinical trials each therapeutic area. BLS provided support more than new drugs therapeutic products approved 2024 FDA, including 86% those specific oncology, 74% those submitted biotechnology companies, 80% those submitted leading large pharmaceutical companies.",
  "item7": "Dx segment operating income Dx segment operating margin BLS segment operating income BLS segment operating margin Segment operating income General corporate unallocated expenses Amortization intangibles other assets Restructuring other charges Goodwill other asset impairments Total operating income Dx operating income $1,606.3 year ended December 31, 2024, increase 0.9% over operating income $1,591.3 corresponding period 2023, Dx operating margin decreased 110 basis points year-over-year. decrease operating margin primarily due higher personnel costs, partially offset organic demand. BLS operating income $458.9 year ended December 31, 2024, increase 15.8% operating income $396.3 corresponding period 2023, BLS operating margin increased 140 basis points year over year. increase primarily due organic growth LaunchPad savings, partially offset higher personnel costs.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS FORWARD-LOOKING STATEMENTS changes government third-party payer regulations, reimbursement, coverage policies other future reforms United States (U.S.) healthcare system (or interpretation current regulations), new insurance payment systems, including state, regional private insurance cooperatives (e.g., health insurance exchanges) affecting governmental third-party coverage reimbursement commercial laboratory testing, including impact U.S. Protecting Access Medicare Act 2014; significant monetary damages, fines, penalties, assessments, refunds, repayments, damage Company’s reputation, unanticipated compliance expenditures, and/or exclusion debarment ineligibility participate government programs, among other adverse consequences, arising enforcement anti-fraud abuse laws other laws applicable Company jurisdictions which Company conducts business; significant fines, penalties, costs, unanticipated compliance expenditures, and/or damage Company’s reputation arising failure comply applicable privacy security laws regulations, including U.S. Health Insurance Portability Accountability Act 1996, U.S."
}