{
  "source_file": "lin-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\")\nNon-GAAP Measures\nThroughout MD&A, the company provides adjusted operating results exclusive of certain items such as Cost reduction program and other charges, purchase accounting impacts of the Linde AG merger, and pension settlement charges. Adjusted amounts are non-GAAP measures which are intended to supplement investors’ understanding of the company’s financial information by providing measures which investors, financial analysts and management find useful in evaluating the company’s operating performance.  Items which the company does not believe to be indicative of on-going business performance are excluded from these calculations so that investors can better evaluate and analyze historical and future business trends on a consistent basis.  In addition, operating results, excluding these items, is important to management's development of annual and long-term employee incentive compensation plans. Definitions of these non-GAAP measures may not be comparable to similar definitions used by other companies and are not a substitute for similar GAAP measures. \nThe non-GAAP measures and reconciliations are separately included in a later section in the MD&A titled \"Non-GAAP Measures and Reconciliations.\"\n24\nTable of Contents\n    \nConsolidated Results\n \nThe following table provides summary information for the quarters and nine months ended September 30, 2025 and 2024. The reported amounts are GAAP amounts from the Consolidated Statement of Income. The adjusted amounts are intended to supplement investors' understanding of the company's financial information and are not a substitute for GAAP measures:\n \n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars, except per share data)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n8,615 \n$\n8,356 \n3 \n%\n$\n25,222 \n$\n24,723 \n2 \n%\nCost of sales, exclusive of depreciation and amortization\n$\n4,379 \n$\n4,356 \n1 \n%\n$\n12,842 \n$\n12,823 \n— \n%\nAs a percent of sales\n50.8 \n%\n52.1 \n%\n50.9 \n%\n51.9 \n%\nSelling, general and administrative\n$\n897 \n$\n823 \n9 \n%\n$\n2,553 \n$\n2,523 \n1 \n%\nAs a percent of sales\n10.4 \n%\n9.8 \n%\n10.1 \n%\n10.2 \n%\nDepreciation and amortization\n$\n961 \n$\n960 \n— \n%\n$\n2,813 \n$\n2,867 \n(2)\n%\nCost reduction program and other charges\n$\n(11)\n$\n145 \n(108)\n%\n$\n44 \n$\n145 \n(70)\n%\nOther income (expense) - net\n$\n14 \n$\n51 \n(73)\n%\n$\n47 \n$\n111 \n(58)\n%\nOperating profit\n$\n2,367 \n$\n2,086 \n13 \n%\n$\n6,905 \n$\n6,365 \n8 \n%\nOperating margin\n27.5 \n%\n25.0 \n%\n27.4 \n%\n25.7 \n%\nInterest expense - net\n$\n64 \n$\n68 \n(6)\n%\n$\n191 \n$\n203 \n(6)\n%\nNet pension and OPEB cost (benefit), excluding service cost\n$\n(57)\n$\n(45)\n27 \n%\n$\n(172)\n$\n(144)\n19 \n%\nEffective tax rate\n18.0 \n%\n24.1 \n%\n21.9 \n%\n23.3 \n%\nIncome from equity investments\n$\n36 \n$\n38 \n(5)\n%\n$\n107 \n$\n131 \n(18)\n%\nNoncontrolling interests\n$\n(43)\n$\n(53)\n(19)\n%\n$\n(117)\n$\n(128)\n(9)\n%\nNet Income – Linde plc\n$\n1,929 \n$\n1,550 \n24 \n%\n$\n5,368 \n$\n4,840 \n11 \n%\nDiluted earnings per share\n$\n4.09 \n$\n3.22 \n27 \n%\n$\n11.34 \n$\n10.02 \n13 \n%\nDiluted shares outstanding\n471,509 \n480,898 \n(2)\n%\n473,500 \n483,186 \n(2)\n%\nNumber of employees\n65,489 \n65,596 \n— \n%\n65,489 \n65,596 \n— \n%\nAdjusted Amounts (a)\nDepreciation and amortization\n$\n759 \n$\n720 \n5 \n%\n$\n2,222 \n$\n2,150 \n3 \n%\nOperating profit\n$\n2,558 \n$\n2,477 \n3 \n%\n$\n7,552 \n$\n7,240 \n4 \n%\nOperating margin\n29.7 \n%\n29.6 \n%\n29.9 \n%\n29.3 \n%\nEffective tax rate\n22.7 \n%\n23.6 \n%\n23.5 \n%\n23.3 \n%\nNet Income – Linde plc\n$\n1,987 \n$\n1,896 \n5 \n%\n$\n5,804 \n$\n5,576 \n4 \n%\nDiluted earnings per share\n$\n4.21 \n$\n3.94 \n7 \n%\n$\n12.26 \n$\n11.54 \n6 \n%\nOther Financial Data (a)\nEBITDA\n$\n3,364 \n$\n3,084 \n9 \n%\n$\n9,825 \n$\n9,363 \n5 \n%\nAs percent of sales\n39.0 \n%\n36.9 \n%\n39.0 \n%\n37.9 \n%\nAdjusted EBITDA\n$\n3,377 \n$\n3,253 \n4 \n%\n$\n9,941 \n$\n9,575 \n4 \n%\nAs percent of sales\n39.2 \n%\n38.9 \n%\n39.4 \n%\n38.7 \n%\n(a)\nAdjusted Amounts and Other Financial Data are non-GAAP performance measures. A reconciliation of reported amounts to adjusted amounts can be found in the \"Non-GAAP Measures and Reconciliations\" section of this MD&A. \nReported \nIn the third quarter of 2025, Linde's sales were $8,615 million, 3%, above the prior year. Sales grew 2% from higher price attainment. Acquisitions increased sales by 1% in the third quarter. Currency translation increased sales by 1% in the quarter driven primarily by the strengthening of the Euro and British pound against the U.S dollar. Cost pass-through, representing the contractual billing of energy cost variances primarily to onsite customers, was flat in the quarter. Engineering sales decreased by 1% in the quarter. Volumes were flat in the quarter versus the 2024 respective period, as base volume declines were largely offset by new project start-ups.\n25\nTable of Contents\n    \nReported operating profit for the third quarter of 2025 was $2,367 million, or 27.5% of sales, 13% above the prior year. The reported year-over-year increase was primarily driven by higher pricing and productivity initiatives and lower cost reduction program and other charges, which more than offset adverse impacts from cost inflation. The reported effective tax rate (\"ETR\") was 18.0% in the third quarter 2025 versus 24.1% in the third quarter 2024. Diluted earnings per share (\"EPS\") was $4.09, or 27% above EPS of $3.22 in the third quarter of 2024, primarily due to higher net income - Linde plc and lower diluted shares outstanding.\nAdjusted\nIn the third quarter of 2025, adjusted operating profit of $2,558 million, or 29.7% of sales, was 3% higher as compared to 2024, driven by higher pricing and productivity initiatives partially offset by cost inflation. The adjusted ETR was 22.7% in the third quarter 2025 versus 23.6% in the respective 2024 quarter. On an adjusted basis, EPS was $4.21, 7% above the 2024 adjusted EPS of $3.94, driven by higher adjusted net income - Linde plc and lower diluted shares outstanding.\nOutlook\nLinde provides quarterly updates on operating results, material trends that may affect financial performance, and financial guidance via quarterly earnings releases and investor teleconferences. These updates are available on the company’s website, www.linde.com, but are not incorporated herein.\nResults of operations\nThe changes in consolidated sales compared to the prior year are attributable to the following:\n \nQuarter Ended September 30, 2025 vs. 2024\nNine months ended September 30, 2025 vs. 2024\n \n% Change\n% Change\nFactors Contributing to Changes - Sales\nVolume\n— \n%\n(1)\n%\nPrice/Mix\n2 \n%\n2 \n%\nCost pass-through\n— \n%\n— \n%\nCurrency\n1 \n%\n— \n%\nAcquisitions/divestitures\n1 \n%\n1 \n%\nEngineering\n(1)\n%\n— \n%\n3 \n%\n2 \n%\nSales\nSales increased by 3% for the third quarter of 2025 and 2% for the nine months ended September 30, 2025, versus the respective 2024 periods. Higher price attainment increased sales by 2% in the quarter and nine months ended September 30, 2025. Acquisitions increased sales by 1% in the quarter and nine months ended September 30, 2025. Currency translation increased sales by 1% in the quarter, primarily driven by the strengthening of the Euro and British pound against the \nU.S. dollar\n. In the nine months ended September 30, 2025, currency translation impact on sales was flat. Cost pass-through was flat in both the quarter and nine months ended September 30, 2025. Volumes were flat in the quarter and decreased sales by 1% for the nine months ended September 30, 2025, as base volume declines were partially offset by new project start-ups. Engineering sales decreased by 1% in the quarter and was flat for the nine months ended September 30, 2025.\nCost of sales, exclusive of depreciation and amortization\nCost of sales, exclusive of depreciation and amortization, increased $23 million, or 1%, for the third quarter of 2025 primarily due to cost inflation, partially offset by productivity gains, and increased $19 million for the nine months ended September 30, 2025. Cost of sales, exclusive of depreciation and amortization, was 50.8% and 50.9% of sales for the third quarter and nine months ended September 30, 2025, respectively, versus 52.1% and 51.9% for the respective 2024 periods. The decrease as a percentage of sales in the quarter and year-to-date periods was primarily due to higher pricing and productivity gains.\n26\nTable of Contents\n    \nSelling, general and administrative expenses\nSelling, general and administrative expense (\"SG&A\") increased $74 million, or 9%, for the third quarter of 2025 and increased $30 million, or 1%, for the nine months ended September 30, 2025. SG&A was\n \n10.4% of third quarter sales and 10.1% of sales for the nine months ended September 30, 2025 versus 9.8% and 10.2% of sales for the respective 2024 periods. Currency impact increased SG&A by approximately $12 million for the third quarter and was flat year to date 2025. Excluding foreign currency, SG&A increased during the third quarter of 2025 and nine months ended September 30, 2025, due to acquisitions and cost inflation, partially offset by savings from cost reduction programs and productivity initiatives. \nDepreciation and amortization\nReported depreciation and amortization expense was flat for the third quarter of 2025 and decreased $54 million, or 2%, in the nine months ended September 30, 2025, primarily due to lower depreciation and amortization of assets acquired in the merger, partially offset by the net impact of new project start-ups.\nOn an adjusted basis, depreciation and amortization increased $39 million, or 5%, for the third quarter of 2025 and increased $72 million, or 3%, for the nine months ended September 30, 2025. Currency impact increased depreciation and amortization by $9 million for the third quarter and was flat year to date 2025. Excluding currency, for the quarter and year-to-date periods, the underlying depreciation and amortization increase was driven largely by new project start-ups.\nCost reduction program and other charges\nCost reduction program and other charges were a benefit of $11 million for the third quarter of 2025, and charges of $44 million for the nine months ended September 30, 2025, primarily related to severance charges. On an adjusted basis, these costs have been excluded in both periods. 2024 included severance charges of $148 million and $165 million for the quarter and year to date periods, other cost reduction charges of $40 million and $23 million for the quarter and year to date periods, and other benefit of $43 million for the quarter and year to date periods related to a divestiture in APAC.\nOther income (expense) - net\nReported other income (expense) - net was a benefit of $14 million for the third quarter of 2025 and $47 million for the year-to-date period. 2024 other income (expense) for the year-to-date period included a benefit of $43 million in insurance recoveries primarily within the Other segment, recognized during the first quarter, and a benefit of $36 million related to a settlement with a supplier in the Americas segment, recognized during the third quarter.\nOperating profit \nOn a reported basis, operating profit increased $281 million, or 13%, for the third quarter of 2025 and increased $540 million, or 8%, for the nine months ended September 30, 2025. The increase in both periods was primarily due to higher pricing and savings from productivity initiatives and lower cost reduction program and other charges, which more than offset the adverse impacts of cost inflation.\nOn an adjusted basis, which excludes the impacts of merger-related purchase accounting as well as cost reduction programs and other charges, operating profit increased $81 million, or 3%, in the third quarter of 2025 and increased $312 million, or 4%, for the nine months ended September 30, 2025. Operating profit growth was driven by higher pricing and productivity initiatives, which more than offset the effects of cost inflation during the quarter and year-to-date periods of 2025. A discussion of operating profit by segment is included in the segment discussion that follows.\nInterest expense - net\n \nReported interest expense - net decreased $4 million, or 6%, for the third quarter of 2025 and decreased $12 million, or 6%, for the nine months ended September 30, 2025.\nNet pension and OPEB cost (benefit), excluding service cost\nReported net pension and OPEB cost (benefit), excluding service cost, was a benefit of $57 million and $172 million for the quarter and nine months ended September 30, 2025, respectively, versus $45 million and $144 million for the respective 2024 periods. The increase in the benefit primarily relates to lower interest cost due to lower benefit obligations and higher amortization of deferred gains year-over-year.\n27\nTable of Contents\n    \nEffective tax rate\nThe reported effective tax rate (\"ETR\") for the quarter and nine months ended September 30, 2025 was 18.0% and 21.9%, respectively, versus 24.1% and 23.3% for the respective 2024 periods. The decrease in the 2025 quarter was primarily due to a tax rate decrease in EMEA including merger-related purchase accounting impacts. The decrease in the year-to-date rate was primarily due to a tax rate decrease in EMEA, partially offset by tax benefits in 2024 from a repatriation that did not recur in 2025. The benefit related to the tax rate decrease in EMEA for the quarter and year-to-date periods was $156 million.\nOn an adjusted basis, the ETR for the quarter and nine months ended September 30, 2025 was 22.7% and 23.5%, respectively, versus 23.6% and 23.3% for the respective 2024 periods. The decrease in the quarter rate was primarily due to tax rate change in Germany excluding merger-related purchase accounting impacts. The increase in the year-to-date rate was primarily due to tax benefits from a repatriation in 2024 that did not recur in 2025 partially offset by a tax rate decrease in Germany.\nOn July 4, 2025, H.R.1 - One Big Beautiful Bill Act was enacted into law (OBBBA). The Bill makes permanent key elements of the 2017 Tax Cuts and Jobs Act, including 100% bonus depreciation and domestic research cost expensing. These changes provide current and future cash tax benefits to the company. The company continues to evaluate the impact of other provisions of OBBBA but does not expect them to be material.\nIncome from equity investments\n \nReported income from equity investments for the third quarter and nine months ended September 30, 2025 was $36 million and $107 million, respectively, versus $38 million and $131 million for the respective 2024 periods. \nOn an adjusted basis, income from equity investments for the third quarter and nine months ended September 30, 2025 was $60 million and $167 million, respectively, versus $56 million and $185 million for the respective 2024 periods. \nNoncontrolling interests \nAt September 30, 2025, noncontrolling interests consisted primarily of non-controlling shareholders' investments in APAC (primarily China). Reported noncontrolling interests income was $43 million and $117 million for the third quarter of 2025 and nine months ended September 30, 2025, respectively. Noncontrolling interest was $53 million and $128 million for the respective 2024 periods, which included the impact of a divestiture in the APAC segment.\nNet Income – Linde plc\nReported net income - Linde plc increased $379 million, or 24%, for the third quarter of 2025 and increased $528 million, or 11%, for the nine months ended September 30, 2025 versus the respective 2024 period. \nOn an adjusted basis, which excludes the impacts of merger-related purchase accounting and cost reduction program and other charges, net income - Linde plc increased $91 million, or 5%, for the third quarter of 2025 and increased $228 million, or 4%, for the nine months ended September 30, 2025 versus the respective 2024 period. \nOn both a reported and adjusted basis, the increase was largely driven by higher operating profit.\nDiluted earnings per share \nReported diluted earnings per share increased $0.87, or 27%, for the third quarter of 2025 versus the respective 2024 period. Reported diluted earnings per share increased $1.32, or 13%, for the nine months ended September 30, 2025 versus the respective 2024 period. \nOn an adjusted basis, diluted EPS increased $0.27, or 7%, for the third quarter versus the respective 2024 period. On an adjusted basis, diluted EPS increased $0.72, or 6%, for the nine months ended September 30, 2025, versus the respective 2024 period. \nThe increase on both a reported and adjusted basis was primarily due to higher net income - Linde plc and lower diluted shares outstanding. \nEmployees\nThe number of employees at September 30, 2025 was 65,489, a decrease of 107 employees from September 30, 2024, primarily due to the ongoing impact of cost reduction programs, partially offset by acquisitions.\n28\nTable of Contents\n    \nOther Financial Data\nEBITDA was $3,364 million for the third quarter of 2025 as compared to $3,084 million in the respective 2024 period.  EBITDA was $9,825 million for the nine months ended September 30, 2025 as compared to $9,363 million in the respective 2024 period.\nAdjusted EBITDA increased to $3,377 million for the third quarter of 2025 from $3,253 million in the respective 2024 period. Adjusted EBITDA increased to $9,941 million for the nine months ended September 30, 2025 from $9,575 million in the respective 2024 period. The increase on both a reported and adjusted basis was driven by higher net income - Linde plc versus prior year.\nSee the \"Non-GAAP Measures and Reconciliations\" section for definitions and reconciliations of these adjusted non-GAAP measures to reported GAAP amounts.\nOther Comprehensive Income (Loss)\nOther comprehensive loss for the third quarter was $165 million and income was $507 million for the nine months ended September 30, 2025. The loss in the quarter and income in the year-to-date periods resulted primarily from currency translation adjustments of $167 million and $466 million, respectively. The translation adjustments reflect the impact of translating local currency foreign subsidiary financial statements to U.S. dollars, and are largely driven by the movement of the U.S. dollar against major currencies, including the Euro and British pound. See the \"Currency\" section of the MD&A for exchange rates used for translation purposes and Note 10 to the condensed consolidated financial statements for a summary of the currency translation adjustment component of accumulated other comprehensive income (loss) by segment.\nSegment Discussion\nThe following summary of sales and operating profit by segment provides a basis for the discussion that follows. Linde plc evaluates the performance of its reportable segments based on operating profit, excluding items not indicative of ongoing business trends.\n \nThe reported amounts are GAAP amounts from the Consolidated Statement of Income.\nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSALES\nAmericas\n$\n3,846 \n$\n3,618 \n6 \n%\n$\n11,324 \n$\n10,833 \n5 \n%\nEMEA\n2,178 \n2,111 \n3 \n%\n6,371 \n6,293 \n1 \n%\nAPAC\n1,741 \n1,716 \n1 \n%\n4,935 \n4,964 \n(1)\n%\nEngineering\n519 \n611 \n(15)\n%\n1,635 \n1,694 \n(3)\n%\nOther\n331 \n300 \n10 \n%\n957 \n939 \n2 \n%\nTotal sales\n$\n8,615 \n$\n8,356 \n3 \n%\n$\n25,222 \n$\n24,723 \n2 \n%\nSEGMENT OPERATING PROFIT\nAmericas\n$\n1,199 \n$\n1,153 \n4 \n%\n$\n3,545 \n$\n3,400 \n4 \n%\nEMEA\n781 \n703 \n11 \n%\n2,283 \n2,094 \n9 \n%\nAPAC\n490 \n497 \n(1)\n%\n1,431 \n1,418 \n1 \n%\nEngineering\n101 \n108 \n(6)\n%\n305 \n304 \n— \n%\nOther\n(13)\n16 \n(181)\n%\n(12)\n24 \n(150)\n%\nSegment operating profit\n$\n2,558 \n$\n2,477 \n3 \n%\n$\n7,552 \n$\n7,240 \n4 \n%\nReconciliation to reported operating profit:\nCost reduction program and other charges\n11 \n(145)\n(44)\n(145)\nPurchase accounting impacts - Linde AG (a)\n(202)\n(246)\n(603)\n(730)\nTotal operating profit\n$\n2,367 \n$\n2,086 \n$\n6,905 \n$\n6,365 \n(a)\nTo adjust for purchase accounting impacts related to the merger.\n29\nTable of Contents\n    \nAmericas\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n3,846 \n$\n3,618 \n6 \n%\n$\n11,324 \n$\n10,833 \n5 \n%\nOperating profit\n$\n1,199 \n$\n1,153 \n4 \n%\n$\n3,545 \n$\n3,400 \n4 \n%\nAs a percent of sales\n31.2 \n%\n31.9 \n%\n31.3 \n%\n31.4 \n%\n \nQuarter Ended September 30, 2025 vs. 2024\nNine Months Ended September 30, 2025 vs. 2024\n \n% Change\n% Change\nFactors Contributing to Changes - Sales\nVolume\n1 \n%\n1 \n%\nPrice/Mix\n3 \n%\n3 \n%\nCost pass-through\n2 \n%\n2 \n%\nCurrency\n— \n%\n(2)\n%\nAcquisitions/divestitures\n— \n%\n1 \n%\n6 \n%\n5 \n%\nThe Americas segment includes Linde's industrial gases operations in approximately 20 countries including the United States, Canada, Mexico, and Brazil.\nSales\nSales for the Americas segment increased $228 million, or 6%, in the third quarter and $491 million, or 5%, for the nine months ended September 30, 2025 versus the respective 2024 periods. Higher pricing contributed 3% to sales in the third quarter and 3% year to date. Cost pass-through increased sales by 2% in both the quarter and year-to-date periods, with minimal impact on operating profit. Volumes increased sales by 1% in both the quarter and year-to-date periods, primarily driven by electronics and metals and mining end markets including project start-ups. Acquisitions were flat in the quarter and increased sales by 1% year to date. Currency translation was flat in the third quarter and decreased sales by 2% year to date, \ndriven primarily by the weakening of the Brazilian real and Mexican peso against the U.S. dollar.\n \nOperating profit\n \nOperating profit in the Americas segment increased $46 million, or 4%, in the third quarter and $145 million, or 4%, for the nine months ended September 30, 2025 versus the respective 2024 period, driven primarily by higher pricing and continued productivity initiatives, which more than offset cost inflation. 2024 included a settlement gain with a supplier, recognized during the third quarter.\nEMEA\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n2,178 \n$\n2,111 \n3 \n%\n$\n6,371 \n$\n6,293 \n1 \n%\nOperating profit\n$\n781 \n$\n703 \n11 \n%\n$\n2,283 \n$\n2,094 \n9 \n%\nAs a percent of sales\n35.9 \n%\n33.3 \n%\n35.8 \n%\n33.3 \n%\n30\nTable of Contents\n    \n \nQuarter Ended September 30, 2025 vs. 2024\nNine Months Ended September 30, 2025 vs. 2024\n% Change\n% Change\nFactors Contributing to Changes - Sales\nVolume\n(3)\n%\n(4)\n%\nPrice/Mix\n2 \n%\n2 \n%\nCost pass-through\n(1)\n%\n— \n%\nCurrency\n5 \n%\n3 \n%\nAcquisitions/divestitures\n— \n%\n— \n%\n3 \n%\n1 \n%\nThe EMEA segment includes Linde's industrial gases operations in approximately 45 European, Middle Eastern and African countries including Germany, the United Kingdom, France, the Republic of South Africa and Sweden.  \nSales\n \nEMEA segment sales increased $67 million, or 3%, in the third quarter and increased $78 million, or 1%, for the nine months ended September 30, 2025, compared to the respective 2024 periods. Currency translation increased sales by 5% in the third quarter and 3% year to date, \ndriven primarily by the strengthening of the Euro and British pound against the U.S. dollar. \nHigher price attainment increased sales by 2% in both the quarter and year-to-date periods. Cost pass-through decreased sales by 1% in the quarter with minimal impact on operating profit and was flat year to date. Volumes decreased sales by 3% in the quarter and 4% in the year-to-date period, primarily driven by the metals and mining, manufacturing, and chemicals and energy end markets.\nOperating Profit\nOperating profit for the EMEA segment increased by $78 million, or 11%, in the third quarter and $189 million, or 9%, for the nine months ended September 30, 2025, compared to the respective 2024 periods. The increase in the third quarter and year to date was driven primarily by higher pricing, currency translation, and continued productivity initiatives, partially offset by lower volumes. \nAPAC\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n1,741 \n$\n1,716 \n1 \n%\n$\n4,935 \n$\n4,964 \n(1)\n%\nOperating profit\n$\n490 \n$\n497 \n(1)\n%\n$\n1,431 \n$\n1,418 \n1 \n%\nAs a percent of sales\n28.1 \n%\n29.0 \n%\n29.0 \n%\n28.6 \n%\n \nQuarter Ended September 30, 2025 vs. 2024\nNine Months Ended September 30, 2025 vs. 2024\n \n% Change\n% Change\nFactors Contributing to Changes - Sales\nVolume/Equipment\n— \n%\n(1)\n%\nPrice/Mix\n(1)\n%\n— \n%\nCost pass-through\n— \n%\n— \n%\nCurrency\n(1)\n%\n(1)\n%\nAcquisitions/divestitures\n3 \n%\n1 \n%\n1 \n%\n(1)\n%\nThe APAC segment includes Linde's industrial gases operations in approximately 15 Asian and South Pacific countries and regions including China, Australia, India, and South Korea.\n31\nTable of Contents\n    \nSales\n \nSales for the APAC segment increased $25 million, or 1%, in the third quarter and decreased $29 million, or 1%, for the nine months ended September 30, 2025 versus the respective 2024 periods. Acquisitions increased sales by 3% in the quarter and 1% in the year-to-date period.\n Volumes \nwere flat\n in the quarter and \ndecreased sales by 1%\n in the \nyear-to-date period. \nPrice\n decreased sales by 1% in the quarter largely due to helium and was flat year to date.\n Currency translation decreased sales by 1% in the quarter and year-to-date periods, primarily due to the weakening of the Australian dollar against the U.S. dollar. \nOperating profit\n \nOperating profit in the APAC segment decreased $7 million, or \n1%,\n in the third quarter, driven primarily by lower helium pricing, currency translation, partially offset by acquisitions. In the nine months ended September 30, 2025, operating profit increased $13 million, or \n1%\n, driven primarily by productivity initiatives and acquisitions, partially offset by cost inflation, lower volumes, and currency translation. \nEngineering\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n519 \n$\n611 \n(15)\n%\n$\n1,635 \n$\n1,694 \n(3)\n%\nOperating profit\n$\n101 \n$\n108 \n(6)\n%\n$\n305 \n$\n304 \n— \n%\nAs a percent of sales\n19.5 \n%\n17.7 \n%\n18.7 \n%\n17.9 \n%\n \nQuarter Ended September 30, 2025 vs. 2024\nNine Months Ended September 30, 2025 vs. 2024\n \n% Change\n% Change\nFactors Contributing to Changes - Sales\nCurrency\n4 \n%\n2 \n%\nOther\n(19)\n%\n(5)\n%\n(15)\n%\n(3)\n%\nSales \nEngineering segment sales decreased $92 million, or 15%, in the third quarter and decreased $59 million, or 3%, for the nine months ended September 30, 2025, as compared to the respective 2024 periods, driven by project timing. Currency translation increased sales by 4% in the quarter and increased sales by 2% in the year-to-date period, primarily due to the strengthening of the Euro against the U.S. dollar.\nOperating profit \nEngineering segment operating profit decreased $7 million, or 6%, in the third quarter primarily driven by project timing, partially offset by currency translation impacts and was flat for the nine months ended September 30, 2025, as compared to the respective 2024 periods.\nOther\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nSales\n$\n331 \n$\n300 \n10 \n%\n$\n957 \n$\n939 \n2 \n%\nOperating profit (loss)\n$\n(13)\n$\n16 \n(181)\n%\n$\n(12)\n$\n24 \n(150)\n%\nAs a percent of sales\n(3.9)\n%\n5.3 \n%\n(1.3)\n%\n2.6 \n%\n32\nTable of Contents\n    \n \nQuarter Ended September 30, 2025 vs. 2024\nNine Months Ended September 30, 2025 vs. 2024\n \n% Change\n% Change\nFactors Contributing to Changes - Sales\nVolume/price\n8 \n%\n1 \n%\nCost pass-through\n1 \n%\n— \n%\nCurrency\n1 \n%\n1 \n%\nAcquisitions/divestitures\n— \n%\n— \n%\n10 \n%\n2 \n%\nOther consists of corporate costs and a few smaller businesses including Linde Advanced Material Technologies (LAMT) and global helium wholesale, which individually do not meet the quantitative thresholds for separate presentation. \nSales \nSales for Other increased $31 million, or 10%, for the third quarter and $18 million, or 2% for the nine months ended September 30, 2025, versus the respective 2024 periods. Underlying s\nales \nincreased by 8%\n in the quarter and\n 1% in the year-to-date period, \nprimarily due to higher volumes in LAMT. Currency translation \nincreased sales by 1% in the quarter and year-to-date periods. \nOperating profit\n \nOperating profit in Other decreased $29 million in the third quarter and\n $36 million for the nine months ended September 30, 2025 \nversus the respective 2024 periods. The decrease in the quarter was primarily driven by helium and cost inflation. The decrease in the \nyear-to-date period\n was driven by helium and an insurance recovery in 2024, partially offset by \nlower costs and continued productivity initiatives\n.   \nCurrency\nThe results of Linde's non-U.S. operations are translated to the company’s reporting currency, the U.S. dollar, from the functional currencies. For most operations, Linde uses the local currency as its functional currency. There is inherent variability and unpredictability in the relationship of these functional currencies to the U.S. dollar and such currency movements may materially impact Linde's results of operations in any given periods.\nTo help understand the reported results, the following is a summary of the significant currencies underlying Linde's consolidated results and the exchange rates used to translate the financial statements (rates of exchange expressed in units of local currency per U.S. dollar):\n \nPercentage of YTD 2025 Consolidated Sales\nExchange Rate for\nIncome Statement\nExchange Rate for\nBalance Sheet\n \nYear-To-Date Average\nSeptember 30,\nDecember 31,\nCurrency\n2025\n2024\n2025\n2024\nEuro\n17 \n%\n0.89 \n0.92 \n0.85 \n0.97 \nChinese yuan\n7 \n%\n7.22 \n7.20 \n7.12 \n7.30 \nBritish pound\n5 \n%\n0.76 \n0.78 \n0.74 \n0.80 \nBrazilian real\n4 \n%\n5.65 \n5.23 \n5.32 \n6.18 \nAustralian dollar\n4 \n%\n1.56 \n1.51 \n1.51 \n1.62 \nMexican peso\n3 \n%\n19.48 \n17.67 \n18.31 \n20.83 \nKorean won\n3 \n%\n1,412 \n1,352 \n1,404 \n1,472 \nCanadian dollar\n3 \n%\n1.40 \n1.36 \n1.39 \n1.44 \nIndian rupee\n2 \n%\n86.50 \n83.41 \n88.79 \n85.61 \nSwedish krona\n1 \n%\n9.92 \n10.50 \n9.42 \n11.07 \nSouth African rand\n1 \n%\n18.13 \n18.46 \n17.27 \n18.84 \nSwiss franc\n1 \n%\n0.84 \n0.89 \n0.80 \n0.91 \n33\nTable of Contents\n    \nLiquidity, Capital Resources and Other Financial Data\nThe following selected cash flow information provides a basis for the discussion that follows:\n(Millions of dollars)\nNine Months Ended September 30,\n \n2025\n2024\nNET CASH PROVIDED BY (USED FOR):\nOPERATING ACTIVITIES\nNet income (including noncontrolling interests)\n$\n5,485 \n$\n4,968 \nNon-cash charges (credits):\nAdd:  Depreciation and amortization\n2,813 \n2,867 \nAdd:  Deferred income taxes\n(458)\n(308)\nAdd:  Share-based compensation\n133 \n120 \nAdd:  Cost reduction program and other charges, net of payments\n(71)\n52 \nNet income adjusted for non-cash charges\n7,902 \n7,699 \nLess: Working capital\n(461)\n(916)\nLess: Pension contributions\n(20)\n(29)\n  Other\n(101)\n(140)\nNet cash provided by (used for) operating activities\n$\n7,320 \n$\n6,614 \nINVESTING ACTIVITIES\nCapital expenditures\n(3,803)\n(3,247)\nAcquisitions, net of cash acquired\n(393)\n(175)\nDivestitures, net of cash divested and asset sales\n31 \n154 \nOther investing, net\n(95)\n— \nNet cash provided by (used for) investing activities\n$\n(4,260)\n$\n(3,268)\nFINANCING ACTIVITIES\nDebt increase (decrease) - net\n1,917 \n2,628 \nIssuances (purchases) of common stock - net\n(3,191)\n(3,120)\nCash dividends - Linde plc shareholders\n(2,113)\n(1,996)\nNoncontrolling interest transactions and other\n(149)\n(261)\nNet cash provided by (used for) financing activities\n$\n(3,536)\n$\n(2,749)\nEffect of exchange rate changes on cash and cash equivalents\n$\n135 \n$\n(74)\nCash and cash equivalents, end-of-period\n$\n4,509 \n$\n5,187 \nCash Flow from Operations\nCash provided by operations of $7,320 million for the nine months ended September 30, 2025 increased $706 million, or 11%, versus 2024. The increase was driven primarily by higher net income adjusted for non-cash charges and lower net working capital requirements.\nLinde estimates that the total 2025 required contributions to its pension plans will be in the range of approximately $25 million to\n $35 million\n, of which $20 million has been made through September 30, 2025.\nInvesting\nNet cash used for investing activities of $4,260 million for the nine months ended September 30, 2025 increased $992 million, or 30%, versus 2024, due to higher capital expenditures and acquisition spend, net of cash acquired.\nCapital expenditures for the nine months ended September 30, 2025 were $3,803 million, $556 million higher than the prior year, primarily due to investments in new plant and production equipment for backlog growth requirements.\n34\nTable of Contents\n    \nAt September 30, 2025, Linde's sale of gas backlog of large projects under construction was approximately $7.1 billion. This represents the total estimated capital cost of large plants under construction.\nAcquisitions, net of cash acquired, were $393 million for the nine months ended September 30, 2025, and relate primarily to businesses in the Americas, APAC and EMEA segments. Acquisitions, net of cash acquired, were $175 million for the nine months ended September 30, 2024 and related primarily to packaged gas businesses in the Americas segment.\nDivestitures, net of cash divested and asset sales, for the nine months ended September 30, 2025 were $31 million. 2024 divestitures, net of cash divested and asset sales were $154 million, which primarily related to $69 million in net proceeds for a\ndivestiture in APAC and a settlement with a supplier in the Americas. \nOther investing, net for the nine months ended September 30, 2025 was outflows of $95 million and relate to the cash settlement of foreign exchange contracts designated in a net investment hedging relationship.\nFinancing\nCash used for financing activities was $3,536 million for the nine months ended September 30, 2025 as compared to $2,749 million for the nine months ended September 30, 2024. Cash provided by debt was $1,917 million in 2025 versus $2,628 million in 2024, driven primarily by lower net debt issuances in 2025 partially offset by higher commercial paper issuances. For the nine months ended September 30, 2025, Linde issued €2,250 million Euro-denominated notes and CHF500 million Swiss-franc denominated notes and redeemed or repaid $1,000 million U.S. dollar-denominated notes and €500 million Euro denominated notes.\nNet purchases of ordinary shares were $3,191 million in 2025 versus $3,120 million in 2024.  For additional information related to the share repurchase programs, see Part II Item 2. Unregistered Sales of Equity Securities and Use of Proceeds.  \nCash dividends of $2,113 million increased $117 million from 2024 driven primarily by a 8% increase in quarterly dividends per share from $1.39 per share to $1.50 per share, partially offset by lower shares outstanding. Cash used for Noncontrolling interest transactions and other was $149 million for the nine months ended September 30, 2025 versus cash used of $261 million for the respective 2024 period, driven by higher cash inflows from financing related derivatives.\nThe company continues to believe it has sufficient operating flexibility, cash, and funding sources to maintain adequate amounts of liquidity to meet its business needs around the world. The company maintains a $5 billion and a $1.5 billion unsecured and undrawn revolving credit agreement with no associated financial covenants. No borrowings were outstanding under the credit agreements as of September 30, 2025. The company does not anticipate any limitations on its ability to access the debt capital markets and/or other external funding sources and remains committed to its strong ratings from Moody’s and Standard & Poor’s.\nLegal Proceedings\nSee Note 8 to the condensed consolidated financial statements.\n35\nTable of Contents\n    \nNON-GAAP MEASURES AND RECONCILIATIONS\n(Millions of dollars, except per share data)\nThe following non-GAAP measures are intended to supplement investors’ understanding of the company’s financial information by providing measures which investors, financial analysts and management use to help evaluate the company’s operating performance and liquidity.  Items which the company does not believe to be indicative of on-going business trends are excluded from these calculations so that investors can better evaluate and analyze historical and future business trends on a consistent basis.  Definitions of these non-GAAP measures may not be comparable to similar definitions used by other companies and are not a substitute for similar GAAP measures. \nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAdjusted Operating Profit and Operating Margin\nReported operating profit\n$\n2,367 \n$\n2,086 \n$\n6,905 \n$\n6,365 \nAdd: Cost reduction program and other charges\n(11)\n145 \n44 \n145 \nAdd: Purchase accounting impacts - Linde AG (c)\n202 \n246 \n603 \n730 \nTotal adjustments\n191 \n391 \n647 \n875 \nAdjusted operating profit\n$\n2,558 \n$\n2,477 \n$\n7,552 \n$\n7,240 \nReported percentage change\n13 \n%\n8 \n%\nAdjusted percentage change\n3 \n%\n4 \n%\nReported sales\n$\n8,615 \n$\n8,356 \n$\n25,222 \n$\n24,723 \nReported operating margin\n27.5 \n%\n25.0 \n%\n27.4 \n%\n25.7 \n%\nAdjusted operating margin\n29.7 \n%\n29.6 \n%\n29.9 \n%\n29.3 \n%\nAdjusted Depreciation and amortization\nReported depreciation and amortization\n$\n961 \n$\n960 \n$\n2,813 \n$\n2,867 \nLess: Purchase accounting impacts - Linde AG (c)\n(202)\n(240)\n(591)\n(717)\nAdjusted depreciation and amortization\n$\n759 \n$\n720 \n$\n2,222 \n$\n2,150 \nAdjusted Other Income (Expense) - net\nReported Other Income (Expense) - net\n$\n14 \n$\n51 \n$\n47 \n$\n111 \nAdd: Purchase accounting impacts - Linde AG (c)\n— \n(6)\n(12)\n(13)\nAdjusted Other Income (Expense) - net\n$\n14 \n$\n57 \n$\n59 \n$\n124 \nAdjusted Net Pension and OPEB Cost (Benefit), Excluding Service Cost\nReported net pension and OPEB cost (benefit), excluding service cost\n$\n(57)\n$\n(45)\n$\n(172)\n$\n(144)\nAdd: Pension settlement charges\n(2)\n(6)\n(2)\n(6)\nAdjusted Net Pension and OPEB cost (benefit), excluding service costs\n$\n(59)\n$\n(51)\n$\n(174)\n$\n(150)\nAdjusted Interest Expense - Net\nReported interest expense - net\n$\n64 \n$\n68 \n$\n191 \n$\n203 \nAdd: Purchase accounting impacts - Linde AG (c)\n— \n— \n— \n3 \n36\nTable of Contents\n    \nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAdjusted interest expense - net\n$\n64 \n$\n68 \n$\n191 \n$\n206 \nAdjusted Income Taxes (a)\nReported income taxes\n$\n424 \n$\n498 \n$\n1,508 \n$\n1,469 \nAdd: Purchase accounting impacts - Linde AG (c)\n155 \n60 \n245 \n176 \nAdd: Pension settlement charges\n— \n1 \n— \n1 \nAdd: Cost reduction program and other charges\n1 \n21 \n19 \n26 \nTotal adjustments \n156 \n82 \n264 \n203 \nAdjusted income taxes \n$\n580 \n$\n580 \n$\n1,772 \n$\n1,672 \nAdjusted Effective Tax Rate (a)\nReported income before income taxes and equity investments\n$\n2,360 \n$\n2,063 \n$\n6,886 \n$\n6,306 \nAdd: Pension settlement charge\n2 \n6 \n2 \n6 \nAdd: Purchase accounting impacts - Linde AG (c)\n202 \n246 \n603 \n727 \nAdd: Cost reduction program and other charges\n(11)\n145 \n44 \n145 \nTotal adjustments \n193 \n397 \n649 \n878 \nAdjusted income before income taxes and equity investments\n$\n2,553 \n$\n2,460 \n$\n7,535 \n$\n7,184 \nReported Income taxes \n$\n424 \n$\n498 \n$\n1,508 \n$\n1,469 \nReported effective tax rate\n18.0 \n%\n24.1 \n%\n21.9 \n%\n23.3 \n%\nAdjusted income taxes \n$\n580 \n$\n580 \n$\n1,772 \n$\n1,672 \nAdjusted effective tax rate\n22.7 \n%\n23.6 \n%\n23.5 \n%\n23.3 \n%\nIncome from Equity Investments\nReported income from equity investments\n$\n36 \n$\n38 \n$\n107 \n$\n131 \nAdd: Purchase accounting impacts - Linde AG (c)\n18 \n18 \n54 \n54 \nAdd: Cost reduction program and other charges\n6 \n— \n6 \n— \nTotal adjustments\n24 \n18 \n60 \n54 \nAdjusted income from equity investments \n$\n60 \n$\n56 \n$\n167 \n$\n185 \nAdjusted Noncontrolling Interests\nReported noncontrolling interests\n$\n(43)\n$\n(53)\n$\n(117)\n$\n(128)\nAdd: Purchase accounting impacts - Linde AG (c)\n(3)\n(3)\n(9)\n(9)\nAdd: Cost reduction program and other charges\n— \n16 \n— \n16 \nTotal adjustments\n(3)\n13 \n(9)\n7 \nAdjusted noncontrolling interests\n$\n(46)\n$\n(40)\n$\n(126)\n$\n(121)\nAdjusted Net Income - Linde plc (b)\nReported net income\n$\n1,929 \n$\n1,550 \n$\n5,368 \n$\n4,840 \nAdd: Pension settlement charge\n2 \n5 \n2 \n5 \nAdd: Cost reduction program and other charges\n(6)\n140 \n31 \n135 \nAdd: Purchase accounting impacts - Linde AG (c)\n62 \n201 \n403 \n596 \nTotal adjustments\n58 \n346 \n436 \n736 \n37\nTable of Contents\n    \nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAdjusted net income - Linde plc\n$\n1,987 \n$\n1,896 \n$\n5,804 \n$\n5,576 \nAdjusted Diluted EPS (b)\nReported diluted EPS\n$\n4.09 \n$\n3.22 \n$\n11.34 \n$\n10.02 \nAdd: Pension settlement charge\n— \n0.01 \n— \n0.01 \nAdd: Cost reduction program and other charges\n(0.01)\n0.29 \n0.07 \n0.28 \nAdd: Purchase accounting impacts - Linde AG (c)\n0.13 \n0.42 \n0.85 \n1.23 \nTotal adjustments\n0.12 \n0.72 \n0.92 \n1.52 \nAdjusted diluted EPS\n$\n4.21 \n$\n3.94 \n$\n12.26 \n$\n11.54 \nReported percentage change\n27 \n%\n13 \n%\nAdjusted percentage change\n7 \n%\n6 \n%\nAdjusted EBITDA and % of Sales\nNet Income - Linde plc\n$\n1,929 \n$\n1,550 \n$\n5,368 \n$\n4,840 \nAdd: Noncontrolling interests\n43 \n53 \n117 \n128 \nAdd: Net pension and OPEB cost (benefit), excluding service cost\n(57)\n(45)\n(172)\n(144)\nAdd: Interest expense\n64 \n68 \n191 \n203 \nAdd: Income taxes\n424 \n498 \n1,508 \n1,469 \nAdd: Depreciation and amortization\n961 \n960 \n2,813 \n2,867 \nEBITDA\n$\n3,364 \n$\n3,084 \n$\n9,825 \n$\n9,363 \nAdd: Cost reduction program and other charges\n(5)\n145 \n50 \n145 \nAdd: Purchase accounting impacts - Linde AG (c)\n18 \n24 \n66 \n67 \nTotal adjustments\n13 \n169 \n116 \n212 \nAdjusted EBITDA\n$\n3,377 \n$\n3,253 \n$\n9,941 \n$\n9,575 \nReported sales \n$\n8,615 \n$\n8,356 \n$\n25,222 \n$\n24,723 \n% of sales \nEBITDA\n39.0 \n%\n36.9 \n%\n39.0 \n%\n37.9 \n%\nAdjusted EBITDA as a % of Sales\n39.2 \n%\n38.9 \n%\n39.4 \n%\n38.7 \n%\n38\nTable of Contents\n    \n(a)  The income tax expense (benefit) on the non-GAAP pre-tax adjustments was determined using the applicable tax rates for the jurisdictions that were utilized in calculating the GAAP income tax expense (benefit) and included both current and deferred income tax amounts.\n(b)  Net of income taxes which are shown separately in “Adjusted Income Taxes and Effective Tax Rate”.\n(c)  The company believes that its non-GAAP measures excluding merger Purchase accounting impacts - Linde AG are useful to investors because: (i) the 2018 business combination was a merger of equals in an all-stock merger transaction, with no cash consideration, (ii)  the company is managed on a geographic basis and the results of certain geographies are more heavily impacted by merger purchase accounting than others, causing results that are not comparable at the reportable segment level, therefore, the impacts of merger purchase accounting adjustments to each segment vary and are not comparable within the company and when compared to other companies in similar regions, (iii) business management is evaluated and variable compensation is determined based on results excluding merger purchase accounting impacts, and; (iv) it is important to investors and analysts to understand the purchase accounting impacts to the financial statements.\nA summary of each of the adjustments made for Purchase accounting impacts - Linde AG are as follows:\nAdjusted Operating Profit and Margin:\n  The purchase accounting adjustments for the periods presented relate primarily to depreciation and amortization related to the fair value step up of fixed assets and intangible assets (primarily customer related) acquired in the merger and the allocation of fair value step-up for ongoing Linde AG asset disposals (reflected in Other Income/(Expense)). \nAdjusted Interest Expense - Net\n: Relates to the amortization of the fair value of debt acquired in the merger. \nAdjusted Income Taxes and Effective Tax Rate:\n  Relates to the current and deferred income tax impact on the adjustments discussed above.  The income tax expense (benefit) on the non-GAAP pre-tax adjustments was determined using the applicable tax rates for the jurisdictions that were utilized in calculating the GAAP income tax expense (benefit) and included both current and deferred income tax amounts.\nAdjusted Income from Equity Investments:\n  Represents the amortization of increased fair value on equity investments related to depreciable and amortizable assets.  \nAdjusted Noncontrolling Interests:\n Represents the noncontrolling interests’ ownership portion of the adjustments described above determined on an entity by entity basis.\n39\nTable of Contents\n    \nSupplemental Guarantee Information\nOn May 3, 2023, the company filed a Form S-3 Registration Statement with the SEC (\"the Registration Statement\").\nLinde plc may offer debt securities, preferred shares, depositary shares and ordinary shares under the Registration Statement, and debt securities exchangeable for or convertible into preferred shares, ordinary shares or other debt securities. Debt securities of Linde plc may be guaranteed by Linde Inc. and/or Linde GmbH. Linde plc may provide guarantees of debt securities offered by its wholly owned subsidiaries Linde Inc. or Linde Finance under the Registration Statement.\nLinde Inc. is a wholly owned subsidiary of Linde plc. Linde Inc. may offer debt securities under the Registration Statement. Debt securities of Linde Inc. will be guaranteed by Linde plc, and such guarantees by Linde plc may be guaranteed by Linde GmbH. Linde Inc. may also provide (i) guarantees of debt securities offered by Linde plc under the Registration Statement and (ii) upstream guarantees of downstream guarantees provided by Linde plc of debt securities of Linde Finance offered under the Registration Statement.\nLinde Finance B.V. is a wholly owned subsidiary of Linde plc. Linde Finance may offer debt securities under the Registration Statement. Linde plc will guarantee debt securities of Linde Finance offered under the Registration Statement. Linde GmbH and Linde Inc. may guarantee Linde plc’s obligations under its downstream guarantee.\nLinde GmbH is a wholly owned subsidiary of Linde plc. Linde GmbH may provide (i) guarantees of debt securities offered by Linde plc under the Registration Statement and (ii) upstream guarantees of downstream guarantees provided by Linde plc of debt securities of Linde Inc. or Linde Finance offered under the Registration Statement.\nIn September 2019, Linde plc provided downstream guarantees of all pre-existing Linde Inc. and Linde Finance notes, and Linde GmbH and Linde Inc., respectively, provided upstream guarantees of Linde plc’s downstream guarantees.\nLinde plc established a European debt issuance program on May 11, 2020, as subsequently updated with a base prospectus filed with the Luxembourg Stock Exchange on May 8, 2025, for a €20.0 billion debt issuance program (or the equivalent in other currencies), under which Linde plc may offer debt securities. Linde Inc. and Linde GmbH have provided to Linde plc upstream guarantees in relation to debt securities of Linde plc offered under the European debt issuance program, as confirmed to the current program amount. Under the European debt issuance program, Linde plc may issue unsecured notes with such terms, including currency, interest rate and maturity, as agreed by Linde plc and the purchasers of such notes at the time of sale and as set out in the final terms for the relevant issue of notes. The current European debt issuance program will be valid for a period of one year from May 8, 2025, after which it will require updating prior to any further issuance of notes. \nFor further information about the guarantees of the debt securities registered under the Registration Statement (including the ranking of such guarantees, limitations on enforceability of such guarantees and the circumstances under which such guarantees may be released), see “Description of Debt Securities – Guarantees” and “Description of Debt Securities – Ranking” in the Registration Statement, which subsections are incorporated herein by reference.\n40\nTable of Contents\n    \nThe following tables present summarized financial information for Linde plc, Linde Inc., Linde GmbH and Linde Finance on a combined basis, after eliminating intercompany transactions and balances between them and excluding investments in and equity in earnings from non-guarantor subsidiaries.\n(Millions of dollars)\nStatement of Income Data\nNine Months Ended September 30, 2025\nTwelve Months Ended December 31, 2024\nSales\n$\n6,509 \n$\n7,995 \nOperating profit\n1,256 \n1,526 \nNet income\n(41)\n3,553 \nTransactions with non-guarantor subsidiaries\n2,672 \n7,177 \nBalance Sheet Data (at period end)\nCurrent assets (a)\n$\n5,442 \n$\n7,827 \nLong-term assets (b)\n16,355 \n14,481 \nCurrent liabilities (c)\n12,190 \n10,309 \nLong-term liabilities (d)\n70,688 \n64,848 \n(a) From current assets above, amount due from non-guarantor subsidiaries\n$\n2,102 \n$\n4,425 \n(b) From long-term assets above, amount due from non-guarantor subsidiaries\n830 \n1,031 \n(c) From current liabilities above, amount due to non-guarantor subsidiaries\n2,342 \n1,841 \n(d) From long-term liabilities above, amount due to non-guarantor subsidiaries\n47,844 \n45,378"
}