{
  "source_file": "lkq-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nStatements and information in this Quarterly Report on Form 10-Q that are not historical are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and are made pursuant to the \"safe harbor\" provisions of such Act.\nForward-looking statements include, but are not limited to, statements regarding our outlook, guidance, expectations, beliefs, hopes, intentions and strategies. Words such as \"may,\" \"will,\" \"plan,\" \"should,\" \"expect,\" \"anticipate,\" \"believe,\" \"if,\" \"estimate,\" \"intend,\" \"project\" and similar words or expressions are used to identify these forward-looking statements. These statements are subject to a number of risks, uncertainties, assumptions and other factors that may cause our actual results, performance or achievements to be materially different. All forward-looking statements are based on information available to us at the time the statements are made. We undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\nYou should not place undue reliance on our forward-looking statements. Actual events or results may differ materially from those expressed or implied in the forward-looking statements. The risks, uncertainties, assumptions and other factors that could cause actual results to differ from the results predicted or implied by our forward-looking statements include factors discussed in our filings with the SEC, including those disclosed under the captions \"Risk Factors\" and \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" in our 2024 Form 10-K and our Quarterly Reports on Form 10-Q (including this Quarterly Report). \nOverview\nWe are a global distributor of vehicle products, including replacement parts, components and systems used in the repair and maintenance of vehicles, and specialty aftermarket products and accessories to improve the performance, functionality and appearance of vehicles.\nBuyers of vehicle replacement products have the option to purchase from primarily five sources: new products produced by OEMs; new products produced by companies other than the OEMs, which are referred to as aftermarket products; recycled products obtained from salvage and total loss vehicles; recycled products that have been refurbished; and recycled products that have been remanufactured. We distribute a variety of products to collision and mechanical repair shops, including aftermarket collision and mechanical products; recycled collision and mechanical products; refurbished collision products such as wheels, bumper covers and lights; and remanufactured engines and transmissions. Collectively, we refer to the four sources that are not new OEM products as alternative parts.\nWe are organized into three operating segments: Wholesale - North America; Europe; and Specialty, each of which is presented as a reportable segment. We have made certain reclassifications to the prior period financial information to reflect discontinued operations presentation as a result of the sale of our Self Service segment. See Note 2, \"Discontinued Operations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information.\nOur Wholesale - North America segment is a leading provider of alternative vehicle collision replacement products, paint and body repair related products, and alternative vehicle mechanical replacement products, with our sales, processing, and distribution facilities reaching most major markets in the United States and Canada. Our Europe segment is a leading provider of alternative vehicle replacement and maintenance products in Germany, the U.K., the Benelux region (Belgium, Netherlands, and Luxembourg), Italy, Czech Republic, Austria, Slovakia, France and various other European countries. Our Specialty segment is a leading distributor of specialty vehicle aftermarket equipment and accessories reaching most major markets in the U.S. and Canada. \nOur operating results have fluctuated on a quarterly and annual basis in the past and can be expected to continue to fluctuate in the future as a result of a number of factors, some of which are beyond our control. Please refer to the factors referred to in Forward-Looking Statements above. Due to these factors and others, which may be unknown to us at this time, our operating results in future periods can be expected to fluctuate\n.\n Accordingly, our historical results of operations may not be indicative of future performance.\n25\nAcquisitions and Investments\nSince our inception in 1998, we have pursued a growth strategy through both organic growth and acquisitions. Our current acquisition strategy focuses on highly accretive tuck-in acquisitions with significant synergies or critical capabilities and no large platform acquisitions are expected. Additionally, from time to time, we make investments in various businesses to advance our strategic objectives.\nSources of Revenue\nWe report our revenue in two categories: (i) parts and services and (ii) other. Our parts revenue is generated from the sale of vehicle products, including replacement parts, components and systems used in the repair and maintenance of vehicles, and specialty products and accessories used to improve the performance, functionality and appearance of vehicles. Our service revenue is generated primarily from the sale of service-type warranties and diagnostic and repair services. Revenue from other sources includes sales of scrap and other metals (including precious metals - platinum, palladium and rhodium - contained in recycled parts such as catalytic converters), bulk sales to mechanical manufacturers (including cores) and sales of aluminum ingots and sows from our furnace operations. Other revenue will vary from period to period based on fluctuations in commodity prices and the volume of materials sold. See Note 5, \"Revenue Recognition\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information related to our sources of revenue.\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based upon our Unaudited Condensed Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires management to make use of certain estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. Our 2024 Form 10-K includes a summary of the critical accounting estimates we believe are the most important to aid in understanding our financial results. There have been no changes to those critical accounting estimates that have had a material impact on our reported amounts of assets, liabilities, revenues or expenses during the nine months ended September 30, 2025.\nRecently Issued Accounting Pronouncements\nSee \"Recent Accounting Pronouncements\" in Note 1, \"Interim Financial Statements\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for information related to new accounting standards.\nFinancial Information by Geographic Area\nSee Note 5, \"Revenue Recognition\" and Note 15, \"Segment and Geographic Information\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for information related to our revenue and long-lived assets by geographic region.\nKey Performance Indicators\nWe believe that organic revenue growth, Segment EBITDA and free cash flow are key performance indicators for our business. Segment EBITDA is our key measure of segment profit or loss reviewed by our CODM. Free cash flow is a financial measure that is not prepared in accordance with U.S. generally accepted accounting principles (“non-GAAP”).\n•\nOrganic revenue growth \n- We define organic revenue growth as total revenue growth from continuing operations excluding the effects of acquisitions and divestitures (i.e., revenue generated from the date of acquisition to the first anniversary of that acquisition, net of reduced revenue due to the disposal of businesses) and foreign currency movements (i.e., impact of translating revenue at different exchange rates). Organic revenue growth includes incremental sales from both existing and new (i.e., opened within the last twelve months) locations and is derived from expanding business with existing customers, securing new customers and offering additional products and services. We believe that organic revenue growth is a key performance indicator as this statistic measures our ability to serve and grow our customer base successfully.\n26\n•\nSegment EBITDA\n - See Note 15, \"Segment and Geographic Information\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for a description of the calculation of Segment EBITDA. We believe that Segment EBITDA provides useful information to evaluate our segment profitability by focusing on the indicators of ongoing operational results.\n•\nFree Cash Flow\n - We calculate free cash flow as net cash provided by operating activities, less purchases of property, plant and equipment. Free cash flow provides insight into our liquidity and provides useful information to management and investors concerning cash flow available to meet future debt service obligations and working capital requirements, make strategic acquisitions, repurchase stock, and pay dividends.\nThese three key performance indicators are used as targets in determining incentive compensation at various levels of the organization, including senior management. By using these performance measures, we attempt to motivate a balanced approach to the business that rewards growth, profitability and cash flow generation in a manner that enhances our long-term prospects.\nResults of Operations—Consolidated\nThe following table sets forth statements of income data as a percentage of total revenue for the periods indicated:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nRevenue\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCost of goods sold\n61.7 \n%\n61.3 \n%\n61.2 \n%\n61.2 \n%\nGross margin\n38.3 \n%\n38.7 \n%\n38.8 \n%\n38.8 \n%\nSelling, general and administrative expenses\n27.4 \n%\n27.0 \n%\n27.7 \n%\n27.1 \n%\nRestructuring and transaction related expenses\n0.4 \n%\n0.6 \n%\n0.3 \n%\n0.9 \n%\nDepreciation and amortization\n2.7 \n%\n2.5 \n%\n2.6 \n%\n2.4 \n%\nOperating income\n7.8 \n%\n8.7 \n%\n8.1 \n%\n8.4 \n%\nTotal other expense, net\n1.5 \n%\n1.6 \n%\n1.4 \n%\n1.5 \n%\nIncome from continuing operations before provision for income taxes\n6.4 \n%\n7.1 \n%\n6.7 \n%\n6.8 \n%\nProvision for income taxes\n1.3 \n%\n1.8 \n%\n1.7 \n%\n2.0 \n%\nEquity in earnings of unconsolidated subsidiaries\n— \n%\n(0.1)\n%\n— \n%\n— \n%\nIncome from continuing operations\n5.1 \n%\n5.4 \n%\n5.0 \n%\n4.9 \n%\nNet income from discontinued operations\n— \n%\n0.1 \n%\n0.2 \n%\n0.2 \n%\nNet income\n5.1 \n%\n5.5 \n%\n5.2 \n%\n5.1 \n%\nLess: net income attributable to continuing noncontrolling interest\n— \n%\n— \n%\n— \n%\n— \n%\nNet income attributable to LKQ stockholders\n5.1 \n%\n5.5 \n%\n5.2 \n%\n5.0 \n%\nNote: In the table above, the sum of the individual percentages may not equal the total due to rounding.\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024 \nRevenue\nThe following table summarizes the changes in revenue by category (in millions):\nThree Months Ended September 30,\n2025\n2024\nChange\nParts & services revenue\n$\n3,414 \n$\n3,375 \n$\n39 \nOther revenue\n85 \n78 \n7 \nTotal revenue\n$\n3,499 \n$\n3,453 \n$\n46 \n27\nThe increase in parts and services revenue of $39 million, or 1.1%, represented increases in segment revenue of $39 million, or 9.3%, in Specialty and $6 million, or 0.4%, in Europe, partially offset by a decrease of $6 million, or 0.5%, in Wholesale - North America. This overall increase was driven by an $88 million, or 2.6%, increase due to fluctuations in foreign exchange rates, partially offset by an organic parts and services revenue decrease of $41 million, or 1.2%, and a $9 million, or 0.3%, decrease due to the net impact of acquisitions and divestitures.\n \nRefer to the discussion of our segment results of operations for factors contributing to the changes in revenue by segment for the three months ended September 30, 2025 compared to the three months ended September 30, 2024.\nCost of Goods Sold\nCost of goods sold increased by $43 million, or 2.0%, to $2,158 million for the three months ended September 30, 2025. Cost of goods sold primarily reflects increases of $33 million from Specialty and $11 million from Wholesale - North America. Cost of goods sold as a percentage of revenue increased to 61.7% for the three months ended September 30, 2025 from 61.3% for the three months ended September 30, 2024. Cost of goods sold as a percentage of revenue primarily reflects increases of 0.3% from Wholesale - North America and 0.2% from Specialty, partially offset by a decrease of 0.2% from Europe. Refer to the discussion of our segment results of operations for factors contributing to the changes in cost of goods sold by segment for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. \nSelling, General and Administrative Expenses\nOur Selling, general and administrative (\"SG&A\") expenses\n \nincreased by $27 million, or 3.0%, to $958 million for the three months ended September 30, 2025. The year over year increase in SG&A expense primarily reflects increases of $13 million from Europe and $12 million from Wholesale - North America.\n \nSG&A expenses as a percentage of revenue increased to 27.4% for the three months ended September 30, 2025 from 27.0% for the three months ended September 30, 2024. SG&A expenses as a percentage of revenue primarily reflects increases\n \nof 0.4% from Wholesale - North America and 0.3% from Europe, partially offset by a decrease of 0.2% from Specialty. Refer to the discussion of our segment results of operations for factors contributing to the changes in SG&A expenses by segment for the three months ended September 30, 2025 compared to the three months ended September 30, 2024.\nRestructuring and Transaction Related Expenses\nRestructuring and transaction related expenses decreased by $6 million, primarily due to an $8 million decrease in restructuring expenses related to our 2024 Global Restructuring plan, partially offset by a $4 million increase in transaction related expenses for legal, accounting and advisory services related to completed and potential transactions.\nProvision for Income Taxes\nOur effective income tax rate for the three months ended September 30, 2025 was 20.0%, compared to 25.0% for the three months ended September 30, 2024. The decrease in the effective tax rate for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 is primarily attributable to the discrete tax benefits, including a $10 million reduction to deferred tax liabilities related to tax rate changes enacted in Germany during the third quarter of 2025. \nForeign Currency Impact\nWe translate our statements of income at the average exchange rates in effect for the period. Relative to the rates used during the three months ended September 30, 2024, the Czech koruna, euro and pound sterling rates used to translate the three months ended September 30, 2025 statements of income increased by 9.4%, 6.4% and 3.7%, respectively, while the Canadian dollar rate decreased by 0.9%. Realized and unrealized currency gains and losses combined with the translation effect of the change in foreign currencies against the U.S. dollar had a net positive effect of $0.02 on diluted earnings per share from continuing operations relative to the prior year period.\n28\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nRevenue\nThe following table summarizes the changes in revenue by category (in millions):\nNine Months Ended September 30,\n2025\n2024\nChange\nParts & services revenue\n$\n10,085 \n$\n10,353 \n$\n(268)\nOther revenue\n254 \n244 \n10 \nTotal revenue\n$\n10,339 \n$\n10,597 \n$\n(258)\nThe decrease in parts and services revenue of $268 million, or 2.6%, represented decreases in segment revenue of $148 million, or\n \n3.0%, in Europe and $128 million, or 3.1%, in Wholesale - North America, partially offset by an increase of $8 million, or 0.6%, in Specialty. This overall decrease was driven by an organic parts and services revenue decrease of $308 million, or 3.0% (2.3% decrease on a per day basis) and a $74 million, or 0.7%, decrease due to the net impact of acquisitions and divestitures, partially offset by an increase of $114 million, or 1.1%, due to fluctuations in foreign exchange rates. Refer to the discussion of our segment results of operations for factors contributing to the changes in revenue by segment for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nCost of Goods Sold\nCost of goods sold decreased by $153 million, or 2.4%, to $6,329 million for the nine months ended September 30, 2025. Cost of goods sold primarily reflects decreases of $124 million from Europe and $44 million from Wholesale - North America, partially offset by an increase of $14 million\n \nfrom Specialty. Cost of goods sold as a percentage of revenue remained flat at 61.2% for the nine months ended September 30, 2025 and 2024. Cost of goods sold as a percentage of revenue primarily reflects a decrease of 0.3% from Europe, partially offset by an increase of 0.2% from Wholesale - North America. Refer to the discussion of our segment results of operations for factors contributing to the changes in cost of goods sold by segment for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. \nSelling, General and Administrative Expenses\nOur SG&A expenses decreased by $8 million, or 0.2%, to $2,865 million for the nine months ended September 30, 2025. The year over year decrease in SG&A expense primarily reflects decreases\n \nof $5 million from Wholesale - North America and $3 million from Europe.\n \nSG&A expenses as a percentage of revenue increased to 27.7% for the nine months ended September 30, 2025 from 27.1% for the nine months ended September 30, 2024. SG&A expenses as a percentage of revenue primarily reflects increases of 0.4% from Europe and 0.3% from Wholesale - North America. Refer to the discussion of our segment results of operations for factors contributing to the changes in SG&A expenses by segment for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nRestructuring and Transaction Related Expenses\nRestructuring and transaction related expenses decreased by $66 million, primarily due to a $48 million decrease in restructuring expenses related to our 2024 Global Restructuring plan and a $16 million decrease in restructuring expenses related to our Acquisition Integration plans.\nProvision for Income Taxes\nOur effective income tax rate for the nine months ended September 30, 2025 was 24.8%, compared to 29.0% for the nine months ended September 30, 2024. The decrease in the effective tax rate for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 is primarily attributable to the discrete tax benefits, including a $10 million reduction to deferred tax liabilities related to tax rate changes enacted in Germany during the third quarter of 2025 and the nonrecurring unfavorable tax effects of the Global Restructuring Plan impairments in the prior year. See Note 6, \"Restructuring and Transaction Related Expenses\" for further information on the impairments.\n29\nForeign Currency Impact\nWe translate our statements of income at the average exchange rates in effect for the period. Relative to the rates used during the nine months ended September 30, 2024, the Czech koruna, pound sterling, and euro rates used to translate the nine months ended September 30, 2025 statements of income increased by 3.9%, 3.0% and 2.9%, respectively, while the Canadian dollar rate decreased by 2.7%. Realized and unrealized currency gains and losses combined with the translation effect of the change in foreign currencies against the U.S. dollar had a net positive effect of $0.04 on diluted earnings per share from continuing operations relative to the prior year period.\nResults of Operations—Segment Reporting\nWe have three reportable segments: Wholesale - North America; Europe; and Specialty. \nThe following table presents our financial performance, including third party revenue, total revenue and Segment EBITDA, by reportable segment for the periods indicated (in millions):\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\nThird Party Revenue\nWholesale - North America\n$\n1,423 \n$\n1,423 \n$\n4,277 \n$\n4,396 \nEurope\n1,620 \n1,613 \n4,749 \n4,896 \nSpecialty\n456 \n417 \n1,313 \n1,305 \nTotal third party revenue\n$\n3,499 \n$\n3,453 \n$\n10,339 \n$\n10,597 \nTotal Revenue\nWholesale - North America\n$\n1,423 \n$\n1,423 \n$\n4,277 \n$\n4,397 \nEurope\n1,620 \n1,613 \n4,749 \n4,896 \nSpecialty\n457 \n419 \n1,316 \n1,308 \nEliminations\n(1)\n(2)\n(3)\n(4)\nTotal revenue\n$\n3,499 \n$\n3,453 \n$\n10,339 \n$\n10,597 \nSegment EBITDA\nWholesale - North America\n$\n199 \n14.0 \n%\n$\n224 \n15.8 \n%\n$\n640 \n15.0 \n%\n$\n714 \n16.2 \n%\nEurope\n162 \n10.0 \n%\n165 \n10.2 \n%\n454 \n9.6 \n%\n482 \n9.8 \n%\nSpecialty\n34 \n7.3 \n%\n31 \n7.3 \n%\n94 \n7.1 \n%\n99 \n7.6 \n%\nNote: In the table above, the percentages of total segment revenue may not recalculate due to rounding.\nThe key measure of segment profit or loss reviewed by our CODM, our Chief Executive Officer, is Segment EBITDA. The CODM uses Segment EBITDA to compare profitability among the segments and evaluate business strategies. Segment EBITDA includes revenue and expenses that are controllable by the segment. Corporate general and administrative expenses are allocated to the segments based on usage, with shared expenses apportioned based on the segment's percentage of consolidated revenue. We calculate Segment EBITDA as Net Income excluding net income and loss attributable to noncontrolling interest; income and loss from discontinued operations; depreciation; amortization; interest; gains and losses on debt extinguishment; income tax expense; restructuring and transaction related expenses; change in fair value of contingent consideration liabilities; other gains and losses related to acquisitions, equity method investments, or divestitures; equity in losses and earnings of unconsolidated subsidiaries; equity investment fair value adjustments; impairment charges; and direct impacts of the Ukraine/Russia conflict. See Note 15, \"Segment and Geographic Information\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for a reconciliation of total Segment EBITDA to net income.\n30\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024 \nWholesale - North America\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Wholesale - North America segment (in millions):\nThree Months Ended September 30,\nWholesale - North America\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n1,343 \n$\n1,349 \n$\n(6)\n(1)\nOther revenue\n80 \n74 \n6 \nTotal segment revenue\n1,423 \n1,423 \n— \nCost of goods sold\n825 \n814 \n11 \nGross margin\n598 \n42.1 \n%\n609 \n42.8 \n%\n(11)\n(2)\nSelling, general and administrative expenses\n(4)\n401 \n28.2 \n%\n389 \n27.4 \n%\n12 \n(3)\nLess: Other segment items\n(5)\n(2)\n(4)\n2 \nSegment EBITDA\n$\n199 \n14.0 \n%\n$\n224 \n15.8 \n%\n$\n(25)\n(1)\nParts and services revenue decreased by $6 million, or 0.5%, to $1,343 million for the three months ended September 30, 2025. This decrease was primarily due to an organic revenue decrease of $5 million, or 0.4%, driven primarily by lower volumes in our paint, body and equipment business from lower repairable claims and increased competition. This decrease is partially offset by pricing initiatives and targeted actions to increase market penetration as well as higher aftermarket parts volumes.\n(2)\nGross margin decreased by $11 million, or 1.7%, to $598 million for the three months ended September 30, 2025. This decrease was driven by the dilutive effect of increasing prices to recoup tariff costs and unfavorable customer mix.\n(3)\nSG&A expenses increased by $12 million, or 3.2%, to $401 million for the three months ended September 30, 2025. The increase in SG&A expense is primarily due to (i) $7 million from increased personnel costs due to lower incentive compensation in the prior year, (ii) $3 million from increased professional fees, (iii) $3 million from an increase in credit loss reserves, partially offset by (iv) other individually immaterial factors representing a $1 million favorable impact in the aggregate.\n(4)\nAmounts include certain overhead costs that were historically allocated to the Self Service segment. See Note 2, \"Discontinued Operations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information.\n(5)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 6, \"Restructuring and Transaction Related Expenses\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information on restructuring charges.\n31\nEurope\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Europe segment (in millions):\nThree Months Ended September 30,\nEurope\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n1,615 \n$\n1,609 \n$\n6 \n(1)\nOther revenue\n5 \n4 \n1 \nTotal segment revenue\n1,620 \n1,613 \n7 \nCost of goods sold\n991 \n993 \n(2)\nGross margin\n629 \n38.8 \n%\n620 \n38.4 \n%\n9 \n(2)\nSelling, general and administrative expenses\n474 \n29.3 \n%\n461 \n28.6 \n%\n13 \n(3)\nLess: Other segment items\n(4)\n(7)\n(6)\n(1)\nSegment EBITDA\n$\n162 \n10.0 \n%\n$\n165 \n10.2 \n%\n$\n(3)\n(1)\nParts and services revenue\n \nincreased\n \nby\n \n$6 million, or\n \n0.4%, to\n \n$1,615 million\n \nfor the three months ended September 30, 2025. This increase\n \nwas due to (i) the effect of an exchange rate increase of $91 million, or 5.6%, primarily due to the continued strengthening of the euro and pound sterling, and to a lesser extent, the Czech koruna against the U.S. dollar, partially offset by (ii) an organic revenue\n \ndecrease of\n \n$75 million, or 4.7%, primarily driven by decreased volumes due to difficult economic conditions, heightened competition in certain markets and a focus on profitable customer mix, and (iii) a net acquisition and divestiture decrease of $10 million, or 0.6%, primarily related to the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024.\n(2)\nGross margin increased\n \nby\n \n$9 million, or\n \n1.4%, to\n \n$629 million\n \nfor the three months ended September 30, 2025. This increase was driven by higher revenue as described above. The increase as a percentage of total segment revenue was primarily driven by the benefit from the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024.\n(3)\nSG&A expenses increased\n \nby $13 million, or 2.8%, to\n \n$474 million\n \nfor the three months ended September 30, 2025. The increase\n \nin SG&A expense is primarily due to (i) a $15 million unfavorable foreign exchange impact from a weakening U.S. dollar and (ii) other individually immaterial factors representing a $1 million unfavorable impact in the aggregate, partially offset by (iii) a $3 million favorable impact from the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024.\n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 6, \"Restructuring and Transaction Related Expenses\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information on restructuring charges.\n32\nSpecialty\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Specialty segment (in millions):\nThree Months Ended September 30,\nSpecialty\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n456 \n$\n417 \n$\n39 \n(1)\nIntersegment revenue\n1 \n2 \n(1)\nTotal segment revenue\n457 \n419 \n38 \nCost of goods sold\n343 \n310 \n33 \nGross margin\n114 \n24.8 \n%\n109 \n26.0 \n%\n5 \n(2)\nSelling, general and administrative expenses\n83 \n18.1 \n%\n81 \n19.2 \n%\n2 \nLess: Other segment items\n(3)\n(3)\n(3)\n— \nSegment EBITDA\n$\n34 \n7.3 \n%\n$\n31 \n7.3 \n%\n$\n3 \n(1)\nParts and services revenue increased by $39 million, or 9.3%, to $456 million for the three months ended September 30, 2025. This\n \nwas primarily due to an organic revenue increase of $39 million, or 9.4% driven by volume growth in our automotive and marine product lines.\n(2)\nGross margin increased by $5 million, or 4.3%, to $114 million for the three months ended September 30, 2025. This increase was primarily driven by increases in parts and services revenue partially offset by unfavorable sales mix with higher volumes on lower margin product lines.\n(3)\nAmounts primarily represent other non operating income and expenses, as well as a reconciling item to remove depreciation - cost of goods sold, which is excluded from the calculation of Segment EBITDA.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nWholesale - North America\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Wholesale - North America segment (in millions):\nNine Months Ended September 30,\nWholesale - North America\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n4,041 \n$\n4,169 \n$\n(128)\n(1)\nOther revenue\n236 \n227 \n9 \nIntersegment revenue\n— \n1 \n(1)\nTotal segment revenue\n4,277 \n4,397 \n(120)\nCost of goods sold\n2,433 \n2,477 \n(44)\nGross margin\n1,844 \n43.1 \n%\n1,920 \n43.7 \n%\n(76)\n(2)\nSelling, general and administrative expenses\n(4)\n1,217 \n28.5 \n%\n1,222 \n27.8 \n%\n(5)\n(3)\nLess: Other segment items\n(5)\n(13)\n(16)\n3 \nSegment EBITDA\n$\n640 \n15.0 \n%\n$\n714 \n16.2 \n%\n$\n(74)\n(1)\nParts and services revenue decreased by $128 million, or 3.1%, to $4,041 million for the nine months ended September 30, 2025. This decrease was primarily due to an organic revenue decrease of $117 million, or 2.8% (2.2% on a per day basis), driven primarily by lower volumes in our paint, body and equipment business from lower repairable claims and increased competition, and having one fewer selling days in the current year, partially offset by pricing initiatives and targeted actions to increase market penetration. Additionally, revenue decreased due to a negative exchange rate effect of $19 million, or 0.5%, primarily due to the stronger U.S. dollar against the Canadian dollar.\n33\n(2)\nGross margin decreased by $76 million, or 3.9%, to $1,844 million for the nine months ended September 30, 2025. This decrease was driven by lower revenue as described above as well as unfavorable customer mix and higher input costs not fully offset by price increases due to market competition.\n(3)\nSG&A expenses decreased by $5 million, or 0.3%, to $1,217 million for the nine months ended September 30, 2025. The decrease in SG&A expense is primarily due to (i) $17 million from decreased personnel costs due to cost savings initiatives which were partially offset by inflationary pressures, and (ii) other individually immaterial factors representing a $6 million favorable impact in the aggregate, partially offset by (iii) $11 million from increased vehicle costs, and (iv) $7 million from increased facility costs due to increased rent.\n(4)\nAmounts include certain overhead costs that were historically allocated to the Self Service segment. See Note 2, \"Discontinued Operations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information.\n(5)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 6, \"Restructuring and Transaction Related Expenses\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information on restructuring charges.\nEurope\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Europe segment (in millions):\nNine Months Ended September 30,\nEurope\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n4,731 \n$\n4,879 \n$\n(148)\n(1)\nOther revenue\n18 \n17 \n1 \nTotal segment revenue\n4,749 \n4,896 \n(147)\nCost of goods sold\n2,910 \n3,034 \n(124)\nGross margin\n1,839 \n38.7 \n%\n1,862 \n38.0 \n%\n(23)\n(2)\nSelling, general and administrative expenses\n1,407 \n29.6 \n%\n1,410 \n28.8 \n%\n(3)\n(3)\nLess: Other segment items\n(4)\n(22)\n(30)\n8 \nSegment EBITDA\n$\n454 \n9.6 \n%\n$\n482 \n9.8 \n%\n$\n(28)\n(1)\nParts and services revenue\n \ndecreased by\n \n$148 million, or\n \n3.0%, to\n \n$4,731 million\n \nfor the nine months ended September 30, 2025. This decrease\n \nwas primarily due to (i) an organic revenue decrease\n \nof\n \n$201 million, or\n \n4.1% (3.4% on a per day basis), primarily driven by decreased volumes due to difficult economic conditions and heightened competition in certain markets, (ii) a net acquisition and divestiture decrease of $82 million, or 1.7%, primarily related to the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024, partially offset by (iii) the effect of an exchange rate increase of $136 million, or 2.8%, primarily due to the strengthening of the pound sterling and euro, and to a lesser extent, the Czech koruna against the U.S. dollar.\n(2)\nGross margin decreased by $23 million, or 1.2%, to $1,839 million\n \nfor the nine months ended September 30, 2025. The decrease\n \nwas primarily attributable to\n \ndecreased\n \nrevenue, partially offset by a $12 million reduction in cost of goods sold related to restructuring expenses incurred as part of the 2024 Global Restructuring Plan in the prior year period. These restructuring expenses are excluded from the calculation of Segment EBITDA. See Note 6, \"Restructuring and Transaction Related Expenses\" and Note 15, \"Segment and Geographic Information\" for further information. The increase in gross margin as a percentage of total segment revenue was primarily driven by (i) a benefit from net procurement savings, (ii) the benefit from the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024 and (iii) lower restructuring expense in the current year as described above. \n(3)\nSG&A expenses decreased by $3 million, or 0.2%, to $1,407 million for the nine months ended September 30, 2025. The\n \ndecrease in SG&A expense is primarily due to favorable impacts of (i) $23 million from the divestiture of certain operations in Poland, Slovenia and Bosnia in 2024, (ii) $9 million of lower freight, vehicle and fuel cost and (iii) other individually immaterial factors representing an $11 million\n \nfavorable impact in the aggregate, partially offset by (iv) a $29 million unfavorable foreign exchange impact from a weakening U.S. dollar and (v) an $11 million unfavorable impact in professional fees related to several strategic central and regional information technology initiatives.\n34\n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 6, \"Restructuring and Transaction Related Expenses\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information on restructuring charges.\nSpecialty\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Specialty segment (in millions):\nNine Months Ended September 30,\nSpecialty\n2025\n% of Total Segment Revenue\n2024\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n1,313 \n$\n1,305 \n$\n8 \n(1)\nIntersegment revenue\n3 \n3 \n— \nTotal segment revenue\n1,316 \n1,308 \n8 \nCost of goods sold\n989 \n975 \n14 \nGross margin\n327 \n24.8 \n%\n333 \n25.5 \n%\n(6)\n(2)\nSelling, general and administrative expenses\n241 \n18.3 \n%\n241 \n18.4 \n%\n— \nLess: Other segment items\n(3)\n(8)\n(7)\n(1)\nSegment EBITDA\n$\n94 \n7.1 \n%\n$\n99 \n7.6 \n%\n$\n(5)\n(1)\nParts and services revenue increased by $8 million, or 0.6%, to $1,313 million for the nine months ended September 30, 2025. This was primarily due to an organic revenue increase of $11 million, or 0.8% (1.4% on a per day basis), driven by continued volume growth in our marine and automotive product lines. \n(2)\nGross margin decreased by $6 million, or 1.8%, to $327 million for the nine months ended September 30, 2025. This decrease was primarily driven by unfavorable sales mix with higher volumes on lower margin product lines partially offset by increases in parts and services revenue.\n(3)\nAmounts primarily represent other non operating income and expenses, as well as a reconciling item to remove depreciation - cost of goods sold, which is excluded from the calculation of Segment EBITDA.\nLiquidity and Capital Resources\nWe assess our liquidity and capital resources in terms of our ability to fund our operations and provide for expansion through both internal development and acquisitions. Our primary sources of liquidity are cash flows from operations and our revolving credit facilities. We utilize our cash flows from operations to fund working capital and capital expenditures, with the excess amounts going towards paying dividends, repurchasing our common stock, paying down outstanding debt, or funding acquisitions. As we have pursued acquisitions as part of our historical growth strategy, our cash flows from operations have not always been sufficient to cover our investing activities. To fund our acq\nuisitions, we have accessed various forms of debt financing, including revolving credit facilities, term loans, and senior notes. We currently believe we have sufficient access to capital markets to support our future growth objectives.\nThe following table summarizes liquidity data as of the dates indicated (in millions):\nSeptember 30, 2025\nDecember 31, 2024\nCapacity under revolving credit facilities\n$\n2,000 \n$\n2,000 \nLess: Revolving credit facilities borrowings\n498 \n664 \nLess: Letters of credit\n114 \n114 \nAvailability under credit revolving facilities\n1,388 \n1,222 \nAdd: Cash and cash equivalents\n289 \n234 \nTotal liquidity\n$\n1,677 \n$\n1,456 \n35\nWe had \n$1,388 million\n available under\n our revolving credit facilities as of \nSeptember 30, 2025\n. Combined with $289 million of cash and cash equivalents at September 30, 2025, we had $1,677 million i\nn available liquidity, an increase of $221 million from our\n available liquidity as of December 31, 2024, primarily as a result of decreasing our revolving credit facilities borrowings by \n$166 million.\nOn May 2, 2025, we entered into Amendment No. 2 to the Senior Unsecured Credit Agreement which extended the maturity date of the unsecured term loan facility from January 5, 2026 to January 5, 2027 as well as certain other immaterial modifications. See Note 10, \"Long-Term Obligations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q\n for information regarding total debt outstanding. \nWe believe that our current liquidity, cash expected to be generated by operating activities in future periods and access to capital markets will be sufficient to meet our current operating and capital requirements. Our capital allocation strategy includes spending to support growth driven capital projects, return stockholder value through the payment of dividends and repurchasing shares of our common stock, completing highly synergistic tuck-in acquisitions and debt repayment. \nA summary of the dividend activity for our common stock for the \nnine months ended\n September 30, 2025 is as follows:\nDividend Amount\nDeclaration Date\nRecord Date\nPayment Date\n$0.30\nFebruary 18, 2025\nMarch 13, 2025\nMarch 27, 2025\n$0.30\nApril 22, 2025\nMay 15, 2025\nMay 29, 2025\n$0.30\nJuly 22, 2025\nAugust 14, 2025\nAugust 28, 2025\nOn October 28, 2025, our Board of Directors declared a quarterly cash dividend of $0.30 per share of common stock, payable on December 4, 2025, to stockholders of record at the close of business on November 20, 2025.\nWe believe that our future cash flow generation will permit us to continue paying dividends in future periods; however, the timing, amount and frequency of such future dividends will be subject to approval by our Board of Directors, and based on considerations of capital availability, and various other factors, many of which are outside of our control.\nWith $1,677 million of total liquidity as of September 30, 2025 and $537 million of current maturities, we have access to funds to meet our near term commitments.\n \nOur current maturities include the \n$503 million\n term loan payable under our Senior Unsecured Term Loan Agreement due July 2026, which we intend to extend or refinance on or before the scheduled maturity. \nWe have a surplus of current assets over current liabilities, which further reduces the risk of short-term cash shortfalls.\nO\nur Senior Unsecured Credit Agreement and our CAD Note both include two financial maintenance covenants: a maximum total leverage ratio and minimum interest coverage ratio. The terms maximum total leverage ratio and minimum interest coverage ratio are specifically calculated per both the Senior Unsecured Credit Agreement and CAD Note, and differ in specified ways from comparable GAAP or common usage terms. We were in compliance with all applicable covenants under both our Senior Unsecured Credit Agreement and CAD Note as of September 30, 2025. The required debt covenants per both the Senior Unsecured Credit Agreement and CAD Note and our actual ratios with respect to those covenants are as follows as of September 30, 2025:\nCovenant Level\nRatio Achieved as of September 30, 2025\nMaximum total leverage ratio\n4.00 : 1.00\n2.5\nMinimum interest coverage ratio\n3.00 : 1.00\n7.3\nThe indentures relating to our U.S. Notes and Euro Notes d\no not include financial maintenance covenants, and the indentures will not restrict our ability to draw funds under the Senior Unsecured Credit Agreement. The indentures do not prohibit amendments to the financial covenants under the Senior Unsecured Credit Agreement and CAD Note as needed.\nWhile we believe that we have adequate capacity under our existing revolving credit facilities to finance our current operations, from time to time we may need to raise additional funds through public or private financing, strategic relationships or modification of our existing Senior Unsecured Credit Agreement to finance additional investments or to refinance existing debt obligations. There can be no assurance that additional funding, or refinancing of our Senior Unsecured Credit Agreement, if needed, will be available on terms attractive to us, or at all. Furthermore, any additional equity financing may be dilutive to \n36\nstockholders, and debt financing, if available, may involve restrictive covenants or higher interest costs. Our failure to raise capital if and when needed could have a material adverse impact on our business, operating results, and financial condition.\nWe hold interest rate swaps to hedge the variable rates on a portion of our credit agreement borrowings. After giving effect to these contracts outstanding, the \nweighted average interest rate on borrowings outstanding under our Senior Unsecured Credit Agreement was 6.1% at September 30, 2025. Including our senior notes and CAD Note, our overall weighted average interest rate on borrowings was \n5.3%\n at September 30, 2025.\n Excluding the higher rate borrowings on the revolving credit facility that were repaid on October 1, 2025 with pretax net proceeds from the sale of our Self Service segment, these rates were 5.6% and 5.1%, respectively. \nRefer to \nNote 2, \"Discontinued Operations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information. Under the Senior Unsecured Credit Agreement, our borrowings bear interest at SOFR plus the applicable spread or other risk-free interest rates that are applicable for the specified currency plus a spread. Under the CAD Note, the interest rate may be (i) a forward-looking term rate based on the Canadian Overnight Repo Rate Average for an interest period chosen by the Company of one or three months or (ii) the Canadian Prime Rate (as defined in the CAD Note), plus in each case a spread. See Note 10, \"Long-Term Obligations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for information related to our borrowings and related interest. The interest rate swaps are described in Note 11, \"Derivative Instruments and Hedging Activities\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n \nWe had outstanding borrowin\ngs under our revolving credit facilities and term loans payable of $1,501 million \nand \n$1,651 million \nat September 30, 2025 and December 31, 2024, respectively. Of these amounts,\n \nt\nhere wer\ne current maturities of \n$503 million\n \nat \nSeptember 30, 2025 related to the term loan payable under our Senior Unsecured Term Loan Agreement due July 2026. There were no current maturities at December 31, 2024. On October 1, 2025, we repaid approximately $\n390 million of revolving credit facility borrowings with the pretax net proceeds received from the Self Service sale. Refer to \nNote 2, \"Discontinued Operations\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for additional information.\nThe scheduled maturities of long-term obligations outstanding at September 30, 2025 are as follows (in millions): \nAmount\nThree months ending December 31, 2025\n \n$\n11 \nYears ending December 31:\n2026 \n(1)\n532 \n2027\n521 \n2028\n1,606 \n2029\n10 \nThereafter\n1,501 \nTotal debt \n(2)\n$\n4,181 \n(1)\nIncludes \n$503 million\n related to our Senior Unsecured Term Loan Agreement due July 2026, which we intend to extend or refinance on or before the scheduled maturity.\n(2)\nThe total debt amounts presented above reflect the gross values to be repaid (excluding debt issuance costs and unamortized bond discounts of $29 million as of September 30, 2025).\nAs of September 30, 2025, the Company had cash and cash equivalents of $289 million, of which $263 million was held by foreign subsidiaries. In general, it is our practice and intention to permanently reinvest the undistributed earnings of our foreign subsidiaries. We believe that we have sufficient cash flow and liquidity to meet our financial obligations in the U.S. without repatriating our foreign earnings. We may, from time to time, choose to selectively repatriate foreign earnings if doing so supports our financing or liquidity objectives. Distributions of dividends from our foreign subsidiaries, if any, would be generally exempt from further U.S. taxation, either as a result of the 100% participation exemption under the Tax Cuts and Jobs Act enacted in 2017, or due to the previous taxation of foreign earnings under the transition tax and the Global Intangible Low-Taxed Income regime.\nThe procurement of inventory is the largest operating use of our funds. We normally pay for aftermarket product purchases on standard payment terms or at the time of shipment, depending on the manufacturer and the negotiated payment terms. We normally pay for salvage vehicles acquired at salvage auctions and under direct procurement arrangements at the time that we take possession of the vehicles.\n37\nAs part of our effort to improve our operating cash flows, we may negotiate payment term extensions with suppliers. These efforts are supported by our supply chain finance programs. See Note 9, \"Supply Chain Financing\" to the Unaudited Condensed Consolidated Financial Statements in Part I, Item 1 of this Quarterly Report on Form 10-Q for information related to our supply chain financing arrangements.\nFor the nine months ended September 30, 2025, net cash provided by operating activities totaled $733 million compared to $886 million for the same period of 2024. Cash flows related to our primary working capital accounts can be volatile as the purchases, payments and collections can be timed differently from period to period. Receivables represented $39 million in higher cash outflows for the nine months ended September 30, 2025 compared to the same period of 2024. Inventories represented $102 million in incremental cash inflows for the nine months ended September 30, 2025 compared to the same period of 2024. Accounts payable produced $219 million in incremental cash outflows for the nine months ended September 30, 2025 compared to the same period of 2024. Other operating activities primarily reflects lower cash paid for taxes of $73 million during the nine months ended September 30, 2025 compared to the same period of 2024.\nFor the nine months ended September 30, 2025, net cash used in investing activities totaled $144 million compared to $300 million for the same period of 2024. We invested $46 million of cash in business acquisitions during the nine months ended September 30, 2024. There were no significant business acquisitions during the nine months ended September 30, 2025. Property, plant and equipment purchases were\n \n$160 million in the nine months ended September 30, 2025 compared to $225 million in the prior year period.\nThe following table reconciles Net Cash Provided by Operating Activities to Free Cash Flow (in millions):\n \nNine Months Ended September 30,\n \n2025\n2024\nNet cash provided by operating activities\n$\n733 \n$\n886 \nLess: purchases of property, plant and equipment\n160 \n225 \nFree cash flow \n(1)\n$\n573 \n$\n661 \n(1)\nFor the nine months ended September 30, 2025 and 2024, Self Service contributed approximately $50 million and $40 million, respectively, of free cash flow.\nFor the nine months ended September 30, 2025, net cash used in financing activities totaled $562 million compared to $516 million for the same period in 2024. Cash outflows for share repurchases were $119 million and dividends paid were $234 million for the nine months ended September 30, 2025 compared to $280 million for share repurchases and $240 million for dividends paid for the same period of 2024. Net debt payments were $203 million for the nine months ended September 30, 2025 compared to net debt borrowings (net of amortized bond discounts) of $45 million for the same period of 2024. \nWe intend to continue to evaluate markets for potential growth through the internal development of distribution centers, processing and sales facilities, and warehouses, through further integration of our facilities, and through selected business acquisitions. Our future liquidity and capital requirements will depend upon numerous factors, including the costs and timing of our internal development efforts and the success of those efforts.\nSummarized Guarantor Financial Information\nOur U.S. Notes (2028/2033) and Euro Notes (2031) are guaranteed on a senior, unsecured basis by certain of our subsidiaries (each, a \"subsidiary guarantor\" and, together with LKQ, the \"Obligor Group\"), which are listed in Exhibit 22.1 in Part II, Item 6 of this Quarterly Report on Form 10-Q. The guarantees are full and unconditional, joint and several, and subject to certain conditions for release. See Note 18, \"Long-Term Obligations\" in Item 8 of Part II of our 2024 Form 10-K for information related to the Euro Notes (2031) and U.S. Notes (2028/2033).\nHolders of the notes have a direct claim only against the Obligor Group. The following summarized financial information is presented for the Obligor Group on a combined basis after elimination of intercompany transactions and balances within the Obligor Group and equity in the earnings from and investments in any non-guarantor subsidiary.\n38\nSummarized Statements of Income (in millions)\nNine Months Ended \nSeptember 30, 2025\nFiscal Year Ended\nDecember 31, 2024 \n(2)\nRevenue\n$\n4,832 \n$\n6,436 \nCost of goods sold\n2,950 \n3,888 \nGross margin \n(1)\n1,882 \n2,548 \nIncome from continuing operations\n267 \n404 \nNet income\n$\n267 \n$\n404 \n(1)\nGuarantor subsidiaries recorded $41 million and $53 million of net sales to and $158 million and $205 million of purchases from non-guarantor subsidiaries for the nine months ended September 30, 2025 and fiscal year ended December 31, 2024, respectively.\n(2)\nInformation reflects the current Obligor Group listed in Exhibit 22.1 in Part II, Item 6 of this Quarterly Report on Form 10-Q.\nSummarized Balance Sheets (in millions)\nSeptember 30, 2025\nDecember 31, 2024 \n(3)\nCurrent assets \n(1)\n$\n3,233 \n$\n2,273 \nNoncurrent assets\n4,440 \n5,207 \nCurrent liabilities \n(2)\n1,934 \n1,171 \nNoncurrent liabilities\n3,296 \n4,046 \n(1)\nCurrent assets for guarantor subsidiaries included $503 million of short-term notes receivable from non-guarantor subsidiaries as of September 30, 2025.\n(2)\nCurrent liabilities for guarantor subsidiaries included $414 million and $219 million of short-term notes payable to non-guarantor subsidiaries as of September 30, 2025 and December 31, 2024, respectively.\n(3)\nInformation reflects the current Obligor Group listed in Exhibit 22.1 in Part II, Item 6 of this Quarterly Report on Form 10-Q."
}