{
  "source_file": "lkq-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOVERVIEW\nLKQ Corporation (\"LKQ,\" the \"Company\" or \"we\"), a member of the Standard & Poor's 500 Stock In\ndex (\"S&P 500 Index\")\n, is a global distributor of vehicle products, including replacement parts, components and systems used in the repair and maintenance of vehicles, and specialty aftermarket products and accessories to improve the performance, functionality and appearance of vehicles.\nBuyers of vehicle replacement products have the option to purchase from primarily five sources: new products produced by original equipment manufacturers (\"OEMs\"); new products produced by companies other than the OEMs, which are referred to as aftermarket products; recycled products obtained from salvage and total loss vehicles; recycled products that have been refurbished; and recycled products that have been remanufactured. We distribute a variety of products to collision and mechanical repair shops, including aftermarket collision and mechanical products; recycled collision and mechanical products; refurbished collision products such as wheels, bumper covers and lights; and remanufactured engines and transmissions. Collectively, we refer to the four sources that are not new OEM products as alternative parts. \nOur Wholesale - North America segment is a leading provider of alternative vehicle collision replacement products, paint and related body repair products, and alternative vehicle mechanical replacement products, with our sales, processing, and distribution facilities reaching most major markets in the United States and Canada. Our Europe segment is a leading provider of alternative vehicle replacement and maintenance products in Germany, the United Kingdom (\"U.K.\"), the Benelux region (Belgium, Netherlands, and Luxembourg), Italy, Czech Republic, Austria, Slovakia, France and various other European countries. Our Specialty segment is a leading distributor of specialty vehicle aftermarket equipment and accessories reaching most major markets in the U.S. and Canada. Our Self Service segment operates self service retail facilities across the U.S. that sell recycled automotive products from end-of-life-vehicles.\n3\nIn 2023, we acquired Uni-Select Inc. (\"Uni-Select\"), a leading distributor of automotive refinish and industrial coatings and related products in North America through its FinishMaster business and a leading distributor of automotive maintenance parts and accessories serving the Canadian market through its Canadian Automotive Group business. This acquisition complemented our existing North American paint distribution operations and provided a scaled position in the Canadian replacement and maintenance parts market, with opportunity for future consolidation and growth.\nWe are organized into four operating segments: Wholesale - North America; Europe; Specialty; and Self Service, each of which is presented as a reportable segment. See Note 25, \"Segment and Geographic Information\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for financial information by reportable segment and by geographic region.\nSTRATEGY\nOur mission is to be the leading global value-added and sustainable distributor of vehicle parts and accessories by offering our customers the most comprehensive, available and cost-effective selection of parts and service solutions while building strong partnerships with our employees and the communities in which we operate. To achieve this mission, our strategy focuses on executing three key initiatives:\nCapitalizing on profitable growth opportunities\nWe are dedicated to building competitive advantages and maintaining our leadership positions in the markets in which we operate. We focus on driving profitable growth and increasing free cash flow while maintaining a strong balance sheet. We foster an entrepreneurial and employee-centric culture that enables agility and innovation, empowering our businesses to succeed in the markets they serve. To continuously enhance the quality of our portfolio, our growth strategy is driven by organic investments in automation, productivity improvements, talent development, and strategic acquisitions. \nExpanding our lean operating model\nWe are committed to generating sustainable returns on invested capital by driving operational excellence and lean management across our businesses. We continuously evaluate and pursue opportunities to improve efficiency, margins and returns on invested capital. Through targeted productivity initiatives and a disciplined approach to cost management, we drive performance across key metrics, such as free cash flow generation, organic growth and profit margins. Our current initiatives include optimizing working capital through expansion of our vendor financing program, enhancing margins through our inventory optimization efforts and reducing selling, general and administrative costs through streamlining our footprint and reducing complexity across our business.  \nDisciplined capital allocation and portfolio simplification\nWe are focused on maximizing return on investment though efficient allocation of capital. We seek to deploy capital for acquisitions in attractive growth areas. We apply strict criteria, targeting accretive tuck-in acquisition opportunities with high synergies that align with the core businesses in our strategic framework. We proactively divest businesses that no longer align with our strategic vision, financial objectives or have limited long-term value potential, as demonstrated by our divestment of certain of our operations in Poland in 2024. Finally, we maintain a prudent and disciplined financial policy that prioritizes returning cash to shareholders through dividends and share repurchases, while maintaining our investment grade credit rating.\nWHOLESALE - NORTH AMERICA SEGMENT\nOur Wholesale - North America segment, which consists of aftermarket and salvage operations, sells five product types (aftermarket, OEM recycled, OEM remanufactured, OEM refurbished and, to a lesser extent, new OEM parts) to professional collision and mechanical vehicle repair businesses, which represents the source of the majority of the revenue generated by the segment. \nAs the profile and complexity of vehicles being repaired evolves, we have expanded and continue to expand our offerings to customers. In recent years, we have begun to offer on-site mobile and remote diagnostics services through our \nbrand known as Elitek Vehicle Services. Additiona\nlly, we began offering proprietary hybrid battery reconditioning and installation services which create a more reliable hybrid battery while also extending the battery's useful life. We expect these areas, as well as our overall product and service offerings, to grow in the coming years as the number of technological comp\nonents in vehicles increases. \n4\nIn August 2023, we acquired Uni-Select, including Canadian Automotive Group, a leading distributor of automotive parts and accessories serving the Canadian market, which provided entry to the Canadian mechanical parts space; and FinishMaster, a leading distributor of paint and related products and supplies, which expanded our existing North American paint business, collectively now branded as LKQ Refinish.\nInventory\nOur aftermarket products encompass items commonly prone to damage in a collision, including bumper covers, automotive body panels, and lights, as well as paint and paint related consumables for refinishing vehicles. Additionally, through the acquisition of Canadian Automotive Group, we have broadened our product offerings to include a range of mechanical automotive parts and accessories. Platinum Plus is our exclusive product line offered under the Keystone brand of aftermarket products. We also offer a product line called \"Value Line\" for more value conscious, often self-pay, consumers. We receive certifications on certain of our products from Certified Automotive Parts Association, an independent organization that evaluates the quality of our parts compared to OEM collision replacement products. Our salvage products include both mechanical and collision parts, including engines; transmissions; door assemblies; sheet metal products such as trunk lids, fenders and hoods; lights; and bumper assemblies. \nThe aftermarket products we distribute are purchased from independent manufacturers and distributors located primarily in North America and Asia, principally Taiwan. In 2024, approximately 49% of our aftermarket purchases were made from our top six vendors, with our largest vendor providing approximately 19% of our annual inventory purchases for the Wholesale - North America segment. This is primarily related to our acquisition of FinishMaster, where we obtained a strategic relationship with a supplier for paint and related products. This partnership will continue to play a key role in the expansion of our offerings for paint and related products. We believe we are one of the largest customers of each of these suppliers. Outside of this group, no other supplier provided more than 4% of our supply of aftermarket products in 2024. We purchased approximately 56% of our aftermarket products in 2024 from vendors located in the U.S.; however, we believe the majority of these products were manufactured in Taiwan, Mexico or other foreign countries, with the remaining aftermarket products being purchased directly from manufacturers in Taiwan and other Asian countries.\nWithin our wholesale operations, we focus our procurement on products that are in the most demand, based on a number of factors such as historical sales records of vehicles by model and year, customer requests, and projections of future supply and demand trends. Because lead times may be 40 days or more on imported aftermarket products, sales volumes and in-stock inventory are important factors in the procurement process.\nWe procure recycled products for our wholesale operations by dismantling total loss vehicles, typically acquired at regional salvage auctions, and inventorying the parts. The availability and pricing of the salvage vehicles we procure for our wholesale recycled products operations may be impacted by a variety of factors, including the production level of new vehicles and the percentage of damaged vehicles declared total losses. Our bidding specialists are equipped with a proprietary software application that allows them to compare the vehicles at salvage auctions against our current inventory levels, historical demand, and recent average selling prices to arrive at an estimated maximum bid.\nScrap and Other Materials\nOur salvage operations generate scrap metal and other materials that we sell to metals recyclers. Vehicles that have been dismantled for recycled products and \"crush only\" end-of-life vehicles acquired from other companies are typically crushed using equipment on site. In other cases, we will hire mobile crushing equipment to crush the vehicles before they are transported to shredders and scrap metal processors. Damaged and unusable wheel cores are melted in our aluminum furnace and sold to consumers of aluminum ingots and sows for the production of various automotive products, including wheels. We also sell the precious metals contained in certain of our recycled parts such as catalytic converters.\nCustomers\nWe sell our products to wholesale customers that include collision and mechanical repair shops and new and used car dealerships, as well as to retail customers. The majority of these customers tend to be individually-owned small businesses, although the number of independent and dealer-operated repair facilities has declined over the last decade as a result of consolidation. While the majority of our distribution is done through a two-step model, our Canadian Automotive Group business utilizes a mix of both a two-step (i.e., direct sales to repair shop customers) and three-step model (i.e., sales to distributors who in turn sell to repair shop customers). \n5\nAutomobile insurance companies affect the demand for our collision products; while insurance companies do not pay for our products directly, they ultimately pay for the repair costs of insured vehicles in excess of any deductible amount. As a result, insurance companies often influence the types of products used in a repair. The use of our alternative parts instead of new OEM products provides a direct benefit to insurance companies by lowering the cost of repairs, by decreasing the repair time and thus the time the vehicle's owner is without a vehicle, and by providing a replacement product that is of similar quality and comparable performance to the part being replaced.\nSince we have comparable options from both our aftermarket and recycled parts stock, our sales staff can access both sales systems and fill requests by cross selling if the desired part is not in stock.\nTo better serve our customers, we take a consolidated approach to the electronic sale of wholesale products in our Wholesale - North America segment. A full suite of e-commerce services is available to approved partners that helps us improve order accuracy, reduce return rates and better fit our customer workflow. Using these services in coordination with our partners, products can be searched, priced and ordered without leaving the customers' own operating systems.\nDistribution\nWe believe our Wholesale - North America segment has the largest distribution network of alternative vehicle parts and accessories for the vehicle collision and mechanical repair market in North America. We have a distribution network of warehouses and cross dock facilities, which allows us to develop and maintain our service levels with local repair shops while providing industry leading fulfillment rates that are made possible by our nationwide presence. Our delivery fleet utilizes a third party software provider to optimize delivery routes and to track the progress of delivery vehicles throughout their runs. This third party software connects into each of our wholesale systems to allow a single interface for our management team to facilitate a single delivery to our customer, regardless of the product line or operating system. Our local presence allows us to provide a responsive and predictable experience, delivering daily if required and using consistent drivers each delivery. Our sales force and local delivery drivers develop and maintain critical personal relationships with the local repair shops, which benefit from access to our wide selection of products that we are able to offer as a result of our regional inventory network. We operate a delivery fleet of trucks and vans, which deliver multiple product types on the same delivery routes to minimize distribution costs, improve customer service and reduce environmental impacts.\nCompetition\nWe consider all suppliers of vehicle collision and mechanical products to be competitors, including aftermarket suppliers, recycling businesses, refurbishing operations, parts remanufacturers, OEMs and internet-based suppliers. We compete with alternative parts distributors on the basis of our nationwide distribution system, our product lines and inventory availability, customer service, our relationships with insurance companies, and to a lesser extent, price; we compete with OEMs primarily on the basis of price and, to a lesser extent, on service and product quality. In the U.S., we do not consider retail chains that focus on the do-it-yourself market to be our direct competitors because many of our wholesale product sales are influenced by insurance companies, who ultimately pay for the repair costs of insured vehicles in excess of any deductible amount, rather than the end user, and there is limited overlap in the products that we sell.\nInformation Technology Systems\nIn our aftermarket operations, we use a third party enterprise management system along with other third party software packages to enhance our online business-to-business platforms - OrderKeystone.com and Keyless. The FinishMaster business (now included within LKQ Refinish) was fully integrated onto our aftermarket systems in 2024, while Canadian Automotive Group remains on its existing, separate, enterprise management system.\nOur wholesale recycled product locations in North America operate an internally-developed, proprietary enterprise management system called LKQX. We believe that the use of a single system across a majority of our wholesale recycled product operations helps facilitate the sales process; allows for continued implementation of standard operating procedures; and improves training efficiency, employee transferability, access to our national inventory database, management reporting and data storage. The system also supports an electronic exchange process for identifying and locating parts at other select recyclers and facilitates brokered sales to fill customer orders for items not in stock. \nWe also use other third party software packages, such as a data warehouse and integrated budgeting system, to leverage centralized data and information to conduct enhanced analytics and reporting.\n6\nEUROPE SEGMENT\nOur Europe segment operates in approximately 20 countries and was built up through a series of acquisitions. Our businesses consist primarily of aftermarket operations, but we have begun expanding into wholesale recycling operations through the acquisition of businesses with salvage and vehicle repair facilities in Sweden and Norway in 2014, remanufacturing in Tunisia in 2018, and remanufacturing and salvage in the Netherlands and Poland in 2023. We divested certain operations in Slovenia, Poland and Bosnia in 2024 as these operations did not align with our strategic objectives.\nInventory\nOur inventory is primarily composed of mechanical aftermarket parts for the repair of vehicles 3 to 15 years old. Our top selling products include brake pads, discs and sensors, clutches, electrical products such as spark plugs and batteries, steering and suspension products, filters, and oil and automotive fluids. Our inventory is comprised of \nover \n900,000\n SKU's\n, of which, parts related to common passenger vehicles represents the largest group. We are committed to simplifying our business by optimizing our product offerings. Our current efforts are focused on evaluating the product mix and market demand for common passenger vehicles parts to identify opportunities for streamlining - including reducing the number of SKU's offered, consolidating suppliers and increasing private label penetration. This evaluation is over halfway complete, with a target of reaching 80% by the end of 2025. Implementation actions are planned for 2025 through 2027.\nIn 2024, our top supplier represented 9% of our aftermarket inventory purchases for our Europe segment. No other suppliers comprised more than 4% of our purchases. Further, we purchased 91% of our products from companies in Europe, and 73%\n \nand 18% of our total inventory purchases were made in euros and pounds sterling, respectively, in 2024. We are expanding the distribution of our private label products, which include Optimal, ERA and MPM Oils.\nIn our salvage operations, we purchase severely damaged or total loss vehicles from insurance companies and auctions, which are transferred to our dismantling facilities or sold to other third party dismantlers.\nCustomers\nWe primarily operate a two-step (i.e., direct sales to repair shop customers) distribution model in Europe, although certain businesses located in Italy, the Netherlands, Germany, Switzerland, and Hungary operate partially a three-step (i.e., sales to distributors who in turn sell to repair shop customers) distribution model. In our two-step operations, we sell the majority of our products to commercial customers primarily consisting of professional repairers, including both independent mechanical repair shops and collision repair shops. In our three-step operations, we sell products to wholesale distributors or jobbers. In addition to our sales to repair shops and wholesale distributors, we generate a portion of our revenue through sales to retail customers from e-commerce platforms and from point of sale transactions at branch locations.\nDistribution\nWe currently have operations in approximately 20 different European countries, which we believe represents the broadest and largest footprint in the aftermarket industry in Europe with a distribution network larger than those of any of our principal competitors. Our European operations employ a distribution model in which inventory is stored at national or international distribution centers or regional hubs, with fast moving product stored at branch locations. The large distribution centers regularly restock the smaller branches and hubs and hold slower moving items, helping us to improve fulfillment rates. Product is moved through the distribution network on our trucks, vans or via common carriers. We have major international central distribution centers in Tamworth, England, Sulzbach-Rosenberg, Germany, and Berkel en Rodenrijs, the Netherlands, that have allowed us to consolidate multiple regional distribution centers while maintaining local distribution centers as necessary to support our businesses. \nCompetition\nWe view all suppliers of replacement repair products as our competitors, including other alternative parts suppliers and OEMs and their dealer networks. We face significant competition in many markets where even smaller competitors can compete on price and service, and the OEMs compete via ties to brand loyalty of the consumer while also remaining competitive on price, service and availability. We believe we have been able to distinguish ourselves from other alternative parts suppliers primarily through our distribution network, efficient inventory management systems and proprietary technology, which allows us to deliver our products quickly, reliably, and at competitive prices.\n7\nInformation Technology Systems\nOur aftermarket operations in Europe use various information technology (\"IT\") systems. Our systems are complex and designed to perform a variety of tasks (depending on the market), including but not limited to customer orders, inventory management, budgeting, analytics, warehouse and logistics, data warehousing, and financial reporting. Certain of our IT systems can interface with the respective IT systems of our repair shop customers, which enables our customers to identify and order the part required for the repair. As part of our efforts to integrate the operations, we are executing a multi-year plan to develop and implement a European wide ERP system, which has reduced and will continue to reduce the number of IT systems we operate through its projected completion date in 2027.\nSPECIALTY SEGMENT\nOur Specialty segment was formed in 2014 with our acquisition of Keystone Specialty, a leading distributor and marketer of specialty vehicle aftermarket products and accessories in North America. We subsequently expanded through acquisitions within the core business and adjacent markets, including high performance vehicle equipment and electrical marine products. Our Specialty operations reach most major markets in the U.S. and Canada and serve the following seven product segments: RV; truck and off-road; towing; speed and performance; wheels, tires and performance handling; marine; and miscellaneous accessories. \nInventory\nThe specialty vehicle aftermarket equipment and accessories we distribute and raw materials for products we manufacture are purchased from suppliers located primarily in the U.S., Canada, and China. Our top selling products are recreational vehicles (\"RV\") appliances and air conditioners, towing hitches, truck bed covers, vehicle protection products, marine electronics, cargo management products, and wheels, tires, and suspension products. Our 2017 acquisition of Warn Industries, Inc. (\"Warn\") gave us internal capabilities to manufacture and source aftermarket winches, hoists, and bumpers. Specialty aftermarket suppliers are typically small to medium-sized, independent businesses that focus on a narrow product or market niche. Due to the highly fragmented supplier base for specialty vehicle aftermarket products, we have limited supplier concentration. In 2024, approximately 21% of our specialty vehicle aftermarket purchases were made from our top three suppliers to this segment, with our largest supplier providing approximately 12% of our annual inventory purchases. No other suppliers comprised more than 4% of our purchases during 2024. \nCustomers\nOverall, the specialty vehicle aftermarket parts and accessories market serves a fragmented customer base composed of RV, marine, and specialty automotive dealers, installers, jobbers, builders, parts chains, and mail-order businesses. Our customers are principally small, independent businesses. These customers depend on us to provide a broad range of products, rapid delivery, marketing support and technical assistance. In addition to traditional customers, we sell to several large parts and accessory online retailers. Our Specialty segment also operates retail stores in northeast Pennsylvania.\nWe promote our products to customers through marketing programs, which include: (i) catalogs, advertising, sponsorships and promotional activities, (ii) product level marketing and merchandising support, and (iii) online and digital marketing initiatives. We stage in-person and/or virtual trade shows across the U.S., which provide an opportunity to improve sales through the showcasing of new and innovative products from our vendors to our customers.\nOnline sales, which represent the majority of our sales, of our Specialty products take place primarily through our ekeystone.com, viantp.com, and SeaWideB2B.com sites and our mobile app. These sites provide customers (i) the ability to match products with the make and model of vehicle thus allowing the customer to order the correct part, (ii) product information (e.g., pictures, attributes) available for review and (iii) the convenience of searching inventory availability and ordering the product on the site. Additionally, these sites can provide sales opportunities by suggesting other parts to purchase based on an inquiry submitted by the customer.\nDistribution\nOur Specialty segment operations employ a hub-and-spoke distribution model that enables us to transport products from our primary distribution centers to our non-inventory stocking cross docks, some of which are co-located with our Wholesale - North America operations and provide distribution points to key regional markets and synergies with our existing infrastructure. We believe this provides added value to our customers through a broader product offering and more efficient distribution process. We use our delivery routes to provide delivery and returns of our products directly to and from our customers in all 48 \n8\ncontinental U.S. states and 9 Canadian provinces, and we ship globally to customers in other countries. Our delivery fleet utilizes a third party software provider to optimize delivery routes, and to track the progress of delivery vehicles.\nCompetition\nIndustry participants have a variety of supply choices. Vendors can deliver products to market via warehouse distributors and mail order catalog businesses, or directly to retailers and/or consumers. We view all distributors of specialty vehicle aftermarket equipment and accessories as our competitors. We believe we have been able to distinguish ourselves from other specialty vehicle aftermarket parts and equipment distributors primarily through our broad product selection, which encompasses both popular and hard-to-find products, our national distribution network, and our efficient inventory management systems, as well as through our service. We compete on the basis of product breadth and depth, rapid and dependable delivery, marketing initiatives, support services, and price.\nInformation Technology Systems\nMost of our Specialty operations utilize an internally developed inventory management and order entry system that interfaces with third party software systems for accounting, transaction processing, inventory and warehouse management, data analytics, and reporting. By utilizing an internally developed system, real-time updates, improvements, and developments can be programmed to fit the business’s ongoing and changing needs.\nSELF SERVICE SEGMENT\nOur Self Service segment consists of retail operations, most of which operate under the name “LKQ Pick Your Part,” and allows consumers to come directly to the yard to pick parts off of salvage vehicles. We also sell scrap metal and other materials to recyclers from cars that are no longer available for customers in the yard. In addition to revenue from the sale of parts, cores, scrap steel and other metals, we charge a nominal admission fee to access the property.\nInventory\nWe acquire salvage vehicles for our self service retail product operations from a variety of sources, including but not limited to towing companies, vehicle auctions, the general public, municipality sales, insurance carriers, and charitable organizations. The salvage vehicles we procure are generally older and priced lower than the salvage vehicles we purchase for our wholesale recycled product operations. Vehicles are delivered to our locations by the seller, or we arrange for transportation. Once on our property, minimal labor is required to process the vehicle other than removing the battery, fluids, refrigerants, catalytic converters and hazardous materials. The extracted fluids are stored in bulk and subsequently sold to recyclers. Vehicles are then placed in the yard for customers to remove parts. In our self service business, availability of a specific part will depend on which vehicles are currently at the site and to what extent parts may have been previously sold. We usually keep a vehicle at our facility for 30 to 120 days, depending on the capacity of the yard and the number of customers serviced, before it is crushed and sold to scrap metal processors.\nScrap and Other Materials\nOur self service operations generate scrap metal, alloys and other materials that we sell to recyclers. Vehicles that we no longer make available to the public and \"crush only\" vehicles acquired from other companies, including OEMs, are typically crushed using equipment on site. Damaged and unusable wheel cores are melted in our aluminum furnace and sold to consumers of aluminum ingots and sows for the production of various automotive products. We also extract and sell the precious metals contained in certain of our recycled parts such as catalytic converters.\nCustomers\nThe customers of our self service yards are frequently do-it-yourself mechanics, small independent repair shops servicing older vehicles, auto rebuilders, and resellers. The scrap from vehicle hulks is sold to metals recyclers, with whom we may also compete when procuring salvage vehicles for our operations.\n9\nCompetition\nThere are competitors operating self service businesses in all of the markets in which we operate. In some markets, there are numerous competitors, often operating in close proximity to our operations. We try to differentiate our business by the quality of the inventory, the size and cleanliness of the property, and digital marketing initiatives, including our mobile app. The mobile app allows customers to receive daily push notifications when vehicles they have identified an interest in are placed into their favorite yards and also allows them to input search parameters, including specific parts and the year, make, and model of their vehicle, to show which compatible parts are available in a specific yard. We do not consider retail chains that focus on the do-it-yourself market to be our direct competitors, as there is limited overlap in the products that we sell. \nInformation Technology Systems\nIn our self service business, we operate two internally-developed, proprietary enterprise management systems. The point of sale system is used to record retail sales transactions and reporting. The Carbuy system is used for the purchasing and inventorying of vehicles. We also use a module within the Carbuy system to record all sales transactions of scrap and other materials. \nHUMAN CAPITAL\nAt LKQ, our team members are at the heart of everything we do. As of December 31, 2024, we employ approximately 47,000 people globally, of which approximately 19,000 were based in North America, 26,000 based in Europe and 2,000 based in Asia.  Of our employees in North America, approximately 1,000 were represented by unions. Outside of North America, we have government-mandated collective bargaining agreements and union contracts in certain countries, particularly in Europe where many of our employees are represented by unions and/or works councils. \nHealth and Safety\nWe are dedicated to ensuring a safe and secure work environment for all team members, where unnecessary risks are minimized, and safety is a shared priority. Our proactive approach includes implementing a range of programs and practices aimed at preventing accidents and fostering a culture of safety throughout our organization. \nEmployee Engagement and Empowerment\nWe strive to create an environment where creativity thrives, and team members are empowered to make decisions that are best for their teams and the business. One example of this practice is our global employee engagement survey, which provides an opportunity to listen to our organization, understand what we are doing well, and identify areas for improvement. As a result of feedback from this survey, we launched the Inspired to Thrive Global Initiative, which reinforces our commitment to fostering an inclusive culture where every team member feels valued, respected, and empowered to contribute their unique perspectives and talents.  This initiative is built on five pillars: (i) holistic well-being; (ii) financial empowerment; (iii) inclusive culture; (iv) professional growth; and (v) community engagement. Each of these pillars is supported by robust programs that enable our team members to lead fulfilling lives both in and outside of the workplace. And through this initiative, we prioritize the well-being, development, and engagement of our workforce, recognizing that a diverse and inclusive environment drives both innovation and success.\nCommitment to Values and Ethics\nOur Code of Ethics empowers our team members to make principled decisions in every aspect of their work. Covering essential topics such as the responsible use of company assets, bribery and corruption, conflicts of interest, discrimination, harassment, health and safety, privacy and data protection, and the safeguarding of confidential information, our Code of Ethics reflects our dedication to maintaining a high level of integrity. Additionally, our global Speak Up program provides a secure, anonymous channel for reporting complaints related to potential violations of our Code of Ethics, policies, laws, or safety practices.\nINTELLECTUAL PROPERTY\nWe own and have the right to use various intellectual property, including intellectual property acquired as a result of past acquisitions, such as intellectual property related to winches manufactured by Warn. In addition to trade names, trademarks and patents, we also have technology-based intellectual property that has been both internally developed and obtained through license agreements and acquisitions. We do not believe that our business is materially dependent on any single item of intellectual property, or any single group of related intellectual property, owned or licensed, nor would the expiration of any particular item or related group of intellectual property, or the termination of any particular intellectual property license \n10\nagreement, materially affect our business. See the risk factor \"\nIntellectual property claims relating to aftermarket products could adversely affect our business.\n\" in Part I, Item 1A of this Annual Report on Form 10-K for further information regarding the risks related to intellectual property.\nREGULATION\nOur operations and properties are subject to laws and regulations relating to the protection of the environment in the U.S. and the other countries in which we operate. We may be affected by tariffs and other import laws and restrictions because we import into the U.S. a significant number of products for sale and distribution. Our business processes and operations are subject to laws and regulations relating to privacy and data protection. Some jurisdictions have enacted laws to restrict or prohibit the sale of alternative vehicle parts. We have thousands of employees located in the U.S. and many other countries and are subject to labor and employment laws in numerous jurisdictions. See \"Risk Factors\" in Part I, Item 1A of this Annual Report on Form 10-K for further information regarding the effects of environmental laws and regulations on us, importation risks, privacy and data protection risks, regulatory restrictions on the sale of our products, and labor and employment risks.\nSEASONALITY\nOur operating results are subject to quarterly variations based on a variety of factors, including, but not limited to, seasonal weather patterns and events. For our Wholesale - North America segment, we tend to see higher demand for our collision related products during periods of cold inclement weather, which creates a higher likelihood of increased collision frequency and repairable claims. For our Europe segment, many of our aftermarket service-related products are impacted by weather patterns. For example, during periods of extreme cold, our Europe segment historically witnesses an increase in battery demand. Our Specialty segment sells parts for RV and marine products, and as a result, we tend to see higher demand for our products during periods of warmer weather due to an increased level of outdoor leisure activity.\nSUSTAINABILITY MATTERS\nProfitably Delivering Sustainable Solutions\nLKQ's North American and European operations purchase used vehicles and remove certain components for reuse in the repair of vehicles which helps reduce the use of raw materials and contributes to a circular economy. Once the parts are removed from end-of-life vehicles, some of the remaining valuable materials are collected and repurposed for use in the manufacturing of new basic materials such as steel, aluminum, plastic, and rubber. Additionally, we extract fluids, some of which are recycled or utilized in our own operations, such as fuel to run our own on- and off-site fleet, and washer fluid.\nOur recycling expertise and efforts are a key pillar of our mission statement of being a leading global value-added and sustainable distributor of vehicle parts and accessories. Our recycling efforts preserve natural resources, reduce the demand for scarce landfill space, and help decrease air and water pollution, the latter attributed to the avoidance of new manufacturing activities that would otherwise be required.\nPeople-led Performance\nPart of LKQ’s mission is to build strong partnerships with our employees and the communities in which we operate. Along those lines, we strive to create a culture of respect and inclusivity and encourage everyone to be their authentic selves. We are committed to maintaining a physically and psychologically safe and inclusive environment, free from bullying and harassment, in alignment with our core values. And in furtherance of our mission, in 2020 we established the LKQ Community Foundation, which is committed to supporting charitable organizations that help the communities where our employees live and LKQ operates.\nStrong Governance and Ethical Practices\nOur Board of Directors (the “Board\") refreshment process has resulted in over half of our current Board being added since August 2018, and currently, 38% of our Board is comprised of persons from underrepresented groups. Additionally, eleven of our thirteen directors are independent.\nWe have adopted “proxy access,” which permits an eligible stockholder to nominate and include in our proxy materials director nominees (subject to the terms set forth in our Bylaws). We also have majority voting for the election of our directors, requiring a director who fails to receive a majority vote to tender his or her resignation to the Board. \n11\nOur Board adopted a revised Code of Ethics in 2024, which covers a variety of topics, including the use of company assets, bribery and corruption, conflicts of interest, discrimination, harassment, health and safety, privacy and data protection, and the safeguarding of confidential information, and reporting Code of Ethics violations. It is available in 16 languages through our Website.\nMore information on our Sustainability initiatives can be found in our 2023 Sustainability Report on our Website. The Sustainability Report is not incorporated by reference and should not be considered part of this Annual Report on Form 10-K.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read in conjunction with our audited Consolidated Financial Statements and notes thereto included in Part II, Item 8, \"Financial Statements and Supplementary Data,\" of this Annual Report on Form 10-K. Discussion of 2022 items and the year-over-year comparison of changes in our financial condition and the results of operations as of and for the years ended December 31, 2023 and December 31, 2022 for our Consolidated Results of Operations can be found in Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" of our Annual Report on Form 10-K for the year ended December 31, 2023 filed with the SEC on February 22, 2024. Unless otherwise indicated or the context otherwise requires, as used in this \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" the terms \"we,\" \"us,\" \"the Company,\" \"our,\" \"LKQ\" and similar terms refer to LKQ Corporation and its subsidiaries.\nOverview\nWe are a global distributor of vehicle products, including replacement parts, components and systems used in the repair and maintenance of vehicles, and specialty aftermarket products and accessories to improve the performance, functionality and appearance of vehicles.\nBuyers of vehicle replacement products have the option to purchase from primarily five sources: new products produced by OEMs; new products produced by companies other than the OEMs, which are referred to as aftermarket products; recycled products obtained from salvage and total loss vehicles; recycled products that have been refurbished; and recycled products that have been remanufactured. We distribute a variety of products to collision and mechanical repair shops, including aftermarket collision and mechanical products; recycled collision and mechanical products; refurbished collision products such as wheels, bumper covers and lights; and remanufactured engines and transmissions. Collectively, we refer to the four sources that are not new OEM products as alternative parts.\nWe are organized into four operating segments: Wholesale - North America; Europe; Specialty; and Self Service, each of which is presented as a reportable segment.\nOur Wholesale - North America segment is a leading provider of alternative vehicle collision replacement products, paint and body repair related products, and alternative vehicle mechanical replacement products, with our sales, processing, and distribution facilities reaching most major markets in the United States and Canada. Our Europe segment is a leading provider of alternative vehicle replacement and maintenance products in Germany, the U.K., the Benelux region, Italy, Czech Republic, Austria, Slovakia, France and various other European countries. Our Specialty segment is a leading distributor of specialty vehicle aftermarket equipment and accessories reaching most major markets in the U.S. and Canada. Our Self Service segment operates self service retail facilities across the U.S. that sell recycled automotive products from end-of-life-vehicles.\nOur operating results have fluctuated on a quarterly and annual basis in the past and can be expected to continue to fluctuate in the future as a result of a number of factors, some of which are beyond our control. Please refer to the factors referred to in Special Note on Forward-Looking Statements and Risk Factors above. Due to these factors and others, which may be unknown to us at this time, our operating results in future periods can be expected to fluctuate. Accordingly, our historical results of operations may not be indicative of future performance.\nAcquisitions and Investments\nSince our inception in 1998, we have pursued a growth strategy through both organic growth and acquisitions. Our current acquisition strategy focuses on highly accretive tuck-in acquisitions with significant synergies or critical capabilities and no large platform acquisitions are expected. Additionally, from time to time, we make investments in various businesses to advance our strategic objectives. See Note 3, \"Business Combinations\" and Note 10, \"Equity Method Investments\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information related to our acquisitions and investments. \nSources of Revenue\nWe report our revenue in two categories: (i) parts and services and (ii) other. Our parts revenue is generated from the sale of vehicle products, including replacement parts, components and systems used in the repair and maintenance of vehicles, and specialty products and accessories used to improve the performance, functionality and appearance of vehicles. Our service revenue is generated primarily from the sale of service-type warranties, fees for admission to our self service yards, and \n32\ndiagnostic and repair services. During the year ended December 31, 2024, parts and services revenue represented 95.6% of our consolidated revenue. Revenue from other sources includes sales of scrap and other metals (including precious metals - platinum, palladium and rhodium - contained in recycled parts such as catalytic converters), bulk sales to mechanical manufacturers (including cores) and sales of aluminum ingots and sows from our furnace operations. Other revenue will vary from period to period based on fluctuations in commodity prices and the volume of materials sold. See Note 12, \"Revenue Recognition\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information related to our sources of revenue.\nCritical Accounting Estimates\nThe preparation of the Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America (\"GAAP\") requires management to make use of certain estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses, as well as related disclosure of contingent assets and liabilities in the Consolidated Financial Statements and accompanying notes. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances. Historically, we have not made significant changes to the methods for determining these estimates as our actual results have not differed materially from our estimates. We do not believe it is reasonably likely that the estimates and related assumptions will change materially in the foreseeable future; however, actual results could differ from those estimates under different assumptions, judgments or conditions.\nCritical accounting estimates are those that are most important to the portrayal of our financial condition and results of operations, and which require us to make our most difficult and subjective judgments, often as a result of the need to make estimates of matters that are inherently uncertain. Based on this definition, we have identified the critical accounting estimates addressed below. For additional information related to significant accounting policies used in the preparation of our Consolidated Financial Statements, see Note 2, \"Summary of Significant Accounting Policies\" to the accompanying Consolidated Financial Statements. \nGoodwill Impairment\nDescription\nGoodwill is obtained through business acquisitions and recorded at the estimated fair value at the date of acquisition. Goodwill is not amortized but instead tested for impairment annually or sooner if events indicate that an impairment may exist. In performing this test, we compare the carrying value of the asset to its fair value. To derive the fair value for our reporting units which carry goodwill, we consider the use of various valuation techniques, with the primary technique being an income approach via a discounted cash flow method and another being a market approach via a guideline public company method. If the carrying value of these assets exceeds the estimated fair value, the asset is considered impaired and an impairment charge is recognized. In performing the test for impairment of goodwill, goodwill is allocated to the reporting units expected to benefit from the business combination. \nJudgments and Uncertainties\nDetermining whether impairment indicators exist and estimating fair values as part of impairment testing require significant judgment. Estimating the fair values of our reporting units which have goodwill requires the use of significant unobservable inputs, or Level 3 inputs, as defined by the fair value hierarchy. As part of applying the discounted cash flow method and guideline public company method, we use significant assumptions which include sales growth, operating margins, discount rates, perpetual growth rates and valuation multiples which consider our budgets, business plans, economic projections and marketplace data.\nSensitivity of Estimate to Change\nThe balance of our goodwill was $5,448 million and $5,600 million as of \nDecember 31, 2024 and December 31, 2023\n, respectively. We have not made material changes in the accounting methodology used to evaluate impairment of goodwill during the last three years. The assumptions used to assess impairment consider historical trends, macroeconomic conditions, and projections consistent with the Company’s operating strategy. Changes in these estimates can have a significant impact on the assessment of fair value which could result in material impairment losses. During fiscal year 2024, we elected to perform a quantitative impairment test for our goodwill. No impairment charges were recorded as a result of the testing as the fair value of each goodwill reporting unit exceeded the calculated carrying value. A 10% decline in projected cash flows or a 10% increase in the discount rate would not have resulted in an impairment to goodwill.\n33\nBusiness Combinations\nDescription\nWe account for business combinations using the acquisition method of accounting, under which the acquisition purchase price is allocated to the assets acquired, including purchased intangible assets, and liabilities assumed based upon their respective fair values. The excess of the fair value of the purchase price over the fair values of these assets acquired and liabilities assumed is recorded as goodwill.\nJudgments and Uncertainties\nAccounting for business combinations requires management to make significant estimates and assumptions to determine the fair values of assets acquired and liabilities assumed at the acquisition date. Although we believe the assumptions and estimates we have made in relation to the acquisitions are appropriate, they are based, in part, on historical experience, information obtained from management of the acquired companies and information obtained from independent third party valuation firms and are inherently uncertain. Critical estimates in valuing certain acquired intangible assets include, but are not limited to, future expected cash flows including revenue growth rate assumptions from product sales and customer contracts, estimated royalty rates used in valuing related intangible assets, customer attrition rates and discount rates. The discount rates used to discount expected future cash flows to present value are typically derived from a weighted-average cost of capital analysis and adjusted to reflect inherent risks. Unanticipated events and circumstances may occur that could affect either the accuracy or validity of such assumptions, estimates or actual results.\nSensitivity of Estimate to Change\nWhile we use our best estimates and assumptions to accurately value assets acquired and liabilities assumed at the acquisition date, our estimates are inherently uncertain and subject to refinement. Changes in the estimates applied or values of acquired assets and liabilities could have a material impact on our financial statements. As a result, during the measurement period, which may be up to one year from the business acquisition date, we may record adjustments to the originally assigned values of assets acquired and liabilities assumed with the corresponding offset to goodwill.\nRecently Issued Accounting Pronouncements\nSee \"Recent Accounting Pronouncements\" in Note 2, \"Summary of Significant Accounting Policies\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for information related to new accounting standards.\nFinancial Information by Geographic Area\nSee Note 12, \"Revenue Recognition\" and Note 25, \"Segment and Geographic Information\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for information related to our revenue and long-lived assets by geographic region.\nKey Performance Indicators\nWe believe that organic revenue growth, Segment EBITDA and free cash flow are key performance indicators for our business. Segment EBITDA is our key measure of segment profit or loss reviewed by our chief operating decision maker (\"CODM\"). Free cash flow is a financial measure that is not prepared in accordance with U.S. generally accepted accounting principles (“non-GAAP”).\n•\nOrganic revenue growth \n- We define organic revenue growth as total revenue growth from continuing operations excluding the effects of acquisitions and divestitures (i.e., revenue generated from the date of acquisition to the first anniversary of that acquisition, net of reduced revenue due to the disposal of businesses) and foreign currency movements (i.e., impact of translating revenue at different exchange rates). Organic revenue growth includes incremental sales from both existing and new (i.e., opened within the last twelve months) locations and is derived from expanding business with existing customers, securing new customers and offering additional products and services. We believe that organic revenue growth is a key performance indicator as this statistic measures our ability to serve and grow our customer base successfully.\n34\n•\nSegment EBITDA\n - See Note 25, \"Segment and Geographic Information\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for a description of the calculation of Segment EBITDA. We believe that Segment EBITDA provides useful information to evaluate our segment profitability by focusing on the indicators of ongoing operational results.\n•\nFree Cash Flow\n - We calculate free cash flow as net cash provided by operating activities, less purchases of property, plant and equipment. Free cash flow provides insight into our liquidity and provides useful information to management and investors concerning cash flow available to meet future debt service obligations and working capital requirements, make strategic acquisitions, repurchase stock, and pay dividends.\nThese three key performance indicators are used as targets in determining incentive compensation at various levels of the organization, including senior management. By using these performance measures, we attempt to motivate a balanced approach to the business that rewards growth, profitability and cash flow generation in a manner that enhances our long-term prospects.\nResults of Operations—Consolidated\nThe following table sets forth statements of income data as a percentage of total revenue for the periods indicated:\nYear Ended December 31,\n \n2024\n2023\nRevenue\n100.0 \n%\n100.0 \n%\nCost of goods sold\n60.9 \n%\n59.8 \n%\nGross margin\n39.1 \n%\n40.2 \n%\nSelling, general and administrative expenses\n27.3 \n%\n27.9 \n%\nRestructuring and transaction related expenses\n0.9 \n%\n0.5 \n%\nDepreciation and amortization\n2.5 \n%\n2.0 \n%\nOperating income\n8.4 \n%\n9.8 \n%\nTotal other expense, net\n1.7 \n%\n0.9 \n%\nIncome from continuing operations before provision for income taxes\n6.7 \n%\n8.9 \n%\nProvision for income taxes\n1.9 \n%\n2.2 \n%\nEquity in earnings of unconsolidated subsidiaries\n0.1 \n%\n0.1 \n%\nIncome from continuing operations\n4.8 \n%\n6.8 \n%\nNet (loss) income from discontinued operations\n— \n%\n— \n%\nNet income\n4.8 \n%\n6.8 \n%\nLess: net income attributable to continuing noncontrolling interest\n— \n%\n— \n%\nNet income attributable to LKQ stockholders\n4.8 \n%\n6.7 \n%\nNote: In the table above, the sum of the individual percentages may not equal the total due to rounding.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\n \nRevenue\nThe following table summarizes the changes in revenue by category (in millions):\nYear Ended December 31,\n2024\n2023\nChange\nParts & services revenue\n$\n13,718 \n$\n13,174 \n$\n544 \nOther revenue\n637 \n692 \n(55)\nTotal revenue\n$\n14,355 \n$\n13,866 \n$\n489 \n35\nThe increase in parts and services revenue of $544 million, or 4.1%, represented increases in segment revenue of 9.9% in Wholesale - North America and 1.3% in Europe, partially offset by decreases of 8.4% in Self Service and 0.7% in Specialty. This overall\n \nincrease was driven by a 6.3% increase due to the net impact of acquisitions and divestitures, partially offset by an organic parts and services revenue decline of 2.2%. The decrease in other revenue of 7.8% was primarily driven by a decrease in organic revenue of $56 million, or 8.1%, due to lower commodities prices and volumes compared to the prior year, which resulted in a $46 million organic revenue decrease in our Self Service segment and a $12 million organic revenue decrease in our Wholesale - North America segment. Refer to the discussion of our segment results of operations for factors contributing to the changes in revenue by segment for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nCost of Goods Sold\nCost of goods sold as a percentage of revenue increased to 60.9% for the year ended December 31, 2024 from 59.8% for the year ended December 31, 2023. Cost of goods sold primarily reflects an increase of 1.0% from our Wholesale - North America segment. Refer to the discussion of our segment results of operations for factors contributing to the changes in cost of goods sold as a percentage of revenue by segment for the year ended December 31, 2024 compared to the year ended December 31, 2023. \nSelling, General and Administrative Expenses\nOur SG&A expenses as a percentage of revenue decreased to 27.3% for the year ended December 31, 2024 from 27.9% for the year ended December 31, 2023. The year over year decrease in SG&A expense primarily reflects an impact of 0.7% related to our Wholesale - North America segment. Refer to the discussion of our segment results of operations for factors contributing to the changes in SG&A expenses as a percentage of revenue by segment for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nRestructuring and Transaction Related Expenses\nRestructuring and transaction related expenses increased by $70 million, primarily due to (i) a $98 million increase in restructuring expenses related to our 2024 Global Restructuring plan, partially offset by (ii) a $17 million decrease related to transaction related expenses and (iii) an $8 million decrease in restructuring expenses related to our 2022 Global Restructuring Plan.\nDepreciation and Amortization\nDepreciation and amortization expense increased by\n \n$78 million, primarily due to an increase in amortization expense of $56 million driven by an increase in Wholesale - North America primarily due to our acquisition of Uni-Select in August 2023. \nProvision for Income Taxes\nSee Note 23, \"Income Taxes\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further information.\nTotal Other Expense, Net\nInterest Expense\nInterest expense\n \nincreased by\n \n$48 million, primarily due to (i) a $52 million increase from higher outstanding debt primarily related to the permanent financing for the Uni-Select Acquisition, and (ii) a $5 million increase from higher interest rates for the year ended December 31, 2024 compared to the prior year, partially offset by (iii) a $9 million decrease related to amortization of pre-acquisition bridge loan financing costs related to the Uni-Select Acquisition.\nGains on Foreign Exchange Contracts - Acquisition Related\nGains on foreign exchange contracts - acquisition related decreased due to the $49 million pretax gain on the foreign exchange forward contracts related to the Uni-Select Acquisition in 2023. See Note 3, \"Business Combinations\" and Note 19, \"Derivative Instruments and Hedging Activities\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further information.\n36\nForeign Currency Impact\nWe translate our statements of income at the average exchange rates in effect for the period. Relative to the rates used for the year ended December 31, 2023, the Czech koruna and Canadian dollar rates used to translate the 2024 statements of income decreased by 4.4% and 1.5%, respectively, while the pound sterling rate increased by 2.7% and the euro was flat. Realized and unrealized currency gains and losses (including the effects of hedge instruments) combined with the translation effect of the change in foreign currencies against the U.S. dollar had a net negative effect of $0.20 on diluted earnings per share relative to the prior year primarily related to the $49 million pretax gain on the foreign exchange forward contracts related to the Uni-Select Acquisition in 2023. \nResults of Operations—Segment Reporting\nWe have four reportable segments: Wholesale - North America; Europe; Specialty; and Self Service. \nWe have presented the growth of our revenue and profitability in our operations on both an as reported and a constant currency basis. The constant currency presentation, which is a non-GAAP measure, excludes the impact of fluctuations in foreign currency exchange rates. We believe providing constant currency information provides valuable supplemental information regarding our growth and profitability, consistent with how we evaluate our performance, as this statistic removes the translation impact of exchange rate fluctuations, which are outside of our control and do not reflect our operational performance. Constant currency revenue and Segment EBITDA results are calculated by translating prior year revenue and Segment EBITDA in local currency using the current year's currency conversion rate. This non-GAAP financial measure has important limitations as an analytical tool and should not be considered in isolation or as a substitute for an analysis of our results as reported under GAAP. Our use of this term may vary from the use of similarly-titled measures by other issuers due to potential inconsistencies in the method of calculation and differences due to items subject to interpretation. In addition, not all companies that report revenue or profitability on a constant currency basis calculate such measures in the same manner as we do, and accordingly, our calculations are not necessarily comparable to similarly-named measures of other companies and may not be appropriate measures for performance relative to other companies.\nThe following table presents our financial performance, including third party revenue, total revenue and Segment EBITDA, by reportable segment for the periods indicated (in millions):\nYear Ended December 31,\n \n2024\n% of Total Segment Revenue\n2023\n% of Total Segment Revenue\n2022\n% of Total Segment Revenue\nThird Party Revenue\nWholesale - North America\n$\n5,762 \n$\n5,281 \n$\n4,556 \nEurope\n6,407 \n6,323 \n5,735 \nSpecialty\n1,654 \n1,665 \n1,788 \nSelf Service\n532 \n597 \n715 \nTotal third party revenue\n$\n14,355 \n$\n13,866 \n$\n12,794 \nTotal Revenue\nWholesale - North America\n$\n5,763 \n$\n5,282 \n$\n4,556 \nEurope\n6,407 \n6,323 \n5,735 \nSpecialty\n1,657 \n1,668 \n1,791 \nSelf Service\n532 \n597 \n715 \nEliminations\n(4)\n(4)\n(3)\nTotal revenue\n$\n14,355 \n$\n13,866 \n$\n12,794 \nSegment EBITDA\nWholesale - North America\n$\n959 \n16.6 \n%\n$\n975 \n18.5 \n%\n$\n852 \n18.7 \n%\nEurope\n634 \n9.9 \n%\n614 \n9.7 \n%\n585 \n10.2 \n%\nSpecialty\n113 \n6.8 \n%\n134 \n8.0 \n%\n199 \n11.1 \n%\nSelf Service\n50 \n9.3 \n%\n36 \n6.0 \n%\n83 \n11.7 \n%\nNote: In the table above, the percentages of total segment revenue may not recalculate due to rounding.\n37\nThe key measure of segment profit or loss reviewed by our CODM, our Chief Executive Officer, is Segment EBITDA. The CODM uses Segment EBITDA to compare profitability among the segments and evaluate business strategies. Segment EBITDA includes revenue and expenses that are controllable by the segment. Corporate general and administrative expenses are allocated to the segments based on usage, with shared expenses apportioned based on the segment's percentage of consolidated revenue. We calculate Segment EBITDA as Net Income excluding net income and loss attributable to noncontrolling interest; income and loss from discontinued operations; depreciation; amortization; interest; gains and losses on debt extinguishment; income tax expense; restructuring and transaction related expenses; change in fair value of contingent consideration liabilities; other gains and losses related to acquisitions, equity method investments, or divestitures; equity in losses and earnings of unconsolidated subsidiaries; equity investment fair value adjustments; impairment charges; and direct impacts of the Ukraine/Russia conflict. See Note 25, \"Segment and Geographic Information\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for a reconciliation of total Segment EBITDA to net income.\nYear Ended December 31, 2024 Compared to Year Ended December 31, 2023\nWholesale - North America\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Wholesale - North America segment (in millions):\nYear Ended December 31,\nWholesale - North America\n2024\n% of Total Segment Revenue\n2023\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n5,465 \n$\n4,974 \n$\n491 \n(1)\nOther revenue\n297 \n307 \n(10)\nIntersegment revenue\n1 \n1 \n— \nTotal segment revenue\n5,763 \n5,282 \n481 \nCost of goods sold\n3,252 \n2,796 \n456 \nGross margin\n2,511 \n43.6 \n%\n2,486 \n47.0 \n%\n25 \n(2)\nSelling, general and administrative expenses\n1,567 \n27.2 \n%\n1,535 \n29.0 \n%\n32 \n(3)\nLess: Other segment items\n(4)\n(15)\n(24)\n9 \nSegment EBITDA\n$\n959 \n16.6 \n%\n$\n975 \n18.5 \n%\n$\n(16)\n(1)\nParts and services revenue increased by $491 million, or 9.9%, to $5,465 million for the year ended December 31, 2024. This increase was primarily driven by acquisitions, net of divestitures revenue of $779 million, or 15.7%, primarily due to the acquisition of Uni-Select in the third quarter of 2023. See\n \nNote 3, \"Business Combinations\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further information on the acquisition of Uni-Select. This was partially offset by an organic revenue decrease of $278 million, or 5.6% (6.3% on a per day basis), primarily due to a reduction in aftermarket collision volumes, which were negatively impacted by a reduction in repairable claims. We believe this is mainly attributable to difficult economic conditions. Additionally, organic revenue was negatively impacted by (i) a reduction in paint revenue related to increased competition and (ii) weather related events in 2024.\n(2)\nGross margin increased by $25 million, or 1.0%, to $2,511 million for the year ended December 31, 2024. This increase was driven by the acquisition of Uni-Select, partially offset by a decrease in parts and services organic revenue and a decline in commodities prices. The decrease in gross margin as a percentage of total segment revenue of 3.4% for the year ended December 31, 2024 compared to the prior year was primarily due to the dilutive nature of the acquisition of Uni-Select, which changed the segment's product mix to reflect a greater percentage of paint, body and equipment and maintenance product lines. These product lines have a lower gross margin structure than our other wholesale product lines. Additionally, the gross margin was negatively affected by the related mix effect resulting from lower aftermarket revenue, which has a higher margin than our other wholesale lines as well as decreases in salvage margins tied to softening salvage revenue and a decline in commodities prices.\n(3)\nSelling, general and administrative expenses increased by $32 million, or 2.3%, to $1,567 million for the year ended December 31, 2024. The increase in Selling, general and administrative expense primarily reflects unfavorable impacts of (i) $71 million from personnel costs excluding incentive compensation primarily due to the acquisition of Uni-Select, (ii) $36 million from facility costs primarily due to the acquisition of Uni-Select, (iii) $11 million from increased freight, vehicle, and fuel costs, partially offset by (iv) $42 million from lower incentive compensation, (v) $27 million from \n38\nprofessional fees primarily related to proceeds from the favorable settlement of a legal claim in 2024, (vi) $6 million from lower charitable contributions in the prior year period, and (vii) other individually immaterial factors representing an $11 million favorable impact in the aggregate. Selling, general and administrative expenses as a percent of total segment revenue decreased by 1.8% to 27.2% for the year ended December 31, 2024. In addition to the factors noted above, the decrease in Selling, general and administrative expenses as a percent of total segment revenue was driven by cost saving initiatives and acquisition related synergies, partially offset by inflationary pressures.\n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nEurope\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Europe segment (in millions):\nYear Ended December 31,\nEurope\n2024\n% of Total Segment Revenue\n2023\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n6,386 \n$\n6,303 \n$\n83 \n(1)\nOther revenue\n21 \n20 \n1 \nTotal segment revenue\n6,407 \n6,323 \n84 \nCost of goods sold\n3,953 \n3,886 \n67 \nGross margin\n2,454 \n38.3 \n%\n2,437 \n38.5 \n%\n17 \n(2)\nSelling, general and administrative expenses\n1,855 \n28.9 \n%\n1,842 \n29.1 \n%\n13 \n(3)\nLess: Other segment items\n(4)\n(35)\n(19)\n(16)\nSegment EBITDA\n$\n634 \n9.9 \n%\n$\n614 \n9.7 \n%\n$\n20 \n(1)\nParts and services revenue increased by $83 million, or 1.3%, to $6,386 million for the year ended December 31, 2024. This increase was primarily due to a parts and services organic revenue increase of $76 million, or 1.2% (0.7% on a per day basis), driven by pricing initiatives to offset increased costs resulting from inflationary pressures and, to a lesser extent, increased volumes.\n(2)\nGross margin increased by $17 million, or 0.7%, to $2,454 million for the year ended December 31, 2024. This increase was primarily attributable to increased revenue through pricing initiatives, partially offset by unfavorable customer mix, inflationary pressures and a $16 million reduction primarily related to restructuring expenses incurred as part of the 2024 Global Restructuring Plan. These restructuring expenses are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" and Note 25, \"Segment and Geographic Information\" for further information.\n(3)\nSelling, general and administrative expenses increased by $13 million, or 0.7%, to $1,855 million for the year ended December 31, 2024. The increase in selling, general and administrative expense primarily reflects unfavorable impacts of (i) $15 million from professional fees related to several strategic central and regional IT initiatives, (ii) $14 million from increased outbound freight and logistics costs, (iii) $7 million from increased personnel costs mainly due to wage inflation, and (iv) other individually immaterial factors representing a $1 million unfavorable impact in the aggregate, partially offset by favorable impacts of (v) $13 million due to lower energy and utilities costs compared to the prior year across all geographies, and (vi) $11 million of non-recurring expense in the prior year related to the settlement of a value-added tax issue in Italy. \n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\n39\nSpecialty\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Specialty segment (in millions):\nYear Ended December 31,\nSpecialty\n2024\n% of Total Segment Revenue\n2023\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n1,654 \n$\n1,665 \n$\n(11)\n(1)\nIntersegment revenue\n3 \n3 \n— \nTotal segment revenue\n1,657 \n1,668 \n(11)\nCost of goods sold\n1,238 \n1,238 \n— \nGross margin\n419 \n25.3 \n%\n430 \n25.8 \n%\n(11)\n(2)\nSelling, general and administrative expenses\n315 \n19.0 \n%\n305 \n18.3 \n%\n10 \n(3)\nLess: Other segment items\n(4)\n(9)\n(9)\n— \nSegment EBITDA\n$\n113 \n6.8 \n%\n$\n134 \n8.0 \n%\n$\n(21)\n(1)\nParts and services revenue decreased by $11 million, or 0.7%, to $1,654 million for the year ended December 31, 2024. This was primarily due to a parts and services organic revenue decrease of $75 million, or 4.5% (5.3% on a per day basis), driven by demand softness in the RV and automotive product lines, as unit retail sales for RV and certain automotive categories have declined year over year. This was partially offset by a net increase of $66 million, or 4.0%, in acquisition and divestiture revenue primarily related to our acquisition of one Specialty business in 2023.\n(2)\nGross margin decreased by $11 million, or 2.6%, to $419 million for the year ended December 31, 2024. This decrease was primarily driven by higher discounts to help maintain sales volume in the first six months of the year, as well as lower revenue.\n(3)\nSelling, general and administrative expenses increased by $10 million, or 3.3%, to $315 million for the year ended December 31, 2024. The increase in selling, general and administrative expenses reflects unfavorable impacts of (i) $5 million from increased personnel costs, (ii) $3 million related to higher credit loss reserves compared to prior year, and (iii) other individually immaterial factors representing a $5 million unfavorable impact in the aggregate, partially offset by a favorable impact of (iv) $3 million due to lower freight, vehicle and fuel expenses.\n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nSelf Service\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Self Service segment (in millions):\nYear Ended December 31,\nSelf Service\n2024\n% of Total Segment Revenue\n2023\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n213 \n$\n232 \n$\n(19)\n(1)\nOther revenue\n319 \n365 \n(46)\n(2)\nTotal segment revenue\n532 \n597 \n(65)\nCost of goods sold\n305 \n375 \n(70)\nGross margin\n227 \n42.7 \n%\n222 \n37.2 \n%\n5 \n(3)\nSelling, general and administrative expenses\n179 \n33.6 \n%\n188 \n31.5 \n%\n(9)\n(4)\nLess: Other segment items\n(5)\n(2)\n(2)\n— \nSegment EBITDA\n$\n50 \n9.3 \n%\n$\n36 \n6.0 \n%\n$\n14 \n40\n(1)\nParts and services organic revenue decreased by $19 million, or 8.4% (8.7% on a per day basis), to $213 million for the year ended December 31, 2024. This decrease was primarily due to lower parts volumes from a reduced number of customer admissions.\n(2)\nOther organic revenue decreased $46 million, or 12.7%, to $319 million for the year ended December 31, 2024. This decrease was primarily driven by (i) a $28 million decrease in revenue from precious metals due to lower prices and lower volumes and (ii) a $24 million decrease in revenue from scrap steel primarily related to lower volumes and lower prices, partially offset by (iii) a $6 million increase in revenue from other scrap (e.g., aluminum) and cores due to higher prices, partially offset by lower volumes.\n(3)\nGross margin increased by $5 million, or 2.3%, to $227 million for the year ended December 31, 2024. The increase is attributable to improvements in vehicle procurement costs, partially offset by lower commodities prices. Decreases in precious metals prices contributed an estimated $13 million decline in gross margin relative to the year ended December 31, 2023. During the year ended December 31, 2024, scrap steel prices had a $2 million unfavorable impact on gross margin, compared to a $5 million favorable impact during the year ended December 31, 2023. The unfavorable impacts for the year ended December 31, 2024 resulted from decreases in scrap steel prices between the date we purchased a vehicle, which influences the price we pay for a vehicle, and the date we scrapped a vehicle, which influences the price we receive for scrapping a vehicle.\n(4)\nSelling, general and administrative expenses decreased by $9 million, or 5.0%, to $179 million for the year ended December 31, 2024. The decrease in Selling, general and administrative expenses primarily reflects individually immaterial factors representing a $9 million favorable impact in the aggregate primarily related to operational productivity initiatives.\n(5)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nYear Ended December 31, 2023 Compared to Year Ended December 31, 2022\nWholesale - North America\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Wholesale - North America segment (in millions):\nYear Ended December 31,\nWholesale - North America\n2023\n% of Total Segment Revenue\n2022\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n4,974 \n$\n4,207 \n$\n767 \n(1)\nOther revenue\n307 \n349 \n(42)\n(2)\nIntersegment revenue\n1 \n— \n1 \nTotal segment revenue\n5,282 \n4,556 \n726 \nCost of goods sold\n2,796 \n2,347 \n449 \nGross margin\n2,486 \n47.0 \n%\n2,209 \n48.5 \n%\n277 \n(3)\nSelling, general and administrative expenses\n1,535 \n29.0 \n%\n1,372 \n30.1 \n%\n163 \n(4)\nLess: Other segment items\n(5)\n(24)\n(15)\n(9)\nSegment EBITDA\n$\n975 \n18.5 \n%\n$\n852 \n18.7 \n%\n$\n123 \n(1)\nParts and services revenue increased by $767 million, or 18.2%, to $4,974 million for the year ended December 31, 2023. This increase was primarily driven by an acquisition and divestiture parts and services revenue net increase of $432 million, or 10.3%, primarily due to the acquisition of Uni-Select in the third quarter of 2023, partially offset by the divestiture of our PGW aftermarket glass business in the second quarter of 2022. See\n \nNote 3, \"Business Combinations\" and \"Other Divestitures (Not Classified in Discontinued Operations)\" in Note 4, \"Discontinued Operations and Divestitures\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further information on the acquisition of Uni-Select and the divestiture of PGW, respectively. Additionally, parts and services organic revenue increased 8.2% (8.6% on a per day basis) for the year ended December 31, 2023 compared to the prior year, primarily driven pricing initiatives which focused on offsetting inflation on input costs and a net volume increase. Aftermarket collision parts volumes increased year over year due to reduced pressures on our supply chain. Aftermarket \n41\ncollision parts volumes also grew as a result of the continued rollout of State Farm's aftermarket parts program, which began on a trial basis in June 2022 and has subsequently been expanded.\n(2)\nOther revenue decreased by $42 million, or 12.0%, to $307 million for the year ended December 31, 2023. This decrease was primarily due to an other organic revenue decrease of $41 million, or 11.8%, primarily related to (i) a $46 million decrease in revenue from precious metals (platinum, palladium, and rhodium) due to lower prices, partially offset by higher volumes, partially offset by (ii) a $5 million increase in revenue from other scrap (e.g., aluminum) and cores due to higher volumes, partially offset by lower prices.\n(3)\nGross margin increased by $277 million, or 12.5%, to $2,486 million for the year ended December 31, 2023. The decrease in gross margin as a percentage of total segment revenue of was primarily driven by (i) an unfavorable impact of 2.1% related to the acquisition of Uni-select in the third quarter of 2023 due to product mix as the paint, body, and equipment and maintenance parts lines have a lower gross margin structure than other wholesale product lines, partially offset by (ii) a 0.5% benefit from lower inbound freight costs and (iii) a 0.2% mix benefit resulting from the PGW divestiture in the second quarter of 2022.\n(4)\nSelling, general and administrative expenses increased by $163 million, or 11.8%, to $1,535 million for the year ended December 31, 2023. The decrease in Selling, general and administrative expenses as a percentage of revenue reflects favorable impacts of (i) 0.9% related to the acquisition of Uni-Select as Uni-Select operates with lower overhead expenses than our other wholesale product lines, (ii) 0.5% from decreased freight, vehicle, and fuel costs and (iii) other individually immaterial factors representing a 0.2% favorable impact in the aggregate, partially offset by (iv) 0.4% from higher professional fees and (v) 0.2% from higher charitable contributions.\n(5)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nEurope\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Europe segment (in millions):\nYear Ended December 31,\nEurope\n2023\n% of Total Segment Revenue\n2022\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n6,303 \n$\n5,711 \n$\n592 \n(1)\nOther revenue\n20 \n24 \n(4)\nTotal segment revenue\n6,323 \n5,735 \n588 \nCost of goods sold\n3,886 \n3,520 \n366 \nGross margin\n2,437 \n38.5 \n%\n2,215 \n38.6 \n%\n222 \n(2)\nSelling, general and administrative expenses\n1,842 \n29.1 \n%\n1,651 \n28.8 \n%\n191 \n(3)\nLess: Other segment items\n(4)\n(19)\n(21)\n2 \nSegment EBITDA\n$\n614 \n9.7 \n%\n$\n585 \n10.2 \n%\n$\n29 \n(1)\nParts and services revenue increased by $592 million, or 10.4%, to $6,303 million for the year ended December 31, 2023. This increase was primarily due to (i) a parts and services organic revenue increase of 6.9% (7.4% on a per day basis), primarily driven by pricing initiatives across all geographies to offset increased costs resulting from inflationary pressures and to a lesser extent, higher volumes, (ii) an acquisition and divestiture revenue net increase of $76 million, or 1.3%, primarily related to our acquisition of seven wholesale businesses from the beginning of 2022 through the one-year anniversary of the acquisition dates and (iii) an exchange rate increase of $121 million, or 2.1%, primarily due to the weaker U.S. dollar against the euro, Czech koruna and pound sterling for the year ended December 31, 2023 relative to the prior year. \n(2)\nGross margin increased by $222 million, or 10.0%, to $2,437 million for the year ended December 31, 2023. Gross margin as a percent of total segment revenue was flat on a year to date basis, as favorable impacts from price increases were offset by inflationary pressures and difficult macro-economic conditions causing consumer price sensitivity, most notably in our Central and Eastern European regions. \n42\n(3)\nSelling, general and administrative expenses increased by $191 million, or 11.6%, to $1,842 million for the year ended December 31, 2023. The increase in selling, general and administrative expense as a percentage of total segment revenue primarily reflects the unfavorable impacts of 0.2% due to the settlement of a value-added tax issue in Italy and leverage effects of 0.2% caused by strike activity in Germany. \n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nSpecialty\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Specialty segment (in millions):\nYear Ended December 31,\nSpecialty\n2023\n% of Total Segment Revenue\n2022\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n1,665 \n$\n1,788 \n$\n(123)\n(1)\nIntersegment revenue\n3 \n3 \n— \nTotal segment revenue\n1,668 \n1,791 \n(123)\nCost of goods sold\n1,238 \n1,270 \n(32)\nGross margin\n430 \n25.8 \n%\n521 \n29.1 \n%\n(91)\n(2)\nSelling, general and administrative expenses\n305 \n18.3 \n%\n325 \n18.2 \n%\n(20)\n(3)\nLess: Other segment items\n(4)\n(9)\n(3)\n(6)\nSegment EBITDA\n$\n134 \n8.0 \n%\n$\n199 \n11.1 \n%\n$\n(65)\n(1)\nParts and services revenue decreased by $123 million, or 6.9%, to $1,665 million for the year ended December 31, 2023. This decrease was primarily due to a parts and services organic revenue decrease of 10.1% primarily due to demand softness in the RV product line, as RV unit retail sales and wholesale shipments have declined year over year. This was partially offset by an acquisition and divestiture parts and services revenue net increase of $64 million, or 3.6%, primarily related to our acquisition of one Specialty business in 2023.\n(2)\nGross margin decreased by $91 million, or 17.4%, to $430 million for the year ended December 31, 2023. Gross margin as a percent of total segment revenue decreased primarily due to product channel mix toward lower margin auto and marine products and increased competitive pricing due to broader availability of inventory among competitors in the market.\n(3)\nSelling, general and administrative expenses decreased by $20 million, or 6.4%, to $305 million for the year ended December 31, 2023. The decrease in selling, general and administrative expenses as a percent of total segment revenue was primarily due to a 0.2% decrease in personnel costs, mainly driven by decreased workers compensation and health insurance expenses, as well as restructuring activities.\n(4)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\n43\nSelf Service\nThe following table provides a reconciliation of Revenue to Segment EBITDA in our Self Service segment (in millions):\nYear Ended December 31,\nSelf Service\n2023\n% of Total Segment Revenue\n2022\n% of Total Segment Revenue\n$ Change\nParts & services revenue\n$\n232 \n$\n227 \n$\n5 \n(1)\nOther revenue\n365 \n488 \n(123)\n(2)\nTotal segment revenue\n597 \n715 \n(118)\nCost of goods sold\n375 \n437 \n(62)\nGross margin\n222 \n37.2 \n%\n278 \n38.8 \n%\n(56)\n(3)\nSelling, general and administrative expenses\n188 \n31.5 \n%\n196 \n27.4 \n%\n(8)\n(4)\nLess: Other segment items\n(5)\n(2)\n(1)\n(1)\nSegment EBITDA\n$\n36 \n6.0 \n%\n$\n83 \n11.7 \n%\n$\n(47)\n(1)\nParts and services organic revenue increased by $5 million, or 2.4%, to $232 million for the year ended December 31, 2023, primarily driven by pricing initiatives which focused on offsetting inflation on input costs resulting from greater competition for vehicles.\n(2)\nOther revenue decreased by $123 million, or 25.2%, to $365 million for the year ended December 31, 2023, primarily driven by an other organic decrease of $93 million, or 19.1%, due to (i) a $79 million decrease in revenue from precious metals (platinum, palladium, and rhodium) due to lower prices, (ii) a $20 million decrease in revenue from scrap steel related to lower prices and lower volumes, partially offset by (iii) a $6 million increase in revenue from other scrap (e.g., aluminum) and cores primarily related to higher volumes, partially offset by lower prices. Additionally, acquisition and divestiture other revenue was a net decrease of $30 million, or 6.1%, due to the divestiture of a business in the third quarter of 2022. See \"Other Divestitures (Not Classified in Discontinued Operations)\" in Note 4, \"Discontinued Operations and Divestitures\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further information on the divestiture.\n(3)\nGross margin decreased by $56 million, or 20.0%, to $222 million for the year ended December 31, 2023 primarily due to an unfavorable impact resulting from vehicle procurement costs decreasing at a lesser rate than commodity prices. Decreases in precious metals prices contributed an estimated $60 million decline in gross margin relative to the year ended December 31, 2022. Net sequential changes in scrap steel prices partially offset the impact of the decline in precious metals prices. During the year ended December 31, 2023, scrap steel prices had a $5 million favorable impact on gross margin compared to a $15 million unfavorable impact during the year ended December 31, 2022. The favorable impacts for the year ended December 31, 2023 resulted from the increase in scrap steel prices between the date we purchased a vehicle, which influences the price we pay for a vehicle, and the date we scrapped a vehicle, which influences the price we receive for scrapping a vehicle.\n(4)\nSelling, general and administrative expenses decreased by $8 million, or 3.9%, to $188 million for the year ended December 31, 2023. The increase in selling, general and administrative expenses as a percent of total segment revenue was primarily due to a negative leverage effect of 5.7% from decreases in metals revenue, partially offset by other individually immaterial factors representing a 1.5% favorable impact in the aggregate.\n(5)\nAmounts primarily represent other non operating income and expenses, as well as reconciling items to remove depreciation - cost of goods sold and restructuring - cost of goods sold, which are excluded from the calculation of Segment EBITDA. See Note 13, \"Restructuring and Transaction Related Expenses\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for additional information on restructuring charges.\nLiquidity and Capital Resources\nWe assess our liquidity and capital resources in terms of our ability to fund our operations and provide for expansion through both internal development and acquisitions. Our primary sources of liquidity are cash flows from operations and our revolving credit facilities. We utilize our cash flows from operations to fund working capital and capital expenditures, with the excess amounts going towards paying dividends, repurchasing our common stock, paying down outstanding debt, or funding acquisitions. As we have pursued acquisitions as part of our historical growth strategy, our cash flows from operations have not always been sufficient to cover our investing activities. To fund our acq\nuisitions, we have accessed various forms of debt \n44\nfinancing, including revolving credit facilities, term loans, and senior notes. We currently believe we have sufficient access to capital markets to support our future growth objectives. \nThe following table summarizes liquidity data as of the dates indicated (in millions):\nDecember 31, 2024\nDecember 31, 2023\nCapacity under revolving credit facilities\n$\n2,000 \n$\n2,000 \nLess: Revolving credit facilities borrowings\n664 \n914 \nLess: Letters of credit\n114 \n110 \nAvailability under credit revolving facilities\n1,222\n976 \nAdd: Cash and cash equivalents\n234 \n299 \nTotal liquidity\n$\n1,456 \n$\n1,275 \nWe had \n$1,222 million\n available under\n our revolving credit facilities as of December 31, 2024. Combined with $234 million\n \nof cash and cash equivalents at December 31, 2024, we had $1,456 million i\nn available liquidity, an increase of \n$181 million\n from our\n available liquidity as of December 31, 2023, primarily as a result of reducing our revolving credit facilities borrowings by $250 million. \nSee Note 18, \"Long-Term Obligations\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K\n for information regarding total debt outstanding.\n \nWe believe that our current liquidity, cash expected to be generated by operating activities in future periods and access to capital markets will be sufficient to meet our current operating and capital requirements. Our capital allocation strategy includes spending to support growth driven capital projects, return stockholder value through the payment of dividends and repurchasing shares of our common stock, completing highly synergistic tuck-in acquisitions and debt repayment. \nSee Part II, Item 5 of this Annual Report on Form 10-K for further information regarding\n the dividend activity for our common stock for the \nyear ended\n December 31, 2024\n.\nOn February 18, 2025, our Board declared a quarterly cash dividend of $0.30 per share of common stock, payable on March 27, 2025, to stockholders of record at the close of business on March 13, 2025\n. \nWe believe that our future cash flow generation will permit us to continue paying dividends in future periods; however, the timing, amount and frequency of such future dividends will be subject to approval by our Board, and based on considerations of capital availability, and various other factors, many of which are outside of our control.\n \nWith $1,456 million of total liquidity as of December 31, 2024 and $38 million of current maturities, we have access to funds to meet our near term commitments. We have a surplus of current assets over current liabilities, which further reduces the risk of short-term cash shortfalls. \nO\nur Senior Unsecured Credit Agreement and our CAD Note both include two financial maintenance covenants: a maximum total leverage ratio and minimum interest coverage ratio. The terms maximum total leverage ratio and minimum interest coverage ratio are specifically calculated per both the Senior Unsecured Credit Agreement and CAD Note, and differ in specified ways from comparable GAAP or common usage terms. We were in compliance with all applicable covenants under both our Senior Unsecured Credit Agreement and CAD Note as of \nDecember 31, 2024\n. The required debt covenants per both the Senior Unsecured Credit Agreement and CAD Note and our actual ratios with respect to those covenants are as follows as of \nDecember 31, 2024\n:\nCovenant Level\nRatio Achieved as of \nDecember 31, 2024\nMaximum total leverage ratio\n4.00 : 1.00\n2.3\nMinimum interest coverage ratio\n3.00 : 1.00\n7.5\nThe indentures relating to our U.S. Notes and Euro Notes d\no not include financial maintenance covenants, and the indentures will not restrict our ability to draw funds under the Senior Unsecured Credit Agreement. The indentures do not prohibit amendments to the financial covenants under the Senior Unsecured Credit Agreement and CAD Note as needed.\n45\nWhile we believe that we have adequate capacity under our existing revolving credit facilities to finance our current operations, from time to time we may need to raise additional funds through public or private financing, strategic relationships or modification of our existing Senior Unsecured Credit Agreement to finance additional investments or to refinance existing debt obligations. There can be no assurance that additional funding, or refinancing of our Senior Unsecured Credit Agreement, if needed, will be available on terms attractive to us, or at all. Furthermore, any additional equity financing may be dilutive to stockholders, and debt financing, if available, may involve restrictive covenants or higher interest costs. Our failure to raise capital if and when needed could have a material adverse impact on our business, operating results, and financial condition. \nAs part of our effort to improve our operating cash flows, we may negotiate payment term extensions with suppliers. These efforts are supported by our supply chain finance programs. See Note 17, \"Supply Chain Financing\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for information related to our supply chain financing arrangements.\nWe hold interest rate swaps to hedge the variable rates on a portion of our credit agreement borrowings. After giving effect to these contracts outstanding, the weighted average interest rate on borrowings outstanding under our Senior Unsecured Credit Agreement was 5.8% at \nDecember 31, 2024\n. Including our senior notes and CAD Note, our overall weighted average interest rate on borrowings was 5.3% at \nDecember 31, 2024\n. Under the Senior Unsecured Credit Agreement, our borrowings bear interest at the Secured Overnight Financing Rate (i.e., SOFR) plus the applicable spread or other risk-free interest rates that are applicable for the specified currency plus a spread. Under the CAD Note, the interest rate may be (i) a forward-looking term rate based on the Canadian Overnight Repo Rate Average (\"CORRA\") for an interest period chosen by the Company of one or three months or (ii) the Canadian Prime Rate (as defined in the CAD Note), plus in each case a spread. See Note 18, \"Long-Term Obligations\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for information related to our borrowings and related interest. The interest rate swaps are described in Note 19, \"Derivative Instruments and Hedging Activities\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K.\n \nWe had outstanding borrowin\ngs under our revolving credit facilities and term loans payable of $1,651 million \nand \n$1,943 million\n at \nDecember 31, 2024\n and 2023, respectively. Of these amounts\n, there were no current maturities at\n \nDecember 31, 2024\n or 2023.\nSee Note 18, \"Long-Term Obligations\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K\n for information regarding the\n scheduled maturities of long-term obligations outstanding\n.\n \nAs of December 31, 2024, the Company had cash and cash equivalents of \n$234 million\n, of which $213 million was held by foreign subsidiaries. In general, it is our practice and intention to permanently reinvest the undistributed earnings of our foreign subsidiaries. We believe that we have sufficient cash flow and liquidity to meet our financial obligations in the U.S. without repatriating our foreign earnings. We may, from time to time, choose to selectively repatriate foreign earnings if doing so supports our financing or liquidity objectives. Distributions of dividends from our foreign subsidiaries, if any, would be generally exempt from further U.S. taxation, either as a result of the 100% participation exemption under the Tax Cuts and Jobs Act enacted in 2017, or due to the previous taxation of foreign earnings under the transition tax and the Global Intangible Low-Taxed Income regime (\"GILTI\").\nThe procurement of inventory is the largest operating use of our funds. We normally pay for aftermarket product purchases on standard payment terms or at the time of shipment, depending on the manufacturer and the negotiated payment terms. We normally pay for salvage vehicles acquired at salvage auctions and under direct procurement arrangements at the time that we take possession of the vehicles.\nFor the year ended December 31, 2024, net cash provided by operating activities totaled $1,121 million compared to $1,356 million for the same period of 2023. Cash flows related to our primary working capital accounts can be volatile as the purchases, payments and collections can be timed differently from period to period.\n \nInventories represented $324 million in incremental cash outflows for the year ended December 31, 2024 compared to the same period of 2023. Accounts payable produced $256 million in incremental cash inflows for the year ended December 31, 2024 compared to the same period of 2023. Other operating activities primarily reflect the aggregate effect of lower cash earnings, higher interest payments (primarily due to additional borrowings for the Uni-Select Acquisition and higher interest rates), and higher cash paid for taxes during the year ended December 31, 2024 compared to the same period of 2023.\n46\nFor the year ended December 31, 2024, net cash used in investing activities totaled $406 million compared to $2,442 million for the same period of 2023. We invested $49 million and $2,225 million of cash in business acquisitions during the years ended December 31, 2024 and 2023, respectively. Proceeds from the disposal of businesses, net of divested cash were an outflow of $11 million for the year ended December 31, 2024, compared to an inflow of $110 million for the year ended December 31, 2023, primarily related to the sale of GSF Car Parts. Property, plant and equipment purchases were $311 million for the year ended December 31, 2024 compared to $358 million in the prior year. During the year ended December 31, 2023, we settled our foreign exchange forward contracts related to the Uni-Select purchase price with the counterparties and received\n \n$49 million due primarily to strengthening in the Canadian exchange rate relative to the contract rates.\nThe following table reconciles Net Cash Provided by Operating Activities to Free Cash Flow (in millions):\n \nYear Ended December 31,\n \n2024\n2023\nNet cash provided by operating activities\n$\n1,121 \n$\n1,356 \nLess: purchases of property, plant and equipment\n311 \n358 \nFree cash flow\n$\n810 \n$\n998 \nFor the year ended December 31, 2024, net cash used in financing activities totaled $746 million compared to net cash provided by financing activities of $1,102 million\n for the same period of \n2023. The decrease is primarily due to proceeds (net of unamortized bond discounts) of $1,394 million from the issuance of the U.S. Notes (2028/33) in 2023. Cash outflows for share repurchases were $360 million and dividends paid were $318 million for the year ended December 31, 2024 compared to $38 million for share repurchases and $302 million for dividends paid for the same period of 2023. Net debt payments (net of unamortized bond discounts) were $17 million for the year ended December 31, 2024 compared to net debt borrowings (net of unamortized bond discounts) of $111 million for the same period of 2023 (excluding proceeds from the issuance of the U.S. Notes (2028/33) of $1,394 million).\nWe intend to continue to evaluate markets for potential growth through the internal development of distribution centers, processing and sales facilities, and warehouses, through further integration of our facilities, and through selected business acquisitions. Our future liquidity and capital requirements will depend upon numerous factors, including the costs and timing of our internal development efforts and the success of those efforts.\nWe have various contractual obligations and commitments arising in the normal course of business. The following represent our anticipated material cash requirements from known contractual and other obligations as of December 31, 2024.\n•\nLong-term debt of $4,198 million and related interest totaling $914 million, of which $38 million and $223 million, respectively, is expected to be paid within twelve months. See Note 18, \"Long-Term Obligations\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for more information related to debt amounts outstanding at December 31, 2024. \n•\nOperating lease payments of $1,838 million, of which $333 million is expected to be paid within twelve months. See Note 21, \"Leases\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for more information related to lease amounts outstanding at December 31, 2024.\n•\nPurchase obligations of $693 million for open purchase orders for aftermarket inventory all expected to be paid within twelve months.\n•\nNet pension obligations of $84 million, of which $8 million is expected to be paid within twelve months. Benefit payments for our funded plans will be made from plan assets, whereas benefit payments for our unfunded plans are made from cash flows from operating activities. See Note 22, \"Employee Benefit Plans\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for more information related to net pension obligations at December 31, 2024. \n•\nSelf-insurance reserves of $144 million, of which\n \n$79 million is expected to be paid within twelve months. See Note 7, \"Self-Insurance Reserves\" to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for more information related to self-insurance reserves at December 31, 2024.\n47\nSummarized Guarantor Financial Information\nOur U.S. Notes (2028/2033) and Euro Notes (2031) are guaranteed on a senior, unsecured basis by certain of our subsidiaries (each, a “subsidiary guarantor” and, together with LKQ, the “Obligor Group”), which are listed in Exhibit 22.1 in Part IV, Item 15 of this Annual Report on Form 10-K. The guarantees are full and unconditional, joint and several, and subject to certain conditions for release. See Note 18, \"Long-Term Obligations\" in Part II, Item 8 of this Annual Report on Form 10-K for information related to the Euro Notes (2031) and U.S. Notes (2028/2033).\nHolders of the notes have a direct claim only against the Obligor Group. The following summarized financial information is presented for the Obligor Group on a combined basis after elimination of intercompany transactions and balances within the Obligor Group and equity in the earnings from and investments in any non-guarantor subsidiary.\nSummarized Statements of Income (in millions)\nFiscal Year Ended December 31,\n2024\n2023 \n(2)\nRevenue\n$\n6,968 \n$\n6,954 \nCost of goods sold\n4,192 \n4,079 \nGross margin \n(1)\n2,776 \n2,875 \nIncome from continuing operations\n428 \n602 \nNet income\n$\n428 \n$\n589 \n(1)\nGuarantor subsidiaries recorded $53 million and $53 million of net sales to and $205 million and $203 million of purchases from non-guarantor subsidiaries for the fiscal years ended December 31, 2024 and December 31, 2023, respectively.\n(2)\nInformation reflects the current Obligor Group listed in Exhibit 22.1 in Part IV, Item 15 of this Annual Report on Form 10-K.\nSummarized Balance Sheets (in millions)\nDecember 31,\n2024\n2023\n (2)\nCurrent assets\n$\n2,321 \n$\n2,167 \nNoncurrent assets\n5,722 \n5,699 \nCurrent liabilities \n(1)\n1,206 \n925 \nNoncurrent liabilities\n4,163 \n4,031 \n(1)\nCurrent liabilities for guarantor subsidiaries included $219 million of short term notes payable to non-guarantor subsidiaries as of December 31, 2024.\n(2)\nInformation reflects the current Obligor Group listed in Exhibit 22.1 in Part IV, Item 15 of this Annual Report on Form 10-K.",
  "item2": null
}