{
  "item1": "18% total inventory purchases made euros pounds sterling, respectively, 2024. expanding distribution private label products, which include Optimal, ERA MPM Oils. salvage operations, purchase severely damaged total loss vehicles insurance companies auctions, which transferred dismantling facilities sold other third party dismantlers. primarily operate two-step (i.e., direct sales repair shop customers) distribution model Europe, although certain businesses located Italy, Netherlands, Germany, Switzerland, Hungary operate partially three-step (i.e., sales distributors who turn sell repair shop customers) distribution model.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS global distributor vehicle products, including replacement parts, components systems used repair maintenance vehicles, specialty aftermarket products accessories improve performance, functionality appearance vehicles. Buyers vehicle replacement products option purchase primarily five sources: new products produced OEMs; new products produced companies other than OEMs, which referred aftermarket products; recycled products obtained salvage total loss vehicles; recycled products been refurbished; recycled products been remanufactured. distribute variety products collision mechanical repair shops, including aftermarket collision mechanical products; recycled collision mechanical products; refurbished collision products such wheels, bumper covers lights; remanufactured engines transmissions.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations Forward-Looking Statements Forward-looking statements include, but not limited to, statements regarding outlook, guidance, expectations, beliefs, hopes, intentions strategies. Words such \"may,\" \"will,\" \"plan,\" \"should,\" \"expect,\" \"anticipate,\" \"believe,\" \"if,\" \"estimate,\" \"intend,\" \"project\" similar words expressions used identify these forward-looking statements. These statements subject number risks, uncertainties, assumptions other factors may cause actual results, performance achievements materially different."
}