{
  "source_file": "lmt-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to help the reader understand our results of operations and financial condition. The MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and notes to consolidated financial statements herein and with our Annual Report on Form 10-K for the year ended December 31, 2024 (2024 Form 10-K). \nBUSINESS OVERVIEW\nWe are a global aerospace and defense company principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products and services. We also provide a broad range of management, engineering, technical, scientific, logistics, system integration and cybersecurity services. Our main areas of focus are in defense, space, intelligence, homeland security and information technology, including cybersecurity. We serve both U.S. and international customers with products and services that have defense, civil and commercial applications, with our principal customers being agencies of the U.S. Government. During the nine months ended September 28, 2025, 72% of our $54.7 billion in sales were from the U.S. Government, either as a prime contractor or as a subcontractor (including 63% from U.S. Department of War (DoW), also known as the Department of Defense under 10 U.S.C. § 111(a)), and 28% were from international customers (including foreign military sales (FMS) contracted through the U.S. Government).\nGlobal Security\nWe operate in a complex and evolving global security environment. Conflicts or tensions in areas such as Europe, the Middle East, and the Pacific region have heightened tensions and highlighted security requirements globally, including in these regions as well as the U.S. Although these tensions and conflicts may drive interest in specific products or services as countries seek to improve their security posture, our business primarily operates on a long-cycle basis. As a result, the U.S. Government has been broadly focused on increasing industry capacity to meet long-term demand. We continue to work with the U.S. Government, international partners, and our supply chain to increase capacity and enhance our ability to scale our operations to anticipate potential demand, deliver critical capabilities, and replenish depleted U.S. and allied stockpiles of products that have been consumed over the past several years. \nGlobal Economic and Geopolitical Environment\nOur business and financial performance are impacted by general economic conditions including inflationary pressures, delays and disruptions in supply chains, business slowdowns or shutdowns, workforce challenges and labor shortfalls, impacts from technological change, and market volatility. These macroeconomic factors have contributed, and may continue to contribute, to increased costs, delays, disruptions and other performance challenges, as well as competing demands for limited resources to address such increased costs and other challenges, for our company, our suppliers and partners, and our customers.\nWe have experienced, and continue to experience, supply chain challenges, including supplier shortages and performance issues. While on-time deliveries are improving, pressures remain in certain areas, and we are proactively working with our suppliers to meet our contract commitments. In addition, macroeconomic conditions including elevated levels of inflation present risks for us, our suppliers and the stability of the broader defense industrial base. Supply chain challenges, including both the availability and cost of goods, may be further impacted due to the imposition of tariffs and the availability of raw materials including rare earth minerals, as discussed below under “Recent Developments in Trade and Regulatory Policies.” If we experience significant supply chain issues or high rates of inflation, and are unable to successfully mitigate the impact, our future profits, margins and cash flows, particularly for existing fixed-price contracts, may be adversely affected. We remain committed to our ongoing efforts to increase the efficiency of our operations and improve the cost competitiveness and affordability of our products and services, which may, in part, offset cost increases from inflation.\nFor additional risks to the company related to the supply chain and availability of materials, see Part I, Item 1A, “Risk Factors” of our 2024 Form 10-K.\n29\nTable of \nContents\nRecent Developments in Trade and Regulatory Policies\nCertain materials and component parts that go into making our products are imported into the U.S. and are subject to tariffs, sanctions, embargoes, export and import controls, and other trade restrictions. The U.S. Government has increased, expanded, or imposed new tariffs on goods imported from various countries. We also export certain products to other countries, and several countries have increased or imposed additional tariffs in response to U.S. tariffs. The tariff environment has been dynamic in 2025, with changes occurring on an ongoing basis, and it is possible that additional developments will occur in the future, including as a result of negotiations between the U.S. and trade partners and legal challenges to the tariffs.\nThe actual impact of the tariffs is subject to a number of factors including the effective date and duration of such tariffs, changes in the amount, scope and nature of the tariffs, any countermeasures that the target countries may take, the result of negotiations between the U.S. and trade partners, how our Tier 1 and Tier 2 suppliers react, possible substitution effects, possible duty-free entry entitlements, the outcome of any legal challenges, and any mitigating actions that may become available. Tariffs that have been enacted or expanded by the U.S. or other countries had an impact of approximately $350 million on our cash flows for the nine months ended September 28, 2025. However, we expect a substantial portion of this impact to be recoverable over time. We are closely monitoring the situation and evaluating the potential future impacts of the imposition of the announced tariffs to our business and financial condition. At this time, excluding the near-term cash flow impact, we do not believe that the tariffs announced by the U.S. or actions taken in response to these tariffs by other countries will have a material adverse effect upon our results of operation or financial condition over the long term.\nSignificant changes in tax, trade, or other policies either in the U.S. or other countries, as well as any fluctuation in foreign exchange rates as a result of such activity, could materially increase our tax burden, the price we pay for materials and component parts, the price our customers pay, and result in delays in products received or non-delivery from our vendors as well as impact the availability of materials (including rare earth minerals), which could materially impact our business and financial results. We are pursuing available options to fully or substantially mitigate the impact of the increased tariffs or any future tariffs, including seeking exclusions, through drawbacks, refunds, recovering the costs in the pricing of our products, securing alternative sources of materials or products, or, in certain cases, qualifying for duty-free treatment. However, these actions may not be successful in fully or substantially mitigating the impact of tariffs, and, even if successful, there could continue to be a near-term volatility in cash flows due to the timing of when tariffs are paid compared to when such costs may be refunded or recovered.\nIn addition, recent government actions relating to rare earth minerals that are used in certain of our products, including U.S. Government sourcing prohibitions on the import of such minerals and the imposition of export controls on such minerals by China, have raised concerns about supply availability. We are monitoring the rare earth minerals supply chain and maintaining active engagement with our suppliers as the regulatory landscape evolves. The rare earth supply chain continues to be vulnerable to disruption due to increasing scarcity and constrained capacity, and we are developing and executing mitigation plans designed to safeguard supply and meet future delivery commitments. We believe we will continue to meet our 2025 production and delivery commitments. However, if we are unable to successfully mitigate disruptions to the availability of rare earth minerals, our future profits, margins and cash flows may be adversely affected.\nLastly, the President has issued multiple Executive Orders, including two that are intended to (i) simplify and accelerate the procurement process through an overhaul of the Federal Acquisition Regulation (FAR), and its supplements and (ii) modernize the defense acquisition process by promoting commercial solutions, use of innovative acquisition authorities, and other existing streamlined processes. As the modernization of the FAR progresses, we continue to monitor any changes to the Defense Acquisition Regulation Supplement. Among the actions directed by the President is a review of major defense acquisition programs that are more than 15% behind schedule or over budget, or not aligned with the Administration’s priorities, including identifying programs for potential cancellation. While the full impact of these reforms on our business is uncertain, we are adapting to meet the changes in the Government buying behaviors. We continue to monitor and assess their effects on our business and financial results. As the U.S. Government continues to review defense programs in which we provide products and/or services, and if this review leads to a full or partial cancellation of one or more of these programs, this could have an adverse effect on our business, financial condition, results of operations and cash flows.\nFor additional risks to the company related to the geopolitical and economic environment, see Part I, Item 1A, “Risk Factors” of our 2024 Form 10-K.\nU.S. Government Budget Environment\nOur primary customer is the U.S. Government, from which we derived 72% of our sales during the nine months ended September 28, 2025, including 63% from the DoW. Funding for U.S. Government programs is subject to a variety \n30\nTable of \nContents\nof factors that can affect our business, including the administration’s budget requests and procurement priorities and policies, annual congressional budget authorization and appropriation processes, and other U.S. Government domestic and international priorities. U.S. Government spending levels, particularly defense spending, and timely funding thereof can affect our financial performance over the short and long term.\nThe Administration published its Fiscal Year (FY) 2026 budget request in June 2025. The budget request includes $848.3 billion in the base budget (discretionary) funding, and $113.3 billion in reconciliation (mandatory) funding. The One Big Beautiful Bill Act was signed by the President on July 4, 2025. The bill provides more than $150 billion in mandatory funding (inclusive of the $113.3 billion reconciliation funding) for the DoW available until September 30, 2029. \nThe start of the new fiscal year began October 1, 2025, without the passage of Appropriation Acts or a Continuing Resolution (CR) and the Government began its shutdown procedures, to include furloughing government civilian employees. It is unclear at this time when either a CR or Appropriations Act will be enacted. Federal agencies, including DoW, have published guidance for identifying those missions and functions that may continue to be carried out in the absence of available appropriations. The DoW published “Contingency Plan Guidance for Continuation of Operations in the Absence of Available Appropriations” stated the Department’s priorities include: Operations to secure the U.S. Southern Border, Middle East Operations, Golden Dome for America, Depot Maintenance, Shipbuilding, and Critical Munitions. We are closely monitoring the known and potential impact and if the shutdown extends for a prolonged period of time, we expect our cash flows to be negatively impacted. \nWith respect to the Appropriations Acts, the House Appropriations Subcommittee on Defense (HAC-D) released its FY 2026 congressional marks using the FY 2025 enacted amounts as its baseline on June 12, 2025. The bill recommends $831.5 billion in discretionary funding for the DoW. The Senate Armed Services Committee marked up its version of the FY 2026 National Defense Authorization Act (FY 2026 NDAA) on July 10, 2025 and included a topline increase of $32.1 billion. The House Armed Services Committee (HASC) also completed their markup of the FY 2026 NDAA on July 15, 2025 and held at the topline of the FY 2026 President’s budget request. \nWe anticipate the federal budget, additional potential tax law changes, and regulatory environment will continue to be subject to debate and compromise shaped by, among other things, the new Administration and Congress, heightened political tensions, the global security environment, inflationary pressures, and macroeconomic conditions. The result may be shifting funding priorities, which could have material impacts on defense spending broadly and our programs. Additionally, the administration continues to take steps to evaluate government-wide and defense-specific staffing and procurement, which includes assessing mission priorities, procurement methods, program performance, and other factors and then potentially taking action based on those assessments. Those actions remain uncertain and could result in impacts to both our current and future business prospects and financial performance.\nSee also the discussion of U.S. Government funding risks, in Part I, Item 1A, “Risk Factors” of our 2024 Form 10-K.\n31\nTable of \nContents\nCONSOLIDATED RESULTS OF OPERATIONS\nOur operating cycle is primarily long-term and involves many types of contracts for the design, development and manufacture, integration, and sustainment of products and related activities with varying delivery schedules. Additionally, we close our books and records on the last Sunday of each month, except for the month of December, as our fiscal year ends on December 31, to align our financial closing with our business processes. Because of this, the number of weeks in a reporting quarter may vary slightly during the year and for comparable prior year periods. Consequently, the results of operations of a particular year, or year-to-year comparisons of sales and profits, may not be indicative of future operating results. The following discussions of comparative results should be reviewed in this context. All per share amounts cited in these discussions are presented on a “per diluted share” basis, unless otherwise noted. \nOur consolidated results of operations were as follows (in millions, except per share data): \n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\n$\n18,609\n \n$\n17,104 \n$\n54,727\n \n$\n52,421 \nOperating costs and expenses\n(16,369)\n(14,987)\n(49,430)\n(46,181)\nGross profit\n2,240\n \n2,117 \n5,297\n \n6,240 \nOther income, net\n40\n \n23 \n103\n \n77 \nOperating profit\n2,280\n \n2,140 \n5,400\n \n6,317 \nInterest expense\n(286)\n(256)\n(828)\n(772)\nNon-service FAS pension (expense) income\n(99)\n16 \n(296)\n47 \nOther non-operating income, net\n43\n \n18 \n115\n \n109 \nEarnings before income taxes\n1,938\n \n1,918 \n4,391\n \n5,701 \nIncome tax expense\n(319)\n(295)\n(718)\n(892)\nNet earnings\n$\n1,619\n \n$\n1,623 \n$\n3,673\n \n$\n4,809 \nDiluted earnings per common share\n$\n6.95\n \n$\n6.80 \n$\n15.69\n \n$\n20.05 \nCertain amounts reported in other income, net, including our share of earnings or losses from equity method investees, are included in the operating profit of our business segments. Accordingly, such amounts are included in the discussion of our business segment results of operations. \nSales\nSubstantially all of our contracts are accounted for using the percentage-of-completion cost-to-cost method. Under the percentage-of-completion cost-to-cost method, we record sales on contracts over time based upon our progress towards completion on a particular contract, as well as our estimate of the profit to be earned at completion. The following discussion of material changes in our consolidated sales should be read in tandem with the subsequent discussion of changes in our consolidated operating costs and expenses and our business segment results of operations because changes in our sales are typically accompanied by a corresponding change in our operating costs and expenses due to the nature of the percentage-of-completion cost-to-cost method.\n32\nTable of \nContents\nWe generate sales from the delivery of products and services to our customers. Our consolidated sales were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nProducts\n$\n15,311\n \n$\n14,472 \n$\n45,396\n \n$\n43,777 \n% of total sales\n82.3\n%\n84.6\n%\n82.9\n%\n83.5\n%\nServices\n3,298\n \n2,632 \n9,331\n \n8,644 \n% of total sales\n17.7\n%\n15.4\n%\n17.1\n%\n16.5\n%\nTotal sales\n$\n18,609\n \n$\n17,104 \n$\n54,727\n \n$\n52,421 \nProduct Sales\nProduct sales increased $839 million, or 6%, during the quarter ended September 28, 2025, compared to the same period in 2024. Higher product sales of approximately $445 million at MFC, $255 million at Aeronautics and $180 million at Space. Higher product sales at MFC were due to production ramp-up on PAC-3, Joint Air-to-Surface Standoff Missile (JASSM) and Long Range Anti-Ship Missile (LRASM) programs. Higher product sales at Aeronautics were due to higher volume on F-35 production contracts and the delays in receiving additional contractual authorization and funding under the Lots 18-19 contract in the third quarter of 2024, partially offset by lower volume on classified contracts. Higher product sales at Space were due to higher volume on Fleet Ballistic Missile (FBM), Orion and Next Generation Interceptor (NGI) programs.\nProduct sales increased $1.6 billion, or 4%, during the nine months ended September 28, 2025, compared to the same period in 2024. The increase was primarily attributable to higher product sales of approximately $1.1 billion at MFC and $400 million at Aeronautics. Higher product sales at MFC were due to production ramp-up on JASSM, LRASM, precision fires and PAC-3 programs. Higher product sales at Aeronautics were due to higher volume on F-35 production contracts and the delays in the third quarter of 2024 as described above, partially offset by the unfavorable cumulative adjustment to sales driven by recognizing a loss on a classified contract in the second quarter of 2025.\nService Sales\nService sales increased $666 million, or 25%, during the quarter ended September 28, 2025, compared to the same period in 2024 due to higher service sales of approximately $510 million at Aeronautics as a result of higher volume on F-35 sustainment contracts. \nService sales increased $687 million, or 8%, during the nine months ended September 28, 2025, compared to the same period in 2024 due to higher service sales of approximately $725 million at Aeronautics as a result of higher volume on F-35 sustainment contracts.\n33\nTable of \nContents\nOperating Costs and Expenses\nOperating costs and expenses, for both products and services, consist of materials, labor, subcontracting costs and an allocation of indirect costs (overhead and general and administrative), as well as the costs to fulfill our industrial cooperation agreements, sometimes referred to as offset agreements, required under certain contracts with international customers. For each of our contracts, we monitor the nature and amount of costs at the contract level, which form the basis for estimating our total costs to complete the contract. \nOur consolidated operating costs and expenses were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nOperating costs and expenses – products\n$\n(13,708)\n$\n(12,964)\n$\n(41,461)\n$\n(39,368)\n% of product sales\n89.5\n%\n89.6\n%\n91.3\n%\n89.9\n%\nOperating costs and expenses – services\n(2,871)\n(2,272)\n(8,641)\n(7,457)\n% of service sales\n87.1\n%\n86.3\n%\n92.6\n%\n86.3\n%\nImpairment and other charges\n—\n \n— \n(66)\n(87)\nOther unallocated, net\n210\n \n249 \n738\n \n731 \nTotal operating costs and expenses\n$\n(16,369)\n$\n(14,987)\n$\n(49,430)\n$\n(46,181)\nThe following discussion of material changes in our consolidated operating costs and expenses for products and services should be read in tandem with the preceding discussion of changes in our consolidated sales and our business segment results of operations. Except for potential impacts to our programs resulting from supply chain disruptions, inflation, and tariffs, we have not identified any additional developing trends in operating costs and expenses for products and services that could have a material impact on our future operations.\nProduct Costs\nProduct costs increased $744 million, or 6%, during the quarter ended September 28, 2025, compared to the same period in 2024. The increase was primarily attributable to higher product costs of approximately $395 million at MFC, $260 million at Aeronautics and $130 million at Space. Higher product costs at MFC, Aeronautics and Space were due to production ramp-up and higher volume as described above in “Product Sales”.\nProduct costs increased $2.1 billion, or 5%, during the nine months ended September 28, 2025, compared to the same period in 2024. The increase was primarily attributable to higher product costs of approximately $1.3 billion at Aeronautics and $880 million at MFC. Higher product costs at Aeronautics were due to higher volume and the impact of recognizing a loss on a classified contract as described above in “Product Sales”. Higher product costs at MFC were due to production ramp-up as described above in “Product Sales”.\nService Costs\nService costs increased $599 million, or 26%, during the quarter ended September 28, 2025, compared to the same period in 2024 primarily attributable to higher service costs of approximately $475 million at Aeronautics driven by higher volume as described above in “Service Sales”.\nService costs increased $1.2 billion, or 16%, during the nine months ended September 28, 2025, compared to the same period in 2024. The increase was primarily attributable to higher service costs of approximately $640 million at Aeronautics and $430 million at RMS. Higher service costs at Aeronautics were due to higher volume as described above in “Service Sales”. Higher service costs at RMS were due to the impact of recognizing a loss on CMHP as previously described.\n34\nTable of \nContents\nImpairment and Other Charges\nWe recorded charges totaling $66 million ($52 million, or $0.22 per share, after-tax) during the quarter ended June 29, 2025 and \n$87 million ($69 million, or $0.29 per share, after-tax) during the same period \nin 2024.\n \nSee “Note 10 - Other” included in our Notes to Consolidated Financial Statements for additional information. \nOther Unallocated, Net\nOther unallocated, net primarily includes the FAS/CAS pension operating adjustment (which represents the difference between total CAS pension cost recorded in our business segments’ results of operations and the service cost component of FAS pension (expense) income), stock-based compensation expense, changes in the fair value of assets and liabilities for deferred compensation plans, intangible asset amortization expense and other corporate costs. These items are not allocated to the business segments and, therefore, are not allocated to operating costs and expenses for products or services. Other unallocated, net reduced operating expenses by $210 million and $738 million during the quarter and nine months ended September 28, 2025, compared to $249 million and $731 million during the quarter and nine months ended September 29, 2024. The fluctuations in other unallocated, net for all periods were due to costs associated with various corporate items, none of which were individually significant.\nOther Income, Net\nOther income, net was $40 million and $103 million during the quarter and nine months ended September 28, 2025. Other income, net was $23 million and $77 million during the quarter and nine months ended September 29, 2024. Other income, net, primarily includes earnings generated by equity method investees, as well as gains or losses for acquisitions, divestitures, and other items, none of which are individually significant. The increase in other income, net during the quarter and nine months ended September 28, 2025 resulted primarily from an intellectual property license arrangement and the Commercial Engine Solutions divestiture net working capital true-up.\nInterest Expense\nInterest expense was $286 million and $828 million during the quarter and nine months ended September 28, 2025, compared to $256 million and $772 million during the quarter and nine months ended September 29, 2024. The increase in interest expense in 2025 resulted primarily from a higher intra-period outstanding balance of commercial paper and issuance of senior unsecured notes in July 2025 and December 2024.\nNon-service FAS Pension (Expense) Income\nNon-service FAS pension expense was $99 million and $296 million during the quarter and nine months ended September 28, 2025, compared to non-service FAS pension income of $16 million and $47 million during the quarter and nine months ended September 29, 2024. The increase in expense was primarily due to higher prior service cost amortization and a reduced asset base as detailed in “Note 6 - Postretirement Benefit Plans” included in our Notes to Consolidated Financial Statements.\nOther Non-operating Income, net\nOther non-operating income, net primarily includes gains or losses related to adjustments in valuation of early-stage company investments or gains or losses upon the sale of these investments and interest income earned on cash and cash equivalents. Other non-operating income, net was $43 million and $115 million during the quarter and nine months ended September 28, 2025, compared to $18 million and $109 million during the quarter and nine months ended September 29, 2024. See “Note 8 - Fair Value Measurements” included in our Notes to Consolidated Financial Statements for additional information.\nIncome Tax Expense\nOur effective income tax rates were 16.5% and 16.4% for the quarter and nine months ended September 28, 2025 and 15.4% and 15.6% for the quarter and nine months ended September 29, 2024. The higher effective income tax rates for the quarter and nine months ended September 28, 2025 were attributable to the One Big Beautiful Bill Act (the Tax Act) primarily driven by lower tax deductions for foreign derived intangible income partially offset by the favorable resolution of certain federal income tax audit items with the Internal Revenue Service (IRS). The rates for all periods benefited from \n35\nTable of \nContents\nresearch and development tax credits, dividends paid to our defined contribution plans with an employee stock ownership plan feature, tax deductions for foreign derived intangible income and employee equity awards. \nChanges in U.S. (federal or state) or foreign tax laws and regulations, or their interpretation and application (including those with retroactive effect), could significantly impact our provision for income taxes, the amount of taxes payable, our deferred tax asset and liability balances, and stockholders’ equity. In addition to future changes in tax laws, the amount of net deferred tax assets will change periodically based on several factors, including the measurement of our postretirement benefit plan obligations, actual cash contributions to our postretirement benefit plans and the change in the amount or reevaluation of uncertain tax positions.\nAs a result of an IRS tax audit related to our adoption of Accounting Standards Codification (ASC) 606 for certain manufacturing contracts and the associated changes to the income recognition rules enacted in the 2017 Tax Cuts and Jobs Act, the IRS has proposed adjustments that could result in significant additional federal income tax. We are in ongoing discussions with the IRS in an effort to resolve the matter. See “Note 10 - Other” included in our Notes to Consolidated Financial Statements for additional information.\nWe are regularly under audit or examination by tax authorities, including U.S. and foreign tax authorities (Australia, Canada, India, Italy, Japan, Poland, the United Kingdom, and other countries). The final resolution of tax audits and any related administrative reviews or litigation could result in unanticipated increases in our tax expense and changes to the timing of required tax payments, which could affect profitability and cash flows for any particular reporting period. These increases or changes could have a material impact on financial condition and results of operations in such period.\nThe Organisation for Economic Co-operation and Development (OECD) has established a framework for a global minimum corporate tax of 15%, known as Pillar 2, which will be applied on a country-by-country basis to companies with global revenues and profits above certain thresholds. The implementation of Pillar 2 is phased, with certain aspects effective on January 1, 2024, and others on January 1, 2025. Although the United States has not enacted legislation to adopt Pillar 2, and its future adoption is uncertain, several countries where we operate have enacted such legislation, and others are in the process of doing so. We do not expect Pillar 2 to have a material impact on our effective tax rate or our financial condition and results of operations.\nNet Earnings\nWe reported net earnings of $1.6 billion ($6.95 per share) and $3.7 billion ($15.69 per share) during the quarter and nine months ended September 28, 2025 and $1.6 billion ($6.80 per share) and $4.8 billion ($20.05 per share) during the quarter and nine months ended September 29, 2024. Net earnings and earnings per share for the quarter and nine months ended September 28, 2025 were affected by the factors mentioned above. Earnings per share also benefited from a net decrease of approximately 5.8 million weighted average common shares outstanding during both the quarter and nine months ended September 28, 2025, compared to the same periods in 2024. The reduction in weighted average common shares was a result of share repurchases, partially offset by share issuances under our stock-based awards and certain defined contribution plans.\nBUSINESS SEGMENT RESULTS OF OPERATIONS\nOur operations are organized into four business segments, which also comprise our reportable segments: Aeronautics, Missiles and Fire Control (MFC), Rotary and Mission Systems (RMS) and Space. We generally organize our business segments based on the nature of products and services offered.\nBusiness segment operating profit excludes the FAS/CAS pension operating adjustment detailed below, a portion of corporate costs not considered allowable or allocable to contracts with the U.S. Government under the applicable U.S. Government Cost Accounting Standards (CAS) or federal acquisition regulations (FAR), and other items not considered part of management’s evaluation of segment operating performance. See “Note 3 - Information on Business Segments – Unallocated Items” included in our Notes to Consolidated Financial Statements for additional information. \n36\nTable of \nContents\nSales and operating profit for each of our business segments were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\nAeronautics\n$\n7,256\n \n$\n6,487 \n$\n21,733\n \n$\n20,609 \nMissiles and Fire Control\n3,624\n \n3,175 \n10,430\n \n9,270 \nRotary and Mission Systems\n4,373\n \n4,367 \n12,696\n \n13,003 \nSpace \n3,356\n \n3,075 \n9,868\n \n9,539 \nTotal sales\n$\n18,609\n \n$\n17,104 \n$\n54,727\n \n$\n52,421 \nOperating profit \nAeronautics\n$\n682\n \n$\n659 \n$\n1,304\n \n$\n2,089 \nMissiles and Fire Control\n510\n \n456 \n1,454\n \n1,217 \nRotary and Mission Systems \n506\n \n483 \n855\n \n1,408 \nSpace \n331\n \n272 \n1,072\n \n943 \nTotal business segment operating profit\n2,029\n \n1,870 \n4,685\n \n5,657 \nUnallocated items\nFAS/CAS pension operating adjustment\n380\n \n406 \n1,138\n \n1,218 \nImpairment and other charges \n(a)\n—\n \n— \n(66)\n(87)\nIntangible asset amortization expense\n(70)\n(61)\n(197)\n(183)\nOther, net \n(59)\n(75)\n(160)\n(288)\nTotal unallocated items\n251\n \n270 \n715\n \n660 \nTotal consolidated operating profit\n$\n2,280\n \n$\n2,140 \n$\n5,400\n \n$\n6,317 \n(a)\nSee “Note 10 - Other” included in our Notes to Consolidated Financial Statements for additional information.\nThe total FAS/CAS pension adjustments, including the service and non-service cost components of FAS pension (expense) income for our qualified defined benefit pension plans, were as follows (in millions):\nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nTotal FAS (expense) income and CAS cost\nFAS pension (expense) income\n$\n(111)\n$\n1 \n$\n(334)\n$\n2 \nLess: CAS pension cost\n392\n \n421 \n1,176\n \n1,263 \nTotal FAS/CAS pension adjustment\n$\n281\n \n$\n422 \n$\n842\n \n$\n1,265 \nService and non-service cost reconciliation\nFAS pension service cost\n$\n(12)\n$\n(15)\n$\n(38)\n$\n(45)\nLess: CAS pension cost\n392\n \n421 \n1,176\n \n1,263 \nTotal FAS/CAS pension operating adjustment\n380\n \n406 \n1,138\n \n1,218 \nNon-service FAS pension (expense) income\n(99)\n16 \n(296)\n47 \nTotal FAS/CAS pension adjustment\n$\n281\n \n$\n422 \n$\n842\n \n$\n1,265 \nManagement evaluates performance on our contracts by focusing on sales and operating profit and not by type or amount of operating expense. Consequently, our discussion of business segment performance focuses on sales and operating profit, consistent with our approach for managing the business. This approach is consistent throughout the life cycle of our contracts, as management assesses the bidding of each contract by focusing on sales and operating profit and monitors performance on our contracts in a similar manner through their completion. This method and assumptions used to evaluate contracts and recognize revenue, including the use of percentage-of-completion accounting for contracts with continuous transfer of control to the customer, are consistent with those described in our 2024 Form 10-K under \n37\nTable of \nContents\n“Management’s Discussion and Analysis of Financial Condition and Results of Operations”. Additionally, for updates related to fixed-price contracts, see “Note 10 - Other” included in our Notes to Consolidated Financial Statements.\nChanges in sales and operating profit generally are expressed in terms of volume, contract mix, and/or performance (referred to as profit booking rate adjustments). Changes in volume refer to increases or decreases in sales or operating profit resulting from varying production activity levels, deliveries or service levels on individual contracts. Volume changes in segment operating profit are typically based on the current profit booking rate for a particular contract. Contract mix primarily refers to changes in the ratio of contract type or life cycle (e.g., cost-type, fixed-price, development, production and/or sustainment) and other cost recoveries.\nComparability of our segment sales, operating profit and operating margin may be impacted favorably or unfavorably by changes in profit booking rates on our contracts. \nThe following table presents the effect of our consolidated net profit booking rate adjustments on segment operating profit (loss) (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nAeronautics\n$\n60\n \n$\n105 \n$\n(560)\n$\n315 \nMissiles and Fire Control\n130\n \n135 \n390\n \n285 \nRotary and Mission Systems\n105\n \n110 \n(360)\n210 \nSpace\n70\n \n25 \n330\n \n180 \nTotal net adjustments to segment operating \n    profit\n$\n365\n \n$\n375 \n$\n(200)\n$\n990 \nDuring the nine months ended September 28, 2025, we recorded losses of $950 million on an ongoing classified program at our Aeronautics business segment, $570 million on Canadian Maritime Helicopter Program (CMHP) and $95 million on Türkish Utility Helicopter Program (TUHP) at our RMS business segment, and $105 million of unfavorable profit adjustments on C-130 programs at our Aeronautics business segment. In addition to these losses and unfavorable profit adjustments, we also recorded $130 million of favorable adjustments upon completion on certain commercial civil space programs at Space, and $80 million favorable adjustments upon completion of a classified program at Aeronautics. During the nine months ended September 29, 2024, we recognized reach-forward losses of $145 million on the same ongoing classified program at our Aeronautics business segment ($80 million was recognized during the quarter ended September 29, 2024) and of $100 million on a classified program at our MFC business segment.\nWith respect to the classified program at our Aeronautics business segment, we continue to monitor this program, and we may need to record additional losses in future periods if we experience further performance issues, increases in scope, or increases in costs from prior estimates. Our estimates may change, in particular, as we conduct further development and testing on the program, which may lead to new findings or cause us to modify our expectations or understanding of the risks inherent in the program. Similarly, we may need to record additional losses in future periods for the programs at our MFC and RMS business segments referenced above. Any such losses could be material to our financial results in any period that they are recognized. For further discussion regarding the losses recognized on these programs, see ““Note 10 - Other” included in our Notes to Consolidated Financial Statements.\nAeronautics\nSummary\n operating results for our Aeronautics business segment were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\n$\n7,256\n \n$\n6,487 \n$\n21,733\n \n$\n20,609 \nOperating profit\n682\n \n659 \n1,304\n \n2,089 \nOperating margin\n9.4\n%\n10.2\n%\n6.0\n%\n10.1\n%\nAeronautics’ sales during the \nquarter ended September 28, 2025\n \nincreased\n \n$769 million\n, or \n12%\n, compared to the same period in \n2024\n. \nThis increase was primarily attributable to higher sales of $965 million on the F-35 program due to \n38\nTable of \nContents\nhigher volume on production and sustainment contracts and the delays in receiving additional contractual authorization and funding under the Lots 18-19 contract in the third quarter of 2024. This increase was partially offset by lower sales of $140 million on classified contracts due to lower volume.\n \nAeronautics’ operating profit during the quarter ended September 28, 2025 increased \n$23 million\n, or \n3%\n, compared to the same period in 2024. This increase was attributable to a $70 million increase from higher volume, as described above, partially offset by a $45 million decrease in profit booking rate adjustments. The decrease in profit booking rate adjustments was primarily due to $40 million of unfavorable profit adjustments on C-130 programs. In addition, profit booking rate adjustments from 2024 that did not recur include a favorable profit rate adjustments of $85 million for a claim associated with a C-5 Galaxy contract and an unfavorable profit rate adjustment of $80 million on a classified program.\nAeronautics’ sales during the nine months ended September 28, 2025 increased $1.1 billion, or 5%, compared to the same period in 2024. This increase was primarily attributable to higher sales of $1.6 billion on the F-35 program due to higher volume on production and sustainment contracts and the delays in receiving additional contractual authorization and funding under the Lots 18-19 contract in the third quarter of 2024. This increase was partially offset by a decrease of $515 million on classified programs due to an unfavorable cumulative adjustment to sales driven by the loss on a classified contract recorded in the second quarter of 2025 and lower volume.\nAeronautics’ operating profit during the nine months ended September 28, 2025 decreased $785 million, or 38%, compared to the same period in 2024. The decrease was attributable to $875 million of lower profit rate adjustments partially offset by $175 million of higher volume as described above. The lower profit rate adjustments were primarily driven by a net impact of $805 million of reach-forward losses recognized on a classified contract ($950 million recognized in 2025 and $145 million recognized in 2024), partially offset by $105 million of unfavorable profit adjustments on C-130 programs, in addition to the items mentioned above.\nMissiles and Fire Control\nSummary operating results for our MFC business segment were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\n$\n3,624\n \n$\n3,175 \n$\n10,430\n \n$\n9,270 \nOperating profit\n510\n \n456 \n1,454\n \n1,217 \nOperating margin\n14.1\n%\n14.4\n%\n13.9\n%\n13.1\n%\nMFC’s sales during the quarter ended September 28, 2025 increased $449 million, or 14%, compared to the same period in 2024.\n \nThis increase was primarily attributable to higher sales of $280 million on tactical and\nstrike missile programs due to production ramp-up on JASSM, LRASM and precision fires programs; and $235 million for integrated air and missile defense programs primarily due to production ramp-up on PAC-3.\nMFC’s operating profit during the quarter ended September 28, 2025 increased $54 million, or 12%, compared to the same period in 2024. \nThis increase was primarily attributable to a $45 million increase from production ramp-up as described above.\nMFC’s sales during the nine months ended September 28, 2025 increased \n$1.2 billion\n, or 13%, compared to the same period in 2024. \nThis increase was primarily attributable to higher sales of $980 million on tactical and strike missile programs due to production ramp-up on JASSM, LRASM and precision fires programs; and $270 million for integrated air and missile defense programs due to production ramp-up on PAC-3.\nMFC’s operating profit during the nine months ended September 28, 2025 increased $237 million, or 19%, compared to the same period in 2024. This increase was attributable to two primary factors: a $105 million increase in profit booking rate adjustments and a $105 million volume increase driven by production ramp-up as described above. The increase in profit booking rate adjustments was primarily due to a $100 million loss recognized on a classified program in 2024 that did not recur and an unfavorable profit adjustment on Hellfire in the first quarter of 2024 that did not recur, partially offset by lower favorable profit adjustments on PAC-3 in 2025.\n39\nTable of \nContents\nRotary and Mission Systems\nSummary operating results for our RMS business segment were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\n$\n4,373\n \n$\n4,367 \n$\n12,696\n \n$\n13,003 \nOperating profit\n506\n \n483 \n855\n \n1,408 \nOperating margin\n11.6\n%\n11.1\n%\n6.7\n%\n10.8\n%\nRMS’ sales during the quarter ended September 28, 2025 were comparable to the same period in 2024. Sales increased $190 million on Sikorsky helicopter programs due to higher production volume on Black Hawk programs and $40 million on various C6ISR programs due to higher volume. These increases were offset by lower sales of $155 million on integrated warfare systems and sensors (IWSS) programs due to lower volume on the Aegis and CSC programs, and $75 million for various training, logistics and simulation (TLS) programs due to lower volume. \nRMS’ operating profit during the quarter ended September 28, 2025 increased $23 million, or 5%, compared to the same period in 2024. This increase was primarily attributable to favorable contract mix at Sikorsky.\nRMS’ sales during the nine months ended September 28, 2025 decreased $307 million, or 2%, compared to the same period in 2024. The decrease was primarily attributable to lower sales of $150 million on IWSS programs due to lower volume within the laser systems portfolio and Littoral Combat Ship (LCS); $100 million for various TLS programs due to lower volume; and $50 million on Sikorsky helicopter programs primarily due to the unfavorable cumulative adjustments to sales driven by recognizing losses on CMHP and TUHP in the second quarter of 2025, as previously disclosed, and lower production volume on Seahawk programs, partially offset by higher production volume on Black Hawk programs.\nRMS’ operating profit during the nine months ended September 28, 2025 decreased $553 million, or 39%, compared to the same period in 2024. This decrease was attributable to a $570 million decrease in profit booking rate adjustments primarily due to the losses recognized on CMHP and TUHP in the second quarter of 2025, as previously disclosed, partially offset by unfavorable profit adjustments on Seahawk programs in the first quarter of 2024 that did not recur.\nSpace\nSummary operating results for our Space business segment were as follows (in millions):\n \nQuarters Ended\nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nSeptember 28,\n2025\nSeptember 29,\n2024\nSales\n$\n3,356\n \n$\n3,075 \n$\n9,868\n \n$\n9,539 \nOperating profit\n331\n \n272 \n1,072\n \n943 \nOperating margin\n9.9\n%\n8.8\n%\n10.9\n%\n9.9\n%\nSpace’s sales during the quarter ended September 28, 2025 increased $281 million, or 9%, compared to the same period in 2024. This increase was primarily attributable to higher sales of $160 million for strategic and missile defense programs due to higher volume on the FBM and NGI programs; and $70 million on national security space programs due to classified volume.\nSpace’s operating profit during the quarter ended September 28, 2025 increased $59 million, or 22%, compared to the same period in 2024. This increase was attributable to two primary factors: a $45 million increase in profit booking rate adjustments and a $20 million increase in volume, as described above. The increase in profit booking rate adjustments was primarily due to higher net favorable profit adjustments on the FBM program.\nSpace’s sales during the nine months ended September 28, 2025 increased $329 million, or 3%, compared to the same period in 2024. This increase was primarily attributable to higher sales of $250 million for strategic and missile defense programs due to higher volume on the NGI and FBM programs; and $225 million for commercial civil space \n40\nTable of \nContents\nprograms primarily due to higher volume on the Orion program. These increases were partially offset by a decrease of $180 million on national security space programs due to program lifecycle on Next Gen OPIR system.\nSpace’s operating profit during the nine months ended September 28, 2025 increased $129 million, or 14%, compared to the same period in 2024. This increase was attributable to an $150 million increase in profit booking rate adjustments partially offset by $20 million of lower equity earnings driven by lower launch volume from our investment in United Launch Alliance (ULA). The increase in profit booking rate adjustments was primarily due to favorable performance at completion on certain commercial civil space programs.\nTotal equity earnings (ULA) represented approximately $5 million, or 2%, and $10 million, or 1%, of Space's operating profit during the quarter and nine months ended September 28, 2025, compared to\n approximately $5 million, or 2%, and $30 million, or 3% for the same periods in 2024.\nFINANCIAL CONDITION\nLiquidity and Capital Resources\nAt September 28, 2025, we had cash and cash equivalents of $3.5 billion that was generally available to fund ordinary business operations without significant legal, regulatory or other restrictions. Our principal source of liquidity is our cash from operations and access to credit markets. Access to credit markets includes our $3.0 billion revolving credit facility, including the ability to issue commercial paper. The outstanding balance of commercial paper can fluctuate daily and the amount outstanding during the period may be greater or less than the amount reported at the end of the period. There were no borrowings outstanding under the revolving credit facility or the commercial paper program at both September 28, 2025 and December 31, 2024. We may, as conditions warrant, continue to issue commercial paper backed by our revolving credit facility to manage the timing of cash flows.\nCash received from customers is our primary source of cash from operations. However, from time to time, we fund customer programs ourselves pending government appropriations or prior to contract award. If we incur costs in excess of funds obligated on the contract or in advance of a contract award, this negatively affects our cash flows, and we may be at risk for reimbursement of the excess costs. In addition, when estimates of total costs to be incurred on a contract exceed total estimates of the transaction price, a provision for the entire loss is determined at the contract level and is recorded in the period in which the loss is evident, which we refer to as a reach-forward loss. These reach-forward losses do not have an immediate cash flow impact, but as future costs are incurred on these contracts, these losses will negatively impact cash flows over the remaining period of performance.\nThe start of the new fiscal year began October 1, 2025, without the passage of Appropriation Acts or a Continuing Resolution (CR) and the Government began its shutdown procedures, to include furloughing government civilian employees.  We are closely monitoring the known and potential impact and if the shutdown extends for a prolonged period of time, we expect our cash flows to be negatively impacted. See “U.S. Government Budget Environment” included within the “Business Overview” discussion above.\nAdditionally, increases in costs due to tariffs may impact our cash flows, as we may not be able to fully recover these costs, and even if recovery is possible, it may not occur in the same period as the incurred costs. See “Recent Developments in Trade and Regulatory Policies” included within the “Business Overview” discussion above.\nBilling timetables and payment terms on our contracts vary based on a number of factors, including the contract type. We generally bill and collect cash more frequently under cost-reimbursable contracts, which represented approximately 41% of the sales we recorded during the nine months ended September 28, 2025, as we are authorized to bill as the costs are incurred. A number of our fixed-price contracts may provide for performance-based payments, which allow us to bill and collect cash as we perform on the contract as we hit milestones. The amounts of performance-based payments and the related milestones are determined in the negotiation of each contract. The timing of such payments may differ from the timing of the costs incurred related to our contract performance, thereby affecting our cash flows.\nThe U.S. Government has indicated that it would consider progress payments as the baseline for negotiating payment terms on fixed-price contracts, rather than performance-based payments. In contrast to negotiated performance-based payment terms, progress payment provisions correspond to a percentage of the amount of costs incurred during the performance of the contract and are invoiced regularly as costs are incurred. Our cash flows may be affected if the U.S. Government changes its payment policies. The U.S. Government from time to time withholds payments on certain of our billings based on contract terms or regulatory provisions. Ultimately, the impact of policy changes or withholding payments may delay the receipt of cash, but the cumulative amount of cash collected during the life of the contract should not vary.\n41\nTable of \nContents\nWe seek to maintain a disciplined and dynamic cash deployment strategy to invest in our business and key technologies to provide our customers with enhanced capabilities, enhance stockholder value, and position ourselves to take advantage of new business opportunities when they arise. Consistent with that strategy, we have continued to invest in our business and technologies through capital expenditures, independent research and development, and selective business acquisitions and investments.\nWe continue to return cash to stockholders through dividends and share repurchases. In October 2025, the Board of Directors authorized a fourth quarter dividend payment of $3.45 per share, representing an increase of $0.15 per share over the prior quarterly dividend payment. The Board of Directors also authorized an increase of $2.0 billion to our share repurchase program in addition to the $7.1 billion remaining authorization under our share repurchase program as of September 28, 2025. The share repurchase program does not have an expiration date and may be amended or terminated by the Board of Directors at any time. The amount of shares ultimately purchased and the timing of purchases are at the discretion of management and subject to compliance with applicable law and regulation.\nWe continue to actively manage our debt levels, including maturities and interest rates. We seek to finance our business in a manner that preserves financial flexibility while minimizing borrowing costs to the extent practicable. We review changes in financial market and economic conditions to manage the types, amounts and maturities of our indebtedness. We may at times refinance existing indebtedness, vary our mix of variable-rate and fixed-rate debt or seek alternative financing sources or arrangements for our cash and operational needs.\nWe also actively manage our pension obligations and expect to continue to opportunistically manage our pension liabilities through the purchase of group annuity contracts or other actions for portions of our outstanding defined benefit pension obligations using assets from the pension trust. Future transactions could be significant and result in us making additional contributions to the pension trust. The required funding of our qualified defined benefit pension plans is determined in accordance with the Employee Retirement Income Security Act of 1974 (ERISA), as amended, and CAS. We could be required to make pension contributions earlier than and/or in excess of what was planned if our return on pension assets is less than our assumptions, which would reduce our free cash flow. We may also make additional contributions at our discretion.\nThe following table provides a summary of our cash flow information followed by a discussion of the key elements (in millions):\n \nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nCash and cash equivalents at beginning of year\n$\n2,483\n \n$\n1,442 \nOperating activities\nNet earnings\n3,673\n \n4,809 \nNoncash adjustments\n3,192\n \n1,490 \nChanges in working capital\n(1,553)\n(469)\nOther, net\n26\n \n119 \nNet cash provided by operating activities\n5,338\n \n5,949 \nNet cash (used for) investing activities\n(1,464)\n(954)\nNet cash (used for) financing activities\n(2,887)\n(3,286)\nNet change in cash and cash equivalents\n987\n \n1,709 \nCash and cash equivalents at end of period\n$\n3,470\n \n$\n3,151 \nOperating Activities\nNet cash provided by operating activities during the nine months ended September 28, 2025 decreased $611 million compared to the same period in 2024. The decrease in cash from operations was primarily due to an increase in working capital, primarily production and billing cycles impacting receivables across all four business segments, partially offset by lower tax payments, reflecting the impact of the Tax Act.\nNon-GAAP Financial Measure - Free Cash \nFlow\nFree cash flow is a non-GAAP financial measure that we define as cash from operations less capital expenditures. Our capital expenditures are comprised of equipment and facilities infrastructure and information technology (inclusive of \n42\nTable of \nContents\ncosts for the development or purchase of internal-use software that are capitalized). We use free cash flow to evaluate our business performance and overall liquidity, and is a performance goal in our annual and long-term incentive plans. We believe free cash flow is a useful measure for investors because it represents the amount of cash generated from operations after reinvesting in the business and that may be available to return to stockholders and creditors (through dividends, stock repurchases and debt repayments) or available to fund acquisitions and other investments. The entire amount of free cash flow is not necessarily available for discretionary expenditures, however, because it does not account for certain mandatory expenditures, such as the repayment of maturing debt and future pension contributions. While management believes that free cash flow as a non-GAAP financial measure may be useful in evaluating our financial performance and liquidity, it should be considered supplemental to, and not a substitute for, financial information prepared in accordance with GAAP and may not be comparable to similarly titled measures used by other companies.\nThe following table reconciles net cash provided by operating activities to free cash flow (in millions):\n \nNine Months Ended\nSeptember 28,\n2025\nSeptember 29,\n2024\nCash from operations\n$\n5,338\n \n$\n5,949 \nCapital expenditures\n(1,186)\n(1,103)\nFree cash flow\n$\n4,152\n \n$\n4,846 \nFree cash flow \nd\nuring the nine months ended September 28, 2025 decreased $694 million compared to the same period in 2024 primarily due to operating cash flow drivers described above and higher software expenditures.\nInvesting Activities\nNet cash used for investing activities \nduri\nng the nine months ended September 28, 2025 increased $510 million compared to the same period in 2024, primarily due to a $360 million cash payment for the acquisition of Rapid Solutions. Capital expenditures totaled $1.2 billion and $1.1 billion during the nine months ended September 28, 2025 and September 29, 2024. The majority of our capital expenditures are for equipment and facilities infrastructure that generally are incurred to support new and existing programs across all of our business segments. We also incur capital expenditures for information technology to support programs and general enterprise information technology infrastructure, inclusive of costs for the development or purchase of internal-use software.\nFinancing Activities\nNet cash used for financing activities \nduring t\nhe nine months ended September 28, 2025 decreased $399 million compared to the same period in 2024, primarily attributable to paying $2.3 billion to repurchase 5.0 million shares in 2025 compared to $2.7 billion to repurchase 5.7 million shares in 2024. See “Note 9 - Stockholders’ Equity” and “Note 10 - Other” \nincluded in our Notes to Consolidated Financial Statements for additional information regarding dividend payments, share repurchases and debt issuances.\nOTHER MATTERS\nStatus of the F-35 Program\nThe F-35 program primarily consists of production contracts, sustainment activities, and new development efforts. Production of the aircraft is expected to continue for many decades given the U.S. Government’s objective of procuring and sustaining 2,456 aircraft for the U.S. Air Force, U.S. Marine Corps, and U.S. Navy. We also have commitments from seven international partner countries and 12 Foreign Military Sales (FMS) customers. We continue to see strong international demand for the F-35. In February 2025, Singapore signed an LOA for eight F-35As, adding to their prior program of record of 12 F-35Bs. In June 2025, the United Kingdom announced its intent to purchase 12 F-35As adding to its existing fleet of F-35Bs. Finally, in July 2025 Belgium announced their intention to procure an additional 11 F-35As bringing their total program of record to 45 aircraft. We expect international interest to continue to expand in the coming years.\nDuring the third quarter of 2025, we delivered 46 aircraft. Since the program inception through September 28, 2025, we delivered 1,245 production F-35 aircraft, including 893 F-35A variants, 230 F-35B variants and 122 F-35C variants, and our backlog as of that date was 265 aircraft. \n43\nTable of \nContents\nIn addition, during the third quarter, Lockheed Martin and the Joint Program Office (JPO) reached an agreement for Lot 18 and Lot 19 F-35 Air Vehicle Production Contract for 296 aircraft, resulting in the planned payments during the third quarter of 2025, followed by definitization on September 29, 2025. The scope includes aircraft for the U.S. Air Force, Navy, and Marines and the International Partners and FMS customers, in addition to the required infrastructure for the international Final Assembly and Checkout Facilities (FACOs) and other equipment. With this award, an additional 3 Lot 18 aircraft and 148 Lot 19 aircraft were added to the F-35 backlog, demonstrating the F-35 program’s continued progress and longevity.\nThe F-35 program is significant and complex, and we and our customers continually review aircraft performance, program and delivery schedule, cost and supply chain issues, and requirements as part of our internal program management efforts and the DoW, Congressional and international countries’ oversight and budgeting processes. Areas of particular focus currently include Lockheed Martin’s and supplier performance, Block 4 modernization, flight test execution, cost of life cycle operations, sustainment, inflation-related cost and supply chain-related cost and schedule pressures, and efforts to increase affordability and readiness.\nAs previously disclosed, deliveries of F-35 aircraft were put on hold in the first half of 2024 due to technology insertion delays in the Lot 15-17 contract. Deliveries resumed in July 2024 after reaching agreement with JPO on a phased approach to inserting such capabilities into the aircraft including timing of the final delivery payments and related withhold liquidations. We continue to make progress on delivering capability while enhancing the air dominance of the F-35 through on-going Block 4 development.\nContingencies\nSee “Note 7 - Legal Proceedings and Contingencies” included in our Notes to Consolidated Financial Statements for information regarding our contingent obligations, including off-balance sheet arrangements.\nCritical Accounting Policies\nThere have been no significant changes to the critical accounting policies disclosed in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K."
}