{
  "source_file": "lnt-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis MDA includes information relating to Alliant Energy, and IPL and WPL (collectively, the Utilities), as well as ATC Holdings, AEF and Corporate Services.  Where appropriate, information relating to a specific entity has been segregated and labeled as such.  The following discussion and analysis should be read in conjunction with the \nFinancial Statements\n and the \nNotes\n included in this report, as well as the financial statements, notes and MDA included in the 2024 \nForm\n 10-K\n.  Unless otherwise noted, all “per share” references in MDA refer to earnings per diluted share.\n2025 HIGHLIGHTS\nKey highlights since the filing of the 2024 \nForm 10-K\n include the following:\nCustomer Investments:\n•\nOver the next six years, Alliant Energy currently plans to develop and/or acquire new generation investments to add flexibility with evolving load growth, including approximately 2,000 MW of natural gas resources, approximately 1,300 MW of new energy storage, approximately 1,100 MW of new renewable generation, improvements of approximately 530 MW at existing natural gas-fired EGUs, and refurbishments at approximately 450 MW of existing wind farms.  Alliant Energy is currently evaluating the impact of potential additional large load growth customers and MISO’s seasonal resource adequacy requirements on its resource plans and will update these generation investment plans as needed in the future.  Estimated capital expenditures for these planned projects for 2025 through 2029 are included in the “Generation” section in the construction and acquisition table in “\nLiquidity and Capital Resources\n.”  Information on IPL’s and WPL’s regulatory filings and/or approvals for future generation and energy storage projects are as follows:\n•\nIn February 2025, WPL filed a certificate of authority (CA) application with the PSCW for approval to construct a 2 billion cubic feet, or 25 million gallon, liquified natural gas facility in Rock County, Wisconsin.  A decision from the PSCW is currently expected in the second quarter of 2026.\n•\nIn April 2025, the PSCW issued an order authorizing WPL to construct, own and operate a 17.5 MW natural gas-fired EGU using Reciprocating Internal Combustion Engine (RICE) technology, at the site of its Riverside Energy Center.\n•\nIn April 2025, WPL filed a CA application with the PSCW for approval to construct, own and operate the Bent Tree North EGU, an approximate 153 MW wind farm.  A decision from the PSCW is currently expected in the second quarter of 2026.\n28\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \n•\nIn May 2025, the PSCW issued an order authorizing WPL to refurbish the Bent Tree wind farm.\n•\nIn June 2025, the IUC issued an order authorizing IPL to construct, own and operate the Cedar River Generating Station, a 94 MW natural gas-fired EGU using RICE technology, at the site of its Prairie Creek Generating Station.\n•\nIn June 2025, the PSCW issued an order authorizing WPL to construct, own and operate an approximately 20 MW compressed carbon dioxide-based long-duration energy storage system at the site of its Columbia Energy Center.\n•\nIn July 2025, IPL filed for advance rate-making principles with the IUC for up to 1,000 MW of new wind generation in Iowa.  The advance rate-making principles filing included requests for a fixed cost cap of $3,020/kilowatt, including allowance for funds used during construction and transmission upgrade costs among other costs, and a return on common equity of 11.25%.  A decision from the IUC is currently expected in the first quarter of 2026.\n•\nIn July 2025, the IUC issued an order authorizing IPL to construct, own and operate up to 150 MW of energy storage at the site of its retired Lansing Generating Station.\n•\nIn July 2025, WPL completed construction of approximately 100 MW of energy storage at the site of its Grant County solar facility.\n•\nIn August 2025, the IUC issued an order authorizing IPL to construct, own and operate up to 75 MW of energy storage at the site of its Golden Plains wind farm.\n•\nIn August 2025, IPL filed a certificate of public convenience, use and necessity (GCU Certificate) application with the IUC for approval to construct, own and operate an approximate 720 MW simple-cycle natural gas-fired EGU at the site of its Marshalltown Generating Station, known as the Bobcat Energy Center.  A decision from the IUC is currently expected in the first quarter of 2026.\n•\nIn September 2025, the IUC issued an order authorizing IPL to construct, own and operate up to 75 MW of energy storage at the site of its Whispering Willow - North wind farm.\n•\nIn October 2025, WPL completed construction of approximately 75 MW of energy storage at the site of its Wood County solar facility.\n•\nIn November 2025, IPL filed a GCU Certificate application with the IUC for approval to construct, own and operate a 94 MW natural gas-fired EGU using RICE technology at the site of its Burlington Generating Station.  A decision from the IUC is currently expected in the first quarter of 2026.\nRate Matters:\n•\nIn September 2025, WPL filed a unanimous settlement agreement with the PSCW for the 2026/2027 forward-looking Test Period.  In November 2025, the PSCW issued an oral decision approving the settlement agreement.  A written order from the PSCW is currently expected by the end of 2025.  The settlement agreement reflects the following:\n•\nAnnual incremental rate increases for its retail electric customers of $79 million and $73 million in 2026 (effective January 1, 2026) and 2027 (effective January 1, 2027), respectively, and an average retail electric rate base of $6,234 million and $6,549 million in 2026 and 2027, respectively. \n•\nAnnual incremental rate increases for its retail gas customers of $7 million and $5 million in 2026 (effective January 1, 2026) and 2027 (effective January 1, 2027), respectively, and an average retail gas rate base of $558 million and $593 million in 2026 and 2027, respectively. \n•\nReturn on common equity of 9.8% and common equity component of its regulatory capital structure of 54.5%.  \n•\nKey drivers include revenue requirement impacts of increasing electric and gas rate base, including wind refurbishment projects, energy storage, existing natural gas-fired EGU improvements, solar generation costs incurred that exceed the construction cost estimates previously approved by the PSCW (refer to \nNote 3\n for further discussion), and electric and gas distribution investments. \n•\nExtension, with certain modifications, of current earnings sharing mechanism through 2027, including deferral of a portion of earnings if the annual regulatory return on common equity exceeds 10.05% during the 2026/2027 Test Period (deferral of 50% of its excess earnings between 10.05% and 10.55%, and 100% of any excess earnings above 10.55%). \n•\nAllowance for funds used during construction applied to 100% of construction work in progress balances related to construction activity on capital projects requiring PSCW approval and are impacted by federal law changes.\n•\nIPL currently expects to file a subsequent proceeding with the IUC in the fourth quarter of 2025 for its October 2024 through September 2025 forward-looking Test Period retail electric and gas rate reviews, which will compare actual revenues and costs to those initially forecasted by IPL.  IPL currently does not expect any rate adjustments from the subsequent proceeding.\nGrowing Customer Demand:\n•\nWPL has entered into electric service agreements with two new customers, who currently expect to build data centers in WPL’s service territory.  The actual timing and amount of increases in WPL’s load are subject to various factors, including interconnections, siting approvals and actual customer demand, and any executed or future agreements with customers are not expected to result in immediate increases in load.  IPL’s and WPL’s currently executed electric service agreements include aggregate, peak demands of approximately 3 gigawatts.  The energy resources to serve this expected load are included in the construction and acquisition table in “\nLiquidity and Capital Resources\n.”\n•\nIn May 2025 and October 2025, the IUC issued orders, with certain conditions, approving individual customer rates for data centers expected to be constructed in IPL’s service territory.  In April 2025, WPL filed a request with the PSCW for approval of an individual customer rate for a data center expected to be constructed in its service territory.  A decision from the PSCW is currently expected in the first quarter of 2026.\n29\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nEnvironmental Matters and Stewardship:\n•\nIn March 2025, the EPA announced it expects to initiate a formal reconsideration of various environmental regulations and programs, including the Cross-State Air Pollution Rule and Effluent Limitation Guidelines.  In June 2025, the EPA proposed to repeal emissions standards and guidelines issued under Clean Air Act Sections 111(b) and 111(d) for electric generating units.  In July 2025, the EPA proposed to repeal its 2009 finding that GHG contributes to climate change, which gave it authority to regulate GHG under the Clean Air Act.  In October 2025, the EPA proposed a rule to revise certain deadlines and other provisions of the 2024 Effluent Limitation Guidelines.  The EPA also expects to expedite review of state programs to delegate implementation of the Coal Combustion Residuals Rule and reconsider compliance deadlines.  Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these matters, including resolution of ongoing and potential litigation.\n•\nAlliant Energy’s current voluntary environmental stewardship goals include the following:\n•\nBy 2030, reduce GHG emissions from its utility operations by 50% from 2005 levels, reduce its electric utility water supply by 75% from 2005 levels and electrify 100% of its owned light-duty fleet vehicles.\n•\nBy 2040, eliminate all coal-fired EGUs from its generating fleet.\n•\nBy 2050, aspire to achieve net-zero GHG emissions from its utility operations.\n•\nAlliant Energy’s aspirational GHG goal includes EPA reportable emissions based on applicable regulatory compliance requirements for carbon dioxide, methane and nitrous oxide from its owned fossil-fueled EGUs and distribution of natural gas.  Alliant Energy’s voluntary environmental stewardship goals may be revised, or their achievement may be delayed, based on increasing customer energy needs, reliability and resource adequacy requirements, and tax policy changes, and the ability to achieve these goals is subject to various additional risk factors included in the 2024 \nForm 10-K\n.  These goals are not meant to be considered guidance.\nLegislative Matters: \n•\nIn July 2025, the One Big Beautiful Bill Act was enacted, which modifies various clean energy tax credits under the Inflation Reduction Act of 2022, including production tax credits and investment tax credits.  The most significant provisions of the new legislation for Alliant Energy, IPL and WPL relate to the accelerated phase out of clean energy tax credits for eligible projects for which construction begins more than 12 months after the date of enactment or for projects placed in service after 2027, and restricted access to clean energy tax credits for projects that begin construction after 2025 and receive impermissible amounts of construction support from entities with ties to certain foreign countries, including China.  Additionally, in July 2025, the Presidential Administration directed the U.S. Department of the Treasury to strictly enforce the termination of clean energy tax credits, including issuing new and revised guidance in August 2025, to ensure that requirements concerning the beginning of construction are not circumvented.  Refer to “\n2025 Highlights\n” for discussion of Alliant Energy’s, IPL’s and WPL’s current plans to develop and/or acquire new clean energy resources.  Alliant Energy, IPL and WPL currently expect these clean energy projects would continue to be eligible for clean energy tax credits.  If these clean energy projects do not begin construction within the anticipated timeframes or fail to meet other eligibility requirements, the amount of clean energy tax credits could be significantly reduced, which could adversely impact Alliant Energy’s, IPL’s and WPL’s financial condition and results of operations.\nFinancings and Common Stock Dividends:\n•\nRefer to “\nResults of Operations\n” for discussion of expected future issuances of common stock in 2026 through 2029 and common stock dividends in 2026, and expected future issuances and retirements of long-term debt by the end of 2026.\n•\nIn April 2025, WPL submitted an application to the U.S. Army Corps of Engineers for up to $45 million in loans through the Corps Water Infrastructure Financing Program.  If finalized, such loans would provide low interest financing for various proposed safety projects at WPL’s Kilbourn and Prairie du Sac hydro EGUs.\nRESULTS OF OPERATIONS\nFinancial Results Overview\n - \nThe table below includes diluted EPS for Utilities and Corporate Services, ATC Holdings, and Non-utility and Parent, which are non-GAAP financial measures.  Alliant Energy believes these non-GAAP financial measures are useful to investors because they facilitate an understanding of performance and trends, and provide additional information about Alliant Energy’s operations on a basis consistent with the measures that management uses to manage its operations and evaluate its performance.  Alliant Energy’s net income and EPS attributable to Alliant Energy common shareowners for the three months ended September 30 were as follows (dollars in millions, except per share amounts):\n2025\n2024\nIncome (Loss)\nEPS\nIncome (Loss)\nEPS\nUtilities and Corporate Services\n$292\n$1.13\n$308\n$1.20\nATC Holdings\n10\n0.04\n9\n0.04\nNon-utility and Parent\n(21)\n(0.08)\n(22)\n(0.09)\nAlliant Energy Consolidated\n$281\n$1.09\n$295\n$1.15\nAlliant Energy’s Utilities and Corporate Services net income decreased by $16 million for the three-month period, primarily due to higher other operation and maintenance expenses, the timing of income tax expense, higher depreciation and financing expenses.  These items were partially offset by higher revenue requirements from IPL’s and WPL’s capital investments.\n30\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nAlliant Energy’s Non-utility and Parent net income increased $1 million for the three-month period, primarily due to the timing of income taxes, partially offset by a state income tax apportionment charge.\nNet Income Variances\n - \nThe following items contributed to increased (decreased) net income for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nRevenues:\nChanges in electric utility (Refer to \ndetails below\n)\n$125\n$85\n$40\n$249\n$137\n$112\nChanges in gas utility (Refer to \ndetails below\n)\n2\n—\n2\n44\n10\n34\nChanges in other utility\n—\n1\n(1)\n1\n2\n(1)\nChanges in non-utility\n2\n—\n—\n(1)\n—\n—\nChanges in total revenues\n129\n86\n41\n293\n149\n145\nOperating expenses:\nChanges in electric production fuel and purchased power (Refer to \ndetails below\n)\n(47)\n(27)\n(21)\n(71)\n(18)\n(53)\nChanges in electric transmission service (Refer to \ndetails below\n)\n(1)\n—\n(2)\n(10)\n(5)\n(4)\nChanges in cost of gas sold (Refer to \ndetails below\n)\n1\n1\n—\n(28)\n(4)\n(24)\nAsset valuation charge for IPL’s Lansing Generating Station in the second quarter of 2024 (Refer to \nNote 2\n for details)\n—\n—\n—\n60\n60\n—\nChanges in other operation and maintenance (Refer to \ndetails below\n)\n(30)\n(12)\n(12)\n(20)\n6\n(22)\nChanges in depreciation and amortization (Higher primarily due to solar generation placed in service in 2024 and updated electric depreciation rates for IPL effective October 1, 2024)\n(16)\n(16)\n(1)\n(60)\n(52)\n(6)\nChanges in taxes other than income taxes\n—\n(1)\n1\n(1)\n1\n(1)\nChanges in total operating expenses\n(93)\n(55)\n(35)\n(130)\n(12)\n(110)\nChanges in operating income\n36\n31\n6\n163\n137\n35\nOther income and deductions:\nChanges in interest expense (Higher primarily due to financings completed in 2024 and 2025)\n(14)\n(10)\n(1)\n(43)\n(26)\n(5)\nChanges in equity income from unconsolidated investments, net (Refer to \nNote\n \n5\n for details)\n4\n—\n—\n(3)\n—\n—\nChanges in allowance for funds used during construction \n4\n2\n2\n7\n3\n4\nChanges in Other\n—\n(1)\n(1)\n(1)\n2\n(5)\nChanges in total other income and deductions\n(6)\n(9)\n—\n(40)\n(21)\n(6)\nChanges in income before income taxes\n30\n22\n6\n123\n116\n29\nChanges in income taxes\n (Refer to \nNote\n 9\n for details)\n(44)\n(47)\n3\n5\n(14)\n22\nChanges in net income\n($14)\n($25)\n$9\n$128\n$102\n$51\n31\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nElectric and Gas Revenues and Sales Summary\n - \nElectric and gas revenues (in millions), and MWh and Dth sales (in thousands), for the three and nine months ended September 30 were as follows:\nAlliant Energy\nElectric\nGas\nRevenues\nMWhs Sold\nRevenues\nDths Sold\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nThree Months\nRetail\n$996\n$887\n6,974\n6,697\n$38\n$38\n3,252\n3,281\nSales for resale:\nWholesale\n51\n58\n713\n782\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n64\n31\n1,497\n1,363\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n13\n23\n13\n14\n13\n11\n34,593\n30,239\n$1,124\n$999\n9,197\n8,856\n$51\n$49\n37,845\n33,520\nNine Months\nRetail\n$2,514\n$2,312\n19,075\n18,633\n$327\n$289\n33,188\n29,128\nSales for resale:\nWholesale\n148\n147\n2,055\n2,115\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n133\n66\n4,050\n4,120\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n33\n54\n41\n43\n39\n33\n92,758\n93,248\n$2,828\n$2,579\n25,221\n24,911\n$366\n$322\n125,946\n122,376\nIPL\nElectric\nGas\nRevenues\nMWhs Sold\nRevenues\nDths Sold\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nThree Months\nRetail\n$574\n$497\n3,812\n3,647\n$20\n$21\n1,489\n1,606\nSales for resale:\nWholesale\n11\n19\n135\n212\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n17\n—\n503\n248\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n6\n7\n7\n8\n7\n6\n10,309\n10,337\n$608\n$523\n4,457\n4,115\n$27\n$27\n11,798\n11,943\nNine Months\nRetail\n$1,377\n$1,259\n10,537\n10,302\n$162\n$156\n15,928\n14,491\nSales for resale:\nWholesale\n39\n45\n478\n568\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n19\n(5)\n1,199\n777\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n20\n19\n23\n24\n23\n19\n32,675\n31,621\n$1,455\n$1,318\n12,237\n11,671\n$185\n$175\n48,603\n46,112\nWPL\nElectric\nGas\nRevenues\nMWhs Sold\nRevenues\nDths Sold\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nThree Months\nRetail\n$422\n$390\n3,162\n3,050\n$18\n$17\n1,763\n1,675\nSales for resale:\nWholesale\n40\n39\n578\n570\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n47\n31\n994\n1,115\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n7\n16\n6\n6\n6\n5\n24,284\n19,902\n$516\n$476\n4,740\n4,741\n$24\n$22\n26,047\n21,577\nNine Months\nRetail\n$1,137\n$1,053\n8,538\n8,331\n$165\n$133\n17,260\n14,637\nSales for resale:\nWholesale\n109\n102\n1,577\n1,547\nN/A\nN/A\nN/A\nN/A\nBulk power and other\n114\n71\n2,851\n3,343\nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n13\n35\n18\n19\n16\n14\n60,083\n61,627\n$1,373\n$1,261\n12,984\n13,240\n$181\n$147\n77,343\n76,264\n32\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nSales Trends and Temperatures\n -\n All\niant Energy’s retail electric sa\nles volumes increased 4% and 2% for the three and nine months ended September 30, 2025, respectively, compared to the same periods in 2024, primarily due to changes in temperatures and higher sales to industrial customers.  Alliant Energy’s retail gas sales volumes increased 14% for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to changes in temperatures.\nEstimated increases (decreases) to operating income from the impacts of temperatures for the three and nine months ended September 30 were as follows (in millions):\nElectric\nGas\nThree Months\nNine Months \nThree Months\nNine Months \n2025\n2024\nChange\n2025\n2024\nChange\n2025\n2024\nChange\n2025\n2024\nChange\nIPL\n$11\n$1\n$10\n$12\n($7)\n$19\n$—\n($1)\n$1\n($4)\n($8)\n$4\nWPL\n(1)\n—\n(1)\n—\n(11)\n11\n—\n(1)\n1\n(1)\n(7)\n6\nTotal Alliant Energy\n$10\n$1\n$9\n$12\n($18)\n$30\n$—\n($2)\n$2\n($5)\n($15)\n$10\nElectric Sales for Resale - Bulk Power and Other\n - \nBulk power and other volume changes were due to changes in sales in the wholesale energy markets operated by MISO.  These changes are impacted by several factors, including the availability and dispatch of Alliant Energy’s EGUs and electricity demand within these wholesale energy markets.  Changes in bulk power and other revenues were largely offset by changes in fuel-related costs, and therefore did not have a significant impact on operating income.\nGas Transportation/Other\n - \nGas transportation/other sales volume changes were largely due to changes in the gas volumes supplied to Alliant Energy’s natural gas-fired EGUs caused by the availability and dispatch of such EGUs.\nElectric Utility Revenue Variances\n - \nThe following items contributed to increased (decreased) electric utility revenues for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nHigher revenue requirements (a)(b)\n$118\n$100\n$18\n$319\n$271\n$48\nHigher sales for resale bulk power and other revenues (c)\n33\n17\n16\n67\n24\n43\nEstimated changes in sales volumes caused by temperatures\n9\n10\n(1)\n30\n19\n11\nHigher revenues at IPL related to changes in recovery amounts for energy efficiency costs through the energy efficiency rider (mostly offset by changes in energy efficiency expense)\n7\n7\n—\n14\n14\n—\nHigher (lower) revenues primarily due to changes in retail electric fuel-related costs (Refer to \nElectric Production Fuel and Purchased Power Expenses Variances\n below) \n23\n17\n6\n10\n(1)\n11\nChanges in WPL electric fuel-related costs, net of recoveries (d)\n1\n—\n1\n7\n—\n7\nLower revenues at IPL due to credits on customers’ bills related to production tax credits through its fuel-related cost recovery mechanism (offset by changes in income taxes) (a)\n(27)\n(27)\n—\n(116)\n(116)\n—\nLower revenues at IPL due to credits on customers’ bills through the tax benefit rider in 2025 (partially offset by changes in income taxes) (a)\n(19)\n(19)\n—\n(53)\n(53)\n—\nLower revenues at IPL from discontinuation of renewable energy rider in 2024 (a)\n(15)\n(15)\n—\n(23)\n(23)\n—\nOther\n(5)\n(5)\n—\n(6)\n2\n(8)\n$125\n$85\n$40\n$249\n$137\n$112\n(a)\nIn September 2024, the IUC issued an order authorizing an annual base rate increase of $185 million for IPL’s retail electric customers, with customers receiving partially offsetting credits for the first 12 months through a tax benefit rider, for the October 2024 through September 2025 forward-looking Test Period.  Rate changes were effective October 1, 2024, which reflect revenue requirement impacts of increasing electric rate base including investments in solar generation, updated depreciation rates, and certain incremental costs incurred resulting from the 2020 derecho windstorm.  In addition, effective October 1, 2024, IPL’s renewable energy rider was discontinued, and certain production tax credits are credited to IPL’s retail electric customers through IPL’s fuel-related cost recovery mechanism.  Credits on IPL’s customers’ bills have been and are expected to be offset by a reduction in income tax expense.\n(b)\nIn December 2023, the PSCW issued an order authorizing an annual base rate increase of $60 million for WPL’s retail electric customers, covering the 2025 forward-looking Test Period, which reflects revenue requirement impacts of increasing electric rate base including investments in solar generation and energy storage.\n33\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \n(c)\nSales for resale bulk power and other revenues increased primarily due to higher prices for electricity and capacity sold by IPL and WPL to MISO wholesale energy markets.  These changes were largely offset by changes in fuel-related costs.\n(d)\nWPL’s cost recovery mechanism for retail fuel-related expenses supports deferrals of amounts that fall outside an approved fuel monitoring range of forecasted fuel-related expenses determined by the PSCW each year.  The difference between revenue collected and actual fuel-related expenses incurred within the fuel monitoring range increases or decreases Alliant Energy’s and WPL’s electric utility revenues.  WPL estimates the increase (decrease) to electric utility revenues from amounts within the fuel monitoring range were approximately $1 million and $3 million for the three and nine months ended September 30, 2025, respectively, compared to $0 and ($4) million for the three and nine months ended September 30, 2024, respectively.\nGas Utility Revenue Variances\n - \nThe following items contributed to increased (decreased) gas utility revenues for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nHigher (lower) revenues due to changes in gas costs (Refer to \nCost of Gas Sold Expense Variances\n below)\n($1)\n($1)\n$—\n$28\n$4\n$24\nEstimated changes in sales volumes caused by temperatures\n2\n1\n1\n10\n4\n6\nHigher revenue requirements (a)\n1\n1\n—\n6\n6\n—\nLower revenues at IPL related to changes in recovery amounts for energy efficiency costs through the energy efficiency rider (mostly offset by changes in energy efficiency expense)\n—\n—\n—\n(6)\n(6)\n—\nOther\n—\n(1)\n1\n6\n2\n4\n$2\n$—\n$2\n$44\n$10\n$34\n(a)\nIn September 2024, the IUC issued an order authorizing an annual base rate increase of $10 million for IPL’s retail gas customers, for the October 2024 through September 2025 forward-looking Test Period.  Rate changes were effective October 1, 2024, which reflect revenue requirement impacts of increasing gas rate base.\nElectric Production Fuel and Purchased Power Expenses Variances\n - \nThe following items contributed to (increased) decreased electric production fuel and purchased power expenses for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nHigher electric production fuel costs (a)\n($27)\n($20)\n($7)\n($55)\n($37)\n($18)\nLower (higher) purchased power expense (b)\n(3)\n2\n(5)\n(13)\n6\n(19)\nChanges in regulatory recovery of retail electric fuel-related costs\n(17)\n(9)\n(8)\n(4)\n13\n(17)\nOther\n—\n—\n(1)\n1\n—\n1\n($47)\n($27)\n($21)\n($71)\n($18)\n($53)\n(a)\nElectric production fuel costs increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024, primarily due to higher coal volumes due to higher dispatch of coal-fired EGUs and higher natural gas prices, partially offset by lower natural gas volumes due to lower dispatch of natural gas-fired EGUs. \n(b)\nPurchased power expense increased for the three and nine months ended September 30, 2025 compared to the same periods in 2024, primarily due to higher prices for electricity purchased at WPL.\nElectric Transmission Service Expense Variances\n - \nThe following items contributed to (increased) decreased electric transmission service expense for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nChanges in regulatory recovery for the difference between actual electric transmission service costs and those costs used to determine rates\n$4\n$2\n$2\n$11\n$3\n$8\nOther (primarily due to changes in transmission service costs provided by third parties)\n(5)\n(2)\n(4)\n(21)\n(8)\n(12)\n($1)\n$—\n($2)\n($10)\n($5)\n($4)\n34\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nCost of Gas Sold Expense Variances\n - \nThe following items contributed to (increased) decreased cost of gas sold expense for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions):\nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nChanges in retail gas volumes and natural gas prices\n($6)\n$1\n($7)\n($29)\n($6)\n($23)\nChanges in the regulatory recovery of gas costs\n7\n—\n7\n1\n2\n(1)\n$1\n$1\n$—\n($28)\n($4)\n($24)\nOther Operation and Maintenance Expenses Variances\n - \nThe following items contributed to (increased) decreased other operation and maintenance expenses for the three and nine months ended September 30, 2025 compared to the same periods in 2024 (in millions): \nThree Months\nNine Months \nAlliant Energy\nIPL\nWPL\nAlliant Energy\nIPL\nWPL\nHigher generation and energy delivery expenses\n($13)\n($6)\n($7)\n($11)\n$—\n($11)\nHigher incentive compensation expense\n(5)\n(3)\n(2)\n(10)\n(5)\n(5)\nHigher energy efficiency expense at IPL (mostly offset by higher revenues)\n(7)\n(7)\n—\n(7)\n(7)\n—\nDevelopment costs for new generation\n(6)\n(4)\n(2)\n(6)\n(4)\n(2)\nARO charge in the second quarter of 2024 for steam assets at IPL (Refer to \nNote 1(d)\n for details)\n—\n—\n—\n20\n20\n—\nOther \n1\n8\n(1)\n(6)\n2\n(4)\n($30)\n($12)\n($12)\n($20)\n$6\n($22)\nOther Future Considerations\n \n- In addition to items discussed in this report, the following key items could impact Alliant Energy’s, IPL’s and WPL’s future financial condition or results of operations:\n•\nFinancing Plans \n- Alliant Energy currently expects to issue up to $2.4 billion of common stock in aggregate from 2026 through 2029 through the distribution agreement that was executed in May 2025, its Shareholder Direct Plan (up to $25 million in common stock annually) and additional future equity offerings.  For the remainder of 2025, WPL currently expects to issue up to $300 million of long-term debt.  In 2026, IPL and WPL currently expect to issue up to $500 million and $300 million, respectively, of long-term debt, and AEF and/or Alliant Energy at the parent company level expect to issue up to $300 million of long-term debt in aggregate.  AEF and Alliant Energy at the parent company level have $500 million and $575 million, respectively, of long-term debt maturing in 2026.\n•\nCommon Stock Dividends\n - Alliant Energy announced a 5% increase in its targeted 2026 annual common stock dividend to $2.14 per share, which is equivalent to a quarterly rate of $0.535 per share, beginning with the February 2026 dividend payment.  The timing and amount of future dividends is subject to approval of quarterly dividend declarations from Alliant Energy’s Board of Directors, and is dependent upon earnings expectations, capital requirements, and general financial business conditions, among other factors.\n•\nHigher Earnings on Increasing Rate Base\n - Alliant Energy and WPL currently expect increases in electric utility and gas utility revenues in 2026 compared to 2025 due to impacts from increasing revenue requirements related to investments in the utility business (refer to “\nRate Matters\n” for further discussion).  Additionally, Alliant Energy and IPL currently expect electric utility revenues to increase in 2026 compared to 2025 due to the expiration of tax benefit rider credits in 2025.  Furthermore, Alliant Energy, IPL and WPL currently expect a decrease in the effective income tax rate in 2026 compared to 2025 due to additional renewable tax credits from renewable generation and energy storage projects placed in service and/or expected to be placed in service in 2025 and 2026.  A majority of the differences between actual renewable tax credits and renewable tax credits used to determine rates are recorded in regulatory assets or regulatory liabilities on the balance sheets until they are reflected in future billings to customers.  Investment tax credits resulting from IPL energy storage projects placed in service and/or expected to be placed in service in 2025 and 2026 may be utilized to offset any revenue deficiency on an annual basis up to the earnings sharing mechanism threshold included in IPL’s retail electric rate review settlement agreement.\n•\nSales Trends\n - Alliant Energy, IPL and WPL currently expect an increase in retail electric sales in 2026 compared to 2025 driven by expected load growth from new customers who currently expect to build data centers in IPL’s and WPL’s service territories.  Refer to “\nGrowing Customer Demand\n” for further discussion.\n•\nOther Operation and Maintenance Expenses\n - Alliant Energy, IPL and WPL currently expect an increase in other operation and maintenance expenses in 2026 compared to 2025 largely due to higher generation maintenance and energy delivery expenses.\n•\nDepreciation and Amortization Expense\n - Alliant Energy, IPL and WPL currently expect an increase in depreciation and amortization expense in 2026 compared to 2025 due to capital projects placed in service in 2025 and 2026.\n•\nInterest Expense\n - Alliant Energy, IPL and WPL currently expect an increase in interest expense in 2026 compared to 2025 due to financings completed in 2025 and planned in 2026 as discussed above.\n•\nAllowance for Funds Used During Construction\n - Alliant Energy, IPL and WPL currently expect an increase in allowance for funds used during construction in 2026 compared to 2025 largely due to changes in construction work in progress balances related to construction activity on capital projects.\n35\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nLIQUIDITY AND CAPITAL RESOURCES\nThe liquidity and capital resources summary included in the 2024 \nForm 10-K\n has not changed materially, except as described below.\nLiquidity Position\n - \nAt September 30, 2025, Alliant Energy had $503 million of cash and cash equivalents, $250 million of short-term investments, $1,108 million ($550 million at the parent company, $350 million at IPL and $208 million at WPL) of available capacity under the single revolving credit facility and $4 million of available capacity at IPL under its sales of accounts receivable program.\nCapital Structure\n - \nFinancial capital structures at September 30, 2025 were as follows (Long-term Debt (including current maturities) (LD); Short-term Debt (SD); Common Equity (CE)):\n(a)\nThe long-term debt component of Alliant Energy’s financial capital structure includes junior subordinated notes classified as “Long-term debt, net” on Alliant Energy’s balance sheet (refer to \nNote 7\n for additional information).  50% of the carrying amount of junior subordinated notes is excluded from the debt component of Alliant Energy’s debt-to-capital ratio used by the majority of rating agencies.  Alliant Energy’s financial capital structure adjusted for the reclassification of 50% of the carrying amount of junior subordinated notes from long-term debt to common equity at September 30, 2025 was as follows: LD: 59%, CE: 40% and SD: 1%.  The non-GAAP adjusted presentation reflecting this treatment is useful and relevant to investors in understanding how management and the rating agencies evaluate Alliant Energy’s capital structure.\nCash Flows\n - \nSelected information from the cash flows statements was as follows (in millions):\nAlliant Energy\nIPL\nWPL\n2025\n2024\n2025\n2024\n2025\n2024\nCash, cash equivalents and restricted cash, January 1\n$81\n$63\n$29\n$53\n$51\n$7\nCash flows from (used for):\nOperating activities\n900\n913\n289\n231\n573\n651\nInvesting activities\n(1,605)\n(940)\n(660)\n(332)\n(530)\n(464)\nFinancing activities\n1,127\n794\n551\n804\n(83)\n(125)\nNet increase (decrease)\n422\n767\n180\n703\n(40)\n62\nCash, cash equivalents and restricted cash, September 30\n$503\n$830\n$209\n$756\n$11\n$69\n36\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nOperating Activities - \nThe following items contributed to increased (decreased) operating activity cash flows for the nine months ended September 30, 2025 compared to the same period in 2024 (in millions):\nAlliant Energy\nIPL\nWPL\nLower collections from IPL’s retail customers due to credits on customers’ bills related to production tax credits through its fuel-related cost recovery mechanism\n($116)\n($116)\n$—\nLower collections from IPL’s retail customers due to credits on customers’ bills related to the tax benefit rider\n(53)\n(53)\n—\nChanges in income taxes paid/received (a)\n(50)\n(20)\n(43)\nChanges in interest payments\n(47)\n(31)\n(13)\nRestructuring and voluntary employee separation payments in 2025\n(25)\n(11)\n(12)\nLower collections from IPL’s retail customers due to discontinuation of renewable energy rider in 2024\n(23)\n(23)\n—\nChanges in gas stored underground and prepaid gas costs\n(23)\n(10)\n(13)\nHigher collections from IPL’s and WPL’s retail electric and IPL’s retail gas base rate increases\n325\n277\n48\nIncreased collections from IPL’s and WPL’s retail customers caused by temperature impacts on electric and gas sales\n40\n23\n17\nOther (primarily due to other changes in working capital)\n(41)\n22\n(62)\n($13)\n$58\n($78)\n(a)\nRefer to the cash flows statements for details of renewable tax credits transferred to other corporate taxpayers during the nine months ended September 30, 2025 and 2024.\nInvesting Activities -\n The following items contributed to increased (decreased) investing activity cash flows for the nine months ended September 30, 2025 compared to the same period in 2024 (in millions):\nAlliant Energy\nIPL\nWPL\nPurchases of short-term investments in 2025\n($250)\n$—\n$—\n(Higher) lower utility construction and acquisition expenditures (a)\n(207)\n(274)\n67\nProceeds from sales of partial ownership interests in West Riverside in 2024\n(123)\n—\n(123)\nChanges in the amount of cash receipts on sold receivables\n(67)\n(67)\n—\nOther\n(18)\n13\n(10)\n($665)\n($328)\n($66)\n(a)\nLargely due to higher expenditures for IPL’s energy storage and gas generation, partially offset by lower expenditures for IPL’s and WPL’s solar generation and WPL’s energy storage.\nConstruction and Acquisition Expenditures\n - Construction and acquisition expenditures and financing plans are reviewed, approved and updated as part of the strategic planning process.  Changes may result from a number of reasons, including changes in expected load growth, regulatory requirements, changing legislation, not obtaining favorable and acceptable regulatory approval on certain projects, changing costs of projects due to market conditions and the impact of tariffs, improvements in technology, and improvements to ensure resiliency and reliability of the electric and gas distribution systems.  Alliant Energy, IPL and WPL have not yet entered into contractual commitments relating to the majority of their anticipated future construction and acquisition expenditures.  As a result, they have some discretion with regard to the level and timing of these expenditures.  Construction and acquisition expenditures for 2025 through 2029 are currently anticipated as follows (in millions), which are focused on adding renewable generation and energy storage projects and dispatchable gas generation projects to meet growing customer demand for electricity, including expected future data center growth from currently executed electric service agreements, and strengthening the resiliency and reliability of the electric and gas distribution systems.  Alliant Energy, IPL and WPL are currently evaluating the impacts of tariffs, recently enacted legislation and additional potential large load growth customers on their resource plans, and will update their anticipated construction and acquisition expenditures as needed in the future.  Cost estimates represent Alliant Energy’s, IPL’s and WPL’s portion of construction expenditures and exclude allowance for funds used during construction and capitalized interest, if applicable.\n37\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nAlliant Energy\nIPL\nWPL\n2025\n2026\n2027\n2028\n2029\n2025\n2026\n2027\n2028\n2029\n2025\n2026\n2027\n2028\n2029\nGeneration:\nRenewables and energy storage projects\n$940 \n$875 \n$1,135 \n$1,545 \n$820 \n$615 \n$445 \n$530 \n$275 \n$655 \n$310 \n$480 \n$605 \n$1,270 \n$165 \nGas projects\n400 \n1,055 \n1,505 \n1,180 \n985 \n230 \n690 \n1,130 \n920 \n440 \n120 \n330 \n375 \n260 \n545 \nOther\n155 \n180 \n135 \n175 \n100 \n80 \n80 \n80 \n55 \n45 \n75 \n100 \n55 \n120 \n55 \nDistribution:\nElectric systems\n620 \n550 \n545 \n570 \n615 \n355 \n275 \n260 \n265 \n275 \n265 \n275 \n285 \n305 \n340 \nGas systems\n110 \n135 \n145 \n105 \n105 \n65 \n70 \n80 \n40 \n40 \n45 \n65 \n65 \n65 \n65 \nOther\n245 \n250 \n200 \n220 \n280 \n50 \n40 \n40 \n40 \n60 \n35 \n40 \n35 \n40 \n55 \n$2,470 \n$3,045 \n$3,665 \n$3,795 \n$2,905 \n$1,395 \n$1,600 \n$2,120 \n$1,595 \n$1,515 \n$850 \n$1,290 \n$1,420 \n$2,060 \n$1,225 \nFinancing Activities -\n The following items contributed to increased (decreased) financing activity cash flows for the nine months ended September 30, 2025 compared to the same period in 2024 (in millions):\nAlliant Energy\nIPL\nWPL\nHigher (lower) net proceeds from issuance of long-term debt\n$561\n$245\n($297)\n(Higher) lower payments to retire long-term debt\n5\n(300)\n—\nHigher (lower) capital contributions from IPL’s and WPL’s parent company, Alliant Energy\n—\n(40)\n25\nNet changes in the amount of commercial paper outstanding\n(221)\n(50)\n327\nHigher common stock dividends\n(22)\n(119)\n(16)\nOther \n10\n11\n3\n$333\n($253)\n$42\nFERC Financing Authorization\n - In August 2025, IPL received authorization from FERC to increase the long-term debt securities issuances in 2024 and 2025 to $1,950 million.  The remaining capacity as of September 30, 2025 is $400 million.\nCommon Stock Issuances and Common Stock Dividends\n - Refer to \nNote\n 6\n for discussion of common stock issuances by Alliant Energy in 2025 and Alliant Energy’s at-the-market offering program.  Refer to “\nResults of Operations\n” for discussion of expected future issuances of common stock from 2026 through 2029 and common stock dividends in 2026.\nLong-term Debt\n - Refer to \nNote \n7\n(b)\n for discussion of AEF’s term loan credit agreements and various issuances and/or retirements of long-term debt by Alliant Energy and IPL in 2025.  Refer to “\nResults of Operation\ns\n” for discussion of expected future issuances and retirements of long-term debt by the end of 2026.\nImpact of Credit Ratings on Liquidity and Collateral Obligations\n -\nRatings Triggers -\n In March 2025, Standard & Poor’s Ratings Services changed certain Alliant Energy, IPL and WPL credit ratings and outlooks, which are not expected to have a material impact on Alliant Energy’s, IPL’s and WPL’s liquidity or collateral obligations, and the current credit ratings and outlooks are as follows:\nStandard & Poor’s Ratings Services\nAlliant Energy:\nCorporate/issuer\nBBB+\nCommercial paper\nA-2\nSenior unsecured long-term debt\nBBB\nOutlook\nStable\nIPL:\nCorporate/issuer\nBBB+\nCommercial paper\nA-2\nSenior unsecured long-term debt\nBBB+\nOutlook\nStable\nWPL:\nCorporate/issuer\nA-\nCommercial paper\nA-2\nSenior unsecured long-term debt\nA-\nOutlook\nStable\nOff-Balance Sheet Arrangements and Certain Financial Commitments\n - \nA summary of Alliant Energy’s and IPL’s off-balance sheet arrangements and Alliant Energy’s, IPL’s and WPL’s contractual obligations is included in the 2024 \nForm 10-K\n and has not changed materially from the items reported in the 2024 \nForm 10-K\n, except for the items described in Notes \n4\n, \n7\n and \n1\n3\n.\n38\nTable of Contents\n    \n    \n    \n    \n    \n    \n    \n    \n    \n \nOTHER MATTERS\nCritical Accounting Estimates\n - The summary of critical accounting estimates included in the 2024 \nForm 10-K\n has not changed materially, except as described below.\nLong-Lived Assets\n -\nRegulated Operations\n -\nGenerating Units Subject to Early Retirement\n - WPL currently plans to continue coal operations at Columbia Units 1 and 2 at least through 2029 as well as evaluate the potential conversion of Columbia Unit 1 and/or Unit 2 to natural gas.  WPL previously planned to cease coal operations at Columbia Units 1 and 2 by the end of 2029.  As a result, Alliant Energy and WPL concluded that Columbia Units 1 and 2 no longer meet the criteria to be considered probable of abandonment as of September 30, 2025.  Refer to \nNote 3\n for further discussion of Columbia Units 1 and 2.\nSolar Generation Projects Recently Completed\n - Construction costs associated with WPL’s approximately 1,100 MW of new solar generation exceeded the construction cost estimates previously approved by the PSCW by approximately $\n205\n million.  In September 2025, WPL filed a settlement agreement with the PSCW for the 2026/2027 forward-looking Test Period.  In November 2025, the PSCW issued an oral decision approving the settlement agreement, which includes a full return of and on these solar generation construction costs from WPL’s retail electric customers.  As a result, Alliant Energy and WPL concluded that there was not a probable disallowance of the higher rate base amounts as of September 30, 2025.  Refer to \nNote 3\n for further discussion.\nRetroactive Tariffs on Solar Cells and Modules\n -\n \nIn August 2023, the U.S. Department of Commerce (DOC) issued a final ruling that found solar cells and modules produced in certain Southeast Asian countries, including Cambodia, Malaysia, Thailand and Vietnam, using parts and components produced in China, were circumventing pre-existing antidumping and countervailing duties on China.  Consistent with a June 2022 Presidential Proclamation, the DOC issued rules granting duty-free treatment of solar cells and modules imported from these four countries as of June 2022 until June 2024.  In August 2025, the U.S. Court of International Trade (CIT) ruled that this two-year duty suspension, as issued, was impermissible.  In September 2025, this ruling from the CIT was appealed to the Federal Circuit.  The CIT's order has been stayed pending appeal.  Alliant Energy, IPL and WPL continue to assess the potential impact of these tariffs on previously completed solar generation projects and are currently unable to predict with certainty the future outcome or impact of these matters, including resolution of ongoing litigation."
}