{
  "source_file": "lnt-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nA. GENERAL\nAlliant Energy maintains its principal executive offices in Madison, Wisconsin.  Alliant Energy operates as a regulated investor-owned public utility holding company, and its purpose-driven strategy is to serve its customers and build stronger communities.  Alliant Energy’s primary focus is to provide regulated electric and natural gas service to approximately 1,000,000 electric and approximately 430,000 natural gas customers in the Midwest through its two public utility subsidiaries, IPL and WPL.  The primary first tier wholly-owned subsidiaries of Alliant Energy are as follows:\n3\nTable of C\no\nntents\n                                    \n1) IPL -\n is a public utility engaged principally in the generation and distribution of electricity and the distribution and transportation of natural gas to retail customers in select markets in Iowa.  IPL provides utility services to incorporated communities as directed by the IUC and utilizes non-exclusive franchises, which cover the use of public right-of-ways for utility facilities in incorporated communities for a maximum term of 25 years.  At December 31, 2024, IPL supplied electric and natural gas service to approximately 500,000 and 230,000 retail customers, respectively, in Iowa.  IPL also sells electricity to wholesale customers in Minnesota (IPL’s related wholesale power agreement expires July 2025), Illinois and Iowa.  IPL is also engaged in the generation and distribution of steam for two customers in Cedar Rapids, Iowa, which are each under contract through 2025 for taking minimum quantities of annual steam usage, with certain conditions, after which IPL expects to exit the steam business.\n2) WPL -\n is a public utility engaged principally in the generation and distribution of electricity and the distribution and transportation of natural gas to retail customers in select markets in Wisconsin.  WPL operates in municipalities pursuant to permits of indefinite duration and state statutes authorizing utility operation in areas annexed by a municipality.  At December 31, 2024, WPL supplied electric and natural gas service to approximately 500,000 and 200,000 retail customers, respectively.  WPL also sells electricity to wholesale customers in Wisconsin.\n3) CORPORATE SERVICES -\n provides administrative services to Alliant Energy, IPL, WPL and AEF.\n4) AEF -\n Alliant Energy’s non-utility holdings are organized under AEF, which manages a portfolio of wholly-owned subsidiaries and additional holdings, including the following distinct platforms:\nATI\n - currently holds all of Alliant Energy’s interest in ATC Holdings.  ATC Holdings is comprised of a 16% ownership interest in ATC and a 20% ownership interest in ATC Holdco LLC.  ATC is an independent, for-profit, transmission-only company.  ATC Holdco LLC holds an interest in Duke-American Transmission Company, LLC, a joint venture between Duke Energy Corporation and ATC, that owns electric transmission infrastructure in North America.\nCorporate Venture Investments\n - includes various minority ownership interests in regional and national venture funds, including a global coalition of energy companies working together to help identify and research innovative technologies and business models within the emerging energy economy.\nNon-utility Wind Farm\n - includes a 50% cash equity ownership interest in a 225 MW non-utility wind farm located in Oklahoma.\nSheboygan Falls Energy Facility\n - is a 347 MW, simple-cycle, natural gas-fired EGU near Sheboygan Falls, Wisconsin, which is currently leased to WPL through 2044.  Refer to \nNote \n9\n for additional information on WPL’s Sheboygan Falls Energy Facility lease.\nTravero\n - is a supply chain solutions company, including a short-line rail freight service in Iowa; a Mississippi River barge, rail and truck freight terminal in Illinois; freight brokerage services; wind turbine blade recycling services; and a rail-served warehouse in Iowa.\nDevelopment-ready Sites\n - includes various rail-served and ready-to-build manufacturing and industrial sites throughout Alliant Energy’s service territories, with access to various airports and interstate freeways.\nB. INFORMATION RELATING TO ALLIANT ENERGY ON A CONSOLIDATED BASIS\n1) HUMAN CAPITAL MANAGEMENT - \nAlliant Energy’s core purpose is to serve customers and build stronger communities.  We constantly strive to attract, retain and develop a qualified workforce of high-performing employees and foster an environment of high levels of engagement.\nEmployees\n - \nAt December 31, 2024, Alliant Energy, IPL and WPL had the following full- and part-time employees:\nTotal\nNumber of\nPercentage of Employees\nNumber of\nBargaining Unit\nCovered by Collective\nEmployees\nEmployees\nBargaining Agreements\nAlliant Energy\n2,998\n1,732\n58%\nIPL\n1,043\n759\n73%\nWPL\n1,003\n860\n86%\nThe majority of IPL’s bargaining unit employees are covered by the International Brotherhood of Electrical Workers Local 204 (Cedar Rapids) collective bargaining agreement, which expires August 31, 2028.  All of WPL’s bargaining unit employees are covered by the International Brotherhood of Electrical Workers Local 965 collective bargaining agreement, which expires May 31, 2026.\n4\nTable of C\no\nntents\n                                    \nSafety\n - \nSafety is integral to our company’s culture.  It is one of our Values - “Live safety. Everyone. Always.  Our first priority is that nobody gets hurt.”  Alliant Energy is committed to providing a safe environment for our employees, visitors, customers, contractors, vendors and the communities in which we live and work.\nWe focus on the proactive management of our safety performance.  Our comprehensive behavioral safety-based program consists of leading indicators, lagging indicators and targeted focus programs.  We utilize a formal safety management system to capture and track best practices, near misses, job site briefings, safety observations, safety conversations and any unsafe conditions.  This system provides the insights needed to help drive a positive safety culture and help ensure compliance with safety rules, processes and procedures.  We also use this system to broadly share lessons learned in support of shaping the mindsets and behaviors needed to help prevent similar events from occurring elsewhere.  Collectively, this information is used to evaluate the safety performance of the executive and management teams related to their goals, and safety metrics are factored into short-term incentive awards.\nWe maintain executive and local safety leadership teams to establish our safety vision, strategy and priorities, and ensure education and recognition of employee actions that improve our safety culture.  This leadership provides strong support for sustained growth of both employee and public safety programs and initiatives.\nPublic safety is equally important, as we interact with our customers to provide energy to their homes and businesses.  We offer awareness campaigns, natural gas and electric public safety presentations, and free online resources and training programs and guidance to assist local emergency responders.\nTotal Rewards\n - \nOur market-competitive Total Rewards programs are designed to meet the varied and evolving needs of our employees.  Through a variety of health, welfare and compensation programs, we offer employees choice and control, and help support their financial, physical, and mental well-being.  We provide tools and resources to employees to help maintain and improve their health.  Short- and long-term incentive plans have a mix of operational and financial metrics that align employees with strategic corporate goals.\nIn addition to competitive salaries and wages, our Total Rewards programs include:\n•\ncompetitive short- and long-term incentive compensation;\n•\na 401(k) savings plan with an employer contribution and employer match;\n•\nhealthcare and insurance benefits, including medical, vision, dental, life, short-term disability, and long-term disability insurance;\n•\nhealth savings and flexible spending accounts;\n•\nenhanced offerings to support the well-being of employees and their families;\n•\npaid time off to use for vacation, personal time, sick time, holidays, bereavement, jury duty, military leave, parental leave, maternity leave, and adoption leave;\n•\nadoption assistance;\n•\nlegal planning assistance;\n•\ntuition reimbursement;\n•\nVacation Donation program; and\n•\nVolunteer Grants and a Matching Gifts program.\nAnnually, Alliant Energy awards up to 25 scholarships to children of its current employees and eligible retirees.  Award recipients have achieved excellent records in high school, are pursuing a higher education, and \nmay enroll in any accredited two- or four-year college, university or vocational-technical school in the U.S.\nEmployee Engagement\n - \nA workplace where everyone feels meaningful connection to work and company goals is crucial for the success and retention of our employees, to attract future talent and to execute our purpose-driven strategy to serve our customers and build stronger communities.  It is one of our Values - “Care for others: Together we create a workplace where people feel like they can use their backgrounds, talents and perspectives to their fullest potential.”  Alliant Energy believes the achievement of its strategic objectives can only be achieved with a focused and engaged workforce.\nOur efforts to advance employee engagement in our workforce include:\n•\nLearning: We offer various learning opportunities for employees, such as participating in area summits, supporting company-wide listening sessions, providing training opportunities, and hosting speakers, among other programs, as well as leaders facilitating conversations around employee engagement, helping to ensure employees are seen, heard and valued;\n•\nListening and responding: We collect and act upon feedback through employee sentiment surveys;\n•\nEmpowering: We promote and foster an engaged workforce, providing opportunities to collaborate, network, and share their insights and talents; and\n•\nLeading: Our Leadership Team identifies and champions initiatives to help advance a culture that values employee engagement.\n5\nTable of C\no\nntents\n                                    \nTalent Development and Workforce Readiness\n - \nWe support all employees in their skill development and career growth, offering several training opportunities, development programs and tuition reimbursement, as well as leadership development and succession planning.  Development goals and conversations with leadership help identify opportunities to learn through a mix of on-the-job experience, collaboration and formal content to build needed skills for today and the future.\nTo help attract and introduce a wide range of candidates to our industry, we have early careers programs that include apprenticeships, youth programs (high school) and internships (college).  Our programs provide a pipeline of talented students to engage in meaningful, hands-on work experiences.  Our apprenticeship program combines supervised, structured on-the-job training with related instruction to produce highly skilled trade and technical workers, and builds lifetime skills and comprehensive knowledge in the high-demand technical trades necessary for our success.  The apprenticeship program gives us the flexibility to tailor training to match our needs - training employees in our facilities, on our equipment, and consistent with\n \nour\n \nsafety standards and employee expectations.  We instill company Values, methods and procedures from day one.\n2) REGULATION - \nAlliant Energy, IPL and WPL are subject to regulation by various federal, state and local agencies.  The following includes the primary regulations impacting Alliant Energy’s, IPL’s and WPL’s businesses.\nFERC\n -\nPublic Utility Holding Company Act of 2005 - \nAlliant Energy is registered with FERC as a public utility holding company, pursuant to the Public Utility Holding Company Act of 2005, and is required to maintain certain records and to report certain transactions involving its public utilities, service company and other entities regulated by FERC.  Corporate Services, IPL and WPL are subject to regulation by FERC under the Public Utility Holding Company Act of 2005 for various matters including, but not limited to, affiliate transactions, public utility mergers, acquisitions and dispositions, and books, records and accounting requirements.\nEnergy Policy Act of 2005 - \nThe Energy Policy Act of 2005 requires creation of an Electric Reliability Organization to provide oversight by FERC.  FERC designated North American Electric Reliability Corporation, which also provides oversight of cybersecurity standards, as the overarching Electric Reliability Organization.  Midwest Reliability Organization, which is a regional member of North American Electric Reliability Corporation, has direct responsibility for mandatory electric reliability standards for IPL and WPL.\nFederal Power Act of 1935 - \nFERC also has jurisdiction, under the Federal Power Act of 1935, over certain electric utility facilities and operations, electric wholesale sales, interstate electric transmission rates, dividend payments, issuance of IPL’s securities, and accounting practices of Corporate Services, IPL and WPL.\nElectric Wholesale Rates\n - FERC has authority over IPL's and WPL's wholesale electric market-based rates.  Market-based rate authorization allows for wholesale sales of electricity within FERC’s wholesale markets, including the MISO market, and in transactions directly with third parties, based on the market value of the transactions.  IPL and WPL also have FERC-approved cost of service formula-based rates related to the provision of firm full- and partial-requirement wholesale electric sales, which allow for true-ups to actual costs, including fuel costs.\nElectric Transmission Rates\n - FERC regulates the rates charged for electric transmission facilities used in interstate commerce.  IPL and WPL do not own or operate FERC-regulated electric transmission facilities; however, both IPL and WPL pay for the use of the interstate electric transmission system based upon FERC-regulated rates.  IPL and WPL rely primarily on the use of the ITC and ATC transmission systems, respectively.\nNatural Gas Act\n - FERC regulates the transportation and sale for resale of natural gas in interstate commerce under the Natural Gas Act.  Under the Natural Gas Act, FERC has authority over certain natural gas facilities and operations of IPL and WPL.\nIUC\n -\n IPL is subject to regulation by the IUC for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, the construction of EGUs, and the acquisition, sale or lease of assets with values that exceed 3% of IPL’s revenues.  In Iowa, counties and cities are prohibited from regulating the sale of natural gas and propane, which supports IPL’s ability to provide gas utility service to retail customers and industries.\n6\nTable of C\no\nntents\n                                    \nRetail Utility Base Rates - \nIPL files periodic requests with the IUC for retail rate changes and may base those requests on either historical or forward-looking test periods.  The IUC must decide on requests for retail rate changes within 10 months of the date of the application for which changes are filed, subject to certain exceptions.  The historical test periods may be adjusted for certain known and measurable changes to capital investments, cost of capital and operating and maintenance expenses consistent with IUC rules and regulations.  The IUC has rules that establish minimum filing requirements for rate reviews using a forward-looking test period, and a related subsequent proceeding review after the close of the forward-looking test period.  The rules provide that in the subsequent proceeding review, a utility’s actual costs and revenues will be presumed to be reasonably consistent with the forward-looking test period if the utility’s actual return on common equity falls within a standard of reasonableness of 50 basis points above to 50 basis points below the authorized return on common equity.  If the utility’s actual return on common equity is outside of this range, future rates could be adjusted.  In addition, the rules require that IPL must receive an order from the IUC related to the subsequent proceeding review before it can file another rate review.  Also, IPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels.  Refer to “\nRate Matters\n” in MDA for discussion of IPL’s retail electric base rate moratorium from October 2025 through September 2029 approved by the IUC in IPL’s most recent retail electric rate review.\nEnergy Efficiency - \nIn accordance with Iowa law, IPL is required to file an energy efficiency plan (EEP) every five years with the IUC.  An EEP provides a utility’s plan and related budget to achieve specified levels of electric and gas energy savings.  IUC approval demonstrates that IPL’s EEP is reasonably expected to achieve cost-effective delivery of the energy efficiency programs.  Refer to \nNote 1(g)\n for discussion of the recovery of these costs from IPL’s retail electric and gas customers.\nElectric Generating Units - \nIPL must obtain a certificate of public convenience, use and necessity (GCU Certificate) from the IUC in order to construct a new, or significantly alter (including fuel switching) an existing, EGU or energy storage facility located in Iowa with a nameplate generating capacity of 25 MW or more.  IPL’s ownership and operation of EGUs (including those located outside the state of Iowa) to serve Iowa customers is subject to retail utility rate regulation by the IUC.\nGas Pipeline Projects - \nIPL must obtain a pipeline permit from the IUC related to the siting of utility gas pipelines in Iowa that will be operated at a pressure over 150 pounds per square inch and will transport gas to a distribution system or single, large volume customer.\nAdvance Rate-making Principles - \nIowa law allows Iowa utilities to request rate-making principles prior to making certain investments in Iowa.  As a result, IPL may file for, and the IUC must render a decision on, rate-making principles for certain new EGUs located in Iowa, including any alternate energy production facility (such as a wind, solar, energy storage or nuclear-fired facility), combined-cycle natural gas-fired EGU, and certain base-load EGUs with a nameplate generating capacity of 300 MW or more.  Advance rate-making principles are also available for the repowering of an alternative energy production facility or certain significant alterations of an existing EGU.  Upon approval of rate-making principles by the IUC, IPL must either construct the EGU or repower the alternative energy production facility under the approved rate-making principles, or not at all.  If rate-making principles are not approved by the IUC, IPL may construct the facility, subject to other applicable approvals (such as a GCU Certificate), subject to recovery in future rate reviews.\nThe IUC’s 2023 order for the advance rate-making principles for IPL’s 400 MW of solar generation projects placed in service in 2024 included a consumer protection plan, which monitors IPL’s achievement of certain aggregate summer capacity factors for those projects during June, July and August each calendar year over 30 years.  Actual three-year rolling average summer capacity factors will be compared to target capacity factors, which may result in surpluses or deficits that would be offset against one another and contribute to an accumulated balance in a given calendar year.  Surpluses or deficits will be capped at $3 million in aggregate per year.  At the end of the program, any accumulated deficit balance would be addressed in IPL’s next rate review, and any accumulated surplus balance would not result in any return to IPL.\nElectric Generating Unit Environmental Controls Projects \n- At its sole discretion, IPL may submit an updated emissions plan and budget to the IUC setting out a multi-year plan and budget for managing regulated emissions from its coal-fired EGUs in a cost-effective manner.  IPL must simultaneously submit this plan and budget to the Iowa Department of Natural Resources for a determination of whether the plan and budget meet state environmental requirements for regulated emissions.  The reasonable and prudent costs associated with implementing the approved plan are expected to be included in IPL’s future retail electric rates.\nPSCW\n -\n WPL is subject to regulation by the PSCW related to its operations in Wisconsin for various matters including, but not limited to, retail utility rates and standards of service, accounting requirements, issuance and use of proceeds of securities, affiliate transactions, approval of the location and construction of EGUs and certain other additions and extensions to facilities.  In addition, Alliant Energy is subject to regulation by the PSCW for the type and amount of Alliant Energy’s holdings in non-utility businesses and other affiliated interest activities, among other matters.\nRetail Utility Base Rates - \nWPL files periodic requests with the PSCW for retail rate changes, which are based on forward-looking test periods.  There is no statutory time limit for the PSCW to decide on retail base rate requests.  However, the PSCW attempts to process retail base rate reviews in approximately 10 months and has the ability to approve interim retail rate relief, subject to refund, if necessary.  Currently, WPL is required to defer a portion of its earnings if its annual regulatory return on common equity exceeds certain levels.\n7\nTable of C\no\nntents\n                                    \nPublic Benefits - \nWPL contributes 1.2% of its annual retail utility revenues to help fund Focus on Energy, Wisconsin’s state-wide energy efficiency and renewable energy resource program.  In addition, WPL contributes to a program that provides assistance to income-eligible residents in Wisconsin.  These contributions are recovered from customers through a monthly bill surcharge of the lesser of 3% of customers’ utilities bills or $750.  Refer to \nNote 1(g)\n for discussion of the recovery of these costs from WPL’s retail electric and gas customers.\nNew Electric Generating Units - \nA CA application is required to be filed with the PSCW for construction approval of any new EGU (including energy storage) with a capacity of less than 100 MW and a project cost of $16.3 million or more.  WPL must obtain a CPCN from the PSCW in order to construct a new EGU (including energy storage) in Wisconsin with a capacity of 100 MW or more.  In addition, WPL’s ownership and operation of EGUs (including those located outside the state of Wisconsin) to serve Wisconsin customers are subject to retail utility rate regulation by the PSCW.\nElectric Generating Unit Upgrades and Electric Distribution Projects - \nA CA application is required to be filed with the PSCW for construction approval of any additions to EGUs, including environmental controls projects, as well as electric distribution projects, with estimated project costs of $16.3 million or more.\nGas Distribution Projects - \nA CA application is required to be filed with the PSCW for construction approval of gas projects with an estimated project cost of $8.1 million or more and at any time that WPL requests to extend gas service to a new portion of its service territory.\nAdvance Rate-making Principles -\n Wisconsin law provides Wisconsin utilities with the opportunity to request rate-making principles prior to the purchase or construction of any EGU utilized to serve Wisconsin customers.  WPL is not obligated to file for or accept authorized rate-making principles under Wisconsin law.  WPL can proceed with an approved project under traditional rate-making terms or accept authorized rate-making principles under Wisconsin law.\nDepartment of Homeland Security Transportation Security Administration\n -\n Alliant Energy, IPL and WPL are subject to regulation for physical and cybersecurity of their natural gas pipeline systems, and are applying, and monitoring for changes to, these requirements to their pipeline systems.\nEnvironmental\n - \nAlliant Energy, IPL and WPL are subject to regulation of environmental matters by federal, state and local authorities as a result of their current and past operations.  Alliant Energy, IPL and WPL monitor these environmental matters and address them by installing controls that reduce emissions and by implementing operational modifications or other measures to address compliance obligations.  There is currently significant regulatory uncertainty with respect to environmental rules and regulations discussed below.  Given the evolving nature of environmental regulations and other related regulatory requirements, Alliant Energy, IPL and WPL develop and periodically update their compliance plans to address these environmental obligations.  Prudent expenditures incurred by IPL and WPL to comply with environmental requirements are eligible to be recovered in rates from their customers.  The following are major environmental matters that could potentially have a significant impact on financial condition and results of operations.\nAir Quality -\nClimate Change and Greenhouse Gas Regulations\n - In 2007, the Supreme Court provided direction on the EPA’s authority to regulate GHG and ruled that these emissions are covered by the CAA.  In 2009, the EPA issued a ruling that found GHG emissions contribute to climate change and therefore threaten public health and welfare, which is the basis for implementing CO2 reduction standards under the CAA.  The primary GHG directly emitted from Alliant Energy’s utility operations is CO2 from the combustion of fossil fuels at its EGUs.\nClean Air Act Section 111(d)\n - In May 2024, the EPA enacted the final Section 111(d) rule under the CAA for certain fossil-fueled EGUs, which requires states to implement plans to reduce CO2 emissions through various Best System of Emission Reduction (BSER) measures at affected sources, including retirement, enforceable limits on operational capacity, co-firing with low-GHG fuels, or carbon capture and energy storage technology.  State plans are subject to EPA approval, and must be submitted by May 2026.  The final rule’s compliance requirements will be phased in beginning in 2030 and covers fossil-fueled EGUs that utilize steam boilers to generate electricity, including IPL’s coal-fired Ottumwa Generating Station, George Neal Generating Station, Prairie Creek Generating Station Unit 3 and Louisa Generating Station, WPL’s coal-fired Edgewater Generating Station Unit 5 (WPL currently plans to convert Edgewater Unit 5 to natural gas in 2028, subject to regulatory approvals), and IPL’s natural gas-fired Burlington Generating Station and Prairie Creek Generating Station Unit 4.  The final rule does not apply to EGUs that are retired by January 2032.  If WPL’s coal-fired Columbia Energy Center is retired by the end of 2029, the final rule would not be applicable; however, if WPL converts Columbia Unit 1 and/or Unit 2 to natural gas, then the final rule would be applicable for the EGUs that are converted.  In addition, the final rule does not impact existing natural gas-fired combustion turbines, including IPL’s Marshalltown Generating Station and Emery Generating Station, and WPL’s Riverside Energy Center and West Riverside Energy Center; however, these EGUs could be subject to future Section 111(d) rules to reduce CO2 emissions from existing combustion turbines.  Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these matters, including resolution of ongoing litigation.\n8\nTable of C\no\nntents\n                                    \nClean Air Act Section 111(b)\n - In 2015, the EPA published final standards under Section 111(b) of the CAA, which establish CO2 emissions limits for certain new fossil-fueled EGUs, including IPL’s Marshalltown Generation Station and WPL’s West Riverside Energy Center.  In addition, in May 2024, the EPA enacted final revised standards under Section 111(b), which establish CO2 emissions limits from certain new and reconstructed fossil-fueled EGU combustion turbines that commenced operation after May 23, 2023 with a capacity greater than 25 MW.  The final revised standards do not apply to IPL’s and WPL’s current fossil-fueled EGU combustion turbines since they were all placed into service before May 23, 2023 and have not been reconstructed since that date.  Alliant Energy, IPL and WPL are currently unable to predict with certainty the future outcome or impact of these revised standards, including resolution of ongoing litigation.\nCross-State Air Pollution Rule\n - CSAPR is a regional sulfur dioxide and nitrogen oxides cap-and-trade program, where compliance with emission limits may be achieved by purchasing emission allowances and/or reducing emissions through changes in operations or the additions of environmental controls.  CSAPR emission allowances may be banked for future year compliance.  CSAPR establishes state-specific annual sulfur dioxide and nitrogen oxides emission caps and ozone season nitrogen oxides emission caps.  In 2023, the EPA finalized revisions to the CSAPR state-specific ozone season nitrogen oxides emission caps and utility-specific emission allowances for certain states, including Wisconsin, beginning in 2023; however, these revisions were stayed by the Supreme Court in June 2024.  In November 2024, the EPA issued an interim final rule to stay the 2023 rule and re-establish the prior emission caps and allowance allocations, including Wisconsin, pending judicial review.  WPL currently receives, and expects to receive in the future, enough CSAPR emission allowances to ensure ongoing compliance without the need to purchase additional allowances or materially curtail operations.  These revisions do not currently apply to Iowa; however, Iowa could be included in a future rule.  As a result, Alliant Energy and IPL are currently unable to predict with certainty the future outcome or impacts of these matters.\nNew Source Performance Standards (NSPS) for Combustion Turbines\n - The EPA establishes requirements under the CAA for various categories of stationary sources that cause or contribute significantly to air pollution, and may reasonably be anticipated to endanger public health or welfare, which are referred to as NSPS.  These standards reflect the degree of emission limitation achievable through the application of the BSER.  In December 2024, the EPA proposed updates to the NSPS for combustion turbines built, reconstructed, or modified after December 13, 2024, which would establish more stringent emission limits for nitrogen oxides emissions and retain the current sulfur dioxide emission limits.  This proposal would establish size-based subcategories for new, reconstructed or modified combustion turbines, and could require combustion controls or selective catalytic reduction control equipment.  Alliant Energy, IPL and WPL are currently evaluating the proposed rule and are unable to predict with certainty future compliance impacts; however, costs to comply with this rule could have a material impact on their financial condition and results of operations.\nWater Quality -\nEffluent Limitation Guidelines\n - In May 2024, the EPA enacted a final rule that revises discharge limits for specific categories of wastewater from existing steam EGUs.  The new limitations will be implemented in each facility’s wastewater discharge permits issued by state agencies and become effective as soon as possible but no later than December 31, 2029.  Alliant Energy, IPL and WPL are currently evaluating the final rule and are unable to predict with certainty future compliance impacts, including resolution of ongoing litigation; however, costs to comply with this rule could have a material impact on their financial condition and results of operations.\nLand and Solid Waste -\nCoal Combustion Residuals Rule\n - The CCR Rule, which initially became effective in 2015, regulates CCR as a non-hazardous waste.  In May 2024, the EPA revised the CCR Rule, which significantly expands the scope of regulation, and as discussed in \nNote 1\n3\n, Alliant Energy, IPL and WPL recorded additional AROs in 2024.  IPL and WPL have coal ash ponds at current and former EGU sites, and active and inactive CCR landfills, that are impacted by this rule.  Alliant Energy, IPL and WPL continue to evaluate the revised CCR Rule and are unable to predict with certainty the future outcome or impact of these updates, including resolution of ongoing litigation.\nManufactured Gas Plant Sites\n - Refer to \nNote 1\n6\n(e)\n for discussion of IPL’s and WPL’s MGP sites.\nRenewable Energy Standards\n - \nIowa and Wisconsin have renewable energy standards, which establish the minimum amount of energy IPL and WPL must supply from renewable resources.  IPL primarily relies upon renewable energy generated from the wind or solar resources it owns and renewable energy acquired under PPAs to meet these requirements.  WPL utilizes its current renewable portfolio, which primarily consists of wind, solar and hydro energy, both owned and acquired under PPAs, to meet these requirements.  IPL and WPL currently exceed their respective renewable energy standards requirements.\n3) STRATEGY - \nRefer to “\nOverview\n” in MDA for discussion of Alliant Energy’s strategy, which supports its mission to deliver energy solutions and exceptional service that its customers and communities count on - affordably, safely, reliably and sustainably.\n9\nTable of C\no\nntents\n                                    \nC. INFORMATION RELATING TO UTILITY OPERATIONS\nAlliant Energy’s utility business includes the operations of IPL (electric, gas and steam operations) and WPL (electric and gas operations), which are both reportable segments.  IPL’s and WPL’s electric, gas and other revenues as a percentage of total revenues were as follows:\nIPL\nWPL\n1) ELECTRIC UTILITY OPERATIONS\nGeneral\n -\n Alliant Energy’s electric utility operations are located in the Midwest with IPL providing retail and wholesale electric service in Iowa and WPL providing retail and wholesale electric service in Wisconsin.  IPL also sells electricity to wholesale customers in Minnesota and Illinois.  Refer to the “\nElectric Operating Information\n” tables for additional details regarding electric utility operations.\nCustomers\n \n-\n IPL and WPL provide electric utility service to a large base of retail customers in several industries, with the largest concentrations in the farming, agriculture, industrial manufacturing, chemical (including ethanol), packaging and food industries.  IPL and WPL also sell electricity to wholesale customers, which primarily consist of municipalities and rural electric cooperatives.\nSeasonality\n - \nElectric sales are seasonal to some extent with the annual peak normally occurring in the summer months due to air conditioning requirements.  Electric sales are also impacted to a certain extent in the winter months due to heating requirements.\nCompetition\n - \nRetail electric customers in Iowa and Wisconsin currently do not have the ability to choose their electric supplier, and IPL and WPL have obligations to serve all their retail electric customers.  Although electric service in Iowa and Wisconsin is regulated, IPL and WPL still face competition from self-generation by large industrial customers, customer- and third party-owned generation (e.g. solar panels), alternative energy sources, and petitions to municipalize (Iowa) as well as service territory expansions by municipal utilities through annexations (Wisconsin).  In addition, the wholesale power market is competitive and IPL and WPL compete against independent power producers, other utilities and MISO market purchases to serve wholesale customers for their electric energy and capacity needs.  Alliant Energy’s strategy includes actions to retain current customers and attract new customers into IPL’s and WPL’s service territories in an effort to keep energy rates low for all of their customers.  Refer to “\nOverview\n” in MDA for discussion of the strategy element focusing on growing customer demand.\nElectric Supply\n -\n Alliant Energy, IPL and WPL have met, and expect to continue meeting, customer demand of electricity through a mix of electric supply, including owned EGUs, PPAs and additional purchases from wholesale energy markets.  Alliant Energy expects its current mix of electric supply to continue to evolve with new wind and solar generation, energy storage facilities, new natural gas resources, refurbishing of existing wind farms, improvements at existing natural gas-fired EGUs and converting certain coal-fired EGUs to natural gas.  Long-term generation plans are intended to meet growing customer demand, reduce air emissions and water impacts, reduce reliance on wholesale market purchases and mitigate the impacts of future EGU retirements while maintaining compliance with long-term electric demand planning reserve margins, renewable energy standards established by regulators, among other requirements.\nElectric Demand Planning Reserve Margin -\n IPL and WPL are required to maintain a planning reserve margin above their load at the time of the MISO-wide peak each season to ensure reliable electric service to their customers.  IPL and WPL utilize accredited capacity from EGUs they own, and have rights to through PPAs, to meet a substantial portion of their current MISO planning reserve margin requirements and periodically rely on short-term market capacity purchases to supplement the accredited capacity from such EGUs.\n10\nTable of C\no\nntents\n                                    \nMISO Seasonal Resource Adequacy Process\n - MISO’s resource adequacy process includes capacity planning reserve margins and capacity accreditation requirements with four distinct seasons, to help ensure the reliability of electricity in the MISO region.  Capacity planning reserve margins are required for all market participants on a seasonal basis, and seasonal accredited capacity values are determined for certain classes of generating resources, including higher accredited capacity for wind generation during the Spring, Fall and Winter seasons and higher accredited capacity for solar generation during the Summer season.  Beginning with the June 1, 2028 through May 31, 2029 planning period, MISO will implement a Direct Loss of Load methodology to determine capacity accreditation, which will incorporate forward-looking analysis, and historical resource-specific performance during periods of high system risk over the previous three years.  Alliant Energy, IPL and WPL currently plan to construct and/or acquire additional renewable, energy storage and natural gas resources to meet the requirements of the seasonal resource adequacy process and have reflected the estimated capital expenditures for these projects in the “Generation” lines in the construction and acquisition table in “\nLiquidity and Capital Resources\n.”  Seasonal capacity reserve margins are as follows:\nJune 2025 - August 2025\nSeptember 2025 - November 2025\nDecember 2025 - February 2026\nMarch 2026 - May 2026\nRequired installed capacity reserve margin\n15.7%\n25.3%\n38.6%\n38.8%\nRequired unforced capacity reserve margin\n7.9%\n14.9%\n18.4%\n25.3%\nGeneration Fuel Supply - \nIPL and WPL own a portfolio of EGUs located in Iowa, Wisconsin and Minnesota with a fuel mix that includes natural gas, renewable resources and coal.  Refer to “\nProperties\n” in Item 2 for details of IPL’s and WPL’s EGUs.  The average cost of delivered fuel per million British Thermal Units used for electric generation was as follows:\nIPL\nWPL\n2024\n2023\n2022\n2024\n2023\n2022\nAll fuels\n$2.49\n$2.83\n$4.37\n$2.74\n$3.09\n$4.47\nNatural gas (a)\n2.52\n3.10\n5.76\n3.03\n3.47\n6.02\nCoal\n2.29\n2.09\n2.31\n2.37\n2.54\n2.43\n(a)\nThe average cost of natural gas includes commodity and transportation costs, as well as realized gains and losses from swap and option contracts used to hedge the price of natural gas volumes expected to be used by IPL’s and WPL’s natural gas-fired EGUs.\nNatural Gas\n - Alliant Energy, IPL and WPL own several natural gas-fired EGUs, and WPL also has exclusive rights to the output of AEF’s Sheboygan Falls Energy Facility under an affiliated lease agreement.  These facilities help meet customer demand for electricity when natural gas prices are low enough to make natural gas-fired generation economical compared to other fuel sources.  Alliant Energy manages the gas supply to these gas-fired EGUs and helps ensure an adequate supply is available at known prices through a combination of gas commodity, pipeline transportation and storage agreements held by IPL and WPL for numerous years.  Alliant Energy, IPL and WPL believe they are reasonably insulated against gas price volatility for these EGUs given their use of forward contracts and hedging practices, as well as their regulatory cost-recovery mechanisms.\nCoal\n - Coal is one of the fuel sources for owned EGUs.  Coal contracts entered into with different entities help ensure that a specified supply of coal is available, and delivered, at known prices for IPL’s and WPL’s coal-fired EGUs.  Alliant Energy, IPL and WPL believe their coal supply portfolio represents a reasonable balance between the risks of insufficient supplies and those associated with being unable to respond to future coal market changes.  Remaining coal requirements are expected to be met from either future term contracts or purchases in the spot market.  Currently, all of the coal utilized by IPL and WPL is from the Wyoming Powder River Basin.\nAlliant Energy, IPL and WPL believe they are reasonably insulated against coal price volatility given their current coal procurement process, the specific coal market in their primary purchase region and regulatory cost-recovery mechanisms.  The coal procurement process supports periodic purchases, staggering of contract terms, stair-stepped levels of supply going forward and different suppliers.  Similarly, given the term lengths of their transportation agreements and strategic alignment of agreement expirations for negotiation purposes, Alliant Energy, IPL and WPL believe they are reasonably insulated against future higher coal transportation rates from the major railroads.\nPurchased Power -\n IPL and WPL periodically enter into PPAs and purchase electricity from wholesale energy markets to meet a portion of their customer demand for electricity.\n11\nTable of C\no\nntents\n                                    \nElectric Transmission\n - \nIPL and WPL do not own electric transmission service assets and currently receive transmission services from ITC and ATC, respectively.  ITC and ATC are independent, for-profit, transmission-only companies and are transmission-owning members of the MISO Regional Transmission Organization, Midwest Reliability Organization and Reliability First Corporation Regional Entities.  The annual transmission service rates that ITC or ATC charges their customers are calculated each calendar year using a FERC-approved cost of service formula rate.  As a result, ITC and ATC can implement new rates each calendar year without filing a request with FERC.  However, new rates are subject to challenge by either FERC or customers.  If the rates proposed by ITC or ATC are determined by FERC to be unjust or unreasonable, or another mechanism is determined by FERC to be just and reasonable, ITC’s or ATC’s rates would change accordingly.  Refer to \nNote 1(g)\n for discussion of a transmission cost rider utilized by IPL for recovery of its electric transmission service expense, and discussion of WPL’s escrow for recovery of electric transmission service expense, which is recovered from its retail electric customers through changes in base rates determined during periodic rate proceedings.  Refer to \nNote\n \n1\n6\n(g)\n for discussion of a court case and resulting FERC order, which decreased the base return on equity authorized for MISO transmission owners, including ATC.\nMISO Markets\n \n-\n IPL and WPL are members of MISO, a FERC-approved Regional Transmission Organization, which is responsible for monitoring and ensuring equal access to the transmission system in their footprint.  IPL and WPL participate in the wholesale energy and ancillary services markets operated by MISO, which are discussed in more detail below.  As agent for IPL and WPL, Corporate Services enters into energy, capacity, ancillary services, and transmission sale and purchase transactions within MISO.  Corporate Services assigns such sales and purchases between IPL and WPL based on statements received from MISO.\nWholesale Energy Market - \nIPL and WPL sell and purchase power in the day-ahead and real-time wholesale energy markets operated by MISO.  MISO’s bid/offer-based markets compare the cost of IPL and WPL generation against other generators, which affects IPL and WPL generation operations, energy purchases and energy sales.  MISO generally dispatches the lowest cost generators, while recognizing current system constraints, to reduce costs for purchasers in the wholesale energy market.  In addition, MISO may dispatch generators that support reliability needs, but that would not have operated based on economic needs.  In these cases, MISO’s settlement assures that these generators are made whole financially for their variable costs.\nAncillary Services Market - \nIPL and WPL also participate in MISO’s ancillary services market, which integrates the procurement and use of regulation and contingency reserves with the existing wholesale energy market to ensure reliability of electricity supply.  MISO’s ancillary services market has had the overall impact of lowering ancillary services costs in the MISO footprint.\nFinancial Transmission Rights and Auction Revenue Rights\n \n-\n In areas of constrained transmission capacity, energy costs could be higher due to congestion and its impact on locational marginal prices.  FTRs provide a hedge for certain congestion costs that occur in the MISO energy market.  MISO allocates auction revenue rights to IPL and WPL annually based on a fiscal year from June 1 through May 31 and historical use of the transmission system.  The allocated auction revenue rights are used by IPL and WPL to acquire FTRs through the FTR auctions operated by MISO.\nResource Adequacy\n \n-\n MISO has resource adequacy requirements to help ensure adequate resources to meet forecasted peak load obligations plus a reserve margin.  Accredited capacity assigned to EGUs is available to meet these requirements.  In order for an EGU to receive accredited capacity, it must meet MISO capacity accreditation requirements, which can include satisfying transmission requirements identified in its interconnection agreement prior to the MISO planning year.  Refer to “\nElectric Demand Planning Reserve Margin\n” above for discussion of MISO’s seasonal resource adequacy process establishing capacity planning reserve margin and capacity accreditation requirements.\n12\nTable of C\no\nntents\n                                    \nElectric Operating Information - Alliant Energy\n2024\n2023\n2022\nRevenues (in millions):\nResidential\n$1,236\n \n$1,220 \n$1,233 \nCommercial\n821\n \n820 \n821 \nIndustrial\n952\n \n968 \n965 \nRetail subtotal\n3,009\n \n3,008 \n3,019 \nSales for resale:\nWholesale\n200\n \n213 \n233 \nBulk power and other\n86\n \n71 \n111 \nOther\n77\n \n53 \n58 \nTotal\n$3,372\n \n$3,345 \n$3,421 \nSales (000s MWh):\nResidential\n7,104\n \n7,176 \n7,479 \nCommercial\n6,304\n \n6,329 \n6,436 \nIndustrial\n11,161\n \n11,435 \n11,494 \nRetail subtotal\n24,569\n \n24,940 \n25,409 \nSales for resale:\nWholesale\n2,783\n \n2,859 \n2,866 \nBulk power and other\n5,620\n \n4,730 \n3,734 \nOther\n57\n \n58 \n62 \nTotal\n33,029\n \n32,587 \n32,071 \nCustomers (End of Period):\nRetail\n1,002,967\n \n995,982 \n989,369 \nOther\n2,915\n \n2,914 \n2,903 \nTotal\n1,005,882\n \n998,896 \n992,272 \nOther Selected Electric Data:\nMaximum summer peak hour demand (MW)\n5,638\n \n5,856 \n5,629 \nMaximum winter peak hour demand (MW)\n4,317\n \n4,240 \n4,415 \nCooling degree days (a):\nCedar Rapids, Iowa (IPL) (normal - 819)\n890\n \n974 \n908 \nMadison, Wisconsin (WPL) (normal - 704)\n742\n \n781 \n787 \nSources of electric energy (000s MWh):\nGas\n13,883\n \n14,764 \n11,438 \nPurchased power:\nWind (b)\n4,285\n \n4,067 \n4,422 \nOther (b)\n1,715\n \n1,883 \n2,803 \nWind (b)\n5,540\n \n5,410 \n6,424 \nSolar (b)\n1,833\n \n471 \n41 \nCoal\n6,204\n \n6,447 \n7,416 \nOther (b)\n201\n \n186 \n198 \nTotal\n33,661\n \n33,228 \n32,742 \nRevenue per KWh sold to retail customers (cents)\n$12.25\n \n$12.06 \n$11.88 \n(a)\nCooling degree days are calculated using a simple average of the high and low temperatures each day compared to a 65 degree base.  Normal degree days are calculated using a rolling 20-year average of historical cooling degree days.  Refer to “\nGas Operating Information\n” below for details of heating degree days.\n(b)\nAll or some of the renewable energy attributes associated with generation from these sources may be used in future years to comply with renewable energy standards or other regulatory requirements.\n13\nTable of C\no\nntents\n                                    \nElectric Operating Information\nIPL\nWPL\n2024\n2023\n2022\n2024\n2023\n2022\nRevenues (in millions):\nResidential\n$640\n \n$641 \n$673 \n$596\n \n$579 \n$560 \nCommercial\n525\n \n519 \n536 \n296\n \n301 \n285 \nIndustrial\n497\n \n501 \n538 \n455\n \n467 \n427 \nRetail subtotal\n1,662\n \n1,661 \n1,747 \n1,347\n \n1,347 \n1,272 \nSales for resale:\nWholesale\n61\n \n62 \n64 \n139\n \n151 \n169 \nBulk power and other\n(6)\n11 \n13 \n92\n \n60 \n98 \nOther\n30\n \n27 \n35 \n47\n \n26 \n23 \nTotal\n$1,747\n \n$1,761 \n$1,859 \n$1,625\n \n$1,584 \n$1,562 \nSales (000s MWh):\nResidential\n3,573\n \n3,586 \n3,793 \n3,531\n \n3,590 \n3,686 \nCommercial\n3,974\n \n3,988 \n4,049 \n2,330\n \n2,341 \n2,387 \nIndustrial\n6,073\n \n6,335 \n6,428 \n5,088\n \n5,100 \n5,066 \nRetail subtotal\n13,620\n \n13,909 \n14,270 \n10,949\n \n11,031 \n11,139 \nSales for resale:\nWholesale\n750\n \n766 \n771 \n2,033\n \n2,093 \n2,095 \nBulk power and other\n1,138\n \n1,465 \n1,401 \n4,482\n \n3,265 \n2,333 \nOther\n32\n \n32 \n33 \n25\n \n26 \n29 \nTotal\n15,540\n \n16,172 \n16,475 \n17,489\n \n16,415 \n15,596 \nCustomers (End of Period):\nRetail\n503,279\n \n500,938 \n498,515 \n499,688\n \n495,044 \n490,854 \nOther\n881\n \n878 \n867 \n2,034\n \n2,036 \n2,036 \nTotal\n504,160\n \n501,816 \n499,382 \n501,722\n \n497,080 \n492,890 \nOther Selected Electric Data:\nMaximum summer peak hour demand (MW)\n2,833\n \n2,940 \n2,895 \n2,805\n \n2,926 \n2,800 \nMaximum winter peak hour demand (MW)\n2,359\n \n2,294 \n2,449 \n2,034\n \n1,946 \n2,046 \nCooling degree days (a):\nCedar Rapids, Iowa (IPL) (normal - 819)\n890\n \n974 \n908 \nN/A\nN/A\nN/A\nMadison, Wisconsin (WPL) (normal - 704)\nN/A\nN/A\nN/A\n742\n \n781 \n787 \nSources of electric energy (000s MWh):\nGas\n5,965\n \n6,636 \n4,625 \n7,918\n \n8,128 \n6,813 \nPurchased power:\nWind (b)\n2,681\n \n2,504 \n2,985 \n1,604\n \n1,563 \n1,437 \nOther (b)\n1,228\n \n730 \n835 \n487\n \n1,153 \n1,968 \nWind (b)\n4,347\n \n4,257 \n4,991 \n1,193\n \n1,153 \n1,433 \nSolar (b)\n119\n \n11 \n11 \n1,714\n \n460 \n30 \nCoal\n1,442\n \n2,252 \n3,305 \n4,762\n \n4,195 \n4,111 \nOther (b)\n—\n \n1 \n2 \n201\n \n185 \n196 \nTotal\n15,782\n \n16,391 \n16,754 \n17,879\n \n16,837 \n15,988 \nRevenue per KWh sold to retail customers (cents)\n$12.20\n \n$11.94 \n$12.24 \n$12.30\n \n$12.21 \n$11.42 \n(a)\nCooling degree days are calculated using a simple average of the high and low temperatures each day compared to a 65 degree base.  Normal degree days are calculated using a rolling 20-year average of historical cooling degree days.  Refer to “\nGas Operating Information\n” below for details of heating degree days.\n(b)\nAll or some of the renewable energy attributes associated with generation from these sources may be used in future years to comply with renewable energy standards or other regulatory requirements.\n14\nTable of C\no\nntents\n                                    \n2) GAS UTILITY OPERATIONS\nGeneral\n -\n Alliant Energy’s gas utility operations are located in the Midwest with IPL providing gas service in Iowa and WPL providing gas service in Wisconsin.  Refer to the “\nGas Operating Information\n” tables for additional details regarding gas utility operations.  Refer to \nNote 1(g)\n for information relating to utility natural gas cost recovery mechanisms and \nNote 1\n6\n(b)\n for discussion of natural gas commitments.\nCustomers\n - \nIPL and WPL provide gas utility service to a large base of retail customers and industries, including research, education, hospitality, manufacturing and chemicals (including ethanol).  In addition, IPL and WPL provide transportation service to commercial and industrial customers by moving customer-owned gas through Alliant Energy’s distribution systems to the customers’ meters.\nSeasonality\n - \nGas sales follow a seasonal pattern with an annual base-load of gas and a large heating peak occurring during the winter season.  Natural gas obtained from producers, marketers and brokers, as well as gas in storage, is utilized to meet the peak heating season requirements.  Storage contracts generally allow IPL and WPL to purchase gas in the summer and inject it into underground storage fields, and remove it from storage fields in the winter to deliver to customers.\nCompetition\n \n-\n Gas customers in Iowa and Wisconsin currently do not have the ability to choose their gas distributor, and IPL and WPL have obligations to serve all their gas customers.  While the gas utility distribution function is expected to remain a regulated function, sales of the natural gas commodity and related services are subject to competition from third-parties who provide alternative fuel sources (e.g. propane).  However, when natural gas service is available for a given area, customers in such area have generally selected natural gas over propane as a more cost competitive solution for their fuel needs.  Refer to “\nCustomer Investments\n” in MDA for discussion of plans to expand gas distribution systems.\nGas Supply\n \n-\n IPL and WPL maintain purchase agreements with numerous suppliers of natural gas from various gas producing regions of the U.S. and Canada.  In providing gas commodity service to retail customers, Corporate Services administers a portfolio of transportation and storage contracts on behalf of IPL and WPL.  The tariffs for IPL’s and WPL’s retail gas customers provide for subsequent adjustments to their rates for the cost of gas sold to these customers.  As a result, natural gas prices do not have a material impact on IPL’s or WPL’s operating income.\nGas Demand Planning Reserve Margin\n -\n IPL and WPL are required to maintain adequate pipeline capacity to ensure they meet their customers’ maximum daily system demand requirements.  IPL and WPL currently have planning reserve margins of 2% and 5%, respectively, above their forecasted maximum daily system demand requirements from November 2024 through March 2025.\nGas Operating Information - Alliant Energy\n2024\n2023\n2022\nRevenues (in millions):\nResidential\n$275\n \n$316 \n$371 \nCommercial\n133\n \n163 \n197 \nIndustrial\n11\n \n16 \n20 \nRetail subtotal\n419\n \n495 \n588 \nTransportation/other\n46\n \n45 \n54 \nTotal\n$465\n \n$540 \n$642 \nSales (000s Dths):\nResidential\n24,243\n \n25,838 \n31,109 \nCommercial\n16,974\n \n18,291 \n21,097 \nIndustrial\n2,272\n \n2,276 \n2,815 \nRetail subtotal\n43,489\n \n46,405 \n55,021 \nTransportation/other\n123,386\n \n115,177 \n104,812 \nTotal\n166,875\n \n161,582 \n159,833 \nRetail Customers (End of Period)\n430,699\n \n428,143 \n426,153 \nOther Selected Gas Data:\nHeating degree days (a):\nCedar Rapids, Iowa (IPL) (normal - 6,736)\n5,450\n \n5,807 \n7,222 \nMadison, Wisconsin (WPL) (normal - 6,987)\n5,801\n \n6,157 \n7,210 \nRevenue per Dth sold to retail customers\n$9.63\n \n$10.67 \n$10.69 \nPurchased gas costs per Dth sold to retail customers\n$5.06\n \n$6.37 \n$6.97 \n15\nTable of C\no\nntents\n                                    \nGas Operating Information\nIPL\nWPL\n2024\n2023\n2022\n2024\n2023\n2022\nRevenues (in millions):\nResidential\n$148\n \n$176 \n$202 \n$127\n \n$140 \n$169 \nCommercial\n68\n \n86 \n101 \n65\n \n77 \n96 \nIndustrial\n7\n \n11 \n14 \n4\n \n5 \n6 \nRetail subtotal\n223\n \n273 \n317 \n196\n \n222 \n271 \nTransportation/other\n27\n \n27 \n34 \n19\n \n18 \n20 \nTotal\n$250\n \n$300 \n$351 \n$215\n \n$240 \n$291 \nSales (000s Dths):\nResidential\n12,413\n \n13,146 \n16,250 \n11,830\n \n12,692 \n14,859 \nCommercial\n7,714\n \n8,477 \n10,257 \n9,260\n \n9,814 \n10,840 \nIndustrial\n1,513\n \n1,505 \n1,985 \n759\n \n771 \n830 \nRetail subtotal\n21,640\n \n23,128 \n28,492 \n21,849\n \n23,277 \n26,529 \nTransportation/other\n43,075\n \n43,232 \n43,264 \n80,311\n \n71,945 \n61,548 \nTotal\n64,715\n \n66,360 \n71,756 \n102,160\n \n95,222 \n88,077 \nRetail Customers (End of Period)\n226,838\n \n226,265 \n226,284 \n203,861\n \n201,878 \n199,869 \nOther Selected Gas Data:\nMaximum daily winter peak demand (Dth)\n267,820\n \n290,922 \n259,474 \n221,135\n \n234,796 \n201,980 \nHeating degree days (a):\nCedar Rapids, Iowa (IPL) (normal - 6,736)\n5,450\n \n5,807 \n7,222\nN/A\nN/A\nN/A\nMadison, Wisconsin (WPL) (normal - 6,987)\nN/A\nN/A\nN/A\n5,801\n \n6,157 \n7,210\nRevenue per Dth sold to retail customers\n$10.30\n$11.80\n$11.13\n$8.97\n$9.54\n$10.22\nPurchased gas cost per Dth sold to retail customers\n$5.68\n$7.16\n$7.17\n$4.44\n$5.59\n$6.77\n(a)\nHeating degree days are calculated using a simple average of the high and low temperatures each day compared to a 65 degree base.  Normal degree days are calculated using a rolling 20-year average of historical heating degree days.\n3) OTHER UTILITY OPERATIONS - STEAM - \nIPL’s Prairie Creek facility provides steam for IPL’s two high-pressure steam customers in Iowa.  These customers are each under contract through 2025 for taking minimum quantities of annual steam usage, with certain conditions, after which IPL currently expects to exit the steam business.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis MDA includes information relating to Alliant Energy, IPL and WPL, as well as AEF and Corporate Services.  Where appropriate, information relating to a specific entity has been segregated and labeled as such.  The following discussion and analysis should be read in conjunction with the Financial Statements and Notes included in this report.  Unless otherwise noted, all “per share” references in MDA refer to earnings per diluted share.  In addition, this MDA includes certain financial information for 2024 compared to 2023.  Refer to MDA in the combined 2023 \nForm 10-K\n for details on certain financial information for 2023 compared to 2022.\nOVERVIEW\nMission, Purpose and Strategy\nAlliant Energy’s mission is to deliver affordable energy solutions and exceptional service that its customers and the communities it serves count on - affordably, safely, reliably, and sustainably.  This mission aligns with Alliant Energy’s purpose - to serve customers and build stronger communities - which guides it through the ever-changing dynamics of the economy and the energy industry.  Alliant Energy takes its responsibility as a corporate citizen seriously and remains a careful steward of the environment and supports the communities in its service territories.  Alliant Energy’s mission and purpose are supported by a strategy focused on meeting evolving customer expectations, providing an attractive return for investors, and advancing emerging technologies with safe, secure energy production.  This strategy includes the following key elements:\n27\nTable of C\no\nntents\n                                    \nProviding affordable energy solutions for customers - \nAlliant Energy’s strategy focuses on affordable energy solutions that support retention and growth of its existing customers and attract new customers to its service territories.\nKey Highlights\n - \n•\nAlliant Energy’s resource plan continues to add resources in Iowa and Wisconsin, which is expected to result in continued reliability and affordability for its utility customers.  As a result, Alliant Energy directly reinvests in the communities it serves through the addition of skilled jobs, economic development and increased tax revenue.  From 2022 through 2024, Alliant Energy completed projects that resulted in approximately 1,500 MW of additional zero-fuel cost solar generation resources in aggregate (WPL completed 1,089 MW of solar generation in Wisconsin in 2022-2024 and IPL completed 400 MW of solar generation in Iowa in 2024), which generate renewable tax credits that are provided to its electric customers.\n•\nAlliant Energy, IPL and WPL have utilized, and expect to continue to utilize, various provisions of the Inflation Reduction Act of 2022 to enhance tax benefits expected from wind, solar and energy storage projects in Iowa and Wisconsin, including transferring certain future tax credits from such projects to other corporate taxpayers.  The Inflation Reduction Act of 2022 is expected to result in more cost benefits for IPL’s and WPL’s customers, higher rate base amounts, and improvements in long-term cash flows over the life of the solar, energy storage and wind refurbishment projects.  Refer to \nNote 1(c)\n for discussion of $216 million and $98 million of proceeds from renewable tax credits transferred to other corporate taxpayers in 2024 and 2023, respectively.\n•\nReductions in Iowa corporate income tax rates resulting from tax reform enacted in 2022 are expected to provide cost benefits to IPL’s electric and gas customers in the future.  IPL’s retail electric and gas customers began receiving these benefits with the new base rates effective October 1, 2024.\n•\nIPL maintaining flat base rates for its retail electric and gas customers from 2021 through September 30, 2024, as well as a retail electric base rate moratorium from October 2025 through September 2029 approved by the IUC in IPL’s most recent retail electric rate review.\n•\nSignificant fuel cost reductions beginning in 2023 with the completion of various solar facilities.\n•\nCompletion of a restructuring and voluntary employee separation program in 2024, which is expected to reduce operation and maintenance expenses in the future.\n•\nIssuance of new long-term debt at historically low interest rates for IPL ($300 million of 3.1% senior debentures due 2051) and WPL ($300 million of 1.95% green bonds due 2031) in 2021 and WPL ($600 million of 3.95% green bonds due 2032) in 2022.\n•\nIPL and WPL have entered into conditional commitments with the U.S. Department of Energy’s Loan Programs Office for loan guarantees of approximately $1.4 billion and $1.6 billion, respectively.  If finalized, such loans would provide low interest financing for IPL’s and WPL’s expected construction of renewable generation and energy storage projects.\n•\nIn July 2024, the U.S. Department of Energy Office of Clean Energy Demonstrations awarded WPL’s Columbia Energy Storage Project, an approximately 20 MW compressed CO2-based long-duration energy storage system at the Columbia Energy Center site, up to approximately $30 million in grant funding during construction of the project.  In addition, in October 2024, the U.S. Department of Energy Office of Grid Deployment selected WPL’s Smart Power Automation for Rural Communities program application to move into the final stage of award negotiations for up to $50 million in grant funding under the Grid Resilience and Innovation Partnerships Program.  If finalized, any grant proceeds would reduce the cost of the projects for WPL’s customers.\nMaking customer-focused investments - \nAlliant Energy’s strategic priorities include making significant customer-focused investments toward more reliable, resilient, and sustainable customer energy solutions.  Alliant Energy’s strategy drives a capital allocation process focused on: 1) transitioning its generation portfolio to meet the growing interest and needs of customers for reliable and sustainable sources of energy, 2) upgrading its electric and gas distribution systems to strengthen safety, reliability and resiliency, as well as enable distributed energy solutions in its service territories, and 3) enhancing its customers’ and employees’ experience with evolving technology and greater flexibility.\nKey Highlights\n (refer to “\nCustomer Investments\n” for details) - \n•\nOver the next five years, Alliant Energy currently plans to develop and/or acquire new generation investments to add flexibility with evolving load growth, including approximately 1,200 MW of new wind and solar generation in aggregate, approximately 1,000 MW of energy storage, approximately 750 MW of new natural gas resources, refurbishments at approximately 600 MW of existing wind farms, and improvements at approximately 650 MW of existing natural gas-fired EGUs and the conversion of existing coal-fired EGUs to natural gas.  Alliant Energy is currently evaluating the impact of potential additional large load growth customers and MISO’s seasonal resource adequacy requirements on its resource plans and will update these generation investment plans as needed in the future.\n•\nCompletion of new solar generation at WPL (1,089 MW in Wisconsin from 2022-2024) and IPL (400 MW in Iowa in 2024), and IPL’s refurbishment of the existing Franklin County wind farm in Iowa in 2024.\n•\nImproving reliability and resiliency with more underground electric distribution, and enabling distributed energy solutions with higher capacity lines.  Currently, approximately 28% of Alliant Energy’s electric distribution system is underground.\n•\nAlliant Energy continues to partner with its commercial and industrial customers in Iowa and Wisconsin to help develop renewable solutions to support their sustainability initiatives.\n•\nInstalling fiber optic routes between Alliant Energy’s facilities to enhance its communications network to improve resiliency and reliability of, and enable and strengthen, the integrated grid network focused on less densely populated rural areas.  Currently, approximately 1,000 miles of underground fiber optic routes have been installed.\n28\nTable of C\no\nntents\n                                    \nGrowing customer demand - \nAlliant Energy’s strategy supports expanding electric and gas usage in its service territories by promoting electrification initiatives and economic development.\nKey Highlights\n - \n•\nThe IUC’s order for IPL’s most recent retail electric rate review includes the creation of an individual customer rate tariff, allowing IPL to attract new load growth to its service territory.  In addition, Iowa’s Major Economic Growth Attraction program and Wisconsin’s sales and use tax exemption for qualified data centers, encourage economic development in Alliant Energy’s service territory.\n•\nIPL has entered into electric service agreements with two new customers, who currently expect to build data centers at the Big Cedar Industrial Center in Cedar Rapids, Iowa in IPL’s service territory.  These agreements include aggregate, maximum demands of approximately 1.9 gigawatts.  The electric service agreements are subject to IUC approval under the individual customer rate tariff that was included in the IUC’s September 2024 order for IPL’s retail electric rate review.  The actual timing and amount of increases in IPL’s load are subject to various factors, including interconnections and actual customer demand, and any executed or future agreements with customers are not expected to result in immediate increases in load.\n•\nVarious development-ready sites, which are rail-served and in close proximity to a variety of transportation options, are located throughout Alliant Energy’s service territories.\nRESULTS OF OPERATIONS\nFinancial Results Overview\n - \nThe table below includes diluted EPS for Utilities and Corporate Services, ATC Holdings, and Non-utility and Parent, which are non-GAAP financial measures.  Alliant Energy believes these non-GAAP financial measures are useful to investors because they facilitate an understanding of performance and trends, and provide additional information about Alliant Energy’s operations on a basis consistent with the measures that management uses to manage its operations and evaluate its performance.  Alliant Energy’s net income and EPS attributable to Alliant Energy common shareowners were as follows (dollars in millions, except per share amounts):\n2024\n2023\nIncome (Loss)\nEPS\nIncome (Loss)\nEPS\nUtilities and Corporate Services\n$722\n$2.81\n$724\n$2.86\nATC Holdings\n40\n0.16\n35\n0.14\nNon-utility and Parent\n(72)\n(0.28)\n(56)\n(0.22)\nAlliant Energy Consolidated\n$690\n$2.69\n$703\n$2.78\nAlliant Energy’s Utilities and Corporate Services net income decreased by $2 million in 2024 compared to 2023.  The decrease was primarily due to an asset valuation charge for IPL’s Lansing Generating Station as a result of the IUC order for IPL’s retail electric rate review, estimated temperature impacts on retail electric and gas sales, restructuring and voluntary separation charges, an ARO charge allocated to the steam business at IPL due to the revised CCR Rule, higher depreciation and financing expenses, and lower \nAFUDC.  These items were partially offset by higher revenue requirements from capital investments.\nAlliant Energy’s Non-utility and Parent net income decreased by $16 million in 2024 compared to 2023, primarily due to higher financing expense.\n29\nTable of C\no\nntents\n                                    \nNet Income Variances\n - \nThe following items contributed to increased (decreased) net income for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nRevenues:\nChanges in electric utility (Refer to \ndetails below\n)\n$27\n($14)\n$41\nChanges in gas utility (Refer to \ndetails below\n)\n(75)\n(50)\n(25)\nChanges in other utility\n2\n—\n2\nChanges in total revenues\n(46)\n(64)\n18\nOperating expenses:\nChanges in electric production fuel and purchased power (Refer to \ndetails below\n)\n108\n13\n96\nChanges in electric transmission service (Refer to \ndetails below\n)\n(30)\n3\n(33)\nChanges in cost of gas sold (Refer to \ndetails below\n)\n75\n43\n33\nAsset valuation charge for IPL’s Lansing Generating Station in 2024 (Refer to \nNote 2\n for details)\n(60)\n(60)\n—\nChanges in other operation and maintenance (Refer to \ndetails below\n)\n(1)\n(5)\n(8)\nChanges in depreciation and amortization (Higher primarily due to solar generation placed in service in 2024 and 2023, as well as WPL’s amortization of liquidated damages related to West Riverside procurement contracts, which resulted in reductions to depreciation and amortization expenses in 2023, and updated electric depreciation rates for IPL effective October 1, 2024)\n(96)\n(16)\n(77)\nChanges in taxes other than income taxes\n(7)\n(3)\n(4)\nChanges in total operating expenses\n(11)\n(25)\n7\nChanges in operating income\n(57)\n(89)\n25\nOther income and deductions:\nChanges in interest expense (Higher primarily due to financings completed in 2024 and 2023)\n(55)\n(22)\n(16)\nChanges in AFUDC (Primarily due to changes in levels of CWIP balances related to solar generation and energy storage, and IPL’s refurbishment of the existing Franklin County wind farm)\n(25)\n22\n(47)\nChanges in Other\n6\n14\n(11)\nChanges in total other income and deductions\n(74)\n14\n(74)\nChanges in income before income taxes\n(131)\n(75)\n(49)\nChanges in income taxes\n (Refer to \nNote \n1\n1\n for details)\n118\n71\n49\nChanges in net income\n($13)\n($4)\n$—\n30\nTable of C\no\nntents\n                                    \nElectric and Gas Revenues and Sales Summary\n - \nElectric and gas revenues (in millions), and MWh and Dth sales (in thousands), were as follows:\nElectric\nGas\nRevenues\nMWhs Sold\nRevenues\nDths Sold\n2024\n2023\n2024\n2023\n2024\n2023\n2024\n2023\nAlliant Energy\nRetail\n$3,009\n \n$3,008 \n24,569\n \n24,940 \n$419\n \n$495 \n43,489\n \n46,405 \nSales for resale:\nWholesale\n200\n \n213 \n2,783\n \n2,859 \nN/A\nN/A\nN/A\nN/A\nBulk power and other\n86\n \n71 \n5,620\n \n4,730 \nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n77\n \n53 \n57\n \n58 \n46\n \n45 \n123,386\n \n115,177 \n$3,372\n \n$3,345 \n33,029\n \n32,587 \n$465\n \n$540 \n166,875\n \n161,582 \nIPL\nRetail\n$1,662\n \n$1,661 \n13,620\n \n13,909 \n$223\n \n$273 \n21,640\n \n23,128 \nSales for resale:\nWholesale\n61\n \n62 \n750\n \n766 \nN/A\nN/A\nN/A\nN/A\nBulk power and other\n(6)\n11 \n1,138\n \n1,465 \nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n30\n \n27 \n32\n \n32 \n27\n \n27 \n43,075\n \n43,232 \n$1,747\n \n$1,761 \n15,540\n \n16,172 \n$250\n \n$300 \n64,715\n \n66,360 \nWPL\nRetail\n$1,347\n \n$1,347 \n10,949\n \n11,031 \n$196\n \n$222 \n21,849\n \n23,277 \nSales for resale:\nWholesale\n139\n \n151 \n2,033\n \n2,093 \nN/A\nN/A\nN/A\nN/A\nBulk power and other\n92\n \n60 \n4,482\n \n3,265 \nN/A\nN/A\nN/A\nN/A\nTransportation/Other\n47\n \n26 \n25\n \n26 \n19\n \n18 \n80,311\n \n71,945 \n$1,625\n \n$1,584 \n17,489\n \n16,415 \n$215\n \n$240 \n102,160\n \n95,222 \nSales Trends and Temperatures\n -\n Alliant Energy’s retail electric sales volumes decreased 1% in 2024 compared to 2023, primarily due to changes in sales volumes at IPL’s industrial customers due to standby service customers that can use other generation, and changes in temperatures.  Alliant Energy’s retail gas sales volumes decreased 6% in 2024 compared to 2023, primarily due to changes in temperatures.\nEstimated decreases to operating income from the impacts of temperatures were as follows (in millions):\nElectric\nGas\n2024\n2023\nChange\n2024\n2023\nChange\nIPL\n($14)\n($1)\n($13)\n($12)\n($8)\n($4)\nWPL\n(15)\n(5)\n(10)\n(10)\n(6)\n(4)\nTotal Alliant Energy\n($29)\n($6)\n($23)\n($22)\n($14)\n($8)\nElectric Sales for Resale - Bulk Power and Other\n - \nBulk power and other volume changes were due to changes in sales in the wholesale energy markets operated by MISO.  These changes are impacted by several factors, including the availability and dispatch of Alliant Energy’s EGUs and electricity demand within these wholesale energy markets.  Changes in bulk power and other revenues were largely offset by changes in fuel-related costs, and therefore did not have a significant impact on operating income.\nGas Transportation/Other\n - \nGas transportation/other sales volume changes were largely due to changes in the gas volumes supplied to Alliant Energy’s natural gas-fired EGUs caused by the availability and dispatch of such EGUs.\n31\nTable of C\no\nntents\n                                    \nElectric Utility Revenue Variances\n - \nThe following items contributed to increased (decreased) electric utility revenues for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nHigher revenue requirements (a)(b)\n$240\n$85\n$155\nHigher (lower) sales for resale bulk power and other revenues (c)\n15\n(17)\n32\nDeferral of incremental solar generation construction costs at WPL in 2024 (Refer to \nNote 3\n)\n12\n—\n12\nLower revenues primarily due to changes in retail electric fuel-related costs at WPL, and credits on IPL’s customers’ bills related to production tax credits through its fuel-related cost recovery mechanism (Refer to \nElectric Production Fuel and Purchased Power Expenses Variances\n below) (a)(b)\n(142)\n(42)\n(100)\nChanges in WPL refunds/collections of previous over-/under-collection of retail electric fuel-related costs (offset in electric production fuel and purchased power expenses) (Refer to \nNote 2\n)\n(33)\n—\n(33)\nEstimated changes in sales volumes caused by temperatures\n(23)\n(13)\n(10)\nLower revenues at IPL due to credits on customers’ bills through the tax benefit rider in 2024 (partially offset by changes in income taxes) (a)\n(16)\n(16)\n—\nLower wholesale revenues at WPL primarily due to lower fuel-related costs and lower sales\n(13)\n(1)\n(12)\nLower revenues at IPL related to changes in recovery amounts for energy efficiency costs through the energy efficiency rider (mostly offset by changes in energy efficiency expense) (Refer to \nNote \n1(g)\n)\n(13)\n(13)\n—\nChanges in WPL electric fuel-related costs, net of recoveries (d)\n(10)\n—\n(10)\nOther\n10\n3\n7\n$27\n($14)\n$41\n(a)\nIn September 2024, the IUC issued an order authorizing an annual base rate increase of $185 million for IPL’s retail electric customers, with customers receiving partially offsetting credits for the first 12 months through a tax benefit rider, for the October 2024 through September 2025 forward-looking Test Period.  Rate changes were effective October 1, 2024, which reflect revenue requirement impacts of increasing electric rate base including investments in solar generation, updated depreciation rates, and certain incremental costs incurred resulting from the 2020 derecho windstorm.  In addition, effective October 1, 2024, IPL’s renewable energy rider was discontinued, and certain production tax credits are credited to IPL’s retail electric customers through IPL’s fuel-related cost recovery mechanism.  Credits on IPL’s customers’ bills are expected to be offset by a reduction in income tax expense.\n(b)\nIn December 2023, the PSCW issued an order authorizing an annual base rate increase of $49 million for WPL’s retail electric customers, covering the 2024 forward-looking Test Period, which reflects revenue requirement impacts of increasing electric rate base and lower forecasted fuel-related expenses.\n(c)\nAlliant Energy’s and WPL’s sales for resale bulk power and other revenues increased primarily due to higher volumes and higher prices for electricity sold by WPL to MISO wholesale energy markets.  Alliant Energy’s increase was partially offset by decreased sales for resale bulk power and other revenues at IPL primarily due to lower prices for electricity and capacity sold by IPL to MISO wholesale energy markets.  These changes were largely offset by changes in fuel-related costs.\n(d)\nWPL’s cost recovery mechanism for retail fuel-related expenses supports deferrals of amounts that fall outside an approved fuel monitoring range of forecasted fuel-related expenses determined by the PSCW each year.  The difference between revenue collected and actual fuel-related expenses incurred within the fuel monitoring range increases or decreases Alliant Energy’s and WPL’s electric utility revenues.  WPL estimates the increase (decrease) to electric utility revenues from amounts within the fuel monitoring range were approximately ($4) million and $6 million in 2024 and 2023, respectively.\nGas Utility Revenue Variances\n - \nThe following items contributed to increased (decreased) gas utility revenues for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nLower revenues due to changes in gas costs (Refer to \nCost of Gas Sold Expense Variances\n below)\n($75)\n($42)\n($33)\nEstimated changes in sales volumes caused by temperatures\n(8)\n(4)\n(4)\nLower revenues at IPL related to changes in recovery amounts for energy efficiency costs through the energy efficiency rider (mostly offset by changes in energy efficiency expense)  (Refer to \nNote \n1(g)\n)\n(6)\n(6)\n—\nHigher revenue requirements (a) (b)\n14\n2\n12\n($75)\n($50)\n($25)\n32\nTable of C\no\nntents\n                                    \n(a)\nIn September 2024, the IUC issued an order authorizing an annual base rate increase of $10 million for IPL’s retail gas customers, for the October 2024 through September 2025 forward-looking Test Period.  Rate changes were effective October 1, 2024, which reflect revenue requirement impacts of increasing gas rate base.\n(b)\nIn December 2023, the PSCW issued an order authorizing an annual base rate increase of $13 million for WPL’s retail gas customers, covering the 2024 forward-looking Test Period, which reflects revenue requirement impacts of increasing gas rate base.\nElectric Production Fuel and Purchased Power Expenses Variances\n - \nThe following items contributed to (increased) decreased electric production fuel and purchased power expenses for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nLower electric production fuel costs (a)\n$108\n$72\n$36\nChanges in WPL refunds/collections of previous over-/under-collection of retail electric fuel-related costs (offset in electric utility revenue) (Refer to \nNote 2\n)\n33\n—\n33\nChanges in regulatory recovery of retail electric fuel-related costs (Refer to \nNote \n1(g)\n)\n21\n(21)\n42\nHigher purchased power expense (b)\n(49)\n(38)\n(11)\nOther\n(5)\n—\n(4)\n$108\n$13\n$96\n(a)\nElectric production fuel costs decreased at IPL primarily due to lower natural gas prices in 2024 compared to 2023, and lower natural gas and coal volumes due to lower dispatch of IPL’s EGUs in 2024.  Electric production fuel costs decreased at WPL primarily due to lower natural gas prices in 2024 compared to 2023, and higher dispatch of WPL’s renewable EGUs in 2024, partially offset by higher coal volumes due to higher dispatch of WPL’s coal-fired EGU’s in 2024.\n(b)\nPurchased power expense increased primarily due to higher prices for electricity purchased by IPL and WPL, and higher volumes of electricity purchased at IPL due to lower dispatch of IPL’s EGUs in 2024, partially offset by lower volumes of electricity purchased at WPL due to higher dispatch of WPL’s EGUs in 2024.\nElectric Transmission Service Expense Variances\n - \nThe following items contributed to (increased) decreased electric transmission service expense for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nChanges in regulatory recovery for the difference between actual electric transmission service costs and those costs used to determine rates (Refer to \nNote 1(g)\n)\n($28)\n($7)\n($21)\nOther (primarily due to changes in transmission service costs provided by third parties)\n(2)\n10\n(12)\n($30)\n$3\n($33)\nCost of Gas Sold Expense Variances\n - \nThe following items contributed to (increased) decreased cost of gas sold expense for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nLower natural gas prices and lower retail gas volumes \n$105\n$66\n$39\nChanges in the regulatory recovery of gas costs (Refer to \nNote 1(g\n)\n)\n(30)\n(24)\n(6)\nOther\n—\n1\n—\n$75\n$43\n$33\nOther Operation and Maintenance Expenses Variances\n \n- The following items contributed to (increased) decreased other operation and maintenance expenses for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nRestructuring and voluntary employee separation charges in 2024 (excluding payroll taxes) (Refer to \nNote\n 12(a)\n)\n($27)\n($13)\n($12)\nARO charge for steam assets at IPL in 2024 (Refer to \nNote 13\n)\n(20)\n(20)\n—\nLower energy efficiency expense at IPL (mostly offset by lower revenues)\n20\n20\n—\nLower generation and energy delivery expenses\n11\n3\n8\nOther\n15\n5\n(4)\n($1)\n($5)\n($8)\nOther Future Considerations\n - \nIn addition to items discussed in this report, the following key items could impact Alliant Energy’s, IPL’s and WPL’s future financial condition or results of operations:\n•\nFinancing Plans - \nAlliant Energy currently expects to issue up to $25 million of common stock in 2025 through its Shareowner Direct Plan.  In 2025, IPL currently expects to issue up to $600 million of long-term debt, and AEF and/or Alliant Energy at the parent company level expect to issue up to $600 million of long-term debt in aggregate.  IPL and AEF each have $300 million of long-term debt maturing in 2025.\n33\nTable of C\no\nntents\n                                    \n•\nCommon Stock Dividends - \nAlliant Energy announced a 6% increase in its targeted 2025 annual common stock dividend to $2.03 per share, which is equivalent to a quarterly rate of $0.5075 per share, beginning with the February 2025 dividend payment.  The timing and amount of future dividends is subject to approval of quarterly dividend declarations from Alliant Energy’s Board of Directors, and is dependent upon earnings expectations, capital requirements, and general financial business conditions, among other factors.\n•\nCash Flows From Operating Activities -\n Alliant Energy, IPL and WPL currently expect an increase in future cash flows from operating activities resulting from the transfer of future renewable tax credits to other corporate taxpayers pursuant to the Inflation Reduction Act of 2022.  In addition, Alliant Energy, IPL and WPL currently expect an increase in future cash flows from operating activities resulting from higher earnings on increasing rate base at IPL and WPL.\n•\nHigher Earnings on Increasing Rate Base - \nAlliant Energy, IPL and WPL currently expect increases in electric utility and gas utility revenues in 2025 compared to 2024 due to impacts from increasing revenue requirements related to investments in the utility business.  In addition, Alliant Energy, IPL and WPL currently expect a decrease in the effective income tax rate in 2025 compared to 2024 due to additional tax credits from renewable generation and energy storage projects placed in service in 2024 and/or expected to be placed in service in 2025.  A majority of the differences between actual renewable tax credits and renewable tax credits used to determine rates are recorded in regulatory assets or regulatory liabilities on the balance sheets until they are reflected in future billings to customers.  Investment tax credits resulting from IPL energy storage projects expected to be placed in service in 2025 may be utilized to offset any revenue deficiency on an annual basis up to the earnings sharing mechanism threshold included in IPL’s retail electric rate review settlement agreement discussed in “\nRate Matters\n.”\n•\nSales Trends and Temperatures - \nIn July 2025, IPL’s wholesale power agreement with Southern Minnesota Energy Cooperative (SMEC) will expire (sales to SMEC represented approximately 5% of IPL’s total electric sales in 2024), which is not expected to have a material impact on Alliant Energy’s or IPL’s future financial condition and results of operations.  In 2024, warmer than normal temperatures in the winter and cooler than normal temperatures in the summer in Alliant Energy’s, IPL’s and WPL’s service territories resulted in lower retail electric and gas sales volumes and operating income.\n•\nOther Operation and Maintenance Expenses\n - Alliant Energy, IPL and WPL currently expect a decrease in other operation and maintenance expenses in 2025 compared to 2024 largely due to the asset valuation charge for IPL’s Lansing Generating Station and ARO charge for steam assets at IPL recorded in 2024, charges for restructuring and voluntary employee separation recorded in 2024, as well as expected future cost savings related to Alliant Energy’s restructuring activities.  These items are expected to be partially offset by higher generation maintenance and energy delivery expenses.\n•\nDepreciation and Amortization Expense -\n Alliant Energy, IPL and WPL currently expect an increase in depreciation and amortization expense in 2025 compared to 2024 due to capital projects placed in service in 2024 and 2025, and updated electric depreciation rates for IPL effective October 1, 2024.\n•\nInterest Expense - \nAlliant Energy, IPL and WPL currently expect an increase in interest expense in 2025 compared to 2024 due to financings completed in 2024 and planned in 2025 as discussed above.\nCUSTOMER INVESTMENTS\nAlliant Energy’s, IPL’s and WPL’s strategic priorities include making significant customer-focused investments toward reliable, resilient and sustainable customer energy solutions.  These priorities include:\nResource Planning\nAlliant Energy’s current resource plan continues to add resources in Iowa and Wisconsin, and serves as a guide to meet customer demand for affordable, safe, reliable and sustainable energy.  Over the next five years, Alliant Energy currently plans to develop and/or acquire new generation investments to add flexibility with evolving load growth, including approximately 1,200 MW of new wind and solar generation in aggregate, approximately 1,000 MW of energy storage, approximately 750 MW of new natural gas resources, refurbishments at approximately 600 MW of existing wind farms, and improvements at approximately 650 MW of existing natural gas-fired EGUs and the conversion of existing coal-fired EGUs to natural gas.  Alliant Energy is currently evaluating the impact of potential additional large load growth customers and MISO’s seasonal resource adequacy requirements on its resource plans and will update these generation investment plans as needed in the future.  Estimated capital expenditures for these planned projects for 2025 through 2028 are included in the “Generation” section in the construction and acquisition table in “\nLiquidity and Capital Resources\n.”  Information on IPL’s and WPL’s regulatory filings and/or approvals for future generation and energy storage projects, as well as recently completed projects, are as follows:\nWPL’s Generation and Energy Storage Projects -\nSolar\n - In 2022 through 2024, WPL completed 1,089 MW of new solar generation projects in Wisconsin, including the Grant County facility (200 MW) in 2024.  Refer to \nNote \n3\n for discussion of the construction costs associated with these projects.\nEnergy Storage\n - In 2023, the PSCW issued orders authorizing WPL to construct, own and operate energy storage at the Grant County (100 MW) and Wood County (75 MW) solar projects in Wisconsin, which is currently expected to be placed in service in the second half of 2025, and at the Edgewater Generation Station in Wisconsin (approximately 99 MW), which is currently expected to be placed in service in 2026.\nIn July 2024, the U.S. Department of Energy Office of Clean Energy Demonstrations awarded WPL’s Columbia Energy Storage Project, an approximately 20 MW compressed CO2-based long-duration energy storage system at the Columbia \n34\nTable of C\no\nntents\n                                    \nEnergy Center site, up to approximately $30 million in grant funding during construction of the project.  In August 2024, WPL filed a CA application with the PSCW for construction approval of the energy storage system.  A decision from the PSCW is currently expected in the second quarter of 2025.  If finalized, any grant proceeds would reduce the cost of the project for WPL’s customers.\nExisting Natural Gas-Fired Electric Generating Unit Improvements\n - In April 2024, the PSCW issued orders authorizing WPL to construct improvements at the existing natural gas-fired Neenah Energy Facility and Sheboygan Falls Energy Facility, which would increase the capacity and efficiency of the EGUs.\nExisting Wind Farm Refurbishment\n - In July 2024, WPL filed a CA application with the PSCW for approval to refurbish the Bent Tree wind farm, which would be eligible for production tax credits under the Inflation Reduction Act of 2022.  A decision from the PSCW is currently expected in the first quarter of 2025.\nIPL’s Generation and Energy Storage Projects -\nSolar\n - In 2024, IPL completed new solar generation projects in Iowa, including the Wever facility (150 MW), the Creston facility (50 MW), and the first (50 MW) and second (150 MW) phases of the Pleasant Creek facility.  Refer to \nNote 3\n for discussion of the construction costs associated with these projects.\nEnergy Storage\n - IPL received approval from the IUC to construct, own and operate up to approximately 140 MW of energy storage in Iowa (100 MW at the Wever project and 40 MW at the Creston project), which is currently expected to be placed in service in 2025 and 2026.\nNatural Gas-fired Electric Generating Unit\n - In February 2025, IPL filed request with the IUC for approval to construct, own and operate the Cedar River Generating Station, a 94 MW natural gas-fired EGU using Reciprocating Internal Combustion Engine (RICE) technology, at the site of IPL’s Prairie Creek Generation Station.  A decision from the IUC is currently expected in the fourth quarter of 2025.\nExisting Wind Farm Refurbishment\n - In 2024, IPL completed the refurbishment of the existing Franklin County wind farm in Iowa.  IPL currently expects the refurbishment of the existing Whispering Willow - East wind farm to be completed in 2026.  These projects are eligible for production tax credits under the Inflation Reduction Act of 2022.\nWPL’s West Riverside Natural Gas-fired Generating Station - \nIn 2020, WPL completed the construction of West Riverside, a 723 MW natural gas-fired combined-cycle EGU in Beloit, Wisconsin.  WPL entered into agreements with neighboring utilities and electric cooperatives that provide each of them options to purchase a partial ownership interest in West Riverside.  The purchase price for such options is based on the ownership interest acquired and the net book value of West Riverside on the date of the purchase.  The timing and ownership amount of the options are as follows:\nCounterparty\nOption Amount and Timing\nWEC Energy Group, Inc. (WEC)\nIn 2023 and 2024, WEC acquired 200 MW in aggregate, pursuant to PSCW and FERC approval (a)\nMadison Gas and Electric Company (MGE)\nIn 2023 and 2024, MGE acquired 50 MW in aggregate, pursuant to PSCW and FERC approval\nElectric cooperatives\nApproximately 60 MW were acquired in 2018\n(a)\nWPL may exercise reciprocal options, subject to approval by the PSCW, to purchase up to 200 MW of any natural-gas combined-cycle EGU that WEC places in service prior to May 2030.\nPlant Retirements and Fuel Switching - \nThe current strategy includes the retirement, or fuel switch from coal to natural gas, of various EGUs in the next several years.  IPL currently expects to retire Prairie Creek Unit 1 and fuel switch Prairie Creek Unit 3 (65 MW in aggregate) by December 31, 2025.  WPL currently expects to convert the coal-fired Edgewater Unit 5 (414 MW) to natural gas in 2028.  In addition, WPL currently plans to cease coal operations at Columbia Units 1 and 2 (595 MW in aggregate) by the end of 2029, as well as evaluate the conversion of Columbia Unit 1 and/or Unit 2 to natural gas.  Alliant Energy, IPL and WPL are working with MISO, state regulatory commissions and other regulatory agencies, as required, to determine the timing of these actions, which are subject to change depending on operational, regulatory, market and other factors.  Refer to \nNote 3\n for additional details on Columbia Units 1 and 2, and Edgewater Unit 5.\nEnvironmental Stewardship - \nAlliant Energy’s environmental stewardship is focused on the implementation of a responsible energy strategy to meet its customers’ energy needs affordably, safely, reliably and sustainably.  Alliant Energy periodically reviews and updates this strategy to reflect changes needed to support the transition to a low-carbon economy.  Alliant Energy’s current voluntary environmental-related goals and achievements include the following:\n•\nExceeded its 2020 targets by reducing air emissions for sulfur dioxide by over 90%, nitrogen oxides by over 80% and mercury by over 90% from 2005 levels.\n•\nBy 2030, reduce GHG emissions from its utility operations by 50% from 2005 levels, reduce its electric utility water supply by 75% from 2005 levels and electrify 100% of its owned light-duty fleet vehicles.\n•\nBy 2040, eliminate all coal-fired EGUs from its generating fleet.\n•\nBy 2050, aspire to achieve net-zero GHG emissions from its utility operations.\n35\nTable of C\no\nntents\n                                    \nAlliant Energy’s aspirational GHG goal includes EPA reportable emissions based on applicable regulatory compliance requirements for CO2, methane and nitrous oxide from its owned fossil-fueled EGUs and distribution of natural gas.  In addition, Alliant Energy’s environmental stewardship efforts include a goal to partner to plant more than 1 million trees by the end of 2030.  Future updates to sustainable energy plans and attaining these goals will depend on future economic developments, evolving energy technologies and emerging trends in Alliant Energy’s service territories.\nOther Customer-focused Investments\nElectric and Gas Distribution Systems - \nCustomer-focused investments include replacing, modernizing and upgrading infrastructure in the electric and gas distribution systems.  Electric system investments will focus on areas such as improving reliability and resiliency with more underground electric distribution and enabling distributed energy solutions with higher capacity lines.  Gas system investments will focus on pipeline replacement to ensure safety and pipeline expansion to support reliability and economic development.  Estimated capital expenditures for expected and current electric and gas distribution infrastructure projects for 2025 through 2028 are included in the “Electric and gas distribution systems” lines in the construction and acquisition expenditures table in “\nLiquidity and Capital Resources\n.”\nGrid Resilience and Innovation Partnerships Program for WPL -\n In October 2024, the U.S. Department of Energy Office of Grid Deployment selected WPL’s Smart Power Automation for Rural Communities program application to move into the final stage of award negotiations for up to $50 million in grant funding under the Grid Resilience and Innovation Partnerships Program.  WPL currently expects to submit project plans to the PSCW in 2025 when award negotiations are nearing completion.  If finalized, any grant proceeds would reduce the cost of the project for WPL’s customers.\nFiber Optic Telecommunication Network - \nAlliant Energy is currently installing fiber optic routes between its facilities to enhance its communications network to improve resiliency and reliability of, and enable and strengthen, the integrated grid network focused on less densely populated rural areas.\nGas Pipeline Expansion - \nIPL and WPL currently expect to make investments to extend various gas distribution systems to provide natural gas to unserved or underserved areas in their service territories.\nGas Pipeline Safety -\n The Pipeline and Hazardous Materials Safety Administration published various final rules from 2019 through 2024 that updated safety requirements for gas transmission pipelines, and updated procedures were implemented to address these rules.  Plans to address certain requirements for specific pipelines were developed and implemented, with identified remediation efforts to be completed by July 2035.  In response to these rule changes, Alliant Energy, IPL and WPL have been assessing, testing and modifying certain of IPL’s and WPL’s pipelines, and updating practices for assessment and operation of all IPL and WPL pipelines.  Alliant Energy, IPL, and WPL also continue to evaluate the impact of these final rules and resulting remediation plans on their financial condition and results of operations.\nTechnology - \nAlliant Energy, IPL and WPL currently plan to make investments in technology to enhance productivity and efficiency through automation, customer self-service and telework.  Estimated capital expenditures for expected and current technology projects for 2025 through 2028 are included in the “Other” line in the construction and acquisition expenditures table in “\nLiquidity and Capital Resources\n.”\nNon-utility business - \nAlliant Energy continues to explore growth of its Travero businesses and other limited scope opportunities outside of, but complementary to, Alliant Energy’s core utility business.  This non-utility strategy continues to evolve through exploration of modest strategic opportunities that are accretive to earnings and cash flows.\nRATE MATTERS\nRate Reviews\nRetail Base Rate Filings - \nBase rate changes reflect both returns on additions to infrastructure and recovery of changes in costs incurred or expected to be incurred to provide electric and gas service to retail customers.  Given that a portion of the rate changes will offset changes in costs, revenues from rate changes should not be expected to result in an equal change in net income for either IPL or WPL.\nIPL’s Retail Electric and Gas Rate Reviews (October 2024 Through September 2025 Forward-looking Test Period)\n - In September 2024, the IUC issued an order for IPL’s retail electric and gas rate reviews for the October 2024 through September 2025 forward-looking Test Period with rate changes effective October 1, 2024.  Key drivers for the rate review included revenue requirement impacts of increasing electric and gas rate base, including investments in solar generation, as well as updated depreciation rates and certain incremental costs incurred resulting from the 2020 derecho windstorm.  The IUC’s order included the following provisions:\n•\nAnnual retail electric base rate increase of $185 million, with customers receiving partially offsetting credits for the first 12 months through a tax benefit rider, and a subsequent retail electric base rate moratorium through September 2029;\n•\nDuring the moratorium, IPL may request updated rates if its actual return on common equity is 100 or more basis points below the authorized return on common equity for a single calendar year or 50 or more basis points below the authorized return on common equity for two consecutive years, and/or if a material change in laws or regulations causes the moratorium to become unsustainable;\n•\nAnnual retail gas base rate increase of $10 million;\n36\nTable of C\no\nntents\n                                    \n•\nElectric earnings sharing mechanism beginning in calendar year 2025, where IPL would apply excess earnings to the remaining net book value of IPL’s highest earning asset with advance ratemaking principles (currently the Emery Generation Station) based on its authorized return on common equity as follows;\nThreshold Above Authorized\nReturn on Common Equity\nSharing\nFirst 50 basis points\n75% customers, 25% IPL\n>50 to 100 basis points\n50% customers, 50% IPL\n>100 to 150 basis points\n25% customers, 75% IPL\n>150 basis points\n100% customers\n•\nInvestment tax credits resulting from renewable generation and energy storage projects may be utilized to offset any revenue deficiency on an annual basis up to IPL’s return on common equity threshold; any remaining investment tax credits, net of the cost of transferability, that are not used to offset any revenue deficiency, will be deferred by IPL and carried forward to offset any revenue deficiency in future years;\n•\nCreation of an individual customer rate tariff, which would allow IPL to attract new load growth to its service territory;\n•\nElectric distribution system investment cap not to exceed $900 million in aggregate or $325 million in any given year from 2026 through 2029, with certain exceptions;\n•\nIPL to retain renewable production tax credits from new generation resources not included in base rates and the repowering of existing wind farms, including the Franklin County wind farm refurbishment, as well as retain energy margins for new generation resources and energy storage;\n•\nDiscontinuation of the renewable energy rider; and\n•\nA return of the remaining net book value of the Lansing Generating Station; however, the IUC’s order does not include a return on the remaining net book value of Lansing, resulting in Alliant Energy and IPL recording a pre-tax non-cash charge of $60 million to “Asset valuation charge for IPL’s Lansing Generating Station” in their income statements in 2024.\nWPL’s Retail Electric and Gas Rate Reviews (2024/2025 Forward-looking Test Period)\n - In December 2023, the PSCW issued an order authorizing annual base rate increases of $49 million and $13 million for WPL’s retail electric and gas customers, respectively, effective January 1, 2024, for the 2024 forward-looking Test Period.  The PSCW’s order also authorized WPL to implement an additional $60 million increase in annual rates for its retail electric customers, effective January 1, 2025, for the 2025 forward-looking Test Period.  The key drivers for the annual base rate increases include revenue requirement impacts of increasing electric and gas rate base, including investments in solar generation and energy storage.  The order extends, with certain modifications, an earnings sharing mechanism through 2025.  Under the earnings sharing mechanism, WPL will defer a portion of its earnings if its annual regulatory return on common equity exceeds 9.95% during the 2024/2025 Test Period.  WPL must defer 50% of its excess earnings between 9.95% and 10.55%, and 100% of any excess earnings above 10.55%.  The PSCW also authorized WPL to defer the incremental under-/over-collection of solar and energy storage renewable tax credits that are different than the approved amounts.  Refer to \nN\note \n3\n for discussion of the PSCW’s 2024 orders related to the deferral of, and deferral of a return on, incremental solar generation construction costs in 2024 and 2025.\nWPL’s Retail Fuel-related Rate Filing (2023 Forward-looking Test Period)\n - In August 2024, the PSCW issued an order authorizing WPL to refund $34 million, plus interest, to its retail electric customers in 2024 for fuel-related costs incurred by WPL in 2023 that were lower than fuel-related costs used to determine rates for such period.\nRate Review Details\n - Details related to IPL’s and WPL’s key jurisdictions were as follows:\nAverage\nAuthorized Return\nCommon Equity\nRegulatory\nRate Base\non Common\nComponent of Regulatory\nEffective\nBody\n(in millions)\nEquity (a)\nCapital Structure\nDate\nIPL Retail Electric (October 2024-September 2025 Test Period) (b)\nMarshalltown\nIUC\n$484\n11.00%\n51.0%\n10/1/2024\nEmery\nIUC\n90\n12.23%\n51.0%\n10/1/2024\nWhispering Willow - East\nIUC\n124\n11.70%\n51.0%\n10/1/2024\nWind\nIUC\n1,218\n11.00%\n51.0%\n10/1/2024\nSolar\nIUC\n511\n10.25%\n51.0%\n10/1/2024\nOther (c)\nIUC\n4,852\n9.34%\n51.0%\n10/1/2024\nIPL Retail Gas (October 2024-September 2025 Test Period) (b)\nIUC\n630\n9.65%\n51.0%\n10/1/2024\nIPL Wholesale Electric\nFERC\n170\n10.97%\n50.0%\n1/1/2024\nWPL Retail Electric and Gas\nElectric (2025 Test Period) (d)\nPSCW\n5,774\n9.80%\n53.7%\n1/1/2025\nGas (2025 Test Period) (d)\nPSCW\n532\n9.80%\n53.7%\n1/1/2025\nWPL Wholesale Electric\nFERC\n510\n10.90%\n55.0%\n1/1/2024\n(a)\nAuthorized returns on common equity may not be indicative of actual returns earned or projections of future returns.\n37\nTable of C\no\nntents\n                                    \n(b)\nAverage rate base amounts reflect IPL’s allocated retail share of rate base and do not include CWIP and were calculated using a forecasted 13-month average for the test period.\n(c)\nAverage rate base amounts include assets that do not have advance rate-making principles (9.65% return on common equity), production tax credits carryforwards for 1,000 MW of wind generating facilities placed in service in 2019 and 2020 (5% return on common equity), as well as the portion of Whispering Willow - East that does not earn a return on investment.\n(d)\nAverage rate base amounts reflect WPL’s allocated retail share of rate base and do not include CWIP or a cash working capital allowance, and were calculated using a forecasted 13-month average for the test period.  The PSCW provides a return on selected CWIP and a cash working capital allowance by adjusting the percentage return on rate base.\nPlanned Rate Review\n - WPL currently expects to file a retail electric and gas rate review with the PSCW by the end of the second quarter of 2025 for the 2026/2027 forward-looking Test Period.  The key drivers for the anticipated filing include revenue requirement impacts of increasing electric and gas rate base.  Any rate changes granted from this pending request are expected to be effective on January 1, 2026, with a decision from the PSCW expected by the end of 2025.\nLEGISLATIVE MATTERS\nIn May 2024, the Major Economic Growth Attraction program was enacted in Iowa, which offers various tax incentives for up to two qualified businesses for certain large-scale projects with capital investments greater than $1 billion constructed on certified sites greater than 250 acres in Iowa.  The most significant provision of this program for Alliant Energy encourages economic development in IPL’s service territory.  Alliant Energy has various development-ready sites throughout Iowa, including the Big Cedar Industrial Center Mega-site in Cedar Rapids, Iowa, and the Prairie View Industrial Center Super Park in Ames, Iowa.\nIn May 2024, legislation was enacted in Iowa related to the advance rate-making principles for certain generation and energy storage investments located in Iowa.  The most significant provisions of this legislation for Alliant Energy would allow IPL to include energy storage and nuclear-fired generation projects in the advance rate-making principles request process prior to making these investments in Iowa, and require IPL to obtain a certificate of public convenience, use and necessity (GCU Certificate) from the IUC in order to construct energy storage projects.\nIn July 2023, legislation was enacted in Wisconsin, which creates a sales and use tax exemption for the sale of certain property for qualified data centers.  The most significant provision of this legislation for Alliant Energy encourages economic development in WPL’s service territory.\nIn August 2022, the Inflation Reduction Act of 2022 was enacted.  The most significant provisions of the legislation for Alliant Energy, IPL and WPL relate to a 10-year extension of tax credits for clean energy projects, a new production tax credit for eligible solar projects, a new stand-alone investment tax credit for energy storage projects and the right to transfer renewable tax credits generated after 2022 to other corporate taxpayers.  The new legislation also includes a requirement for corporations with income over $1 billion to pay a 15% minimum tax; however, Alliant Energy is currently below this income level.  Alliant Energy, IPL and WPL are utilizing various provisions of the new legislation to enhance the tax benefits expected from their current and planned renewable generation and energy storage projects, including transferring tax credits from such projects to other corporate taxpayers.  The impact of these changes is expected to result in more cost benefits for IPL’s and WPL’s customers, higher rate base amounts, additional financing needs expected to be satisfied with additional long-term debt and common stock issuances, and improvements in long-term cash flows over the life of the solar, energy storage and wind projects.  Repeal or amendment of the Inflation Reduction Act of 2022, or portions of the Inflation Reduction Act of 2022, could have an adverse impact on Alliant Energy’s, IPL’s and WPL’s financial condition and results of operations.  Refer to \nNote 1(c)\n for discussion of the transfer of renewable tax credits to other corporate taxpayers in 2023 and 2024.\nRefer to \nNote \n1\n1\n for discussion of Iowa tax reform enacted in 2022.\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\n -\n Alliant Energy, IPL and WPL expect to maintain adequate liquidity to operate their businesses and implement their strategy as a result of operating cash flows generated by their utility business, and available capacity under a single revolving credit facility and IPL’s sales of accounts receivable program, supplemented by periodic issuances of long-term debt and Alliant Energy equity securities.  As summarized below, Alliant Energy, IPL and WPL believe they have the ability to generate and obtain adequate amounts of cash to meet their requirements and plans for cash in the next 12 months and beyond.\nLiquidity Position\n - \nAt December 31, 2024, Alliant Energy had $81 million of cash and cash equivalents, $742 million ($275 million at the parent company, $250 million at IPL and $217 million at WPL) of available capacity under the single revolving credit facility and $40 million of available capacity at IPL under its sales of accounts receivable program.\nCapital Structure\n - \nAlliant Energy, IPL and WPL plan to maintain debt-to-total capitalization ratios that are consistent with investment-grade credit ratings, as well as maintain capital structures consistent with the authorized levels approved by IPL’s and WPL’s regulators.  Financial capital structures as of December 31, 2024 were as follows (Common Equity (CE); Long-term Debt (including current maturities) (LD); Short-term Debt (SD)):\n38\nTable of C\no\nntents\n                                    \nAlliant Energy, IPL and WPL intend to manage their capital structures and liquidity positions in such a way that facilitates their ability to raise funds reliably and on reasonable terms and conditions, while maintaining capital structures consistent with those approved by regulators.  In addition to capital structures, other important factors used to determine the characteristics of future financings include financial coverage ratios, capital spending plans, regulatory orders and rate-making considerations, levels of debt and equity imputed by rating agencies, market conditions, the impact of tax initiatives and legislation, and any potential proceeds from asset sales.  The PSCW factors certain imputed debt adjustments, including certain lease obligations, in establishing a regulatory capital structure as part of WPL’s retail rate reviews.  The IUC does not make any explicit adjustments for imputed debt in establishing capital ratios used in determining customer rates, although such adjustments are considered by IPL in recommending an appropriate capital structure.  Debt imputations by rating agencies include, among others, pension and OPEB obligations, the sales of accounts receivable program and certain lease obligations.\nCredit and Capital Markets\n - \nAlliant Energy, IPL and WPL maintain a single revolving credit facility to provide backstop liquidity to their commercial paper programs, and ensure a committed source of liquidity in the event the commercial paper market becomes disrupted.  In addition, IPL maintains a sales of accounts receivable program as an alternative financing source; however, if customer arrears were to exceed certain levels, IPL’s access to the program may be restricted.\nPrimary Sources and Uses of Cash\n -\n Alliant Energy’s most significant source of cash is from electric and gas sales to IPL’s and WPL’s customers.  Cash from these sales reimburses IPL and WPL for prudently-incurred expenses to provide service to their utility customers and generally provides IPL and WPL a return of and a return on the assets used to provide such services.  Capital needed to retire debt and fund capital expenditures related to large strategic projects is expected to be met primarily through external financings.\nCash Flows\n -\n Selected information from the cash flows statements was as follows (in millions):\nAlliant Energy\nIPL\nWPL\n2024\n2023\n2024\n2023\n2024\n2023\nCash, cash equivalents and restricted cash, January 1\n$63\n \n$24 \n$53\n \n$15 \n$7\n \n$5 \nCash flows from (used for):\nOperating activities\n1,167\n \n867 \n357\n \n261 \n761\n \n578 \nInvesting activities\n(1,547)\n(1,401)\n(684)\n(326)\n(724)\n(946)\nFinancing activities\n398\n \n573 \n303\n \n103 \n7\n \n370 \nNet increase (decrease)\n18\n \n39 \n(24)\n38 \n44\n \n2 \nCash, cash equivalents and restricted cash, December 31\n$81\n \n$63 \n$29\n \n$53 \n$51\n \n$7 \nOperating Activities - \nThe following items contributed to increased (decreased) operating activity cash flows for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nHigher collections from WPL’s retail electric and gas base rate increases\n$254\n$87\n$167\nChanges in income taxes paid/received (a)\n109\n58\n64\nChanges in levels of production fuel\n19\n2\n17\nTiming of WPL’s fuel-related cost recoveries from retail electric customers\n(75)\n—\n(75)\nChanges in the sales of accounts receivable at IPL\n(56)\n(56)\n—\nChanges in interest payments\n(56)\n(19)\n(17)\nDecreased collections from IPL’s and WPL’s retail customers caused by temperature impacts on electric and gas sales\n(31)\n(17)\n(14)\nOther (primarily due to other changes in working capital)\n136\n41\n41\n$300\n$96\n$183\n(a)\nRefer to the cash flows statements for details of renewable tax credits transferred to other corporate taxpayers in 2023 and 2024.\n39\nTable of C\no\nntents\n                                    \nIncome Tax Payments and Receipts\n - Income tax (payments) receipts were as follows (in millions):\n2024\n2023\nIPL\n$175\n$117\nWPL\n14\n(50)\nOther subsidiaries\n8\n21\nAlliant Energy\n$197\n$88\nAlliant Energy, IPL and WPL currently do not expect to make any significant federal income tax payments over the next few years based on their current credit carryforward positions; however, some tax payments and receipts may occur for state taxes and between consolidated group members (including IPL and WPL) under the tax sharing agreement between Alliant Energy and its subsidiaries.  Refer to \nNote 1\n1\n for discussion of the carryforward positions.\nAs discussed in “\nLegislative Matters\n,” the Inflation Reduction Act of 2022 provides the right to transfer renewable tax credits to other corporate taxpayers.  Refer to the cash flows statements and \nNote 1\n(c)\n for details of renewable tax credits transferred to other corporate taxpayers in 2023 and 2024.  Alliant Energy, IPL and WPL currently intend to transfer all eligible renewable tax credits in the future, and as a result, expect an increase in future cash flows from operating activities.\nHigher Earnings on Increasing Rate Base\n - Refer to “\nOther Future Considerations\n” for discussion of expected increases in future cash flows from operating activities resulting from higher earnings on increasing rate base at IPL and WPL.\nPension Plan Contributions\n - Alliant Energy, IPL and WPL currently expect to make $20 million, $1 million and $14 million of pension plan contributions in 2025, respectively, based on the funded status and assumed return on assets for each plan as of the December 31, 2024 measurement date.  Refer to \nNote 1\n2\n(a)\n for discussion of pension plan contributions in 2024 and the current funded levels of pension plans.\nInvesting Activities - \nThe following items contributed to increased (decreased) investing activity cash flows for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\n(Higher) lower utility construction and acquisition expenditures (a)\n($321)\n($512)\n$191\nChanges in the amount of cash receipts on sold receivables\n140\n140\n—\nOther\n35\n14\n31\n($146)\n($358)\n$222\n(a)\nLargely due to higher expenditures for IPL’s and WPL’s energy storage, IPL’s solar generation and IPL’s refurbishment of an existing wind farm, partially offset by lower expenditures for WPL’s solar generation.\nConstruction and Acquisition Expenditures\n - Construction and acquisition expenditures and financing plans are reviewed, approved and updated as part of the strategic planning process.  Changes may result from a number of reasons, including changes in expected load growth, regulatory requirements, changing legislation, not obtaining favorable and acceptable regulatory approval on certain projects, changing costs of projects due to market conditions, improvements in technology, and improvements to ensure resiliency and reliability of the electric and gas distribution systems.  Refer to “\nRate Matters\n” for discussion of an electric distribution system investment cap included in IPL’s rate review settlement agreement, which was approved by the IUC in September 2024.  Alliant Energy, IPL and WPL have not yet entered into contractual commitments relating to the majority of their anticipated future construction and acquisition expenditures.  As a result, they have some discretion with regard to the level and timing of these expenditures.  The table below summarizes anticipated construction and acquisition expenditures (in millions), which are focused on adding generation to meet growing customer demand for electricity, including initial expected future data center growth, and strengthening the resiliency and reliability of the electric grid, and include renewable generation and energy storage projects, dispatchable gas generation projects and converting certain coal-fired EGUs to natural gas.  Alliant Energy, IPL and WPL are currently evaluating the impact of additional potential large load growth customers on their resource plans and will update their anticipated construction and acquisition expenditures as needed in the future.  Cost estimates represent Alliant Energy’s, IPL’s and WPL’s portion of construction expenditures and exclude AFUDC and capitalized interest, if applicable.  Refer to “\nCustomer Investments\n” for further discussion of certain key utility business projects impacting construction and acquisition plans, and the related regulatory filings.\n40\nTable of C\no\nntents\n                                    \nAlliant Energy\nIPL\nWPL\n2025\n2026\n2027\n2028\n2025\n2026\n2027\n2028\n2025\n2026\n2027\n2028\nGeneration:\nRenewables and energy storage projects\n$800 \n$1,115 \n$1,325 \n$1,340 \n$455 \n$540 \n$595 \n$565 \n$345 \n$575 \n$730 \n$775 \nGas projects\n390 \n570 \n780 \n655 \n145 \n175 \n365 \n355 \n195 \n365 \n415 \n300 \nOther\n130 \n120 \n55 \n55 \n65 \n55 \n25 \n15 \n65 \n65 \n30 \n40 \nDistribution:\nElectric systems\n585 \n570 \n560 \n580 \n310 \n275 \n280 \n280 \n275 \n295 \n280 \n300 \nGas systems\n80 \n85 \n85 \n85 \n35 \n40 \n40 \n40 \n45 \n45 \n45 \n45 \nOther\n220 \n220 \n215 \n245 \n45 \n50 \n60 \n45 \n30 \n25 \n30 \n30 \n$2,205 \n$2,680 \n$3,020 \n$2,960 \n$1,055 \n$1,135 \n$1,365 \n$1,300 \n$955 \n$1,370 \n$1,530 \n$1,490 \nWest Riverside Options\n - WPL entered into agreements with neighboring utilities that provided them options to purchase a partial ownership interest in West Riverside.  Upon exercise of such options and the resulting sales, WPL received proceeds from the sales in 2023 and 2024.  Refer to “\nCustomer Investments\n” for additional information.\nRenewable Tax Credits\n - IPL and WPL started construction in 2024, and currently expect to start construction in the first half of 2025, of certain renewable and energy storage projects, with the intention of preserving the qualification of any renewable tax credits associated with these projects.\nFinancing Activities -\n The following items contributed to increased (decreased) financing activity cash flows for 2024 compared to 2023 (in millions):\nAlliant Energy\nIPL\nWPL\nHigher payments to retire long-term debt\n($301)\n($500)\n$—\nLower net proceeds from common stock issuances\n(223)\n—\n—\n(Higher) lower common stock dividends\n(36)\n80\n(12)\nNet changes in the amount of commercial paper outstanding\n250\n50\n(163)\nHigher net proceeds from issuance of long-term debt\n158\n347\n—\nHigher (lower) capital contributions from IPL’s and WPL’s parent company, Alliant Energy\n—\n245\n(190)\nOther\n(23)\n(22)\n2\n($175)\n$200\n($363)\nFERC and Public Utility Holding Company Act Financing Authorizations\n - Under the Public Utility Holding Company Act of 2005, FERC has authority over the issuance of utility securities, except to the extent that a public utility’s primary state regulatory commission has retained jurisdiction over such matters.  FERC currently has authority over the issuance of securities by IPL.  FERC does not have authority over the issuance of securities by Alliant Energy, WPL, AEF or Corporate Services.  In 2023, IPL received authorization from FERC to issue securities in 2024 and 2025 as follows (in millions):\nInitial Authorization\nRemaining Capacity as of December 31, 2024\nLong-term debt securities issuances in aggregate\n$1,700\n$1,050\nShort-term debt securities outstanding at any time (including borrowings from its parent)\n400\n350\nPreferred stock issuances in aggregate\n300\n300\nState Regulatory Financing Authorizations\n - In March 2023, WPL received authorization from the PSCW to have up to $500 million of short-term borrowings and/or letters of credit outstanding at any time through the expiration date of WPL’s credit facility agreement.  As of December 31, 2024, WPL also had authority to issue up to $600 million of long-term debt securities in aggregate through December 2025 pursuant to a February 2023 PSCW order.\nShelf Registrations\n - Alliant Energy, IPL and WPL have current shelf registration statements on file with the SEC for availability to issue unspecified amounts of securities through December 2026.  Alliant Energy’s shelf registration statement may be used to issue common stock, debt and other securities.  IPL’s and WPL’s shelf registration statements may be used to issue preferred stock and debt securities.\nCommon Stock Dividends\n - Payment of common stock dividends is subject to dividend declaration by Alliant Energy’s Board of Directors and is dependent upon, among other factors, regulatory limitations, earnings, cash flows, capital requirements and general financial condition of subsidiaries.  Alliant Energy’s general long-term goal is to maintain a dividend payout ratio that is competitive with the industry average.  Based on that, Alliant Energy’s goal is to maintain a dividend payout ratio of approximately 60% to 70% of consolidated earnings from continuing operations.  Refer to “\nResults of Operations\n” for discussion of expected common stock dividends in 2025.\n41\nTable of C\no\nntents\n                                    \nCommon Stock Issuances\n - Refer to \nNote 7\n for discussion of common stock issuances by Alliant Energy in 2023 and 2024, and “\nResults of Operations\n” for discussion of expected issuances of common stock in 2025.\nShort-term Debt\n - In December 2024, Alliant Energy, IPL and WPL amended and extended their single revolving credit facility agreement, which expires in December 2029 and is discussed in \nNote \n8\n(a)\n.  There are currently 14 lenders that participate in the credit facility, with respective commitments ranging from $25 million to $130 million.  Subject to certain conditions, Alliant Energy, IPL and WPL may exercise two extension options, which would each extend the maturity date by one year.  The credit facility has a provision to expand the facility size up to an additional $700 million, for a potential total commitment of $2 billion, subject to lender approval for Alliant Energy and subject to lender and regulatory approvals for IPL and WPL.\nThe credit agreement contains customary events of default, including a cross-default provision that would be triggered if Alliant Energy or certain of its significant subsidiaries (including IPL and WPL) defaults on debt (other than non-recourse debt) totaling $100 million or more.  IPL and WPL are subject to a similar cross-default provision with respect to their own respective consolidated debt.  A default by Alliant Energy or its non-utility subsidiaries would not trigger a cross-default at IPL or WPL, nor would a default by either of IPL or WPL constitute a cross-default event for the other.  If an event of default under the credit agreement occurs and is continuing, then the lenders may declare any outstanding obligations of the defaulting borrower under the credit agreement immediately due and payable.\nThe single credit facility agreement contains a financial covenant, which requires Alliant Energy, IPL and WPL to maintain certain debt-to-capital ratios in order to borrow under the credit facility.  AEF’s term loan credit agreement contains a financial covenant, which requires Alliant Energy to maintain a certain debt-to-capital ratio in order to borrow under the term loan credit agreement.  The required debt-to-capital ratios compared to the actual debt-to-capital ratios at December 31, 2024 were as follows:\nAlliant Energy\nIPL\nWPL\nRequirement, not to exceed\n65%\n65%\n65%\nActual\n60%\n48%\n48%\nThe debt component of the capital ratios includes, when applicable, long- and short-term debt (excluding non-recourse debt and hybrid securities to the extent the total carrying value of such hybrid securities does not exceed 15% of consolidated capital of the applicable borrower), finance lease obligations, certain letters of credit, guarantees of the foregoing and new synthetic leases.  Unfunded vested benefits under qualified pension plans and sales of accounts receivable are not included in the debt-to-capital ratios.  The equity component of the capital ratios excludes accumulated other comprehensive income (loss).\nLong-term Debt\n - Refer to \nNote \n8\n(b)\n for discussion of issuances and retirements of long-term debt in 2024, and “\nResults of Operations\n” for discussion of expected issuances and retirements of long-term debt in 2025.  In 2023, IPL issued $300 million of 5.7% senior debentures due 2033, and used the net proceeds to reduce cash amounts received from its sales of accounts receivable program, reduce commercial paper classified as long-term debt, and for general corporate purposes; pending application of the proceeds, such proceeds were placed in money market fund investments.  In 2023, WPL issued $300 million of 4.95% green bond debentures due 2033, and an amount equal to or in excess of the net proceeds was disbursed for the development and acquisition of its solar EGUs.  In 2023, AEF issued $300 million of 5.95% senior notes due 2029 and used the net proceeds to reduce Alliant Energy’s outstanding commercial paper and for general corporate purposes.  In 2023, AEF entered into a $300 million interest rate swap maturing in January 2026 to mitigate interest rate risk.  Under the terms of the swap, AEF exchanged a variable interest rate for a fixed interest rate of 3.93% on a portion of its variable-rate term loan borrowings.  In 2023, Alliant Energy issued $575 million of 3.875% convertible senior notes due 2026, and used the net proceeds for general corporate purposes.\nImpact of Credit Ratings on Liquidity and Collateral Obligations\n -\nRatings Triggers - \nThe long-term debt of Alliant Energy and its subsidiaries is not subject to any repayment requirements as a result of explicit credit rating downgrades or so-called “ratings triggers.”  However, Alliant Energy and its subsidiaries are parties to various agreements that contain provisions dependent on credit ratings.  In the event of a significant downgrade, Alliant Energy or its subsidiaries may need to provide credit support, such as letters of credit or cash collateral equal to the amount of any exposure, or may need to unwind contracts or pay underlying obligations.  In the event of a significant downgrade, management believes Alliant Energy, IPL and WPL have sufficient liquidity to cover counterparty credit support or collateral requirements under these various agreements.  In addition, a downgrade in the credit ratings of Alliant Energy, IPL or WPL could also result in them paying higher interest rates in future financings, reduce flexibility with future financing plans, reduce their pool of potential lenders, increase their borrowing costs under existing credit facilities or limit their access to the commercial paper market.  Credit ratings and outlooks as of the date of this report are as follows:\n42\nTable of C\no\nntents\n                                    \nStandard & Poor’s Ratings Services\nMoody’s Investors Service\nAlliant Energy:\nCorporate/issuer\nA-\nBaa2\nCommercial paper\nA-2\nP-2\nSenior unsecured long-term debt\nBBB+\nN/A\nOutlook\nNegative\nStable\nIPL:\nCorporate/issuer\nA-\nBaa1\nCommercial paper\nA-2\nP-2\nSenior unsecured long-term debt\nA-\nBaa1\nOutlook\nNegative\nStable\nWPL:\nCorporate/issuer\nA\nBaa1\nCommercial paper\nA-1\nP-2\nSenior unsecured long-term debt\nA\nBaa1\nOutlook\nNegative\nStable\nStandard & Poor’s Ratings Services and Moody’s Investors Service issued credit ratings of BBB+ and Baa2, respectively, for the senior notes issued by AEF in 2018, 2020, 2022, 2023 and 2024 (with Alliant Energy as guarantor).  Credit ratings are not recommendations to buy or sell securities and are subject to change, and each rating should be evaluated independently of any other rating.  Each of Alliant Energy, IPL or WPL assumes no obligation to update their respective credit ratings.  Refer to \nN\note 1\n4\n for additional information on ratings triggers for commodity contracts accounted for as derivatives.\nOff-Balance Sheet Arrangements\n -\nSpecial Purpose Entities - \nIPL maintains a Receivables Agreement whereby it may sell its customer accounts receivables, unbilled revenues and certain other accounts receivables to a third party through wholly-owned and consolidated special purpose entities.  The purchase commitment from the third party to which IPL sells its receivables expires in March 2026.  In 2024 and 2023, IPL evaluated the third party that purchases IPL’s receivable assets under the Receivables Agreement and believes that the third party is a VIE; however, IPL concluded consolidation of the third party was not required.\nIn addition, IPL’s sales of accounts receivable program agreement contains a cross-default provision that is triggered if IPL or Alliant Energy incurs an event of default on debt totaling $100 million or more.  If an event of default under IPL’s sales of accounts receivable program agreement occurs, then the counterparty could terminate such agreement.  Refer to \nNote 5(b)\n for additional information regarding IPL’s sales of accounts receivable program.\nGuarantees and Indemnifications - \nAt December 31, 2024, various guarantees and indemnifications are outstanding related to Alliant Energy’s cash equity ownership interest in a non-utility wind farm, prior divestiture activities and transfers of renewable tax credits to other corporate taxpayers.  Refer to \nNote 1\n6\n(d)\n for additional information.\nCertain Financial Commitments\n - \nContractual Obligations - \nAlliant Energy, IPL and WPL have various long-term contractual obligations as of December 31, 2024, which include long-term debt maturities in \nNote \n8\n(b)\n, operating and finance leases in \nNote \n9\n, capital purchase obligations in \nNote 1\n6\n(a)\n, and other purchase obligations in \nNote 1\n6\n(b)\n.  At December 31, 2024, Alliant Energy, IPL and WPL had no uncertain tax positions recorded as liabilities.  Refer to \nNote 1\n2\n(a)\n for anticipated pension and OPEB funding amounts.  Refer to “\nConstruction and Acquisition Expenditures\n” above for additional information on construction and acquisition programs.  In addition, at December 31, 2024, there were various other liabilities included on the balance sheets that, due to the nature of the liabilities, the timing of payments cannot be estimated.\nOTHER MATTERS\nMarket Risk Sensitive Instruments and Positions\n - \nPrimary market risk exposures are associated with commodity prices, counterparty credit risk, investment prices and interest rates.  Risk management policies are used to monitor and assist in mitigating these market risks and derivative instruments are used to manage some of the exposures related to commodity prices and interest rates.  Refer to Notes \n1(h)\n and \n1\n4\n for further discussion of derivative instruments, and \nNote 1(g)\n for details of utility cost recovery mechanisms that significantly reduce commodity risk.\nCommodity Price - \nAlliant Energy, IPL and WPL are exposed to the impact of market fluctuations in the price and transportation costs of commodities they procure and market.  Established policies and procedures mitigate risks associated with these market fluctuations, including the use of various commodity derivatives and contracts of various durations for the forward sale and purchase of these commodities.  Exposure to commodity price risks in the utility businesses is also significantly mitigated by current rate-making structures in place for recovery of fuel-related costs as well as the cost of natural gas purchased for resale.  IPL’s electric and gas tariffs and WPL’s wholesale electric and gas tariffs provide for subsequent monthly adjustments to their tariff rates for material changes in prudently incurred commodity costs.  IPL’s and WPL’s rate mechanisms, combined with commodity derivatives, significantly reduce commodity risk associated with their electric and gas service.  WPL’s retail electric service is exposed to the impact of changes in commodity prices due largely to the current retail recovery mechanism in place in Wisconsin for fuel-related costs.\n43\nTable of C\no\nntents\n                                    \nCounterparty Credit Risk - \nAlliant Energy, IPL, and WPL are exposed to credit risk related to losses resulting from counterparties’ nonperformance of their contractual obligations.  Alliant Energy, IPL and WPL maintain credit policies intended to minimize overall credit risk and actively monitor these policies to reflect changes and scope of operations.  Alliant Energy, IPL, and WPL conduct credit reviews for certain counterparties, and employ credit risk controls such as letters of credit, parental guarantees, master netting agreements and termination provisions.  Credit exposure is monitored, and when necessary, activity with a specific counterparty is limited until credit enhancement is provided.  Distress in the financial markets could increase Alliant Energy’s, IPL’s and WPL’s credit risk.\nInvestment Price -\n Alliant Energy, IPL and WPL are exposed to investment price risk as a result of their investments in securities, largely related to securities held by their pension and OPEB plans, as well as unconsolidated investments accounted for under the equity method of accounting.  Refer to \nNote 1\n2\n(a)\n for details of the securities held by their pension and OPEB plans, and \nNote 6\n for details of equity investments.  Refer to “\nCritical Accounting \nEstimates\n” for the impact on retirement plan costs of changes in the rate of returns earned by plan assets.\nInterest Rate -\n Alliant Energy, IPL and WPL are exposed to risk resulting from changes in interest rates associated with variable-rate borrowings.  In addition, Alliant Energy and IPL are exposed to risk resulting from changes in interest rates on cash amounts outstanding under IPL’s sales of accounts receivable program.  Assuming the impact of a hypothetical 100 basis point increase in interest rates on variable-rate borrowings and cash amounts outstanding under IPL’s sales of accounts receivable program at December 31, 2024, Alliant Energy’s, IPL’s and WPL’s annual pre-tax expense would increase by approximately $6 million, $1 million and $2 million, respectively.  Refer to Notes \n5(b)\n and \n8\n for additional information on cash amounts outstanding under IPL’s sales of accounts receivable program, and short- and long-term variable-rate borrowings, respectively.  Refer to “\nCritical Accounting \nEstimates\n” for the impacts of changes in discount rates on retirement plan obligations and costs.\nCritical Accounting Estimates\n - \nAlliant Energy’s, IPL’s and WPL’s financial statements are prepared in conformity with GAAP, which requires management to apply accounting policies, judgments and assumptions, and make estimates that affect results of operations and the amounts of assets and liabilities reported in the financial statements.  The following accounting estimates are critical to the business and the understanding of financial results as they require critical assumptions and judgments by management.  The results of these assumptions and judgments form the basis for making estimates regarding the results of operations and the amounts of assets and liabilities that are not readily apparent from other sources.  Actual financial results may differ materially from estimates.  Management has discussed these critical accounting estimates with the Audit Committee of the Board of Directors.  Refer to \nNote 1\n for additional discussion of accounting estimates used in the preparation of the financial statements.\nRegulatory Assets and Regulatory Liabilities - \nIPL and WPL are regulated by various federal and state regulatory agencies.  As a result, they are subject to GAAP for regulated operations, which recognizes that the actions of a regulator can provide reasonable assurance of the existence of an asset or liability.  Regulatory assets or regulatory liabilities arise as a result of a difference between GAAP and actions imposed by the regulatory agencies in the rate-making process.  Regulatory assets generally represent incurred costs that have been deferred as such costs are probable of recovery in future customer rates.  Regulatory liabilities generally represent obligations to make refunds to customers or amounts collected in rates for which the related costs have not yet been incurred.  Regulatory assets and regulatory liabilities are recognized in accordance with the rulings of applicable federal and state regulators, and future regulatory rulings may impact the carrying value and accounting treatment of regulatory assets and regulatory liabilities.  \nNote 2\n provides details of the nature and amounts of regulatory assets and regulatory liabilities assessed at December 31, 2024.\nAssumptions and judgments are made each reporting period regarding whether regulatory assets are probable of future recovery and regulatory liabilities are probable future obligations by considering factors such as regulatory environment changes, rate orders issued by the applicable regulatory agencies, historical decisions by such regulatory agencies regarding similar regulatory assets and regulatory liabilities, and subsequent events of such regulatory agencies.  The decisions made by regulatory agencies have an impact on the recovery of costs, the rate of return on invested capital and the timing and amount of assets to be recovered by rates.  A change in these decisions may result in a material impact on results of operations and the amount of assets and liabilities in the financial statements.\nIn May 2023, IPL retired the Lansing Generating Station.  IPL was previously allowed a full recovery of and a full return on this EGU from its retail customers.  In September 2024, the IUC approved IPL’s retail electric rate review for the October 2024 through September 2025 forward-looking Test Period, which includes a return of the remaining net book value of Lansing; however, the IUC did not approve a return on the remaining net book value of Lansing, therefore the return on the remaining net book value is no longer recoverable from IPL’s retail electric customers.  As a result a pre-tax non-cash charge of $60 million was recorded to “Asset valuation charge for IPL’s Lansing Generating Station” in Alliant Energy’s and IPL’s income statements in 2024, with a corresponding decrease in Alliant Energy’s and IPL’s assets retired early regulatory assets.  IPL is currently allowed a full recovery of and a full return on this EGU from its wholesale customers.\n44\nTable of C\no\nntents\n                                    \nIncome Taxes -\n Alliant Energy, IPL and WPL are subject to income taxes in various jurisdictions.  Assumptions and judgments are made each reporting period to estimate income tax assets, liabilities, benefits and expenses.  Judgments and assumptions are supported by historical data and reasonable projections.  Significant changes in these judgments and assumptions could have a material impact on financial condition and results of operations.  Alliant Energy’s and IPL’s critical assumptions and judgments for 2024 included estimates of qualifying deductions for repairs expenditures, allocation of mixed service costs and state depreciation, and costs related to retirement or removal of depreciable property due to the impact of Iowa rate-making principles on such property-related differences.  Critical assumptions and judgments also include projections of future taxable income used to determine the ability to utilize federal credit carryforwards prior to their expiration.  Refer to \nNote 1\n1\n for further discussion of tax matters.\nEffect of Rate-making on Property-related Differences\n - Alliant Energy’s and IPL’s effective income tax rates are normally impacted by certain property-related differences at IPL for which deferred tax is not recorded in the income statement pursuant to Iowa rate-making principles.  Changes in methods or assumptions regarding the amount of IPL’s qualifying repairs expenditures, allocation of mixed service costs and state depreciation, and costs related to retirement or removal of depreciable property, could result in a material impact on Alliant Energy’s and IPL’s financial condition and results of operations.\nCarryforward Utilization\n - Significant federal tax credit carryforwards exist for Alliant Energy, IPL and WPL as of December 31, 2024.  Based on projections of current and future taxable income, Alliant Energy, IPL and WPL plan to utilize all of these carryforwards approximately five years before expiration.  Changes in tax regulations or assumptions regarding current and future taxable income could require valuation allowances in the future resulting in a material impact on financial condition and results of operations.\nLong-Lived Assets\n \n-\n Periodic assessments regarding the recoverability of certain long-lived assets are completed when factors indicate the carrying value of such assets may not be recoverable or such assets are planned to be sold.  These assessments require significant assumptions and judgments by management.  The long-lived assets assessed for impairment generally include certain assets within regulated operations that may not be fully recovered from IPL’s and WPL’s customers as a result of regulatory decisions in the future, and assets within non-utility operations that are proposed to be sold or are currently generating operating losses.\nRegulated Operations\n - Alliant Energy’s, IPL’s and WPL’s long-lived assets within their regulated operations that were assessed for impairment and/or plant abandonment in 2024 included WPL’s generating units subject to early retirement and solar generation projects.\nGenerating Units Subject to Early Retirement \n- Alliant Energy and WPL evaluate future plans for their electric generation fleet and have announced the early retirement of certain EGUs.  When it becomes probable that an EGU will be retired before the end of its useful life, Alliant Energy and WPL must assess whether the EGU meets the criteria to be considered probable of abandonment.  EGUs that are considered probable of abandonment generally have material remaining net book values and are expected to cease operations in the near term significantly before the end of their original estimated useful lives.  If an EGU meets such criteria to be considered probable of abandonment, Alliant Energy and WPL must assess the probability of full recovery of the remaining carrying value of such EGU.  If it is probable that regulators will not allow full recovery of and a full return on the remaining net book value of the abandoned EGU, an impairment charge is recognized equal to the difference between the remaining carrying value and the present value of the future revenues expected from the abandoned EGU.\nAlliant Energy and WPL concluded that the coal-fired Columbia Units 1 and 2 met the criteria to be considered probable of abandonment as of December 31, 2024.  WPL currently plans to cease coal operations at Columbia Units 1 and 2 by the end of 2029, as well as evaluate the conversion of Columbia Unit 1 and/or Unit 2 to natural gas.  WPL is currently allowed a full recovery of and a full return on the Columbia EGUs from both its retail and wholesale customers, and as a result, Alliant Energy and WPL concluded that no impairment was required as of December 31, 2024.  Alliant Energy, IPL and WPL evaluated their other EGUs that are subject to early retirement and determined that no other EGUs met the criteria to be considered probable of abandonment as of December 31, 2024.  \nNote\n \n3\n provides additional details on these EGUs.\nSolar Generation Projects\n - Alliant Energy and WPL review property, plant and equipment for possible impairment whenever events or changes in circumstances indicate all or a portion of the carrying value of the assets may be disallowed for rate-making purposes.  If WPL is disallowed recovery of any portion of, or is only allowed a partial return on, the carrying value of its solar generation projects, then an impairment charge is recognized.  Alliant Energy and WPL currently expect construction costs associated with WPL’s approximately 1,100 MW of new solar generation will exceed the construction cost estimates previously approved by the PSCW by approximately $205 million.  In 2024, the PSCW issued orders approving deferral of, and the deferral of a return on, the incremental solar generation construction costs in 2024 and 2025.  Alliant Energy and WPL concluded that there was not a probable disallowance of higher rate base amounts as of December 31, 2024 given construction costs were reasonably and prudently incurred.  “\nCustomer Investments\n” provides details of WPL’s solar generation projects recently completed.\n45\nTable of C\no\nntents\n                                    \nAROs\n - The fair value of a legal obligation associated with the retirement of an asset is recorded as a liability when an asset is placed in service, when a legal obligation is subsequently identified or when sufficient information becomes available to determine a reasonable estimate of the fair value of future retirement costs.  Alliant Energy, IPL and WPL estimate the fair value of their AROs using present value techniques, in which they make various assumptions, including estimates of the amounts and timing of future cash flows associated with retirement activities, inflation and discount rates.  Estimates of the timing and amounts of future cash outlays are based on projections of when and how assets will be retired and the cost of future removal activities.  The estimates are subject to change and future updates could have a material impact on Alliant Energy’s, IPL’s and WPL’s financial condition and results of operations.  In 2024, substantially due to the enactment of the revised CCR Rule, which significantly expands the scope of regulation to include coal ash ponds at sites that no longer produce electricity and inactive landfills, Alliant Energy, IPL and WPL recorded additional AROs of $409 million, $201 million and $208 million, respectively.  These amounts are expected to be adjusted in the future, as additional information is obtained for the specific site closure plans, including the determination of whether or not individual sites are considered legal obligations and the acceptance and approval of compliance approaches, which could change management assumptions and result in a material change to the recorded ARO amounts.  Refer to \nNote 1\n3\n for further discussion of AROs.\nPensions and Other Postretirement Benefits - \nAlliant Energy, IPL and WPL sponsor various defined benefit pension and OPEB plans that provide benefits to a significant portion of their employees and retirees.  Assumptions and judgments are made periodically to estimate the obligations and costs related to their retirement plans.  There are many judgments and assumptions involved in determining an entity’s pension and other postretirement liabilities and costs each period including employee demographics (including life expectancies and compensation levels), discount rates, assumed rates of return and funding.  Changes made to plan provisions may also impact current and future benefits costs.  Judgments and assumptions are supported by historical data and reasonable projections and are reviewed at least annually.  The following table shows the impacts of changing certain key actuarial assumptions discussed above (in millions):\nDefined Benefit Pension Plans\nOPEB Plans\nChange in Actuarial Assumption\nImpact on Projected Benefit Obligation at December 31, 2024\nImpact on 2025 Net Periodic Benefit Costs\nImpact on Accumulated Benefit Obligation at December 31, 2024\nImpact on 2025 Net Periodic Benefit Costs\nAlliant Energy\n1% change in discount rate\n$85\n$7\n$10\n$—\n1% change in expected rate of return\nN/A\n7\nN/A\n1\nIPL\n1% change in discount rate\n39\n3\n4\n—\n1% change in expected rate of return\nN/A\n3\nN/A\n1\nWPL\n1% change in discount rate\n38\n3\n4\n—\n1% change in expected rate of return\nN/A\n3\nN/A\n—\nContingencies - \nAssumptions and judgments are made each reporting period regarding the future outcome of contingent events.  Loss contingency amounts are recorded for any contingent events for which the likelihood of loss is probable and able to be reasonably estimated based upon current available information.  The amounts recorded may differ from actuals when the uncertainty is resolved.  The estimates made in accounting for contingencies, and the gains and losses that are recorded upon the ultimate resolution of these uncertainties, could have a significant effect on results of operations and the amount of assets and liabilities in the financial statements.  Certain contingencies require estimation each reporting period of the expected credit losses on those contingencies, which requires significant judgment and may result in the recognition of a credit loss liability.  \nNote 1\n6\n provides further discussion of contingencies assessed at December 31, 2024 that may have a material impact on financial condition and results of operations, including various pending legal proceedings, guarantees and indemnifications.",
  "item2": null
}