{
  "source_file": "low-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThis discussion and analysis summarizes the significant factors affecting our consolidated operating results, liquidity and capital resources during the three and nine months ended October 31, 2025, and November 1, 2024.  This discussion and analysis should be read in conjunction with the consolidated financial statements and notes to the consolidated financial statements that are included in our Annual Report on Form 10-K for the fiscal year ended January 31, 2025 (the Annual Report), as well as the consolidated financial statements (unaudited) and notes to the consolidated financial statements (unaudited) contained in this report.  Unless otherwise specified, all comparisons made are to the corresponding period of fiscal 2024.  This discussion and analysis is presented in four sections:\n•\nExecutive Overview\n•\nOperations\n•\nFinancial Condition, Liquidity and Capital Resources\n•\nCritical Accounting Policies and Estimates\nEXECUTIVE OVERVIEW\nThe following table highlights our financial results:\nThree Months Ended\nNine Months Ended\n(in millions, except per share data)\nOctober 31, 2025\nNovember 1, 2024\nOctober 31, 2025\nNovember 1, 2024\nNet sales\n$\n20,813 \n$\n20,170 \n$\n65,701 \n$\n65,120 \nNet earnings\n1,616 \n1,695 \n5,654 \n5,833 \nDiluted earnings per share\n$\n2.88 \n$\n2.99 \n$\n10.07 \n$\n10.22 \nNet cash provided by operating activities\n$\n8,297 \n$\n8,714 \nCapital expenditures\n1,610 \n1,379 \nRepurchases of common stock\n1\n74 \n2,515 \nCash dividend payments\n1,963 \n1,916 \n1\n    \nRepurchases of common stock on a trade-date basis.\nNet sales in the third quarter of fiscal 2025 improved 3.2% to $20.8 billion compared to net sales of $20.2 billion in the third quarter of fiscal 2024.  Comparable sales for the third quarter of fiscal 2025 increased 0.4%, consisting of an increase in comparable average ticket of 3.4%, partially offset by a decrease of 3.0% in comparable customer transactions.  Net earnings in the third quarter of fiscal 2025 were $1.6 billion, compared to net earnings of $1.7 billion in the third quarter of fiscal 2024.  Diluted earnings per common share were $2.88 in the third quarter of fiscal 2025 compared to $2.99 in the third quarter of fiscal 2024.  Included in the third quarter of 2025 results were pre-tax expenses of $129 million consisting of transaction costs and intangible asset amortization related to the acquisitions of Artisan Design Group (ADG) and Foundation Building Materials (FBM).  Excluding the impact of these items, adjusted diluted earnings per common share was $3.06 in the third quarter of 2025 (see the \nnon-GAAP financial measures\n discussion).\nFor the first nine months of fiscal 2025, cash flows from operating activities were approximately $8.3 billion, with $1.6 billion used for capital expenditures.  During the three months ended October 31, 2025, we closed on the acquisition of FBM for $8.8 billion.  In addition, we paid $673 million in dividends, continuing to deliver on our commitment to return cash to shareholders.  \nDuring the third quarter, we saw strength across all five key initiatives of our 2025 Total Home strategy.  Our continued Pro growth is driven by our focus on enhancing the products and services offerings to the Pro customers.  In addition, we delivered double-digit online sales growth through increased traffic and continued strong conversion rates.  We are also leveraging our loyalty ecosystem to gain deeper customer insights which enable tailored, value-enhancing offers through data-driven marketing.  Home services also delivered double-digit growth driven in-part by our technology enabled solutions which have enhanced the experience of our customers, installers, and associates by accelerating the process from inquiry to completed installation through intuitive scheduling, quoting, and payment solutions.  Lastly, we continued to focus on increasing space productivity to drive incremental sales opportunities.  We expanded our rural format as well as our workwear and pet assortments to additional locations, while also making progress on our SKU rationalization efforts.\n17\nTable of Contents\nThe acquisitions of ADG and FBM will create a comprehensive interior solution for our home builders by expanding our product portfolio and strengthening our fulfillment capabilities. \nOverall, we were encouraged to see modest improvement in DIY customer engagement in the third quarter as we continued to navigate an uncertain macro environment.  Affordability and uncertainty in the broader economy continue to weigh on consumer confidence in the near term.  Looking ahead we expect lower interest rates will help drive demand for the Company’s products and services.  The combination of strong fundamentals, substantial home equity, and the potential for lower interest rates in the future, gives us confidence in the long-term health of the home improvement industry, and we remain confident that continued execution of our Total Home strategy will position us to capitalize on the expected recovery in housing and home improvement.\nTariffs\nDuring the year, the United States has enacted significant changes to its trade policy and imposed tariffs on imported goods from a number of countries.  The Company has been, and continues to, monitor these trade policies and their ongoing impacts on the cost of our inventory.  We will also continue to evaluate adjustments to our merchandise assortment, pricing, and global supply chain strategies, including continued country of origin diversification, as potential mitigating actions.  \nOPERATIONS\nThe following table sets forth the percentage relationship to net sales of each line item of the consolidated statements of earnings (unaudited), as well as the percentage change in dollar amounts from the prior period.  This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements (unaudited), including the related notes to the consolidated financial statements (unaudited).\nThree Months Ended\nBasis Point Increase/(Decrease) in Percentage of Net Sales\nNine Months Ended\nBasis Point Increase/(Decrease) in Percentage of Net Sales\nOctober 31, 2025\nNovember 1, 2024\nOctober 31, 2025\nNovember 1, 2024\nNet sales\n100.00\n \n%\n100.00\n \n%\nN/A\n100.00\n \n%\n100.00\n \n%\nN/A\nGross margin\n34.19\n \n33.69\n \n50\n33.80\n \n33.45\n \n35\nExpenses:\nSelling, general and administrative\n19.99 \n18.97 \n102\n18.85 \n18.22 \n63\nDepreciation and amortization\n2.28 \n2.15 \n13\n2.10 \n1.97 \n13\nOperating income\n11.92\n \n12.57\n \n(65)\n12.85\n \n13.26\n \n(41)\nInterest – net\n1.69 \n1.57 \n12\n1.52 \n1.51 \n1\nPre-tax earnings\n10.23\n \n11.00\n \n(77)\n11.33\n \n11.75\n \n(42)\nIncome tax provision\n2.46 \n2.59 \n(13)\n2.72 \n2.79 \n(7)\nNet earnings\n7.77\n \n%\n8.41\n \n%\n(64)\n8.61\n \n%\n8.96\n \n%\n(35)\n18\nTable of Contents\nThe following table sets forth key metrics utilized by management in assessing business performance.  This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements (unaudited), including the related notes to the consolidated financial statements (unaudited).\nThree Months Ended\nNine Months Ended\nOther Metrics\nOctober 31, 2025\nNovember 1, 2024\nOctober 31, 2025\nNovember 1, 2024\nComparable sales increase/(decrease) \n1\n0.4 \n%\n(1.1)\n%\n(0.1)\n%\n(3.6)\n%\nCustomer transactions (in millions) \n2,3\n187 \n192 \n608 \n626 \nAverage ticket \n3\n108.78 \n104.78 \n107.12\n104.06\nAt end of period:\nNumber of stores\n1,756 \n1,747 \nSales floor square feet (in millions)\n196 \n195 \nAverage store size selling square feet (in thousands) \n4\n111 \n112 \nNet earnings to average debt and shareholders’ deficit\n22.4 \n%\n26.8 \n%\nReturn on invested capital \n5\n26.1 \n%\n31.2 \n%\n1\n    A comparable location is defined as a retail location that has been open longer than 13 months.\n \nA location that is identified for relocation is no longer considered comparable in the month of its relocation.\n \nThe relocated location must then remain open longer than 13 months to be considered comparable.\n \nA location we decide to close is no longer considered comparable as of the beginning of the month in which we announce its closing.  Operating locations which are sold are included in comparable sales until the date of sale.  Comparable sales are presented on a transacted basis when tender is accepted from a customer.  Comparable sales include online sales, which positively impacted third quarter fiscal 2025 and fiscal 2024 comparable sales by approximately 130 basis points and 55 basis points, respectively, and year-to-date fiscal 2025 and fiscal 2024 sales by approximately 95 basis points and 35 basis points, respectively.  The comparable store sales calculation included in the preceding table was calculated using comparable 13-week and 39-week periods. \n2\n    In the first quarter of fiscal 2025, the Company adjusted its customer transactions metric to exclude certain order modifications which were previously included as a separate transaction. The prior year period has been adjusted to align with the current period presentation.\n3  \n Customer transactions and average ticket represent metrics used by management to evaluate performance of our retail locations.                                                              \n4\n    Average store size selling square feet is defined as sales floor square feet divided by the number of stores open at the end of the period.  \n5\n    Return on invested capital is calculated using a non-GAAP financial measure.  See below for additional information and reconciliations of non-GAAP measures.\nNon-GAAP Financial Measures\nAdjusted Diluted Earnings Per Share\nAdjusted diluted earnings per share is considered a non-GAAP financial measure.  The Company believes this non-GAAP financial measure provides useful insight for analysts and investors in understanding the comparison of operational performance for fiscal 2025.  Adjusted diluted earnings per share excludes the impact of certain items, further described below, not contemplated in the Company’s business outlook for fiscal 2025.  \nFiscal 2025 Impacts\nDuring fiscal 2025, the Company recognized financial impacts from the following:\n•\nIn the third quarter of fiscal 2025, the Company recognized pre-tax expenses of $129 million consisting of transaction costs and intangible asset amortization related to the acquisition of Artisan Design Group and Foundation Building Materials (Acquisition of businesses).\nFiscal 2024 Impacts:\nDuring fiscal 2024, the Company recognized financial impacts from the following:\n•\nIn the third quarter of fiscal 2024, the Company recognized pre-tax income of $54 million consisting of a realized gain on the contingent consideration associated with the fiscal 2022 sale of the Canadian retail business (Canadian retail business transaction). \nAdjusted diluted earnings per share should not be considered an alternative to, or more meaningful indicator of, the Company’s diluted earnings per common share as prepared in accordance with GAAP.  The Company’s methods of determining non-GAAP financial measures may differ from the method used by other companies and may not be comparable.\n19\nTable of Contents\nThree Months Ended\nOctober 31, 2025\nNovember 1, 2024\nPre-Tax Earnings\nTax\n1\nNet Earnings\nPre-Tax Earnings\nTax\n1\nNet Earnings\nDiluted earnings per share, as reported\n$\n2.88\n \n$\n2.99\n \nNon-GAAP adjustments – per share impacts\n  Acquisition of businesses\n0.23 \n(0.05)\n0.18 \n— \n— \n— \nCanadian retail business transaction\n— \n— \n— \n(0.10)\n— \n(0.10)\nAdjusted diluted earnings per share\n$\n3.06\n \n$\n2.89\n \n1\n \nRepresents the corresponding tax benefit or expense specifically related to the items excluded from adjusted diluted earnings per share.\nReturn on Invested Capital\nReturn on Invested Capital (ROIC) is calculated using a non-GAAP financial measure.  Management believes ROIC is a meaningful metric for analysts and investors as a measure of how effectively the Company is using capital to generate financial returns.  Although ROIC is a common financial metric, numerous methods exist for calculating ROIC.  Accordingly, the method used by our management may differ from the methods used by other companies.  We encourage you to understand the methods used by another company to calculate ROIC before comparing its ROIC to ours.\nWe define ROIC as the rolling 12 months’ lease adjusted net operating profit after tax (Lease adjusted NOPAT) divided by the average of current year and prior year ending debt and shareholders’ deficit.  Lease adjusted NOPAT is a non-GAAP financial measure, and net earnings is considered to be the most comparable GAAP financial measure.  The calculation of ROIC, together with a reconciliation of net earnings to Lease adjusted NOPAT, is as follows:\nFor the Periods Ended\n(In millions, except percentage data)\nOctober 31, 2025\nNovember 1, 2024\nCalculation of Return on Invested Capital\nNumerator\n \nNet Earnings\n$\n6,779 \n$\n6,853 \nPlus:\nInterest expense – net\n1,331 \n1,333 \nOperating lease interest\n177 \n172 \nProvision for income taxes\n2,165 \n2,137 \nLease adjusted net operating profit\n10,452 \n10,495 \nLess:\nIncome tax adjustment\n1\n2,530 \n2,495 \nLease adjusted net operating profit after tax\n$\n7,922 \n$\n8,000 \nDenominator\nAverage debt and shareholders’ deficit\n2\n$\n30,307 \n$\n25,603 \nNet earnings to average debt and shareholders’ deficit\n22.4\n \n%\n26.8\n \n%\nReturn on invested capital\n26.1\n \n%\n31.2\n \n%\n1\n    \nIncome tax adjustment is defined as lease adjusted net operating profit multiplied by the effective tax rate, which was 24.2% and 23.8% for the periods ended October 31, 2025, and November 1, 2024, respectively.\n2    \nAverage debt and shareholders’ deficit is defined as average current year and prior year ending debt, including current maturities, short-term borrowings, and operating lease liabilities, plus the average current year and prior year ending total shareholders’ deficit.\nResults of Operations\nNet Sales –\n Net sales in the third quarter of 2025 increased 3.2% to $20.8 billion.  Comparable sales increased 0.4%, consisting of a 3.4% increase in comparable average ticket, partially offset by a 3.0% decline in comparable customer transactions.  \n20\nTable of Contents\nDuring the third quarter of 2025, ten of our 14 product categories experienced positive comparable store sales, led by Rough Plumbing, Appliances, Paint and Flooring.  Strength in these categories reflects continued growth with our Pro customer and online, as well as our broad assortment of appliances available next-day to our customers in the majority of the United States.\nNet sales increased 0.9% to $65.7 billion for the first nine months of 2025 compared to 2024.  Comparable sales declined 0.1% over the same period, driven by a 3.0% decline in comparable customer transactions, partially offset by a comparable average ticket increase of 2.9%.  \nGross Margin –\n For the third quarter of 2025, gross margin as a percentage of sales increased fifty basis points compared to 2024.  The gross margin improvement for the quarter was driven by cycling storm pressures from the prior year, as well as improvements in credit revenue and better sell-through of inventory as part of item rationalization efforts.\nGross margin as a percentage of sales increased thirty-five basis points in the first nine months of 2025 compared to 2024, primarily due to cycling storm pressures from the prior year, as well as improvements in credit revenue.  \nSG&A –\n For the third quarter of 2025, SG&A expense deleveraged 102 basis points as a percentage of sales compared to the third quarter of 2024, primarily due to cycling the prior year gain on contingent consideration associated with the fiscal 2022 sale of the Canadian retail business, expenses associated with the acquisitions of ADG and FBM, along with an increase in employee compensation and benefits.\nSG&A expense as a percentage of sales deleveraged 63 basis points as a percentage of sales for the first nine months of 2025 compared to 2024, primarily due to the same factors that impacted SG&A for the third quarter.\nDepreciation and Amortization –\n Depreciation and amortization deleveraged 13 basis points as a percentage of sales for the third quarter of 2025 compared to 2024.\nDepreciation and amortization deleveraged 13 basis points as a percentage of sales for the first nine months of 2025 compared to 2024.\nInterest – Net\n – Net interest expense for the third quarter of 2025 deleveraged 12 basis points as a percentage of sales primarily due to the costs related to the bridge financing for the FBM acquisition.\nNet interest expense for the first nine months of 2025 deleveraged one basis point as a percentage of sales. \nIncome Tax Provision –\n Our effective income tax rates were 24.1% and 23.6% for the three months ended October 31, 2025 and November 1, 2024, respectively, and 24.0% and 23.8% for the nine months ended October 31, 2025 and November 1, 2024, respectively.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity\nCash flows from operations, combined with our continued access to capital markets on both a short-term and long-term basis, as needed, remain adequate to fund our operations, make strategic investments to support long-term growth, return cash to shareholders in the form of dividends, and repay debt maturities as they become due.  We believe these sources of liquidity will continue to support our business for the next twelve months.  As of October 31, 2025, we held $0.6 billion of cash and cash equivalents, as well as $5.0 billion in undrawn capacity on our Revolving Credit Facilities at quarter end.  \nCash Flows Provided by Operating Activities\nNine Months Ended\n(In millions)\nOctober 31, 2025\nNovember 1, 2024\nNet cash provided by operating activities\n$\n8,297 \n$\n8,714 \nCash flows from operating activities continued to provide the primary source of our liquidity.  The decrease in net cash provided by operating activities for the nine months ended October 31, 2025, compared to the nine months ended November 1, 2024, was \nprimarily driven by the timing of income tax payments in the third quarter of fiscal 2025 which were previously deferred under the income tax relief announced by the IRS for businesses impacted by Hurricane Helene. \n \n21\nTable of Contents\nCash Flows Used in Investing Activities\nNine Months Ended\n(In millions)\nOctober 31, 2025\nNovember 1, 2024\nNet cash used in investing activities\n$\n(11,687)\n$\n(1,320)\nNet cash used in investing activities is primarily driven by our acquisitions of ADG and FBM which used $10.1 billion for the nine months ended October 31, 2025.  In addition, total capital expenditures were $1.6 billion and $1.4 billion for the nine months ended October 31, 2025, and November 1, 2024, respectively.  Our capital expenditures generally consist of investments in our strategic initiatives to enhance our ability to serve customers, improve existing stores, and support expansion plans.  For fiscal 2025, our guidance for capital expenditures is up to $2.5 billion.\nCash Flows Provided by / (Used in) Financing Activities\nNine Months Ended\n(In millions)\nOctober 31, 2025\nNovember 1, 2024\nNet cash provided by/(used in) financing activities\n$\n2,250 \n$\n(5,044)\nNet cash provided by and used in financing activities primarily consists of transactions related to our debt, share repurchases, and cash dividend payments.\nDebt\nDuring the three months ended October 31, 2025, the Company issued $5.0 billion of unsecured notes.  In addition, the Company entered into a $2.0 billion unsecured term loan credit agreement (2025 Term Loan) which has a maturity date of October 2028.  The proceeds from the unsecured notes and the 2025 Term Loan were designated to finance, in part, our acquisition of FBM and general corporate purposes.\nOn September 16, 2025, the Company entered into a $2.0 billion five-year unsecured credit agreement (2025 Credit Agreement), which has a maturity date of September 2030, replacing the Company’s $2.0 billion five-year unsecured revolving credit agreement entered into in December 2021, and as amended (Third Amended and Restated Credit Agreement).\nOn September 16, 2025, the Company also amended the five-year unsecured revolving credit agreement dated September 1, 2023 (the 2023 Credit Agreement) with a syndicate of banks, which has a maturity date of September 2028 and an aggregate availability of $2.0 billion.\n \nUnder the amendment, borrowings under the 2023 Credit Agreement will no longer be subject to a SOFR credit spread adjustment. \nThe 2025 Credit Agreement and the 2023 Credit Agreement (collectively the Long-Term Credit Agreements) support the Company’s commercial paper program.  The amounts available to be drawn under the Long-Term Credit Agreements are reduced by the amount of borrowings under the commercial paper program.  As of October 31, 2025, November 1, 2024, and January 31, 2025, there were no outstanding borrowings under the Company’s commercial paper program or the Long-Term Credit Agreements.  \nOn September 16, 2025, the Company also entered into a $1.0 billion 364-day unsecured revolving credit agreement (collectively with the Long-Term Credit Agreements the “Revolving Credit Facilities”) which has a maturity date of September 2026 and had no outstanding borrowings as of October 31, 2025.\nThe following table includes additional information related to our debt for the nine months ended October 31, 2025, and November 1, 2024:\nNine Months Ended\n(In millions)\nOctober 31, 2025\nNovember 1, 2024\nNet proceeds from issuance of debt\n$\n6,974 \n$\n— \nRepayment of debt\n(2,568)\n(522)\nNet change in commercial paper\n— \n— \nMaximum commercial paper outstanding at any period\n125 \n250 \n22\nTable of Contents\nShare Repurchases\nWe have a share repurchase program, authorized by the Company’s Board of Directors, that is executed through purchases made from time to time either in the open market or through private off-market transactions.  We also withhold shares from employees to satisfy tax withholding liabilities.  Shares repurchased are retired and returned to authorized and unissued status.  The following table provides, on a settlement date basis, the total number of shares repurchased, average price paid per share, and the total cash used to repurchase shares for the nine months ended October 31, 2025, and November 1, 2024:\nNine Months Ended\n(In millions, except per share data)\nOctober 31, 2025\nNovember 1, 2024\nTotal amount paid for share repurchases\n1\n$\n115 \n$\n2,681 \nTotal number of shares repurchased\n0.5 \n11.2 \nAverage price paid per share\n$\n243.45 \n$\n239.11 \n1   \nExcludes unsettled share repurchases and excise taxes.\nAs of October 31, 2025, we had $10.8 billion remaining available under our share repurchase program with no expiration date.  In fiscal 2025, the Company paused its share repurchase program.\nDividends\nDividends are paid in the quarter immediately following the quarter in which they are declared.  Dividends paid per share increased from $3.35 per share for the nine months ended November 1, 2024, to $3.50 per share for the nine months ended October 31, 2025.\nCapital Resources\nWe expect to continue to have access to the capital markets on both a short-term and long-term basis when needed for liquidity purposes by issuing commercial paper or new long-term debt.  The availability and the borrowing costs of these funds could be adversely affected, however, by a downgrade of our debt ratings or a deterioration of certain financial ratios.  The table below reflects our debt ratings by Standard & Poor’s (S&P) and Moody’s as of November 26, 2025, which we are disclosing to enhance understanding of our sources of liquidity and the effect of our ratings on our cost of funds.  Our commercial paper and senior debt ratings may be subject to revision or withdrawal at any time by the assigning rating organization, and each rating should be evaluated independently of any other rating. \nDebt Ratings\nS&P\nMoody’s\nCommercial Paper\nA-2\nP-2\nSenior Debt\nBBB+\nBaa1\nSenior Debt Outlook\nStable\nStable\nThere are no provisions in any agreements that would require early cash settlement of existing debt or leases as a result of a downgrade in our debt rating or a decrease in our stock price.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur significant accounting policies are described in Note 1 to the consolidated financial statements presented in the Annual Report.  Our critical accounting policies and estimates are described in “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Annual Report.  Our significant and critical accounting policies and estimates have not changed significantly since the filing of the Annual Report, except as set forth below.\nBusiness Combinations\nDescription\nWe account for business combinations using the acquisition method of accounting, which requires that once control is obtained, all the assets acquired and liabilities assumed are recorded at their respective fair values at the date of acquisition.  Goodwill is measured as of the acquisition date as the excess of consideration transferred over the net acquisition‑date fair value of the net identifiable assets acquired and liabilities assumed.  During the measurement period, which is up to one year from the acquisition date, the Company may record adjustments to the assets acquired and liabilities assumed with the corresponding \n23\nTable of Contents\noffset to goodwill due to the use of preliminary information in our initial estimates.  Subsequent to the measurement period, any adjustments are recorded to earnings.\nJudgments and uncertainties involved in the estimate\nThe determination of fair values of identifiable assets and liabilities requires estimates and the use of valuation techniques when fair value is not readily available and requires a significant amount of management judgment.  For the valuation of intangible assets acquired in a business combination, we typically use an income approach.  Specifically, for the acquisitions of ADG and FBM, we used the multi-period excess earnings method to value Customer Relationships and the relief from royalty method to value Tradenames. The significant assumptions used to estimate the fair value of intangibles included forecasted revenues and expenses, growth rates, royalty rates, attrition rates, and discount rates. \nEffect if actual results differ from assumptions\nAlthough the Company believes its estimates of fair value are reasonable, actual financial results could differ from those estimates due to the inherent uncertainty involved in making such estimates.  Changes in assumptions concerning future financial results or other underlying assumptions could have a significant impact on the determination of the fair value of the intangible assets acquired."
}