{
  "source_file": "low-20250131.htm",
  "form_type": "10-K",
  "item1": "Item 1 - Business\n \nGeneral Information\nLowe’s Companies, Inc. and subsidiaries (the Company or Lowe’s) is a Fortune\n®\n 50 company and the world’s second largest home improvement retailer.  As of January 31, 2025, Lowe’s opera\nted 1,748 \nhome improvement stores and outlets in the United States, representing approximately 195 million\n sq\nuare feet of retail selling space.  \nLowe’s was founded in 1921 with the opening of its first hardware store in North Wilkesboro, North Carolina.  The Company was incorporated in North Carolina in 1952 and has been publicly held since 1961.  The Company’s common stock is listed on the New York Stock Exchange - ticker symbol “LOW”.\nFor additional information about the Company’s performance and financial condition, see \nItem 7\n, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”, of this Annual Report. \nOur Strategy\nLowe’s is an omnichannel retailer whose focus is on helping customers solve problems and fulfill dreams for their homes by providing an excellent customer experience, creating a great place to work for our associates, and improving our communities, which we believe will create long-term, sustainable value for our shareholders.  In fiscal 2024, we continued to execute on our Total Home strategy that was introduced in fiscal 2020, by focusing on serving the professional customer (Pro customer), accelerating our online business, expanding installation services, improving localization efforts and elevating our product assortment.  In December 2024, we updated our Total Home strategy, aligned with the key drivers of home improvement demand, to help our customers solve their home improvement needs with more value and exceptional service.  The five pillars of our Total Home strategy are as follows:\nDrive \nPro penetration\nAccelerate\nonline sales\nExpand\nhome services\nCreate a\nloyalty ecosystem\nIncrease\nspace productivity\n•\nWe continue to transform our Pro offerings to drive Pro penetration by continuing to enhance our Pro product assortment, investing in inventory of high-volume Pro products, launching our redesigned loyalty program, improving job site delivery capabilities, and rolling out our new Pro extended aisle.  \n•\nWe are investing in our omnichannel retail capabilities to accelerate our online business through project design tools and our online product marketplace.  \n•\nWe are expanding our installation services to create a high value simplified installation solution, which are provided by our network of independent installers or outsourced to our third-party model that sells, furnishes, and installs both smaller refresh projects and more complex projects.  \n•\nWe are creating a loyalty ecosystem that drives brand preference and includes building out our MyLowe’s Rewards infrastructure for both Pro and do-it-yourself (DIY) customers.  \n•\nFinally, we are increasing space productivity by optimizing our assortments and tailoring them to the local markets, and balancing our value-oriented private brands with our national brands.    \nOur Customers and Market\nThe home improvement market in which we operate is highly fragmented, serving Pro customers, individual homeowners, and renters completing a wide array of projects that vary along the spectrum of DIY and do-it-for-me (DIFM).  The Pro customer at Lowe’s is primarily the small to medium sized Pro, which includes three broad categories: tradespeople, repair and remodelers, and property managers.  \n \n1\nTable of Contents\nThere are many variables that affect consumer demand for the home improvement products and services we offer.  Key indicators we monitor include home price appreciation, age of the housing stock, real disposable personal income, and housing turnover.  We also monitor demographic and societal trends that shape home improvement industry growth over time as the US population moves through major life stages and events.  These include strong millennial household formation, an increased preference among older generations to age in place, and the persistence of remote work.\nOur Competition\nThe home improvement industry includes a broad competitive landscape that continues to evolve.  We compete with national and regional home improvement warehouse chains and lumber yards in most of the markets we serve.  We also compete with traditional hardware, plumbing, electrical, and home supply retailers, as well as paint stores, lumber yards, garden centers, and maintenance and repair organizations.  In addition, we compete with general merchandise retailers, home goods specialty stores, warehouse clubs, online retailers, other specialty retailers, providers of equipment and tool rental, service providers that install home improvement products, and wholesalers that provide home-related products and services to homeowners, renters, businesses, and the government.  \nLocation of stores, product assortment, product pricing, and customer service continue to be key competitive factors in our industry, while the evolution of technology, including artificial intelligence (AI) and machine learning technologies, expansion of fulfillment capabilities, and customer expectations also underscore the importance of omnichannel capabilities as a competitive factor.  See further discussion of competition in \nItem 1A\n, “Risk Factors”, of this Annual Report.\nOur Omnichannel Capabilities\nWe are committed to meeting customer demand to shop however, whenever, and wherever they choose.  Our omnichannel network provides a single view of the customer, no matter where they place their order, whether in-store, online, on-site or through the contact center.  This allows our customers to move from channel to channel with simple and seamless transitions even within the same transaction.  For example, for many projects, the majority of our customers conduct research online before making an in-store purchase.  For purchases made on Lowes.com, customers may pick up their purchase in-store at the customer service desk, curbside, or from touchless lockers, or have their purchase delivered to their home or business.  In addition, flexible fulfillment options are available for in-store purchases and those made through the contact center.  Regardless of the channels through which customers choose to engage with us, we strive to provide them with a seamless experience across channels and an extended aisle of products, enabled by our flexible fulfillment capabilities.  Our ability to sell products in-store, online, on-site, or through our contact centers speaks to our leverage of our existing infrastructure with the omnichannel capabilities we continue to introduce.\nIn-Store\nOur \n1,748\n Lowe’s-branded home improvement stores and outlet stores are generally open seven days per week and average approximately 112,000 square feet of retail selling space, plus approximately 32,000 square feet of outdoor garden center selling space.  Our home improvement stores offer similar products and services, with certain variations based on localization, along with a dedicated team of knowledgeable and friendly frontline associates available to assist our customers.  We continue to develop and implement productivity tools, including our front-end transformation and freight flow optimization initiatives,  to enhance the efficiency of our sales associates and improve the customer experience.  Our Lowe’s Outlet stores have a smaller format and offer value to our customers through incremental savings on discontinued, overstocked, or scratch and dent items.  \nOnline\nThrough our websites and mobile applications, we seek to empower consumers by providing a 24/7 shopping experience, product information, customer ratings and reviews, buying guides, how-to videos, and other information.  These tools help consumers make more informed purchasing decisions and give them increased confidence to undertake home improvement projects.  We enable customers to choose from a variety of fulfillment options, including buying online and picking up in-store, curbside pick-up, same-day delivery through our gig network, and shipment to their homes or businesses.  Further, we also offer digital inspiration, design, and project management tools across our destination home improvement categories. \nOn-Site\nWe have on-site specialists available for retail and Pro customers to assist them in selecting products and services for their projects.  Our Pro sales managers meet with Pro customers at their place of business or on a job site and leverage nearby stores and our distribution network to ensure we meet customer needs for products and resources.  In addition, our In-Home Sales program is available in the majority of our stores to discuss various exterior projects such as windows, doors, and fencing, whose characteristics lend themselves to an in-home consultative sales approach.  \n2\nTable of Contents\nContact Centers\nLowe’s operates contact centers utilizing a combination of internal staffing and third-party providers.  These contact centers help Lowe’s enable an omnichannel customer experience by providing the ability to tender sales, assist with order management, coordinate deliveries, manage after-sale installations, and answer general customer questions via phone, mail, e-mail, live chat, and social media.\n \nOur Products\nProduct Selection\nTo meet customers’ varying needs, we offer a complete line of products for construction, maintenance, repair, remodeling, and decorating.  We offer home improvement products in the following categories: Appliances, Seasonal & Outdoor Living, Lumber, Lawn & Garden, Kitchens & Bath, Hardware, Building Materials, Millwork, Paint, Rough Plumbing, Tools, Electrical, Flooring, and Décor.  A typical Lowe’s-branded home improvement store stocks approximately 40,000 items, with additional items available through our online selling channel.  Our product assortments offered in-store strive to meet the needs of the local market for the Pro and DIY customer.  See \nNote 16\n of the Notes to Consolidated Financial Statements included in \nItem 8\n, “Financial Statements and Supplementary Data”, of this Annual Report for historical revenues by product category for each of the last three fiscal years.  \nWe are committed to offering a wide selection of national brand-name merchandise complemented by our selection of high-value private brands.  We are balancing our value-oriented private brands with our national power brands, intensifying our localization efforts and expanding our rural assortment.  In addition, we are dedicated to selling products sourced in a socially responsible, efficient, and cost-effective manner.\nSupply Chain\nWe source our products from vendors worldwide and believe that alternative and competitive suppliers are available for virtually all of our products.  Whenever possible, we purchase directly from manufacturers to provide savings for customers and improve our gross margin.\nTo efficiently replenish our stores and meet our customers’ expectations for fast fulfillment and delivery, we own and operate more than 120 supply chain facilities in our network.  These facilities include regional distribution centers (RDCs), flatbed distribution centers (FDCs), import distribution centers (IDCs), bulk distribution centers (BDCs), cross-dock terminals (XDTs), and Fulfillment Centers (FCs).  Fulfillment centers, along with many of our stores, ship product directly to our customers.  In addition, we leverage our existing supply chain to deliver directly to our Pro customers.  Each one of these distribution nodes plays a critical role in our Total Home strategy and collectively enable our products to get to their destination as efficiently as possible.\nThe FDCs distribute merchandise that requires special handling due to size or type of packaging such as lumber, boards, panel products, pipe, siding, ladders, and building materials.  On average, each RDC and FDC serves approximately 115 stores.  Our Pro fulfillment network stocks deeper quantities of our top Pro assortments and has expanded capabilities to handle large orders on multiple flat bed trucks.  Our IDCs were expanded to create more capacity to hold import product at the coast, which improves our network’s agility to move inventory where and when it is needed.  Our BDCs handle appliances and other big and bulky products, and our XDTs fulfill final mile box truck deliveries of these products.  \nOur supply chain supports every pillar of our Total Home strategy, and as such, we continue to invest and transform our network to unlock our omnichannel capabilities while keeping our organization’s sustainability goals top of mind.  As part of the completion of the rollout of our market-based delivery model, we expanded to additional geographic areas and enhanced our distribution capacity for big and bulky products.  As of fiscal year 2024, we have finalized the roll-out of our market-based delivery model.\nWe have also been focused on improving the speed of our delivery capabilities for our customers.  As of fiscal year 2024, most parcel-eligible items fulfilled by Lowe’s can be ordered by a customer and delivered within two business days or less at standard shipping rates.  Also, the nationwide expansion of our gig provider network enables same-day delivery of certain products from our stores, and as of fiscal 2024, we have the ability to deliver major appliances next-day in almost every zip code in the United States.  Customer needs and buying patterns are constantly changing, and our supply chain will continue to evolve to meet their needs.  We are building an omnichannel supply chain that positions the right products in the right quantities in the right places, and operates with greater network capacity with better flow management and optimization.   \n3\nTable of Contents\nOur Services\nInstalled Sales\nWe offer installation services through independent contractors in many of our product categories, with Kitchen & Bath, Flooring, Appliances, Millwork, and Rough Plumbing accounting for the majority of installed sales.  Our installed sales model, which separates selling and project administration tasks, allows our sales associates to focus on project selling, while project managers ensure that the details related to installing the products are efficiently executed.  We are simplifying the process through a team of remote associates that we call our central selling team.  This team handles building quotes, answering questions over video or phone call, and providing personalized support to our customers.  We are also implementing technology that allows our customers to finalize their installation contract and checkout on lowes.com or mobile application, so they do not need to return to the store.  \nInstalled sales, which includes both product and \nlabor, accounted for approximately 5% of total sales in fiscal 2024.\nLowe’s Protection Plans and Repair Services\nWe offer extended protection plans for certain products within the Appliances, Kitchens & Bath, Décor, Millwork, Rough Plumbing, Electrical, Seasonal & Outdoor Living, Tools, and Hardware categories.  These protection plans provide customers with product protection that enhances the coverage offered by the manufacturer’s warranty and provide additional benefits and repair services that extend beyond the manufacturer’s warranty.  \nSeasonality and Working Capital\nThe home improvement business in general is subject to seasonal influences, particularly related to the spring selling season.  Historically, we have realized the highest volume of sales during our second fiscal quarter (May, June, and July) and the lowest volume of sales during our fourth fiscal quarter (November, December, and January).  Accordingly, our working capital requirements have historically been greater during our fourth fiscal quarter as we build inventory in anticipation of the spring selling season and as we experience lower fourth fiscal quarter sales volumes.  We fund our working capital requirements primarily through cash flows generated from operations, but also with short-term borrowings, as needed.  For more detailed information, see the Financial Condition, Liquidity and Capital Resources section in \nItem 7\n, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”, of this Annual Report.\nIntellectual Property\nThe name “Lowe’s” is a registered service mark of one of our wholly-owned subsidiaries.  We consider this mark and logo and the accompanying goodwill and name recognition to be valuable to our business.  This subsidiary owns and maintains various additional registered and unregistered trademarks, service marks and trade names, including private brand product names, such as, “Kobalt”, “STAINMASTER”, and “allen+roth.”  This subsidiary also maintains various Internet domain names that are important to our business, and we also own registered and unregistered copyrights.  In addition, we maintain patent portfolios related to some of our products and services and seek to patent or otherwise protect certain innovations that we incorporate into our products, services, or business operations.\nGovernment Regulation\nWe are subject to a wide array of federal, state, and local laws and regulations.  We do not currently expect compliance with these laws and regulations to have a material effect on our capital expenditures, results of operations, and competitive position as compared to prior periods.\nHuman Capital\nWhen it comes to attracting and retaining top talent, Lowe’s strives to be the employer of choice in retail.  At Lowe’s we are committed to creating valuable career opportunities for our associates, supporting them and the communities where they live, and cultivating a culture that invites and encourages diverse opinions and ideas.  We would like our associates to see Lowe’s as a “Home to Possibility” with good jobs, a sense of belonging, and a promising future.  \nAs a testament to our commitments, in fiscal 2024 we received several notable employer of choice awards, including being named on the Disability:IN National Best Places to Work for Disability Inclusion, Fortune’s World’s Most Admired Companies Specialty Retailer, 2024 Great Place to Work Certified - U.S. and India,  Fair360 Top 50 Noteworthy Company for Workplace Fairness, 2024 American Opportunity Index Top 100 Company, and a Best Corporation for Veteran’s Business Enterprises of the Year.\n4\nTable of Contents\nOur People\nAs of January 31, 2025, Lowe’s employed approximately 161,000 full-time associates and 109,000 part-time associates, primarily in the United States and India.  During the spring season, we temporarily expand our workforce by hiring associates in part-time and full-time positions to meet the elevated levels of demand.  \nAt Lowe’s, we have a proactive associate listening strategy, most notably through our annual engagement survey.  In fiscal 2024, more than 90% of our associates participated in our survey, and our people leaders use the feedback to improve our associate experience.\nCreating Good Jobs\nWe have a strong track record of investing in our workforce by offering locally competitive salaries and wages.  As of fiscal 2024, our minimum wage starts at $15 per hour, which helps us remain competitive for talent in all of our markets.  These investments include incremental wages and share-based compensation for our frontline associates, which included creating many new roles for our associates to grow into as they advance along their career path.  \nWe offer an array of health, welfare, and financial benefits to our full-time and part-time associates, including health care and insurance benefits, retirement plans, an employee stock purchase plan, paid time off, and leave programs, among many others.  We have implemented workforce management tools that enable us to offer various scheduling options to our full-time associates to foster an improved experience in balancing their work and life responsibilities.  This includes such options for a shortened workweek, consistent shifts, or consecutive days off. \nOur focus on the associate experience begins at initial application.  The implementation of improved technology in the hiring process has simplified the experience for those looking to join Lowe’s and helped to drive the experience overall.  We have  Spanish language capabilities to promote bilingual hiring by guiding Spanish-speaking candidates through the full application process.  \nProviding a safe environment for both working and shopping is our highest priority at Lowe’s.  We strive to maintain a culture of safety, which begins with our leaders modeling the behaviors we want our associates to adopt.  We embed safety into associate onboarding, developmental e-learning, and on-the-job training.\nSense of Belonging\nWe believe that by building diverse and inclusive teams with a range of perspectives, backgrounds, and experiences, and equal opportunity for all, we drive better ideas, positive business results, and improve service through a deeper connection with the diverse communities we serve.  Earlier this year, we evolved our diversity and inclusion initiatives, combining our eight Business Resource Groups into one umbrella associate engagement organization.  By shifting to one, unified program, Lowe’s is able to foster networking and development for all associates across all areas of the business.  Additionally, we eliminated our sponsorship of outside festivals, parades, and fairs to focus on our four community pillars: safe and affordable housing, community improvements, skilled trades education, and disaster response.  Finally, we are evaluating our participation in external surveys, factoring in the goals of each survey and whether we will gain any actionable insights as a result of our participation.  These changes were made with the goal of creating a more respectful and inclusive workplace for all of our associates.\nPromising Future\nWe are committed to securing top talent and providing ongoing training and other developmental opportunities to facilitate meaningful careers at Lowe’s.  We offer a variety of role-specific leadership and development programs that build and reinforce functional-technical/professional skills, business acumen, and leadership skills to prepare high-performing leaders for their next role.  Our focus on leadership development enables us to grow talent internally and has resulted in more than 85% of store leadership positions being filled internally in the last year.\nOur Lowe's University offerings include the District Manager and Store Manager immersive week-long leadership experience programs, delivered from the Lowe’s University training center; the virtually-delivered store department supervisor fundamentals series; the virtually-delivered field supply chain leadership director, manager, and supervisor experience programs; and the certification programs for store and technology associates that further develop their skills and knowledge base.  In addition, our in-person Lowe’s University offerings include an Assistant Store Manager leadership training to further develop our store leaders.\nAdditionally, through Lowe’s Track to the Trades program, we offer all Lowe’s associates the opportunity to enroll in programs to complete apprentice certifications in electrical, plumbing, HVAC, appliance repair, or multi-family maintenance.  The program also connects them with Pros to help them start a career in their area of interest.  The Track to the Trades program \n5\nTable of Contents\ndemonstrates Lowe’s commitment to our industry and the communities we serve.  This program, combined with our tuition-free education program, are further examples of how we are investing in the development of our associates.\nCorporate Responsibility\nWe take our role as a Fortune\n®\n 50 retailer seriously by managing our business responsibly and focusing on serving our associates and improving the communities where we live and work.  Sustainability objectives are integrated into our business operations, particularly by focusing on the three pillars of our sustainability strategy: our people and communities, product sustainability, and operational excellence, which includes reducing the environmental footprint of our operations, which we believe will help drive long-term shareholder value. In fiscal 2024, for the sixth consecutive year, Lowe’s was included in the Dow Jones Sustainability North America Index based on our environmental, social, and operational practices.\nInvesting in our Communities\nWe understand the important role Lowe’s plays in supporting our communities through our philanthropic efforts.  With our community engagement initiatives and continued partnerships with nonprofits across the nation, we are revitalizing neighborhoods, improving community spaces, responding when natural disasters strike, and preparing the next generation of skilled tradespeople.  We carry out these initiatives with a special focus on veterans, the active military community, and first responders.  Additionally, since awarding its first Gable Grants in 2023, the Lowe’s Foundation has invested over $25 million to help expand skilled trades career pathways through a growing network of community colleges and nonprofits in rural and urban communities.  From funding new skilled trade facilities and instructors to accreditation programs, these grants support carpentry and construction, HVAC, electrical, plumbing, and appliance repair training. \nProduct Sustainability\nWe are committed to promoting sustainable practices throughout our supply chain and providing customers with eco-friendly, high quality, and safe products.  Our products undergo a thorough selection process, beginning with our sourcing decisions. Through collaboration and established management systems, we monitor our suppliers’ practices to secure high-quality products from suppliers who support worker rights and protect the environment.  Lowe’s human rights policy supports the fundamental principles of human rights, as defined by the “Universal Declaration of Human Rights.”  We continue to hold all suppliers to our rigorous standards through our human rights policy, our conflict minerals policy, and our Vendor Code of Conduct, which includes enhanced environmental standards.  \nIn addition, we have a wood sourcing policy with principles that we expect our vendors to follow, including no illegal logging; no deforestation; no sourcing of endangered species; the protection and preservation of biodiversity; and undergoing and securing Free, Prior and Informed Consent, as defined by the United Nations, wherever applicable.  We have enhanced our wood sourcing policy to include a more robust risk-based approach, including new wood sourcing risk levels by country, improved monitoring practices, and a new forestry grievance process.\n \nWe are dedicated to empowering our customers to lead more sustainable lives while minimizing the environmental footprint of our products.  We continue to expand our offering of independently certified products that have validated environmental claims, preserve and protect natural resources, and help customers decrease energy and water consumption.  We work with local and regional utilities to offer customers assorted rebates for a variety of efficient products including ENERGY STAR\n®\n and WaterSense\n®\n. \nReducing our Environmental Footprint\nWe are committed to mitigating climate change by reducing the environmental impact of our operations and supply chain through reducing carbon emissions with investments in energy efficiency, use of renewable energy, environmentally friendly transportation practices, and innovative water and waste management systems. \nGreenhouse Gas (GHG) Emissions\nIn December 2022, Lowe’s established a goal to reach net-zero emissions across the Company’s scope 1, 2, and 3 GHG emissions by 2050.  Lowe’s has since increased its interim emissions targets for 2030 and committed to decreasing its scope 1 and 2 emissions by 42% and reducing scope 3 emissions by 25% below 2021 levels.  We report our progress annually in Lowe’s Corporate Responsibility Report, to the Carbon Disclosure Project (CDP), and via \nlowes.com/net-zero\n.  The contents of these reports are not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the Securities and Exchange Commission (SEC).\n6\nTable of Contents\nTo reach these targets, Lowe’s will focus on increasing operational efficiency and working to reduce emissions across Lowe's entire value chain.  We are making further investments in energy efficiency and renewable energy within our operations, while exploring emerging technologies to reduce emissions associated with our vehicle fleet and facilities.  Over the past three years, we have spent more than $300 million across multiple projects including replacing stores’ aging HVAC units with high efficiency models, installing and updating building management systems, installing pallet grinders, and completing indoor LED lighting upgrades.  Lowe’s continues to partner with our suppliers to decrease our scope 3 GHG emissions.  We encourage suppliers to report their emissions to CDP, giving suppliers more insight into how they generate emissions, which is the first step toward helping them reduce upstream emissions.  This collaboration can help suppliers increase their operational efficiency and reduce their emissions through the use of renewable energy and low-carbon innovations.  When our suppliers mitigate their impacts on the climate, Lowe’s own scope 3 emissions can be reduced.\nProcuring renewable energy is another lever to reduce our emissions footprint.  Our first renewable power purchase agreement, the Mesquite Star wind farm in Texas, went live in fiscal 2020 and is now in its fifth year of operation.  As we strive to establish a pipeline of other offsite renewable projects, several projects are planned to become active over the next few years.  Lowe’s is a member of the Clean Energy Buyers Association to evaluate and explore new opportunities and technologies across renewable energy markets (e.g., community solar, power purchase agreements), as well as implementing on-site solar generation in multiple states.  In fiscal 2023, we announced plans to install rooftop solar panels at 174 store and distribution center locations nationwide, including more than 50 sites already in operation.  More than 100 sites were operational by the end of fiscal 2024.  Once each site is completed, the solar panels will provide approximately 90% of the energy usage at each location.\nWe are dedicated to promoting sustainable practices in the transportation industry, and we collaborate with the Environmental Protection Agency’s (EPA’s) SmartWay program to reduce transportation emissions by managing and reducing fuel usage through incentives for freight contractors to improve efficiency.  We are an EPA SmartWay program partner and aim for 100% SmartWay certification for our transportation providers.  This program provides access to comprehensive data and oversight of scope 3 emissions associated with our U.S. transportation footprint. \nWaste\nWe partner with suppliers to improve recycling and waste diversion, develop regional management processes, measure waste streams, and conduct waste audits.  At a local level, store waste, including cardboard, broken appliances, and wood pallets, is recycled through national and regional partners, and we provide in-store recycling and reuse centers for our customers to bring in plastic planter pots, compact fluorescent lamp bulbs, plastic bags, and rechargeable batteries.  In our fourth year collaborating with How2Recycle, we continue to educate customers and encourage proper recycling of our product packaging.  As technology and innovative practices improve, we will continue to explore opportunities to participate in the circular economy. \nWater\nWhile our water consumption is modest compared with other industries, we continue to focus on reducing water consumption within our operations.  We use smart irrigation controllers for efficient watering at most stores and have been exploring other water-efficient measures to increase water savings in our stores and garden centers.  Additionally, we use leak detection technology to catch leaks as they occur to prevent unnecessary water use.  We also have protocols in place to manage the disposal of chemicals to prevent release into waterways of the communities we serve. \nCorporate Responsibility Reporting\nLowe’s participates in the CDP’s climate change, forests, and water security questionnaires to benchmark and quantify our environmental practices and provide transparency on our progress.  Lowe’s continues to externally verify our scope 1 and 2 GHG emissions, as well as scope 3 Use of Sold Product GHG emissions and water usage data to increase confidence in our reporting.  Additionally, our annual Corporate Responsibility Report is guided by the Sustainable Accounting Standards Board, the Global Reporting Initiative, and the U.N. Sustainable Development Goals, and we publish our Task Force on Climate-related Financial Disclosures Report to assess our climate-related risks and opportunities and better understand the potential impacts on our value chain. \nAdditional information regarding our activities related to our human capital strategy, as well as our workforce diversity data, latest community improvement projects, and sustainability efforts can be found in our Corporate Responsibility Report and Culture, Diversity & Inclusion Report, which are published annually and can be found on our website at \nresponsibility.lowes.com\n.  The contents of these reports are not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC.\n7\nTable of Contents\nAvailable Information\n \nOur Annual Report, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended, are made available free of charge through our Internet website at \nir.lowes.com\n, as soon as reasonably practicable after such documents are electronically filed with, or furnished to, the SEC.  The SEC maintains an Internet site, \nwww.sec.gov\n, that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.",
  "item7": "Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis summarizes the significant factors affecting our consolidated operating results, financial condition, liquidity and capital resources during the two-year period ended January 31, 2025 (our fiscal years 2024 and 2023).  Unless otherwise noted, all references herein for the years 2024, 2023, and 2022 represent the fiscal years ended January 31, 2025, February 2, 2024, and February 3, 2023, respectively.  Fiscal years 2024 and 2023 contained 52 weeks of operating results compared to fiscal year 2022, which contained 53 weeks.  We intend for this discussion to provide the reader with information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from year to year, and the primary factors that accounted for those changes, as well as how certain accounting principles affect our financial statements.  This discussion should be read in conjunction with our consolidated financial statements and notes to the consolidated financial statements included in this Annual Report that have been prepared in accordance with accounting principles generally accepted in the United States of America.  This discussion and analysis is presented in four sections:\n•\nExecutive Overview\n•\nOperations\n•\nFinancial Condition, Liquidity and Capital Resources\n•\nCritical Accounting Policies and Estimates\nEXECUTIVE OVERVIEW\nThe following table highlights our annual financial results:\n(in millions, except per share data)\n2024\n2023\n2022\n1\nNet sales\n$\n83,674 \n$\n86,377 \n$\n97,059 \nNet earnings\n6,957 \n7,726 \n6,437 \nDiluted earnings per share\n$\n12.23 \n$\n13.20 \n$\n10.17 \nNet cash provided by operating activities\n$\n9,625 \n$\n8,140 \n$\n8,589 \nCapital expenditures\n1,927 \n1,964 \n1,829 \nRepurchases of common stock\n2\n3,929 \n6,334 \n14,128 \nCash dividend payments\n2,566 \n2,531 \n2,370 \n1    \nThe fiscal year ended February 3, 2023 had 53 weeks. The fiscal years ended January 31, 2025 and February 2, 2024 had 52 weeks.\n2    \nRepurchases of common stock on a trade-date basis.\nNet sales for fiscal 2024 decreased \n3.1%\n from fiscal 2023 to \n$83.7 billion\n.  Comparable sales for fiscal 2024 decreased \n2.7%\n, consisting of a\n 3.0% decrease in comparable customer transactions, and a 0.3% increase in comparable average ticket\n.  Net earnings for fiscal 2024 de\ncreased 10.0% to $7.0 billion.  Diluted earnings per common share decreased 7.4% in fiscal 2024 to $12.23 from $13.20 in fiscal 2023. \n Included in fiscal \n2024 results is pre-tax income of $177 million associated with the fiscal 2022 sale of the Canadian retail business, w\nhich \nincreased diluted earnings per share by $0.24\n.  Included in the fiscal 2023 results is $63 million of pre-tax income associated with the sale of the Canadian retail business, which increased diluted earnings per share by $0.11 in fiscal year 2023.  Adjusting for these items, adjusted diluted earnings per common share decreased 8.4% to $11.99 in 2024 from adjusted diluted earnings per common share of $13.09 in 2023 (see the \nnon-GAAP financial measures\n discussion).\nFor fiscal 2024, cash flows from operating activities wer\ne $9.6 billion\n, with $1.9 billion used for capital expenditures.  Continuing to deliver on our commitment to return excess cash to shareholders, the Company repurchased\n $3.9 billion \nof common stock and \npaid $2.6 billion \nin dividends during the year.\nMacroeconomic factors, such as ongoing inflation and higher interest rates resulting in depressed levels of housing turnover,  continued to exert downward pressure on big-ticket DIY discretionary spending in fiscal 2024.  Despite these factors, we generated positive Pro customer comparable sales and increased Pro penetration for the year.  This is the result of our cumulative investments in the right brands and products, greater inventory depth, improved job site delivery, dedicated service levels, and the Pro customer digital experience.  In addition, our strong online performance gives us confidence that our focus on an intuitive user experience and omnichannel fulfillment capabilities, specifically more same-day delivery options and an improved Buy Online Pickup in Store experience, are resonating with our customers.\n24\nTable of Contents\nLooking Forward\n \nThe core demand drivers of our business that we track remain unchanged: disposable personal income, home price appreciation, and the age of the housing stock.  We believe these drivers will sustain long-term demand as homeowners invest in repairs and upgrades.  Trends such as millennial household formation,  the elderly preference to age in place, and the persistence of remote work also support home improvement market demand.  While these demand drivers remain supportive, broader market uncertainties also exist around tariffs, tax policy, and the overall geopolitical environment.  We remain focused on delivering strong operating performance, while continuing to make the right long-term investments for growth.  This includes executing at a high level through the near-term market pressures by driving productivity, managing costs, and investing in our updated Total Home strategy while continuing to drive sustainable, long-term shareholder value.\nOPERATIONS\nThe following table sets forth the percentage relationship to net sales of each line item of the consolidated statements of earnings.  This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements, including the related notes to the consolidated financial statements.\nBasis Point Increase/(Decrease) in\n \nPercentage of Net Sales\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n100.00\n \n%\n100.00\n \n%\n100.00\n \n%\nGross margin\n33.32\n \n33.39\n \n33.23\n \n(7)\n16\nExpenses:\nSelling, general and administrative\n18.74 \n18.02 \n20.94 \n72 \n(292)\nDepreciation and amortization\n2.07 \n1.99 \n1.82 \n8 \n17\nOperating income\n12.51\n \n13.38\n \n10.47\n \n(87)\n291\nInterest – net\n1.57 \n1.60 \n1.16 \n(3)\n44\nPre-tax earnings\n10.94\n \n11.78\n \n9.31\n \n(84)\n247\nIncome tax provision\n2.63 \n2.83 \n2.68 \n(20)\n15\nNet earnings\n8.31\n \n%\n8.95\n \n%\n6.63\n \n%\n(64)\n232\nThe following table sets forth key metrics utilized by management in assessing business performance. This table should be read in conjunction with the following discussion and analysis and the consolidated financial statements, including the related notes to the consolidated financial statements.\nOther Metrics\n2024\n2023\n2022\n1\nComparable sales decrease\n2\n(2.7)\n%\n(4.7)\n%\n(0.9)\n%\nTotal customer transactions (in millions)\n809 \n835 \n937 \nAverage ticket\n3\n$\n103.37 \n$\n103.51 \n$\n103.64 \nAt end of year:\nNumber of stores \n1,748 \n1,746 \n1,738 \nSales floor square feet (in millions)\n195 \n195 \n195 \nAverage store size selling square feet (in thousands)\n4\n112 \n112 \n112 \nNet earnings to average debt and shareholders’ deficit\n27.5 \n%\n31.6 \n%\n26.6 \n%\nReturn on invested capital\n5\n32.0 \n%\n36.4 \n%\n30.4 \n%\n1    \nThe fiscal year ended February 3, 2023 had 53 weeks. The fiscal years ended January 31, 2025 and February 2, 2024 had 52 weeks.\n2     \nA comparable location is defined as a retail location that has been open longer than 13 months.  A location that is identified for relocation is no longer considered comparable in the month of its relocation.  The relocated location must then remain open longer than 13 months to be considered comparable.  A location we have decided to close is no longer considered comparable as of the beginning of the month in which we announce its closing.  Operating locations which are sold are included in comparable sales until the date of sale.  Comparable sales include online sales, which positively impacted comparable sales in fiscal 2024, fiscal 2023, and fiscal 2022 by approximately 50 \n25\nTable of Contents\nbasis points, 25 basis points, and 45 basis points, respectively. The comparable sales calculation for fiscal 2022 was calculated using sales for a comparable 52-week period.\n3    \nAverage ticket is defined as net sales divided by the total number of customer transactions.\n4    \nAverage store size selling square feet is defined as sales floor square feet divided by the number of stores open at the end of the period.\n5    \nReturn on invested capital is calculated using a non-GAAP financial measure.  See below for additional information and reconciliations of non-GAAP measures.\nFiscal 2024 Compared to Fiscal 2023\nNet Sales –\n Net sales decreased 3.1% to $83.7 billion in fiscal 2024.  The decrease in total sales was primarily driven by the decrease in comparable sales.  Comparable sales decreased 2.7% over the same period, driven by a 3.0% decline in comparable customer transactions, and a 0.3% increase in comparable average ticket.  Comparable sales change during each quarter of the fiscal year, as reported, were declines of 4.1% in the first quarter, 5.1% in the second quarter, 1.1% in the third quarter, and an increase of 0.2% in the fourth quarter.\nDuring fiscal 2024, we had comparable sales increases in Building Materials.  An additional four product categories performed above the Company average, including Hardware, Rough Plumbing, Appliances, and Millwork.  Strength in Building Materials reflects strong demand from Pro customers.  Our DIY customer categories were impacted by lower DIY discretionary demand, particularly in bigger-ticket interior projects.  \nGross Margin\n – Gross margin as a percentage of sales for fiscal 2024 decreased seven basis points compared to fiscal 2023.  The gross margin decrease for the year was primarily driven by investments in our supply chain, partially offset by productivity initiatives.   \nSG&A\n – SG&A expense for fiscal 2024 deleveraged 72 basis points as a percentage of sales compared to fiscal 2023.  This was primarily driven by employee compensation and benefits, due to higher bonus attainment and employee insurance costs, as well as cycling favorable legal settlements in the prior year.\nDepreciation and Amortization\n – Depreciation and amortization expense deleveraged eight basis points for fiscal 2024 as a percentage of sales compared to fiscal 2023.  \nInterest – Net\n – Net interest expense is comprised of the following:\n(In millions)\n2024\n2023\nInterest expense, net of amount capitalized\n$\n1,445 \n$\n1,459 \nAmortization of original issue discount and loan costs\n24 \n23 \nInterest on tax uncertainties\n3 \n1 \nInterest income\n(159)\n(101)\nInterest – net\n$\n1,313\n \n$\n1,382\n \nNet interest expense in fiscal 2024 leveraged three basis points. \nIncome Tax Provision\n – Our effective income tax rate was 24.0% in fiscal 2024 compared to 24.1% in fiscal 2023.  \nFiscal 2023 Compared to Fiscal 2022\nFor a comparison of our results of operations, financial condition, liquidity, and capital resources for the fiscal years ended February 2, 2024, and February 3, 2023, see “\nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition a\nnd Results of Operations\n” of our Annual Report on Form 10-K for the fiscal year ended February 2, 2024, filed with the SEC on March 25, 2024.\n26\nTable of Contents\nNon-GAAP Financial Measures\nAdjusted Diluted Earnings Per Share\nAdjusted diluted earnings per share is considered a non-GAAP financial measure.  The Company believes this non-GAAP financial measure provides useful insight for analysts and investors in understanding the comparison of operational performance for fiscal 2024 and fiscal 2023.  Adjusted diluted earnings per share excludes the impact of certain items, further described below, not contemplated in the Company’s business outlook for fiscal 2024 and fiscal 2023.  \nFiscal 2024 Impacts\n•\nIn fiscal 2024, the Company recognized pre-tax income of $177 million consisting of realized gains on the contingent consideration associated with the fiscal 2022 sale of the Canadian retail business (Canadian retail business transaction).\nFiscal 2023 Impacts\n•\nIn fiscal 2023, the Company recognized pre-tax income of $63 million consisting of a realized gain on the contingent consideration and adjustments to the selling price associated with the fiscal 2022 sale of the Canadian retail business (Canadian retail business transaction). \nAdjusted diluted earnings per share should not be considered an alternative to, or more meaningful indicator of, the Company’s diluted earnings per common share as prepared in accordance with GAAP.  The Company’s methods of determining this non-GAAP financial measure may differ from the method used by other companies and may not be comparable.\n2024\n2023\nPre-Tax Earnings\nTax\n1\nNet Earnings\nPre-Tax Earnings\nTax\n1\nNet Earnings\nDiluted earnings per share, as reported\n$\n12.23\n \n$\n13.20\n \nNon-GAAP adjustments – per share impacts\nCanadian retail business transaction\n(0.31)\n0.07 \n(0.24)\n(0.11)\n— \n(0.11)\nAdjusted diluted earnings per share\n$\n11.99\n \n$\n13.09\n \n1\n \nRepresents the tax benefit or expense related to the item excluded from adjusted diluted earnings per share.\nReturn on Invested Capital\nReturn on Invested Capital (ROIC) is calculated using a non-GAAP financial measure.  Management believes ROIC is a meaningful metric for analysts and investors as a measure of how effectively the Company is using capital to generate financial returns.  Although ROIC is a common financial metric, numerous methods exist for calculating ROIC.  Accordingly, the method used by our management may differ from the methods used by other companies.  We encourage you to understand the methods used by another company to calculate ROIC before comparing its ROIC to ours.\nWe define ROIC as the rolling 12 months’ lease adjusted net operating profit after tax (Lease adjusted NOPAT) divided by the average of current year and prior year ending debt and shareholders’ deficit.  Lease adjusted NOPAT is a non-GAAP financial measure, and net earnings is considered to be the most comparable GAAP financial measure.  The calculation of ROIC, together with a reconciliation of net earnings to Lease adjusted NOPAT, is as follows:\n27\nTable of Contents\n(In millions, except percentage data)\n2024\n2023\n2022\nCalculation of Return on Invested Capital\nNumerator\nNet earnings\n$\n6,957 \n$\n7,726 \n$\n6,437 \nPlus:\nInterest expense – net\n1,314 \n1,382 \n1,123 \nOperating lease interest\n173 \n157 \n163 \nProvision for income taxes\n2,196 \n2,449 \n2,599 \nLease adjusted net operating profit\n10,640 \n11,714 \n10,322 \nLess:\nIncome tax adjustment\n1\n2,552 \n2,819 \n2,970 \nLease adjusted net operating profit after tax\n$\n8,088 \n$\n8,895 \n$\n7,352 \nDenominator\nAverage debt and shareholders’ deficit\n2\n$\n25,270 \n$\n24,418 \n$\n24,155 \nNet earnings to average debt and shareholders’ deficit\n27.5\n \n%\n31.6\n \n%\n26.6\n \n%\nReturn on invested capital\n3\n32.0\n \n%\n36.4\n \n%\n30.4\n \n%\n1\n    \nIncome tax adjustment is defined as net operating profit multiplied by the effective tax rate, which was 24.0%, 24.1%, and 28.8% for fiscal 2024, fiscal 2023, and fiscal 2022, respectively.\n2    \nAverage debt and shareholders’ deficit is defined as average current year and prior year ending debt, including current maturities, short-\nterm borrowings, and operating lease liabilities, plus the average current year and prior year ending total shareholders’ deficit.\n3\n \n For the year ended January 31, 2025, February 2, 2024, and February 3, 2023, return on invested capital was impacted by approximately 44 basis points, 19 basis points, an\nd \n-800\n basis points, respectively, as a result of the sale of the Canadian retail business.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nSources of Liquidity\nCash flows from operations, combined with our continued access to capital markets on both a short-term and long-term basis, as needed, remain adequate to fund our operations, make strategic investments to support long-term growth, return excess cash to shareholders in the form of dividends and share repurchases, and repay debt maturities as they become due.  We believe these sources of liquidity will continue to support our business for the next twelve months.  As of January 31, 2025, we held \n$1.8 billion of cash and cash equivalents, as well as $4.0 billion in undrawn capacity on our revolving credit facilities.  \nAs of January 31, 2025, our material contractual obligations and commercial commitments consist of leases, long-term debt, purchase obligations, and letters of credit.  See \nNote 5\n, \nNote 7\n, and \nNote 14\n of the Notes to the Consolidated Financial Statements in",
  "item2": null
}