{
  "source_file": "lrcx-20250629.htm",
  "form_type": "10-K",
  "item1": "Item 1.     \nBusiness\nIncorporated in 1980, Lam Research Corporation (“Lam Research,” “Lam,” “we,” “our,” “us,” or the “Company”) is a Delaware corporation, headquartered in Fremont, California. We maintain a network of facilities throughout Asia, Europe, and the United States in order to meet the needs of our dynamic customer base.\nAdditional information about Lam Research is available on our website at www.lamresearch.com. The content on any website referred to in this Form 10-K is not a part of or incorporated by reference in this Form 10-K unless expressly noted.\nOur Annual Report on Form 10-K, Quarterly Reports on Forms 10-Q, Current Reports on Forms 8-K, Proxy Statements and all other filings we make with the SEC are available on our website, free of charge, as soon as reasonably practical after we file them with or furnish them to the SEC and are also available online at the SEC’s website at www.sec.gov. \nLam Research Corporation 2025 10-K \n3\nTable of Contents\nThe Lam Research logo, Lam Research, and all product and service names used in this report are either registered trademarks or trademarks of Lam Research Corporation or its subsidiaries in the United States and/or other countries. All other marks mentioned herein are the property of their respective holders.\nWe are a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas such as nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering, and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices. \nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers (“IDMs”) that make products such as non-volatile memory (“NVM”), dynamic random-access memory (“DRAM”), and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits (“ICs”) on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing (the “Cloud”)\n,\n artificial intelligence, 5G, the Internet of Things (“IoT”), and other markets is driving the need for increasingly powerful and cost\n-\nefficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional (“3D”) architecture as well as multiple patterning to enable shrinks. \nWe believe we are in a strong position with our leadership and expertise in deposition\n,\n etch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Several factors create opportunity for sustainable differentiation for us: (i) our focus on research and development, with several on-going programs relating to sustaining engineering, product and process development, and concept and feasibility; (ii) our ability to effectively leverage cycles of learning from our broad installed base; (iii) our collaborative focus with semi-ecosystem partners, including our close-to-customer focus; (iv) our ability to identify and invest in the breadth of our product portfolio to meet technology inflections; and (v) our focus on delivering our multi-product solutions with a goal to enhance the value of Lam’s solutions to our customers.\nWe also address processes for back-end wafer-level packaging (“WLP”), which is an alternative to traditional wire bonding and can offer a smaller form factor, increased interconnect speed and bandwidth, and lower power consumption, among other benefits. We offer advanced packaging solutions that support fan-out panel-level packaging, a process in which chips or chiplets are cut from a large format substrate sheet several times the size of a traditional silicon wafer, which increases yield and reduces waste and solutions that meet the need for 3D stacking of high bandwidth memory (“HBM”). In addition, our products are well-suited for related markets that rely on semiconductor processes and require production-proven manufacturing capability, such as complementary metal-oxide-semiconductor image sensors (“CIS”) and micro-electromechanical systems (“MEMS”).\nOur Customer Support Business Group (“CSBG”) provides products and services to maximize installed equipment performance, predictability, and operational efficiency. We offer a broad range of services to deliver value throughout the lifecycle of our equipment, including customer service, spares, upgrades, and new and refurbished non-leading edge products in our deposition, etch, and clean markets. Many of the technical advances that we introduce in our newest products are also available as upgrades, which provide customers with a cost-effective strategy for extending the performance and capabilities of their existing wafer fabrication lines. Service offerings include fleet level Equipment Intelligence\n® \nsolutions to maximize the productivity of our customers through system uptime or availability optimization, throughput improvements, and defect reduction. Our spares product line offers running cost optimization programs and focuses on product life extension to help customers increase the return on their capital purchases. Additionally, within CSBG, our Reliant\n®\n product line offers new and refurbished non-leading edge products in deposition, etch and clean markets for those applications that do not require the most advanced wafer processing capability. \nLam Research Corporation 2025 10-K \n4\nTable of Contents\nProducts\nMarket\n \nProcess/Application\n \nTechnology\n \nProducts\nDeposition\nMetal Films\nElectrochemical Deposition (“ECD”) (Copper & Other)\nSABRE\n®\n family \nChemical Vapor Deposition (“CVD”)\nAtomic Layer Deposition (“ALD”)\n(Tungsten & Molybdenum)\nALTUS\n®\n family\n Dielectric Films\nPlasma-enhanced CVD (“PECVD”)\nALD \nGapfill High-Density Plasma CVD (“HDP-CVD”)\nVECTOR\n®\n family\nStriker\n®\n \nfamily\nSPEED\n®\n family\nEtch\nConductor Etch\nReactive Ion Etch\nKiyo\n®\n family, \nVersys\n®\n Metal family\nDielectric Etch\nReactive Ion Etch\nFlex\n®\n family\nVantex\n®\n family\nThrough-silicon Via (“TSV”) Etch\nDeep Reactive Ion Etch\nSyndion\n®\n family\nClean\nWafer Cleaning\nWet Clean\nEOS\n®\n, DV-Prime\n®\n, \nDa Vinci\n®\n, SP Series\nBevel Cleaning\nDry Plasma Clean\nCoronus\n®\n family\nDeposition Processes and Product Families\n \nDeposition processes create layers of dielectric (insulating) and metal (conducting) materials used to build a semiconductor device. Depending on the type of material and structure being made, different techniques are employed. Electrochemical deposition creates the copper wiring (interconnect) that links devices in an integrated circuit (“IC” or “chip”). Plating of copper and other metals is also used for TSV and WLP applications. Tiny molybdenum or tungsten connectors and thin barriers are made with the precision of chemical vapor deposition and atomic layer deposition, which adds only a few layers of atoms at a time. Plasma-enhanced CVD, high-density plasma CVD, and ALD are used to form the critical insulating layers that isolate and protect all of these electrical structures. Lastly, post-deposition treatments such as ultraviolet thermal processing are used to improve dielectric film properties.\nALTUS\n®\n Product Family\nTungsten and/or molybdenum deposition is used to form conductive features such as contacts, vias, and wordlines on a chip. These features are small, often narrow, and use only a small amount of metal, so minimizing resistance and achieving complete fill can be difficult. At these nanoscale dimensions, even slight imperfections can impact device performance or cause a chip to fail. Our ALTUS\n®\n systems combine CVD and ALD technologies to deposit the highly conformal or selective films as needed for advanced tungsten or molybdenum metallization (ALTUS\n® \nHalo) applications in both logic and memory. The Multi-Station Sequential Deposition architecture enables nucleation layer formation and bulk CVD/ALD fill to be performed in the same chamber (“in situ”). Our ALD technologies are used in the deposition of barrier films to achieve high step coverage with reduced thickness at lower temperatures relative to a conventional process.\nSABRE\n®\n Product Family\nCopper deposition lays down the electrical wiring for most semiconductor devices. Even the smallest defect - say, a microscopic pinhole or dust particle - in these conductive structures can impact device performance, from loss of speed to complete failure. The SABRE\n®\n ECD product family, which helped pioneer the copper interconnect transition, offers the precision needed for copper damascene manufacturing in logic and memory. System capabilities include cobalt deposition for logic applications and copper deposition directly on various liner materials, which is important for next-generation metallization schemes. For advanced packaging applications, such as forming conductive bumps, redistribution layers, TSV filing, and wafer level bonding, the SABRE\n®\n 3D family combines Lam’s SABRE Electrofill\n®\n technology with additional innovation to deliver the high-quality films needed at high productivity. The modular architecture can be configured with multiple plating and pre/post-treatment cells, providing flexibility to address a variety of packaging applications, including HBM.\nSPEED\n®\n Product Family\nDielectric gapfill processes deposit critical insulation layers between conductive and/or active areas by filling openings of various aspect ratios between conducting lines and between devices. With advanced devices, the structures being filled can be very tall and narrow. As a result, high-quality dielectric films are especially important due to the ever-increasing possibility of cross-talk and device failure. Our SPEED\n®\n HDP-CVD products provide a multiple dielectric film solution for high-quality gapfill with industry-leading throughput and reliability. SPEED\n®\n products have excellent particle performance, and their design allows large batch sizes between cleans and faster cleans.\nLam Research Corporation 2025 10-K \n5\nTable of Contents\nStriker\n®\n Product Family\nThe latest memory, logic, and imaging devices require extremely thin, highly conformal dielectric films for continued device performance improvement and scaling. For example, ALD films are critical for low-k spacers for device power consumption/speed, dielectric gapfills in high aspect ratio features for isolation and device performance, as well as for spacer-based multiple patterning schemes where the spacers help define critical dimensions. These applications have little tolerance for voids and even the smallest defect. The Striker\n®\n single-wafer ALD products provide dielectric film solutions for these challenging requirements through application-specific material, process and hardware options that deliver film technology and defect performance. \nVECTOR\n® \nProduct Family\nDielectric film deposition processes are used to form some of the most difficult-to-produce insulating layers in a semiconductor device, including those used in the latest transistors and 3D structures. In some applications, these films require dielectric films to be exceptionally uniform and defect free since slight imperfections are multiplied greatly in subsequent layers. Our VECTOR\n®\n PECVD products are designed to provide the performance and flexibility needed to create these enabling structures within a wide range of challenging device applications. As a result of its design, VECTOR\n®\n produces superior thin film quality, along with exceptional within-wafer and wafer-to-wafer uniformity. \nEtch Processes and Product Families\nEtch processes create chip features by selectively removing dielectric, metal, silicon and poly silicon materials, including films that have been added during deposition. Reactive ion etch processing enables device-critical formation steps to enable transistor performance, create storage capacitors, and memory cells. Low temperature, cryogenic etching enables the use of new, novel chemistries to deliver increased high aspect ratio etch capability.\nFlex\n®\n Product Family\nDielectric etch carves patterns in insulating materials to create barriers between the electrically conductive parts of a semiconductor device. For advanced devices, these structures can be extremely tall and thin and involve complex, sensitive materials. Slight deviations from the target feature profile - even at the atomic level - can negatively affect electrical properties of the device. To precisely create these challenging structures, our Flex\n®\n product family offers differentiated technologies and application-focused capabilities for critical dielectric etch applications. Uniformity, repeatability, and tunability are enabled by a unique multi-frequency, small-volume, confined plasma design. Flex\n®\n offers in situ multi-step etch and continuous plasma capability that delivers high productivity with low defectivity.\nVantex\n®\n Product Family\nDielectric etch processes remove non-conductive materials during the manufacturing of a semiconductor device. Leading-edge memory devices have especially challenging structures, such as extremely deep holes and trenches, that must be manufactured with tight tolerances. Our latest dielectric etch system, Vantex\n®\n creates high aspect ratio device features while maintaining critical dimension (“CD”) uniformity and selectivity. Vantex\n® \nis part of our Sense.i\n®\n platform and offers advanced RF technology and repeatable wafer-to-wafer performance enabled by Equipment Intelligence\n®\n solutions to meet the needs of advanced memory manufacturing, primarily in 3D NAND high aspect ratio hole, trench, contact, and capacitor cell applications.\nKiyo\n®\n Product Family\nConductor etch helps shape the electrically active materials used in the parts of a semiconductor device. Even a slight variation in these miniature structures can degrade device performance. In fact, these structures are so tiny and sensitive that etch processes push the boundaries of the basic laws of physics and chemistry. Our Kiyo\n®\n product family delivers the high-performance capabilities needed to precisely and consistently form these features precisely and with high productivity. Proprietary Hydra technology in Kiyo\n®\n products improves CD uniformity by correcting for incoming pattern variability, and atomic-scale variability control with production-worthy throughput.\nSyndion\n®\n Product Family \nPlasma etch processes used to remove silicon and other materials deep into the wafer are collectively referred to as deep silicon etch. These may be deep trenches for CMOS image sensors, trenches for power and other devices, TSVs for HBM and advanced packaging, and other high aspect ratio features. These are created by etching through multiple materials sequentially, where each new material involves a change in the etch process. The Syndion\n®\n etch product family is optimized for deep silicon etch, providing the fast process switching with depth and cross-wafer uniformity control required to achieve precision etch results. The systems support both conventional single-step etch and rapidly alternating process, which minimizes damage and delivers precise depth uniformity.\nVersys\n®\n Metal Product Family\nMetal etch processes play a key role in connecting the individual components that form an IC, such as forming wires and electrical connections. These processes can also be used to drill through metal hardmasks that are used to form the wiring for advanced devices. To enable these critical etch steps, the Versys\n®\n Metal product family provides high-productivity capability on a flexible \nLam Research Corporation 2025 10-K \n6\nTable of Contents\nplatform. Superior CD, profile uniformity, and uniformity control are enabled by a symmetrical chamber design with independent process tuning features.\nClean Processes and Product Families\nClean techniques are used between manufacturing steps to clear away particles, contaminants, residues and other unwanted material that could later lead to defects and to prepare the wafer surface for subsequent processing. Wet processing technologies can be used for wafer cleaning and etch applications. Plasma bevel cleaning is used to enhance die yield by removing unwanted materials from the wafer’s edge that could impact the device area. \nCoronus\n®\n Product Family\nBevel cleaning removes unwanted masks, residues, and films from the edge of a wafer between manufacturing steps. If not cleaned, these materials become defect sources. For instance, they can flake off and re-deposit on the device area during subsequent processes. Even a single particle that lands on a critical part of a device can ruin the entire chip. By inserting bevel clean processes at strategic points, these potential defect sources can be eliminated and more functional chips produced. By combining the precise control and flexibility of plasma with technology that protects the active die area, the Coronus\n®\n \nbevel clean family cleans the wafer’s edge to enhance die yield.\n \nThe systems provide active die area protection by using plasma processing with proprietary confinement technology. Applications include post-etch, pre- and post-deposition, pre-lithography, and metal film removal to prevent arcing during plasma etch or deposition steps.\nDV-Prime\n®\n,\n \nDa Vinci\n®\n,\n \nEOS\n®\n, and SP Series Product Families\nWafer cleaning is performed repeatedly during semiconductor device manufacturing and is a critical process that affects product yield and reliability. Unwanted microscopic materials - some no bigger than the tiny structures themselves - need to be cleaned effectively. At the same time, these processes must selectively remove residues that are chemically similar to the device films. For advanced WLP, the wet clean steps used between processes that form the package and external wiring have surprisingly complex requirements. These processes are called on to completely remove specific materials and leave other fragile structures undisturbed. In IoT products that include power devices, MEMS and image sensors, there is a unique requirement for wafer backside wet etch to uniformly thin the silicon wafer while protecting the device side of the wafer.\nBased on our pioneering single-wafer spin technology, the DV-Prime\n®\n and Da Vinci\n®\n products provide the process flexibility needed with high productivity to address a wide range of wafer cleaning steps throughout the manufacturing process flow. As the latest of Lam’s wet clean products, EOS\n®\n delivers exceptionally low on-wafer defectivity and high throughput to address progressively demanding wafer cleaning applications. With a broad range of process capability, our SP Series products deliver cost-efficient, production-proven wet clean and silicon wet etch solutions for challenging WLP and IoT applications. \nFiscal Periods Presented\nAll references to fiscal years apply to our fiscal years, which ended June 29, 2025, June 30, 2024, and June 25, 2023.\nResearch and Development\nThe market for semiconductor capital equipment is characterized by rapid technological change and product innovation. Our ability to achieve and maintain our competitive advantage depends in part on our continued and timely development of new products and enhancements to existing products. Accordingly, we devote a significant portion of our personnel and financial resources to research and development (“R&D”) programs and seek to maintain close and responsive relationships with our customers and suppliers.\nWe believe current challenges for customers at various points in the semiconductor manufacturing process present opportunities for us. We expect to continue to make substantial investments in R&D to meet our customers’ product needs, support our growth strategy, and enhance our competitive position.\nMarketing, Sales, and Service\nOur marketing, sales, and service efforts are focused on building long-term relationships with our customers and targeting product and service solutions designed to meet their needs. These efforts are supported by a team of product marketing and sales professionals as well as equipment and process engineers who work closely with individual customers to develop solutions for their wafer processing needs. We maintain ongoing service relationships with our customers and have an extensive network of service engineers in place throughout the United States (“U.S.”), China, Europe, India, Japan, Korea, Southeast Asia, and Taiwan. We believe that comprehensive support programs and close working relationships with customers are essential to maintaining high customer satisfaction and our competitiveness in the marketplace.\nWe provide standard warranties for our systems. The warranty provides that systems will be free from defects in material and workmanship and will conform to agreed-upon specifications. The warranty is limited to repair of the defect or replacement with new or like-new equivalent goods and is valid when the buyer provides prompt notification within the warranty period of the claimed defect or non-conformity and also makes the items available for inspection and repair. \nLam Research Corporation 2025 10-K \n7\nTable of Contents\nInternational Sales\nA significant portion of our sales and operations occur outside the United States and, therefore, may be subject to certain risks, including but not limited to compliance with U.S. and international laws and regulations, including U.S. export restrictions; tariffs and other barriers; difficulties in staffing and managing non-U.S. operations; adverse tax consequences; foreign currency exchange rate fluctuations; changes in currency controls; and economic and political conditions. Any of these factors may have a material adverse effect on our business, financial position, and results of operations and cash flows. For geographical reporting, revenue is attributed to the geographic location in which the customers’ facilities are located. Refer to \nNote 19\n of our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K, for the attribution of revenue by geographic region. \nLong-lived Assets\nRefer to \nNote 19\n of our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K, for information concerning the geographic locations of long-lived assets.\nCustomers\nOur customers include many of the world’s leading semiconductor manufacturers. Customers continue to establish joint ventures, alliances, and licensing arrangements which have the potential to positively or negatively impact our competitive position and market opportunities. Refer to \nNote 9\n of our Consolidated Financial Statements, included in Part II, Item 8 of this report, for information concerning customer concentrations. Our most significant customers during the fiscal years ending June 29, 2025, June 30, 2024, and June 25, 2023 included Samsung Electronics Company, Ltd. and Taiwan Semiconductor Manufacturing Company.\nA material reduction in orders from our customers could adversely affect our results of operations and projected financial condition. Our business depends upon the expenditures of semiconductor manufacturers. Semiconductor manufacturers’ businesses, in turn, depend on many factors, including their economic capability, the current and anticipated market demand for ICs, and the availability of equipment capacity to support that demand.\nManufacturing\nOur manufacturing operations mainly consist of assembling and testing components, sub-assemblies, and modules that are then integrated into finished systems prior to shipment to or at the location of our customers. The assembly and testing of our products is conducted predominately in cleanroom environments. \nWe have agreements with third parties to outsource certain aspects of our manufacturing, production warehousing, and logistics functions. These outsourcing contracts may provide us more flexibility to scale our operations up or down in a timely and cost-effective manner. We believe that we have selected reputable providers and have secured their performance on terms documented in written contracts. However, it is possible that one or more of these providers could fail to perform as we expect, and such failure could have an adverse impact on our business and have a negative effect on our operating results and financial condition. Overall, we believe we have effective mechanisms to manage risks associated with our outsourcing relationships. Refer to \nNote 17\n of our Consolidated Financial Statements, included in Part II, Item 8 of this report, for further information concerning our outsourcing commitments, reported as a component of purchase obligations.\nCertain components and sub-assemblies that we include in our products may only be obtained from a single supplier. We are engaged in efforts to obtain and qualify alternative sources to supply these products and in some circumstances protect against potential supply challenges by carrying inventory in excess of current need. Any prolonged inability to obtain these components could have an adverse effect on our operating results and could unfavorably impact our customer relationships.\nCompliance with Government Regulations\nAs a public company with global operations, we are subject to a variety of governmental regulations across multiple jurisdictions, including those related to export controls, financial and other disclosures, corporate governance, anti-trust, intellectual property, privacy, anti-bribery, anti-corruption, anti-boycott, tax, tariffs, labor, health and safety, conflict minerals, human trafficking, the management of hazardous materials, and carbon emissions, among others. Each of these regulations imposes costs on our business and has the potential to divert our management’s time and attention from revenue-generating and other profit maximizing activities to those associated with compliance. Efforts to comply with new and changing regulations have resulted in, and are likely to continue to result in, decreased net income and increased capital expenditures. If we are alleged or found by a court or regulatory agency not to be in compliance with regulations, we may be subject to fines, restrictions on our actions, reputational damage, and harm to our competitive position, and our business, financial condition, and/or results of operations could be adversely affected. For additional details, please refer to “Legal, Regulatory and Tax Risks – We Are Exposed to Various Risks from Our Regulatory Environment” in",
  "item7": "Item 7.    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion of our financial condition and results of operations contains forward-looking statements, which are subject to risks, uncertainties, and changes in condition, significance, value, and effect. Our actual results could differ materially from those anticipated in the forward-looking statements as a result of certain factors, including but not limited to those discussed in “Risk Factors” and elsewhere in this 2025 Form 10-K and other documents we file from time to time with the Securities and Exchange Commission. (See “Cautionary Statement Regarding Forward-Looking Statements” in Part I of this 2025 Form 10-K.)\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) provides a description of our results of operations and should be read in conjunction with our Consolidated Financial Statements and accompanying Notes to Consolidated Financial Statements included in \nPart II, Item 8\n of this 2025 Form 10-K. MD&A consists of the following sections:\nExecutive Summary\n provides a summary of the key highlights of our results of operations and our management’s assessment of material trends and uncertainties relevant to our business.\nResults of Operations\n provides an analysis of operating results.\nCritical Accounting Policies and Estimates\n discusses accounting policies that reflect the more significant judgments and estimates used in the preparation of our Consolidated Financial Statements.\nLiquidity and Capital Resources\n provides an analysis of cash flows, contractual obligations, and financial position.\nExecutive Summary\nLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas like nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices.\nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers that make products such as NVM, DRAM, and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control, enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing, artificial intelligence, 5G, the Internet of Things, and other markets is driving the need for increasingly powerful and cost\n-\nefficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional architecture as well as multiple patterning to enable shrinks. \nWe believe we are in a strong position with our leadership and expertise in deposition\n,\n etch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Our Customer Support Business Group provides products and services to maximize installed equipment performance, predictability, and operational efficiency. Several factors create opportunities for sustainable differentiation for us: (i) our focus on research and development, with several on-going programs relating to sustaining engineering, product and process development, and concept and feasibility; (ii) our ability to effectively leverage cycles of learning from our broad installed base; (iii) our collaborative focus with semi-ecosystem partners, including our close-to-customer focus; (iv) our ability to identify and invest in the breadth of our product portfolio to meet technology inflections; and (v) our focus on delivering our multi-product solutions with a goal to enhance the value of Lam’s solutions to our customers.\nWafer fabrication equipment spending levels were strong in the 2025 fiscal year driven by an increase in both the memory and non-memory market segments. In the short term, volatility in the semiconductor industry environment from trade restrictions, tariffs, as well as other direct and indirect risks and uncertainties, have had, and in the future may have, a negative impact on our revenue and operating margin. Over the longer term, we believe that secular demand for semiconductors, combined with technology inflections in our industry, including 3D device scaling, multiple patterning, process flow, and advanced packaging chip integration, will drive sustainable growth and lead to an increase in the served available market for our products and services in the deposition, etch, and clean businesses.\nLam Research Corporation 2025 10-K \n29\nTable of Contents\nOn October 2, 2024, the Company effected a ten-for-one stock split of its common stock and a proportional increase in the number of authorized shares. All references made to share or per share amounts throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations have been retroactively adjusted to reflect the stock split. \n The following table summarizes certain key financial information for the periods indicated below:\n \nYear Ended\n Change\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except per share data, percentages and basis points)\nRevenue\n$\n18,435,591 \n$\n14,905,386 \n$\n17,428,516 \n$\n3,530,205 \n23.7 \n%\n$\n(2,523,130)\n(14.5)\n%\nGross margin\n$\n8,979,059 \n$\n7,052,791 \n$\n7,776,925 \n$\n1,926,268 \n27.3 \n%\n$\n(724,134)\n(9.3)\n%\nGross margin as a percent of total revenue\n48.7 \n%\n47.3 \n%\n44.6 \n%\n+ 140 bps\n+ 270 bps\nTotal operating expenses\n$\n3,078,091 \n$\n2,788,878 \n$\n2,602,065 \n$\n289,213 \n10.4 \n%\n$\n186,813 \n7.2 \n%\nNet income\n$\n5,358,217 \n$\n3,827,772 \n$\n4,510,931 \n$\n1,530,445 \n40.0 \n%\n$\n(683,159)\n(15.1)\n%\nNet income per diluted share\n$\n4.15 \n$\n2.90 \n$\n3.32 \n$\n1.25 \n43.1 \n%\n$\n(0.42)\n(12.7)\n%\nFiscal year 2025 revenue increased 23.7% compared to fiscal year 2024, driven by strong customer demand for semiconductor equipment systems as well as customer support-related revenues from customer investments across memory and non-memory markets. Gross margin as a percentage of revenue increased in fiscal year 2025 compared to fiscal year 2024 largely due to improved factory efficiencies and favorable product mix, partially offset by increased transformational charges. The increase in operating expenses in fiscal year 2025 compared to fiscal year 2024 was driven by higher employee-related costs primarily as a result of increased headcount, increased spending on transformational activities, and higher outside service expense. \nFiscal year 2024 revenue decreased 14.5% compared to fiscal year 2023. \nSystems and customer-support related revenues declined in fiscal year 2024 primarily from weakness in the non-volatile memory market, partially offset by strength in \nDRAM a\ns well as increased revenue generation from our China regional customers. Gross margin as a percentage of revenue increased in fiscal year \n2024\n compared to fiscal year \n2023\n largely due to a more favorable customer mix, lower spending on material costs, and higher field resource utilization, partially offset by lower factory efficiencies. The increase in operating expenses in fiscal year \n2024\n compared to fiscal year \n2023\n was driven by higher employee-related costs primarily as a result of increased research and development-related headcount, increased spending on transformational activities, higher deferred compensation plan-related costs, and increased spending on supplies. \nWe aim to balance the requirements of our customers with the availability of resources, as well as performance to our operational and financial objectives. As a result, from time to time, we exercise discretion and judgment as to the timing and prioritization of manufacturing and deliveries of products, which has impacted, including in the current fiscal year, and may in the future impact, the timing of revenue recognition with respect to such products.\nOur cash and cash equivalents and restricted cash balances totaled approximately $6.4 billion as of June 29, 2025, compared to $5.9 billion as of June 30, 2024. Cash flows provided from operating activities were $6.2 billion for fiscal year 2025 compared to $4.7 billion for fiscal year 2024. Cash flows provided from operating activities in fiscal year 2025 were primarily used for $3.4 billion in treasury stock purchases, including net share settlement of employee stock-based compensation; $1.1 billion in dividends paid to our stockholders; $759 million of capital expenditures; and $507 million of principal payment on debt instruments and debt issuance costs. \nResults of Operations\nRevenue\n \nYear Ended\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nRevenue (in millions)\n$\n18,436 \n$\n14,905 \n$\n17,429 \nChina\n34 \n%\n42 \n%\n26 \n%\nKorea\n22 \n%\n19 \n%\n20 \n%\nTaiwan\n19 \n%\n11 \n%\n20 \n%\nJapan\n10 \n%\n10 \n%\n10 \n%\nUnited States\n7 \n%\n7 \n%\n9 \n%\nSoutheast Asia\n5 \n%\n6 \n%\n8 \n%\nEurope\n3 \n%\n5 \n%\n7 \n%\nLam Research Corporation 2025 10-K \n30\nTable of Contents\nRevenue increased in fiscal year 2025 compared to fiscal year 2024 due to increased equipment spending by our customers across Memory and Foundry market segments as well as increased customer support-related revenue for upgrades, spares, and services. \nRevenue decreased in fiscal year 2024 compared to fiscal year 2023 \nmainly due to decreases in\n non-volatile memory spending, \npartially offset by increases in DRAM spending by our customers.\nThe deferred revenue balance increased to $2.7 billion as of June 29, 2025 compared to $1.6 billion as of June 30, 2024 primarily due to an increase in advance deposits from newer customers. \nThe following table presents our revenue disaggregated between system and customer support-related revenue:\nYear Ended\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\n(in thousands)\nSystems Revenue\n$\n11,491,280 \n$\n8,921,643 \n$\n10,695,897 \nCustomer support-related revenue and other\n6,944,311 \n5,983,743 \n6,732,619 \n$\n18,435,591 \n$\n14,905,386 \n$\n17,428,516 \nPlease refer to \nNote 4: Revenue\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K for additional information regarding the composition of the two categories into which revenue has been disaggregated.\nThe percentage of leading- and non-leading-edge equipment and upgrade revenue from each of the markets we serve was as follows:\n \n \nYear Ended\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFoundry\n45 \n%\n40 \n%\n38 \n%\nMemory\n42 \n%\n42 \n%\n42 \n%\nLogic/integrated device manufacturing\n13 \n%\n18 \n%\n20 \n%\nGross Margin\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages and basis points)\nGross margin\n$\n8,979,059 \n$\n7,052,791 \n$\n7,776,925 \n$\n1,926,268 \n27.3 \n%\n$\n(724,134)\n(9.3)\n%\nPercent of revenue\n48.7 \n%\n47.3 \n%\n44.6 \n%\n+ 140 bps\n+ 270 bps\nThe increase in gross margin as a percentage of revenue for fiscal year 2025 compared to fiscal year 2024 was largely due to improved factory efficiencies and favorable product mix, partially offset by increased transformational charges.\nThe increase in gross margin as a percentage of revenue for fiscal year 2024 compared to fiscal year 2023 \nwas due to a more favorable customer mix, reduced spending on material costs, and higher field resource utilization, partially offset by lower factory efficiencies.\nResearch and Development\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages and basis points)\nResearch & development\n$\n2,096,387 \n$\n1,902,444 \n$\n1,727,162 \n$\n193,943 \n10.2 \n%\n$\n175,282 \n10.1 \n%\nPercent of revenue\n11.4 \n%\n12.8 \n%\n9.9 \n%\n- 140 bps\n+ 290 bps\nWe continued to make significant R&D investments focused on leading-edge deposition, etch, clean, and other semiconductor manufacturing processes. \nThe increase in R&D expense during fiscal year 2025 compared to fiscal year 2024 was primarily driven by an increase of $118 million in employee-related costs mainly as a result of increased headcount and $35 million in higher outside service expense, inclusive of transformational and lab-related activities.\nLam Research Corporation 2025 10-K \n31\nTable of Contents\nThe increase in R&D expense during fiscal year 2024 compared to fiscal year 2023 was \nprimarily driven by an increase of $58 million in employee-related costs primarily as a result of increased headcount, $33 million in spending for supplies, $18 million in deferred compensation plan-related costs, and $13 million in spending for transformational activities. \nSelling, General, and Administrative\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages and basis points)\nSelling, general, and administrative (\"SG&A\")\n$\n981,704 \n$\n868,247 \n$\n832,753 \n$\n113,457 \n13.1 \n%\n$\n35,494 \n4.3 \n%\nPercent of revenue\n5.3 \n%\n5.8 \n%\n4.8 \n%\n- 50 bps\n+ 100 bps\nThe increase in SG&A expense during fiscal year 2025 compared to fiscal year 2024 was primarily driven by an increase of $112 million in employee-related costs as a result of increased headcount. \nThe increase in SG&A expense during fiscal year 2024 compared to fiscal year 2023 was primarily \ndriven by an increase of $30 million in transformational activity spend.\nRestructuring Charges, Net\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages and basis points)\nRestructuring charges, net\n$\n— \n$\n61,562 \n$\n120,316 \n$\n(61,562)\n(100.0)\n%\n$\n(58,754)\n(48.8)\n%\nPercent of revenue\n— \n%\n0.4 \n%\n0.7 \n%\n- 40 bps\n- 30 bps\nIn fiscal year 2023, we initiated a restructuring plan, that continued into fiscal year 2024, designed to better align our cost structure with our outlook for the economic environment and business opportunities. Under the plan, we terminated approximately 1,760 employees, incurring expenses related to employee severance and separation costs. Employee severance and separation costs are primarily related to severance, non-cash severance, including equity award compensation expense, pension and other termination benefits. Additionally, we made a strategic decision to relocate certain manufacturing activities to pre-existing facilities. The restructuring plan was substantially complete as of June 30, 2024. \nRestructuring charges decreased during fiscal year 2024 compared to fiscal year 2023 primarily due to lower employee severance and separation costs. Please refer to \nNote 20: Restructuring charges, Net\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K for additional information.\nOther Income (Expense), Net\nOther income (expense), net, consisted of the following:\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages)\nInterest income\n$\n231,331 \n$\n251,938 \n$\n138,984 \n$\n(20,607)\n(8.2)\n%\n$\n112,954 \n81.3 \n%\nInterest expense\n(178,203)\n(185,236)\n(186,462)\n$\n7,033 \n(3.8)\n%\n$\n1,226 \n(0.7)\n%\nGains on deferred compensation plan related assets, net\n39,121 \n58,767 \n20,186 \n$\n(19,646)\n(33.4)\n%\n$\n38,581 \n191.1 \n%\nForeign exchange losses, net\n(26,412)\n(4,837)\n(7,078)\n$\n(21,575)\n446.0 \n%\n$\n2,241 \n(31.7)\n%\nOther, net\n(8,676)\n(24,323)\n(31,280)\n$\n15,647 \n(64.3)\n%\n$\n6,957 \n(22.2)\n%\n$\n57,161 \n$\n96,309 \n$\n(65,650)\n$\n(39,148)\n(40.6)\n%\n$\n161,959 \n(246.7)\n%\nInterest income decreased in fiscal year 2025 compared to fiscal year 2024 primarily due to lower interest rates, partially offset by higher cash balances. Interest income increased in fiscal year 2024 compared to fiscal year 2023 primarily because of higher yields and higher cash balances.\nInterest expense decreased in fiscal year 2025 compared to fiscal year 2024 primarily due to the maturity of $500 million of the Company’s senior notes in March 2025. Interest expense was flat in fiscal year 2024 compared to fiscal year 2023.\nLam Research Corporation 2025 10-K \n32\nTable of Contents\nThe gains on deferred compensation plan related assets, net were driven by fluctuations in the fair market value of the underlying funds for all periods presented.\nForeign exchange fluctuations were primarily due to currency movements against portions of our unhedged balance sheet exposures for all periods presented.\nThe variation in other, net for the fiscal year 2025 compared to fiscal years 2024 and 2023 was primarily driven by fluctuations in the fair market value of equity investments. \nIncome Tax Expense \nOur provision for income taxes and effective tax rate for the periods indicated were as follows:\n \nYear Ended\nChange\nJune 29,\n2025\nJune 30,\n2024\nJune 25,\n2023\nFY25 vs. FY24\nFY24 vs. FY23\n \n(in thousands, except percentages and basis points)\nIncome tax expense\n$\n599,912 \n$\n532,450 \n$\n598,279 \n$\n67,462 \n12.7 \n%\n$\n(65,829)\n(11.0)\n%\nEffective tax rate\n10.1 \n%\n12.2 \n%\n11.7 \n%\n- 210 bps\n+ 50 bps\nThe decrease in the effective tax rate in fiscal year 2025 as compared to fiscal year 2024 was primarily due to the recognition of previously unrecognized tax benefits from lapses of statutes of limitation in fiscal year 2025 and the change in level and proportion of income in higher and lower tax jurisdictions.\nThe increase in the effective tax rate in fiscal year 2024 compared to fiscal year 2023 was primarily due to the change in level and proportion of income in higher and lower tax jurisdictions.\nInternational revenues account for a significant portion of our total revenues, such that a material portion of our pre-tax income is earned and taxed outside the United States. International pre-tax income is taxable in the United States at a lower effective tax rate than the federal statutory tax rate. Please refer to \nNote 7: Income Taxes\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was signed into law by U.S. President Donald Trump. The impact on income taxes due to change in legislation is required, under Accounting Standards Codification (“ASC”) 740, Income Taxes, to be recognized in the period in which the law is enacted, which is during our fiscal year 2026. In general, the OBBBA introduces changes to U.S. taxation, including changes in the taxation of non-U.S. income. We are currently assessing the potential implications of these changes to our fiscal year 2026 Consolidated Financial Statements.\nDeferred Income Taxes\nDeferred income taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, as well as the tax effect of carryforwards. Our gross deferred tax assets were $1,897 million and $1,516 million at the end of fiscal years 2025 and 2024, respectively. These gross deferred tax assets were offset by gross deferred tax liabilities of $197 million and $218 million and a valuation allowance primarily representing our entire California deferred tax asset balance due to the single sales factor apportionment resulting in lower taxable income in California of $424 million and $389 million at the end of fiscal years 2025 and 2024, respectively. The change in gross deferred tax assets, gross deferred tax liabilities, and valuation allowance between fiscal year 2025 and 2024 is primarily due to increases in gross deferred tax assets for outside basis differences of foreign subsidiaries.\nWe evaluate if the deferred tax assets are realizable on a quarterly basis and will continue to assess the need for changes in valuation allowances, if any.\nUncertain Tax Positions \nWe re-evaluate uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit, and new audit activity. Any change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision.\nLam Research Corporation 2025 10-K \n33\nTable of Contents\nCritical Accounting Policies and Estimates \nA critical accounting policy is defined as one that has both a material impact on our financial condition and results of operations and requires us to make difficult, complex and/or subjective judgments, often as a result of the need to make estimates about matters that are inherently uncertain. The preparation of financial statements in conformity with U.S. generally accepted accounting principles (“GAAP”) requires management to make certain judgments, estimates and assumptions that could affect the reported amounts of assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. We base our estimates and assumptions on historical experience and on various other assumptions we believe to be applicable and evaluate them on an ongoing basis to ensure they remain reasonable under current conditions. Actual results could differ significantly from those estimates, which could have a material impact on our business, results of operations, and financial condition. Our critical accounting estimates include:\n•\nthe recognition and valuation of revenue;\n•\nthe valuation of inventory, which impacts gross margin; and\n•\nthe recognition and measurement of current and deferred income taxes, including the measurement of uncertain tax positions, which impact our provision for income tax expenses.\nWe believe that the following critical accounting policies reflect the more significant judgments and estimates used in the preparation of our consolidated financial statements regarding the critical accounting estimates indicated above. See \nNote 2: Summary of Significant Accounting Policies\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K for additional information regarding our accounting policies.\nRevenue Recognition: \nWe generally consider documentation of terms with an approved purchase order as a customer contract, provided that collection is considered probable, which is assessed based on the creditworthiness of the customer as determined by credit checks, payment histories, and/or other circumstances. The transaction price for our contracts with customers is allocated among the identified performance obligations and consists of both fixed and variable consideration provided it is probable that a significant reversal of revenue will not occur when the uncertainty related to variable consideration is resolved. Fixed consideration includes amounts to be contractually billed to the customer while variable consideration includes estimates for discounts and credits for future usage which are based on contractual terms outlined in volume purchase agreements and other factors known at the time. We generally invoice customers at shipment and for professional services as provided. Revenue for systems and spares are recognized at a point in time, which is generally upon shipment or delivery. Revenue from services is recognized over time as services are completed or ratably over the contractual period of generally one year or less. Revenue is recognized in an amount that reflects the consideration to which we expect to be entitled in exchange for those goods or services.\n \nInventory Valuation:\n Inventories are stated at the lower of cost or net realizable value using standard costs that approximate actual cost on a first-in, first-out basis. Inventory in excess of management’s estimated usage requirement and obsolete inventory is written down to its estimated net realizable value if less than cost. Estimates of net realizable value include but are not limited to customer demand, management’s forecasts related to our future manufacturing schedules, technological and/or market obsolescence, general semiconductor market conditions, and possible alternative uses. \nIncome Taxes:\n Deferred income taxes reflect the net tax effect of temporary differences between the carrying amount of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes, as well as the tax effect of carryforwards. We record a valuation allowance to reduce our deferred tax assets to the amount that is more likely than not to be realized. The assessment of valuation allowances against our deferred tax assets includes estimation and judgement with respect to future operating results and market conditions. We have an accounting policy election to record deferred taxes related to Global Intangible Low-Taxed Income (“GILTI”).\nWe recognize the benefit from a tax position only if it is more likely than not that the position will be sustained upon audit based solely on the technical merits of the tax position. We have a policy to include interest and penalties related to uncertain tax positions as a component of income tax expense.\nRecent Accounting Pronouncements\nFor a description of recent accounting pronouncements, including the expected dates of adoption and estimated effects, if any, on our consolidated financial statements, see \nNote 3: Recent Accounting Pronouncements\n of our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K.\nLiquidity and Capital Resources \nTotal gross cash, cash equivalents, and restricted cash balances were $6.4 billion at the end of fiscal year 2025 compared to $5.9 billion at the end of fiscal year 2024. This increase was primarily due to cash provided by operating activities, partially offset by Common Stock repurchases in connection with our stock repurchase program, dividends paid, capital expenditures, and principal payments on debt instruments.\nLam Research Corporation 2025 10-K \n34\nTable of Contents\nCash Flows from Operating Activities\nNet cash provided by operating activities of $6.2 billion during fiscal year 2025 consisted of (in thousands):\nNet income\n$\n5,358,217 \nNon-cash charges:\nDepreciation and amortization\n386,277 \nDeferred income taxes\n(363,247)\nEquity-based compensation expense\n343,371 \nChanges in operating asset and liability accounts\n441,801 \nOther\n6,845 \n$\n6,173,264 \nSignificant changes in operating asset and liability accounts, net of foreign exchange impact, included the following sources of cash: increases in deferred gross profit of $1.1 billion, accrued expenses and other liabilities of $328 million, and accounts payable of $212 million. These sources of cash are offset by the following uses of cash: increases in accounts receivable of $859 million, prepaid expenses and other current assets of $207 million, and inventory of $181 million.\nCash Flows from Investing Activities\nNet cash used for investing activities during fiscal year 2025 was $708 million, primarily consisting of $759 million in capital expenditures.\nCash Flows from Financing Activities\nNet cash used for financing activities during fiscal year 2025 was $4,937 million, primarily consisting of $3,422 million in Common Stock repurchases, including net share settlement on employee stock-based compensation; $1,150 million of dividends paid; and $507 million of principal payments on debt instrument and debt issuance costs, partially offset by $143 million of stock issuance and treasury stock reissuances associated with our employee stock-based compensation plans.\nLiquidity\nGiven that the semiconductor industry is highly competitive and has historically experienced rapid changes in demand, we believe that maintaining sufficient liquidity reserves is important to support sustaining levels of investment in R&D and capital infrastructure. Anticipated cash flows from operations based on our current business outlook, combined with our current levels of cash and cash equivalents as of June 29, 2025, are expected to be sufficient to support our anticipated levels of operations, investments, debt service requirements, capital expenditures, capital redistributions, and dividends through at least the next twelve months. However, factors outside of our control, including uncertainty in the global economy and the semiconductor industry, as well as disruptions in credit markets, have in the past, are currently, and could in the future, impact customer demand for our products, as well as our ability to manage normal commercial relationships with our customers, suppliers, and creditors.\nIn March 2025, $500 million principal value of our 2025 Notes were settled upon maturity using available cash on hand. \nIn January 2025, we entered into a Third Amended and Restated Credit Agreement. The amendment increased the unsecured revolving credit facility commitment from $1.5 billion to $2.0 billion and extended the maturity of the facility from June 2026 to January 2030. The facility provides for an expansion option that will allow us, subject to certain requirements, to request an increase in the facility of up to an additional $750 million, for a potential total commitment of $2.75 billion. Please refer to \nNote 14, “Long-term Debt and Other Borrowing\ns\"\n to our Consolidated Financial Statements, included in Part II, Item 8 of this 2025 Form 10-K for additional information.\nIn the longer term, liquidity will depend to a great extent on our future revenues and our ability to appropriately manage our costs based on demand for our products and services. While we have substantial cash balances, we may require additional funding and need or choose to raise the required funds through borrowings or public or private sales of debt or equity securities. We believe that, if necessary, we will be able to access the capital markets on terms and in amounts adequate to meet our objectives. However, domestic and global macroeconomic and political conditions could cause disruptions to the capital markets and otherwise make any financing more challenging, and there can be no assurance that we will be able to obtain such financing on commercially reasonable terms or at all.\nLam Research Corporation 2025 10-K \n35\nTable of Contents\nOff-Balance Sheet Arrangements and Contractual Obligations\n \nWe have certain obligations to make future payments under various contracts, some of which are recorded on our balance sheet and some of which are not. Certain obligations that are recorded on our balance sheet in accordance with GAAP include our long-term debt, operating leases and finance leases; refer to Notes \n14\n and \n15\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K for further discussion. Our off-balance sheet arrangements and our transition tax liability are presented as purchase obligations, refer to Note \n17\n of our Consolidated Financial Statements in Part II, Item 8 of this 2025 Form 10-K for further discussion. In addition, in the ordinary course of business, we issue purchase orders based on estimates of our production needs, many times well in advance of delivery dates. The commitments under these open purchase orders are not included in the off-balance sheet commitments disclosed in the Notes to the Consolidated Financial Statements, as we generally have the option to cancel the purchase orders at our convenience, reschedule, and/or adjust quantities based on our business needs. As of June 29, 2025, we expect to fulfill approximately $387 million within one year related to these arrangements.",
  "item2": null
}