{
  "source_file": "lrcx-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nWith the exception of historical facts, the statements contained in this discussion are forward-looking statements, which are subject to the safe harbor provisions created by the Private Securities Litigation Reform Act of 1995. Certain, but not all, of the forward-looking statements in this report are specifically identified as forward-looking, by use of phrases and words such as “believe,” “estimated,” “anticipate,” “expect,” “probable,” “intend,” “plan,” “aim,” “may,” “should,” “could,” “would,” “will,” “continue,” and other future-oriented terms. The identification of certain statements as “forward-looking” does not mean that other statements not specifically identified are not forward-looking. Forward-looking statements include, but are not limited to, statements that relate to: trends and opportunities in the global economic environment; trends and opportunities in the semiconductor industry, including in the end markets and applications for semiconductors, in device complexity, and in the complexity of device manufacturing; growth or decline in the industry and the market for, and spending on, wafer fabrication equipment; the anticipated levels of, and rates of change in, margins, market share, served available market, capital expenditures, research and development expenditures, international sales, revenue (actual and/or deferred), operating expenses and earnings generally; management’s plans and objectives for our current and future operations and business focus; restructuring activities; business process improvements and initiatives; volatility in our quarterly results; the makeup of our customer base; customer and end user requirements and our ability to satisfy those requirements; the performance and benefits of our products and services; customer spending and demand for our products and services, and the reliability of indicators of change in customer spending and demand; the effect of variability in our customers’ business plans or demand for our products and services; our competition, and our ability to defend our market share and to gain new market share; the success of joint development and collaboration relationships with customers, suppliers, or others; outsourced activities; our supply chain and the role of suppliers in our business, including the impacts of supply chain constraints and material costs; our leadership and competency, and our ability to facilitate innovation; our research and development programs; the opportunities in our industry for, and our ability to create sustainable differentiation; technology inflections in the industry and our ability to identify those inflections and to invest in research and development programs to meet them; our ability to deliver multi-product solutions; the resources invested to comply with evolving standards and the impact of such efforts; changes in state, federal and international tax laws, our estimated annual tax rate and the factors that affect our tax rates; legal and regulatory compliance; the estimates we make, and the accruals we record, in order to implement our critical accounting policies (including, but not limited to, the adequacy of prior tax payments, future tax benefits or liabilities, and the adequacy of our accruals relating to them); hedging transactions; debt or financing arrangements; our investment portfolio; our access to capital markets; uses of, payments of, and impact of interest rate fluctuations on, our debt; our intention to pay quarterly dividends and the amounts thereof, if any; our ability and intention to repurchase our shares; credit risks; controls and procedures; recognition or amortization of expenses; our ability to manage and grow our cash position; our ability to scale our operations to respond to changes in our business; our goals and initiatives with respect to environmental, social and governance matters, including emissions, and human capital, the value of our patents; the materiality of potential losses arising from legal proceedings; the probability of making payments under our guarantees; and the sufficiency of our financial resources or liquidity to support future business activities (including, but not limited to, operations, investments, debt service requirements, dividends, and capital expenditures). Such statements are based on current expectations and are subject to risks, uncertainties, and changes in condition, significance, value, and effect, including without limitation those discussed below under the heading “Risk Factors” within Part II Item 1A and elsewhere in this report and other documents we file from time to time with the Securities and Exchange Commission (“SEC”), such as our annual report on Form 10-K for the year ended June 29, 2025 (our “2025 Form 10-K”), and our current reports on Form 8-K. Such risks, uncertainties, and changes in condition, significance, value, and effect could cause our actual results to differ materially from those expressed in this report and in ways not readily foreseeable. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof and are based on information currently and reasonably known to us. We do not undertake any obligation to release the results of any revisions to these forward-looking statements, which may be made to reflect events or circumstances that occur after the date of this report or to reflect the occurrence or effect of anticipated or unanticipated events.\nDocuments To Review In Connection With Management’s Discussion and Analysis Of Financial Condition and Results Of Operations\nFor a full understanding of our financial position and results of operations for the three months ended September 28, 2025, and the related Management’s Discussion and Analysis of Financial Condition and Results of Operations below, you should also read the Condensed Consolidated Financial Statements and notes presented in this Form 10-Q and the financial statements and notes in our 2025 Form 10-K.\n Lam Research Corporation 2025 Q3 10-Q \n 16\nTable of Contents\nEXECUTIVE SUMMARY\nLam Research Corporation is a global supplier of innovative wafer fabrication equipment and services to the semiconductor industry. We have built a strong global presence with core competencies in areas like nanoscale manufacturing enablement, chemistry, plasma and fluidics, advanced systems engineering, and a broad range of operational disciplines. Our products and services are designed to help our customers build smaller and better performing devices that are used in a variety of electronic products, including mobile phones, personal computers, cloud and enterprise servers, wearables, automotive vehicles, and data storage devices.\nOur customer base includes leading semiconductor memory, foundry, and integrated device manufacturers that make products such as non-volatile memory, dynamic random-access memory, and logic devices. Their continued success is part of our commitment to driving semiconductor breakthroughs that define the next generation. Our core technical competency is integrating hardware, process, materials, software, and process control, enabling results on the wafer.\nSemiconductor manufacturing, our customers’ business, involves the fabrication of multiple dies or integrated circuits on a wafer. This involves the repetition of a set of core processes and can require hundreds of individual steps. Fabricating these devices requires a sequence of highly sophisticated process technologies to integrate an increasing array of new materials with precise control at the atomic scale. Along with meeting technical requirements, wafer processing equipment must deliver high productivity and be cost-effective.\nDemand from cloud computing, artificial intelligence, 5G, the Internet of Things, and other markets is driving the need for increasingly powerful and cost-efficient semiconductors. At the same time, there are growing technical challenges with traditional two-dimensional scaling. These trends are driving significant inflections in semiconductor manufacturing, such as the increasing importance of vertical scaling strategies like three-dimensional architecture as well as multiple patterning to enable shrinks. \nWe believe we are in a strong position with our leadership and expertise in deposition, etch, and clean markets to facilitate some of the most significant innovations in semiconductor device manufacturing. Our Customer Support Business Group provides products and services to maximize installed equipment performance, predictability, and operational efficiency. Several factors create opportunities for sustainable differentiation for us: (i) our focus on research and development, with several ongoing programs relating to sustaining engineering, product and process development, and concept and feasibility; (ii) our ability to effectively leverage cycles of learning from our broad installed base; (iii) our collaborative focus with semi-ecosystem partners, including our close-to-customer focus; (iv) our ability to identify and invest in the breadth of our product portfolio to meet technology inflections; and (v) our focus on delivering our multi-product solutions with a goal to enhance the value of Lam’s solutions to our customers.\nWafer fabrication equipment spending levels are strong in the 2025 calendar year driven by an increase in both the memory and non-memory market segments. In the short term, volatility in the semiconductor industry environment from trade restrictions, tariffs, as well as other direct and indirect risks and uncertainties, have had, and in the future may have, a negative impact on our revenue and operating margin. Over the longer term, we believe that secular demand for semiconductors, combined with technology inflections in our industry, including 3D device scaling, multiple patterning, process flow, and advanced packaging chip integration, will drive sustainable growth and lead to an increase in the served available market for our products and services in the deposition, etch, and clean businesses.\n Lam Research Corporation 2025 Q3 10-Q \n 17\nTable of Contents\nThe following table summarizes certain key financial information for the periods indicated below:\nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\n(in thousands, except per share data and percentages)\nRevenue\n$\n5,324,173 \n$\n5,171,393 \nGross margin\n$\n2,684,879 \n$\n2,589,709 \nGross margin as a percent of total revenue\n50.4 \n%\n50.1 \n%\nTotal operating expenses\n$\n855,791 \n$\n848,581 \nNet income\n$\n1,568,660 \n$\n1,720,088 \nDiluted net income per share\n$\n1.24 \n$\n1.35 \nIn the September 2025 quarter, revenue increased 3% compared to the three months ended \nJune 29, 2025\n (the “June 2025 quarter”), driven by an increase in systems revenue as a result of sustained investments in the Foundry market segment as well as increases in customer support-related revenue. T\nhe deferred revenue balance was $2.77 billion at the end of the September 2025 quarter, an increase relative to the balance at the end of the June 2025 quarter of $2.68 billion. \nWe aim to balance the requirements of our customers with the availability of resources, as well as performance to our operational and financial objectives. As a result, from time to time, we exercise discretion and judgment as to the timing and prioritization of manufacturing and deliveries of products, which has impacted, including in the current fiscal year, and may in the future impact, the timing of revenue recognition with respect to such products. \nThe increase in gross margin as a percentage of revenue in the September 2025 quarter compared to the June 2025 quarter was primarily a result of favorable changes in customer mix, partially offset by reduced factory efficiencies, higher tariff-related spend, and increased material costs. The increase in operating expenses in the September 2025 quarter compared to the June 2025 quarter was driven by an increase in employee-related costs tied to higher headcount, partially offset by lower elective deferred compensation plan-related costs.\nOur cash, cash equivalents, and restricted cash balances increased to $6.7 billion at the end of the September 2025 quarter compared to $6.4 billion at the end of the June 2025 quarter. This increase was primarily the result of $1,779.0 million of cash generated from operating activities, partially offset by $975.8 million of share repurchases, including net share settlement of employee stock-based compensation and excise tax; $292.0 million of dividends paid to stockholders; and $185.1 million of capital expenditures. Employee headcount as of September 28, 2025 was approximately 19,400. \n Lam Research Corporation 2025 Q3 10-Q \n 18\nTable of Contents\nRESULTS OF OPERATIONS\nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\nRevenue (in millions)\n$\n5,324 \n$\n5,171 \n$\n4,168 \nChina\n43 \n%\n35 \n%\n37 \n%\nTaiwan\n19 \n%\n19 \n%\n15 \n%\nKorea\n15 \n%\n22 \n%\n18 \n%\nJapan\n10 \n%\n14 \n%\n7 \n%\nUnited States\n6 \n%\n6 \n%\n12 \n%\nSoutheast Asia\n5 \n%\n2 \n%\n6 \n%\nEurope\n2 \n%\n2 \n%\n5 \n%\nThe increase in revenue in the September 2025 quarter compared to the same period in 2024 was tied to increases in Foundry equipment spending by our customers as well as higher customer support-related revenue. \nThe following table presents our revenue disaggregated between systems and customer support-related revenue:\nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(In thousands)\nSystems revenue\n$\n3,547,565 \n$\n3,437,625 \n$\n2,392,730 \nCustomer support-related revenue and other\n1,776,608 \n1,733,768 \n1,775,246 \n$\n5,324,173 \n$\n5,171,393 \n$\n4,167,976 \nPlease refer to Note 3, “Revenue,” to the Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding the composition of the two categories into which revenue has been disaggregated.\nThe percentage of leading- and non-leading-edge equipment and upgrade revenue from each of the markets we serve was as follows: \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\nFoundry\n60 \n%\n52 \n%\n41 \n%\nMemory\n34 \n%\n41 \n%\n35 \n%\nLogic/integrated device manufacturing\n6 \n%\n7 \n%\n24 \n%\nThe increase in the foundry market segment for the September 2025 quarter compared to the June 2025 quarter was driven by mature node investments. This increase was offset by\n a decrease in\n memory which was attributable to a decrease in non-volatile memory. \nGross Margin\n \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(in thousands, except percentages)\nGross margin\n$\n2,684,879 \n$\n2,589,709 \n$\n2,002,683 \nPercent of revenue\n50.4 \n%\n50.1 \n%\n48.0 \n%\nGross margin as a percentage of re\nvenue increased \nin the September 2025 quarter compared to the June 2025 quarter driven by favorable changes in customer mix, partially offset by reduced factory efficiencies, higher tariff-related spend, and increased material costs. \n Lam Research Corporation 2025 Q3 10-Q \n 19\nTable of Contents\nThe increase in gross margin as a percentage of revenue in the September 2025 quarter compared to the same period in the prior year was primarily due to favorable changes in customer mix.\nResearch and Development\n \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(in thousands, except percentages)\nResearch & development (“R&D”)\n$\n576,446 \n$\n580,178 \n$\n495,358 \nPercent of revenue\n10.8 \n%\n11.2 \n%\n11.9 \n%\nWe continued to make significant R&D investments in the September 2025 quarter focused on leading-edge deposition, etch, clean and other semiconductor manufacturing processes. R&D expense in the September 2025 quarter was relatively flat compared to the June 2025 quarter. \nR&D expense in the September 2025 quarter increased compared to the same period in the prior year, driven by higher employee-related costs as a result of increased headcount, and increased spending on supplies. \nSelling, General, and Administrative\n \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(in thousands, except percentages)\nSelling, general, and administrative (“SG&A”)\n$\n279,345 \n$\n268,403 \n$\n243,128 \nPercent of revenue\n5.2 \n%\n5.2 \n%\n5.8 \n%\nSG&A expense during the September 2025 quarter increased compared to both the June 2025 and the September 2024 quarters as a \nresult of higher employee-related costs due to increased headcount. \nOther Income (Expense), Net\nOther income (expense), net consisted of the following:\n \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(in thousands)\nInterest income\n$\n63,930 \n$\n54,633 \n$\n68,449 \nInterest expense\n(42,472)\n(42,774)\n(44,946)\nGains on deferred compensation plan-related assets, net\n23,088 \n34,102 \n17,420 \nForeign exchange losses, net\n(5,534)\n(6,907)\n(9,686)\nOther, net\n(8,938)\n(1,201)\n(1,156)\n$\n30,074 \n$\n37,853 \n$\n30,081 \nInterest income increased in the September 2025 quarter as compared to the June 2025 quarter, primarily due to higher cash balances. Interest income decreased in the September 2025 quarter compared to the same period in the prior year, primarily due to lower interest rates, partially offset by higher cash balances.\nInterest expense was flat in the September 2025 quarter as compared to the June 2025 quarter. Interest expense decreased in the September 2025 quarter compared to the same period in the prior year primarily due to the maturity of $500 million of the Company’s senior notes in March 2025.\nThe variations in deferred compensation plan-related assets, net were driven by fluctuations in the fair market value of the underlying funds for all periods presented.\nForeign exchange fluctuations were primarily due to currency movements against portions of our unhedged balance sheet exposures for all periods presented.\n Lam Research Corporation 2025 Q3 10-Q \n 20\nTable of Contents\nThe variation in other, net in the September 2025 quarter as compared to the June 2025 quarter and to the same period in the prior year was driven by fluctuations in the fair market value of equity investments and charitable contributions.\nIncome Tax Expense\nOur provision for income taxes and effective tax rate for the periods indicated were as follows:\n \nThree Months Ended\nSeptember 28,\n2025\nJune 29,\n2025\nSeptember 29,\n2024\n(in thousands, except percentages)\nIncome tax expense\n$\n290,502 \n$\n58,893 \n$\n177,834 \nEffective tax rate\n15.6 \n%\n3.3 \n%\n13.7 \n%\nThe increase in the effective tax rate for the September 2025 quarter compared to the June 2025 quarter was primarily due to the recognition of previously unrecognized tax benefits from lapses of statutes of limitation in the June 2025 quarter, the change in level and proportion of income in higher and lower tax jurisdictions, the revaluation of deferred taxes due to changes in the U.S. taxation of non-U.S. income under OBBBA, and GMT being fully effective starting in the September 2025 quarter.\nThe increase in the effective tax rate for the September 2025 quarter compared to the same period in the prior year was primarily due to the change in level and proportion of income in higher and lower tax jurisdictions, the revaluation of deferred taxes due to changes in the U.S. taxation of non-U.S. income under OBBBA, and GMT being fully effective starting in the September 2025 quarter.\nInternational revenues account for a significant portion of our total revenues, such that a material portion of our pre-tax income is earned and taxed outside the United States. International pre-tax income is taxable in the United States at a lower effective tax rate than the federal statutory tax rate. Please refer to Note 7, “Income Taxes”, to our Consolidated Financial Statements in Part II, Item 8 of our 2025 Form 10-K for additional information.\nWe re-evaluate uncertain tax positions on a quarterly basis. This evaluation is based on factors including, but not limited to, changes in facts or circumstances, changes in tax law, effectively settled issues under audit, and new audit activity. Any change in recognition or measurement would result in the recognition of a tax benefit or an additional charge to the tax provision.\nBEPS 2.0 GMT is fully effective for us this fiscal year. We assessed our exposure to GMT under currently enacted legislation and determined that we expect to meet transitional safe harbor requirements in most jurisdictions, with limited jurisdictions subject to GMT.\nOn July 4, 2025, the OBBBA was signed into law by U.S. President Donald Trump. The impact on income taxes due to change in legislation is required, under ASC 740, Income Taxes, to be recognized in the period in which the law is enacted, which is this fiscal year. In general, the OBBBA introduces changes to U.S. taxation, including changes in the taxation of non-U.S. income.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur critical accounting policies and estimates are unchanged from those disclosed in “Critical Accounting Policies and Estimates” in Part II, Item 7 of our 2025 Form 10-K. \nRecent Accounting Pronouncements\nSee Note 2 - Recent Accounting Pronouncements, of our Condensed Consolidated Financial Statements, included in Part 1 of this Form 10-Q.\nLIQUIDITY AND CAPITAL RESOURCES\nTotal gross cash, cash equivalents, and restricted cash balances were $6.7 billion at September 28, 2025 compared to $6.4 billion as of June 29, 2025. The increase was primarily driven by cash generated from operating activities totaling $1,779.0 million, partially offset by $975.8 million of share repurchases, including net share settlement on employee stock-based compensation and excise tax; $292.0 million in dividends paid; and $185.1 million in capital expenditures. \n Lam Research Corporation 2025 Q3 10-Q \n 21\nTable of Contents\nCash Flows from Operating Activities\nNet cash provided by operating activities of $1.78 billion during the three months ended September 28, 2025 consisted of (in thousands):\nNet income\n$\n1,568,660 \nNon-cash charges:\nDepreciation and amortization\n101,644 \nEquity-based compensation expense\n97,241 \nDeferred income taxes\n(62,875)\nChanges in operating asset and liability accounts\n76,184 \nOther\n(1,890)\n$\n1,778,964 \nChanges in operating asset and liability accounts, net of foreign exchange impact, included the following sources of cash: decreases in inventory of $189.8 million and prepaid expenses and other current assets of $30.2 million, and increases in deferred gross profit of $80.9 million, accrued expenses and other liabilities of $25.2 million and accounts payable of $5.1 million. These sources of cash were offset by the following uses of cash: increases in accounts receivable of $255.0 million.\nCash Flows from Investing Activities\nNet cash used for investing activities during the three months ended September 28, 2025 was $186.0 million, primarily consisting of capital expenditures.\nCash Flows from Financing Activities\nNet cash used for financing activities during the three months ended September 28, 2025 was $1.28 billion, primarily consisting of $975.8 million in treasury stock repurchases, including net share settlement on employee stock-based compensation and excise tax and $292.0 million in dividends paid.\nLiquidity\nGiven that the semiconductor industry is highly competitive and has historically experienced rapid changes in demand, we believe that maintaining sufficient liquidity reserves is important to support sustaining levels of investment in R&D and capital infrastructure. Anticipated cash flows from operations based on our current business outlook, combined with our current levels of cash and cash equivalents as of September 28, 2025, are expected to be sufficient to support our anticipated levels of operations, investments, debt service requirements, capital expenditures, capital redistributions, and dividends through at least the next twelve months. However, factors outside of our control, including uncertainty in the global economy and the semiconductor industry, as well as disruptions in credit markets, have in the past, are currently, and could in the future, impact customer demand for our products, as well as our ability to manage normal commercial relationships with our customers, suppliers, and creditors.\nIn the longer term, liquidity will depend to a great extent on our future revenues and our ability to appropriately manage our costs based on demand for our products and services. While we have substantial cash balances, we may require additional funding and need or choose to raise the required funds through borrowings or public or private sales of debt or equity securities. We believe that, if necessary, we will be able to access the capital markets on terms and in amounts adequate to meet our objectives. However, domestic and global macroeconomic and political conditions could cause disruptions to the capital markets and otherwise make any financing more challenging, and there can be no assurance that we will be able to obtain such financing on commercially reasonable terms or at all."
}