{
  "source_file": "luv-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n    \nBusiness \nCompany Overview \nSouthwest Airlines Co. (the “Company” or “Southwest”) operates Southwest Airlines, a major passenger airline that provides scheduled air transportation in the United States and near-international markets. Southwest commenced service on June 18, 1971, with three Boeing 737 aircraft serving three Texas cities: Dallas, Houston, and San Antonio. Southwest’s unique route network, low fares, and famous Hospitality continue to make the Company an attractive choice for Customers in cities across the United States and near-international destinations. As of December 31, 2024, Southwest had a total of 803 Boeing 737 aircraft in its fleet and served 117 destinations in 42 states, the District of Columbia, the Commonwealth of Puerto Rico, and ten near-international countries: Mexico, Jamaica, The Bahamas, Aruba, Dominican Republic, Costa Rica, Belize, Cuba, the Cayman Islands, and Turks and Caicos.\nCompany Initiatives\nAs part of the Company's ongoing modernization efforts, during third quarter 2024, the Company announced several transformational initiatives designed to elevate the Customer Experience on its flights, improve financial performance, and drive Shareholder value, including:\n•\nAssigned Seating\n: Southwest will introduce an assigned seating model to better align with airline passenger preferences. The Company expects to begin selling assigned seats in the second half of 2025, with its first flights operating with the new seating model in the first half of 2026.\n•\nPremium Seating\n: Southwest will offer extra legroom options with additional pitch while maintaining a standard economy seat pitch.\n•\nRedesigned Boarding Model\n: Southwest will evolve its boarding process with seat assignments while focusing on operational efficiency and improving the Customer Experience. The updated boarding process will be designed to maintain Southwest's unique and popular approach in boarding through position numbers and signage displayed on stanchions within the gate area. \n•\nGlobal Airline Partnerships\n: Southwest is seeking partnerships with international carriers to expand its network and connect Customers with more global destinations to generate additional demand for travel across the Southwest network. Icelandair will become Southwest's initial partner with an expected launch on February 13, 2025 through Baltimore-Washington International Airport, which will serve as its first U.S. gateway for the carriers. The Icelandair partnership is expected to add Denver and Nashville gateways during 2025, and Southwest intends to add at least one additional partner carrier in 2025.\n•\nGetaways by Southwest™\n: In 2025, Southwest intends to launch a new product, Getaways by Southwest, offering vacation packages that are unique to the industry and come with Customer-friendly policies. These customizable vacation bundles are expected to feature Southwest's generous cancellation policy and flexibility with its no change fees for flights extending to hotels and other elements of packaged vacations.\n•\n24-Hour Operations\n: Southwest is scheduled to add 24-hour operation capabilities with the introduction of overnight \n(i.e., redeye) \nflights on February 13, 2025 in key markets to maximize aircraft utilization.\n•\nMarketing & Distribution Evolution\n: In order to attract new Customers and reach them where they are performing travel searches today, Southwest has expanded into new channels such as Google Flights, Kayak, and Skyscanner to broaden its Customer base and begin to engage them in its loyalty program.\n•\nService Modernization\n: To drive efficiency and improvement in Customer Service, Southwest is transitioning to a digital-first model, offering more self-service options designed to augment the Company’s contact centers and airport experience.\nCompany Operations\nRoute Structure\n3\nTable of Contents\nSouthwest primarily provides “point-to-point” service, rather than the “hub-and-spoke” service provided by most major U.S. airlines. A point-to-point system enables airlines to connect directly to destinations without providing connecting service. By contrast, the hub-and-spoke system concentrates most of an airline's operations at a limited number of central hub cities and serves most other destinations in the system by providing one-stop or connecting service through a hub. By not concentrating operations exclusively through one or more central transfer points, Southwest's route structure has allowed for more direct nonstop routing than a traditional hub-and-spoke service. To provide greater connectivity and support operational reliability and recoverability, in recent years the Company has increasingly focused on designing its network around core stations. Southwest’s unique network blends intentional connectivity offered by hub-and-spoke models and point-to-point nonstops, allowing the Company to capture nonstop demand and provide reliable one-stop itinerary options. \nSouthwest’s unique route network has also enabled it to provide its markets with frequent, conveniently timed flights and low fares. For example, Southwest currently offers 12 weekday roundtrips between Dallas Love Field and Houston Hobby, six weekday roundtrips between Denver and Chicago Midway, six weekday roundtrips between Los Angeles International and Las Vegas, eight weekday round trips between Burbank and Oakland, and ten weekday roundtrips between Phoenix and Denver. Southwest complements its high-frequency short-haul routes with mid-range and long-haul nonstop service, including flights between Hawaii and California, Las Vegas, and Phoenix, and between markets such as Los Angeles and Nashville, New York LaGuardia and Houston, Los Angeles and Baltimore, Oakland and Houston, and San Diego and Baltimore. In 2024, the United States Department of Transportation (“DOT”) approved the Company’s bid to offer nonstop round-trip flights between Las Vegas and Washington Reagan. Service between Las Vegas and Washington Reagan begins February 13, 2025, with daily service beginning March 6, 2025. As the domestic travel market has matured and structural changes have reduced the demand for short-haul travel, especially post-pandemic, the Company has increased its proportion of longer-haul flights. Further, during 2024, the Company announced 24-hour operation capabilities with the introduction of redeye flights. Booking of redeye flying on initial routes became available in July 2024, with the first redeye flights scheduled on February 13, 2025, in five initial nonstop markets: Las Vegas to Baltimore and Orlando; Los Angeles to Baltimore and Nashville; and Phoenix to Baltimore.\nThe table below sets forth data regarding the Company's nonstop service, aircraft stage length, and trip duration over the last three years:\nYear ended December 31,\n2024\n2023\n2022\nPercentage of Customers flying nonstop\n74%\n73%\n74%\nNonstop city pairs\n850\n805\n825\nAverage stage length (miles)\n763\n730\n728\nAverage trip duration (hours)\n2.0\n2.0\n2.0\nThe Company continually works to better optimize its route network and schedule through the adjustment of flights in its existing markets and the addition of new markets and itineraries, while also pruning less profitable flights from its schedule. During 2024, the Company sought to restructure and better optimize its network to better match capacity to demand and adjust for post-pandemic Customer travel patterns by reducing short-haul trips, redistributing resources to longer-haul trips in more profitable markets, and reducing flying on weekdays and at off-peak times with lower travel demand. In response to market conditions, the Company ceased service at Cozumel, Mexico; Houston Bush Intercontinental; Syracuse; and Bellingham in 2024. Further, the Company redeployed underperforming capacity by significantly reducing service at Atlanta, Fort Lauderdale, and Chicago O’Hare, while expanding service at Nashville. The Company is continuing to improve the connectivity and efficiency of its network through redesigns in smaller cities and the planned introduction of redeye flying. Additionally, the Company is taking a cross-functional, methodical approach to market maturation efforts. The Company’s unique route network allows for these adjustments without structurally disrupting its airports in core markets and other large cities. To further improve international connectivity with its domestic network, as discussed under “Company Initiatives,” the Company is scheduled to begin operating as a partner with Icelandair on February 13, 2025 to provide for transatlantic connectivity and announced plans to add at least one more partner during 2025.\n4\nTable of Contents\nCost Structure\nA key component of the Company's business strategy is its focus on cost discipline and charging competitively low fares. The Company's low-cost strategy includes, among other elements, (i) the use of a single aircraft type, the Boeing 737, and (ii) the Company's route structure. Southwest's use of a single aircraft type has historically allowed for simplified scheduling, maintenance, flight operations, safety management, and training activities. Southwest's route structure includes service to and from many secondary or downtown airports such as Dallas Love Field, Houston Hobby, Chicago Midway, Baltimore-Washington International, Burbank, Manchester, Oakland, San Jose, and Providence. These conveniently located airports are typically less congested than other airlines' hub airports, which has contributed to Southwest's ability to achieve high asset utilization because aircraft can be scheduled to minimize the amount of time they are on the ground. This, in turn, has reduced the number of aircraft and gate facilities that would otherwise be required and is designed to allow for higher Employee productivity over a long period of time. Given ever-evolving travel patterns and labor market challenges, the Company continues to focus on better optimizing its route network, improving operational efficiency and reliability, and increasing Employee productivity. The Company expects to further increase asset utilization through its introduction of redeye flights and its initiatives to decrease the amount of time it takes to turn an aircraft (the time needed to unload Passengers from an arriving flight and load Passengers on the same aircraft for its subsequent flight). Such investments include moving to a fully digital (i.e., paperless) process, improved communication tools for Employees, and better visual and real-time information to assist both Customers and Employees. These initiatives are designed to lower unit costs, as the Company is expected to be able to generate either the same number of available seat miles (“ASMs”) with fewer aircraft or produce more ASMs utilizing the same number of aircraft in its fleet. These efforts are underway and are scheduled to be fully implemented by November 2025. In addition, the Company is targeting other cost savings initiatives, including capitalizing on identified supply chain opportunities and improving its corporate efficiency through automation and better allocation of resources. \nThe Company's focus on controlling costs also includes a continued commitment to pursuing, implementing, and enhancing initiatives to reduce fuel consumption and improve fuel efficiency (ASMs per fuel gallon consumed). The Company focuses on minimizing fuel consumption and improving fuel efficiency through fleet modernization and other fuel initiatives. For example, in 2024, the Company added 22 Boeing 737 MAX 8 (“-8”) aircraft to its fleet, with the goal of lowering operating costs, improving potential growth opportunities, better optimizing the Company's network, reducing carbon emissions per ASM, and further modernizing the Company's fleet with more fuel-efficient aircraft. \nFuel and oil expense can be extremely volatile and unpredictable, and even a small change in market fuel prices can significantly affect profitability. Although the Company’s jet fuel prices per gallon were generally lower in 2024, as compared with 2023, they remain at high levels. Fuel and oil expense remained the Company's second largest operating cost category for 2024. As evidenced by the table below, energy prices can fluctuate significantly in a relatively short amount of time. The table below shows the Company's average cost of jet fuel inclusive of fuel taxes and fuel hedging impacts, for each year beginning in 2011 and during each quarter of 2024.\n5\nTable of Contents\nYear\nCost\n(Millions)\nAverage\nCost Per\nGallon\nPercentage of\nOperating\nExpenses\n2011\n$\n5,751 \n$\n3.25 \n38.2 \n%\n2012\n$\n6,156 \n$\n3.32 \n37.3 \n%\n2013\n$\n5,823 \n$\n3.19 \n35.3 \n%\n2014\n$\n5,355 \n$\n2.97 \n32.6 \n%\n2015\n$\n3,740 \n$\n1.96 \n23.6 \n%\n2016\n$\n3,801 \n$\n1.90 \n22.7 \n%\n2017\n$\n4,076 \n$\n1.99 \n23.0 \n%\n2018\n$\n4,616 \n$\n2.20 \n24.6 \n%\n2019\n$\n4,347 \n$\n2.09 \n22.3 \n%\n2020\n$\n1,849 \n$\n1.45 \n14.4 \n%\n2021\n$\n3,310 \n$\n1.98 \n23.5 \n%\n2022\n$\n5,975 \n$\n3.10 \n26.2 \n%\n2023\n$\n6,217 \n$\n2.89 \n24.0 \n%\n2024\n$\n5,812 \n$\n2.64 \n21.4 \n%\nFirst Quarter 2024\n$\n1,531 \n$\n2.92 \n22.8 \n%\nSecond Quarter 2024\n$\n1,599 \n$\n2.76 \n23.0 \n%\nThird Quarter 2024\n \n$\n1,417 \n$\n2.52 \n20.7 \n%\nFourth Quarter 2024\n \n$\n1,264 \n$\n2.38 \n19.0 \n%\nThe Company’s fuel efficiency was aided in 2024, as compared with 2023, through the addition of \n22\n -8 aircraft to its fleet and by the retirement of \n34\n of its oldest, least fuel-efficient Boeing 737-700 (“-700”) aircraft and the retirement of two Boeing 737-800 (\"-800\") aircraft. As of December 31, 2024, the Company had 245 -8 aircraft in its fleet. In second and fourth quarter 2024, the Company entered into supplemental agreements (the “Supplements”) to its purchase agreement with The Boeing Company (“Boeing”) relating to the Company's purchase of -8 and Boeing 737-7 (\"-7\", and, together with -8, the \"MAX aircraft\"). Pursuant to the Supplements, the Company amended its order book delivery schedule to better allocate aircraft deliveries to the Company’s network and capacity plans. The Company held 180 remaining MAX options as of December 31, 2024, in addition to 492 firm orders of MAX aircraft to be delivered through 2031. The Company retains significant flexibility to manage its fleet size, including opportunities to accelerate fleet modernization efforts (e.g., through accelerated retirements of the Company's -700 aircraft) if growth opportunities do not materialize. The Company previously announced plans to pursue opportunities to take advantage of current market conditions through the sale and/or sale-leaseback of certain aircraft, with the intention of replacing most, if not all, of such aircraft with new -8 and -7 aircraft from Boeing, at the favorable pricing available in the Company’s order book with Boeing, by the end of 2031, assuming that Boeing is able to meet aircraft delivery expectations. During December 2024, the Company received gross proceeds of $871 million from the sale-leaseback of 35 aircraft (see Note 7 to the Consolidated Financial Statements for more details on the sale-leaseback transactions), which the Company expects to use in support of its capital allocation strategy, which includes funding future fleet modernization and providing Shareholder returns. As a result of these efforts, the Company expects its net fleet capital expenditures during the near term to moderate significantly from recent levels, with the added benefit of further accelerating the modernization of the Company’s fleet. For further information regarding the Company’s aircraft contractual order book see “Properties” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” The delivery schedule for the -7 is dependent on the Federal Aviation Administration (“FAA”) issuing required certifications and approvals to Boeing and the Company. The FAA will ultimately determine the timing of the -7 certification and entry into service, and the Company therefore offers no assurances that current estimations and timelines are correct. \nThe Company continues to undertake a number of other fuel conservation initiatives, which are discussed in detail under “Environmental Sustainability.”\n6\nTable of Contents\nThe table below sets forth the Company's ASMs produced per fuel gallon consumed (fuel-efficiency) over the last five years:\n \nYear ended December 31,\n \n \n2024\n \n2023\n2022\n2021\n2020\nAvailable seat miles per fuel gallon consumed\n \n80.8\n \n79.5\n \n77.3\n79.2\n81.3\nThe Company has also entered into fuel derivative contracts to manage its risk associated with significant increases in fuel prices. Based on the current geopolitical and market dynamics, higher premium costs over time, and aggressive cost reductions underway, the Company does not intend to add new hedging positions to its current hedge book. The Company's fuel hedging activities, as well as the risks associated with high and/or volatile fuel prices, are discussed in more detail below under “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and Note 10 to the Consolidated Financial Statements.\nSalaries, wages, and benefits expense constituted approximately 45.1 percent of the Company's operating expenses in 2024 and was the Company's largest operating cost category. The Company's ability to control labor costs is largely limited by the terms of its collective-bargaining agreements, and increased labor costs from recently ratified contracts and rate inflation have negatively impacted both the Company's low-cost structure and the overall airline industry’s costs. During 2024, active full-time equivalent headcount decreased 2,356, or 3.1 percent, compared with year-end 2023, in an effort to right-size staffing to current operations. The Company expects to continue these efforts in 2025 by minimizing hiring and improving corporate efficiency. The Company's labor costs, and risks associated therewith, are discussed in more detail below under “Business—Employees,” “Risk Factors,” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nFare Structure\nGeneral\nSouthwest offers a relatively simple fare structure that features competitive fares and product benefits, including unrestricted fares, as well as lower fares available on a restricted basis. \nSouthwest fare products include four major categories: “Wanna Get Away®,” “Wanna Get Away Plus®,” “Anytime,” and “Business Select®,” to provide Customers options when choosing a fare. All fare products include the privilege of two free checked bags (weight and size limits apply). Southwest does not charge fees for cancellations or changes to flight reservations, although fare differences may apply.\n•\n“Wanna Get Away” fares are generally the lowest fares and are often subject to advance purchase requirements. They are non-refundable, but, subject to Southwest’s No-Show Policy, flight credit for the fare paid for unused travel by the Customer (“flight credit”) may be applied towards future travel on Southwest. Subject to Southwest’s No-Show Policy, Wanna Get Away fares also enable a same-day standby listing, free of airline charges, if there is another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with voluntary changes in their itinerary. Under Southwest's Rapid Rewards® loyalty program, Wanna Get Away fares earn six Rapid Rewards points for each dollar spent on the base fare. The Company’s loyalty program is discussed below under “Rapid Rewards Loyalty Program.”\n•\n“Wanna Get Away Plus” fares are often subject to advance purchase requirements. They are non-refundable, but, subject to Southwest’s No-Show Policy, flight credit may be applied towards future travel on Southwest. Wanna Get Away Plus fares earn eight Rapid Rewards points for each dollar spent on the base fare. Wanna Get Away Plus fares offer Transferable Flight Credit™ that enables Customers to transfer an eligible unused flight credit to another traveler for future use. Both travelers must be Rapid Rewards members and only one transfer is permitted. For bookings through a Southwest Business (corporate travel) channel, a transfer may only be made to an employee of the same organization. Subject to Southwest’s No-Show Policy, Wanna Get Away Plus fares also enable a same-day confirmed change, free of airline charges, \n7\nTable of Contents\nif there is an open seat on another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with voluntary changes in their itinerary. If there is no open seat on this different flight, a traveler may request to be added to the standby list for that flight.\n•\n“Anytime” fares are often subject to advance purchase requirements. They are refundable if canceled, subject to Southwest’s No-Show Policy, or flight credit may be applied towards future travel on Southwest. If this fare is purchased with non-refundable flight credit, then the resulting flight credit will be non-refundable if travel is canceled. Anytime fares earn 10 Rapid Rewards points for each dollar spent on the base fare. Anytime fares also receive EarlyBird Check-In®. See “Ancillary Services” below for further information about EarlyBird Check-In. Additionally, Anytime fares receive Priority Lane and Express Lane access through check-in and security lines where available. Further, Anytime fares receive all of the benefits of Wanna Get Away Plus fares, including Transferable Flight Credit and same-day confirmed changes and standby.\n•\n“Business Select” fares are often subject to advance purchase requirements. They are refundable if canceled, subject to Southwest’s No-Show Policy, or flight credit may be applied towards future travel on Southwest. If this fare is purchased with non-refundable flight credit, then the resulting flight credit will be non-refundable if travel is canceled. Business Select fares also include additional perks such as priority boarding with a boarding position in the first 15 boarding positions within boarding group “A,” 12 Rapid Rewards points per dollar spent on the base fare—the highest loyalty point multiplier of all Southwest fare products, one complimentary premium beverage coupon for the day of travel on flights over 250 miles (Customers must be of legal drinking age to drink alcoholic beverages), and free inflight internet service, where available. Business Select fares also receive all of the benefits of Anytime fares, including Priority Lane and Express Lane access through check-in and security lines where available, Transferable Flight Credit, and same-day confirmed changes and standby.\nSouthwest’s No-Show Policy applies if a Customer does not change or cancel a flight segment at least ten minutes prior to scheduled departure and the Customer does not travel on the scheduled flight. In such event, subject to certain exceptions, all unflown segments associated with the reservation will be canceled, and (i) with respect to a Wanna Get Away and Wanna Get Away Plus fares, the fare paid for unused travel will be forfeited; and (ii) with respect to Anytime and Business Select fares, the fare paid for unused travel will be held as a flight credit for future travel on Southwest.\nIn order to enhance and expand upon its already generous and flexible ticketing policies, the Company announced in July 2022 that flight credits will no longer expire. Flight credits for non-refundable fa\nres are issued as long as the reservation is cancelled more than ten minutes prior to the scheduled departure. Transferable Flight Credits or refunds for refundable fares are issued regardless of cancellation time.\nAncillary Services\nThe Company offers ancillary services such as Southwest’s EarlyBird Check-In®, Upgraded Boarding, and transportation of pets and unaccompanied minors, in accordance with Southwest’s respective policies.\nEarlyBird Check-In provides Customers with automatic check-in and an assigned boarding position before general boarding positions become available, thereby improving Customers’ seat selection options (priority boarding privileges are already a benefit of being an “A-List” or “A-List Preferred” tier member under the Company’s Rapid Rewards loyalty program). EarlyBird Check-In pricing is based on multiple factors, including the length of the flight and the historical popularity of EarlyBird Check-In on the route.\nWhen available, Southwest sells Upgraded Boarding at the airport or on Customer mobile devices, which allows a Customer to pay for an open priority boarding position in the first 15 positions in its “A” boarding group.\n8\nTable of Contents\nSouthwest’s Pet Policy provides Customers an opportunity to travel with a small cat or dog in the aircraft cabin on domestic flights. Southwest also has an unaccompanied minor travel policy, with pricing to address the administrative costs and the extra care necessary to safely transport these Customers.\nRapid Rewards Loyalty Program\nSouthwest’s Rapid Rewards loyalty program enables program members (“Members”) to earn points for every dollar spent on Southwest base fares, also including purchases paid with LUV Vouchers, gift cards, or flight credit, with no portion of the purchase price paid with Rapid Rewards points. The amount of points earned under the program is based on the base fare and fare class purchased, with higher fare products (e.g., Business Select) earning more points than lower fare products (e.g., Wanna Get Away). As discussed above under “Fare Structure – General,” each fare class is associated with a points earning multiplier, and points for flights are calculated by multiplying the base fare for the flight by the fare class multiplier. The amount of points required to be redeemed for a flight is based on the base fare and a multiplier. Under the program, (i) Members are able to redeem their points for every available seat, every day, on every flight, with no blackout dates; and (ii) points do not expire.\nUnder the program, Members continue to accumulate points until the time they decide to redeem them. As a result, the program provides Members significant flexibility and options for earning and redeeming rewards. For example, Members can earn more points (and achieve tier status such as A-List, A-List Preferred, or a Companion Pass® faster) by purchasing higher fare tickets. Members also have significant flexibility in redeeming points, such as the opportunity to book in advance to take advantage of a lower fare ticket (including many fare sales) requiring fewer points, or by being able to redeem at the last minute, if seats are still available for sale. Members can also earn points through qualifying purchases with Rapid Rewards Partners (which include, for example, car rental agencies, hotels, and restaurants), as well as by using Southwest’s co-branded Chase® Visa credit cards. In addition to earning points for revenue flights and qualifying purchases with Rapid Rewards Partners, Members also have the ability to purchase, gift, and transfer points, as well as the ability to donate points to selected charities.\nSouthwest’s Rapid Rewards loyalty program features tier status and Companion Pass programs for the most active Members, including “A-List” and “A-List Preferred” status. A Member who flies 20 qualifying one-way flight segments booked through Southwest or earns 35,000 tier qualifying points per calendar year will qualify for A-List status. A Member who flies 40 qualifying one-way flights booked through Southwest or earns 70,000 tier qualifying points per calendar year will qualify for A-List Preferred status. The Member will maintain A-List or A-List Preferred status for the remainder of the calendar year in which the status is earned and for the entire calendar year immediately following. Both A-List and A-List Preferred Members enjoy benefits such as priority check-in and security lane access, where available, as well as dedicated phone lines, standby priority, and an earnings bonus on eligible revenue flights (25 percent for A-List and 100 percent for A-List Preferred). In addition, A-List Preferred Members enjoy free inflight internet service, where available, and up to two complimentary premium drinks per flight on flights traveling 250 miles or more, added directly to their mobile boarding passes. Members who attain A-List or A-List Preferred status receive priority boarding privileges. When these Customers purchase travel at least 36 hours prior to flight time, they receive the best boarding position available (generally, an “A” boarding pass). If an A-List or A-List Preferred Member’s plans change, subject to Southwest’s No Show Policy, they are entitled to same-day confirmed change, free of airline charges, if there is an open seat on another flight that departs on the same day as the original flight and is between the same origin and destination airports, but the Customer is required to pay any additional government taxes and fees associated with changes in their itinerary. If there is no open seat on this different flight, a traveler may request to be added to the standby list for that flight. Another feature of the Rapid Rewards loyalty program is the Companion Pass. Members who fly 100 qualifying one-way flights or earn 135,000 qualifying points in a calendar year automatically receive a Companion Pass, which provides for unlimited travel for the designated Companion free of charges (other than taxes and fees). The Companion Pass is valid for the remainder of the calendar year in which status is earned and for the following full calendar year to any destination available on Southwest for a designated Companion of the qualifying Member. The Member and designated Companion must travel together on the same flight.\n9\nTable of Contents\nIn addition, since early 2024, Members are able to pay for their flights with a combination of cash and Rapid Rewards points—starting with as few as 1,000 points. Bookings with flights completed before January 1, 2025, paid for with a combination of points plus other forms of eligible payment did not earn Rapid Rewards points, tier qualifying points for A-List or A-List Preferred status, or Companion Pass qualifying points, but did earn tier qualifying segment credits. However, starting January 1, 2025, the cash portion of a cash plus points booking earns Rapid Rewards points, Rapid Rewards Business points, tier qualifying points for A-List or A-List Preferred status, and Companion Pass qualifying points.\nDuring 2021, the Company added Rapid Rewards Business, giving businesses the ability to earn Rapid Rewards points. By joining Rapid Rewards Business, companies earn Rapid Rewards points that can be applied toward travel on the company’s behalf, while travelers who are Rapid Rewards Members also earn Rapid Rewards points in their personal accounts. Rapid Rewards business accounts generally have the same opportunities and benefits to earn and redeem points as individual Member accounts.\nSouthwest’s Rapid Rewards loyalty program has been designed to drive more revenue by (i) bringing in new Customers, including new Members, as well as new holders of Southwest’s co-branded Chase Visa credit cards; (ii) increasing business from existing Customers; and (iii) strengthening the Company’s Rapid Rewards hotel, rental car, credit card, and other partnerships.\nAs part of the Company’s transformation initiatives announced in third quarter 2024, Southwest plans to update its Tier Benefits, giving A-List and A-List Preferred Members even better benefits, and has updated its credit card program to offer cardmembers more value through assigned seats and premium seating. The Company also anticipates eventually providing Rapid Rewards Members more opportunities to earn and redeem points for longer-haul international destinations with the development of its airline partnerships and the evolution of its \nGetaways by Southwest\n \nproduct.\nYear ended December 31,\n2024\n2023\n2022\nFlight awards redeemed (millions)\n10.1\n10.9\n9.2\nFor 2024, 2023, and 2022, Customer redemption of flight awards accounted for approximately 14.7 percent, 16.3 percent, and 15.0 percent of revenue passenger miles flown, respectively. The Company’s accounting policies with respect to its loyalty programs are discussed in more detail in Note 1 to the Consolidated Financial Statements.\nInvestments in Customer Experience\nIn 2022, the Company announced a multi-year plan to modernize and transform the Customer Experience.\n \nThese enhancements, expected to cost over $2 billion over a five-year period, include the Company’s plans to:\n•\nbring enhanced WiFi connectivity onboard aircraft;\n•\ninstall latest-technology onboard power ports on MAX aircraft to charge personal devices at every seat;\n•\noffer larger overhead bins on new aircraft deliveries with more space and easier access to carryon items;\n•\nintroduce more entertainment options and a wider variety of refreshments in the cabin; and\n•\nenable new self-service capabilities to bring elevated ease in doing business with the Company, benefiting Employees and Customers.\nDuring 2023, the Company completed the enhanced WiFi connectivity onboard its aircraft in order to improve WiFi speed, reliability, and bandwidth. Its new -8 aircraft deliveries are equipped with latest-generation WiFi hardware, and the Company completed its upgrade of the WiFi hardware on its existing fleet. In late 2023, the Company also began taking delivery of MAX aircraft with the latest-generation of onboard USB-A and USB-C power ports on every seat, with a space-saving system that preserves legroom. The Company is also installing the in-seat power ports onboard its existing MAX fleet. Retrofits for in-seat power have begun and occurred at a pace of approximately 11 aircraft per month in 2024. As of December 31, 2024, the Company had 164 aircraft with in-seat power. Further, the Company's new -8 aircraft will come equipped with larger overhead bin space, which is \n10\nTable of Contents\nexpected to result in better operational metrics, fewer gate checked bags, and an improved Customer Experience. As of December 31, 2024, the Company had approximately 91 -8 aircraft with larger overhead bins, and plans to retrofit the remainder of its -8 fleet, as well as its -800 fleet, with larger overhead bins, beginning in 2025. Additionally, in 2024, the Company also announced a refreshed cabin design, which includes new and more comfortable RECARO seats. Southwest has also invested in modernizing its airport spaces by installing new lobby signage, which is expected to facilitate self-service, enhance the overall visual appeal of the lobbies, and make Customers’ travel journey easier.\nSouthwest offers inflight entertainment and connectivity service. Southwest’s suite of complimentary offerings includes, where available, movies-on-demand, messaging, live and on-demand television, a flight tracker, and more. The free inflight entertainment offerings include over 125 free movies-on-demand each month and free app messaging via iMessage or WhatsApp. The television product consists of at least 13 live channels and approximately 70 on-demand recorded episodes from popular television series. The inflight entertainment service allows Customers to enjoy gate-to-gate entertainment directly on their personal wireless devices. Customers can also purchase satellite internet service while A-List Preferred Members and Business Select Customers receive complimentary satellite internet service. Activating internet service gives Customers the ability to stream videos, complete work tasks, and browse social media.\nIn third quarter of 2024, the Company announced its “Southwest. Even Better.” transformation plan to evolve and improve its Customer Experience. The plan includes the Company’s intentions to:\n•\nintroduce assigned seating and premium seating options with extra legroom;\n•\nevolve its boarding process;\n•\nformalize partnerships with international carriers to expand its network, beginning with a partnership with Icelandair that is expected to launch on February 13, 2025 through Baltimore-Washington International Airport;\n•\nlaunch a new \nGetaways by Southwest\n \nvacation\n \nproduct; and\n•\nenhance its Rapid Rewards program and benefits.\nThese initiatives stem from continued monitoring of Customer feedback, travel patterns, and preferences. The introduction of assigned seating is intended to address changes in Customer travel frequency and preferences for a seat assignment, particularly as the Company has increased its proportion of longer-haul flights in light of reduced demand for short-haul travel. Research indicates that a vast majority of both existing Southwest Customers and potential Customers prefer an assigned seat.\nIn addition to assigning seats, the Company plans to offer a premium, extended legroom portion of the cabin that research shows many Customers also prefer. The Company also plans to evolve its boarding process with the introduction of assigned seating and premium seating options, maintaining the Company’s unique approach in boarding through position numbers and signage displayed on stanchions within the gate area. \nThe move to assigned and premium seating will be a significant undertaking by the Company. In addition to incorporating new technologies and procedures for a seamless transition, the new cabin layout will require approvals from the FAA along with other regulatory agencies and vendor partners. The Company expects to make assigned seat and extended legroom bookings available in the second half of 2025, with related flights occurring in the first half of 2026.\nGetaways by Southwest \nBeginning in 2025, the Company plans to offer Customers an in-house vacation package product called “Getaways by Southwest”, replacing the outsourced product Southwest has historically offered. This new vacation booking platform is expected to allow the Company to appeal directly to its broad existing Customer base with an enhanced offering that includes both lodging and excursions, which is designed to drive growth with leisure travelers and grow higher-margin revenues.\nDistribution and Marketing Approach\n11\nTable of Contents\nThe Company primarily offers its fare products directly to Customers through its Internet website, Southwest.com\n®\n, and the Southwest App. For the years ended December 31, 2024, and December 31, 2023, approximately 81 percent and 82 percent, respectively, of the Company’s Passenger revenues originated from Southwest.com or the Southwest App (including revenues from SWABIZ®, the Company's online booking tool designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest). This “direct to Customer” distribution approach has historically provided a cost advantage for the Company because it eliminates fees associated with the use of third-party distribution channels such as third-party online travel platforms.  \nIn light of changing travel patterns post-pandemic, in 2024 the Company focused on attracting new and less frequent Customers, in part, through new distribution channels and the launching of new ad campaigns. The Company expanded its distribution channels through partnerships with flight meta search engines, including Google Flights, Kayak, and Skyscanner, to increase visibility and drive traffic for bookings to Southwest.com. \nIn April 2024, the Company launched “The Big Flex”: a bold new brand marketing campaign showcasing the Company’s fun-loving personality and flexible and Customer-friendly policy points of difference on every fare, everywhere. The campaign highlights choice and flexibility for the Company’s Customers delivered with the Hospitality for which the Company is famous. Additionally, in May 2024, the Company launched “Wanna Go Wednesdays” on Southwest.com, a new weekly program that allows Customers to book the latest low fares on routes that are still available for last minute bookings. The Company also invested in technology to support artificial intelligence (\"AI\")-based marketing efforts and more personalized marketing capabilities throughout 2024.\nThe Company supports its distribution approach by offering a broad suite of digital platforms to support Customers' travel needs, including full featured websites and apps. These digital platforms help Customers book and manage their Southwest air travel and facilitate the purchase of the Company’s ancillary products, including Fare Upgrades, EarlyBird Check-In, Upgraded Boarding, vacation packages, rental car reservations, hotel reservations, and travel activities. In addition, the digital platforms provide self-service tools for trip management and Customer support.\nDigital Hospitality\nThe Company is committed to its goal of widening its Customer Service advantage by enhancing digital Hospitality. The Company is amid a multi-year digital service modernization program designed to, among other things, provide better Customer Service at a lower cost. Key focus areas of the digital service modernization program include contact center service modernization, airport service modernization, Customer Service communications, and disruptions management.  \nIn 2024, the Company implemented digital enhancements to empower Customer self-service and provide more efficient Customer Service. Key updates included a revamped Help Center, an expanded chatbot for improved information access, and enhanced disruption management tools (such as options to rebook or cancel flights and access nearby airports). In compliance with new DOT regulations, Southwest introduced automated ancillary refunds for canceled flights, additional flight rebooking flexibility for applicable schedule adjustments, and improved content to clearly communicate Customer options. The Company added additional Customer Service capabilities, including improved error messaging for increased clarity and actionable options for Customers, improved booking options when booking trips with youth travelers on mobile devices, increased passenger capacity per reservation, self-service features that enable self-management of companion designations, inbound flight tracking, and increased travel flexibility with improved standby booking options for connecting flights.\nIn 2024, the Company introduced generative AI capabilities and automation tools with a goal to improve Customer Service, increase efficiency, and drive lower cost while exceeding Customers’ Hospitality expectations. The Company continues to test the effectiveness of generative AI capabilities across the Customer journey.\nDuring 2024, as a result of these efforts, the Company experienced fewer contact center calls per trip, while increasing app utilization on the day of travel, each as compared with 2023. The Company’s digital service modernization program is expected to continue to deliver additional enhancements and efficiencies in 2025. \n12\nTable of Contents\nThe Company continues to enhance digital revenue-generating capabilities through strategic investments and innovations. The Company deployed a comprehensive suite of optimizations designed to improve product performance across air sales and ancillary offerings, including Upgraded Boarding, EarlyBird Check-In, Cars, Hotels, and Vacations. These efforts are designed to drive incremental revenue while enhancing the Customer Experience.\nThe Company has made significant advancements in marketing automation, particularly on the mobile app. Generative AI-powered copy testing has been introduced to refine marketing messages and optimize conversion rates, yielding increased sales per marketing effort. The Company has also implemented enhanced Rapid Rewards acquisition techniques, promotional text message campaigns, increased push messaging marketing, and improved co-brand acquisition strategies to drive Customer engagement and loyalty. The Company continues to test ongoing improvements to its digital shopping and booking experience to further increase fare upsells and booking conversion effectiveness. \nFurther, the Company has expanded its offerings to include overnight connection flight options, enhanced Rapid Rewards marketing content, and added the ability for Customers to pay for flights using cash plus points. Improvements to account management tools underscore the Company’s commitment to meeting diverse customer needs and growing its market presence. \nSouthwest Business\n®\n Initiatives\nIn addition to improvements in the Company's consumer-direct Southwest.com channel of distribution and new flight search engine partnerships, in recent years the Company has taken significant action, including investments in Employees, processes, and technology, in order to grow its corporate travel business with the goal of making it easier for corporate travel Customers and travel management companies to do business with Southwest. The Company employs a multi-channel distribution strategy for its corporate business travel, offering the ability for business travelers and travel decision makers to book Southwest fares within all major Global Distribution System platforms via Amadeus, Travelport, and Sabre channels, through third-party partners directly connected to the Company's host reservation system, or through the Company’s free corporate online booking tool, SWABIZ®. \nThe Company utilizes Airlines Reporting Corporation to implement industry standard processes to handle the settlement of tickets booked through Travelport, Amadeus, and Sabre channels. The Company also utilizes ATPCO Routehappy to provide detailed product information that supports robust shopping and selling processes in third-party booking channels.\nThe Company offers Southwest Business Meetings, a product for its corporate Customers that is designed to make it easier for meeting planners to manage travel on Southwest by streamlining the process to book group travel for meetings and conventions. In late 2024, the Company beta-launched a new group travel tool, Southwest Groups, designed to bring many self-service features to travel managers in early 2025. The Company also offers Southwest Business Assist™, a travel portal that enables corporate travel buyers, travel decision makers, and travel management companies to better manage their business travel on Southwest using dashboards, reports, automated processing of travel benefits, and Customer Service. The on-demand self-service tool provides access to real-time information and reporting. Southwest Business has also continued to invest in and enhance SWABIZ with mobile capabilities. SWABIZ is designed for business Customers who prefer a self-service and low-cost solution for booking their air travel on Southwest. The site also facilitates car and hotel bookings and offers a suite of reports for travel managers. The Company has additionally developed a new data-sharing API channel, Southwest Business TravelTrack®, that provides business travel Customers and third-party partners more visibility into the business they do with Southwest. \nTechnology Initiatives\n13\nTable of Contents\nThe Company is focused on the prioritization and execution of its technology investments through an evolving multi-year plan, with the goal of developing stronger, more adaptable, more efficient, and more reliable technology systems to support the Company's strategic priorities. The Company has committed, and plans to continue to commit, significant resources to technology improvements in support of its ongoing operations and initiatives. During 2024, among other things, the Company (i) replaced its legacy flight planning system; (ii) expanded its distribution channels via multiple search engine partnerships; (iii) improved communication tools for Employees; (iv) delivered better visual and real-time information to assist both Customers and Employees; (v) leveraged AI to expedite support and call resolution time for Customer Service agents; (iv) worked towards moving to a fully digital (i.e., paperless) turn process; and (v) enabled Rapid Rewards Members to pay for their flights with a combination of cash and Rapid Rewards points. During 2023, among other things, the Company invested in technology and tools that are expected to enhance resiliency and improve its recovery during irregular operations, implemented a new revenue management system, introduced Customer bag tracking, enhanced Customer digital self-service capabilities, and launched Southwest Business Meetings. During 2022, the Company added technology for (i) a new fare product launch; (ii) a new human resources and payroll system; (iii) a new business travel management system; and (iv) enhanced cyber controls and monitoring.\nThe Company continues to invest significantly in technology resources including, among others, the Company's systems related to (i) new assigned seating, premium seating, and boarding processes; (ii) industry standard interline and codeshare capabilities; (iii) 24-hour operations; (iv) flight planning and scheduling designed to improve operating efficiency; (v) daily flight schedule management designed to improve fleet utilization at lower incremental costs; (vi) aircraft turn capabilities designed to improve operating efficiency; (vii) crew mobility and scheduling designed to improve operating quality and resiliency; (viii) foundational airline operating systems; (ix) ancillary products, including vacation packages such as the announced Getaways by Southwest platform; (x) financial planning; (xi) Customer Service Agent mobility; (xii) technology infrastructure and cybersecurity; and (xiii) digital Customer Service modernization. The move to assigned and premium seating, airline partnerships, and 24-hour operations represent significant undertakings by the Company and will require the incorporation of new technologies and procedures for a seamless transition.\nEnvironmental Sustainability\nThe Company remains steadfast in its desire to pursue, implement, and enhance initiatives to address the Company's impact on the environment. Over the years, the Company has undertaken a number of initiatives that have a direct impact on its fuel conservation and emissions-related reduction efforts, such as the following:\n•\nintroduction of the MAX aircraft into the Company's fleet, which is more fuel-efficient and releases fewer CO₂ emissions per ASM than the Company's previous generation of 737 aircraft;\n•\ninstallation of winglets, which reduce drag and increase fuel efficiency, on all aircraft in the Company's fleet;\n•\napplication of periodic engine washes, which helps improve fuel efficiency;\n•\nimplementation of procedures for the use of electric ground power and pre-conditioned air for aircraft at the gate, when available;\n•\nreplacement of eligible internal combustion ground support equipment with electric equipment at select locations;\n•\ndeployment of auto-throttle and vertical navigation to maintain optimum cruising speeds;\n•\nimplementation of engine start procedures to support the Company's single engine taxi procedures;\n•\nimplementation of procedures on the timing of auxiliary power unit starts on originating flights to reduce auxiliary power unit usage;\n•\nimplementation of fuel planning initiatives to safely reduce loading of excess fuel;\n•\nimplementation of procedures to reduce aircraft engine idle speed while on the ground, which also increases engine life;\n•\nutilization of Company-optimized routes (including flying the best wind routes to take advantage of tailwinds or to minimize headwinds);\n14\nTable of Contents\n•\nimprovements in flight planning algorithms to better match the Company's aircraft flight management system and thereby enabling the Company to fly at the most efficient altitudes;\n•\nsubstitution of Pilot and Flight Attendant flight bags and paper manuals with lighter Electronic Flight Bag tablets; and\n•\nimplementation of Real Time Descent Winds (automatic uplinking of up-to-date wind data to the aircraft, allowing crews to time the descent to minimize thrust inputs and, as a result, improve fuel efficiency per flight). \nThe Company participates in Required Navigation Performance (“RNP”) operations as part of the FAA's Performance Based Navigation program, a key component of the Next Generation Transportation System (“NextGen”), which is intended to modernize the U.S. air traffic system by addressing limitations on air transportation capacity and making more efficient use of airspace. RNP combines the capabilities of advanced aircraft avionics, satellite navigation (instead of less precise ground-based navigation), and new flight procedures to enhance navigational and operational capabilities, improve fuel efficiency, and minimize greenhouse gas (“GHG”) emissions. RNP approaches, which are published by the FAA, are currently available at a limited number of the airports Southwest serves, but the Company continues to work with the FAA to develop and seek more use of RNP approaches and to evolve air traffic control rules to support greater utilization of RNP.\nIn 2021, the Company announced near- and long-term environmental sustainability goals, in addition to a series of actions and initiatives designed to assist the Company in achieving these goals. The Company refreshed its environmental sustainability plan in early 2023 and continually monitors developments related to climate change and evaluates its goals and progress against these developments. The Company expects its path toward achievement of these goals will depend on, among other things, (i) increased use of sustainable aviation fuel (“SAF”), which is not presently available at scale or at prices competitive to jet fuel; (ii) improved fuel efficiency from fleet renewal or planned fuel efficiency initiatives; (iii) operational initiatives; and (iv) technological innovation.\nAs part of its corporate sustainability efforts, the Company has published the Southwest One Report describing the Company's environmental sustainability goals, actions, initiatives, and strategies, which include the foregoing and other efforts to address GHG emissions and other environmental matters such as energy and water conservation, waste minimization, and recycling. Information contained in the Southwest One Report is not incorporated by reference into, and does not constitute a part of, this Form 10-K. While the Company believes that the disclosures contained in the Southwest One Report and other voluntary disclosures regarding environmental, social, and governance (“ESG”) matters are responsive to various areas of investor interest, the Company believes that certain of these disclosures do not currently address matters that are material to the Company’s operations, strategy, financial condition, or financial results, although this view may change in the future based on new information that could materially alter the estimates, assumptions, or timelines used to create these disclosures. Given the estimates, assumptions and timelines used to create the Southwest One Report and other voluntary disclosures, the materiality of these disclosures is inherently difficult to assess in advance. \nRegulation\nThe airline industry is heavily regulated, especially by the federal government, and there are a significant number of governmental agencies and legislative bodies that have the ability to directly or indirectly affect the Company and/or the airline industry financially and/or operationally. Regulations affecting the Company and/or the airline industry that have been or may be imposed by several of these governmental agencies and legislative \nbodies\n include, but are not limited to, those discussed below.\nIn May 2024, Congress enacted the FAA Reauthorization Act of 2024 (the “2024 Reauthorization Act”). This statute authorizes funding for the FAA through federal fiscal year 2028 and provides direction to various FAA and DOT offices and programs over the next several years. The 2024 Reauthorization Act resulted in changes in federal law that will impact commercial air carriers. For example, the 2024 Reauthorization Act mandates that the DOT or the FAA promulgate numerous new rulemakings (or standards setting actions), including: (i) rulemakings regarding \n15\nTable of Contents\npassenger accessibility, including training, aircraft accessibility, airport announcements and communications, and online portal accessibility, and (ii) mandates for the FAA, including for flight data recovery from overwater operations, modernization and improvements to aircraft evacuations, minimum qualifications for overseas mechanics working on U.S. registered aircraft, crewmember self-defense training, cybersecurity, and cabin air safety. Some notable rulemakings and a summary of other major initiatives being pursued by the DOT and the FAA related to the airline industry are described below. With the change of presidential administrations in January 2025, it is unclear which of these initiatives will be fully implemented, and whether the DOT, the FAA, and other agencies will pursue new initiatives \nfor regulating airlines.\nEconomic and Consumer Protection Regulation\nRegulation by the U.S. Department of Transportation\nThe DOT regulates economic operating authority for air carriers and consumer protection for airline passengers. The DOT may take legal enforcement action against air carriers for violating the DOT’s statutes or regulations by imposing civil penalties up to $75,000 per occurrence. In January 2023, the DOT issued a notice stating that, going forward, it intends to seek higher civil penalties, and the DOT’s recent enforcement actions have reflected significant increases in the level of civil penalties assessed for violations. \nTo provide passenger transportation in the United States, a domestic airline is required to hold a Certificate of Public Convenience and Necessity from the DOT. A Certificate of Public Convenience and Necessity is unlimited in duration, and the Company’s certificate generally permits it to operate among any points within the United States and its territories and possessions. Additional DOT authority, in the form of a certificate or exemption from certificate requirements, is required for a U.S. airline to serve foreign destinations either with its own aircraft or via code-sharing with another airline. Exemptions granted by the DOT to serve international markets are generally limited in duration and are subject to periodic renewal requirements. The DOT may revoke a certificate or exemption, in whole or in part, for failure to comply with federal aviation statutes, regulations, orders, or the terms of the certificate or exemption itself.\nThe DOT's consumer protection and enforcement authority is derived primarily from a federal statutory prohibition on “unfair or deceptive practices or unfair methods of competition” by air carriers. In January 2021, the DOT codified the definitions for the terms “unfair” and “deceptive” by adopting the definitions used by the Federal Trade Commission and amended and clarified the procedures the DOT will follow when engaging in aviation consumer protection rulemaking and enforcement. The purpose of this rule is to help establish clear and consistent criteria for unfair or deceptive practices while aligning the DOT’s oversight of aviation entities with other government agencies’ oversight of other sectors of the economy regarding unfair or deceptive practices.\nUnder the above-described authority, the DOT has adopted so-called “Passenger Protection Rules,” which address a wide variety of matters, including flight delays on the tarmac, chronically delayed flights, denied boarding compensation, baggage liability requirements, ticket refunds, and advertising of airfares, among others. For example, under the DOT's tarmac delay rule and subject to limited exceptions, air carriers must not allow an aircraft to remain on the tarmac for more than 3 hours (for domestic delays) or more than 4 hours (for international delays), without allowing passengers to deplane, subject to limited exceptions.\nIn addition, the Passenger Protection Rules require airlines to (i) display ontime performance on their websites; (ii) adopt Customer Service plans, publish those plans on their website, and audit their own compliance with their plans; (iii) designate an employee to monitor the performance of airlines' flights; (iv) provide information to passengers on how to file complaints; (v) respond in a timely and substantive fashion to consumer complaints; (vi) pay compensation to each passenger denied boarding involuntarily from an oversold flight; and (vii) prominently disclose all potential fees for optional ancillary services on their websites. \nThe Passenger Protection Rules also require that (i) advertised fares include all government-mandated taxes and fees; (ii) passengers be allowed to either hold a reservation for up to 24 hours without making a payment or cancel a \n16\nTable of Contents\npaid reservation without penalty for 24 hours after the reservation is made, as long as the reservation is made at least seven days in advance of travel; (iii) fares may not increase after purchase; (iv) baggage fees must be disclosed to the passenger at the time of booking; (v) the same baggage allowances and fees must apply throughout a passenger’s trip; (vi) baggage fees must be disclosed on e-ticket confirmations; and (vii) passengers must be promptly notified in the event of delays of more than 30 minutes or if there is a cancellation or diversion of their flight.\nIn 2024, the DOT was active in airline consumer protection, proposing or finalizing several new rules. For example, the DOT finalized a new rule addressing airline ticket refunds which is in effect and being implemented by the Company and other airlines. The rule requires airlines to provide a full ticket refund, which may include ancillary fees in addition to the base fare, if a passenger chooses not to accept a rebooking following a cancellation or significant delay. The DOT also finalized a new rule designed to enhance protections for passengers who use wheelchairs and assistive devices. \nThe DOT has also issued a new final rule related to when and how air carriers must disclose ancillary service fees. The final rule was scheduled to take effect on July 1, 2024. However, in May 2024, various airlines and airline associations challenged the rule in federal court, and the U.S. Court of Appeals for the Fifth Circuit stayed the final rule. Additionally, in August 2024, the DOT issued a proposed rule on family seating that would require U.S. and foreign air carriers to seat children aged 13 and under adjacent to at least one accompanying adult at no additional cost beyond the fare, subject to limited exceptions. This rule is pending, but as of January 28, 2025, is subject to the Executive Order “Regulatory Freeze Pending Review.”   \nIn December 2024, the DOT issued a preliminary proposed rule on airline passenger rights. The DOT was soliciting comments on whether, in the event of a significant flight disruption due to causes within an airline’s control, airlines should be required to provide passengers with a graduated level of cash compensation, free rebooking, and amenities such as meals, lodging for overnight delays, and transportation to and from lodging. As of January 28, 2025, this proposed rule is subject to the Executive Order “Regulatory Freeze Pending Review.”\nThe DOT additionally has statutory authority to prohibit discrimination by airlines against consumers on the basis of (i) disability and (ii) race, color, religion, national origin, sex, or ancestry.\nIn August 2023, the DOT finalized its rule on accessible lavatories. The rule requires airlines to have one accessible (i.e., larger) lavatory on new narrow-body aircraft going forward. Specifically, air carriers must comply with these measures with respect to new aircraft that an air carrier operates that are (i) originally ordered after October 3, 2033, (ii) delivered after October 2, 2035, or (iii) part of a new type-certificated design filed with the FAA or a foreign carrier’s safety authority after October 2, 2024. The new rule does not require a retrofit of existing aircraft. The Company anticipates that this rule could impose substantial costs on the Company and have a material effect on the Company's capital expenditures, earnings, and competitive position. \nAviation Taxes and Fees\nThe statutory authority for the federal government to collect most types of aviation taxes, which are used, in part, to finance programs administered by the FAA, must be periodically reauthorized by the U.S. Congress. The 2024 Reauthorization Act extended, but did not modify, most commercial aviation taxes through September 30, 2028. This includes the two principal FAA-related taxes paid by airline consumers when purchasing an airline ticket: (i) the 7.5% excise tax (applied to the base fare of an airline ticket as well as any mandatory passenger fees charged by the airline) and (ii) the domestic segment tax ($5.00 per passenger segment), capped at two segments each way. The domestic segment tax is adjusted annually for inflation by the Internal Revenue Service. Air carriers also directly pay the commercial jet fuel tax (4.3 cents per gallon).\nIn addition to FAA-related taxes, there are federal taxes related to the U.S. Department of Homeland Security. These taxes do not need to be reauthorized periodically. Congress has set the Transportation Security Fee paid by passengers at $5.60 per one-way passenger trip originating in the United States. Additionally, international passengers arriving in the United States are subject to U.S. immigration and customs fees that are indexed to \n17\nTable of Contents\ninflation. These fees are used to support the operations of U.S. Customs and Border Protection (“CBP”). Finally, the U.S. Department of Agriculture's Animal and Plant Health Inspection Service imposes an agriculture inspection fee on international passengers arriving in the United States.\nAirline passengers are also required to pay a Passenger Facility Charge (“PFC”), a user fee that is authorized via federal statute but assessed by each airport. The maximum PFC is $4.50 per passenger enplanement. \nNew or higher aviation taxes or user fees on air carriers and/or their customers may be imposed by Congress at any time, including during Congress’s anticipated consideration of comprehensive budget and tax legislation in 2025.  \nOperational and Safety Regulation\nThe FAA, an agency within the DOT, has the authority to regulate safety aspects of civil aviation operations. Specifically, the Company and certain of its third-party service providers are subject to the jurisdiction of the FAA with respect to aircraft maintenance and operations, including equipment, ground facilities, dispatch, communications, training, and other matters affecting air safety. The FAA, from time to time, issues orders or directives relating to the maintenance and operation of aircraft that require significant expenditures or operational restrictions. The FAA, acting through its own powers or through the appropriate U.S. Attorney, has the power to bring proceedings for the imposition and collection of civil penalties for violation of the FAA's regulations.\nThe FAA requires airlines to obtain and maintain an Air Carrier Operating Certificate, as well as other certificates, approvals, and authorities. These certificates, approvals, and authorities are subject to amendment, suspension, or revocation for cause.\nAs the airlines’ safety regulator, the FAA uses tools, such as temporary flight restrictions, to control aircraft operations within designated areas. The FAA may also issue advisory circulars to provide guidance for compliance with aircraft and pilot certification standards, operational standards, training standards, and other FAA rules. These regulatory tools may create additional costs and/or operational restrictions for the Company. For example, the FAA has expressed concern about the deployment of certain wireless telecommunications systems that may cause interference with certain aircraft avionics, such as radio altimeters. In response, the FAA could impose temporary flight restrictions until the agency believes any safety concerns are resolved. The FAA could also require mitigations from aircraft operators (e.g., aircraft retrofits) to avoid any potential interference.\nWith respect to airline operations, the FAA has rules in effect with respect to crew flight, duty, and rest times. Among other things, the rules (i) require a ten-hour minimum rest period prior to a pilot’s flight duty period; (ii) mandate that a pilot must have an opportunity for eight hours of uninterrupted sleep within the rest period; and (iii) impose pilot “flight time” and \"duty time” limitations based upon report times, the number of scheduled flight segments, and other operational factors. The FAA has imposed similar duty and rest time requirements for flight attendants.\nThe FAA also manages the nation’s air traffic control (“ATC”) system, a major focus of the 2024 Reauthorization Act. The congressional appropriations committees, as well as FAA leadership are addressing persistent shortages of fully licensed and trained air traffic controllers. Controller shortages at key FAA-managed ATC facilities have been the cause of air carrier delays and cancellations, especially when controller shortages are combined with severe weather in places like Florida and the New York/New Jersey/Philadelphia corridor. Moreover, the increase in commercial space operations in some areas of the country and the expected introduction of advanced air mobility aircraft, could further degrade the FAA’s ability to provide consistently efficient and reliable ATC services.\nThe FAA is also the safety regulator of airplane manufacturers and oversees the aircraft certification process. The certification of the -7 is stalled due in part to the FAA’s heightened oversight of aircraft manufacturers and control over the aircraft certification process. The FAA’s oversight of the Company’s original equipment manufacturers and the rate of production of new planes are outside of the Company’s control.\n18\nTable of Contents\nIn June 2023, the FAA finalized a new rule requiring that airplane manufacturers install a physical secondary barrier between the aircraft’s flight deck and cabin in order to provide additional protection against unauthorized access to the flight deck. The final rule provided a two-year compliance period through August 25, 2025, after which a physical secondary barrier meeting the requirements of the rule is required for any transport category airplane manufactured and used in regularly scheduled passenger-carrying operations. Compliance with this rule could impose substantial costs on the Company. Per the 2024 Reauthorization Act, the FAA convened an Aviation Rulemaking Committee (“ARC”) in the fall of 2024 to explore additional requirements to retrofit a secondary barrier on existing mainline airliners. Depending on the ARC’s recommendations, the FAA may initiate rulemaking on a retrofit mandate in 2025, which could apply to the Company’s current fleet.\nIn addition, the 2024 Reauthorization Act, like the FAA Reauthorization Act of 2018, contains provisions directing the FAA to examine whether to issue new regulations establishing minimum dimensions for seat size based on safety and evacuation considerations. Since 2022, the FAA has examined the issue and solicited stakeholder feedback on the topic. The FAA has not yet issued a proposed rule. If the FAA issues a rule with minimum dimensions that exceed the Company’s current seat dimensions, the Company could incur substantial compliance costs.\nIn addition to its day-to-day management of the nation’s air traffic control system, the FAA has continued its lengthy and ongoing effort to implement a multi-faceted, airspace modernization program, NextGen. According to the U.S. government, once fully implemented, NextGen is expected to improve airspace capacity and contribute to a safer, more efficient, and more predictable system, which may potentially contribute to reduced fuel burn, emissions, and noise. As part of the NextGen initiative, in 2010 the FAA published rules requiring most commercial aircraft operating in the national airspace system to be equipped with Automatic Dependent Surveillance - Broadcast (“ADS-B”) technology by January 1, 2020. ADS-B technology is intended to enhance safety and efficiency by moving from ground-based radar and navigational aids to precise tracking using satellite signals. In addition to environmental and efficiency benefits, ADS-B technology gives pilots and air traffic controllers new tools to reduce the risk of runway incursions and aircraft collisions. The Company has implemented technology and programs intended to comply with all applicable ADS-B requirements. On November 9, 2021, the U.S. government announced an Aviation Climate Action Plan to reduce emissions by, among other initiatives and efforts, operationalizing NextGen to realize the full potential of modernized infrastructure and systems, and enhancing data quality and information distribution to enable operators to fly more fuel-efficient trajectories. However, with the new presidential administration, this initiative may be postponed.\nThe Air Traffic Organization (“ATO”) is the operational arm of the FAA. The ATO is responsible for providing safe and efficient air navigation services to all of the United States and large portions of the Atlantic and Pacific Oceans. The Company is subject to any operational changes imposed by the FAA/ATO as they relate to the NextGen program, as well as the day-to-day management of the air traffic control system.\nPassenger and Occupational Health Regulation \nThe Company is subject to various other federal, state, and local laws and regulations relating to health and occupational safety, including Department of Health and Human Services, Centers for Disease Control and Prevention, Occupational Safety and Health Administration, and Food and Drug Administration regulations. In response to the COVID-19 pandemic, federal, state, and local government authorities implemented directives, orders, and regulations intended to mitigate the spread of the virus, and in response, the Company modified its practices, policies, and procedures, as appropriate. New health requirements or standards, whether mandated by government agencies or voluntarily adopted by the Company, related to the COVID-19 pandemic or otherwise intended to mitigate the spread of communicable diseases could affect the Company’s costs and performance.\nSecurity Regulation\nPursuant to the Aviation and Transportation Security Act (“ATSA”), the Transportation Security Administration (“TSA”), a federal agency of the U.S. Department of Homeland Security, is responsible for certain civil aviation \n19\nTable of Contents\nsecurity matters. The ATSA and subsequent TSA regulations and procedures implementing the ATSA and related statutes address, among other things, (i) flight deck security; (ii) the use of federal air marshals onboard flights; (iii) airport and aircraft access security; (iv) airline crew security training; (v) security screening of passengers, baggage, cargo, mail, employees, and vendors; (vi) training and qualifications of security screening personnel; (vii) provision of passenger data to CBP; (viii) background checks; and (ix) certain cybersecurity requirements.\nUnder the ATSA, substantially all security officers at airports are federal employees, and significant other elements of airline and airport security are overseen and performed by federal employees, including federal security managers, federal law enforcement officers, and federal air marshals. TSA personnel and TSA-mandated security procedures can affect the Company's operations, costs, and Customer Experience. For example, as part of its security measures, the TSA regulates the types of liquid items that can be carried onboard aircraft. In addition, as part of its Secure Flight program, the TSA requires airlines to collect a passenger's full name (as it appears on a government-issued ID), date of birth, gender, and Redress Number (if applicable). Airlines must transmit this information to Secure Flight, which uses the information to perform matching against terrorist watch lists. After matching passenger information against the watch lists, Secure Flight transmits the matching results back to airlines. This serves to identify individuals for more extensive security screening and to prevent individuals on watch lists from boarding an aircraft. It also helps prevent the misidentification of passengers who have names similar to individuals on watch lists. The TSA's multi-layered, risk-based approach to airport security also includes physical pat down procedures at security checkpoints. These procedures have raised privacy concerns by some air travelers and have caused delays at screening checkpoints.\nThe Company, in conjunction with the TSA, participates in TSA PreCheck™, a pre-screening initiative that allows passengers deemed low risk by the TSA to move through security checkpoints with greater efficiency and ease when traveling. Eligible passengers may use dedicated screening lanes at certain airports the Company serves for screening benefits, which include leaving on shoes, light outerwear, and belts, as well as leaving laptops and permitted liquids in carryon bags. A similar CBP-administered program, Global Entry\n®\n, allows expedited clearance for pre-approved, low-risk international travelers upon arrival in the United States. The TSA has expressed its plans to leverage advanced transportation security screening technologies, including biometric solutions, to improve security effectiveness and operational efficiency, while also enhancing the passenger experience. The advanced technologies have prompted privacy, cost, and legal concerns from air carriers, travelers, and advocacy groups, which could affect the timing and viability of the TSA's plans.\nThe Company also participates in the TSA Known Crewmember\n®\n program, which is a risk-based screening system that enables TSA security officers to positively verify the identity and employment status of flight-crew members. The program expedites flight crew member access to sterile areas of airports.\nThe Company works collaboratively with the TSA, foreign national governments, and airports to provide risk-based security measures at international locations served by the Company. The Company has also made significant investments in facilities, equipment, and technology to process Customers, checked baggage, and cargo efficiently in compliance with applicable security regulations. However, the Company is not able to predict the impact, if any, t\nhat any new security measures or TSA resource limitations at certain airports will have on Passenger revenues and the Company’s costs, either in the short-term or the long-term.\nEnvironmental Regulation\nThe Company is subject to various federal laws and regulations relating to the protection of the environment, including the Clean Air Act, the Resource Conservation and Recovery Act, the Clean Water Act, the Safe Drinking Water Act, and the Comprehensive Environmental Response, Compensation and Liability Act (“CERCLA”), as well as state and local laws and regulations. These laws and regulations govern aircraft drinking water, emissions, storm water discharges from operations, and the disposal of materials such as jet fuel, chemicals, hazardous waste, and aircraft deicing fluid.\n20\nTable of Contents\nAdditionally, in conjunction with airport authorities, other airlines, and state and local environmental regulatory agencies, the Company, as a normal course of business, undertakes voluntary investigation or remediation of soil or groundwater contamination at various airport sites. The Company has not historically experienced any airport site environmental liability that has had a material adverse effect on its capital expenditures, earnings, or competitive position. However, many airports, as well as federal, state, and local governmental authorities, are increasingly focused on groundwater contamination caused by what are sometimes referred to as “forever chemicals,” most notably per- and polyfluoroalkyl substances (“PFAS”). PFAS have been used in many manufacturing and industrial applications over many decades and can be found in numerous products, including building materials and household products. Most notably for aviation, PFAS are a key component in aqueous film-forming foam (“AFFF”), which are commonly available for use to fight petroleum-based fires at both commercial and military aviation facilities. The FAA and the U.S. Department of Defense have strict performance specifications for fire suppression systems, which has contributed to the use of AFFF/PFAS over the decades. PFAS is now the focus of regulatory oversight at airports, as well as the source of litigation by airports against AFFF manufacturers. Moreover, regulatory authorities at the federal, state, and local levels are moving forward with prohibitions on the manufacturing, use, or sale of PFAS-based AFFF, as well as costly remediation efforts at airports to address groundwater contamination. In addition, in April 2024, the U.S. Environmental Protection Agency (the “EPA”) issued a final rule listing two specific types of PFAS, perfluorooctanoic acid (“PFOA”) and perfluorooctanesulfonic acid (“PFOS”), which may be found in AFFF, as hazardous substances under CERCLA and requiring entities to report releases that meet or exceed the reportable quantity immediately to the EPA’s National Response Center, and any other applicable state or local agencies. Accompanying the final rule, the EPA also separately issued an enforcement discretion policy that describes how the EPA intends to generally seek to impose liability under CERCLA on those responsible for releasing or exacerbating the spread of PFAS into the environment, such as those who have manufactured PFAS or used PFAS in the manufacturing process, and other industrial parties. At this time, the Company cannot predict to what extent, if any, this enforcement discretion may ultimately provide any relief from potential PFAS liability. Furthermore, while the new presidential administration is expected to generally pursue a deregulatory agenda, the Company cannot predict what actions the new administration may take with respect to PFAS regulation and the timing and scope of any such changes. The evolving legal and regulatory activity surrounding PFAS could lead to an inadequate supply of FAA-certified AFFF throughout the aviation system, additional costs associated with transitioning away from AFFF products containing PFOA and PFOS, potential environmental incident prevention or cleanup costs, and/or increased operating costs at certain airports. Moreover, listing PFAS compounds under CERCLA may give rise to strict, joint and several liability for removal, remedial, response, and other costs, the costs of which could be material.\nThe federal government and the United Nations’ International Civil Aviation Organization (“ICAO”) have agreed to a series of measures to reduce GHG emissions within the aviation sector. At the federal level, in July 2016, the EPA issued a final endangerment finding for GHG emissions from certain types of aircraft engines, which the agency determined contribute to pollution that causes climate change and endangers public health and the environment. Following this endangerment finding, per the federal Clean Air Act, the EPA adopted aircraft GHG emissions standards in December 2020. These standards apply to airframe and aircraft engine manufacturers and align with the standards previously adopted by ICAO. The Company has not and does not expect to incur any material costs related to the EPA’s aircraft GHG emissions rules at this time, and the rules are not expected to adversely impact the Company's current aircraft fleet; however, the Company cannot guarantee that more stringent standards will not be adopted by Congress, the FAA, or the EPA in the future that could require material capital expenditures to modernize or replace its aircraft fleet or incur other costs related to GHG emissions from its aircraft.\nIn addition to aircraft emissions standards, ICAO implemented a “global market-based measure” framework in an effort to control carbon dioxide emissions from international aviation. The focal point of this framework is a carbon offsetting system applicable to aircraft operators designed to cap the growth of emissions related to international aviation. ICAO's Carbon Offsetting and Reduction Scheme for International Aviation (“CORSIA”) program is a global market-based measure intended to cap carbon emissions from international civil aviation at their 2019 levels from 2021 to 2023 and 85 percent of their 2019 levels from 2024 to 2035, addressing carbon emissions from the growth of international air traffic by requiring that international aviation emissions above these levels be offset or reduced through the use of CORSIA Eligible Fuel, such as a CORSIA SAF, or CORSIA Eligible Emissions Units. \n21\nTable of Contents\nThe U.S. federal government has opted to participate in the voluntary phases of the CORSIA program from 2021-2026 (additional phases extend through 2035). However, it is unclear at this time whether the new presidential administration will take action to limit the implementation of the mandatory phases beginning in 2027. For example, on January 20, 2025, President Trump issued an Executive Order withdrawing from the Paris Agreement and, at this time, it is unclear what impact this action may have on the United States’ participation in CORSIA in the short term. As part of the CORSIA program, the Company is currently monitoring its international emissions for reporting purposes. Data collected from applicable international flight activity in 2019 forms the baseline and is used in the calculations to determine subsequent carbon offsetting requirements under the CORSIA program. To the extent CORSIA revises any of its emission accounting methodologies or options for meeting emission reduction levels, the Company could face increased costs to purchase additional volumes of SAF, carbon offsets, or take other measures to comply with the CORSIA program. To date, the Company has not incurred any material costs related to its compliance with CORSIA; however, the Company could experience material costs as a result of any future expansion of its international operations, which would increase its compliance obligations under CORSIA, the need to purchase additional carbon offsets or volumes of SAF than what the Company has currently projected based on any changes to the CORSIA program, any similar program, or other unforeseeable reasons given the evolving nature of climate-change-related laws, regulations, and programs. Regardless of the method of regulation or application of CORSIA, further policy changes with regard to climate change are possible, which could significantly increase operating costs in the airline industry and, as a result, adversely affect operations. Until the timing, scope, and extent of such future developments become known, the Company cannot predict their effect on the Company’s cost structure or its operating results.\nThere are additional areas of rulemaking occurring at the state and federal levels with respect to climate-change-related matters that could also increase the Company’s compliance obligations and costs and expenditures related to the same. While there have been a number of federal efforts to require the disclosure of certain climate-related information in recent years, and there may be similar efforts to require such disclosures in the future, the new presidential administration is expected to repeal or otherwise reverse these efforts. Moreover, on his first day in office, on January 20, 2025, President Trump issued an Executive Order reversing many of the climate-related actions of the previous administration. However, to the extent any future rules mandate that the Company make additional disclosure on matters related to climate change, it is possible that such disclosures may result in reputational harm or impact lending or investment decisions of third parties. If the Company is not perceived as meeting any climate change-related standards established by such third parties, the Company could face greater restrictions on or increased costs of access to capital. For example, in March 2024, the U.S. Securities and Exchange Commission (“SEC”) adopted a new rule called, “The Enhancement and Standardization of Climate-Related Disclosures for Investors.” This rule is being challenged legally in the U.S. Court of Appeals for the Eighth Circuit and implementation of the rule has been voluntarily stayed by the SEC pending the outcome of the legal challenge; moreover, the SEC may seek to repeal or revise the rule, though the Company cannot predict whether or how such action would occur or its timing. Should the rule be implemented as finalized, however, the rule would place new requirements on Southwest and other large publicly-traded corporations. For instance, the rule requires a domestic or foreign registrant to include certain climate-related information in its registration statements and periodic reports, such as on Form 10-K, including: (i) climate-related risks and their actual or likely material impacts on the registrant’s business, strategy, and outlook; (ii) the registrant’s governance of climate-related risks and relevant risk management processes; (iii) the registrant’s GHG emissions, which for accelerated and large accelerated filers and with respect to certain emissions would be subject to assurance; (iv) certain climate-related financial statement metrics and related disclosures in a note to its audited financial statements; and (v) information about climate-related targets and goals, and transition plan, if any. Additionally, in 2023, the State of California enacted a number of climate-disclosure related laws, including the Climate Corporate Data Accountability Act (“CCDAA”) and Climate-Related Financial Risk Act (“CRFRA”). The CCDAA requires both public and private U.S. companies that are “doing business in California” and that have a total annual revenue of $1 billion to publicly disclose and verify, on an annual basis, Scopes 1, 2 and 3 GHG emissions. The CRFRA requires the disclosure of a climate-related financial risk report (in line with the Task Force on the Climate-related Financial Disclosures recommendations or equivalent disclosure requirements under the International Sustainability Standards Board’s climate-related disclosure standards) every other year for public and private companies that are “doing business in California” and have total annual revenue of $500 million. Reporting under the CCDAA and CRFRA is scheduled to take effect \n22\nTable of Contents\nbeginning in 2026. The ultimate impact of these laws on the Company remains uncertain and the California Air Resources Board (“CARB”) is presently soliciting comments on certain of the rule’s details, so the specific final requirements may not be known for some time. Furthermore, each of these laws has been subject to legal challenge. While the outcome of such challenge is uncertain at this time, the judge in the case has declined to grant a temporary injunction of the laws while the litigation moves forward. Additionally, in October 2023, California also enacted the Voluntary Carbon Markets Disclosure Act (“VCMDA”) which creates new reporting obligations related to voluntary carbon offsets. The VCMDA requires business entities that (i) market or sell voluntary carbon offsets in California, (ii) purchase or use voluntary carbon offsets sold in California that make emissions-related claims, or (iii) make claims that an entity or product has eliminated or made significant reductions to its carbon dioxide or GHG emissions to make certain public disclosure on the business entity’s website. Furthermore, climate-related laws are presently being developed in the legislatures of several U.S. states and the timing and scope of such legislation, if passed into law, is uncertain at this time. The reporting obligations of the CCDAA, CRFRA, VCMDA, and other state or federal laws or rules requiring the disclosure of climate-related risks may cause the Company to incur increased costs with respect to modifying existing disclosure controls, financial reporting practices, and the gathering and reporting of emissions data. In addition, failure to comply with these disclosure laws and regulations could result in the imposition of substantial fines or penalties. The Company could also face increased risks of litigation resulting from any enhanced disclosure requirements related to climate change. For further discussion of the risks relating to these reporting obligations, see “Risk Factors—Legal, Regulatory, Compliance, and Reputational Risks.”\nOn November 12, 2022, the Biden-Harris Administration proposed the Federal Supplier Climate Risks and Resilience Rule, which would require major federal contractors to publicly disclose their greenhouse gas emissions and climate-related financial risks and set science-based emissions reduction targets verified by the Science-Based Target initiative and in accordance with third-party standards that preclude the use of carbon offsets to achieve emission reduction goals. On January 13, 2025, the proposed rule was withdrawn. However, there may be similar efforts to require such disclosures in the future and compliance with similar rules could require the Company to incur increased costs due to increased reporting obligations, modify its operations to meet emissions reduction targets, accelerate its fleet replacement plans, or otherwise revise or restate its existing sustainability goals.\nIn addition to climate change, aircraft noise continues to be an environmental focus, especially as the FAA implements new flight procedures as part of its NextGen airspace modernization program discussed above. The Airport Noise and Capacity Act of 1990 gives airport operators the right, under certain circumstances, to implement local noise abatement programs, provided they do not unreasonably interfere with interstate or foreign commerce or the national air transportation system and meet other requirements. Some airports have established airport restrictions to limit noise, including restrictions on aircraft types to be used and limits on the number of hourly or daily operations or the time of operations. These types of restrictions can cause curtailments in service or increases in operating costs, limit the ability of air carriers to expand operations at the affected airports, and result in civil fines when operators violate curfews or noise limitations.\nAt the federal level, the FAA has committed to inform and involve the public, engage with communities, and give meaningful consideration to community concerns and views when developing new flight procedures, and there is a possibility that Congress may enact legislation in the future to address local noise concerns at one or more commercial airports in the United States. In addition, the FAA Reauthorization Act of 2018 requires the FAA to consider community noise concerns when proposing a new navigation departure procedure or amending an existing navigation procedure that would direct aircraft over noise sensitive areas. This requirement could delay or otherwise impede the implementation or use of more efficient flight paths.\nIn general, government efforts at the international, federal, state, or local levels to address worldwide climate change, manage GHG emissions, and reduce aircraft noise, to the extent pursued or implemented, could affect the Company, aircraft operators, original equipment manufacturers, producers and sellers of aviation fuel, and other third parties on which the Company is dependent. Additional legislative or regulatory activity in this area could require modifications to the Company’s equipment, operations, and strategy, and have a material effect on the Company's capital expenditures, earnings, or competitive position.\n23\nTable of Contents\nData Privacy and Cybersecurity Regulation\nThe data privacy and cybersecurity regulatory landscape has become increasingly complex with a growing patchwork of legal obligations that require engaging with an increasing number of regulators. Additionally, the interpretation and application of many data privacy and cybersecurity legal obligations is rapidly evolving, non-uniform, and may be subject to significant change. Interpretation of data privacy and cybersecurity legal obligations may also be applied inconsistently across jurisdictions. The Company continues to monitor a growing set of data privacy and cybersecurity legal requirements from a growing number of applicable authorities and regulators. For further discussion of the risks relating to data privacy and cybersecurity, see “Risk Factors—Information Technology, Cybersecurity, and Data Privacy Risks.”\nRegulators and certain jurisdictions, including the European Union, the U.K., and numerous states within the United States, have passed laws relating to the notice, collection, processing, use, retention, protection, and transfer of personal information as well as the protection of sensitive information and critical systems. In some cases, such laws and regulations can be enforced by private parties in addition to regulators. The Company processes, stores, or transmits sensitive data that includes information such as Customer or Employee data, credit card numbers, and other personally identifiable information for a variety of business purposes. The Company, therefore, is subject to various risks and costs associated with such activities, including costs associated with compliance with U.S. and foreign data collection and privacy laws and various contractual obligations. \nThe Company must also comply with evolving payment card association and network operating rules, including data security rules, certification requirements, and rules governing electronic fund transfers. For example, the Company must comply with evolving Payment Card Industry Data Security Standards (“PCI DSS”), which impose stringent requirements on how the Company processes and protects payment card data. Failure to maintain PCI DSS compliance or the compromise of cardholder data that the Company processes, stores, or transmits could result in costs, fees, fines, penalties, and restrictions on the Company’s ability to process payment card transactions, which could materially impact operations and Customer Experience.\nFurthermore, as the Company enters into airline partnerships with international carriers, the Company will need to comply with foreign laws like the EU's General Data Protection Regulation in certain scenarios, which could impose additional data privacy and security requirements upon the Company along with significant compliance obligations and substantial penalties for non-compliance.\nThe Company has experienced heightened legislative and regulatory focus on cybersecurity from a critical infrastructure perspective, a federal contractor perspective, and broadly applicable cybersecurity legal obligations. As a result, the Company must comply with a developing set of cybersecurity requirements, including but not limited to incident and other reporting, internal and external coordination, affirmative risk‑management obligations, compliance, and technical requirements related to information technology systems and operational technology systems. For example, in March 2023, the TSA issued emergency cybersecurity program changes applicable to TSA-regulated airport and aircraft operators, including the requirement to develop a TSA-approved cybersecurity implementation plan describing measures taken to improve cybersecurity and to assess the effectiveness of those measures on an ongoing basis. The TSA also continues to make significant cybersecurity program changes. In December 2023, the SEC’s new rules on cybersecurity risk management, strategy, governance, and incident disclosure became effective. For additional information, see Item 1C – “Cybersecurity.” The 2024 Reauthorization Act required the FAA to create a Civil Aviation Cybersecurity Rulemaking Committee by May 2025 to conduct reviews, develop findings, and make recommendations on cybersecurity standards for civil aircraft, aircraft ground support information systems, airports, air traffic control mission systems, and aeronautical products and articles. Depending on the rulemaking committee's recommendations, the FAA could issue additional cybersecurity rulemaking directly applicable to air carriers, aircraft and product manufacturers, and other industry stakeholders.\nAdditionally, there are emerging regulations and state laws around AI, including those in California and Colorado, that may soon require companies that develop or deploy AI systems to establish formal governance structures and \n24\nTable of Contents\ninternal controls, including designated oversight personnel, documented risk assessment procedures, and regular compliance reviews of their AI systems. \nThe Company expects federal, state, and other governments to assess and implement increasingly complex data privacy and cybersecurity legal obligations, which could result in expanded compliance burdens, costs, and enforcement risks for the Company.\nInternational Regulation\nAll international air service is subject to certain U.S. federal requirements and approvals, as well as the regulatory requirements of the appropriate authorities of the foreign countries involved. Foreign regulatory agencies located in jurisdictions served by the Company can impose requirements on various aspects of the Company’s business, including safety, marketing, ticket sales, staffing, and tax.\nThe Company has obtained the necessary economic authority from the DOT, as well as approvals required by the FAA and applicable foreign government entities, to conduct operations, under certain circumstances, to points outside of the continental United States currently served by the Company. Certain international authorities and approvals held by the Company are subject to periodic renewal requirements. The Company requests extensions of such authorities and approvals when and as appropriate. To the extent the Company seeks to serve additional foreign destinations in the future, or to renew its authority to serve certain routes, it may be required to obtain necessary authority from the DOT and/or approvals from the FAA, as well as any applicable foreign government entity.\nCertain international markets are governed by bilateral air transportation agreements between the United States and foreign countries. Changes in U.S. or foreign government aviation policies could result in the alteration or termination of such agreements, diminish the value of the Company's existing international authorities, present barriers to renewing existing or securing new authorities, or otherwise affect the Company's international operations. There are also capacity limitations at certain international airports, which could impact future service levels. In general, bilateral agreements between the United States and foreign countries the Company currently serves, or may serve in the future, may be subject to renegotiation or reinterpretation from time to time. While the U.S. government has negotiated “open skies” agreements with many countries, which allow for unrestricted access between the United States and respective foreign destinations, agreements with other countries may restrict the Company's entry into those destinations and/or its related growth opportunities.\nThe CBP is the federal agency of the U.S. Department of Homeland Security charged with facilitating international trade, collecting import duties, and enforcing U.S. regulations with respect to trade, customs, and immigration. To the extent the Company expands its international flight offerings, CBP and its requirements and resources will also become increasingly important considerations to the Company. For instance, with the exception of flights from a small number of foreign “preclearance” locations, arriving international flights may only land at CBP-designated airpo\nrts, and CBP officers must be present and in sufficient numbers at those airports to effectively process and inspect arriving international passengers, baggage, and cargo. Thus, CBP personnel and CBP-mandated procedures can affect the Company's operations, costs, and Customer Experience. The Company has made significant investments in facilities, equipment, and technologies at certain airports in order to improve the Customer Experience and to assist CBP with its inspection and processing duties; however, the Company is not able to predict the impact, if any, that various CBP measures or the lack of CBP resources will have on the Company's revenues and costs, either in the short-term or the long-term.\nInsurance\nThe Company carries insurance of types customary in the airline industry and in amounts the Company deems adequate to protect the Company and its property and to comply both with applicable regulations and certain of the Company's credit and lease agreements. The policies principally provide coverage for public and passenger liability, property damage, pollution, D&O/fiduciary, cargo and baggage liability, loss or damage to aircraft, engines, and \n25\nTable of Contents\nspare parts, and workers’ compensation. In addition, the Company carries a cybersecurity insurance policy with regards to data protection and business interruption associated with both security breaches from malicious parties and from certain system failures. The Company also manages insured risk through the use of reinsurance programs, pooling mechanisms, and a wholly-owned captive insurance subsidiary. For a discussion of the risks related to the Company’s insurance coverage, see “Risk Factors.”\nIndustry and Competition\nHistorically, the airline industry has been an extremely volatile industry. Among other things, it has been cyclical, energy intensive, labor intensive, capital intensive, technology intensive, highly regulated, heavily taxed, and extremely competitive. The airline industry has also been particularly susceptible to detrimental events such as economic recessions, jet fuel price volatility, unscheduled maintenance disruptions, outbreaks of disease and/or pandemics, supply chain challenges, U.S. government shutdowns, acts of terrorism or war, geopolitical unrest, severe weather, and natural disasters. In 2024, the U.S. airline industry continued to face challenges such as inflationary cost pressures (particularly labor costs), delayed aircraft deliveries, shifting travel demand patterns, economic uncertainty, disruptive weather events, and natural disasters. In response to ever-evolving travel patterns, the Company and several other U.S. airlines have announced route network changes and slower capacity growth for 2025, as compared with 2024.\nCompetition within the airline industry is intense and highly unpredictable, and Southwest has historically competed with other airlines on virtually all of its scheduled routes. In recent years, the majority of domestic airline service has been provided by Southwest and the other largest major U.S. airlines, including American Airlines, Delta Air Lines, and United Airlines. The DOT defines major U.S. airlines as those airlines with annual revenues of at least $1 billion; there are currently 15 passenger airlines offering scheduled service, including Southwest, that meet this standard.\nKey competitive factors within the airline industry include (i) pricing and cost structure; (ii) routes, loyalty programs, and schedules; (iii) Customer Service, operational reliability, product offerings, and amenities; and (iv) balance sheet health. Airlines, including Southwest, also compete for customers with alternatives to air travel, such as driving, videoconferencing, and business communication platforms. These communication alternatives have bec\nome particularly prevalent post-pandemic.\nPricing and Cost Structure\nPricing is a significant\n competitive factor in the airline industry, and the availability of fare information on the Internet allows travelers to easily compare fares and identify competitor promotions and discounts. During 2024, the Company continued to experience a highly competitive fare environment. \nPricing can be driven by a variety of factors. For example, airlines may discount fares to stimulate traffic in new markets, increase traffic in existing markets, and/or grow market share in existing markets. Some airlines have been able to offer more competitive fares through measures designed to lower operating costs. Common efforts include fleet transformation to gain fuel efficiencies, fleet simplification, and increasing the number of seats per trip through seat retrofits and the use of larger aircraft.\nThe Company believes its low-cost operating structure has historically provided it with an advantage over many of \nits airline competitors by enabling it to continue to charge competitively low fares. \nRoutes, Loyalty Programs, and Schedules\nThe Company also competes with other airlines based on markets served, loyalty opportunities, and flight schedules. While the Company has a robust route network in the United States, some major airlines have more extensive global route structures than Southwest, including more extensive international networks. In addition, many competitors have entered into significant commercial relationships with other airlines, such as strategic \n26\nTable of Contents\nalliances, code-sharing, and capacity purchase agreements, which increase the airlines' opportunities to expand their route offerings. An alliance or code-sharing agreement enables an airline to offer flights that are operated by another airline and allows the airline’s customers to book travel that includes segments on different airlines through a single reservation or ticket. As a result, depending on the nature of the specific alliance or code-sharing arrangement, a participating airline may be able to, among other things, (i) offer its customers access to more destinations than it would be able to serve on its own, (ii) gain exposure in markets it does not otherwise serve, and (iii) increase the perceived frequency of its flights on certain routes. More extensive route structures, as well as alliance and code-sharing arrangements, not only provide additional route flexibility for participating airlines, but they can also allow these airlines to offer their customers more opportunities to earn and redeem loyalty miles or points. A capacity purchase agreement enables an airline to expand its route structure by paying another airline (e.g., a regional airline with smaller aircraft) to operate flights on its behalf in markets that it does not, or cannot, serve itself. In 2024, the Company announced it will pursue partnerships with other airlines in order to further expand the reach of the \nCompany’s network and connect Customers with more global destinations. The Company launched its first such partnership in first quarter 2025 with Icelandair to provide transatlantic connectivity and expects to begin selling and operating interlining flights in February 2025. The Company plans to add at least one more partner during 2025.\nCustomer Service, Operational Reliability, Product Offerings, and Amenities\nSouthwest also competes with other airlines with respect to customer service, operational reliability (such as ontime performance), product offerings, and passenger amenities. Southwest competes with airlines that have more seating options and associated passenger amenities, including first class, business class, and other premium seating and related amenities, which can appeal in particular to business customers. The Company believes the introduction of its fares in the Global Distribution Systems, as well as the introduction of assigned and additional legroom seating, provides an opportunity to increase the Company’s market share of business customers.\nNew and different types of aircraft flown by competitors could have operational attributes and passenger amenities that could be considered more attractive to certain consumers than those associated with the Company’s existing fleet. Some of the Company’s competitors have added, and may continue to add, passenger amenities not offered by the Company, including through new aircraft types and configurations. While Southwest has been known for its open seating model, in 2024 the Company announced its intention to assign seats, offer premium seating options with extra leg room, and evolve its boarding processes. The Company also announced \na refreshed cabin design, including new, more comfortable RECARO seats\n. These new initiatives are designed to elevate the Customer Experience and enable the Company to better compete with other airlines’ product offerings and passenger amenities. The \nanticipated offering of overnight (\ni.e.\n redeye) flights, airline partnerships aimed at delivering international connectivity, and an in-house vacation package product further expand the Company’s competitive product offerings\n. \nC\narriers are also increasingly focusing on customer-friendly policies as opportunities to win and retain customers. However, the Company believes its Customer Service and Customer-friendly policies (including those listed below) continue to positively differentiate it from many of its competitors. The Company continuously reviews the effectiveness of its Customer policies in achieving its commercial objectives. \n•\nThe Company offers up to two free checked bags (subject to weight and size limits) for all ticketed Customers; \n•\nThe Company offers competitively low fares and does not charge change fees (although fare differences may apply) or cancellation fees (subject to the Company’s No Show policy);\n•\nThe Company offers free same-day standby listings (subject to conditions);\n•\nCustomers can pay with a combination of cash and Rapid Rewards points;\n•\nRapid Rewards points do not expire; \n•\nFlight credits do not expire; and \n•\nThere are no additional fees for items such as soft drinks and snacks where available, curb-side check-in where available, and telephone reservations. \n27\nTable of Contents\nBalance Sheet Health\nThe Company has maintained its investment-grade rating by all three major credit agencies (Moody’s, S&P Global, and Fitch), and is one of only two major U.S. passenger airlines with an investment-grade rating by all three major credit agencies. The Company believes its strong balance sheet and focus on prudent capital deployment will support its strategic plans and initiatives. The Company intends to preserve the strength of its balance sheet with manageable debt maturities, with the goal of retaining investment-grade ratings. Finally, the Company intends to return value back to its Shareholders through dividends and share repurchases, and will continually review its return of capital program based in large part upon the Company's free cash flow and leverage, and fleet monetization strategy, with an eye to maintaining investment-grade ratings.\nOther Forms of Competition\nTechnology advancements have provided alternatives to air travel, such as videoconferencing, business communication platforms, and the Internet, and these alternatives significantly increased in scope during the COVID-19 pandemic. There is risk that the significantly increased use of these alternatives could result in permanent changes to consumer behavior and thereby negatively affect demand for air travel.\nThe airline industry is also subject to varying degrees of competition from other forms of transportation, including public charter operators and surface transportation by automobiles, buses, and trains. Inconveniences and delays associated with air travel security measures can increase surface competition. In addition, surface competition can be significant during economic downturns when consumers cut back on discretionary spending and fewer choose to fly, or when gasoline prices are lower, making surface transportation a less expensive option. Because of the relatively high percentage of short-haul travel provided by Southwest, it is particularly exposed to competition from surface transportation in these instances. \nSeasonality\nThe Company's business is ordinarily seasonal. In most markets the Company serves, demand for air travel is greater during the summer months, and, therefore, revenues in the airline industry tend to be stronger in the second (April 1 - June 30) and third (July 1 - September 30) quarters of the year than in the first (January 1 - March 31)\n and fourth (October 1 - December 31) quarters of the year. As a result, in many cases, the Company's results of operations reflect this seasonality. Factors that could alter this seasonality include, among others, the price of fuel, general economic conditions, changes in consumer behavior, governmental action, global pandemics, extreme or severe weather and natural disasters, fears of terrorism or war, or changes in the competitive environment. Therefore, the Company's quarterly operating results are not necessarily indicative of operating results for the entire year, and historical operating results in a quarterly or annual period are not necessarily indicative of future operating results.\nHuman Capital Resources\nEmployees\nAs of December 31, 2024, the Company had 72,450 active full-time equivalent Employees, consisting of 30,771 air operations (including Pilots, Flight Attendants, Dispatchers, Flight Simulator Technicians, Flight Crew Training Instructors, and Meteorologists), 21,435 ground operations (including Ramp, Operations, Provisioning, Freight Agents, and Customer Service Agents), 2,770 Customer Representatives and Source of Support Representatives, 3,756 maintenance and engineering (including Material Specialists, Mechanics, Aircraft Appearance Technicians, and Facilities Maintenance Technicians), and 13,718 additional “noncontract” Employees. The Company has consistently utilized active full-time equivalent Employees to determine various metrics that measure productivity and efficiency, so it has chosen to not include on-leave Employees in the figure, which totaled an additional 4,546 Employees as of December 31, 2024. In addition, the active full-time equivalent Employees figure includes an adjustment to count all part-time Employees as a 0.5 full-time equivalent Employee. When considering total \n28\nTable of Contents\ndemographics of Employees, however, the Company looks at total headcount, active and on-leave Employees, irrespective of part-time or full-time status. \nLabor Union Activity\nApproximately 82 percent of Company Employees as of December 31, 2024, were represented by labor unions. \nThe Railway Labor Act establishes the right of airline employees to organize and bargain collectively. Under the Railway Labor Act, collective-bargaining agreements between an airline and a labor union generally do not expire, but instead become amendable as of an agreed date. By the amendable date, if either party wishes to modify the terms of the agreement, it must notify the other party in the manner required by the Railway Labor Act and/or described in the agreement. After receipt of the notice, the parties must meet for direct negotiations. If no agreement is reached, either party may request the National Mediation Board to appoint a federal mediator. If no agreement is reached in mediation, the National Mediation Board may determine an impasse exists and offer binding arbitration to the parties. If either party rejects binding arbitration, a 30-day “cooling off” period begins. At the end of this 30-day period, the parties may engage in “self-help,” unless a Presidential Emergency Board is established to investigate and report on the dispute. The appointment of a Presidential Emergency Board maintains the “status quo” for an additional period of time. If the parties do not reach agreement during this period, the parties may then engage in “self-help.” “Self-help” includes, among other things, a strike by the union or the airline’s imposition of any or all of its proposed amendments and the hiring of new employees to replace any striking workers.\nThe following table sets forth the Company's Employee groups subject to collective bargaining and the status of their respective collective-bargaining agreements as of December 31, 2024:\n29\nTable of Contents\nEmployee Group\nApproximate Number of Full-time Equivalent Employees\nRepresentatives\nStatus of Agreement\nSouthwest Pilots\n10,548\nSouthwest Airlines Pilots' Association (“SWAPA”)\nAmendable January 2029\nSouthwest Flight Attendants\n19,518\nTransportation Workers of America, AFL-CIO, Local 556 (“TWU 556”)\nAmendable May 2028\nSouthwest Material Specialists (formerly known as Stock Clerks)\n484\nInternational Brotherhood of Teamsters, Local 19 (“IBT 19”)\nAmendable October 2026\nSouthwest Ramp, Operations, Provisioning, Freight Agents\n16,940\nTransport Workers Union Local 555 (“TWU 555”)\nAmendable March 2029\nSouthwest Flight Simulator Technicians\n53\nIBT 19\nAmendable September 2028\nSouthwest Flight Crew Training Instructors\n227\nTransportation Workers of America, AFL-CIO, Local 557 (“TWU 557”)\nAmendable January 2027\nSouthwest Dispatchers\n519\nTransportation Workers of America, AFL-CIO, Local 550 (“TWU 550”)\nAmendable June 2027\nSouthwest Aircraft Appearance Technicians\n212\nAMFA\nAmendable July 2027\nSouthwest Mechanics & Related Employees\n3,011\nAircraft Mechanics Fraternal Association (“AMFA”)\nAmendable August 2027\nSouthwest Facilities Maintenance Technicians\n49\nAMFA\nAmendable November 2027\nSouthwest Customer Service Agents, Customer Representatives, and Source of Support Representatives\n7,265\nInternational Association of Machinists and Aerospace Workers, AFL-CIO (“IAM 142”)\nAmendable December 2027\nSouthwest Meteorologists\n15\nTWU 550\nAmendable May 2028\nHuman Capital Objectives and Programs\nThe Company’s hiring, development, and retention of a talented workforce is a priority that includes: (i) providing opportunities for learning, development, career growth, and movement within the Company; (ii) evaluating compensation and benefits, and rewarding performance; (iii) investing in physical, emotional, and financial health of Employees; (iv) obtaining Employee feedback; (v) maintaining and enhancing Company culture; (vi) communicating with the Board on a routine basis on key topics, including executive succession planning; and (vii) ongoing commitments to equal employment opportunity within the workplace.\nThe Company has implemented many programs designed to achieve these priorities, including strong Employee training and benefits programs. The Company's vast Employee training and development opportunities address, among other things, leadership development; the competency of Belonging; and communication skills. The Company rewards Employees with competitive compensation and benefits packages, including attractive medical plans, the Southwest Airlines Co. Retirement Savings Plan that resulted from the merger of the Company’s former 401(k) plan having a dollar-for-dollar match for Employees other than Pilots (subject to vesting requirements and certain compensation limits) and the Company's former profitsharing plan, and a 401(k) plan with a non-elective Company contribution for Pilots. The Southwest Airlines Co. Retirement Savings Plan also has non-elective contributions for certain eligible workgroups that have negotiated such items as part of ratified collective bargaining contracts.  \n30\nTable of Contents\nThe Company encourages its People to pursue their passions by leveraging the Company’s resources to achieve their career aspirations. The Company’s Career Mobility Center offers Employees a place to explore internal career opportunities, discover new roles, or prepare for a promotion through services like career advising sessions, resume review, and interview preparation resources. The Company also provides numerous career growth and development resources to diversify skill sets, including in-person or virtual courses and mentorship programs. The Company regularly conducts Employee surveys to assess job satisfaction of its Employees and uses information from the surveys to improve the Company’s ability to attract, develop, and retain talented Employees who will help advance the Company. \nThe Company's number of active full-time equivalent Employees decreased by 3.1 percent, year-over-year, in 2024, as the Company minimized hiring in order to right-size staffing to current operations and lower costs. Since October 2022, each of the 12 union-represented workgroups, that collectively represent approximately \n82 percent\n of the Company's Employees, have ratified new contracts. \nDiversity, Equity, Inclusion & Belonging (“DEIB”)\nThe Company is committed to being an equal opportunity employer and prohibits all forms of unlawful discrimination in accordance with applicable law. DEIB is a part of the Company’s culture that not only supports its workforce but is fundamental to the Company’s efforts to support the communities that it serves. In an effort to advance these initiatives, the Company’s DEIB priorities include the following:\n•\nMaintaining a culture of Belonging through the promotion of inclusion and meaningful connections among Employees; \n•\nContinued focus on a Leadership bench diverse in skills, experience, and perspective; and\n•\nSupporting the Company’s commitment to provide all Employees with equal opportunity for learning and personal growth.\nThe Company provides regular DEIB updates to the Compensation Committee of the Board, which assists the Board with its oversight of human resources policies and practices, and has developed a multi-year training plan to support the cultural competency of the Company's workforce.\nThe Company formed an Executive Advisory Board to review and support the Company's strategies for advancing DEIB throughout the organization. The Company also works with community partners in support of expanded recruiting efforts and continued development of diverse and inclusive talent pipelines. The Company also recently launched a formal Sponsorship and Mentorship Program open to all Employees Companywide and offering opportunities to work toward shared goals. The Company's motivation is to be a healthy organization where Employees thrive, feel appreciated and valued, and have an authentic sense of Belonging.\nAdditional Information About the Company\nThe Company was incorporated in Texas in 1967. \nThe following documents are available free of charge through the Company's website, www.southwest.com: the Company’s annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports that are filed with or furnished to the SEC pursuant to Sections 13(a) or 15(d) of the Securities Exchange Act of 1934. These materials are made available through the Company's website as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC. In addition to its reports filed or furnished with the SEC, the Company publicly discloses material information from time to time in its press releases, at annual meetings of Shareholders, in publicly accessible conferences and Investor presentations, and through its website (principally in its Press Room and Investor Relations pages). References to the Company's website in this Form 10-K are provided as a convenience and do not constitute, and should not be deemed, an incorporation by reference of the information contained on, or available through, the website, and such information should not be considered part of this Form 10-K.\n31\nTable of Contents\nDISCLOSURE REGARDING FORWARD-LOOKING INFORMATION\nThis Form 10-K contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are based on, and include statements about, the Company’s estimates, expectations, beliefs, intentions, and strategies for the future, and the assumptions underlying these forward-looking statements. Specific forward-looking statements can be identified by the fact that they do not relate strictly to historical or current facts and include, without limitation, words such as “anticipates,\" “believes,” “estimates,” “expects,” “intends,” “may,” “will,” “would,” “could,” “plans,” “goal,” and similar expressions. Although management believes these forward-looking statements are reasonable as and when made, forward-looking statements are not guarantees of future performance and involve risks and uncertainties that are difficult to predict. Therefore, actual results may differ materially from what is expressed in or indicated by the Company's forward-looking statements or from historical experience or the Company's present expectations. Known material risk factors that could cause these differences are set forth below under “Risk Factors.” Additional risks or uncertainties (i) that are not currently known to the Company, (ii) that the Company currently deems to be immaterial, or (iii) that could apply to any company, could also materially adversely affect the Company's business, financial condition, or future results.\nCaution should be taken not to place undue reliance on the Company's forward-looking statements, which represent the Company's views only as of the date this Form 10-K is filed. The Company undertakes no obligation to update publicly or revise any forward-looking statement, whether as a result of new information, future events, or otherwise.",
  "item7": "Item 7\n.        \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nYEAR IN REVIEW\nThe Company had a record full year 2024 revenue performance, producing operating revenues of $27.5 billion, due to continued demand strength and the benefits from the execution of tactical actions related to initiatives announced by the Company in 2024 designed to elevate the Customer Experience on its flights, improve financial performance, and drive Shareholder value. Additional drivers included record ancillary revenue and passengers carried. \nDuring 2024, the Company continued to return value to its Shareholders. The Company returned $680 million to Shareholders through $430 million in dividend payments and $250 million through an accelerated share repurchase program entered into by the Company with a third party financial institution in fourth quarter 2024. The Company subsequently received 6.8 million shares of common stock in October 2024, representing an estimated 80 percent of the shares to be purchased by the Company under the Fourth Quarter 2024 ASR Program, and an additional one million shares in January 2025 in final settlement of the Fourth Quarter 2024 ASR Program. The number of shares that the Company ultimately repurchased under the Fourth Quarter 2024 ASR Program was determined based generally on a discount to the volume-weighted average price per share of the Company's common stock during a \n67\nTable of Contents\ncalculation period completed in January 2025. See \"Liquidity and Capital Resources\" below for further information on the Company's 2024 share repurchases. The Company has $2.25 billion remaining under its September 2024 $2.5 billion share repurchase authorization. On December 5, 2024, the Company announced its intention to launch a $750 million accelerated share repurchase program in first quarter 2025. See Part II, Item 5 for further information on the Company's share repurchase authorizations.\nThe Company recorded results for 2024 and 2023, on an accounting principles generally accepted in the United States (\"GAAP\") and non-GAAP basis, as noted in the following tables. See Note Regarding Use of Non-GAAP Financial Measures and the Reconciliation of Reported Amounts to Non-GAAP Financial Measures for additional detail regarding non-GAAP financial measures.\n(in millions, except per share amounts)\nYear ended December 31,\nGAAP\n2024\n2023\nChange\nOperating income\n$\n321 \n$\n224 \n43.3\nNet income\n$\n465 \n$\n465 \n—\nNet income per share, diluted\n$\n0.76 \n$\n0.76 \n—\n \n \n \nNon-GAAP\nOperating income\n$\n457 \n$\n893 \n(48.8)\nNet income\n$\n597 \n$\n980 \n(39.1)\nNet income per share, diluted\n$\n0.96 \n$\n1.56 \n(38.5)\nThe Company's financial results, as shown above on a GAAP and non-GAAP basis for the year ended December 31, 2024 versus the year ended December 31, 2023, were affected by higher salaries, wages, and benefits expense, partially offset by lower Fuel and oil expense, primarily driven by lower jet fuel prices. On a GAAP basis, the Company’s results for the year ended December 31, 2024, included a reversal of $116 million of breakage revenue recorded in prior years related to a portion of flight credits issued to Customers during 2022 and prior that have either been redeemed or are expected to be redeemed in future periods. The majority of these flight credits were issued during the COVID-19 pandemic as the Company was making significant changes to its flight schedules based on fluctuating demand. This adjustment was treated as a special item and excluded from the Company's presentation of non-GAAP results. On a GAAP basis, the Company's results for the year ended December 31, 2023 included incremental expense of $180 million for changes in estimate related to the contract ratification bonus for the Company's Flight Attendants as part of a tentative agreement reached in October 2023 and an incremental expense of $354 million for changes in estimate related to the contract ratification bonus for the Company's Pilots as part of a tentative agreement reached in December 2023, both of which were treated as special items and excluded from the Company's presentation of non-GAAP results. Additionally, due to the December 2022 operational disruption, as described below, the financial results on a GAAP and non-GAAP basis for the year ended December 31, 2023 included a negative financial impact of approximately $380 million on a pre-tax basis in first quarter 2023 and, on a GAAP basis, a $107 million charge on a pre-tax basis for the Department of Transportation (\"DOT\") settlement in fourth quarter 2023. See Note Regarding Use of Non-GAAP Financial Measures and the Reconciliation of Reported Amounts to Non-GAAP Financial Measures for additional detail regarding non-GAAP financial measures. \nIn late December 2022, the Company experienced a wide-scale operational disruption as extreme winter weather across a significant portion of the United States impacted its operational plan and flight schedules. This disruption and subsequent recovery efforts resulted in the cancellation of more than 16,700 flights during the period from December 21 through December 31, 2022. For first quarter 2023, these events also created a deceleration in bookings, largely isolated to January and February 2023, as well as additional expenses primarily in the form of reimbursing Customers for costs incurred as a result of the flight cancellations. The financial impact of this disruption on first quarter 2023 results was approximately $380 million on a pre-tax basis. Other than a fourth quarter 2023 charge associated with a DOT settlement of $107 million, there were no material impacts to operating \n68\nTable of Contents\nrevenues or expenses as a result of this disruption beyond first quarter 2023. See Note 1 to the Condensed Consolidated Financial Statements for further information.\nOperating Statistics\nThe Company provides the operating data below for the years ended December 31, 2024 and 2023 because these statistics are commonly used in the airline industry and, therefore, allow readers to compare the Company’s performance against its results for the prior year period, as well as against the performance of the Company’s peers. \nYear ended December 31,\n \n2024\n2023\nChange\nOperating Data:\nRevenue passengers carried (000s)\n140,023 \n137,279 \n2.0 \n%\nEnplaned passengers (000s)\n175,466 \n171,817 \n2.1 \n%\nRevenue passenger miles (RPMs) (in millions)\n(a)\n142,515 \n136,256 \n4.6 \n%\nAvailable seat miles (ASMs) (in millions)\n(b)\n177,250 \n170,323 \n4.1 \n%\nLoad factor\n(c)\n80.4 \n%\n80.0 \n%\n0.4 pts.\nAverage length of passenger haul (miles)\n1,018 \n993 \n2.5 \n%\nAverage aircraft stage length (miles)\n763 \n730 \n4.5 \n%\nTrips flown\n1,443,866 \n1,459,427 \n(1.1)\n%\nSeats flown (000s)\n(d)\n230,187 \n231,409 \n(0.5)\n%\nSeats per trip\n(e)\n159.4 \n158.6 \n0.5 \n%\nAverage passenger fare\n(k)\n$\n178.40 \n$\n172.18 \n3.6 \n%\nPassenger revenue yield per RPM (cents)\n(f)(k)\n17.53 \n17.35 \n1.0 \n%\nOperating revenues per ASM (cents)\n(g)(k)\n15.51 \n15.32 \n1.2 \n%\nPassenger revenue per ASM (cents)\n(h)(k)\n14.09 \n13.88 \n1.5 \n%\nOperating expenses per ASM (cents)\n(i)\n15.32 \n15.19 \n0.9 \n%\nOperating expenses per ASM, excluding fuel (cents)\n12.05 \n11.54 \n4.4 \n%\nOperating expenses per ASM, excluding fuel and profitsharing (cents)\n11.99 \n11.47 \n4.5 \n%\nFuel costs per gallon, including fuel tax\n$\n2.64 \n$\n2.89 \n(8.7)\n%\nFuel costs per gallon, including fuel tax, economic\n$\n2.66 \n$\n2.89 \n(8.0)\n%\nFuel consumed, in gallons (millions)\n2,194 \n2,143 \n2.4 \n%\nActive full-time equivalent Employees\n72,450 \n74,806 \n(3.1)\n%\nAircraft at end of period\n(j)\n803 \n817 \n(1.7)\n%\n(a)\nA revenue passenger mile is one paying passenger flown one mile. Also referred to as \"traffic,\" which is a measure of demand for a given period.\n(b)\nAn available seat mile is one seat (empty or full) flown one mile. Also referred to as \"capacity,\" which is a measure of the space available to carry passengers in a given period.\n(c)\nRevenue passenger miles divided by available seat miles.\n(d)\nSeats flown is calculated using total number of seats available by aircraft type multiplied by the total trips flown by the same aircraft type during a particular period.\n(e)\nSeats per trip is calculated by dividing seats flown by trips flown.\n(f)\nCalculated as passenger revenue divided by revenue passenger miles. Also referred to as \"yield,\" this is the average cost paid by a paying passenger to fly one mile, which is a measure of revenue production and fares.\n(g)\nCalculated as operating revenues divided by available seat miles. Also referred to as \"operating unit revenues\" or \"RASM,\" this is a measure of operating revenue production based on the total available seat miles flown during a particular period. \n69\nTable of Contents\n(h)\nCalculated as passenger revenue divided by available seat miles. Also referred to as \"passenger unit revenues,\" this is a measure of passenger revenue production based on the total available seat miles flown during a particular period.\n(i)\nCalculated as operating expenses divided by available seat miles. Also referred to as \"unit costs\" or \"cost per available seat mile\" or \"CASM,\" this is the average cost to fly an aircraft seat (empty or full) one mile, which is a measure of cost efficiencies.\n(j)\nIncluded three Boeing 737 Next Generation aircraft in temporary storage as of December 31, 2024. \n(k)\nThe 2024 Passenger and Operating revenue metrics include the impact of the $116 million breakage revenue adjustment recorded as a change in estimate and reduction in Passenger revenue during fourth quarter 2024. See Note 1 to the Consolidated Financial Statements for further information.\n2025 Outlook\nThe following tables provide selected financial guidance for first quarter 2025, as well as select full year 2025 guidance and 2027 targets, as applicable: \n1Q 2025 Estimation \nRASM (a), year-over-year\nUp 5% to 7%\nASMs (b), year-over-year\nDown 2% to 3%\nEconomic fuel costs per gallon (c) (d)\n$2.50 to $2.60\nFuel hedging premium expense per gallon\n$0.07\nFuel hedging cash settlement gains per gallon\n$—\nASMs per gallon (fuel efficiency)\n81 to 83\nCASM-X (e), year-over-year (c) (f)\nUp 7% to 9%\nScheduled debt repayments (millions)\n~$5\nInterest expense (millions)\n~$45\n2025 Estimation\n2027 Targets\nOperating margin, excluding special items (c) (g)\n3% to 5%\n≥ 10%\nReturn on invested capital (\"ROIC\") after-tax (h)\n \n(i)\n5% to 8%\n≥ 15%\nASMs (b), year-over-year\nUp 1% to 2%\nUp 1% to 2%\n(a) Operating revenue per available seat mile (\"RASM\" or \"unit revenues\"). \n(b) Available seat miles (\"ASMs\" or \"capacity\"). The Company currently expects second quarter 2025 capacity to increase in the range of 1 percent to 2 percent, year-over-year.\n(c) See Note Regarding Use of Non-GAAP Financial Measures for additional information on special items. In addition, information regarding special items and economic results is included in the accompanying table Reconciliation of Reported Amounts to Non-GAAP Items (also referred to as \"excluding special items\").\n(d) Based on the Company's existing fuel derivative contracts and market prices as of January 21, 2025, first quarter 2025 economic fuel costs per gallon are estimated to be in the range of $2.50 to $2.60. Economic fuel cost projections do not reflect the potential impact of special items because the Company cannot reliably predict or estimate the hedge accounting impact associated with the volatility of the energy markets, or the impact to its financial statements in future periods. Accordingly, the Company believes a reconciliation of non-GAAP financial measures to the equivalent GAAP financial measures for projected results is not meaningful or available without unreasonable effort. See Note Regarding Use of Non-GAAP Financial Measures.\n(e) Operating expenses per available seat mile, excluding fuel and oil expense, special items, and profitsharing (\"CASM-X\"). \n(f) Projections do not reflect the potential impact of fuel and oil expense, special items, and profitsharing because the Company cannot reliably predict or estimate those items or expenses or their impact to its financial statements in future periods, especially considering the significant volatility of the fuel and oil expense line item. Accordingly, the Company believes a reconciliation of non-GAAP financial measures to the equivalent GAAP financial measures for these projected results is not meaningful or available without unreasonable effort.\n(g) Operating margin, excluding special items, is calculated as operating income, excluding special items, divided by operating revenues, excluding special items. Projections and targets do not reflect the potential impact of special items because the Company cannot reliably predict or estimate those items or expenses or their impact to its financial statements in future periods. Accordingly, the Company believes reconciliation of non-GAAP financial measures to the equivalent GAAP financial measures for these projected results is not meaningful or available without unreasonable effort.\n70\nTable of Contents\n(h) See Note Regarding Use of Non-GAAP Financial Measures for additional information on ROIC. In addition, information regarding ROIC and economic results is included in the accompanying table Non-GAAP Return on Invested Capital (ROIC). Projections and targets do not reflect the potential impact of special items because the Company cannot reliably predict or estimate those items or expenses or their impact to its financial statements in future periods. Accordingly, the Company believes reconciliation of non-GAAP financial measures to the equivalent GAAP financial measures for these projected results is not meaningful or available without unreasonable effort. \n(i) The Company estimates its full year 2025 effective tax rate to be in the range of 22 percent to 24 percent.\nThe Company expects first quarter 2025 RASM to increase in the range of 5 percent to 7 percent, year-over-year. The expected year-over-year improvement is driven primarily by a focus on capacity rationalization and the Company's continued focus on the execution of its tactical initiatives. The Company also anticipates continued strength in the demand environment.\nThe Company currently expects its first quarter 2025 CASM-X to increase in the range of 7 percent to 9 percent, year-over-year, driven primarily by the continuation of inflationary pressures, including those associated with labor contracts ratified in 2024, and from capacity moderation efforts. Year-over-year unit cost trends are expected to improve throughout the year as labor comparisons ease, efficiency initiatives generate modest capacity growth, and cost plan benefits are aggressively pursued. Based on its current plan, the Company expects to exit 2025 with year-over-year CASM-X growth in the low-single digits. Improving cost performance is a key focus. The Company is urgently working to accelerate and exceed the $500 million cost initiative announced at its 2024 Investor Day to help mitigate cost inflation by minimizing hiring, optimizing scheduling efficiency, capitalizing on supply chain opportunities, and aggressively improving corporate overhead. \n \nCompany Overview\nAs part of the Company's ongoing modernization efforts, during 2024, the Company announced several new initiatives designed to elevate the Customer Experience on its flights, improve financial performance, and drive Shareholder value. As part of its ongoing focus on product evolution, the Company is moving forward with plans to assign seats, offer premium seating options, redesign the boarding model, and introduce redeye (i.e., overnight) flying. The Company has been known for its open seating model for more than 50 years, which was unique in the airline industry and has been popular with Southwest Customers for decades. Open seating served the Company well as a primarily short-haul carrier. The open seating design, combined with historically lower load factors, contributed to the efficiency of turning aircraft quickly. The Company’s low-cost model enabled low fares and, combined with great Customer Service, allowed the Company to grow across the country and eventually become the nation’s largest domestic carrier.\nHowever, as the domestic travel market has matured and structural changes have reduced the demand for short-haul travel, especially post-pandemic, the Company has increased its proportion of longer-haul flights. The importance of having an assigned seat grows among Customers as the length of flight gets longer. In addition, Customer travel frequency and preferences have evolved—for both frequent flyers, as well as those of more infrequent travelers who are not accustomed to the open seating policy currently utilized by the Company—especially as Southwest has opened several new markets and expanded its route network during the past few years. The Company has continually monitored Customer feedback regarding seating preferences for decades, and Customer travel patterns and preferences have evolved and a seat assignment is generally preferred. Recent research conducted by the Company indicates that a vast majority of both existing Southwest Customers and potential Customers prefer an assigned seat, which supports the Company’s decision to now evolve its boarding and seating processes. In addition to assigning seats, the Company plans to offer a premium, extended legroom portion of the cabin that research shows many Customers also prefer. The Company expects to offer extended legroom, in-line with that offered by industry peers on narrowbody aircraft.\nThe decision to update the seating and boarding model is part of the Company's continued modernization and Customer Experience transformation. Following a Customer study regarding the inflight experience, the Company has continued to enhance its onboard offerings during the past two years with both completed and ongoing \n71\nTable of Contents\nimprovements being made, such as faster WiFi, in-seat power, and larger overhead bins. Work is well underway on a refreshed cabin design, including new, more comfortable RECARO seats. \nThe move to assigned and premium seating will be a significant undertaking by the Company. In addition to incorporating new technologies and procedures for a seamless transition, the new cabin layout will require approvals from the FAA. The Company currently expects to make assigned seat and extended legroom bookings available in the second half of 2025, with related flights occurring in the first half of 2026. The Company also announced it is adding 24-hour operation capabilities with the introduction of redeye flights. Booking of redeye flying on initial routes became available starting July 25, 2024 through Southwest.com, with the first redeye flights scheduled on February 13, 2025 in five initial nonstop markets: Las Vegas to Baltimore and Orlando; Los Angeles to Baltimore and Nashville; and Phoenix to Baltimore.\nThese and other initiatives are designed to improve the Company’s financial performance and metrics, including return on invested capital and operating margins, over the next three years. The Company plans to continue to focus on the following tactical initiatives: Continual network optimization and maturation; Marketing and distribution evolution; and Revenue management maturation. Continual network optimization and maturation includes (i) reduced short-haul flying and redistributing resources to long-haul flying in profitable markets, (ii) reduced flying on weekdays with lower travel demand, (iii) restructured service and network connectivity in stations with lower demand, and (iv) taking a cross-functional, methodical approach to market maturation efforts. Marketing and distribution evolution includes (i) a new advertising campaign to highlight the unique, flexible value Southwest offers and target a new generation of travelers, (ii) partnerships with flight search engines, including Google Flights, Kayak, and Skyscanner intended to increase visibility and drive traffic for bookings to Southwest.com, and (iii) creating the option for Customers to use a combination of cash and Rapid Rewards® points to pay for travel, providing more ways to take advantage of the Company's loyalty program. Revenue management maturation efforts include (i) refinements to the Company's revenue management system, designed to achieve better, more customized results based on the Company's primarily domestic network, (ii) additional staffing to the Company's Revenue Management team to support focusing on driving results, and (iii) recalibrating probability curves, which are expected to improve yields by capturing more demand at higher fares.\nThe Company has also summarized recently announced strategic initiatives into three broad categories: Monetize the Company's value proposition; Increase efficiency and lower costs; and Optimize capital allocation.\nMonetize the Customer value proposition\nIn addition to the assigned seating and extended legroom changes discussed above, the Company also plans to offer an in-house vacation package product to Customers beginning in 2025 called “Getaways by Southwest”, versus the outsourced product it has historically offered. This new vacation booking platform is expected to be designed to allow the Company to appeal directly to its significant existing Customer base with an enhanced offering that includes both lodging and excursions, which is expected to drive growth with leisure travelers and grow higher-margin revenues with a relatively low capital and headcount investment. The Company also announced it will pursue partnerships with other airlines in order to further expand the reach of the Company’s network and connect Customers with more global destinations to generate additional demand. The Company launched its first such partnership in first quarter 2025 with transatlantic connectivity with Icelandair and plans to add at least one more partner during 2025.\nIncrease efficiency and lower costs\nIn addition to the aforementioned introduction of redeye flights, which is designed to maximize or increase asset utilization, another one of the Company's efficiency initiatives includes investments that will decrease the amount of time it takes to turn an aircraft (unload Passengers from an arriving flight and load Passengers on the same aircraft for its subsequent flight). Examples of such investments include moving to a fully digital (i.e., paperless) process, improved communication tools for Employees, and better visual and real-time information to assist both Customers and Employees. These efforts are rolling out and are expected to be fully implemented in November 2025. These initiatives are expected to result in a lowering of unit costs, as the Company is expected to be able to generate either the same number of ASMs with fewer aircraft, or produce more ASMs utilizing the same number of aircraft in its \n72\nTable of Contents\nfleet, respectively. The Company also continues to invest in various technologies and digital products designed to improve the Customer travel experience. In addition, the Company is targeting other cost initiatives that are expected to result in savings, including minimizing hiring in order to right-size staffing to current operations and match the Company’s lower expected growth rates in the near term, capitalizing on identified supply chain opportunities, and improving its corporate efficiency through automation and better allocation of resources. These and other initiatives are currently expected to deliver more than $500 million in annual cost savings by 2027. \n \nOptimize capital allocation\nIn addition, the Company intends to focus on prudent capital deployment by minimizing fleet capital expenditures, continuing to invest in infrastructure, managing debt levels, and providing returns to Shareholders through dividends and share repurchases. The Company continues to have favorable pricing in its order book with Boeing for new 737 MAX aircraft that allows additional flexibility in being able to replace certain aircraft in its existing fleet, given current market conditions, with more fuel efficient and less-maintenance intensive models over the near term. The Company has pursued, and plans to continue to pursue, opportunities to take advantage of current market conditions through the sale and/or sale-leaseback of certain aircraft, with the intention of replacing most, if not all, of such aircraft with new MAX aircraft from Boeing by the end of 2031, assuming that Boeing is able to meet aircraft delivery expectations. As a result of these efforts, the Company’s expected net fleet capital expenditures during the near term are expected to moderate significantly from recent levels, with the added benefit of further accelerating the modernization of its fleet. The Company also intends to preserve the strength of its balance sheet with manageable debt maturities, with the goal of retaining investment-grade ratings. Finally, the Company intends to return  value back to its Shareholders through dividends and share repurchases and will continually review its return of capital program based in large part upon the Company's free cash flow and leverage, and fleet monetization strategy, taking into account potential impacts to its investment grade ratings.\nThrough these initiatives, the Company expects to return to historical levels of financial performance in which its return on invested capital exceeds its weighted-average cost of capital. The targets the Company has set through 2027 include the following:\n•\nAnnual capacity growth in the range of one to two percent, year-over-year, beginning in 2025\n•\nAnnual Operating margins of at least 10 percent, in 2027\n•\nFree cash flow exceeding $1 billion per year in 2027\n•\nReturn on invested capital, after-tax, of at least 15 percent in 2027\n•\nFinancial leverage in the low to mid 30’s percent range in 2027\n•\nContinue to maintain an investment-grade credit rating \nThe Company's Board of Directors (“the Board”) received a letter dated June 10, 2024, from Elliott Investment Management L.P. (\"Elliott\") stating that Elliott had made an investment of approximately $1.9 billion in the Company, representing an approximately 11 percent economic interest in the Company, and advocating for changes to the Company's management, the Board, and the Company's corporate strategy. On October 23, 2024 (the \"Effective Date\"), the Company entered into a Cooperation Agreement (the \"Cooperation Agreement\") with Elliott, Elliott Associates, L.P., Elliott International, L.P., and The Liverpool Limited Partnership. Pursuant to the Cooperation Agreement, the Company agreed to, among other things, (i) appoint David Cush, Sarah Feinberg, David Grissen, Gregg Saretsky and Patricia Watson (collectively, the “Cooperation Agreement Directors”) to the Board, effective 11:59 p.m. Central Time on November 1, 2024, each with an initial term expiring at the 2025 Annual Meeting; (ii) announce that two incumbent Directors as of the Effective Date will not stand for re-election to the Board at the 2025 Annual Meeting; and (iii) include the Cooperation Agreement Directors, together with the other persons recommended by the Board, in the Company’s slate of nominees for election as a Director at the 2025 Annual Meeting. On July 7, 2024, the Board appointed Rakesh Gangwal to the Board, and on September 26, 2024, the Company announced the addition of Robert L. Fornaro to the Board. \nPursuant to the Cooperation Agreement, effective 11:59 p.m. Central Time on November 1, 2024, Gary C. Kelly, Executive Chairman of the Board, David W. Biegler, J. Veronica Biggins, Roy Blunt, William H. Cunningham, Thomas W. Gilligan, and Jill A. Soltau each resigned from the Board. None of the departures were due to any disagreement with the Company on any matter relating to the Company’s operations, policies, or practices. \n73\nTable of Contents\nAdditionally, the Board appointed Pierre Breber as a member of the Board, effective 11:59 p.m. Central Time on November 1, 2024, with an initial term expiring at the 2025 Annual Meeting. On November 4, 2024, the Company announced the appointment of Rakesh Gangwal as independent Chair of the Board and named new Board Committee Chairs.\nThe Cooperation Agreement includes certain voting commitments, customary standstill restrictions, and mutual non-disparagement provisions that remain in place until the earlier of (x) the date that is 30 days prior to the notice deadline under the Company's Fourth Amended and Restated Bylaws for the nomination of non-proxy access Director candidates for election to the Board at the Company's 2026 Annual Meeting of Shareholders and (y) February 14, 2026 (such period, the \"Cooperation Period\"). The foregoing description of the Cooperation Agreement does not purport to be complete and is qualified in its entirety by reference to the full text of the Cooperation Agreement, which is filed as Exhibit 10.31 to this Form 10-K.\nBecause of this activist activity, the Company has incurred increased professional advisory fees and other costs related to Shareholder activism matters.\nAdditionally, in order to provide the Board with time to make informed decisions in the best interests of the Company and its Shareholders, on July 2, 2024, the Board adopted a shareholder rights plan (the \"Rights Agreement\") and declared a dividend of one right in respect of each of the Company’s issued and outstanding shares of common stock (the “Rights”), which would have caused substantial dilution to any person or group acquiring 12.5 percent or more of the Company’s outstanding common stock without the prior approval of the Board. The Rights Agreement was designed to deter the acquisition of actual, de facto, or negative control of the Company by any person or group without appropriately compensating its Shareholders for that control. On October 25, 2024, pursuant to the Cooperation Agreement, the Company and Equiniti Trust Company, LLC entered into the Amendment to the Rights Agreement, which amended and terminated the Rights Agreement by advancing the expiration time of the Rights to 5:00 p.m., New York City time, on October 25, 2024. At the time of the termination of the Rights Agreement, all of the Rights, which were previously distributed to holders of the Company’s Common Stock, pursuant to the Rights Agreement, expired.\nIn January 2025, the Company reached an amended co-brand agreement with Chase Bank USA, N.A. (\"Chase\"). The amendment includes enhanced Cardmember benefits associated with the Company's assigned and premium seating initiative and supports the multi-year financial targets announced at the Company's Investor Day in September 2024.\nDuring 2024, as a result of Boeing's ongoing delivery delays, the Company conservatively re-planned its capacity and delivery expectations for both 2024 and 2025. The Company will continue to closely monitor the ongoing aircraft delivery delays with Boeing and adjust expectations as needed.\nThe Company ended 2024 with 803 Boeing 737 aircraft, including 245 Boeing 737-8 (\"-8\") aircraft. During 2024, the Company retired 34  Boeing 737-700 (\"-700\") aircraft and two Boeing 737-800 (\"-800\") aircraft and took delivery of 22 -8 aircraft. The Company also completed the sale-leaseback of 35 -800 aircraft in December 2024, and completed the sale-leaseback of an additional -800 aircraft in late January 2025. The Company's order book with Boeing as of January 30, 2025, consists of a total of 496 MAX firm orders (300 Boeing 737-7 (\"-7\") aircraft and 196 -8 aircraft) for the years 2025 through 2031, including 63 MAX aircraft that were contractually committed for 2024, but were not received, and 176 MAX options (-7s or -8s) for the years 2026 through 2031. The Company is currently using a planning assumption of 38 -8 aircraft deliveries in 2025, which differs from its contractual order book, as Boeing continues to ramp up production and works to certify the -7. This planning assumption supports the Company's plans to retire approximately 51 aircraft in 2025, including 49 -700s and two -800s, ending 2025 with roughly 790 aircraft in its fleet. Based on recent discussions, the Company is optimistic that Boeing can exceed 38 aircraft deliveries in 2025, and plans to use any additional aircraft deliveries to support its fleet monetization and capital allocation strategies. The Company's aircraft delivery and retirement expectations for 2025 and beyond are fluid and subject to Boeing's production capability.\n74\nTable of Contents\nThe Company has published its flight schedule through October 1, 2025. The Company continues to focus on its goals of operational excellence and reliability, regaining efficiencies, increasing productivity, and returning financial margins back to historical levels.\nFor the year ended December 31, 2024, the Company ended with approximately 72,450 full-time equivalent Employees, which was a reduction of 2,356 full-time equivalent Employees versus year-end 2023. The Company's number of active full-time equivalent Employees decreased primarily through controlled hiring, attrition, and offering voluntary time off programs in order to right-size staffing to current operations and achieve labor cost stability.\nAs part of its commitment to corporate sustainability, the Company published its 2023 One Report on May 8, 2024. The report describes the Company's sustainability strategies, which include the Company’s fuel conservation and emissions mitigation initiatives and other efforts to minimize greenhouse gas emissions and address other environmental matters such as energy and water conservation, waste minimization, and recycling. Information contained in the Southwest One Report as published from time to time is not incorporated by reference into, and does not constitute a part of, this Form 10-K. While the Company believes that the disclosures contained in the Southwest One Report and other voluntary disclosures regarding environmental, social, and governance (“ESG”) matters are responsive to various areas of investor interest, the Company believes that certain of these disclosures address matters that are currently not material to the Company’s near-term operations, strategy, financial condition, or financial results, although this view may change in the future based on new information that could materially alter the estimates, assumptions, or timelines used to create these disclosures. Given the estimates, assumptions, and timelines used to create the Southwest One Report and other voluntary disclosures, the materiality of these disclosures is inherently difficult to assess.\n75\nTable of Contents\n2024 Compared with 2023 \nThe selected financial data presented below is derived from the Company's Consolidated Statement of Income and should be read in conjunction with those financial statements and the related notes thereto.\n \nYear ended December 31,\nIncrease (Decrease)\nPercent change\n(in millions)\n2024\n2023\nPassenger\n$\n24,980 \n$\n23,637 \n$\n1,343 \n5.7 \nFreight\n175 \n175 \n— \n— \nOther\n2,328 \n2,279 \n49 \n2.2 \n      Total operating revenues\n$\n27,483 \n$\n26,091 \n$\n1,392 \n5.3 \nSalaries, wages, and benefits\n$\n12,240 \n$\n11,152 \n$\n1,088 \n9.8 \nFuel and oil\n5,812 \n6,217 \n(405)\n(6.5)\nMaintenance materials and repairs\n1,353 \n1,188 \n165 \n13.9 \nLanding fees and airport rentals\n1,962 \n1,789 \n173 \n9.7 \nDepreciation and amortization\n1,657 \n1,522 \n135 \n8.9 \nOther operating expenses\n4,138 \n3,999 \n139 \n3.5 \n      Total operating expenses\n$\n27,162 \n$\n25,867 \n$\n1,295 \n5.0 \nOperating Revenues\nPassenger revenues for 2024 increased by $1.3 billion, or 5.7 percent, compared with 2023, to achieve an all-time full year Company record of $25.0 billion. On a unit basis, Passenger revenues increased 1.5 percent, year-over-year. The dollar increase was primarily due to a 4.1 percent increase in capacity and continued demand strength, combined with strong operational performance and completion factor throughout 2024 versus 2023. For 2024, the year-over-year Passenger revenue yield per ASM increase was primarily driven by strong domestic demand and the realization of benefits from the Company’s execution of tactical actions, such as improving network optimization and capacity rationalization, marketing and distribution evolution, and continued efforts to advance revenue management techniques, particularly during the second half of the year.\nOther revenues for 2024 increased by $49 million, or 2.2 percent, compared with 2023. On a dollar basis, the increase was primarily driven by improved retail spend on the Company's co-brand credit cards.\nOperating Expenses\nOperating expenses for 2024 increased by $1.3 billion, or 5.0 percent, compared with 2023, and capacity increased 4.1 percent over the same prior year period. A majority of the operating expenses increase was due to higher Salaries, wages, and benefits expense, partially offset by lower Fuel and oil expense. Historically, except for changes in the price of fuel, changes in Operating expenses for airlines have been largely driven by changes in capacity, or ASMs. The following table presents the Company's Operating expenses per ASM for 2024 and 2023, followed by explanations of these changes on a dollar basis. \n76\nTable of Contents\n \nYear ended December 31,\nPer ASM\nPercent\n(in cents, except for percentages)\n2024\n2023\nchange\nchange\nSalaries, wages, and benefits\n6.91 \n¢\n6.55 \n¢\n0.36 \n¢\n5.5 \n%\nFuel and oil\n3.27 \n3.65 \n(0.38)\n(10.4)\nMaintenance materials and repairs\n0.76 \n0.70 \n0.06 \n8.6 \nLanding fees and airport rentals\n1.11 \n1.05 \n0.06 \n5.7 \nDepreciation and amortization\n0.93 \n0.89 \n0.04 \n4.5 \nOther operating expenses\n2.34 \n2.35 \n(0.01)\n(0.4)\nTotal\n15.32 \n¢\n15.19 \n¢\n0.13 \n¢\n0.9 \n%\nOperating expenses per ASM for 2024 increased by 0.9 percent, compared with 2023. The majority of the year-over-year unit cost increase was driven by higher Salaries, wages, and benefits expense. This was despite the prior year including incremental expense of $180 million in 2023 for changes in estimate related to the contract ratification bonus for the Company's Flight Attendants as part of a tentative agreement reached in October 2023 and an incremental expense of $354 million in 2023 for changes in estimate related to the contract ratification bonus for the Company's Pilots as part of a tentative agreement reached in December 2023. This increase was mostly offset by the decrease in the Company's fuel cost per gallon. Operating expenses per ASM for 2024, excluding Fuel and oil expense, profitsharing, and special items (a non-GAAP financial measure), increased 7.8 percent, year-over-year. See Note Regarding Use of Non-GAAP Financial Measures and the Reconciliation of Reported Amounts to Non-GAAP Financial Measures for additional detail regarding non-GAAP financial measures.\nSalaries, wages, and benefits expense for 2024 increased by $1.1 billion, or 9.8 percent, compared with 2023. On a per ASM basis, Salaries, wages, and benefits expense for 2024 increased 5.5 percent, compared with 2023. On a dollar basis, the majority of the increase was due to net step/pay rate increases for certain workgroups (including the ratified labor contracts with the Company's Pilots, Flight Attendants, and Ramp, Operations, Provisioning, and Cargo Agents), and the remainder of the increase was primarily due to various other benefits, including health care coverage and other benefits associated with higher pay rates.\nOn January 22, 2024, the Company's nearly 11,000 Pilots, represented by Southwest Airlines Pilots Association (\"SWAPA\"), voted to ratify a five-year contract extension with the Company. The newly ratified agreement becomes amendable in January 2029.\nOn March 21, 2024, the Company's nearly 18,000 Ramp, Operations, Provisioning, and Cargo Agents, represented by the Transport Workers Union Local 555 (\"TWU 555\"), voted to ratify a five-year contract extension with the Company. The newly ratified agreement becomes amendable in March 2029.\nOn April 24, 2024, the Company's nearly 20,000 Flight Attendants, represented by the Transport Workers of America Union Local 556 (\"TWU 556\"), voted to ratify a four-year contract extension with the Company. The newly ratified agreement becomes amendable in May 2028.\nOn September 16, 2024, the Company announced its more than 50 Flight Simulator Technicians, represented by the International Brotherhood of Teamsters, had voted to ratify a four-year contract extension with the Company. The newly ratified agreement becomes amendable in September 2028. With this result, as of December 2024, all the Company's collective bargaining labor contracts subject to Section 6 of the Railway Labor Act are closed until October 2026 when the next labor contract becomes amendable. Since October 2022, each of the 12 union-represented workgroups, which collectively represent approximately 82 percent of the Company's Employees, have ratified new contracts.\nFuel and oil expense for 2024 decreased by $405 million, or 6.5 percent, compared with 2023. On a per ASM basis, Fuel and oil expense for 2024 decreased 10.4 percent. On a dollar basis, the decrease was primarily attributable to a decrease in fuel prices, partially offset by an increase in fuel gallons consumed. The Company's 2024 average economic fuel cost of $2.66 per gallon is net of approximately $53 million in cash settlements from hedging \n77\nTable of Contents\nactivities compared with an average economic fuel cost of $2.89 per gallon, which was net of approximately $267 million in cash settlements from hedging activities in 2023. On a per ASM basis, the majority of the change was due to lower jet fuel prices. The following table provides more information on the Company's economic fuel cost per gallon, including the impact of fuel hedging premium expense and fuel derivative contracts: \nYear ended December 31,\n2024\n2023\nEconomic fuel costs per gallon\n$\n2.66 \n$\n2.89 \nFuel hedging premium expense (in millions)\n$\n157 \n$\n121 \nFuel hedging cash settlement gain (in millions)\n$\n53 \n$\n267 \nFuel hedging premium expense per gallon\n$\n0.07 \n$\n0.06 \nFuel hedging cash settlement gains per gallon\n$\n0.03 \n$\n0.12 \nSee Note Regarding Use of Non-GAAP Financial Measures and the Reconciliation of Reported Amounts to Non-GAAP Financial Measures for additional detail regarding non-GAAP financial measures. \nThe Company's 2024 available seat miles per gallon (\"fuel efficiency\") improved 1.6 percent, year-over-year, due to operating more -8 aircraft, the Company's most fuel-efficient aircraft, as a percentage of its fleet. The continued deliveries of MAX aircraft are expected to remain critical to the Company's efforts to modernize its fleet, reduce carbon emissions intensity, and achieve its near-term environmental sustainability goals. \nAs of December 31, 2024, the Company has fuel derivative contracts in place through 2027. Based on the current geopolitical and market dynamics, higher premium costs over time, and aggressive cost reductions underway, the Company does not intend to add new hedging positions to its current hedge book. The Company is providing its maximum percentage of estimated fuel consumption covered by fuel derivative contracts in the following table:\nPeriod\nMaximum fuel hedged percentage (a)(b)\n2025\n47%\n2026\n43%\n2027\n13%\n(a) Based on the Company's current available seat mile plans. The Company is currently \n51 percent\n hedged in first quarter 2025, \n45 percent\n hedged in second quarter 2025, and \n46 percent\n hedged in second half 2025.\n(b) The Company's maximum fuel hedged percentage is calculated using the maximum number of gallons that are covered by derivative contracts divided by the Company's estimate of total fuel gallons to be consumed for each respective period. The Company's maximum number of gallons that are covered by derivative contracts may be at different strike prices and at strike prices materially higher than the current market prices. The volume of gallons covered by derivative contracts that ultimately get exercised in any given period may vary significantly from the volumes used to calculate the Company's maximum fuel hedged percentages, as market prices and the Company's fuel consumption fluctuate.\nAs a result of applying hedge accounting in prior periods, the Company has amounts in Accumulated other comprehensive income (\"AOCI\") that will be recognized in earnings in future periods when the underlying fuel derivative contracts settle. The following table displays the Company's estimated fair value of remaining fuel derivative contracts (not considering the impact of the cash collateral provided to or received from counterparties - see Note 10 to the Consolidated Financial Statements for further information), as well as the deferred amounts in AOCI as of December 31, 2024, and the expected future periods in which these items are expected to settle and/or be recognized in earnings (in millions):\n78\nTable of Contents\nYear\nFair value of fuel\nderivative contracts\nat December 31, 2024\nAmount of gains (losses) deferred\nin AOCI at December 31,\n2024 (net of tax)\n2025\n$\n22 \n$\n(96)\n2026\n72 \n(49)\n2027\n36 \n(3)\nTotal\n$\n130 \n$\n(148)\nThe Company's current fuel derivative contracts contain instruments based in Brent crude oil. The economic fuel price per gallon sensitivities provided in the table below assume the relationship between Brent crude oil and refined products based on market prices as of January 21, 2025.\nEstimated economic fuel price per gallon, \nincluding taxes and fuel hedging premiums (b)\nAverage Brent Crude Oil\nprice per barrel\nFirst Quarter 2025\nFull Year 2025\n$60\n$2.05 to $2.15\n$2.00 to $2.10\n$70\n$2.35 to $2.45\n$2.30 to $2.40\nCurrent market (a)\n$2.50 to $2.60\n$2.45 to $2.55\n$80\n$2.65 to $2.75\n$2.65 to $2.75\n$90\n$3.00 to $3.10\n$2.95 to $3.05\n$100\n$3.20 to $3.30\n$3.20 to $3.30\nFair market value of \nfuel derivative contracts settling in period\n$1 million\n$23 million\nEstimated premium costs\n$37 million\n$148 million\n(a) Brent crude oil average market prices as of January 21, 2025, were $78 and $76 per barrel for first quarter and full year 2025, respectively.\n(b) Based on the Company's existing fuel derivative contracts and market prices as of January 21, 2025, first quarter and full year 2025 economic fuel costs per gallon are estimated to be in the range of $2.50 to $2.60 and $2.45 to $2.55, respectively. Economic fuel cost projections do not reflect the potential impact of special items because the Company cannot reliably predict or estimate the hedge accounting impact associated with the volatility of the energy markets, or the impact to its financial statements in future periods. Accordingly, the Company believes a reconciliation of non-GAAP financial measures to the equivalent GAAP financial measures for projected results is not meaningful or available without unreasonable effort. See Note Regarding Use of Non-GAAP Financial Measures.\nMaintenance materials and repairs expense for 2024 increased by $165 million, or 13.9 percent, compared with 2023. On a per ASM basis, Maintenance materials and repairs expense increased 8.6 percent, compared with 2023. On a dollar and per ASM basis, approximately 50 percent of the increase was primarily due to increases in engine shop visits and other engine expenses for the Company's -700 and -800 fleet, approximately 20 percent of the increase was driven by airframe repairs due to a higher average cost per event and the timing of regular maintenance events, and approximately 15 percent of the increase was due to bulk purchases of materials for the Company's seat refurbishment efforts on its entire fleet.\nLanding fees and airport rentals expense for 2024 increased by $173 million, or 9.7 percent, compared with 2023. On a per ASM basis, Landing fees and airport rentals expense increased 5.7 percent, compared with 2023. On a dollar and per ASM basis, the increase was primarily attributable to an increase in airport rental expense and higher landing fees throughout the network driven by higher rates charged by airports, partially offset by more favorable settlements and credits from various airports received in 2024.\nDepreciation and amortization expense for 2024 increased by $135 million, or 8.9 percent, compared with 2023. On a per ASM basis, Depreciation and amortization expense increased by 4.5 percent, compared with 2023. On a dollar and per ASM basis, approximately 55 percent of the increase was primarily due to the acquisition of 22 -8 aircraft \n79\nTable of Contents\nsince fourth quarter 2023 and approximately 45 percent of the increase was due to accelerating the depreciation for certain -700 aircraft planned for early retirement in 2024 and 2025. See Note 1 for further information on early retirement dates and the corresponding impact to depreciation expense.\nOther operating expenses for 2024 increased by $139 million, or 3.5 percent, compared with 2023. Included within this line item was aircraft rentals expense in the amount of $220 million and $198 million for 2024 and 2023, respectively. On a per ASM basis, Other operating expenses decreased 0.4 percent, compared with 2023. On a dollar basis, the increase was due to (i) approximately $80 million in higher advertising expense, (ii) approximately $60 million in higher maintenance agreement expense driven by expanded cloud-based services, (iii) approximately $57 million in higher professional fees, primarily driven by an increase in spend on technology enhancements and replacement projects, and (iv) approximately $47 million in higher per diem rates paid to Flight crews, primarily driven by the new Pilot and Flight Attendant ratified agreements. These increases were partially offset due to (i) recording the $107 million DOT settlement in December 2023 and (ii) a $92 million gain on a sale-leaseback transaction involving 35 -800 aircraft during 2024. See Note 7 for further information.\nNon-Operating Expenses (Income)\nInterest expense for 2024 decreased by $10 million, or 3.9 percent, compared with 2023, primarily due to prepaying the 5.25% senior unsecured notes due May 2025 in December 2024.\nCapitalized interest for 2024 increased by $12 million, or 52.2 percent, compared with 2023, primarily due to an increase in various technology projects, facilities projects, and aircraft under construction.\nInterest income for 2024 decreased by $86 million, or 14.8 percent\n \ncompared with 2023, primarily due to lower cash and investment balances and a lower interest rate in the total investment portfolio.\nOther (gains) losses, net, primarily includes amounts recorded as a result of the Company's deferred compensation and hedging activities. See Note 10 to the Consolidated Financial Statements for further information on the Company's hedging activities. The following table displays the components of Other (gains) losses, net, for 2024 and 2023: \nYear ended December 31, \n(in millions)\n2024\n2023\nMark-to-market impact from fuel contracts settling in current period\n$\n34 \n$\n(17)\nPremium cost of fuel contracts not designated as hedges\n9 \n— \nUnrealized mark-to-market adjustment on available for sale securities\n— \n(4)\nMark-to-market impact on deferred compensation plan investments\n(36)\n(39)\nOther\n(3)\n(2)\n \n$\n4 \n$\n(62)\nIncome Taxes\nThe Company's annual 2024 effective tax rate was 22.2 percent, compared with 26.5 percent in 2023. The year-over-year decrease in the tax rate is primarily due to the DOT settlement, which was treated as a disallowed tax deduction in 2023.\n2023 Compared with 2022\nThe Company's comparison of 2023 results to 2022 results is included in the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, under Part II Item 7, Management's Discussion and Analysis of Financial Condition and Results of Operations.\n80\nTable of Contents\nReconciliation of Reported Amounts to Non-GAAP Financial Measures (excluding special items) (unaudited) (in millions, except per share amounts and per ASM amounts)\nYear ended December 31,\nPercent\n \n2024\n2023\nChange\nFuel and oil expense, unhedged\n$\n5,750 \n$\n6,346 \nAdd: Premium cost of fuel contracts designated as hedges\n148 \n121 \nDeduct: Fuel hedge gains included in Fuel and oil expense, net\n(86)\n(250)\nFuel and oil expense, as reported\n$\n5,812 \n$\n6,217 \nAdd (Deduct): Fuel hedge contracts settling in the current period, but for which (gains) losses were reclassified from AOCI (a)\n34 \n(16)\nAdd: Premium cost of fuel contracts not designated as hedges\n9 \n— \nFuel and oil expense, excluding special items (economic)\n$\n5,855 \n$\n6,201 \n(5.6)\n%\nTotal operating expenses, as reported\n$\n27,162 \n$\n25,867 \nDeduct: Voluntary Employee programs\n(5)\n— \nDeduct: Labor contract adjustment (b)\n(9)\n(180)\nDeduct: SWAPA Labor contract adjustment (c)\n— \n(354)\nAdd (Deduct): Fuel hedge contracts settling in the current period, but for which (gains) losses were reclassified from AOCI (a)\n34 \n(16)\nAdd: Premium cost of fuel contracts not designated as hedges\n9 \n— \nDeduct: DOT settlement\n— \n(107)\nDeduct: Litigation settlements\n(7)\n(12)\nDeduct: Professional advisory fees\n(37)\n— \nDeduct: Transformation costs\n(5)\n— \nTotal operating expenses, excluding special items\n$\n27,142 \n$\n25,198 \n7.7 \n%\nDeduct: Fuel and oil expense, excluding special items (economic)\n(5,855)\n(6,201)\nOperating expenses, excluding Fuel and oil expense and special items\n$\n21,287 \n$\n18,997 \n12.1 \n%\nDeduct: Profitsharing expense\n(103)\n(110)\nOperating expenses, excluding Fuel and oil expense, special items, and profitsharing\n$\n21,184 \n$\n18,887 \n12.2 \n%\nOperating income, as reported\n$\n321 \n$\n224 \nAdd: Breakage revenue adjustment (d)\n116 \n— \nAdd: Voluntary Employee programs\n5 \n— \nAdd: Labor contract adjustment (b)\n9 \n180 \nAdd: SWAPA contract adjustment (c)\n— \n354 \nAdd (Deduct): Fuel hedge contracts settling in the current period, but for which (gains) losses were reclassified from AOCI (a)\n(34)\n16 \nDeduct: Premium cost of fuel contracts not designated as hedges\n(9)\n— \nAdd: DOT settlement\n— \n107 \nAdd: Litigation settlements\n7 \n12 \nAdd: Professional advisory fees\n37 \n— \nAdd: Transformation costs\n5 \n— \nOperating income, excluding special items\n$\n457 \n$\n893 \n(48.8)\n%\nOther (gains) losses, net, as reported\n$\n4 \n$\n(62)\nAdd (Deduct): Mark-to-market impact from fuel contracts settling in current periods (a)\n(34)\n17 \nDeduct: Premium cost of fuel contracts not designated as hedges\n(9)\n— \nAdd: Unrealized mark-to-market adjustment on available for sale securities\n— \n4 \nOther gains, net, excluding special items\n$\n(39)\n$\n(41)\n(4.9)\n%\nIncome before income taxes, as reported\n$\n598 \n$\n633 \nAdd: Breakage revenue adjustment (d)\n116 \n— \nAdd: Voluntary Employee programs\n5 \n— \nAdd: Labor contract adjustment (b)\n9 \n180 \nAdd: SWAPA contract adjustment (c)\n— \n354 \nAdd (Deduct): Fuel hedge contracts settling in the current period, but for which (gains) losses were reclassified from AOCI (a)\n(34)\n16 \nAdd (Deduct): Mark-to-market impact from fuel contracts settling in current periods (a)\n34 \n(17)\nDeduct: Unrealized mark-to-market adjustment on available for sale securities\n— \n(4)\nAdd: DOT settlement\n— \n107 \nAdd: Litigation settlements\n7 \n12 \nAdd: Professional advisory fees\n37 \n— \nAdd: Transformation costs\n5 \n— \nIncome before income taxes, excluding special items\n$\n777 \n$\n1,281 \n(39.3)\n%\nProvision for income taxes, as reported\n$\n133 \n$\n168 \nAdd: Net income tax impact of fuel and special items (e)\n47 \n133 \nProvision for income taxes, net, excluding special items\n$\n180 \n$\n301 \n(40.2)\n%\nNet income, as reported\n$\n465 \n$\n465 \nAdd: Breakage revenue adjustment (d)\n116 \n— \nAdd: Voluntary Employee programs\n5 \n— \nAdd: Labor contract adjustment (b)\n9 \n180 \nAdd: SWAPA contract adjustment (c)\n— \n354 \nAdd (Deduct): Fuel hedge contracts settling in the current period, but for which (gains) losses were reclassified from AOCI (a)\n(34)\n16 \nAdd (Deduct): Mark-to-market impact from fuel contracts settling in current periods (a)\n34 \n(17)\nDeduct: Unrealized mark-to-market adjustment on available for sale securities\n— \n(4)\nAdd: DOT settlement\n— \n107 \nAdd: Litigation settlements\n7 \n12 \nAdd: Professional advisory fees\n37 \n— \nAdd: Transformation costs\n5 \n— \nDeduct: Net income tax impact of special items (e) \n(47)\n(133)\nNet income, excluding special items\n$\n597 \n$\n980 \n(39.1)\n%\nNet income per share, diluted, as reported\n$\n0.76 \n$\n0.76 \nAdd: Impact of special items\n0.27 \n1.01 \nDeduct: Net income tax impact of special items (e)\n(0.07)\n(0.21)\nNet income per share, diluted, excluding special items\n$\n0.96 \n$\n1.56 \n(38.5)\n%\nOperating expenses per ASM (cents), as reported\n15.32 \n¢\n15.19 \n¢\nDeduct: Impact of special items\n(0.04)\n(0.38)\nDeduct: Fuel and oil expense divided by ASMs\n(3.27)\n(3.65)\nDeduct: Profitsharing expense divided by ASMs\n(0.06)\n(0.07)\nOperating expenses per ASM, excluding Fuel and oil expense, profitsharing, and special items (cents)\n11.95 \n¢\n11.09 \n¢\n7.8 \n%\n(a) See Note 10 to Consolidated Financial Statements for further information. \n(b) 2024 amounts represent changes in estimate related to the contract ratification bonuses for the Company's Ramp, Operations, Provisioning, & Cargo Agents as part of the tentative agreement ratified in March 2024 with TWU 555. 2023 amounts represent changes in estimate related to the contract ratification bonus for the Company’s Flight Attendants as part of the tentative agreement reached in October 2023 with TWU 556. The Company began accruing for all of its open labor contracts on April 1, 2022, and this incremental $180 million expense extends the timeframe covered by the ratification bonus to the date the Flight Attendant contract became amendable on November 1, 2018, to compensate for missed wage increases over that time period. The Company’s consolidated financial statements for the year ended December 31, 2023 included market rate wage accruals for all workgroups with open collective bargaining agreements. See the Note Regarding Use of Non-GAAP Financial Measures for further information.\n(c) Represents changes in estimate related to the contract ratification bonus for the Company’s Pilots as part of the tentative agreement reached in December 2023 with SWAPA. The Company began accruing for all of its open labor contracts on April 1, 2022, and this incremental $354 million expense represented an increase in retroactive pay associated with wage rates for purposes of calculating the ratification bonus agreed to for Pilots for periods prior to 2023. See the Note Regarding Use of Non-GAAP Financial Measures for further information.\n(d) Represents a change in breakage revenue estimate related to flight credits the Company issued to Passengers during 2022 and prior. On July 28, 2022, the Company modified its policy and announced that all unexpired flight credits as of that date, including a significant volume of such credits issued to impacted Customers during the COVID-19 pandemic as the Company was making significant changes to its schedules based on fluctuating demand, will no longer have an expiration date and thus will be able to be redeemed by Customers indefinitely. This change in policy was considered a contract modification under ASC 606, Revenue from Contracts with Customers, and the Company accounted for such change prospectively in third quarter 2022. At that time, based on historical Customer behavior, the Company estimated that redemptions of these flight credits would have been reduced to an immaterial amount during 2024 and recognized breakage revenue in prior periods for these flight credits accordingly; however, based on actual Customer redemptions throughout 2024, as well as currently projected redemptions beyond 2024, the Company determined a reversal of a portion of this prior breakage revenue was warranted in the current period. This adjustment is not reflective of base business revenue trends in fourth quarter 2024 or beyond. See the Note Regarding Use of Non-GAAP Financial Measures for further information.\n(e) Tax amounts for each individual special item are calculated at the Company's effective rate for the applicable period and totaled in this line item.\n81\nTable of Contents\nNon-GAAP Return on Invested Capital (ROIC) (in millions) (unaudited)\nYear Ended\nYear Ended\nDecember 31, 2024\nDecember 31, 2023\nOperating income, as reported\n$\n321 \n$\n224 \nBreakage revenue adjustment\n116 \n— \nVoluntary Employee programs\n5 \n— \nTWU 555 contract adjustment\n9 \n— \nTWU 556 contract adjustment\n— \n180 \nSWAPA contract adjustment\n— \n354 \nNet impact from fuel contracts\n(34)\n16 \nPremium benefit of fuel contracts not designated as hedges\n(9)\nProfessional advisory fees\n37 \n— \nTransformation costs\n5 \n— \nDOT settlement\n— \n107 \nLitigation settlements\n7 \n12 \nOperating income, non-GAAP\n457 \n893 \nNet adjustment for aircraft leases (a)\n134 \n128 \nAdjusted operating income, non-GAAP (A)\n$\n591 \n$\n1,021 \nNon-GAAP tax rate (B)\n23.1 \n%\n(d)\n23.5 \n%\n(e)\nNet operating profit after-tax (A* (1-B) = C)\n$\n454 \n$\n781 \nDebt, including finance leases (b)\n$\n7,742 \n$\n8,033 \nEquity (b)\n10,388 \n10,669 \nNet present value of aircraft operating leases (b)\n933 \n1,029 \nAverage invested capital\n$\n19,063 \n$\n19,731 \nEquity adjustment (c)\n13 \n(168)\nAdjusted average invested capital (D)\n$\n19,076 \n$\n19,563 \nNon-GAAP ROIC, pre-tax (A/D)\n3.1 \n%\n5.2 \n%\nNon-GAAP ROIC, after-tax (C/D)\n2.4 \n%\n4.0 \n%\n(a) Net adjustment related to presumption that all aircraft in fleet are owned (i.e., the impact of eliminating aircraft rent expense and replacing with estimated depreciation expense for those same aircraft). The Company makes this adjustment to enhance comparability to other entities that have different capital structures by utilizing alternative financing decisions.\n(b) Calculated as an average of the five most recent quarter end balances or remaining obligations. The Net present value of aircraft operating leases represents the assumption that all aircraft in the Company’s fleet are owned, as it reflects the remaining contractual commitments discounted at the Company's estimated incremental borrowing rate as of the time each individual lease was signed.\n(c) The Equity adjustment in the denominator adjusts for the cumulative impacts, in Accumulated other comprehensive income (loss) and Retained earnings, of gains and/or losses that will settle in future periods, including those associated with the Company's fuel hedges. The current period impact of these gains and/or losses is reflected in the Net impact from fuel contracts in the numerator.\n(d) The GAAP full year tax rate as of \nDecember 31, 2024\n, was \n22.2 percent\n, and the full year Non-GAAP tax rate was\n 23.1 percent\n. See Note Regarding Use of Non-GAAP Financial Measures for additional information.\n(e) The GAAP full year tax rate as of \nDecember 31, 2023\n, was \n26.5 percent\n, and the full year Non-GAAP tax rate was \n23.5 percent\n. See Note Regarding Use of Non-GAAP Financial Measure\ns for additional information.\n82\nTable of Contents\nNote Regarding Use of Non-GAAP Financial Measures \nThe Company's Consolidated Financial Statements are prepared in accordance with GAAP. These GAAP financial statements may include (i) unrealized noncash adjustments and reclassifications, which can be significant, as a result of accounting requirements and elections made under accounting pronouncements relating to derivative instruments and hedging and (ii) other charges and benefits the Company believes are unusual and/or infrequent in nature and thus may make comparisons to its prior or future performance difficult.\nAs a result, the Company also provides financial information in this filing that was not prepared in accordance with GAAP and should not be considered as an alternative to the information prepared in accordance with GAAP. The Company provides supplemental non-GAAP financial information (also referred to as \"excluding special items\"), including results that it refers to as \"economic,\" which the Company's management utilizes to evaluate its ongoing financial performance and the Company believes provides additional insight to investors as supplemental information to its GAAP results. The non-GAAP measures provided that relate to the Company’s performance on an economic fuel cost basis include Fuel and oil expense, non-GAAP; Total operating expenses, non-GAAP; Operating expenses, non-GAAP excluding Fuel and oil expense; Operating expenses, non-GAAP excluding Fuel and oil expense and profitsharing; Operating income, non-GAAP; Other gains, net, non-GAAP; Income before income taxes, non-GAAP; Income tax rate, non-GAAP; Provision for income taxes, net, non-GAAP; Net income, non-GAAP; Net income per share, diluted, non-GAAP; and Operating expenses per ASM, non-GAAP, excluding Fuel and oil expense and profitsharing (cents). The Company's economic Fuel and oil expense results differ from GAAP results in that they only include the actual cash settlements from fuel hedge contracts - all reflected within Fuel and oil expense in the period of settlement. Thus, Fuel and oil expense on an economic basis has historically been utilized by the Company, as well as some of the other airlines that utilize fuel hedging, as it reflects the Company’s actual net cash outlays for fuel during the applicable period, inclusive of settled fuel derivative contracts. Any net premium costs paid related to option contracts that are designated as hedges are reflected as a component of Fuel and oil expense, for both GAAP and non-GAAP (including economic) purposes in the period of contract settlement. The Company believes these economic results provide further insight into the impact of the Company's fuel hedges on its operating performance and liquidity since they exclude the unrealized, noncash adjustments and reclassifications that are recorded in GAAP results in accordance with accounting guidance relating to derivative instruments, and they reflect all cash settlements related to fuel derivative contracts within Fuel and oil expense. This enables the Company's management, as well as investors and analysts, to consistently assess the Company's operating performance on a year-over-year or quarter-over-quarter basis after considering all efforts in place to manage fuel expense. However, because these measures are not determined in accordance with GAAP, such measures are susceptible to varying calculations, and not all companies calculate the measures in the same manner. As a result, the aforementioned measures, as presented, may not be directly comparable to similarly titled measures presented by other companies.\nFurther information on (i) the Company's fuel hedging program, (ii) the requirements of accounting for derivative instruments, and (iii) the causes of hedge ineffectiveness and/or mark-to-market gains or losses from derivative instruments is included in Note 10 to the Consolidated Financial Statements.\nThe Company’s GAAP results in the applicable periods may include other charges or benefits that are also deemed \"special items,\" that the Company believes make its results difficult to compare to prior periods, anticipated future periods, or industry trends. Financial measures identified as non-GAAP (or as excluding special items) have been adjusted to exclude special items. For the periods presented, in addition to the items discussed above, special items include:\n1.\nReversal of breakage revenue recorded in prior years related to a portion of flight credits issued to Customers during 2022 and prior that have either been redeemed or are expected to be redeemed in future periods. The majority of these flight credits were issued during the COVID-19 pandemic as the Company was making significant changes to its flight schedules based on fluctuating demand, which made it difficult to estimate future redemption patterns when compared against historical Customer behavior;\n83\nTable of Contents\n2.\nIncremental expense associated with a voluntary separation program that allowed eligible Employees the opportunity to voluntarily separate from the Company in exchange for severance, medical/dental coverage for a specified period of time, and travel privileges based on years of service;\n3.\nIncremental expense associated with contract ratification bonuses for various workgroups related to additional compensation for services performed by Employees outside the applicable fiscal period;\n4.\nExpenses associated with incremental professional advisory fees related to activist investor activities, which were not budgeted by the Company, are not associated with the ongoing operation of the airline, and are difficult to predict in future periods;\n5.\nA charge associated with a settlement reached with the DOT as a result of the Company's December 2022 operational disruption;\n6.\nCharges associated with tentative litigation settlements regarding certain California state meal-and-rest-break regulations for flight attendants and an arbitration award in favor of the Company's Pilots relating to a collective-bargaining matter;\n7.\nExpenses associated with professional advisory fees related to the Company's implementation of its comprehensive three-year \"Southwest. Even Better.\" transformational plan; and\n8.\nUnrealized mark-to-market adjustment associated with certain available for sale securities.\nBecause management believes special items can distort the trends associated with the Company’s ongoing performance as an airline, the Company believes that evaluation of its financial performance can be enhanced by a supplemental presentation of results that exclude the impact of special items in order to enhance consistency and comparativeness with results in prior periods that do not include such items and as a basis for evaluating operating results in future periods. The following measures are often provided, excluding special items, and utilized by the Company’s management, analysts, and investors to enhance comparability of year-over-year results, as well as to industry trends: Fuel and oil expense, non-GAAP; Total operating expenses, non-GAAP; Operating expenses, non-GAAP excluding Fuel and oil expense; Operating expenses, non-GAAP excluding Fuel and oil expense and profitsharing; Operating income, non-GAAP; Other gains, net, non-GAAP; Income before income taxes, non-GAAP; Income tax rate, non-GAAP; Provision for income taxes, net, non-GAAP; Net income, non-GAAP; Net income per share, diluted, non-GAAP; and Operating expenses per ASM, non-GAAP, excluding Fuel and oil expense and profitsharing (cents).\nThe Company has also provided its calculation of return on invested capital, which is a measure of financial performance used by management to evaluate its investment returns on capital. Return on invested capital is not a substitute for financial results as reported in accordance with GAAP and should not be utilized in place of such GAAP results. Although return on invested capital is not a measure defined by GAAP, it is calculated by the Company, in part, using non-GAAP financial measures. Those non-GAAP financial measures are utilized for the same reasons as those noted above for Net income, non-GAAP and Operating income, non-GAAP. The comparable GAAP measures include charges or benefits that are deemed \"special items\" that the Company believes make its results difficult to compare to prior periods, anticipated future periods, or industry trends, and the Company’s profitability targets and estimates, both internally and externally, are based on non-GAAP results since \"special items\" cannot be reliably predicted or estimated. The Company believes non-GAAP return on invested capital is a meaningful measure because it quantifies the Company's effectiveness in generating returns relative to the capital it has invested in its business. Although return on invested capital is commonly used as a measure of capital efficiency, definitions of return on invested capital differ; therefore, the Company is providing an explanation of its calculation for non-GAAP return on invested capital in the accompanying reconciliation in order to allow investors to compare and contrast its calculation to the calculations provided by other companies.\n84\nTable of Contents\nLiquidity and Capital Resources\nNet cash provided by operating activities for 2024 was $462 million, and net cash provided by operating activities for 2023 was $3.2 billion. Operating cash inflows are historically primarily derived from providing air transportation to Customers. The vast majority of tickets are purchased prior to the day on which travel is provided and, in some cases, several months before the anticipated travel date. Operating cash outflows are related to the recurring expenses of airline operations. The operating cash flows for 2024 were largely impacted by the Company's net income (as adjusted for noncash items, primarily Depreciation and amortization and the gain on the sale-leaseback transaction), the approximately $1.9 billion paid to Pilots, Flight Attendants, and Ramp, Operations, Provisioning, and Cargo Agents as bonuses upon the ratification of the labor contract agreements with SWAPA, TWU 556, and TWU 555, respectively, and a $123 million decrease related to the purchase of fuel derivative instruments, which is included within Other, net operating cash flows in the accompanying Consolidated Statement of Cash Flows (see Note 10 to the Consolidated Financial Statements for further information). Operating cash flows for 2023 included a $29 million increase in Air traffic liability driven by higher ticket sales related to an increase in travel demand, partially offset by a $273 million decrease related to the purchase of fuel derivative instruments, which is included within Other, net operating cash flows in the accompanying Consolidated Statement of Cash Flows, and a $215 million decrease due to the payment of Customer reimbursement expenses in first quarter 2023 related to the December 2022 operational disruption. Net cash provided by operating activities is primarily used to finance capital expenditures, repay debt, provide Shareholder returns, and provide working capital.\nNet cash used in investing activities for 2024 was $261 million, and net cash used in investing activities for 2023 was $2.9 billion. Investing activities in both years included Capital expenditures and changes in the balance of the Company's short-term and noncurrent investments. The Company also raised $871 million in 2024 from the sale-leaseback of 35 aircraft (see Note 7 to the Consolidated Financial Statements for more details on the sale-leaseback transactions). Capital expenditures were $2.1 billion for 2024, compared with $3.5 billion in the same prior year period, and decreased largely due to decreases in progress and delivery payments for aircraft received in 2024, as well as contractual progress payments made in 2024 associated with future aircraft deliveries. Capital expenditures during 2024 also included approximately $22 million associated with the Company's purchase of finance leased aircraft, compared to approximately $174 million associated with finance leased aircraft purchased during 2023. See Note 7 to the Consolidated Financial Statements for further information. \nThe Company estimates its 2025 capital spending to be in the range of $2.5 billion to $3.0 billion, which includes approximately $1.2 billion in aircraft capital spending, based on the planning assumption of 38 -8 aircraft deliveries in 2025, and $1.6 billion in non-aircraft capital spending, but does not include the impact of potential future fleet sales or sale-leaseback transactions. The Company's opportunities to lower net capital spending from its fleet monetization strategy are dependent on aircraft market conditions and Boeing's ability to deliver aircraft pursuant to the Company's contractual order book. \nNet cash used in financing activities for 2024 was $2.0 billion, and net cash used in financing activities for 2023 was $436 million. The Company paid $430 million in cash dividends to Shareholders and repaid $1.3 billion in debt and finance lease obligations, primarily as a prepayment for all of its outstanding 5.25% Notes due 2025 during the year ended December 31, 2024. The Company may engage in early debt repurchases from time to time at its discretion; however, any early future repurchases are not included in the Company's current maturities of long-term debt. The Company paid $428 million in cash dividends to Shareholders and repaid $85 million in finance lease obligations during the year ended December 31, 2023. The Company's purchase of finance leased aircraft in 2023 resulted in the elimination of the Company's remaining financial lease obligations for these aircraft of $191 million.\nOn May 15, 2019, the Company’s Board authorized the repurchase of up to $2.0 billion of the Company’s common stock, of which approximately $899 million remained as of September 2024. On September 25, 2024, the Board terminated and replaced this previous share repurchase authorization with a new $2.5 billion share repurchase authorization of the Company’s common stock. Subject to certain conditions, repurchases may be made in accordance with applicable securities laws in open market or private, including accelerated, repurchase transactions from time to time, depending on market conditions. The Company repurchased $250 million of its outstanding \n85\nTable of Contents\ncommon stock through an accelerated share repurchase program entered into in fourth quarter 2024 under this new authorization, which also impacted net cash used in financing activities. The repurchases of common stock amounts in the Consolidated Statement of Cash Flows may differ from the Consolidated Statement of Stockholder's Equity due to excise taxes incurred on share repurchases, net of issuances, payable in April 2025. On December 5, 2024, the Company announced its intention to launch an additional $750 million accelerated share repurchase program in first quarter 2025.\nA discussion of the Company's most significant drivers impacting cash flow for 2022 are included in the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023, under Part II Item 7, Liquidity and Capital Resources. \nThe Company is a \"well-known seasoned issuer\" and currently has an effective shelf registration statement registering an indeterminate amount of debt and equity securities for future sales. The Company currently intends to use the proceeds from any future securities sales off this shelf registration statement for general corporate purposes.\nAdditional detail regarding the Company's available liquidity is provided in the table below.\n(\nin millions\n)\nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\n$\n7,509 \n$\n9,288 \nShort-term investments\n1,216 \n2,186 \nUndrawn facilities\n1,000 \n1,000 \nTotal available liquidity\n9,725 \n$\n12,474 \nThe Company has access to $1.0 billion under its amended and restated revolving credit facility (the \"Amended Credit Agreement\"). There were no amounts outstanding under the Amended Credit Agreement as of December 31, 2024. See Note 6 to the Consolidated Financial Statements for further information. \nAs of December 31, 2024, the Company carried a working capital deficit of approximately $1 billion, in which its current liabilities exceed its current assets. This is common within the airline industry and is primarily due to the nature of the Air traffic liability account, which is related to advance ticket sales, unused flight credits available to Customers, and loyalty deferred revenue, which are performance obligations for future Customer flights, do not require future settlement in cash, and are mostly nonrefundable. See Note 5 to the Consolidated Financial Statements for further information.\nThe Company believes it has various options available to meet its capital and operating commitments, including unrestricted cash and short-term investments of \n$8.7 billion\n as of December 31, 2024, and anticipated future internally generated funds from operations. The Company continues to have a large base of unencumbered assets with a net book value of approximately \n$16 billion\n, including approximately \n$13 billion\n in aircraft value and approximately \n$3 billion\n in non-aircraft assets such as spare engines, ground equipment, and real estate. In addition, the Company continues to maintain investment-grade credit ratings by all three major credit agencies (Moody's, S&P Global, and Fitch). As of December 31, 2024, the Company had the following corporate credit ratings:\nMoody's\nS&P Global\nFitch\nSouthwest Airlines Co.\nBaa1\nBBB\nBBB+\nThe following discussion includes various short-term and long-term material cash requirements from known contractual and other obligations, but does not include amounts that are contingent on events or other factors that are uncertain or unknown at this time. Given the Company's current liquidity position, available resources, and prevailing outlook, it expects to be able to fulfill both its short-term and long-term material cash requirements. The amounts disclosed are based on various estimates, including estimates regarding the timing of payments, prevailing interest rates, volumes purchased, the occurrence of certain events and other factors. Accordingly, the actual results may vary materially from the amounts discussed herein.\n86\nTable of Contents\nDebt\nAs detailed in Note 6\n \nto the Consolidated Financial Statements, in connection with the major negative impact of COVID-19 on air carriers, the Company received significant financial assistance from Treasury in the form of payroll support, and this assistance had a significant impact on the Company's reported GAAP financial results. Such impact ended in third quarter 2021, and the Company's 2022, 2023, and 2024 results do not reflect the benefit of this payroll support, and its future periods are not expected to benefit from such payroll support. However, future cash flows will be impacted through the portion of payroll support that was in the form of loans that remain outstanding and will have to be repaid to Treasury.\nSee Note 6 to the Consolidated Financial Statements for further detail on the Company's debt and the timing of expected and future principal payments. The Company also has significant future obligations associated with fixed interest payments associated with its debt. As of December 31, 2024, future interest payments associated with its fixed rate debt (excluding interest associated with finance leases) were $138 million in 2025, $128 million in 2026, $71 million in 2027, $13 million in 2028, $13 million in 2029, and $7 million thereafter.\nThe Company's Convertible Notes of $1.6 billion did not meet the criteria to be converted by holders as of the date of the financial statements, but are classified within Current maturities of long-term debt in the accompanying Consolidated Balance Sheet as of December 31, 2024, due to their maturation date of May 1, 2025. Upon conversion, the Company will settle conversions in cash. Also, the Company has engaged in transactions with certain convertible debt holders to purchase their instruments in private transactions from time to time in cash, and may continue to do so in future periods. The Company considers its prevailing stock price, the trading price of its convertible debt instruments, and its available liquidity in determining how much of these instruments it may attempt to repurchase in such transactions.\nLeases\nThe Company enters into leases for aircraft, airports and other real property, and other types of equipment in the normal course of business. See Note 7 to the Consolidated Financial Statements for further detail.\nAircraft purchase commitments\nThe Company is required to make cash deposits toward the purchase of aircraft in advance. These deposits are classified as Deposits on flight equipment purchase contracts in the Consolidated Balance Sheet until the aircraft is delivered, at which time deposits previously made are deducted from the final purchase price of aircraft and are reclassified as Flight equipment. See Part I, Item 2 for a complete table of the Company's contractual firm deliveries and options for -7 and -8 aircraft, and Note 4 to the Consolidated Financial Statements for the financial commitments related to these firm deliveries.\nOther\nThe Company's other material cash requirements primarily consist of outlays associated with normal operating expenses of the airline, including payroll, fuel, airport costs, etc. While many of these expenses are variable in nature, some of the expenditures can be somewhat fixed in the short-term due to the lead-time involved in publishing the Company's flight schedule in advance and providing for resources to be available to operate those schedules. \nThe Company has a large net deferred tax liability on its Consolidated Balance Sheet. The deferral of income taxes has resulted in a significant benefit to the Company and its liquidity position. Since the Company purchases the majority of the aircraft it acquires, it has been able to utilize accelerated depreciation methods (including bonus depreciation) available under the Internal Revenue Code of 1986, as amended, in 2024 and in previous years, which has enabled the Company to accelerate cash tax benefits of depreciation. Based on the Company’s scheduled future \n87\nTable of Contents\naircraft deliveries from Boeing and existing tax laws in effect, the Company will continue to accelerate the cash income tax benefits related to aircraft purchases. Due to the Company's net taxable loss incurred in 2020, and a provision within the CARES Act that allowed entities to carry back such 2020 losses to prior periods of up to five years, and claim refunds of federal taxes paid, the Company received a significant cash tax refund of $472 million associated with this taxable loss from the Internal Revenue Service during second quarter 2022. The Company has federal and state operating loss carryforwards, $253 million and $56 million (tax-effected), respectively, to reduce taxable income in future periods. See Note 14 to the Consolidated Financial Statements for further information. The Company has paid in the past, and will continue to pay in the future, cash taxes to the various taxing jurisdictions where it operates. The Company expects to be able to continue to meet such obligations utilizing cash and investments on hand, as well as cash generated from its ongoing operations.\n88\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe Company’s Consolidated Financial Statements have been prepared in accordance with GAAP. The Company’s significant accounting policies are described in Note 1 to the Consolidated Financial Statements. The preparation of financial statements in accordance with GAAP requires the Company’s management to make estimates and assumptions that affect the amounts reported in the Consolidated Financial Statements and accompanying footnotes. The Company’s estimates and assumptions are based on historical experience and changes in the business environment. However, actual results may differ from estimates under different conditions, sometimes materially. Critical accounting policies and estimates are defined as those that both (i) are most important to the portrayal of the Company’s financial condition and results and (ii) require management’s most subjective judgments. The Company’s critical accounting policies and estimates are described below. \nRevenue Recognition\nTickets sold for Passenger air travel are initially deferred as Air traffic liability. Passenger revenue is recognized and Air traffic liability is reduced when the service is provided (i.e., when the flight takes place). Air traffic liability primarily represents tickets sold for future travel dates, flight credits that are expected to be used in the future, and loyalty benefits that are expected to be redeemed in the future. Air traffic liability typically fluctuates throughout the year based on seasonal travel patterns, fare sale activity, and activity associated with the Company’s loyalty program. See Note 1 to the Consolidated Financial Statements for information about the Company's revenue recognition policies.\nFor air travel on Southwest, the amount of tickets (which includes flight credits—also referred to as partial tickets) that will go unused, referred to as breakage, is estimated and recognized in Passenger revenue once the scheduled flight date has passed, in proportion to the pattern of rights exercised by the Customer, in accordance with Accounting Standards Codification 606, Revenue From Contracts With Customers (\"ASC 606\"). Estimating the amount of tickets that will ultimately go unused involves some level of subjectivity and judgment. The majority of the Company's tickets sold are nonrefundable, although flight credits created when a Customer cancels or modifies an existing flight itinerary can be applied towards the purchase of future travel. Unused flight credits are the primary source of breakage. Breakage estimates are based on historical experience over many years. Fully refundable tickets rarely go unused. \nAs a result of the COVID-19 pandemic, for all Customer flight credits created or scheduled to expire between March 1 and September 7, 2020 associated with flight cancellations, the Company initially extended the expiration date to September 7, 2022. See Note 5 to the Consolidated Financial Statements for further information regarding these extended flight credits. Subsequently, on July 28, 2022, the Company modified its policy and announced that all unexpired flight credits as of that date, including these extended flight credits, will no longer have an expiration date and thus will be able to be redeemed by Customers indefinitely. This change in policy was considered a contract modification under ASC 606 and the Company accounted for such change prospectively in third quarter 2022. The Company’s balance of existing Customer flight credits as of the modification date was approximately $1.9 billion, including the extended flight credits that had been set to expire on September 7, 2022. \nAs a result of changes in observed Customer travel habits and behaviors during 2021 and 2022, the Company increased its estimates of “normal” Customer flight credits that were expected to go unused, as Customer redemptions of these \"normal\" credits had been at a slower rate than the Company’s historical data for similar credits in periods prior to the COVID-19 pandemic. At the time of the Company's policy change, based on historical Customer behavior, the Company estimated that redemptions of these pre-policy change issued flight credits would have been reduced to an immaterial amount during 2024 and recognized breakage revenue in prior periods for these flight credits accordingly; however, based on actual Customer redemptions throughout 2024, as well as currently projected redemptions beyond 2024, the Company determined a reversal of a portion of this prior breakage revenue in the amount of $116 million was warranted in the current period. See Note 1 to the Consolidated Financial Statements for further information regarding this adjustment. Although the Company continues to believe a portion of Customer flight credits will go unused following the Company's change in policy, including a portion of flight \n89\nTable of Contents\ncredits issued after July 28, 2022, the Company's prospective long term breakage rate associated with such flight credits has been and is expected to continue to be lower and more stable than it had been previously. Although the Company's estimated breakage rate was consistent throughout 2024, a one percentage point change in the amount of breakage, as a factor of total flight credits issued, would have resulted in a change of Passenger revenues of approximately $25 million. \nObserved Customer behavior that differs from historical experience can cause actual ticket breakage to differ significantly from estimates. Assumptions about Customer behavior are reviewed frequently and corresponding adjustments are made to breakage estimates, as needed, when observed behaviors differ from historical experience or expectations. Assumptions about Customer behavior can be impacted by several factors including, but not limited to: fare increases, fare sales, changes to the Company's ticketing policies, changes to the Company’s refund, exchange and unused flight credit policies, seat availability, and economic factors. The Company’s estimation techniques have been consistently applied from year to year; however, as with any estimates, actual ticket breakage may vary from estimated amounts. \n Fair Value Measurements and Financial Derivative Instruments\nThe Company utilizes unobservable (Level 3) inputs in determining the fair value of certain assets and liabilities. As of December 31, 2024, these consisted of its fuel derivative option contracts, which were an asset of $130 million. The Company utilizes financial derivative instruments primarily to manage its risk associated with changing jet fuel prices. See \"Quantitative and Qualitative Disclosures about Market Risk\" for more information on these risk management activities, Note 10 to the Consolidated Financial Statements for more information on the Company’s fuel hedging program and financial derivative instruments, and Note 11 to the Consolidated Financial Statements for more information about fair value measurements. \nAll derivatives are required to be reflected at fair value and recorded on the Consolidated Balance Sheet. As of December 31, 2024, the Company was a party to over 175 separate financial derivative instruments related to its fuel hedging program for future periods. Changes in the fair values of these instruments can vary dramatically based on changes in the underlying commodity prices. For example, during 2024, market \"spot\" prices for Brent crude oil peaked at a high average daily price of approximately $91 per barrel and hit a low average daily price of approximately $69 per barrel. During 2023, market spot prices ranged from a high average daily price of approximately $97 per barrel to a low average daily price of approximately $72 per barrel. Market price changes can be driven by factors such as supply and demand, inventory levels, weather events, refinery capacity, political agendas, the value of the U.S. dollar, geopolitical events, pandemics, and general economic conditions, among other items. Historically, the financial derivative instruments utilized by the Company primarily are a combination of collars, purchased call options, call spreads, put spreads, and fixed price swap agreements.\nThe Company enters into financial derivative instruments with third party institutions in \"over-the-counter\" markets. Since the majority of the Company’s financial derivative instruments are not traded on a market exchange, the Company estimates their fair values. Depending on the type of instrument, the values are determined by the use of present value methods or standard option value models with assumptions about commodity prices based on those observed in underlying markets. \nThe Company determines the fair value of fuel derivative option contracts utilizing an option pricing model based on inputs that are either readily available in public markets, can be derived from information available in publicly quoted markets, or are quoted by its counterparties. In situations where the Company obtains inputs via quotes from its counterparties, it verifies the reasonableness of these quotes via similar quotes from another counterparty as of each date for which financial statements are prepared. The Company has consistently applied these valuation techniques in all periods presented and believes it has obtained the most accurate information available for the types of derivative contracts it holds. Due to the fact that certain inputs used in determining the estimated fair value of its option contracts are considered unobservable (primarily implied volatility), the Company has categorized these option contracts as Level 3. Although implied volatility is not directly observable, it is derived primarily from changes in market prices, which are observable. Based on the Company’s portfolio of option contracts as of \n90\nTable of Contents\nDecember 31, 2024, a 10 percent change in implied volatility, holding all other factors constant, would have resulted in a change in the fair value of this portfolio of less than $100 million.\nFair values for financial derivative instruments are estimated prior to the time that the financial derivative instruments settle. However, once settlement of the financial derivative instruments occurs and the hedged jet fuel is purchased and consumed, all values and prices are known and are recognized in the financial statements. Although the Company continues to use a prospective assessment to determine that commodities continue to qualify for hedge accounting in specific locations where the Company hedges, there are no assurances that these commodities will continue to qualify in the future. This is due to the fact that future price changes in these refined products may not be consistent with historical price changes. Increased volatility in these commodity markets for an extended period of time, especially if such volatility were to worsen, could cause the Company to lose hedge accounting altogether for the commodities used in its fuel hedging program. During third quarter 2024, the routine statistical analysis performed by the Company to determine which commodities qualify for special hedge accounting treatment on a prospective basis indicated that West Texas Intermediate (\"WTI\") crude oil-based derivatives no longer qualified for hedge accounting. This change was primarily due to the fact that the correlation between WTI crude oil prices and jet fuel prices during recent periods had not been as strong as in the past, and therefore the Company could no longer demonstrate that derivatives based on WTI crude oil prices would result in effective hedges on a prospective basis. As such, all WTI-based instruments were de-designated from their hedging relationships and the change in fair value of all of the Company's derivatives based in WTI was recorded to Other (gains) losses for third quarter and fourth quarter 2024. All WTI crude oil based derivatives in the Company's portfolio have settled as of December 31, 2024. The change in fair value of the Company's WTI derivative contracts during the second half 2024 was a decrease of $37 million which resulted in a corresponding loss in the Consolidated Statement of Income. Any amounts previously recorded to AOCI remained there until the original forecasted transaction occurred in accordance with hedge accounting requirements. Further, should the anticipated fuel purchases covered by the Company's fuel hedges no longer be probable of occurring, the Company would discontinue hedge accounting. The loss of hedge accounting would create further volatility in the Company’s GAAP financial results.\nAs discussed in Note 10 to the Consolidated Financial Statements, any changes in fair value of cash flow derivatives designated as hedges are offset within AOCI until the period in which the expected future cash flow impacts earnings. Any changes in the fair value of fuel derivatives that do not qualify for hedge accounting are reflected in earnings within Other (gains) losses, net, in the period of the change. Because the Company has extensive historical experience in valuing the derivative instruments it holds, and such experience is continually evaluated against its counterparties each period when such instruments expire and are settled for cash, the Company believes it is unlikely that an independent third party would value the Company’s derivative contracts at a significantly different amount than what is reflected in the Company’s financial statements. In addition, the Company also has bilateral credit provisions in some of its counterparty agreements, which provide for parties (or the Company) to provide cash collateral when the fair value of fuel derivatives with a single party exceeds certain threshold levels. Since this cash collateral is based on the estimated fair value of the Company’s outstanding fuel derivative contracts, this provides further validation to the Company’s estimate of fair values.\nLoyalty Accounting\nThe Company utilizes estimates in the recognition of revenues and liabilities associated with its loyalty program. These estimates primarily include the liability associated with Rapid Rewards loyalty member (\"Member\") account balances that are expected to be redeemed for travel or other products at a future date. Loyalty account balances include points earned through flights taken, points sold to Customers, or points earned through business partners participating in the loyalty program.\nUnder the Southwest Rapid Rewards loyalty program, Members earn points for every dollar spent on eligible Southwest fare purchases. The amount of points earned under the program is based on the fare amount and fare type, with higher fare types (e.g., Business Select) earning more points than lower fare types (e.g., Wanna Get Away). Each fare type is associated with a points earning multiplier, and points for flights are calculated by multiplying the fare amount for the flight by the fare type multiplier. Likewise, the amount of points required to be redeemed for a flight can differ based on the fare type purchased. Under the program, (i) Members are able to \n91\nTable of Contents\nredeem their points for every available seat, every day, on every flight, with no blackout dates; and (ii) points do not expire. In addition, Members are able to redeem their points for items other than travel on Southwest Airlines, such as international flights on other airlines, cruises, hotel stays, rental cars, gift cards, event tickets, and more. In addition to earning points for revenue flights and qualifying purchases with Rapid Rewards Partners, Members also have the ability to purchase, gift, and transfer points, as well as the ability to donate points to selected charities.\nThe Company utilizes the deferred revenue method of accounting for points earned through flights taken in its loyalty program. The Company also sells points and related services to business partners participating in the loyalty program. Liabilities are recorded for the relative standalone selling price of the Rapid Rewards points which are awarded each period. The liabilities recorded represent the total number of points expected to be redeemed by Members, regardless of whether the Members may have enough to qualify for a full travel award. As of December 31, 2024, the loyalty liabilities were approximately $4.8 billion, including $2.9 billion classified within Air traffic liability and $1.9 billion classified as Air traffic liability – noncurrent.\nIn order to determine the value of each loyalty point, certain assumptions must be made at the time of measurement, which include an allocation of passenger revenue between the flight and loyalty points earned by passengers, and the fair value of Rapid Rewards points, which are generally based on their redemption value to the Customer. See Note 5 to the Consolidated Financial Statements for further information on determining the estimated fair value of each loyalty point.\nThe majority of the points sold to business partners are through the Southwest co-branded credit card agreement (\"Agreement\") with Chase. Consideration received as part of this Agreement is subject to ASC 606. For periods presented in the Consolidated Financial Statements, the most recent instance in which the Agreement was amended was in fourth quarter 2021. In January 2025, the Company reached an amended co-brand agreement with Chase. The amendment includes enhanced Cardmember benefits associated with the Company's assigned and premium seating initiative and supports the multi-year financial targets announced at the Company's Investor Day in September 2024. Agreements with Chase have the following multiple elements: travel points to be awarded, use of the Southwest Airlines’ brand and access to Rapid Rewards Member lists, advertising elements, and the Company’s resource team. These elements are combined into two performance obligations, transportation and marketing, and consideration from the Agreement is allocated based on the relative selling price of each performance obligation.\nSignificant management judgment was used to estimate the selling price of each of the performance obligations in the Agreement at inception, including each time in which the Agreement has been materially amended. The objective is to determine the price at which the Company would transact a sale if the product or service was sold on a stand-alone basis. The Company determines the best estimate of selling price by considering multiple inputs and methods including, but not limited to, the estimated selling price of comparable travel, discounted cash flows, brand value, published selling prices, number of points awarded, and the number of points redeemed. The Company estimates the selling prices and volumes over the term of the Agreement in order to determine the allocation of proceeds to each of the multiple performance obligations. The Company records revenue related to air transportation when the transportation is delivered and revenue related to marketing elements when the performance obligation is satisfied. A one percent increase or decrease in the Company's estimate of the standalone selling prices, implemented as of January 1, 2024, causing a change to the allocation of proceeds to air transportation would not have had a material impact on the Company's Operating revenues for the year ended December 31, 2024.\nUnder its current program, Southwest estimates the portion of loyalty points that will not be redeemed. In estimating the breakage, the Company takes into account the Member’s past behavior, as well as several factors related to the Member’s account that are expected to be indicative of the likelihood of future point redemption. These factors are typically representative of a Member’s level of engagement in the loyalty program. They include, but are not limited to, tenure with the program, points accrued in the program, and points redeemed in the program. The Company believes it has obtained sufficient historical behavioral data to develop a predictive statistical model to analyze the amount of breakage expected for all loyalty points. The Company updates this model at least annually, and applies the new breakage rates effective October 1st each year, or more frequently if required by changes in the business. Changes in the breakage rates applied annually in recent years have not had a material impact on Passenger \n92\nTable of Contents\nrevenues. For the year ended December 31, 2024, based on actual redemptions of points sold to business partners and earned through flights, a hypothetical one percentage point change in the estimated breakage rate would have resulted in a change to Passenger revenue of approximately $252 million (an increase in breakage would have resulted in an increase in revenue and a decrease in breakage would have resulted in a decrease in revenue). Given that Member behavior may fluctuate over time, the Company expects the current estimates may change in future periods. However, the Company believes its current estimates are reasonable given current facts and circumstances.\n93\nTable of Contents",
  "item2": null
}