{
  "source_file": "lyb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGENERAL\nThis discussion should be read in conjunction with the information contained in the Consolidated Financial Statements, and the accompanying notes elsewhere in this report. Unless otherwise indicated, the “Company,” “we,” “us,” “our” or similar words are used to refer to LyondellBasell Industries N.V. together with its consolidated subsidiaries (“LyondellBasell N.V.”).\nIn February 2025, we ceased business operations at our Houston refinery. Accordingly, our refining business, previously disclosed as the Refining segment, is reported as a discontinued operation. The related operating results of our refining business are reported as discontinued operations for all periods presented.\nOVERVIEW\nResults from continuing operations for the third quarter of 2025 decreased compared to the second quarter of 2025 primarily as a result of non-cash impairment charges recognized in the third quarter of 2025 for our Olefins and Polyolefins-Europe, Asia, International (“O&P-EAI”) and Advanced Polymer Solutions (“APS”) segments. In our Olefins and Polyolefins-Americas (“O&P-Americas”) segment improved profitability was supported by increased olefins margins and higher sales volumes following the successful completion of turnarounds at our facility in Channelview, Texas. Polyethylene spreads decreased as monomer costs rose. Our sales volumes improved on higher domestic demand for polyethylene given our North American market position, along with higher export flows to key global markets. Polypropylene demand remained weak. In our O&P-EAI segment, improved operations yielded higher monomer volumes while polymer prices were pressured by increased competition from imports. In our Intermediates and Derivatives (“I&D”) segment, oxyfuels results improved sequentially on increased octane blend premiums, lower butane raw material prices and modestly higher sales volumes partially offset by declining styrene margins as global supply normalized.\n \nIn September, we started a two-month turnaround at our La Porte, Texas acetyls unit that will position the asset for improved productivity and reliability.\nResults from continuing operations for the first nine months of 2025 decreased compared to the first nine months of 2024 primarily as a result of non-cash impairment charges recognized for our O&P-EAI and APS segments. In our O&P-Americas segment, olefins and polyethylene margins decreased on higher feedstock and energy costs and a weakened economic environment. In our I&D segment, oxyfuels and related products results declined due to lower crude oil prices and global oversupply. Results for our I&D segment were further impacted by the recognition of shutdown costs related to our European PO Joint Venture during the first quarter of 2025, and by a gain on sale of our U.S. Gulf Coast-based Ethylene Oxide & Derivatives (“EO&D”) business recognized during the second quarter of 2024. In our Technology segment, licensing results decreased as the planned pace of global polyolefin capacity additions moderate.\nIn October 2025, we entered into a sales and purchase agreement for the sale of select olefins & polyolefins assets and the associated business in Europe. Closing of the proposed transaction is currently expected in the first half of 2026. See Note 4 to our Consolidated Financial Statements for additional information.\nDuring the first nine months of 2025 we generated $755 million of cash from operating activities primarily reflecting a net loss adjusted for non-cash items, timing of payment of Accounts payable and tax payments, including U.S. Federal corporate income tax payments deferred from 2024 into 2025 under Hurricane Beryl disaster relief. In connection with our overall capital allocation strategy, we invested $1,428 million in capital expenditures and returned $1,522 million to shareholders through dividend payments and share repurchases.\n33\nTable of Contents\nResults of operations for the periods discussed are presented in the table below:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n7,727 \n$\n7,658 \n$\n23,062 \n$\n25,586 \nCost of sales\n6,821 \n6,871 \n20,820 \n21,747 \nGoodwill impairments\n972 \n— \n972 \n— \nOther impairments\n230 \n32 \n262 \n5 \nSelling, general and administrative expenses\n401 \n435 \n1,237 \n1,223 \nResearch and development expenses\n34 \n35 \n103 \n96 \nOperating (loss) income\n(731)\n285 \n(332)\n2,515 \nInterest expense\n(130)\n(118)\n(355)\n(365)\nInterest income\n21 \n21 \n72 \n114 \n(Loss) gain on sale of business\n(6)\n— \n(6)\n293 \nOther (expense) income, net\n(2)\n29 \n48 \n28 \n(Loss) income from equity investments\n(8)\n7 \n— \n(66)\n(Loss) income from continuing operations before income taxes\n(856)\n224 \n(573)\n2,519 \n(Benefit from) provision for income taxes\n(27)\n69 \n78 \n514 \n(Loss) income from continuing operations\n(829)\n155 \n(651)\n2,005 \n(Loss) income from discontinued operations, net of tax\n(61)\n(40)\n53 \n(35)\nNet (loss) income\n(890)\n115 \n(598)\n1,970 \nOther comprehensive income, net of tax –\nFinancial derivatives\n(4)\n(35)\n(10)\n62 \nDefined benefit pension and other postretirement benefit plans\n3 \n2 \n(1)\n10 \nForeign currency translations\n1 \n127 \n190 \n30 \nTotal other comprehensive income, net of tax\n— \n94 \n179 \n102 \nComprehensive (loss) income\n$\n(890)\n$\n209 \n$\n(419)\n$\n2,072 \n \n34\nTable of Contents\nRESULTS OF OPERATIONS\nRevenues\n—Revenues increased by $69 million, or 1%, in the third quarter of 2025 compared to the second quarter of 2025. Higher sales volumes resulted in a 3% increase in revenue. Favorable foreign exchange impact resulted in a 2% increase in revenues. Lower average sales prices for many of our products resulted in a 4% decrease in revenues. \nRevenues decreased by $2,524 million, or 10%, in the first nine months of 2025 compared to the first nine months of 2024. Lower average sales prices for many of our products resulted in a 7% decrease in revenues. Lower sales volumes driven by lower demand led to a 4% decrease in revenues.  Favorable foreign exchange impact led to a 1% increase in revenues. \nCost of Sales\n—Cost of sales decreased by $50 million, or 1%, in the third quarter of 2025 compared to the second quarter of 2025 and by $927 million or 4% in the first nine months of 2025 compared to the first nine months of 2024 primarily due to lower feedstock and energy costs. Additionally, during the first quarter of 2025 we recognized $117 million in shutdown costs related to our plans to permanently close the European PO Joint Venture. \nImpairments\n—During the second quarter of 2025, we recognized a non-cash impairment charge of $32 million related to property, plant and equipment associated with the European assets classified as held for sale within our O&P EAI segment.\nDuring the third quarter of 2025, a prolonged downturn in, and outlook for, the European petrochemical and global automotive industries, particularly affecting our O&P-EAI and APS segments, combined with the sustained decline in our market capitalization, drove non-cash impairment charges totaling $1,202 million. Refer to Note 14 to our Consolidated Financial Statements for additional information. \nOperating Income\n—Operating income decreased by $1,016 million, or 356%, in the third quarter of 2025 compared to the second quarter of 2025. Operating income in our APS, O&P-EAI and Technology segments decreased  $775 million,  $370 million and $18 million,  respectively. These decreases were partially offset by increases in our O&P-Americas and I&D  segments of $104 million and $43 million, respectively. \nOperating income decreased by $2,847 million, or 113%, in the first nine months of 2025 compared to the first nine months of 2024. Operating income in our O&P-Americas, APS, O&P-EAI, I&D and Technology segments decreased by $998 million, $761 million, $531 million,  $478 million, and  $172 million, respectively.\nResults for each of our business segments are discussed further in the “Segment Analysis” section below.\n(Loss) Gain on Sale of Business\n—In the second quarter of 2024, we completed the sale of our EO&D business and associated production facilities located in Bayport, Texas and recognized a pre-tax gain of $293 million.\n(Loss) income from Equity Investments\n—Results from equity investments decreased by $15 million, in the third quarter of 2025 compared to the second quarter of 2025 primarily driven by increased costs and lower volumes for Saudi Arabian joint ventures in our O&P EAI segment. Equity income improved by $66 million in the first nine months of 2025 compared to the first nine months of 2024 as the first nine months of 2024 included equity losses recognized by a Chinese joint venture in our O&P-EAI segment. Our Chinese joint venture was subsequently fully impaired during the fourth quarter of 2024.\n35\nTable of Contents\nIncome Taxes\n—Our effective income tax rate for the third quarter of 2025 was 3.2% compared to 30.8% for the second quarter of 2025. The lower effective tax rate for the third quarter of 2025 was due to the relative impact of our tax rate drivers, primarily exempt income, due to lower earnings that decreased our effective income tax rate by 31.4 percentage points, coupled with the discrete tax recognition in the second quarter of 2025 of foreign exchange gains and losses of 16.8 percentage points.  To a lesser extent, the lower effective tax rate for the third quarter of 2025 was driven by non-cash impairments, for which there is largely no tax benefit, recognized discretely in the third quarter that decreased our effective income tax rate by 7.8 percentage points. These decreases were partially offset by the establishment of a valuation allowance against deferred tax assets, for which no tax benefit can be recognized, in the United Kingdom that increased the effective tax rate by 28.0 percentage points.\nOur effective income tax rate for the first nine months of 2025 was (13.6)% compared to 20.4% for the first nine months of 2024. The lower effective tax rate for the first nine months of 2025 was primarily due to non-cash impairments recognized discretely in the third quarter, for which there is largely no tax benefit, which decreased our effective tax rate by 36.7 percentage points. This decrease was coupled with the increased relative impact of our tax rate drivers, primarily exempt income, due to lower earnings that decreased our effective income tax rate by 21.9 percentage points. These decreases were partially offset by the establishment of a valuation allowance against deferred tax assets, for which no tax benefit can be recognized, in the United Kingdom and fluctuations in foreign exchange gains and losses recognized discretely in 2025, which increased the effective tax rate by 15.0 and 10.7 percentage points, respectively. \n(Loss) income from Discontinued Operations, Net of Tax\n—Loss (income) from discontinued operations decreased by $21 million in the third quarter of 2025 compared to the second quarter of 2025. During the third quarter of 2025, we recognized a $29 million loss from discontinued operations, net of tax, related to our Berre refinery primarily driven by the recognition of an environmental reserve. \n(Loss) income from discontinued operations increased $88 million in the first nine months of 2025 compared to the first nine months of 2024 primarily the result of the recognition a last-in, first-out (“LIFO”) benefit of $196 million, net of tax, for the liquidation of low cost inventory in the first quarter of 2025. The remainder of the change was primarily driven by increased costs as we ceased business operations at our Houston refinery in February of 2025.\nComprehensive (Loss) Income\n—Comprehensive (loss) income decreased by $1,099 million in the third quarter of 2025 compared to the second quarter of 2025, primarily due to the decrease in Net (loss) income and net unfavorable impacts of unrealized changes in foreign currency translation adjustments. Comprehensive (loss) income decreased by $2,491 million in the first nine months of 2025 compared to the first nine months of 2024, primarily due to the decrease in Net (loss) income. The components of Other comprehensive (loss) income are discussed below.\nFinancial derivatives designated as cash flow hedges, primarily our commodity swaps, led to an increase in Comprehensive (loss) income of $31 million and a decrease of $72 million in the third quarter of 2025 compared to the second quarter of 2025 and in the first nine months of 2025 compared to the first nine months of 2024, respectively, reflecting commodity price volatility. \nForeign currency translations decreased Comprehensive (loss) income by $126 million in the third quarter of 2025 compared to the second quarter of 2025, primarily due to changes in foreign currency exchange rates between the U.S. dollar and euro relative to the prior quarter, partially offset by the effective portion of our net investment hedges. Foreign currency translation increased Comprehensive (loss) income by $160 million in the first nine months of 2025 compared to the first nine months of 2024, primarily due to the weakening of the U.S. dollar relative to the euro, partially offset by the effective portion of our net investment hedges. \n36\nTable of Contents\nSegment Analysis\nWe use net (loss) income before interest, income taxes, and depreciation and amortization (“EBITDA”) as our measure of profitability for segment reporting purposes. This measure of segment operating results is used by our chief operating decision maker to assess the performance of and allocate resources to our operating segments. Intersegment eliminations and items that are not directly related or allocated to business operations, such as foreign exchange gains or losses and components of pension and other postretirement benefits other than service costs are included in “Other”. See the table below for a reconciliation of EBITDA to its nearest generally accepted accounting principles (“GAAP”) measure. \nThe following table presents the reconciliation of Net (loss) income to EBITDA for each of the periods presented:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nNet (loss) income\n$\n(890)\n$\n115 \n$\n(598)\n$\n1,970 \n(Benefit from) provision for income taxes\n(49)\n62 \n91 \n505 \nDepreciation and amortization\n350 \n332 \n1,005 \n1,133 \nInterest expense, net\n109 \n97 \n283 \n251 \nEBITDA\n$\n(480)\n$\n606 \n$\n781 \n$\n3,859 \nOur continuing operations are managed through five reportable segments: O&P-Americas, O&P-EAI, I&D, APS, and Technology. Revenues and other information by segment for the periods presented are reflected in the tables below:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues:\nO&P-Americas segment\n$\n2,606 \n$\n2,377 \n$\n7,464 \n$\n8,779 \nO&P-EAI segment\n2,587 \n2,704 \n7,891 \n8,396 \nI&D segment\n2,343 \n2,275 \n6,916 \n8,067 \nAPS segment\n870 \n917 \n2,695 \n2,809 \nTechnology segment\n115 \n137 \n372 \n497 \nOther, including intersegment eliminations\n(794)\n(752)\n(2,276)\n(2,962)\nTotal\n$\n7,727 \n$\n7,658 \n$\n23,062 \n$\n25,586 \nOperating (loss) income:\nO&P-Americas segment\n$\n246 \n$\n142 \n$\n473 \n$\n1,471 \nO&P-EAI segment\n(410)\n(40)\n(473)\n58 \nI&D segment\n194 \n151 \n336 \n814 \nAPS segment\n(765)\n10 \n(738)\n23 \nTechnology segment\n4 \n22 \n68 \n240 \nOther, including intersegment eliminations\n— \n— \n2 \n(91)\nTotal\n$\n(731)\n$\n285 \n$\n(332)\n$\n2,515 \n37\nTable of Contents\nThree Months Ended\nNine Months Ended\nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nDepreciation and amortization:\nO&P-Americas segment\n$\n165 \n$\n164 \n$\n484 \n$\n460 \nO&P-EAI segment\n42 \n38 \n119 \n162 \nI&D segment\n109 \n99 \n307 \n304 \nAPS segment\n23 \n20 \n63 \n64 \nTechnology segment\n11 \n11 \n32 \n31 \nTotal\n$\n350 \n$\n332 \n$\n1,005 \n$\n1,021 \n(Loss) income from equity investments:\nO&P-Americas segment\n$\n6 \n$\n4 \n$\n17 \n$\n12 \nO&P-EAI segment\n(14)\n3 \n(17)\n(65)\nI&D segment\n— \n— \n— \n(13)\nTotal\n$\n(8)\n$\n7 \n$\n— \n$\n(66)\nImpairments:\nO&P-Americas segment\n$\n9 \n$\n— \n$\n9 \n$\n— \nO&P-EAI segment\n411 \n32 \n443 \n3 \nI&D segment\n— \n— \n— \n2 \nAPS segment\n782 \n— \n782 \n— \nTotal\n$\n1,202 \n$\n32 \n$\n1,234 \n$\n5 \n(Loss) gain on sale of business:\nI&D segment\n$\n— \n$\n— \n$\n— \n$\n293 \nAPS segment\n(6)\n— \n(6)\n— \nTotal\n$\n(6)\n$\n— \n$\n(6)\n$\n293 \nOther (expense) income, net:\nO&P-Americas segment\n$\n1 \n$\n3 \n$\n8 \n$\n6 \nO&P-EAI segment\n1 \n1 \n9 \n10 \nI&D segment\n— \n36 \n40 \n25 \nAPS segment\n2 \n2 \n13 \n7 \nOther, including intersegment eliminations\n(6)\n(13)\n(22)\n(20)\nTotal\n$\n(2)\n$\n29 \n$\n48 \n$\n28 \nEBITDA:\nO&P-Americas segment\n$\n418 \n$\n313 \n$\n982 \n$\n1,949 \nO&P-EAI segment\n(381)\n2 \n(362)\n165 \nI&D segment\n303 \n286 \n683 \n1,423 \nAPS segment\n(746)\n32 \n(668)\n94 \nTechnology segment\n15 \n33 \n100 \n271 \nDiscontinued operations\n(83)\n(47)\n66 \n68 \nOther, including intersegment eliminations\n(6)\n(13)\n(20)\n(111)\nTotal\n$\n(480)\n$\n606 \n$\n781 \n$\n3,859 \n38\nTable of Contents\nOlefins and Polyolefins-Americas Segment \nOverview\n—EBITDA increased in the third quarter of 2025 compared to the second quarter of 2025 primarily due to higher olefins margins. EBITDA decreased in the first nine months of 2025 relative to the first nine months of 2024 as margins decreased for most businesses.\nEthylene Raw Materials—\nEthylene and its co-products are produced from two major raw material groups:\n•\nnatural gas liquids (“NGLs”), principally ethane and propane, the prices of which are generally affected by natural gas prices; and\n•\ncrude oil-based liquids (“liquids” or “heavy liquids”), including naphtha, condensates and gas oils, the prices of which are generally related to crude oil prices.\nWe have flexibility to vary the raw material mix and process conditions in our U.S. olefins plants in order to maximize profitability as market prices fluctuate for both feedstocks and products. Although prices of crude-based liquids and natural gas liquids are generally related to crude oil and natural gas prices, during specific periods the relationships among these materials and benchmarks may vary significantly. In the third and second quarter of 2025, and the first nine months of 2025 and 2024, approximately 75% to 80% of the raw materials used in our North American crackers was ethane.\nThe following table sets forth selected financial information for the O&P-Americas segment including Income from equity investments, which is a component of EBITDA:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n2,606 \n$\n2,377 \n$\n7,464 \n$\n8,779 \nIncome from equity investments\n6 \n4 \n17 \n12 \nEBITDA\n418 \n313 \n982 \n1,949 \nRevenue\n—Revenues for our O&P-Americas segment increased by $229 million, or 10% in the third quarter of 2025 compared to the second quarter of 2025 and decreased by $1,315 million, or 15%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Higher volumes from improved operating rates resulted in a 13% increase in revenue. Lower average sales prices, driven by increased polyethylene market supply, led to a 3% decrease in revenue.\nFirst nine months of 2025 versus first nine months of 2024\n—Lower volumes driven by planned and unplanned outages resulted in a 9% decrease in revenue. Lower average sales prices driven by a lower oil price environment and ample product supply resulted in a 6% decrease in revenue. \nEBITDA\n—EBITDA increased by $105 million, or 34%, in the third quarter of 2025 compared to the second quarter of 2025 and decreased by $967 million, or 50%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Higher olefins results led to a 49% increase in EBITDA driven by improved margins primarily from lower cost of ethylene due to co-product contribution. Lower polymer results led to a 15% decrease in EBITDA driven by lower margins as sales prices did not keep up with higher monomer cost due to market conditions. \n39\nTable of Contents\nFirst nine months of 2025 versus first nine months of 2024\n—Lower olefins results led to a 32% decrease in EBITDA driven by lower margins from a decrease in co-product contribution combined with higher energy costs. Lower polyethylene results led to a 16% decrease in EBITDA primarily driven by lower product margins attributed to unfavorable macroeconomic conditions.\nOlefins and Polyolefins-Europe, Asia, International Segment\nOverview\n—EBITDA decreased in the third quarter of 2025 compared to the second quarter of 2025 and in the first nine months of 2025 compared to the first nine months of 2024, primarily due to the recognition of a $400 million non-cash goodwill impairment charge in the third quarter of 2025. See Note 14 to our Consolidated Financial Statements for additional information.\nEthylene Raw Materials\n—In Europe, naphtha is the primary raw material for our ethylene production and represented approximately 60% to 70% of the raw materials used in the third and second quarter of 2025, and the first nine months of 2025 and 2024.\nThe following table sets forth selected financial information for the O&P-EAI segment including (Loss) income from equity investments, which is a component of EBITDA:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n2,587 \n$\n2,704 \n$\n7,891 \n$\n8,396 \n(Loss) income from equity investments\n(14)\n3 \n(17)\n(65)\nEBITDA\n(381)\n2 \n(362)\n165 \nRevenue\n—Revenues decreased by $117 million, or 4%, in the third quarter of 2025 compared to the second quarter of 2025 and by $505 million, or 6%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Lower volumes resulted in a revenue decrease of 4% primarily due to lower demand. Lower average sales prices primarily as a result of a decrease in the price of naphtha drove a 3% decrease in revenue. Favorable foreign exchange impacts resulted in a 3% increase in revenue.    \nFirst nine months of 2025 versus first nine months of 2024\n—Lower average sales prices primarily as a result of a decrease in the price of naphtha drove a 7% decrease in revenue. Lower volumes resulted in a decrease of 2% due to lower demand and unplanned downtime. Favorable foreign exchange impacts resulted in a 3% increase in revenues.\nEBITDA\n—EBITDA decreased by $383 million in the third quarter of 2025 compared to the second quarter of 2025 and by $527 million in the first nine months of 2025 compared to the first nine months of 2024. \nDuring the third quarter of 2025, we recognized a $400 million non-cash goodwill impairment charge related to a prolonged downturn in, and outlook for, the European petrochemical industry. See Note 14 to our Consolidated Financial Statements for additional information.\nThird quarter of 2025 versus second quarter of 2025\n— Improved olefins results contributed to an increase in EBITDA equally driven by improved margins from lower feedstock costs and higher volumes with less unplanned downtime. This improvement was offset by lower polymer margins on lower average sales prices. The remaining change was primarily due to recognition of the non-cash goodwill impairment charge in the third quarter of 2025.\nFirst nine months of 2025 versus first nine months of 2024\n—Lower polyethylene results led to a 58% decrease in EBITDA driven by lower margins reflecting the weakening economic environment. The remaining change was primarily due to the recognition of the non-cash goodwill impairment charge in the third quarter of 2025.\n40\nTable of Contents\nIntermediates and Derivatives Segment \nOverview\n—EBITDA increased in the third quarter of 2025 relative to the second quarter of 2025 as a result of higher margins from oxyfuel and related products, partially offset by a decrease in intermediate chemicals and propylene oxide and derivatives results. \nEBITDA decreased in the first nine months of 2025 compared to the first nine months of 2024 as a result of lower oxyfuels and related products margins, shutdown costs related to our European PO Joint Venture recognized in the first quarter of 2025, and the absence of a gain on sale of our EO&D business recognized in the second quarter of 2024. \nThe following table sets forth selected financial information for the I&D segment including Loss from equity investments, which is a component of EBITDA:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n2,343 \n$\n2,275 \n$\n6,916 \n$\n8,067 \nLoss from equity investments\n— \n— \n— \n(13)\nEBITDA\n303 \n286 \n683 \n1,423 \nRevenue\n—Revenues increased by $68 million, or 3%, in the third quarter of 2025 compared to the second quarter of 2025 and decreased by $1,151 million, or 14%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Higher average sales prices resulted in a 3% increase in revenue primarily due to high octane values in the U.S. Gulf Coast and Europe driven by tight supply. Sales volumes decreased due to unplanned outages resulting in a 1% decrease in revenue. Favorable foreign exchange impacts resulted in a 1% increase in revenue.\nFirst nine months of 2025 versus first nine months of 2024\n—Lower average sales prices resulted in a 14% decrease in revenue driven primarily by oxyfuels and related products as a result of lower crude, gasoline crack spreads, and blend premiums. A decline in sales volumes due to the second quarter of 2024 sale of our EO&D business and associated production facilities located in Bayport, Texas resulted in a 1% decrease in revenue. Favorable foreign exchange impacts resulted in a 1% increase in revenue.\nEBITDA\n—EBITDA increased by $17 million, or 6%, in the third quarter of 2025 compared to the second quarter of 2025 and decreased by $740 million, or 52%, in the first nine months of 2025 compared to the first nine months of 2024.\nIn May 2024, we sold our U.S. Gulf Coast-based EO&D business along with the production facilities located in Bayport, TX and recognized a pre-tax gain of $293 million during the second quarter of 2024.\nIn March 2025, we announced our plans to permanently close the European PO Joint Venture, resulting in the recognition of $117 million in shutdown costs during the first quarter of 2025.\nThird quarter of 2025 versus second quarter of 2025\n—Oxyfuels and related products results led to a 39% increase in EBITDA primarily due to higher margins primarily driven by higher octane values. Intermediate chemicals results led to an EBITDA decrease of 26% due to margin compression resulting from global supply normalizing as well as the absence of a $36 million gain on sale of precious metals recognized during the second quarter of 2025. Propylene oxide and derivatives results led to a 6% decrease in EBITDA primarily from lower sales volumes due to unplanned outages. \n41\nTable of Contents\nFirst nine months of 2025 versus first nine months of 2024\n—Oxyfuels and related products results led to a 22% decline in EBITDA largely due to weaker demand and global oversupply. The remaining change was primarily due to the recognition of a gain on sale of our EO&D business in 2024 and costs incurred related to the announced closure of our European PO Joint Venture in the first quarter of 2025.\nAdvanced Polymer Solutions Segment\nOverview\n—EBITDA decreased in the third quarter of 2025 relative to the second quarter of 2025 and in the first nine months of 2025 relative to the first nine months of 2024, primarily due to the recognition of $782 million of non-cash impairment charges in the third quarter of 2025. See Note 14 to our Consolidated Financial Statements for additional information.\nThe following table sets forth selected financial information for the APS segment:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n870 \n$\n917 \n$\n2,695 \n$\n2,809 \nEBITDA\n(746)\n32 \n(668)\n94 \nRevenue\n—Revenues decreased by $47 million, or 5%, in the third quarter of 2025 compared to the second quarter of 2025 and by $114 million, or 4%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Sales volumes decreased resulting in a 5% decrease in revenue stemming from weaker automotive demand and challenging market conditions. Lower average sales prices resulted in a 2% decrease in revenue. Favorable foreign exchange impacts resulted in a revenue increase of 2%.\nFirst nine months of 2025 versus first nine months of 2024\n—Sales volumes decreased resulting in a 4% decrease in revenue stemming from weaker automotive demand. Lower average sales prices resulted in a 1% decrease in revenue. Favorable foreign exchange impacts resulted in a revenue increase of 1%.\nEBITDA\n—EBITDA decreased by $778 million in the third quarter of 2025 compared to the second quarter of 2025 and by $762 million or 811% in the first nine months of 2025 compared to the first nine months of 2024.\nDuring the third quarter of 2025, we recognized $782 million of non-cash impairment charges related to a prolonged downturn in, and outlook for, the global automotive industry. See Note 14 to our Consolidated Financial Statements for additional information. \nThird quarter of 2025 versus second quarter of 2025\n—Lower volumes primarily from lower seasonal demand and challenging market conditions resulted in a 41% decrease in EBITDA. Higher margins related to lower fixed costs resulted in a 59% increase in EBITDA. The remaining decrease was primarily due to the recognition of non-cash impairment charges recognized in the third quarter of 2025.   \nFirst nine months of 2025 versus first nine months of 2024\n—Improved margins related to lower fixed costs drove a 61% increase in EBITDA. This improvement in\n \nEBITDA was offset by non-cash impairment charges recognized in the third quarter of 2025.\n42\nTable of Contents\nTechnology Segment\nOverview\n—EBITDA decreased in the third quarter of 2025 compared to the second quarter of 2025, and in the first nine months of 2025 compared to the first nine months of 2024, primarily due to lower licensing results as the planned pace of global polyolefin capacity additions moderate.\nThe following table sets forth selected financial information for the Technology segment:\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nJune 30,\nSeptember 30,\nSeptember 30,\nMillions of dollars\n2025\n2025\n2025\n2024\nSales and other operating revenues\n$\n115 \n$\n137 \n$\n372 \n$\n497 \nEBITDA\n15 \n33 \n100 \n271 \nRevenue\n—Revenues decreased by $22 million, or 16%, in the third quarter of 2025 compared to the second quarter of 2025 and by $125 million, or 25%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Lower licensing revenues from fewer contracts reaching significant milestones drove a 10% decrease in revenues. Lower catalyst volumes resulted in an 11% decrease in revenues due to lower demand. Higher average catalyst sales price resulted in a 3% increase in revenues. Favorable foreign exchange impact resulted in a 2% increase in revenues. \nFirst nine months of 2025 versus first nine months of 2024\n—Lower licensing revenues resulting from recognition of revenue on fewer contracts drove a 22% decrease in revenues. Lower catalyst volume resulted in a 5% decrease in revenues due to continued lower polymer end use demand. Favorable foreign exchange impact resulted in a 2% increase in revenues.\nEBITDA\n—EBITDA decreased by $18 million, or 55%, in the third quarter of 2025 compared to the second quarter of 2025 and by $171 million, or 63%, in the first nine months of 2025 compared to the first nine months of 2024.\nThird quarter of 2025 versus second quarter of 2025\n—Licensing results led to a 36% decrease in EBITDA as fewer contracts with lower average values reached significant milestones. Lower catalyst demand resulted in a 30% decrease in EBITDA. Higher catalyst margins due to lower costs resulted in a 6% increase in EBITDA. Favorable foreign exchange impact resulted in a 6% increase in EBITDA.  \nFirst nine months of 2025 versus first nine months of 2024\n—Licensing results led to a 41% decrease in EBITDA as fewer contracts with lower average values reached significant milestones. Lower catalyst margins resulted in an 18% decrease in EBITDA as a result of unfavorable product mix and higher operating cost from increased maintenance. Lower catalyst demand resulted in a 7% decrease of EBITDA. Favorable foreign exchange impact resulted in a 3% EBITDA increase.\n43\nTable of Contents\n FINANCIAL CONDITION\nThe following table summarizes operating, investing and financing cash flow activities:\n \nNine Months Ended\nSeptember 30,\nMillions of dollars\n2025\n2024\nCash provided by (used in):\nOperating activities\n$\n755 \n$\n1,904 \nInvesting activities\n(1,373)\n(1,306)\nFinancing activities\n(1,046)\n(1,377)\nOperating Activities\n—Cash provided by\n \noperating activities of \n$755 million \nin the first nine months of 2025 primarily reflected net loss adjusted for non-cash items, $385 million of tax payments which includes $235 million in U.S. Federal corporate income tax payments deferred from 2024 into 2025 under Hurricane Beryl disaster relief, and a $583 million change in Accounts payable which was driven by the timing of payments.\nCash \nprovided \nby operating activities of $1,904 million in the first nine months of 2024 primarily reflected earnings adjusted for non-cash items and cash activities primarily related to Accounts receivable and Inventories. Increased Accounts receivable of $413 million was primarily driven by higher average sales prices in our O&P-Americas and O&P-EAI segments. The increase of $433 million in Inventories was primarily due to inventory build for planned outages within our O&P-Americas and O&P-EAI segments coupled with inventory rebuild from low year-end levels at our I&D segment.\nInvesting Activities\n—Capital expenditures in the first nine months of 2025 and 2024 totaled $1,428 million and $1,335 million, respectively, of which approximately 65% and 75%, respectively, support sustaining maintenance such as turnaround activities at several sites as well as other plant health, safety and environmental projects. The remaining expenditures support profit-generating growth projects.\nIn the first nine months of 2025, foreign currency contracts with an aggregate notional value of €750 million expired. Upon settlement of these foreign currency contracts, we paid €750 million ($877 million at the expiry spot rate) to our counterparties and received $843 million from our counterparties. Additionally, in March 2025 we received $59 million upon termination and cash settlement of our cross-currency interest rate swaps, designated as net investment hedges, maturing in 2025 and 2030.\nIn the second quarter of 2024 we sold our EO&D business for $700 million and invested approximately $500 million to acquire a 35% stake in the NATPET joint venture in Saudi Arabia.\nIn the first nine months of 2024, foreign currency contracts with an aggregate notional value of €400 million expired. Upon settlement of these foreign currency contracts, we paid €400 million ($445 million at the expiry spot rate) to our counterparties and received $463 million from our counterparties.\nFinancing Activities\n—We made dividend payments totaling $1,321 million and $1,283 million in the first nine months of 2025 and 2024, respectively. Additionally, we made payments of $201 million and $117 million to repurchase outstanding ordinary shares in the first nine months of 2025 and 2024, respectively.\nIn May 2025, we issued $500 million of 6.150% guaranteed notes due 2035. Net proceeds from the sale of the notes were used for general corporate purposes, including the repayment of $492 million of outstanding principal of our 2025 Notes in October 2025.\nIn February 2024, we issued $750 million of 5.5% guaranteed notes due 2034. In March 2024, we repaid the $775 million remaining of outstanding principal on our 5.75% senior notes due 2024. \nFor additional detail regarding these debt transactions see Note 8 to the Consolidated Financial Statements.\n44\nTable of Contents\nIn April 2024, foreign currency contracts with an aggregate notional value of €784 million expired. Upon settlement of these foreign currency contracts, which were designated as cash flow hedges, we paid €784 million ($835 million at the expiry spot rate) to our counterparties and received $849 million from our counterparties.\nLiquidity and Capital Resources\nOverview\nWe plan to fund our working capital, capital expenditures, debt service, dividends and other cash requirements with our current available liquidity and cash from operations, which could be affected by general economic, financial, competitive, legislative, regulatory, business and other factors, many of which are beyond our control. \nDebt repayment, and the purchase of shares under our share repurchase authorization, may be funded from cash and cash equivalents, cash from short-term investments, cash from operating activities, proceeds from the issuance of debt, or a combination thereof.\nAs part of our overall capital allocation strategy, we plan to provide returns to shareholders in the form of dividends and share repurchases. Over the long-term, we are targeting shareholder returns of 70% of free cash flow, defined as net cash provided by operating activities less capital expenditures; however, our returns may vary in the event of significant or unforeseen changes in business circumstances, mergers or acquisitions, or the continuation of the current downturn.  We intend to continue to declare and pay quarterly dividends, after giving consideration to our cash balances and expected results from operations. Our focus on funding our dividends is balanced with our commitment to maintain an investment grade balance sheet as part of our capital allocation strategy and there can be no assurance that any dividends or distributions will be declared or paid in the future.    \nCash Improvement Plan\nIn April 2025, to address ongoing macroeconomic volatility, we announced a Cash Improvement Plan. The plan now targets a $600 million run-rate in annualized savings for 2025. The Cash Improvement Plan includes three initiatives: (1) deferral of $200 million in capital spending; (2) $200 million net reduction in Accounts receivable, Inventory and Accounts payable; and (3) fixed cost reductions of $200 million, excluding one-time implementation costs estimated to be less than $50 million. We will continue to prioritize capital spending on maintenance and certain growth projects. The net reduction in Accounts receivable, Inventory and Accounts payable and fixed cost reductions are relative to our internal 2025 plan. Fixed cost reductions may be achieved through contract changes, reductions in employees and employee-related expenses or other means. As of September 30, 2025, we have incurred $27 million in costs associated with the Cash Improvement Plan and are on track to achieve our targets.\nCapital Budget\nIn 2025, we plan to invest approximately $1.7 billion in capital expenditures. Approximately $1.2 billion of the budget is planned for sustaining maintenance, with the remaining budget supporting profit-generating growth projects. While we continue to invest in \nMoReTec-\n1 as planned, we are delaying construction to expand our propylene production capacity at our Channelview Complex (Flex-2) and delaying other capital projects to preserve capital during the cycle downturn. In 2026, we plan on investing up to $1.2 billion in capital expenditures.\nProposed Sale of Certain European Assets\nIn 2025, we entered into an agreement for the sale of select European olefins & polyolefins assets and the associated business. The sites to be sold have been part of the previously announced European strategic assessment and are located in Berre l’Etang (France), Münchsmünster (Germany), Carrington (United Kingdom), and Tarragona (Spain). The sale is currently expected to close in the first half of 2026. In connection with the sale, we anticipate making a cash contribution of approximately $300 million to the disposal group prior to closing. See Note 4 to our Consolidated Financial Statements for additional information.\n45\nTable of Contents\nCash and Liquid Investments\nAs of September 30, 2025, we had Cash and cash equivalents totaling $1,784 million, which includes $487 million in jurisdictions outside of the U.S., which is largely held within the United Kingdom. There are currently no legal or economic restrictions that would materially impede our transfers of cash.\nCredit Arrangements\nAs of September 30, 2025, we had total debt, including current maturities, of $11,856 million. Additionally, we had $211 million of outstanding letters of credit, bank guarantees and surety bonds issued under uncommitted credit facilities.\nWe had total unused availability under our credit facilities of $4,650 million as of September 30, 2025, which included the following:\n \n•\n$3,750 million under our $3,750 million Senior Revolving Credit Facility. This facility supports our $2,500 million commercial paper program. Availability under this facility is net of outstanding borrowings, outstanding letters of credit provided under the facility and notes issued through our commercial paper program.  As of September 30, 2025, we had no outstanding commercial paper and no borrowings or letters of credit outstanding under this facility; and\n•\n$900 million under our $900 million U.S. Receivables Facility. Availability under this facility is subject to a borrowing base of eligible receivables, which is reduced by outstanding borrowings and letters of credit, if any. As of September 30, 2025, we had no borrowings or letters of credit outstanding under this facility. In May 2025, we extended the term of the facility to June 2026 in accordance with the terms of the agreement.\nIn September 2025, we amended the Senior Revolving Credit Facility primarily to increase the Maximum Leverage Ratio (as defined in the Credit Agreement) through 2027 unless we elect to terminate such provisions sooner. Included in the amendment are certain limitations, including restrictions on dividend increases, if our leverage ratio is greater than or equal to 4.00 to 1.00, and share repurchases except to offset dilution. Additionally, the modification to the Maximum Leverage Ratio was incorporated into the U.S. Receivables Facility. For additional detail see Note 8 to the Consolidated Financial Statements.\nAt any time and from time to time, we may repay or redeem our outstanding debt, including purchases of our outstanding bonds in the open market, through privately negotiated transactions or a combination thereof, in each case using cash and cash equivalents, cash from our short-term investments, cash from operating activities, proceeds from the issuance of debt or proceeds from asset divestitures. Any repayment or redemption of our debt will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. In connection with such repurchases or redemptions, we may incur cash and non-cash charges, which could be material in the period in which they are incurred.\nShare Repurchases\nIn May 2025, our shareholders approved a proposal to authorize us to repurchase up to 34.0 million ordinary shares through November 23, 2026, which superseded any prior repurchase authorizations. Our share repurchase authorization does not have a stated dollar amount, and purchases may be made through open market purchases, private market transactions or other structured transactions. Repurchased shares could be retired or used for general corporate purposes, including for various employee benefit and compensation plans. The maximum number of shares that may yet be purchased is not necessarily an indication of the number of shares that will ultimately be purchased. In September 2025, we amended our Senior Revolving Credit Facility which now restricts share repurchases, except to offset dilution. During the first half of 2025, we purchased approximately 3.0 million shares under our share repurchase authorizations for $201 million.\nAs of October 29, 2025, we had approximately 34.0 million shares remaining under the current authorization. The timing and amounts of additional shares repurchased, if any, will be determined based on our evaluation of market conditions and other factors, including any additional authorizations approved by our shareholders. For additional information related to our share repurchase authorizations, see Note 12 to the Consolidated Financial Statements.\n46\nTable of Contents\nCURRENT BUSINESS OUTLOOK\nIn the fourth quarter of 2025, year-end seasonality and lower operating rates are expected to impact results across most businesses. In North America, higher natural gas and feedstock costs are likely to pressure integrated polyolefins margins. In Europe, weak industrial and consumer demand is expected to persist. Global capacity rationalizations and anti-involution measures in China are supporting a more constructive mid-term outlook for the industry. Industry downtime supported oxyfuels margins during October, but seasonally higher costs for feedstocks and lower octane values are expected to pressure oxyfuels profitability for the remainder of the fourth quarter. In our APS segment, pricing pressure persists, but cost reduction initiatives are expected to offset some of the impact. \nIn November 2025, we will idle our larger cracker in Wesseling, Germany and one of the propylene oxide/styrene monomer units in Channelview, Texas. Each asset will be down for about 40 days. This downtime will allow for maintenance activities while aligning production with global demand and reducing working capital. We expect fourth quarter operating rates of 80% for our O&P-Americas assets, 60% for our European O&P-EAI assets and 75% for our I&D assets.  \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nImpairments—\nWe test goodwill for impairment annually in the fourth quarter, or more frequently when events or changes in circumstances indicate that the fair value of a reporting unit may be below its carrying amount.\nIn the third quarter of 2025, we performed a quantitative impairment assessment of the reporting units within our O&P-EAI and APS segments, resulting in the recognition of non-cash impairment charges of $1,182 million. Refer to Note 14 to our Consolidated Financial Statements. \nThe process of valuing each reporting unit is inherently subjective as valuation models require the application of significant estimates and the use of unobservable inputs including projected operating results, economic conditions, expected cash flows and discount rates and other assumptions based on a market participant perspective. The discount rates applied in our cash flow models reflect considerations such as prevailing market and economic conditions, the risk profile of the projected cash flows, and the return expectations of market participants. While we believe our fair value estimates are reasonable, actual results may differ from those projections.\nThe impairments recognized in our O&P-EAI and APS segments resulted in a full write-down of Goodwill for these segments, as well as Property, plant and equipment for the impacted asset groups. Intangible assets remaining within our APS segment after the recognition of impairment charges are immaterial. We believe that any reasonable variation, whether favorable or unfavorable, in a significant input would not have a material effect on Net (loss) income. In addition, due to the complexity and interdependence of the assumptions underlying the impairment analysis, it is not practicable to quantify the effect of individual assumptions on Net (loss) income.\nACCOUNTING AND REPORTING CHANGES\nFor a discussion of the potential impact of new accounting pronouncements on the Consolidated Financial Statements, see Note 2 to the Consolidated Financial Statements.\n47\nTable of Contents\nCAUTIONARY STATEMENT FOR THE PURPOSES OF THE “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nThis report includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 (the “Securities Act”) and Section 21E of the Securities Exchange Act of 1934 (the “Exchange Act”). You can identify our forward-looking statements by the words “anticipate,” “estimate,” “believe,” “continue,” “could,” “intend,” “may,” “plan,” “potential,” “predict,” “should,” “will,” “expect,” “objective,” “projection,” “forecast,” “goal,” “guidance,” “outlook,” “effort,” “target” and similar expressions.\nWe based forward-looking statements on our current expectations, estimates and projections of our business and the industries in which we operate. We caution you that these statements are not guarantees of future performance. They involve assumptions about future events that, while made in good faith, may prove to be incorrect, and involve risks and uncertainties we cannot predict. Our actual outcomes and results may differ materially from what we have expressed or forecast in the forward-looking statements. Any differences could result from a variety of factors, including the following:\n \n•\nthe cost of raw materials represents a substantial portion of our operating expenses, and energy costs generally follow price trends of crude oil, natural gas liquids and/or natural gas; price volatility can significantly affect our results of operations and we may be unable to pass raw material and energy cost increases on to our customers due to the significant competition that we face, the commodity nature of our products and the time required to implement pricing changes;\n•\nour operations in the United States (“U.S.”) have benefited from low-cost natural gas and natural gas liquids; decreased availability of these materials (for example, from their export or regulations impacting hydraulic fracturing in the U.S.) could reduce the current benefits we receive;\n•\nif crude oil prices are low relative to U.S. natural gas prices, we could see less benefit from low-cost natural gas and natural gas liquids and it could have a negative effect on our results of operations;\n•\nindustry production capacities and operating rates may lead to periods of oversupply and low profitability and our future operating and financial results are dependent on the pace of global capacity rationalization;\n•\nwe may face unplanned operating interruptions (including leaks, explosions, fires, weather-related incidents, mechanical failures, unscheduled downtime, supplier disruptions, labor shortages, strikes, work stoppages or other labor difficulties, transportation interruptions, spills and releases and other environmental incidents) at any of our facilities, which would negatively impact our operating results;\n•\nchanges in general economic, business, political and regulatory conditions in the countries or regions in which we operate could increase our costs through tariffs or otherwise, limit or disrupt trade, restrict our operations and reduce our operating results;\n•\nour ability to execute our organic growth plans may be negatively affected by our ability to complete projects on time and on budget;\n•\nthe successful outcome of any planned sale of our assets, or our ability to acquire or dispose of product lines or businesses could disrupt our business and harm our financial condition;\n•\nuncertainties associated with worldwide economies could create reductions in demand and pricing, as well as increased counterparty risks, which could reduce liquidity or cause financial losses resulting from counterparty default;\n•\nthe negative outcome of any legal, tax and environmental proceedings or changes in laws or regulations regarding legal, tax and environmental matters may increase our costs, reduce demand for our products, or otherwise limit our ability to achieve savings under current regulations;\n•\nany loss or non-renewal of favorable tax treatment under tax agreements or tax treaties, or changes in tax laws, regulations or treaties, may substantially increase our tax liabilities;\n48\nTable of Contents\n•\nwe may be required to reduce production or idle certain facilities because of the cyclical and volatile nature of the supply-demand balance in the chemical and refining industries, which would negatively affect our operating results;\n•\nwe rely on continuing technological innovation, and an inability to protect our technology, or others’ technological developments could negatively impact our competitive position; \n•\nwe have significant international operations, and fluctuations in exchange rates, valuations of currencies and our possible inability to access cash from operations in certain jurisdictions on a tax-efficient basis, if at all, could negatively affect our liquidity and our results of operations;\n•\nwe are subject to the risks of doing business at a global level, including wars, terrorist activities, political and economic instability and disruptions and changes in governmental policies, which could cause increased expenses, decreased demand or prices for our products and/or disruptions in operations, all of which could reduce our operating results;\n•\nif we are unable to achieve our emission reduction, circularity, or other sustainability targets, it could result in reputational harm, changing investor sentiment regarding investment in our stock or a negative impact on our access to and cost of capital;\n•\nour ability to execute and achieve the expected results of our value enhancement program and cash improvement plan;\n•\nour ability to maintain our investment-grade credit rating and execute our capital allocation strategy, including our ability to pay dividends; \n•\nif we are unable to comply with the terms of our credit facilities, indebtedness and other financing arrangements, those obligations could be accelerated, which we may not be able to repay; and\n•\nwe may be unable to incur additional indebtedness or obtain financing on terms that we deem acceptable, including for refinancing of our current obligations; higher interest rates and costs of financing would increase our expenses.\nAny of these factors, or a combination of these factors, could materially affect our future results of operations and the ultimate accuracy of the forward-looking statements. Our management cautions against putting undue reliance on forward-looking statements or projecting any future results based on such statements or present or prior earnings levels.\nAll subsequent written and oral forward-looking statements attributable to us or any person acting on our behalf are expressly qualified in their entirety by the cautionary statements contained or referred to in this section and any other cautionary statements that may accompany such forward-looking statements. Except as otherwise required by applicable law, we disclaim any duty to update any forward-looking statements."
}