{
  "source_file": "lyv-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\n    \nBUSINESS\nOur Company\nWe believe that we are the largest live entertainment company in the world, connecting over 788 million fans across all of our concerts and ticketing platforms in 51 countries during 2024.\nWe believe we are the largest producer of live music concerts in the world, based on total fans that attend Live Nation events as compared to events of other promoters, connecting 151 million fans to approximately\n \n11,000 artists at 54,000 events in 2024. Live Nation owns, operates, has exclusive booking rights for or has an equity interest for which we have a significant influence in 394 venues globally, including\n House of Blues\n®\n music venues and prestigious locations such as\n The Fillmore\n®\n in San Francisco, \nBrooklyn Bowl\n® \nin New York City\n, \nthe Hollywood Palladium in Los Angeles, the Moody Center\n©\n arena in Austin, the Ziggo Dome in Amsterdam, 3Arena in Dublin, Royal Arena in Copenhagen and Spark Arena in Auckland. We believe we are one of the world’s leading artist management companies based on the number of artists represented. Our artist management companies manage music artists and acts across all music genres.\nWe believe we are the world’s leading live entertainment ticketing sales and marketing company, based on the number of tickets we sell. Ticketmaster provides ticket sales services and marketing and distribution globally through \nwww.ticketmaster.com \nand\n www.livenation.com \nand our mobile apps, other websites and numerous retail outlets, distributing over 637 million tickets through our systems in 2024. Ticketmaster serves approximately 11,500 clients worldwide across multiple event categories, providing ticketing services for leading arenas, stadiums, festival and concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums and theaters.\nWe believe our global footprint is one of the world’s largest music advertising networks for corporate brands and includes one of the world’s leading ecommerce websites based on a comparison of gross sales of top internet retailers.\nOur principal executive offices are located at 9348 Civic Center Drive, Beverly Hills, California 90210 (telephone: 310-867-7000). Our principal website is \nwww.livenationentertainment.com\n. Live Nation is listed on the New York Stock Exchange, trading under the symbol “LYV.”\n2\nOur Strategy\nOur strategy is to grow our global leadership position in live entertainment, promote more shows, sell more tickets and partner with more sponsors, thereby increasing our revenue, earnings and cash flow. We serve artists, venues and sports teams and leagues to secure content and tickets; we invest in technology to build innovative products which advance our ticketing, digital presence, including mobile platforms, and advertising; and we are paid by advertisers that want to connect their brands with our passionate fan base. \nOur core businesses surrounding the promotion of live events include ticketing and sponsorship and advertising. We believe our focus on growing these businesses will increase shareholder value as we continue to enhance our revenue streams and achieve economies of scale with our global platforms. We also continue to strengthen our core operations, further expanding into global markets and optimizing our cost structure. We execute on our strategy and thereby grow and innovate through the initiatives listed below. \n•\nExpand our Concert Platform\n. We will deliver more shows, grow our fan base and increase our ticket sales by continuing to build our portfolio of concerts globally, expanding our business into additional top global music markets, and further building our presence in existing markets. This includes investing capital expenditures in new venues and enhancements to existing venues. Through our culture of serving artists and a focus on supporting the development of emerging artists, we believe we can continue to expand our concert base.\n•\nGrow our Revenue per Show.\n We will grow our revenue per show across our venues through more effective ticket pricing, broader ticketing distribution and more targeted promotional marketing. We will also grow our onsite fan monetization by improving ease of purchase, through improved onsite food and beverage and other products, merchandising, and enhanced experiences for our fans.\n•\nInvest in our Ticketing Platform\n. We will continue to invest in our ticketing enterprise system and develop innovative products to better serve our enterprise clients and continue to build our global client base. These include technological and digital transformations, enhanced marketing capabilities, and improved analytical tools to meet the needs of venues, event organizers and our fans.\n•\nGrow our Marketplace Capabilities\n. We are focused on selling tickets through a wide set of sales channels including mobile, online and affiliate partners while continuing to broaden our digital rollout. We will grow the volume of secondary tickets sold through a trusted environment for fan ticket exchanges, allowing our fans to have a dependable, secure destination for secondary ticket acquisition for all events. Within this, we will continue to invest in tools that reduce fraud and help artists and teams determine how to get their tickets into the hands of real fans. Lastly, we are focused on leveraging our platform by growing non-service fee revenue streams including insurance, additional enterprise tools, payment integration and other upsells.\n•\nGrow Sponsorship and Advertising Partnerships\n. We will continue to drive growth in our sponsorship relationships and capture a larger share of the global music sponsorship market by further monetizing our fan base and growing our portfolio of brands. We will focus on expanding existing partnerships and developing new corporate sponsor partners to provide them with targeted strategic programs, accessing the fans attending our shows. We will continue to develop and to scale new products in order to drive onsite and digital revenue.\nOur Strengths \nWe believe we have unique resources that are unmatched in the live entertainment industry. \n•\nFans\n. During 2024, we connected over 788 million fans to their favorite live events. Our database of fans and their interests provides us with the means to efficiently communicate to them about shows they are likely to be interested in. \n•\nArtists\n. We have extensive relationships with artists ranging from those just beginning their careers to established superstars. In 2024, we promoted shows for approximately 11,000 artists globally. In addition, through our artist management companies, we managed more than 380 artists in 2024.\n•\nDigital Platforms and Ticketing\n. We own and operate various branded websites, both in the United States and abroad, which are customized to reflect services offered in each jurisdiction. Our primary commercial websites, \nwww.livenation.com\n and \nwww.ticketmaster.com\n, together with our other branded ticketing websites, are designed to promote ticket sales for live events. We also have both Live Nation and Ticketmaster mobile apps that our fans can use to access event information and buy tickets.\n3\n•\nDistribution Network\n. We believe that our global network of promoters, venues and festivals provides us with a strong position in the live concert industry. We believe we have one of the largest global networks of live entertainment businesses in the world, with offices in 47 countries worldwide. In addition, we own, lease, operate, have exclusive booking rights for, or have an equity interest for which we have a significant influence in 394 venues and have operations located across 51 countries as of the end of 2024, making us, we believe, the second largest operator of music venues in the world. We also believe that we are one of the largest music festival producers in the world with 137 festivals globally in 2024. In addition, we believe that our global ticketing distribution network—with approximately 11,500 clients worldwide in 2024 — makes us the largest ticketing network in the world. \n•\nSponsors\n. We monetize our physical and digital assets through long-term sponsorship agreements and advertising. We employ a sales force of approximately 760 people that worked with more than 1,500 sponsors during 2024, through a combination of strategic partnerships, local venue-related deals, national agreements and digital campaigns, both in North America and internationally. Our sponsors include some of the most well-recognized national and global brands across diverse sectors including consumer, financials and leisure, such as Citibank, O\n2\n, Mastercard, Cisco, Red Bull and Anheuser Busch (each of these brands is a registered trademark of the sponsor).\nOur Industry \nWe operate in the following main industries within the live entertainment business: live music events, music venue operations, the provision of management and other services to artists and athletes, ticketing services and sponsorship and advertising sales. \nThe live music industry includes concert promotion and/or production of music events or tours. Typically, to initiate live music events or tours, booking agents work with artists. Booking agents then work with promoters, who will contract with them or with artists directly, to promote events. Promoters earn revenue primarily from the sale of tickets. Artists are paid by the promoter under one of several different formulas, which may include fixed guarantees and/or a percentage of ticket sales or event profits. In addition, promoters may also reimburse artists for certain costs of production, such as sound and lights. Under guaranteed payment formulas, promoters assume the risks of unprofitable events. Promoters may renegotiate lower guarantees or cancel events because of insufficient ticket sales in order to reduce their losses. Promoters can also reduce the risk of losses by entering into global or national touring agreements with artists and including the right to offset lower performing shows against higher performing shows on the tour in the determination of overall artist fees. Artist managers primarily provide services to music artists to manage their careers. The artist manager negotiates on behalf of the artist and is paid a fee, generally as a percentage of the artist’s earnings.\nWe believe the artist-fan connection is the source of nearly all commercial value and as a result, our artists receive the majority of all ticketing revenue. For music tours, four to eight months typically elapse between initially booking artists and the first performances. Artists, in conjunction with promoters, managers and booking agents, set ticket prices and advertising plans. Promoters market events, sell tickets, rent or otherwise provide venues and arrange for local production services, such as stages and equipment.\nVenue operators typically contract with promoters to have their venues rented for specific events on specific dates and receive fixed fees and/or percentages of ticket sales as rental income. In addition, venue operators provide services such as concessions, parking, security, ushering and ticket scanning at the gate, and receive some or all of the revenue from concessions, merchandise, parking and premium seating. \n Ticketing services generally refers to the sale of tickets primarily through online and mobile channels, but also include sales through phone, outlet and box office channels. Ticketing companies will contract with venues and/or promoters to sell tickets to events over a period of time, generally three to five years. The ticketing company generally gets paid a fixed fee per ticket sold or a percentage of the total ticket service charges. The ticketing company receives the cash for the ticket sales and related service charges at the time the ticket is sold and periodically remits these receipts to the venue and/or promoter after deducting its fee. Venues will often also sell tickets through a local box office at the venue using the ticketing company’s technology. Venues set the ticketing service fee to be charged on tickets and typically retain the majority of these fees.\nTicketing resale services generally refers to the sale of tickets by a holder who originally obtained the tickets from a venue or other entity. Resale tickets are also referred to as secondary tickets. Generally, the ticket resale company is paid a service charge when the ticket is resold and the remaining ticket value is paid to the holder.\nThe sponsorship and advertising industry within the live entertainment business involves the sale of international, national, regional and local advertising and promotional programs to a variety of companies to advertise or promote their brand, product or service. These sponsorships typically include venue and festival naming rights, onsite venue signage, online and in-app advertisements and exclusive partner rights in various categories such as credit card, beverage, travel and telecommunications, and may include venue and festival event pre-sales and onsite product activation.\n4\nOur Business \nOur reportable segments are Concerts, Ticketing and Sponsorship & Advertising.\nConcerts\n.\n \nOur Concerts segment principally involves the global promotion of live music events in our owned or operated venues and in rented third-party venues, the operation and management of music venues, the production of music festivals across the world, the creation of associated content and the provision of management and other services to artists. Including intersegment revenue, our Concerts business generated $19.0 billion, or 82%, of our total revenue during 2024. We promoted more than 54,000 live music and other events in 2024. While our Concerts segment traditionally operates year-round, we experience higher revenue during the second and third quarters due to the seasonal nature of shows at our outdoor amphitheaters and festivals, which primarily occur from May through October. We expect our seasonality trends to evolve as we continue to expand our global operations.\nAs a promoter, we earn revenue primarily from the sale of tickets and pay artists under one of several formulas, including a fixed guaranteed amount and/or a percentage of ticket sales or event profits. For each event we promote, we either use a venue we own or operate, or rent a third-party venue. Revenue is generally impacted by the number of events, volume of ticket sales and ticket prices. Event costs such as artist fees and production expenses are included in direct operating expenses and are typically substantial in relation to the revenue. As a result, significant increases or decreases in promotion revenue do not typically result in comparable changes to operating income.\nAs a venue operator, we generate revenue primarily from the sale of concessions, parking, premium seating, rental income and ticket rebates or service charges earned on tickets sold under ticketing agreements. In our amphitheaters, the sale of concessions is outsourced and we receive a share of the net revenue from the concessionaire, which is recorded in revenue with limited associated direct operating expenses. Revenue generated from venue operations typically has a higher margin than promotion revenue and therefore typically has a more direct relationship to changes in operating income. As we have continued to build our skill at venue operations, this has become an increasingly large part of our Concerts strategy, with a substantial focus on building our global owned or operated venue platform.\nAs a festival promoter, we typically book artists, secure festival sites, provide for third-party production services, sell tickets and advertise events to attract fans. We also provide or arrange for third parties to provide operational services as needed such as concessions, merchandising and security. We earn revenue from the sale of tickets and typically pay artists a fixed guaranteed amount. We also earn revenue from the sale of concessions, camping fees and service charges earned on tickets sold. For each event, we either use a festival site we own or rent a third-party festival site. Revenue is generally impacted by the number of events, volume of ticket sales and ticket prices. Event costs such as artist fees and production expenses are included in direct operating expenses and are typically substantial in relation to the revenue. Since the artist fees are typically fixed guarantees for these events, significant increases or decreases in festival promotion revenue will generally result in comparable changes to operating income.\nTicketing\n. Our Ticketing segment is primarily an agency business that sells tickets for events on behalf of its clients and retains a portion of the service charge as its fee. We sell tickets for our events and also for third-party clients across multiple live event categories, providing ticketing services for leading arenas, stadiums, amphitheaters, music clubs, concert promoters, professional sports franchises and leagues, college sports teams, performing arts venues, museums and theaters. We sell tickets through mobile apps, websites and ticket outlets. Our Ticketing segment also manages our online activities including enhancements to our websites and product offerings. Including intersegment revenue, our Ticketing business generated $3.0 billion, or 13%, of our total revenue during 2024, which excludes the face value of tickets sold and is net of the fees paid to our ticketing clients. Through all of our ticketing services, we sold approximately 331 million tickets in 2024 on which we were paid fees for our services. In addition, approximately 307 million tickets were sold, for which we did not receive a fee, using our Ticketmaster systems, including season seat packages, our venue clients’ box offices, and other channels. Our ticketing sales are impacted by fluctuations in the availability of events for sale to the public, which may vary depending upon event scheduling by our clients. As ticket sales increase, related ticketing operating income generally increases as well.\n5\nWe sell tickets on behalf of our clients through our ticketing platforms across the world. We generally enter into written agreements with individual clients to provide primary ticketing services for specified multi-year periods, typically ranging from three to five years. Pursuant to these agreements, clients and their content partners generally determine and then tell us what tickets will be available for sale, when such tickets will go on sale to the public and what the ticket price will be, sometimes with our analytical support. Agreements with venue clients in North America and Australia generally grant us exclusive rights to sell tickets for all events presented at the relevant venue for which tickets are made available to the general public. Agreements with promoter clients in other international markets generally grant us the right to an allocation of tickets for events presented by a given promoter at any venue, unless that venue is already covered by an existing exclusive agreement with our ticketing business or another ticketing service provider. Similarly, in such international markets we have venue agreements which provide Ticketmaster an allocation of tickets for all events at those venues. While we generally have the right to sell a substantial portion of our clients’ tickets, venue and promoter clients often sell and distribute a portion of their tickets in-house through their box office and season ticket programs. In addition, under many written agreements between promoters and our clients, and generally subject to Ticketmaster approval, the client may allocate certain tickets for artist, promoter, agent and venue use and do not make those tickets available for sale by us. Due to these and other permitted third-party ticket distribution channels, we do not always sell all of our clients’ tickets, even at venues where we are the exclusive primary ticketing service provider, and the amount of tickets that we sell varies from client to client and from event to event, and also varies as to any given client from year to year. We pay our clients for the rights to sell certain tickets, generally in the form of upfront payments, a portion of service fee revenue and the portion of other services at low or no cost.\nWe currently offer ticket resale services, sometimes referred to as secondary ticketing, principally through our integrated inventory platform, league/team platforms and other platforms internationally. We enter into arrangements with the holders of tickets previously distributed by a venue or other source to post those tickets for sale at a purchase price equal to a new sales price, determined by the ticket holder, plus a service fee paid by the buyer. The seller in this circumstance receives the new sales price less a seller service fee.\nSponsorship & Advertising\n.\n \nOur Sponsorship & Advertising segment employs a sales force that creates and maintains relationships with sponsors through a combination of strategic, international, national and local opportunities that allow businesses to reach customers through our concert, festival, venue and ticketing assets, including advertising on our websites. We work with our corporate clients to help create marketing programs that support their business goals and connect their brands directly with fans and artists. We also develop, book and produce custom events or programs for our clients’ specific brands, which are typically presented exclusively to the clients’ consumers. These custom events can involve live music events with talent and media, using both online and traditional outlets. Including intersegment revenue, our Sponsorship & Advertising business generated $1.2 billion, or 5%, of our total revenue during 2024. We typically experience higher revenue in the second and third quarters as a large portion of sponsorships are usually associated with our outdoor venues and festivals, which are primarily used in or occur from May through October. We expect our seasonality trends to evolve as we continue to expand our global operations.\nWe believe that we have a unique opportunity to connect the music fan to corporate sponsors and therefore seek to optimize this relationship through strategic sponsorship programs. We continue to also pursue the sale of national and local sponsorships, both domestically and internationally, and placement of advertising, including signage, online advertising and promotional programs. Many of our venues have naming rights sponsorship programs. We believe national and international sponsorships allow us to maximize our network of venues and festivals and to arrange multi-venue or multi-festival branding opportunities for advertisers. Our local and venue-focused sponsorships include venue signage, promotional programs, onsite activation, hospitality and tickets, and are derived from a variety of client companies across various industry categories. \nLive Nation Venue Details \nIn the live entertainment industry, venue types generally consist of: \n•\nStadiums\n—Stadiums are multi-purpose facilities, often housing local sports teams. Stadiums typically have 30,000 or more seats. Although they are the largest venues available for live music, they are not specifically designed for live music. \n•\nAmphitheaters\n—Amphitheaters are generally outdoor venues with between 5,000 and 30,000 seats that are used primarily in the summer season. We believe they are popular because they are designed specifically for concert events, with premium seat packages and better lines of sight and acoustics. \n•\nArenas\n—Arenas are indoor venues that are used as multi-purpose facilities, often housing local sports teams. Arenas typically have between 5,000 and 20,000 seats. Because they are indoors, they are able to offer amenities that other similar-sized outdoor venues cannot, such as luxury suites and premium club memberships. As a result, we believe they are popular for higher-priced concerts aimed at audiences willing to pay for these amenities.\n6\n•\nTheaters\n—Theaters are indoor venues that are built primarily for music events, but may include theatrical performances. These venues typically have a capacity of between 1,000 and 6,500. Theaters represent less risk to concert promoters because they have lower fixed costs associated with hosting a concert and may provide a more appropriately-sized venue for developing artists and more artists in general. Because these venues have a smaller capacity than an amphitheater or arena, they do not offer as much economic upside on a per show basis. Theaters can also be used year-round. \n•\nClubs\n—Clubs are indoor venues that are built primarily for music events, but may also include comedy clubs. These venues typically have a capacity of less than 1,000 and often without full fixed seating. Because of their small size, they do not offer as much economic upside, but they also represent less risk to a concert promoter because they have lower fixed costs associated with hosting a concert and also may provide a more appropriately-sized venue for developing artists. Clubs can also be used year-round. \n•\nRestaurants & Music Halls\n—Restaurants & Music Halls are indoor venues that offer customers an integrated live music, entertainment and dining experience.  This category includes our \nHouse of Blues\n®\n and \nBrooklyn Bowl\n® \nvenues whose live music halls are specially designed to provide optimum acoustics and typically can accommodate between 1,000 to 2,000 guests. A full-service restaurant and bar is located adjacent to the live music hall. We believe that the strength of the brand and the quality of the food, service and unique atmosphere in our restaurants attract customers to these venues independently from a live music event and generate a significant amount of repeat business from local customers. \n•\nFestival Sites\n—Festival sites are outdoor locations used primarily in the summer season to stage large single-day or multi-day concert events featuring several artists on multiple stages. Depending on the location, festival site capacities can range from 10,000 to over 100,000 fans per day. We believe they are popular because of the value provided to the fan by packaging several artists together for an event. While festival sites only host a few events each year, they can provide higher operating income because we are able to generate income from many different services provided at the event.\n•\nOther Venues\n—Other venues includes restaurants and exhibition and convention halls that typically are not used for live music events.\nThe following table summarizes the number of venues by type that we owned, leased, operated, had exclusive booking rights for or had an equity interest over which we had a significant influence as of December 31, 2024:\nVenue Type\n Capacity\nOwned\n Leased\nOperated\nExclusive\nBooking\nRights\nEquity\nInterest \nTotal\nStadium\nMore than 30,000\n— \n2 \n1 \n— \n— \n3 \nAmphitheater\n 5,000 - 30,000\n10 \n44 \n1 \n18 \n— \n73 \nArena\n 5,000 - 20,000\n3 \n15 \n2 \n5 \n— \n25 \nTheater\n 1,000 - 6,500\n10 \n76 \n9 \n32 \n2 \n129 \nClub\n Less than 1,000\n5 \n56 \n1 \n13 \n— \n75 \nRestaurants & Music Halls\n 1,000 - 2,000\n2 \n15 \n— \n— \n— \n17 \nFestival Sites \n(1)\nVaries\n2 \n— \n53 \n— \n— \n55 \nOther Venues\nVaries\n— \n14 \n— \n1 \n2 \n17 \nTotal venues in operation\n32 \n222 \n67 \n69 \n4 \n394 \nVenues currently under construction\n— \n13 \n— \n— \n1 \n14 \nVenues not currently in operation\n2 \n— \n— \n5 \n3 \n10 \nTotal venues in operation by location:\nNorth America\n22 \n169 \n25 \n68 \n4 \n288 \nInternational\n10 \n53 \n42 \n1 \n— \n106 \n__________\n(1)\nOperated festival sites includes multi-year agreements providing us the right to use public or private land for a defined period of time leading up to and continuing after the festival. We may enter into multiple agreements for a single festival site or use the same site for multiple festivals. We have aggregated the agreements for each festival site and reported them as one festival site.\n7\nCompetition \nCompetition in the live entertainment industry is intense. We believe that we compete primarily on the basis of our ability to deliver quality music events, sell tickets and provide enhanced fan and artist experiences. We believe that our primary strengths include:\n•\nthe quality of service delivered to our artists, fans, ticketing clients and corporate sponsors; \n•\nour track record and reputation in promoting and producing live music events and tours both domestically and internationally; \n•\nour artist relationships; \n•\nour global footprint; \n•\nthe quality of our ticketing software and services; \n•\nour ecommerce site and effective marketing capabilities; \n•\nour diverse distribution platform of venues; \n•\nthe scope, effectiveness and expertise of our advertising and sponsorship programs; and \n•\nour financial stability. \nAlthough we believe that our products and services currently compete favorably with respect to such factors, we cannot provide any assurance that we can maintain our competitive position against current and potential competitors, especially those with significantly greater brand recognition, or greater financial, marketing, technical and other resources. \nIn the markets in which we promote music concerts, we face competition from other promoters and venue operators. We believe that barriers to entry into the promotion services business are low and that certain local promoters are increasingly expanding the geographic scope of their operations. \nSome of our competitors in the live music promotion industry are Anschutz Entertainment Group, or AEG, Another Planet Entertainment, CTS Eventim, Jam Productions, Ltd., I.M.P., Outback Presents and TEG Dainty in addition to numerous smaller regional companies and various casinos and venues in North America, Europe, Asia and Australia. AEG operates under a number of different names including AEG Presents, Concerts West, Frontier Touring, Goldenvoice and Messina Touring Group. Some of our competitors in the live music industry have a stronger presence in certain markets, have access to other sports and entertainment venues and may have greater financial resources in those markets, which may enable them to gain a greater competitive advantage in relation to us.\nIn markets where we own or operate a venue, we compete with other venues to serve artists likely to perform in that general region. Consequently, touring artists have various alternatives to our venues when scheduling tours. Our main competitors in venue management include ASM Global, Madison Square Garden Entertainment Corp., The Nederlander Organization and Bowery Presents, in addition to numerous smaller regional companies in North America, Europe, Australia and New Zealand. Some of our competitors in venue management may have more attractive or a greater number of venues in certain markets, and may have greater financial resources in those markets.\nThe ticketing services industry includes the sale of tickets primarily through online and mobile channels, but also through telephone and ticket outlets. The transition to online and mobile ticket purchases has made it easier for technology-based companies to offer primary ticketing services and standalone, automated ticketing systems that enable venues to perform their own ticketing services or utilize self-ticketing systems. In the online environment, we compete with other websites, online event sites and ticketing companies to provide event information, sell tickets and provide other online services such as fan clubs and artist websites. \nWe experience competition from other national, regional and local primary ticketing service providers to secure new venue clients and to reach fans for events. Resale, or secondary, ticketing services have created more aggressive buying of primary tickets whereby certain brokers are using automated internet “bot” technology to attempt to buy the best tickets when they go on sale, notwithstanding federal and state prohibitions. We actively develop and apply methods to mitigate the impact of these bots, however, the bot technology constantly evolves and changes. The internet allows fans and other ticket resellers to reach a vastly larger audience through the aggregation of inventory on resale websites and marketplaces, and provides consumers with more convenient access to tickets for a larger number and greater variety of events.\n8\nWe also face significant and increasing competition from companies that sell self-ticketing systems, as well as from venues that choose to integrate self-ticketing systems into their existing operations or acquire primary ticketing service providers. Our competitors include primary ticketing companies such as Tickets.com, AXS, Paciolan, Inc., CTS Eventim AG, Eventbrite, eTix, SeatGeek, Ticketek, See Tickets and Dice; secondary ticketing companies such as StubHub, Vivid Seats, Viagogo and SeatGeek; and many others, including large technology and ecommerce companies that could enter these markets.\nOur main competitors at the local market level for sponsorships and advertising dollars include local sports teams, which often offer state-of-the-art venues, strong brand association and attractive local media packages, as well as festivals, theme parks and other local events. On the national level, our competitors include the major sports leagues that sell sponsorships combined with significant national media packages.\nGovernment Regulations\nWe are subject to federal, state and local laws, both domestically and internationally, governing matters such as: \n•\nprivacy and the protection of personal or sensitive information; \n•\ncompliance with the United States Foreign Corrupt Practices Act, the United Kingdom Bribery Act 2010 and similar regulations in other countries; \n•\nprimary ticketing and ticket resale services;\n•\nconstruction, renovation and operation of our venues; \n•\nlicensing, permitting and zoning, including noise ordinances; \n•\nhuman health, safety, security and sanitation requirements; \n•\nthe service of food and alcoholic beverages; \n•\nworking conditions, labor, minimum wage and hour, citizenship and employment laws; \n•\ncompliance with the Americans with Disabilities Act of 1990 (“ADA”), the United Kingdom’s Disability Discrimination Act of 1995 (“DDA”) and similar regulations in other countries; \n•\nhazardous and non-hazardous waste and other environmental protection laws; \n•\nsales and other taxes and withholding of taxes; \n•\nmarketing activities via the telephone and online; and\n•\nhistoric landmark rules.\nWe believe that we are materially in compliance with these laws. \nWe are required to comply with federal, state and international laws regarding privacy and the storing, sharing, use, disclosure and protection of personally identifiable information and user data, an area that is increasingly subject to legislation and regulations in numerous jurisdictions around the world, including the European Union’s GDPR (as defined and discussed below in Item 1A.—Risk Factors) and the California Consumer Protection Act.\nWe are required to comply with the laws of the countries in which we operate and also the United States Foreign Corrupt Practices Act and the United Kingdom Bribery Act 2010 regarding anti-bribery regulations. These regulations make it illegal for us to pay, promise to pay or receive money or anything of value to, or from, any government or foreign public official for the purpose of directly or indirectly obtaining or retaining business. This ban on illegal payments and bribes also applies to agents or intermediaries who use funds for purposes prohibited by the statute.\nFrom time to time, federal, state, local and international authorities and/or consumers commence investigations, inquiries or litigation with respect to our compliance with applicable consumer protection, advertising, unfair business practice, antitrust (and similar or related laws) and other laws, particularly as related to primary ticketing and ticket resale services.\nThe regulations relating to our food service operations in our venues are many and complex. A variety of regulations at various governmental levels relating to the handling, preparation and serving of food, the cleanliness of food production facilities and the hygiene of food-handling personnel are enforced primarily at the local public health department level. \nWe also must comply with applicable licensing laws, as well as state and local service laws, commonly called dram shop statutes. Dram shop statutes generally prohibit serving alcoholic beverages to certain persons such as an individual who is intoxicated or a minor. If we violate dram shop laws, we may be liable to third parties for the acts of the customer. Although we generally hire outside vendors to provide these services at our larger operated venues and regularly sponsor training programs designed to minimize the likelihood of such a situation, we cannot guarantee that intoxicated or minor customers will not be served or that liability for their acts will not be imposed on us. \n9\nWe are also required to comply with the ADA, the DDA and certain state statutes and local ordinances that, among other things, require that places of public accommodation, including our websites as well as existing and newly constructed venues, be accessible to customers with disabilities. The ADA and the DDA require that venues be constructed to permit persons with disabilities full use of a live entertainment venue. The ADA and the DDA may also require that certain modifications be made to existing venues to make them accessible to customers and employees who are disabled. In order to comply with the ADA, the DDA and other similar ordinances, we may face substantial capital expenditures in the future. \nFrom time to time, governmental bodies have proposed legislation that could affect our business. For example, some legislatures have proposed laws in the past that would impose potential liability on us and other promoters and producers of live music events for entertainment taxes and for incidents that occur at our events, particularly relating to drugs and alcohol. Some jurisdictions have also proposed legislation that would restrict ticketing methods or mandate ticket practices. \nIn addition, we and our venues are subject to extensive environmental laws and regulations relating to the use, storage, disposal, emission and release of hazardous and non-hazardous substances, as well as zoning and noise level restrictions which may affect, among other things, the hours of operations of and the type of events we can produce at our venues.\nOur People and Culture\nBringing more than 54,000 events to life and connecting over 788 million fans across all of our concerts and ticketing platforms, as we did in 2024, is a massive undertaking, made possible by our thousands of employees spread across 47 countries. Our teams come together every day to grow our business, and we recognize our people are the key to our success—whether they’re putting on a show at one of our venues, selling tickets, working with our brand partners or supporting our businesses in a myriad of other ways.\nTaking Care of Our Own\nOur core value with our employees is “taking care of our own,” which means a top priority is making sure that every employee can rely on us to go above just providing standard compensation and benefits by offering assistance for a range of planned and unplanned situations. We also ensure that our employees have direct access to senior executives to raise concerns and share ideas. Our programs are structured under eight core pillars, designed to support key life moments:\n•\nTaking Care of Yourself\n: To enhance overall happiness and wellness, we offer flexible vacation time, free ticket perks, in-house and on-demand virtual meditation sessions, crisis support, crowdfunding networks, and more. We launched Sober Nation to provide sobriety and recovery support for our employees and help destigmatize addiction and recovery in the industry. In 2024, we extended our offerings to include part-time club staff and partnered with artists to host events at our headquarters highlighting the intersection of sobriety and mental health. \n•\nTaking Care of Your Health\n: Beyond a full suite of medical, dental and vision benefits, we provide access to \n \ntelehealth and telemedicine platforms available to employees and their family members enrolled in our medical plan.\n•\nTaking Care of Your Mental Health\n: Our mental well-being offerings include free virtual mental health coaching or therapy sessions, group support sessions, 24/7 counselor support line, and both in-person and virtual meditation and yoga sessions. In 2024, we extended our offerings to include part-time club staff.\n•\nTaking Care of Your Family\n: We provide assistance with fertility needs such as egg-freezing, egg-donation and IVF, as well as adoption or surrogacy, primary caregiver leave for new parents, sick leave to care for loved ones, and leave for bereavement or end-of-life care.\n•\nTaking Care of Your Career\n: Our School of Live learning and development center at our Los Angeles headquarters has furthered our career advancement opportunities including leadership workshops for mid-career employees. In 2024, we expanded offerings to include more global live and on-demand learning and professional development and coaching opportunities for employees. We also offer recognition for successful patent recipient applications and tuition reimbursement to further ongoing education.\n•\nTaking Care of Your Wealth\n: To support long-term financial goals, we traditionally provide 401(k) or pension matching, a stock reimbursement program, and student loan repayment assistance. In 2024, we expanded our $20.00 per hour minimum wage to our part-time club and seasonal amphitheater staff based on tenure.\n•\nTaking Care of Our Own\n: During life’s most difficult moments, we offer employees financial support to help them through a variety of crises, including unexpected deaths, natural disasters, and escaping domestic violence. Through the end of 2024, our Crew Nation global relief fund has provided financial support to over 16,000 live music crews in over 50 countries to which we have donated over $15 million since March 2020.\n•\nTaking Care of Others\n: In order to empower our employees to get involved in causes that are meaningful to them, we provide paid time off for them to volunteer in their local communities.\n10\nOur People\nWe aspire to foster a workplace where all employees can contribute fully and feel valued. Some programs key to this mission include:\n•\nPromotion and Pay\n: Ongoing reviews of positions and compensation with the goal of ensuring that all employees across Live Nation are paid appropriately and provided with promotion opportunities.\n•\nEmployee Resource Groups\n: Our employee-led groups, with executive leaders as sponsors, offer programming across our teams that promotes growth and connection through collaboration, professional development, networking, nonprofit support and community outreach.\n•\nOur Workforce\n: As a global organization, we are committed to valuing and respecting all backgrounds, experiences, abilities and perspectives that enrich our workforce, and reflect our artist community and fan base.\n•\nIndustry Engagement\n: In 2024, we partnered with various nonprofit organizations to launch music business intensive courses and paid internship programs to introduce the next generation of industry newcomers to the technical skills required to succeed in careers in the live industry.\nHuman Capital\nOur compensation philosophy is focused on attracting and retaining talented individuals who contribute to our values and help lead our dynamic and innovative environment. To determine market-competitive pay for our employees, we use a combination of entertainment and technology industry benchmarks.\nWe are committed to encouraging and rewarding pay-for-performance that is aligned with business objectives in the best interest of our shareholders for long-term growth and profitability. We further strive to reward individual achievements and contributions that are both aligned with and supportive of our short- and long-term goals and core business values. We believe that our efforts in these areas are working and contributing to the overall success of the Company, as evidenced by accolades such as obtaining a Great Place to Work® certification (2017-19, 2022-24), placing on Forbes’ World’s Best Employers List (2023), America’s Best Large Employers List (2022-24) and America’s Dream Employers List (2025), placing on TIME’s World’s Best Companies (2023) and 100 Most Influential Companies (2023), Newsweek’s America’s Best of the Best (2024) and placing on Fortune’s World’s Most Admired Companies List (2018-21, 2024, 2025), Most Innovative Companies List (2024) and 500 List (2010-2020, 2023, 2024). \nAs of December 31, 2024, we had approximately 16,200 full-time employees. Our staffing needs vary significantly throughout the year and we also employ seasonal and part-time employees, primarily for our live music venues and festivals. At the end of 2024, we employed approximately 16,000 seasonal and part-time employees and during peak seasonal periods, particularly in the summer months, we employed as many as 34,500 seasonal and part-time employees in 2024.\nLabor Relations\nThe stagehands at some of our venues and other employees are subject to collective bargaining agreements. Our union agreements typically have a term of three years and thus regularly expire and require negotiation in the course of our business. We believe that we have good relationships with our employees and other unionized labor involved in our events, and there have been no related significant work stoppages in the past three years. Upon the expiration of any of our collective bargaining agreements, however, we may be unable to renegotiate on terms favorable to us, and our business operations at one or more of our facilities may be interrupted as a result of labor disputes or difficulties and delays in the process of renegotiating our collective bargaining agreements. In addition, our business operations at one or more of our facilities may also be interrupted as a result of labor disputes by outside unions attempting to unionize a venue even though we do not have unionized labor at that venue currently. A work stoppage at one or more of our owned or operated venues or at our promoted events could have a material adverse effect on our business, results of operations and financial condition. We cannot predict the effect that a potential work stoppage will have on our business operations.\n11\nInformation About Our Executive Officers \nSet forth below are the names, ages and current positions of our executive officers and other significant employees as of February 13, 2025.\nName\nAge\nPosition\nMichael Rapino\n59\nPresident, Chief Executive Officer and Director\nOmar Al-Joulani\n47\nCo-President–U.S. Concerts and President–Touring\nCarlos Alvarez\n50\nChief Technology Officer–Ticketmaster\nJoe Berchtold\n60\nPresident and Chief Financial Officer\nBrian Capo\n58\nSenior Vice President–Chief Accounting Officer\nLiz Dyer\n39\nSenior Vice President–Human Resources\nArthur Fogel\n71\nChairman–Global Music and President–Global Touring\nKaitlyn Henrich\n34\nSenior Vice President–Corporate Communications and Social Impact\nJohn Hopmans\n66\nExecutive Vice President–Mergers and Acquisitions and Strategic Finance\nBob Roux\n67\nPresident–U.S. Concerts\nMichael Rowles\n59\nGeneral Counsel and Secretary\nRussell Wallach\n59\nPresident–Sponsorship and Advertising\nMichael Wichser\n46\nChief Operating Officer–Ticketmaster\nMark Yovich\n50\nPresident–Ticketmaster\nJordan Zachary\n42\nCo-President–U.S. Concerts and President–Regions U.S. Concerts\nMichael Rapino \nis our President and Chief Executive Officer and has served in this capacity since August 2005. He has also served on our board of directors since December 2005. Mr. Rapino has worked for us or our predecessors since 1999.\nOmar Al-Joulani\n is our Co-President of U.S. Concerts and President of Touring and has served in this capacity since September 2021. Prior to that, Mr. Al-Joulani served in various North America touring roles since joining us in March 2010.\nCarlos Alvarez \nis our Chief Technology Officer of Ticketmaster and has served in this capacity since September 2020. Prior to that, Mr. Alvarez served in various information technology roles since joining us in August 2014.\nJoe Berchtold\n is our President and Chief Financial Officer. He has served as President since December 2017 and Chief Financial Officer since July 2021. Prior to that, Mr. Berchtold served as our Chief Operating Officer since joining us in April 2011.\nBrian Capo \nis our Senior Vice President and Chief Accounting Officer and has served in this capacity since joining us in December 2007.\nLiz Dyer \nis our Senior Vice President of Human Resources and has served in this capacity since September 2020. Prior to that, Ms. Dyer served in various human resources roles since joining us in April 2016.\nArthur Fogel \nis the Chairman of our Global Music group and President of our Global Touring division and has served in these capacities since 2005. Mr. Fogel has worked for us or our predecessors since 1999.\nKaitlyn Henrich \nis our Senior Vice President of Corporate Communications and Social Impact and has served in this capacity since January 2022. Prior to that, Ms. Henrich served in various corporate communications roles since joining us in January 2016.\nJohn Hopmans \nis our Executive Vice President of Mergers and Acquisitions and Strategic Finance and has served in this capacity since joining us in April 2008.\nBob Roux\n is President of our U.S. Concerts division and has served in this capacity since October 2010. Mr. Roux has worked for us or our predecessors since 1990.\nMichael Rowles \nis our General Counsel and has served in this capacity since joining us in March 2006 and as our Secretary since May 2007.\nRussell Wallach \nis President of our Sponsorship and Advertising division and has served in this capacity since July 2006. Mr. Wallach has worked for us or our predecessors since 1996.\n12\nMichael Wichser \nis our Chief Operating Officer of Ticketmaster and has served in this capacity since January 2021. Prior to that, Mr. Wichser served in various mergers and acquisitions and strategy and development roles since joining us in September 2014.\nMark Yovich\n is President of Ticketmaster and has served in this capacity since December 2020. Prior to that, Mr. Yovich served as President of Ticketmaster’s International division since November 2011. Mr. Yovich has worked for us or our predecessors since 2000.\nJordan Zachary\n is our Co-President of U.S. Concerts and President of Regions U.S. Concerts and has served in this capacity since April 2021. Prior to that, Mr. Zachary served in various strategy and development roles since joining us in April 2015.\nAvailable Information\nWe are required to file annual, quarterly and current reports, proxy statements and other information with the SEC. You may read and copy any materials we have filed with the SEC at the SEC’s Public Reference Room at 100 F Street, NE, Washington, DC 20549. You may obtain information on the operation of the Public Reference Room by calling the SEC at 1-800-SEC-0330. Our filings with the SEC are also available to the public through the SEC’s website at \nwww.sec.gov\n. \nYou can find more information about us online at our investor relations website located at \nwww.investors.livenationentertainment.com\n. Our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K and any amendments to those reports are available free of charge on our website as soon as reasonably practicable after we electronically file such material with the SEC. The information posted on or accessible through our website is not incorporated into this Annual Report on Form 10-K.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion of our financial condition and results of operations together with the audited consolidated financial statements and notes to the consolidated financial statements included elsewhere in this Annual Report. This discussion contains forward-looking statements that involve risks and uncertainties. The forward-looking statements are not historical facts, but rather are based on current expectations, estimates, assumptions and projections about our industry, business and future financial results. Our actual results could differ materially from the results contemplated by these forward-looking statements due to a number of factors, including those discussed under Item 1A.—Risk Factors and other sections in this Annual Report. \nThe following discussion of our financial condition and results of operations generally discusses 2024 and 2023 items along with year-over-year comparisons between these two years. Discussion of 2022 items and year-over-year comparisons between 2023 and 2022 can be found in Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2023 Annual Report on Form 10-K.\nExecutive Overview\nIn 2024, we saw demand for the live experience growing across the globe with emerging to superstar acts performing to packed houses across all genres and in venues big and small. After a record 2023 fueled by our highest volume of stadium shows ever, we surpassed last year’s revenue results. While operating income declined double-digits as a result of the Astroworld legal contingency, we grew our AOI by double-digits and our underlying businesses thrived in 2024. Our Concerts segment generated over $0.5 billion in AOI for the first time ever, growing by over 50%. We added over 5 million fans and nearly 5,000 additional shows in Concerts, with new venues added to our global footprint and plans to open more in the year ahead.\nOur overall revenue increased by $429 million, or 2%, to $23.2 billion as compared to last year. The increase in revenue was $664 million without the impact of changes in foreign exchange rates. Operating income for the year declined by $260 million or 24% primarily related to the Astroworld estimated loss contingencies of $455 million partially offset by stronger performance in our Concerts and Sponsorship segments. The decrease in operating income was $208 million without the impact of changes in foreign exchange rates. Consolidated AOI for the year increased by $265 million, or 14%, to $2.1 billion this year. The increase in AOI was $320 million without the impact of changes in foreign exchange rates.\nOur event-related deferred revenue balance increased by $336 million, or 11%, to $3.3 billion as of December 31, 2024 compared to December 31, 2023. This, coupled with current ticket sales for 2025, suggests ongoing strong demand for concerts, making us confident in our continued success in the year ahead.\nFor the year, we experienced unfavorable foreign currency translation impacts of $235 million on revenues, $52 million on operating income and $55 million on AOI. The majority of the impacts came from Latin American currencies.\nAll of the segment financial comments below are based on reported foreign currency exchange rates.\nOur Concerts segment revenue for the year increased by $283 million, or 2% compared to 2023, from $18.7 billion to $19.0 billion. The growth in revenue was the result of more fans enjoying their favorite artists and spending more money at events to maximize their unique live experiences. Approximately 151 million fans attended our shows in the year, our largest annual fan count ever, compared to approximately 146 million last year, for growth of over 5 million or 4%. The growth was relatively evenly distributed across our global markets with notable strength in the United States, Latin America and Asia-Pacific. Growth in amphitheater, arena and theater & club fan count drove the increase in show attendance. In particular, arena fan count increased by almost 8 million fans to over 50 million fans globally. Some of the larger acts touring globally in the year included Coldplay, Pink, Metallica and Olivia Rodrigo, reflecting the global diversified base of our artists.\nConcerts AOI for the year increased by $209 million, or 65%, compared to 2023, from $320 million to $530 million. Our ancillary revenue spending at our United States amphitheater shows was over $44 per fan for the year, growing by nearly $1 over 2023, driven by higher food and beverage spending as well as merchandise and premium offerings. After extensive renovations, our Jones Beach amphitheater re-opened on Long Island and produced double-digit growth on premium seating, concessions and VIP club revenues. Similarly the Estadio GNP stadium (formerly known as Foro Sol) re-opened in Mexico City over the summer, offering fans an elevated concert-going experience with several new VIP lounges and additional points of sale for all fans.\n30\nOur Ticketing segment revenue for the year increased by $29 million, or 1%, compared to 2023, from $2.96 billion to $2.99 billion. We sold 331 million fee-bearing tickets in 2024 compared to 329 million tickets last year, essentially flat for the year. GTV for the year was $34.7 billion, down $1 billion, or 3% compared to 2023. Despite some sales headwinds during the year and a tough 2023 comparison with respect to stadium activity, the year ended on an encouraging note with the fourth quarter coming in as our highest quarter ever for transacted ticket sales and GTV. This resulted in a record fourth quarter for Ticketing across all of our key financial metrics – revenue, operating income and AOI.\nTicketing AOI for the year was $1.1 billion, roughly in line with our 2023 results. We signed 22.8 million net new tickets in 2024, of which 14.3 million, or roughly 60%, are from clients outside of North America, highlighting the significance of our international operations and our global expansion opportunity. This gives us confidence that our ticketing platforms’ features and functionalities will continue to fuel growth going forward.\nOur Sponsorship & Advertising segment revenue for the year increased by $100 million, or 9%, compared to 2023 from $1.1 billion to $1.2 billion. The increase was largely driven by our international divisions with new naming rights and other deals for Estadio GNP in Mexico City, newly acquired festivals in Colombia, additional sponsorable content in Mexico and the timing of the Rock in Rio Brazil and Portugal festivals which play every two years. Sponsorship & Advertising AOI increased by $89 million, or 13%, compared to 2023, from $675 million to $764 million.\nWe are optimistic about the long-term potential of our Company and are focused on the key elements of our business model: expanding our global platforms to connect artists and fans.\n31\nConsolidated Results of Operations \n \nYear Ended December 31,\n% Change\n2024 vs 2023\n% Change\n2023 vs 2022\n \n2024\n2023\n2022\nAs Reported\nCurrency Impacts\nConstant Currency*\nAs Revised\nAs Revised\nAs Reported\nConstant Currency*\nAs Revised\n \n(in thousands)\n \nRevenue\n$\n23,155,625 \n$\n235,038 \n$\n23,390,663 \n$\n22,726,317 \n$\n16,681,254 \n2%\n3%\n36%\nOperating expenses:\nDirect operating expenses\n17,328,154 \n17,250,530 \n12,347,611 \n0.4%\n40%\nSelling, general and administrative expenses\n4,096,424 \n3,557,167 \n2,955,884 \n15%\n20%\nDepreciation and amortization\n549,923 \n516,797 \n449,976 \n6%\n15%\nGain on disposal of operating assets\n(11,015)\n(13,927)\n(32,082)\n(21)%\n(57)%\nCorporate expenses\n367,629 \n330,817 \n237,834 \n11%\n39%\nOperating income\n824,510 \n52,365 \n876,875 \n1,084,933 \n722,031 \n(24)%\n(19)%\n50%\nOperating margin\n3.6%\n3.7%\n4.8%\n4.3%\nInterest expense\n325,974 \n350,244 \n278,483 \nLoss on extinguishment of debt\n2,563 \n18,504 \n— \nInterest income\n(156,254)\n(237,818)\n(77,620)\nEquity in losses (earnings) of nonconsolidated affiliates\n16,675 \n5,455 \n(10,571)\nOther expense (income), net\n(103,874)\n35,274 \n41,215 \nIncome before income taxes\n739,426 \n913,274 \n490,524 \nIncome tax expense (benefit)\n(391,698)\n209,476 \n115,941 \nNet income\n1,131,124 \n703,798 \n374,583 \nNet income attributable to noncontrolling interests\n234,837 \n146,905 \n108,143 \nNet income attributable to common stockholders of Live Nation\n$\n896,287 \n$\n556,893 \n$\n266,440 \n________   \n \n*\nConstant currency is a non-GAAP financial measure. We calculate currency impacts as the difference between current period activity translated using the current period’s currency exchange rates and the comparable prior period’s currency exchange rates. We present constant currency information to provide a framework for assessing how our underlying businesses performed excluding the effect of foreign currency rate fluctuations.\nRevenue\nRevenue increased $429.3 million during the year ended December 31, 2024 as compared to the prior year driven by increased revenue in our Concerts segment of $283.4 million, Ticketing segment of $29.2 million and Sponsorship & Advertising segment of $99.8 million as further discussed within each segment’s operating results.\n32\nOperating income\nOperating income decreased $260.4 million during the year ended December 31, 2024 as compared to the prior year primarily driven by decreased operating income in our Concerts segment of $313.2 million, which included Astroworld estimated loss contingencies of $454.9 million, and Ticketing segment of $20.7 million. These decreases in operating income were partially offset by increased operating income in our Sponsorship & Advertising segment of $99.2 million as further discussed within each segment’s operating results.\nInterest expense\nInterest expense decreased $24.3 million during the year ended December 31, 2024 as compared to the prior year primarily driven by lower debt balance throughout 2024 as compared to 2023.\nInterest income\nInterest income decreased $81.6 million during the year ended December 31, 2024 as compared to the prior year primarily attributed to lower rate of return on our cash and cash equivalents in 2024 and a decrease in our cash and cash equivalents.\nOther expense (income), net\nFor the year ended December 31, 2024, we had $103.9 million of other income, net, which primarily includes mark to market adjustments for certain investments in nonconsolidated affiliates of $99.2 million. For the year ended December 31, 2023, we had $35.3 million of other expense, net, which includes net foreign exchange rate losses of $74.5 million partially offset by mark to market adjustments for certain investments in nonconsolidated affiliates of $46.5 million. The net foreign exchange rate gains and losses result primarily from revaluation of certain foreign currency denominated net assets held internationally.\nIncome taxes\nFor the year ended December 31, 2024, we had a net tax benefit of $391.7 million on income before income taxes of $739.4 million compared to a net tax expense of $209.5 million on income before income taxes of $913.3 million for 2023. In 2024, the net income tax benefit consisted of $518.3 million of tax benefit related to United States federal income taxes, $127.0 million of tax expense related to foreign entities and $0.4 million of tax benefit related to state and local income taxes. The net decrease in tax expense of $601.2 million is related to a valuation allowance release, due to changes in judgment regarding the realizability of certain deferred tax assets.\nNet income attributable to noncontrolling interests\nNet income attributable to noncontrolling interests increased $87.9 million during the year ended December 31, 2024 as compared to the prior year primarily due to higher operating results from certain concert businesses during 2024 as compared to the prior year.\nNon-GAAP Measures\nConsolidated AOI\nConsolidated AOI is a non-GAAP financial measure that we define as consolidated operating income (loss) before certain acquisition expenses (including ongoing legal costs stemming from the Ticketmaster merger, changes in the fair value of accrued acquisition-related contingent consideration obligations, and acquisition-related severance and compensation), amortization of non-recoupable ticketing contract advances, depreciation and amortization (including goodwill impairment), loss (gain) on disposal of operating assets, and stock-based compensation expense. We also exclude from AOI the impact of estimated or realized liabilities for settlements or damages arising out of the Astroworld matter that exceed our estimated insurance recovery, due to the significant and non-recurring nature of the matter. Ongoing legal costs associated with defense of these claims, such as attorney fees, are not excluded from AOI.\nWe use AOI to evaluate the performance of our operating segments. We believe that information about AOI assists investors by allowing them to evaluate changes in the operating results of our portfolio of businesses separate from non-operational factors that affect net income (loss), thus providing insights into both operations and the other factors that affect reported results. AOI is not calculated or presented in accordance with GAAP. A limitation of the use of AOI as a performance measure is that it does not reflect the periodic costs of certain amortizing assets used in generating revenue in our business. Accordingly, AOI should be considered in addition to, and not as a substitute for, operating income (loss), net income (loss), and other measures of financial performance reported in accordance with GAAP. Furthermore, this measure may vary among other companies; thus, AOI as presented herein may not be comparable to similarly titled measures of other companies.\n33\nThe following table sets forth the reconciliation of consolidated operating income to consolidated AOI for the years ended December 31, 2024, 2023 and 2022:\n2024\n2023\n2022\nAs Revised\nAs Revised\n(in thousands)\nOperating income \n(1)\n$\n824,510 \n$\n1,084,933 \n$\n722,031 \nAcquisition expenses\n128,513 \n93,664 \n68,078 \nAmortization of non-recoupable ticketing contract advance\n88,717 \n83,693 \n79,043 \nDepreciation and amortization\n549,923 \n516,797 \n449,976 \nGain on sale of operating assets\n(11,015)\n(13,927)\n(32,082)\nAstroworld estimated loss contingencies\n454,902 \n— \n— \nStock-based compensation expense\n110,348 \n115,959 \n110,049 \nConsolidated AOI \n(1)\n$\n2,145,898 \n$\n1,881,119 \n$\n1,397,095 \n___________________\n(1)\nFor the years ended December 31, 2023 and December 31, 2022, the revision increased our operating income and consolidated AOI by $18.7 million for 2023 and decreased our operating income and consolidated AOI by $10.1 million for 2022, respectively. See further discussion in Part II — Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 2 – Correction of Errors in Previously Reported Consolidated Financial Statements.\n34\nSegment Overview\nInformation regarding our use of AOI to evaluate the performance of our operating segments can be found in Part II —Financial Information —Item 8.—Financial Statements and Supplementary Data—Note 12 – Segments and Revenue Recognition.\nConcerts\nRevenue and related costs for events are generally deferred and recognized when the event occurs. All advertising costs incurred during the year for shows in future years are expensed at the end of the year. If a current year event is rescheduled into a future year, all advertising costs incurred to date are expensed in the period when the event is rescheduled.\nConcerts direct operating expenses include artist fees, event production costs, show-related marketing and advertising expenses, along with other costs.\nTo judge the health of our Concerts segment, we primarily monitor the number of confirmed events and fan attendance in our network of operated and third-party venues, talent fees, average paid attendance, market ticket pricing, advance ticket sales and the number of major artist clients under management. In addition, at our operated venues and festivals, we monitor ancillary revenue per fan and premium ticket sales. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nTicketing\nRevenue related to ticketing service charges is recognized when the ticket is sold for our third-party clients. For our own events, where our concert promoters or venues control ticketing, revenue is deferred and recognized when the event occurs. GTV represents the total amount of the transaction related to a ticket sale and includes the face value of the ticket as well as the service charge. We use GTV to evaluate changes in ticket fee revenue that are driven by the pricing of our service charges.\nTicketing direct operating expenses include call center costs and credit card fees, along with other costs.\nTo judge the health of our Ticketing segment, we primarily review the GTV and the number of tickets sold through our primary and secondary ticketing operations, the number of clients renewed or added and the average royalty rate paid to clients who use our ticketing services. In addition, we review the number of visits to our websites, cost of customer acquisition, the purchase conversion rate, and the overall number of customers in our database. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nSponsorship & Advertising\nRevenue related to sponsorship and advertising programs is recognized over the term of the agreement or operating season as the benefits are provided to the sponsor unless the revenue is associated with a specific event, in which case it is recognized when the event occurs.\nSponsorship & Advertising direct operating expenses include fulfillment costs related to our sponsorship programs, along with other costs.\nTo judge the health of our Sponsorship & Advertising segment, we primarily review the revenue generated through sponsorship arrangements and online advertising, and the percentage of expected revenue under contract. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\n35\nKey Operating Metrics\n \nYear Ended December 31,\n \n2024\n2023\n2022\n(in thousands except estimated events)\nConcerts \n(1)\nEstimated events:\nNorth America \n(2)\n36,673 \n33,629 \n29,170 \nInternational\n18,014 \n16,430 \n14,475 \nTotal estimated events\n54,687 \n50,059 \n43,645 \nEstimated fans:\nNorth America \n(2)\n86,563 \n81,252 \n69,693 \nInternational \n64,486 \n64,538 \n51,459 \nTotal estimated fans\n151,049 \n145,790 \n121,152 \nTicketing\n \n(3)\nEstimated number of fee-bearing tickets sold\n330,567 \n329,116 \n280,862 \nEstimated number of non-fee-bearing tickets sold\n307,164 \n291,295 \n269,814 \nTotal estimated tickets sold\n637,731 \n620,411 \n550,676 \n _________\n(1)\nEvents generally represent a single performance by an artist. Fans generally represent the number of people who attend an event. Festivals are counted as one event in the quarter in which the festival begins, but the number of fans is based on the days the fans were present at the festival and thus can be reported across multiple quarters. Events and fan attendance metrics are estimated each quarter.\n(2)\nNorth America refers to our events and fans within the United States and Canada.\n(3)\nThe fee-bearing tickets estimated above include primary and secondary tickets that are sold using our Ticketmaster systems or that we issue through affiliates. This metric includes primary tickets sold during the year regardless of event timing, except for our own events where our concert promoters or venues control ticketing which are reported when the events occur. The non-fee-bearing tickets estimated above include primary tickets sold using our Ticketmaster systems, through season seat packages and our venue clients’ box offices, along with tickets sold on our “do it yourself” platform. These ticketing metrics are net of any refunds requested and any cancellations that occurred during the period and up to the time of reporting of these consolidated financial statements.\n36\nSegment Operating Results\nConcerts\nOur Concerts segment operating results were, and discussions of significant variances are, as follows:\n \nYear Ended December 31,\n% Change\n2024 vs 2023\n% Change\n2023 vs 2022\n \n2024\n2023\n2022\nAs Revised\nAs Revised\nAs Revised\n \n(in thousands)\n \nRevenue \n(1)\n$\n19,024,302\n$\n18,740,913\n$\n13,494,100\n2%\n39%\nDirect operating expenses \n(2)\n16,041,350\n16,001,769\n11,334,178\n0.2%\n41%\nSelling, general and administrative expenses\n3,005,885\n2,497,983\n2,083,637\n20%\n20%\nDepreciation and amortization\n370,108\n320,680\n260,238\n15%\n23%\nGain on disposal of operating assets\n(11,094)\n(10,804)\n(30,810)\n3%\n(65)%\nOperating loss \n(3)\n$\n(381,947)\n$\n(68,715)\n$\n(153,143)\n*\n55%\nOperating margin\n(2.0)%\n(0.4)%\n(1.1)%\nAOI \n(3)\n$\n529,748\n$\n320,397\n$\n174,840\n65%\n83%\nAOI margin\n2.8%\n1.7%\n1.3%\n_________________________\n*\nPercentages are not meaningful.\n(1)\nSee further discussion in Part II — Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 2 – Correction of Errors in Previously Reported Consolidated Financial Statements. For the year ended December 31, 2023, the revision decreased revenue by $22.8 million.\n(2)\nFor the years ended December 31, 2023 and December 31, 2022, the revision decreased direct operating expenses by $17.7 million and $5.1 million, respectively.\n(3)\nFor the years ended December 31, 2023 and December 31, 2022, the revision decreased operating income and AOI by $5.1 million as well as increased operating income and AOI by $5.1 million, respectively.\nRevenue\nConcerts revenue increased $283.4 million during the year ended December 31, 2024 as compared to the prior year attributable to acquisitions and new venues of $335.1 million as well as increased show count and fan growth. In particular, higher arena and amphitheater shows and related fan count partially offset by fewer stadium shows contributed to the increase in revenue.\nOperating results\nConcerts AOI increased $209.4 million during the year ended December 31, 2024 as compared to the prior year primarily driven by an increase in revenues from the number of shows discussed above partially offset by increased selling general and administrative expenses related to additional compensation expenses fueled by growth from our venue footprint and additional global activity. The remaining change in operating income outside of AOI of $522.6 million is primarily associated with Astroworld estimated loss contingencies of $454.9 million and higher depreciation and amortization expenses of $49.4 million for additional capital expenditures incurred to support the increased operations as well as from acquisitions and new venues.\n37\nTicketing\nOur Ticketing segment operating results were, and discussions of significant variances are, as follows:\n \nYear Ended December 31,\n% Change\n2024 vs 2023\n% Change\n2023 vs 2022\n \n2024\n2023\n2022\nAs Revised\nAs Revised\nAs Revised\n \n(in thousands)\n \nRevenue\n$\n2,988,685\n$\n2,959,477\n$\n2,238,618\n1%\n32%\nDirect operating expenses \n(1)\n1,089,608\n1,067,937\n809,173\n2%\n32%\nSelling, general and administrative expenses\n888,198\n855,070\n711,574\n4%\n20%\nDepreciation and amortization\n100,329\n105,256\n109,778\n(5)%\n(4)%\nLoss (gain) on disposal of operating assets\n41\n39\n(197)\n5%\n*\nOperating income \n(2)\n$\n910,509\n$\n931,175\n$\n608,290\n(2)%\n53%\nOperating margin\n30.5%\n31.5%\n27.2%\nAOI \n(2)\n$\n1,123,588\n$\n1,140,133\n$\n812,714\n(1)%\n40%\nAOI margin\n37.6%\n38.5%\n36.3%\n__________________________\n*\nPercentages are not meaningful.\n(1)\nSee further discussion in Part II — Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 2 – Correction of Errors in Previously Reported Consolidated Financial Statements. For the years ended December 31, 2023 and December 31, 2022, the revision decreased direct operating expenses by $23.8 million and increased direct operating expenses by $15.2 million, respectively.\n(2)\nFor the years ended December 31, 2023 and December 31, 2022, the revision increased operating income and AOI by $23.8 million as well as decreased operating income and AOI by $15.2 million, respectively.\nRevenue\nTicketing revenue increased $29.2 million during the year ended December 31, 2024 as compared to the prior year. Ticket sales and gross transaction value for concerts, sporting and family & arts events were largely in line with 2023. For concert events, higher sales for arena and amphitheater shows were mostly offset by a reduction in stadium shows, coming off a record year of stadium activity in 2023.\nOperating results\nTicketing AOI decreased $16.5 million and operating income decreased $20.7 million during the year ended December 31, 2024 as compared to the prior year primarily driven by higher selling, general and administrative expenses attributable to improving the user experience and reducing friction during high demand on-sales.\n38\nSponsorship & Advertising\nOur Sponsorship & Advertising segment operating results were, and discussions of significant variances are, as follows:\n \n \nYear Ended December 31,\n% Change\n2024 vs 2023\n% Change\n2023 vs 2022\n \n2024\n2023\n2022\n \n(in thousands)\n \nRevenue\n$\n1,195,019\n$\n1,095,217\n$\n968,146\n9%\n13%\nDirect operating expenses\n242,536\n245,297\n225,724\n(1)%\n9%\nSelling, general and administrative expenses\n197,565\n184,158\n155,305\n7%\n19%\nDepreciation and amortization\n62,934\n72,969\n60,318\n(14)%\n21%\nLoss on sale of operating assets\n38\n—\n—\n*\n*\nOperating income\n$\n691,946\n$\n592,793\n$\n526,799\n17%\n13%\nOperating margin\n57.9%\n54.1%\n54.4%\nAOI\n$\n763,777\n$\n675,137\n$\n591,972\n13%\n14%\nAOI margin\n63.9%\n61.6%\n61.1%\n______________\n*\nPercentages are not meaningful.\nRevenue\nSponsorship & Advertising revenue increased $99.8 million during the year ended December 31, 2024 as compared to the prior year primarily driven by increased sponsorship activity from our international markets and onsite sponsorships.\nOperating results\nSponsorship & Advertising AOI increased $88.6 million and operating income increased $99.2 million during the year ended December 31, 2024 as compared to the prior year. These increases were primarily due to increased revenues from sponsorship activity discussed above.\n39\nLiquidity and Capital Resources \nOur cash is centrally managed on a worldwide basis. Our primary short-term liquidity needs are to fund general working capital requirements, capital expenditures and debt service requirements while our long-term liquidity needs are primarily related to acquisitions and debt repayment. Our primary sources of funds for our short-term liquidity needs will be cash flows from operations and borrowings under our amended senior secured credit facility, while our long-term sources of funds will be from cash flows from operations, long-term bank borrowings and other debt or equity financings. We may from time to time engage in open market purchases of our outstanding debt securities or redeem or otherwise repay such debt.\nOur balance sheet reflects cash and cash equivalents of $6.1 billion at December 31, 2024 and $6.2 billion at December 31, 2023. Included in the December 31, 2024 and 2023 cash and cash equivalents balances are $1.6 billion and $1.5 billion, respectively, of cash received that includes the face value of tickets sold on behalf of our ticketing clients and their share of service charges, which we refer to as client cash. We generally do not utilize client cash for our own financing or investing activities as the amounts are payable to clients on a regular basis. Our foreign subsidiaries held approximately $3.3 billion in cash and cash equivalents, excluding client cash, at December 31, 2024. We generally do not repatriate these funds, but if we did, we would need to accrue and pay United States state income taxes as well as any applicable foreign withholding or transaction taxes on future repatriations.\nWe may from time to time enter into borrowings under our revolving credit facility. If the original maturity of these borrowings is 90 days or less, we present the borrowings and subsequent repayments on a net basis in the statement of cash flows to better represent our financing activities. Our balance sheet reflects total net debt of $6.4 billion and $6.6 billion, respectively, at December 31, 2024 and December 31, 2023. Our weighted-average cost of debt, excluding unamortized debt discounts and debt issuance costs on our term loans and notes, was 4.4% at December 31, 2024, with approximately 93% of our debt at fixed rates. Our weighted-average cost of debt for short-term borrowings outstanding at December 31, 2024, excluding unamortized debt discounts and debt issuance costs on our term loans and notes, was 5.0%.\nOur cash and cash equivalents are held in accounts managed by third-party financial institutions and consist of cash in our operating accounts and invested cash. Cash held in non-interest-bearing and interest-bearing operating accounts in many cases exceeds the Federal Deposit Insurance Corporation insurance limits. The invested cash is in interest-bearing funds consisting primarily of bank deposits and money market funds. While we monitor cash and cash equivalents balances in our operating accounts on a regular basis and adjust the balances as appropriate, these balances could be impacted if the underlying financial institutions fail. To date, we have experienced no loss or lack of access to our cash and cash equivalents; however, we can provide no assurances that access to our cash and cash equivalents will not be impacted by adverse conditions in the financial markets.\nFor our Concerts segment, we often receive cash related to ticket revenue in advance of the event, which is recorded in deferred revenue until the event occurs. In the United States, this cash is largely associated with events in our owned or operated venues, notably amphitheaters, festivals, theaters and clubs. Internationally, this cash is from a combination of both events in our owned or operated venues, as well as events in third-party venues associated with our promoter’s share of tickets in allocation markets. With the exception of some upfront costs and artist advances, which are recorded in prepaid expenses until the event occurs, we pay the majority of event-related expenses at or after the event. Artists are paid when the event occurs under one of several different formulas, which may include fixed guarantees and/or a percentage of ticket sales or event profits, net of any advance they have received. When an event is cancelled, any cash held in deferred revenue is reclassified to accrued expenses as those funds are typically refunded to the fan within 30 days of event cancellation. When a show is rescheduled, fans have the ability to request a refund if they do not want to attend the event on the new date, although historically we have had low levels of refund requests for rescheduled events.\nWe view our available cash as cash and cash equivalents, less ticketing-related client cash, less event-related deferred revenue, less accrued expenses due to artists and cash collected on behalf of others, plus event-related prepaid expenses. This is essentially our cash available to, among other things, repay debt balances, make acquisitions, and finance capital expenditures.\nOur intra-year cash fluctuations are impacted by the seasonality of our various businesses. Examples of seasonal effects include our Concerts segment, which reports the majority of its revenue in the second and third quarters. Cash inflows and outflows depend on the timing of event-related payments but the majority of the inflows generally occur prior to the event. See “—Seasonality” below. We believe that we have sufficient financial flexibility to fund these fluctuations and to access the global capital markets on satisfactory terms and in adequate amounts, although there can be no assurance that this will be the case, and capital could be less accessible and/or more costly given current economic conditions. We expect cash flows from operations and borrowings under our amended senior secured credit facility, along with other financing alternatives, to satisfy working capital requirements, capital expenditures and debt service requirements for at least the succeeding year. We may need to incur additional debt or issue equity to make other strategic acquisitions or investments. There can be no assurance that such financing will be available to us on acceptable terms or at all. We may make significant acquisitions in the near term, subject to limitations imposed by our financing agreements and market conditions.\n40\nThe lenders under our revolving loans and counterparty to our interest rate hedge agreement consists of banks and other third-party financial institutions. While we currently have no indications or expectations that such lenders will be unable to fund their commitments as required, we can provide no assurances that future funding availability will not be impacted by adverse conditions in the financial markets. Should an individual lender default on its obligations, the remaining lenders would not be required to fund the shortfall, resulting in a reduction in the total amount available to us for future borrowings, but would remain obligated to fund their own commitments. Should the counterparty to our interest rate hedge agreement default on its obligation, we could experience higher interest rate volatility during the period of any such default.\nSources of Cash\nIn December 2024, we issued $1.1 billion principal amount of 2.875% convertible senior notes due 2030. In conjunction with this issuance, we used the net proceeds to repay $585.0 million outstanding amounts under our senior secured revolving credit facility, to repurchase $316.0 million aggregate principal amount of the 2.0% convertible senior notes due 2025 and related repurchase premiums, fees and accrued interest of $98.0 million, paid debt issuance costs of $18.1 million, with any remaining proceeds available for general corporate purposes. \nIn November 2024, we amended our senior secured credit facility and added a new venue expansion revolving credit facility of $400.0 million, which resulted in a total available revolving borrowing capacity of $1.7 billion.\nDuring the three months ended March 31, 2024, we repaid $370.0 million outstanding amounts under our senior secured revolving credit facility that had been outstanding as of December 31, 2023. No material gain or loss was recorded as a result of this repayment.\nIn November 2023, we amended our senior secured credit facility to include a $1.3 billion revolving credit facility in addition to the existing $950.0 million term loan B facility. The $1.3 billion revolving credit facility refinanced our existing $630.0 million revolving credit facilities and we drew down $370.0 million at closing to repay in full our outstanding $367.5 million delayed draw term A loan facility and related accrued interest and fees. The delayed draw term A loan facility was permanently retired upon being repaid in full.\nIn February 2023, we amended our senior secured credit facility. The amendments provides for, among other things: (i) replacement of the benchmark reference rate of the Eurodollar Rate (as defined in the Credit Agreement) with the Term SOFR Rate for borrowings denominated in United States Dollars and for each Alternative Currency (as defined in the Credit Agreement), a corresponding reference rate, as set forth in the Amended Credit Agreement, (ii) deletion of the provisions regarding Canadian bankers’ acceptances, and (iii) the addition of our ability to draw letters of credit in Canadian Dollars.\nIn January 2023, we issued $1.0 billion principal amount of 3.125% convertible senior notes due 2029. In conjunction with this issuance, we used approximately $485.8 million of the net proceeds to repurchase $440.0 million aggregate principal amount of the 2.5% convertible senior notes due 2023, entered into capped call transactions at a cost of $75.5 million, paid debt issuance costs of $15.0 million, with any remaining proceeds available for general corporate purposes.\nIn December 2022, we entered into a $126.7 million Euro denominated loan due in 2024 with a floating interest rate of three month Euribor plus 3.0% per annum related to an asset acquisition in Europe. In December 2024, we extended the maturity of the Euro denominated loan to December 2025.\nDebt Instruments\nInformation regarding our various debt instruments can be found in Part II —Financial Information —Item 8.—Financial Statements and Supplementary Data—Note 5 – Long-Term Debt.\nDebt Covenants\nInformation regarding our debt covenants can be found in Part II —Financial Information —Item 8.—Financial Statements and Supplementary Data—Note 5 – Long-Term Debt.\nSubsequent Event\nOn February 18, 2025, we utilized $84.8 million of our existing cash balance to repay the remaining aggregate principal amount of the 2.0% convertible senior notes due February 2025 plus accrued interest and we issued 182,560 shares of common stock to the convertible holders.\n41\nUses of Cash\nAcquisitions\nDuring 2024, we completed various acquisitions that resulted in cash paid, net of cash acquired, of $98.3 million.\nCapital Expenditures\nVenue and ticketing operations require ongoing investment in our existing venues and ticketing systems to address fan and artist expectations, technological industry advances and various federal, state and/or local regulations.\nWe categorize capital outlays between revenue generating capital expenditures and maintenance capital expenditures. Revenue generating capital expenditures are primarily focused on our global venue expansion strategy as we connect more artists to their global fan base and major renovations to buildings to enhance the fan experience and drive improvements in our hospitality efforts including onsite spending and premium experiences. In addition, in Ticketing, we continue to develop new ticketing tools and technology enhancements. Revenue generating capital expenditures can also include smaller projects whose purpose is to increase revenue and/or improve operating income. Maintenance capital expenditures are associated with the renewal and improvement of existing venues and technology systems, web development and administrative offices. Capital expenditures typically increase during periods when our venues are not in operation since that is the time that such improvements can be completed.\nOur capital expenditures, including accruals for amounts incurred but not yet paid for, but net of expenditures funded by outside parties such as landlords and noncontrolling interest partners or expenditures funded by insurance proceeds, consisted of the following:\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(in thousands)\nRevenue generating capital expenditures\n$\n499,220 \n$\n321,885 \n$\n237,603 \nMaintenance capital expenditures\n133,411 \n131,866 \n126,957 \nTotal capital expenditures\n$\n632,631 \n$\n453,751 \n$\n364,560 \nFor the years ended December 31, 2024, 2023 and 2022, $5.0 million, $15.0 million and $12.4 million, respectively, of insurance proceeds and landlord or noncontrolling interest partner reimbursements have been excluded from capital expenditures in the table above.\nRevenue generating capital expenditures for 2024 increased from the same period of the prior year primarily due to enhancements at our theaters and amphitheaters in the United States as well as a stadium in Mexico.\nWe expect capital expenditures to be approximately $900 million to $1.0 billion for the year ending December 31, 2025 with approximately 85% dedicated to revenue generating projects, including $700 million to $800 million of spend relating to our venue expansion and enhancement plans. Some of the more significant projects in 2025 include an extensive renovation of an arena in Hamilton, Ontario in Canada and the new Riverside Amphitheater outside of Kansas City, Missouri which will open in 2026. In the third quarter of 2025, our new stadium in Bogota, Colombia will open, with capacity for 40,000 fans, further strengthening our presence in Latin America. Approximately $250 million of our capital expenditure estimate is being funded outside our cash flow by third party equity partners, sponsors, pre-selling certain premium rights and project-based debt.\nCash Flows\n \nYear Ended December 31,\n \n2024\n2023\n2022\nAs Revised\nAs Revised\n \n(in thousands)\nCash provided by (used in):\nOperating activities\n$\n1,725,175 \n$\n1,362,974 \n$\n1,835,047 \nInvesting activities\n$\n(854,281)\n$\n(695,805)\n$\n(784,691)\nFinancing activities\n$\n(658,550)\n$\n(87,281)\n$\n(143,340)\n42\nOperating Activities\nCash provided by operating activities increased $362.2 million for the year ended December 31, 2024 as compared to the prior year primarily due to an overall increase in net income combined with changes in operating assets and liabilities partially offset by higher deferred income taxes, lower provision for uncollectible accounts receivable, changes in fair value of contingent considerations from certain acquisitions and higher gains on mark-to-market of investments in nonconsolidated affiliates during 2024.\nInvesting Activities\nCash used in investing activities increased $158.5 million for the year ended December 31, 2024 as compared to the prior year primarily due to higher purchases of property, plant and equipment in 2024 for revenue generating capital expenditures and cash paid for acquisitions, net of cash acquired, which were partially offset by lower advances in notes receivable and higher collections of notes receivable due to timing. See “—Uses of Cash” above for further discussion.\nFinancing Activities\nCash used in financing activities increased $571.3 million for the year ended December 31, 2024 as compared to the prior year primarily due to higher payments of our long-term debt as a result of the repayment of outstanding amounts under our senior secured revolving credit facility, repayment of the principal amount on our 4.875% senior notes and the repurchase of a portion of our 2.0% convertible senior notes. These repayments were partially offset by higher proceeds of debt in 2024 from the issuance of our 2.875% convertible senior notes and draw down from our senior secured revolving credit facility as compared to 2023. See “—Sources of Cash” above for further discussion.\nContractual Obligations and Commitments\nFirm Commitments\nWe have future cash obligations for our debt obligations and operating lease liabilities. We lease office space, certain equipment and many of the venues used in our concert operations under long-term operating leases. Some of our lease agreements contain renewal options and annual rental escalation clauses (generally tied to the consumer price index), as well as provisions for our payment of utilities and maintenance. Information regarding our scheduled maturities of our outstanding debt obligations (excluding unamortized debt discounts and issuance costs) and operating lease liabilities can be found in Part II—Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 5 – Long-Term Debt and —Note 4 – Leases, respectively.\nWe also have minimum payments associated with non-cancelable contracts related to our operations, such as artist guarantees and client ticketing agreements. As part of our ongoing capital projects, we will enter into construction-related commitments for future capital expenditure work. Information regarding our minimum payments for non-cancelable contracts and capital expenditures commitments can be found in Part II—Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 8 – Commitments and Contingent Liabilities as of December 31, 2024 and thus do not represent all expected expenditures for those periods.\nThe estimated interest payments, and expected payments of contingent and deferred consideration liabilities as of December 31, 2024 are as follows:\n \nPayments Due by Period\nTotal\n \n2025\n2026\n2027\n2028\n2029\nThereafter\n \n(in thousands)\nEstimated interest payments\n$\n801,532 \n$\n288,800 \n$\n255,401 \n$\n149,741 \n$\n66,325 \n$\n34,662 \n$\n6,603 \nContingent and deferred consideration\n61,531 \n40,764 \n8,211 \n6,345 \n368 \n365 \n5,478 \nTotal\n$\n863,063 \n$\n329,564 \n$\n263,612 \n$\n156,086 \n$\n66,693 \n$\n35,027 \n$\n12,081 \nGuarantees of Third-Party Obligations\nAs of December 31, 2024 and 2023, we guaranteed the debt of third parties of approximately $19.4 million and $19.4 million, respectively, primarily related to maximum credit limits on employee and tour-related credit cards and obligations under a venue management agreement.\nSeasonality\nInformation regarding the seasonality of our business can be found in Part II—Financial Information—Item 8.—Financial Statements and Supplementary Data—Note 1 – The Company and Summary of Significant Accounting Policies.\n43\nMarket Risk\nWe are exposed to market risks arising from changes in market rates and prices, including movements in foreign currency exchange rates and interest rates.\nForeign Currency Risk\nWe have operations in countries throughout the world. The financial results of our foreign operations are measured in their local currencies. Our foreign subsidiaries also carry certain net assets or liabilities that are denominated in a currency other than that subsidiary’s functional currency. As a result, our financial results could be affected by factors such as changes in foreign currency exchange rates or weak economic conditions in the foreign markets in which we have operations. We operate in certain countries that are hyper-inflationary, for example Argentina, however the impact of these currencies did not have a material impact on our statement of operations for the year ended December 31, 2024. Our foreign operations reported an operating income of $744.4 million for the year ended December 31, 2024. We estimate that a 10% change in the value of the United States dollar relative to foreign currencies would change our operating income for the year ended December 31, 2024 by $74.4 million. As of December 31, 2024, our most significant foreign exchange exposure included the Euro, British Pound, Australian Dollar, Canadian Dollar and Mexican Peso. This analysis does not consider the implication such currency fluctuations could have on the overall economic conditions of the United States or other foreign countries in which we operate or on the results of operations of our foreign entities. In addition, the reported carrying value of our assets and liabilities, including the total cash and cash equivalents held by our foreign operations, will also be affected by changes in foreign currency exchange rates.\nWe primarily use forward currency contracts, in addition to options, to reduce our exposure to foreign currency risk associated with short-term artist fee commitments. At December 31, 2024, we had forward currency contracts outstanding with an aggregate notional amount of $283.1 million.\nInterest Rate Risk\nOur market risk is also affected by changes in interest rates. We had $6.5 billion of total debt, excluding unamortized debt discounts and issuance costs, outstanding as of December 31, 2024. Of the total amount, we had $6.0 billion of fixed-rate debt and $457.6 million of floating-rate debt. \nBased on the amount of our floating-rate debt as of December 31, 2024, each 25-basis point increase or decrease in interest rates would increase or decrease our annual interest expense and cash outlay by approximately $1.1 million. This potential increase or decrease is based on the simplified assumption that the level of floating-rate debt remains constant with an immediate across-the-board increase or decrease as of December 31, 2024 with no subsequent change in rates for the remainder of the period.\nIn January 2020, we entered into an interest rate swap agreement that is designated as a cash flow hedge for accounting purposes to effectively convert a portion of our floating-rate debt to a fixed-rate basis. The swap agreement expires in October 2026, has a notional amount of $500 million and ensures that a portion of our floating-rate debt does not exceed 3.445%.\n \nRecent Accounting Pronouncements\nInformation regarding recently issued and adopted accounting pronouncements can be found in Item 8.—Financial Statements and Supplementary Data—Note 1 – The Company and Summary of Significant Accounting Policies.\n44\nCritical Accounting Policies and Estimates\nThe preparation of our financial statements in conformity with GAAP requires management to make estimates, judgments and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. On an ongoing basis, we evaluate our estimates that are based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. The result of these evaluations forms the basis for making judgments about the carrying values of assets and liabilities and the reported amount of revenue and expenses that are not readily apparent from other sources. Because future events and their effects cannot be determined with certainty, actual results could differ from our assumptions and estimates, and such difference could be material. Management believes that the following accounting estimates are the most critical to aid in fully understanding and evaluating our reported financial results, and they require management’s most difficult, subjective or complex judgments, resulting from the need to make estimates about the effect of matters that are inherently uncertain. The following narrative describes these critical accounting estimates, the judgments and assumptions and the effect if actual results differ from these assumptions where applicable.\nConsolidation \nOur consolidated financial statements include all of our accounts, including our majority owned and controlled subsidiaries and VIEs for which we are the primary beneficiary. Intercompany accounts among the consolidated businesses have been eliminated in consolidation. Net income (loss) attributable to noncontrolling interests is reflected in the statements of operations.\nTypically, we consolidate entities in which we own more than 50% of the voting common stock and control operations and also VIEs for which we are the primary beneficiary. Investments in nonconsolidated affiliates in which we own more than 20% of the voting common stock or otherwise exercise significant influence over operating and financial policies, but not control of the nonconsolidated affiliate, are accounted for using the equity method of accounting. Investments in nonconsolidated affiliates in which we own less than 20% of the voting common stock and do not exercise significant influence over operating and financial policies are accounted for at fair value unless the investment does not have a readily determinable fair value in which case the investment is accounted for at cost less any impairment.\nBusiness Combinations \nWe account for our business combinations under the acquisition method of accounting. Identifiable assets acquired, liabilities assumed and any noncontrolling interest in the acquiree are recognized and measured as of the acquisition date at fair value. Additionally, contingent consideration is recorded at fair value on the acquisition date and classified as a liability. Goodwill is recognized to the extent by which the aggregate of the acquisition-date fair value of the consideration transferred and any noncontrolling interest in the acquiree exceeds the recognized basis of the identifiable assets acquired, net of assumed liabilities. Determining the fair value of assets acquired, liabilities assumed and noncontrolling interest requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future cash flows, discount rates and asset lives among other items. In addition, when we have acquisitions where substantially all of the fair value of assets acquired is concentrated in a single asset or group of similar assets, we account for the acquisitions as asset acquisitions.\nIntangibles \nWe classify intangible assets as definite-lived or indefinite-lived. Definite-lived intangibles include revenue-generating contracts, client/vendor relationships, trademarks and naming rights, technology, non-compete agreements, and venue management and leasehold agreements, all of which are amortized either on a straight-line basis over the respective lives of the agreements, typically 3 to 10 years, or on a basis more representative of the time pattern over which the benefit is derived. We periodically review the appropriateness of the amortization periods related to our definite-lived intangible assets. These assets are stated at cost or fair value at the date of acquisition. Indefinite-lived intangibles consist of trade names and cryptocurrency assets which are not subject to amortization. Our amortization expense is presented as a separate line item, with depreciation expense, in the statements of operations. There is no amortization expense included in direct operating expenses, selling, general and administrative expenses or corporate expenses.\nWe test for possible impairment of definite-lived intangible assets whenever events or circumstances change, such as a current period operating cash flow loss combined with a history of, or projections of, operating cash flow losses or a significant adverse change in the manner in which the asset is intended to be used, which could indicate that the carrying amount of the asset may not be recoverable. If indicators exist, we compare the estimated undiscounted future cash flows related to the asset to the carrying value of the asset. If the carrying value is greater than the estimated undiscounted future cash flow amount, an impairment charge is recorded based on the difference between the fair value and the carrying value. Any such impairment charge is recorded in depreciation and amortization in the statements of operations. For the years ended December 31, 2024, 2023 and 2022, there were no significant impairment charges.\n45\nWe test for possible impairment of indefinite-lived intangible assets at least annually. Depending on facts and circumstances, qualitative factors may first be assessed to determine whether the existence of events and circumstances indicate that it is more likely than not that an indefinite-lived intangible asset is impaired. If it is concluded that it is more likely than not impaired, we perform a quantitative impairment test by comparing the fair value with the carrying amount. When specific assets are determined to be impaired, the cost basis of the asset is reduced to reflect the current fair value. The impairment loss calculations require management to apply judgment in estimating future cash flows, expected future revenue, discount rates and royalty rates that reflect the risk inherent in future cash flows. For the years ended December 31, 2024, 2023 and 2022, there were no significant impairment charges.\nGoodwill\nWe review goodwill for impairment annually, as of October 1, using a two-step process. We also test goodwill for impairment in other periods if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount or when we change our reporting units.\nThe first step is a qualitative evaluation as to whether it is more likely than not that the fair value of any of our reporting units is less than its carrying value using an assessment of relevant events and circumstances. Examples of such events and circumstances include historical financial performance, industry and market conditions, macroeconomic conditions, reporting unit-specific events, historical results of goodwill impairment testing and the timing of the last performance of a quantitative assessment. We also considered changes in discount rates, market multiples, carrying values and forecast since the last quantitative test. If any reporting units are concluded to be more likely than not impaired, or if that conclusion cannot be determined qualitatively, a second step is performed for that reporting unit utilizing a quantitative approach.\nFor the year ended December 31, 2024, as part of a refresh of the fair values of reporting units, as of July 1, 2024, three of our reporting units were assessed under quantitative analysis to support future qualitative evaluation. As of October 1, as required by our policy to perform goodwill tests annually as of October 1, these three reporting units were also assessed under the initial qualitative evaluation and did not advance to the quantitative analysis. As of October 1, the remaining three reporting units with goodwill were assessed under quantitative analysis to support future qualitative evaluation. All of our reporting units assessed under the quantitative analysis primarily used a discounted cash flows methodology, with a lesser weighting attributed to the market multiple approach. The discounted cash flows methodology estimates fair value by discounting the reporting unit’s estimated future cash flows using a weighted-average cost of capital that reflects current market conditions and the risk profile of the reporting unit. Under the market multiple approach, the estimated fair value of the reporting unit was estimated by applying market multiples derived from stock prices of companies that are engaged in the same or similar lines of business as the reporting unit and that are actively traded on a free and open market. The derived multiples are then applied to the reporting unit’s financial metrics. \nFor the year ended December 31, 2023, as part of our annual test for impairment, one of our reporting units, which accounted for approximately 12% of our goodwill at December 31, 2023, was assessed under the quantitative analysis. The remaining reporting units with goodwill were assessed under the initial qualitative evaluation and did not advance to the quantitative analysis.\nFor the year ended December 31, 2022, as part of our annual test for impairment, all of our reporting units with goodwill were assessed under the initial qualitative evaluation and did not advance to the quantitative analysis. No impairment charges were recorded for the years ended December 31, 2024, 2023 and 2022.\nRevenue Recognition \nRevenue from the promotion or production of an event in our Concerts segment is recognized when the event occurs. Revenue collected in advance of the event is recorded as deferred revenue until the event occurs. Revenue collected from sponsorship agreements, which is not related to a single event, is classified as deferred revenue and recognized over the term of the agreement or operating season as the benefits are provided to the sponsor.\nRevenue from our ticketing operations primarily consists of service fees charged at the time a ticket for an event is sold in either the primary or secondary markets. For primary tickets sold to our concert and festival events, where our concert promoters control ticketing, the revenue for the associated ticket service charges collected in advance of the event is recorded as deferred revenue until the event occurs and these service charges are shared between our Ticketing and Concerts segments. For primary tickets sold for events of third-party clients and secondary market sales, the revenue is recognized at the time of the sale and is recorded by our Ticketing segment. \nWe account for taxes that are externally imposed on revenue producing transactions on a net basis. \n46\nLitigation Accruals \nWe are currently involved in certain legal proceedings and, as required, have accrued our estimate of the probable costs for the resolution of these claims. Management’s estimates used have been developed in consultation with counsel and are based upon an analysis of potential results, assuming a combination of litigation and settlement strategies. It is possible, however, that future results of operations for any particular period could be materially affected by changes in our assumptions or the effectiveness of our strategies related to these proceedings.\nIncome Taxes \nWe account for income taxes using the liability method which results in deferred tax assets and liabilities based on differences between financial reporting bases and tax bases of assets and liabilities and are measured using the enacted tax rates expected to apply to taxable income in the periods in which the deferred tax asset or liability is expected to be realized or settled. We assess the realizability of our deferred tax assets, considering all relevant factors, at each reporting period. As almost all earnings from our continuing foreign operations are permanently reinvested and not distributed, our income tax provision does not include additional United States state and foreign withholding or transaction taxes on those foreign earnings that would be incurred if they were distributed. It is not practicable to determine the amount of state and foreign income taxes, if any, that might become due in the event that any remaining available cash associated with these earnings were distributed.\nThe FASB guidance for income taxes prescribes a recognition threshold and a measurement attribute for the financial statement recognition and measurement of tax positions taken or expected to be taken in a tax return. For those benefits to be recognized, a tax position must be more likely than not to be sustained upon examination by taxing authorities. The amount recognized is measured as the largest amount of benefit that is more likely than not to be realized upon ultimate settlement.\nWe have established a policy of including interest related to tax loss contingencies in income tax expense (benefit) in the statements of operations. \nWe treat the taxes due on future Global Intangible Low-Taxed Income (“GILTI”) inclusions in United States taxable income as a current-period expense when incurred.",
  "item2": null
}