{
  "source_file": "lyv-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our 2024 Annual Report on Form 10-K filed with the SEC on February 21, 2025.\nThere have been no changes to our critical accounting policies during the nine months ended September 30, 2025.\n41\nTable of Contents\nItem 3. Quantitative and Qualitative Disclosures About Market Risk\nRequired information is within Part I — Financial Information—Item 2.—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Market Risk.\nItem 4. Controls and Procedures\nEvaluation of Disclosure Controls and Procedures\nWe have established disclosure controls and procedures to ensure that material information relating to our company, including our consolidated subsidiaries, is made known to the officers who certify our financial reports and to other members of senior management and our board of directors.\nBased on their evaluation as of September 30, 2025, our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) under the Securities Exchange Act of 1934, as amended) are effective to ensure that (1) the information required to be disclosed by us in the reports that we file or submit under the Securities Exchange Act of 1934, as amended, is recorded, processed, summarized and reported within the time periods specified in SEC rules and forms, and (2) the information we are required to disclose in such reports is accumulated and communicated to management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nOur management, including our Chief Executive Officer and Chief Financial Officer, does not expect that our disclosure controls and procedures or internal controls will prevent all possible errors and fraud. Our disclosure controls and procedures are, however, designed to provide reasonable assurance of achieving their objectives, and our Chief Executive Officer and Chief Financial Officer have concluded that our disclosure controls and procedures are effective at that reasonable assurance level.\nChanges in Internal Control Over Financial Reporting\nThere has been no change in our internal control over financial reporting during the period covered by this report that has materially affected, or is reasonably likely to materially affect, our internal control over financial reporting. \n42\nTable of Contents\nPART II—OTHER INFORMATION\nItem 1. Legal Proceedings\nInformation regarding our legal proceedings can be found in Part I—Financial Information—Item 1. Financial Statements—Note 6 – Commitments and Contingent Liabilities.\nItem 1A. Risk Factors \nWhile we attempt to identify, manage and mitigate risks and uncertainties associated with our business to the extent practical under the circumstances, some level of risk and uncertainty will always be present. Part I—Item 1A.—Risk Factors of our 2024 Annual Report on Form 10-K filed with the SEC on February 21, 2025, describes some of the risks and uncertainties associated with our business which could materially and adversely affect our business, financial condition, cash flows and results of operations, and the trading price of our common stock could decline as a result. We do not believe that there have been any material changes to the risk factors previously disclosed in our 2024 Annual Report on Form 10-K.\nItem 2. Unregistered Sales of Equity Securities and Use of Proceeds\nPurchase of Equity Securities\nThe following table provides information regarding repurchases of our common stock during the three months ended  September 30, 2025:\nPeriod\nTotal Number of Shares Purchased \n(1)\nAverage Price Paid per Share \n(1)\nTotal Number of Shares Purchased as Part of Publicly Announced Program \n(2)\nMaximum Fair Value of Shares that May Yet Be Purchased Under the Program \n(2)\nJuly 2025\n6,071 \n$143.94 \nAugust 2025\n104,574 \n$150.76 \nSeptember 2025\n95,721 \n$171.76 \n206,366 \n(1)\n  Represents shares of common stock that employees surrendered as part of the default option to satisfy withholding taxes in connection with the vesting of restricted stock awards under our stock incentive plan. Pursuant to the terms of our stock plan, such shares revert to available shares under the plan.\n(2)\n  We do not have a publicly announced program to purchase shares of our common stock. Accordingly, there were no shares purchased as part of a publicly announced program.\nItem 3. Defaults Upon Senior Securities\nNone.\nItem 5. Other Information\nNo\n director or officer adopted or terminated any Rule 10b5-1 plan, or any other written trading arrangement that meets the requirements of a “\nnon-Rule 10b5-1\n trading arrangement” during the three months ended September 30, 2025.\n43\nTable of Contents\nItem 6. Exhibits\nExhibit Description\nIncorporated by Reference\nFiled\nHerewith\nExhibit\nNo.\nForm\nFile No.\nExhibit No.\nFiling Date\n31.1\nCertification of Chief Executive Officer.\nX\n31.2\nCertification of Chief Financial Officer.\nX\n32.1\nSection 1350 Certification of Chief Executive Officer.\nX\n32.2\nSection 1350 Certification of Chief Financial Officer.\nX\n101.INS\nXBRL Instance Document - this instance document does not appear in the Interactive Data File because its XBRL tags are embedded within the Inline XBRL document.\nX\n101.SCH\nXBRL Taxonomy Schema Document.\nX\n101.CAL\nXBRL Taxonomy Calculation Linkbase Document.\nX\n101.DEF\nXBRL Taxonomy Definition Linkbase Document.\nX\n101.LAB\nXBRL Taxonomy Label Linkbase Document.\nX\n101.PRE\nXBRL Taxonomy Presentation Linkbase Document.\nX\n104\nCover Page Interactive Data File (Formatted as Inline XBRL and contained in Exhibit 101)\nX\n §    Management contract or compensatory plan or arrangement.\n44\nTable of Contents\nSIGNATURES\nPursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, on November 4, 2025.\n \nLIVE NATION ENTERTAINMENT, INC.\nBy:\n/s/ Brian Capo\nBrian Capo\nSenior Vice President—Chief Accounting Officer \n(Duly Authorized Officer)\n45",
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n“Live Nation” (which may be referred to as the “Company,” “we,” “us” or “our”) means Live Nation Entertainment, Inc. and its subsidiaries, or one of our segments or subsidiaries, as the context requires. You should read the following discussion of our financial condition and results of operations together with the unaudited consolidated financial statements and notes to the financial statements included elsewhere in this quarterly report.\nSpecial Note About Forward-Looking Statements\nCertain statements contained in this quarterly report (or otherwise made by us or on our behalf from time to time in other reports, filings with the SEC, news releases, conferences, internet postings or otherwise) that are not statements of historical fact constitute “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act of 1934, as amended, notwithstanding that such statements are not specifically identified. Forward-looking statements include, but are not limited to, statements about our financial position, business strategy, competitive position, potential growth opportunities, potential operating performance improvements, the effects of competition, the effects of future legislation or regulations and plans and objectives of our management for future operations. We have based our forward-looking statements on our beliefs and assumptions considering the information available to us at the time the statements are made. Use of the words “may,” “should,” “continue,” “plan,” “potential,” “anticipate,” “believe,” “estimate,” “expect,” “intend,” “outlook,” “could,” “target,” “project,” “seek,” “predict,” or variations of such words and similar expressions are intended to identify forward-looking statements but are not the exclusive means of identifying such statements.\nForward-looking statements are not guarantees of future performance and are subject to risks and uncertainties that could cause actual results to differ materially from those in such statements. Factors that could cause actual results to differ from those discussed in the forward-looking statements include, but are not limited to, those set forth below under Part II—Other Information—Item 1A.—Risk Factors, in Part I—Item IA.—Risk Factors of our 2024 Annual Report on Form 10-K as well as other factors described herein or in our annual, quarterly and other reports we file with the SEC (collectively, “cautionary statements”). Based upon changing conditions, should any risk or uncertainty that has already materialized, worsen in scope, impact or duration, or should one or more of the currently unrealized risks or uncertainties materialize, or should any underlying assumptions prove incorrect, actual results may vary materially from those described in any forward-looking statements. All subsequent written and oral forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by the applicable cautionary statements. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date on which they are made. We do not intend to update these forward-looking statements, except as required by applicable law.\nExecutive Overview\nOur third quarter was another record for the Company with operating income up 24% and AOI up 14% versus 2024.  With our largest quarter completed and the summer season wrapped, we are confident of hitting our 2025 goals. Nearly all of our large venue content for the year is booked and our event-related deferred revenue balance of $3.5 billion is up $1.0 billion or 37% compared to September 30, 2024, demonstrating continued consumer demand for live concert experiences.\nFor the third quarter of 2025, revenues increased by $848.1 million, or 11%, on a reported basis as compared to the same period in 2024, from $7.7 billion to $8.5 billion. The increase was $707.8 million, or 9%, on a constant currency basis. Revenue growth for the quarter was largely driven by our Concerts segment with more fans and record stadium activity across over 50 markets. Our operating income increased by 24% and AOI increased 14% versus 2024. Revenues, operating income and AOI rose in all three of our reporting segments in the quarter as a result of higher fan count, higher ticket sales and more brand partnerships.\nFor the first nine months of 2025, our consolidated revenue increased by $1.4 billion, or 8%, compared to the same period in 2024, from $17.5 billion to $18.9 billion. The increase was $1.3 billion, or 8%, on a constant currency basis. We had consolidated operating income of $1.4 billion for the first nine months of 2025, an increase of $0.3 billion compared to the first nine months of 2024 at a reported and constant currency basis. Consolidated AOI for the first nine months increased by $183.9 million, or 9%, compared to the same period in 2024, from $2.0 billion to $2.2 billion. The increase was the same on a constant currency basis.\nAll of the segment financial comments to follow are based on reported foreign currency exchange rates.\nOur Concerts segment revenue for the quarter increased by $701.9 million, or 11%, from $6.6 billion in the third quarter of 2024 to $7.3 billion in the third quarter of 2025. The revenue increase was largely the result of more stadium shows and fans this quarter. Similar to the second quarter, the majority of Concerts’ revenue growth came from international markets, led by Mexico and the United Kingdom. The total number of events for the third quarter of 2025 was approximately 12,300 compared to over 12,800 in the third quarter of 2024, a decrease of approximately 500 events or 4%. The number of fans for the quarter was 51.3 million compared to 50.1 million last year, an increase of 1.2 million or 2% driven by double-digit growth in stadium \n25\nTable of Contents\ncontent. Some of the major acts touring in the third quarter of 2025 included Oasis, The Weeknd, Chris Brown and Blackpink. Our larger festivals in the quarter included Lollapalooza Chicago, Ocean’s Calling in Maryland, Rock Werchter in Belgium and Lowlands in the Netherlands. Meanwhile, Concerts AOI for the quarter was $514.2 million compared to $474.1 million in the third quarter of 2024, for growth of $40.1 million or 8%. \nFor the first nine months of 2025, Concerts revenue grew $1.3 billion compared to the same period in 2024, from $14.4 billion to $15.7 billion. For the first nine months of 2025, our Concerts fan count was 117.8 million compared to 111.9 million for the same period in 2024, an increase of 5.9 million fans or 5%. Fan growth has been driven by more activity in stadiums globally with nearly 30 million fans attending one of our stadium shows so far this year. Onsite spending at our United States amphitheater shows for the first nine months of 2025 versus 2024 grew by 8% per fan for the season, driven by higher food and beverage spending. For our larger festivals, we saw 6% growth in per fan spend, driven largely by higher food and beverage and VIP sales. Concerts AOI for the first nine months increased by $136.5 million, or 18%, compared to the same period in 2024, from $742.9 million to $879.4 million.\nOur Ticketing segment revenue for the quarter increased by $103.9 million, or 15%, from $693.7 million in the third quarter of 2024 to $797.6 million in the third quarter of 2025. We sold 89.1 million fee-bearing tickets, on a reported basis net of refunds, in the third quarter of 2025 compared to 85.8 million tickets in the same period of the prior year, an increase of 3.3 million tickets, or 4%. Two-thirds of the ticket sales growth occurred in North America with the remaining one-third came from our international markets. Fee-bearing GTV increased by 12% globally in the quarter with North America up double digits while international GTV increased by 5%. It was our second highest ever quarter for reported GTV and our fourth highest ever with respect to ticket volume. Ticketing AOI for the quarter was $285.9 million compared to $235.7 million last year, an increase of $50.2 million or 21%.\nFor the first nine months of 2025, our Ticketing segment’s revenue increased by $87.4 million compared to the same period in 2024, from $2.1 billion to $2.2 billion. Ticketing AOI for the first nine months of 2024 increased by $16.7 million compared to the same period in 2024, from $812.4 million to $829.1 million. For the first nine months of 2025, our fee-bearing ticket sales, on a reported basis net of refunds, were 249.9 million tickets, which was 5.1 million ahead of 2024. We have signed clients with 26.5 million of net new tickets so far this year, of which two-thirds are in our international markets, which demonstrates that our ticketing platforms’ features and functionalities continue to fuel growth.\nOur Sponsorship & Advertising segment’s revenue for the quarter increased by $52.3 million, or 13%, from $390.3 million in the third quarter of 2024 to $442.7 million in the third quarter of 2025. The growth was largely due to an increase in festival and venue sponsorship income for North America as well as festival and access growth for continental Europe. For the first nine months of 2025, our sponsorship growth has been driven by new and expanded ticket access deals in our international markets as well as from onsite sponsorships globally. AOI for the quarter increased by $37.7 million, from $275.3 million in the third quarter of 2024 to $313.1 million in the third quarter of 2025.\nFor the nine months of 2025, our Sponsorship & Advertising segment’s revenue grew $85.5 million, or 9%, compared to the same period in 2024, from $913.9 million to $999.3 million. Sponsorship & Advertising AOI for the first nine months increased by $48.7 million, or 8%, compared to the same period in 2024, from $627.9 million to $676.6 million. On a full year basis, we expect AOI and operating margins to be in line with historical norms. Our committed sponsorship sales are up over double-digits year-over-year and virtually all of our projected revenue for the year is accounted for, giving us confidence we will deliver double-digit growth for the year once again in our Sponsorship & Advertising segment.\nWe are optimistic about the long-term potential of our Company and are focused on the key elements of our business model: expanding our global platforms to connect artists and fans.\n26\nTable of Contents\nConsolidated Results of Operations\nThree Months\nThree Months Ended September 30,\n% Change\n2025\n2024\nAs Reported\nCurrency Impacts\nAt Constant Currency**\nAs Reported\nAs Reported\nAt Constant Currency**\n(in thousands)\nRevenue\n$\n8,499,143\n$\n(140,295)\n$\n8,358,848\n$\n7,651,087\n11%\n9%\nOperating expenses:\nDirect operating expenses\n6,437,700\n5,780,188\n11%\nSelling, general and administrative expenses\n1,008,038\n1,005,418\n0.3%\nDepreciation and amortization\n165,600\n137,001\n21%\nGain on disposal of operating assets\n(14,851)\n(3,968)\n*\nCorporate expenses\n110,205\n92,923\n19%\nOperating income\n792,451\n(12,757)\n779,694\n639,525\n24%\n22%\nOperating margin\n9.3%\n9.3%\n8.4%\nInterest expense\n80,291\n87,961\nInterest income\n(36,659)\n(36,067)\nEquity in losses of nonconsolidated affiliates\n5,209\n13,987\nOther expense (income), net\n13,792\n(12,268)\nIncome before income taxes\n729,818\n585,912\nIncome tax expense\n251,840\n70,229\nNet income\n477,978\n515,683\nNet income attributable to noncontrolling interests\n46,520\n63,878\nNet income attributable to common stockholders of Live Nation\n$\n431,458\n$\n451,805\n___________\n*\nPercentages are not meaningful.\n**\nConstant currency is a non-GAAP financial measure. We calculate currency impacts as the difference between current period activity translated using the current period’s currency exchange rates and the comparable prior period’s currency exchange rates. We present constant currency information to provide a framework for assessing how our underlying businesses performed excluding the effect of foreign currency rate fluctuations.\nRevenue\nRevenue increased $848.1 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily due to increased revenue in our Concerts segment of $701.9 million, Ticketing segment of $103.9 million and Sponsorship & Advertising segment of $52.3 million, as further discussed within each segment’s operating results.\nOperating income\nOperating income increased $152.9 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily driven by increased operating income in our Concerts segment of $91.2 million, Ticketing segment of $45.1 million and Sponsorship & Advertising segment of $34.2 million, as further discussed within each segment’s operating results.\nOther expense (income), net\nFor the three months ended September 30, 2025, we had other expense, net of $13.8 million, which primarily consisted of net foreign exchange rate losses of $24.7 million partially offset by mark to market adjustments for certain investments in nonconsolidated affiliates of $10.4 million. For the three months ended September 30, 2024, we had other income, net of $12.3 million which included net foreign exchange rate gains of $12.1 million.\n27\nTable of Contents\nConsolidated Results of Operations\nNine Months\nNine Months Ended September 30,\n% Change\n2025\n2024\nAs Reported\nCurrency Impacts\nAt Constant Currency**\nAs Reported\nAs Reported\nAt Constant Currency**\n(in thousands)\nRevenue\n$\n18,887,901 \n$\n(81,173)\n$\n18,806,728\n$\n17,474,032 \n8%\n8%\nOperating expenses:\nDirect operating expenses\n13,903,393 \n12,839,737 \n8%\nSelling, general and administrative expenses\n2,790,304 \n2,913,199 \n(4)%\nDepreciation and amortization\n474,080 \n407,324 \n16%\nGain on disposal of operating assets\n(17,909)\n(5,398)\n*\nCorporate expenses\n344,160 \n255,216 \n35%\nOperating income\n1,393,873 \n(2,246)\n1,391,627\n1,063,954 \n31%\n31%\nOperating margin\n7.4%\n7.4%\n6.1%\nInterest expense\n232,682 \n248,622 \nInterest income\n(108,613)\n(123,749)\nEquity in losses of nonconsolidated affiliates\n462 \n8,527 \nOther expense (income), net\n53,125 \n(110,064)\nIncome before income taxes\n1,216,217 \n1,040,618 \nIncome tax expense\n389,196 \n191,412 \nNet income\n827,021 \n849,206 \nNet income attributable to noncontrolling interests\n128,949 \n153,906 \nNet income attributable to common stockholders of Live Nation\n$\n698,072 \n$\n695,300 \n____________\n*\nPercentages are not meaningful.\n**\nConstant currency is a non-GAAP financial measure. We calculate currency impacts as the difference between current period activity translated using the current period’s currency exchange rates and the comparable prior period’s currency exchange rates. We present constant currency information to provide a framework for assessing how our underlying businesses performed excluding the effect of foreign currency rate fluctuations.\nRevenue\nRevenue increased $1.4 billion during the nine months ended September 30, 2025 as compared to the same period of the prior year, driven by increased revenue in our Concerts segment of $1.3 billion, Ticketing segment of $87.4 million and Sponsorship & Advertising segment of $85.5 million, as further discussed within each segment’s operating results.\nOperating income\nOperating income increased $329.9 million during the nine months ended September 30, 2025 as compared to the same period of the prior year, primarily driven by increased operating income in our Concerts segment of $373.4 million and Sponsorship & Advertising segment of $48.3 million. These were partially offset by higher certain acquisition expenses of $78.0 million as well as decreased operating income in our Ticketing segment of $1.1 million, as further discussed within each segment’s operating results.\nOther expense (income), net\nFor the nine months ended September 30, 2025, we had other expense, net of $53.1 million, which primarily consisted of net foreign exchange rate losses of $59.2 million. For the nine months ended September 30, 2024, we had other income, net of $110.1 million, which primarily included mark to market adjustments for certain investments in nonconsolidated affiliates of $94.7 million and net foreign exchange rate gains of $14.7 million.\n28\nTable of Contents\nIncome tax expense\nFor the nine months ended September 30, 2025, we had a net tax expense of $389.2 million on income before income taxes of $1.2 billion compared to a net tax expense of $191.4 million on income before income taxes of $1.0 billion for the nine months ended September 30, 2024. For the nine months ended September 30, 2025, the income tax expense consisted of $251.4 million related to foreign entities, $111.8 million related to United States federal taxes and $26.0 million related to state and local income taxes. The net increase of $197.8 million is attributable to an increase in non-deductible expenses in the United States primarily related to legal matters as well as an increase in performance share awards vesting during 2025.\nNet income attributable to noncontrolling interests\nNet income attributable to noncontrolling interests decreased $25.0 million during the nine months ended September 30, 2025 as compared to the prior year primarily due to lower show activity from certain concert businesses during 2025 as compared to the prior year.\nNon-GAAP Measure\nConsolidated AOI\nConsolidated AOI is a non-GAAP financial measure that we define as consolidated operating income (loss) before certain acquisition expenses (including ongoing legal costs stemming from the Ticketmaster merger, changes in the fair value of accrued acquisition-related contingent consideration obligations, and acquisition-related severance and compensation), amortization of non-recoupable ticketing contract advances, depreciation and amortization (including goodwill impairment), loss (gain) on disposal of operating assets, and stock-based compensation expense. We also exclude from AOI the impact of estimated or realized liabilities for settlements or damages arising out of the Astroworld matter that exceed our estimated insurance recovery, due to the significant and non-recurring nature of the matter. Ongoing legal costs associated with defense of these claims, such as attorney fees, are not excluded from AOI.\nWe use AOI to evaluate the performance of our operating segments. We believe that information about AOI assists investors by allowing them to evaluate changes in the operating results of our portfolio of businesses separate from non-operational factors that affect net income (loss), thus providing insights into both operations and the other factors that affect reported results. AOI is not calculated or presented in accordance with GAAP. A limitation of the use of AOI as a performance measure is that it does not reflect the periodic costs of certain amortizing assets used in generating revenue in our business. Accordingly, AOI should be considered in addition to, and not as a substitute for, operating income (loss), net income (loss), and other measures of financial performance reported in accordance with GAAP. Furthermore, this measure may vary among other companies; thus, AOI as presented herein may not be comparable to similarly titled measures of other companies.\nThe following table sets forth the reconciliation of consolidated operating income to consolidated AOI for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(in thousands)\nOperating income\n$\n792,451 \n$\n639,525 \n$\n1,393,873 \n$\n1,063,954 \nAcquisition expenses\n32,983 \n94,565 \n141,873 \n95,087 \nAmortization of non-recoupable ticketing contract advances\n16,528 \n16,996 \n61,971 \n62,237 \nDepreciation and amortization\n165,600 \n137,001 \n474,080 \n407,324 \nGain on sale of operating assets\n(14,851)\n(3,968)\n(17,909)\n(5,398)\nAstroworld estimated loss contingencies\n(553)\n— \n(8,353)\n279,915 \nStock-based compensation expense\n40,815 \n25,712 \n126,912 \n85,450 \nConsolidated AOI\n$\n1,032,973 \n$\n909,831 \n$\n2,172,447 \n$\n1,988,569 \n29\nTable of Contents\nSegment Overview\nOur reportable segments are Concerts, Ticketing and Sponsorship & Advertising, as discussed in Note 8 – Segments and Revenue Recognition.\nConcerts\nRevenue and related costs for events are generally deferred and recognized when the event occurs. All advertising costs incurred during the year for shows in future years are expensed at the end of the year. If a current year event is rescheduled into a future year, all advertising costs incurred to date are expensed in the period when the event is rescheduled.\nConcerts direct operating expenses include artist fees, event production costs, show-related marketing and advertising expenses, along with other costs.\nTo judge the health of our Concerts segment, we primarily monitor the number of confirmed events and fan attendance in our network of operated and third-party venues, talent fees, average paid attendance, market ticket pricing, advance ticket sales and the number of major artist clients under management. In addition, at our operated venues and festivals, we monitor ancillary revenue per fan and premium ticket sales. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nTicketing\nRevenue related to ticketing service charges is recognized when the ticket is sold for our third-party clients. For our own events, where our concert promoters or venues control ticketing, revenue is deferred and recognized when the event occurs. GTV represents the total amount of the transaction related to a ticket sale and includes the face value of the ticket as well as the service charge. We use GTV and average ticket prices to understand trends in our service charge revenue and service charge revenue per ticket.\nTicketing direct operating expenses include call center costs and credit card fees, along with other costs.\nTo judge the health of our Ticketing segment, we primarily review the GTV and the number of tickets sold through our primary and secondary ticketing operations, the number of clients renewed or added and the average royalty rate paid to clients who use our ticketing services. In addition, we review the number of visits to our websites, cost of customer acquisition, the purchase conversion rate, and the overall number of customers in our database. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\nSponsorship & Advertising\nRevenue related to sponsorship and advertising programs is recognized over the term of the agreement or operating season as the benefits are provided to the sponsor unless the revenue is associated with a specific event, in which case it is recognized when the event occurs.\nSponsorship & Advertising direct operating expenses include fulfillment costs related to our sponsorship programs, along with other costs.\nTo judge the health of our Sponsorship & Advertising segment, we primarily review the revenue generated through sponsorship arrangements and online advertising, and the percentage of expected revenue under contract. For business that is conducted in foreign markets, we also compare the operating results from our foreign operations to prior periods without the impact of changes in foreign exchange rates.\n30\nTable of Contents\nKey Operating Metrics\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in thousands except estimated events)\nConcerts \n(1)\nEstimated events:\nNorth America \n(2)\n8,874 \n9,664 \n24,963 \n26,831 \nInternational\n3,415 \n3,170 \n12,913 \n11,884 \nTotal estimated events\n12,289 \n12,834 \n37,876 \n38,715 \nEstimated fans:\nNorth America \n(2)\n31,790 \n32,900 \n64,123 \n66,978 \nInternational\n19,479 \n17,204 \n53,668 \n44,948 \nTotal estimated fans\n51,269 \n50,104 \n117,791 \n111,926 \nTicketing \n(3)\nEstimated number of fee-bearing tickets sold\n89,065 \n85,797 \n249,909 \n244,839 \nEstimated number of non-fee-bearing tickets sold\n66,092 \n66,598 \n216,129 \n216,162 \nTotal estimated tickets sold\n155,157 \n152,395 \n466,038 \n461,001 \n _________\n(1)\nEvents generally represent a single performance by an artist. Fans generally represent the number of people who attend an event. Festivals are counted as one event in the quarter in which the festival begins, but the number of fans is based on the days the fans were present at the festival and thus can be reported across multiple quarters. Events and fan attendance metrics are estimated each quarter.\n(2)\nNorth America refers to our events and fans within the United States and Canada.\n(3)\nThe fee-bearing tickets estimated above include primary and secondary tickets that are sold using our Ticketmaster systems or that we issue through affiliates along with tickets sold on our “do it yourself” platform. This metric includes primary tickets sold during the year regardless of event timing, except for our own events where our concert promoters or venues control ticketing which are reported when the events occur. The non-fee-bearing tickets estimated above include primary tickets sold using our Ticketmaster systems, through season seat packages and our venue clients’ box offices. These ticketing metrics are net of any refunds requested and any cancellations that occurred during the period and up to the time of reporting of these consolidated financial statements.\n31\nTable of Contents\nSegment Operating Results\nConcerts\nOur Concerts segment operating results were, and discussions of significant variances are, as follows:\n \nThree Months Ended\nSeptember 30,\n%\nChange\nNine Months Ended\nSeptember 30,\n%\nChange\n \n2025\n2024\n2025\n2024\n \n(in thousands)\n(in thousands)\nRevenue\n$\n7,282,473\n$\n6,580,595\n11%\n$\n15,712,926\n$\n14,447,009\n9%\nDirect operating expenses\n6,090,222\n5,464,732\n11%\n13,007,206\n11,943,821\n9%\nSelling, general and administrative expenses\n705,710\n733,459\n(4)%\n1,911,452\n2,125,152\n(10)%\nDepreciation and amortization\n114,983\n91,207\n26%\n329,452\n274,216\n20%\nGain on disposal of operating assets\n(14,850)\n(3,974)\n*\n(17,903)\n(5,466)\n*\nOperating income\n$\n386,408\n$\n295,171\n31%\n$\n482,719\n$\n109,286\n*\nOperating margin\n5.3%\n4.5%\n3.1%\n0.8%\nAOI\n$\n514,167\n$\n474,053\n8%\n$\n879,420\n$\n742,936\n18%\nAOI margin\n7.1%\n7.2%\n5.6%\n5.1%\n_______\n*\nPercentages are not meaningful.\nThree Months\nRevenue\nConcerts revenue increased $701.9 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily due to more stadium shows and fans. Concerts had incremental revenue of $275.0 million during the three months ended September 30, 2025 from acquisitions and new venues.\nOperating results\nConcerts AOI increased $40.1 million and operating income increased $91.2 million during the three months ended September 30, 2025 as compared to the same period of the prior year. The increase in AOI was primarily driven by higher revenue as discussed above, partially offset by an increase in direct operating expenses to support more stadium shows and fan growth at events and higher selling, general and administrative expenses related to additional headcount and compensation expenses. The remaining change in operating income outside of AOI of $51.1 million is primarily associated with lower acquisition expenses of $73.6 million, mostly due to contingent consideration changes in the prior year, partially offset by higher depreciation and amortization expense of $23.8 million related to capital expenditures incurred to support the increased operations.\nNine Months\nRevenue\nConcerts revenue increased $1.3 billion during the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to more stadium shows and fans. Concerts had incremental revenue of $412.8 million during the nine months ended September 30, 2025 from acquisitions and new venues.\nOperating results\nConcerts AOI increased $136.5 million and operating income increased $373.4 million during the nine months ended September 30, 2025 as compared to the same period of the prior year. The increase in AOI was primarily driven by higher revenue as discussed above, partially offset by increased direct operating expenses to support more stadium shows and fan growth at events. The remaining change in operating income outside of AOI of $236.9 million is primarily associated with the nonrecurring Astroworld estimated loss contingencies in the prior year as well as lower acquisition expenses of $31.2 million, mostly due to contingent consideration changes in the prior year. These were partially offset by higher depreciation and amortization expense of $55.2 million related to capital expenditures incurred to support the increased operations and higher stock-based compensation of $39.7 million.\n32\nTable of Contents\nTicketing\nOur Ticketing segment operating results were, and discussions of significant variances are, as follows:\nThree Months Ended\nSeptember 30,\n%\nChange\nNine Months Ended\nSeptember 30,\n%\nChange\n2025\n2024\n2025\n2024\n(in thousands)\n(in thousands)\nRevenue\n$\n797,572\n$\n693,704\n15%\n$\n2,234,940\n$\n2,147,559\n4%\nDirect operating expenses\n290,196\n262,773\n10%\n761,145\n767,696\n(1)%\nSelling, general and administrative expenses\n247,859\n218,826\n13%\n735,572\n648,456\n13%\nDepreciation and amortization\n28,319\n26,033\n9%\n81,857\n73,956\n11%\nLoss (Gain) on disposal of operating assets\n(1)\n(17)\n(94)%\n(6)\n29\n*\nOperating income\n$\n231,199\n$\n186,089\n24%\n$\n656,372\n$\n657,422\n(0.2)%\nOperating margin\n29.0%\n26.8%\n29.4%\n30.6%\nAOI\n$\n285,949\n$\n235,704\n21%\n$\n829,101\n$\n812,352\n2%\nAOI margin\n35.9%\n34.0%\n37.1%\n37.8%\n_______\n*\nPercentages are not meaningful.\nThree Months\nRevenue\nTicketing revenue increased $103.9 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily due to higher primary ticket sales in North America and Latin America markets.\nOperating results\nTicketing AOI increased $50.2 million and operating income increased $45.1 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily driven by an increase in revenue discussed above partially offset by higher selling, general and administrative expenses due to increased investments in research & development, cybersecurity and cloud computing.\nNine Months\nRevenue\nTicketing revenue increased $87.4 million during the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to higher primary ticket sales in North America and international markets.\nOperating results\nTicketing AOI increased $16.7 million and operating income decreased $1.1 million during the nine months ended September 30, 2025 as compared to the same period of the prior year primarily driven by higher revenue discussed above partially offset by higher selling, general and administrative expenses due to increased investments in research & development, cybersecurity and cloud computing.\n33\nTable of Contents\nSponsorship & Advertising\nOur Sponsorship & Advertising segment operating results were, and discussions of significant variances are, as follows:\nThree Months Ended\nSeptember 30,\n%\nChange\nNine Months Ended\nSeptember 30,\n%\nChange\n2025\n2024\n2025\n2024\n(in thousands)\n(in thousands)\nRevenue\n$\n442,689\n$\n390,345\n13%\n$\n999,316\n$\n913,856\n9%\nDirect operating expenses\n77,140\n64,842\n19%\n183,424\n157,853\n16%\nSelling, general and administrative expenses\n56,072\n52,288\n7%\n147,791\n134,977\n9%\nDepreciation and amortization\n16,190\n14,134\n15%\n46,055\n47,216\n(2)%\nLoss on disposal of operating assets\n—\n23\n(100)%\n—\n39\n(100)%\nOperating income\n$\n293,287\n$\n259,058\n13%\n$\n622,046\n$\n573,771\n8%\nOperating margin\n66.3%\n66.4%\n62.2%\n62.8%\nAOI \n$\n313,072\n$\n275,329\n14%\n$\n676,624\n$\n627,926\n8%\nAOI margin\n70.7%\n70.5%\n67.7%\n68.7%\nThree Months\nRevenue\nSponsorship & Advertising revenue increased $52.3 million during the three months ended September 30, 2025 as compared to the same period of the prior year primarily due to increased sponsorship activity in North America and mainland Europe, notably for our operated venues and festivals as well as ticket onsale deals.\nOperating results\nSponsorship & Advertising AOI increased $37.7 million and operating income increased $34.2 million during the three months ended September 30, 2025 as compared to the same period of the prior year. These increases were primarily due to increased revenues from sponsorship activity discussed above.\nNine Months\nRevenue\nSponsorship & Advertising revenue increased $85.5 million during the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to increased sponsorship activity in North America and international markets, notably for our operated venues and festivals as well as ticket onsale deals.\nOperating results\nSponsorship & Advertising AOI increased $48.7 million and operating income increased $48.3 million during the nine months ended September 30, 2025 as compared to the same period of the prior year. These increases were primarily due to increased revenues from sponsorship activity discussed above.\n34\nTable of Contents\nLiquidity and Capital Resources\nOur cash is centrally managed on a worldwide basis. Our primary short-term liquidity needs are to fund general working capital requirements, capital expenditures and debt service requirements while our long-term liquidity needs are primarily related to acquisitions and debt repayment. Our primary sources of funds for our short-term liquidity needs will be cash flows from operations and borrowings under our amended senior secured credit facility, while our long-term sources of funds will be from cash flows from operations, long-term bank borrowings and other debt or equity financings. We may from time to time engage in open market purchases of our outstanding debt securities or redeem or otherwise repay such debt.\nOur balance sheet reflects cash and cash equivalents of $6.8 billion and short-term investments of $67.6 million at September 30, 2025, and cash and cash equivalents of $6.1 billion at December 31, 2024. Included in the September 30, 2025 and December 31, 2024 cash and cash equivalents balances are $2.1 billion and $1.6 billion, respectively, of cash received that includes the face value of tickets sold on behalf of our ticketing clients and their share of service charges, which we refer to as client cash. We generally do not utilize client cash for our own financing or investing activities as the amounts are payable to clients on a regular basis, though we may do so from time to time. Our foreign subsidiaries held approximately $4.1 billion in cash and cash equivalents, excluding client cash, at September 30, 2025. We generally do not repatriate these funds, but if we did, we would need to accrue and pay United States state income taxes as well as any applicable foreign withholding or transaction taxes on future repatriations.\nWe may from time to time enter into borrowings under our revolving credit facility. If the original maturity of these borrowings is 90 days or less, we present the borrowings and subsequent repayments on a net basis in the statement of cash flows to better represent our financing activities. Our balance sheet reflects total net debt of $7.4 billion and $6.4 billion at September 30, 2025 and December 31, 2024, respectively. Our weighted-average cost of debt, excluding unamortized debt discounts and debt issuance costs on our term loans and notes, was 4.5% at September 30, 2025, with approximately 80.6% of our debt at fixed rates. Our weighted-average cost of debt for short-term borrowings outstanding at September 30, 2025, excluding unamortized debt discounts and debt issuance costs on our term loans and notes, was 3.4%.\nOur cash and cash equivalents are held in accounts managed by third-party financial institutions and consist of cash in our operating accounts and invested cash. Cash held in non-interest-bearing and interest-bearing operating accounts in many cases exceeds the Federal Deposit Insurance Corporation insurance limits. The invested cash is in interest-bearing funds consisting primarily of bank deposits and money market funds. While we monitor cash and cash equivalents balances in our operating accounts on a regular basis and adjust the balances as appropriate, these balances could be impacted if the underlying financial institutions fail. To date, we have experienced no loss or lack of access to our cash and cash equivalents; however, we can provide no assurances that access to our cash and cash equivalents will not be impacted by adverse conditions in the financial markets.\nFor our Concerts segment, we often receive cash related to ticket revenue in advance of the event, which is recorded in deferred revenue until the event occurs. In the United States, this cash is largely associated with events in our operated venues, notably amphitheaters, festivals, theaters and clubs. Internationally, this cash is from a combination of both events in our operated venues, as well as events in third-party venues associated with our promoter’s share of tickets in allocation markets. With the exception of some upfront costs and artist advances, which are recorded in prepaid expenses until the event occurs, we pay the majority of event-related expenses at or after the event. Artists are paid when the event occurs under one of several different formulas, which may include fixed guarantees and/or a percentage of ticket sales or event profits, net of any advance they have received. When an event is cancelled, any cash held in deferred revenue is reclassified to accrued expenses as those funds are typically refunded to the fan within 30 days of event cancellation. When a show is rescheduled, fans have the ability to request a refund if they do not want to attend the event on the new date, although historically we have had low levels of refund requests for rescheduled events.\nWe view our available cash as cash and cash equivalents, less ticketing-related client cash, less event-related deferred revenue, less accrued expenses due to artists and cash collected on behalf of others, plus event-related prepaid expenses. This is essentially our cash available to, among other things, repay debt balances, make acquisitions, and finance capital expenditures.\nOur intra-year cash fluctuations are impacted by the seasonality of our various businesses. Examples of seasonal effects include our Concerts segment, which reports the majority of its revenue in the second and third quarters. Cash inflows and outflows depend on the timing of event-related payments but the majority of the inflows generally occur prior to the event. See “—Seasonality” below. We believe that we have sufficient financial flexibility to fund these fluctuations and to access the global capital markets on satisfactory terms and in adequate amounts, although there can be no assurance that this will be the case, and capital could be less accessible and/or more costly given current economic conditions. We expect cash flows from operations and borrowings under our amended senior secured credit facility, along with other financing alternatives, to satisfy working capital requirements, capital expenditures and debt service requirements for at least the succeeding year. We may need to incur additional debt or issue equity to make other strategic acquisitions or investments. There can be no assurance that such \n35\nTable of Contents\nfinancing will be available to us on acceptable terms or at all. We may make significant acquisitions in the near term, subject to limitations imposed by our financing agreements and market conditions.\nThe lenders under our revolving loans and counterparty to our interest rate hedge agreement consists of banks and other third-party financial institutions. While we currently have no indications or expectations that such lenders will be unable to fund their commitments as required, we can provide no assurances that future funding availability will not be impacted by adverse conditions in the financial markets. Should an individual lender default on its obligations, the remaining lenders would not be required to fund the shortfall, resulting in a reduction in the total amount available to us for future borrowings, but would remain obligated to fund their own commitments. Should the counterparty to our interest rate hedge agreement default on its obligation, we could experience higher interest rate volatility during the period of any such default.\nSources of Cash\nAmended Senior Secured Credit Facility\nIn November 2024, we amended our senior secured credit facility and entered into Amendment No. 12 (the “Amendment”) to our Credit Agreement (as amended by Amendment No. 12, the “Amended Credit Agreement”). The Amendment provides for, among other things, a $400.0 million revolving credit facility to be used for venue financing or other general corporate purposes, which resulted in a revolving credit facility with a total available borrowing capacity of up to $1.7 billion including a $250.0 million sublimit for the issuance of letters of credit and a $100.0 million sublimit for swingline borrowings. The revolving credit facility allows for a $780.0 million sublimit for borrowings in U.S. Dollars, Euros, or Sterling, and a $260.0 million sublimit for borrowings in those or one or more other approved non-U.S. currencies. The revolving credit facility will be available to us and, if designated in the future, certain of our foreign subsidiaries. The Amended Credit Agreement provides for the right, subject to certain conditions, to increase the term B loan and revolving facilities by an amount not to exceed an amount equal to the sum of (x) $1.625 billion, (y) the aggregate principal amount of voluntary prepayments of the term B loans and permanent reductions of the revolving credit facility commitments, in each case, other than from proceeds of long-term indebtedness, and (z) additional amounts so long as the senior secured leverage ratio, on a pro-forma basis after giving effect to such increase, is no greater than 4.50x.\nOur obligations under the Amended Credit Agreement will continue to be guaranteed by the majority of our direct and indirect domestic subsidiaries, subject to certain exceptions, and the obligations of the foreign subsidiary borrowers, if any, will be guaranteed by us, the majority of our direct and indirect domestic subsidiaries, and by certain of our wholly-owned foreign subsidiaries. The obligations under the Amended Credit Agreement and the guarantees will continue to be secured by a lien on substantially all of our tangible and intangible personal property and the domestic subsidiaries that are guarantors, and by a pledge of substantially all of the shares of stock, partnership interests and limited liability company interests of our direct and indirect domestic subsidiaries and 65% of each class of capital stock of any first-tier foreign subsidiaries and, if there are any foreign borrowers, by certain of the assets of such foreign borrowers and certain foreign subsidiaries, subject to limited exceptions.\nThe interest rates per annum applicable to the revolving credit facility under the amended senior secured credit facility are, at our option, equal to either Term SOFR plus 1.75% or a base rate (as defined in the Credit Agreement) plus 0.75%. The interest rates per annum applicable to the term loan B are, at our option, equal to either Term Benchmark Loans or RFR Loans (as defined in the Credit Agreement) plus 1.75% or a base rate plus 0.75%. We have an interest rate swap agreement that ensures the interest rate on $500.0 million principal amount of our outstanding term loan B does not exceed 3.445% through October 2026. For the term loan B, we are required to make quarterly payments of $2.4 million with the balance due at maturity in October 2026. We are also required to make mandatory prepayments of the loan, subject to specified exceptions, from excess cash flow and with the proceeds of asset sales, debt issuances and specified other events.\nWe are required to pay a commitment fee of 0.35% per year on the undrawn portion available under the revolving credit facility and variable fees on outstanding letters of credit. Based on our outstanding letters of credit of $20.5 million, $904.5 million was available for future borrowings from our revolving credit facility as of September 30, 2025.\nThe revolving credit facility matures on November 5, 2029, provided, that if (x) any of the term loan B, our 6.5% Senior Secured Notes due 2027, or our 4.75% Senior Notes due 2027 remain outstanding on the date that is ninety-one days prior to the stated maturity thereof in an aggregate principal amount in excess of $500.0 million and (y) our consolidated free cash on such date is less than the sum of such outstanding principal amount plus $500.0 million, then the maturity date of the amended senior secured credit facility will instead be such date.\nDebt Covenants \nAs of September 30, 2025, we believe we were in compliance with all of our debt covenants related to our senior secured credit facility and our corporate senior secured notes, senior notes and convertible senior notes. We expect to remain in compliance with all of these covenants throughout 2025.\n36\nTable of Contents\nSubsequent Events\n2.875% Convertible Senior Notes due 2031\nOn October 10, 2025, we issued $1.4 billion aggregate principal amount of 2.875% Convertible Senior Notes due 2031 (the “Notes”). In conjunction with this issuance, we intend to use the net proceeds from the Notes, together with borrowings under the new senior secured credit facility detailed below, (i) to fund the redemption (the “Redemption”) in full of all of the Company’s 2026 Notes, (ii) to repay in full amounts outstanding under the Company’s term loan B facility and the revolving credit facilities under the Company’s existing senior secured credit facility, (iii) to pay related fees and expenses in connection with the uses described in clauses (i) and (ii), and (iv) for general corporate purposes.\nInterest on the Notes is payable semi-annually in arrears on April 15 and October 15, beginning on April 15, 2026, at a rate of 2.875% per annum. The Notes will mature on October 15, 2031, unless earlier repurchased, redeemed or converted. The Notes will be convertible, under certain circumstances, until July 15, 2031, and on or after such date without condition, at an initial conversion rate of 4.4459 shares of our common stock per $1,000 principal amount of notes, subject to adjustment. Upon conversion, the notes may be settled in, at our election, shares of common stock or cash or a combination of cash and shares of common stock.\nWe may redeem for cash all or any portion of the Notes, at our option, on or after October 20, 2028 and before the 41st scheduled trading day before the maturity date, if the sales price of our common stock reaches specified targets as defined in the indenture. The redemption price will equal 100% of the principal amount of the notes plus accrued interest, if any.\nIf we experience a fundamental change, as defined in the indenture governing the Notes, the holders of the Notes may require us to purchase for cash all or a portion of the Notes, subject to specified exceptions, at a repurchase price equal to the principal amount of the Notes plus accrued and unpaid interest, if any.\n5.625% Senior Notes due 2026 Note Redemption\nIn connection with the Redemption, on October 9, 2025, the Company issued a notice of conditional full redemption to redeem the 2026 Notes on November 8, 2025 (the “Redemption Date”) at a redemption price determined in accordance with the indenture governing the 2026 Notes plus accrued and unpaid interest, if any, to, but excluding, the Redemption Date.\nSenior Secured Credit Facility\nOn August 14, 2025, we drew down $775.0 million from our existing senior secured credit facility primarily to finance the acquisition of an additional 24% interest in OCESA from CIE and for other general corporate purposes. This borrowing was fully repaid in October 2025.\nOn October 21, 2025, we amended, amended and restated and refinanced, our existing senior secured credit facility and entered into an amended and restated credit agreement (the “2025 Credit Agreement”). The 2025 Credit Agreement provides for, among other things, (i) a $1.3 billion term loan B facility (the “new term loan B facility”), (ii) a $700.0 million delayed draw term loan A facility (the “new delayed draw term loan A facility”), (iii) a $1.3 billion multicurrency revolving credit facility (the “new multicurrency revolving credit facility”), and (iv) a $400.0 million venue expansion revolving credit facility (the “new venue expansion revolving credit facility” and together with the new multicurrency revolving credit facility, the “new revolving credit facilities”).\nWe are required to pay a commitment fee of 0.35% per year on the undrawn portion available under the new revolving facilities and the new delayed draw term loan A facility, and customary letter of credit fees, as necessary.\nThe 2025 Credit Agreement contains a financial covenant that requires us to maintain a maximum ratio of consolidated net debt to consolidated EBITDA (both as defined in the 2025 Credit Agreement) that ranges from 6.75x to 5.25x, with the first measurement occurring after the quarter ended March 31, 2026, the first step down of 0.50x occurring on March 31, 2027 and additional step downs of 0.50x occurring annually thereafter.\nThe new revolving facilities and new delayed draw term loan A facility mature on October 21, 2030 if certain conditions are met in accordance with the 2025 Credit Agreement. The new term loan B facility matures on October 21, 2032. Upon closing of the 2025 Credit Agreement, the new term B loan facility of $1.3 billion was fully drawn while the new delayed draw term loan A facility and the new revolving credit facilities were undrawn.\n37\nTable of Contents\nUses of Cash\nAcquisitions\nDuring the nine months ended September 30, 2025, we completed various acquisitions that resulted in cash paid, net of cash acquired of $68.3 million.\nCapital Expenditures\nVenue and ticketing operations require ongoing investment in our existing venues and ticketing systems to address fan and artist expectations, technological industry advances and various federal, state and/or local regulations.\nWe categorize capital outlays between revenue generating capital expenditures and maintenance capital expenditures. Revenue generating capital expenditures are primarily focused on our global venue expansion strategy as we connect more artists to their global fan base and major renovations to buildings to enhance the fan experience and drive improvements in our hospitality efforts including onsite spending and premium experiences. In addition, in Ticketing, we continue to develop new ticketing tools and technology enhancements. Revenue generating capital expenditures can also include smaller projects whose purpose is to increase revenue and/or improve operating income. Maintenance capital expenditures are associated with the renewal and improvement of existing venues and technology systems, web development and administrative offices. Capital expenditures typically increase during periods when our venues are not in operation since that is the time that such improvements can be completed.\nOur capital expenditures, including accruals for amounts incurred but not yet paid for, but net of expenditures funded by outside parties such as landlords and noncontrolling interest partners or expenditures funded by insurance proceeds, consisted of the following:\n \nNine Months Ended\nSeptember 30,\n2025\n2024\n(in thousands)\nRevenue generating\n$\n600,992 \n$\n363,576 \nMaintenance\n79,827 \n81,529 \nTotal capital expenditures\n$\n680,819 \n$\n445,105 \nRevenue generating capital expenditures during the first nine months of 2025 increased from the same period of the prior year primarily due to venue expansion and enhancements across North America and Latin America.\nWe expect capital expenditures to be approximately $1.0 billion for the year ending December 31, 2025 with approximately 85% dedicated to revenue generating projects, including $700 million to $800 million of spend relating to our venue expansion and enhancement plans. Some of the more significant projects in 2025 include an extensive renovation of an arena in Hamilton, Ontario in Canada and the new Riverside Amphitheater outside of Kansas City, Missouri which will open in 2026. Approximately $200 million of our capital expenditure estimate is being funded outside our cash flow by third party equity partners, pre-selling certain premium rights and project-based debts.\nCash Flows\nNine Months Ended\nSeptember 30,\n2025\n2024\n(in thousands)\nCash provided by (used in):\nOperating activities\n$\n1,449,046 \n$\n680,052 \nInvesting activities\n$\n(832,767)\n$\n(642,798)\nFinancing activities\n$\n(322,780)\n$\n(692,460)\nOperating Activities\nCash provided by operating activities increased $769.0 million for the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to changes in operating assets and liabilities from timing of events on sale, payments and receipts as well as lower gain on mark-to-market of investments in nonconsolidated affiliates and higher deferred income taxes.\n38\nTable of Contents\nInvesting Activities\nCash used in investing activities increased $190.0 million for the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to higher purchases of property, plant and equipment for revenue generating capital expenditures partially offset by lower advances of notes receivable due to timing. See “—Uses of Cash - Acquisitions and Capital Expenditures” above for further discussion.\nFinancing Activities\nCash used in financing activities decreased $369.7 million for the nine months ended September 30, 2025 as compared to the same period of the prior year primarily due to the draw down of $775.0 million from our revolving credit facility as well as lower payments on debt. These were partially offset by higher purchases of noncontrolling interests including the acquisition of an additional 24% interest in OCESA from CIE. See “—Sources of Cash” above for further discussion.\nSeasonality\nInformation regarding the seasonality of our business can be found in Part I—Financial Information—Item 1.—Financial Statements—Note 1 – Basis of Presentation and Other Information.\n39\nTable of Contents\nMarket Risk\nWe are exposed to market risks arising from changes in market rates and prices, including movements in foreign currency exchange rates and interest rates.\nForeign Currency Risk\nWe have operations in countries throughout the world. The financial results of our foreign operations are measured in their local currencies. Our foreign subsidiaries also carry certain net assets or liabilities that are denominated in a currency other than that subsidiary’s functional currency. As a result, our financial results could be affected by factors such as changes in foreign currency exchange rates or weak economic conditions in the foreign markets in which we have operations. We operate in certain countries that are hyper-inflationary, however the impact of these currencies did not have a material impact on our statement of operations for the three and nine months ended September 30, 2025 and 2024. Our foreign operations reported an operating income of $575.2 million for the nine months ended September 30, 2025. We estimate that a 10% change in the value of the United States dollar relative to foreign currencies would change our operating income for the nine months ended September 30, 2025 by $57.5 million. As of September 30, 2025, our most significant foreign exchange exposure included the Euro, British Pound, Australian Dollar, Canadian Dollar and Mexican Peso. This analysis does not consider the implication such currency fluctuations could have on the overall economic conditions of the United States or other foreign countries in which we operate or on the results of operations of our foreign entities. In addition, the reported carrying value of our assets and liabilities, including the total cash and cash equivalents held by our foreign operations, will also be affected by changes in foreign currency exchange rates.\nWe primarily use forward currency contracts, in addition to options, to reduce our exposure to foreign currency risk associated with short-term artist fee commitments. At September 30, 2025, we had forward currency contracts outstanding with an aggregate notional amount of $471.7 million.\nInterest Rate Risk\nOur market risk is also affected by changes in interest rates. We had $7.4 billion of total debt, excluding unamortized debt discounts and issuance costs, outstanding as of September 30, 2025. Of the total amount, we had $6.0 billion of fixed-rate debt and $1.4 billion of floating-rate debt.\nBased on the amount of our floating-rate debt as of September 30, 2025, each 25-basis point increase or decrease in interest rates would increase or decrease our annual interest expense and cash outlay by approximately $3.6 million. This potential increase or decrease is based on the simplified assumption that the level of floating-rate debt remains constant with an immediate across-the-board increase or decrease as of September 30, 2025 with no subsequent change in rates for the remainder of the period.\nIn January 2020, we entered into an interest rate swap agreement that is designated as a cash flow hedge for accounting purposes to effectively convert a portion of our floating-rate debt to a fixed-rate basis. The swap agreement expires in October 2026, has a notional amount of $500.0 million and ensures that a portion of our floating-rate debt does not exceed 3.445%.\nAccounting and Other Pronouncements\nInformation regarding recently issued and adopted accounting pronouncements can be found in Part I — Financial Information—Item 1.—Financial Statements—Note 1 – Basis of Presentation and Other Information.\nIn 2021, the Organization for Economic Co-operation and Development (“OECD”) released Pillar Two model rules designed to ensure large multinational enterprises (“MNE”) pay a minimum level of tax arising in each jurisdiction they operate. Over 135 jurisdictions joined a plan to update key elements of the international tax system and provide for a coordinated system of taxation that imposes top-up tax on profits arising in a jurisdiction whenever the effective rate is below the minimum rate. Effective January 1, 2024, many of these jurisdictions have enacted a global 15% minimum effective tax rate. This minimum rate applies to MNE’s with consolidated revenue above €750 million. Based on the Company’s current analysis, the current Pillar Two rules do not have a material impact on the Company’s financial statements for the current period.\n40\nTable of Contents\nCritical Accounting Policies and Estimates\nThe preparation of our financial statements in conformity with GAAP requires management to make estimates, judgments and assumptions that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. On an ongoing basis, we evaluate our estimates that are based on historical experience and on various other assumptions that are believed to be reasonable under the circumstances. The result of these evaluations forms the basis for making judgments about the carrying values of assets and liabilities and the reported amount of revenue and expenses that are not readily apparent from other sources. Because future events and their effects cannot be determined with certainty, actual results could differ from our assumptions and estimates, and such difference could be material.\nManagement believes that the accounting estimates involved in business combinations, impairment of long-lived assets and goodwill, revenue recognition, and income taxes are the most critical to aid in fully understanding and evaluating our reported financial results, and they require management’s most difficult, subjective or complex judgments, resulting from the need to make estimates about the effect of matters that are inherently uncertain. These critical accounting estimates, the judgments and assumptions and the effect if actual results differ from these assumptions are described in Part II—Financial Information\n—\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our 2024 Annual Report on Form 10-K filed with the SEC on February 21, 2025.\nThere have been no changes to our critical accounting policies during the nine months ended September 30, 2025.\n41\nTable of Contents"
}