{
  "item1": "ITEM 1. BUSINESS Mastercard technology company global payments industry. connect consumers, financial institutions, merchants, governments, digital partners, businesses other organizations worldwide enabling electronic payments making those payment transactions secure, simple, smart accessible. make payments easier more efficient providing wide range payment solutions services using family well-known trusted brands, including Mastercard®, Maestro® Cirrus®.",
  "item7": "PART II ITEM 7. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Operating expenses increased 13% 2024 versus prior year. Adjusted operating expenses increased 11%, both as-adjusted currency-neutral basis, versus prior year. components operating expenses follows: Years Ended December 31, General administrative Advertising marketing Depreciation amortization Provision litigation Total operating expenses Adjusted total operating expenses Note: Table may not sum due rounding.",
  "item2": "PART I ITEM 2. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS following tables represents reconciliation growth rates reported under GAAP non-GAAP growth rates: Three Months Ended September 30, 2025 compared Three Months Ended September 30, 2024 Effective income tax rate Diluted earnings per share (Gains) losses equity investments Litigation provisions Restructuring charge Adjusted - Non-GAAP - currency-neutral Nine Months Ended September 30, 2025 compared Nine Months Ended September 30, 2024 Effective income tax rate Diluted earnings per share (Gains) losses equity investments Litigation provisions Restructuring charge Adjusted - Non-GAAP - currency-neutral Note: Tables may not sum due rounding. Key Metrics Drivers addition financial measures described above “Financial Results Overview”, review following metrics evaluate identify trends business, measure performance, prepare financial projections make strategic decisions. believe key metrics presented facilitate understanding operating financial performance provide meaningful comparison results between periods."
}