{
  "source_file": "ma-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nItem 2. Management’s discussion and analysis of financial condition and results of operations\nThe following supplements management's discussion and analysis of Mastercard Incorporated for the year ended December 31, 2024 as contained in the Company's Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission on February 12, 2025 (“2024 Form 10-K”).  It also should be read in conjunction with the consolidated financial statements and notes of Mastercard Incorporated and its consolidated subsidiaries, including Mastercard International Incorporated (together, “Mastercard” or the “Company”), included elsewhere in this Report.  Percentage changes provided throughout “Management’s Discussion and Analysis of Financial Condition and Results of Operations” were calculated on amounts rounded to the nearest thousand.\nGlobal Economic, Political, Financial and Societal Events and Conditions\nWe continue to monitor government actions and changes in policies across the globe, including those related to tariffs.  The extent to which these developments affect our business and results of operations, if at all, are uncertain and cannot be predicted at this time.\nFinancial Results Overview\nThe following table provides a summary of our key GAAP operating results, as reported:\nThree Months Ended September 30,\nIncrease/(Decrease)\nNine Months Ended September 30,\nIncrease/(Decrease)\n2025\n2024\n2025\n2024\n(in millions, except percentages and per share data)\nNet revenue\n$\n8,602 \n$\n7,369 \n17%\n$\n23,985 \n$\n20,678 \n16%\nOperating expenses\n$\n3,541 \n$\n3,365 \n5%\n$\n9,998 \n$\n9,034 \n11%\nOperating income\n$\n5,061 \n$\n4,004 \n26%\n$\n13,987 \n$\n11,644 \n20%\nOperating margin\n58.8 \n%\n54.3 \n%\n4.5 ppt\n58.3 \n%\n56.3 \n%\n2.0 ppt\nIncome tax expense\n$\n1,072 \n$\n603 \n78%\n$\n2,794 \n$\n1,831 \n53%\nEffective income tax rate\n21.5 \n%\n15.6 \n%\n5.9 ppt\n20.4 \n%\n16.1 \n%\n4.3 ppt\nNet income\n$\n3,927 \n$\n3,263 \n20%\n$\n10,908 \n$\n9,532 \n14%\nDiluted earnings per share\n$\n4.34 \n$\n3.53 \n23%\n$\n12.00 \n$\n10.25 \n17%\nDiluted weighted-average shares outstanding\n905 \n925 \n(2)%\n909 \n930 \n(2)%\nNote: Table may not sum due to rounding.\nThe following table provides a summary of our key non-GAAP operating results\n1\n, adjusted to exclude the impact of gains and losses on our equity investments, Special Items (which represent litigation judgments and settlements and certain one-time items) and the related tax impacts on our non-GAAP adjustments.  In addition, we have presented growth rates, adjusted for the impact of currency:\nThree Months Ended September 30,\nIncrease/(Decrease)\nNine Months Ended September 30,\nIncrease/(Decrease)\n2025\n2024\nAs adjusted\nCurrency-neutral\n2025\n2024\nAs adjusted\nCurrency-neutral\n(in millions, except percentages and per share data)\nNet revenue\n$\n8,602 \n$\n7,369 \n17%\n15%\n$\n23,985 \n$\n20,678 \n16%\n16%\nAdjusted operating expenses\n$\n3,459 \n$\n2,999 \n15%\n14%\n$\n9,668 \n$\n8,444 \n14%\n14%\nAdjusted operating margin\n59.8 \n%\n59.3 \n%\n0.5 ppt\n0.2 ppt\n59.7 \n%\n59.2 \n%\n0.5 ppt\n0.5 ppt\nAdjusted effective income tax rate\n21.4 \n%\n16.3 \n%\n5.1 ppt\n4.6 ppt\n20.5 \n%\n16.6 \n%\n3.9 ppt\n3.9 ppt\nAdjusted net income\n$\n3,961 \n$\n3,593 \n10%\n8%\n$\n11,136 \n$\n10,027 \n11%\n11%\nAdjusted diluted earnings per share\n$\n4.38 \n$\n3.89 \n13%\n11%\n$\n12.25 \n$\n10.78 \n14%\n13%\nNote: Table may not sum due to rounding.\n1    \nSee “Non-GAAP Financial Information” for further information on our non-GAAP adjustments and the reconciliation to GAAP reported amounts. \n \n30   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nKey highlights for the three and nine months ended September 30, 2025, versus the comparable periods in 2024:\nNet revenue\nThree Months Ended September 30, 2025\nGAAP\nNon-GAAP \n(currency-neutral)\nBoth the as-reported and currency-neutral net revenue increases were attributable to growth in our payment network and value-added services and solutions.\nup 17%\nup 15%\nNine Months Ended September 30, 2025\nGAAP\nNon-GAAP \n(currency-neutral)\nBoth the as-reported and currency-neutral net revenue increases were attributable to growth in our payment network and value-added services and solutions.\nup 16%\nup 16%\nOperating expenses\nAdjusted\noperating expenses\nThree Months Ended September 30, 2025\nGAAP\nNon-GAAP \n(currency-neutral)\nThe as-reported operating expenses increase was primarily due to higher general and administrative expenses (which included a restructuring charge in the third quarter of 2024), partially offset by lower litigation provisions.  The as-adjusted operating expenses increase was primarily due to higher general and administrative expenses. \nup 5%\nup 14%\nNine Months Ended September 30, 2025\nGAAP\nNon-GAAP \n(currency-neutral)\nThe as-reported operating expenses increase was primarily due to higher general and administrative expenses (which included a restructuring charge in the third quarter of 2024), partially offset by lower litigation provisions.  The as-adjusted operating expenses increase was primarily due to higher general and administrative expenses. \nup 11%\nup 14%\nEffective income \ntax rate\nAdjusted effective \nincome tax rate\nThree Months Ended September 30, 2025\nBoth the as-reported and as-adjusted effective income tax rates were higher versus the comparable period in 2024, primarily due to the 15% global minimum tax (Pillar 2 Rules) that took effect in 2025 and  a change in our geographic mix of earnings.\nGAAP\nNon-GAAP\n21.5%\n21.4%\nup 5.9 ppt\nup 5.1 ppt\nNine Months Ended September 30, 2025\nBoth the as-reported and as-adjusted effective income tax rates were higher versus the comparable period in 2024, primarily due to the Pillar 2 Rules that took effect in 2025 and a change in our geographic mix of earnings.\nGAAP\nNon-GAAP\n20.4%\n20.5%\nup 4.3 ppt\nup 3.9 ppt\nOther financial highlights for the nine months ended September 30, 2025 were as follows:\n•\nWe generated net cash flows from operations of $12.6 billion.\n•\nWe repurchased \n14.7 million\n shares of our common stock for $8.2 billion and paid dividends of $2.1 billion.\n•\nWe completed a debt offering in February 2025 for an aggregate principal amount of $1.25 billion.\n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n31\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNon-GAAP Financial Information\nNon-GAAP financial information is defined as a numerical measure of a company’s performance that excludes or includes amounts so as to be different than the most comparable measure calculated and presented in accordance with accounting principles generally accepted in the United States (“GAAP”).  As described more fully below, our non-GAAP financial measures exclude, where applicable, the impact of gains and losses on our equity investments, which includes mark-to-market fair value adjustments, impairments and gains and losses upon disposition, as well as the related tax impacts.  Our non-GAAP financial measures also exclude, where applicable, the impact of special items, which represent litigation judgments and settlements and/or certain one-time items, as well as the related tax impacts (“Special Items”).  We also present growth rates adjusted for the impact of currency, which is a non-GAAP financial measure.  We believe that the non-GAAP financial measures presented facilitate an understanding of our operating performance and provide a meaningful comparison of our results between periods.  We use non-GAAP financial measures to evaluate our ongoing operations in relation to historical results, for internal planning and forecasting purposes and in the calculation of performance-based compensation, among other things.  We excluded these items because management evaluates the underlying operations and performance of the Company separately from these recurring and nonrecurring items.  Operating expenses, operating margin, other income (expense), effective income tax rate, net income and diluted earnings per share, each as adjusted for the impact of gains and losses on our equity investments, Special Items and/or the impact of currency, should not be relied upon as substitutes for measures calculated in accordance with GAAP.  \nOur non-GAAP financial measures for the comparable periods exclude the impact of the following:\nGains and Losses on Equity Investments\n•\nIn the \nthree and nine months ended September 30, 2025\n, we recorded net gains of $41 million ($31 million after tax, or $0.03 per diluted share) and $16 million ($11 million after tax, or $0.01 per diluted share), respectively, primarily related to unrealized fair market value adjustments on marketable and nonmarketable equity securities.\n•\nIn the three and nine months ended September 30, 2024, we recorded net losses of $62 million ($63 million after tax, or $0.07 per diluted share) and $69 million ($67 million after tax, or $0.07 per diluted share), respectively, primarily related to unrealized fair market value adjustments on marketable and nonmarketable equity securities.\nSpecial Items\nLitigation provisions\n•\nIn the three months ended September 30, 2025, we recorded charges of $83 million ($65 million after tax, or $0.07 per diluted share), primarily due to a legal provision associated with the U.S. liability shift litigation.  In the nine months ended September 30, 2025, we recorded charges of $330 million ($240 million after tax, or $0.26 per diluted share), primarily as a result of a change in estimate related to the claims of merchants who opted out of the U.S. merchant class litigation, a legal provision associated with the U.S. liability shift litigation and a legal provision associated with the ATM non-discrimination rule surcharge complaints.\n•\nIn the three months ended September 30, 2024, we recorded charges of $176 million ($120 million after tax, or $0.13 per diluted share), primarily as a result of a change in estimate related to the claims of merchants who opted out of the U.S. merchant class litigation.  In the nine months ended September 30, 2024, we recorded charges of $400 million ($281 million after tax, or $0.30 per diluted share), primarily as a result of a change in estimate related to the claims of merchants who opted out of the U.S. merchant class litigation, settlements with a number of U.K. merchants and a legal provision associated with the ATM non-discrimination rule surcharge complaints. \nRestructuring charge\n•\nIn the three and nine months ended September 30, 2024, we recorded a restructuring charge of $190 million ($147 million after tax, or $0.16 per diluted share).  The restructuring action was intended to streamline our organization, delivering efficiencies to enable reinvestment in our business to support the realization of our long-term growth opportunities.\nSee Note 5 (Investments) and Note 14 (Legal and Regulatory Proceedings) to the consolidated financial statements included in Part I, Item 1 of this Report for further discussion related to certain of the items discussed above.   \nCurrency-neutral Growth Rates\nCurrency-neutral growth rates are non-GAAP financial measures and are calculated by remeasuring the prior period’s results using the current period’s exchange rates for both the translational and transactional impacts on operating results.  The impact of currency translation represents the effect of translating operating results where the functional currency is different from our U.S. dollar reporting currency.  The impact of the transactional currency represents the effect of converting revenue and expenses occurring in a currency other than the functional currency of the entity.  The impact of the related realized gains and losses resulting from our foreign exchange derivative contracts designated as cash flow hedging instruments (specifically those that manage the impact of foreign currency variability on anticipated revenues and expenses) is recognized in the respective financial statement line item on the consolidated statements of operations when the underlying forecasted transactions impact earnings. \n \n32   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe translational and transactional impact of currency and the related impact of our foreign exchange derivative contracts designated as cash flow hedging instruments as specified in the preceding paragraph (collectively, the “Currency Impact”) has been excluded from our currency-neutral growth rates and has been identified in the “Non-GAAP Reconciliations” tables below and our “Drivers of Change” tables.  See “Foreign Currency - Currency Impact” for further information on our currency impacts and “Financial Results - Net Revenue” and “Financial Results - Operating Expenses” for our \"Drivers of Change” tables.  \nNon-GAAP Reconciliations \nThe following tables reconcile our reported financial measures calculated in accordance with GAAP to the respective adjusted non-GAAP financial measures:\nThree Months Ended September 30, 2025\nOperating expenses\nOperating margin\nOther income (expense)\nEffective income tax rate\nNet income\nDiluted earnings per share\n($ in millions, except per share data)\nReported - GAAP\n$\n3,541 \n58.8 \n%\n$\n(62)\n21.5 \n%\n$\n3,927 \n$\n4.34 \n(Gains) losses on equity investments\n**\n**\n(41)\n— \n%\n(31)\n(0.03)\nLitigation provisions\n(83)\n1.0 \n%\n ** \n— \n%\n65 \n0.07 \nAdjusted - Non-GAAP\n$\n3,459 \n59.8 \n%\n$\n(103)\n21.4 \n%\n$\n3,961 \n$\n4.38 \nNine Months Ended September 30, 2025\n Operating expenses\nOperating margin\nOther income (expense)\nEffective income tax rate\n Net income\n Diluted earnings per share\n($ in millions, except per share data)\nReported - GAAP\n$\n9,998 \n58.3 \n%\n$\n(285)\n20.4 \n%\n$\n10,908 \n$\n12.00 \n(Gains) losses on equity investments\n**\n**\n(16)\n— \n%\n(11)\n(0.01)\nLitigation provisions\n(330)\n1.4 \n%\n ** \n0.2 \n%\n240 \n0.26 \nAdjusted - Non-GAAP\n$\n9,668 \n59.7 \n%\n$\n(301)\n20.5 \n%\n$\n11,136 \n$\n12.25 \nThree Months Ended September 30, 2024\nOperating expenses\nOperating margin\nOther income (expense)\nEffective income tax rate\nNet income\nDiluted earnings per share\n($ in millions, except per share data)\nReported - GAAP\n$\n3,365 \n54.3 \n%\n$\n(138)\n15.6 \n%\n$\n3,263 \n$\n3.53 \n(Gains) losses on equity investments\n**\n**\n62 \n(0.3)\n%\n63 \n0.07 \nLitigation provisions\n(176)\n2.4 \n%\n**\n0.7 \n%\n120 \n0.13 \nRestructuring charge\n(190)\n2.6 \n%\n**\n0.3 \n%\n147 \n0.16 \nAdjusted - Non-GAAP\n$\n2,999 \n59.3 \n%\n$\n(75)\n16.3 \n%\n$\n3,593 \n$\n3.89 \nNine Months Ended September 30, 2024\n Operating expenses\nOperating margin\nOther income (expense)\nEffective income tax rate\n Net income\n Diluted earnings per share\n($ in millions, except per share data)\nReported - GAAP\n$\n9,034 \n56.3 \n%\n$\n(281)\n16.1 \n%\n$\n9,532 \n$\n10.25 \n(Gains) losses on equity investments\n**\n**\n69 \n(0.1)\n%\n67 \n0.07 \nLitigation provisions\n(400)\n1.9 \n%\n**\n0.5 \n%\n281 \n0.30 \nRestructuring charge\n(190)\n0.9 \n%\n**\n0.1 \n%\n147 \n0.16 \nAdjusted - Non-GAAP\n$\n8,444 \n59.2 \n%\n$\n(211)\n16.6 \n%\n$\n10,027 \n$\n10.78 \nNote: Tables may not sum due to rounding.\n**    Not applicable. \n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n33\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following tables represents the reconciliation of our growth rates reported under GAAP to our non-GAAP growth rates:\nThree Months Ended September 30, 2025 as compared to the Three Months Ended September 30, 2024\nIncrease/(Decrease)\n Operating expenses\nOperating margin\nEffective income tax rate\n Net income\n Diluted earnings per share\nReported - GAAP\n5%\n4.5 ppt\n5.9 ppt\n20%\n23%\n(Gains) losses on equity investments\n**\n**\n0.2 ppt\n(3)%\n(3)%\nLitigation provisions\n3%\n(1.4) ppt\n(0.7) ppt\n(2)%\n(2)%\nRestructuring charge\n7%\n(2.6) ppt\n(0.3) ppt\n(5)%\n(5)%\nAdjusted - Non-GAAP\n15%\n0.5 ppt\n5.1 ppt\n10%\n13%\nCurrency Impact\n(1)%\n(0.3) ppt\n(0.5) ppt\n(2)%\n(2)%\nAdjusted - Non-GAAP - currency-neutral\n14%\n0.2 ppt\n4.6 ppt\n8%\n11%\nNine Months Ended September 30, 2025 as compared to the Nine Months Ended September 30, 2024\nIncrease/(Decrease)\n Operating expenses\nOperating margin\nEffective income tax rate\n Net income\n Diluted earnings per share\nReported - GAAP\n11%\n2.0 ppt\n4.3 ppt\n14%\n17%\n(Gains) losses on equity investments\n**\n**\n0.1 ppt\n(1)%\n(1)%\nLitigation provisions\n1%\n(0.6) ppt\n(0.3) ppt\n(1)%\n(1)%\nRestructuring charge\n3%\n(0.9) ppt\n(0.1) ppt\n(2)%\n(2)%\nAdjusted - Non-GAAP\n14%\n0.5 ppt\n3.9 ppt\n11%\n14%\nCurrency Impact\n—%\n— ppt\n(0.1) ppt\n—%\n—%\nAdjusted - Non-GAAP - currency-neutral\n14%\n0.5 ppt\n3.9 ppt\n11%\n13%\nNote: Tables may not sum due to rounding.\n**    Not applicable. \nKey Metrics and Drivers\nIn addition to the financial measures described above in “Financial Results Overview”, we review the following metrics to evaluate and identify trends in our business, measure our performance, prepare financial projections and make strategic decisions.  We believe that the key metrics presented facilitate an understanding of our operating and financial performance and provide a meaningful comparison of our results between periods.  \nOperating Margin\n measures how much profit we make on each dollar of sales after our operating costs but before other income (expense) and income tax expense.  Operating margin is calculated by dividing our operating income by net revenue.\nKey Drivers \nGross Dollar Volume (“GDV”)\n measures dollar volume of activity, including both domestic and cross-border volume, on cards carrying our brands during the period, on a local currency basis and U.S. dollar-converted basis.  GDV represents purchase volume plus cash volume; “purchase volume” means the aggregate dollar amount of purchases made with Mastercard-branded cards for the relevant period; and “cash volume” means the aggregate dollar amount of cash disbursements and includes the impact of balance transfers and convenience checks obtained with Mastercard-branded cards for the relevant period.  Information denominated in U.S. dollars relating to GDV is calculated by applying an established U.S. dollar/local currency exchange rate for each local currency in which our volumes are reported.  These exchange rates are calculated on a quarterly basis using the average exchange rate for each quarter.  We report period-over-period rates of change in purchase volume and cash volume on the basis of local currency information, in order to eliminate the impact of changes in the value of currencies against the U.S. dollar in calculating such rates of change.  Data used in the calculation of GDV is provided by our customers and is subject to verification by Mastercard and partial cross-checking against information provided by Mastercard’s transaction switching systems.  All data is subject to revision and amendment by Mastercard or our customers.\nCross-border Volume Growth\n measures the growth of cross-border dollar volume during the period, on a local currency basis and U.S. dollar-converted basis, for all Mastercard-branded programs. \nSwitched Transactions\n measures the number of transactions switched by Mastercard, which is defined as the number of transactions initiated and switched through our network during the period.\n \n \n34   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following tables provide a summary of the growth trends in our key drivers:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nIncrease/(Decrease)\nIncrease/(Decrease)\nUSD\nLocal\nUSD\nLocal\nUSD\nLocal\nUSD\nLocal\nMastercard-branded GDV growth \n1\n10%\n9%\n9%\n11%\n8%\n9%\n8%\n10%\nUnited States\n7%\n7%\n7%\n7%\n7%\n7%\n6%\n6%\nWorldwide less United States\n11%\n10%\n10%\n12%\n9%\n10%\n9%\n12%\nCross-border volume growth \n1\n19%\n15%\n17%\n17%\n17%\n15%\n17%\n17%\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nIncrease/(Decrease)\nIncrease/(Decrease)\nSwitched transactions growth\n10%\n11%\n10%\n11%\n1    \nExcludes volume generated by Maestro and Cirrus cards.\nKey Metrics related to the Payment Network\nAssessments represent agreed-upon standard pricing provided to our customers based on various forms of payment-related activity.  Assessments are used internally by management to monitor operating performance as it allows for comparability and provides visibility into cardholder trends.  Assessments do not represent our net revenue.\nThe following provides additional information on our key metrics related to the payment network:\n•\nDomestic assessments \nare charges based on activity related to cards that carry the Company’s brands where the merchant country and the country of issuance are the same.  These assessments are primarily driven by the domestic dollar volume of activity (e.g., domestic purchase volume, domestic cash volume) or the number of cards issued.\n•\nCross-border assessments \nare charges based on activity related to cards that carry the Company’s brands where the merchant country and the country of issuance are different.  These assessments are primarily driven by the cross-border dollar volume of activity (e.g., cross-border purchase volume, cross-border cash volume). \n•\nTransaction processing assessments\n are charges primarily driven by the number of switched transactions on our payment network.  Switching activities include:\n◦\nAuthorization, the process by which a transaction is routed to the issuer for approval \n◦\nClearing, the determination and exchange of financial transaction information between issuers and acquirers after a transaction has been successfully conducted at the point of interaction \n◦\nSettlement, which facilitates the determination and exchange of funds between parties \nThese assessments can also include connectivity services and network access, which are based on the volume of data transmitted and the number of authorization and settlement messages.\n•\nOther network assessments \nare charges for licensing, implementation and other franchise fees.\nThe following table provides a summary of our key metrics related to the payment network:\nThree Months Ended September 30,\nIncrease/(Decrease)\nNine Months Ended September 30,\nIncrease/(Decrease)\n2025\n2024\nAs reported\nCurrency-neutral\n2025\n2024\nAs reported\nCurrency-neutral\n($ in millions)\nDomestic assessments\n$\n2,809 \n$\n2,641 \n6%\n6%\n$\n8,256 \n$\n7,707 \n7%\n9%\nCross-border assessments\n3,313 \n2,804 \n18%\n16%\n8,756 \n7,475 \n17%\n16%\nTransaction processing assessments\n4,191 \n3,587 \n17%\n15%\n11,689 \n9,997 \n17%\n16%\nOther network assessments\n255 \n227 \n13%\n12%\n746 \n697 \n7%\n7%\n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n35\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForeign Currency\nCurrency Impact\nOur primary revenue functional currencies are the U.S. dollar, euro, British pound and the Brazilian real.  Our overall operating results are impacted by currency translation, which represents the effect of translating operating results where the functional currency is different than our U.S. dollar reporting currency.\nOur operating results are also impacted by transactional currency.  The impact of the transactional currency represents the effect of converting revenue and expense transactions occurring in a currency other than the functional currency.  Changes in currency exchange rates directly impact the calculation of GDV, which is used in the calculation of our key metrics related to domestic assessments and cross-border assessments as well as certain volume-related rebates and incentives.  GDV is calculated based on local currency spending volume converted to U.S. dollars and euros using average exchange rates for the period.  As a result, our key metrics related to domestic assessments and cross-border assessments as well as certain volume-related rebates and incentives are impacted by the strengthening or weakening of the U.S. dollar and euro versus local currencies.  For example, our billing in Australia is in the U.S. dollar, however, consumer spend in Australia is in the Australian dollar.  The transactional currency impact of converting Australian dollars to our U.S. dollar billing currency will have an impact on the revenue generated.  The strengthening or weakening of the U.S. dollar is evident when GDV growth on a U.S. dollar-converted basis is compared to GDV growth on a local currency basis.  For the three and nine months ended September 30, 2025, GDV on a U.S. dollar-converted basis increased 10% and 8%, respectively, while GDV on a local currency basis increased 9% for each of the periods, versus the comparable periods in 2024.  Further, the impact from transactional currency occurs in our key metrics related to transaction processing assessments and other network assessments as well as value-added services and solutions revenue and operating expenses when the transacting currency of these items is different than the functional currency of the entity.\nTo manage the impact of foreign currency variability on anticipated revenues and expenses, we may enter into foreign exchange derivative contracts and designate such derivatives as hedging instruments in a cash flow hedging relationship as discussed further in Note 16 (Derivative and Hedging Instruments) to the consolidated financial statements included in Part I, Item 1. \nForeign Exchange Activity\nWe incur foreign currency gains and losses from remeasuring monetary assets and liabilities that are denominated in a currency other than the functional currency of the entity.  To manage this foreign exchange risk, we may enter into foreign exchange derivative contracts to economically hedge the foreign currency exposure of our nonfunctional currency monetary assets and liabilities.  The gains or losses resulting from the changes in fair value of these contracts are intended to reduce the potential effect of the underlying hedged exposure and are recorded net within general and administrative expenses on the consolidated statements of operations.  The impact of this foreign exchange activity, including the related hedging activities, has not been eliminated in our currency-neutral results.  \nOur foreign exchange risk management activities are discussed further in Note 16 (Derivative and Hedging Instruments) to the consolidated financial statements included in Part I, Item 1.  \nFinancial Results\nNet Revenue\nThe components of net revenue were as follows:\n \nThree Months Ended September 30,\nIncrease/(Decrease)\nNine Months Ended September 30,\nIncrease/(Decrease)\n \n2025\n2024\n2025\n2024\n \n($ in millions)\nPayment network\n$\n5,179 \n$\n4,629 \n12%\n$\n14,556 \n$\n12,924 \n13%\nValue-added services and solutions\n3,423 \n2,740 \n25%\n9,429 \n7,754 \n22%\nTotal net revenue \n$\n8,602 \n$\n7,369 \n17%\n$\n23,985 \n$\n20,678 \n16%\nFor the three months ended September 30, 2025: \nNet revenue increased 17%, or 15% on a currency-neutral basis, versus the comparable period in 2024, which included a 1 percentage point increase from acquisitions completed in 2024 (“Acquisitions”).  The remaining increase in net revenue was attributable to organic growth in both our payment network and value-added services and solutions.\n \n36   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNet revenue from our payment network increased 12%, or 10% on a currency-neutral basis, versus the comparable period in 2024.  The increase was primarily driven by growth in domestic and cross-border dollar volumes and an increase in the number of switched transactions, reflecting growth trends across all of our key drivers.  Net revenue from our payment network included $5,389 million of rebates and incentives provided to customers, which increased 16%, or 15% on a currency-neutral basis, versus the comparable period in 2024, primarily due to an increase in our key drivers as well as new and renewed deals.\nNet revenue from our value-added services and solutions increased 25%, or 22% on a currency-neutral basis, versus the comparable period in 2024, which included a 3 percentage point increase from Acquisitions.  The remaining increase was driven primarily by (1) growth in our underlying key drivers, (2) our security and digital and authentication solutions, consumer acquisition and engagement services, and business and market insights and (3) pricing. \nFor the nine months ended September 30, 2025:\nNet revenue increased 16%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024, which included a 1 percentage point increase from Acquisitions.  The remaining increase in net revenue was attributable to organic growth in both our payment network and value-added services and solutions.\nNet revenue from our payment network increased 13%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024.  The increase was primarily driven by growth in domestic and cross-border dollar volumes and an increase in the number of switched transactions, reflecting growth trends across all of our key drivers.  Net revenue from our payment network included $14,891 million of rebates and incentives provided to customers, which increased 15%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024, primarily due to an increase in our key drivers as well as new and renewed deals.  \nNet revenue from our value-added services and solutions increased 22%, or 21% on a currency-neutral basis, versus the comparable period in 2024, which included a 3 percentage point increase from Acquisitions.  The remaining increase was driven primarily by (1) growth in our underlying key drivers, (2) our security and digital and authentication solutions, and consumer acquisition and engagement services and (3) pricing. \nSee Note 3 (Revenue) to the consolidated financial statements included in Part II, Item 8 of our 2024 Form 10-K for a further discussion of our revenue recognition policies.\nDrivers of Change\nThe following tables summarize the drivers of change in net revenue:\nThree Months Ended September 30, 2025\nIncrease/(Decrease)\nOperational\nAcquisitions\nCurrency impact \n1\nTotal\nPayment network\n10 \n%\n**\n2 \n%\n12 \n%\nValue-added services and solutions\n19 \n%\n3 \n%\n3 \n%\n25 \n%\nNet revenue\n13 \n%\n1 \n%\n2 \n%\n17 \n%\nNine Months Ended September 30, 2025\nIncrease/(Decrease)\nOperational\nAcquisitions \nCurrency impact \n1\nTotal\nPayment network\n13 \n%\n**\n— \n%\n13 \n%\nValue-added services and solutions\n17 \n%\n3 \n%\n1 \n%\n22 \n%\nNet revenue\n14 \n%\n1 \n%\n— \n%\n16 \n%\nNote: Tables may not sum due to rounding.\n**    Not applicable.\n1\nIncludes the translational and transactional impact of currency and the related impact of our foreign exchange derivative contracts designated as cash flow hedging instruments.  See “Non-GAAP Financial Information - Currency-neutral Growth Rates” for further information on our currency impact non-GAAP adjustment. \n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n37\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOperating Expenses\nFor the three months ended September 30, 2025, operating expenses increased 5% versus the comparable period in 2024.  Adjusted operating expenses increased 15%, or 14% on a currency-neutral basis, versus the comparable period in 2024, which included a 4 percentage point increase from Acquisitions.\nFor the nine months ended September 30, 2025, operating expenses increased 11% versus the comparable period in 2024.  Adjusted operating expenses increased 14%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024, which included a 4 percentage point increase from Acquisitions.  \nThe components of operating expenses were as follows:\nThree Months Ended September 30,\nIncrease/ (Decrease)\nNine Months Ended September 30,\nIncrease/ (Decrease)\n2025\n2024\n2025\n2024\n($ in millions)\nGeneral and administrative\n$\n2,923 \n$\n2,744 \n7%\n$\n8,212 \n$\n7,448 \n10%\nAdvertising and marketing\n245 \n220 \n11%\n610 \n520 \n17%\nDepreciation and amortization\n290 \n225 \n29%\n846 \n666 \n27%\nProvision for litigation\n83 \n176 \n(53)%\n330 \n400 \n(18)%\nTotal operating expenses\n3,541 \n3,365 \n5%\n9,998 \n9,034 \n11%\nSpecial Items \n1\n(83)\n(366)\n(77)%\n(330)\n(590)\n(44)%\nAdjusted total operating expenses \n1\n$\n3,459 \n$\n2,999 \n15%\n$\n9,668 \n$\n8,444 \n14%\nNote: Table may not sum due to rounding.\n1    \nSee “Non-GAAP Financial Information” for further information on our non-GAAP adjustments and the reconciliation to GAAP reported amounts.\nDrivers of Change\nThe following tables summarize the drivers of change in operating expenses:\nThree Months Ended September 30, 2025\nIncrease/(Decrease)\nOperational\nAcquisitions\nCurrency impact \n1, 2\nSpecial \nItems \n2\nTotal\nGeneral and administrative\n10%\n4%\n1%\n(8)%\n7%\nAdvertising and marketing\n8%\n2%\n2%\n**\n11%\nDepreciation and amortization\n14%\n13%\n2%\n**\n29%\nProvision for litigation\n**\n**\n**\n(53)%\n(53)%\nTotal operating expenses\n10%\n4%\n1%\n(10)%\n5%\nNine Months Ended September 30, 2025\nIncrease/(Decrease)\nOperational\nAcquisitions\nCurrency impact \n1, 2\nSpecial\nItems \n2\nTotal\nGeneral and administrative\n10%\n4%\n—%\n(3)%\n10%\nAdvertising and marketing\n14%\n2%\n1%\n**\n17%\nDepreciation and amortization\n13%\n13%\n1%\n**\n27%\nProvision for litigation\n**\n**\n**\n(18)%\n(18)%\nTotal operating expenses\n10%\n4%\n—%\n(4)%\n11%\nNote: Tables may not sum due to rounding.\n**    Not applicable.\n1\nRepresents the translational and transactional impact of currency.\n2\nSee “Non-GAAP Financial Information” for further information on our non-GAAP adjustments and the reconciliation to GAAP reported amounts.\n \n38   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nGeneral and Administrative\nFor the three months ended September 30, 2025, general and administrative expenses increased 7%, or 6% on a currency-neutral basis, versus the comparable period in 2024, which included a 4 percentage point increase from Acquisitions and an 8 percentage point decrease from Special Items.  The remaining increase was primarily due to higher personnel costs to support the continued investment in our strategic initiatives across payments and value-added services and solutions as well as fulfillment costs to provide marketing services. \nFor the nine months ended September 30, 2025, general and administrative expenses increased 10%, on both an as-reported and currency-neutral basis, versus the comparable period in 2024, which included a 4 percentage point increase from Acquisitions and a 3 percentage point decrease from Special Items.  The remaining increase was primarily due to higher personnel costs to support the continued investment in our strategic initiatives across payments and value-added services and solutions as well as fulfillment costs to provide marketing services. \nThe components of general and administrative expenses were as follows:\nThree Months Ended September 30,\nIncrease/ (Decrease)\nNine Months Ended September 30,\nIncrease/(Decrease)\n \n2025\n2024\n2025\n2024\n \n($ in millions)\nPersonnel \n1\n$\n1,893 \n$\n1,899 \n—%\n$\n5,433 \n$\n5,020 \n8%\nProfessional fees\n128 \n129 \n(1)%\n348 \n358 \n(3)%\nData processing and telecommunications\n324 \n279 \n16%\n930 \n820 \n13%\nForeign exchange activity \n2\n26 \n16 \n53%\n68 \n49 \n38%\nOther\n552 \n421 \n32%\n1,433 \n1,201 \n19%\nTotal general and administrative expenses\n$\n2,923 \n$\n2,744 \n7%\n$\n8,212 \n$\n7,448 \n10%\n1\nFor the three and nine months ended September 30, 2024, total general and administrative expenses included a restructuring charge of $190 million.  See “Non-GAAP Financial Information” for further information.\n2\nForeign exchange activity includes the impact of remeasurement of assets and liabilities denominated in foreign currencies net of the impact of gains and losses on foreign exchange derivative contracts.  See Note 16 (Derivative and Hedging Instruments) to the consolidated financial statements included in Part I, Item 1 for further discussion.\nAdvertising and Marketing\nFor the three months ended September 30, 2025, advertising and marketing expenses increased 11%, or 9% on a currency-neutral basis, versus the comparable period in 2024, which included a 2 percentage point increase from Acquisitions.  The remaining increase was primarily due to an increase in spending on sponsorships.\nFor the nine months ended September 30, 2025, advertising and marketing expenses increased 17%, or 16% on a currency-neutral basis, versus the comparable period in 2024, which included a 2 percentage point increase from Acquisitions.  The remaining increase was primarily due to an increase in spending on sponsorships and marketing campaigns. \nDepreciation and Amortization\nFor the three months ended September 30, 2025, depreciation and amortization expenses increased 29%, or 27% on a currency-neutral basis, versus the comparable period in 2024, which included a 13 percentage point increase from Acquisitions.  The remaining increase was primarily due to higher capitalized software versus the comparable period in 2024, driven by the continued growth of our business.\nFor the nine months ended September 30, 2025, depreciation and amortization expenses increased 27%, or 26% on a currency-neutral basis, versus the comparable period in 2024, which included a 13 percentage point increase from Acquisitions.  The remaining increase was primarily due to higher capitalized software versus the comparable period in 2024, driven by the continued growth of our business.\nProvision for Litigation\nFor the three months ended September 30, 2025, we recorded charges of $83 million, primarily due to a legal provision associated with the U.S. liability shift litigation.  For the nine months ended September 30, 2025, we recorded charges of $330 million, primarily as a result of a change in estimate related to the claims of merchants who opted out of the U.S. merchant class litigation, a legal provision associated with the U.S. liability shift litigation and a legal provision associated with the ATM non-discrimination rule surcharge complaints.  See “Non-GAAP Financial Information” in this section and Note 14 (Legal and Regulatory Proceedings) to the consolidated financial statements included in Part I, Item 1 of this Report for further discussion.\n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n39\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOther Income (Expense)\nThe components of total other income (expense) were as follows:\nThree Months Ended September 30,\nFavorable/ (Unfavorable)\nNine Months Ended September 30,\nFavorable/ (Unfavorable)\n \n2025\n2024\n2025\n2024\n \n(in millions)\nInvestment income\n$\n81 \n$\n76 \n$\n5 \n$\n239 \n$\n231 \n$\n8 \nGains (losses) on equity investments, net\n41 \n(62)\n103 \n16 \n(69)\n85 \nInterest expense\n(186)\n(159)\n(27)\n(563)\n(462)\n(101)\nOther income (expense), net\n2 \n7 \n(5)\n23 \n19 \n4 \nTotal other income (expense)\n(62)\n(138)\n76 \n(285)\n(281)\n(4)\n(Gains) losses on equity investments \n1\n(41)\n62 \n(103)\n(16)\n69 \n(85)\nAdjusted total other income (expense) \n1\n$\n(103)\n$\n(75)\n$\n(28)\n$\n(301)\n$\n(211)\n$\n(90)\nNote: Table may not sum due to rounding.\n1    \nSee “Non-GAAP Financial Information” for further information on our non-GAAP adjustments and the reconciliation to GAAP reported amounts.\nIncome Taxes \nThe effective income tax rates for the three months ended September 30, 2025 and 2024 were 21.5% and 15.6%, respectively.  The adjusted effective income tax rates for the three months ended September 30, 2025 and 2024 were 21.4% and 16.3%, respectively.  The effective income tax rates for the nine months ended September 30, 2025 and 2024 were 20.4% and 16.1%, respectively.  The adjusted effective income tax rates for the nine months ended September 30, 2025 and 2024 were 20.5% and 16.6%, respectively.  Both the as-reported and as-adjusted effective income tax rates for the three and nine months ended September 30, 2025 were higher versus the comparable periods in 2024, primarily due to the Pillar 2 Rules and a change in our geographic mix of earnings.  In 2025, the Pillar 2 Rules took effect in Singapore and various other jurisdictions and largely offsets the reduction to our effective income tax rate resulting from our incentive grant received from the Singapore Ministry of Finance.  See Note 20 (Income Taxes) to the consolidated financial statements included in Part II, Item 8 of our 2024 Form 10-K for further information about this incentive grant.\nIn July 2025, the U.S. enacted the One Big Beautiful Bill Act (OBBBA).  While we continue to analyze the impacts of the OBBBA, at this time it is not expected to have a material impact on our financial statements.\nLiquidity and Capital Resources\nWe rely on existing liquidity (our cash, cash equivalents and investments), cash generated from operations and access to capital to fund our global operations, credit and settlement exposure, capital expenditures, investments in our business and current and potential obligations.  The following table summarizes the cash, cash equivalents, investments and credit available to us:\nSeptember 30,\n2025\nDecember 31,\n2024\n(in billions)\nCash, cash equivalents and investments \n1\n$\n10.6 \n$\n8.8 \nUnused line of credit\n$\n8.0 \n$\n8.0 \n1    \nInvestments include available-for-sale securities and held-to-maturity securities.  This amount excludes restricted cash and restricted cash equivalents and restricted security deposits held for customers at September 30, 2025 and December 31, 2024 of $2.5 billion and $2.4 billion, respectively.\nWe believe that our existing liquidity, our cash flow generating capabilities, and our access to capital resources are sufficient to satisfy our future operating cash needs, capital asset purchases, outstanding commitments and other liquidity requirements associated with our existing operations and potential obligations, which include litigation provisions and credit and settlement exposure.\nOur liquidity and access to capital could be negatively impacted by global credit market conditions.  We guarantee the settlement of many of the transactions between our customers.  Historically, payments under these guarantees have not been significant; however, historical trends may not be indicative of potential future losses.  The risk of loss on these guarantees is specific to individual customers, but may also be driven by regional or global economic and market conditions, including, but not limited to the health of the financial institutions in a country or region.  See Note 15 (Settlement and Other Risk Management) to the consolidated financial statements in Part I, Item 1 for a description of these guarantees.\n \n40   \n  MASTERCARD SEPTEMBER 30, 2025 FORM 10-Q\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOur liquidity and access to capital could also be negatively impacted by the outcome of any of the legal or regulatory proceedings to which we are a party.  For additional discussion of these and other risks facing our business, see Part I, Item 1A - Risk Factors of our 2024 Form 10-K and Note 14 (Legal and Regulatory Proceedings) to the consolidated financial statements in Part I, Item 1 of this Report.\nCash Flows\nThe table below shows a summary of the cash flows from operating, investing and financing activities:\nNine Months Ended September 30,\n \n2025\n2024\n \n(in millions)\nNet cash provided by operating activities\n$\n12,646 \n$\n9,946 \nNet cash used in investing activities\n$\n(941)\n$\n(724)\nNet cash used in financing activities\n$\n(9,993)\n$\n(6,795)\nNet cash provided by operating activities increased $2,700 million for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to higher net income after adjusting for non-cash items. \nNet cash used in investing activities increased $217 million for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to lower proceeds from maturities and sales of investment securities, partially offset by lower purchases of investment securities.\nNet cash used in financing activities increased $3,198 million for the nine months ended September 30, 2025, versus the comparable period in 2024, primarily due to lower proceeds from debt and higher cash paid for repurchases of our Class A common stock and dividends, partially offset by  higher repayments of debt in the prior year.\nDebt and Credit Availability\nIn February 2025, we issued $300 million principal amount of Floating Rate Notes due March 2028, $450 million principal amount of 4.550% notes due March 2028 and $500 million principal amount of 4.950% notes due March 2032 (collectively, the “2025 USD Notes”).  The net proceeds from the issuance of the 2025 USD Notes, after deducting the original issue discount, underwriting discount and offering expenses, were $1.242 billion.\nIn March 2025, $750 million of principal related to the 2019 USD Notes matured and was paid.  Our total debt outstanding at September 30, 2025 and December 31, 2024 was $19.0 billion and $18.2 billion, respectively, with the earliest maturity of $750 million of principal occurring in November 2026.\nAs of September 30, 2025, we have a commercial paper program (the “Commercial Paper Program”), under which we are authorized to issue up to $8 billion in outstanding notes, with maturities up to 397 days from the date of issuance.  In conjunction with the Commercial Paper Program, we have a committed unsecured $8 billion revolving credit facility (the “Credit Facility”) that expires in November 2029.\nBorrowings under the Commercial Paper Program and the Credit Facility are to be used to provide liquidity for general corporate purposes, including providing liquidity in the event of one or more settlement failures by our customers.  In addition, we may borrow and repay amounts under these facilities for business continuity purposes.  We had no borrowings outstanding under the Commercial Paper Program or the Credit Facility at September 30, 2025 and December 31, 2024.\nSee Note 9 (Debt) to the consolidated financial statements included in Part I, Item 1 for further discussion on our debt and Note 15 (Debt) to the consolidated financial statements included in Part II, Item 8 of our 2024 Form 10-K for further discussion on our debt, the Commercial Paper Program and the Credit Facility.\nDividends and Share Repurchases\nWe have historically paid quarterly dividends on our outstanding Class A common stock and Class B common stock.  Subject to legally available funds, we intend to continue to pay a quarterly cash dividend.  The declaration and payment of future dividends is at the sole discretion of our Board of Directors after taking into account various factors, including our financial condition, operating results, available cash and current and anticipated cash needs.\nAggregate payments for quarterly dividends for the nine months ended September 30, 2025 totaled $2,072 million. \nOn December 17, 2024, our Board of Directors declared a quarterly cash dividend of $0.76 per share paid on February 7, 2025 to holders of record as of January 9, 2025 of our Class A common stock and Class B common stock.  The aggregate amount of this dividend was $694 million.\n \nMASTERCARD SEPTEMBER 30, 2025 FORM 10-Q     \n41\nPART I\nITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOn February 10, 2025, our Board of Directors declared a quarterly cash dividend of $0.76 per share paid on May 9, 2025 to holders of record as of April 9, 2025 of our Class A common stock and Class B common stock.  The aggregate amount of this dividend was $691 million.\nOn June 24, 2025, our Board of Directors declared a quarterly cash dividend of $0.76 per share payable on August 8, 2025 to holders of record as of July 9, 2025 of our Class A common stock and Class B common stock.  The aggregate amount of this dividend was $687 million.\nOn September 16, 2025, our Board of Directors declared a quarterly cash dividend of $0.76 per share payable on November 7, 2025 to holders of record as of October 9, 2025 of our Class A common stock and Class B common stock.  The aggregate amount of this dividend is $684 million.  \nRepurchased shares of our common stock are considered treasury stock.  In December 2024 and 2023, our Board of Directors approved share repurchase programs of our Class A common stock authorizing us to repurchase up to $12.0 billion and $11.0 billion, respectively.  The program approved in 2024 became effective in April 2025 after the completion of the program approved in 2023.  The timing and actual number of additional shares repurchased will depend on a variety of factors, including cash requirements to meet the operating needs of the business, legal requirements, as well as the share price and economic and market conditions.  The following table summarizes our share repurchase authorizations and repurchase activity of our Class A common stock through September 30, 2025, unless otherwise noted:\n(in millions, except per share data)\nRemaining authorization at December 31, 2024\n$\n15,188 \nDollar-value of shares repurchased for the nine months ended September 30, 2025\n$\n8,169 \nRemaining authorization at September 30, 2025\n$\n7,019 \nShares repurchased for the nine months ended September 30, 2025\n14.7 \nAverage price paid per share for the nine months ended September 30, 2025\n$\n554.47 \nDollar-value of shares repurchased October 1, 2025 through October 27, 2025\n$\n1,202 \nNote: Table may not sum due to rounding.\nRecent Accounting Pronouncements\nFor a description of recent accounting pronouncements, if any, and the potential impact of these pronouncements refer to Note 1 (Summary of Significant Accounting Policies) to the consolidated financial statements in Part I, Item 1."
}