{
  "source_file": "maa-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\tManagement’s Discussion and Analysis o\nf Financial Condition and Results of Operations.\nThe following discussion analyzes the financial condition and results of operations of both MAA and the Operating Partnership, of which MAA is the sole general partner and in which MAA owned a 97.5% interest as of September 30, 2025. MAA conducts all of its business through the Operating Partnership and its various subsidiaries. This discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto included in this Quarterly Report on Form 10-Q.\nMAA, an S&P 500 company, is a multifamily-focused, self-administered and self-managed real estate investment trust, or REIT. We own, operate, acquire and selectively develop apartment communities primarily located in the Southeast, Southwest and Mid-Atlantic regions of the U.S. As of September 30, 2025, we owned and operated\n \n293 apartment communities (which does not include development communities under construction) through the Operating Partnership and its subsidiaries, and had an ownership interest in one apartment community through an unconsolidated real estate joint venture. In addition, as of September 30, 2025, we had seven development communities under construction, and 35 of our apartment communities included retail components. Our apartment communities, including development communities under construction, were located across 16 states and the District of Columbia as of September 30, 2025.\nWe report in two segments, Same Store and Non-Same Store and Other. Our Same Store segment represents those apartment communities that have been owned and stabilized for at least 12 months as of the first day of the calendar year. Communities are considered stabilized when achieving 90% average physical occupancy for 90 days. Our Non-Same Store and Other segment includes recently acquired communities, communities being developed or in lease-up, communities that have been disposed of or identified for disposition, communities that have incurred a significant casualty loss and stabilized communities that do not meet the requirements to be Same Store communities. Also included in our Non-Same Store and Other segment are non-multifamily activities and expenses related to severe weather events, including hurricanes and winter storms. Additional information regarding the composition of our segments is included in Note 11 to the condensed consolidated financial statements included in this Quarterly Report on Form 10-Q.\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q may contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, or the Exchange Act. Forward-looking statements do not discuss historical fact, but instead are statements related to expectations, projections, intentions, assumptions and beliefs regarding the future. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates,” “forecasts,” “projects,” “assumes,” “will,” “may,” “could,” “should,” “budget,” “target,” “outlook,” “proforma,” “opportunity,” “guidance” and variations of such words and similar expressions are intended to identify such forward-looking statements. Such forward-looking statements include, but are not limited to, statements regarding expected operating performance and results, property stabilizations, property acquisition and disposition activity, joint venture activity, development and renovation activity and other capital expenditures, and capital raising and financing activity, as well as lease pricing, revenue and expense growth, occupancy, interest rate and other economic expectations. Such forward-looking statements involve known and unknown risks, uncertainties and other factors, as described below, which may cause our actual results, performance, achievements or outcomes to be materially different from the future results, performance, achievements or outcomes expressed or implied by such forward-looking statements. In light of the significant uncertainties inherent in these forward-looking statements, the inclusion of such statements should not be regarded as a representation by us or any other person that the results, performance, achievements or outcomes described in such statements will be achieved.\n \n\n\n29\n\n\n\n\n \n\n\nThe following factors, among others, could cause our actual results, performance, achievements or outcomes to differ materially from those expressed or implied in the forward-looking statements:\n•\nadverse effects on occupancy levels and rental revenues due to unfavorable market and economic conditions;\n•\nexposure to risks inherent in investments in a single industry and sector;\n•\nadverse changes in real estate markets, including the extent of future demand for multifamily units in our significant markets, barriers of entry into new markets which we may seek to enter in the future, limitations on our ability to increase or collect rental rates, competition, our ability to identify and consummate attractive acquisitions or development projects on favorable terms, our ability to consummate any planned dispositions in a timely manner on acceptable terms, and our ability to reinvest sale proceeds in a manner that generates favorable returns;\n•\nfailure of development communities to be completed within budget and on a timely basis, if at all, to lease-up as anticipated or to achieve anticipated results;\n•\nunexpected capital needs;\n•\nmaterial changes in operating costs, including real estate taxes, utilities and insurance costs, due to inflation and other factors;\n•\ninability to obtain appropriate insurance coverage at reasonable rates, or at all, losses due to uninsured risks, deductibles and self-insured retentions, or losses from catastrophes in excess of coverage limits;\n•\nability to obtain financing at favorable rates, if at all, or refinance existing debt as it matures;\n•\nlevel and volatility of interest or capitalization rates or capital market conditions;\n•\nthe effect of any rating agency actions on the cost and availability of new debt financing;\n•\nthe impact of adverse developments affecting the U.S. or global banking industry, including bank failures and liquidity concerns, which could cause continued or worsening economic and market volatility, and regulatory responses thereto;\n•\nsignificant change in the mortgage financing market or other factors that would cause single-family housing or other alternative housing options, either as an owned or rental product, to become a more significant competitive product;\n•\nability to continue to satisfy complex rules in order to maintain our status as a REIT for federal income tax purposes, the ability of the Operating Partnership to satisfy the rules to maintain its status as a partnership for federal income tax purposes, the ability of our taxable REIT subsidiaries to maintain their status as such for federal income tax purposes, and our ability and the ability of our subsidiaries to operate effectively within the limitations imposed by these rules;\n•\ninability to attract and retain qualified personnel;\n•\ncyber liability or potential liability for breaches of our or our service providers’ information technology systems, or business operations disruptions;\n•\npotential liability for environmental contamination;\n•\nchanges in the legal requirements we are subject to, or the imposition of new legal requirements, that adversely affect our operations; \n•\nextreme weather and natural disasters;\n•\ndisease outbreaks and other public health events and measures that are taken by federal, state and local governmental authorities in response to such outbreaks and events;\n•\nimpact of climate change on our properties or operations;\n•\nlegal proceedings or class action lawsuits;\n•\nimpact of reputational harm caused by negative press or social media postings of our actions or policies, whether or not warranted;\n•\ncompliance costs associated with numerous federal, state and local laws and regulations; and\n•\nother risks identified in this Quarterly Report on Form 10-Q, in our Annual Report on Form 10-K for the year ended December 31, 2024 or in other reports we file with the Securities and Exchange Commission, or the SEC, from time to time.\nExcept as required by law, we undertake no obligation to publicly update or revise forward-looking statements contained in this Quarterly Report on Form 10-Q to reflect events, circumstances or changes in expectations after the date on which this Quarterly Report on Form 10-Q is filed.\nOverview of the Three Months Ended September 30, 2025\nFor the three months ended September 30, 2025, net income available for MAA common shareholders was $98.6 million as compared to $114.3 million for the three months ended September 30, 2024. Results for the three months ended September 30, 2025 included $8.9 million of accrued legal defense costs, partially offset by $5.4 million of non-cash gain from investments and $2.0 million of non-cash gain related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares. Results for the three months ended September 30, 2024 included $18.3 million of non-cash loss related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares, $11.0 million of gain on the consolidation of a third-party development and $5.7 million of net casualty related recoveries.\n \nRevenues for the three months ended September 30, 2025 increased 0.6% as compared to the three months ended September 30, 2024. Property operating expenses, excluding depreciation and amortization, for the three months ended September 30, 2025 increased\n \nby 2.1% as compared to the three months ended September 30, 2024. The primary drivers of these changes are discussed in the “Results of Operations” section.\n\n\n30\n\n\n\n\n \n\n\nTrends\n \nDuring the three months ended September 30, 2025, the change in revenue for our Same Store segment was primarily driven by average effective rent per unit. The average effective rent per unit for our Same Store segment decreased to $1,693 for the three months ended September 30, 2025 as compared to $1,700 for the three months ended September 30, 2024, a 0.4% decrease for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. Average effective rent per unit represents the average of gross rent amounts, after the effect of leasing concessions, for occupied apartment units plus prevalent market rates asked for unoccupied apartment units, divided by the total number of units. Leasing concessions represent discounts to the current market rate. We believe average effective rent per unit is a helpful measurement in evaluating average pricing; however, it does not represent actual rental revenue collected per unit.\nFor the three months ended September 30, 2025, average physical occupancy for our Same Store segment was 95.6% as compared to 95.7% for the three months ended September 30, 2024. Average physical occupancy is a measurement of the total number of our apartment units that are occupied by residents, and it represents the average of the daily physical occupancy for the period.\nAs of September 30, 2025, resident turnover for our Same Store segment was 40.2% as compared to 42.8% as of September 30, 2024. Resident turnover represents resident move outs, excluding transfers within the Same Store segment, as a percentage of expiring leases on a trailing twelve-month basis as of the end of the reported period.\nAn important part of our portfolio strategy is to maintain diversity of markets, submarkets, product types and price points in the Southeast, Southwest and Mid-Atlantic regions of the U.S. We have multifamily assets in 38 defined markets, with a presence in approximately 150 submarkets and a mixture of garden-style, mid-rise and high-rise communities. This diversity helps to mitigate exposure to economic issues, including supply and demand factors, in any one geographic market or area. We believe that a well-balanced portfolio, including both urban and suburban locations, with a broad range of monthly rent price points, will provide higher performance and lower volatility throughout the full economic cycle.\nDemand for apartments in our markets was solid during the third quarter of 2025, as evidenced by strong renewal pricing, solid traffic patterns and lead volumes along with stable occupancy and low resident turnover. We believe demand for apartments is primarily driven by general economic conditions in our markets and is particularly correlated to job growth, population growth, household formation, in-migration and housing affordability over the long term. We continue to monitor pressures surrounding housing supply, inflation trends and general economic conditions. A worsening of the current environment could contribute to uncertain rent collections going forward, suppress demand for apartments and could drive lower rent growth on new leases and renewals than what we achieved in the three and nine months ended September 30, 2025. New supply delivering into several of our markets continues to be absorbed in a steady manner as the demand for apartment housing remains solid. We continue to believe that we will continue to see a decline in new apartment deliveries in calendar year 2026.\nAccess to the financial markets remains available for high-credit rated borrowers, such as ourselves. However, overall borrowing costs remain at elevated levels as compared to our in-place fixed rate debt, and we expect this trend to continue. As of September 30, 2025, we had $463.0 million of variable rate debt outstanding under our commercial paper program. Our continued exposure to elevated interest rates will be a result of additional variable rate borrowings and future financing activities.\nResults of Operations\nComparison of the three months ended September 30, 2025 to the three months ended September 30, 2024\nFor the three months ended September 30, 2025, we achieved net income available for MAA common shareholders of $98.6 million, a 13.7% decrease as compared to the three months ended September 30, 2024, and total revenue growth of $3.2 million, representing a 0.6% increase\n \nin property revenues as compared to the three months ended September 30, 2024. The following discussion describes the primary drivers of the decrease in net income available for MAA common shareholders for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024.\nProperty Revenues\nThe following table reflects our property revenues by segment for the three months ended September 30, 2025 and 2024 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree months ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nIncrease (decrease)\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nSame Store\n\n\n \n\n\n$\n\n\n520,861\n\n\n \n\n\n \n\n\n$\n\n\n522,278\n\n\n \n\n\n \n\n\n$\n\n\n(1,417\n\n\n)\n\n\n \n\n\n \n\n\n(0.3\n\n\n)%\n\n\n\n\n\n\nNon-Same Store and Other\n\n\n \n\n\n \n\n\n33,512\n\n\n \n\n\n \n\n\n \n\n\n28,848\n\n\n \n\n\n \n\n\n \n\n\n4,664\n\n\n \n\n\n \n\n\n \n\n\n16.2\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n554,373\n\n\n \n\n\n \n\n\n$\n\n\n551,126\n\n\n \n\n\n \n\n\n$\n\n\n3,247\n\n\n \n\n\n \n\n\n \n\n\n0.6\n\n\n%\n\n\n\n\n \n\n\n31\n\n\n\n\n \n\n\nThe Same Store segment generated a 0.3% decrease in revenues for the three months ended September 30, 2025, primarily the result of average effective rent per unit decrease of 0.4% as compared to the three months ended September 30, 2024. The increase in property revenues from the Non-Same Store and Other segment for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024 was primarily the result of increased revenues from completed units in development communities and recently acquired communities.\n \nProperty Operating Expenses\nProperty operating expenses include costs for property personnel, building repairs and maintenance, real estate taxes, insurance, utilities and other operating expenses. The following table reflects our property operating expenses by segment for the three months ended September 30, 2025 and 2024 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree months ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nIncrease (decrease)\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nSame Store\n\n\n \n\n\n$\n\n\n198,833\n\n\n \n\n\n \n\n\n$\n\n\n194,372\n\n\n \n\n\n \n\n\n$\n\n\n4,461\n\n\n \n\n\n \n\n\n \n\n\n2.3\n\n\n%\n\n\n\n\n\n\nNon-Same Store and Other\n\n\n \n\n\n \n\n\n17,231\n\n\n \n\n\n \n\n\n \n\n\n17,189\n\n\n \n\n\n \n\n\n \n\n\n42\n\n\n \n\n\n \n\n\n \n\n\n0.2\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n216,064\n\n\n \n\n\n \n\n\n$\n\n\n211,561\n\n\n \n\n\n \n\n\n$\n\n\n4,503\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n%\n\n\n\n\nThe increase in property operating expenses for our Same Store segment for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024 was primarily driven by increases in personnel expense of $1.9 million, utilities expense of $1.2 million, and property tax expense of $1.1 million.\n \nThe increase in property operating expenses from the Non-Same Store and Other segment for the three months ended September 30, 2025 as compared to three months ended September 30, 2024 was primarily the result of increased operating expenses from completed development communities and recently acquired communities.\n \nDepreciation and Amortization\nDepreciation and amortization expense for the three months ended September 30, 2025 was $156.7 million, an increase of $9.9 million as compared to the three months ended September 30, 2024. The increase\n \nwas primarily driven by the recognition of depreciation expense associated with our completed development communities, acquisitions and capital spend activities completed after September 30, 2024 in the normal course of business through September 30, 2025.\nOther Income and Expenses\nProperty management expenses for the three months ended September 30, 2025 were $18.2 million, an increase of $0.9 million as compared to the three months ended September 30, 2024. General and administrative expenses for the three months ended September 30, 2025 were $12.5 million, a decrease of $0.2 million as compared to the three months ended September 30, 2024.\n \nInterest expense for the three months ended September 30, 2025 was $46.3 million, an increase of $3.6 million as compared to the three months ended September 30, 2024. The increase was due to an increase in our average outstanding debt balance during the three months ended September 30, 2025 as compared to the three months ended September 30, 2024.\n \n Other non-operating expense (income) for the three months ended September 30, 2025 was $1.3 million of expense, a decrease of $0.4 million as compared to the three months ended September 30, 2024. The expense for the three months ended September 30, 2025 was primarily driven by $8.9 million of accrued legal defense costs, partially offset by $5.4 million of non-cash gain from investments and $2.0 million of non-cash gain related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares. The expense for the three months ended September 30, 2024 was primarily driven by $18.3 million of non-cash loss related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares, partially offset by $11.0 million of gain on the consolidation of a third-party development and $5.7 million of net casualty related recoveries.\n \nComparison of the nine months ended September 30, 2025 to the nine months ended September 30, 2024\nFor the nine months ended September 30, 2025, we achieved net income available for MAA common shareholders of $386.6 million, a 7.9% increase as compared to the nine months ended September 30, 2024, and total revenue growth of $12.4 million, representing a 0.8% increase in property revenues as compared to the nine months ended September 30, 2024. The following discussion describes the primary drivers of the increase in net income available for MAA common shareholders for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024.\n\n\n32\n\n\n\n\n \n\n\nProperty Revenues\nThe following table reflects our property revenues by segment for the nine months ended September 30, 2025 and 2024 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine months ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nIncrease (decrease)\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nSame Store\n\n\n \n\n\n$\n\n\n1,558,641\n\n\n \n\n\n \n\n\n$\n\n\n1,561,231\n\n\n \n\n\n \n\n\n$\n\n\n(2,590\n\n\n)\n\n\n \n\n\n \n\n\n(0.2\n\n\n)%\n\n\n\n\n\n\nNon-Same Store and Other\n\n\n \n\n\n \n\n\n94,929\n\n\n \n\n\n \n\n\n \n\n\n79,952\n\n\n \n\n\n \n\n\n \n\n\n14,977\n\n\n \n\n\n \n\n\n \n\n\n18.7\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n1,653,570\n\n\n \n\n\n \n\n\n$\n\n\n1,641,183\n\n\n \n\n\n \n\n\n$\n\n\n12,387\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n%\n\n\n\n\nThe Same Store segment generated a 0.2% decrease in revenues for the nine months ended September 30, 2025, primarily the result of average effective rent per unit decrease of 0.5% as compared to the nine months ended September 30, 2024. The increase in property revenues from the Non-Same Store and Other segment for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024 was primarily the result of increased revenues from completed units in development communities and recently acquired communities.\n \nProperty Operating Expenses\nProperty operating expenses include costs for property personnel, building repairs and maintenance, real estate taxes, insurance, utilities and other operating expenses. The following table reflects our property operating expenses by segment for the nine months ended September 30, 2025 and 2024 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine months ended September 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nIncrease (decrease)\n\n\n \n\n\n \n\n\n% Change\n\n\n \n\n\n\n\n\n\nSame Store\n\n\n \n\n\n$\n\n\n584,206\n\n\n \n\n\n \n\n\n$\n\n\n570,371\n\n\n \n\n\n \n\n\n$\n\n\n13,835\n\n\n \n\n\n \n\n\n \n\n\n2.4\n\n\n%\n\n\n\n\n\n\nNon-Same Store and Other\n\n\n \n\n\n \n\n\n47,865\n\n\n \n\n\n \n\n\n \n\n\n44,788\n\n\n \n\n\n \n\n\n \n\n\n3,077\n\n\n \n\n\n \n\n\n \n\n\n6.9\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n632,071\n\n\n \n\n\n \n\n\n$\n\n\n615,159\n\n\n \n\n\n \n\n\n$\n\n\n16,912\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n%\n\n\n\n\nThe increase in property operating expenses for our Same Store segment for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024 was primarily driven by increases in personnel expense of $6.0 million, utilities expense of $4.4 million, building repair and maintenance expense of $2.4 million, office operations expense of $1.9 million, and marketing expense of $1.4 million, partially offset by a decrease in property tax expense of $2.4 million. The increase in property operating expenses from the Non-Same Store and Other segment for the nine months ended September 30, 2025 as compared to nine months ended September 30, 2024 was primarily the result of increased operating expenses from completed development communities and recently acquired communities.\n \nDepreciation and Amortization\nDepreciation and amortization expense for the nine months ended September 30, 2025 was $462.5 million, an increase of $27.8 million as compared to the nine months ended September 30, 2024. The increase was primarily driven by the recognition of depreciation expense associated with our completed development communities, acquisitions and capital spend activities completed after September 30, 2024 in the normal course of business through September 30, 2025.\nOther Income and Expenses\nProperty management expenses for the nine months ended September 30, 2025 were $56.3 million, an increase of $1.8 million as compared to the nine months ended September 30, 2024. General and administrative expenses for the nine months ended September 30, 2025 were $41.0 million, a decrease of $1.5 million as compared to the nine months ended September 30, 2024.\n \nInterest expense for the nine months ended September 30, 2025 was $136.5 million, an increase of $12.2 million as compared to the nine months ended September 30, 2024. The increase was due to an increase in our average outstanding debt balance and an increase of 11 basis points in our effective interest rate, partially offset by an increase in capitalized interest during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024.\n \n Other non-operating expense (income) for the nine months ended September 30, 2025 was $4.3 million of income, an increase of $1.7 million as compared to the nine months ended September 30, 2024. The income for the nine months ended September 30, 2025 was primarily driven by $5.8 million of non-cash gain from investments, $3.7 million of net casualty related recoveries, and $3.3 million of non-cash gain related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares, partially offset by $8.9 million of accrued legal defense costs.\n \nThe income for the nine months ended September 30, 2024 was primarily driven by $11.0 million of gain on the consolidation of a third-party development, $9.7 million of net casualty related recoveries and $3.7 million of non-cash gain from investments, partially offset by $14.5 million of non-cash loss related to the fair value adjustment of the embedded derivative in the MAA Series I preferred shares and $8.0 million of accrued legal defense costs.\n\n\n33\n\n\n\n\n \n\n\nNon-GAAP Financial Measures\nFunds from Operations and Core Funds from Operations\nFunds from operations, or FFO, a non-GAAP financial measure, represents net income available for MAA common shareholders (computed in accordance with U.S. generally accepted accounting principles, or GAAP) excluding gains or losses on disposition of operating properties, asset impairment and gain on consolidation of third-party development, plus depreciation and amortization of real estate assets, net income attributable to noncontrolling interests and adjustments for joint ventures. Because net income attributable to noncontrolling interests is added back, FFO, when used in this Quarterly Report on Form 10-Q, represents FFO attributable to common shareholders and unitholders.\n \nFFO should not be considered as an alternative to net income available for MAA common shareholders, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity. Management believes that FFO is helpful to investors in understanding our operating performance, primarily because its calculation excludes depreciation and amortization expense on real estate assets and gain on sale of depreciable real estate assets. We believe that GAAP historical cost depreciation of real estate assets is generally not correlated with changes in the value of those assets, whose value does not diminish predictably over time, as historical cost depreciation implies. While our calculation of FFO is in accordance with the National Association of Real Estate Investment Trusts’, or NAREIT’s, definition, it may differ from the methodology for calculating FFO utilized by other REITs and, accordingly, may not be comparable to such other REITs.\nCore FFO represents FFO as adjusted for items that are not considered part of our core business operations such as adjustments related to the fair value of the embedded derivative in the MAA Series I preferred shares; gain or loss on sale of non-depreciable assets; gain or loss on investments, net of tax; casualty related (recoveries) and charges, net; gain or loss on debt extinguishment; legal costs, settlements and (recoveries), net, and mark-to-market debt adjustments. Because net income attributable to noncontrolling interests is added back to FFO, Core FFO, when used in this Quarterly Report on Form 10-Q, represents Core FFO attributable to common shareholders and unitholders.\n \nCore FFO should not be considered as an alternative to net income available for MAA common shareholders, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity. Management believes that Core FFO is helpful in understanding our core operating performance between periods in that it removes certain items that by their nature are not comparable over periods and therefore tend to obscure actual operating performance from rental activities. While our definition of Core FFO may be similar to others in the industry, our methodology for calculating Core FFO may differ from that utilized by other REITs and, accordingly, may not be comparable to such other REITs.\n\n\n34\n\n\n\n\n \n\n\nThe following table presents a reconciliation of net income available for MAA common shareholders to FFO attributable to common shareholders and unitholders and Core FFO attributable to common shareholders and unitholders for the three and nine months ended September 30, 2025 and 2024, as we believe net income available for MAA common shareholders is the most directly comparable GAAP measure (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree months ended September 30,\n\n\n \n\n\n \n\n\nNine months ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet income available for MAA common shareholders\n\n\n \n\n\n$\n\n\n98,616\n\n\n \n\n\n \n\n\n$\n\n\n114,273\n\n\n \n\n\n \n\n\n$\n\n\n386,572\n\n\n \n\n\n \n\n\n$\n\n\n358,131\n\n\n \n\n\n\n\n\n\nDepreciation and amortization of real estate assets\n\n\n \n\n\n \n\n\n155,267\n\n\n \n\n\n \n\n\n \n\n\n145,256\n\n\n \n\n\n \n\n\n \n\n\n458,407\n\n\n \n\n\n \n\n\n \n\n\n430,470\n\n\n \n\n\n\n\n\n\n(Gain) loss on sale of depreciable real estate assets\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(71,842\n\n\n)\n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n\n\n\n\nMAA’s share of depreciation and amortization of real estate assets of real estate joint venture\n\n\n \n\n\n \n\n\n168\n\n\n \n\n\n \n\n\n \n\n\n157\n\n\n \n\n\n \n\n\n \n\n\n499\n\n\n \n\n\n \n\n\n \n\n\n466\n\n\n \n\n\n\n\n\n\nGain on consolidation of third-party development \n(1)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(11,033\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(11,033\n\n\n)\n\n\n\n\n\n\nNet income attributable to noncontrolling interests\n\n\n \n\n\n \n\n\n2,506\n\n\n \n\n\n \n\n\n \n\n\n3,035\n\n\n \n\n\n \n\n\n \n\n\n9,987\n\n\n \n\n\n \n\n\n \n\n\n9,605\n\n\n \n\n\n\n\n\n\nFFO attributable to common shareholders and unitholders\n\n\n \n\n\n \n\n\n256,557\n\n\n \n\n\n \n\n\n \n\n\n251,688\n\n\n \n\n\n \n\n\n \n\n\n783,623\n\n\n \n\n\n \n\n\n \n\n\n787,664\n\n\n \n\n\n\n\n\n\n(Gain) loss on embedded derivative in preferred shares \n(1)\n\n\n \n\n\n \n\n\n(2,009\n\n\n)\n\n\n \n\n\n \n\n\n18,257\n\n\n \n\n\n \n\n\n \n\n\n(3,292\n\n\n)\n\n\n \n\n\n \n\n\n14,451\n\n\n \n\n\n\n\n\n\n(Gain) loss on investments, net of tax \n(1) (2)\n\n\n \n\n\n \n\n\n(4,396\n\n\n)\n\n\n \n\n\n \n\n\n533\n\n\n \n\n\n \n\n\n \n\n\n(4,733\n\n\n)\n\n\n \n\n\n \n\n\n(2,873\n\n\n)\n\n\n\n\n\n\nCasualty related (recoveries) and charges, net \n(1)\n\n\n \n\n\n \n\n\n(127\n\n\n)\n\n\n \n\n\n \n\n\n(5,714\n\n\n)\n\n\n \n\n\n \n\n\n(3,695\n\n\n)\n\n\n \n\n\n \n\n\n(9,664\n\n\n)\n\n\n\n\n\n\nLegal costs, settlements and (recoveries), net \n(1) (3)\n\n\n \n\n\n \n\n\n8,908\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8,908\n\n\n \n\n\n \n\n\n \n\n\n8,000\n\n\n \n\n\n\n\n\n\nCore FFO attributable to common shareholders and unitholders\n\n\n \n\n\n$\n\n\n258,933\n\n\n \n\n\n \n\n\n$\n\n\n264,764\n\n\n \n\n\n \n\n\n$\n\n\n780,811\n\n\n \n\n\n \n\n\n$\n\n\n797,578\n\n\n \n\n\n\n\n(1)\nIncluded in “Other non-operating expense (income)” in the Condensed Consolidated Statements of Operations. \n(2)\nFor the three and nine months ended September 30, 2025 and the nine months ended September 30, 2024, gain on investments is presented net of tax expense of $1.0 million, $1.0 million and $0.8 million, respectively. For the three months ended September 30, 2024, loss on investments is presented net of tax benefit of $0.1 million.\n(3)\nFor the three and nine months ended September 30, 2025 and the nine months ended September 30, 2024, we recognized $8.9 million, $8.9 million and $8.0 million, respectively, of accrued legal defense costs that are expected to be incurred through July 2027.  \nCore FFO attributable to common shareholders and unitholders for the three months ended September 30, 2025 was $258.9 million, a decrease of $5.8 million as compared to the three months ended September 30, 2024, primarily as a result of increases in property operating expenses, excluding depreciation and amortization, of $4.5 million, interest expenses of $3.6 million, and property management expenses of $0.9 million, partially offset by an increase in property revenues of $3.2 million.\n \n \nCore FFO attributable to common shareholders and unitholders for the nine months ended September 30, 2025 was $780.8 million, a decrease of $16.8 million as compared to the nine months ended September 30, 2024, primarily as a result of increases in property operating expenses, excluding depreciation and amortization, of $16.9 million, interest expenses of $12.2 million, and property management expenses of $1.8 million, partially offset by an increase in property revenues of $12.4 million and a decrease in general and administrative expenses of $1.5 million.\n \nNet Debt, EBITDA, EBITDAre, and Adjusted EBITDAre\nNet debt, a non-GAAP financial measure, represents unsecured notes payable, net and secured notes payable, net less cash and cash equivalents and 1031(b) exchange proceeds included in restricted cash. Management considers net debt a helpful tool in evaluating our debt position. Net debt should not be considered as an alternative to any GAAP measurement as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity.\nEarnings before interest, taxes, depreciation and amortization, or EBITDA, a non-GAAP financial measure, represents net income (computed in accordance with GAAP) plus depreciation and amortization, interest expense, and income taxes. As an owner and operator of real estate, management considers EBITDA to be an important measure of performance from core operations because EBITDA excludes various expense items that are not indicative of operating performance. EBITDA should not be considered as an alternative to net income, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity.\n \nEBITDA\nre\n is composed of EBITDA adjusted for the gain or loss on sale of depreciable assets, gain on consolidation of third-party development and adjustments to reflect our share of EBITDA\nre\n of an unconsolidated affiliate. As an owner and operator of real estate, management considers EBITDA\nre\n to be an important measure of performance from core operations because EBITDA\nre\n excludes various expense items that are not indicative of operating performance. While our definition of EBITDA\nre\n is in accordance with NAREIT’s definition, it may differ from the methodology utilized by other REITs to calculate EBITDA\nre\n and, accordingly, may not be comparable to such other REITs. EBITDA\nre\n should not be considered as an alternative to net income, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity.\n \n\n\n35\n\n\n\n\n \n\n\nAdjusted EBITDA\nre\n is comprised of EBITDA\nre\n further adjusted for items that are not considered part of our core operations such as adjustments related to the fair value of the embedded derivative in the MAA Series I preferred shares; gain or loss on sale of non-depreciable assets; gain or loss on investments; casualty related (recoveries) and charges, net; gain or loss on debt extinguishment; and legal costs, settlements and (recoveries), net. As an owner and operator of real estate, management considers Adjusted EBITDA\nre\n to be an important measure of performance from core operations because Adjusted EBITDA\nre\n excludes various income and expense items that are not indicative of operating performance. Our computation of Adjusted EBITDA\nre\n may differ from the methodology utilized by other REITs to calculate Adjusted EBITDA\nre\n. Adjusted EBITDA\nre\n should not be considered as an alternative to net income, or any other GAAP measurement, as an indicator of operating performance or as an alternative to cash flow from operating, investing and financing activities as a measure of liquidity.\n \nManagement monitors its debt levels to a ratio of net debt to Adjusted EBITDA\nre\n in order to maintain our investment grade credit ratings. We believe this is an important factor in the management of our debt levels to maintain an optimal capital structure, and it is also considered in the assignment of our credit ratings. Adjusted EBITDA\nre\n is measured on a trailing twelve-month basis.\n \nThe following table presents a reconciliation of unsecured notes payable, net and secured notes payable, net to net debt as of September 30, 2025 and December 31, 2024, as we believe unsecured notes payable, net and secured notes payable, net, combined, is the most directly comparable GAAP measure (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30, 2025\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\nUnsecured notes payable, net\n\n\n \n\n\n$\n\n\n4,836,998\n\n\n \n\n\n \n\n\n$\n\n\n4,620,690\n\n\n \n\n\n\n\n\n\nSecured notes payable, net\n\n\n \n\n\n \n\n\n360,361\n\n\n \n\n\n \n\n\n \n\n\n360,267\n\n\n \n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n \n\n\n5,197,359\n\n\n \n\n\n \n\n\n \n\n\n4,980,957\n\n\n \n\n\n\n\n\n\nCash and cash equivalents\n\n\n \n\n\n \n\n\n(32,249\n\n\n)\n\n\n \n\n\n \n\n\n(43,018\n\n\n)\n\n\n\n\n\n\nNet debt\n\n\n \n\n\n$\n\n\n5,165,110\n\n\n \n\n\n \n\n\n$\n\n\n4,937,939\n\n\n \n\n\n\n\nThe following table presents a reconciliation of net income to EBITDA, EBITDA\nre\n and Adjusted EBITDA\nre\n for the trailing twelve months ended September 30, 2025 and December 31, 2024, as we believe net income is the most directly comparable GAAP measure (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nTwelve Months Ended\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30, 2025\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n$\n\n\n570,399\n\n\n \n\n\n \n\n\n$\n\n\n541,576\n\n\n \n\n\n\n\n\n\nDepreciation and amortization\n\n\n \n\n\n \n\n\n613,373\n\n\n \n\n\n \n\n\n \n\n\n585,616\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n180,741\n\n\n \n\n\n \n\n\n \n\n\n168,544\n\n\n \n\n\n\n\n\n\nIncome tax expense\n\n\n \n\n\n \n\n\n5,159\n\n\n \n\n\n \n\n\n \n\n\n5,240\n\n\n \n\n\n\n\n\n\nEBITDA\n\n\n \n\n\n \n\n\n1,369,672\n\n\n \n\n\n \n\n\n \n\n\n1,300,976\n\n\n \n\n\n\n\n\n\nGain on sale of depreciable real estate assets\n\n\n \n\n\n \n\n\n(126,870\n\n\n)\n\n\n \n\n\n \n\n\n(55,003\n\n\n)\n\n\n\n\n\n\nGain on consolidation of third-party development \n(1)\n\n\n \n\n\n \n\n\n(206\n\n\n)\n\n\n \n\n\n \n\n\n(11,239\n\n\n)\n\n\n\n\n\n\nAdjustments to reflect the Company’s share of EBITDA\nre\n of an unconsolidated affiliate\n\n\n \n\n\n \n\n\n1,395\n\n\n \n\n\n \n\n\n \n\n\n1,363\n\n\n \n\n\n\n\n\n\nEBITDA\nre\n\n\n \n\n\n \n\n\n1,243,991\n\n\n \n\n\n \n\n\n \n\n\n1,236,097\n\n\n \n\n\n\n\n\n\nLoss on embedded derivative in preferred shares \n(1)\n\n\n \n\n\n \n\n\n1,008\n\n\n \n\n\n \n\n\n \n\n\n18,751\n\n\n \n\n\n\n\n\n\nGain on investments \n(1)\n\n\n \n\n\n \n\n\n(9,913\n\n\n)\n\n\n \n\n\n \n\n\n(7,809\n\n\n)\n\n\n\n\n\n\nCasualty related (recoveries) and charges, net \n(1)\n\n\n \n\n\n \n\n\n(3,357\n\n\n)\n\n\n \n\n\n \n\n\n(9,326\n\n\n)\n\n\n\n\n\n\nLegal costs, settlements and (recoveries), net \n(1) (2)\n\n\n \n\n\n \n\n\n10,345\n\n\n \n\n\n \n\n\n \n\n\n9,437\n\n\n \n\n\n\n\n\n\nAdjusted EBITDA\nre\n\n\n \n\n\n$\n\n\n1,242,074\n\n\n \n\n\n \n\n\n$\n\n\n1,247,150\n\n\n \n\n\n\n\n(1)\nIncluded in “Other non-operating expense (income)” in the Condensed Consolidated Statements of Operations.\n(2)\nFor the trailing twelve months ended September 30, 2025 and December 31, 2024, in accordance with our accounting policies, we recognized $8.9 million and $8.0 million, respectively, of accrued legal defense costs that are expected to be incurred through July 2027.\nOur net debt to Adjusted EBITDA\nre\n ratio as of September 30, 2025 was 4.2x, as compared to a ratio of 4.0x as of December 31, 2024. Adjusted EBITDA\nre\n decreased $5.1 million for the trailing twelve months ended September 30, 2025 as compared to the trailing twelve months ended December 31, 2024, while net debt increased $227.2 million as of September 30, 2025 as compared to December 31, 2024. The decrease in Adjusted EBITDA\nre\n was primarily due to increases in property operating expenses, excluding depreciation and amortization, and property management expenses, partially offset by an increase in property revenues and a decrease in general and administrative expenses, while the increase in net debt was primarily due to an increase in unsecured notes payable, net, and a decrease in cash and cash equivalents. The increase in unsecured notes payable, net was primarily driven by an increase in cash requirements to fund acquisition and development activities.\n\n\n36\n\n\n\n\n \n\n\nLiquidity and Capital Resources\nOur cash flows from operating, investing and financing activities, as well as general economic and market conditions, are the principal factors affecting our liquidity and capital resources.\nWe expect that our primary uses of cash will be to fund our ongoing operating needs, to fund our ongoing capital spending requirements, which relate primarily to our development, redevelopment and property repositioning activities, to repay maturing borrowings, to fund the future acquisition of assets and to pay shareholder dividends. We expect to meet our cash requirements through net cash flows from operating activities, existing unrestricted cash and cash equivalents, borrowings under our commercial paper program and our revolving credit facility, the future issuance of debt and equity and the future disposition of assets.\nWe historically have had positive net cash flows from operating activities. We believe that future net cash flows generated from operating activities, existing unrestricted cash and cash equivalents, borrowing capacity under our current commercial paper program and revolving credit facility, and our ability to issue debt and equity will provide sufficient liquidity to fund the cash requirements for our business over the next 12 months and the foreseeable future.\nAs of September 30, 2025, we had $814.7 million of combined unrestricted cash and cash equivalents and available capacity under our revolving credit facility.\n \nCash Flows from Operating Activities\nNet cash provided by operating activities was $816.5 million for the nine months ended September 30, 2025, a decrease of $42.7 million as compared to the nine months ended September 30, 2024. The decrease in operating cash flows was primarily driven by the timing of cash payments.\nCash Flows from Investing Activities\nNet cash used in investing activities was $492.7 million for the nine months ended September 30, 2025, a decrease of $158.9 million as compared to the nine months ended September 30, 2024. The primary drivers of the change were as follows (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPrimary drivers of cash (outflow) inflow\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nduring the nine months ended September 30,\n\n\n \n\n\n \n\n\nIncrease (Decrease)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nin Net Cash\n\n\n \n\n\n\n\n\n\nPurchases of real estate and other assets\n\n\n \n\n\n$\n\n\n(104,880\n\n\n)\n\n\n \n\n\n$\n\n\n(189,104\n\n\n)\n\n\n \n\n\n$\n\n\n84,224\n\n\n \n\n\n\n\n\n\nCapital improvements and other\n\n\n \n\n\n \n\n\n(257,163\n\n\n)\n\n\n \n\n\n \n\n\n(235,856\n\n\n)\n\n\n \n\n\n \n\n\n(21,307\n\n\n)\n\n\n\n\n\n\nDevelopment costs\n\n\n \n\n\n \n\n\n(207,295\n\n\n)\n\n\n \n\n\n \n\n\n(255,216\n\n\n)\n\n\n \n\n\n \n\n\n47,921\n\n\n \n\n\n\n\n\n\nContributions to affiliates\n\n\n \n\n\n \n\n\n(8,175\n\n\n)\n\n\n \n\n\n \n\n\n(1,874\n\n\n)\n\n\n \n\n\n \n\n\n(6,301\n\n\n)\n\n\n\n\n\n\nProceeds from sale of marketable equity securities\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n9,975\n\n\n \n\n\n \n\n\n \n\n\n(9,975\n\n\n)\n\n\n\n\n\n\nProceeds from real estate asset dispositions\n\n\n \n\n\n \n\n\n81,128\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n81,128\n\n\n \n\n\n\n\n\n\nNet proceeds from insurance recoveries\n\n\n \n\n\n \n\n\n3,692\n\n\n \n\n\n \n\n\n \n\n\n20,203\n\n\n \n\n\n \n\n\n \n\n\n(16,511\n\n\n)\n\n\n\n\nThe decrease in cash outflows for purchases of real estate and other assets was driven by the number of the real estate assets acquired during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. We acquired one apartment community and one land parcel during the nine months ended September 30, 2025 while we acquired two apartment communities and two land parcels during the nine months ended September 30, 2024. The increase in cash outflows for capital improvements and other was primarily driven by increased capital spend relating to our property redevelopment and repositioning activities during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The decrease in cash outflows for development costs was primarily driven by decreased development activity during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The increase in cash outflows for contributions to affiliates was driven by a larger amount of investments made in the technology-focused limited partnerships during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024. The decrease in cash inflows from proceeds from sale of marketable equity securities resulted from no marketable equity securities being sold during the nine months ended September 30, 2025 as compared to the sale of marketable equity securities during the nine months ended September 30, 2024. The increase in cash inflows from proceeds from real estate asset dispositions resulted from the dispositions of two multifamily communities during the nine months ended September 30, 2025 as compared to no dispositions of real estate assets during the nine months ended September 30, 2024. The decrease in cash inflows from net proceeds from insurance recoveries was driven by decreased insurance reimbursements received for storm-related casualty claims during the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024.\n \n\n\n37\n\n\n\n\n \n\n\nCash Flows from Financing Activities\nNet cash used in financing activities was $334.6 million for the nine months ended September 30, 2025, an increase of $136.0 million as compared to the nine months ended September 30, 2024. The primary drivers of the change were as follows (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPrimary drivers of cash inflow (outflow)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nduring the nine months ended September 30,\n\n\n \n\n\n \n\n\nIncrease (Decrease)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nin Net Cash\n\n\n \n\n\n\n\n\n\nNet proceeds from (payments of) commercial paper\n\n\n \n\n\n$\n\n\n213,000\n\n\n \n\n\n \n\n\n$\n\n\n(5,000\n\n\n)\n\n\n \n\n\n$\n\n\n218,000\n\n\n \n\n\n\n\n\n\nProceeds from notes payable\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n744,551\n\n\n \n\n\n \n\n\n \n\n\n(744,551\n\n\n)\n\n\n\n\n\n\nPrincipal payments on notes payable\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(400,000\n\n\n)\n\n\n \n\n\n \n\n\n400,000\n\n\n \n\n\n\n\n\n\nPayment of deferred financing costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(7,150\n\n\n)\n\n\n \n\n\n \n\n\n7,150\n\n\n \n\n\n\n\n\n\nDividends paid on common shares\n\n\n \n\n\n \n\n\n(531,645\n\n\n)\n\n\n \n\n\n \n\n\n(515,085\n\n\n)\n\n\n \n\n\n \n\n\n(16,560\n\n\n)\n\n\n\n\nThe increase in cash inflows related to net proceeds from (payments of) commercial paper was driven by the increase in net borrowings of $213.0 million on our commercial paper program during the nine months ended September 30, 2025 as compared to the decrease in net borrowings of $5.0 million on our commercial paper program during the nine months ended September 30, 2024. The decrease in cash inflows from proceeds from notes payable resulted from no issuance of unsecured senior notes during the nine months ended September 30, 2025 as compared to the issuance of $750.0 million of unsecured senior notes during the nine months ended September 30, 2024. The decrease in cash outflows related to principal payments on notes payable resulted from no retirement of unsecured senior notes during the nine months ended September 30, 2025 as compared to the retirement of $400.0 million of unsecured senior notes during the during the nine months ended September 30, 2024. The decrease in cash outflows related to payment of deferred financing costs resulted from no payments of deferred financing costs during the nine months ended September 30, 2025 as compared to the closing costs of $7.2 million related to the issuance of $750.0 million of unsecured senior notes during the nine months ended September 30, 2024. The increase in cash outflows from dividends paid on common shares primarily resulted from the increase in the dividend rate to $4.5450 per share during the nine months ended September 30, 2025 as compared to the dividend rate of $4.4100 per share during the nine months ended September 30, 2024.\n \nDebt\nThe following schedule reflects our outstanding debt as of September 30, 2025 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nPrincipal Balance\n\n\n \n\n\n \n\n\nAverage Years to Rate Maturity\n\n\n \n\n\n \n\n\nWeighted Average Effective Rate\n\n\n \n\n\n\n\n\n\nUnsecured debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFixed rate senior notes\n\n\n \n\n\n$\n\n\n4,400,000\n\n\n \n\n\n \n\n\n \n\n\n5.6\n\n\n \n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\nVariable rate commercial paper program\n\n\n \n\n\n \n\n\n463,000\n\n\n \n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n%\n\n\n\n\n\n\nDebt issuance costs, discounts and premiums\n\n\n \n\n\n \n\n\n(26,002\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal unsecured debt\n\n\n \n\n\n$\n\n\n4,836,998\n\n\n \n\n\n \n\n\n \n\n\n5.0\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n\n\nSecured debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFixed rate property mortgages\n\n\n \n\n\n$\n\n\n363,293\n\n\n \n\n\n \n\n\n \n\n\n23.3\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n%\n\n\n\n\n\n\nDebt issuance costs\n\n\n \n\n\n \n\n\n(2,932\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal secured debt\n\n\n \n\n\n$\n\n\n360,361\n\n\n \n\n\n \n\n\n \n\n\n23.3\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n%\n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n$\n\n\n5,197,359\n\n\n \n\n\n \n\n\n \n\n\n6.3\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\n \n\n\n38\n\n\n\n\n \n\n\nThe following schedule presents the contractual maturity dates of our outstanding debt, net of debt issuance costs, discounts and premiums, as of September 30, 2025 (dollars in thousands):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nCommercial Paper\n⁽¹⁾\n & Revolving Credit Facility\n⁽²⁾\n\n\n \n\n\n \n\n\nSenior Notes\n\n\n \n\n\n \n\n\nProperty Mortgages\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n463,000\n\n\n \n\n\n \n\n\n$\n\n\n399,934\n\n\n \n\n\n \n\n\n$\n\n\n—\n\n\n \n\n\n \n\n\n$\n\n\n862,934\n\n\n \n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n299,323\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n299,323\n\n\n \n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n598,710\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n598,710\n\n\n \n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n398,367\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n398,367\n\n\n \n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n555,214\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n555,214\n\n\n \n\n\n\n\n\n\n2030\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n298,487\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n298,487\n\n\n \n\n\n\n\n\n\n2031\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n446,795\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n446,795\n\n\n \n\n\n\n\n\n\n2032\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n395,241\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n395,241\n\n\n \n\n\n\n\n\n\n2033\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2034\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n344,306\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n344,306\n\n\n \n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n637,621\n\n\n \n\n\n \n\n\n \n\n\n360,361\n\n\n \n\n\n \n\n\n \n\n\n997,982\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n463,000\n\n\n \n\n\n \n\n\n$\n\n\n4,373,998\n\n\n \n\n\n \n\n\n$\n\n\n360,361\n\n\n \n\n\n \n\n\n$\n\n\n5,197,359\n\n\n \n\n\n\n\n(1)\nThere was $463.0 million outstanding under MAALP’s unsecured commercial paper program as of September 30, 2025. Under the terms of the program, MAALP may issue up to a maximum aggregate amount outstanding at any time of $625.0 million. For the three months ended September 30, 2025, the average daily borrowings outstanding under the commercial paper program were $361.8 million.\n(2)\nThere were no borrowings outstanding under MAALP’s $1.25 billion unsecured revolving credit facility as of September 30, 2025.\nThe following schedule reflects the maturities and average effective interest rates of our outstanding fixed rate debt, net of debt issuance costs, discounts and premiums, as of September 30, 2025 (dollars in thousands):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nFixed Rate Debt\n\n\n \n\n\n \n\n\nAverage Effective Rate\n\n\n \n\n\n\n\n\n\n2025\n\n\n \n\n\n$\n\n\n399,934\n\n\n \n\n\n \n\n\n \n\n\n4.2\n\n\n%\n\n\n\n\n\n\n2026\n\n\n \n\n\n \n\n\n299,323\n\n\n \n\n\n \n\n\n \n\n\n1.2\n\n\n%\n\n\n\n\n\n\n2027\n\n\n \n\n\n \n\n\n598,710\n\n\n \n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\n2028\n\n\n \n\n\n \n\n\n398,367\n\n\n \n\n\n \n\n\n \n\n\n4.2\n\n\n%\n\n\n\n\n\n\n2029\n\n\n \n\n\n \n\n\n555,214\n\n\n \n\n\n \n\n\n \n\n\n3.7\n\n\n%\n\n\n\n\n\n\n2030\n\n\n \n\n\n \n\n\n298,487\n\n\n \n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n\n\n2031\n\n\n \n\n\n \n\n\n446,795\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n%\n\n\n\n\n\n\n2032\n\n\n \n\n\n \n\n\n395,241\n\n\n \n\n\n \n\n\n \n\n\n5.4\n\n\n%\n\n\n\n\n\n\n2033\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n2034\n\n\n \n\n\n \n\n\n344,306\n\n\n \n\n\n \n\n\n \n\n\n5.1\n\n\n%\n\n\n\n\n\n\nThereafter\n\n\n \n\n\n \n\n\n997,982\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n4,734,359\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n%\n\n\n\n\nUnsecured Revolving Credit Facility & Commercial Paper\nAs of September 30, 2025, MAALP had an unsecured revolving credit facility with a borrowing capacity of $1.25 billion and an option to expand to $2.0 billion. The revolving credit facility bore an interest rate at a rate based on the adjusted Secured Overnight Financing Rate plus a spread of 0.70% to 1.40% determined by a credit ratings grid. The revolving credit facility was scheduled to mature in October 2026 with an option to extend for two additional six-month periods. In October 2025, MAALP amended its unsecured revolving credit facility, increasing its borrowing capacity to $1.5 billion with an option to expand to $2.0 billion. The amended revolving credit facility has a maturity date of January 2030 with two six-month extension options and bears interest at a rate based on the Secured Overnight Financing Rate plus a spread ranging from 0.65% to 1.40% determined by a credit ratings grid, with the current spread at 0.725% based on MAALP’s current credit rating.\nAs of September 30, 2025, there was no outstanding balance under the revolving credit facility, while $4.5 million of capacity was used to support outstanding letters of credit.\n \nAs of September 30, 2025, MAALP had an unsecured commercial paper program, whereby it issued unsecured commercial paper notes with varying maturities not to exceed 397 days up to a maximum aggregate principal amount outstanding of $625.0 million. As of September 30, 2025, MAALP had $463.0 million of borrowings outstanding under the commercial paper program. In October 2025, MAALP amended its commercial paper program to increase the maximum aggregate principal amount of notes that may be outstanding under the program from $625.0 million to $750.0 million.\nUnsecured Senior Notes\nAs of September 30, 2025, MAALP had $4.4 billion of publicly issued unsecured senior notes outstanding.\n \n\n\n39\n\n\n\n\n \n\n\nSecured Property Mortgages\nMAALP maintains secured property mortgages with various life insurance companies. As of September 30, 2025, MAALP had $363.3 million of secured property mortgages outstanding.\nFor more information regarding our debt capital resources, see Note 6 to the condensed consolidated financial statements included in this Quarterly Report on Form 10-Q.\nEquity\nAs of September 30, 2025, MAA owned 117,081,742 OP Units, representing a 97.5% limited partnership interest in MAALP, while the remaining 2,941,839 outstanding OP Units were held by limited partners of MAALP other than MAA. Holders of OP Units (other than MAA) may require us to redeem their OP Units from time to time, in which case we may, at our option, pay the redemption price either in cash (in an amount per OP Unit equal, in general, to the average closing price of MAA’s common stock on the NYSE over a specified period prior to the redemption date) or by delivering one share of MAA’s common stock (subject to adjustment under specified circumstances) for each OP Unit so redeemed. MAA has registered under the Securities Act the 2,941,839 shares of its common stock that, as of September 30, 2025, were issuable upon redemption of OP Units, in order for those shares to be sold freely in the public markets.\nMAA has entered into an at-the-market equity offering program, or ATM program, enabling MAA to sell shares of its common stock into the existing market at current market prices from time to time to or through the sales agents under the ATM program. Pursuant to the ATM program, MAA from time to time may also enter into forward sale agreements and sell shares of its common stock pursuant to these agreements. Through the ATM program, MAA may issue up to an aggregate of 4.0 million shares of its common stock at such times as determined by MAA.\n \nMAA has no obligation to issue shares through the ATM program. During the three and nine months ended September 30, 2025 and 2024, MAA did not sell any shares of common stock under its ATM program. As of September 30, 2025, 4.0 million shares of MAA’s common stock remained issuable under the ATM program.\nFor more information regarding our equity capital resources, see Note 8 and Note 9 to the condensed consolidated financial statements included in this Quarterly Report on Form 10-Q.\n \nMaterial Cash Requirements\n \nAs of September 30, 2025, we had $894.2 million of outstanding debt and debt service obligations payable in the year ending December 31, 2025, including the $463.0 million of commercial paper borrowings due October 2025, the $400.0 million of publicly issued unsecured senior notes maturing in November 2025, and the $31.2 million of interest payments on fixed rate debt obligations in the year ending December 31, 2025. For a schedule of the maturity dates of our outstanding debt beyond 2025, see the “Liquidity and Capital Resources - Debt” section above. As of September 30, 2025, we also had obligations to make additional capital contributions to five technology-focused limited partnerships in which we hold equity interests. The capital contributions may be called by the general partners at any time after giving appropriate notice. As of September 30, 2025, we had committed to make additional capital contributions totaling up to $22.4 million if and when called by the general partners of the limited partnerships.\nWe have other material cash requirements that do not represent contractual obligations, but that we expect to incur in the ordinary course of our business.\nAs of September 30, 2025, we had seven development communities under construction totaling 2,242 apartment units once complete. Total expected costs for the seven development projects are $797.0 million, of which $543.2 million had been incurred through September 30, 2025. In addition, our property redevelopment and repositioning activities are ongoing, and we incur expenditures relating to recurring capital replacements, which typically include scheduled carpet replacement, new roofs, HVAC units, plumbing, concrete, masonry and other paving, pools and various exterior building improvements. For the year ending December 31, 2025, we expect that our total capital expenditures relating to our development activities, our property redevelopment and repositioning activities and recurring capital replacements will be in line with our total capital expenditures for the year ended December 31, 2024. We expect to have additional development projects in the future.\nWe typically declare cash dividends on MAA’s common stock on a quarterly basis, subject to approval by MAA’s Board of Directors. We expect to pay quarterly dividends at an annual rate of $6.06 per share of MAA common stock during the year ending December 31, 2025. The timing and amount of future dividends will depend on actual cash flows from operations, our financial condition, capital requirements, the annual distribution requirements under the REIT provisions of the Internal Revenue Code of 1986 and other factors as MAA’s Board of Directors deems relevant. MAA’s Board of Directors may modify our dividend policy from time to time.\n \nFor information regarding our material cash requirements as of December 31, 2024, see Item 7 of Part II of our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 7, 2025.\n \n\n\n40\n\n\n\n\n \n\n\nInflation\nOur resident leases at our apartment communities allow for adjustments in the rental rate at the time of renewal, which may enable us to seek rent increases. The majority of our leases are for one year or less. The short-term nature of these leases generally serves to reduce our risk to adverse effects of inflation on our revenue. During the nine months ended September 30, 2025, we experienced inflationary pressures that drove higher operating expenses, primarily in personnel, utilities, building repair and maintenance, and office operations expenses.\n \nCritical Accounting Estimates\n \nPlease refer to our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 7, 2025, for discussions of our critical accounting estimates. During the three months ended September 30, 2025, there were no material changes to these estimates."
}