{
  "source_file": "mar-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business.\nOverview\nWe are a worldwide operator, franchisor, and licensor of hotel, residential, timeshare, and other lodging properties under more than 30 brand names at different price and service points. Consistent with our focus on management, franchising, and licensing, we own or lease very few of our lodging properties (less than one percent of our system). As of year-end 2024, our system included 9,361 properties (1,706,331 rooms) in 144 countries and territories, and we also had nearly 3,800 hotels (over 577,000 rooms) in our development pipeline.\nWe discuss our operations in the following reportable business segments:\n \n(1) U.S. & Canada, (2) Europe, Middle East & Africa (“EMEA”), (3) Greater China, and (4) Asia Pacific excluding China (“APEC”). Our Caribbean & Latin America (“CALA”) operating segment does not meet the applicable accounting criteria for separate disclosure as a reportable business segment, and as such, we include its results in “Unallocated corporate and other.” See Note 14 for more information.\nBrand Portfolio\nWe believe that our brand portfolio offers the most compelling range of brands and lodging offerings in hospitality. Our brands are categorized by style of offering - Classic and Distinctive. Our Classic brands offer time-honored hospitality for the modern traveler, and our Distinctive brands offer memorable experiences with a unique perspective - each of which we group into four quality tiers: Luxury, Premium, Select, and Midscale. Luxury\n \noffers bespoke and superb amenities and services. Premium offers sophisticated and thoughtful amenities and services. Select offers smart and easy amenities and services. Midscale offers limited services and essential amenities at a more affordable price point. Longer stay brands, which are classified under multiple quality tiers, offer amenities that mirror the comforts of home. The following table shows the portfolio of brands owned, operated, and/or licensed by Marriott for properties open at year-end 2024. In 2025, we expect properties to open under additional brand offerings, including our StudioRes\nTM\n brand and our outdoor-focused lodging offerings.\n4\nTable of Contents\n    \n                                    \nThe following table shows the geographic distribution of properties operating under the brands in our portfolio at year-end 2024:\nU.S. & Canada\nEurope\nMiddle East & Africa\nAsia Pacific excluding China\nGreater China\nCaribbean & Latin America\nTotal\nLuxury\nJW Marriott\n®\nProperties\n35\n8\n13\n29\n24\n17\n126\nRooms\n19,269\n2,525\n4,734\n9,399\n9,556\n4,496\n49,979\nThe Ritz-Carlton\n®\nProperties\n43\n13\n16\n24\n18\n9\n123\nRooms\n13,227\n2,820\n4,049\n4,821\n5,158\n2,007\n32,082\nThe Luxury Collection\n® \nProperties\n19\n40\n15\n30\n5\n11\n120\nRooms\n9,903\n5,801\n2,691\n7,125\n1,488\n1,570\n28,578\nW\n \nHotels\n®\nProperties\n26\n11\n6\n11\n11\n8\n73\nRooms\n8,417\n2,271\n2,175\n2,754\n3,905\n1,931\n21,453\nSt. Regis\n®\nProperties\n13\n7\n14\n10\n14\n5\n63\nRooms\n2,669\n887\n3,511\n2,066\n3,659\n675\n13,467\nEDITION\n®\nProperties\n5\n5\n4\n3\n2\n1\n20\nRooms\n1,379\n819\n703\n496\n646\n180\n4,223\nBvlgari\nProperties\n—\n4\n1\n2\n2\n—\n9\nRooms\n—\n332\n121\n157\n201\n—\n811\nPremium\nMarriott\n®\n Hotels\nProperties\n336\n75\n31\n55\n71\n34\n602\nRooms\n131,983\n21,341\n9,976\n16,512\n24,852\n9,174\n213,838\nSheraton\n®\nProperties\n166\n49\n32\n56\n99\n29\n431\nRooms\n64,254\n13,469\n9,513\n16,914\n38,399\n8,091\n150,640\nWestin\n®\nProperties\n136\n18\n8\n39\n31\n15\n247\nRooms\n55,323\n6,074\n2,147\n11,026\n10,370\n4,347\n89,287\nAutograph Collection\n®\nProperties\n162\n87\n17\n23\n4\n39\n332\nRooms\n37,404\n12,024\n2,753\n4,969\n571\n12,777\n70,498\nRenaissance\n®\n Hotels\nProperties\n90\n25\n6\n15\n32\n10\n178\nRooms\n28,315\n5,834\n1,728\n3,806\n11,307\n2,959\n53,949\nLe Méridien\n®\nProperties\n24\n16\n20\n33\n21\n3\n117\nRooms\n5,262\n5,164\n6,490\n7,735\n5,862\n562\n31,075\nDelta Hotels by Marriott\n® \n(Delta Hotels\n®\n)\nProperties\n92\n32\n8\n—\n4\n3\n139\nRooms\n21,817\n5,586\n1,876\n—\n1,529\n561\n31,369\nMGM Collection with Marriott Bonvoy \n(2)\nProperties\n12\n—\n—\n—\n—\n—\n12\nRooms\n26,210\n—\n—\n—\n—\n—\n26,210\nTribute Portfolio\n® \nProperties\n88\n28\n8\n13\n8\n9\n154\nRooms\n16,578\n3,794\n1,173\n1,444\n1,735\n1,011\n25,735\nGaylord\n®\n Hotels\nProperties\n6\n—\n—\n—\n—\n—\n6\nRooms\n10,220\n—\n—\n—\n—\n—\n10,220\nDesign Hotels\n®\nProperties\n20\n93\n9\n13\n4\n22\n161\nRooms\n2,157\n6,912\n768\n955\n783\n531\n12,106\nMarriott Executive Apartments\n®\nProperties\n—\n3\n13\n13\n11\n2\n42\nRooms\n—\n212\n1,841\n1,785\n1,735\n240\n5,813\nApartments by Marriott Bonvoy\nTM\nProperties\n—\n—\n—\n—\n—\n2\n2\nRooms\n—\n—\n—\n—\n—\n231\n231\nSonder by Marriott Bonvoy\nProperties\n104\n56\n3\n—\n—\n—\n163\nRooms\n6,501\n1,850\n844\n—\n—\n—\n9,195\n5\nTable of Contents\n    \n                                    \nU.S. & Canada\nEurope\nMiddle East & Africa\nAsia Pacific excluding China\nGreater China\nCaribbean & Latin America\nTotal\nSelect\nCourtyard by Marriott\n®\n (Courtyard\n®\n)\nProperties\n1,076\n80\n12\n65\n58\n50\n1,341\nRooms\n148,671\n14,639\n2,635\n13,184\n14,951\n8,100\n202,180\nFairfield by Marriott\n®\n (Fairfield\n®\n)\nProperties\n1,174\n1\n—\n72\n66\n18\n1,331\nRooms\n111,495\n222\n—\n9,614\n10,398\n2,521\n134,250\nResidence Inn by Marriott\n®\n (Residence Inn\n®\n)\nProperties\n873\n30\n8\n—\n—\n9\n920\nRooms\n107,249\n3,446\n1,205\n—\n—\n1,328\n113,228\nSpringHill Suites by Marriott\n®\n (SpringHill Suites\n®\n)\nProperties\n563\n—\n—\n—\n—\n—\n563\nRooms\n66,666\n—\n—\n—\n—\n—\n66,666\nFour Points by Sheraton\n®\n (Four Points\n®\n)\nProperties\n148\n24\n23\n50\n67\n20\n332\nRooms\n22,028\n4,309\n5,520\n11,501\n17,724\n2,624\n63,706\nTownePlace Suites by Marriott\n®\n (TownePlace Suites\n®\n)\nProperties\n525\n—\n—\n—\n—\n—\n525\nRooms\n53,208\n—\n—\n—\n—\n—\n53,208\nAloft\n®\n Hotels\nProperties\n166\n11\n12\n17\n14\n17\n237\nRooms\n24,010\n1,763\n2,743\n4,296\n3,180\n2,769\n38,761\nAC Hotels by Marriott\n®\nProperties\n126\n88\n2\n7\n2\n19\n244\nRooms\n21,029\n11,909\n286\n1,966\n378\n3,007\n38,575\nMoxy\n®\n Hotels\nProperties\n44\n93\n—\n13\n11\n—\n161\nRooms\n7,805\n17,587\n—\n2,886\n2,052\n—\n30,330\nElement\n® \nHotels\nProperties\n90\n2\n7\n3\n8\n—\n110\nRooms\n12,428\n275\n1,189\n572\n1,647\n—\n16,111\nProtea Hotels\n®\n by Marriott\nProperties\n—\n—\n64\n—\n—\n—\n64\nRooms\n—\n—\n6,932\n—\n—\n—\n6,932\nMidscale\nCity Express by Marriott\nSM\nProperties\n1\n—\n—\n—\n—\n152\n153\nRooms\n83\n—\n—\n—\n—\n17,694\n17,777\nFour Points Flex\nSM\n by Sheraton\nProperties\n—\n11\n4\n13\n—\n—\n28\nRooms\n—\n1,420\n231\n3,386\n—\n—\n5,037\nResidences\nResidences\nProperties\n72\n12\n17\n20\n2\n14\n137\nRooms\n7,664\n619\n2,429\n3,808\n302\n862\n15,684\nSubtotal Properties\n6,235\n922\n373\n629\n589\n518\n9,266\nSubtotal Rooms\n1,043,224\n153,904\n80,263\n143,177\n172,388\n90,248\n1,683,204\nTimeshare \n(1)\nProperties\n93\nRooms\n22,750\nYacht \n(1)\nProperties\n2\nRooms\n377\nTotal Properties\n9,361\nTotal Rooms\n1,706,331\n(1)\nWe exclude geographical data for Timeshare and Yacht as these offerings are captured within “Unallocated corporate and other.”\n(2)\nExcludes five MGM Collection with Marriott Bonvoy properties (two Autograph Collection, one Tribute Portfolio, one The Luxury Collection, and one W Hotels), which are presented within their respective brands.\nProperty and room counts presented by brand in the above table include certain hotels in our system that are not yet operating under such brand, but are expected to operate under such brand following the completion of planned renovations. In addition, Four Points Flex by Sheraton refers to properties previously referred to as Four Points Express by Sheraton.\nCompany-Operated Properties\nAt year-end 2024, we had 2,032 company-operated properties (586,201 rooms), which included properties under long-term management agreements with hotel owners and properties that we own and lease.\nTerms of our management agreements vary, but we earn a management fee that is typically composed of a base management fee, which is a percentage of the revenues of the hotel, and an incentive management fee, which is based on the profits of the hotel. In many cases (particularly in our U.S. & Canada, Europe, and CALA regions), incentive management fees \n6\nTable of Contents\n    \n                                    \nare subject to a specified owner return. Our management agreements also typically include reimbursement of costs of operations (both direct and indirect). Such agreements are generally for initial periods of 20 to 30 years, with options for us to renew for up to 10 or more additional years. Our lease agreements also vary, but may include fixed annual rentals plus additional rentals based on a specified percentage of annual revenues that exceed a fixed amount. In many jurisdictions, our management agreements may be subordinated to mortgages or other liens securing indebtedness of the hotel owners. Many of our management agreements also permit the hotel owners to terminate the agreement if we do not meet certain performance metrics, financial returns fail to meet defined levels for a period of time, and we have not cured those deficiencies.\nFor the hotels we operate, we generally are responsible for hiring, training, and supervising the associates needed to operate the hotels and for incurring operational and administrative costs related to the operation of the hotels, and hotel owners are required to reimburse us for those costs. We provide centralized programs and services, such as our Loyalty Program (as defined below), reservations, and marketing, as well as various accounting and data processing services, and hotel owners are required to reimburse us for those costs as well.\nFranchised, Licensed, and Other Properties\nWe have franchise, license, and other arrangements that permit hotel owners and certain other third parties to use many of our lodging brand names and systems.\nUnder our hotel franchising arrangements, we generally receive an initial application fee and continuing royalty fees, which typically range from\n \nfour to seven percent of room revenues, plus for certain brands, up to four percent of food and beverage revenues, as well as reimbursement for centralized programs and services, such as our Loyalty Program, reservations, and marketing. Such agreements are generally for periods of 10 to 20 years.\nWe also have license and other agreements with third parties for certain offerings, such as for our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection\n, \npursuant to which we receive royalty and certain other fees. For our timeshare properties, we receive royalty fees under license agreements with Marriott Vacations Worldwide Corporation and its affiliates (collectively, “MVW”) for certain brands. The royalty fees we receive from MVW consist of a fixed annual fee, adjusted for inflation, plus certain variable fees based on sales volumes. Certain licensees are also charged for certain systems and centralized programs and services, such as our Loyalty Program, reservations, and marketing.\nAt year-end 2024, we had 7,192 franchised, licensed, and other properties (1,104,446 rooms and timeshare units).\nResidential\nWe use or license certain of our trademarks for the sale of residential real estate, often in conjunction with hotel development. We receive one-time branding fees upon the sale of each branded residential unit by the third-party developers who construct and sell the residences, with limited amounts, if any, of our capital at risk. We often also manage the related homeowners’ association and receive continuing management fees for that service. At year-end 2024, we had 137 branded residential properties (15,684 residential units).\nIntellectual Property\nWe operate in a highly competitive industry and our brand names, trademarks, service marks, trade names, and logos are very important to our business, including the development, sales and marketing of our lodging offerings and services. We believe that our brand names and other intellectual property have come to represent outstanding quality, care, service, and value to our customers, guests, and the traveling public. Accordingly, we register and protect our intellectual property where we deem appropriate and otherwise protect against its unauthorized use.\nLoyalty and Credit Card Programs\nMarriott Bonvoy\n®\n is central to our business strategy. It encompasses our portfolio of over 30 brands and other travel offerings, our direct channels, and our award-winning travel loyalty program, which we refer to throughout this report as our “Loyalty Program.” Loyalty Program members can earn points for stays at participating properties and other travel offerings, such as Homes & Villas by Marriott Bonvoy, a global offering focusing on the premium and luxury tiers of rental homes, as well as through purchases with co-branded credit cards and our Loyalty Program partners. Members can redeem points for stays at participating properties, airline tickets, airline frequent flyer program miles, rental cars, products from Marriott Bonvoy Boutiques\n®\n, and a variety of other awards, including experiences from Marriott Bonvoy Moments\n®\n.\n7\nTable of Contents\n    \n                                    \nWe believe that our Loyalty Program generates substantial repeat business that might otherwise go to competing properties. In 2024, 72 percent of our U.S. hotel room nights and 65 percent of our global hotel room nights were booked by Loyalty Program members. We strategically market to this large and growing guest base to generate revenue.\nWe have co-branded credit cards associated with Marriott Bonvoy in 11 countries. In the U.S., we have multi-year agreements with JPMorgan Chase and American Express. We also license credit card programs internationally, including in Japan, China, Canada, the United Arab Emirates, and other markets. We generally earn fixed amounts that are payable at contract inception and variable amounts that are paid to us monthly over the term of the agreements primarily based on card usage. We believe that our co-branded credit cards create a diverse revenue stream for the Company, reflect the quality and value of our portfolio of brands, and contribute to the strength of our Loyalty Program by creating value for our customers, hotel owners, and other parties with whom we have an affiliation. Payments received under our co-branded credit card agreements represent a significant funding source for the Loyalty Program.\nSee the “Loyalty Program” caption in Note 2 for more information about our Loyalty Program and co-branded credit cards.\nSales and Marketing and Reservation Systems \nMarriott.com, the Marriott Bonvoy mobile app, and our other direct digital channels offer seamless digital experiences. We deliver customer-minded enhancements, including powerful in-stay capabilities through our mobile app, such as contactless check-in and check-out, Mobile Key, chat, service requests, mobile dining, and more. In addition, we are focused on strengthening Marriott Bonvoy by attracting more Loyalty Program members and localizing our experiences to reach new customers around the world. Our focus on creating frictionless experiences throughout our direct digital channels is foundational to our worldwide technology systems transformation. This multi-year transformation of our reservations, property management, and loyalty systems is focused on introducing new technology that delivers more choices for customers, new capabilities for associates, and new revenue opportunities for hotels in our system.\nOur above-property sales deployment and revenue management strategies are designed around the way the customer wants to buy and the strategic priorities of hotels in our system. Our above-property sales strategy focuses on offering global business-to-business solutions, driving efficiencies, optimizing revenue, and enhancing customer loyalty while minimizing duplication of efforts at the hotel level. We also utilize innovative and sophisticated revenue management systems, many of which are proprietary, which are designed to facilitate pricing decisions, increase efficiency, and optimize property-level revenue. Most of the hotels in our portfolio utilize web-based programs to effectively manage the rate set-up and modification processes, which provides for greater pricing flexibility and increased efficiency.\nOur marketing strategies focus on building awareness, increasing demand, promoting Marriott Bonvoy, and increasing customer loyalty. We do this through a variety of brand and marketing programs, offerings, and tools.\nCompetition\nWe compete for guests in many areas, including brand recognition and reputation, location, guest satisfaction, room rates, quality of service, amenities, quality of accommodations, safety and security, and the ability to earn and redeem loyalty program points. We encounter strong competition in the short-term lodging market from regional, national, and international chains that operate lodging properties or franchise their brands, lodging properties that are not affiliated with a chain, and online platforms, including Airbnb and Vrbo, that allow travelers to book short-term rentals of homes and apartments as an alternative to hotel rooms. Although we believe that our strong brand recognition assists us in attracting and retaining guests and hotel owners, we compete against many other companies with strong brands and guest appeal, including Hilton, IHG Hotels & Resorts, Hyatt, Wyndham Hotels & Resorts, Accor, Choice Hotels, Best Western Hotels & Resorts, and others. Our direct digital channels also compete for guests with online travel services platforms, such as Expedia.com, Priceline.com, Booking.com, Travelocity.com, Orbitz.com, and Trip.com, and search engines such as Google, Bing, Yahoo, and Baidu.\nWe believe that the location and quality of our lodging offerings, our Loyalty Program, our marketing programs, our reservation systems, and our emphasis on guest service and guest and associate satisfaction contribute to guest preference across all our brands.\nAffiliation with a brand is common in the U.S. lodging industry. In 2024, approximately 73 percent of U.S. hotel rooms were brand-affiliated. Although lodging properties outside the U.S. also often affiliate with a brand, such brand affiliation is \n8\nTable of Contents\n    \n                                    \nless prevalent than in the U.S. Based on lodging industry data, we have an approximately 17 percent share of the U.S. hotel market and a four percent share of the hotel market outside the U.S. (based on number of rooms).\nWe believe that our brands are attractive to hotel owners seeking a management company, franchise, or other licensing affiliation because of the benefits of our Loyalty Program, centralized reservation systems, marketing programs, and other offerings, and our emphasis on guest service.\nSeasonality\nIn general, business at hotels in our system fluctuates moderately with the seasons. Business at some resort properties may be more seasonal depending on location.\nHuman Capital Management\nMarriott’s long history of service, innovation, and growth is built on a culture of putting people first. We are committed to investing in our associates, with a focus on leadership development, competitive compensation, and creating a sense of well-being and belonging for all.\nAt year-end 2024, Marriott managed the employment of approximately 418,000 associates. This number includes approximately 155,000 associates employed by Marriott at properties, customer care centers, and above-property operations, as well as approximately 263,000 associates who are employed by our hotel owners but whose employment is managed by Marriott (which is common outside the U.S.). Approximately 118,000 of the associates employed by Marriott are located in the U.S., of which approximately 20,000 belong to labor unions. Outside the U.S., some of our associates are represented by trade unions, works councils, or employee associations. These numbers do not include hotel personnel employed by our independent franchisees and licensees or management companies hired by our franchisees and licensees. Marriott is committed to conducting its business in accordance with high ethical and legal standards, and our franchisees are expected to develop responsible human capital management practices.\nWe are focused on maintaining Marriott’s position as an employer of choice both for job seekers and our existing associates. To attract talent, we are targeting new labor pools, optimizing our recruiting practices, and sharing our story of long-term career potential. Our people brand, “Be™”, showcases associate stories to highlight the meaningful work and numerous opportunities at the Company. At our headquarters in Bethesda, Maryland, we utilize a hybrid work model to allow for flexibility and choice to meet the needs of our corporate workforce. For many hotel-based associates, we are innovating the way hotel jobs are structured, introducing more flexibility and choice through our integrated jobs program, which allows associates to have more cross-training and engaging roles.\nWe encourage continual feedback from our associates at all levels. We measure associate satisfaction through our Associate Engagement Survey, which gives all associates the opportunity to provide feedback about their work experience, providing valuable insights so we can drive improvements in our culture. In 2024, we changed our cadence from an annual survey to three times per year to allow for more frequent feedback. Our associate engagement scores exceeded the “Global Best Employer” external benchmark in 2024, and we were recognized as a top 10 company on the Fortune 100 Best Companies to Work For\n®\n in 2024, a list we have been on for 27 consecutive years.\nIn 2024, we launched a comprehensive initiative, with a focus on our headquarters and corporate offices, to enhance our effectiveness and efficiency across the Company and to advance our strategic objectives. As part of these efforts, we streamlined some roles, reshaped work to focus on our highest priorities, and de-layered the organization to speed up and simplify decision-making capabilities of our teams.\nOur human capital strategy is based on three signature elements – Growing Great Leaders, Investing in Associates, and Providing Access to Opportunity.\nGrowing Great Leaders\nWe believe that associates at every level can inspire others through great leadership. Our Leadership Framework, designed to help us grow great leaders, starts with three Leadership Essentials that clearly define what great leadership means at Marriott at all levels of the organization. In 2024, we also revamped our leadership development offerings with tailored programming that targets successive managerial levels, creating a clear pathway for associates to progressively grow into leadership roles. Our leadership competencies are integrated into our performance management process and leadership development programs. Our talent development strategy is designed to provide opportunities for our associates to develop and grow their careers with Marriott for the long term while driving the performance of our business.\n9\nTable of Contents\n    \n                                    \nInvesting in Associates\nWe are focused on providing our associates with the tools, resources, and support they need to thrive – both personally and professionally. We provide our eligible U.S. associates and their families with access to comprehensive compensation and benefits offerings, such as health care coverage, work/life support benefits, and other offerings, including retirement savings and employee stock purchase plans. Outside the U.S., we offer comprehensive compensation and benefit programs that vary based on the geographic market and we regularly evaluate these programs for competitiveness against the external talent market. Our TakeCare program provides associates with tools and resources to support their physical, mental, and financial well-being.\nIn addition, pay equity is foundational to our compensation structures and practices. Globally, pay equity best practices guide our determination of starting pay for our associates, including our policy of prohibiting compensation history inquiries. In the U.S., we conduct pay equity audits at least annually and make adjustments as needed.\nProviding Access to Opportunity\nOur focus on access to opportunity encompasses a range of initiatives and programs to support our goal to make all stakeholders (including associates, guests, hotel owners, and suppliers) feel welcome and valued. The Inclusion and Social Impact Committee of our Board of Directors (“Board”), established over 20 years ago, assists the Board in providing oversight of the Company’s strategy related to our people-first culture, associate well-being and inclusion, and corporate social responsibility and environmental matters.\nSustainability and Social Impact\nWe are focused on creating a positive and sustainable impact wherever we do business. Our sustainability and social impact platform, Serve 360: Doing Good in Every Direction, is built around four focus areas: Nurture Our World; Sustain Responsible Operations; Empower Through Opportunity; and Welcome All and Advance Human Rights. Our efforts are centered around (1) making the communities and environments where we operate better places to live, work, and visit, (2) embedding sustainability across our operations, (3) providing access to workplace readiness and opportunity for all to grow and succeed, and (4) encouraging cultural understanding and connecting people through the power of travel.\nOur sustainability strategy and initiatives focus on a wide range of issues, including designing resource-efficient hotels, implementing technologies to track and reduce energy and water consumption, as well as waste and food waste, increasing the use of renewable energy, managing water-related risks, focusing on third-party sustainability certifications at the hotel-level, supporting ecosystem restoration initiatives, and focusing on responsible and local sourcing.\nWe have set near-term and long-term science-based emissions reduction targets, which were verified by the Science Based Targets initiative in 2024.\nIn response to humanitarian crises and natural disasters, hotels in our system often look to support their local communities in need by donating funds, hotel stays, food, supplies, and volunteer hours. We also deploy our Company relief funds to support affected associates and their families and charitable organizations providing relief in impacted areas. We also continue to focus on our efforts to advance human rights, including by continuing to train associates in human trafficking awareness and donating our training program to the broader lodging industry.\nGovernment Regulations\nAs a company with global operations, we are subject to a wide variety of laws, regulations, and government policies around the world. Some of the regulations that most affect us and our business include those related to employment practices; marketing and advertising; consumer protection; trade and economic sanctions; anti-bribery, anti-corruption, and anti-money laundering; intellectual property; cybersecurity, data privacy, data localization, data transfers, and the handling of personally identifiable information; competition; climate and the environment; health, safety, and accessibility; liquor sales; the offer and sale of franchises; and credit card products.\nInternet Address and Company SEC Filings\nOur primary Internet address is Marriott.com. On the investor relations portion of our website, Marriott.com/investor, we provide a link to our electronic filings with the SEC, including our annual report on Form 10-K, our quarterly reports on Form 10-Q, our current reports on Form 8-K, and any amendments to these reports. We make all such filings available free of charge as soon as reasonably practicable after filing. The information found on our website is not part of this or any other report we file with or furnish to the SEC.\n10\nTable of Contents",
  "item7": "Item 7.     Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nA discussion regarding our financial condition and results of operations for year-end 2023 compared to year-end 2022 can be found in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, as filed with the SEC on February 13, 2024 (“2023 Form 10-K”).\nBUSINESS AND OVERVIEW\nOverview\nWe are a worldwide operator, franchisor, and licensor of hotel, residential, timeshare, and other lodging properties under more than 30 brand names. We discuss our operations in the following reportable business segments: (1) U.S. & Canada, (2) Europe, Middle East & Africa (“EMEA”), (3) Greater China, and (4) Asia Pacific excluding China (“APEC”). Our Caribbean & Latin America (“CALA”) operating segment does not meet the applicable accounting criteria for separate disclosure as a reportable business segment, and as such, we include its results in “Unallocated corporate and other.”\nUnder our asset-light business model, we typically manage or franchise hotels and other lodging offerings, rather than own them.\n \nTerms of our management agreements vary, but we earn a management fee that is typically composed of a base management fee, which is a percentage of the revenues of the hotel, and an incentive management fee, which is based on the profits of the hotel. In many cases (particularly in our U.S. & Canada, Europe, and CALA regions), incentive management fees are subject to a specified owner return. Under our hotel franchising arrangements, we generally receive an initial application fee and continuing royalty fees, which are typically based on a percentage of room revenues, plus for certain brands, a percentage \n21\nTable of Contents\n    \n                                    \nof food and beverage revenues. We also have license and other agreements with third parties for certain offerings, such as for our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection, under which we receive royalty fees and certain other fees. Additionally, we earn fees for other uses of our intellectual property, including primarily co-branded credit card fees, as well as residential branding fees and certain other licensing fees.\nPerformance Measures \nWe believe Revenue per Available Room (“RevPAR”), which we calculate by dividing property level room revenue by total rooms available for the period, is a meaningful indicator of our performance because it measures the period-over-period change in room revenues. RevPAR may not be comparable to similarly titled measures, such as revenues, and should not be viewed as necessarily correlating with our fee revenue. We also believe occupancy and average daily rate (“ADR”), which are components of calculating RevPAR, are meaningful indicators of our performance. Occupancy, which we calculate by dividing total rooms sold by total rooms available for the period, measures the utilization of a property’s available capacity. ADR, which we calculate by dividing property level room revenue by total rooms sold, measures average room price and is useful in assessing pricing levels. RevPAR, occupancy, and ADR statistics are on a systemwide basis for comparable properties, unless otherwise stated. Unless otherwise stated, all changes refer to year-over-year changes for the comparable period. Comparisons to prior periods are on a constant U.S. dollar basis, which we calculate by applying exchange rates for the current period to the prior comparable period. We believe constant dollar analysis provides valuable information regarding the performance of hotels in our system as it removes currency fluctuations from the presentation of such results.\nWe define our comparable properties as hotels in our system that were open and operating under one of our brands since the beginning of the last full calendar year (since January 1, 2023 for the current period) and have not, in either the current or previous year: (1) undergone significant room or public space renovations or expansions, (2) been converted between company-operated and franchised, or (3) sustained substantial property damage or business interruption. Our comparable properties also exclude MGM Collection with Marriott Bonvoy, Design Hotels, The Ritz-Carlton Yacht Collection, and timeshare properties. For 2024, we had 5,439 comparable U.S. & Canada properties and 1,741 comparable International properties.\nBusiness Trends\nWe saw solid global RevPAR growth during 2024 compared to 2023. In 2024, worldwide RevPAR increased 4.3 percent compared to 2023, reflecting ADR growth of 2.8 percent and occupancy improvement of 1.0 percentage point. The increase in RevPAR was driven by strong year-over-year demand growth in nearly all our regions.\nIn the U.S. & Canada, where demand has normalized, RevPAR increased 3.0 percent in 2024, led by strong demand from group as well as strong demand from transient customer segments across our brand tiers.\nIn EMEA, RevPAR growth of 9.1 percent in 2024 was driven by strong demand in most countries across the region, aided by the 2024 Paris Olympics and other special events. In APEC, RevPAR increased 12.9 percent in 2024, driven by strong demand, including an increase in inbound demand into the region. In CALA, RevPAR increased 8.8 percent in 2024, driven by strong demand throughout the region. In Greater China, RevPAR declined 2.3 percent in 2024 due to lower domestic demand as a result of macro-economic conditions and an increase in outbound travel.\nIn 2024, we launched a comprehensive initiative to enhance our effectiveness and efficiency across the Company. At this point in the process, we expect this initiative to yield $80 million to $90 million of annual general and administrative cost reductions beginning in 2025. These efforts are also anticipated to deliver cost savings to our hotel owners.\nAs part of these efforts, in the second half of 2024, we implemented a voluntary retirement program for certain above-property associates, and some above-property roles in the organization were eliminated or redefined. We substantially completed this initiative as of year-end 2024.\nStarwood Data Security Incident\nOn November 30, 2018, we announced a data security incident involving \nunauthorized access to the Starwood \nreservations database (the “Data Security Incident”). We are currently unable to reasonably estimate the range of total possible financial impact to the Company from the Data Security Incident in excess of the expenses already recorded; however, we do not believe this incident will impact our long-term financial health. See Note 7 for additional information related to legal proceedings and governmental investigations related to the Data Security Incident.\n22\nTable of Contents\n    \n                                    \nSystem Growth and Pipeline\nOur system grew from 8,785 properties (1,597,380 rooms) at year-end 2023 to 9,361 properties (1,706,331 rooms) at year-end 2024. The increase compared to year-end 2023 reflected gross additions of 666 properties (123,389 rooms), including the addition of 16 properties (approximately 38,000 rooms) from our exclusive, long-term strategic licensing agreement with MGM Resorts International and 163 properties (approximately 9,000 rooms) from our long-term agreement with Sonder Holdings Inc., and deletions of 90 properties (14,572 rooms). Our 2024 gross room additions included approximately 52,300 rooms located outside U.S. & Canada and roughly 75,300 rooms converted from competitor brands.\nAt year-end 2024, we had nearly 3,800 properties and over 577,000 rooms in our development pipeline, which includes roughly 29,000 rooms approved for development but not yet under signed contracts. Our development pipeline includes over 229,000 rooms, or 40 percent, that were under construction or in the process of converting to our system at year-end 2024. \nFifty-five percent\n of the rooms in our development pipeline are located outside U.S. & Canada.\nIn 2024, we signed over 1,200 development deals with hotel owners and other counterparties for nearly 162,000 rooms globally. Approximately 34 percent of rooms signed were the result of conversion opportunities. During 2024, we continued to strengthen our luxury portfolio and grow our midscale brands. In December 2024, we also announced the expansion of our outdoor-focused lodging offerings.\nIn 2025, we expect net rooms growth of 4 to 5 percent.\nProperties and Rooms\nThe following table shows our properties and rooms by ownership type.\nProperties\nRooms\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nManaged\n1,981 \n2,046 \n(65)\n(3)\n%\n571,889 \n575,963 \n(4,074)\n(1)\n%\nFranchised/Licensed/Other \n(1) \n7,192 \n6,563 \n629 \n10 \n%\n1,104,446 \n994,354 \n110,092 \n11 \n%\nOwned/Leased\n51 \n50 \n1 \n2 \n%\n14,312 \n13,115 \n1,197 \n9 \n%\nResidential\n137 \n126 \n11 \n9 \n%\n15,684 \n13,948 \n1,736 \n12 \n%\nTotal\n9,361 \n8,785 \n576 \n7 \n%\n1,706,331 \n1,597,380 \n108,951 \n7 \n%\n(1)\nIn addition to franchised, includes our timeshare properties, MGM Collection with Marriott Bonvoy, Design Hotels, and The Ritz-Carlton Yacht Collection.\nLodging Statistics\nThe following table presents RevPAR, occupancy, and ADR statistics for comparable properties for 2024, and 2024 compared to 2023. Systemwide statistics include data from our franchised properties, in addition to our company-operated \n23\nTable of Contents\n    \n                                    \nproperties.\nRevPAR\nOccupancy\nAverage Daily Rate\n2024\nvs. 2023\n2024\nvs. 2023\n2024\nvs. 2023\nComparable Company-Operated Properties\nU.S. & Canada\n$\n177.07 \n3.4 \n%\n69.4 \n%\n0.5 \n%\npts.\n$\n255.23 \n2.6 \n%\nEurope\n$\n215.26 \n7.0 \n%\n72.1 \n%\n0.7 \n%\npts.\n$\n298.73 \n6.0 \n%\nMiddle East & Africa\n$\n132.47 \n11.2 \n%\n68.6 \n%\n2.9 \n%\npts.\n$\n193.15 \n6.5 \n%\nGreater China\n$\n84.57 \n(2.5)\n%\n68.7 \n%\n1.2 \n%\npts.\n$\n123.16 \n(4.2)\n%\nAsia Pacific excluding China\n$\n122.13 \n12.2 \n%\n72.5 \n%\n3.7 \n%\npts.\n$\n168.45 \n6.5 \n%\nCaribbean & Latin America\n$\n182.62 \n8.7 \n%\n66.0 \n%\n2.0 \n%\npts.\n$\n276.82 \n5.5 \n%\nInternational - All \n(1)\n$\n124.96 \n6.6 \n%\n69.9 \n%\n2.1 \n%\npts.\n$\n178.79 \n3.3 \n%\nWorldwide \n(2)\n$\n147.09 \n4.9 \n%\n69.7 \n%\n1.5 \n%\npts.\n$\n211.12 \n2.7 \n%\nComparable Systemwide Properties\nU.S. & Canada\n$\n131.26 \n3.0 \n%\n70.1 \n%\n0.4 \n%\npts.\n$\n187.14 \n2.4 \n%\nEurope\n$\n154.31 \n7.6 \n%\n70.3 \n%\n2.7 \n%\npts.\n$\n219.39 \n3.5 \n%\nMiddle East & Africa\n$\n123.62 \n12.1 \n%\n68.0 \n%\n2.8 \n%\npts.\n$\n181.72 \n7.6 \n%\nGreater China\n$\n78.91 \n(2.3)\n%\n67.7 \n%\n1.0 \n%\npts.\n$\n116.55 \n(3.7)\n%\nAsia Pacific excluding China\n$\n124.66 \n12.9 \n%\n72.5 \n%\n3.8 \n%\npts.\n$\n171.98 \n6.9 \n%\nCaribbean & Latin America\n$\n151.98 \n8.8 \n%\n65.8 \n%\n1.8 \n%\npts.\n$\n231.13 \n5.8 \n%\nInternational - All \n(1)\n$\n121.75 \n7.6 \n%\n69.2 \n%\n2.4 \n%\npts.\n$\n175.89 \n3.9 \n%\nWorldwide \n(2)\n$\n128.23 \n4.3 \n%\n69.8 \n%\n1.0 \n%\npts.\n$\n183.58 \n2.8 \n%\n(1)\nIncludes Europe, Middle East & Africa, Greater China, Asia Pacific excluding China, and Caribbean & Latin America.\n(2)\nIncludes U.S. & Canada and International - All.\nCONSOLIDATED RESULTS\nThe discussion below presents an analysis of our consolidated results of operations for 2024 compared to 2023. Also see the\n \n“Business Trends” section above for further discussion.\nFee Revenues\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nBase management fees\n$\n1,288 \n$\n1,238 \n$\n50 \n4 \n%\nFranchise fees\n3,113 \n2,831 \n282 \n10 \n%\nIncentive management fees\n769 \n755 \n14 \n2 \n%\nGross fee revenues\n5,170 \n4,824 \n346 \n7 \n%\nContract investment amortization\n(103)\n(88)\n(15)\n(17)\n%\nNet fee revenues\n$\n5,067 \n$\n4,736 \n$\n331 \n7 \n%\nThe increase in base management fees primarily reflected higher RevPAR and unit growth ($26 million).\nThe increase in franchise fees primarily reflected higher RevPAR, unit growth ($99 million), higher co-branded credit card fees ($59 million), higher residential branding fees ($36 million), and higher fees from properties that converted from managed to franchised ($31 million).\nThe increase in incentive management fees primarily reflected higher profits at managed hotels. In 2024, we earned incentive management fees from 69 percent of our managed hotels worldwide, compared to 68 percent in 2023. We earned incentive management fees from 31 percent of our U.S. & Canada managed hotels and 85 percent of our International managed hotels in each of 2024 and 2023. In addition, 67 percent of our total incentive management fees in 2024 came from our International managed hotels, primarily in EMEA and APEC, versus 65 percent in 2023.\n24\nTable of Contents\n    \n                                    \nOwned, Leased, and Other\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nOwned, leased, and other revenue\n$\n1,551 \n$\n1,564 \n$\n(13)\n(1)\n%\nOwned, leased, and other - direct expenses\n1,200 \n1,165 \n35 \n3 \n%\nOwned, leased, and other, net\n$\n351 \n$\n399 \n$\n(48)\n(12)\n%\nOwned, leased, and other revenue, net of direct expenses, decreased primarily due to $65 million of higher termination fees recorded in the prior year, largely related to one development project in U.S. & Canada.\nCost Reimbursements\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nCost reimbursement revenue\n$\n18,482 \n$\n17,413 \n$\n1,069 \n6 \n%\nReimbursed expenses\n18,799 \n17,424 \n1,375 \n8 \n%\nCost reimbursements, net\n$\n(317)\n$\n(11)\n$\n(306)\n(2,782)\n%\nCost reimbursements, net (cost reimbursement revenue, net of reimbursed expenses) varies due to timing differences between the costs we incur for centralized programs and services and the related rei\nmbursemen\nts we receive from hotel owners and certain other counterparties.\n \nOver the long term, our centralized programs and services are not designed to impact our economics, either positively or negatively. See Note 2 for more information about the accounting for cost reimbursements, including our Loyalty Program.\nThe decrease in cost reimbursements, net primarily reflected lower revenues, net of expenses, for many of our programs and services, and Loyalty Program activity, which incurred higher program expenses.\nOther Operating Expenses\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nDepreciation, amortization, and other\n$\n183 \n$\n189 \n$\n(6)\n(3)\n%\nGeneral, administrative, and other\n1,074 \n1,011 \n63 \n6 \n%\nRestructuring and merger-related charges\n77 \n60 \n17 \n28 \n%\nGeneral, administrative, and other expenses increased primarily due to higher compensation costs ($53 million) and higher guarantee reserves ($22 million).\nRestructuring and merger-related charges increased primarily due to $37 million of restructuring charges for employee termination benefits discussed in Note 16 and a $30 million reserve for a loan commitment related to the Company’s acquisition of Starwood, partially offset by $35 million of lower charges related to the Data Security Incident discussed in Note 7.\nNon-Operating Income (Expense)\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nGains and other income, net\n$\n31 \n$\n40 \n$\n(9)\n(23)\n%\nInterest expense\n(695)\n(565)\n(130)\n(23)\n%\nInterest income\n40 \n30 \n10 \n33 \n%\nEquity in earnings\n8 \n9 \n(1)\n(11)\n%\nGains and other income, net decreased primarily due to a gain recorded in the prior year on the sale of a hotel in the CALA region ($24 million).\nInterest expense increased primarily due to higher debt balances driven by Senior Notes issuances, net of maturities ($125 million).\n25\nTable of Contents\n    \n                                    \nIncome Taxes\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nProvision for income taxes\n$\n(776)\n$\n(295)\n$\n(481)\n(163)\n%\nOur tax provision increased in 2024 primarily due to intellectual property restructuring transactions resulting in non-U.S. tax benefits in the prior year ($228 million), the prior year release of a tax valuation allowance as the Company concluded it is more likely than not to recognize non-U.S. tax benefits ($223 million), and the prior year release of tax reserves, which was mostly due to the completion of a prior year tax audit ($103 million). The increase was partially offset by a decrease in pre-tax income ($51 million).\nBUSINESS SEGMENTS\nThe following discussion presents an analysis of the operating results of our reportable business segments for 2024 compared to 2023. Also see the\n \n“Business Trends” section above for further discussion.\n($ in millions)\n2024\n2023\nChange 2024 vs. 2023\nU.S. & Canada\nSegment net fee revenues\n$\n2,875 \n$\n2,734 \n$\n141 \n5 \n%\nSegment profit\n2,640 \n2,724 \n(84)\n(3)\n%\nEMEA\nSegment net fee revenues\n575 \n516 \n59 \n11 \n%\nSegment profit\n512 \n441 \n71 \n16 \n%\nGreater China\nSegment net fee revenues\n249 \n265 \n(16)\n(6)\n%\nSegment profit\n186 \n208 \n(22)\n(11)\n%\nAPEC\nSegment net fee revenues\n340 \n284 \n56 \n20 \n%\nSegment profit\n280 \n243 \n37 \n15 \n%\nProperties\nRooms\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nDecember 31, 2024\nDecember 31, 2023\nvs. December 31, 2023\nU.S. & Canada\n6,235 \n5,965 \n270 \n5 \n%\n1,043,224 \n979,631 \n63,593 \n6 \n%\nEMEA\n1,295 \n1,142 \n153 \n13 \n%\n234,167 \n218,167 \n16,000 \n7 \n%\nGreater China\n589 \n525 \n64 \n12 \n%\n172,388 \n159,871 \n12,517 \n8 \n%\nAPEC\n629 \n567 \n62 \n11 \n%\n143,177 \n130,158 \n13,019 \n10 \n%\nIn 2024, net fee revenues grew in U.S. & Canada, EMEA, and APEC compared to 2023, primarily driven by higher RevPAR and unit growth (see the Lodging Statistics and Properties and Rooms tables above for more information), as well as higher profits at managed hotels. In Greater China, net fee revenues decreased in 2024 primarily due to lower RevPAR.\nU.S. & Canada segment profit decreased in 2024 compared to 2023 despite the higher net fee revenues due to $138 million of lower cost reimbursement revenue, net of reimbursed expenses, $59 million of lower owned, leased, and other revenue, net of direct expenses, and $28 million of higher general, administrative, and other expenses. Owned, leased, and other revenue, net of direct expenses decreased primarily due to higher termination fees in the prior year, largely related to one development project. General, administrative, and other expenses increased primarily due to higher guarantee reserves.\nEMEA segment profit increased in 2024 compared to 2023 due to higher net fee revenues and $30 million of lower general, administrative, and other expenses, primarily due to lower litigation accruals, partially offset by $26 million of lower cost reimbursement revenue, net of reimbursed expenses.\nLIQUIDITY AND CAPITAL RESOURCES\nOur Credit Facility\nWe are party to a $4.5 billion multicurrency revolving credit agreement (as amended, the “Credit Facility”). Available borrowings under the Credit Facility support our commercial paper program and general corporate needs. U.S. dollar borrowings under the Credit Facility bear interest at SOFR (the Secured Overnight Financing Rate) plus a spread based on our \n26\nTable of Contents\n    \n                                    \npublic debt rating. We also pay quarterly fees on the Credit Facility at a rate based on our public debt rating. We classify outstanding borrowings under the Credit Facility and outstanding commercial paper borrowings (which generally have short-term maturities of 45 days or less) as long-term based on our ability and intent to refinance the outstanding borrowings on a long-term basis. The Credit Facility expires on December 14, 2027.\nThe Credit Facility contains certain covenants, including a single financial covenant that limits our maximum leverage (consisting of the ratio of Adjusted Total Debt to EBITDA, each as defined in the Credit Facility) to not more than 4.5 to 1.0. Our outstanding public debt does not contain a corresponding financial covenant or a requirement that we maintain certain financial ratios.\n \nWe currently satisfy the covenants in our Credit Facility and public debt instruments, including the leverage covenant under the Credit Facility, and do not expect the covenants will restrict our ability to meet our anticipated borrowing and liquidity needs.\nWe monitor the status of the capital markets and regularly evaluate the effect that changes in capital market conditions may have on our ability to fund our liquidity needs. We believe the Credit Facility, and our access to capital markets, together with cash we expect to generate from operations, remain adequate to meet our liquidity requirements.\nCommercial Paper\nWe issue commercial paper in the U.S. Because we do not have purchase commitments from buyers for our commercial paper, our ability to issue commercial paper is subject to market demand. We do not expect that fluctuations in the demand for commercial paper will affect our liquidity, given our borrowing capacity under the Credit Facility and access to capital markets.\nCash from Operations\nNet cash provided by operating activities decreased by $421 million in 2024 compared to 2023. Net cash provided by operating activities in 2024 reflected a cash outflow of $300 million in the “Restructuring and merger-related charges” caption of our Statements of Cash Flows for the settlement of the guarantee liability associated with the purchase of the Sheraton Grand Chicago (discussed in Note 3). Cash flows for 2023 reflected reduced cash received from U.S. co-branded credit card issuers related to the 2020 prepayment of certain future revenues. Such reductions ended as of year-end 2023. \nOur ratio of current assets to current liabilities was\n \n0.4 to 1.0 at both year-end 2024 and year-end 2023. We have significant borrowing capacity under our Credit Facility should we need additional working capital.\nInvesting Activities Cash Flows\nCapital Expenditures and Other Investments. \nWe made capital and technology expenditures of $750 million in 2024 and $452 million in 2023. Capital and technology expenditures in 2024 increased by $298 million compared to 2023, primarily due to approximately $200 million of spending related to the Sheraton Grand Chicago capitalized assets (discussed in Note 3) and higher than typical spending on our worldwide technology systems transformation, the overwhelming portion of which is expected to be reimbursed over time. In 2023, we also had cash outflows of $101 million due to the City Express brand acquisition.\nWe expect capital expenditures and other investments will total approximately $1.0 billion to $1.1 billion for 2025, including capital and technology expenditures, loan advances, contract acquisition costs, and other investing activities, but excluding any potential property or brand acquisitions, which we cannot forecast with sufficient accuracy and which may be significant. Our anticipated capital and technology expenditures include higher than typical spending on our worldwide technology systems transformation and renovations of hotels in our owned and leased portfolio.\nDispositions.\n Property and asset sales generated $16 million of cash proceeds in 2024 and $71 million in 2023.\nOver time, we have sold lodging properties, both completed and under development, generally subject to long-term management agreements. Our ability to attract third-party purchasers, and their ability to raise the debt and equity capital necessary to acquire such properties, depends in part on the perceived risks in the lodging industry and other constraints inherent in the capital markets. We monitor the status of the capital markets and regularly evaluate the potential impact of changes in capital market conditions on our business operations. We have made, and expect to continue making, selective and opportunistic investments to add units to our lodging business, which may include property acquisitions and renovations, new construction, loans, guarantees, and equity investments. Over time, we seek to minimize capital invested in our business through asset sales subject to long-term management or franchise agreements. \n27\nTable of Contents\n    \n                                    \nFinancing Activities Cash Flows\nDebt. \nDebt increased by $2,574 million in 2024, to $14,447 million at year-end 2024 from $11,873 million at year-end 2023,\n \nprimarily due to the issuances of our Series PP Notes and Series QQ Notes ($1,480 million) and Series NN Notes and Series OO Notes ($1,468 million), partially offset by the maturity of our Series CC Notes ($550 million). See Note 9 for additional information on Senior Notes issuances.\nOur long-term financial objectives include maintaining diversified financing sources, optimizing the mix and maturity of our long-term debt, and reducing our working capital. At year-end 2024, our long-term debt had a weighted average interest rate of 4.5 percent and a weighted average maturity of approximately 5.0 years. The ratio of our fixed-rate long-term debt to our total long-term debt was 0.9 to 1.0 at year-end 2024.\nSee the “Our Credit Facility” caption in this “Liquidity and Capital Resources” section for more information on our Credit Facility.\nShare Repurchases and Dividends. \nWe repurchased\n \n15.4 million shares of our common stock for $3.7 billion in 2024.\n \nYear-to-date through February 7, 2025, we repurchased 1.2 million shares for $350 million. For additional information, see “Market for Registrant’s Common Equity, Related Stockholder Matters, and Issuer Purchases of Equity Securities” in Part II, Item 5.\nOur Board declared the following quarterly cash dividends in 2024: (1) $0.52 per share declared on February 8, 2024 and paid on March 29, 2024 to stockholders of record on February 22, 2024; (2) $0.63 per share declared on May 10, 2024 and paid on June 28, 2024 to stockholders of record on May 24, 2024; (3) $0.63 per share declared on August 2, 2024 and paid on September 30, 2024 to stockholders of record on August 16, 2024; and (4) $0.63 per share declared on November 7, 2024 and paid on December 31, 2024 to stockholders of record on November 21, 2024.\nWe expect to continue to return cash to stockholders through a combination of share repurchases and cash dividends.\nMaterial Cash Requirements\nOur material cash requirements include the following contractual obligations and off-balance sheet arrangements.\n•\nAt year-end 2024, we had $14,447 million of debt plus $3,110 million of future interest payments, of which a total of $1,866 million is payable within the next 12 months from year-end 2024. See Note 9 for further information about our long-term debt and Note 8 for further information about our finance leases.\n•\nWe enter into operating leases primarily for hotels, offices, and equipment, which are discussed in Note 8.\n•\nAt December 31, 2024, projected Deemed Repatriation Transition Tax payments under the 2017 Tax Cuts and Jobs Act totaled $135 million, which is payable within the next 12 months from year-end 2024.\n•\nThe Company had guarantees and letters of credit as of year-end 2024, which are discussed in Note 7. The majority of our remaining guarantee commitments are not expected to be funded within the next 12 months from year-end 2024.\n•\nIn the normal course of business, we enter into purchase commitments related to the programs and services that we typically provide to hotel owners, and we incur other obligations to manage the daily operating needs of the hotels that we manage. Since our contracts with hotel owners generally require reimbursement for expenses incurred in providing these programs and services and managing the daily operating needs of the hotels that we manage, these obligations are not expected to have a material impact on our net income and cash flow over the long term.\nNEW ACCOUNTING STANDARDS\nWe do not expect that accounting standards updates issued to date and that are effective after December 31, 2024 will have a material effect on our Financial Statements.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur preparation of financial statements in accordance with GAAP requires management to make estimates and assumptions that affect reported amounts and related disclosures. Management considers an accounting policy and estimate to be critical if: (1) we must make assumptions that were uncertain when the estimate was made; and (2) changes in the estimate, or selection of a different estimate methodology could have a material effect on our consolidated results of operations or financial condition.\n28\nTable of Contents\n    \n                                    \nWhile we believe that our estimates, assumptions, and judgments are reasonable, they are based on information available when the estimate or assumption was made. Actual results may differ significantly. Additionally, changes in our assumptions, estimates or assessments due to unforeseen events or otherwise could have a material impact on our financial position or results of operations.\nSee Note 2 for further information related to our critical accounting policies and estimates, which are as follows:\nLoyalty Program\n, including how we estimate the breakage of hotel points, credit card points, and free night certificates, the volume of points and free night certificates that will be issued under our co-branded credit card agreements, the amount of consideration to which we will be entitled under our co-branded credit card agreements, and the stand-alone selling prices of goods and services provided under our co-branded credit card agreements. Changes in these estimates could result in material changes to our liability for guest loyalty program and Loyalty Program revenue. Based on the conditions existing at December 31, 2024 and holding other factors constant, a one percent decrease in our estimate of the breakage of points could result in an increase in the liability for guest loyalty program of approximately\n \n$50 million. The breakage impact may vary significantly depending on the specific Loyalty Program points for which the anticipated breakage changes.\nGoodwill\n, including how we evaluate the fair value of reporting units and when we record an impairment loss on goodwill. Our reporting units are the same as our operating segments. See Note 14 for more information. During the 2024 fourth quarter, we conducted our annual goodwill impairment test, and no impairment charges were recorded. The estimated fair values of all our reporting units significantly exceeded their carrying amounts at the date of their most recent estimated fair value determination.\nIntangibles and Long-Lived Assets\n, including how we evaluate the fair value of intangibles and long-lived assets and when we record impairment losses on intangibles and long-lived assets. During 2024, we evaluated our intangibles and long-lived asset groups for impairment and did not record any material impairment charges. The estimated fair values of all our indefinite-lived intangible assets significantly exceeded their carrying amounts at the date of their most recent estimated fair value determination.",
  "item2": null
}