{
  "source_file": "mas-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF\nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nDue to changing market conditions, we are experiencing, and may continue to experience, lower market demand for our products. We have been experiencing, and may continue to experience, elevated commodity and other input costs, as well as employee-related cost inflation. Additionally, we have been experiencing, and may continue to experience, significantly higher costs to us, principally in our Plumbing Products segment, due to the recently announced and enacted tariffs, particularly those related to China. We seek to mitigate the impact of higher tariffs and other unfavorable impact to our costs over time with pricing, cost savings initiatives, sourcing changes, and other activities. Consumer demand for our products, however, could further diminish if consumer confidence erodes and the price of our products and other consumer goods increases. \nWe continue to execute our strategies of leveraging our strong brand portfolio, our industry-leading positions and the Masco Operating System, our methodology to drive growth and productivity, to create long-term shareholder value. We remain confident in the fundamentals of our business and long-term strategy.  We believe that our strong financial position and cash flow generation, together with our investments in our industry-leading branded building products, our continued focus on innovation and customer service and disciplined capital allocation, will allow us to drive long-term growth and create value for our shareholders.   \nTHIRD QUARTER 2025 AND THE FIRST NINE MONTHS 2025 VERSUS \nTHIRD QUARTER 2024 AND THE FIRST NINE MONTHS 2024\nConsolidated Results of Operations\nWe report our financial results in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). However, we believe that certain non-GAAP performance measures and ratios used in managing the business may provide users of this financial information with additional meaningful comparisons between current results and results in prior periods. Non-GAAP performance measures and ratios should be viewed in addition to, and not as an alternative for, our reported results under GAAP. Within the tables presented, certain columns and rows may not add due to the use of rounded numbers for disclosure purposes.\nThe following discussion of consolidated results of operations refers to the three and nine months ended September 30, 2025 compared to the same periods of 2024.\nNET SALES\nBelow is a summary of our net sales, in millions, for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nChange\n2025\n2024\nChange\nNet sales, as reported\n$\n1,917 \n$\n1,983 \n(3)\n%\n$\n5,769 \n$\n6,000 \n(4)\n%\nDivestitures\n— \n(54)\n— \n(178)\nNet sales, excluding divestitures\n1,917 \n1,929 \n(1)\n%\n5,769 \n5,822 \n(1)\n%\nCurrency translation\n(20)\n— \n(17)\n— \nNet sales, excluding divestitures and the effect of currency translation\n$\n1,897 \n$\n1,929 \n(2)\n%\n$\n5,752 \n$\n5,822 \n(1)\n%\n16\nOur net sales for the three months ended September 30, 2025 were $1,917 million, which decreased three percent compared to the three months ended September 30, 2024. Excluding divestitures and the effect of currency translation, net sales decreased two percent primarily due to lower sales volume across the entire company which decreased sales by four percent, partially offset by higher net selling prices of plumbing products which increased sales by two percent.\nOur net sales for the nine months ended September 30, 2025 were $5,769 million, which decreased four percent compared to the nine months ended September 30, 2024. Excluding divestitures and the effect of currency translation, net sales decreased one percent primarily due to lower sales volume across the entire company which decreased sales by three percent, partially offset by higher net selling prices of plumbing products which increased sales by two percent.\nRESULTS OF OPERATIONS\nBelow is a summary of our results of operations for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nFavorable / (Unfavorable)\n2025\n2024\nFavorable / (Unfavorable)\nNet sales\n$\n1,917 \n$\n1,983 \n(3)\n%\n$\n5,769 \n$\n6,000 \n(4)\n%\nCost of sales\n(1,261)\n(1,258)\n— \n%\n(3,696)\n(3,805)\n3 \n%\nGross profit\n$\n656 \n$\n725 \n(10)\n%\n$\n2,073 \n$\n2,195 \n(6)\n%\nGross margin\n34.2 \n%\n36.6 \n%\n(240) bps\n35.9 \n%\n36.6 \n%\n(70) bps\nSelling, general and administrative expenses\n$\n(353)\n$\n(368)\n4 \n%\n$\n(1,072)\n$\n(1,123)\n5 \n%\nSelling, general and administrative expenses as a percent of net sales\n(18.4)\n%\n(18.6)\n%\n20 bps\n(18.6)\n%\n(18.7)\n%\n10 bps\nOperating profit\n$\n303 \n$\n357 \n(15)\n%\n$\n1,001 \n$\n1,073 \n(7)\n%\nOperating profit margin\n15.8 \n%\n18.0 \n%\n(220) bps\n17.4 \n%\n17.9 \n%\n(50) bps\nThree Months Ended September 30, 2025\nOur gross profit for the three months ended September 30, 2025 was $656 million, which decreased 10 percent, and was negatively impacted by higher commodity and tariff costs, four percent due to lower sales volume, an increase in other expenses (including inventory-related reserves), and two percent due to the divestiture of our Kichler Lighting (\"Kichler\") business. These amounts were partially offset by seven percent due to higher net selling prices, as well as cost savings initiatives.\nOur selling, general and administrative expenses for the three months ended September 30, 2025 were $353 million, which decreased four percent, and were positively impacted by four percent due to the divestiture of Kichler and two percent due to lower marketing costs, partially offset by one percent due to unfavorable foreign currency translation.\nOur operating profit for the three months ended September 30, 2025 was $303 million, which decreased 15 percent, and was negatively impacted by decreased gross profit, partially offset by lower selling, general and administrative expenses.\n17\nNine Months Ended September 30, 2025\nOur gross profit for the nine months ended September 30, 2025 was $2,073 million, which decreased six percent, and was negatively impacted by higher commodity and tariff costs and three percent each due to lower sales volume and the divestiture of Kichler, as well as an increase in other expenses (including inventory-related reserves). These amounts were partially offset by five percent due to higher net selling prices of plumbing products, as well as cost savings initiatives.\nOur selling, general and administrative expenses for the nine months ended September 30, 2025 were $1,072 million, which decreased five percent, and were positively impacted by four percent due to the divestiture of Kichler and one percent due to lower employee-related costs.\nOur operating profit for the nine months ended September 30, 2025 was $1,001 million, which decreased seven percent, and was negatively impacted by decreased gross profit, partially offset by lower selling, general and administrative expenses.\nOTHER INCOME (EXPENSE), NET\nBelow is a summary of our other income (expense), net, in millions, for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nFavorable / (Unfavorable)\n2025\n2024\nFavorable / (Unfavorable)\nInterest expense\n$\n(25)\n$\n(25)\n— \n%\n$\n(77)\n$\n(75)\n(3)\n%\nOther, net\n(2)\n(85)\n98 \n%\n(16)\n(95)\n83 \n%\nOther income (expense), net\n$\n(27)\n$\n(109)\n75 \n%\n$\n(93)\n$\n(170)\n45 \n%\nOther, net included a preliminary loss on the sale of Kichler of $81 million for the three and nine months ended September 30, 2024.\nINCOME TAXES\nBelow is a summary of our income tax expense, in millions, and our effective tax rate for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nFavorable / (Unfavorable)\n2025\n2024\nFavorable / (Unfavorable)\nIncome tax expense\n$\n(76)\n$\n(68)\n(12)%\n$\n(226)\n$\n(222)\n(2)%\nEffective tax rate\n(28)\n%\n(27)\n%\n(100) bps\n(25)\n%\n(25)\n%\n— bps\nNET INCOME AND INCOME PER COMMON SHARE - ATTRIBUTABLE TO MASCO CORPORATION\nBelow is a summary of our net income, in millions, and diluted income per common share for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nFavorable / (Unfavorable)\n2025\n2024\nFavorable / (Unfavorable)\nNet income\n$\n189 \n$\n167 \n13 \n%\n$\n645 \n$\n640 \n1 \n%\nDiluted income per common share \n$\n0.90 \n$\n0.77 \n17 \n%\n$\n3.06 \n$\n2.91 \n5 \n%\n18\nBusiness Segment Results\nThe following tables set forth our net sales and operating profit information by business segment, dollars in millions.\n \nThree Months Ended September 30,\nPercent Change\nNine Months Ended September 30,\nPercent Change\n \n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nNet Sales:\n \n \n \nPlumbing Products\n$\n1,247 \n$\n1,219 \n2 \n%\n$\n3,744 \n$\n3,665 \n2 \n%\nDecorative Architectural Products\n670 \n764 \n(12)\n%\n2,025 \n2,336 \n(13)\n%\nTotal\n$\n1,917 \n$\n1,983 \n(3)\n%\n$\n5,769 \n$\n6,000 \n(4)\n%\nThree Months Ended September 30,\nPercent Change\nNine Months Ended September 30,\nPercent Change\n \n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nOperating Profit:\n \n \nPlumbing Products\n$\n196 \n$\n240 \n(18)\n%\n$\n688 \n$\n713 \n(4)\n%\nDecorative Architectural Products\n128 \n138 \n(7)\n%\n381 \n436 \n(13)\n%\nTotal\n$\n324 \n$\n378 \n(14)\n%\n$\n1,068 \n$\n1,149 \n(7)\n%\nGeneral corporate expense, net\n(20)\n(21)\n(5)\n%\n(68)\n(76)\n(11)\n%\nTotal operating profit\n$\n303 \n$\n357 \n(15)\n%\n$\n1,001 \n$\n1,073 \n(7)\n%\nThe following discussion of business segment results refers to the three and nine months ended September 30, 2025 compared to the same periods of 2024. Changes in operating profit in the following business segment results discussion exclude general corporate expense, net.\nBUSINESS SEGMENT RESULTS DISCUSSION\nPlumbing Products\nSales\nNet sales in the Plumbing Products segment increased two percent for both the three and nine months ended September 30, 2025. In local currencies (including sales in currencies outside their respective functional currencies), net sales increased one percent and two percent for the three and nine months ended September 30, 2025, respectively. For the three months ended September 30, 2025, net sales increased three percent due to higher net selling prices, partially offset by three percent due to lower sales volume. For the nine months ended September 30, 2025, net sales increased three percent due to higher net selling prices, partially offset by one percent due to lower sales volume.\nOperating Results\nOperating profit in the Plumbing Products segment for the three and nine months ended September 30, 2025 was negatively impacted by higher commodity and tariff costs, an increase in other expenses (including inventory-related reserves), and lower sales volume, partially offset by higher net selling prices and cost savings initiatives. For the nine months ended September 30, 2025, operating profit was also negatively impacted by unfavorable sales mix and higher marketing costs.\n19\nDecorative Architectural Products\nSales\nNet sales in the Decorative Architectural Products segment decreased 12 percent and 13 percent for the three and nine months ended September 30, 2025, respectively. For the three months ended September 30, 2025, net sales decreased seven percent due to the divestiture of Kichler and seven percent due to lower sales volume, partially offset by one percent due to higher net selling prices. For the nine months ended September 30, 2025, net sales decreased eight percent due to the divestiture of Kichler and six percent due to lower sales volume.\nOperating Results\nOperating profit in the Decorative Architectural Products segment for the three and nine months ended September 30, 2025 was negatively impacted by lower sales volume and higher commodity and tariff costs, partially offset by cost savings initiatives. For the three months ended September 30, 2025, negative impacts to operating profit were also partially offset by higher net selling prices.\nLiquidity and Capital Resources \nOverview of Capital Structure\nWe had cash and cash investments of approximately $559 million and $634 million at September 30, 2025 and December 31, 2024, respectively. Our cash and cash investments consist of overnight interest bearing money market demand accounts, time deposit accounts, and money market mutual funds containing government securities and treasury obligations. While we attempt to diversify these investments in a prudent manner to minimize risk, it is possible that future changes in the financial markets could affect the security or availability of these investments. Of the cash and cash investments we held at September 30, 2025 and December 31, 2024, $303 million and $321 million, respectively, was held in our foreign subsidiaries. If these funds were needed for our operations in the U.S., their repatriation into the U.S. would not result in significant additional U.S. income tax or foreign withholding tax, as we have recorded such taxes on substantially all undistributed foreign earnings, except for those that are legally restricted.\nWe believe that our present cash balance and cash flows from operations, and borrowing availability under our revolving credit agreement, are sufficient to fund our near-term working capital and other investment needs. We believe that our longer-term working capital and other general corporate requirements will be satisfied through cash flows from operations and, to the extent necessary, from bank borrowings and future financial market activities. However, due to the changing market conditions and its impact on our customers and suppliers, we are unable to fully estimate the extent of the impact that the changing market conditions may have on our future financial condition.\nCredit Agreement\nOn April 26, 2022, we entered into a revolving credit agreement (the “2022 Credit Agreement”) with an aggregate commitment of $1.0 billion and a maturity date of April 26, 2027. \nUnder the 2022 Credit Agreement, at our request and subject to certain conditions, we can increase the aggregate commitment up to an additional $500 million with the current lenders or new lenders. See Note H to the condensed consolidated financial statements for additional information.\nThe 2022 Credit Agreement contains financial covenants requiring us to maintain (A) a net leverage ratio, as adjusted for certain items, not exceeding 4.0 to 1.0, and (B) an interest coverage ratio, as adjusted for certain items, not less than 2.5 to 1.0. We were in compliance with all covenants and no borrowings were outstanding at September 30, 2025. \n20\nOther Liquidity and Capital Resource Activities\n \nAs part of our ongoing efforts to improve our cash flow and related liquidity, we work with suppliers to optimize our terms and conditions, including extending payment terms. We also facilitate a voluntary supply chain finance program (the \"program\") to provide certain of our suppliers with the opportunity to sell receivables due from us to participating financial institutions at the sole discretion of both the suppliers and the financial institutions. The amounts confirmed as valid under the program and included in accounts payable were $32 million and $36 million at September 30, 2025 and December 31, 2024, respectively. Of the amounts confirmed as valid under the program, the amounts owed to participating financial institutions were $22 million and $23 million at September 30, 2025 and December 31, 2024, respectively. All payments made under the program are recorded as a decrease in accounts payable and accrued liabilities, net, in our condensed consolidated statements of cash flows. A downgrade in our credit rating or changes in the financial markets could limit the financial institutions’ willingness to commit funds to, and participate in, the program. We do not believe such risk would have a material impact on our working capital or cash flows, as substantially all of our payments are made outside of the program.\nDivestitures\nIn the third quarter of 2024, we sold our Kichler business, a provider of decorative residential and light commercial lighting products, ceiling fans, and LED lighting systems, for consideration of $125 million, net of cash disposed, and subject to final closing adjustments. \nShare Repurchases\nEffective October 20, 2022, our Board of Directors authorized the repurchase, for retirement, of up to $2.0 billion of shares of our common stock, exclusive of excise tax, in open-market transactions or otherwise. During the nine months ended September 30, 2025, we repurchased and retired approximately 5.1 million shares of our common stock (including 0.3 million shares to offset the dilutive impact of restricted stock units granted in the nine months ended September 30, 2025) for approximately $357 million, inclusive of excise tax of $3 million. At September 30, 2025, we had approximately $542 million remaining under the 2022 authorization. Consistent with our past practice and as part of our long-term capital allocation strategy, outside of any potential acquisitions, we anticipate using approximately $500 million of cash for share repurchases in 2025.\nCash Flows\nFor the nine months ended September 30, 2025, net cash provided by operations was $604 million, primarily driven by operating profit and the change in deferred taxes as a result of the cash tax benefit associated with immediate expensing of qualified fixed assets and research and development expenditures from the enactment of the One Big Beautiful Bill Act, partially offset by changes in working capital.\nFor the nine months ended September 30, 2025, net cash used for financing activities was $592 million, primarily due to $354 million for the repurchase and retirement of our common stock, $197 million for the payment of cash dividends, and $30 million for dividends paid to noncontrolling interest.\nFor the nine months ended September 30, 2025, net cash used for investing activities was $111 million, primarily driven by $109 million of capital expenditures.\n21\nCautionary Statement Concerning Forward-Looking Statements\nThis Report contains statements that reflect our views about our future performance and constitute \"forward-looking statements\" under the Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as \"outlook,\" \"believe,\" \"anticipate,\" \"appear,\" \"may,\" \"will,\" \"should,\" \"intend,\" \"plan,\" \"estimate,\" \"expect,\" \"assume,\" \"seek,\" \"forecast,\" and similar references to future periods. Our views about future performance involve risks and uncertainties that are difficult to predict and, accordingly, our actual results may differ materially from the results discussed in our forward-looking statements. We caution you against relying on any of these forward-looking statements.\nOur future performance may be affected by the levels of residential repair and remodel activity, and to a lesser extent, new home construction, our ability to maintain our strong brands, to develop innovative products and respond to changing consumer purchasing practices and preferences, our ability to maintain our public image and reputation, our ability to maintain our competitive position in our industries, our reliance on key customers, the cost and availability of materials, our dependence on suppliers and service providers, extreme weather events and changes in climate, risks associated with our international operations and global strategies, the impact on demand, pricing and product costs resulting from tariffs, our ability to achieve the anticipated benefits of our strategic initiatives, our ability to successfully execute our acquisition strategy and integrate businesses that we have acquired and may in the future acquire, our ability to attract, develop and retain a talented workforce, risks associated with cybersecurity vulnerabilities, threats and attacks and risks associated with our reliance on information systems and technology.\nThese and other factors are discussed in detail in Item 1A. \"Risk Factors\" in our most recent Annual Report on Form 10-K, as well as in other filings we make with the Securities and Exchange Commission. Any forward-looking statement made by us speaks only as of the date on which it was made. Factors or events that could cause our actual results to differ may emerge from time to time, and it is not possible for us to predict all of them. Unless required by law, we undertake no obligation to update publicly any forward-looking statements as a result of new information, future events or otherwise.\n22\nMASCO CORPORATION"
}