{
  "source_file": "mas-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness. \nMasco Corporation and its subsidiaries (the “Company”) is a global leader in the design, manufacture and distribution of branded home improvement and building products. Our portfolio of industry-leading brands includes BEHR® paint; DELTA® and HANSGROHE® faucets, bath and shower fixtures; LIBERTY® branded decorative and functional hardware; and HOT SPRING® spas. We leverage our powerful brands across product categories, sales channels and geographies to create value for our customers and shareholders.\nWe believe that our solid results of operations and financial position for 2024 resulted from our continued focus on our three strategic pillars: \n•\ndrive the full potential of our core businesses; \n•\nleverage opportunities across our enterprise; and \n•\nactively manage our portfolio.\nIn 2024, we continued to return value to our shareholders by repurchasing approximately 10.0 million shares of our common stock and increasing our quarterly dividend by approximately two percent compared to 2023. In addition, in the third quarter of 2024, we completed the divestiture of our Kichler Lighting business.\nOur Business Segments\nWe report our financial results in two segments, our Plumbing Products segment and our Decorative Architectural Products segment, which are aggregated by product similarity.  Our Decorative Architectural Products segment is impacted by seasonality and normally experiences stronger sales during the second and third calendar quarters, corresponding with the peak season for repair and remodel activity.\n2\nPlumbing Products\nThe businesses in our Plumbing Products segment sell a wide variety of products that are manufactured or sourced by us. \n•\nOur plumbing products include faucets, showerheads, handheld showers, valves, bath hardware and accessories, bathing units, shower bases and enclosures, shower drains, steam shower systems, water filtration systems, sinks and kitchen accessories. We primarily sell these products to home center retailers, online retailers, mass merchandisers, wholesalers and distributors that, in turn, sell them to plumbers, building contractors, remodelers, smaller retailers, consumers and homebuilders. The majority of our faucet, bathing and showering products are sold primarily in North America, Europe and China under the brand names DELTA\n®\n, BRIZO\n®\n, PEERLESS\n®\n, HANSGROHE\n®\n, AXOR\n®\n, KRAUS\n®\n, EASY DRAIN\n®\n, NEWPORT BRASS\n®\n, GINGER\n®\n, BRASSTECH\n®\n and WALTEC\n®\n. Our BRISTAN™ and HERITAGE™ products are sold primarily in the United Kingdom. \n•\nWe manufacture acrylic tubs, bath and shower enclosure units\n,\n and shower bases and trays\n.\n Our DELTA, PEERLESS and MIROLIN\n®\n products are sold primarily to home center retailers in North America. Our MIROLIN products are also sold to wholesalers and distributors in Canada.\n•\nOur spas, exercise pools, aquatic fitness systems and saunas are manufactured and sold under our HOT SPRING\n®\n, CALDERA\n®\n, FREEFLOW SPAS\n®\n, FANTASY SPAS\n®\n, AQUATERRA\n®\n, LIFESMART\n®\n, ENDLESS POOLS\n®\n, TYLO\n®\n, FINNLEO\n®\n and HELO\n®\n brands, as well as under other trademarks. Our spas, exercise pools and saunas are sold worldwide to independent specialty retailers and distributors and our spas and saunas are also sold to online mass merchandisers. Certain exercise pools are also available on a consumer-direct basis in North America and Europe, while our aquatic fitness systems are sold through independent specialty retailers as well as on a consumer-direct basis in some areas. \n•\nIncluded in our Plumbing Products segment are brass\n,\n copper and composite plumbing system components and other non-decorative plumbing products that are sold to plumbing, heating and hardware wholesalers, home center and online retailers, hardware stores, building supply outlets and other mass merchandisers. These products are marketed primarily in North America under our BRASSCRAFT\n®\n, PLUMBSHOP\n®\n and MASTER PLUMBER\n®\n brands and are also sold under private label.\n•\nWithin our Plumbing Products segment we develop connected water products that enhance the experience with water in homes and businesses. These systems include touchless activation, voice activation, controlled volume dispensing and provide for monitoring and controlling the temperature and flow of water and are compatible with a range of faucets, showerheads and other showering components.\n•\nWe also supply high-quality, custom thermoplastic solutions, extruded plastic profiles and specialized fabrications, as well as PEX tubing, to manufacturers, distributors and wholesalers for use in diverse applications that include faucets and plumbing supplies, appliances, oil and gas equipment and building products. \nWe believe that our plumbing products are among the leaders in sales in North America and Europe. Competitors of the majority of our products in this segment include Dornbracht AG & Co. KG, Zurn Elkay Water Solutions Corporation, Fortune Brands Innovations, Inc.'s Moen, Rohl and Riobel brands, Kohler Co., Lixil Group Corporation’s American Standard and Grohe brands, Spectrum Brands Holdings, Inc.'s Pfister faucets as well as private label and digitally native brands. Competitors of our spas, exercise pools, aquatic fitness systems and saunas include Artesian Spas, Harvia, Jacuzzi and Master Spas brands, among others. Foreign manufacturers competing with us are located primarily in Europe, China and Canada. Additionally, we face significant competition from private label products and digitally native brands. The businesses in our Plumbing Products segment manufacture products primarily in North America and Europe as well as in Asia and source products from Asia and other regions. Competition for our plumbing products is based largely on brand reputation, product features and innovation, product quality, customer service, breadth of product offering and price. Many of the faucet and showering products with which our products compete are manufactured by low-cost foreign manufacturers that contribute to price competition.\n3\nMany of our plumbing products contain brass, the major components of which are copper and zinc. We have multiple sources, both domestic and foreign, for our raw materials used in this segment. We have encountered price volatility for brass, brass components and any components containing copper and zinc. To help reduce the impact of this volatility, from time to time we may enter into long-term agreements with certain significant suppliers. In addition, some of the products in this segment that we import have been and may in the future be subject to duties and tariffs.\nDecorative Architectural Products\nOur Decorative Architectural Products segment primarily includes architectural coatings, including paints, primers, specialty coatings, stains and waterproofing products, as well as paint applicators and accessories. These products are sold primarily in North America as well as in South America under the brand names BEHR\n®\n, KILZ\n®\n, WHIZZ\n®\n,\n \nElder & Jenks\n®\n \nand other trademarks to “do‑it‑yourself” and professional customers through home center retailers and other retailers. Net sales of architectural coatings comprised approximately 32 percent of our consolidated net sales in 2024, 2023, and 2022. Our BEHR products are sold through The Home Depot, our largest customer overall, as well as this segment’s largest customer. Our Behr business grants Behr brand exclusivity in the retail sales channel in North America to The Home Depot. The granting of exclusivity affects our ability to sell those products and brands to other customers, and the loss of this segment’s sales to The Home Depot would have a material adverse effect on this segment’s business and on our consolidated business as a whole.\nOur competitors in this segment include large national and international brands such as Benjamin Moore & Co., Pittsburgh Paints Co.'s Glidden, Olympic, Pittsburgh Paints and Stains and PPG Paints brands, RPM International, Inc.'s Rust-Oleum and Zinsser brands, The Sherwin‑Williams Company's Minwax, Sherwin-Williams, Thompson’s Water Seal, Valspar and Purdy brands and the Wooster Brush Company, as well as many regional and other national brands. We believe that brand reputation is an important factor in consumer selection, and that competition in this industry is also based largely on product features and innovation, product quality, customer service, breadth of product offering and price. \nAcrylic resins and titanium dioxide are principal raw materials in the manufacture of architectural coatings. The price of acrylic resins fluctuates based on the price of its components, which can have a material impact on our costs and results of operations in this segment. The price for titanium dioxide can fluctuate as a result of global supply and demand dynamics and production capacity limitations, which can have a material impact on our costs and results of operations in this segment. In addition, the prices of crude oil, natural gas, propylene and certain petroleum by-products can impact our costs and results of operations in this segment. We have multiple sources, both domestic and foreign, for the raw materials used in this segment and have encountered price volatility with respect to certain of these materials. To help reduce the impact of this price volatility, we have and may in the future enter into long-term agreements with certain significant suppliers. We import certain materials and products for this segment that have been and may in the future be subject to duties and tariffs. We also have agreements with certain significant suppliers for this segment that are intended to help assure continued supply. \nOur Decorative Architectural Products segment includes branded cabinet and door hardware, functional hardware, wall plates, hook and hook rail products, and outdoor living hardware, which are manufactured for us and sold to home center retailers, mass retailers, online retailers, other specialty retailers, original equipment manufacturers and wholesalers. These products are sold under the LIBERTY\n®\n, BRAINERD\n®\n, FRANKLIN BRASS\n®\n and other trademarks. Our key competitors in North America include Amerock Hardware, Richelieu Hardware Ltd., Top Knobs and private label brands. Decorative bath hardware, shower accessories, mirrors and shower doors are sold under the brand names DELTA\n®\n and FRANKLIN BRASS\n®\n and other trademarks to home center retailers, mass retailers, online retailers, other specialty retailers and wholesalers. Competitors for these products include American Bath Group, LLC's Dreamline brand, Fortune Brands Innovations, Inc.'s Moen brand, Gatco Fine Bathware, Kohler Co. and private label brands.\n4\nAdditional Information\nIntellectual Property\nWe hold numerous U.S. and foreign patents, patent applications, licenses, trademarks, trade names, trade secrets and proprietary manufacturing processes. We view our trademarks and other intellectual property rights as important, but do not believe that there is any reasonable likelihood of a loss of such rights that would have a material adverse effect on our present business as a whole.\nLaws and Regulations Affecting Our Business\nWe are subject to federal, state, local and international government laws and regulations. For a more detailed description of the various laws and regulations that impact our business, see Item 1A. Risk Factors.\nWe monitor applicable laws and regulations, including environmental laws and regulations, and incur ongoing expense relating to compliance, however we do not expect that compliance with federal, state, local and international regulations will result in material capital expenditures or have a material adverse effect on our results of operations and financial position.\nHuman Capital Management\nThe performance of our Company is impacted by our human capital management, and as a result we are focused on attracting, developing and retaining highly qualified, engaged employees, who have diverse experiences and backgrounds.  We have developed three strategic talent priorities: leadership, diversity, equity and inclusion, and future workforce. Our Chief Human Resources Officer is responsible for developing and executing our human capital strategy and provides regular updates to our Board of Directors’ Compensation and Talent Committee on our progress toward the achievement of these strategic initiatives. We believe that our human capital initiatives work together to help our employees grow and thrive, and cultivate a culture where our employees feel like they belong. We are also committed to keeping our employees healthy and safe in the workplace. \nLeadership\n \nWe support and foster the growth of our employees by providing development opportunities, experiences and tools that build and strengthen leadership capabilities. Our Leadership Profile, which is how we internally describe the capabilities and behaviors that we believe make great leaders, serves as the foundation for how we select, develop and measure the performance of our leaders. \nTo develop a sustainable pipeline of leaders, we have robust and proactive talent management and succession planning processes to support our businesses. In addition, our Board of Directors and executive management team regularly review our Company’s critical leadership roles and succession plans. \nWe are focused on building a continuous improvement and learning culture. This is supported by frequent and candid feedback discussions about performance and development between employees and their managers, across peers, and within teams.  \nDiversity, Equity and Inclusion (\"DE&I\")\nWe believe a workplace that encourages different voices, perspectives and backgrounds creates better teams, better solutions and more innovation. We strive to cultivate a sense of belonging for our employees. We are focused on the following three key areas:\n•\nOur workplace: who we are and how it feels to work at Masco\n•\nOur marketplace: how we deliver innovative solutions that meet the needs of all our consumers and customers\n•\nOur communities: how we help increase access, equity, and inclusion with our diverse community partners\n5\nWe have developed enterprise-wide initiatives in each strategic focus area and our businesses have developed plans designed to meet their specific needs that are aligned with these initiatives. Our executive leadership team, DE&I Councils, and employee resource groups serve as advisors, ambassadors and change agents in implementing our enterprise-wide initiatives and their business unit plans. \nOur workforce representation statistics are one indicator of our performance in advancing a diverse workforce. Following is our workforce representation statistics as of December 31, 2024:\n•\nIn the U.S., our leadership team is comprised of 34 percent women and 27 percent racially / ethnically diverse individuals, as compared to the EEO-1 benchmark of 26 percent and 24 percent, respectively. The EEO-1 leadership benchmark includes executive-level/senior-officials and managers, and first-level officials and managers. \n•\nIn the U.S., our salaried workforce is comprised of approximately 35 percent women and 31 percent racially / ethnically diverse individuals, as compared to the EEO-1 benchmark of 29 percent and 29 percent, respectively. The EEO-1 salaried employees benchmark includes leadership, professionals and technicians.\n•\nIn the U.S., our hourly workforce, which includes hourly and exception hourly, is comprised of 37 percent women and 55 percent racially / ethnically diverse individuals, as compared to the EEO-1 benchmark of 27 percent and 35 percent, respectively. The EEO-1 hourly employees benchmark includes all other EEO categories we did not include in the EEO-1 leadership and salaried benchmark.\nFuture Workforce\nThere are critical capabilities that our employees and our organization need to help us achieve our businesses objectives. We leverage our Masco Operating System, our methodology to drive growth and productivity, to ensure that our businesses are focused on building these critical organizational capabilities by ensuring they have the right structure, talent, tools, and training in place. \nEmployee Engagement\nIn order to engage and retain our employees, we listen to our employees to understand their perspectives, needs and ideas by leveraging various forums, tools, and methods including surveys to measure key insights related to employee engagement, inclusion, well-being, and leadership, among others.\n \nEmployee Health and Safety\nThe safety of our employees is integral to our company. In support of our safety efforts, we identify, assess, and investigate incidents and injury data, and each year set a goal to improve key safety performance indicators. We communicate and train our workforce on the importance of safe work practices. We also regularly consult with our employees on safety-related improvements to our operations. \nOur Workforce\nAt December 31, 2024, we employed approximately 18,000 people. \nAvailable Information\nOur website is www.masco.com. Our periodic reports and all amendments to those reports required to be filed or furnished pursuant to Section 13(a) or Section 15(d) of the Securities Exchange Act of 1934 are available free of charge through our website as soon as reasonably practicable after those reports are electronically filed with or furnished to the Securities and Exchange Commission (\"SEC\"). This Report is being posted on our website concurrently with its filing with the SEC. Information contained on our website is not incorporated by reference into this Report or any other report filed with the SEC. Our reports filed with the SEC also may be found on the SEC’s website at www.sec.gov.\n6",
  "item7": "Item 7.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis should be read in conjunction with, and is qualified in its entirety by, our consolidated financial statements (and notes related thereto) and other more detailed financial information appearing elsewhere in this Report. Further, you should read the following discussion and analysis of our financial condition and results of operations together with the “Risk Factors” included elsewhere in this Report for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.  See also “Cautionary Statement Concerning Forward-Looking Statements” at the beginning of this Report. Amounts may not add due to rounding.\nOverview\nWe design, manufacture and distribute branded home improvement and building products. These products are sold primarily for repair and remodeling activity and, to a lesser extent, new home construction. We sell our products through home center retailers, online retailers, wholesalers and distributors, mass merchandisers, hardware stores, direct to the consumer, professional contractors and homebuilders. \nWe continue to pursue our strategy of driving the full potential of our core businesses, leveraging opportunities across our enterprise, and actively managing our portfolio. We remain confident in the fundamentals of our business and long-term strategy. We execute our strategy by investing in our brands, developing innovative products, making capital investments, and focusing on continuous productivity improvement and operational excellence, among other initiatives. We believe that our strong financial position and cash flow generation, together with our investments in our industry-leading branded building products, our continued focus on innovation and disciplined capital allocation, will allow us to drive long-term growth and create value for our shareholders.\nWe continue to leverage the Masco Operating System, our methodology to drive growth and productivity, and continuous improvement initiatives across our enterprise to identify additional opportunities to improve our business operations. From time to time, we may take actions to drive efficiency in the business focused on the strategic rationalization of our businesses, including business consolidations, plant closures, headcount reductions and other cost savings initiatives.\nRecent Trends\nDue to changing market conditions, we are experiencing, and may continue to experience, lower market demand for our products. We also have been experiencing, and may continue to experience, elevated commodity and other input costs, as well as employee-related cost inflation. We aim to offset the potential unfavorable impact of our elevated costs and lower demand for our products with productivity improvements, pricing, and other initiatives.\nConsolidated Results of Operations\nWe report our financial results in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). However, we believe that certain non-GAAP performance measures and ratios, used in managing the business, may provide users of this financial information with additional meaningful comparisons between current results and results in prior periods. These include the disclosure of net sales, operating profit and operating profit margins adjusted for certain items. Non-GAAP performance measures and ratios should be viewed in addition to, and not as an alternative for, our reported results under GAAP.\nWe discuss our consolidated results as well as our Business Segment results of operations for the year ended December 31, 2024 versus December 31, 2023. A detailed discussion of our consolidated and Business Segment results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022 can be found under “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II of our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 8, 2024.\n20\nNET SALES\nBelow is a summary of our net sales, in millions, for the years ended December 31, 2024 and 2023:\n \nYear Ended December 31,\n \n2024\n2023\nChange\nNet sales, as reported\n$\n7,828 \n$\n7,967 \n(2)\n%\nAcquisitions\n(58)\n— \nDivestitures\n— \n(72)\nNet sales, excluding acquisitions and divestitures\n7,770 \n7,895 \n(2)\n%\nCurrency translation\n32 \n— \nNet sales, excluding acquisitions, divestitures and the effect of currency translation\n$\n7,802 \n$\n7,895 \n(1)\n%\nOur net sales for 2024 were $7,828 million, which decreased two percent compared to 2023. Excluding acquisitions, divestitures, and the effect of currency translation, net sales decreased one percent. Our net sales for 2024 decreased primarily due to lower sales volume of North America plumbing products, lower net selling prices of decorative architectural products, and unfavorable sales mix of plumbing products which each decreased sales by one percent. These amounts were partially offset by higher net selling prices of plumbing products which increased sales by one percent.\nRESULTS OF OPERATIONS\nBelow is a summary of our results of operations, dollars in millions, for the years ended December 31, 2024 and 2023:\n \nYear Ended December 31,\n \n2024\n2023\nChange\nNet sales\n$\n7,828 \n$\n7,967 \n(2)\n%\nCost of sales\n(4,997)\n(5,131)\n(3)\n%\nGross profit\n$\n2,831 \n$\n2,836 \n— \n%\nGross margin\n36.2 \n%\n35.6 \n%\n60 bps\nSelling, general and administrative expenses\n$\n(1,468)\n$\n(1,473)\n— \n%\nSelling, general and administrative expenses of a percent of net sales\n(18.8)\n%\n(18.5)\n%\n(30) bps\nImpairment charge for other intangible assets\n$\n— \n$\n(15)\n(100)\n%\nOperating profit, as reported\n$\n1,363 \n$\n1,348 \n1 \n%\nRationalization charges\n9 \n13 \n(31)\n%\nImpairment charge for other intangible assets\n— \n15 \n(100)\n%\nInsurance settlement\n— \n(40)\n(100)\n%\nOperating profit, excluding rationalization charges, impairment charge, and insurance settlement\n$\n1,372 \n$\n1,336 \n3 \n%\nOperating profit margin, as reported\n17.4 \n%\n16.9 \n%\n50 bps\nOperating profit margin, excluding rationalization charges, impairment charge, and insurance settlement\n17.5 \n%\n16.8 \n%\n70 bps\n21\nOur gross profit for 2024 was $2,831 million, which remained flat compared to 2023. Gross profit was negatively impacted by one percent due to the non-recurrence of the receipt of an insurance settlement payment in 2023, as well as unfavorable sales mix, and one percent each due to lower sales volume and unfavorable foreign currency translation. These amounts were mostly offset by cost savings initiatives and one percent due to higher net selling prices.  \nOur selling, general and administrative expenses for 2024 were $1,468 million, which remained flat compared to 2023. Selling, general and administrative expenses were positively impacted by one percent each due to the divestiture of Kichler in the third quarter of 2024 and lower sales commissions, mostly offset by two percent due to higher employee-related costs.\nOur operating profit for 2024 was $1,363 million, which increased one percent, and was positively impacted by the non-recurrence of an impairment charge for other intangible assets in 2023.\nOTHER INCOME (EXPENSE), NET\nBelow is a summary of our other income (expense), net, in millions, for the years ended December 31, 2024 and 2023:\n \nYear Ended December 31,\n \n2024\n2023\nFavorable / (Unfavorable)\nInterest expense\n$\n(99)\n$\n(106)\n7 \n%\nOther, net\n(103)\n(4)\n(2,475)\n%\nOther income (expense), net\n$\n(202)\n$\n(110)\n(84)\n%\nOther, net included a loss on the sale of Kichler Lighting (\"Kichler\") of $88 million, inclusive of costs to sell, for the year ended December 31, 2024.\nINCOME TAXES\nBelow is a summary of our income tax expense, in millions, and our effective tax rate for the years ended December 31, 2024 and 2023:\n \nYear Ended December 31,\n \n2024\n2023\nFavorable / (Unfavorable)\nIncome tax expense\n$\n(287)\n$\n(278)\n(3)\n%\nEffective tax rate\n(25)\n%\n(22)\n%\n(300) bps\nOur 2023 income tax expense included a $29 million state income tax benefit, net of federal expense, from the recognition of certain state deferred tax assets due to a legal restructuring of certain U.S. businesses that occurred in early 2024. This state income tax benefit did not recur in 2024. \nRefer to Note P to the consolidated financial statements for additional information. \nNET INCOME AND INCOME PER COMMON SHARE - ATTRIBUTABLE TO MASCO CORPORATION\nBelow is a summary of our net income, in millions, and diluted income per common share for the years ended December 31, 2024 and 2023:\n \nYear Ended December 31,\n \n2024\n2023\nFavorable / (Unfavorable)\nNet income\n$\n822 \n$\n908 \n(9)\n%\nDiluted income per common share\n$\n3.76 \n$\n4.02 \n(6)\n%\n22\nBusiness Segment Results\nThe following table sets forth our net sales and operating profit information by Business Segment, dollars in millions.\n \nYear Ended December 31,\nPercent Change\n \n2024\n2023\n2024 vs. 2023\nNet Sales:\n \n \n \nPlumbing Products\n$\n4,853 \n$\n4,842 \n— \n%\nDecorative Architectural Products\n2,975 \n3,125 \n(5)\n%\nTotal\n$\n7,828 \n$\n7,967 \n(2)\n%\nYear Ended December 31,\nPercent Change\n \n2024\n2023\n2024 vs. 2023\nOperating Profit:\n \n \nPlumbing Products\n$\n911 \n$\n861 \n6 \n%\nDecorative Architectural Products\n549 \n578 \n(5)\n%\nTotal\n$\n1,460 \n$\n1,439 \n1 \n%\nGeneral corporate expense, net\n(97)\n(91)\n7 \n%\nTotal operating profit\n$\n1,363 \n$\n1,348 \n1 \n%\nBUSINESS SEGMENT RESULTS DISCUSSION\nChanges in operating profit in the following Business Segment Results discussion exclude general corporate expense, net, and compares each respective period to the same period of the immediately preceding year. \nPlumbing Products\nSales\nNet sales in the Plumbing Products segment were flat in 2024. In local currencies (including sales in currencies outside their respective functional currencies), net sales increased one percent in 2024. Higher net selling prices increased sales by two percent and the acquisition of Sauna360 Group Oy (\"Sauna360\") in 2023 increased sales by one percent. These increases were mostly offset by lower sales volume and unfavorable sales mix which each decreased sales by one percent.\nOperating Results\nOperating profit in the Plumbing Products segment in 2024 was positively impacted by cost savings initiatives and higher net selling prices, partially offset by higher commodity costs, unfavorable sales mix, lower sales volume and higher employee-related costs. \nDecorative Architectural Products\nSales\nNet sales in the Decorative Architectural Products segment decreased five percent in 2024, primarily due to the divestiture of Kichler in the third quarter of 2024, lower net selling prices across the segment and lower sales volume of builders' hardware products, partially offset by higher sales volume of paints and other coating products.\n23\nOperating Results\nOperating profit in the Decorative Architectural Products segment in 2024 was negatively impacted by lower net selling prices and the non-recurrence of the receipt of an insurance settlement payment in 2023, partially offset by cost savings initiatives, the non-recurrence of an other intangible asset impairment charge in 2023 and lower sales commissions. \nLiquidity and Capital Resources \nOverview of Capital Structure\nHistorically, we have largely funded our growth through cash provided by our operations, the issuance of notes in the financial markets, bank borrowings and, to a lesser extent, the issuance of our common stock, including issuances for certain mergers and acquisitions. Maintaining high levels of liquidity and focusing on cash generation are among our financial strategies. Our capital allocation strategy includes reinvesting in our business, maintaining an investment grade credit rating, maintaining a relevant dividend and deploying excess free cash flow to share repurchases or acquisitions. \nWe had cash and cash investments of approximately $634 million at both December 31, 2024 and 2023. Our cash and cash investments consist of overnight interest bearing money market demand accounts, time deposit accounts, and money market mutual funds containing government securities and treasury obligations. While we attempt to diversify these investments in a prudent manner to minimize risk, it is possible that future changes in the financial markets could affect the security or availability of these investments. Of the cash and cash investments we held at December 31, 2024 and 2023, $321 million and $323 million, respectively, was held in our foreign subsidiaries. If these funds were needed for our operations in the U.S., their repatriation into the U.S. would not result in significant additional U.S. income tax or foreign withholding tax, as we have recorded such taxes on substantially all undistributed foreign earnings, except for those that are legally restricted.\nOur total debt as a percent of total capitalization was 102 percent and 97 percent at December 31, 2024 and 2023, respectively. Refer to Note K to the consolidated financial statements for additional information.\nWe believe that our present cash balance and cash flows from operations, and borrowing availability under our revolving credit agreement, are sufficient to fund our near-term working capital and other investment needs. We believe that our longer-term working capital and other general corporate requirements will be satisfied through cash flows from operations and, to the extent necessary, from bank borrowings and future financial market activities. However, due to the changing market conditions and its impact on our customers and suppliers, we are unable to fully estimate the extent of the impact that the changing market conditions may have on our future financial condition.\nCapital Expenditures\nWe continue to invest in our manufacturing and distribution operations to increase our productivity, improve customer service and support product innovation. Capital expenditures for 2024 were $168 million, compared with $243 million for 2023. The decrease in capital expenditures in 2024 was primarily due to capacity expansion plans in our Plumbing Products and Decorative Architectural Products segments in 2023. For 2025, capital expenditures, excluding any potential future acquisitions, are expected to be approximately $175 million. Depreciation and amortization expense for 2024 totaled $150 million, compared with $149 million for 2023. For 2025, depreciation and amortization expense, excluding any potential future acquisitions, is expected to be approximately $150 million. Amortization expense totaled $32 million in 2024, compared with $34 million in 2023.\nCredit Agreement \nOn April 26, 2022, we entered into a revolving credit agreement (the “2022 Credit Agreement”) with an aggregate commitment of $1.0 billion and a maturity date of April 26, 2027. \nUnder the 2022 Credit Agreement, at our request and subject to certain conditions, we can increase the aggregate commitment up to an additional $500 million with the current lenders or new lenders. See Note K to the consolidated financial statements for additional information.\n24\nThe 2022 Credit Agreement contains financial covenants requiring us to maintain (A) a net leverage ratio, as adjusted for certain items, not exceeding 4.0 to 1.0, and (B) an interest coverage ratio, as adjusted for certain items, not less than 2.5 to 1.0. We were in compliance with all covenants and no borrowings were outstanding under our 2022 Credit Agreement as of December 31, 2024.\nShort-term Borrowings\nOn May 9, 2023, our Hansgrohe SE subsidiary entered into €70 million ($77 million) of short-term borrowings to support working capital needs. The loans contained no financial covenants and the entire balance was repaid as of December 31, 2023.\n364-day Term Loan\nOn April 26, 2022, we entered into a 364-day $500 million senior unsecured delayed draw term loan (the \"term loan\") due April 26, 2023 with a syndicate of lenders. The term loan and commitments thereunder were subject to prepayment or termination at our option and the loans bore interest at SOFR plus a spread adjustment and 0.70%. The covenants, including the financial covenants, were substantially the same as those in the 2022 Credit Agreement. We repaid $300 million during 2022 and the remaining $200 million upon the maturity of the term loan on April 26, 2023.\nCorporate Development Strategy\nWe expect to maintain a balanced growth strategy pursuing organic growth by maximizing the full potential of our existing businesses and, as appropriate, complementing our existing business with strategic acquisitions.\nIn addition, we actively manage our portfolio of companies by divesting those businesses that do not align with our long-term growth strategy. We will continue to review all of our businesses to determine which businesses, if any, may not align with our long-term growth strategy.\nAcquisitions\nIn the third quarter of 2023, we acquired all of the share capital of Sauna360 for approximately €124 million ($136 million), net of cash acquired. Sauna360 has a portfolio of products that includes traditional, infrared, and wood-burning saunas as well as steam showers.\nDivestitures\nIn the third quarter of 2024, we sold our Kichler business, a provider of decorative residential and light commercial lighting products, ceiling fans, and LED lighting systems, for consideration of $125 million, net of cash disposed, and subject to final closing adjustments. Post-closing adjustments were finalized in the fourth quarter of 2024. \nShare Repurchases\nEffective October 20, 2022, our Board of Directors authorized the repurchase, for retirement, of up to $2.0 billion of shares of our common stock, exclusive of excise tax, in open-market transactions or otherwise. We repurchased and retired 10.0 million shares of our common stock in 2024 for approximately $757 million, inclusive of excise tax of $6 million. This included 0.5 million shares to offset the dilutive impact of restricted stock units granted in 2024. At December 31, 2024, we had $896 million remaining under the 2022 authorization. Consistent with past practice and as part of our long-term capital allocation strategy, outside of any potential acquisitions, we anticipate using approximately $600 million of cash for share repurchases (including shares which will be purchased to offset any dilution from restricted stock units granted as part of our compensation programs) in 2025. Refer to Note N to the consolidated financial statements for additional information.\nDuring 2023, we repurchased and retired 6.2 million shares of our common stock (including 0.2 million shares to offset the dilutive impact of restricted stock units granted during the year), for approximately $356 million, inclusive of excise tax of $3 million. \n25\nDividend to holders of our Common Shares\nIn 2024, we paid a quarterly dividend of $0.29 per common share for an annual dividend of $1.16 per share. Total cash dividends paid was $254 million in 2024.\nAs part of our capital allocation strategy, the Board of Directors declared a quarterly dividend of $0.31 per share in the first quarter of 2025 with the intention to increase the annual dividend 7 percent to $1.24 per share.\nOther Liquidity and Capital Resource Activities\n \nAs part of our ongoing efforts to improve our cash flow and related liquidity, we work with suppliers to optimize our terms and conditions, including extending payment terms. We also facilitate a voluntary supply chain finance program (the \"program\") to provide certain of our suppliers with the opportunity to sell receivables due from us to participating financial institutions at the sole discretion of both the suppliers and the financial institutions. The amounts confirmed as valid under the program and included in accounts payable were $36 million and $53 million at December 31, 2024 and 2023, respectively. Of the amounts confirmed as valid under the program, the amounts owed to participating financial institutions were $23 million and $28 million at December 31, 2024 and 2023, respectively. All payments made under the program are recorded as a decrease in accounts payable and accrued liabilities, net, in our consolidated statements of cash flows.  A downgrade in our credit rating or changes in the financial markets could limit the financial institutions’ willingness to commit funds to, and participate in, the program. We do not believe such risk would have a material impact on our working capital or cash flows, as substantially all of our payments are made outside of the program.\nWe utilize derivative and hedging instruments to manage our exposure to currency fluctuations, primarily related to the European euro, British pound sterling, Chinese renminbi, Mexican peso and the U.S. dollar. We review our hedging program, derivative positions and overall risk management on a regular basis. We currently do not have any derivative instruments for which we have designated hedge accounting.\n26\nCash Flows\nSignificant sources and (uses) of cash for the years ended December 31, 2024 and 2023 are summarized as follows, in millions:\n \n2024\n2023\nNet cash from operating activities\n$\n1,075 \n$\n1,413 \nPurchase of Company common stock\n(751)\n(353)\nExcise tax paid on the purchase of Company common stock\n(3)\n— \nCash dividends paid\n(254)\n(257)\nPurchase of redeemable noncontrolling interest\n(15)\n— \nDividends paid to noncontrolling interest\n(37)\n(49)\nProceeds from short-term borrowings\n— \n77 \nPayment of short-term borrowings\n— \n(77)\nPayment of term loan\n— \n(200)\nProceeds from the exercise of stock options\n79 \n38 \nEmployee withholding taxes paid on stock-based compensation\n(35)\n(29)\nPayment of debt\n(3)\n(5)\nCapital expenditures\n(168)\n(243)\nAcquisition of businesses, net of cash acquired\n(4)\n(136)\nProceeds from disposition of business, net of cash disposed\n126 \n— \nEffect of exchange rate changes on cash and cash investments\n(9)\n6 \nOther, net\n(4)\n(4)\nCash (decrease) increase\n$\n(1)\n$\n182 \nOur working capital days were as follows:\n \nAt December 31,\n \n2024\n2023\nReceivable days\n51 \n52 \nInventory days\n72 \n77 \nAccounts payable days\n70 \n70 \nWorking capital (receivables plus inventories, less accounts payable) as a   percentage of net sales\n15.1 \n%\n16.0 \n%\nOperating Activities\nNet cash provided by operations was $1,075 million, primarily driven by operating profit, partially offset by changes in working capital.\nFinancing Activities\nNet cash used for financing activities was $1,017 million, primarily due to $751 million for the repurchase and retirement of our common stock, $254 million for the payment of cash dividends, $37 million for dividends paid to noncontrolling interest, $35 million for employee withholding taxes paid on stock-based compensation, and $15 million for the purchase of the remaining equity interest in Easy Sanitary Solutions B.V. These uses of cash were partially offset by $79 million of proceeds from the exercise of stock options.\nInvesting Activities\nNet cash used for investing activities was $50 million, primarily driven by $168 million of capital expenditures, partially offset by $126 million of proceeds from the sale of Kichler.\n27\nCommitments and Contingencies\nLitigation\nInformation regarding our legal proceedings is set forth in Note R to the consolidated financial statements, which is incorporated herein by reference.\nOther Commitments\nWe enter into contracts, which include reasonable and customary indemnifications that are standard for the industries in which we operate. Such indemnifications include claims made against builders by homeowners for issues relating to our products and workmanship. In conjunction with divestitures and other transactions, we occasionally provide reasonable and customary indemnifications. We have not paid a material amount related to these indemnifications, and we evaluate the probability that amounts may be incurred and record an estimated liability when probable and reasonably estimable.\nContractual Obligations\nThe following table provides payment obligations related to current contracts at December 31, 2024, in millions:\n \nPayments Due by Period\n \n2025\n2026-2027\n2028-2029\nBeyond 2029\nOther\nTotal\nDebt \n(A)\n$\n3 \n$\n304 \n$\n839 \n$\n1,806 \n$\n— \n$\n2,952 \nInterest \n(A)\n98 \n193 \n158 \n580 \n— \n1,028 \nOperating leases\n55 \n88 \n57 \n142 \n— \n341 \nCurrently payable income taxes\n28 \n— \n— \n— \n— \n28 \nPurchase commitments \n(B)\n363 \n100 \n41 \n— \n— \n505 \nUncertain tax positions, including interest and penalties \n(C)\n— \n— \n— \n— \n97 \n97 \nTotal\n$\n546 \n$\n685 \n$\n1,095 \n$\n2,527 \n$\n97 \n$\n4,950 \n______________________________\n(A)\nWe assume that all debt would be held to maturity. Amounts include finance lease obligations.\n(B)\nIncludes purchase commitments for vendor contracts and contracts for the purchase of renewable energy credits and transferable tax credits. Excludes contracts that do not require volume commitments and open or pending purchase orders.\n(C)\nDue to the high degree of uncertainty regarding the timing of future cash outflows associated with uncertain tax positions, we are unable to make a reasonable estimate for the year in which cash settlements may occur with applicable tax authorities.\nRefer to Note M to the consolidated financial statements for defined-benefit pension plan obligations.\n28\nCritical Accounting Policies and Estimates\nOur discussion and analysis of our financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements requires us to make certain estimates and assumptions that affect or could have affected the reported amounts of assets and liabilities, disclosure of any contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. We regularly review our estimates and assumptions, which are based upon historical experience, as well as current economic conditions and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of certain assets and liabilities and related disclosures, and future revenues and expenses, that are not readily apparent from other sources. Actual results may differ from these estimates and assumptions.\nNote A to the consolidated financial statements includes our accounting policies, estimates and methods used in the preparation of our consolidated financial statements.\nWe believe that the following critical accounting policies are affected by significant judgments and estimates used in the preparation of our consolidated financial statements.\nRevenue Recognition\nWe recognize revenue as control of our products is transferred to our customers, which is generally at the time of shipment or upon delivery based on the contractual terms with our customers. We provide customer programs and incentive offerings, including special pricing and co-operative advertising arrangements, promotions and other volume-based incentives. These customer programs and incentives are considered variable consideration. We include in revenue variable consideration only to the extent that it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur when the variable consideration is resolved. This determination is made based upon known customer program and incentive offerings at the time of sale, and expected sales volume forecasts as it relates to our volume-based incentives. This determination is updated each reporting period. \nGoodwill and Other Intangible Assets\nWe record the excess of purchase price over the fair value of net tangible assets of acquired companies as goodwill or other identifiable intangible assets. In the fourth quarter of each year, or as events occur or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying amount, we complete the impairment testing of goodwill utilizing a discounted cash flow method. We selected the discounted cash flow methodology because we believe that it is comparable to what would be used by market participants. We have defined our reporting units and completed the impairment testing of goodwill at the operating segment level. \nDetermining market values using a discounted cash flow method requires us to make significant estimates and assumptions, including long-term projections of cash flows, market conditions and appropriate discount rates. Our judgments are based upon historical experience, current market trends, consultations with external valuation specialists and other information. While we believe that the estimates and assumptions underlying the valuation methodology are reasonable, different estimates and assumptions could result in different outcomes. In estimating future cash flows, we rely on internally generated five-year forecasts for sales and operating profits, and, currently, a two percent long-term assumed annual growth rate of cash flows for periods after the five-year forecast. We generally develop these forecasts based upon, among other things, recent sales data for existing products, planned timing of new product launches, estimated repair and remodel activity and, to a lesser extent, estimated housing starts. Our assumptions included U.S. and Eurozone Gross Domestic Product growing at approximately 1.8 percent and 1.4 percent, respectively, in 2025, and 2.0 percent and 1.4 percent, respectively, per annum over the remainder of the five-year forecast. \nWe utilize our weighted average cost of capital of approximately 8.50 percent as the basis to determine the discount rate to apply to the estimated future cash flows. In 2024, based upon our assessment of the risks impacting each of our businesses, we applied a risk premium to increase the discount rate to a range of 10.50 percent to 12.50 percent for our reporting units.\n29\nIf the carrying amount of a reporting unit exceeds its fair value, an impairment loss is recognized to the extent that a reporting unit's recorded carrying value exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit.\nIn the fourth quarter of 2024, we estimated that future discounted cash flows projected for all of our reporting units were greater than the carrying values. Accordingly, we did not recognize any impairment charges for goodwill.  A 10 percent decrease in the estimated fair value of our reporting units would not have resulted in any goodwill impairment.  \nWe review our other indefinite-lived intangible assets for impairment annually in the fourth quarter, or as events occur or circumstances change that indicate the assets may be impaired without regard to the business unit. Potential impairment is identified by comparing the fair value of an other indefinite-lived intangible asset to its carrying value. We utilize a relief-from-royalty model to estimate the fair value of other indefinite-lived intangible assets.  We consider the implications of both external (e.g., market growth, competition and local economic conditions) and internal (e.g., product sales and expected product growth) factors and their potential impact on cash flows related to the intangible asset in both the near- and long-term. We also consider the profitability of the business, among other factors, to determine the royalty rate for use in the impairment assessment.\nWe utilize our weighted average cost of capital of approximately 8.50 percent as the basis to determine the discount rate to apply to the estimated future cash flows. In 2024, based upon our assessment of the risks impacting each of our businesses and the nature of the other indefinite-lived intangible assets (i.e., trade name), we applied a risk premium to increase the discount rate to a range of 11.50 percent to 13.50 percent for our other indefinite-lived intangible assets.\nIf the carrying amount of an other indefinite-lived intangible asset exceeds its fair value, an impairment loss is recognized to the extent that an other indefinite-lived intangible asset's recorded carrying value exceeds its fair value, not to exceed the carrying amount of the other indefinite-lived intangible asset.\nIn the fourth quarter of 2024, we estimated that the future discounted cash flows projected for all of our other indefinite-lived intangible assets were greater than the carrying values. Accordingly, we did not recognize any impairment charges for other indefinite-lived intangible assets. A 10 percent decrease in the estimated fair value of our other indefinite-lived intangible assets would have resulted in a $1 million impairment of one of our other indefinite-lived intangible assets. \nRefer to Note H for additional information.\nIncome Taxes\nWe record deferred taxes on the future tax consequences of differences between the financial statement carrying value of our assets and liabilities and their respective tax basis. The realization of deferred tax assets depends on sufficient sources of taxable income in future periods. Possible sources of taxable income include taxable income in carryback periods, the future reversal of existing taxable temporary differences recorded as a deferred tax liability, tax-planning strategies that generate future income or gains and projected future taxable income.\nIf, based upon all available evidence, both positive and negative, it is more likely than not such deferred tax assets will not be realized, a valuation allowance is recorded. Significant weight is given to evidence that is objectively verifiable such as cumulative losses in recent years, however, some evidence may be based on estimates and assumptions regarding potential sources of future taxable income. Changes in these estimates and assumptions may result in a change in judgment regarding the realizability of deferred tax assets.\nRefer to Note P for additional information.\nRecently Adopted and Issued Accounting Pronouncements\nRefer to Note A to the consolidated financial statements for discussion of recently adopted and issued accounting pronouncements, which is incorporated herein by reference.\n30",
  "item2": null
}