{
  "item1": "Masco Corporation its subsidiaries (the “Company”) global leader design, manufacture distribution branded home improvement building products. portfolio industry-leading brands includes BEHR® paint; DELTA® HANSGROHE® faucets, bath shower fixtures; LIBERTY® branded decorative functional hardware; HOT SPRING® spas. leverage powerful brands across product categories, sales channels geographies create value customers shareholders. believe solid results operations financial position 2024 resulted continued focus three strategic pillars: drive full potential core businesses; leverage opportunities across enterprise; actively manage portfolio.",
  "item7": "Management's Discussion Analysis Financial Condition Results Operations. following discussion analysis should read conjunction with, qualified its entirety by, consolidated financial statements (and notes related thereto) other more detailed financial information appearing elsewhere Report. Further, should read following discussion analysis financial condition results operations together “Risk Factors” included elsewhere Report discussion important factors could cause actual results differ materially results described implied forward-looking statements contained following discussion analysis. See also “Cautionary Statement Concerning Forward-Looking Statements” beginning Report.",
  "item2": "part ongoing efforts improve cash flow related liquidity, work suppliers optimize terms conditions, including extending payment terms. also facilitate voluntary supply chain finance program (the \"program\") provide certain suppliers opportunity sell receivables due us participating financial institutions sole discretion both suppliers financial institutions. amounts confirmed valid under program included accounts payable $32 million $36 million September 30, 2025 December 31, 2024, respectively. amounts confirmed valid under program, amounts owed participating financial institutions $22 million $23 million September 30, 2025 December 31, 2024, respectively."
}