{
  "item1": "INDEX BUSINESS Prescription Technology Solutions Medical-Surgical Solutions Investments, Restructuring, Business Combinations, Divestitures Patents, Trademarks, Copyrights, Licenses Government Regulation Other Information about Business Forward-Looking Statements McKesson Corporation together its subsidiaries (collectively, “Company,” “McKesson,” “we,” “our,” “us” other similar pronouns), which traces its business roots 1833, diversified healthcare services leader dedicated advancing health outcomes patients everywhere. teams partner biopharma companies, care providers, pharmacies, manufacturers, governments, others deliver insights, products, services help make quality care more accessible affordable. Company’s fiscal year begins April 1 ends March 31. Unless otherwise noted, all references document particular year refers Company’s fiscal year.",
  "item7": "Years Ended March 31, (Dollars millions) Other segment expense, net Prescription Technology Solutions Medical-Surgical Solutions Total other expense, net Segment operating profit (loss) Prescription Technology Solutions Medical-Surgical Solutions Corporate expenses, net Income continuing operations before income taxes Segment operating profit margin Prescription Technology Solutions Medical-Surgical Solutions Other segment expense, net includes cost sales, total operating expenses, well other income, net, reportable segments. Other segment expense, net U.S. Pharmaceutical segment includes following: credit $206 million provision bad debts $725 million years ended March 31, 2025 2024, respectively, related bankruptcy customer Rite Aid October 2023, further discussed “Trends Uncertainties” cash receipts share antitrust legal settlements $444 million $244 million years ended March 31, 2025 2024, respectively; charge $82 million credit $157 million years ended March 31, 2025 2024, respectively, related LIFO method accounting inventories; restructuring charges $59 million year ended March 31, 2025 restructuring initiatives, discussed Financial Note 3, “Restructuring, Impairment, Related Charges, Net,” consolidated financial statements included Annual Report; charges $57 million $74 million years ended March 31, 2025 2024, respectively, related estimated liability opioid-related claims, discussed Financial Note 17, “Commitments Contingent Liabilities,” consolidated financial statements included Annual Report; loss $43 million year ended March 31, 2025 related one Company’s equity method investments. Other segment expense, net RxTS segment year ended March 31, 2024 includes gain $78 million resulting fair value adjustments contingent consideration liability related RxSS acquisition, discussed more detail Financial Note 2, “Business Acquisitions Divestitures consolidated financial statements included Annual Report.",
  "item2": "McKESSON CORPORATION FINANCIAL REVIEW (CONTINUED) (UNAUDITED) Financial Note 2, “Business Acquisitions Divestitures,” accompanying condensed consolidated financial statements Quarterly Report additional information regarding these acquisition transactions. following summary provides highlights key factors impacted business, operating results, financial condition, liquidity three six months ended September 30, 2025: three months ended September 30, 2025 compared prior year, revenues increased 10%, gross profit increased 9%, total operating expenses decreased 20%, other income, net increased $28 million. six months ended September 30, 2025 compared prior year, revenues increased 16%, gross profit increased 7%, total operating expenses decreased 9%, other income, net decreased $38 million. Refer “ Overview Consolidated Results ” section below analysis these changes; Diluted earnings per common share attributable McKesson Corporation increased $8.92 $1.87 three months ended September 30, 2025 increased $15.16 $8.89 six months ended September 30, 2025 compared respective prior year periods; April 1, 2025, completed acquisition controlling interest PRISM Vision $871 million cash, discussed further detail “Business Acquisitions Divestitures” June 2, 2025, completed acquisition controlling interest Core Ventures $2.5 billion cash, discussed further detail “Business Acquisitions Divestitures” six months ended September 30, 2025, recorded provision bad debts $189 million related bankruptcy customer, Rite Aid Corporation (including certain its subsidiaries, “Rite Aid”); May 8, 2025, entered into syndicated $1.0 billion 364-Day senior unsecured credit facility (the “364-Day Credit Facility”) which scheduled mature May 2026."
}