{
  "source_file": "mck-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nINDEX TO MANAGEMENT’S DISCUSSION AND ANALYSIS\nSection\nPage\nGeneral\n36\nOverview of our Business\n36\nExecutive Summary\n38\nTrends and Uncertainties\n38\nOverview of Consolidated Results\n39\nOverview of Segment Results\n43\nNew Accounting Pronouncements\n47\nFinancial Condition, Liquidity, and Capital Resources\n47\nCautionary Notice About Forward-Looking Statements\n51\nAvailable Information\n51\nGENERAL\nManagement’s discussion and analysis of financial condition and results of operations, referred to as the “Financial Review,” is intended to assist the reader in the understanding and assessment of significant changes and trends related to the results of operations and financial position of McKesson Corporation together with its subsidiaries (collectively, the “Company,” “McKesson,” “we,” “our,” or “us,” and other similar pronouns). This discussion and analysis should be read in conjunction with the condensed consolidated financial statements and accompanying financial notes in Item 1 of Part I of this Quarterly Report on Form 10-Q (“Quarterly Report”) and in Item 8 of Part II of our Annual Report on Form 10-K for the fiscal year ended March 31, 2025 previously filed with the Securities and Exchange Commission (the “SEC”) on May 9, 2025 (“2025 Annual Report”).\nOur fiscal year begins on April 1 and ends on March 31. Unless otherwise noted, all references to a particular year refer to our fiscal year. \nCertain statements in this report constitute forward-looking statements. See \n“Cautionary Notice About Forward-Looking Statements”\n included in this Quarterly Report.\nOverview of our Business:\nWe are a diversified healthcare services leader dedicated to advancing health outcomes for patients everywhere. Our teams partner with biopharma companies, care providers, pharmacies, manufacturers, governments, and others to deliver insights, products, and services to help make quality care more accessible and affordable.\nWe implemented a new segment reporting structure commencing in the second quarter of fiscal 2026, which resulted in four reportable segments: North American Pharmaceutical, Oncology & Multispecialty, Prescription Technology Solutions (“RxTS”), and Medical-Surgical Solutions. \nOur Norwegian operations are included in Other. \nAll prior segment information has been recast to reflect the Company’s new segment structure and current period presentation. Our organizational structure also includes Corporate, which consists of income and expenses associated with administrative functions and projects, as well as the results of certain investments. The factors for determining the reportable segments include the manner in which management evaluates the performance of the Company combined with the nature of individual business activities. We evaluate the performance of our operating segments on a number of measures, including revenues and operating profit before interest expense and income taxes.\n36\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nThe following summarizes our four reportable segments. Refer to \nFinancial Note 13, “Segments of Business,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for further information regarding our reportable segments.\n•\nNorth American Pharmaceutical\n is a reportable segment that provides distribution and logistics services for branded, generic, specialty, biosimilar and over-the-counter pharmaceutical drugs along with other healthcare-related products to wholesale and institutional customers in the United States (“U.S.”) and Canada. In addition, the segment sells financial, operational, and clinical solutions to pharmacies (retail, hospital, alternate sites) and provides consulting, outsourcing, technological, and other services. The U.S. distribution operations was previously included in the former U.S. Pharmaceutical reportable segment and the Canadian operations was previously included in the former International reportable segment.\n•\nOncology & Multispecialty\n is a reportable segment that includes provider solutions that encompass specialty drug distribution, group purchasing organizations, infusion services, direct to patient pharmacy capabilities, cell and gene therapy services with InspiroGene, technology solutions, practice consulting services, and vaccine distribution. \nIn addition, the segment supports one of the largest networks of physician-led, integrated, community-based oncology \npractices dedicated to advancing high-quality, evidence-based cancer care in the U.S. The segment also includes PRISM Vision Holdings, LLC (“PRISM Vision”), which \ndrives patient outcomes in a retina and ophthalmology setting. Combined with Sarah Cannon Research Institute and our technology business, Ontada, this segment provides research, insights, technologies, and services that address and improve cancer and specialty care. \nThis segment was previously reflected in the former U.S. Pharmaceutical reportable segment.\n•\nPrescription Technology Solutions \nis a reportable segment that combines automation and our ability to navigate the healthcare ecosystem to connect patients, pharmacies, providers, pharmacy benefit managers, health plans, and biopharma companies to address patients’ medication access, affordability, and adherence challenges. RxTS offers technology services, which includes electronic prior authorization, prescription price transparency, benefit insight, dispensing support services, in addition to third-party logistics, and wholesale distribution support across various therapeutic categories and temperature ranges to biopharma customers throughout the product lifecycle.\n•\nMedical-Surgical Solutions\n is a reportable segment that provides medical-surgical supply distribution, logistics, and other services to healthcare providers, operating in ambulatory care environments, such as physician offices, surgery centers, and hospital reference labs, as well as extended care settings, including nursing homes and home health care agencies. This segment offers national brand medical-surgical products as well as McKesson’s own line of high-quality products through a network of distribution centers within the U.S. On May 8th, 2025, we announced our intention to separate this segment into an independent company.\nOur Norwegian operations, which provide distribution and services to wholesale and retail customers in Norway where we own, partner, or franchise with retail pharmacies, were previously included in the International reportable segment and are now included in Other. During the six months ended September 30, 2025, we entered into a definitive agreement to sell our businesses in Norway, and classified the assets and liabilities as held for sale (“Norway disposal group”). The transaction is subject to customary closing conditions, including receipt of required regulatory approvals. Refer to \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n for more information.\nBusiness Acquisitions and Divestitures\nPRISM Vision Holdings, LLC\nOn April 1, 2025, we completed the acquisition of a controlling interest in PRISM Vision, a leading provider of general ophthalmology and retina administrative services. We acquired an 80% interest in PRISM Vision for $871 million in cash and prior owners, including management and physicians in PRISM Vision practices, retained a 20% ownership interest. As of the acquisition date, the financial results of PRISM Vision are reported within our Oncology & Multispecialty segment.\nCommunity Oncology Revitalization Enterprise Ventures, LLC\nOn June 2, 2025, we completed the acquisition of a controlling interest in Community Oncology Revitalization Enterprise Ventures, LLC (“Core Ventures”), a business and administrative services organization established by Florida Cancer Specialists & Research Institute, LLC, (“FCS”). We acquired a 70% controlling interest in Core Ventures for $2.5 billion in cash and FCS physicians retained 30% interest. As of the acquisition date, Core Ventures is a part of the Oncology platform and financial results are reported within our Oncology & Multispecialty segment.\n37\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nRefer to \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report for additional information regarding these acquisition transactions.\nExecutive Summary: \nThe following summary provides highlights and key factors that impacted our business, operating results, financial condition, and liquidity for the three and six months ended September 30, 2025:\n•\nFor the three months ended September 30, 2025 compared to the prior year, revenues increased by 10%, gross profit increased by 9%, total operating expenses decreased by 20%, and other income, net increased by $28 million. \n•\nFor the six months ended September 30, 2025 compared to the prior year, revenues increased by 16%, gross profit increased by 7%, total operating expenses decreased by 9%, and other income, net decreased by $38 million. Refer to the “\nOverview of Consolidated Results\n” section below for an analysis of these changes;\n•\nDiluted earnings per common share attributable to McKesson Corporation increased to $8.92 from $1.87 for the three months ended September 30, 2025 and increased to $15.16 from $8.89 for the six months ended September 30, 2025 compared to the respective prior year periods;\n•\nOn April 1, 2025, we completed the acquisition of a controlling interest in PRISM Vision for $871 million in cash, as discussed in further detail in the \n“Business Acquisitions and Divestitures”\n section above;\n•\nOn June 2, 2025, we completed the acquisition of a controlling interest in Core Ventures for $2.5 billion in cash, as discussed in further detail in the \n“Business Acquisitions and Divestitures”\n section above;\n•\nFor the six months ended September 30, 2025, we recorded a provision for bad debts of $189 million related to the bankruptcy of our customer, Rite Aid Corporation (including certain of its subsidiaries, “Rite Aid”);\n•\nOn May 8, 2025, we entered into a syndicated $1.0 billion 364-Day senior unsecured credit facility (the “364-Day Credit Facility”) which is scheduled to mature in May 2026. Refer to \nFinancial Note 8, “Debt and Financing Activities,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report for additional information;\n•\nOn May 30, 2025, we completed a public debt offering of 4.65% Notes due May 30, 2030 in a principal amount of $650 million, 4.95% Notes due May 30, 2032 in a principal amount of $650 million, and 5.25% Notes due May 30, 2035 in a principal amount of $700 million, for total proceeds received, net of discounts and debt offering expenses, of $2.0 billion. The net proceeds from these notes in addition to cash on hand were utilized to fund the purchase of the interest in Core Ventures. Refer to \nFinancial Note 8, “Debt and Financing Activities,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report for additional information;\n•\nDuring the six months ended September 30, 2025, we returned $1.6 billion of cash to shareholders through $1.4 billion of common stock repurchases in open market transactions and $179 million of dividend payments. The total remaining authorization outstanding for repurchases of the Company’s common stock at September 30, 2025 was $6.1 billion; and\n•\nOn July 29, 2025, our Board of Directors (the “Board”) raised our quarterly dividend to $0.82 from $0.71 per share of common stock.\nTrends and Uncertainties:\nGovernment Policies\nAs described in “Item 1. Government Regulation” and “Item 1A - Risk Factors” in Part I of our 2025 Annual Report, our industry is highly regulated and is subject to risks and uncertainty caused by the volume and speed of changes to regulatory policies. Changes in U.S. federal regulatory posture and law may result in significant changes in healthcare policy, government funding of healthcare costs, and other laws affecting our operations, but the ultimate outcomes are difficult to predict.\n38\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nRESULTS OF OPERATIONS\nOverview of Consolidated Results:\n(Dollars in millions, except per share data)\nThree Months Ended September 30, \n \nSix Months Ended September 30, \n \n2025\n2024\nChange\n2025\n2024\nChange\nRevenues\n$\n103,150 \n$\n93,651 \n10 \n%\n$\n200,977 \n$\n172,934 \n16 \n%\nGross profit\n3,542 \n3,248 \n9 \n6,821 \n6,400 \n7 \nGross profit margin\n3.43 \n%\n3.47 \n%\n(4)\nbp\n3.39 \n%\n3.70 \n%\n(31)\nbp\nTotal operating expenses\n$\n(2,135)\n$\n(2,670)\n(20)\n%\n$\n(4,378)\n$\n(4,793)\n(9)\n%\nTotal operating expenses as a percentage of revenues\n2.07 \n%\n2.85 \n%\n(78)\nbp\n2.18 \n%\n2.77 \n%\n(59)\nbp\nOther income, net\n$\n62 \n$\n34 \n82 \n%\n$\n126 \n$\n164 \n(23)\n%\nInterest expense\n(74)\n(78)\n(5)\n(123)\n(153)\n(20)\nIncome before income taxes\n1,395 \n534 \n161 \n2,446 \n1,618 \n51 \nIncome tax expense\n(232)\n(247)\n(6)\n(452)\n(371)\n22 \nReported income tax rate\n16.6 \n%\n46.3 \n%\n(2,970)\nbp\n18.5 \n%\n22.9 \n%\n(440)\nbp\nNet income\n1,163 \n287 \n305 \n1,994 \n1,247 \n60 \nNet income attributable to noncontrolling interests\n(53)\n(46)\n15 \n(100)\n(91)\n10 \nNet income attributable to McKesson Corporation\n$\n1,110 \n$\n241 \n361 \n%\n$\n1,894 \n$\n1,156 \n64 \n%\nDiluted earnings per common share attributable to McKesson Corporation\n$\n8.92 \n$\n1.87 \n377 \n%\n$\n15.16 \n$\n8.89 \n71 \n%\nWeighted-average diluted common shares outstanding\n124.4 \n129.3 \n(4)\n%\n124.9 \n130.0 \n(4)\n%\nAny percentage changes displayed above which are not meaningful are displayed as zero percent.\nbp - basis point\nRevenues \nRevenues increased for the three and six months ended September 30, 2025 compared to the same prior year periods, primarily due to market growth in our North American Pharmaceutical segment, including higher volumes largely from retail national account customers. Market growth includes growing drug utilization and newly launched products, partially offset by branded to generic drug conversion. Revenues for the three and six months ended September 30, 2025 was also favorably impacted by growth in our Oncology & Multispecialty segment primarily due to higher specialty pharmaceutical sales.\nGross Profit \nGross profit increased for the three and six months ended September 30, 2025 compared to the same prior year periods primarily due to growth in our Oncology & Multispecialty segment, driven by the addition of providers in practice management and growth of specialty pharmaceuticals, and in our Prescription Technology Solutions segment, driven by higher volumes.\nWe recognized immaterial gains \nand \n$63 million for the three months ended September 30, 2025 and 2024, respectively, and $8 million and $153 million for the six months ended September 30, 2025 and 2024, respectively, related to our share of antitrust legal settlements. We recognized these amounts within \"Cost of sales\" in the Condensed Consolidated Statements of Operations within our North American Pharmaceutical segment.\n39\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nGross profit for the three and six months ended September 30, 2024 was impacted by restructuring charges of $63 million related to a broad set of initiatives to drive operational efficiencies and increase cost optimization efforts as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report. We recorded this amount\n \nrelated to impairment of inventories within \"Cost of sales\" in the Condensed Consolidated Statements of Operations within our North American Pharmaceutical segment.\nTotal Operating Expenses\nA summary of the components of our total operating expenses for the three and six months ended September 30, 2025 and 2024 is as follows: \n•\nSelling, distribution, general, and administrative expenses (“SDG&A”):\n consists of personnel costs, transportation costs, depreciation and amortization, lease costs, professional fee expenses, administrative expenses, provision for bad debts and related recoveries, remeasurement charges to fair value less costs to sell, and other general charges.\n•\nClaims and litigation charges, net:\n These charges include adjustments for estimated probable settlements related to our controlled substance monitoring and reporting, and opioid-related claims, as well as any applicable income items or credit adjustments due to subsequent changes in estimates. Legal fees to defend claims, which are expensed as incurred, are included within SDG&A.\n•\nRestructuring, impairment, and related charges, net:\n Charges recorded under this component include those incurred for programs in which we change our operations, the scope of a business undertaken by our business units, or the manner in which that business is conducted, as well as long-lived asset impairments.\nThree Months Ended September 30, \nSix Months Ended September 30, \n(Dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nSelling, distribution, general, and administrative expenses\n$\n2,074 \n$\n2,503 \n(17)\n%\n$\n4,270 \n$\n4,504 \n(5)\n%\nClaims and litigation charges, net\n(2)\n(4)\n(50)\n(2)\n108 \n(102)\nRestructuring, impairment, and related charges, net\n63 \n171 \n(63)\n110 \n181 \n(39)\nTotal operating expenses\n$\n2,135 \n$\n2,670 \n(20)\n%\n$\n4,378 \n$\n4,793 \n(9)\n%\nPercent of revenues\n2.07 \n%\n2.85 \n%\n(78)\nbp\n2.18 \n%\n2.77 \n%\n(59)\nbp\nAny percentage changes displayed above which are not meaningful are displayed as zero percent.\nbp - basis point\nFor the three and six months ended September 30, 2025, total operating expenses and total operating expenses as a percentage of revenues decreased compared to the same prior year periods. Total operating expenses were impacted by the following significant items:\n•\nSDG&A for the three and six months ended September 30, 2024 includes charges of $643 million to remeasure the sale of our Rexall and Well.ca businesses in Canada (“Canadian retail disposal group”) to fair value less costs to sell. The remeasurement adjustment includes a $15 million loss related to the accumulated other comprehensive loss balances associated with this disposal. Of the total charges recorded during the period, $593 million were included within our North American Pharmaceutical segment and $50 million were included within Corporate expenses, net;\n•\nSDG&A for the three and six months ended September 30, 2025 was impacted by lower operating expenses from the completed divestiture of our Canadian retail disposal group in fiscal 2025, as discussed in more detail in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report;\n•\nSDG&A for the six months ended September 30, 2025 includes a provision for bad debts of $189 million, and for the three and six months ended September 30, 2024 includes a credit of $203 million related to the bankruptcy of Rite Aid;\n \n40\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\n•\nSDG&A for the six months ended September 30, 2025 was impacted by higher operating expenses related to the acquisitions completed during the first half of fiscal 2026, as discussed in more detail in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report;\n•\nClaims and litigation charges, net primarily consists of a charge of $108 million for the six months ended September 30, 2024 related to our estimated liability for opioid-related claims as discussed in more detail in \nFinancial Note 11, “Commitments and Contingent Liabilities,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; and\n•\nRestructuring, impairment, and related charges, net were $63 million and $171 million for the three months ended September 30, 2025 and 2024, respectively, and $110 million and $181 million for the six months ended September 30, 2025 and 2024, respectively, as discussed below under “Restructuring Initiatives.”\nGoodwill Impairment\nWe evaluate goodwill for impairment on an annual basis in the first fiscal quarter, and at an interim date if indicators of potential impairment exist. The annual impairment testing performed in fiscal 2026 and fiscal 2025 did not indicate any impairment of goodwill, and no goodwill impairment charges were recorded during the three and six months ended September 30, 2025 and 2024. However, other risks, expenses, and future developments, such as government actions, increased regulatory uncertainty, and material changes in key market assumptions limit our ability to estimate projected cash flows, which could adversely affect the fair value of various reporting units in future periods.\nFor additional disclosure of our policy regarding goodwill, refer to the “Critical Accounting Estimates” section within Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations in Part II of our 2025 Annual Report.\nRestructuring Initiatives\nWe recorded restructuring, impairment, and related charges of $63 million and $171 million for the three months ended September 30, 2025 and 2024, respectively, and $110 million and $181 million for the six months ended September 30, 2025 and 2024, respectively. These charges were included in “Restructuring, impairment, and related charges, net” in the Condensed Consolidated Statements of Operations.\nDuring the second quarter of fiscal 2025, we approved enterprise-wide initiatives to modernize and accelerate our technology service operating model, which were intended to improve business continuity, compliance, operating efficiency and advance investments to streamline the organization. These initiatives include cost reduction efforts and support other rationalization efforts within Corporate, and the Medical-Surgical Solutions and North American Pharmaceutical segments to help realize long-term sustainable growth. We anticipate total charges related to these initiatives of $650 million to $700 million, consisting primarily of employee severance and other employee-related costs as well as facility, exit, and other related costs, including long-lived asset impairments. These programs are anticipated to be substantially complete in fiscal 2028. We recorded charges of $52 million and $90 million for the three and six months ended September 30, 2025, respectively, and $227 million for the three and six months ended September 30, 2024 related to these initiatives, which primarily includes severance and other employee-related costs as well as facility exit and other related costs, including\n \nlong-lived asset impairments and a $63 million related to inventory impairments recorded within “Cost of sales” in the Condensed Consolidated Statements of Operations.\nRefer to \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for further information on our restructuring initiatives.\nOther Income, Net\nOther income, net for the three and six months ended September 30, 2025 compared to the same prior year periods was impacted by net gains from certain investments in our equity securities and a favorable impact from interest income. Other income, net for the six months ended September 30, 2025 compared to the same prior year period was impacted by a prior year net gain of $95 million related to our investments in equity securities of certain U.S. growth stage companies in the healthcare industry, partially offset by a prior year loss of $43 million related to one of our equity method investments.\n41\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nInterest Expense\nInterest expense decreased for the three and six months ended September 30, 2025 compared to the same prior year periods primarily due to changes in our derivative portfolio in fiscal 2026 and increased capitalized interest from higher capital spending, partially offset by interest from increased average balances of the Company’s loan portfolio in fiscal 2026. Interest expense may fluctuate based on timing, amounts, and interest rates of term debt repaid and new term debt issued, as well as amounts incurred associated with financing fees. Refer to \nFinancial Note 8, “Debt and Financing Activities,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for more information.\nIncome Tax Expense\nFor the three months ended September 30, 2025 and 2024, we recorded income tax expense of $232 million and $247 million, respectively. For the six months ended September 30, 2025 and 2024, we recorded income tax expense of $452 million and $371 million, respectively. Our reported income tax rates were 16.6% and 46.3% for the three months ended September 30, 2025 and 2024, respectively, and 18.5% and 22.9% for the six months ended September 30, 2025 and 2024, respectively.\nFluctuations in our reported income tax rates are primarily due to changes in our business mix of earnings among various taxing jurisdictions and discrete tax items recognized in the quarters. Refer to \nFinancial Note 4, “Income Taxes,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for more information.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted into law, introducing modifications to various U.S. federal tax provisions. We have evaluated the implications of the legislation and concluded that the provisions of the OBBBA are not expected to have a material impact on our consolidated financial position, results of operations, or cash flows.\nNet Income Attributable to Noncontrolling Interests\nNet income attributable to noncontrolling interests for the three and six months ended September 30, 2025 and 2024 primarily represents the proportionate results of third-party equity interests in ClarusONE Sourcing Services LLP, Vantage Oncology Holdings, LLC, and SCRI Oncology, LLC.\nNoncontrolling interests with redemption features, such as put rights, that are not solely within our control are considered redeemable noncontrolling interests. During the six months ended September 30, 2025, we initially recognized redeemable noncontrolling interests of $700 million and $25 million related to our acquisitions of Core Ventures and PRISM Vision, respectively. As a result of the quarterly valuation process, we recorded an adjustment to the redemption value of the redeemable noncontrolling interests of $2 million for PRISM Vision and $45 million for Core Ventures. Redeemable noncontrolling interests are presented outside of stockholders’ deficit in the Company’s Condensed Consolidated Balance Sheet. Refer to the “\nSelected Measures of Liquidity and Capital Resources\n” section of this Financial Review and \nFinancial Note 5, “Redeemable Noncontrolling Interests and Noncontrolling Interests,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for more information on changes to our redeemable and noncontrolling interests during the first half of fiscal 2026.\nNet Income Attributable to McKesson Corporation\nNet income attributable to McKesson Corporation was $1.1 billion and $241 million for the three months ended September 30, 2025 and 2024, respectively, and $1.9 billion and $1.2 billion for the six months ended September 30, 2025 and 2024, respectively. Diluted earnings per common share attributable to McKesson Corporation was $8.92 and $1.87 for the three months ended September 30, 2025 and 2024, respectively, and $15.16 and $8.89 for the six months ended September 30, 2025 and 2024, respectively. Our diluted earnings per share includes the cumulative effects of share repurchases during each period.\nWeighted-Average Diluted Common Shares Outstanding\nDiluted earnings per common share was calculated based on a weighted-average number of shares outstanding of 124.4 million and 129.3 million for the three months ended September 30, 2025 and 2024, respectively, and 124.9 million and 130.0 million for the six months ended September 30, 2025 and 2024, respectively. Weighted-average diluted shares outstanding for the three and six months ended September 30, 2025 decreased from the same prior year periods primarily due to the cumulative effect of share repurchases, as discussed in the “\nShare Repurchases Plans\n” section of this Financial Review.\n42\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nOverview of Segment Results:\nSegment Revenues:\n \nThree Months Ended September 30, \n \nSix Months Ended September 30, \n \n(Dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nSegment revenues\nNorth American Pharmaceutical\n$\n86,481 \n$\n80,018 \n8 \n%\n$\n169,210 \n$\n146,366 \n16 \n%\nOncology & Multispecialty\n12,044 \n9,157 \n32 \n22,702 \n17,938 \n27 \nPrescription Technology Solutions\n1,376 \n1,265 \n9 \n2,810 \n2,506 \n12 \nMedical-Surgical Solutions\n2,947 \n2,946 \n— \n5,648 \n5,578 \n1 \nOther\n302 \n265 \n14 \n607 \n546 \n11 \nTotal revenues\n$\n103,150 \n$\n93,651 \n10 \n%\n$\n200,977 \n$\n172,934 \n16 \n%\nAny percentage changes displayed above which are not meaningful are displayed as zero percent.\nNorth American Pharmaceutical\nThree Months Ended September 30, 2025 vs. 2024\nNorth American Pharmaceutical revenues for the three months ended September 30, 2025 increased $6.5 billion or\n \n8% compared to the same prior year period. Within the segment, sales to U.S. pharmacies and healthcare providers increased $6.4 billion primarily due to higher volumes from retail national account customers, partially offset by branded to generic drug conversions.\nSix Months Ended September 30, 2025 vs. 2024\nNorth American Pharmaceutical revenues for the six months ended September 30, 2025 increased $22.8 billion or\n \n16% compared to the same prior year period. Within the segment, sales to U.S. pharmacies and healthcare providers increased $22.8 billion primarily due to higher volumes from retail national account customers, partially offset by branded to generic drug conversions.\nOncology & Multispecialty\nThree Months Ended September 30, 2025 vs. 2024\nOncology & Multispecialty revenues for the three months ended September 30, 2025 increased $2.9 billion or 32% compared to the same prior year period primarily driven by growth in provider solutions due to the addition of providers within practice management and higher specialty pharmaceutical sales.\nSix Months Ended September 30, 2025 vs. 2024\nOncology & Multispecialty revenues for the six months ended September 30, 2025 increased $4.8 billion or 27% compared to the same prior year period primarily driven by growth in provider solutions due to the addition of providers within practice management and higher specialty pharmaceutical sales.\nPrescription Technology Solutions\nThree Months Ended September 30, 2025 vs. 2024\nRxTS revenues for the three months ended September 30, 2025 increased $111 million or 9% compared to the same prior year period due to increased volumes from our third-party logistics and higher technology services revenues.\n43\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nSix Months Ended September 30, 2025 vs. 2024\nRxTS revenues for the six months ended September 30, 2025 increased $304 million or 12% compared to the same prior year period due to increased volumes from our third-party logistics and higher technology services revenues.\nMedical-Surgical Solutions\nThree Months Ended September 30, 2025 vs. 2024\nMedical-Surgical Solutions revenues for the three months ended September 30, 2025 increased $1 million compared to the same prior year period. Within the segment, sales to ambulatory care customers increased $7 million driven by underlying business growth and other sales increased by $6 million. These increases were partially offset by sales to extended care customers which decreased by $12 million.\nSix Months Ended September 30, 2025 vs. 2024\nMedical-Surgical Solutions revenues for the six months ended September 30, 2025 increased $70 million or 1% compared to the same prior year period. Within the segment, sales to ambulatory care customers increased $66 million driven by underlying business growth and other sales increased by $18 million. These increases were partially offset by sales to extended care customers which decreased by $14 million.\nOther Segment Expense, Segment Operating Profit and Corporate Expenses, Net:\n \nThree Months Ended September 30, \n \n \nSix Months Ended September 30, \n \n \n(Dollars in millions)\n2025\n2024\nChange\n2025\n2024\nChange\nOther segment expense, net \n(1) \nNorth American Pharmaceutical \n(2)\n$\n85,629 \n$\n79,671 \n7 \n%\n$\n167,764 \n$\n145,317 \n15 \n%\nOncology & Multispecialty \n(3)\n11,712 \n8,957 \n31 \n22,158 \n17,590 \n26 \nPrescription Technology Solutions\n1,132 \n1,060 \n7 \n2,313 \n2,098 \n10 \nMedical-Surgical Solutions \n(4)\n2,727 \n2,855 \n(4)\n5,207 \n5,295 \n(2)\nOther\n274 \n252 \n9 \n566 \n516 \n10 \nTotal other segment expense, net\n$\n101,474 \n$\n92,795 \n9 \n%\n$\n198,008 \n$\n170,816 \n16 \n%\nSegment operating profit\nNorth American Pharmaceutical\n$\n852 \n$\n347 \n146 \n%\n$\n1,446 \n$\n1,049 \n38 \n%\nOncology & Multispecialty\n332 \n200 \n66 \n544 \n348 \n56 \nPrescription Technology Solutions\n244 \n205 \n19 \n497 \n408 \n22 \nMedical-Surgical Solutions\n220 \n91 \n142 \n441 \n283 \n56 \nOther\n28 \n13 \n115 \n41 \n30 \n37 \nSubtotal\n1,676 \n856 \n96 \n2,969 \n2,118 \n40 \nCorporate expenses, net \n(5)\n(207)\n(244)\n(15)\n(400)\n(347)\n15 \nInterest expense\n(74)\n(78)\n(5)\n(123)\n(153)\n(20)\nIncome before income taxes\n$\n1,395 \n$\n534 \n161 \n%\n$\n2,446 \n$\n1,618 \n51 \n%\nSegment operating profit margin\nNorth American Pharmaceutical\n0.99 \n%\n0.43 \n%\n56 \nbp\n0.85 \n%\n0.72 \n%\n13 \nbp\nOncology & Multispecialty\n2.76 \n2.18 \n58 \n2.40 \n1.94 \n46 \nPrescription Technology Solutions\n17.73 \n16.21 \n152 \n17.69 \n16.28 \n141 \nMedical-Surgical Solutions\n7.47 \n3.09 \n438 \n7.81 \n5.07 \n274 \nOther\n9.27 \n4.91 \n436 \n6.75 \n5.49 \n126 \n44\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nAny percentage changes displayed above which are not meaningful are displayed as zero percent.\nbp - basis point\n(1)\nOther segment expense, net includes cost of sales, total operating expenses, as well as other income, net, for our reportable segments. \n(2)\nOther segment expense, net for our North American Pharmaceutical segment includes the following:\n•\na provision for bad debts of $189 million for the six months ended September 30, 2025 and a credit of $203 million for the three and six months ended September 30, 2024 related to the bankruptcy of our customer Rite Aid;\n•\ncash receipts for our share of antitrust legal settlements were immaterial and $63 million for the three months ended September 30, 2025 and 2024, respectively, and $8 million and $153 million for the six months ended September 30, 2025 and 2024, respectively;\n•\na charge of $593 million for the three and six months ended September 30, 2024 to remeasure the assets and liabilities of the Canadian retail disposal group to fair value less costs to sell, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; \n•\nrestructuring charges of $63 million and $65 million for the three and six months ended September 30, 2024, respectively, for restructuring initiatives as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; and\n•\na charge of $57 million for the six months ended September 30, 2024 related to our estimated liability for opioid-related claims as discussed in \nFinancial Note 11, “Commitments and Contingent Liabilities,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\n(3)\nOther segment expense, net for our Oncology & Multispecialty segment includes the following:\n•\na net gain of $51 million for the three and six months ended September 30, 2025 related to the sale of an investment and market decisions; and\n•\na loss of $43 million for the six months ended September 30, 2024 related to one of the Company’s equity method investments.\n(4)\nOther segment expense, net for our Medical-Surgical Solutions segment for the three and six months ended September 30, 2024 includes restructuring charges of $144 million related to a broad set of initiatives to drive operational efficiencies and increase cost optimization efforts as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\n(5)\nCorporate expenses, net includes the following:\n•\na charge of $50 million for the three and six months ended September 30, 2024 related to the effect of accumulated other comprehensive loss components from our Canadian retail disposal group, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; \n•\na net gain of $95 million for the six months ended September 30, 2024 related to our investments in equity securities of certain U.S. growth stage companies in the healthcare industry, as discussed in \nFinancial Note 10, “Fair Value Measurements,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; \n•\na net charge of $51 million for the six months ended September 30, 2024 related to our estimated liability for opioid-related claims as discussed in \nFinancial Note 11, “Commitments and Contingent Liabilities,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report; and\n•\nrestructuring charges of $38 million and $23 million for the three months ended September 30, 2025 and 2024, respectively, and charges of $67 million and $24 million for the six months ended September 30, 2025 and 2024, respectively, for restructuring initiatives as discussed in \nFinancial Note 3, “Restructuring, Impairment, and Related Charges, Net,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nNorth American Pharmaceutical\nThree Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the three months ended September 30, 2025 compared to the same prior year period largely due to prior year remeasurement charges related to our Canadian retail disposal group held for sale, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report and higher pharmaceutical distribution volumes across the segment, partially offset by a prior year credit of $203 million related to the bankruptcy of Rite Aid and a decrease from net cash proceeds received representing our share of antitrust legal settlements.\n45\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nSix Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the six months ended September 30, 2025 compared to the same prior year period primarily due to prior year remeasurement charges related to our Canadian retail disposal group held for sale, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report, higher pharmaceutical distribution volumes across the segment, and a prior year charge of $57 million related to our estimated liability for opioid-related claims. These increases are partially offset by a prior year credit of $203 million and a current year provision for bad debts of $189 million related to the bankruptcy of Rite Aid, a decrease from net cash proceeds received representing our share of antitrust legal settlements, and an increase in operating expenses to support higher volumes.\nOncology & Multispecialty\nThree Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the three months ended September 30, 2025 compared to the same prior year period primarily due to growth in specialty pharmaceuticals and a net gain of $51 million related to the sale of an investment and market decisions, partially offset by an increase in operating expenses to support higher volumes.\nSix Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the six months ended September 30, 2025 compared to the same prior year period primarily due to growth in specialty pharmaceuticals, a net gain of $51 million related to the sale of an investment and market decisions, and a prior year loss of $43 million related to one of our equity method investments, partially offset by an increase in operating expenses to support higher volumes.\nPrescription Technology Solutions\nThree Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the three months ended September 30, 2025 compared to the same prior year period driven by increased volumes primarily from growth in our technology services.\nSix Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the six months ended September 30, 2025 compared to the same prior year period driven by increased volumes primarily from growth in our technology services.\nMedical-Surgical Solutions\nThree Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the three months ended September 30, 2025 compared to the same prior year period primarily due to lower expenses resulting from business rationalization initiatives, partially offset by a decline in the contribution from our ambulatory care and extended care businesses.\nSix Months Ended September 30, 2025 vs. 2024\nOperating profit for this segment increased for the six months ended September 30, 2025 compared to the same prior year period primarily due to lower expenses resulting from business rationalization initiatives, partially offset by a decline in the contribution from our ambulatory care and extended care businesses.\nCorporate Expenses, Net\nThree Months Ended September 30, 2025 vs. 2024\nCorporate expenses, net decreased for the three months ended September 30, 2025 compared to the same prior year period primarily due to prior year remeasurement charges related to our Canadian retail disposal group held for sale, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report and a favorable impact to our equity investments and interest income, partially offset by higher restructuring charges compared to prior year.\n46\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nSix Months Ended September 30, 2025\nCorporate expenses, net increased for the six months ended September 30, 2025 compared to the same prior year period primarily due to prior year gains related to our investments in equity securities of certain U.S. growth stage companies in the healthcare industry, higher restructuring charges compared to prior year, partially offset by lower litigation charges in the current year compared to prior year and prior year remeasurement charges related to our Canadian retail disposal group held for sale, as discussed in \nFinancial Note 2, “Business Acquisitions and Divestitures”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nNew Accounting Pronouncements\nNew accounting pronouncements that we have recently adopted as well as those that have been recently issued but not yet adopted by us are included in \nFinancial Note 1, “Significant Accounting Policies,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nFINANCIAL CONDITION, LIQUIDITY, AND CAPITAL RESOURCES \nWe expect our available cash generated from operations and our short-term investment portfolio, together with our existing sources of liquidity from our credit facilities, commercial paper program, and other borrowings will be sufficient to fund our short-term and long-term capital expenditures, working capital, and other cash requirements. We remain adequately capitalized, including access to liquidity from our $4.0 billion revolving credit facility and $1.0 billion 364-day credit facility. At September 30, 2025, we were in compliance with all debt covenants, and believe we have the ability to continue to meet our debt covenants in the future.\nThe following table summarizes the net change in cash, cash equivalents, and restricted cash for the periods shown: \nSix Months Ended September 30, \n(Dollars in millions)\n2025\n2024\nChange\nNet cash provided by (used in):\nOperating activities\n$\n1,502 \n$\n720 \n$\n782 \nInvesting activities\n(3,588)\n(373)\n(3,215)\nFinancing activities\n215 \n(2,408)\n2,623 \nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n24 \n1 \n23 \nChange in cash, cash equivalents, and restricted cash classified as Assets held for sale\n— \n(14)\n14 \nNet change in cash, cash equivalents, and restricted cash\n$\n(1,847)\n$\n(2,074)\n$\n227 \nOperating Activities\nOperating activities provided cash of $1.5 billion and $720 million during the six months ended September 30, 2025 and 2024, respectively. Cash flows from operations can be significantly impacted by factors such as the timing of receipts from customers, inventory receipts, and payments to vendors. Additionally, working capital is primarily a function of sales and purchase volumes, inventory requirements, and vendor payment terms.\nFor the six months ended September 30, 2025, net cash used by operating activities increased by $782 million compared to the same prior year period. This increase was primarily due to the following:\n•\nthe Company’s net income increased by $747 million and was impacted by lower net non-cash items of $450 million, compared to the same prior year period driven by factors discussed in more detail in the \n“Overview of Consolidated Results”\n section of this Financial Review;\n•\nan increase in net cash of $1.2 billion related to accounts receivable is primarily due to favorable timing of collections;\n•\nan increase in cash from other assets and liabilities primarily related to lower contract liability payments; and\n•\na decrease in cash of $1.1 billion related to accounts payable as a result of customary vendor payment scheduling, partially offset by an increase in cash of $111 million due to lower inventory requirements during the period.\n47\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nInvesting Activities\nInvesting activities used cash of $3.6 billion and $373 million during the six months ended September 30, 2025 and 2024, respectively. Investing activities for the six months ended September 30, 2025 includes $3.4 billion of net cash payments for acquisitions, including $2.5 billion and $871 million for the acquisitions of the interests in Core Ventures and PRISM Vision, respectively, as discussed in further detail in \nFinancial Note 2, “Business Acquisitions and Divestitures,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report. Investing activities for the six months ended September 30, 2025 and 2024 includes $385 million and $385 million, respectively, in capital expenditures for property, plant, and equipment and capitalized software. Investing activities for the six months ended September 30, 2025 was also impacted by the receipt of proceeds of $133 million related to the sale of businesses and investments, as discussed in \nFinancial Note 10, “Fair Value Measurements,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nInvesting activities for the six months ended September 30, 2024 was also impacted by the receipt of proceeds of $92 million related to the sale of equity securities, as discussed in \nFinancial Note 10, “Fair Value Measurements,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nFinancing Activities\nFinancing activities provided cash of $215 million and used cash of $2.4 billion during the six months ended September 30, 2025 and 2024, respectively, which includes $1.4 billion and $2.0 billion of cash paid for share repurchases, respectively, as well as $179 million\n \nand $162 million of cash paid for dividends, respectively. Financing activities for the six months ended September 30, 2024 also includes cash receipts and cash payments each of $2.3 billion and $6.9 billion for the six months ended September 30, 2025 and 2024, respectively, related to short-term borrowings of commercial paper.\nOn May 30, 2025, we completed a public debt offering of 4.65% Notes due May 30, 2030 in a principal amount of $650 million, 4.95% Notes due May 30, 2032 in a principal amount of $650 million, and 5.25% Notes due May 30, 2035 in a principal amount of $700 million, for total proceeds received, net of discounts and debt offering expenses, of $2.0 billion. The net proceeds from these notes were utilized to fund the purchase of the interest in Core Ventures. Refer to \nFinancial Note 8, “Debt and Financing Activities,”\n to the accompanying condensed consolidated financial statements in this Quarterly Report for additional information.\n On September 10, 2024, we completed a public offering of 4.25% Notes due September 15, 2029 in a principal amount of $500 million. Proceeds received from this note issuance, net of discounts and offering expenses, were approximately $496 million. We utilized the net proceeds from this note issuance along with cash on hand to redeem our $500 million outstanding principal amount of 5.25% Notes due February 15, 2026 prior to maturity at a redemption price equal to 100% of the principal amount plus accrued and unpaid interest through the settlement date.\nCash used for other financing activities generally includes the cash value of shares surrendered for tax withholding and payments to noncontrolling interests.\nShare Repurchase Plans\nThe Board has authorized the repurchase of common stock. We may repurchase common stock from time-to-time through open market transactions, privately negotiated transactions, accelerated share repurchase programs, or by combinations of such methods, any of which may use pre-arranged trading plans that are designed to meet the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934 (“Exchange Act”). The timing of any repurchases and the actual number of shares repurchased will depend on a variety of factors, including our stock price, corporate and regulatory requirements, tax implications, restrictions under our debt obligations, other uses for capital, impacts on the value of remaining shares, cash generated from operations, and market and economic conditions.\nExcise taxes of $8 million and $15 million were accrued for shares repurchased during the three months ended September 30, 2025 and 2024, respectively. Excise taxes of $10 million and $16 million were accrued for shares repurchased during the six months ended September 30, 2025 and 2024, respectively. On July 30, 2025, we made a payment of $26 million for fiscal 2025 excise taxes previously accrued. As of September 30, 2025 and March 31, 2025, the amount accrued for excise taxes was $10 million and $26 million within “Other accrued liabilities” in our Condensed Consolidated Balance Sheets, respectively.\n48\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nInformation regarding share repurchase activity for the six months ended September 30, 2025 and 2024 was as follows:\nShare Repurchases \n(1)\n(In millions, except price per share)\nTotal \nNumber of\nShares \nPurchased \n(2) \nAverage Price \nPaid Per Share\n (3)\nApproximate \nDollar Value of \nShares that May \nYet Be Purchased \nUnder the \nPrograms \nBalance at March 31, 2025\n$\n7,469 \nQ1 Shares repurchased - Open market\n \n0.8\n$\n709.84 \n(590)\nQ2 Shares repurchased - Open market\n1.2\n$\n693.25 \n(809)\nBalance at September 30, 2025\n$\n6,070 \n(1)\nThis table does not include the value of equity awards surrendered to satisfy tax withholding obligations or forfeitures of equity awards.\n(2)\nThe number of shares purchased reflects rounding adjustments.\n(3)\nThe average price paid per share includes $10 million of excise taxes for the six months ended September 30, 2025.\nShare Repurchases \n(1)\n(In millions, except price per share)\nTotal \nNumber of\nShares \nPurchased \n(2) \nAverage Price \nPaid Per Share\n (3)\nApproximate \nDollar Value of \nShares that May \nYet Be Purchased \nUnder the \nPrograms\nBalance at March 31, 2024\n$\n6,615 \nQ1 Shares repurchased - Open market \n1.0\n$\n548.20 \n(527)\nJuly 2024 Board Authorization\n4,000 \nQ2 Shares repurchased - Open market\n (4)\n2.9\n$\n533.46 \n(1,528)\nBalance at September 30, 2024\n$\n8,560 \n(1)\nThis table does not include the value of equity awards surrendered to satisfy tax withholding obligations or forfeitures of equity awards.\n(2)\nThe number of shares purchased reflects rounding adjustments.\n(3)\nThe average price paid per share includes $16 million of excise taxes for the six months ended September 30, 2024.\n(4)\nOf the total dollar value, $22 million was accrued within “Other accrued liabilities” in our Condensed Consolidated Balance Sheet as of September 30, 2024 for share repurchases that were executed in late September 2024 and settled in early October 2024.\n49\nTable of Contents\n \nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONTINUED) \n(UNAUDITED)\nSelected Measures of Liquidity and Capital Resources\n(Dollars in millions)\nSeptember 30, 2025\nMarch 31, 2025\nCash, cash equivalents, and restricted cash\n$\n4,109 \n$\n5,956 \nWorking capital\n(8,144)\n(6,206)\nDebt to capital ratio \n(1)\n112.0 \n%\n125.3 \n%\n(1)\nThis ratio describes the relationship and changes within our capital resources, and is computed as the sum of total debt divided by the sum of total debt and McKesson stockholders’ deficit, which excludes noncontrolling interests and accumulated other comprehensive loss.\nCash equivalents, which are readily convertible to known amounts of cash, are carried at fair value. Cash equivalents are primarily invested in AAA-rated U.S. government money market funds, short-term deposits with financial institutions, and short-term commercial papers issued by non-financial institutions. Deposits with financial institutions are primarily denominated in U.S. dollars and the functional currencies of our foreign subsidiaries, including Canadian dollars. Deposits could exceed the amounts insured by the Federal Deposit Insurance Corporation in the U.S. and similar deposit insurance programs in other jurisdictions. We mitigate the risk of our short-term investment portfolio by depositing funds with reputable financial institutions and monitoring risk profiles and investment strategies of money market funds.\nOur cash and cash equivalents balance as of September 30, 2025 and March 31, 2025 included approximately\n \n$1.6 billion and $2.9 billion, respectively, of cash held by our subsidiaries outside of the U.S. Our primary intent is to utilize this cash for foreign operations for an indefinite period of time. Although the majority of cash held outside the U.S. is available for repatriation, doing so could subject us to foreign withholding taxes and state income taxes. We may remit foreign earnings to the U.S. to the extent it is tax efficient to do so. We do not anticipate the tax impact from remitting these earnings to be material. Following enactment of the 2017 Tax Cuts and Jobs Act, the repatriation of cash to the U.S. is generally no longer taxable for federal income tax purposes.\nWorking capital primarily includes cash and cash equivalents, receivables, inventories, and prepaid expenses, net of drafts and accounts payable, short-term borrowings, current portion of long-term debt, current portion of operating lease liabilities, and other accrued liabilities. Our businesses require substantial investments in working capital that are susceptible to large variations during the year as a result of inventory purchase patterns and seasonal demands. Inventory purchase activity is a function of sales activity and other requirements.\nConsolidated working capital decreased at September 30, 2025 compared to March 31, 2025 primarily due to an increase in drafts and accounts payable from increased purchasing driven by increased sales and timing, a decrease in cash and cash equivalents, an increase in current portion of long term debt, and an increase in other accrued liabilities. These were partially offset by an increase in inventories, net, and receivables, net, driven by higher sales and timing.\nOur debt to capital ratio decreased for the six months ended September 30, 2025 due to net income attributable to McKesson for fiscal 2026 and issuance of new long-term debt, partially offset by share repurchases and dividend payments.\nOn July 29, 2025, we raised our quarterly dividend from $0.71 to $0.82 per share of common stock. We anticipate that we will continue to pay quarterly cash dividends in the future. However, the payment and amount of future dividends remain within the discretion of the Board and will depend upon our future earnings, financial condition, capital requirements, legal requirements, and other factors.\nRedeemable Noncontrolling Interests\nDuring the six months ended September 30, 2025, we initially recognized redeemable noncontrolling interests of $25 million and $700 million related to our acquisition of 80% of PRISM Vision and 70% of Core Ventures, respectively. The balance of redeemable noncontrolling interests is reported at the greater of its carrying value or its maximum redemption value at each reporting date. The 30% minority interest retained by FCS is classified as redeemable noncontrolling interest, with a put option exercisable every five years, subject to a floor of 75% of initial fair value. As a result of the quarterly valuation process, we recorded an adjustment to the redemption value of the redeemable noncontrolling interests of $2 million for PRISM Vision and $45 million for Core Ventures. Refer to \nFinancial Note 5, “Redeemable Noncontrolling Interests and Noncontrolling Interests,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report for additional \n50\nTable of Contents\nMD&A Index\nMcKESSON CORPORATION\nFINANCIAL REVIEW (CONCLUDED)\n(UNAUDITED)\ninformation on redeemable noncontrolling interests.\nCapital Resources\nWe fund our working capital requirements primarily with cash and cash equivalents, proceeds from short-term borrowings from our commercial paper issuances, and longer-term credit agreements and debt offerings. Funds necessary for future debt maturities and our other cash requirements, including any future payments that may be made related to our total estimated litigation liability of $5.7 billion as of September 30, 2025 payable under the terms of various settlement agreements for opioid-related claims, are expected to be met by existing cash balances, cash flow from operations, existing credit sources, and future borrowings. Long-term debt markets and commercial paper markets, our primary sources of capital after cash flow from operations, are open and accessible to us should we decide to access those markets. Detailed information regarding our debt and financing activities is included in \nFinancial Note 8, “Debt and Financing Activities,”\n to the accompanying condensed consolidated financial statements included in this Quarterly Report.\nWe believe that our future operating cash flow, financial assets, and access to capital and credit markets, including our credit facilities, give us the ability to meet our financing needs for the foreseeable future. However, there can be no assurance that an increase in volatility or disruption in the global capital and credit markets will not impair our liquidity or increase our costs of borrowing.\nCAUTIONARY NOTICE ABOUT FORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q, including “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 2 of Part I of this report, contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Exchange Act. Forward-looking statements may be identified by their use of terminology such as “believes,” “expects,” “anticipates,” “may,” “will,” “should,” “seeks,” “approximately,” “intends,” “projects,” “plans,” “estimates,” “targets,” or the negative of these words or other comparable terminology. The discussion of proposed acquisition or disposition transactions, financial trends, strategy, plans, assumptions, expectations, litigation outcomes, or intentions may also include forward-looking statements. Forward-looking statements involve risks and uncertainties that could cause actual results to differ materially from those projected, anticipated, or implied. Although it is not possible to predict or identify all such risks and uncertainties, they include, but are not limited to, the factors discussed in the “Risk Factors” section in Item 1A of Part I of the 2025 Annual Report and in our publicly available SEC filings and press releases. Readers are cautioned not to place undue reliance on forward-looking statements, which speak only as of the date such statements were first made. Except to the extent required by federal securities laws, we undertake no obligation to publicly release the result of any revisions to any forward-looking statements to reflect events or circumstances after the date the statements are made, or to reflect the occurrence of unanticipated events.\nAVAILABLE INFORMATION\nWe routinely post on our company website, and via our social media channels, information that may be material to investors, including details and updates to information disclosed elsewhere, which may include business developments, earnings and financial performance, sustainability matters, details regarding upcoming events, and materials for presentations to investors and financial analysts. Investors are encouraged to monitor our website \nwww.mckesson.com\n. Interested parties can sign up on our website, including our Investor Relations site, to receive automated e-mail alerts, such as via RSS newsfeed, when we post certain information. Interested parties can also follow our social media feed @McKesson on X. The content on any website or social media channel is not incorporated by reference into this report, unless expressly noted otherwise."
}