{
  "source_file": "mco-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nBackground\nAs used in this report, except where the context indicates otherwise, the terms “Moody’s” or the “Company” refer to Moody’s Corporation, a Delaware corporation, and its subsidiaries. The Company’s executive offices are located at 7 World Trade Center at 250 Greenwich Street, New York, NY 10007 and its telephone number is (212) 553-0300.\nTHE COMPANY\nCompany Overview\nIn a world shaped by increasingly interconnected risks, Moody's data, insights, and innovative technologies help customers develop a holistic view of their world and unlock opportunities. With a rich history of experience in global markets and a diverse workforce of approximately 16,000 across more than 40 countries, Moody's gives customers the comprehensive perspective needed to act with confidence and thrive.\nMoody's is helping customers accelerate value creation in an era of exponential risk.\nMoody's\nWe provide tools that enable Banks, Insurers, Investors, Corporations and Governments to...\nWhat do \nwe do?\nIssue, Originate, Select, Underwrite\nIdentify, Measure, \nMonitor & Manage Risk\nVerify, Comply, Plan \n& Report\nLeveraging an unrivaled set of data, analytics, & domain expertise across...\nHow do we \ndo this?\nCredit\nCompanies\nProperties\nSecurities\nPeople\nEconomies\nESG\nClimate\nMoody’s has two reportable segments: MA and MIS. \nMoody's Analytics\nMoody's Investors Service\nMA provides data, intelligence and analytical tools to help business and financial leaders make confident decisions.\nFor more than 115 years, MIS has been a leading provider of credit ratings, research, and risk analysis helping businesses, governments, and other entities around the globe.\nFinancial information and operating results of these segments, including revenue, expenses and Adjusted Operating Income, are included in Part II, Item 8. Financial Statements of this annual report and are herein incorporated by reference.\n10\n     MOODY'S\n 2024 10-K\nTable of Contents\nMoody's Analytics Overview\nMA empowers financial services, corporate and public sector customers to anticipate risks, adapt and thrive in a new era of exponential risk. MA's combined data, analytics and cloud-based software tools deliver integrated solutions that help customers to start business relationships, monitor and manage risk, and comply and report based on global laws, rules and regulations. \nMA is comprised of: i) a premier fixed income and economic research business (Research & Insights); ii) a data business powered by the world’s largest database on companies and credit (Data & Information); and iii) three cloud-based subscription businesses serving banking, insurance and KYC workflows (Decision Solutions).\nMA creates a holistic view on risk provided by our vast set of proprietary data, analytics, and domain expertise across a range of areas, including credit, companies, properties, securities, people, economies, ESG, climate and more. MA's integrated and technology-enabled solutions provide unique capabilities and insights that are embedded in customer workflows.\nMOODY'S\n 2024 10-K     11\nTable of Contents\nMA by the Numbers\n14,800+\n6,700+\n800+\nMA Customers\nCorporates and Professional Services\nReal Estate Entities\n165+\n2,600+\n600+\nCountries where MA customers operate\nCommercial Banks\nEducational Institutions\n1,900+\n200+\nAsset Managers\nSecurities Dealers and Investment Banks\n900+\n200+\nGovernment Entities\nOthers\n900+\nInsurance Companies\n12\n     MOODY'S\n 2024 10-K\nTable of Contents\nMoody's Investors Service Overview\nMIS is a leading global provider of credit ratings, research, and risk analysis. A rating from Moody’s enables issuers to create timely, go-to-market debt strategies with the ability to capture wider investor focus and provides investors with a comprehensive view of global debt markets through our credit ratings and research. Moody’s trusted insights can help decision-makers navigate the safest path through market turmoil and volatility.\nMIS publishes credit ratings and provides assessment services on a wide range of debt obligations, programs and facilities, and the entities that issue such obligations in markets worldwide, including various corporate, financial institution and governmental obligations, and structured finance securities.\nThe Benefits of a Moody's Rating \nInvestors seek Moody's opinions and particularly value the knowledge of its analysts and the depth of Moody's research\nAccess to capital\nTransparency, credit comparison and market stability\nPlanning and budgeting\nAnalytical capabilities\n•\nMoody’s opinions on credit are used by institutional investors throughout the world, making an issuer’s debt potentially more attractive to a wide range of buyers.\n•\nSignals a willingness by issuers to be transparent and provides issuers with an independent assessment against which to compare creditworthiness.\n•\nMay help issuers when formulating internal capital plans and funding strategies.\n•\nAmong ratings advisors, Moody’s has a strong position and is well-recognized for the depth and breadth of its analytical capabilities.\n•\nA Moody’s rating may facilitate access to both domestic and international debt capital.\n•\nMoody’s ratings and research reports may help maintain investor confidence, especially during periods of market stress.\nMIS by the Numbers\n$75.8+ trillion\n4,800+\n3,300+\nTotal Rated Debt Outstanding\nNon-Financial Corporates\nFinancial Institutions\n33,300+\n14,400+\n8,900+\nRated Organizations and Structured Deals\nU.S. Public Finance Issuers\nStructured Finance Deals\n190+\n1,000+\n380+\nRating Methodologies\nInfrastructure & Project Finance Issuers\nSub-Sovereigns\n140+\n50\nSovereigns\nSupranational Institutions\nMIS also generates revenue from certain non-ratings-related operations, which primarily consist of financial instruments pricing services in the Asia-Pacific region, revenue from Second Party Opinions and Net Zero Assessments and revenue from ICRA's non-ratings operations. The revenue from these operations is included in the MIS Other LOB and is not material to the results of the MIS segment.\nMOODY'S\n 2024 10-K     13\nTable of Contents\nSustainability\nMoody's aims to deliver value to all stakeholders, including customers, employees, partners, communities, and stockholders. We consider sustainability in our operations, products, and services. We use our expertise to make a positive impact, helping others understand the link between sustainability and global markets. In 2024, Moody's received multiple awards for its sustainability efforts, including:\n•\nRecognized among America’s 100 Most JUST Companies by JUST Capital and CNBC for its commitment to serving its workforce, customers, communities, the environment, and stockholders for its sustainability-related efforts;\n•\nMade CDP's 2023 Climate Change 'A' List, in recognition of Moody's leadership in corporate transparency and actions taken in response to climate change;\n•\nNamed to the 2023 Dow Jones Sustainability Indices - World and North America, an annual listing of publicly traded companies, recognizing Moody's for its strong corporate sustainability practices; and\n•\nRecognized as a 2023 CDP Supplier Engagement leader for the fourth consecutive year, ranking among the top 4% of companies assessed for supplier engagement on climate change.\nThe Board oversees sustainability matters via the Audit, Governance & Nominating, and Compensation & Human Resources Committees, as part of its oversight of management and the Company’s overall strategy. The Audit Committee oversees financial, risk and other disclosures made in the Company’s annual and quarterly reports related to sustainability. The Governance & Nominating Committee oversees sustainability matters, including significant issues of corporate social and environmental responsibility, as they pertain to the Company’s business and to long-term value creation for the Company and its stockholders, and makes recommendations to the Board regarding these issues. Finally, the Compensation & Human Resources Committee oversees inclusion of sustainability-related performance goals for determining compensation of all senior executives. The Board also oversees Moody’s policies for assessing and managing the Company's exposure to risk, including climate-related risks such as business continuity disruption and reputational or credibility concerns stemming from incorporation of climate-related risks into our credit rating methodologies, or analysis of such risks within our products and services. The Board maintains its collective knowledge of sustainability topics through ongoing education, such as regular presentations from management.\nThree Pillars of Moody's Sustainability Strategy \nOur Actions\nOur Influence\nOur Support\nthe decisions and actions we can take related to impacts under our direct control\nthe actions that we can request from entities providing us with products and services\nthe steps we take to support or enable direct action by other organizations or communities\n14\n     MOODY'S\n 2024 10-K\nTable of Contents\nHUMAN CAPITAL\nOur employees are vital to Moody’s continued success, and we seek to create an environment that attracts, develops and sustains a highly skilled, performance-oriented and engaged workforce. Our approach is oriented around the following pillars: \n–\nproviding market-competitive compensation, benefits and wellness programs as part of our Total Rewards program; \n–\nimplementing a robust talent management, employee engagement and retention strategy; and\n–\nfostering an inclusive environment where all employees have a sense of belonging and are given the opportunity to perform their best.\nTotal Rewards\nMoody's Total Rewards programs are designed to attract and maintain a high-performing, engaged and motivated global workforce. The Company's compensation packages include market-competitive salaries, performance-based annual bonuses, and equity grants aligned to our long-term performance for certain employees.\nThe Company's industry leading benefits programs offer comprehensive resources to support physical, mental and financial well-being. We invest in AI powered technologies in order to provide our employees with a world-class experience accessing and managing their benefits. We continuously evaluate our market benchmarks and employee feedback so that our benefits are competitive and support the attraction of the best talent. For example, in recent years we implemented a global paid parental leave policy to give parents time off to care for and bond with a new child and updated our tuition reimbursement program.\nThe Company also promotes flexible work arrangements, which support the Company's efforts to create a work atmosphere in which people feel valued and inspired to give their best. The Company has implemented a \"PurposeFirst\" framework, which fosters purpose-driven decisions relating to how and where Moody's teams work.\nTalent Management, Employee Engagement and Retention\nMoody’s believes that our long-term success depends on our ability to attract, develop and retain a high-performing workforce. Our goal is to create an environment where colleagues can thrive personally and professionally and can maximize their potential. Our culture is one of continuous learning, which we believe is crucial for colleagues to thrive as part of our organization and to feel a sense of accomplishment and purpose, and our leaders are key in reinforcing this at Moody’s.\nMoody's talent strategy helps us create integrated, cohesive talent activities that support the growth and success of our employees and the business. This strategy informs all of our talent programs, guiding our efforts to attract, develop and retain top talent. It also helps us remain aligned with Moody’s overall business objectives and values while designing programs to meet the evolving needs of our organization.\nMoody’s offers various talent development programs and resources through Moody’s University that are focused on building professional, technical and leadership skills to support employees' goals and objectives. Moody’s also places significant emphasis on our high-potential and high-performance programs, which are designed to identify and nurture emerging leaders within the organization. These programs provide tailored development opportunities, mentorship and the chance to work on strategic projects that drive our business forward.\nMoody's Employee Experience function conducts listening sessions with our employees and creates targeted plans to act on the feedback provided. We measure employee engagement via multiple channels, including the BES for employees to provide anonymous and candid feedback to management. This periodic survey helps Moody's management understand our employees' level of engagement in critical areas, which include, but are not limited to, purpose, leadership, managerial effectiveness, connection, enablement and empowerment and well-being. Managers are accountable for identifying opportunity areas and taking targeted actions based on survey results. The feedback received through the BES is used as a vital input into making decisions to improve employee experience and retention. As we strive to make Moody’s a place people want to come and stay, management also carefully monitors global employee turnover rates.\nInclusion and Belonging\nMoody's believes that a workforce comprised of individuals with varied thoughts, backgrounds and experiences fosters an environment that makes our opinions stronger, our products more innovative, our workplace more welcoming and improves how we relate and respond to our customers. We are committed to cultivating a culture where every individual feels a sense of belonging and has an equal opportunity to succeed.\nOur Inclusion Operating and Governance Model turns our inclusion strategy into reality by providing a functional framework to guide how our People team, councils, sponsors, BRGs and committees work together. The Global Inclusion Council, chaired by our CEO and composed of senior leaders, is charged with oversight of our global inclusion strategy and its progress. The members of the council meet quarterly.\nOur governance model also includes three Regional Inclusion Councils tasked with overseeing the inclusion strategy within their respective regions. Each council meets on a quarterly basis.\nOur operating model includes 11 active BRGs which represent 48 chapters. These groups are open to all Moody's employees, with more than 4,800 employees participating globally as of December 31, 2024.\nMOODY'S\n 2024 10-K     15\nTable of Contents\nWorkforce Overview\nAs of December 31, 2024 and 2023, the number of Moody’s employees was as follows: \nDecember 31,\nChange\n2024\n2023\n(1)\n%\nMA\nU.S.\n2,989\n \n2,992 \n— \n%\nNon-U.S.\n5,156\n \n4,872 \n6 \n%\nTotal\n8,145\n \n7,864 \n4 \n%\nMIS\nU.S. \n1,571\n \n1,490 \n5 \n%\nNon-U.S. \n4,186\n \n3,870 \n8 \n%\nTotal \n5,757\n \n5,360 \n7 \n%\nMSS\nU.S.\n696\n \n749 \n(7)\n%\nNon-U.S.\n1,240\n \n1,187 \n4 \n%\nTotal\n1,936\n \n1,936 \n— \n%\nTotal MCO\nU.S.\n5,256\n \n5,231 \n— \n%\nNon-U.S.\n10,582\n \n9,929 \n7 \n%\nTotal\n15,838\n \n15,160 \n4 \n%\n(1)\n Certain reclassifications have been made to 2023 amounts to reflect certain departmental reorganizations and M&A integrations\n–\nMA’s employee population primarily consists of software engineers, product managers and strategists, data and operations analysts, advisory and implementation teams and economists, as well as sales, business development, and sales support professionals. \n–\nThe MIS employee population primarily consists of credit analysts, data and operations analysts, credit strategy and methodology professionals, software engineers, sales and sales operations, and international strategy teams. \n–\nThe MSS employee population primarily consists of information technology professionals and other professional staff such as finance, human resources, compliance, and legal that support both MA and MIS.\nCLIMATE CHANGE\nClimate change is a major challenge that demands action from all of us. While Moody’s has a limited direct environmental impact, we do have an important role to play in demonstrating proactive corporate responsibility and best practices when it comes to climate change mitigation. As such, the Company is taking steps to reduce emissions across its operations and value chain in accordance with its decarbonization strategy.\nOur decarbonization plan outlines tangible strategies for realizing our climate ambitions, including the procurement of 100% of renewable electricity in the Company’s office spaces and optimizing efficiencies in its operations through its hybrid work program. The costs associated with the implementation of the decarbonization plan are not expected to be material. \nThe acquisition of RMS allowed us to expand our climate data and analysis capabilities. The Company continues to take steps to integrate these capabilities into existing offerings to provide its analysts and researchers with streamlined access to consistent and high-quality climate insights. Additionally, we have launched a Net Zero Assessment framework to provide an independent and comparable evaluation of the strength of an entity’s carbon transition plan.\n16\n     MOODY'S\n 2024 10-K\nTable of Contents\nMOODY’S STRATEGY\nMoody’s is a global integrated risk assessment firm that empowers organizations to anticipate, adapt and thrive in a new era of exponential risk. Our data, analytical solutions and insights help decision-makers identify opportunities and manage the risks of doing business with others.    \nMission\nOur mission is to be the leading source of relevant insights on exponential risk\nGrowth Strategy\nInvest with intent to grow and scale\nInvest with intent\n \nto grow and strengthen our core business\n \nwith a foundation of credibility, transparency, technology, data and analytics\nInvest in \nintegrated solutions\n to allow customers to manage multiple risks, bringing the best of Moody's capabilities\nInvest to successfully \nscale in priority growth markets\n with highly differentiated products and services\nInvestment in high growth markets\nExecution Priorities\nHow we will get it done\nCustomer first\nDevelop our people and culture\nCollaborate, modernize and innovate\nMoody’s invests in initiatives to implement the Company’s strategy, including internally-led organic development and targeted acquisitions. Illustrative examples include:\nEnhancements to ratings quality and product extensions\nExpansion in emerging markets \nNew products, services, content and technology capabilities, including Gen AI, to meet customer demands\nInvestments that extend ownership and participation in joint ventures as well as acquisitions and strategic partnerships that accelerate the ability to scale and grow Moody’s businesses\nIn this era of exponential risk, we know that risks are interconnected, and organizations want a complete view of risk. This includes having a greater breadth and depth of understanding around how risks connect.\nOur integrated approach provides stakeholders with a more comprehensive view of risk, helping them to make better decisions and unlock opportunities. Moody’s brings together multiple data sets and develops risk analysis solutions to assess multiple risk factors (e.g., supply chain failures; cyberattacks; geopolitical tensions; sanctions and security issues; and extreme weather events).\nMOODY'S\n 2024 10-K     17\nTable of Contents\nPROSPECTS FOR GROWTH\nMoody’s believes that the overall long-term outlook remains favorable for continued growth from the offerings of both of our reportable segments.\nMoody’s growth is influenced by a number of trends that impact the market for our products, including:\nEnablement of Gen AI\nHealth of the world’s major economies\nDebt capital markets activity\nDisintermediation of credit markets\nFiscal and monetary policy of governments\nExpansion of market for integrated data and analytics solutions\nBusiness investment spending, including mergers and acquisitions\nIn an environment of increasing financial complexity and exponential risk, Moody’s expects to be well positioned to benefit from continued growth in global fixed-income market activity and more widespread use of credit ratings and integrated risk solutions. Moreover, pricing opportunities aligned with customer value creation and advances in technology present growth opportunities for Moody’s.\nOver the last decade, Moody’s has leveraged the power of AI and ML to better serve our customer base. As an early adopter of Gen AI, Moody's expects to be well positioned to benefit from the capabilities of this technology, which will help our customers make better decisions by unlocking deeper, more integrated perspectives on risk. Through enablement of Gen AI, both internally and through certain strategic partnerships, we are in the process of evolving how we deliver insights on exponential risk to our customers. \nMoody’s operations are subject to various risks, as more fully described in Part I, Item 1A “Risk Factors,” inherent in conducting business on a global basis. \nMA Prospects for Growth\nMA provides insights on the evolving risks of our customers and supports their ability to capitalize on related opportunities. Growth in MA is likely to be driven by landing new customers and expanding customer relationships across use cases over time. Our trusted and curated data is key in an environment that is increasingly using Gen AI, and we expect that the integration of our platforms will enable effective cross-selling of models, data and applications. MA's growth is also likely to be driven by quickly addressing new use cases and incorporating new risk data and analytics as needed. \nStrategic growth drivers\n:\nNEW PRODUCT DEVELOPMENT\nSTRONG CUSTOMER RETENTION RATES\nCROSS-SELLING, UPGRADES & PRICING\nCONTINUED SAAS TRANSITION\nINCREASED DISTRIBUTION CAPACITY AND PRODUCTIVITY\n18\n     MOODY'S\n 2024 10-K\nTable of Contents\nMarket growth drivers\n:  \nCustomers need to understand a large range of interconnected and emerging risks. Our comprehensive solutions support the transformation underway across various industries due to: \nOperational and reputational risks\nDigitization & Artificial Intelligence\nEvolving regulatory environment\nFluctuations in credit and financial markets\nClimate change\nGeopolitical risks\nMIS Prospects for Growth \nStrong secular trends should continue to provide long-term growth opportunities in MIS. Key growth drivers include:\nLong-term Growth Building Blocks\nEconomic Expansion\n+\nValue Proposition\n+\nDeveloping Capital Markets and Evolving Risks\n•\nGDP growth drives demand for debt capital to fund business investments\n•\nRefinancing needs support future supply\n•\nProven rating accuracy and deeply experienced analysts\n•\nMix of issuers and opportunistic issuance\n•\nDeepening participation in developing markets\n•\nMeeting customers’ evolving risk assessment demands, including Sustainable and Transition Finance, Private Credit, Digitalization of the financial sector, and Cybersecurity\nIn addition to the factors noted above, growth in global fixed income markets in a given year is dependent on many macroeconomic and capital market factors including: \nInterest rates\nBusiness investment spending\nCorporate refinancing needs\nMerger and acquisition activity \nIssuer financial health\nConsumer borrowing levels\nSecuritization activity\nExpansion of ratings coverage \nExpansion into emerging markets\nRating fees paid by debt issuers account for most of the revenue of MIS. Therefore, a substantial portion of MIS’s revenue is dependent upon the dollar-equivalent volume and number of ratable debt securities issued in the global capital markets. However, annual fee arrangements with frequent debt issuers, annual fees from debt monitoring, commercial paper and medium-term note programs, bank deposit ratings, insurance company financial strength ratings, mutual fund ratings, and other areas partially mitigate MIS’s dependence on the volume or number of new debt securities issued in the global fixed-income markets.\nWithin MIS, we remain firmly committed to ratings quality, timely and insightful research, and engagement with issuers and investors. In the past year, we have enhanced our footprint in domestic markets by increasing our majority share in the GCR Africa affiliate and expanding in Latin American markets through Moody's Local domestic rating business. This strategic expansion has solidified our domestic rating agency's position, enhancing its capacity and reach. \nCompetition\nMA competes broadly in the financial information and enterprise risk software industries against various diversified competitors. MA’s main competitors within DS are providers of software and analytic solutions. In R&I, MA faces competition from providers of economic data, financial research and analysis. MA's main competitors within D&I are providers of commercial and financial data.\nMIS competes with other CRAs and with investment banks and brokerage firms that offer credit opinions and research. Many users of MIS’s ratings also have in-house credit research capabilities. \nMOODY'S\n 2024 10-K     19\nTable of Contents\nRegulation\nMIS, certain of the Company's credit rating affiliates, and many of the issuers and/or securities that MIS and the affiliates rate, are subject to extensive regulation in the U.S. (including by state and local authorities), EU, U.K. and in other countries. In addition, some of the services offered by MA and its affiliates are subject to regulation in a number of countries. MA also derives a significant amount of its sales from banks and other financial services providers who are subject to regulatory oversight and who are required to conduct due diligence and pass through certain regulatory requirements to key suppliers such as MA by contract. Existing and proposed laws and regulations can impact the Company’s operations, products and the markets in which the Company operates. Additional laws and regulations have been proposed or are being considered. Each of the existing, adopted, proposed and potential laws and regulations can increase the costs and legal risk associated with the Company’s operations, including the issuance of credit ratings, and may negatively impact the Company’s profitability and ability to compete, or result in changes in the demand for the Company's products and services, in the manner in which the Company's products and services are utilized, and in the manner in which the Company operates.\nIn the U.S., CRAs are subject to extensive regulation primarily pursuant to Section 15E of the Exchange Act and rules thereunder. MIS is registered with the SEC as an NRSRO and is subject to the SEC's oversight and examination authority. \nIn the EU, the CRA industry is registered and supervised through a pan-EU regulatory framework. ESMA has direct supervisory responsibility for registered CRAs throughout the EU. MIS’s EU CRA subsidiaries are registered with and are subject to CRA regulation in the EU and periodic inspection by ESMA.\nThe European Parliament and the Council of the EU, the EU co-legislators, announced they had reached agreement on the text of the Regulation on ESG Ratings Activities in February 2024. The Regulation will become law after it has been published in the EU Official Journal. The regulation will apply after an 18 month implementation period from its publication, and will subject ESG rating and/or score providers to formal regulation and supervision by ESMA. Certain products offered by MIS may fall in scope of the Regulation and we continue to assess and prepare for the implications. We do not expect MA products to fall into scope. \nThe EU AI Act was published in the EU Official Journal in July 2024, though elements of the Act have different implementation periods. We continue to assess and prepare for any implications both for MA and MIS.\nIn December 2022, the EU adopted DORA, which will apply from early 2025. As a credit rating agency, MIS is in scope of DORA, and accordingly, is required to undertake certain steps to ensure that its oversight and risk management of its information technology, including any functions outsourced to third-parties that provide information communication technologies, is resilient. MA provides certain products and services to clients that may be regulated financial institutions in the EU and therefore fall in the scope of DORA. It is therefore expected that MA may receive queries from such clients in relation to those products and services, as well as requests for contractual commitments, to ensure their compliance with DORA. \nIn the U.K., MIS U.K. is registered with and regulated by the FCA. In March 2023, the FCA initiated a review of competition in the markets for certain types of wholesale market data, including credit ratings data. The review concluded at the end of February 2024. In its final report, the FCA declined to make a market investigation reference to the Competition and Markets Authority nor did it consider any specific remedies or other specific interventions in respect of credit ratings data.\nAdditionally, HM Treasury published a consultation in March 2023 on whether regulation for providers of ESG ratings should be introduced, and the potential scope of a regulatory regime. The U.K. Government has said it intends to take forward such legislation in 2025.\nIntellectual Property\nMoody’s and its affiliates own and control a variety of intellectual property, including but not limited to: \nProprietary information\nPublications\nDatabases\nTrademarks and Patents\nSaaS and other software tools and applications\nDomain names\nResearch\nModels and methodologies\nOther proprietary materials that, in the aggregate, are of material importance to Moody’s business\n20\n     MOODY'S\n 2024 10-K\nTable of Contents\nManagement of Moody’s believes that the trademarks and related corporate names, marks and logos relating to its businesses, including those containing the term “Moody’s”, are of material importance to the Company.\nThe Company, primarily through MA and its affiliates, provides access to certain of its databases, SaaS and other software applications, credit risk models, assessments, research and other publications and services that contain intellectual property to its customers. These licenses are provided pursuant to standard agreements containing customary restrictions and intellectual property protections.\nIn addition, Moody’s licenses from third parties certain technology, data and other intellectual property rights. Specifically, Moody’s obtains licenses from third parties to use financial information (such as market and index data, financial statement data, research data, default data and security identifiers) as well as software development tools and libraries. In addition, certain of the Company’s affiliates obtain from third-party information providers certain financial, credit risk, compliance, firmographic, management, ownership, news and/or other data worldwide, which are distributed through Moody's information products. The Company obtains such technology and intellectual property rights from generally available commercial sources. The Company also utilizes generally available open-source software and libraries subject to appropriately permissive open-source licenses, to carry out routine functions in certain of the Company’s software products. Most of such technology and intellectual property is available from a variety of sources. Although certain financial information (particularly security identifiers, certain pricing or index data, and company financial data in selected geographic markets) is available from a limited number of sources, Moody’s does not believe it is dependent on any one data source for a material aspect of its business.\nThe names of Moody’s products and services referred to herein are trademarks, service marks or registered trademarks or service marks owned by or licensed to Moody’s or one or more of its affiliates. The Company owns patents (including granted, allowed and pending patents). None of the Company's intellectual property is subject to a specific expiration date, except to the extent that the patents and the copyright in items that the Company holds (such as credit reports, research, software, and other written opinions) expire pursuant to relevant law.\nThe Company considers its intellectual property to be proprietary, and Moody’s relies on a combination of copyright, trademark, trade secret, patent, non-disclosure and other contractual and technological safeguards for protection. Moody’s also pursues instances of third-party infringement of its intellectual property in order to protect the Company’s rights.\nAvailable Information\nMoody’s investor relations internet website is https://ir.moodys.com/. Under the “SEC Filings” tab at this website, the Company makes available free of charge its annual reports on Form 10-K, proxy and other information statements, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports as soon as reasonably practicable after they are filed with, or furnished to, the SEC.\nThe SEC maintains an internet website that contains annual, quarterly and current reports, proxy and other information statements that the Company files electronically with the SEC. The SEC’s internet website is https://www.sec.gov/.\nInformation About Our Executive Officers\nName, Age, Position and Biographical Data\nRobert Fauber, 54\nPresident and Chief Executive Officer\nMr. Fauber has served as the Company’s President and Chief Executive Officer since January 2021. Mr. Fauber joined the Board of Directors in October 2020 and he currently serves on the Executive Committee of the Board of Directors. Prior to serving as CEO, Mr. Fauber served as Chief Operating Officer from November 2019 to December 2020, as President of MIS from June 2016 to October 2019, as Senior Vice President—Corporate & Commercial Development of Moody’s Corporation from April 2014 to May 2016, and was Head of the MIS Commercial Group from January 2013 to May 2016.\nMOODY'S\n 2024 10-K     21\nTable of Contents\nName, Age, Position and Biographical Data\nNoémie Heuland, 47\nSenior Vice President and Chief Financial Officer\nMs. Heuland has served as the Company’s Senior Vice President and Chief Financial Officer since April 2024. She joined the Company most recently from Ceridian HCM Holding Inc. (which changed its name to Dayforce, Inc. on January 1, 2024), a global leader of human capital management technology, where she served as Executive Vice President, Chief Financial Officer from September 2020 to December 2023. From April 2018 to September 2020, Ms. Heuland held the position of Senior Vice President, Chief Financial Officer at SAP Latin America and Caribbean region, and held various other finance leadership roles in Europe and the Americas at SAP beginning in 2008. Prior to joining SAP, a global software company, Ms. Heuland spent eight years at PricewaterhouseCoopers. Ms. Heuland is a certified public accountant.\nRichard Steele, 55\nSenior Vice President and General Counsel\nMr. Steele has served as the Company’s Senior Vice President and General Counsel since September 2023. Mr. Steele joined Moody’s KMV Company in 2006 as its Chief Legal Officer, and was named General Counsel of Moody’s Analytics in January 2008. Prior to joining the Company, Mr. Steele was a corporate lawyer at Wilson Sonsini Goodrich & Rosati, and also held senior legal positions at several firms in financial technology, software and venture capital.\nCaroline Sullivan, 56\nChief Accounting Officer and Corporate Controller\nMs. Sullivan has served as the Company’s Chief Accounting Officer and Corporate Controller since December 2018. She served as the Interim Chief Financial Offer from September 2023 to April 2024. Prior to joining the Company, Ms. Sullivan served in several roles at Bank of America from 2011 to 2018, where her last position held was Managing Director and Global Banking Controller. Prior to that role, Ms. Sullivan supported the Global Wealth & Investment Management business from 2015 to 2017 in a variety of positions, including Controller. Ms. Sullivan, a CPA, previously held various senior positions at several banks and a major accounting firm.\n22\n     MOODY'S\n 2024 10-K\nTable of Contents\nName, Age, Position and Biographical Data\nStephen Tulenko, 57\nPresident, Moody’s Analytics\nMr. Tulenko has served as President of Moody’s Analytics since November 2019. Mr. Tulenko served as Executive Director of Moody's former Enterprise Risk Solutions LOB from 2013 to October 2019 and as Executive Director of Global Sales, Customer Service and Marketing from 2008 to 2013. Prior to the formation of Moody’s Analytics, he held various sales, product development and product strategy roles at Moody’s Investors Service, Inc. Mr. Tulenko joined Moody’s in 1990. \nMichael West, 56\nPresident, Moody’s Investors Service \nMr. West has served as President of Moody’s Investors Service, Inc. since November 2019. Mr. West served as Managing Director—Head of MIS Ratings and Research from June 2016 to October 2019. Previously, Mr. West served as Managing Director—Head of Global Structured Finance from February 2014 to May 2016 and Managing Director—Head of Global Corporate Finance from January 2010 to January 2014. Earlier in his career, he was also responsible for the research strategy for the ratings businesses and before that led Corporate Finance for the EMEA Region, European Corporates and the EMEA leveraged finance business.",
  "item7": "ITEM 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis discussion and analysis of financial condition and results of operations should be read in conjunction with the Moody’s Corporation consolidated financial statements and notes thereto included elsewhere in this annual report on Form 10-K.\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations contains Forward-Looking Statements. See “Forward-Looking Statements” commencing on page \n61\n and Item 1A. “Risk Factors” commencing on page \n23\n for a discussion of uncertainties, risks and other factors associated with these statements.\nThe Company\nMoody’s is a global integrated risk assessment firm that empowers organizations to anticipate, adapt and thrive in a new era of exponential risk. Moody’s reports in two segments: MA and MIS. \nMA is a global provider of: i) research and insights; ii) data and information; and iii) decision solutions, which help companies make better and faster decisions. MA leverages its industry expertise across multiple risks such as credit, market, financial crime, supply chain, catastrophe and climate to deliver integrated risk assessment solutions that enable business leaders to identify, measure and manage the implications of interrelated risks and opportunities. \nMIS publishes credit ratings and provides assessment services on a wide range of debt obligations, programs and facilities, and the entities that issue such obligations in markets worldwide, including various corporate, financial institution and governmental obligations, and structured finance securities. \nCritical Accounting Estimates\nMoody’s discussion and analysis of its financial condition and results of operations are based on the Company’s consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires Moody’s to make estimates and judgments that affect reported amounts of assets and liabilities and related disclosures of contingent assets and liabilities at the dates of the financial statements and revenue and expenses during the reporting periods. These estimates are based on historical experience and on other assumptions that are believed to be reasonable under the circumstances. On an ongoing basis, Moody’s evaluates its critical accounting estimates. Actual results may differ from these estimates under different assumptions or conditions. The following accounting estimates are considered critical because they are particularly dependent on management’s judgment about matters that are uncertain at the time the accounting estimates are made and changes to those estimates could have a material impact on the Company’s consolidated results of operations or financial condition.\nGoodwill and Other Acquired Intangible Assets\nAt July 31st of each year, Moody’s evaluates its goodwill for impairment at the reporting unit level, defined as an operating segment (i.e., MA and MIS), or one level below an operating segment (i.e., a component of an operating segment).\nThe Company has four reporting units: two reporting units within MA consisting of businesses that offer: i) data and data-driven analytical solutions; and ii) risk-management software, workflow and CRE solutions, and two within the Company’s ratings business (one for the ICRA business and one that encompasses all of Moody’s other ratings operations).\nThe Company evaluates the recoverability of goodwill using a two-step impairment test approach at the reporting unit level. In the first step, the Company assesses various qualitative factors to determine whether the fair value of a reporting unit may be less than its carrying amount. If a determination is made based on the qualitative factors that an impairment does not exist, the Company is not required to perform further testing. If the aforementioned qualitative assessment results in the Company concluding that it is more likely than not that the fair value of a reporting unit may be less than its carrying amount, the fair value of the reporting unit will be quantitatively determined and compared to its carrying value including goodwill. If the fair value of the reporting unit exceeds the carrying value of the net assets assigned to that unit, goodwill is not impaired, and the Company is not required to perform further testing. If the fair value of the reporting unit is less than the carrying value, the Company will record a goodwill impairment charge for the amount by which the carrying value exceeds the reporting unit’s fair value. The Company evaluates its reporting units on an annual basis, or more frequently if there are changes in the reporting structure of the Company due to acquisitions, realignments or if there are indicators of potential impairment. For the reporting units where the Company is consistently able to conclude that no impairment exists using only a qualitative approach, the Company’s accounting policy is to perform the second step of the aforementioned goodwill impairment assessment at least once every three years. \nAt July 31, 2024, the Company performed quantitative assessments for each of the four reporting units in accordance with the aforementioned policy. These quantitative assessments resulted in fair values that significantly exceeded carrying value for all reporting units. \nDetermining the fair value of a reporting unit involves the use of significant estimates and assumptions, which are more fully described below. In addition, the Company also makes certain judgments and assumptions in allocating shared assets and liabilities to determine the carrying values for each of its reporting units.\nOther assets and liabilities, including applicable corporate assets, are allocated to the extent they are related to the operation of respective reporting units.\n38\n     MOODY'S\n 2024 10-K\nTable of Contents\nMethodologies and significant estimates utilized in determining the fair value of reporting units:\nThe following is a discussion regarding the Company’s methodology for determining the fair value of its reporting units, excluding ICRA, as of July 31, 2024. As ICRA is a publicly traded company in India, the Company was able to observe its fair value based on its market capitalization. \nThe fair value of each reporting unit, excluding ICRA, was estimated using a discounted cash flow methodology and comparable public company and precedent transaction multiples. The discounted cash flow analysis requires significant estimates, including projections of future operating results and cash flows of each reporting unit that are based on internal budgets and strategic plans, expected long-term growth rates, terminal values, weighted average cost of capital and the effects of external factors and market conditions. Changes in these estimates and assumptions could materially affect the estimated fair value of each reporting unit that could result in an impairment charge to reduce the carrying value of goodwill, which could be material to the Company’s financial position and results of operations. Moody’s allocates newly acquired goodwill to reporting units based on the reporting unit expected to benefit from the acquisition.\nThe sensitivity analyses on the future cash flows and WACC assumptions are described below. These key assumptions utilized in the discounted cash flow valuation methodology require significant management judgment:\n–\nFuture cash flow assumptions\n - The projections for future cash flows utilized in the models are derived from historical experience and assumptions regarding future growth and profitability of each reporting unit. These projections are consistent with the Company’s operating budget and strategic plan. Cash flows for the five years subsequent to the date of the quantitative goodwill impairment test were utilized in the determination of the fair value of each reporting unit. Beyond five years, a terminal value was determined using a perpetuity growth rate based on inflation and real GDP growth rates. A sensitivity analysis of the revenue growth rates was performed on all reporting units. For each reporting unit analyzed, a 10% reduction in the revenue growth rates used would still result in fair values that significantly exceeded carrying values.\n–\nWACC\n - The WACC is the rate used to discount each reporting unit’s estimated future cash flows. The WACC is calculated based on the proportionate weighting of the cost of debt and equity. The cost of equity is based on a risk-free interest rate and an equity risk factor, which is derived from public companies similar to the reporting unit and which captures the perceived risks and uncertainties associated with the reporting unit’s cash flows. The cost of debt component is calculated as the weighted average cost associated with all of the Company’s outstanding borrowings as of the date of the impairment test and was immaterial to the computation of the WACC. The cost of debt and equity is weighted based on the debt to market capitalization ratio of publicly traded companies with similarities to the reporting unit being tested. The WACC for all reporting units ranged from 10.0% to 10.5% as of July 31, 2024. Differences in the WACC used between reporting units is primarily due to distinct risks and uncertainties regarding the cash flows of the different reporting units. A sensitivity analysis of the WACC was performed on all reporting units as of July 31, 2024 for each reporting unit. For all reporting units, an increase in the WACC of one percentage point would still result in fair values that significantly exceeded carrying values.\nLong-lived assets\nLong-lived assets, which consist primarily of amortizable intangible assets, operating lease ROU Assets and property and equipment, are reviewed for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable.\nUnder the first step of the recoverability assessment, Moody's compares the estimated undiscounted future cash flows attributable to the asset or asset group to its carrying value. If the undiscounted future cash flows are greater than the carrying value, no further assessment is required. If the undiscounted future cash flows are less than the carrying value, Moody's proceeds with step two of the assessment. Under step two of this assessment, Moody's is required to determine the fair value of the asset or asset group and recognize an impairment loss if the carrying amount exceeds its fair value. In performing this assessment, Moody's must include assumptions that market participants would use in their estimates of fair value, including the estimated future cash flows and discount rate. Moody's must apply judgment in developing estimated future cash flows and in the determination of market participant assumptions.\nIncome Taxes\nThe Company is subject to income taxes in the U.S. and various foreign jurisdictions. The Company’s tax assets and liabilities are affected by the amounts charged for services provided and expenses incurred as well as other tax matters such as intercompany transactions. The Company accounts for income taxes under the asset and liability method in accordance with ASC Topic 740. Therefore, income tax expense is based on reported income before income taxes, and deferred income taxes reflect the effect of temporary differences between the amounts of assets and liabilities that are recognized for financial reporting purposes and the amounts that are recognized for income tax purposes.\nThe Company is subject to tax audits in the U.S. and various foreign jurisdictions. The Company regularly assesses the likely outcomes of such audits in order to determine the appropriateness of liabilities for UTPs. The Company classifies interest related to income taxes as a component of interest expense in the Company’s consolidated statements of operations and associated penalties, if any, as part of other non-operating expenses.\nFor UTPs, ASC Topic 740 requires a company to first determine whether it is more-likely-than-not (defined as a likelihood of more than fifty percent) that a tax position will be sustained based on its technical merits as of the reporting date, assuming that taxing authorities will examine the position and have full knowledge of all relevant information. A tax position that meets this more-likely-\nMOODY'S\n 2024 10-K     39\nTable of Contents\nthan-not threshold is then measured and recognized at the largest amount of benefit that is greater than fifty percent likely to be realized upon effective settlement with a taxing authority. As the determination of liabilities related to UTPs and associated interest and penalties requires significant estimates to be made by the Company, there can be no assurance that the Company will accurately predict the outcomes of these audits, and thus the eventual outcomes could have a material impact on the Company’s operating results or financial condition.\nContingencies\nAccounting for contingencies, including those matters described in Note 19 to the consolidated financial statements, is highly subjective and requires the use of judgments and estimates in assessing their magnitude and likely outcome. In many cases, the outcomes of such matters will be determined by third parties, including governmental or judicial bodies. The provisions made in the consolidated financial statements, as well as the related disclosures, represent management’s best estimates of the current status of such matters and their potential outcome based on a review of the facts and in consultation with outside legal counsel where deemed appropriate. The Company regularly reviews contingencies and as new information becomes available may, in the future, adjust its associated liabilities.\nFor claims, litigation and proceedings and governmental investigations and inquiries not related to income taxes, the Company records liabilities in the consolidated financial statements when it is both probable that a liability has been incurred and the amount of loss can be reasonably estimated and periodically adjusts these as appropriate. When the reasonable estimate of the loss is within a range of amounts, the minimum amount of the range is accrued unless some higher amount within the range is a better estimate than another amount within the range. In instances when a loss is reasonably possible but uncertainties exist related to the probable outcome and/or the amount or range of loss, management does not record a liability but discloses the contingency if material. As additional information becomes available, the Company adjusts its assessments and estimates of such matters accordingly. \nMoody’s also discloses material pending legal proceedings pursuant to SEC rules and other pending matters as it may determine to be appropriate.\nIn view of the inherent difficulty of assessing the potential outcome of legal proceedings, governmental, regulatory and legislative investigations and inquiries, claims and litigation and similar matters and contingencies, particularly when the claimants seek large or indeterminate damages or assert novel legal theories or the matters involve a large number of parties, the Company often cannot predict what the eventual outcome of the pending matters will be or the timing of any resolution of such matters. The Company also may be unable to predict the impact (if any) that any such matters may have on how its business is conducted, on its competitive position or on its financial position, results of operations or cash flows. As the process to resolve any pending matters progresses, management will continue to review the latest information available and assess its ability to predict the outcome of such matters and the effects, if any, on its operations and financial condition and to accrue for and disclose such matters as and when required. However, because such matters are inherently unpredictable and unfavorable developments or resolutions can occur, the ultimate outcome of such matters, including the amount of any loss, may differ from those estimates.\nPension and Other Retirement Benefits\nThe expenses, assets and liabilities that Moody’s reports for its Retirement Plans are dependent on many assumptions concerning the outcome of future events and circumstances. These significant assumptions include the following:\n–\nfuture compensation increases based on the Company’s long-term actual experience and future outlook;\n–\nlong-term expected return on pension plan assets based on historical portfolio results and the expected future average annual return for each major asset class within the plan’s portfolio (which is principally comprised of equity and fixed-income investments); and\n–\ndiscount rates based on current yields on high-grade corporate long-term bonds.\nThe discount rates used to measure the present value of the Company’s benefit obligation for its Retirement Plans as of December 31, 2024 were derived using a cash flow matching method whereby the Company compares each plan’s projected payment obligations by year with the corresponding yield on the FTSE pension discount curve. The cash flows by plan are then discounted back to present value to determine the discount rate applicable to each plan.\nMoody’s major assumptions vary by plan and assumptions used are set forth in Note 13 to the consolidated financial statements. In determining these assumptions, the Company consults with third-party actuaries and other advisors as deemed appropriate. While the Company believes that the assumptions used in its calculations are reasonable, differences in actual experience or changes in assumptions could have a significant effect on the expenses, assets and liabilities related to the Company’s Retirement Plans. \nWhen actual plan experience differs from the assumptions used, actuarial gains or losses arise. Excluding differences between the expected long-term rate of return assumption and actual returns on plan assets, the Company amortizes, as a component of annual pension expense, total outstanding actuarial gains or losses over the estimated average future working lifetime of active plan participants to the extent that the gain/loss exceeds 10% of the greater of the beginning-of-year projected benefit obligation or the market-related value of plan assets. For Moody’s Retirement Plans, the total actuarial losses as of December 31, 2024 that have not been recognized in annual expense are $48 million, and Moody’s expects the net periodic expense related to the amortization of net actuarial (losses)/gains will be immaterial in 2025.\nFor Moody’s funded U.S. pension plan, the differences between the expected long-term rate of return assumption and actual returns could also affect the net periodic pension expense. As permitted under ASC Topic 715, the Company amortizes the impact \n40\n     MOODY'S\n 2024 10-K\nTable of Contents\nof asset returns over a five-year period for purposes of calculating the market-related value of assets that is used in determining the expected return on assets’ component of annual expense and in calculating the total unrecognized gain or loss subject to amortization. As of December 31, 2024, the Company has an unrecognized loss of $68 million, of which $19 million will be recognized in the market-related value of assets that is used to calculate the expected return on assets component of 2025 expense.\nThe table below shows the estimated effect that a one percentage-point decrease in each of these assumptions will have on Moody’s 2025 income before provision for income taxes. These effects have been calculated using the Company’s current projections of 2025 expenses, assets and liabilities related to Moody’s Retirement Plans, which could change as updated data becomes available.\n(dollars in millions)\nAssumptions Used for 2025\nEstimated Impact on 2025 Income before Provision for Income Taxes (Decrease) Increase\nWeighted Average Discount Rates \n(1)\n5.43%/5.40%\n$\n(4)\nWeighted Average Assumed Compensation Growth Rate\n3.60%\n$\n1 \nAssumed Long-Term Rate of Return on Pension Assets\n6.60%\n$\n(5)\n(1)\nWeighted average discount rates of 5.43% and 5.40% for pension plans and Other Retirement Plans, respectively.\nBased on current projections, the Company estimates that net periodic expense related to Retirement Plans will be immaterial in 2025.\nInvestments in Non-consolidated Affiliates\nEquity method investments are reviewed for indicators of other-than-temporary impairment on a quarterly basis. These investments are written down to fair value if there is evidence of a loss in value that is other-than-temporary.\nFor equity investments without a readily determinable fair value for which the Company does not have significant influence, Moody's generally elects to measure these investments at cost, less impairment, adjusted for subsequent observable price changes as of the date that an observable transaction takes place. \nThe Company performs an assessment on a quarterly basis to determine if there are indicators of impairment for its investments in non-consolidated affiliates. If there are indicators of impairment, the Company estimates the investment’s fair value and records an impairment if the carrying value of the investment exceeds its fair value.\nIn situations where estimation of fair value is required for investments in non-consolidated affiliates, the Company considers various factors, including: recent observable investee equity transactions, comparable public company/precedent transaction multiples and discounted cash flow models. The estimation of fair value for these investments may involve significant judgment.\nOther Estimates\nIn addition to the critical accounting estimates described above, there are other accounting estimates within Moody’s consolidated financial statements. Management believes the current assumptions and other considerations used to estimate amounts reflected in Moody’s consolidated financial statements are appropriate. However, if actual experience differs from the assumptions and other considerations used in estimating amounts reflected in Moody’s consolidated financial statements, the resulting changes could have a material adverse effect on Moody’s consolidated results of operations or financial condition.\nSee Note 2 to the consolidated financial statements for further information on significant accounting policies that impact Moody’s.\nReportable Segments\nThe Company is organized into two reportable segments at December 31, 2024: MA and MIS, which are more fully described in the section entitled “The Company” above and in Note 20 to the consolidated financial statements.\nMOODY'S\n 2024 10-K     41\nTable of Contents\nResults of Operations\nThis section of this Form 10-K generally discusses the year ended December 31, 2024 and 2023 financial results and year-to-year comparisons between these years. Discussions related to the year ended December 31, 2023 financial results and year-to-year comparisons between the years ended December 31, 2023 and 2022 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended \nDecember 31, 2023\n.\nThe following footnotes are applicable throughout the discussion of the Company's results of operations:\n(1)\nRefer to the section entitled \"Non-GAAP Financial Measures\" of this MD&A for the definition and methodology that the Company utilizes to calculate this metric.\n(2)\nRefer to the section entitled \"Key Performance Metrics\" of this MD&A for the definition and methodology that the Company utilizes to calculate this metric.\n42\n     MOODY'S\n 2024 10-K\nTable of Contents\nYear ended December 31, 2024 compared with year ended December 31, 2023 \nExecutive Summary\nThe following table provides an executive summary of key operating results for the year ended December 31, 2024. Following this executive summary is a more detailed discussion of the Company’s operating results as well as a discussion of the operating results of the Company’s reportable segments.\nYear Ended December 31,\nFinancial measure:\n2024\n2023\n% Change Favorable  (Unfavorable)\nInsight and Key Drivers of Change Compared to Prior Year\nMoody's total revenue\n$\n7,088\n \n$\n5,916 \n20 \n%\n— reflects growth in both segments\nMA external revenue\n$\n3,295\n \n$\n3,056 \n8 \n%\n— sustained demand for KYC, insurance offerings and SaaS-based banking solutions;\n— ongoing strong retention for ratings data feeds and company data applications; and\n— continued demand and sales growth for credit and economic research product offerings\nMIS external revenue\n$\n3,793\n \n$\n2,860 \n33 \n%\nreflects issuance growth across all LOBs resulting from:\n— favorable market conditions for issuers, due to sustained tight credit spreads and declining interest rates that drove strong refinancing activity; and\n— demand from investors as yields remained high for a majority of the year \nTotal operating and SG&A expenses\n$\n3,680\n \n$\n3,319 \n(11 \n%)\n— higher incentive and stock-based compensation aligned with financial and operating performance; and\n— higher salaries and benefits reflecting an increase in headcount and annual salary increases in both segments\nDepreciation and amortization\n$\n431\n \n$\n373 \n(16 \n%)\n— higher amortization relating to internally developed software, primarily related to the development of MA SaaS solutions\nRestructuring\n$\n59\n \n$\n87 \n32 \n%\n— relates to the Company's restructuring programs, more fully discussed in Note 9 to the consolidated financial statements\nCharges related to asset abandonment\n$\n43\n \n$\n— \nNM\n— costs related to the Company's decision to outsource the production of certain sustainability content utilized in our product offerings, which is more fully discussed in Note 22 to the consolidated financial statements\nTotal non-operating (expense) income, net\n$\n(176)\n$\n(202)\n13 \n%\n— an increase in interest income of $39 million due to higher cash and short-term investment balances and higher interest rates; and\n— a net decrease of $30 million in foreign exchange losses recorded during the year mainly attributable to an immaterial out-of-period adjustment relating to the 2022 fiscal year recorded in the first quarter of 2023;\npartially offset by:\n— an increase in tax-related interest expense of $21 million mainly due to the favorable resolution of tax matters in the prior year\nOperating Margin\n40.6\n \n%\n36.1 \n%\n450BPS\n— operating margin and Adjusted Operating Margin\n(1)\n expansion reflects strong revenue growth, particularly in MIS, outpacing operating and SG&A expense growth\nAdjusted Operating Margin\n(1)\n48.1\n \n%\n43.9 \n%\n420BPS\nETR\n23.7\n \n%\n16.9 \n%\n(680BPS)\n— higher ETR primarily reflects tax benefits recognized in the first quarter of 2023, which resulted from the resolutions of UTPs in various U.S. and non-U.S. tax jurisdictions\nDiluted EPS\n$\n11.26\n \n$\n8.73 \n29 \n%\n— increase reflects growth in operating income/Adjusted Operating Income\n(1) \ndriven mainly by increases in MIS revenue, \npartially offset by:\n— a $0.76 per share benefit in the prior year resulting from the resolutions of tax matters in the first quarter of 2023\nAdjusted Diluted EPS\n(1)\n$\n12.47\n \n$\n9.90 \n26 \n%\n \nMOODY'S\n 2024 10-K     43\nTable of Contents\nMoody’s Corporation\nYear Ended December 31,\n% Change Favorable\n(Unfavorable)\n2024\n2023\nRevenue:\nUnited States\n$\n3,836\n \n$\n3,071 \n25 \n%\nNon-U.S.:\nEMEA\n2,174\n \n1,886 \n15 \n%\nAsia-Pacific\n629\n \n570 \n10 \n%\nAmericas\n449\n \n389 \n15 \n%\nTotal Non-U.S.\n3,252\n \n2,845 \n14 \n%\nTotal\n7,088\n \n5,916 \n20 \n%\nExpenses:\nOperating\n1,945\n \n1,687 \n(15 \n%)\nSG&A\n1,735\n \n1,632 \n(6 \n%)\nDepreciation and amortization\n431\n \n373 \n(16 \n%)\nRestructuring\n59\n \n87 \n32 \n%\nCharges related to asset abandonment\n43\n \n— \nNM\nTotal\n4,213\n \n3,779 \n(11 \n%)\nOperating income\n2,875\n \n2,137 \n35 \n%\nAdjusted Operating Income \n(1)\n3,408\n \n2,597 \n31 \n%\nInterest expense, net\n(237)\n(251)\n6 \n%\nOther non-operating income, net\n61\n \n49 \n24 \n%\nNon-operating (expense) income, net\n(176)\n(202)\n13 \n%\nNet income attributable to Moody’s\n$\n2,058\n \n$\n1,607 \n28 \n%\nDiluted weighted average shares outstanding\n182.7\n \n184.0 \n1 \n%\nDiluted EPS attributable to Moody’s common shareholders\n$\n11.26\n \n$\n8.73 \n29 \n%\nAdjusted Diluted EPS \n(1)\n$\n12.47\n \n$\n9.90 \n26 \n%\nOperating margin\n40.6\n \n%\n36.1 \n%\nAdjusted Operating Margin \n(1)\n48.1\n \n%\n43.9 \n%\nETR\n23.7\n \n%\n16.9 \n%\nGLOBAL REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nGlobal revenue ⇑ $1,172 million\nU.S. Revenue ⇑ $765 million\nNon-U.S. Revenue ⇑ $407 million\nGrowth in global revenue reflected increases in both MA and MIS, both in the U.S. and internationally. Refer to the section entitled “Segment Results” of this MD&A for a more fulsome discussion of the Company’s segment revenue.\n44\n     MOODY'S\n 2024 10-K\nTable of Contents\nOperating Expense ⇑ $258 million\nCompensation expenses of $1,469 million increased $245 million, with the most notable drivers reflecting:\nNon-compensation expenses of $476 million increased $13 million, with the most notable driver reflecting:\n— higher salaries and benefits reflecting hiring and salary increases to support continued growth in the business; and\n— costs to support operating growth, including investments in technology and innovation \n— higher incentive and stock-based compensation aligned with financial and operating performance and headcount growth\nSG&A Expense ⇑ $103 million\nCompensation expenses of $1,070 million increased $54 million, with the most notable drivers reflecting:\nNon-compensation expenses of $665 million increased $49 million, with the most notable drivers reflecting:\n— higher incentive and stock-based compensation aligned with headcount growth and financial and operating performance\n— a charge in 2024 relating to a regulatory investigation, which is more fully discussed in Note 19 to the consolidated financial statements; and\n— increases in costs to support operating growth, including investments to support technology and innovation\nMOODY'S\n 2024 10-K     45\nTable of Contents\nDepreciation and amortization \nThe increase in depreciation and amortization expense is driven by amortization of internally developed software, which is primarily related to the development of MA SaaS solutions. \nRestructuring \nThe amounts reflect charges and adjustments related to the Company's restructuring programs as more fully discussed in Note 9 to the consolidated financial statements.\nCharges related to asset abandonment\nReflects costs related to the Company's decision to outsource the production of certain sustainability content utilized in our product offerings, which is more fully discussed in Note 22 to the consolidated financial statements.\nOperating margin 40.6%, up 450 BPS\nAdjusted Operating Margin 48.1%, up 420 BPS\nIncreases in both Operating margin and Adjusted Operating Margin\n(1)\n are due to strong revenue growth, particularly within MIS, partially offset by an increase in operating and SG&A expenses.\nInterest Expense ⇓ $14 million\nOther non-operating income ⇑ $12 million\nThe decrease in interest expense is primarily due to:\nThe most notable drivers of the increase in income are:\n— higher interest income of $39 million reflecting higher cash and short-term investment balances and interest yields; \npartially\n \noffset by:\n— a $30 million net decrease in foreign currency losses mainly attributable to an immaterial out-of-period adjustment relating to the 2022 fiscal year recorded in the first quarter of 2023;\n partially offset by:\n— an increase of $21 million in tax-related interest mainly reflecting the favorable resolution of tax matters in the prior year\n— a benefit of $9 million in the prior year related to the favorable resolution of various tax matters\nETR ⇑ 680BPS\nThe increase in the ETR primarily reflects $113 million in tax benefits recognized in the first quarter of 2023, which resulted from the resolutions of UTPs in various U.S. and non-U.S. tax jurisdictions that did not recur in 2024.\nDiluted EPS ⇑ $2.53 \nAdjusted Diluted EPS ⇑ $2.57\nBoth diluted EPS and Adjusted Diluted EPS\n(1)\n growth is mostly attributable to higher operating income and Adjusted Operating Income\n(1)\n, the components of which are more fully described above. This was partially offset by a $0.76 per share benefit in the prior year related to the resolution of tax matters in the first quarter of 2023.\n46\n     MOODY'S\n 2024 10-K\nTable of Contents\nSegment Results\nMoody’s Analytics\nThe table below provides a summary of revenue and operating results, followed by further insight and commentary:\nYear Ended December 31,\n% Change Favorable\n(Unfavorable)\n2024\n2023\nRevenue:\nDecision Solutions (DS)\n$\n1,516\n \n$\n1,383 \n10 \n%\nResearch and Insights (R&I)\n926\n \n884 \n5 \n%\nData and Information (D&I)\n853\n \n789 \n8 \n%\nTotal external revenue\n3,295\n \n3,056 \n8 \n%\nIntersegment revenue\n13\n \n13 \n— \n%\nTotal MA Revenue\n3,308\n \n3,069 \n8 \n%\nExpenses:\nOperating and SG&A (external)\n2,101\n \n1,946 \n(8 \n%)\nOperating and SG&A (intersegment)\n193\n \n186 \n(4 \n%)\nTotal operating and SG&A expense\n2,294\n \n2,132 \n(8 \n%)\nAdjusted Operating Income\n$\n1,014\n \n$\n937 \n8 \n%\nAdjusted Operating Margin\n30.7\n \n%\n30.5 \n%\nDepreciation and amortization\n353\n \n298 \n(18 \n%)\nRestructuring\n42\n \n59 \n29 \n%\nCharges related to asset abandonment\n43\n \n— \nNM\nMOODY'S ANALYTICS REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nMA: Global revenue ⇑ $239 million\nU.S. Revenue  ⇑ $69 million\nNon-U.S. Revenue  ⇑ $170 million\nThe 8% increase in global MA revenue reflects growth both in the U.S. (5%) and internationally (10%) across all LOBs. \n–\nARR\n(2)\n increased 9% reflecting strong growth across all LOBs.\nMOODY'S\n 2024 10-K     47\nTable of Contents\nDECISION SOLUTIONS REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \n \nDS: Global revenue ⇑ $133 million\nU.S. Revenue ⇑ $20 million\nNon-U.S. Revenue ⇑ $113 million\nGlobal DS revenue for the for the years ended December 31, 2024 and 2023 was comprised as follows\n:\nGlobal DS revenue grew 10% and reflects increases in both the U.S. (4%) and internationally (14%).\nThe most notable drivers of the growth reflect: \n–\nstrong demand for KYC and compliance solutions reflecting increased customer and supplier risk data usage, coupled with sales growth from new customers, drove both revenue and ARR\n(2)\n growth of 18% and 17%, respectively; \n–\nInsurance revenue and ARR\n(2)\n grew 9% and 12%, respectively.\n–\nrecurring revenue growth of 12% in Insurance was attributable to improved customer retention and strong demand resulting in new sales for subscription-based catastrophe modeling tools.\n–\nBanking revenue and ARR\n(2)\n grew 6% and 9%, respectively.\n–\nrecurring revenue growth of 11% within Banking was supported by strong customer retention coupled with expansion of existing customer relationships to subscription-based banking offerings, which enable customers' lending, risk management and finance workflows;\n–\nthe aforementioned recurring revenue growth for Insurance and Banking was partially offset by a decline in transaction revenue of 39% and 10%, respectively, reflecting MA's continued strategic shift to subscription-based solutions.\nThe aforementioned factors contributed to overall ARR\n(2)\n growth for DS of 12%.\n48\n     MOODY'S\n 2024 10-K\nTable of Contents\nRESEARCH AND INSIGHTS REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nR&I: Global revenue  ⇑ $42 million\nU.S. Revenue ⇑ $24 million\nNon-U.S. Revenue ⇑ $18 million\nGlobal R&I revenue increased 5% compared to 2023 and reflects growth in both the U.S. (5%) and internationally (5%). This increase was attributable to sales growth for credit and economic research product offerings, which contributed to ARR\n(2) \ngrowth of 6%.\nDATA AND INFORMATION REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nD&I: Global revenue  ⇑ $64 million\nU.S. Revenue ⇑ $25 million\nNon-U.S. Revenue ⇑ $39 million\nGlobal D&I revenue increased 8% compared to 2023 and reflects growth in both the U.S. (9%) and internationally (8%), mainly driven by continued strong demand for company ratings feeds and data applications, which contributed to ARR\n(2) \ngrowth of 8% for D&I.\nMOODY'S\n 2024 10-K     49\nTable of Contents\nMA: Operating and SG&A Expense ⇑ $155 million\nCompensation expenses of $1,370 million increased $132 million:\nNon-compensation expenses of $731 million increased $23 million:\n— the growth in salaries and benefits reflects higher headcount and annual salary increases to support business growth; and\n— the modest increase is mostly attributable to costs to support operating growth, including investments in technology and innovation\n— the increase in incentive and stock-based compensation is driven by higher headcount and financial and operating performance\nMA: Adjusted Operating Margin 30.7% ⇑ 20BPS\nModest Adjusted Operating Margin expansion for MA is primarily due to the 8% increase in global MA revenue, offset by an 8% increase in operating and SG&A expenses.\nDepreciation and amortization\nThe increase in depreciation and amortization expense primarily reflects higher amortization of internally developed software relating to the development of SaaS-based solutions.\nRestructuring \nThe restructuring charges relate to the Company's restructuring programs as more fully discussed in Note 9 to the consolidated financial statements.\nCharges related to asset abandonment\nReflects costs related to the Company's decision to outsource the production of certain sustainability content utilized in our product offerings, which is more fully discussed in Note 22 to the consolidated financial statements.\n50\n     MOODY'S\n 2024 10-K\nTable of Contents\nMoody’s Investors Service\nThe table below provides a summary of revenue and operating results, followed by further insight and commentary:\nYear Ended December 31,\n% Change Favorable\n(Unfavorable)\n2024\n2023\nRevenue:\nCorporate finance (CFG)\n$\n1,950\n \n$\n1,404 \n39 \n%\nStructured finance (SFG)\n518\n \n405 \n28 \n%\nFinancial institutions (FIG)\n727\n \n545 \n33 \n%\nPublic, project and infrastructure finance (PPIF)\n564\n \n476 \n18 \n%\nTotal ratings revenue\n3,759\n \n2,830 \n33 \n%\nMIS Other\n34\n \n30 \n13 \n%\nTotal external revenue\n3,793\n \n2,860 \n33 \n%\nIntersegment royalty\n193\n \n186 \n4 \n%\nTotal\n3,986\n \n3,046 \n31 \n%\nExpenses:\nOperating and SG&A (external)\n1,579\n \n1,373 \n(15 \n%)\nOperating and SG&A (intersegment)\n13\n \n13 \n— \n%\nTotal operating and SG&A expense\n1,592\n \n1,386 \n(15 \n%)\nAdjusted Operating Income\n$\n2,394\n \n$\n1,660 \n44 \n%\nAdjusted Operating Margin\n60.1\n \n%\n54.5 \n%\nDepreciation and amortization\n78\n \n75 \n(4 \n%)\nRestructuring\n17\n \n28 \n39 \n%\nThe following chart presents changes in rated issuance volumes compared to 2023. To the extent that changes in rated issuance volumes had a material impact to MIS's revenue compared to the prior year, those impacts are discussed below.\nMOODY'S\n 2024 10-K     51\nTable of Contents\nMOODY'S INVESTORS SERVICE REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nMIS: Global revenue ⇑ $933 million\nU.S. Revenue ⇑ $696 million\nNon-U.S. Revenue ⇑ $237 million\nThe increase in global MIS revenue reflects strong growth across all LOBs.\nCFG REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nCFG: Global revenue ⇑ $546 million\nU.S. Revenue ⇑ $381 million\nNon-U.S. Revenue ⇑ $165 million\nGlobal CFG revenue for the years ended December 31, 2024 and 2023 was comprised as follows\n:\n* Other includes: recurring monitoring fees of a rated debt obligation and/or entities that issue such obligations as well as fees from programs such as commercial paper, medium term notes, and ICRA corporate finance revenue.\n52\n     MOODY'S\n 2024 10-K\nTable of Contents\nThe increase in CFG revenue of 39% reflects increases in both the U.S (40%) and internationally (37%).\nTransaction revenue increased $528 million compared to the prior year, with continued momentum in leveraged finance (which includes bank loans and speculative-grade bonds) and investment-grade issuance. The growth in these sectors resulted from:\n–\nstrong refinancing activity and new mandates, resulting from:\n–\ncontinued tight credit spreads and declining interest rates; and\n–\nstrong investor demand as yields remained high for the majority of the year; and\n–\nbank loan and investment-grade issuance to fund M&A transactions.\nSFG REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \nSFG: Global revenue ⇑ $113 million\nU.S. Revenue ⇑ $116 million\nNon-U.S. Revenue ⇓ $3 million\nGlobal SFG revenue for the years ended December 31, 2024 and 2023 was comprised as follows:\nThe increase in SFG revenue of 28% reflects growth in the U.S. (46%), partially offset by modest declines in international revenue (2%). \nTransaction revenue increased $102 million compared to 2023, mainly attributable to:\n–\nhigher CLO issuance, with new deals supported by increased bank loan activity, coupled with refinancing activity; and \n–\nincreased issuance activity from the CMBS asset class, reflecting tightening credit spreads, declining interest rates and strong investor demand.\nMOODY'S\n 2024 10-K     53\nTable of Contents\nFIG REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nFIG: Global revenue ⇑ $182 million\nU.S. Revenue ⇑ $133 million\nNon-U.S. Revenue ⇑ $49 million\nGlobal FIG revenue for the years ended December 31, 2024 and 2023 was comprised as follows:\nThe increase in FIG revenue of 33% reflects growth in both the U.S. (53%) and internationally (17%). \nTransaction revenue increased $164 million compared to 2023, primarily driven by issuance growth in the insurance and banking sector, which was supported by a favorable issuance mix from infrequent issuer activity.\nPPIF REVENUE\n2024\n---------------------------------------------------------------------------------------\n2023\n_________________________________________________\n_________\n______________________________________________\n \n \n \nPPIF: Global revenue  ⇑ $88 million\nU.S. Revenue  ⇑ $67 million\nNon-U.S. Revenue ⇑ $21 million\n54\n     MOODY'S\n 2024 10-K\nTable of Contents\nGlobal PPIF revenue for the years ended December 31, 2024 and 2023 was comprised as follows:\nThe 18% increase in PPIF revenue reflects increases in both the U.S. (23%) and internationally (11%).\nTransaction revenue increased $83 million compared to 2023, primarily due to:\n–\nhigher issuance from U.S. Public Finance issuers, reflecting increased activity in the state and local government and higher education sectors;\n–\nincreased investment-grade infrastructure finance activity in both the U.S. and EMEA; and\n–\nhigher U.S. Project Finance activity supported by continued market improvement.\nMIS: Operating and SG&A Expense ⇑ $206 million\nCompensation expenses of $1,169 million increased $166 million, with the most notable drivers of the growth reflecting:\nNon-compensation expenses of $410 million increased $40 million with the most notable drivers of the growth reflecting:\n— an increase in incentive and stock-based compensation driven by higher headcount and financial and operating performance; and \n— an increase in costs to support operating growth; and\n— a charge relating to a regulatory investigation, which is more fully discussed in Note 19 to the consolidated financial statements\n— growth in salaries and benefits reflecting higher headcount and annual salary increases\nMIS: Adjusted Operating Margin of 60.1% ⇑  560BPS\nThe MIS Adjusted Operating Margin expansion primarily reflected the aforementioned 33% increase in revenue, partially offset by growth of 15% in operating and SG&A expenses. \nRestructuring Charges\nThe restructuring charges relate to the Company's restructuring programs as more fully discussed in Note 9 to the consolidated financial statements.\nMOODY'S\n 2024 10-K     55\nTable of Contents\nMarket Risk\nFX risk:\nMoody’s maintains a presence in more than 40 countries. In 2024, approximately 39% of the Company’s revenue and approximately 38% of the Company's expenses were denominated in functional currencies other than the U.S. dollar, principally in the British pound and the euro. As such, the Company is exposed to market risk from changes in FX rates. As of December 31, 2024, approximately 49% of Moody’s assets were located outside the U.S., making the Company susceptible to fluctuations in FX rates. The effects of translating assets and liabilities of non-U.S. operations with non-U.S. functional currencies to the U.S. dollar are charged or credited to OCI.\nThe effects of revaluing assets and liabilities that are denominated in currencies other than a subsidiary’s functional currency are charged to other non-operating income, net in the Company’s consolidated statements of operations. Accordingly, the Company enters into foreign exchange forward contracts to partially mitigate the change in fair value on certain assets and liabilities denominated in currencies other than a subsidiary’s functional currency. The following table shows the impact to the fair value of the forward contracts if currencies being purchased were to weaken by 10%:\nForeign Currency Forwards \n(1)\nImpact on fair value of contract\nSell\nBuy\nU.S. dollar\nBritish pound\n$59 million unfavorable impact\nU.S. dollar\nSingapore dollar\n$4 million unfavorable impact\nU.S. dollar\nCanadian dollar\n$3 million unfavorable impact\nU.S. dollar\nJapanese yen\n$2 million unfavorable impact\nU.S. dollar\nIndian Rupee\n$2 million unfavorable impact\nEuro\nU.S. dollar\n$1 million unfavorable impact\n$71 million unfavorable impact\n(1)\nRefer to Note 6 to the consolidated financial statements in Item 8 of this Form 10-K for further detail on the forward contracts.\nThe change in fair value of the foreign exchange forward contracts would be offset by FX revaluation gains or losses on underlying assets and liabilities denominated in currencies other than a subsidiary’s functional currency.\nDerivatives and non-derivatives designated as net investment hedges:\nThe Company designates derivative instruments and foreign currency-denominated debt as hedges of foreign currency risk of net investments in certain foreign subsidiaries (net investment hedges) under ASC Topic 815, \nDerivatives and Hedging\n. \nCross-currency swaps\nAs of December 31, 2024, the Company had cross-currency swaps designated as hedges of euro denominated net investments in subsidiaries, for which the notional values and corresponding interest rates are disclosed in Note 6 to the consolidated financial statements located in Item 8 of this Form 10-K. \nIf the euro were to strengthen 10% relative to the U.S. dollar, there would be an approximate $321 million unfavorable impact to the fair value of the cross-currency swaps recognized in OCI, which would be offset by favorable currency translation gains on the Company’s euro net investment in foreign subsidiaries.\nEuro-denominated debt\nAs of December 31, 2024, the Company has designated €500 million of the 2015 Senior Notes and €750 million of the 2019 Senior Notes as a net investment hedge to mitigate FX exposure relating to euro denominated net investments in subsidiaries. If the euro were to strengthen 10% relative to the U.S. dollar, there would be an approximate $129 million unfavorable adjustment to OCI related to these net investment hedges. This adjustment would be offset by favorable translation adjustments on the Company’s euro net investment in subsidiaries.\n56\n     MOODY'S\n 2024 10-K\nTable of Contents\nInterest rate and credit risk:\nInterest rate swaps designated as a fair value hedge:\nThe Company’s interest rate risk management objectives are to reduce the funding cost and volatility to the Company and to alter the interest rate exposure to a desired risk profile. Moody’s uses interest rate swaps as deemed necessary to assist in accomplishing these objectives. The Company is exposed to interest rate risk on its various outstanding fixed-rate debt for which the fair value of the outstanding fixed rate debt fluctuates based on changes in interest rates. The Company has entered into interest rate swaps to convert the fixed interest rate on certain of its long-term debt to a floating interest rate based on the SOFR. These swaps are adjusted to fair market value based on prevailing interest rates at the end of each reporting period and fluctuations are recorded as a reduction or addition to the carrying value of the borrowing, while net interest payments are recorded as interest expense/income in the Company’s consolidated statement of operations. A hypothetical change of 100 BPS in the SOFR-based swap rate would result in an approximate $161 million change to the fair value of the swaps, which would be offset by the change in fair value of the hedged item.\nAdditional information on these interest rate swaps is disclosed in Note 6 to the consolidated financial statements located in Item 8 of this Form 10-K.\nMoody’s cash equivalents consist of investments in high-quality investment-grade securities within and outside the U.S. with maturities of three months or less when purchased. The Company manages its credit risk exposure by allocating its cash equivalents among various money market deposit accounts and certificates of deposit and by limiting the amount it can invest with any single issuer. Short-term investments primarily consist of certificates of deposit.\nLiquidity and Capital Resources\nMoody's remains committed to using its strong cash flow to create value for shareholders by both investing in the Company's employees and growing the business through targeted organic initiatives and inorganic acquisitions aligned with strategic priorities. Additional excess capital is returned to the Company’s shareholders via a combination of dividends and share repurchases.\nCash Flow\nThe Company is currently financing its operations, capital expenditures, acquisitions and share repurchases from operating and financing cash flows.\nThe following is a summary of the changes in the Company’s cash flows followed by a brief discussion of these changes:\nYear Ended December 31,\n$ Change \nFavorable/ (unfavorable)\n2024\n2023\nNet cash provided by operating activities\n$\n2,838\n \n$\n2,151 \n$\n687 \nNet cash used in investing activities\n$\n(1,056)\n$\n(247)\n$\n(809)\nNet cash used in financing activities\n$\n(1,446)\n$\n(1,584)\n$\n138 \nFree Cash Flow\n (1)\n$\n2,521\n \n$\n1,880 \n$\n641 \n(1)\nFree Cash Flow is a non-GAAP measure and is defined by the Company as net cash provided by operating activities minus cash paid for capital additions. Refer to the section entitled “Non-GAAP Financial Measures” of this MD&A for further information on this financial measure.\nNet cash provided by operating activities\nNet cash flows from operating activities increased by $687 million compared to the prior year, with the most notable drivers reflecting: \n–\ngrowth in operating income of $738 million coupled with various changes in working capital;\npartially offset by:\n–\n$269 million in higher income tax payments in the current year.\nNet cash used in investing activities\nThe $809 million increase in cash flows used in investing activities compared to 2023 primarily reflects:\n–\nhigher net purchases of investments in 2024 of $535 million;\n–\nhigher cash paid for acquisitions, net of cash acquired, of $218 million primarily due to the acquisition of Numerated in the fourth quarter of 2024, GCR and Praedicat in the third quarter of 2024, and certain other immaterial acquisitions completed in the first quarter of 2024; and\n–\nhigher cash paid for capital additions of $46 million compared to the prior year reflecting both the development of SaaS-based solutions in MA coupled with costs to support investments in company-wide technology infrastructure.\nNet cash used in financing activities\nThe $138 million decrease in cash used in financing activities was primarily attributed to:\nMOODY'S\n 2024 10-K     57\nTable of Contents\n–\na $500 million repayment of notes payable in 2023; and\n–\na $496 million issuance of notes in the third quarter of 2024;\npartially offset by:\n–\n higher cash paid for treasury share repurchases in 2024 of $802 million compared to the prior year.\nCash and cash equivalents and short-term investments\nThe Company’s aggregate cash and cash equivalents and short-term investments of $3.0 billion at December 31, 2024 included approximately $1.7 billion located outside of the U.S. Approximately 33% of the Company’s aggregate cash and cash equivalents and short-term investments is denominated in EUR and GBP. The Company manages both its U.S. and non-U.S. cash flow to maintain sufficient liquidity in all regions to effectively meet its operating needs.\nAs a result of the Tax Act, all previously net undistributed foreign earnings have now been subject to U.S. tax since 2017. The Company continues to evaluate which entities it will indefinitely reinvest earnings outside the U.S. The Company has provided deferred taxes for those entities whose earnings are not considered indefinitely reinvested. Accordingly, the Company continues to repatriate a portion of its non-U.S. cash in these subsidiaries and will continue to repatriate certain of its offshore cash in a manner that addresses compliance with local statutory requirements, sufficient offshore working capital and any other factors that may be relevant in certain jurisdictions. Notwithstanding the Tax Act, which generally eliminated federal income tax on future cash repatriation to the U.S., cash repatriation may be subject to state and local taxes or withholding or similar taxes.\nMaterial Cash Requirements\nThe Company's material cash requirements consist of the following contractual and other obligations:\nFinancing Arrangements\nIndebtedness\nAt December 31, 2024, Moody’s had $7.4 billion of outstanding debt and approximately $1 billion of additional capacity available under the Company’s CP program, which is backstopped by the $1.25 billion 2024 Credit Facility.\nThe repayment schedule for the Company’s borrowings outstanding at December 31, 2024 is as follows:\nFuture interest payments and fees associated with the Company's debt and credit facility are expected to be $4.7 billion, of which approximately $300 million is expected to be paid in each of the next five years, and the remaining amount expected to be paid thereafter. For additional information on the Company's outstanding debt, CP program and 2024 Credit Facility, refer to Note 16 to the consolidated financial statements. \nManagement may consider pursuing additional long-term financing when it is appropriate in light of cash requirements for operations, share repurchases and other strategic opportunities, which could result in higher financing costs.\nPurchase Obligations \nPurchase obligations generally include multi-year agreements with vendors to purchase goods or services and mainly include data center/cloud hosting fees and fees for information technology licensing and maintenance. As of December 31, 2024, these purchase obligations totaled $716 million, of which approximately 45% is expected to be paid in the next twelve months and another approximate 45% expected to be paid over the next two subsequent years, with the remainder to be paid thereafter.\nLeases\nThe Company has remaining payments related to its operating leases of $478 million at December 31, 2024, primarily related to real estate leases, of which $111 million in payments are expected over the next twelve months. For more information on the expected cash flows relating to the Company's operating leases, refer to Note 18 to the consolidated financial statements. \nPension and Other Retirement Plan Obligations\nThe Company does not anticipate making significant contributions to its funded pension plan in the next twelve months. This plan is overfunded at December 31, 2024, and accordingly holds sufficient investments to fund future benefit obligations. Payments for the \n58\n     MOODY'S\n 2024 10-K\nTable of Contents\nCompany's unfunded plans are not expected to be material in either the short or long-term. For further information on the Company's pension and other retirement plan obligations, refer to Note 13 to the consolidated financial statements.\nDividends and share repurchases\nOn February 12, 2025, the Board approved the declaration of a quarterly dividend of $0.94 per share for Moody’s common stock, payable March 14, 2025 to shareholders of record at the close of business on February 25, 2025. The continued payment of dividends at this rate, or at all, is subject to the discretion of the Board.\nOn February 5, 2024, the Board of Directors authorized $1 billion in share repurchase authority. On October 15, 2024, the Board authorized an additional $1.5 billion in share repurchase authority. At December 31, 2024, the Company had approximately $1.6 billion of remaining authority under these authorizations. There is no established expiration date for the remaining authorizations.\nRestructuring\nAs more fully discussed in Note 9 to the consolidated financial statements, the Company is currently in the process of executing the Strategic and Operational Efficiency Restructuring Program. Future cash outlays associated with this program are expected to be $165 million to $195 million, which are expected to be paid out through 2027.\nSources of Funding to Satisfy Material Cash Requirements\nThe Company believes that it has the financial resources needed to meet its cash requirements and expects to have positive operating cash flow in 2025. Cash requirements for periods beyond the next twelve months will depend, among other things, on the Company’s profitability and its ability to manage working capital requirements. The Company may also borrow from various sources as described above.\nNon-GAAP Financial Measures:\nIn addition to its reported results, Moody’s has included in this MD&A certain adjusted results that the SEC defines as “Non-GAAP financial measures.” Management believes that such adjusted financial measures, when read in conjunction with the Company’s reported results, can provide useful supplemental information for investors analyzing period-to-period comparisons of the Company’s performance, facilitate comparisons to competitors’ operating results and can provide greater transparency to investors of supplemental information used by management in its financial and operational decision-making. These adjusted measures, as defined by the Company, are not necessarily comparable to similarly defined measures of other companies. Furthermore, these adjusted measures should not be viewed in isolation or used as a substitute for other GAAP measures in assessing the operating performance or cash flows of the Company. Below are brief descriptions of the Company’s adjusted financial measures accompanied by a reconciliation of the adjusted measure to its most directly comparable GAAP measure.\nAdjusted Operating Income and Adjusted Operating Margin:\nThe Company presents Adjusted Operating Income and Adjusted Operating Margin because management deems these metrics to be useful measures to provide additional perspective on Moody's operating performance. Adjusted Operating Income excludes the impact of: i) depreciation and amortization; ii) restructuring charges/adjustments; and iii) charges related to asset abandonment. Depreciation and amortization are excluded because companies utilize productive assets of different useful lives and use different methods of acquiring and depreciating productive assets. Restructuring charges/adjustments and charges related to asset abandonment, which the Company believes are not reflective of its ongoing operating cost structure, are excluded as the frequency and magnitude of these charges may vary widely across periods and companies. Refer to Notes 9 and 22 to the consolidated financial statements for further information regarding the nature of the Company’s restructuring programs and asset abandonment, respectively.\nManagement believes that the exclusion of the aforementioned items, as detailed in the reconciliation below, allows for an additional perspective on the Company’s operating results from period to period and across companies. The Company defines Adjusted Operating Margin as Adjusted Operating Income divided by revenue. \nYear ended December 31,\n2024\n2023\nOperating income\n$\n2,875\n \n$\n2,137 \nAdjustments:\nDepreciation and amortization\n431\n \n373 \nRestructuring\n59\n \n87 \nCharges related to asset abandonment\n43\n \n— \nAdjusted Operating Income\n$\n3,408\n \n$\n2,597 \nOperating margin\n40.6\n \n%\n36.1 \n%\nAdjusted Operating Margin\n48.1\n \n%\n43.9 \n%\nMOODY'S\n 2024 10-K     59\nTable of Contents\nAdjusted Net Income and Adjusted Diluted EPS attributable to Moody’s common shareholders:\nThe Company presents Adjusted Net Income and Adjusted Diluted EPS because management deems these metrics to be useful measures to provide additional perspective on Moody's operating performance. Adjusted Net Income and Adjusted Diluted EPS exclude the impact of: i) amortization of acquired intangible assets; ii) restructuring charges/adjustments; iii) charges related to asset abandonment; and iv) gains on previously held equity method investments.\nThe Company excludes the impact of amortization of acquired intangible assets as companies utilize intangible assets with different estimated useful lives and have different methods of acquiring and amortizing intangible assets. These intangible assets were recorded as part of acquisition accounting and contribute to revenue generation. The amortization of intangible assets related to acquisitions will recur in future periods until such intangible assets have been fully amortized. Furthermore, the timing and magnitude of business combination transactions are not predictable and the purchase price allocated to amortizable intangible assets and the related amortization period are unique to each acquisition and can vary significantly from period to period and across companies. Restructuring charges/adjustments and charges related to asset abandonment, which the Company believes are not reflective of its ongoing operating cost structure, and gains on previously held equity method investments are excluded as the frequency and magnitude of these items may vary widely across periods and companies. \nThe Company excludes the aforementioned items to provide additional perspective when comparing net income and diluted EPS from period to period and across companies as the frequency and magnitude of similar transactions may vary widely across periods.\nYear ended December 31,\nAmounts in millions\n2024\n2023\nNet income attributable to Moody’s common shareholders\n$\n2,058\n \n$\n1,607\n \nPre-tax Acquisition-Related Intangible Amortization Expenses\n$\n198 \n$\n198 \nTax on Acquisition-Related Intangible Amortization Expenses\n(48)\n(48)\nNet Acquisition-Related Intangible Amortization Expenses\n150\n \n150\n \nPre-tax restructuring\n$\n59 \n$\n87 \nTax on restructuring\n(15)\n(22)\nNet restructuring\n44\n \n65\n \nPre-tax charges related to asset abandonment\n$\n43 \n$\n— \nTax on charges related to asset abandonment\n(11)\n— \nNet charges related to asset abandonment\n32\n \n—\n \nPre-tax gain on previously held equity method investments\n$\n(7)\n$\n— \nTax on gain on previously held equity method investments\n2 \n— \nNet gain on previously held equity method investments\n(5)\n—\n \nAdjusted Net Income\n$\n2,279\n \n$\n1,822\n \nYear ended December 31,\n2024\n2023\nDiluted earnings per share attributable to Moody’s common shareholders\n$\n11.26\n \n$\n8.73\n \nPre-tax Acquisition-Related Intangible Amortization Expenses\n$\n1.08 \n$\n1.08 \nTax on Acquisition-Related Intangible Amortization Expenses\n(0.26)\n(0.26)\nNet Acquisition-Related Intangible Amortization Expenses\n0.82\n \n0.82\n \nPre-tax restructuring\n$\n0.32 \n$\n0.47 \nTax on restructuring\n(0.08)\n(0.12)\nNet restructuring\n0.24\n \n0.35\n \nPre-tax charges related to asset abandonment\n$\n0.24 \n$\n— \nTax on charges related to asset abandonment\n(0.06)\n— \nNet charges related to asset abandonment\n0.18\n \n—\n \nPre-tax gain on previously held equity method investments\n$\n(0.04)\n$\n— \nTax on gain on previously held equity method investments\n0.01 \n— \nNet gain on previously held equity method investments\n(0.03)\n—\n \nAdjusted Diluted EPS\n$\n12.47\n \n$\n9.90\n \n60\n     MOODY'S\n 2024 10-K\nTable of Contents\nNote: the tax impacts in the table above were calculated using tax rates in effect in the jurisdiction for which the item relates.\nFree Cash Flow:\nThe Company defines Free Cash Flow as net cash provided by operating activities minus cash paid for capital additions. Management believes that Free Cash Flow is a useful metric in assessing the Company’s cash flows to service debt, pay dividends and to fund acquisitions and share repurchases. Management deems capital expenditures essential to the Company’s product and service innovations and maintenance of Moody’s operational capabilities. Accordingly, capital expenditures are deemed to be a recurring use of Moody’s cash flow. Below is a reconciliation of the Company’s net cash flows from operating activities to Free Cash Flow:\nYear ended December 31,\n2024\n2023\nNet cash provided by operating activities\n$\n2,838\n \n$\n2,151 \nCapital additions\n(317)\n(271)\nFree Cash Flow\n$\n2,521\n \n$\n1,880 \nNet cash used in investing activities\n$\n(1,056)\n$\n(247)\nNet cash used in financing activities\n$\n(1,446)\n$\n(1,584)\nKey Performance Metrics:\nThe Company presents ARR on a constant currency organic basis for its MA business as a supplemental performance metric to provide additional insight on the estimated value of MA's recurring revenue contracts at a given point in time. The Company uses ARR to manage and monitor performance of its MA operating segment and believes that this metric is a key indicator of the trajectory of MA's recurring revenue base.\nThe Company calculates ARR by taking the total recurring contract value for each active renewable contract as of the reporting date, divided by the number of days in the contract and multiplied by 365 days to create an annualized value. The Company defines renewable contracts as subscriptions, term licenses, maintenance and renewable services. ARR excludes transaction sales including one-time training, services and perpetual licenses. In order to compare period-over-period ARR excluding the effects of foreign currency translation, the Company bases the calculation on currency rates utilized in its current year operating budget and holds these FX rates constant for the duration of all current and prior periods being reported. Additionally, ARR excludes contracts related to acquisitions to provide additional perspective in assessing growth excluding the impacts from certain acquisition activity.\nThe Company’s definition of ARR may differ from definitions utilized by other companies reporting similarly named measures, and this metric should be viewed in addition to, and not as a substitute for, financial measures presented in accordance with GAAP.\nAmounts in millions\nDecember 31, 2024\nDecember 31, 2023\nChange\nGrowth\nMA ARR\nDecision Solutions\nBanking\n$\n457\n \n$\n420 \n$\n37 \n9%\nInsurance\n601\n \n536 \n65 \n12%\nKYC\n390\n \n334 \n56 \n17%\nTotal Decision Solutions\n$\n1,448\n \n$\n1,290 \n$\n158 \n12%\nResearch and Insights\n942\n \n885 \n57 \n6%\nData and Information\n888\n \n821 \n67 \n8%\nTotal MA ARR\n$\n3,278\n \n$\n2,996 \n$\n282 \n9%\nRecently Issued Accounting Pronouncements\nRefer to Note 2 to the consolidated financial statements located in Part II, Item 8 on this Form 10-K for a discussion on the impact to the Company relating to recently issued accounting pronouncements.\nContingencies\nLegal proceedings in which the Company is involved also may impact Moody’s liquidity or operating results. No assurance can be provided as to the outcome of such proceedings. In addition, litigation inherently involves significant costs. For information regarding legal proceedings, see Part II, Item 8 – “Financial Statements,” Note 19 “Contingencies” in this Form 10-K.\nForward-Looking Statements\nCertain statements contained in this annual report on Form 10-K are forward-looking statements and are based on future expectations, plans and prospects for the Company's business and operations that involve a number of risks and uncertainties. Such statements involve estimates, projections, goals, forecasts, assumptions and uncertainties that could cause actual results or outcomes to differ materially from those contemplated, expressed, projected, anticipated or implied in the forward-looking \nMOODY'S\n 2024 10-K     61\nTable of Contents\nstatements. Those statements appear at various places throughout this annual report on Form 10-K, including in the sections entitled “Contingencies” under Item 7, “MD&A”, commencing on page \n38\n of this annual report on Form 10-K, under “Legal Proceedings” in Part I, Item 3, of this Form 10-K, and elsewhere in the context of statements containing the words “believe,” “expect,” “anticipate,” “intend,” “plan,” “will,” “predict,” “potential,” “continue,” “strategy,” “aspire,” “target,” “forecast,” “project,” “estimate,” “should,” “could,” “may,” and similar expressions or words and variations thereof relating to the Company’s views on future events, trends and contingencies or otherwise convey the prospective nature of events or outcomes generally indicative of forward-looking statements. Stockholders and investors are cautioned not to place undue reliance on these forward-looking statements. The forward-looking statements and other information in this document are made as of the date of this annual report on Form 10-K, and the Company undertakes no obligation (nor does it intend) to publicly supplement, update or revise such statements on a going-forward basis, whether as a result of subsequent developments, changed expectations or otherwise, except as required by applicable law or regulation. In connection with the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, the Company is identifying certain factors that could cause actual results to differ, perhaps materially, from those indicated by these forward-looking statements.\nThose factors, risks and uncertainties include, but are not limited to:\n–\nthe impact of general economic conditions (including significant government debt and deficit levels, and inflation and related monetary policy actions by governments in response to inflation) on worldwide credit markets and on economic activity, including on the level of merger and acquisition activity, and their effects on the volume of debt and other securities issued in domestic and/or global capital markets;\n–\nthe uncertain effectiveness and possible collateral consequences of U.S. and foreign government initiatives and monetary policy to respond to the current economic climate, including instability of financial institutions, credit quality concerns, and other potential impacts of volatility in financial and credit markets; \n–\nthe global impacts of the Russia-Ukraine military conflict and the military conflict in the Middle East on volatility in world financial markets, on general economic conditions and GDP in the U.S. and worldwide, on global relations and on the Company's own operations and personnel;\n–\nother matters that could affect the volume of debt and other securities issued in domestic and/or global capital markets, including regulation, increased utilization of technologies that have the potential to intensify competition and accelerate disruption and disintermediation in the financial services industry, as well as the number of issuances of securities without ratings or securities which are rated or evaluated by non-traditional parties;\n–\nthe level of merger and acquisition activity in the U.S. and abroad;\n–\nthe uncertain effectiveness and possible collateral consequences of U.S. and foreign government actions affecting credit markets, international trade and economic policy, including those related to tariffs, tax agreements and trade barriers;\n–\nthe impact of MIS’s withdrawal of its credit ratings on countries or entities within countries and of Moody’s no longer conducting commercial operations in countries where political instability warrants such actions; \n–\nconcerns in the marketplace affecting our credibility or otherwise affecting market perceptions of the integrity or utility of independent credit agency ratings;\n–\nthe introduction or development of competing and/or emerging technologies and products;\n–\npricing pressure from competitors and/or customers;\n–\nthe level of success of new product development and global expansion;\n–\nthe impact of regulation as an NRSRO, the potential for new U.S., state and local legislation and regulations;\n–\nthe potential for increased competition and regulation in the jurisdictions in which we operate, including the EU;\n–\nexposure to litigation related to our rating opinions, as well as any other litigation, government and regulatory proceedings, investigations and inquiries to which Moody’s may be subject from time to time;\n–\nprovisions in U.S. legislation modifying the pleading standards and EU regulations modifying the liability standards applicable to CRAs in a manner adverse to CRAs;\n–\nprovisions of EU regulations imposing additional procedural and substantive requirements on the pricing of services and the expansion of supervisory remit to include non-EU ratings used for regulatory purposes;\n–\nuncertainty regarding the future relationship between the U.S. and China;\n–\nthe possible loss of key employees and the impact of the global labor environment;\n–\nfailures or malfunctions of our operations and infrastructure;\n–\nany vulnerabilities to cyber threats or other cybersecurity concerns;\n–\nthe timing and effectiveness of our restructuring programs;\n–\ncurrency and foreign exchange volatility;\n62\n     MOODY'S\n 2024 10-K\nTable of Contents\n–\nthe outcome of any review by tax authorities of Moody’s global tax planning initiatives;\n–\nexposure to potential criminal sanctions or civil remedies if Moody’s fails to comply with foreign and U.S. laws and regulations that are applicable in the jurisdictions in which Moody’s operates, including data protection and privacy laws, sanctions laws, anti-corruption laws, and local laws prohibiting corrupt payments to government officials;\n–\nthe impact of mergers, acquisitions, or other business combinations and the ability of Moody’s to successfully integrate acquired businesses;\n–\nthe level of future cash flows;\n–\nthe levels of capital investments; and\n–\na decline in the demand for credit risk management tools by financial institutions, corporate or government entities.\nThese factors, risks and uncertainties as well as other risks and uncertainties that could cause Moody’s actual results to differ materially from those contemplated, expressed, projected, anticipated or implied in the forward-looking statements are described in greater detail under “Risk Factors” in Part I, Item 1A of Moody’s annual report on Form 10-K for the year ended December 31, 2024, and in other filings made by the Company from time to time with the SEC or in materials incorporated herein or therein. Stockholders and investors are cautioned that the occurrence of any of these factors, risks and uncertainties may cause the Company’s actual results to differ materially from those contemplated, expressed, projected, anticipated or implied in the forward-looking statements, which could have a material and adverse effect on the Company’s business, results of operations and financial condition. New factors may emerge from time to time, and it is not possible for the Company to predict new factors, nor can the Company assess the potential effect of any new factors on it. Forward-looking and other statements in this document may also address our corporate responsibility progress, plans, and goals (including sustainability and environmental matters), and the inclusion of such statements is not an indication that these contents are necessarily material to investors or required to be disclosed in the Company’s filings with the Securities and Exchange Commission. In addition, historical, current, and forward-looking sustainability-related statements may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve, and assumptions that are subject to change in the future.",
  "item2": null
}