{
  "source_file": "mdlz-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOverview of Business and Strategy\nOur core business is making and selling chocolate, biscuits and baked snacks, with additional businesses in adjacent, locally relevant categories including gum & candy, cheese & grocery and powdered beverages around the world.\nWe aim to be the global leader in snacking. Our strategy is to drive long-term growth by focusing on four strategic priorities: accelerating consumer-centric growth, driving operational excellence, creating a winning growth culture and scaling sustainable snacking. We believe the successful implementation of our strategic priorities and leveraging of our attractive global footprint, strong core of iconic global and local brands, marketing, sales, distribution and cost excellence capabilities, and top talent with a growth mindset, will drive consistent top- and bottom-line growth, enabling us to continue to create long-term value for our shareholders. \nRecent Developments and Significant Items\nMacroeconomic environment\nWe continue to observe significant market and geopolitical uncertainty, fluctuating consumer demand, inflationary pressures, supply constraints, trade and regulatory uncertainty and exchange rate volatility. As a result, we experienced significantly higher operating costs, including higher overall raw material, labor and energy costs that have continued to rise. In particular, while we expect cocoa costs to be lower in 2026 compared to the current year, we expect to continue to face elevated cocoa costs as compared to historical levels in the near- and medium-term. Refer to \nCommodity Trends\n for additional information.\nOur overall outlook for future snacks revenue growth remains strong; however, we anticipate ongoing volatility. While we have responded to elevated raw material costs with pricing increases for certain of our products, the elasticity impacts from those pricing increases has adversely impacted consumer demand, particularly in the United States and Europe. We will continue to proactively manage our business in response to the evolving global economic environment, related uncertainty and business risks while also prioritizing and supporting our employees and customers. We continue to take steps to mitigate impacts to our supply chain, operations, technology and assets.\nTrade and Regulatory Uncertainty\nIn many markets, including the United States, certain products or a portion of our products, including significant inputs, are imported from other jurisdictions. As the current geopolitical environment remains unpredictable, we continue to monitor and evaluate the impact of proposed and enacted tariffs, including proposed and enacted retaliatory tariffs or other trade restrictions. We are evaluating the potential impact of these developments as well as our ability to mitigate the impact, as they are expected to adversely impact our revenue and cost of goods sold. If the provisions of certain proposed tariffs for which implementation is currently delayed are ultimately implemented as originally proposed, or if additional tariff actions are implemented, we would expect those adverse impacts on our business operations and financial performance to be significant. For most products and materials imported to the United States from Mexico and Canada, we comply with the terms of the U.S.-Mexico-Canada Agreement and are therefore not subject to tariffs on most products and materials imported from those jurisdictions. However, the current trade environment continues to evolve rapidly and there can be no assurance that such products and materials will continue to be exempt. The implementation of additional protectionist trade measures, and any further retaliatory actions taken in response, could result in increased costs and pricing pressures, disrupt consumer spending patterns, and impact market stability and consumer confidence, any or all of which could adversely affect our operating results. For additional information, see the risk factors in our Annual Report on Form 10-K for the year ended December 31, 2024, including the risk entitled “\nWe are subject to risks from changes to the trade policies and tariff and import/export regulations by the U.S. and/or other foreign governments.\n”\nWar in Ukraine\nIn February 2022, following the Russian military invasion of Ukraine, we stopped production and closed our facilities in Ukraine; since then, we have taken steps to protect the safety of our employees and to restore operations at our \n27\nTable of Contents\ntwo manufacturing facilities, which were significantly damaged in March 2022. Refer to \nItems Affecting Comparability of Financial Results\n for additional information.\nWe have suspended new capital investments and our advertising spending in Russia, but as a food company with more than 2,500 employees in the country, we have not ceased operations because we believe that we play a role in the continuity of the food supply. We continue to evaluate the situation in Ukraine and Russia and our ability to control our operating activities and businesses on an ongoing basis and comply with applicable international sanctions. We continue to consolidate both our Ukrainian and Russian subsidiaries. During the third quarter of 2025, Ukraine generated 0.4% and Russia generated 3.7% of our consolidated net revenue and during the third quarter of 2024, Ukraine generated 0.4% and Russia generated 2.9% of our consolidated net revenue. The profitability of and the assets held by our Russian business continue to remain above historic levels. We cannot predict if the recent strength in our Russian business will continue in the future. \nOur operations in Russia are subject to risks, including the temporary or permanent loss of assets due to expropriation or further curtailment of our ability to conduct business operations in Russia. In the event this were to occur, this could lead to the partial or full impairment of our Russian assets or deconsolidation of our Russian operations in future periods, or the termination of and loss of revenue from our business operations, based on actions taken by Russia, other parties or us. For additional information, see the risk factors in our Annual Report on Form 10-K for the year ended December 31, 2024, including the risk entitled “\nThe war in Ukraine has impacted and could continue to impact our business operations, financial performance and results of operations.\n”\nDevelopments in the Middle East\nIn October 2023, conflict developed in the Middle East between Hamas and Israel, and has expanded to other parts of the region. Throughout 2024 and thus far in 2025, we experienced limited adverse sales impacts related to this conflict in certain AMEA markets, but this did not have a material impact on our business, results of operations or financial condition. We continue to evaluate the impacts of these developments, including ongoing geopolitical discussions, on our business and we cannot predict if the conflict will have a significant impact in the future.\nExtreme Price Growth in Argentina and Other Currency-Related Items\nDuring December 2023, the Argentinean peso significantly devalued. The peso's devaluation and potential resulting distortion on our non-GAAP Organic Net Revenue, Organic Net Revenue growth and other constant currency growth rate measures resulted in our decision to exclude the impact of pricing increases in excess of 26% year-over-year (\"extreme pricing\") in Argentina, from these measures beginning in the first quarter of 2024. The benchmark of 26% represents the minimum annual inflation rate for each year over a 3-year period which would result in a cumulative inflation rate in excess of 100%, the level at which an economy is considered hyperinflationary under U.S. GAAP. Throughout the following MD&A discussion, we exclude the impact of extreme pricing in Argentina from the net pricing impact of Organic Net Revenue and Organic Net Revenue growth and its related impact on our other non-GAAP financial constant currency growth measures. Additionally within this MD&A discussion, \"currency-related items\" reflect the impacts of extreme pricing and year-over-year currency translation rate changes. Refer to \nNon-GAAP financial measures \nfor additional information. \nCurrency-related items impacted our non-GAAP financial measures for the three months ended September 30, 2025 as follows:\n•\nOrganic Net Revenue: In the third quarter of 2025, favorable currency-related items of $137 million (1.5 pp) were driven by favorable currency translation rate changes of $134 million (1.5 pp) and extreme pricing of $3 million (— pp). In Emerging Markets, favorable currency-related items of $14 million (0.4 pp) were driven by favorable currency translation rate changes of $11 million (0.3 pp) and extreme pricing of $3 million (0.1 pp). In Developed Markets, favorable currency-related items of $123 million (2.1 pp) were driven by favorable currency translation rate changes.\n•\nAdjusted Operating Income: In the third quarter of 2025, favorable currency-related items of $15 million were driven by favorable currency translation rate changes of $15 million, as extreme pricing had an immaterial impact.\n•\nAdjusted EPS: In the third quarter of 2025, favorable currency-related items of $0.01 were driven by favorable currency translation rate changes, as extreme pricing had an immaterial impact.\n28\nTable of Contents\nCurrency-related items impacted our non-GAAP financial measures for the nine months ended September 30, 2025 as follows:\n•\nOrganic Net Revenue: In the first nine months of 2025, unfavorable currency-related items of $137 million (0.5 pp) were driven by unfavorable currency translation rate changes of $186 million (0.7 pp), partially offset by extreme pricing of $49 million (0.2 pp). In Emerging Markets, unfavorable currency-related items of $296 million (2.8 pp) were driven by unfavorable currency translation rate changes of $345 million (3.2 pp), partially offset by extreme pricing of 49 million (0.4 pp). In Developed Markets, favorable currency-related items of 159 million (1.0 pp) were driven by favorable currency translation rate changes.\n•\nAdjusted Operating Income: In the first nine months of 2025, favorable currency-related items of $18 million were driven by favorable currency translation rate changes of $10 million and the impact of extreme pricing of $8 million.\n•\nAdjusted EPS: In the first nine months of 2025, favorable currency-related items of $0.02 were driven by favorable currency translation rate changes of $0.01 and  extreme pricing of $0.01.\nERP System Implementation\nIn July 2024, our Board of Directors approved funding of $1.2 billion for a multi-year systems transformation program to upgrade our global ERP and supply chain systems (the “ERP System Implementation”). ERP System Implementation spending comprises both capital expenditures and operating expenses, of which a majority is expected to relate to operating expenses. The operating expenses associated with the ERP System Implementation represent incremental transformational costs above the normal ongoing level of spending on information technology to support operations. The ERP System Implementation program will be implemented by region in several phases with spending occurring over the next four years, with expected completion by year-end 2028. Refer to \nNon-GAAP financial measures\n for additional information. \nAcquisitions and Divestitures\nDuring the fourth quarter of 2024\n, we completed the acquisition of Evirth (Shanghai) \nIndustrial Co., Ltd, a leading manufacturer of cakes and pastries in China. \nRefer to Note 2, \nAcquisitions and Divestitures\n, for additional details.\nEquity Method Investment Transactions\nJDE Peet’s Transactions (Euronext Amsterdam: “JDEP”)\nDuring the first quarter of 2024, we recorded an impairment charge of €612 million ($665 million) related to our JDEP investment. During the fourth quarter of 2024, we sold our remaining 85.9 million shares to JAB Holding Company.\nOn August 24, 2025, Keurig Dr Pepper Inc. (“KDP”) and JDEP entered into a definitive agreement under which KDP will acquire JDEP. As a result of that definitive agreement, we became entitled to a cash payment of €145 million ($169 million) from JAB that we received in the third quarter of 2025. \n For additional information, refer to Note 6, \nEquity Method Investments.\nMondelēz Global and Canada Retirement Plan Settlements\nMondelēz Global LLC Retirement Plan Settlement\nDuring the third quarter of 2024, we entered into agreements with two third-party insurance companies to purchase buy-in annuity contracts to cover the liabilities associated with the Mondelēz Global LLC Retirement Plan (“MDLZ Global Plan”), the pension plan for U.S. salaried employees. The agreements provided us with the option to elect a buy-out conversion, at which time full responsibility of the MDLZ Global Plan obligations would transfer to the insurance companies. On June 12, 2025 we elected the buy-out conversion and recognized a non-cash pretax settlement loss of $282 million as a component of net periodic pension cost in the second quarter of 2025. \n29\nTable of Contents\nMondelez Canada Inc. - Trusteed Hourly Retirement Plan and Retirement Plan Settlement\nDuring the third quarter of 2025, we entered into an agreement with a third-party insurance company to buy-out the retiree participants' obligations of the Mondelez Canada Inc. Trusteed Hourly Retirement Plan and Mondelez Canada Inc. Retirement Plan (collectively, \"Canadian Pension Plans\"). On September 11, 2025 the obligations were transferred to the insurance company and we recognized a non-cash pre-tax settlement loss of $54 million as a component of our net periodic pension cost in the third quarter of 2025.\nFor additional information, refer to Note 9, \nBenefit Plans.\nTaxes\nWe continue to monitor existing and potential future tax reform around the world. Numerous countries have enacted the Organization of Economic Cooperation and Development’s model rules on a global minimum tax, effective for 2024. The existing legislation does not have a material impact on our condensed consolidated financial statements. However, we continue to monitor all developments including how the June 28, 2025 G7 announcement that U.S.-parented companies be exempted from certain aspects of the global minimum tax regime will be incorporated into the model rules and local legislation around the world.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was signed into U.S. law. The initial impact of the OBBBA legislation was not material to our third quarter earnings. Further, while we continue to monitor supplemental guidance released by the government, we do not expect any material impacts to our financial statements for the full year ending December 31, 2025.\nNon-GAAP Financial Measures\nWe use non-GAAP financial measures internally to make operating and strategic decisions, including the preparation of our annual operating plan, evaluation of business performance and as a factor in determining incentive compensation. We believe that non-GAAP financial measures, when used in connection with results reported in accordance with U.S. GAAP, provide additional information to facilitate comparisons of our historical operating results and to enable a more comprehensive understanding of trends in our underlying operating results. We also believe that presenting these measures allows investors to view our performance using the same measures that management and our Board of Directors use in evaluating our business performance and trends. However, non-GAAP financial measures should be considered in addition to, and not as substitutes for, financial information prepared in accordance with U.S. GAAP. In addition, our non-GAAP financial measures may not be the same as or comparable to similar non-GAAP measures presented by other companies. A limitation of these non-GAAP financial measures is they exclude items that have an impact on our U.S. GAAP reported results. The best way this limitation can be addressed is by evaluating our non-GAAP financial measures in combination with our U.S. GAAP reported results.\n \nWe have provided the reconciliations between the GAAP and non-GAAP financial measures along with a discussion of our underlying GAAP results throughout our \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n in this Form 10-Q.\nWe also evaluate the operating performance of the company and its international subsidiaries on a constant currency basis. Our non-GAAP measures presented on a constant currency basis exclude the effects of currency translation rate changes and, beginning in the first quarter of 2024, extreme pricing increases in Argentina. For additional information, refer to \nExtreme Price Growth in Argentin\na. We determine constant currency operating results by dividing or multiplying, as appropriate, the current-period local currency operating results by the currency exchange rates used to translate the financial statements in the comparable prior-year period to determine what the current-period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period. \n30\nTable of Contents\nOur primary non-GAAP financial measures and corresponding metrics, listed below, reflect how we evaluate our current and prior-year operating results. As new events or circumstances arise, these definitions could change. When our definitions change, we provide the updated definitions and present the related non-GAAP historical results on a comparable basis. When items no longer impact our current or future presentation of non-GAAP operating results, we remove these items from our non-GAAP definitions. For descriptions of the items excluded from our non-GAAP financial measures, refer to\n Items Affecting Comparability of Financial Results\n.\n•\n“Organic Net Revenue” is defined as net revenues (the most comparable U.S. GAAP financial measure) excluding, when they occur, the impacts of acquisitions, divestitures, short-term distributor agreements related to the sale of a business\n \nand currency-related items. We believe that Organic Net Revenue reflects the underlying growth from the ongoing activities of our business and provides improved comparability of results. Organic Net Revenue growth is presented on a consolidated basis, for each of our segments and for our emerging markets and developed markets, and these underlying measures are also reconciled to the most comparable U.S. GAAP financial measures above. \n•\nOur emerging markets include our Latin America region in its entirety; the AMEA region, excluding Australia, New Zealand and Japan; and the following countries from the Europe region: Russia, Ukraine, Türkiye, Kazakhstan, Georgia, Poland, Czech Republic, Slovak Republic, Hungary, Bulgaria, Romania, the Baltics and the East Adriatic countries. \n•\nOur developed markets include the entire North America region, the Europe region excluding the countries included in the emerging markets definition, and Australia, New Zealand and Japan from the AMEA region.\n•\n“Adjusted Operating Income” is defined as operating income (the most comparable U.S. GAAP financial measure) excluding, when they occur, the impacts of the Simplify to Grow Program; gains or losses (including non-cash impairment charges) on goodwill and intangible assets; divestiture-related items; acquisition-related items; operating results from short-term distributor agreements related to the sale of a business; remeasurement of net monetary position of highly inflationary countries; mark-to-market impacts from commodity and foreign currency derivative contracts economically hedging forecasted transactions; impacts from resolution of indirect tax matters; incremental costs due to the war in Ukraine;\n \nimpact from the European Commission legal matter; the impact from pension participation changes; and operating costs from the ERP System Implementation program. We also present Adjusted Operating Income margin, which is subject to the same adjustments as Adjusted Operating Income. We also evaluate growth in our Adjusted Operating Income on a constant currency basis. We believe these measures provide improved comparability of underlying operating results.\n•\n“Adjusted EPS” is defined as diluted EPS attributable to Mondelēz International (the most comparable U.S. GAAP financial measure) from continuing operations excluding, when they occur, the impacts of the items listed in the Adjusted Operating Income definition as well as gains or losses on debt extinguishment and related expenses; gains or losses on marketable securities transactions; initial impacts from enacted tax law changes; and gains or losses on equity method investment transactions. We also evaluate growth in our Adjusted EPS on a constant currency basis. We believe Adjusted EPS provides improved comparability of underlying operating results.\n31\nTable of Contents\nItems Affecting Comparability of Financial Results\nThe below table and subsequent commentary present income or (expense) items that affected the comparability of our results of operations and provides details of each item. Please refer to the notes to the condensed consolidated financial statements indicated below for additional information. These items are excluded from our non-GAAP earnings measures to better facilitate comparisons of our underlying operating performance across periods. Refer to the \nConsolidated Results of Operations – Net Earnings and Earnings per Share Attributable to Mondelēz International\n table for the after-tax per share impacts of these items and to the \nNon-GAAP Financial Measures\n section for definitions of our non-GAAP financial measures.\n \n \nFor the Three Months Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n \nSee Note\n2025\n2024\n2025\n2024\n \n \n(in millions, except percentages)\nSimplify to Grow Program\nNote 13\n$\n6 \n$\n(12)\n$\n12 \n$\n(80)\nIntangible asset impairment charges\nNote 5\n(33)\n(153)\n(33)\n(153)\nMark-to-market losses from derivatives \n(1)\nNote 8\n(345)\n(707)\n(1,111)\n(156)\nAcquisition-related items\nNote 2\n(18)\n326 \n11 \n247 \nDivestiture-related items\nNote 2\n— \n2 \n7 \n(2)\nOperating results from short-term distributor agreements\n— \n— \n— \n2 \nIncremental costs due to war in Ukraine\n— \n— \n(1)\n(2)\nEuropean Commission legal matter\nNote 10\n— \n— \n— \n3 \nERP System Implementation costs \n(41)\n(29)\n(111)\n(38)\nRemeasurement of net monetary position\nNote 1\n(9)\n(9)\n(24)\n(26)\nImpact from pension participation changes\nNote 9\n(56)\n(2)\n(343)\n(7)\nImpact from resolution of tax matters\n (1)\n32 \n— \n32 \n— \nInitial impacts from enacted tax law changes\nNote 14\n1 \n11 \n4 \n(12)\nGain/(loss) on equity method investment transactions \nNote 6\n169 \n(4)\n169 \n(669)\n \n(1)\nIncludes impacts recorded in operating income and interest expense and other, net in the condensed consolidated statements of earnings. \nSimplify to Grow Program\n –\n \nReflects restructuring charges incurred under the company’s Simplify to Grow Program to reduce both its supply chain and overhead costs. It comprises charges, such as severance, asset write-downs, and other costs of implementing that program, partially offset by gains on sales of assets disposed of in connection with the program. The company completed its Simplify to Grow Program in the fourth quarter of 2024. Following the completion of the program, any adjustments to the liability of previously recorded charges will be reflected within this item.\nIntangible asset impairment charges \n–\n \nReflects non-cash impairments of certain of our brands in connection with our indefinite-life intangible asset impairment testing. \nMark-to-market impacts from derivatives\n – We exclude unrealized gains and losses (mark-to-market impacts) from commodity and foreign currency derivative contracts economically hedging forecasted transactions from our non-GAAP earnings measures. The mark-to-market impacts of those derivatives are excluded until the related gains or losses are realized. Since we purchase commodity and foreign currency derivative contracts to mitigate price volatility primarily for inventory requirements in future periods, we make this adjustment to remove the volatility of these future inventory purchases on current operating results to facilitate comparisons of our underlying operating performance across periods.\nAcquisition-related items – \nIncludes acquisition-related costs, acquisition integration costs, contingent consideration adjustments, inventory step-ups and gains from acquisitions. Acquisition-related costs include third-party advisor, investment banking and legal fees. Acquisition integration costs include costs related to the integration of operations from acquisitions. Contingent consideration adjustments include any changes made to contingent compensation liabilities for earn-outs related to acquisitions that do not relate to recurring employee compensation expense. See Note 8, \nFinancial Instruments - Fair Value of Contingent Consideration\n for additional information. Other acquisition-related items include incremental costs from inventory step-ups associated with acquired companies related to the fair market valuation of the acquired inventory and acquisition gains from the remeasurement of an existing noncontrolling investment to fair value when the company acquires a controlling interest in the investee. \n32\nTable of Contents\nDivestiture-related items\n – Includes operating results from divestitures, divestiture-related costs and gains/(losses) on divestitures. Divestitures may include sales of businesses, exits of major product lines upon completion of a sale or licensing agreement, or sales of equity method investments. Divestiture-related costs include costs incurred in relation to the preparation and completion of divestiture transactions (including one-time costs such as severance related to the elimination of stranded costs) as well as costs incurred associated with publicly announced processes to sell businesses. For 2024, operating results from divestitures (which are not reflected in the table above) include the operating results from the company’s JDE Peet’s equity method investment earnings which was sold in the fourth quarter of 2024.\nOperating results from short-term distributor agreements\n – Reflects the operating results from short-term distributor agreements that have been executed in conjunction with the sale of a business. Our agreement with the buyer of the developed market gum business to distribute gum products in certain European markets ended in the first quarter of 2024.\nIncremental costs due to war in Ukraine\n –\n \nIn February 2022, Russia began a military invasion of Ukraine and we temporarily stopped our production and closed our manufacturing facilities in Trostyanets and Vyshhorod due to damage incurred during the conflict. In the second quarter of 2024, we fully resumed production at both facilities after completing targeted repairs. Incremental costs incurred by the company related to the ongoing war in Ukraine primarily relate to asset write-downs, net of recoveries. \nEuropean commission legal matter –\n In November 2019, the European Commission informed us that it initiated an investigation into our alleged infringement of European Union competition law through certain practices allegedly restricting cross-border trade within the European Economic Area. We reached a negotiated resolution to this matter in the second quarter of 2024. We adjusted our accrual accordingly and fulfilled our payment obligation in August 2024. Due to the unique nature of this matter, we believe it to be infrequent and unusual and therefore exclude it from our non-GAAP earnings measures to better facilitate comparisons of our underlying operating performance across periods.\nERP system implementation costs \n–\n \nIn July 2024, our Board of Directors approved funding of $1.2 billion for a multi-year systems transformation program to upgrade our global ERP and supply chain systems, which is comprised of both capital expenditures and operating expenses, of which a majority is expected to be operating expenses. The ERP System Implementation program will be implemented in several phases with spending occurring over the next four years, with expected completion by year-end 2028. The operating expenses associated with the ERP System Implementation represent incremental transformational costs above the normal ongoing level of spending on information technology to support operations. These expenses include third-party consulting fees, direct labor costs associated with the program, accelerated depreciation of our existing SAP financial systems and various other expenses, all associated with the implementation of our information technology upgrades.\nRemeasurement of net monetary position of highly inflationary countries\n – The company’s operations in Argentina, Türkiye, Egypt and Nigeria are currently accounted for as highly inflationary. We exclude remeasurement gains and losses of the monetary assets and liabilities of its subsidiaries in highly inflationary economies and the realized gains and losses from derivatives that mitigate the foreign currency volatility related to the remeasurement of the respective monetary assets or liabilities from its non-GAAP earnings measures to facilitate comparisons of our underlying operating performance across periods.\nImpact from pension participation changes \n–\n \nConsists of the charges incurred, primarily gains or losses from pension curtailments and settlements, including settlement losses from our buy-out of a pension plan for U.S. salaried employees during the second quarter of 2025 and our buy-out of the retiree participants' obligations for two Canadian pension plans during the third quarter of 2025, as well as costs incurred when employee groups are withdrawn from multiemployer pension plans. We exclude these charges from our non-GAAP results because those amounts do not reflect our ongoing pension obligations.\nImpact from resolution of tax matters\n – Consists of the reversals and settlements of unusual and significant indirect tax matters. Due to the unique nature of these resolutions, we believe it to be infrequent and therefore exclude it from our non-GAAP earnings measures to better facilitate comparisons of our underlying operating performance across periods.\nInitial impacts from enacted tax law changes \n– Initial impacts from enacted tax law changes include items such as the remeasurement of deferred tax balances and transition taxes from tax reforms. We exclude initial impacts from enacted tax law changes from our non-GAAP financial measures as they do not reflect our ongoing tax obligations under the enacted tax law. \nGains and losses on equity method investment transactions \n–\n \nWe exclude gains and losses from partial or full sales of equity method investments, as well as impairments or other non-routine transactions related to those investments. In addition, we also exclude from our non-GAAP financial measures any gains or losses realized on economic hedges of sales proceeds from our equity method investment transactions.\n33\nTable of Contents\nDiscussion and Analysis of Historical Results\nSummary of Results\n•\nNet revenues increased 5.9% to $9.7 billion in the third quarter of 2025 and increased 4.5% to $28.0 billion in the first nine months of 2025 as compared to the same periods in the prior year.\n–\nNet revenue growth in the third quarter of 2025 was driven by higher net pricing, favorable currency-related items, as several currencies we operate in strengthened relative to the U.S. dollar compared to exchange rates in the prior year, and incremental net revenue from our acquisition of Evirth, partially offset by unfavorable volume/mix.\n–\nNet revenue growth in the first nine months of 2025 was driven by higher net pricing and incremental net revenue from our acquisition of Evirth, partially offset by unfavorable volume/mix, unfavorable currency-related items, as the U.S. dollar strengthened relative to several currencies we operate in compared to exchange rates in the prior year, and lapping prior-year net revenue from a short-term distributor agreement related to the sale of our developed market gum business.\n•\nOrganic Net Revenue, a non-GAAP financial measure, increased 3.4% to $9.5 billion in the third quarter of 2025 and increased 4.0% to $27.9 billion in the first nine months of 2025 as compared to the same periods in the prior year. During both the third quarter and the first nine months of 2025, Organic Net Revenue grew due to higher net pricing, partially offset by unfavorable volume/mix. Organic Net Revenue is reported on a constant currency basis and excludes revenue from acquisitions and divestitures. Refer to \nNon-GAAP Financial Measures \nfor the definition of Organic Net Revenue and \nConsolidated Results of Operations \nfor our reconciliation with net revenues.\n•\nDiluted EPS attributable to Mondelēz International decreased (9.5)% to $0.57 in the third quarter of 2025 and decreased 35.4% to $1.37 in the first nine months of 2025 as compared to the same periods in the prior year. \n–\nDiluted EPS decreased in the third quarter of 2025, primarily driven by a decrease in Adjusted EPS, an unfavorable year-over-year change in acquisition-related items, settlement losses related to the buy-out of retiree participants' obligations for two Canadian pension plans, lapping prior-year divestiture-related items and lapping prior-year favorable initial impacts from enacted tax law changes. These unfavorable items were partially offset by a favorable year-over-year change in mark-to-market impacts from commodity and foreign currency derivatives, a gain on an equity method investment transaction, lower intangible asset impairment charges, a favorable impact from the resolution of an indirect tax matter and lapping prior-year costs for the completed Simplify to Grow Program.\n–\nDiluted EPS decreased in the first nine months of 2025, driven by an unfavorable year-over-year change in mark-to-market impacts from commodity and foreign currency derivatives, a decrease in Adjusted EPS, settlement losses related to the buy-out of retiree participants' obligations for two Canadian pension plans, an unfavorable year-over-year change in acquisition-related items, lapping prior-year divestiture-related items and higher costs incurred for the ERP System Implementation program. These unfavorable items were partially offset by lapping a prior-year equity method investment impairment, a current year gain on an equity method investment transaction, lower intangible asset impairment charges, lapping prior-year costs for the completed Simplify to Grow Program, a favorable impact from the resolution of an indirect tax matter and lapping prior-year unfavorable initial impacts from enacted tax law changes.\n•\nAdjusted EPS, a non-GAAP financial measure, decreased 23.2% to $0.73 in the third quarter of 2025 and decreased 18.8% to $2.20 in the first nine months of 2025 as compared to the same periods in the prior year. On a constant currency basis, Adjusted EPS decreased 24.2% to $0.72 in the third quarter of 2025 and decreased 19.6% to $2.18 in the first nine months of 2025 as compared to the same periods in the prior year. Refer to \nNon-GAAP Financial Measures \nfor the definition of Adjusted EPS and \nConsolidated Results of Operations \nfor our reconciliation with diluted EPS.\n–\nAdjusted EPS decreased in the third quarter of 2025, driven by operating declines, partially offset by lower income taxes, fewer shares outstanding, higher equity method investment earnings, the impact from an acquisition and favorable currency-related items.\n–\nAdjusted EPS decreased in the first nine months of 2025, driven by operating declines, higher interest and other expense and lower benefit plan non-service income, partially offset by fewer shares outstanding, lower income taxes, the impact from an acquisition and favorable currency-related items.\n34\nTable of Contents\nConsolidated Results of Operations\nThree Months Ended September 30\nFor the Three Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n \n(in millions, except per share data)\n \nNet revenues\n$\n9,744 \n$\n9,204 \n$\n540 \n5.9 \n%\nOperating income\n744 \n1,153 \n(409)\n(35.5)\n%\nNet earnings attributable to\n   Mondelēz International\n743 \n853 \n(110)\n(12.9)\n%\nDiluted earnings per share attributable to\n   Mondelēz International\n0.57 \n0.63 \n(0.06)\n(9.5)\n%\nNet Revenues\n – Net revenues increased $540 million (5.9%) to $9,744 million in the third quarter of 2025, and Organic Net Revenue \n(1)\n increased $316 million (3.4%) to $9,520 million. Emerging markets net revenues increased 9.9% and emerging markets Organic Net Revenue increased 7.1% \n(1)\n. Developed markets net revenues increased 3.3% and developed markets Organic Net Revenue increased 1.2% \n(1)\n. The underlying changes in net revenues and Organic Net Revenue are detailed below:\nEmerging\nMarkets\nDeveloped\nMarkets\nMondelēz\nInternational\nThree Months Ended September 30, 2025\nReported (GAAP)\n$\n3,881\n \n$\n5,863\n \n$\n9,744\n \nAcquisitions\n(87)\n— \n(87)\nCurrency-related items\n(14)\n(123)\n(137)\nOrganic (Non-GAAP)\n$\n3,780\n \n$\n5,740\n \n$\n9,520\n \nThree Months Ended September 30, 2024\nReported (GAAP)\n$\n3,530\n \n$\n5,674\n \n$\n9,204\n \nNo adjusting items\n— \n— \n— \nOrganic (Non-GAAP)\n$\n3,530\n \n$\n5,674\n \n$\n9,204\n \n% Change\nReported (GAAP)\n9.9\n \n %\n3.3\n \n %\n5.9\n \n %\nAcquisitions\n(2.4)\n— \n(1.0)\nCurrency-related items\n(0.4)\n(2.1)\n(1.5)\nOrganic (Non-GAAP)\n7.1\n \n%\n1.2\n \n%\n3.4\n \n%\nVol/Mix\n(4.7)pp\n(4.5)pp\n(4.6)pp\nPricing\n11.8 \n5.7 \n8.0 \n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information.\nNet revenue increase of 5.9% was driven by our underlying Organic Net Revenue growth of 3.4%, favorable currency-related items and the impact of an acquisition. Organic Net Revenue growth was driven by higher net pricing, partially offset by unfavorable volume/mix. Higher net pricing was due to the benefit of carryover pricing from 2024 as well as the effects of input cost-driven pricing actions taken during the first nine months of 2025. Higher net pricing was reflected in all regions. Unfavorable volume/mix was experienced across all regions, driven by pricing elasticity impacts in Europe, Latin America and AMEA, as well as soft consumption in North America. Currency-related items increased net revenues by $137 million, driven by favorable currency translation rate changes and the impact of extreme pricing in Argentina. Refer to \nRecent Developments and Significant Items Affecting Comparability \nfor additional information. Favorable currency translation rate changes were due to the strength of several currencies relative to the U.S. dollar, primarily the euro, Russian ruble, British pound sterling, Polish zloty, Brazilian real, Mexican peso and Swedish krona, partially offset by the strength of the U.S. dollar relative to several currencies, primarily the Argentinean peso, Indian rupee and Turkish lira. The November 1, 2024 acquisition of Evirth added incremental net revenues of $87 million (constant currency basis) in the third quarter of 2025. Refer to Note 2, \nAcquisitions and Divestitures, \nfor additional information.\n35\nTable of Contents\nOperating Income\n – Operating income decreased $409 million (35.5%) to $744 million in the third quarter of 2025. Adjusted Operating Income \n(1)\n decreased $567 million (32.6%) to $1,171 million and Adjusted Operating Income on a constant currency basis \n(1)\n decreased $582 million (33.5%) to $1,156 million due to the following:\n \nFor the Three Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\n \nOperating Income\n$\n744\n \n$\n1,153\n \n$\n(409)\n(35.5)\n%\nSimplify to Grow Program \n(6)\n12 \n(18)\nIntangible asset impairment charges \n33 \n153 \n(120)\nMark-to-market losses from derivatives \n348 \n710 \n(362)\nAcquisition-related items\n18 \n(326)\n344 \nDivestiture-related items\n— \n(2)\n2 \nERP System Implementation costs\n41 \n29 \n12 \nRemeasurement of net monetary position \n9 \n9 \n— \nImpact from resolution of tax matters\n(16)\n— \n(16)\nAdjusted Operating Income \n(1)\n$\n1,171\n \n$\n1,738\n \n$\n(567)\n(32.6)\n%\nCurrency-related items\n(15)\n— \n(15)\nAdjusted Operating Income (constant currency) \n(1)\n$\n1,156\n \n$\n1,738\n \n$\n(582)\n(33.5)\n%\nKey Drivers of Adjusted Operating Income (constant currency)\n$ Change\n   Higher net pricing\n$\n739 \nHigher input costs\n(1,255)\nUnfavorable volume/mix\n(294)\nLower selling, general and administrative expenses\n195 \nImpact from acquisitions\n \n10 \nLower amortization of intangible assets\n11 \n   Lower fixed asset impairment charges\n12 \nTotal change in Adjusted Operating Income (constant currency) \n(1)\n$\n(582)\n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information.\n36\nTable of Contents\nDuring the third quarter of 2025, we realized higher net pricing, which was more than offset by increased input costs and unfavorable volume/mix. Higher net pricing, which included the carryover impact of pricing actions taken in 2024 as well as the effects of input cost-driven pricing actions taken during the first nine months of 2025, was reflected across all regions. The increase in input costs was driven by higher raw material costs, partially offset by lower manufacturing costs driven by productivity. Higher raw material costs were primarily due to higher cocoa, dairy, edible oils, packaging, nuts, grains and other ingredient costs, as well as unfavorable year-over-year currency exchange transaction costs on imported materials, partially offset by lower sugar and energy costs. Overall, unfavorable volume/mix was experienced across all regions, reflecting pricing elasticity impacts as well as biscuit & baked snacks category softness in North America.\nTotal selling, general and administrative expenses increased $165 million from the third quarter of 2024, which was driven by a number of factors noted in the table above, including in part, an unfavorable year-over-year change in acquisition-related items, higher costs incurred for the ERP System Implementation program and the impact from an acquisition, partially offset by a favorable impact from the resolution of an indirect tax matter, a favorable currency-related impact to expenses and lapping prior-year implementation costs for the completed Simplify to Grow Program. Excluding these factors, selling, general and administrative expenses decreased $195 million from the third quarter of 2024. The decrease was driven primarily by lower advertising and consumer promotion costs and lower overhead costs.\nCurrency-related items increased operating income by $15 million due to favorable currency translation rate changes as the impact of extreme pricing in Argentina was immaterial. Favorable currency translation rate changes were primarily due to the strength of several currencies relative to the U.S. dollar, including the euro, Russian ruble, British pound sterling, Mexican peso and Brazilian real, partially offset by the strength of U.S. dollar relative to several currencies, including the Argentinean peso, Swiss franc and Turkish lira.\nOperating income margin decreased from 12.5% in the third quarter of 2024 to 7.6% in the third quarter of 2025. The decrease in operating income margin was driven primarily by lower Adjusted Operating Income margin and an unfavorable year-over-year change in acquisition-related items, partially offset by a favorable year-over-year change in mark-to-market impacts from commodity and foreign currency derivatives and lower intangible asset impairment charges. Adjusted Operating Income margin decreased from 18.9% for the third quarter of 2024 to 12.0% for the third quarter of 2025. The decrease was driven primarily by higher raw material costs and unfavorable product mix, partially offset by higher net pricing, lower advertising and consumer promotion costs, lower manufacturing costs driven by productivity and lower overhead costs.\n37\nTable of Contents\nIncome Taxes\n – Our effective tax rate was 19.7% for the third quarter of 2025 as compared to 28.8% in the third quarter of 2024. The decrease in our effective tax rate was primarily driven by a favorable jurisdictional mix of earnings, tax benefits related to the provision for final 2024 tax return filings, and the tax treatment of certain foreign pension assets. \nNet Earnings and Earnings per Share Attributable to Mondelēz International\n – Net earnings attributable to Mondelēz International of $743 million decreased by $110 million (12.9%) in the third quarter of 2025. Diluted EPS attributable to Mondelēz International was $0.57 in the third quarter of 2025, down $0.06 (9.5%) from the third quarter of 2024. Adjusted EPS \n(1)\n was $0.73 in the third quarter of 2025, down $0.22 (23.2%) from the third quarter of 2024. Adjusted EPS on a constant currency basis \n(1)\n was $0.72 in the third quarter of 2025, down $0.23 (24.2%) from the third quarter of 2024.\n \nFor the Three Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\nDiluted EPS attributable to Mondelēz International\n$\n0.57\n \n$\n0.63\n \n$\n(0.06)\n(9.5)\n%\nSimplify to Grow Program \n— \n0.01 \n(0.01)\nIntangible asset impairment charges \n0.02 \n0.08 \n(0.06)\nMark-to-market losses from derivatives \n0.21 \n0.42 \n(0.21)\nAcquisition-related items \n0.02 \n(0.18)\n0.20 \nDivestiture-related items \n— \n(0.03)\n0.03\nERP System Implementation costs \n0.02 \n0.02 \n— \nRemeasurement of net monetary position \n0.01 \n0.01 \n— \nImpact from pension participation changes \n0.03 \n— \n0.03 \nImpact from resolution of tax matters \n(0.02)\n— \n(0.02)\nInitial impacts from enacted tax law changes \n— \n(0.01)\n0.01 \nGain on equity method investment transactions \n(0.13)\n— \n(0.13)\nAdjusted EPS \n(1)\n$\n0.73\n \n$\n0.95\n \n$\n(0.22)\n(23.2)\n%\nCurrency-related items\n(0.01)\n— \n(0.01)\nAdjusted EPS (constant currency)\n (1)\n$\n0.72\n \n$\n0.95\n \n$\n(0.23)\n(24.2)\n%\nKey Drivers of Adjusted EPS (constant currency)\n$ Change\nDecrease in operations\n$\n(0.33)\nImpact from acquisitions \n0.01 \nChange in equity method investment net earnings\n0.01 \nChange in income taxes\n \n0.05 \nChange in shares outstanding \n0.03 \nTotal change in Adjusted EPS (constant currency) \n(1)\n$\n(0.23)\n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information. The tax expense/(benefit) of each of the pre-tax items excluded from our U.S. GAAP results was computed based on the facts and tax assumptions associated with each item, and such impacts have also been excluded from Adjusted EPS.\n•\nFor the three months ended September 30, 2025, taxes for the: intangible asset impairment charges were $(9) million, mark-to-market losses from derivatives were $(71) million, acquisition-related items were $5 million, ERP System Implementation program were $(10) million, remeasurement of net monetary positions was zero, impact from pension participation changes was $(14) million, impact from resolution of tax matters was $10 million and gain on equity method investment transactions was zero.\n•\nFor the three months ended September 30, 2024, taxes for the: Simplify to Grow Program were $(2) million, intangible asset impairment charges were $(40) million, mark-to-market losses from derivatives were $(144) million, acquisition-related items were $84 million, divestiture-related items were $1 million, ERP System Implementation program were $(6) million, remeasurement of net monetary position was zero and initial impacts from enacted tax law changes were $(11) million.\n38\nTable of Contents\nNine Months Ended September 30:\nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n \n(in millions, except per share data)\n \nNet revenues\n$\n28,041 \n$\n26,837 \n$\n1,204 \n4.5 \n%\nOperating income\n2,596 \n4,734 \n(2,138)\n(45.2)\n%\nNet earnings attributable to\n   Mondelēz International\n1,786 \n2,866 \n(1,080)\n(37.7)\n%\nDiluted earnings per share attributable to\n   Mondelēz International\n1.37 \n2.12 \n(0.75)\n(35.4)\n%\nNet Revenues\n – Net revenues increased $1,204 million (4.5%) to $28,041 million in the first nine months of 2025, and Organic Net Revenue \n(1) \nincreased $1,078 million (4.0%) to $27,890 million. Emerging markets net revenues increased 6.8% and emerging markets Organic Net Revenue increased 6.9% \n(1)\n. Developed markets net revenues increased 3.0% and developed markets Organic Net Revenue increased 2.1% \n(1)\n. The underlying changes in net revenues and Organic Net Revenue are detailed below:\nEmerging\nMarkets\nDeveloped\nMarkets\nMondelēz\nInternational\nNine Months Ended September 30, 2025\nReported (GAAP)\n$\n11,242\n \n$\n16,799\n \n$\n28,041\n \nAcquisitions\n(288)\n— \n(288)\nCurrency-related items\n296 \n(159)\n137 \nOrganic (Non-GAAP)\n$\n11,250\n \n$\n16,640\n \n$\n27,890\n \nNine Months Ended September 30, 2024\nReported (GAAP)\n$\n10,523\n \n$\n16,314\n \n$\n26,837\n \nShort-term distributor agreements\n(3)\n(22)\n(25)\nOrganic (Non-GAAP)\n$\n10,520\n \n$\n16,292\n \n$\n26,812\n \n% Change\nReported (GAAP)\n6.8\n \n %\n3.0\n \n %\n4.5\n \n %\nShort-term distributor agreements\n0.1 \npp\n0.1 \npp\n0.1 \npp\nAcquisitions\n(2.8)\n— \n(1.1)\nCurrency-related items\n2.8 \n(1.0)\n0.5 \nOrganic (Non-GAAP)\n6.9\n \n%\n2.1\n \n%\n4.0\n \n%\nVol/Mix\n(3.2)pp\n(3.3)pp\n(3.2)pp\nPricing\n10.1 \n5.4 \n7.2 \n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information.\nNet revenue increase of 4.5% was driven by our underlying Organic Net Revenue growth of 4.0% and the impact of an acquisition, partially offset by unfavorable currency-related items and lapping prior-year net revenue from a short-term distributor agreement related to the sale of our developed market gum business. Organic Net Revenue growth was driven by higher net pricing, partially offset by unfavorable volume/mix. Higher net pricing was due to the benefit of carryover pricing from 2024 as well as the effects of input cost-driven pricing actions taken during the first nine months of 2025. Higher net pricing was reflected in all regions except North America where net pricing was essentially flat. Unfavorable volume/mix was experienced across all regions, driven by volume declines reflecting pricing elasticity impacts in Europe, Latin America and AMEA, as well as soft consumption in North America. The November 1, 2024 acquisition of Evirth added incremental net revenues of $288 million for the first nine months of 2025. Refer to Note 2, \nAcquisitions and Divestitures, \nfor additional information. Currency-related items decreased net revenues by $137 million, driven by unfavorable currency translation rate changes, partially offset by the impact of extreme pricing in Argentina. Refer to \nRecent Developments and Significant Items Affecting Comparability \nfor additional information. Unfavorable currency translation rate changes were due to the strength of the U.S. dollar relative to several currencies, primarily the Argentinean peso, Mexican peso, Brazilian real, Indian rupee, Turkish lira, Australian dollar, Egyptian pound and Canadian dollar, partially offset by the strength of several currencies relative to the U.S. dollar, including the euro, Russian ruble, British pound sterling, Polish zloty and Swedish krona. \n39\nTable of Contents\nThe lapping of the prior-year short-term distributor agreement related to the sale of our developed market gum business, which ended in the first quarter of 2024, resulted in a year-over-year incremental reduction in net revenue of $25 million.\nOperating Income\n – Operating income decreased $2,138 million (45.2%) to\n $2,596 million\n in the first nine months of 2025. Adjusted Operating Income \n(1) \ndecreased $1,111 million (22.5%) to $3,829 million and Adjusted Operating Income on a constant currency basis \n(1) \ndecreased $1,129 million (22.9%) to $3,811 million due to the following:\n \nFor the Nine Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\n \nOperating Income\n$\n2,596\n \n$\n4,734\n \n$\n(2,138)\n(45.2)\n%\nSimplify to Grow Program \n(12)\n80 \n(92)\nIntangible asset impairment charges \n33 \n153 \n(120)\nMark-to-market losses from derivatives \n1,110 \n157 \n953 \nAcquisition-related items\n \n(11)\n(247)\n236 \nDivestiture-related items \n(7)\n2 \n(9)\nOperating income from short-term distributor agreements\n— \n(2)\n2 \nIncremental costs due to war in Ukraine \n1 \n2 \n(1)\nEuropean Commission legal matter\n— \n(3)\n3 \nERP System Implementation costs\n \n111 \n38 \n73 \nRemeasurement of net monetary position \n24 \n26 \n(2)\nImpact from resolution of tax matters \n(16)\n— \n(16)\nAdjusted Operating Income \n(1)\n$\n3,829\n \n$\n4,940\n \n$\n(1,111)\n(22.5)\n%\nCurrency-related items\n(18)\n— \n(18)\nAdjusted Operating Income (constant currency) \n(1)\n$\n3,811\n \n$\n4,940\n \n$\n(1,129)\n(22.9)\n%\nKey Drivers of Adjusted Operating Income (constant currency)\n$ Change\n   Higher net pricing\n$\n1,939 \nHigher input costs\n(2,964)\nUnfavorable volume/mix\n(638)\nLower selling, general and administrative expenses\n468 \n   Impact from acquisition\n33 \nLower amortization of intangible assets\n13 \n   Lower fixed asset impairment charges\n20 \nTotal change in Adjusted Operating Income (constant currency) \n(1)\n$\n(1,129)\n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information.\n40\nTable of Contents\nDuring the first nine months of 2025, we realized higher net pricing, which was more than offset by increased input costs and unfavorable volume/mix. Higher net pricing, which included the carryover impact of pricing actions taken in 2024 as well as the effects of input cost-driven pricing actions taken during the first nine months of 2025, was reflected across all regions except North America where net pricing was essentially flat. The increase in input costs was driven by higher raw material costs, partially offset by lower manufacturing costs driven by productivity. Higher raw material costs were primarily due to higher cocoa, dairy, packaging, edible oils, nuts, energy and other ingredient costs, as well as unfavorable year-over-year currency exchange transaction costs on imported materials, partially offset by lower sugar and grains costs. Overall, unfavorable volume/mix was experienced across all regions, reflecting pricing elasticity impacts as well as biscuit & baked snacks category softness in North America.\nTotal selling, general and administrative expenses decreased $228 million from the first nine months of 2024, which was driven by a number of factors noted in the table above, including in part, lapping prior-year implementation costs for the completed Simplify to Grow Program, the favorable impact from a resolution of an indirect tax matter and favorable year-over-year change in divestiture-related items, which were offset by an unfavorable currency-related impact to expenses, an unfavorable year-over-year change in acquisition-related items, higher costs incurred for the ERP System Implementation program and the impact from an acquisition. Excluding these net unfavorable factors, selling, general and administrative expenses decreased $468 million from the first nine months of 2024. The decrease was driven primarily by lower advertising and consumer promotion costs and lower overhead costs.\nCurrency-related items increased operating income by $18 million, due to favorable currency translation rate changes and the impact of extreme pricing in Argentina. Favorable currency translation rate changes were primarily due to the strength of several currencies relative to the U.S. dollar, including the Russian ruble, euro and British pound sterling, partially offset by the strength of the U.S. dollar relative to several currencies, including the Mexican peso, Brazilian real, Australian dollar, Swiss franc and Indian rupee.\nOperating income margin decreased from 17.6% in the first nine months of 2024 to 9.3% in the first nine months of 2025. The decrease in operating income margin was driven primarily by lower Adjusted Operating Income margin, an unfavorable year-over-year change in mark-to-market impacts from commodity and foreign currency derivatives, an unfavorable year-over-year change in acquisition-related items and higher costs incurred for the ERP System Implementation program, partially offset by lower intangible asset impairment charges and lapping prior-year costs for the completed Simplify to Grow Program. Adjusted Operating Income margin decreased from 18.4% for the first nine months of 2024 to 13.7% for the first nine months of 2025. The decrease was driven primarily by higher raw material costs and unfavorable product mix, partially offset by higher net pricing, lower advertising and consumer promotion costs, lower manufacturing costs driven by productivity and lower overhead costs.\n41\nTable of Contents\nIncome Taxes \n–\n \nOur effective tax rate for the nine months ended September 30, 2025, was 24.9% as compared to 26.9% for the nine months ended September 30, 2024. The decrease in our year-to-date effective tax rate was primarily driven by tax benefits related to the provision for final 2024 tax return filings, the tax treatment of certain foreign pension assets, and the release of liabilities for uncertain tax positions due to audit developments and statute of limitation expirations in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024.\nNet Earnings and Earnings per Share Attributable to Mondelēz International\n – Net earnings attributable to Mondelēz International of $1,786 million decreased by $1,080 million (37.7%) in the first nine months of 2025\n. \nDiluted EPS attributable to Mondelēz International was $1.37 in the first nine months of 2025, down $0.75 (35.4%) from the first nine months of 2024. Adjusted EPS \n(1)\n was $2.20 in the first nine months of 2025, down $0.51 (18.8%) from the first nine months of 2024. Adjusted EPS on a constant currency basis \n(1)\n was $2.18 in the first nine months of 2025, down $0.53 (19.6%) from the first nine months of 2024.\n \nFor the Nine Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\nDiluted EPS attributable to Mondelēz International\n$\n1.37\n \n$\n2.12\n \n$\n(0.75)\n(35.4)\n%\nSimplify to Grow Program \n(0.01)\n0.05 \n(0.06)\nIntangible asset impairment charges \n0.02 \n0.08 \n(0.06)\nMark-to-market losses from derivatives \n0.68 \n0.09 \n0.59 \nAcquisition-related items \n0.01 \n(0.13)\n0.14 \nDivestiture-related items \n— \n(0.05)\n0.05 \nERP System Implementation costs\n \n0.06 \n0.02 \n0.04 \nRemeasurement of net monetary position \n0.02 \n0.02 \n— \nImpact from pension participation changes \n0.20 \n— \n0.20 \nImpact from resolution of tax matters \n(0.02)\n— \n(0.02)\nInitial impacts from enacted tax law changes \n— \n0.01 \n(0.01)\n(Gain)/loss on equity method investment transactions \n(0.13)\n0.50 \n(0.63)\nAdjusted EPS \n(1)\n$\n2.20\n \n$\n2.71\n \n$\n(0.51)\n(18.8)\n%\nCurrency-related items\n(0.02)\n— \n(0.02)\nAdjusted EPS (constant currency)\n (1)\n$\n2.18\n \n$\n2.71\n \n$\n(0.53)\n(19.6)\n%\nKey Drivers of Adjusted EPS (constant currency)\n$ Change\n       Decrease in operations\n$\n(0.63)\n       Impact from acquisitions\n0.02 \n       Change in benefit plan non-service income\n(0.01)\n       Change in interest and other expense, net \n(0.05)\n       Change in income taxes\n \n0.07 \n       Change in shares outstanding \n0.07 \nTotal change in Adjusted EPS (constant currency) \n(1)\n$\n(0.53)\n(1)\nRefer to the \nNon-GAAP Financial Measures\n section above for additional information.\n The tax expense/(benefit) of each of the pre-tax items excluded from our U.S. GAAP results was computed based on the facts and tax assumptions associated with each item, and such impacts have also been excluded from Adjusted EPS.\n•\nFor the nine months ended September 30, 2025, taxes for the: Simplify to Grow Program were $3 million, intangible asset impairment charges were $(9) million, mark-to-market losses from derivatives were $(223) million, acquisition-related items were $19 million, ERP System Implementation program were $(28) million, remeasurement of net monetary position were zero, impact from pension participation changes was $(87) million, impact from resolution of tax matters was $10 million and gain on equity method investment transactions was zero.\n•\nFor the nine months ended September 30, 2024, taxes for the: Simplify to Grow Program were $(19) million, intangible asset impairment charges were $(40) million, mark-to-market losses from derivatives were $(28) million, acquisition-related items were $67 million, divestiture-related items were zero, ERP System Implementation program were $(8) million, remeasurement of net monetary position were zero, initial impacts from enacted tax law changes were $12 million and loss on equity method investment transactions was zero.\n42\nTable of Contents\nResults of Operations by Reportable Segment\nOur operations and management structure are organized into four operating segments:\n•\nLatin America\n•\nAMEA\n•\nEurope\n•\nNorth America\nWe manage our operations by region to leverage regional operating scale, manage different and changing business environments more effectively and pursue growth opportunities as they arise across our key markets. Our regional management teams have responsibility for the business, product categories and financial results in the regions.\nWe use segment operating income to evaluate segment performance and allocate resources. We believe it is appropriate to disclose this measure to help investors analyze segment performance and trends. See Note 16, \nSegment Reporting,\n for additional information on our segments and \nItems Affecting Comparability of Financial Results\n earlier in this section for items affecting our segment operating results.\nOur reconciliation of segment net revenues and earnings to consolidated financial statement totals were:\n \nFor the Three Months Ended\nSeptember 30,\nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nNet revenues:\nLatin America\n$\n1,238 \n$\n1,204 \n$\n3,635 \n$\n3,755 \nAMEA\n2,017 \n1,851 \n5,854 \n5,388 \nEurope\n3,674 \n3,323 \n10,636 \n9,565 \nNorth America\n2,815 \n2,826 \n7,916 \n8,129 \nNet revenues\n$\n9,744 \n$\n9,204 \n$\n28,041 \n$\n26,837 \nSegment operating income:\nLatin America\n$\n147 \n$\n125 \n$\n419 \n$\n426 \nAMEA\n199 \n335 \n813 \n1,036 \nEurope\n275 \n605 \n1,251 \n1,746 \nNorth America\n547 \n918 \n1,486 \n2,012 \nMark-to-market losses from derivatives\n(348)\n(710)\n(1,110)\n(157)\nGeneral corporate expenses\n(44)\n(78)\n(156)\n(212)\nAmortization of intangible assets\n(32)\n(40)\n(107)\n(115)\nAcquisition-related costs\n— \n(2)\n— \n(2)\nOperating income\n$\n744 \n$\n1,153 \n$\n2,596 \n$\n4,734 \n43\nTable of Contents\nLatin America\nFor the Three Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n(in millions)\nNet revenues\n$\n1,238 \n$\n1,204 \n$\n34 \n2.8 \n%\nSegment operating income\n147 \n125 \n22 \n17.6 \n%\n \nFor the Nine Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\nNet revenues\n$\n3,635 \n$\n3,755 \n$\n(120)\n(3.2)\n%\nSegment operating income\n419 \n426 \n(7)\n(1.6)\n%\nThree Months Ended September 30:\nNet revenues increased $34 million (2.8%), due to higher net pricing (8.7 pp), partially offset by unfavorable volume/mix (4.0 pp) and an unfavorable impact of currency-related items (1.9 pp). Higher net pricing, net of extreme pricing in Argentina, was driven by input cost-driven pricing actions and reflected across all categories, primarily in Brazil, Argentina and Mexico. Unfavorable volume/mix reflected volume declines due to pricing elasticity impacts, primarily in Argentina. Overall, unfavorable volume/mix was driven by declines in refreshment beverages, biscuits & baked snacks and candy, partially offset by gains in chocolate, grocery & cheese and gum. Currency-related items were unfavorable due to currency translation rate changes, partially offset by the impact of extreme pricing in Argentina. Unfavorable currency translation impacts were primarily due to the strength of the U.S. dollar relative to a few currencies in the region, primarily the Argentinean peso, partially offset by the strength of several currencies relative to the U.S. dollar, including the Brazilian real and Mexican peso.\nSegment operating income increased $22 million (17.6%), primarily due to higher pricing, lower advertising and consumer promotion costs, a favorable impact from the resolution of an indirect tax matter, lower manufacturing costs driven by productivity and lower other selling, general and administrative expenses. These favorable items were partially offset by higher raw material costs, unfavorable volume/mix and higher costs incurred for the ERP System Implementation program.\nNine Months Ended September 30:\nNet revenues decreased $120 million (3.2%), due to an unfavorable impact of currency-related items (7.9 pp) and unfavorable volume/mix (2.8 pp), partially offset by higher net pricing (7.5 pp). Currency-related items were unfavorable due to currency translation rate changes, partially offset by the impact of extreme pricing in Argentina. Unfavorable currency translation impacts were primarily due to the strength of the U.S. dollar relative to most currencies in the region, including the Argentinean peso, Mexican peso and Brazilian real. Unfavorable volume/mix reflected volume declines due to pricing elasticity impacts, primarily in Argentina and Mexico. Overall, unfavorable volume/mix was driven by declines in refreshment beverages, candy, biscuits & baked snacks and cheese & grocery, partially offset by gains in chocolate and gum. Higher net pricing, net of extreme pricing in Argentina, was driven by input cost-driven pricing actions and reflected across all categories, primarily in Brazil, Argentina and Mexico.\nSegment operating income decreased $7 million (1.6%), primarily due to higher raw material costs, unfavorable volume/mix, higher costs incurred for the ERP System Implementation program, unfavorable currency-related items and higher other selling, general and administrative expenses. These unfavorable items were mostly offset by higher pricing, lower manufacturing costs driven by productivity, lower advertising and consumer promotion costs, lower acquisition-related items, a favorable impact from the resolution of an indirect tax matter, lower losses on remeasurement of net monetary position in highly inflationary countries and lapping prior-year costs for the completed Simplify to Grow program. \n44\nTable of Contents\nAMEA\nFor the Three Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n(in millions)\nNet revenues\n$\n2,017 \n$\n1,851 \n$\n166 \n9.0 \n%\nSegment operating income\n199 \n335 \n(136)\n(40.6)\n%\n \n \n \n \nFor the Nine Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\n \nNet revenues\n$\n5,854 \n$\n5,388 \n$\n466 \n8.6 \n%\nSegment operating income\n813 \n1,036 \n(223)\n(21.5)\n%\nThree Months Ended September 30:\nNet revenues increased $166 million (9.0%), due to higher net pricing (9.3 pp) and the impact of an acquisition (4.7 pp), partially offset by unfavorable volume/mix (4.0 pp) and unfavorable currency translation rate changes (1.0 pp). Higher net pricing, driven by input cost-driven pricing actions, was reflected across all categories. The November 1, 2024 acquisition of Evirth added incremental net revenues of $87 million (constant currency basis) in the third quarter of 2025. Unfavorable volume/mix reflected pricing elasticity impacts, driven by declines in chocolate, gum, refreshment beverages and biscuits & baked snacks, partially offset by gains in cheese & grocery and candy. Unfavorable currency translation impacts were due to the strength of the U.S. dollar relative to several currencies in the region, primarily the Indian rupee, Australian dollar and Vietnam dong. \nSegment operating income decreased $136 million (40.6%), primarily due to higher raw material costs, unfavorable volume/mix, higher acquisition-related items and higher intangible asset impairments. These unfavorable items were partially offset by higher net pricing, lower advertising and consumer promotion costs, lower manufacturing costs driven by productivity and the impact from our Evirth acquisition.\nNine Months Ended September 30:\nNet revenues increased $466 million (8.6%), due to higher net pricing (7.3 pp) and the impact of an acquisition (5.4 pp), partially offset by unfavorable volume/mix (2.3 pp) and unfavorable currency translation rate changes (1.8 pp). Higher net pricing, driven by input cost-driven pricing actions, was reflected across all categories. The November 1, 2024 acquisition of Evirth added incremental net revenues of $288 million (constant currency basis) in the first nine months of 2025. Unfavorable volume/mix reflected pricing elasticity impacts, driven by declines in chocolate and refreshment beverages, partially offset by gains in cheese & grocery, gum, candy and biscuits & baked snacks. Unfavorable currency translation impacts were due to the strength of the U.S. dollar relative to several currencies in the region, including the Indian rupee, Australian dollar, Egyptian pound, Vietnam dong, Chinese yuan, New Zealand dollar and Nigerian naira. \nSegment operating income decreased $223 million (21.5%), primarily due to higher raw material costs, unfavorable volume/mix, higher acquisition-related items, unfavorable currency translation rate changes and higher intangible asset impairment costs. These unfavorable items were partially offset by higher net pricing, lower manufacturing costs driven by productivity, lower advertising and consumer promotion costs, the impact from our Evirth acquisition, lower fixed asset impairments and lapping prior-year costs for the completed Simplify to Grow program. \n45\nTable of Contents\nEurope\nFor the Three Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n(in millions)\nNet revenues\n$\n3,674 \n$\n3,323 \n$\n351 \n10.6 \n%\nSegment operating income\n275 \n605 \n(330)\n(54.5)\n%\n \n \n \n \nFor the Nine Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\n \nNet revenues\n$\n10,636 \n$\n9,565 \n$\n1,071 \n11.2 \n%\nSegment operating income\n1,251 \n1,746 \n(495)\n(28.4)\n%\nThree Months Ended September 30:\nNet revenues increased $351 million (10.6%), due to higher net pricing (12.6 pp) and favorable currency translation rate changes (5.5 pp), partially offset by unfavorable volume/mix (7.5 pp). Higher net pricing, driven by input cost-driven pricing actions, was reflected across all categories except cheese & grocery. Favorable currency translation rate changes reflected the strength of most currencies across the region relative to the U.S. dollar, primarily the euro, Russian ruble, British pound sterling, Polish zloty and Swedish krona. Unfavorable volume/mix reflected volume declines due to pricing elasticity impacts. Overall, unfavorable volume/mix was driven by declines in chocolate, gum, biscuits & baked snacks and candy, partially offset by gains in cheese & grocery and refreshment beverages.\nSegment operating income decreased $330 million (54.5%), primarily due to higher raw material costs, unfavorable volume/mix and higher other selling, general and administrative expenses. These unfavorable items were partially offset by higher net pricing, lower intangible asset impairment charges, lower advertising and consumer promotion costs, lower manufacturing costs driven by productivity, favorable currency translation rate changes, lower acquisition-related items and lower costs incurred for the ERP System Implementation program.\nNine Months Ended September 30:\nNet revenues increased $1,071 million (11.2%), due to higher net pricing (13.2 pp) and favorable currency translation rate changes (2.8 pp), partially offset by unfavorable volume/mix (4.5 pp\n)\n and lapping the prior-year net revenue from a short-term distributor agreement (0.3 pp\n).\n Higher net pricing, driven by input cost-driven pricing actions, was reflected across all categories. Favorable currency translation rate changes reflected the strength of most currencies across the region relative to the U.S. dollar, primarily the euro, Russian ruble, British pound sterling, Polish zloty and Swedish krona. Unfavorable volume/mix reflected volume declines due to pricing elasticity impacts. Overall, unfavorable volume/mix was driven by declines in chocolate, candy, gum and refreshment beverages, partially offset by gains in biscuits & baked snacks and cheese & grocery. The lapping of the prior-year short-term distributor agreement related to the sale of our developed market gum business, which ended in the first quarter of 2024, resulted in a year-over-year incremental reduction in net revenue of $25 million.\nSegment operating income decreased $495 million (28.4%), primarily due to higher raw material costs, unfavorable volume/mix and higher other selling, general and administrative expenses. These unfavorable items were partially offset by higher net pricing, lower intangible asset impairment charges, lower advertising and consumer promotion costs, lower manufacturing costs driven by productivity, favorable currency translation rate changes, lapping prior-year costs for the completed Simplify to Grow program, lower fixed asset impairment charges, lower acquisition-related items and lower divestiture-related costs.\n46\nTable of Contents\nNorth America\nFor the Three Months Ended\nSeptember 30,\n \n2025\n2024\n$ Change\n% Change\n(in millions)\nNet revenues\n$\n2,815 \n$\n2,826 \n$\n(11)\n(0.4)\n%\nSegment operating income\n547 \n918 \n(371)\n(40.4)\n%\n \n \n \n \nFor the Nine Months Ended\nSeptember 30,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(in millions)\n \nNet revenues\n$\n7,916 \n$\n8,129 \n$\n(213)\n(2.6)\n%\nSegment operating income\n1,486 \n2,012 \n(526)\n(26.1)\n%\nThree Months Ended September 30:\nNet revenues decreased $11 million (0.4%), due to unfavorable volume/mix (1.8 pp) and unfavorable currency translation rate changes (0.1 pp), partially offset by higher net pricing (1.5 pp). Unfavorable volume/mix was driven by declines in biscuits & baked snacks and candy, primarily due to soft consumption in the U.S., partially offset by a gain in chocolate. Unfavorable currency translation rate changes were due to the strength of the U.S. dollar relative to the Canadian dollar. Higher net pricing, driven by input cost-driven pricing actions, was reflected across all categories. \nSegment operating income decreased $371 million (40.4%), primarily due to a lower year-over-year benefit from contingent consideration adjustments related to Clif Bar net of lower acquisition integration costs, higher raw material costs, unfavorable volume/mix and higher costs incurred for the ERP System Implementation program. These unfavorable items were partially offset by lower advertising and consumer promotion costs, higher net pricing, lower manufacturing costs due to productivity, lower other selling, general and administrative expenses and lapping prior-year costs for the completed Simplify to Grow program.\nNine Months Ended September 30:\nNet revenues decreased $213 million (2.6%), due to unfavorable volume/mix (2.4 pp) and unfavorable currency translation rate changes (0.2 pp), as net pricing was essentially flat for the first nine months of the year. Unfavorable volume/mix was driven by declines in biscuits & baked snacks and candy, primarily due to soft consumption in the U.S., slightly offset by a gain in chocolate. Net pricing was essentially flat as higher net pricing in chocolate and candy was offset by lower net pricing in biscuits & baked snacks. Unfavorable currency translation rate changes were due to the strength of the U.S. dollar relative to the Canadian dollar. \nSegment operating income decreased $526 million (26.1%), primarily due to higher raw material costs, unfavorable volume/mix, a lower year-over-year benefit from contingent consideration adjustments related to Clif Bar net of lower acquisition integration costs and higher costs incurred for the ERP System Implementation program. These unfavorable items were partially offset by lower advertising and consumer promotion costs, lower manufacturing costs due to productivity, lower other selling, general and administrative expenses and lapping prior-year costs for the completed Simplify to Grow program.\n47\nTable of Contents\nLiquidity and Capital Resources\nWe believe that cash from operations, our revolving credit facilities, short-term borrowings and long-term debt financing will continue to provide sufficient liquidity for our working capital needs, planned capital expenditures and future payments of our contractual, tax and benefit plan obligations and payments for acquisitions, share repurchases and quarterly dividends. We expect to continue to utilize our commercial paper program and international credit lines as needed. We continually evaluate long-term debt issuances to meet our short- and longer-term funding requirements. We also use intercompany loans with our international subsidiaries to improve financial flexibility. Overall, we do not expect negative effects to our funding sources that would have a material effect on our liquidity, and we continue to monitor our global operations including the impact of developments in Ukraine and the Middle East. To date, we have been successful in generating cash and raising financing as needed. However, if a serious economic or credit market crisis ensues or other adverse developments arise, it could have a material adverse effect on our liquidity, results of operations and financial condition.\nOur most significant ongoing short-term cash requirements relate primarily to funding operations (including expenditures for raw materials, labor, manufacturing and distribution, trade and promotions, advertising and marketing, tax liabilities, benefit plan obligations and lease expenses) as well as periodic expenditures for acquisitions, shareholder returns (such as dividend payments and share repurchases), property, plant and equipment and any significant non-operating items. \nLong-term cash requirements primarily relate to funding long-term debt repayments (refer to Note 7, \nDebt and Borrowing Arrangements\n), our U.S. tax reform transition tax liability and deferred taxes (refer to Note 16, \nIncome Taxes,\n in our Annual Report on Form 10-K for the year ended December 31, 2024), our long-term benefit plan obligations (refer to Note 9, \nBenefit Plans, \nin Item 1 herein\n \nand\n \nNote 11\n, Benefit Plans,\n in our Annual report on Form 10-K for the year ended December 31, 2024) and commodity-related purchase commitments and derivative contracts (refer to Note 8, \nFinancial Instruments\n).\nWe generally fund short- and long-term cash requirements with cash from operating activities as well as cash proceeds from short- and long-term debt financing (refer to \nDebt\n below). We generally do not use equity to fund our ongoing obligations. \nCash Flow\nWe believe our ability to generate substantial cash from operating activities and readily access capital markets and secure financing at competitive rates are key strengths and give us significant flexibility to meet our short- and long-term financial commitments. Our cash flow activity is noted below:\nFor the Nine Months Ended\nSeptember 30,\n2025\n2024\n(in millions)\nNet cash provided by/(used in):\nOperating activities\n$\n2,117 \n$\n3,451 \nInvesting activities\n(930)\n(1,170)\nFinancing activities\n(1,346)\n(2,558)\nNet Cash Provided by Operating Activities\nThe reduction in net cash provided by operating activities was primarily due to lower cash-basis net earnings, combined with higher year-over-year working capital movements.\nNet Cash Used in Investing Activities\nThe reduction in net cash used in investing activities was largely driven by net proceeds from investments in the current year as compared to net contributions in the prior year and lower capital expenditures, partially offset by lower proceeds from derivative settlements. We continue to make capital expenditures primarily to modernize manufacturing facilities, implement new product manufacturing and support productivity initiatives. We expect 2025 capital expenditures to be up to $1.3 billion, including capital expenditures in connection with funding our strategic priorities. We expect to continue to fund these expenditures with cash from operations.\n48\nTable of Contents\nNet Cash Used in Financing Activities\nThe reduction in cash used in financing activities was primarily due to higher debt proceeds combined with lower debt repayments, partially offset by higher share repurchases and higher dividends paid in the first nine months of 2025 compared to the same prior year period.\nDividends\nWe paid dividends of $1,842 million in the first nine months of 2025 and $1,722 million in the first nine months of 2024. The third quarter 2025 dividend of $0.50 per share, declared on July 29, 2025 for shareholders of record as of September 30, 2025, was paid on October 14, 2025. The declaration of dividends is subject to the discretion of our Board of Directors and depends on various factors, including our net earnings, financial condition, cash requirements, future prospects and other factors that our Board of Directors deems relevant to its analysis and decision making.\nGuarantees\nAs discussed in Note 10, \nCommitments and Contingencies\n, we enter into third-party guarantees primarily to cover the long-term obligations of our vendors. As part of these transactions, we guarantee that third parties will make contractual payments or achieve performance measures. As of September 30, 2025 and December 31, 2024, we had no material third-party guarantees recorded on our condensed consolidated balance sheets. Guarantees do not have, and we do not expect them to have, a material effect on our liquidity.\nDebt\nThe nature and amount of our long-term and short-term debt and the proportionate amount of each varies as a result of current and expected business requirements, market conditions and other factors. As such, we may issue commercial paper or secure other forms of financing throughout the year to meet our short-term working capital or other financing needs.\nAt its December 2024 meeting, the Board of Directors approved a new $4 billion long-term financing authorization that replaced the prior long-term financing authorization of $2 billion. As of September 30, 2025, $2.4 billion of the long-term financing authorization remained available.\nOur total debt was $21.3 billion as of September 30, 2025 and $17.7 billion as of December 31, 2024. Our debt-to-capitalization ratio was 0.45 at September 30, 2025 and 0.40 at December 31, 2024. At September 30, 2025, the weighted-average term of our outstanding long-term debt was 7.4 years. Our average daily commercial paper borrowings outstanding were $2.2 billion in the first nine months of 2025 and $1.0 billion in the first nine months of 2024. \nOne of our subsidiaries, Mondelez International Holdings Netherlands B.V. (“MIHN”), has outstanding debt. The operations held by MIHN generated approximately 74.3% (or $20.8 billion) of the $28.0 billion of consolidated net revenue for the nine months ended September 30, 2025. The operations held by MIHN represented approximately 96.2% (or $25.2 billion) of the $26.2 billion of consolidated net assets as of September 30, 2025.\nRefer to Note 7, \nDebt and Borrowing Arrangements, \nfor additional information on our debt and debt covenants.\nCommodity Trends\nWe regularly monitor worldwide supply, commodity cost and currency trends so we can cost-effectively secure ingredients, packaging and fuel required for production. During the first nine months of 2025, the primary drivers of the increase in our aggregate commodity costs were higher cocoa, dairy, packaging, edible oils, nuts, energy and other ingredient costs, as well as unfavorable year-over-year currency exchange transaction costs on imported materials, partially offset by lower sugar and grains costs. While the costs of our principal raw materials fluctuate, generally we believe there will continue to be an adequate supply of the raw materials we use and that they will broadly remain available.\nA number of external factors such as the current macroeconomic environment, including global inflation, effects of geopolitical uncertainty, climate, weather and other conditions affecting plant health and crop yield, commodity, transportation and labor market conditions, exchange rate volatility and the effects of local and global regulations, including trade policies, governmental agricultural or other programs affect the availability and cost of raw materials and agricultural materials used in our products. In particular, the supply of cocoa is exposed to many of these factors, including climate change, weather and other events affecting plant health and crop yield, local regulations in \n49\nTable of Contents\ncocoa-producing countries, and global regulations such as the EU Deforestation Regulation (which requires companies to ensure that the products they place on the EU market or export from it are not associated with deforestation). These factors could impact the supply of cocoa, which could potentially limit our ability to produce our products and significantly impact profitability.\nDuring the first nine months of 2025, price volatility and the higher aggregate cost environment increased due to international supply chain and labor market disruptions and generally higher commodity, transportation and labor costs. We expect these conditions to continue to impact our aggregate commodity costs. In particular, while we expect cocoa costs to be lower in 2026 compared to the current year, we expect to continue to face elevated cocoa costs as compared to historical levels in the near- and medium-term due to these factors. It is possible that we may not be able to increase prices sufficiently to fully cover the incremental costs of cocoa prices in this environment and/or our hedging strategies may not protect us from increases in cocoa costs, which could result in a significant adverse impact on our profitability. \nWe address higher commodity costs and currency impacts primarily through hedging, higher pricing and manufacturing and overhead cost control. We use hedging techniques to limit the impact of fluctuations in the cost of our principal raw materials; however, we may not be able to fully hedge against commodity cost changes, such as dairy, where there is a limited ability to hedge, and our hedging strategies may not protect us from increases in specific raw material costs. Our commodity procurement practices are intended to mitigate price volatility and provide visibility to future costs, but also may potentially limit our ability to benefit from possible future price decreases. Additionally, our costs for major raw materials will not necessarily reflect market price fluctuations because of our forward purchasing and hedging practices. Due to competitive or market conditions, planned trade or promotional incentives, fluctuations in currency exchange rates or other factors, our pricing actions may also lag commodity cost changes temporarily.\nSignificant Accounting Estimates\nWe prepare our condensed consolidated financial statements in conformity with U.S. GAAP. The preparation of these financial statements requires the use of estimates, judgments and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements and reported amounts of revenues and expenses during the periods presented. Actual results could differ from those estimates and assumptions. Our significant accounting policies and estimates are described in Note 1 to our consolidated financial statements and \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations, \nrespectively, in our Annual Report on Form 10-K for the year ended December 31, 2024. Also refer to Note 1, \nBasis of Presentation\n, in this report.\nForward-Looking Statements\nThis report contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). All statements other than statements of historical fact are “forward-looking statements” for purposes of federal and state securities laws, including any projections of earnings, revenue or other financial items; any statements of the plans, strategies and objectives of management, including for future operations, capital expenditures or share repurchases; any statements concerning proposed new products, services, or developments; any statements regarding future economic conditions or performance; any statements of belief or expectation; and any statements of assumptions underlying any of the foregoing or other future events. Forward-looking statements may include, among others, the words, and variations of words, “will,” “may,” “expect,” “would,” “could,” “might,” “intend,” “plan,” “believe,” “likely,” “estimate,” “anticipate,” “objective,” “predict,” “project,” “drive,” “seek,” “aim,” “target,” \"remain,\" “potential,” “commitment,” “outlook,” “continue” or any other similar words.\n50\nTable of Contents\nAlthough we believe that the expectations reflected in any of our forward-looking statements are reasonable, actual results or outcomes could differ materially from those projected or assumed in any of our forward-looking statements. Our future financial condition and results of operations, as well as any forward-looking statements, are subject to change and to inherent risks and uncertainties, many of which are beyond our control and are amplified by ongoing macroeconomic volatility and uncertainty, including current and potential trade and tariff actions affecting the countries where we operate. Important factors that could cause our actual results or performance to differ materially from those contained in or implied by our forward-looking statements include, but are not limited to, the following:\n•\nweakness and/or volatility in macroeconomic conditions in our markets, including as a result of inflation (and related monetary policy actions by governments in response to inflation) and the instability of certain financial institutions; \n•\nrisks from operating globally including geopolitical, trade, tariff and regulatory uncertainties affecting developed and emerging markets;\n•\nvolatility of cocoa and other commodity input costs, our ability to effectively hedge such costs and the availability of commodities; \n•\ngeopolitical uncertainty, including the impact of ongoing or new developments in Ukraine and the Middle East, related current and future sanctions imposed by governments and other authorities and related impacts, including on our business operations, employees, reputation, brands, financial condition and results of operations;\n•\ncompetition and our response to channel shifts and pricing and other competitive pressures; \n•\npricing actions and customer and consumer responses to such actions;\n•\npromotion and protection of our reputation and brand image; \n•\nweakness in consumer spending and/or changes in consumer preferences and demand and our ability to predict, identify, interpret and meet these changes;\n•\nthe outcome and effects on us of legal and tax proceedings and government investigations;\n•\nuse of information technology and third party service providers;\n•\nunanticipated disruptions to our business, such as malware incidents, cyberattacks or other security breaches, and supply, commodity, labor and transportation constraints; \n•\nour ability to identify, complete, manage and realize the full extent of the benefits, cost savings, efficiencies and/or synergies presented by strategic acquisitions and other transactions as well as other strategic initiatives, such as our ERP System Implementation program; \n•\nour investments and our ownership interests in those investments;\n•\nthe impact of climate change on our supply chain and operations; \n•\nglobal or regional health pandemics or epidemics;\n•\nconsolidation of retail customers and competition with retailer and other economy brands; \n•\nchanges in our relationships with customers, suppliers or distributors; \n•\nmanagement of our workforce and shifts in labor availability or labor costs; \n•\ncompliance with legal, regulatory, tax and benefit laws and related changes, claims or actions; \n•\nperceived or actual product quality issues or product recalls; \n•\nfailure to maintain effective internal control over financial reporting or disclosure controls and procedures; \n•\nour ability to protect our intellectual property and intangible assets;\n•\ntax matters including changes in tax laws and rates, disagreements with taxing authorities and imposition of new taxes; \n•\nchanges in currency exchange rates, controls and restrictions; \n•\nvolatility of and access to capital or other markets, interest rates, the effectiveness of our cash management programs and our liquidity; \n•\npension costs; \n•\nsignificant changes in valuation factors that may adversely affect our impairment testing of goodwill and intangible assets; and \n•\nthe risks and uncertainties, as they may be amended from time to time, set forth in our filings with the U.S. Securities and Exchange Commission, including our Annual Report on Form 10-K for the year ended December 31, 2024 and subsequent Quarterly Reports on Form 10-Q.\nThere may be other factors not presently known to us or which we currently consider to be immaterial that could cause our actual results to differ materially from those projected in any forward-looking statements we make. We disclaim and do not undertake any obligation to update or revise any forward-looking statement in this report except as required by applicable law or regulation. In addition, historical, current and forward-looking sustainability-related statements may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve, and assumptions that are subject to change in the future.\n51\nTable of Contents"
}