{
  "source_file": "mdt-20250425.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nMedtronic plc, headquartered in Galway, Ireland, is the leading global healthcare technology company. Medtronic was founded in 1949 and today serves healthcare systems, physicians, clinicians, and patients in more than 150 countries worldwide. We remain committed to a mission written by our founder in 1960 that directs us “to contribute to human welfare by the application of biomedical engineering in the research, design, manufacture, and sale of products to alleviate pain, restore health, and extend life.”\nOur Mission — to alleviate pain, restore health, and extend life — empowers us to engineer the extraordinary and deliver better outcomes for our world. We are a company of dedication, honesty, integrity, and service. Building on this strong foundation, we are embracing our role as a healthcare technology leader and evolving our business strategy in three key areas:\n•\nAccelerate innovation-driven growth: The combination of our attractive end markets, recent product launches and robust pipeline is expected to enable continued strong revenue growth. We aim to bring inventive and disruptive technology to large healthcare opportunities which enables us to better meet patient needs. Patients around the world deserve access to our life-saving products, and we are driven to use our local presence and scale to increase the adoption of our products and services in markets around the globe.\n•\nDeliver superior outcomes and better experiences for patients and providers: We listen to our patients and customers to better understand the challenges they face. From the patient journey, to creating agile partnerships that produce novel solutions, to making it easier for our customers to deploy our therapies — what we do is anchored in deep insight, and creates simpler, superior experiences.\n•\nTurn data, artificial intelligence (AI), and automation into action: We are confident in our ability to maximize new technology, AI, and data and analytics to tailor therapies in real-time, facilitating remote monitoring and care delivery that conveniently manages conditions, and creates new standards of care.\nWe have four reportable segments that primarily develop, manufacture, distribute, and sell device-based medical therapies and services: the Cardiovascular Portfolio, the Neuroscience Portfolio, the Medical Surgical Portfolio, and the Diabetes Operating Unit. For more information regarding our segments, please see Note 19 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K. \n3\nTable of Content\nCARDIOVASCULAR PORTFOLIO\nThe Cardiovascular Portfolio is made up of the Cardiac Rhythm & Heart Failure, Structural Heart & Aortic, and Coronary & Peripheral Vascular divisions. The primary medical specialists who use our Cardiovascular products include electrophysiologists, implanting cardiologists, heart failure specialists, cardiovascular, cardiothoracic, and vascular surgeons, and interventional cardiologists and radiologists. \nCardiac Rhythm & Heart Failure \nOur Cardiac Rhythm & Heart Failure division includes the following Operating Units: Cardiac Rhythm Management and Cardiac Ablation Solutions. The\n \ndivision develops, manufactures, and markets products for the diagnosis, treatment, and management of heart rhythm disorders and heart failure. Our products include implantable devices, leads and delivery systems, products for the treatment of atrial fibrillation (AF), products designed to reduce surgical site infections, and information systems for the management of patients with Cardiac Rhythm & Heart Failure devices. Principal products and services offered include:\n•\nImplantable cardiac pacemakers including the Azure MRI SureScan, Adapta, Attesta MRI SureScan, and the Micra transcatheter pacing system. Azure pacemakers feature Medtronic-exclusive BlueSync technology, which enables automatic, secure wireless remote monitoring with increased device longevity. The 3830 lead, with His-bundle and left bundle branch capabilities, effectively covers all current forms of conduction system pacing and sensing. The Micra transcatheter pacing system, which is leadless and does not have a subcutaneous device pocket like a conventional pacemaker, includes the Micra VR and the Micra AV device families. Both pacemakers treat patients with atrioventricular block.\n•\nImplantable cardioverter defibrillators (ICDs), including the Aurora Extravascular-ICD, Visia AF MRI SureScan, Evera MRI SureScan, Primo MRI, and the Cobalt and Crome family of BlueSync-enabled ICDs, as well as defibrillator leads, including the Sprint Quattro Secure lead.\n•\nImplantable cardiac resynchronization therapy devices (CRT-Ds and CRT-Ps) including the Claria/Amplia/Compia family of MRI Quad CRT-D SureScan systems and the Cobalt and Crome portfolio of BlueSync-enabled CRT-Ds, as well as the Percepta/Serena/Solara family of MRI Quad CRT-P SureScan systems. \n•\nCardiac ablation products include a full suite of electrophysiology solutions to treat patients with arrhythmias, including paroxysmal and persistent AF. The portfolio includes the Arctic Front Advanced Cardiac Cryoblation System, PulseSelect single shot Pulsed Field Ablation catheter, the Sphere-9 focal catheter, providing high density mapping capabilities combined with dual radio frequency and pulsed field energies to deliver ablation lesions, and Affera Mapping and Navigation System with Prism-1 software aimed at integrating clinical information to improve patient outcomes.\n•\nInsertable cardiac monitoring systems, including the Reveal LINQ and LINQ II. These devices are for patients who experience transient symptoms such as dizziness, palpitation, syncope (fainting) and chest pain, as well as Cryptogenic Stroke patients, which may indicate a cardiac arrhythmia that requires long-term monitoring or ongoing management. Both portfolio devices have unmatched accuracy and a streamlined workflow with AccuRhythm AI algorithms to reduce clinic workload and data burden. LINQ II, the premium portfolio device, offers extended device longevity and remote programming capabilities.\n•\nTYRX products, including the Cardiac and Neuro Absorbable Antibacterial Envelopes, which are designed to stabilize electronic implantable devices and help prevent infection associated with implantable pacemakers and defibrillators. \n•\nRemote monitoring services and patient-centered software to enable efficient care coordination as well as services related to hospital operational efficiency. \n•\nMedtronic stopped the distribution and sale of the HVAD System in June 2021. We continue a support program for patients with HVAD devices, and for caregivers and healthcare professionals who participate in their care.\n4\nTable of Content\nStructural Heart & Aortic \nOur Structural Heart & Aortic division includes the following Operating Units: Structural Heart & Aortic and Cardiac Surgery. The division includes therapies to treat heart valve disorders and aortic disease. Our devices include products for the repair and replacement of heart valves, perfusion systems, positioning and stabilization systems for beating heart revascularization surgery, surgical ablation products, and a comprehensive line of products and therapies to treat aortic disease, such as aneurysms, dissections, and transections. Principal products offered include:\n•\nCoreValve family of aortic valves, including the Evolut PRO, Evolut PRO+, Evolut FX, and Evolut FX+ TAVR systems for transcatheter aortic valve replacement.\n•\nSurgical valve replacement and repair products for damaged or diseased heart valves, including both tissue and mechanical valves; blood-handling products that form a circulatory support system to maintain and monitor blood circulation and coagulation status, oxygen supply, and body temperature during arrested heart surgery; and surgical ablation systems and positioning and stabilization technologies. \n•\nEndovascular stent grafts and accessories, including the Endurant II Stent Graft System for the treatment of abdominal aortic aneurysms, the Valiant Captivia Thoracic Stent Graft System for thoracic endovascular aortic repair procedures, and the Heli-FX EndoAnchor System. \n•\nTranscatheter Pulmonary Valves, including Harmony Transcatheter Pulmonary Valve (TPV) and Delivery Catheter System and Melody TPV/Ensemble II Delivery System. \nCoronary & Peripheral Vascular\nOur Coronary & Peripheral Vascular division includes the following Operating Units: Coronary & Renal Denervation and Peripheral Vascular Health. The division is comprised of a comprehensive line of products and therapies to treat coronary artery disease as well as peripheral vascular disease and venous disease. Our products include coronary stents and related delivery systems, including a broad line of balloon angioplasty catheters, guide catheters, guide wires, diagnostic catheters, and accessories, peripheral drug coated balloons, stent and angioplasty systems, carotid embolic protection systems for the treatment of vascular disease outside the heart, and products for superficial and deep venous disease. Principal products offered include:\n•\nPercutaneous Coronary Intervention products including our Onyx Frontier and Resolute Onyx drug-eluting stents, Euphora balloons, and Launcher guide catheters. \n•\nProducts to treat hypertension including our Symplicity Spyral Renal Denervation (RDN) system.\n•\nPercutaneous angioplasty balloons including the IN.PACT family of drug-coated balloons, vascular stents including the Abre venous stent, directional atherectomy products including the HawkOne directional atherectomy system, and other procedure support tools. \n•\nProducts to treat superficial venous diseases in the lower extremities including the ClosureFast radiofrequency ablation system and the VenaSeal Closure System.\nNEUROSCIENCE PORTFOLIO\nThe Neuroscience Portfolio is made up of the Cranial & Spinal Technologies, Specialty Therapies, and Neuromodulation divisions. The primary medical specialists who use the products of this group include spinal surgeons, neurosurgeons, neurologists, pain management specialists, anesthesiologists, orthopedic surgeons, urologists, urogynecologists, interventional radiologists, and ear, nose, and throat specialists.\n5\nTable of Content\nCranial & Spinal Technologies\nOur Cranial & Spinal Technologies division and Operating Unit develops, manufactures, and markets an integrated portfolio of devices and therapies for surgical technologies designed to improve the precision and workflow of neurological procedures, and a comprehensive line of medical devices and implants used in the treatment of the spine and musculoskeletal system. The division also provides biologic solutions for the orthopedic markets and offers unique and highly differentiated imaging, navigation, power instruments, and robotic guidance systems used in spine and cranial procedures. Principal products and services offered include:\n•\nNeurosurgery products, including platform technologies, implant therapies, and advanced energy products through the AiBLE spine technology ecosystem. This includes our StealthStation S8 surgical navigation system, Stealth Autoguide cranial robotic guidance platform, O-arm Imaging System, Mazor robotic guidance systems used in robot-assisted spine procedures, UNiD adaptive spine intelligence AI-driven technology for surgical planning and personalized spinal implants, and our Midas Rex surgical drills, including our MR8 high-speed drill system.\n                        \n \n•\nProducts to treat a variety of conditions affecting the spine, including degenerative disc disease, spinal deformity, spinal tumors, fractures of the spine, and stenosis. These products include our CATALYFT PL expandable interbody spacers, CD Horizon ModuLeX spinal system, and T2 STRATOSPHERE expandable corpectomy system. These products can also include titanium interbody implants and surface technologies, such as our Adaptix interbody system and incorporated Titan interbody fusion device with nanoLOCK technology.\n•\nProducts that facilitate less invasive thoracolumbar surgeries, including the CD Horizon Solera Voyager percutaneous fixation system and various retractor systems to access the spine through smaller incisions.\n•\nProducts to treat conditions in the cervical region of the spine, including the ZEVO anterior cervical plate system, the Infinity Occipitocervical-Upper Thoracic (OCT) System, and Prestige LP cervical discs.\n•\nBiologic solutions products, including our Infuse Bone Graft (InductOs in the European Union (E.U.)), which contains a recombinant human bone morphogenetic protein-2, rhBMP-2, for certain spinal, trauma, and oral maxillofacial applications.\n•\nDemineralized bone matrix products, including Magnifuse, GRAFTON/GRAFTON PLUS, and the Mastergraft family of synthetic bone graft products – Matrix, Putty, Strip, and Granules.\nSpecialty Therapies\nOur Specialty Therapies division includes the following Operating Units: Neurovascular; Ear, Nose, and Throat (ENT); and Pelvic Health. The division develops, manufactures, and markets products and therapies to treat patients afflicted with acute ischemic and hemorrhagic stroke, ENT diseases, and patients suffering from overactive bladder, and (non-obstructive) urinary retention. Principal products and services offered include:\n•\nNeurovascular products to treat diseases of the vasculature in and around the brain. This includes coils, neurovascular stent retrievers, and flow diversion products, as well as access and delivery products to support procedures. Products also include the Pipeline Flex and Pipeline Vantage embolization devices with Shield Technology, endovascular treatments for large or giant wide-necked brain aneurysms, the portfolio of Solitaire revascularization devices for treatment of acute ischemic stroke, the Riptide aspiration system, the Onyx Liquid Embolic System, and a portfolio of associated access catheters including our React aspiration catheters also for the treatment of acute ischemic stroke. \n•\nENT products, including the Straightshot M5 microdebrider handpiece, the Integrated Power Console (IPC) system, NIM Vital nerve monitoring systems, Propel and Sinuva Sinus Implants, StealthStation ENT and StealthStation FlexENT navigation systems, as well as products for hearing restoration.\n•\nPelvic health products, including our InterStim X and InterStim II recharge-free neurostimulators, InterStim Micro rechargeable neurostimulators, and SureScan MRI leads. Our NURO System delivers Percutaneous Tibial Neuromodulation therapy to treat overactive bladder, (non-obtrusive) urinary retention, and chronic fecal incontinence. \nNeuromodulation\nOur Neuromodulation division and Operating Unit develops, manufactures, and markets spinal cord stimulation and brain modulation systems, implantable drug infusion systems for chronic pain, as well as interventional products. Principal products and services offered include:\n•\nSpinal cord stimulation products, including rechargeable and recharge-free devices and a large selection of leads used to treat chronic back and/or limb pain and chronic pain resulting from diabetic peripheral neuropathy. This includes the Inceptiv spinal cord stimulation system which offers a closed-loop feature that senses biological signals along the spinal cord and automatically adjusts stimulation in real time, Intellis (rechargeable) and Vanta (recharge-free) spinal cord stimulation systems, with \n6\nTable of Content\nAdaptiveStim and SureScan MRI Technology, DTM (differential target multiplexed) proprietary waveform, and the Evolve workflow algorithm, and Snapshot reporting.\n•\nBrain modulation products, including those for the treatment of Parkinson's disease, essential tremor, refractory epilepsy, severe, treatment-resistant obsessive-compulsive disorder (approved under a Humanitarian Device Exemption (HDE) in the U.S.), and chronic, intractable primary dystonia (approved under a HDE in the U.S.). Specifically, the Percept family of neurostimulators with proprietary adaptive BrainSense technology.\n•\nImplantable drug infusion systems, including our SynchroMed III Implantable Infusion System, which deliver small quantities of drug directly into the intrathecal space surrounding the spinal cord, to help manage chronic pain, cancer pain, and severe spasticity. \n•\nInterventional products, including our full Kyphon portfolio of minimally invasive Kyphoplasty and Vertebroplasty solutions for the treatment of vertebral compression fractures, including bipedicular and unipedicular access options, bone access tools, inflatable balloon tamps, cement and delivery systems, as well as biopsy and specialty devices. The OsteoCool cooled radiofrequency ablation system with simultaneous, dual-probe capabilities and algorithms for the treatment of painful metastatic bone lesions. Emprint Microwave with Thermosphere technology for the treatment of non-resectable liver tumors. As well as the Accurian nerve ablation system, which conducts radio frequency ablation of nerve tissues.\nMEDICAL SURGICAL PORTFOLIO\nThe Medical Surgical Portfolio includes the Surgical & Endoscopy and Acute Care & Monitoring divisions. Products and therapies of this group are used primarily by healthcare systems, physicians' offices, ambulatory care centers, and other alternate site healthcare providers. While less frequent, some products and therapies are also used in home settings.\nSurgical & Endoscopy\nOur Surgical & Endoscopy division includes the following Operating Units: Surgical and Endoscopy. The division develops, manufactures, and markets advanced and general surgical products, including advanced stapling devices, vessel sealing instruments, wound closure products, electrosurgery products, AI-powered surgical video and analytics platform, robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology products, minimally invasive gastrointestinal and hepatologic diagnostics and therapies, and therapies to treat diseases and conditions that are typically, but not exclusively, addressed by surgeons. Principal products and services offered include:\n•\nAdvanced stapling and energy products, including the Tri-Staple technology platform for endoscopic stapling, including the Endo GIA reloads and reinforced reloads with Tri-Staple technology and the Endo GIA ultra universal stapler, the Signia powered stapling system, the LigaSure exact dissector and L-Hook Laparoscopic Sealer/Divider, and the Sonicision 7 curved jaw cordless ultrasonic dissection system.\n•\nElectrosurgical hardware and instruments, including the Valleylab FT10 and FX8 energy platforms, the Valleylab FT10 vessel sealing generator, and the Force TriVerse electrosurgical pencils.\n•\nRobotic and digital surgery technologies, including the Hugo robotic-assisted surgery (RAS) system designed for a broad range of soft-tissue procedures, and Touch Surgery Enterprise, an AI-powered surgical video management solution for the operating room.\n•\nProducts designed for the treatment of hernias, including the AbsorbaTack absorbable mesh fixation device for hernia repair, MaxTack motorized fixation device designed for minimally invasive hernia fixation, the Symbotex composite mesh for surgical laparoscopic and open ventral hernia repair, and ProGrip laparoscopic self-fixating mesh, a self-gripping, biocompatible solution for inguinal hernias.\n•\nSuture and wound closure products, including the V-Loc barbed sutures, the Polysorb braided absorbable sutures, and the Monosof absorbable monofilament nylon sutures.\n7\nTable of Content\n•\nEndoscopy products, including the GI Genius intelligent endoscopy module, the PillCam capsule endoscopy systems, the Bravo calibration-free reflux testing systems, the Endoflip 300 Impedance Planimetry System, the Emprint ablation system with Thermosphere Technology, the ManoScan high-resolution manometry system, the Barrx platform through ablation with the Barrx 360 Express catheter, the Cool-tip radiofrequency ablation system, the Beacon delivery system, and the Nexpowder endoscopic hemostasis system.\nAcute Care & Monitoring\nOur Acute Care & Monitoring division develops, manufactures, and markets products in the fields of patient monitoring and airway management. Principal products and services offered include:\n•\nProducts focused on blood oxygen management and remote monitoring, including Nellcor pulse oximetry monitors and sensors, Healthcast Connectivity Solutions, and the RespArray patient monitor.\n•\nProducts focused on reducing perioperative complications, including Bispectral Index (BIS) brain monitoring technology, INVOS cerebral/somatic oximetry systems, and WarmTouch convective warming. \n•\nProducts focused on airway management and respiratory monitoring, including Microstream capnography monitors, McGRATH MAC video laryngoscopes, Shiley endotracheal tubes, Shiley tracheostomy tubes, and DAR Breathing Systems.\nDIABETES OPERATING UNIT\nThe Diabetes Operating Unit develops, manufactures, and markets products and services for the management of Type 1 and Type 2 diabetes. The primary medical specialists who use and/or prescribe our Diabetes products are endocrinologists and primary care physicians. \nPrincipal products and services offered include:\n•\nInsulin pumps and consumables, including the MiniMed 780G system, powered by SmartGuard technology. The MiniMed 780G system provides smartphone and Bluetooth connectivity, a meal-time detection system, an adjustable glucose target down to 100 mg/dl, and has the capability to continuously deliver background insulin and monitor sugar levels.\n•\nContinuous glucose monitoring (CGM) systems include the Guardian Connect CGM system and Simplera platform. Both systems are worn by patients capturing glucose data to reveal patterns and potential problems, such as hyperglycemic and hypoglycemic episodes. The Simplera platform's discreet design simplifies the insertion and wear experience through the integration of the Simplera CGM, as a Smart Multiple Daily Injections (MDI) system, and the InPen with the Simplera Sync sensor and the MiniMed 780G system, offering disposable capabilities.\n•\nThe InPen smart insulin pen system combines a reusable Bluetooth-enabled insulin pen with an intuitive mobile app that helps users administer the appropriate insulin dose. The InPen application integrates with our CGM data to provide real-time CGM readings alongside insulin dose information.\nIn May 2025, we announced our intention to separate the Diabetes business, with the intention to create a new independent, publicly traded company. The separation is expected to be completed within 18 months of the initial announcement. \nHUMAN CAPITAL \nMedtronic Workforce Overview\nMedtronic’s employees deliver on our Mission every day. We empower insight-driven care, experiences that put people first, and better outcomes for our world. In everything we do, we are engineering the extraordinary. We strive to be the employer of choice for the best and brightest global talent, where employees can grow and develop fulfilling careers. We aspire to create an inclusive, diverse, and equitable workplace that fosters innovation and creativity, and where employees feel a sense of belonging and well-being. Medtronic has over 95,000 full-time employees, of which 44% are based in the U.S. or Puerto Rico. \n8\nTable of Content\nInclusion\nWe believe that improving health for people from all walks of life depends on our ability to unleash the creative power of our global employees. By breaking down barriers, we open doors for everyone, driving opportunity, progress, and prosperity around the world. Our commitment to inclusion is a core element of the Medtronic Mission, and we integrate these principles throughout our Company to ensure every operating unit, team, and leader recognizes and celebrates the value of diverse experiences and backgrounds. Additionally, Medtronic employee resource groups (ERGs) and Networks are employee-led affinity groups that provide career development and networking opportunities to all employees and strengthen ties between employees of many different backgrounds, cultures, and interests.\nPay Equity\nIn our most recent reported period available, in the United States, we have achieved 100% pay equity for gender and ethnically diverse employees. Globally we have achieved 99% pay equity for gender. We are actively working to resolve any remaining pay inequities by continuing to expand the annual pay equity analyses for each country we operate in. \nWorkforce Compensation\nOur compensation framework is designed to provide market competitive pay for the value and contributions of our employees. We are committed to transparent communications on compensation. Our competitive approach to compensation reflects industry benchmarks and local market standards. Our programs include annual and long-term equity-based incentives that provide the means to share in the Company’s success, based on business and individual performance. To attract and retain the best leaders, we offer competitive benefits and cash and equity incentives. We reward high-performing employees with an ownership stake in the Company through restricted stock, and employees have the opportunity to purchase stock at a significant discount through our Employee Stock Purchase Plan.\nLearning & Development\nThe skills and dedication of our employees drive our business performance. Our comprehensive professional development programs empower our people to build rewarding careers and help us attract world-class talent from global and diverse populations. Our suite of professional development programs ensures that our employees, regardless of level, location, language or learning preferences, have access to opportunities to develop and grow.\nIn recent years, we have shifted away from degree requirements to focus on skills-based certification for certain roles within Medtronic. Additionally, as members of the Multiple Pathways Initiative, we have used a skills-based approach to offering opportunities to expanded pools of external talent that have previously been held back due to lack of access to undergraduate education. Internally, eligible U.S. and Puerto Rico employees can now participate through MAPS (Medtronic Advancement Pathways and Skill-building) in undergraduate courses from top-tier universities to enhance or obtain new skills, at no cost to the employee. We have opened opportunities for employees who have been otherwise restricted from career advancement due to degree requirements.\nEmployee Engagement and Culture\nThrough our Organizational Health Survey, we gain valuable insight into the Medtronic employee experience and identify where we can improve in key priority areas: 1) Employee Engagement, 2) Inclusion, 3) Innovation, 4) Ethics and 5) Quality culture as part of our commitment to Put Patients First in our everyday decisions and actions. In our most recent survey ending in the fourth quarter of fiscal year 2025, more than 88% of our employees responded. Medtronic carefully reviews and implements actions based on employee feedback in order to partner and create an inclusive, innovative and supportive environment.\nOur culture is critical to achieving our vision. The Medtronic Mindset builds on our core values of integrity, quality, inclusion, and collaboration. It urges us to act boldly, compete to win, move with speed and decisiveness, foster belonging, and deliver results… the right way. Our culture helps us meet the needs of our patients and customers, and ensures our Mission endures for many years to come.\nHealth & Safety\nAs a large, global employer, our ability to attract and retain talent is based in part on our commitment to maintain a safe workplace and support the well-being of our employees. Medtronic has a comprehensive approach to providing robust support for our employees and their families in natural disasters, public health crises, civil unrest and armed conflicts, bereavement, and other challenging events. Along with other programs, the Medtronic Employee Assistance Program and the Medtronic Employee Emergency Assistance Fund have historically supported employees and their families when faced with difficult times by providing a variety of services such as mental health, safety, and financial resources and support at no cost. These programs have proven invaluable in navigating our employees through unique challenges, including in fiscal year 2025. The Medtronic Employee Emergency Assistance Fund is supported by donations from employees and the Medtronic Foundation, and over the last five years has provided $4 million in grants to employees experiencing unexpected events creating a financial hardship.\n9\nTable of Content\nFor more information on Human Capital Management at Medtronic, please refer to our 2024 Impact Report available on our company website.\nOTHER FACTORS IMPACTING OUR OPERATIONS\nResearch and Development\nThe markets in which we participate are subject to rapid technological advances and innovations. Constant improvement of existing products and introduction of new products is necessary to maintain market leadership. Our research and development (R&D) efforts are directed toward maintaining or achieving technological leadership in the markets we serve to help ensure that patients using our devices and therapies receive the most advanced and effective treatment possible. We remain committed to developing technological enhancements and new indications for existing products, and less invasive and new technologies for new and emerging markets to address unmet patient needs. That commitment leads to our initiation and participation in hundreds of clinical trials each fiscal year as the demand for clinical and economic evidence remains high. Furthermore, our development activities are intended to help reduce patient care costs and the length of hospital stays in the future. We have not engaged in significant customer or government-sponsored research.\nOur R&D activities include improving existing products and therapies, expanding their indications and applications for use, developing new therapies and procedures, and entering into arrangements with third parties to fund the development of certain technologies. We continue to focus on optimizing innovation, improving our R&D productivity, driving growth in international markets, generating clinical evidence, and assessing our R&D programs based on their ability to address unmet clinical needs, produce better patient outcomes, and create new standards of care.\nIntellectual Property and Litigation\nWe rely on a combination of patents, trademarks, tradenames, copyrights, trade secrets, and agreements, including non-disclosure agreements, to protect our business and proprietary technology. In addition, we have entered into exclusive and non-exclusive licenses, and covenants not to sue, relating to a wide array of third-party technologies. In the aggregate, these intellectual property assets, agreements, and licenses are of material importance to our business; however, we believe that no single intellectual property asset, agreement, or license is material in relation to our business as a whole. \nWe operate in an industry characterized by extensive intellectual property litigation. Intellectual property litigation may result in significant damage awards and injunctions that could prevent the manufacture and sale of affected products or result in significant royalty payments in order to continue selling the products. At any given time, we are generally involved as both a plaintiff and a defendant in a number of intellectual property actions, the outcomes of which may not be known for prolonged periods of time.\nSales and Distribution\nWe sell our medical devices and therapies through a combination of direct sales representatives and independent distributors globally. Additionally, a portion of the Company's revenue is generated from consignment inventory maintained at hospitals. Our medical supply products are used primarily in hospitals, ambulatory surgical centers, and alternate care facilities, such as home care and long-term care facilities, and are marketed to materials managers, group purchasing organizations (GPOs) and integrated delivery networks (IDNs). We often negotiate with GPOs and IDNs, which enter into supply contracts for the benefit of their member facilities. Our four largest markets are the U.S., Western Europe, China, and Japan. International markets are an area of increasing focus and opportunity, as we believe they remain under-penetrated.\nOur marketing and sales strategy is focused on rapid, cost-effective delivery of high-quality products to a diverse group of customers worldwide. To achieve this objective, our marketing and sales teams are organized around physician specialties. This focus enables us to develop highly knowledgeable and dedicated sales representatives who are able to foster strong relationships with physicians and other customers and enhance our ability to support our customers and cross-sell complementary products. \nWe are not dependent on any single customer for more than 10 percent of our total net sales. \nCompetition, Industry, and Cost Containment\nWe compete in both the therapeutic and diagnostic medical markets in\n more\n than 150 countries throughout the world. These markets are characterized by rapid change resulting from technological advances, innovations and scientific discoveries. Our product lines face a mix of competitors ranging from large manufacturers with multiple business lines to small manufacturers offering a limited selection of products. In addition, we face competition from providers of other medical therapies, such as pharmaceutical companies, including those producing glucagon-like peptide-1s (GLP-1s).\nMajor shifts in industry market share have occurred in connection with product corrective actions, physician advisories, safety alerts, results of clinical trials to support superiority claims, and publications about our products, reflecting the importance of product quality, product efficacy and quality systems in the medical device industry. In the current environment of managed care, economically motivated \n10\nTable of Content\ncustomers, consolidation among healthcare providers, increased competition, declining reimbursement rates, and national and provincial tender pricing, competitively priced product offerings are essential to our business. In order to continue to compete effectively, we must continue to create or acquire advanced technology, incorporate this technology into proprietary products, obtain regulatory approvals in a timely manner, maintain high-quality manufacturing processes, and successfully market these products.\nGovernment and private sector initiatives to limit the growth of healthcare costs, including price regulation, competitive pricing, bidding and tender mechanics, coverage and payment policies, comparative effectiveness of therapies, technology assessments and managed-care arrangements, are continuing in many countries where we do business, including the U.S. These initiatives put increased emphasis on the delivery of more cost-effective medical devices and therapies. Government programs, including Medicare and Medicaid, private healthcare insurance, managed-care plans, and volume-based procurement tenders in China, have attempted to control costs by limiting the amount of reimbursement they will pay for particular procedures or treatments, tying reimbursement to outcomes, shifting to population health management, and other mechanisms. Hospitals, which purchase our technology, are also seeking to reduce costs through a variety of mechanisms, including, for example, centralized purchasing, and in some cases, limiting the number of vendors that may participate in the purchasing program. Hospitals are also aligning interests with physicians through employment and other arrangements, such as gainsharing, where a hospital agrees with physicians to share any realized cost savings resulting from changes in practice patterns such as device standardization. This has created an increased level of price sensitivity among customers for our products.\nProduction and Availability of Raw Materials\nWe manufacture products at facilities located in various countries throughout the world. We purchase many of the components and raw materials used in manufacturing our products from numerous suppliers in various countries. Certain components and raw materials are available only from a sole supplier. We work closely with our suppliers and have plans and measures in place to help ensure continuity of supply while maintaining high quality and reliability. Generally, we have been able to obtain adequate supplies of such raw materials and components. However, due to the U.S. FDA’s manufacturing requirements and those of other regulatory authorities, we may not be able to quickly establish additional or replacement sources for certain components or materials if we experience a sudden or unexpected reduction or interruption in supply and are unable to develop alternative sources. \nFor additional information related to our manufacturing facilities refer to “Item 2. Properties” in this Annual Report on Form 10-K. \nGovernment Regulation\nOur operations and products are subject to extensive regulation by numerous government agencies, including the U.S. FDA, European regulatory authorities such as the Medicines and Healthcare products Regulatory Agency in the United Kingdom, the Health Products Regulatory Authority in the Republic of Ireland and the Federal Institute for Drugs and Medical Devices in Germany, the China \nNational Medical Product Administration (NMPA)\n, and other government agencies inside and outside the U.S. To varying degrees, each of these agencies requires us to comply with laws and regulations governing the development, testing, manufacturing, labeling, marketing, distribution, and post-marketing surveillance of our products. Our business is also affected by data privacy, security and digital health laws, such as the European Health Data Space (EHDS) regulation, as well as government payor cost containment initiatives, and environmental health and safety laws and regulations. In addition, as a result of the release and availability of Artificial Intelligence (AI) technologies, including generative AI platforms, we have seen a global trend toward more comprehensive regulation of AI designed to ensure the ethical use, security, and privacy of AI and create standards for transparency, accountability, and fairness, including the EU AI Act, which may impact our business.\nProduct Approval and Monitoring\nIn many jurisdictions where we do business, including the U.S., the E.U., Japan, and China, our products are subjected to approval and other regulatory requirements regarding performance, safety, and quality. For instance, authorization to commercially distribute a new medical device in the U.S. is generally obtained in one of two primary ways. The first, known as pre-market notification or the 510(k) process, requires us to demonstrate that our medical device is substantially equivalent to a legally marketed medical device. The second, more rigorous process, known as pre-market approval, requires us to independently demonstrate that a medical device is safe and effective for its intended use. This process is generally much more time-consuming and expensive than the 510(k) process.\nIn the E.U., conformity with the marketing authorization requirements is represented by the CE Mark. To obtain a CE Mark, defined products must meet minimum standards of performance, safety, and quality (i.e., the essential requirements), and then, according to their classification, comply with one or more of a selection of conformity assessment routes. The competent authorities of the E.U. countries separately regulate the clinical research for medical devices and the market surveillance of products once they are placed on the market. The Medical Device Regulation was published by the E.U. in 2017, and it imposes significant additional pre-market and post-market requirements (EU MDR). The regulation provided an implementation period and became effective on May 26, 2021. The European Commission extended the implementation period to the end of 2027 for high-risk devices and to the end of 2028 for medium and low risk devices.\n11\nTable of Content\nThe global regulatory environment is increasingly stringent and unpredictable. While harmonization of global regulations has been pursued, requirements continue to differ among countries. We expect this global regulatory environment will continue to evolve, which could impact the cost, the time needed to approve, and ultimately, our ability to maintain existing approvals or obtain future approvals for our products. In addition, reported potential workforce reductions and agency reorganization at the U.S. FDA, if implemented, could have an impact on product approval timelines. Regulations of the U.S. FDA and other regulatory agencies in and outside the U.S. impose extensive compliance and monitoring obligations on our business. These agencies review our design and manufacturing processes, labeling, record keeping, and manufacturers’ required reports of adverse experiences and other information to identify potential problems with marketed products. We are also subject to periodic inspections for compliance with applicable quality system regulations, which govern the methods used in, and the facilities and controls used for, the design, manufacture, packaging, and servicing of finished medical devices intended for human use. In addition, the U.S. FDA and other regulatory bodies, both in and outside the U.S. (including the Federal Trade Commission, the Office of the Inspector General of the Department of Health and Human Services, the U.S. Department of Justice, and various state Attorneys General), monitor the promotion and advertising of our products. Any adverse regulatory action, depending on its magnitude, may limit our ability to effectively market and sell our products, limit our ability to obtain future pre-market approvals or result in a substantial modification to our business practices and operations. For additional information, see \"Item 1A. Risk Factors\" under, \"\nWe are subject to extensive and complex laws and governmental regulations and any adverse regulatory action may materially adversely affect our financial condition and business operations.\"\nTrade Regulations\nThe movement of products, services, technology, know-how, and investment across borders subjects us to extensive trade laws and regulations, including tariff regulations adopted by different countries or trading zones. These laws and regulations govern, among other things, our import, export and other international trade activities. We are subject to the risk that these laws and regulations could change in a way that would expose us to additional costs and burdens, as well as penalties if not complied with. Some governments impose economic sanctions and other trade restrictions against certain countries, persons or entities. We also sell and provide goods, technology and services to agents, representatives and distributors who may in turn sell or provide such items to customers and other end-users in their own countries or by means of their own cross-border transactions. If we, or the third parties through which we do business, are not in compliance with applicable import, export control or economic sanctions laws and regulations, we may be subject to civil or criminal enforcement action, and varying degrees of liability. Such actions may disrupt or delay sales of our products or services or result in restrictions on our distribution and sales of products or services that may materially impact our business.\nAnti-Boycott Laws\nUnder U.S. laws and regulations, U.S. companies and their subsidiaries and affiliates outside the U.S. are prohibited from participating or agreeing to participate in unsanctioned foreign boycotts in connection with certain business activities, including the sale, purchase, transfer, shipping or financing of goods or services within the U.S. or between the U.S. and countries outside of the U.S. If we, or certain third parties through which we sell or provide goods or services, violate anti-boycott laws and regulations, we may be subject to civil or criminal enforcement action and varying degrees of liability.\nData Privacy and Security Laws and Regulations\nAs a business with a significant global footprint, compliance with evolving regulations and standards in data privacy and cybersecurity has resulted, and may continue to result, in increased costs, new compliance challenges, and the threat of increased regulatory enforcement activity. Our business relies on the secure electronic transmission, storage and hosting of sensitive information, including personal information, protected health information, financial information, intellectual property and other sensitive information related to our products and therapies, customers, patients, and workforce.\nOur global operational footprint comes with the obligation for compliance and adherence to individual data security, confidentiality and breach notification laws at the State, Federal, and International levels. Examples of those laws include, in the U.S., the Health Insurance Portability and Accountability Act of 1996 (HIPAA), as amended, the Health Information Technology for Economic and Clinical Health Act of 2009 (HITECH), and various State privacy laws. We also are subject to various other country-specific requirements around the world, such as the General Data Protection Regulation (GDPR) in the European Economic Area, the United Kingdom’s privacy laws, and China's Personal Information Protection Law (PIPL). \nBecause the laws and regulations continue to expand, differ from jurisdiction to jurisdiction, and are subject to evolving (and at times inconsistent) governmental interpretation and different cross border data transfer rules, compliance may require significant additional cost expenditures or changes in products or business that increase competition or reduce revenue. Noncompliance could result in the imposition of fines, penalties, or orders to stop noncompliant activities, withdrawal of noncompliant products from a market, and reputational harm.\nRegulations Governing Reimbursement\nThe delivery of our devices is subject to regulation by the U.S. Department of Health and Human Services (HHS) and comparable state and non-U.S. agencies responsible for reimbursement and regulation of healthcare items and services. U.S. laws and regulations are imposed \n12\nTable of Content\nprimarily in connection with federally funded healthcare programs, such as the Medicare and Medicaid programs, as well as the government’s interest in regulating the quality and cost of healthcare. Other governments also impose regulations in connection with their healthcare reimbursement programs and the delivery of healthcare items and services. In addition, reported potential workforce reductions and agency reorganization at HHS, if implemented, could have an impact on reimbursement programs.\nU.S. federal healthcare laws apply when we or customers submit claims for items or services that are reimbursed under federally-funded healthcare programs, including laws related to kickbacks, false claims, self-referrals or other healthcare fraud. There are often similar state false claims, anti-kickback, and anti-self-referral and insurance laws that apply to state Medicaid and other healthcare programs and private third-party payors. In addition, as a manufacturer of U.S. FDA-approved devices reimbursable by federal healthcare programs, we are subject to the U.S. Physician Payments Sunshine Act (Open Payments), which requires us to annually report certain payments and other transfers of value we make to U.S.-licensed physicians, certain allied health professionals, and U.S. teaching hospitals. Similarly, other jurisdictions impose transparency reporting obligations relating to health care professional payments. Any failure to comply with these laws and regulations could subject us or our officers and employees to criminal and civil financial penalties.\nImplementation of legislative or regulatory reforms to reimbursement systems, or adverse decisions relating to our products by administrators of these systems in coverage or reimbursement, could significantly reduce reimbursement or result in the denial of coverage, which could have an impact on the acceptance of and demand for our products and the prices that our customers are willing to pay for them. \nEnvironmental Health and Safety Laws\nWe are also subject to various environmental health and safety laws and regulations both within and outside the U.S. Like other companies in our industry, our manufacturing and other operations involve the use and transportation of substances regulated under environmental health and safety laws including those related to the use, storage, transportation, and disposal of hazardous materials.\nAvailable Information \nWe maintain a website at \nwww.medtronic.com\n. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (Exchange Act) are made available under the “Our Company – Investors” caption and “Financials – SEC Filings” sub caption of our website as soon as reasonably practicable after we electronically file them with, or furnish them to, the Securities and Exchange Commission (SEC).\nInformation relating to our corporate governance, including our Principles of Corporate Governance, Code of Conduct (including our Code of Ethics for Senior Financial Officers and any related amendments or waivers), Code of Business Conduct and Ethics for Members of the Board of Directors, AI Compass, and information concerning our executive officers, directors and Board committees (including committee charters) is available through our website at \nwww.medtronic.com\n under the “Our Company – Governance” caption. Information relating to transactions in Medtronic securities by directors and officers is available through our website at \nwww.medtronic.com\n under the “Our Company – Investors” caption and the “Financial Information – SEC Filings” sub caption.\nOur website and the information contained on or connected to our website are not incorporated by reference into this Annual Report on Form 10-K.\nThe SEC maintains a website that contains reports, proxy, and information statements, and other information regarding issuers, including the Company, that file electronically with the SEC. The public may obtain any documents that we file with the SEC at \nhttp://www.sec.gov\n. We file annual reports, quarterly reports, proxy statements, and other documents with the SEC under the Exchange Act.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUNDERSTANDING OUR FINANCIAL INFORMATION\nThe following discussion and analysis provides information management believes to be relevant to understanding the financial condition and results of operations of the Company. \nThe discussi\non focuses on our financial results for the fiscal year ended April 25, 2025 (fiscal year 2025) and the fiscal year ended April 26, 2024 (fiscal year 2024). A discussion on our results of operations for fiscal year 2024 as compared to the year ended April 28, 2023 (fiscal year 2023) is included in Part II, Item 7. \"Mana\ngement's Discussion and Analysis of Financial Condition and Results of Operations\" of our Annual Report on Form 10-K for the year ended \nApril 26, 2024\n, filed with the SEC on June \n20, 2024, and is i\nncorporated by reference into this Form 10-K\n. You should read this discussion and analysis along with our consolidated financial statements and related notes thereto at April 25, 2025 and April 26, 2024 and for fiscal years 2025, 2024, and 2023, which are presented within \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K. Amounts reported in millions within this annual report are computed based on the amounts in thousands, and therefore, the sum of the components may not equal the total amount reported in millions due to rounding. Additionally, certain columns and rows within tables may not sum due to rounding.\nFinancial Trends\nThroughout this Management’s Discussion and Analysis, we present certain financial measures that facilitate management's review of the operational performance of the Company and as a basis for strategic planning; however, such financial measures are not presented in our financial statements prepared in accordance with accounting principles generally accepted in the United States (U.S.) (U.S. GAAP). These financial measures are considered \"non-GAAP financial measures\" and are intended to supplement, and should not be considered as superior to, financial measures presented in accordance with U.S. GAAP. We believe that non-GAAP financial measures provide information useful to investors in understanding the Company's underlying operational performance and trends and may facilitate comparisons with the performance of other companies in the medical technologies industry.\nAs presented in the GAAP to Non-GAAP Reconciliations section on the following pages, our non-GAAP financial measures exclude the impact of amortization of intangible assets and certain charges or benefits that contribute to or reduce earnings and that may affect financial trends and include certain charges or benefits that result from transactions or events that we believe may or may not recur with similar materiality or impact to our operations in future periods (Non-GAAP Adjustments). \nIn the event there is a Non-GAAP Adjustment recognized in our operating results, the tax cost or benefit attributable to that item is separately calculated and reported. Because the effective rate can be significantly impacted by the Non-GAAP Adjustments that take place during the period, we often refer to our tax rate using both the effective rate and the non-GAAP nominal tax rate (Non-GAAP Nominal Tax Rate). The Non-GAAP Nominal Tax Rate is calculated as the income tax provision, adjusted for the impact of Non-GAAP Adjustments, as a percentage of income before income taxes, excluding Non-GAAP Adjustments.\nFree cash flow is a non-GAAP financial measure calculated by subtracting property, plant, and equipment additions from operating cash flows.\nRefer to the “GAAP to Non-GAAP Reconciliations,\" \"Income Taxes,\" and \"Free Cash Flow\" sections for reconciliations of the non-GAAP financial measures to their most directly comparable financial measures prepared in accordance with U.S. GAAP.\n29\nTable of Content\nEXECUTIVE LEVEL OVERVIEW\nThe following is a summary of revenue, diluted earnings per share, and operating cash flow for fiscal years 2025 and 2024:\nGAAP to Non-GAAP Reconciliations \nThe tables below present reconciliations of our Non-GAAP financial measures to the most directly comparable financial measures prepared in accordance with U.S. GAAP for fiscal years 2025 and 2024. \n \nFiscal year ended April 25, 2025\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome Tax Provision (Benefit)\nNet Income Attributable to Medtronic\nDiluted EPS\nEffective Tax Rate\nGAAP\n$\n5,628 \n$\n936 \n$\n4,662 \n$\n3.61 \n16.6 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets \n(1)\n1,807 \n335 \n1,471 \n1.14 \n18.5 \nRestructuring and associated costs\n (2)\n303 \n65 \n238 \n0.18 \n21.5 \nAcquisition and divestiture-related items \n(3)\n124 \n23 \n101 \n0.08 \n18.5 \nCertain litigation charges, net\n317 \n68 \n249 \n0.19 \n21.5 \n(Gain)/loss on minority investments \n(4)\n213 \n26 \n185 \n0.14 \n12.2 \nMedical device regulations \n(5)\n52 \n10 \n42 \n0.03 \n19.2 \nOther \n(6)\n90 \n20 \n70 \n0.05 \n22.2 \nCertain tax adjustments, net \n(7)\n— \n(62)\n62 \n0.05 \n— \nNon-GAAP\n$\n8,533 \n$\n1,423 \n$\n7,079 \n$\n5.49 \n16.7 \n%\n30\nTable of Content\n \nFiscal year ended April 26, 2024\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome Tax Provision (Benefit)\nNet Income Attributable to Medtronic\nDiluted EPS\nEffective Tax Rate\nGAAP\n$\n4,837 \n$\n1,133 \n$\n3,676 \n$\n2.76 \n23.4 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n1,693 \n258 \n1,435 \n1.08 \n15.2 \nRestructuring and associated costs\n (2)\n389 \n66 \n323 \n0.24 \n17.0 \nAcquisition and divestiture-related items \n(8)\n777 \n113 \n664 \n0.50 \n14.5 \nCertain litigation charges, net\n149 \n31 \n118 \n0.09 \n20.8 \n(Gain)/loss on minority investments \n(4)\n308 \n2 \n305 \n0.23 \n0.6 \nMedical device regulations \n(5)\n119 \n22 \n97 \n0.07 \n18.5 \nCertain tax adjustments, net\n (9)\n— \n(299)\n299 \n0.22 \n— \nNon-GAAP\n$\n8,273 \n$\n1,327 \n$\n6,918 \n$\n5.20 \n16.0 \n%\n(1)\nThe Company recognized $151 million of accelerated amortization on certain intangible assets related to product line exits within the Cardiovascular Portfolio. \n(2)\nAssociated costs primarily include salaries and wages for employees supporting the restructuring activities, consulting expenses, asset write-offs, and for the fiscal year ended April 25, 2025, contract terminations. \n(3)\nThe charges primarily include exit of business-related charges, changes in fair value of contingent consideration, business combination costs, and gains related to certain business or asset sales.\n(4)\nWe exclude unrealized and realized gains and losses on our minority investments as we do not believe that these components of income or expense have a direct correlation to our ongoing or future business operations.\n(5)\nThe charges represent incremental costs of complying with the new European Union medical device regulations for previously registered products and primarily include charges for contractors supporting the project and other direct third-party expenses. We consider these costs to be duplicative of previously incurred costs and/or one-time costs, which are limited to a specific time period.\n(6)\nReflects the recognition of incremental Italian payback accruals resulting from the two July 22, 2024 rulings by the Constitutional Court of Italy relating to certain prior years since 2015.\n(7)\nPrimarily relates to amortization of previously established deferred tax assets from intercompany intellectual property transactions.\n(8)\nThe charges predominantly include $439 million of charges related to the February 2024 decision to exit the Company's ventilator product line, which primarily includes long-lived intangible asset impairments and inventory write-downs. In addition, other charges primarily consist of changes in fair value of contingent consideration and associated costs related to the previously contemplated separation of the Patient Monitoring and Respiratory Interventions businesses. \n(9)\nThe net charge primarily relates to an income tax reserve adjustment associated with the June 2023, Israeli Central-Lod District Court decision and the establishment of a valuation allowance against certain net operating losses which were partially offset by a benefit from the change in a Swiss Cantonal tax rate associated with previously established deferred tax assets from intercompany intellectual property transactions and the step up in tax basis for Swiss Cantonal purposes.\nFree Cash Flow \nFree cash flow, a non-GAAP financial measure, is calculated by subtracting additions to property, plant, and equipment from net cash provided by operating activities. Management uses this non-GAAP financial measure, in addition to U.S. GAAP financial measures, to evaluate our operating results. Free cash flow should be considered supplemental to, and not a substitute for, our reported financial results prepared in accordance with U.S. GAAP. Reconciliations between net cash provided by operating activities (the most comparable U.S. GAAP measure) and free cash flow are as follows:\nFiscal Year\n(in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n7,044 \n$\n6,787 \nAdditions to property, plant, and equipment\n(1,859)\n(1,587)\nFree cash flow\n$\n5,185 \n$\n5,200 \nRefer to the Summary of Cash Flows section for drivers of the change in cash provided by operating activities.\n31\nTable of Content\nMacroeconomic Trends\nLooking ahead, a number of macroeconomic and geopolitical factors could negatively impact our business, including without limitation: \n•\nCompetitive product launches and pricing pressure, geographic macroeconomic developments including changes in global trade policies and fluctuations in currency exchange rates, general price inflation, changes in interest rates, reimbursement challenges, impacts from changes in the mix of our product offerings, delays in product registration approvals, national and provincial tender pricing for certain products, particularly in China, replacement cycle challenges, and supply chain challenges from time to time.\n•\nRecent developments in global trade policy have introduced new uncertainties for our business. During and subsequent to the reporting period, the U.S., China, and other jurisdictions imposed or proposed additional tariffs on imported goods. Based on current imposed or proposed rates as of May 21, 2025, we estimate the net tariff impact to be $200 million to $350 million in fiscal year 2026, with the majority recognized in the consolidated statements of income in the second half of the fiscal year. The lower end of the range assumes that the current U.S. (30%) and China (10%) tariffs persist, while the higher end of the range assumes tariffs revert to higher rates (U.S. 145%, China 125%) after the 90-day pause. The actual amount could vary based on changes in tariff rates, duration of tariffs, scope of tariffs, and potential countermeasures or mitigation actions. The impact of the tariffs on the financial results for fiscal year 2025 were not material. While we are taking proactive steps to mitigate the effects of these tariffs, the evolving nature of international trade policy continues to present a risk to our cost structure and financial performance. Further escalation or expansion of trade barriers could have a material adverse effect on our results of operations. \n•\nThe sanctions and other measures being imposed in response to the Russia-Ukraine conflict are having and could continue to have impacts on revenue and supply chain. The financial impact of the conflict in fiscal year 2025, including on accounts receivable and inventory reserves, was not material. For fiscal year 2025, the business of the Company in these countries represented less than 1% of the Company's consolidated revenues and assets.\n•\nAlthough the long-term implications of Israel's conflict are difficult to predict at this time, the financial and operational impact of the conflict in fiscal year 2025, including on accounts receivable and inventory reserves, was not material. As of April 25, 2025, the Company had 6 facilities and approximately 1,500 employees in Israel. For fiscal year 2025, the business of the Company in Israel represented less than 1% of the Company's consolidated revenues and assets.\nNET SALES\nStarting in the first quarter of fiscal year 2025, the Company combined the non-U.S. developed markets and the emerging markets into an international market geography. Prior period net sales have been recast to conform to the new presentation. The charts below illustrate the percent of net sales by segment for fiscal years 2025 and 2024:\n32\nTable of Content\nThe table below includes net sales by segment and division and market geography for fiscal years 2025 and 2024:\n \n Net Sales by Fiscal Year\nPercent Change \n(in millions)\n2025\n2024\nCardiac Rhythm & Heart Failure\n$\n6,392 \n$\n5,995 \n7 \n%\nStructural Heart & Aortic \n3,554 \n3,358 \n6 \nCoronary & Peripheral Vascular \n2,535 \n2,478 \n2 \nCardiovascular \n12,481 \n11,831 \n5 \nCranial & Spinal Technologies\n4,973 \n4,756 \n5 \nSpecialty Therapies\n2,940 \n2,905 \n1 \nNeuromodulation\n1,932 \n1,746 \n11 \nNeuroscience\n9,846 \n9,406 \n5 \nSurgical & Endoscopy\n6,498 \n6,508 \n— \nAcute Care & Monitoring\n1,909 \n1,908 \n— \nMedical Surgical \n8,407 \n8,417 \n— \nDiabetes \n2,755 \n2,488 \n11 \nReportable segment net sales\n33,489 \n32,142 \n4 \nOther operating segment\n(1)\n137 \n221 \n(38)\nOther adjustments\n(2)\n(90)\n— \n100 \nTotal net sales\n$\n33,537 \n$\n32,364 \n4 \n%\nU.S.\nInternational\n(in millions)\nFiscal Year 2025\nFiscal Year 2024\n% Change\nFiscal Year 2025\nFiscal Year 2024\n% Change\nCardiovascular\n$\n5,804 \n$\n5,597 \n4 \n%\n$\n6,677 \n$\n6,234 \n7 \n%\nNeuroscience\n6,713 \n6,305 \n6 \n3,133 \n3,101 \n1 \nMedical Surgical\n3,664 \n3,717 \n(1)\n4,744 \n4,700 \n1 \nDiabetes\n923 \n852 \n8 \n1,832 \n1,636 \n12 \nReportable segment net sales\n17,104 \n16,471 \n4 \n16,386 \n15,671 \n5 \nOther operating segment\n(1)\n68 \n91 \n(25)\n70 \n131 \n(47)\nOther adjustments\n(2)\n— \n— \n— \n(90)\n— \n100 \nTotal net sales\n$\n17,171 \n$\n16,562 \n4 \n%\n$\n16,365 \n$\n15,802 \n4 \n%\n(1)\nIncludes operations and ongoing transition agreements from businesses the Company has exited or divested.\n(2)\nIncremental Italian payback accruals resulting from the two July 22, 2024 rulings by the Constitutional Court of Italy relating to certain prior years since 2015.\nThe increase in net sales for fiscal year 2025 was driven by growth in most businesses, including strong growth in Cardiac Ablation Solutions, Cardiac Pacing Therapies, TAVR, Diabetes, Neuromodulation, Spine, and Advanced Energy. The net sales increase was partially offset by declines in Stapling and a $90 million incremental Italian payback accrual resulting from the two July 22, 2024 rulings by the Constitutional Court of Italy relating to certain prior years since 2015.\nCardiovascular \nCardiovascular products include pacemakers, insertable cardiac monitors, cardiac resynchronization therapy devices, implantable cardioverter defibrillators, leads and delivery systems, products for the treatment of atrial fibrillation, information systems for the management of patients with Cardiac Rhythm & Heart Failure devices, products designed to reduce surgical site infections, coronary and peripheral stents and related delivery systems, balloons and related delivery systems, endovascular stent graft systems, heart valve replacement technologies, cardiac tissue ablation systems, open heart and coronary bypass grafting surgical products, and renal denervation systems for the treatment of hypertension. Cardiovascular also includes Care Management Services and Cath Lab Managed Services (CLMS) within the Cardiac Rhythm & Heart Failure division. Cardiovascular's net sales for fiscal year 2025 were $12.5 billion, an increase of 5 percent as compared to fiscal year 2024. The net sales increase was primarily due to the strong performance of Cardiac Ablation Solutions, Cardiac Rhythm Management, Structural Heart, and Cardiac Surgery.\n33\nTable of Content\nThe charts below illustrate the percent of Cardiovascular net sales by division for fiscal years 2025 and 2024: \nCardiac Rhythm & Heart Failure (CRHF) net sales increased 7 percent in fiscal year 2025 as compared to fiscal year 2024. The net sales increase was driven by growth in Micra transcatheter pacing systems, Aurora extravascular implantable cardioverter defibrillator (EV-ICD) system, and TYRX, partially offset by declines in CRT-Ds. Cardiac Ablation Solutions experienced strong growth in PulseSelect and Affera Sphere-9 pulsed field ablation with partially offsetting declines in cryoablation.\nStructural Heart & Aortic (SHA) net sales increased 6 percent in fiscal year 2025 as compared to fiscal year 2024. The net sales increase was driven by continued growth in Structural Heart from adoption of Evolut FX+ TAVR system and in Cardiac Surgery driven by growth in Perfusion and Surgical Valves.\nCoronary & Peripheral Vascular (CPV) net sales increased 2 percent in fiscal year 2025 as compared to fiscal year 2024. The net sales increase was driven by growth in Coronary and Renal Denervation led by guide catheters, balloons, and the Symplicity Spyral renal denervation system, partially offset by a decline in stents and impacts from tender pricing in China in Peripheral Vascular Health. \nIn addition to the macro-economic and geopolitical factors described in the Executive Level Overview section, looking ahead, we expect Cardiovascular could be affected by the following:\n•\nContinued global penetration of our Micra transcatheter pacing portfolio.\n•\nContinued acceptance and growth from the Azure XT and Azure S SureScan pacing systems and the 3830 lead.\n•\nGlobal adoption of Aurora EV-ICD.\n•\nGrowth of the Cobalt and Crome portfolio of ICDs and CRT-Ds. \n•\nGrowth of the CRT-P quadripolar pacing system.\n•\nContinued growth, adoption, and utilization of the TYRX Envelope for implantable devices. \n•\nContinued use and acceptance of Reveal LINQ and expansion of the LINQ II cardiac monitor.\n•\nContinued acceptance, adoption, and growth of our innovative portfolio of products in the electrophysiology (EP) segment, including the PulseSelect pulsed field ablation system and the Affera mapping and ablation system with Sphere-9 catheter. The Affera mapping and ablation system and Sphere-9 catheter received U.S. FDA approval in late October 2024.\n•\nContinued acceptance and growth of the self-expanding CoreValve Evolut transcatheter aortic valve replacement platform. This includes Evolut PRO which provides enhanced hemodynamics, reliable delivery, enhanced durability, advanced sealing, and Evolut FX, a system designed to improve the overall procedural experience through enhancements in deliverability, implant \n34\nTable of Content\nvisibility, and deployment stability. The Evolut FX+ TAVR system maintains the valve performance benefits of the legacy Evolut TAVR platform and is designed to facilitate coronary access. The system was approved by the U.S. FDA in March 2024 and received CE Mark in late October 2024.\n•\nMarket acceptance and reimbursement for the Symplicity Spyral renal denervation system, also known as the Symplicity blood pressure procedure, for the treatment of hypertension.\n•\nContinued acceptance and growth of the Onyx Frontier drug-eluting stent (DES) platform. Onyx Frontier is a DES that introduces an enhanced delivery system and is used for complex percutaneous coronary intervention (PCI).\n•\nAcceptance and growth of IN.PACT 018 drug-coated balloons (DCB). IN.PACT 018 adds to the existing IN.PACT Admiral DCB portfolio and is used to treat femoropopliteal disease.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline.\nNeuroscience\nNeuroscience's products include various spinal implants, bone graft substitutes, biologic products, image-guided surgery and intra-operative imaging systems, robotic guidance systems used in the robot-assisted spine procedures, and systems that incorporate advanced energy surgical instruments. Neuroscience's products also focus on therapies to treat the diseases of the vasculature in and around the brain, including coils, neurovascular stents, and flow diversion products, as well as products to treat ear, nose, and throat (ENT), and the treatment of overactive bladder and urinary retention. Neuroscience also manufactures products related to implantable neurostimulation therapies and drug delivery systems for the treatment of chronic pain, movement disorders, and epilepsy. Neuroscience’s net sales for fiscal year 2025 were $9.8 billion, an increase of 5 percent as compared to fiscal year 2024. The net sales increase was primarily due to growth in Neuromodulation, Spine and Biologics, and Neurosurgery.\nThe charts below illustrate the percent of Neuroscience net sales by division for fiscal years 2025 and 2024:\nCranial & Spinal Technologies (CST) net sales for fiscal year 2025 increased 5 percent as compared to fiscal year 2024. The net sales increase was driven by the continued adoption of the AiBLE ecosystem of spine implants and enabling technology with growth in Core Spine, Biologics, and Neurosurgery.\nSpecialty Therapies (Specialty) net sales for fiscal year 2025 increased 1 percent as compared to fiscal year 2024. The net sales increase was driven by growth on continued adoption of the Interstim X system and ENT, partially offset by impacts from tender pricing in China in Neurovascular.\n35\nTable of Content\nNeuromodulation (NM) net sales for fiscal year 2025 increased 11 percent as compared to fiscal year 2024. The net sales increase was driven by growth in Pain Stimulation due to the continued launch of the Inceptiv closed-loop spinal cord stimulator, Brain Modulation driven by the Percept RC deep brain neurostimulator, and Interventional.\nIn addition to the macro-economic and geopolitical factors described in the Executive Level Overview section, looking ahead we expect Neuroscience could be affected by the following:\n•\nContinued adoption and growth of our integrated solutions through the AiBLE offering, which integrates spinal implants with enabling technologies (StealthStation, O-arm Imaging Systems, and Midas), Mazor robotics, and UNiD Adaptive Spine Intelligence AI-driven technology for surgical planning and personalized spinal implants.\n•\nMarket acceptance and continued global adoption of innovative new spine products and procedural solutions within our CST operating unit, such as Catalyft PL, ModuLeX, CD Horizon Voyager System, and our Infinity OCT System, as well as continued growth from Titan spine titanium interbody implants with Nanolock technology.\n•\nContinued growth of commercially available Pipeline Embolization Devices, endovascular treatments for large or giant wide-necked brain aneurysms.\n•\nContinued acceptance and growth of the Solitaire X revascularization device for treatment of acute ischemic stroke and our React Catheter and Riptide aspiration system.\n•\nContinued acceptance and growth of our Pelvic Health therapies, including our InterStim therapy with InterStim X and InterStim II recharge-free neurostimulators and InterStim Micro rechargeable neurostimulator for patients suffering from overactive bladder, (non-obtrusive) urinary retention, and chronic fecal incontinence. \n•\nContinued acceptance and growth of our ENT therapies, including capital equipment sales of the StealthStation ENT surgical navigation system and intraoperative NIM nerve monitoring system, and the Propel sinus implants used in the treatment of chronic rhinosinusitis.\n•\nContinued acceptance and growth from spinal cord stimulation (SCS) therapy for treating chronic pain and Diabetic Peripheral Neuropathy (DPN) on the Inceptiv closed-loop rechargeable neurostimulator, Intellis rechargeable neurostimulator and Vanta recharge-free neurostimulator. The Inceptiv closed-loop rechargeable SCS received U.S. FDA approval in April 2024.\n•\nContinued acceptance and growth of our Percept family of deep brain stimulation (DBS) devices with proprietary BrainSense technology for objectifying and personalizing the treatment of Parkinson's Disease, epilepsy, and other movement disorders. In August 2024, the U.S. FDA approved Asleep DBS surgery for people with Parkinson's and people with essential tremor. BrainSense Adaptive DBS and BrainSense Electrode Identifier received CE Mark in January 2025 and U.S. FDA approval in February 2025.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline, which include the hemorrhagic stroke intravascular device, our next-generation spine enabling technologies, and the percutaneous tibial neuromodulation system.\nMedical Surgical\n \nMedical Surgical’s products span the entire continuum of patient care from diagnosis to recovery, with a focus on diseases of the gastrointestinal tract, lungs, pelvic region, obesity, and preventable complications. The products include those for advanced and general surgical products, surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, advanced ablation, interventional lung, airway products, and sensors and monitors for pulse oximetry, capnography, level of consciousness and cerebral oximetry. Medical Surgical’s net sales for fiscal year 2025 were $8.4 billion, flat as compared to fiscal year 2024, with performance outlined below.\n36\nTable of Content\nThe charts below illustrate the percent of Medical Surgical net sales by division for fiscal years 2025 and 2024:\nSurgical & Endoscopy (SE) net sales for fiscal year 2025 were flat as compared to fiscal year 2024. Net sales were impacted by declines in Stapling, due to U.S. bariatric segment declines and continued shifts to robotic surgery, and Endoscopy. Partially offsetting these declines was strong growth in Advanced Energy, due to continued adoption of LigaSure vessel sealing technology.\nAcute Care & Monitoring (ACM) net sales for fiscal year 2025 were flat as compared to fiscal year 2024. Net sales were impacted by growth of the BIS Advance monitoring system offset by declines in Medtronic Care Management Services.\nIn addition to the macro-economic and geopolitical factors described in the Executive Level Overview section, looking ahead we expect Medical Surgical could be affected by the following:\n•\nAcceptance and continued growth of Open-to-MIS (minimally invasive surgery) techniques and tools through our efforts to transition open surgery to MIS. Open-to-MIS initiative focuses on capturing the market opportunity that exists in transitioning open procedures to MIS, whether through traditional MIS, advanced instrumentation, or robotics. Through our approach, in parallel, we also expand our presence and optimize open surgery in current open surgery markets.\n•\nContinued global acceptance and future growth of powered stapling and energy platform.\n•\nOur ability to execute ongoing strategies addressing the pressures to bariatric surgery procedure volumes in the U.S. from pharmaceuticals, and growth of surgical soft tissue robotics procedures in the U.S.\n•\nOur ability to create markets and drive products and procedures into emerging markets with our high quality and cost-effective surgical products designed for customers in emerging markets. \n•\nContinued acceptance and growth in patient monitoring and airway management. Key products in this area include Microstream Capnography, Nellcor pulse oximetry system with OxiMax technology, Shiley tracheostomy and endotracheal tubes, and McGRATH MAC video laryngoscopes.\n•\nAcceptance of less invasive standards of care in chronic and colorectal, as well as hepatology products, including products that span the care continuum from diagnostics to therapeutics.\n•\nExpanding the use of less invasive treatments and furthering our commitment to improving options for women with abnormal uterine bleeding. Our expanded and strengthened surgical offerings complement our global gynecology business.\n•\nGlobal adoption of robotic-assisted surgery and the safe and effective use of the Hugo robotic assisted surgery (RAS) system, including system reliability and acceptability, for urologic, bariatric, gynecologic, hernia, and general surgery procedures. This \n37\nTable of Content\nincludes continued integration and adoption of Touch Surgery Enterprise with the first artificial intelligence powered surgical videos and analytics platform to make it easier to train and discover new techniques within the robotics platform. The Hugo RAS system, which received CE Mark in October 2021, as well as secured additional regulatory approvals outside the U.S., is designed to help reduce unwanted variability, improve patient outcomes, and, by extension, lower per procedure cost.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline, which include our Hugo RAS system in the U.S., the adoption of AI in Endoscopy and Digital Surgical Technologies, Signia powered stapling devices, and our next-gen Ligasure and Sonicision vessel sealing devices.\nDiabetes\nDiabetes' products include insulin pumps, continuous glucose monitoring (CGM) systems, and consumables. Diabetes' net sales for fiscal year 2025 were $2.8 billion, an increase of 11 percent as compared to fiscal year 2024. The increase in net sales was primarily driven by strong U.S growth as a result of the continued adoption of the MiniMed 780G automated insulated delivery (AID) system, and strong international growth in CGM systems from increased attachment rates and adoption of Simplera Sync.\nIn addition to the macro-economic and geopolitical factors described in the Executive Level Overview section, looking ahead we expect Diabetes could be affected by the following:\n•\nThe pending separation of the Diabetes business from the Company. In May 2025, the Company announced its intent to separate the Diabetes Operating Unit into a new standalone company, and its expectation to complete the separation within 18 months from the announcement date.\n•\nContinued acceptance and growth for the MiniMed 780G insulin pump system, which is powered by SmartGuard technology and features the added benefits of meal detection technology that automatically adjusts and corrects sugar levels every five minutes. The global adoption of our AID systems has resulted in strong sensor attachment rates. The MiniMed 780G insulin pump system with the Guardian 4 Sensor is available in the U.S., and the MiniMed 780G insulin pump system with Simplera Sync received U.S. FDA approval in April 2025 and CE Mark in early January 2024.\n•\nMarket acceptance and growth of our sensor Simplera, which received U.S FDA approval in August 2024 and CE Mark in September 2023. \n•\nContinued acceptance and growth of the Guardian Connect CGM system, which displays glucose information directly to a smartphone to provide patients access to their glucose levels seamlessly and discretely. The Guardian Connect CGM system is available on both Apple iOS and Android devices.\n•\nMarket acceptance and growth of our InPen smart pen system, which allows users to have their Medtronic CGM readings in real-time alongside insulin dose information, all in one view. \n•\nContinued pump, CGM, and consumable competition in an expanding global market. \n•\nChanges in medical reimbursement policies and programs, along with additional payor coverage on insulin pumps.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval, manufacture and commercialize the products within our pipeline, including our partnership with Abbott to expand CGM options for people living with diabetes, our next generation insulin delivery options, as well as expanded labeling in Type 2 diabetes, and fast acting insulins.\n38\nTable of Content\nCOSTS AND EXPENSES\nThe following is a summary of cost of products sold, research and development, and selling, general, and administrative expenses as a percent of net sales:\nCost of Products Sold  \n Cost of products sold for fiscal year 2025 was $11.6 billion as compared to $11.2 billion for fiscal year 2024. Cost of products sold as a percentage of net sales was flat as compared to the prior fiscal year. Cost of products sold increased primarily driven by increases in net sales and unfavorable currency impact partially offset by lower costs for quality remediation and excess and obsolete inventory charges. Fiscal year 2024 included $70 million of inventory write-downs associated with our February 2024 decision to exit our ventilator product line. For additional information about the ventilator inventory write-down, refer to Note 3 of the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K. Looking ahead, we anticipate incurring additional costs related to current imposed and proposed tariffs. Refer to the Executive Level Overview section for further information.\nResearch and Development Expense   \nWe remain committed to deliver the best possible experiences for patients, physicians, and caregivers we serve; to create technologies that expand what’s possible across the human body to transform lives; to turn data and insights into real action to serve patient needs, improving care; and to expand healthcare access and deliver positive outcomes. Research and development expense for fiscal years 2025 and 2024 was $2.7 billion.\nSelling, General, and Administrative Expense  \n Our goal is to continue to leverage selling, general, and administrative expense management initiatives. Selling, general, and administrative expense primarily consists of salaries and wages, other administrative costs, such as professional fees and marketing expenses, certain acquisition and divestiture-related costs, and restructuring associated expenses. Selling, general, and administrative expense for fiscal year 2025 was $10.8 billion as compared to $10.7 billion for fiscal year 2024. The increase in selling, general, and administrative expense is primarily due to new product launches and commercialization activities.\nThe following is a summary of other costs and expenses (income):\nFiscal Year\n(in millions)\n2025\n2024\nAmortization of intangible assets\n$\n1,807 \n$\n1,693 \nRestructuring charges, net\n267 \n226 \nCertain litigation charges, net\n317 \n149 \nOther operating (income) expense, net\n(23)\n464 \nOther non-operating income, net\n(402)\n(412)\nInterest expense, net\n729 \n719 \nAmortization of Intangible Assets   \nAmortization of intangible assets includes the amortization expense of our definite-lived intangible assets, consisting of customer relationships, purchased technology and patents, trademarks, tradenames, and other intangible assets. \n39\nTable of Content\nAmortization of intangible assets for fiscal year 2025 includes $151 million of accelerated amortization on certain intangible assets related to product line exits within the Cardiovascular Portfolio.\nRestructuring Charges, Net  \n In fiscal years 2025 and 2024, restructuring costs primarily related to cost reduction initiatives, which predominantly included employee termination benefits, facility consolidations, and asset write-downs, and specifically for fiscal year 2025, contract terminations.\nFor additional information about our restructuring programs, refer to Note 4 of the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K.\nCertain Litigation Charges, Net\n   We classify specified certain litigation charges and gains related to significant legal matters as \ncertain litigation charges, net\n in the consolidated statements of income. For additional information, refer to Note 18 of the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nOther operating (income) expense, net  \n Other operating (income) expense, net primarily includes expenses associated with royalties paid for the in-license of intellectual property from third parties, currency remeasurement and derivative gains and losses, changes in the fair value of contingent consideration, certain acquisition and divestiture-related items, and income from funded research and development arrangements.\nFor fiscal year 2025, the change in other operating (income) expense, net was largely driven by a decrease in acquisition and divestiture-related expenses as well as insignificant gains from certain business or asset sales in the Cardiovascular and Neuroscience Portfolios during fiscal year 2025. In fiscal year 2024, acquisition and divestiture-related expenses included $369 million of charges related to the Company's decision to exit the ventilator product line, which primarily included intangible asset impairments of $295 million and other charges for contract cancellation costs and severance. In addition, the change in fair value of contingent consideration for fiscal year 2025 was $42 million of expense as compared to $156 million of expense for fiscal year 2024. \nThe change in other operating (income) expense, net was partially offset by the net impact of currency remeasurement and our hedging programs. The currency impact for fiscal year 2025 was a net loss of $3 million as compared to a net gain of $68 million in fiscal year 2024.  \nAdditional information on the charges associated with the ventilator product line exit is described in Note 3 of the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K.\nOther Non-Operating Income, Net\n   Other non-operating income, net includes the non-service component of net periodic pension and postretirement benefit cost, investment gains and losses, and interest income, which includes income on marketable debt securities and our global liquidity structures.\nInterest income was $511 million and $597 million for fiscal year 2025 and 2024, respectively. Income from the non-service component of net periodic pension and postretirement benefit cost was $107 million and $124 million for fiscal year 2025 and 2024, respectively. Net losses on minority investments were $213 million and $308 million for fiscal year 2025 and 2024, respectively. \nInterest Expense, Net\n   Interest expense, net includes interest incurred on our outstanding borrowings, global liquidity structures, amortization of debt issuance costs and debt premiums or discounts, and amortization of amounts excluded from the effectiveness assessment of certain net investment and fair value hedges.\nThe increase in interest expense, net was primarily driven by the €3.0 billion debt issuance in June 2024, partially offset by lower borrowing balances in our global liquidity structures.\n40\nTable of Content\nINCOME TAXES\n \nFiscal Year\n(in millions)\n2025\n2024\nIncome tax provision\n$\n936 \n$\n1,133 \nIncome before income taxes\n5,628 \n4,837 \nEffective tax rate\n16.6 \n%\n23.4 \n%\nNon-GAAP income tax provision\n$\n1,423 \n$\n1,327 \nNon-GAAP income before income taxes\n8,533 \n8,273 \nNon-GAAP Nominal Tax Rate\n16.7 \n%\n16.0 \n%\nDifference between the effective tax rate and Non-GAAP Nominal Tax Rate\n0.1 \n%\n(7.4)\n%\nThe Organization for Economic Co-operation and Development (OECD) published Pillar Two Model Rules defining the global minimum tax, which calls for the taxation of large multinational corporations at a minimum rate of 15% in each jurisdiction in which the group operates. The OECD has since issued administrative guidance providing transition and safe harbor rules around the implementation of the Pillar Two Model Rules. A number of countries, including Ireland, have enacted legislation to implement the core elements of Pillar Two Model Rules, which were effective for Medtronic in fiscal year 2025. \nThe Israeli Central-Lod District Court issued its decision in Medtronic Ventor Technologies Ltd (Ventor) v. Kfar Saba Assessing Office in June 2023. The court determined that there was a deemed taxable transfer of intellectual property. As a result, the Company recorded a $187 million income tax charge during fiscal year 2024 and filed an appeal with the Supreme Court of Israel.\nOur effective tax rate for fiscal year 2025 was 16.6 percent, as compared to 23.4 percent in fiscal year 2024. The decrease in our effective tax rate was primarily attributable to the establishment of a valuation allowance on certain net operating losses and an income tax reserve adjustment made in fiscal year 2024 associated with the Ventor court decision noted above, which was partially offset by the Swiss Cantonal tax rate change on previously recorded deferred tax assets in fiscal year 2024 and the implementation of the Pillar Two Model Rules noted above in fiscal year 2025.\nOur Non-GAAP Nominal Tax Rate for fiscal year 2025 was 16.7 percent, as compared to 16.0 percent in fiscal year 2024. The change in our Non-GAAP Nominal Tax Rate was primarily due to the implementation of the Pillar Two Model Rules and year-over-year changes in operational results by jurisdiction.\nDuring fiscal years 2025 and 2024, operational tax costs were not significant.\nAn increase in our Non-GAAP Nominal Tax Rate of one percent would result in an additional income tax provision for fiscal years 2025 and 2024 of approximately\n \n$85 million and\n \n$83 million, respectively.\nCertain Tax Adjustments\nDuring fiscal year 2025, the cost from certain tax adjustments of $62 million, recognized in \nincome tax provision\n in the consolidated statements of income, included amortization of the previously established deferred tax assets from intercompany intellectual property transactions.\nDuring fiscal year 2024, the net cost from certain tax adjustments of $299 million, recognized in \nincome tax provision\n in the consolidated statements of income, included the following:\n•\nA cost of $187 million associated with a reserve adjustment related to the Israeli Central-Lod District Court decision with respect to a deemed taxable transfer of intellectual property.\n•\nA cost of $124 million related to a change in valuation allowance on previously recorded net operating losses.\n•\nA benefit of $95 million related to a Swiss Cantonal tax rate change on previously recorded deferred tax assets.\n•\nA cost of $50 million associated with the amortization of the previously established deferred tax assets from intercompany intellectual property transactions.\n•\nA cost of $33 million associated with a change in the Company’s permanent reinvestment assertion on certain historical earnings.\n41\nTable of Content\nCertain tax adjustments will affect the comparability of our operating results between periods. Therefore, we consider these Non-GAAP Adjustments. Refer to the \"Executive Level Overview\" section of this Management's Discussion and Analysis for further discussion of these adjustments.\nLIQUIDITY AND CAPITAL RESOURCES\nWe are currently in a strong financial position, and we believe our balance sheet and liquidity as of April 25, 2025 provide us with flexibility, and our cash, cash equivalents, and current investments, along with our credit facility and related commercial paper programs will satisfy our foreseeable operating needs.\nOur liquidity and capital structure are evaluated regularly within the context of our annual operating and strategic planning processes. We consider the liquidity necessary to fund our operations, which includes working capital needs, investments in research and development, property, plant, and equipment, and other operating costs. We also consider capital allocation alternatives that balance returning value to shareholders through dividends and share repurchases, satisfying maturing debt, and acquiring businesses and technology.\nSummary of Cash Flows\nThe following is a summary of cash provided by (used in) operating, investing, and financing activities, the effect of exchange rate changes on cash and cash equivalents, and the net change in cash and cash equivalents:\n \nFiscal Year\n(in millions)\n2025\n2024\nCash provided by (used in):\n \n \nOperating activities\n$\n7,044 \n$\n6,787 \nInvesting activities\n(1,937)\n(2,366)\nFinancing activities\n(4,361)\n(4,450)\nEffect of exchange rate changes on cash and cash equivalents\n188 \n(230)\nNet change in cash and cash equivalents\n$\n934 \n$\n(259)\nOperating Activities\n   The $257 million increase in net cash provided was primarily driven by an increase in cash collected from customers due to an increase in sales, partially offset by an increase in cash paid to vendors, annual incentive payouts, and cash paid for taxes.\nInvesting Activities   \nThe $429 million decrease in net cash used was primarily attributable to an increase in net sales and maturities of investments of $576 million and decrease in cash paid for acquisitions of $113 million, partially offset by an increase in net additions to property, plant, and equipment of $272 million. For more information on the acquisitions, refer to Note 3 of the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nFinancing Activities   \nThere was an $89 million decrease in net cash used compared to the prior fiscal year. In the current period, there was a decrease in total short-term borrowings of $1.1 billion, compared to an increase of $1.1 billion in the prior year. Additionally, in June  2024, Medtronic Inc. issued four tranches of EUR-denominated Senior Notes with an aggregate principal of €3.0 billion, or $3.2 billion, which was partially offset by an $873 million increase in net share repurchases during fiscal year 2025. For more information on Senior Notes issued, refer to the Debt and Capital section below.\nDebt and Capital\nOur capital structure consists of equity and interest-bearing debt. We primarily utilize unsecured senior debt obligations to meet our financing needs and, to a lesser extent, bank borrowings. From time to time, we may repurchase our outstanding debt obligations in the open market or through privately negotiated transactions. \nTotal debt at April 25, 2025 was $28.5 billion, as compared to $25.0 billion at April 26, 2024. The increase in total debt was primarily driven by issuance of Euro-denominated Senior Notes and fluctuations in exchange rates.\nIn June 2024, Medtronic Inc. issued four tranches of EUR-denominated Senior Notes with an aggregate principal of €3.0 billion, with maturities ranging from fiscal year 2030 to 2054, resulting in cash proceeds of approximately $3.2 billion, net of discounts and issuance costs. In anticipation of the Euro-denominated debt issuance, the Company entered into forward currency exchange rate contracts to manage the exposure to exchange rate movements. These contracts were settled in conjunction with the issuance of the June 2024 Notes.\n42\nTable of Content\nWe repurchase our ordinary shares on occasion as part of our focus on returning value to our shareholders. In March 2019, the Company's Board of Directors authorized $6.0 billion for repurchase of the Company's ordinary shares. In March 2024, the Company's Board of Directors authorized an additional $5.0 billion for repurchase of the Company's ordinary shares. There is no specific time period associated with these repurchase authorizations. During fiscal years 2025 and 2024, the Company repurchased a total of 38 million and 25 million shares, respectively, under this program at an average price of $83.36 and $83.04, respectively. At April 25, 2025, we had approximately $2.1 billion remaining under the share repurchase program authorized by our Board of Directors. \nFor more information on credit arrangements, refer to Note 6 of the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nLiquidity\nOur liquidity sources at April 25, 2025 included $2.2 billion of cash and cash equivalents and $6.7 billion of current investments. Additionally, we maintain commercial paper programs and a Credit Facility.\nOur investments primarily include available-for-sale debt securities, including U.S. and non-U.S. government and agency securities, corporate debt securities, mortgage-backed securities, and other asset-backed securities. Refer to Note 5 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K for additional information regarding fair value measurements. \nWe maintain multicurrency commercial paper programs for short-term financing, which allow us to issue unsecured commercial paper notes on a private placement basis up to a maximum aggregate amount outstanding at any time of $3.5 billion. At April 25, 2025 and April 26, 2024, we had no and $1.1 billion of commercial paper outstanding, respectively. The issuance of commercial paper reduces the amount of credit available under our existing line of credit, as explained below.\nWe also have a $3.5 billion five-year syndicated credit facility (Credit Facility), which expires in December 2029. At each anniversary date of the Credit Facility, we can request a one-year extension of the maturity date. The Credit Facility provides backup funding for the commercial paper programs and may also be used for general corporate purposes. The Credit Facility provides us with the ability to increase our borrowing capacity by an additional $1.0 billion at any time during the term of the agreement. At April 25, 2025 and April 26, 2024, no amounts were outstanding under the Credit Facility.\nInterest rates on advances of our Credit Facility are determined by a pricing matrix based on our long-term debt ratings assigned by Standard & Poor's Ratings Services (S&P) and Moody's Investors Service (Moody’s). Facility fees are payable on the Credit Facility and are determined in the same manner as the interest rates. We are in compliance with all covenants related to the Credit Facility.\nThe following table is a summary of our S&P and Moody's long-term debt ratings and short-term debt ratings:\nAgency Rating \n(1)\nApril 25, 2025\nApril 26, 2024\nStandard & Poor's Ratings Services\n   Long-term debt\nA\nA\n   Short-term debt\nA-1\nA-1\nMoody's Investors Service \n   Long-term debt\nA3\nA3\n   Short-term debt\nP-2\nP-2\n(1)    Agency ratings are subject to change, and there may be no assurance that an agency will continue to provide ratings and/or maintain its current ratings. A security rating is not a recommendation to buy, sell or hold securities, and may be subject to revision or withdrawal at any time by the rating agency, and each rating should be evaluated independently of any other rating.\nS&P and Moody's long-term debt ratings and short-term debt ratings at April 25, 2025 were unchanged as compared to the ratings at April 26, 2024. We do not expect the S&P and Moody's ratings to have a significant impact on our liquidity or future flexibility to access additional liquidity given our balance sheet, Credit Facility, and related commercial paper programs.\n43\nTable of Content\nContractual Obligations and Cash Requirements\n \nWe have future contractual obligations and other minimum commercial commitments that are entered into in the normal course of business, some of which are recorded in our consolidated balance sheet. We believe our off-balance sheet arrangements do not have a material current or anticipated future effect on our consolidated earnings, financial position, and/or cash flows.  \nPresented below is a summary of our off-balance sheet contractual obligations and other minimum commercial commitments at April 25, 2025, as well as long-term contractual obligations reflected in the balance sheet at April 25, 2025.\n \nMaturity by Fiscal Year\n(in millions)\nTotal\n2026\n2027\n2028\n2029\n2030\nThereafter\nContractual obligations related to off-balance sheet arrangements:\n \n \n \n \n \n \n \nCommitments to fund minority investments, milestone payments, and royalty obligations\n(1)\n$\n163 \n$\n88 \n$\n38 \n$\n34 \n$\n4 \n$\n— \n$\n— \nInterest payments\n(2)\n8,538 \n639 \n622 \n602 \n616 \n578 \n5,481 \nOther\n(3)\n1,605 \n486 \n364 \n277 \n210 \n178 \n89 \nContractual obligations reflected in the balance sheet\n(4)\n:\n \n \n \n \n \n \n \nDebt obligations\n(5)\n$\n28,691 \n$\n2,874 \n$\n1,721 \n$\n1,006 \n$\n2,290 \n$\n977 \n$\n19,824 \nOperating leases\n1,294 \n218\n \n199\n \n155\n \n119\n \n100\n \n503\n \nContingent consideration\n(6)\n81 \n31 \n36 \n12 \n2 \n— \n— \nTax obligations\n(7)\n550 \n550 \n— \n— \n— \n— \n— \n(1)\nIncludes commitments related to the funding of minority investments, estimated milestone payments, and royalty obligations. While it is not certain if and/or when payments will be made, the maturity dates included in the table reflect our best estimates. \n(2)\nIncludes the contractual interest payments on our outstanding debt and excludes the impacts of debt premium and discount amortization. See Note 6 to the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K for additional information on our debt agreements.\n(3)\nIncludes inventory purchase commitments, research and development, and other arrangements that are legally binding and specify minimum purchase quantities or spending amounts. These purchase commitments do not exceed our projected requirements and are in the normal course of business. Excludes open purchase orders with a remaining term of less than one year.\n(4)\nExcludes defined benefit plan obligations, guarantee obligations, uncertain tax positions, non-current tax liabilities, and litigation settlements for which we cannot make a reliable estimate of the period of cash settlement. For further information, see Notes 13, 15, and 18 to the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\n(5)\nIncludes the current and non-current portion of our contractual maturities of debt, excluding deferred financing costs and debt discounts, net. See Note 6 to the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K for additional information on our debt agreements.\n(6)\nIncludes the fair value of our current and non-current portions of contingent consideration. While it is not certain if and/or when payments will be made, the maturity dates included in this table reflect our best estimates. \n(7)\nRepresents the tax obligations associated with the transition tax that resulted from U.S. Tax Reform. The transition tax will be paid over an eight-year period and will not accrue interest.\nIn the normal course of business, we periodically enter into agreements that require us to indemnify customers or suppliers for specific risks, such as claims for injury or property damage arising as a result of our products or the negligence of our personnel or claims alleging that our products infringe third-party patents or other intellectual property. Our maximum exposure under these indemnification provisions is unable to be estimated, and we have not accrued any liabilities within our consolidated financial statements or included any indemnification provisions in the table above. Historically, we have not experienced significant losses on these types of indemnification agreements. \nNote 18 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K provides information regarding amounts we have accrued related to legal matters. In accordance with U.S. GAAP, we record a liability in our consolidated financial statements for these matters when a loss is known or considered probable and the amount can be reasonably estimated. Actual settlements may be different than estimated and could have a material effect on our consolidated earnings, financial position, and/or cash flows.\nWe record tax liabilities in our consolidated financial statements for amounts that we expect to repatriate from subsidiaries (to the extent the repatriation would be subject to tax); however, no tax liabilities are recorded for amounts we consider to be permanently reinvested. We expect to have access to the majority of our cash flows in the future. In addition, we continue to evaluate our legal entity structure supporting our business operations, and to the extent such evaluation results in a change to our overall business structure, we may be required to accrue for additional tax obligations.\n44\nTable of Content\nAdditionally, we have entered into various arrangements with affiliates of Blackstone Life Sciences Advisors L.L.C. (collectively, \"Blackstone\") to receive funding related to the development of certain products, which may give rise to potential regulatory or commercialization milestone payments and royalties based on a percentage of sales of such products. Payments under these agreements generally become due and payable only upon the achievement of certain development, regulatory and/or commercialization milestones or relevant product sales, which may span several years and which may never occur. These contractual obligations are not included within the table above. Refer to Note 3 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K for additional information.\nBeyond the contractual obligations and other minimum commercial commitments outlined above, we have recurring cash requirements arising from the normal operation of our business that include capital expenditures, research and developments costs, and other operational costs. \nWe believe our balance sheet and liquidity provide us with flexibility, and our cash, cash equivalents, current investments, Credit Facility and related commercial paper programs, as well as our ability to generate operating cash flows, will satisfy our current and future contractual obligations and cash requirements. We regularly review our capital needs and consider various investing and financing alternatives to support our requirements.\nACQUISITIONS AND DISPOSITIONS\nInformation regarding acquisitions and disposition activity is included in Note 3 of the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" within this Annual Report on Form 10-K. In May 2025, we announced our intent to separate the Diabetes business, with the intention to create a new independent, publicly traded company. The separation is expected to be completed within 18 months of the initial announcement. \nCRITICAL ACCOUNTING ESTIMATES\nWe have used various accounting policies to prepare the consolidated financial statements in accordance with U.S. GAAP. Our significant accounting policies are disclosed in Note 1 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K. \nThe preparation of the consolidated financial statements, in conformity with U.S. GAAP, requires us to use judgment in making estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, and expenses. These estimates reflect our best judgment about economic and market conditions and the potential effects on the valuation and/or carrying value of assets and liabilities based upon relevant information available. We base our estimates on historical experience and on various assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. \nOur critical accounting estimates include the following:\nRevenue Recognition\n   Revenue recognition on our products varies depending on the amount of consideration we ultimately receive due to return terms, sales rebates, chargebacks, discounts, and other incentives, which are accounted for as variable consideration. The estimate of variable consideration for rebates and distributor chargebacks is considered critical due to the materiality of the balances and use of estimates. Estimates for rebates are based on sales terms, historical experience, and trend analysis. The Company considers the lag time between the point of sale and payment of the rebate claim, the stated rebate rates, and other relevant information to estimate rebates.\nRevenue adjustments related to distributor chargebacks are the difference between distributor sales price and the end-customer negotiated price. A provision for outstanding chargebacks is recorded when we recognize revenue from our sale to the distributor and requires estimates for the distributor chargeback rate, expected sell-through levels by the distributors to contracted customers, as well as estimated distributor inventory levels. \nAt April 25, 2025 and April 26, 2024, there were $1.7 billion and $1.6 billion of rebates and chargebacks recorded in the consolidated balance sheets, respectively. During fiscal year 2025, adjustments to rebate and chargebacks recorded in prior periods were not material.\nLitigation Contingencies\n   We are involved in a number of legal actions from time to time involving product liability, employment, intellectual property and commercial disputes, shareholder-related matters, environmental proceedings, tax disputes, and governmental proceedings and investigations. The outcomes of legal actions are not within the Company's complete control and may not be known for prolonged periods of time. In some actions, the enforcement agencies or private claimants seek damages, as well as other civil or criminal remedies (including injunctions barring the sale of products that are the subject of the proceeding), that could require significant expenditures, result in lost revenues, or limit the Company's ability to conduct business in the applicable jurisdictions. Estimating probable losses from our litigation and governmental proceedings is inherently difficult, particularly when the matters are in early procedural stages, with incomplete scientific facts or legal discovery, involve unsubstantiated or indeterminate claims for damages, potentially involve penalties, fines, or punitive damages, or could result in a change in business practice. We base our judgments on the best information \n45\nTable of Content\navailable at the time. Our estimates related to our legal and product liability accruals may change as additional information becomes available to us, including information related to the nature or existence of claims against us, trial court or appellate proceedings, and mediation, arbitration or settlement proceedings. Any revision of our estimates of potential liability could have a material impact on our financial position and operating results. Our significant legal proceedings are discussed in Note 18 to the consolidated financial statements in \"Item 8. Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K.\nIncome Tax Reserves  \n We establish reserves when, despite our belief that our tax return positions are fully supportable, we believe that certain positions are likely to be challenged and that we may or may not prevail. Under U.S. GAAP, if we determine that a tax position is more likely than not of being sustained upon audit, based solely on the technical merits of the position, we recognize the benefit. We measure the benefit by determining the amount that is greater than 50 percent likely of being realized upon settlement. We presume that all tax positions will be examined by a taxing authority with full knowledge of all relevant information. The calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax regulations in a multitude of jurisdictions across our global operations. We regularly monitor our tax positions and tax liabilities. We reevaluate the technical merits of our tax positions and recognize an uncertain tax benefit, or derecognize a previously recorded tax benefit, when there is (i) a completion of a tax audit, (ii) effective settlement of an issue, (iii) a change in applicable tax law including a tax case or legislative guidance, or (iv) the expiration of the applicable statute of limitations. These reserves are subject to a high degree of estimation and management judgment. Although we believe that we have adequately reserved for liabilities resulting from tax assessments by taxing authorities, positions taken by these tax authorities could have a material impact on our effective tax rate, consolidated earnings, financial position, and/or cash flows.\nValuation of Intangible Assets and Goodwill   \nWhen we acquire a business, the assets acquired and liabilities assumed are recorded at their respective fair values at the acquisition date. Goodwill is the excess of the purchase price over the estimated fair value of identified net assets of acquired businesses. Intangible assets primarily include patents, trademarks, tradenames, customer relationships, purchased technology, and in-process research and development. Determining the fair value of intangible assets acquired as part of a business combination requires us to make significant estimates. These estimates include the amount and timing of projected future cash flows of each project or technology, the discount rate used to discount those cash flows to present value, and the assessment of the asset’s life cycle. The estimates could be impacted by legal, technical, regulatory, economic, and competitive risks.\nWe have four goodwill reporting units with goodwill assigned to them. We assess the impairment of goodwill at the reporting unit level annually as of the first day of the third quarter and whenever an event occurs or circumstances change that would indicate that the carrying amount may be impaired. The test for impairment of goodwill requires us to make several estimates related to projected future cash flows to determine the fair value of the goodwill reporting units. We estimated the fair value of these reporting units using the income and the market approaches, weighted 50 percent each. Fair value under the income approach was determined by discounting to present value the estimated future cash flows of the reporting unit. Fair value under the market approach utilized revenue and earnings multiples using comparable public company information, which uses valuation indicators determined from other businesses that are similar to our reporting unit. We use estimates that are consistent with the highest and best use of the assets based on a market participant's view of the assets being evaluated.\nThe most critical assumptions used in the calculation of the fair value of each reporting unit are the projected revenue, projected earnings, projected future cash flows, and discount rate. Our forecast of future cash flows is based on estimates of projected revenue and projected earnings, based primarily on pricing, raw material costs, market share, industry outlook, general economic conditions and strategic actions to improve our earnings. The fair value of the reporting unit’s goodwill is sensitive to differences between estimated and actual cash flows, including changes in the projected revenue, projected earnings, and discount rate used to evaluate the fair value of the reporting unit. \nThe following table highlights the sensitivities of the most critical assumptions used in the goodwill impairment test as of the date of our annual testing:\nAssumption:\nApproximate % by which the fair value exceeds the carrying value based on annual impairment test\n20% - 312%\nApproximate % by which the fair value exceeds the carrying value if the discount rate was to increase 1%\n12% - 282%\nApproximate % by which the fair value exceeds the carrying value if the future cash flows in the income approach and revenue and earnings in the market approach were to decrease by 5%\n13% - 290%\nAlthough we believe our estimate of fair value is reasonable, actual results may differ from our estimates due to a number of factors including, among others, changes in competitive conditions, timing of regulatory approval, results of clinical trials, changes in worldwide economic conditions, and fluctuations in currency exchange rates.\nNEW ACCOUNTING PRONOUNCEMENTS\nInformation regarding new accounting pronouncements is included in Note 1 to the consolidated financial statements in “Item 8. Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\n46\nTable of Content\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION \nMedtronic plc and Medtronic Global Holdings S.C.A. (Medtronic Luxco), a wholly-owned subsidiary guarantor, each have provided full and unconditional guarantees of the obligations of Medtronic, Inc., a wholly-owned subsidiary issuer, under the Senior Notes (Medtronic Senior Notes) and full and unconditional guarantees of the obligations of Covidien International Finance S.A. (CIFSA), a wholly-owned subsidiary issuer, under the Senior Notes (CIFSA Senior Notes). The guarantees of the CIFSA Senior Notes are in addition to the guarantees of the CIFSA Senior Notes by Covidien Ltd. and Covidien Group Holdings Ltd., both of which are wholly-owned subsidiary guarantors of the CIFSA Senior Notes. Medtronic plc and Medtronic, Inc. each have provided a full and unconditional guarantee of the obligations of Medtronic Luxco under the Senior Notes (Medtronic Luxco Senior Notes). The following is a summary of these guarantees:\nGuarantees of Medtronic Senior Notes\n•\nParent Company Guarantor - Medtronic plc\n•\nSubsidiary Issuer - Medtronic, Inc.\n•\nSubsidiary Guarantor - Medtronic Luxco\nGuarantees of Medtronic Luxco Senior Notes\n•\nParent Company Guarantor - Medtronic plc\n•\nSubsidiary Issuer - Medtronic Luxco\n•\nSubsidiary Guarantor - Medtronic, Inc.\nGuarantees of CIFSA Senior Notes\n•\nParent Company Guarantor - Medtronic plc\n•\nSubsidiary Issuer - CIFSA\n•\nSubsidiary Guarantors - Medtronic Luxco, Covidien Ltd., and Covidien Group Holdings Ltd. (CIFSA Subsidiary Guarantors)\nThe following tables present summarized financial information for the fiscal year ended April 25, 2025 for the obligor groups of Medtronic and Medtronic Luxco Senior Notes, and CIFSA Senior Notes. The obligor group consists of the parent company guarantor, subsidiary issuer, and subsidiary guarantors for the applicable senior notes. The summarized financial information is presented after elimination of (i) intercompany transactions and balances among the guarantors and issuers and (ii) equity in earnings from and investments in any subsidiary that is a non-guarantor or issuer.\nThe summarized results of operations information for the fiscal year ended April 25, 2025 was as follows:\n(in millions)\nMedtronic & Medtronic Luxco Senior Notes \n(1)\nCIFSA Senior Notes\n (2)\nNet sales\n$\n3,218 \n$\n— \nOperating loss\n(43)\n(57)\nLoss before income taxes\n(719)\n(15)\nNet loss attributable to Medtronic\n(622)\n(12)\nThe summarized balance sheet information for the fiscal year ended April 25, 2025 was as follows:\n(in millions)\nMedtronic & Medtronic Luxco Senior Notes \n(1)\nCIFSA Senior Notes\n (2)\nTotal current assets\n(3)\n$\n18,268 \n$\n4,799 \nTotal noncurrent assets\n(4)\n11,356 \n5,207 \nTotal current liabilities\n(5)\n21,099 \n7,625 \nTotal noncurrent liabilities\n(6)\n38,903 \n25,403 \nNoncontrolling interests\n232 \n232 \n(1)\nThe Medtronic Senior Notes and Medtronic Luxco Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, and Medtronic, Inc. Refer to the guarantee summary above for further details.\n(2)\nThe CIFSA Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, CIFSA, and CIFSA Subsidiary Guarantors. Refer to the guarantee summary above for further details.\n(3)\nIncludes receivables due from non-guarantor subsidiaries of $14.2 billion and $1.3 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(4)\nIncludes loans receivable due from non-guarantor subsidiaries of $5.2 billion and $5.2 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(5)\nIncludes payables due to non-guarantor subsidiaries of $16.0 billion and $4.6 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(6)\nIncludes loans payable due to non-guarantor subsidiaries of $11.3 billion and $7.7 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n47\nTable of Content",
  "item2": null
}