{
  "source_file": "mdt-20251024.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUNDERSTANDING OUR FINANCIAL INFORMATION\nThe following discussion and analysis provides information management believes to be relevant to understanding the financial condition and results of operations of Medtronic plc and its subsidiaries (Medtronic plc, Medtronic, or the Company, or we, us, or our). For a full understanding of financial condition and results of operations, you should read this discussion along with Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the fiscal year ended April 25, 2025. In addition, you should read this discussion along with our consolidated financial statements and related notes thereto at and for the three and six months ended October 24, 2025. Amounts reported in millions within this quarterly report are computed based on the amounts in thousands, and therefore, the sum of the components may not equal the total amount reported in millions due to rounding. Additionally, certain columns and rows within tables may not sum due to rounding. \nFinancial Trends\n \nThroughout this Management’s Discussion and Analysis, we present certain financial measures that facilitate management's review of the operational performance of the Company and as a basis for strategic planning; however, such financial measures are not presented in our financial statements prepared in accordance with accounting principles generally accepted in the United States (U.S.) (U.S. GAAP). These financial measures are considered \"non-GAAP financial measures\" and are intended to supplement, and should not be considered as superior to, financial measures presented in accordance with U.S. GAAP. We believe that non-GAAP financial measures provide information useful to investors in understanding the Company's underlying operational performance and trends and may facilitate comparisons with the performance of other companies in the medical technologies industry. \nAs presented in the GAAP to Non-GAAP Reconciliations section on the following pages, our non-GAAP financial measures exclude the impact of amortization of intangible assets and certain charges or benefits that contribute to or reduce earnings and that may affect financial trends and include certain charges or benefits that result from transactions or events that we believe may or may not recur with similar materiality or impact to our operations in future periods (Non-GAAP Adjustments). \nIn the event there is a Non-GAAP Adjustment recognized in our operating results, the tax cost or benefit attributable to that item is separately calculated and reported. Because the effective rate can be significantly impacted by the Non-GAAP Adjustments that take place during the period, we often refer to our tax rate using both the effective rate and the non-GAAP nominal tax rate (Non-GAAP Nominal Tax Rate). The Non-GAAP Nominal Tax Rate is calculated as the income tax provision, adjusted for the impact of Non-GAAP Adjustments, as a percentage of income before income taxes, excluding Non-GAAP Adjustments. \nFree cash flow is a non-GAAP financial measure calculated by subtracting property, plant, and equipment additions from operating cash flows. \nRefer to the “GAAP to Non-GAAP Reconciliations,\" \"Income Taxes,\" and \"Free Cash Flow\" sections for reconciliations of the non-GAAP financial measures to their most directly comparable financial measures prepared in accordance with U.S. GAAP.\n32\nEXECUTIVE LEVEL OVERVIEW\nMedtronic is the leading global healthcare technology company — alleviating pain, restoring health, and extending life for millions of people around the world. Our primary products include those for cardiac rhythm disorders, cardiovascular disease, neurological disorders and diseases, spinal conditions and musculoskeletal trauma, ear, nose, and throat conditions, urological and digestive disorders, advanced and general surgical care, respiratory and monitoring solutions, and diabetes conditions.\nThe following is a summary of net sales and diluted earnings per share for the three months ended October 24, 2025 and October 25, 2024 and operating cash flow for the six months ended October 24, 2025 and October 25, 2024:\n33\nGAAP to Non-GAAP Reconciliations\nThe tables below present our GAAP to Non-GAAP reconciliations for the three months ended October 24, 2025 and October 25, 2024:\n \nThree months ended October 24, 2025\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome \nTax Provision (Benefit)\nNet Income Attributable to Medtronic\nDiluted EPS\nEffective \nTax Rate\nGAAP\n$\n1,597 \n$\n215 \n$\n1,374 \n$\n1.07 \n13.5 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n(1)\n463 \n87 \n376 \n0.29 \n18.8 \nRestructuring and associated costs\n(2)\n13 \n3 \n9 \n0.01 \n23.1 \nAcquisition and divestiture-related items\n(3)\n— \n9 \n(8)\n(0.01)\n— \n(Gain)/loss on minority investments\n(4)\n24 \n— \n24 \n0.02 \n— \nCertain tax adjustments, net\n(5)\n— \n29 \n(29)\n(0.02)\n— \nNon-GAAP\n$\n2,097 \n$\n344 \n$\n1,746 \n$\n1.36 \n16.4 \n%\n \nThree months ended October 25, 2024\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome \nTax Provision (Benefit)\nNet Income Attributable to Medtronic\nDiluted EPS\nEffective \nTax Rate\nGAAP\n$\n1,559 \n$\n281 \n$\n1,270 \n$\n0.99 \n18.0 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n413 \n75 \n338 \n0.26 \n18.2 \nRestructuring and associated costs\n(2)\n46 \n9 \n37 \n0.03 \n19.6 \nAcquisition and divestiture-related items\n(3)\n(25)\n5 \n(30)\n(0.02)\n(20.0)\n(Gain)/loss on minority investments\n(4)\n(10)\n10 \n(21)\n(0.02)\n(100.0)\nMedical device regulations\n(6)\n12 \n2 \n10 \n0.01 \n16.7 \nCertain tax adjustments, net\n— \n(16)\n16 \n0.01 \n— \nNon-GAAP\n$\n1,995 \n$\n366 \n$\n1,620 \n$\n1.26 \n18.3 \n%\n(1)\nThe Company recognized $46 million of accelerated amortization on certain intangible assets within the Cardiovascular Portfolio. \n(2)\nThe charges primarily relate to employee termination benefits and facility related and contract termination costs.\n(3)\nThe charges primarily include business combination costs, changes in fair value of contingent consideration, exit of business-related charges, and gains related to certain business or asset sales. Exit of business-related charges primarily relate to the impending separation of the Diabetes business and costs associated with the Company's June 2021 decision to stop the distribution and sale of the Medtronic HVAD System.\n(4)\nWe exclude unrealized and realized gains and losses on our minority investments as we do not believe that these components of income or expense have a direct correlation to our ongoing or future business operations.\n(5)\nPrimarily includes a tax benefit recognized due to a change in estimate of accrued interest on uncertain tax positions, partially offset by amortization of previously established deferred tax assets arising from intercompany intellectual property transactions.\n(6)\nThe charges represent incremental costs of complying with the new European Union (E.U.) medical device regulations for previously registered products and primarily include charges for contractors supporting the project and other direct third-party expenses. We consider these costs to be duplicative of previously incurred costs and/or one-time costs.\n \n34\nThe tables below present our GAAP to Non-GAAP reconciliations for the six months ended October 24, 2025 and October 25, 2024:\n \nSix months ended October 24, 2025\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome \nTax Provision (Benefit)\nNet Income attributable to Medtronic\nDiluted EPS\nEffective Tax Rate\nGAAP\n$\n2,898 \n$\n470 \n$\n2,414 \n$\n1.87 \n16.2 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n(1)\n922 \n172 \n750 \n0.58 \n18.7 \nRestructuring and associated costs\n(2)\n79 \n19 \n61 \n0.05 \n24.1 \nAcquisition and divestiture-related items\n(3)\n58 \n18 \n40 \n0.03 \n31.0 \nCertain litigation charges, net\n27 \n6 \n21 \n0.02 \n22.2 \n(Gain)/loss on minority investments\n(4)\n137 \n7 \n130 \n0.10 \n5.1 \nOther\n(5)\n(39)\n(8)\n(30)\n(0.02)\n20.5 \nCertain tax adjustments, net\n(6)\n— \n13 \n(13)\n(0.01)\n— \nNon-GAAP\n$\n4,084 \n$\n698 \n$\n3,372 \n$\n2.62 \n17.1 \n%\n \nSix months ended October 25, 2024\n(in millions, except per share data)\nIncome Before Income Taxes\nIncome \nTax Provision (Benefit)\nNet Income attributable to Medtronic\nDiluted EPS\nEffective Tax Rate\nGAAP\n$\n2,827 \n$\n500 \n$\n2,312 \n$\n1.79 \n17.7 \n%\nNon-GAAP Adjustments:\nAmortization of intangible assets\n827 \n149 \n678 \n0.52 \n18.0 \nRestructuring and associated costs\n(2)\n108 \n21 \n87 \n0.07 \n19.4 \nAcquisition and divestiture-related items\n(3)\n(13)\n6 \n(19)\n(0.01)\n(46.2)\nCertain litigation charges, net\n81 \n13 \n68 \n0.05 \n16.0 \n(Gain)/loss on minority investments\n(4)\n(27)\n10 \n(38)\n(0.03)\n(37.0)\nMedical device regulations\n(7)\n27 \n5 \n22 \n0.02 \n18.5 \nOther\n(5)\n90 \n20 \n70 \n0.05 \n22.2 \nCertain tax adjustments, net\n(6)\n— \n(33)\n33 \n0.03 \n— \nNon-GAAP\n$\n3,921 \n$\n693 \n$\n3,213 \n$\n2.49 \n17.7 \n%\n(1)\nThe Company recognized $91 million of accelerated amortization on certain intangible assets within the Cardiovascular Portfolio.\n(2)\nThe charges primarily relate to employee termination benefits and facility related and contract termination costs. \n(3)\nThe charges primarily include business combination costs, changes in fair value of contingent consideration, exit of business-related charges, and gains related to certain business or asset sales. Exit of business-related charges primarily relate to the impending separation of the Diabetes business and costs associated with the Company's June 2021 decision to stop the distribution and sale of the Medtronic HVAD System.\n(4)\nWe exclude unrealized and realized gains and losses on our minority investments as we do not believe that these components of income or expense have a direct correlation to our ongoing or future business operations.\n(5)\nReflects adjustments to the Company's Italian payback accruals resulting from the two July 22, 2024 rulings by the Constitutional Court and the Legislative Decree published by the Italian government on June 30, 2025 for certain prior years since 2015.\n(6)\nThe net benefit for the six months ended October 24, 2025 primarily includes a tax benefit recognized due to a change in estimate of accrued interest on uncertain tax positions, partially offset by amortization of previously established deferred tax assets arising from intercompany intellectual property transactions. The charges for the six months ended October 25, 2024 includes amortization of previously established deferred tax assets arising from intercompany intellectual property transactions.\n(7)\nThe charges represent incremental costs of complying with the new European Union (E.U.) medical device regulations for previously registered products and primarily include charges for contractors supporting the project and other direct third-party expenses. We consider these costs to be duplicative of previously incurred costs and/or one-time costs.\n35\nFree Cash Flow\nFree cash flow, a non-GAAP financial measure, is calculated by subtracting additions to property, plant, and equipment from net cash provided by operating activities. Management uses this non-GAAP financial measure, in addition to U.S. GAAP financial measures, to evaluate our operating results. Free cash flow should be considered supplemental to, and not a substitute for, our reported financial results prepared in accordance with U.S. GAAP. Reconciliations between net cash provided by operating activities (the most comparable U.S. GAAP measure) and free cash flow are as follows:\nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\nNet cash provided by operating activities\n$\n2,013 \n$\n1,944 \nAdditions to property, plant, and equipment\n(972)\n(924)\nFree cash flow\n$\n1,041 \n$\n1,020 \nRefer to the Summary of Cash Flows section for drivers of the change in cash provided by operating activities.\nMacroeconomic Trends\nLooking ahead, a number of macroeconomic and geopolitical factors could negatively impact our business, including without limitation: \n•\nCompetitive product launches and pricing pressure, geographic macroeconomic developments including changes in global trade policies and fluctuations in currency exchange rates, general price inflation, changes in interest rates, reimbursement challenges, impacts from changes in the mix of our product offerings, delays in product registration approvals, national and provincial tender pricing for certain products, particularly in China, replacement cycle challenges, and supply chain challenges from time to time.\n•\nRecent developments in global trade policy have introduced new uncertainties for our business. The U.S., China, and other jurisdictions have recently imposed or proposed additional tariffs on imported goods. Based on current rates as of November 18, 2025, we estimate the pre-tax net tariff impact to be $185 million in fiscal year 2026, with the majority recognized in the consolidated statements of income in the second half of the fiscal year. The actual amount could vary based on changes in tariff rates, duration of tariffs, scope of tariffs, and potential countermeasures or mitigation actions. While we are taking proactive steps to mitigate the effects of these tariffs, the evolving nature of international trade policy continues to present a risk to our cost structure and financial performance. Further escalation or expansion of trade barriers could have a material adverse effect on our results of operations.\n•\nThe sanctions and other measures being imposed in response to the Russia-Ukraine conflict are having and could continue to have impacts on revenue and supply chain. The financial impact of the conflict for the three and six months ended October 24, 2025, including on accounts receivable and inventory reserves, was not material. For the three and six months ended October 24, 2025, the business of the Company in these countries represented less than 1% of the Company's consolidated revenues and assets.\n•\nAlthough the long-term implications of Israel's conflict are difficult to predict at this time, the financial and operational impact of the conflict for the three and six months ended October 24, 2025, including on accounts receivable and inventory reserves, was not material. As of October 24, 2025, the Company had 6 facilities and approximately 1,300 employees in Israel and the business of the Company represented less than 1% of the Company's consolidated revenues and assets.\n36\nNET SALES\nThe charts below illustrate the percent of net sales by segment for the three months ended October 24, 2025 and October 25, 2024:\nThe table below illustrates net sales by segment and division and market geography for the three and six months ended October 24, 2025 and October 25, 2024:\n \nThree months ended\n \nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\n% Change\nOctober 24, 2025\nOctober 25, 2024\n% Change\nCardiac Rhythm & Heart Failure \n$\n1,825 \n$\n1,578 \n16 \n%\n$\n3,538 \n$\n3,114 \n14 \n%\nStructural Heart & Aortic\n956 \n881 \n9 \n1,885 \n1,736 \n9 \nCoronary & Peripheral Vascular \n655 \n643 \n2 \n1,298 \n1,259 \n3 \nCardiovascular \n3,436 \n3,102 \n11 \n6,721 \n6,108 \n10 \nCranial & Spinal Technologies\n1,299 \n1,234 \n5 \n2,509 \n2,382 \n5 \nSpecialty Therapies\n744 \n737 \n1 \n1,446 \n1,450 \n— \nNeuromodulation\n520 \n480 \n8 \n1,023 \n937 \n9 \nNeuroscience \n2,562 \n2,451 \n5 \n4,978 \n4,768 \n4 \nSurgical & Endoscopy\n1,679 \n1,649 \n2 \n3,291 \n3,193 \n3 \nAcute Care & Monitoring\n493 \n478 \n3 \n964 \n930 \n4 \nMedical Surgical \n2,171 \n2,128 \n2 \n4,255 \n4,123 \n3 \nDiabetes \n757 \n686 \n10 \n1,478 \n1,333 \n11 \nReportable segment net sales\n8,926 \n8,366 \n7 \n17,432 \n16,333 \n7 \nOther operating segment\n(1)\n35 \n37 \n(6)\n68 \n75 \n(9)\nOther adjustments\n(2)\n— \n— \n— \n39 \n(90)\nNM\n(3)\nTotal net sales\n$\n8,961 \n$\n8,403 \n7 \n%\n$\n17,539 \n$\n16,318 \n8 \n%\n37\n \nU.S.\nInternational\nThree months ended\nThree months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\n% Change\nOctober 24, 2025\nOctober 25, 2024\n% Change\nCardiovascular \n$\n1,592 \n$\n1,434 \n11 \n%\n$\n1,844 \n$\n1,668 \n11 \n%\nNeuroscience\n1,730 \n1,677 \n3 \n832 \n774 \n8 \nMedical Surgical\n943 \n944 \n— \n1,228 \n1,183 \n4 \nDiabetes \n230 \n232 \n(1)\n527 \n455 \n16 \nReportable segment net sales\n4,494 \n4,286 \n5 \n4,432 \n4,080 \n9 \nOther operating segment\n(1)\n22 \n18 \n22 \n13 \n19 \n(32)\nTotal net sales\n$\n4,516 \n$\n4,304 \n5 \n%\n$\n4,445 \n$\n4,099 \n8 \n%\n \nU.S.\nInternational\nSix months ended\nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\n% Change\nOctober 24, 2025\nOctober 25, 2024\n% Change\nCardiovascular\n$\n3,071 \n$\n2,836 \n8 \n%\n$\n3,650 \n$\n3,272 \n12 \n%\nNeuroscience\n3,354 \n3,242 \n3 \n1,624 \n1,526 \n6 \nMedical Surgical\n1,827 \n1,825 \n— \n2,427 \n2,298 \n6 \nDiabetes\n447 \n447 \n— \n1,031 \n886 \n16 \nReportable segment net sales\n8,699 \n8,350 \n4 \n8,733 \n7,983 \n9 \nOther operating segment\n(1)\n42 \n37 \n14 \n27 \n38 \n(29)\nOther adjustments\n(2)\n— \n— \n— \n39 \n(90)\nNM\n(3)\nTotal net sales\n$\n8,741 \n$\n8,387 \n4 \n%\n$\n8,799 \n$\n7,931 \n11 \n%\n(1)\nIncludes operations and ongoing transition agreements from businesses the Company has exited or divested.\n(2)\nReflects adjustments to the Company's Italian payback accruals as further described below.\n(3)\nNot meaningful (NM).\nThe increase in net sales for the three and six months ended October 24, 2025, as compared to the corresponding periods in the prior fiscal year, was driven primarily by growth in most businesses, including strong growth in Cardiac Ablation Solutions, TAVR, Neuromodulation, Diabetes, Cardiac Surgery, and Cardiac Pacing Therapies. In addition, the net sales increase was driven by impacts of foreign currency fluctuations and, for the six months ended October 24, 2025, changes in estimates relating to our Italian payback accrual resulting from the two July 2024 rulings by the Constitutional Court and the Legislative Decree published by the Italian government in June 2025 and formalized into law in August 2025 for certain prior years since 2015. For the six months ended October 24, 2025, the impact of the Italian payback adjustment was an increase to net sales of $39 million as compared to a decrease in net sales of $90 million for the six months ended October 25, 2024.\nCardiovascular\nCardiovascular products include pacemakers, insertable cardiac monitors, cardiac resynchronization therapy devices, implantable cardioverter defibrillators, leads and delivery systems, products for the treatment of atrial fibrillation, information systems for the management of patients with Cardiac Rhythm & Heart Failure devices, products designed to reduce surgical site infections, coronary and peripheral stents and related delivery systems, balloons and related delivery systems, endovascular stent graft systems, heart valve replacement technologies, cardiac tissue ablation systems, open heart and coronary bypass grafting surgical products, and renal denervation systems for the treatment of hypertension. Cardiovascular also includes Care Management Services and Cath Lab Managed Services (CLMS) within the Cardiac Rhythm & Heart Failure division. Cardiovascular's net sales for the three and six months ended October 24, 2025 were $3.4 billion and $6.7 billion, respectively, an increase of 11 percent and 10 percent, respectively, as compared to the corresponding periods in the prior fiscal year, resulting from growth across most businesses and the impacts of foreign currency fluctuations. \n38\nThe graphs below illustrate the percent of Cardiovascular net sales by division for the three months ended October 24, 2025 and October 25, 2024:\nCardiac Rhythm & Heart Failure (CRHF) net sales for the three and six months ended October 24, 2025 increased 16 percent and 14 percent, respectively, as compared to the corresponding periods in the prior fiscal year. Cardiac Ablation Solutions experienced strong growth in PulseSelect and Affera Sphere-9 pulsed field ablation with partially offsetting declines in cryoablation. Net sales growth was also due to increases within Cardiac Rhythm Management, driven by growth in Micra leadless pacemakers, Aurora extravascular implantable cardioverter defibrillator (EV-ICD) system, SelectSure 3830 lead, and TYRX. \nStructural Heart & Aortic (SHA) net sales for the three and six months ended October 24, 2025 increased 9 percent for both periods, as compared to the corresponding periods in the prior fiscal year. The net sales increase was driven by growth in Structural Heart from Evolut FX+ TAVR system and in Cardiac Surgery driven by Perfusion and Surgical Valves.\nCoronary & Peripheral Vascular (CPV) net sales for the three and six months ended October 24, 2025 increased 2 percent and 3 percent, respectively, as compared to the corresponding periods in the prior fiscal year. The net sales increase was driven by growth in the Symplicity Spyral renal denervation system, guide catheters and balloons, as well as growth in Peripheral Vascular Health from endovenous. The net sales increase was partially offset by declines in coronary stents.\nIn addition to the macroeconomic and geopolitical factors described in the Executive Level Overview, looking ahead, we expect Cardiovascular could be affected by the following:\n•\nContinued global penetration of our Micra transcatheter pacing portfolio.\n•\nContinued acceptance and growth from the Azure XT and Azure S SureScan pacing systems and the 3830 lead.\n•\nGlobal adoption of Aurora EV-ICD.\n•\nGrowth of the Cobalt and Crome portfolio of ICDs and CRT-Ds. \n•\nGrowth of the CRT-P quadripolar pacing system.\n•\nContinued growth and utilization of the TYRX Envelope for implantable devices. \n•\nContinued use and acceptance of Reveal LINQ and expansion of the LINQ II cardiac monitor.\n•\nContinued acceptance, adoption, and growth of our innovative portfolio of products in the electrophysiology (EP) segment, including the PulseSelect pulsed field ablation system and the Affera mapping and ablation system with Sphere-9 catheter. The Affera mapping and ablation system and Sphere-9 catheter received U.S. FDA approval in late October 2024.\n39\n•\nContinued acceptance and growth of the self-expanding CoreValve Evolut transcatheter aortic valve replacement platform. This includes Evolut PRO which provides enhanced hemodynamics, reliable delivery, enhanced durability, advanced sealing, and Evolut FX, a system designed to improve the overall procedural experience through enhancements in deliverability, implant visibility, and deployment stability. The Evolut FX+ TAVR system maintains the valve performance benefits of the legacy Evolut TAVR platform and is designed to facilitate coronary access. The system was approved by the U.S. FDA in March 2024 and received CE Mark in late October 2024.\n•\nMarket acceptance and reimbursement for the Symplicity Spyral renal denervation system, also known as the Symplicity blood pressure procedure, for the treatment of hypertension. U.S. Centers for Medicare and Medicaid Services (CMS) finalized National Coverage Determination in October 2025.\n•\nMarket acceptance and growth of the Penditure LAA Exclusion System. The system received CE Mark in October 2025.\n•\nContinued acceptance and growth of the Onyx Frontier drug-eluting stent (DES) platform. Onyx Frontier is a DES that introduces an enhanced delivery system and is used for complex percutaneous coronary intervention (PCI).\n•\nAcceptance and growth of IN.PACT 018 drug-coated balloons (DCB). IN.PACT 018 adds to the existing IN.PACT Admiral DCB portfolio and is used to treat femoropopliteal disease.\n•\nMarket acceptance and growth of the Neuroguard IEP Carotid stenting system.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline, including the Liberant mechanical thrombectomy system and Affera Sphere-360 pulsed field ablation single-shot catheter.\nNeuroscience\nNeuroscience's products include various spinal implants, bone graft substitutes, biologic products, image-guided surgery and intra-operative imaging systems, robotic guidance systems used in the robot-assisted spine procedures, and systems that incorporate advanced energy surgical instruments. Neuroscience's products also focus on therapies to treat the diseases of the vasculature in and around the brain, including coils, neurovascular stents, and flow diversion products, as well as products to treat ear, nose, and throat (ENT), and the treatment of overactive bladder and urinary retention. Neuroscience also manufactures products related to implantable neurostimulation therapies and drug delivery systems for the treatment of chronic pain, movement disorders, and epilepsy. Neuroscience’s net sales for the three and six months ended October 24, 2025 were $2.6 billion and $5.0 billion, respectively, an increase of 5 percent and 4 percent, respectively, as compared to the corresponding periods in the prior fiscal year, resulting from growth in Neuromodulation, Cranial and Spinal Technologies, and ENT, and the impacts of foreign currency fluctuations.\n40\nThe graphs below illustrate the percent of Neuroscience net sales by division for the three months ended October 24, 2025 and October 25, 2024:\nCranial & Spinal Technologies (CST) net sales for the three and six months ended October 24, 2025 increased 5 percent for both periods, as compared to the corresponding periods in the prior fiscal year. The net sales increase was driven by the continued adoption of the AiBLE ecosystem of spine implants and enabling technology with growth in Core Spine and Neurosurgery.\nSpecialty Therapies (Specialty) net sales for the three and six months ended October 24, 2025 increased 1 percent and remained flat, respectively, as compared to the corresponding periods in the prior fiscal year. The net sales results were driven by impacts from tender pricing in China and the Pipeline Vantage recall for Neurovascular, offset by growth in ENT. \nNeuromodulation (NM) net sales for the three and six months ended October 24, 2025 increased 8 percent and 9 percent, respectively, as compared to the corresponding periods in the prior fiscal year. The net sales increase was driven by the Inceptiv closed-loop spinal cord stimulator, the Percept RC deep brain neurostimulator, and Interventional.\nIn addition to the macroeconomic and geopolitical factors described in the Executive Level Overview, looking ahead we expect Neuroscience could be affected by the following:\n•\nContinued adoption and growth of our integrated solutions through the AiBLE offering, which integrates spinal implants with enabling technologies (StealthStation, O-arm Imaging Systems, and Midas), Mazor robotics, and UNiD Adaptive Spine Intelligence AI-driven technology for surgical planning and personalized spinal implants.\n•\nMarket acceptance and continued global adoption of innovative spine products and procedural solutions within our CST operating unit, such as Catalyft PL, ModuLeX, CD Horizon Voyager System, and our Infinity OCT System, as well as continued growth from Titan spine titanium interbody implants with Nanolock technology.\n•\nContinued growth of commercially available Pipeline Embolization Devices, endovascular treatments for certain wide-necked brain aneurysms.\n•\nContinued acceptance of the Solitaire X revascularization device for treatment of acute ischemic stroke and our React Catheter and Riptide aspiration system.\n•\nContinued acceptance and growth of our Pelvic Health therapies, including our InterStim therapy with InterStim X and InterStim II recharge-free neurostimulators and InterStim Micro rechargeable neurostimulator for patients suffering from overactive bladder, (non-obtrusive) urinary retention, and chronic fecal incontinence. The Altaviva implantable tibial neuromodulation system received U.S. FDA approval in September 2025 for urge urinary incontinence.\n41\n•\nContinued acceptance and growth of our ENT therapies, including capital equipment sales of the StealthStation ENT surgical navigation system and intraoperative NIM nerve monitoring system, and the Propel sinus implants used in the treatment of chronic rhinosinusitis.\n•\nContinued acceptance and growth from spinal cord stimulation (SCS) therapy for treating chronic pain and Diabetic Peripheral Neuropathy (DPN) on the Inceptiv closed-loop rechargeable neurostimulator, Intellis rechargeable neurostimulator and Vanta recharge-free neurostimulator. The Inceptiv closed-loop rechargeable SCS received U.S. FDA approval in April 2024.\n•\nContinued acceptance and growth of our Percept family of deep brain stimulation (DBS) devices with proprietary BrainSense technology for objectifying and personalizing the treatment of Parkinson's Disease, epilepsy, and other movement disorders. In August 2024, the U.S. FDA approved Asleep DBS surgery for people with Parkinson's and people with essential tremor. BrainSense Adaptive DBS and BrainSense Electrode Identifier received CE Mark in January 2025 and U.S. FDA approval in February 2025.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline, which include the hemorrhagic stroke intravascular device, our next-generation spine enabling technologies, the tibial bladder control stimulator, and the percutaneous tibial neuromodulation system.\nMedical Surgical \nMedical Surgical’s products span the entire continuum of patient care from diagnosis to recovery, with a focus on diseases of the gastrointestinal tract, lungs, pelvic region, obesity, and preventable complications. The products include those for advanced and general surgical products, surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, hernia mechanical devices, mesh implants, advanced ablation, interventional lung, airway products, and sensors and monitors for pulse oximetry, capnography, level of consciousness and cerebral oximetry. Medical Surgical's net sales for the three and six months ended October 24, 2025 were $2.2 billion and $4.3 billion, respectively, an increase of 2 percent and 3 percent, respectively, as compared to the corresponding periods in the prior fiscal year, resulting from growth in Advanced Energy, Acute Care & Monitoring, Endoscopy, and the impacts of foreign currency fluctuations. \nThe graphs below illustrate the percent of Medical Surgical net sales by division for the three months ended October 24, 2025 and October 25, 2024:\n42\nSurgical & Endoscopy (SE) net sales for the three and six months ended October 24, 2025 increased 2 percent and 3 percent, respectively as compared to the corresponding periods in the prior fiscal year. The net sales increase was primarily due to growth in LigaSure vessel sealing technology, ProGrip self-gripping polyester mesh, Electrosurgery, and Esophageal. The net sales increase was also driven by international growth in Surgical Robotics partially offset by Advanced Stapling due to pressures on the U.S. bariatric segment and continued shifts to robotic surgery.\nAcute Care & Monitoring (ACM) net sales for the three and six months ended October 24, 2025 increased 3 percent and 4 percent, respectively, as compared to the corresponding periods in the prior fiscal year. The net sales increase was primarily due to growth in Nellcor pulse oximetry and Airways from growth of the McGRATH MAC video laryngoscope.\nIn addition to the macroeconomic and geopolitical factors described in the Executive Level Overview, looking ahead we expect Medical Surgical could be affected by the following:\n•\nAcceptance and continued growth of Open-to-MIS (minimally invasive surgery) techniques and tools through our efforts to transition open surgery to MIS. Open-to-MIS initiative focuses on capturing the market opportunity that exists in transitioning open procedures to MIS, whether through traditional MIS, advanced instrumentation, or robotics. Through our approach, in parallel, we also expand our presence and optimize open surgery in current open surgery markets.\n•\nContinued global acceptance and future growth of powered stapling and energy platform.\n•\nOur ability to execute ongoing strategies addressing the pressures to bariatric surgery procedure volumes in the U.S. from pharmaceuticals, and growth of surgical soft tissue robotics procedures in the U.S.\n•\nOur ability to create markets and drive products and procedures into emerging markets with our high quality and cost-effective surgical products designed for customers in emerging markets. \n•\nContinued acceptance and growth in patient monitoring and airway management. Key products in this area include Microstream Capnography, Nellcor pulse oximetry system with OxiMax technology, Shiley tracheostomy and endotracheal tubes, and McGRATH MAC video laryngoscopes.\n•\nAcceptance of less invasive standards of care in chronic and colorectal, as well as hepatology products, including products that span the care continuum from diagnostics to therapeutics.\n•\nExpanding the use of less invasive treatments and furthering our commitment to improving options for women with abnormal uterine bleeding. Our expanded and strengthened surgical offerings complement our global gynecology business.\n•\nGlobal adoption of robotic-assisted surgery and the safe and effective use of the Hugo robotic assisted surgery (RAS) system, including system reliability and acceptability, for urologic, bariatric, gynecologic, hernia, and general surgery procedures. This includes continued integration and adoption of Touch Surgery Enterprise with the first artificial intelligence powered surgical videos and analytics platform to make it easier to train and discover new techniques within the robotics platform. The Hugo RAS system, which received CE Mark in October 2021, as well as secured additional regulatory approvals outside the U.S., is designed to help reduce unwanted variability, improve patient outcomes, and, by extension, lower per procedure cost. LigaSure RAS vessel-sealing technology received CE Mark in July 2025, expanding Hugo RAS system capabilities for gynecologic, general, and urologic procedures.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval of, and commercialize the products within our pipeline, which include our Hugo RAS system in the U.S., the adoption of AI in Endoscopy and Digital Surgical Technologies, Signia powered stapling devices, and our next-gen Ligasure and Sonicision vessel sealing devices.\nDiabetes\nDiabetes' products include insulin pumps, continuous glucose monitoring (CGM) systems, and consumables. Diabetes' net sales for the three and six months ended October 24, 2025 were $757 million and $1.5 billion, respectively, an increase of 10 percent and 11 percent, respectively, as compared to the corresponding periods in the prior fiscal year. The increase in net sales was primarily driven by strong international growth due to the continued adoption of the MiniMed 780G AID system, including the Simplera Sync and Guardian 4 CGM sensors and Extended Infusion Sets, and the impacts of foreign currency fluctuations.\n43\nIn addition to the macroeconomic and geopolitical factors described in the Executive Level Overview, looking ahead we expect Diabetes could be affected by the following:\n•\nThe pending separation of the Diabetes business from the Company. In May 2025, the Company announced its intent to separate the Diabetes Operating Unit into a new standalone company, and its expectation to complete the separation within 18 months from the announcement date.\n•\nContinued acceptance and growth for the MiniMed 780G insulin pump system, available with Simplera Sync, Guardian 4 CGM sensor, and the Abbott Instinct sensor, which received U.S. FDA approval for use with the SmartGuard dosing algorithm in September 2025. The MiniMed 780G insulin pump system received FDA approval for use in adults 18+ with insulin-requiring type 2 diabetes and CE Mark for expanded indications for use by children as young as two, during pregnancy, as well as type 2 insulin-requiring diabetes in 2025.\n•\nMarket acceptance and growth of our sensor Simplera, which received U.S FDA approval in August 2024 and CE Mark in September 2023.\n•\nContinued acceptance and growth of the Guardian Connect CGM system, which displays glucose information directly to a smartphone to provide patients access to their glucose levels seamlessly and discretely. The Guardian Connect CGM system is available on both Apple iOS and Android devices.\n•\nMarket acceptance and growth of our InPen smart pen system, which allows users to have their Medtronic CGM readings in real-time alongside insulin dose information, all in one view.\n•\nContinued pump, CGM, and consumable competition in an expanding global market.\n•\nChanges in medical reimbursement policies and programs, along with additional payor coverage on insulin pumps.\n•\nOur ability to meet growing demand for our existing products and to successfully develop, obtain regulatory approval, manufacture and commercialize the products within our pipeline, including our partnership with Abbott to expand CGM options for people living with diabetes, our next generation insulin delivery options, as well as expanded labeling in Type 2 diabetes, and fast acting insulins.\n44\nCOSTS AND EXPENSES\nThe following is a summary of cost of products sold, research and development, and selling, general, and administrative expenses as a percent of net sales for the three and six months ended October 24, 2025 and October 25, 2024:\nCost of Products Sold\n   Cost of products sold for the three and six months ended October 24, 2025 was $3.1 billion and $6.1 billion, respectively, as compared to $2.9 billion and $5.7 billion, respectively, for the corresponding periods in the prior fiscal year. The decrease in cost of products sold as a percentage of net sales for the three and six months ended October 24, 2025 was primarily due to favorable currency impact on cost of products sold and net sales in addition to changes in the Italian payback accruals impacting net sales for the six months ended October 24, 2025 and October 25, 2024, partially offset by increased duties from tariffs on imported goods.\nResearch and Development Expense   \nWe remain committed to deliver the best possible experiences for patients, physicians, and caregivers we serve; to create technologies that expand what’s possible across the human body to transform lives; to turn data and insights into real action to serve patient needs, improving care; and to expand healthcare access and deliver positive outcomes. Research and development expense for the three and six months ended October 24, 2025 was $754 million and $1.5 billion, respectively, as compared to $697 million and $1.4 billion, respectively, for the corresponding periods in the prior fiscal year.\nSelling, General, and Administrative Expense   \nOur goal is to continue to leverage selling, general, and administrative expense management initiatives. Selling, general, and administrative expense primarily consists of salaries and wages, other administrative costs, such as professional fees and marketing expenses, and certain acquisition and divestiture-related costs. Selling, general, and administrative expense for the three and six months ended October 24, 2025 was $3.0 billion and $5.8 billion, respectively, as compared to $2.8 billion and $5.4 billion, respectively, for the corresponding periods in the prior fiscal year. The increase in selling, general, and administrative expense was primarily due to increased selling expenses in line with sales growth, new product launches and related commercialization activities, increased incentive performance in the current year, and increased expenses to support the impending separation of the Diabetes Operating Unit.\nThe following is a summary of other costs and expenses (income):\nThree months ended\nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\nOctober 24, 2025\nOctober 25, 2024\nAmortization of intangible assets\n$\n463 \n$\n413 \n$\n922 \n$\n827 \nRestructuring charges, net\n10 \n30 \n55 \n77 \nCertain litigation charges, net\n— \n— \n27 \n81 \nOther operating expense (income), net\n22 \n(34)\n92 \n(33)\nOther non-operating income, net\n(92)\n(173)\n(125)\n(330)\nInterest expense, net\n181 \n209 \n357 \n376 \nAmortization of Intangible Assets   \nAmortization of intangible assets includes the amortization expense of our definite-lived intangible assets, consisting of customer relationships, purchased technology and patents, trademarks, tradenames, and other intangible assets. \n45\nFor the three months and six months ended October 24, 2025, the Company recognized $46 million and $91 million, respectively, of accelerated amortization on certain intangible assets within the Cardiovascular Segment.\nRestructuring Charges, Net   \nFor the three and six months ended October 24, 2025 and October 25, 2024, restructuring costs primarily consist of employee termination benefits.\nFor additional information about our restructuring activities, refer to Note 5 to the current period's consolidated financial statements.\nCertain Litigation Charges, Net   \nWe classify specified certain litigation charges and gains related to significant legal matters as \ncertain litigation charges, net \nin the consolidated statements of income. For additional information, refer to Note 16 in the current period's consolidated financial statements. \nOther Operating Expense (Income), Net   \nOther operating expense (income), net\n primarily includes expenses associated with royalties paid for the in-license of intellectual property from third parties, currency remeasurement and derivative gains and losses, changes in the fair value of contingent consideration, certain acquisition and divestiture-related items, and income from funded research and development arrangements.\nFor the three and six months ended October 24, 2025, the change in \nother operating expense (income), net\n was largely driven by the net impact of currency remeasurement and our hedging programs resulting in a net loss of $69 million and $132 million, respectively, as compared to a net loss of $39 million and $44 million, respectively, in the corresponding periods in the prior fiscal year.\nOther Non-Operating Income, Net   \nOther non-operating income, net\n includes the non-service component of net periodic pension and postretirement benefit cost, investment gains and losses, and interest income, which includes income on marketable debt securities and our global liquidity structures.\nInterest income for the three and six months ended October 24, 2025 was $89 million and $208 million, respectively, as compared to $137 million and $249 million, respectively, for the corresponding periods in the prior fiscal year. The decrease in interest income was primarily driven by changes in our global liquidity structures. For the three and six months ended October 24, 2025, net losses on minority investments were $24 million and $137 million, respectively, as compared to net gains of $10 million and $27 million, respectively, for the corresponding periods in the prior fiscal year. \nInterest Expense, Net   \nInterest expense, net includes interest incurred on our outstanding borrowings, global liquidity structures, amortization of debt issuance costs and debt premiums or discounts, and amortization of amounts excluded from the effectiveness assessment of certain net investment and fair value hedges.\nFor the three and six months ended October 24, 2025, the decrease in interest expense, net was largely driven by changes in our global liquidity structures.\nINCOME TAXES\nThree months ended\nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\nOctober 24, 2025\nOctober 25, 2024\nIncome tax provision\n$\n215 \n$\n281 \n$\n470 \n$\n500 \nIncome before income taxes\n1,597 \n1,559 \n2,898 \n2,827 \nEffective tax rate\n13.5 \n%\n18.0 \n%\n16.2 \n%\n17.7 \n%\nNon-GAAP income tax provision\n$\n344 \n$\n366 \n$\n698 \n$\n693 \nNon-GAAP income before income taxes\n2,097 \n1,995 \n4,084 \n3,921 \nNon-GAAP Nominal Tax Rate\n16.4 \n%\n18.3 \n%\n17.1 \n%\n17.7 \n%\nDifference between the effective tax rate and Non-GAAP Nominal Tax Rate\n2.9 \n%\n0.3 \n%\n0.9 \n%\n— \n%\nOn July 4, 2025, the U.S. Government enacted The One Big Beautiful Bill Act of 2025, which includes, among other provisions, changes to the U.S. corporate income tax system including the allowance of immediate expensing of qualifying research and development expenses and permanent extensions of certain provisions within the Tax Cuts and Jobs Act. Certain provisions are effective for the Company beginning fiscal year 2026. The impact for the three and six months ended October 24, 2025 was not significant, and impacts to fiscal year 2026 and beyond are not expected to be significant.\n46\nThe Organization for Economic Co-operation and Development (OECD) published Pillar Two Model Rules defining the global minimum tax, which calls for the taxation of large multinational corporations at a minimum rate of 15% in each jurisdiction in which the group operates. The OECD has since issued administrative guidance providing transition and safe harbor rules around the implementation of the Pillar Two global minimum tax. A number of countries, including Ireland, have enacted legislation to implement the core elements of Pillar Two, which were effective for the Company in fiscal year 2025.\nOur effective tax rate for the three and six months ended October 24, 2025 was 13.5% and 16.2%, respectively, as compared to 18.0% and 17.7% for the three and six months ended October 25, 2024, respectively. The decrease in the effective tax rate for both periods primarily relates to a tax benefit recognized during the three months ended October 24, 2025 related to a change in estimate of accrued interest on uncertain tax positions partially offset by an increase in the Pillar Two global minimum tax impact and year-over-year changes in operational results by jurisdiction.\nOur Non-GAAP Nominal Tax Rate for the three and six months ended October 24, 2025 was 16.4% and 17.1%, respectively, as compared to 18.3% and 17.7% for the three and six months ended October 25, 2024, respectively. The decrease in our Non-GAAP Nominal Tax Rate for both periods was primarily due to a tax benefit recognized during the three months ended October 24, 2025 related to a change in estimate of accrued interest on uncertain tax positions partially offset by an increase in the Pillar Two global minimum tax impact and year-over-year changes in operational results. An increase in our Non-GAAP Nominal Tax Rate of 1 percent would result in an additional income tax provision for the three and six months ended October 24, 2025 of approximately $21 million and $41 million, respectively.\nLIQUIDITY AND CAPITAL RESOURCES\nWe are currently in a strong financial position, and we believe our balance sheet and liquidity as of October 24, 2025, provide us with flexibility, and our cash, cash equivalents, and current investments, along with our credit facility and related commercial paper programs will satisfy our foreseeable operating needs.\nOur liquidity and capital structures are evaluated regularly within the context of our annual operating and strategic planning processes. We consider the liquidity necessary to fund our operations, which includes working capital needs, investments in research and development, property, plant, and equipment, and other operating costs. We also consider capital allocation alternatives that balance returning value to shareholders through dividends and share repurchases, satisfying maturing debt, and acquiring businesses and technology.\nSummary of Cash Flows\nThe following is a summary of cash provided by (used in) operating, investing, and financing activities, the effect of exchange rate changes on cash and cash equivalents, and the net change in cash and cash equivalents:\n \nSix months ended\n(in millions)\nOctober 24, 2025\nOctober 25, 2024\nCash provided by (used in):\n \n \nOperating activities\n$\n2,013 \n$\n1,944 \nInvesting activities\n(1,201)\n(604)\nFinancing activities\n(1,776)\n(1,265)\nEffect of exchange rate changes on cash and cash equivalents\n28 \n35 \nNet change in cash and cash equivalents\n$\n(936)\n$\n110 \nOperating Activities \n  The $69 million increase in net cash provided was primarily driven by an increase in cash collected from customers due to an increase in sales, partially offset by an increase in cash paid to suppliers and certain litigation payments. \nInvesting Activities   \nThe $597 million increase in cash used was primarily attributable to an increase in net purchases of investments of $562 million. \nFinancing Activities\n \n  There was a $511 million increase in net cash used during the six months ended October 24, 2025, as compared to the corresponding period in the prior fiscal year. \nDuring the six months ended October 24, 2025, the Company issued two tranches of Euro-denominated Senior Notes with an aggregate principal of €1.5 billion, or $1.7 billion. The Company used the net proceeds to repay in full €1.5 billion, or $1.8 billion, of Senior Notes. Further, in July 2025, the Company repaid at maturity €1.0 billion, or $1.2 billion, of Senior Notes. During the six months ended October 25, 2024, the Company issued four tranches of Euro-denominated Senior Notes with an aggregate principal of €3.0 billion, or $3.2 billion, partially offset by net share repurchases of $2.6 billion. The above changes were partially offset by an increase in short-term borrowings of $1.4 billion as compared to a decrease of $67 million in the prior year. For more information on commercial paper and Senior Notes issued and repaid, refer to the Debt and Capital section below.\n47\nDebt and Capital \nOur capital structure consists of equity and interest-bearing debt. We primarily utilize unsecured senior debt obligations to meet our financing needs and, to a lesser extent, bank borrowings. From time to time, we may repurchase our outstanding debt obligations in the open market or through privately negotiated transactions.\nTotal debt at October 24, 2025 was $29.1 billion as compared to $28.5 billion at April 25, 2025. The increase in total debt was primarily driven by the increase in commercial paper outstanding and the impact of foreign exchange rates on our foreign currency denominated debt. This was partially offset by repayments of Euro-denominated debt, net of issuances, as discussed below.\nIn September 2025, Medtronic, Inc. issued two tranches of Euro-denominated Senior Notes with an aggregate principal of €1.5 billion, with maturities in fiscal year 2031 and 2046, resulting in cash proceeds of approximately $1.7 billion, net of discounts and issuance costs. The Company used the net proceeds to repay at maturity €500 million of Medtronic Luxco’s 2.625% Senior Notes for $587 million in September 2025 and €1.0 billion of Medtronic Luxco's 0.000% Senior Notes for $1.2 billion in October 2025. Further, in July 2025, the Company repaid at maturity €1.0 billion, or $1.2 billion, of Senior Notes.\nIn June 2024, Medtronic, Inc. issued four tranches of Euro-denominated Senior Notes with an aggregate principal of €3.0 billion, with maturities ranging from fiscal year 2030 to 2054, resulting in cash proceeds of approximately $3.2 billion, net of discounts and issuance costs. In anticipation of the Euro-denominated debt issuance, the Company entered into forward currency exchange rate contracts to manage the exposure to exchange rate movements. These contracts were settled in conjunction with the issuance of the June 2024 Notes.\nWe repurchase our ordinary shares on occasion as part of our focus on returning value to our shareholders. In March 2024, the Company's Board of Directors authorized the repurchase of $5.0 billion of the Company's ordinary shares. There is no specific time period associated with these repurchase authorizations. During the six months ended October 24, 2025, the Company repurchased a total of 5 million shares under this program at an average price of $91.37. At October 24, 2025, we had approximately $1.7 billion remaining under the share repurchase program authorized by our Board of Directors. \nFor more information on credit arrangements, refer to Note 7 to the current period's consolidated financial statements and Note 6 to the consolidated financial statements included in our Annual Report on Form 10-K for the fiscal year ended April 25, 2025.\nLiquidity\nOur liquidity sources at October 24, 2025 included $1.3 billion of cash and cash equivalents and $7.0 billion of current investments. Additionally, we maintain commercial paper programs and a Credit Facility. \nOur investments primarily include available-for-sale debt securities, including U.S. and non-U.S. government and agency securities, corporate debt securities, mortgage-backed securities, and other asset-backed securities. Refer to Note 6 to the current period's consolidated financial statements for additional information regarding fair value measurements.\nWe maintain multicurrency commercial paper programs for short-term financing, which allow us to issue unsecured commercial paper notes on a private placement basis up to a maximum aggregate amount outstanding at any time of $3.5 billion. At October 24, 2025 and April 25, 2025, we had $1.4 billion and no commercial paper outstanding, respectively. The issuance of commercial paper reduces the amount of credit available under our existing line of credit, as explained below.\nWe also have a $3.5 billion five-year syndicated credit facility (Credit Facility), which expires in December 2029. At each anniversary date of the Credit Facility we can request a one-year extension of the maturity date. The Credit Facility provides backup funding for the commercial paper programs and may also be used for general corporate purposes. The Credit Facility provides us with the ability to increase our borrowing capacity by an additional $1.0 billion at any time during the term of the agreement. At October 24, 2025 and April 25, 2025, no amounts were outstanding under the Credit Facility.\nInterest rates on advances of our Credit Facility are determined by a pricing matrix based on our long-term debt ratings assigned by Standard & Poor's Ratings Services (S&P) and Moody's Investors Service (Moody’s). Facility fees are payable on the Credit Facility and are determined in the same manner as the interest rates. We are in compliance with all covenants related to the Credit Facility.\n48\nThe following table is a summary of our S&P and Moody's long-term debt ratings and short-term debt ratings:\nAgency Rating\n(1)\nOctober 24, 2025\nApril 25, 2025\nStandard & Poor's Ratings Services\n   Long-term debt\nA\nA\n   Short-term debt\nA-1\nA-1\nMoody's Investors Service\n   Long-term debt\nA3\nA3\n   Short-term debt\nP-2\nP-2\n(1)\nAgency ratings are subject to change, and there may be no assurance that an agency will continue to provide ratings and/or maintain its current ratings. A security rating is not a recommendation to buy, sell or hold securities, and may be subject to revision or withdrawal at any time by the rating agency, and each rating should be evaluated independently of any other rating. \nS&P and Moody's long-term debt ratings and short-term debt ratings at October 24, 2025 were unchanged as compared to the ratings at April 25, 2025. We do not expect the S&P and Moody's ratings to have a significant impact on our liquidity or future flexibility to access additional liquidity given our balance sheet, Credit Facility, and related commercial paper programs.\nWe have future contractual obligations and other minimum commercial commitments that are entered into in the normal course of business. We believe our off-balance sheet arrangements do not have a material current or anticipated future effect on our consolidated earnings, financial position, and/or cash flows. Refer to the Debt and Capital section above for changes in debt obligations during the first two quarters of fiscal year 2026; there have been no other material changes to our long-term contractual obligations as reported in our most recent Annual Report filed on Form 10-K for the fiscal year ended April 25, 2025.\nACQUISITIONS AND DISPOSITIONS\nInformation regarding acquisitions and disposition activity is included in Note 4 to the current period's consolidated financial statements. In May 2025, we announced our intent to separate the Diabetes business, with the intention to create a new independent, publicly traded company. The separation is expected to be completed within 18 months of the initial announcement.\nGOODWILL\nInformation regarding goodwill is included in Note 10 to the current period's consolidated financial statements.\nCRITICAL ACCOUNTING ESTIMATES\nWe have used various accounting policies to prepare the consolidated financial statements in accordance with U.S. GAAP. Our significant accounting policies are disclosed in Note 1 to the consolidated financial statements included in our Annual Report on Form 10-K for the fiscal year ended April 25, 2025.\nThe preparation of the consolidated financial statements, in conformity with U.S. GAAP, requires us to use judgment in making estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, and expenses. These estimates reflect our best judgment about economic and market conditions and the potential effects on the valuation and/or carrying value of assets and liabilities based upon relevant information available. We base our estimates on historical experience and on various assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. \nAs of October 24, 2025, there were no material changes to our critical accounting estimates. \nNEW ACCOUNTING PRONOUNCEMENTS\nInformation regarding new accounting pronouncements is included in Note 2 to the current period's consolidated financial statements.\n49\nSUPPLEMENTAL GUARANTOR FINANCIAL INFORMATION\nMedtronic plc and Medtronic Global Holdings S.C.A. (Medtronic Luxco), a wholly-owned subsidiary guarantor, each have provided full and unconditional guarantees of the obligations of Medtronic, Inc., a wholly-owned subsidiary issuer, under the Senior Notes (Medtronic Senior Notes) and full and unconditional guarantees of the obligations of Covidien International Finance S.A. (CIFSA), a wholly-owned subsidiary issuer, under the Senior Notes (CIFSA Senior Notes). The guarantees of the CIFSA Senior Notes are in addition to the guarantees of the CIFSA Senior Notes by Covidien Ltd. and Covidien Group Holdings Ltd., both of which are wholly-owned subsidiary guarantors of the CIFSA Senior Notes. Medtronic plc and Medtronic, Inc. each have provided a full and unconditional guarantee of the obligations of Medtronic Luxco under the Senior Notes (Medtronic Luxco Senior Notes). The following is a summary of these guarantees:\nGuarantees of Medtronic Senior Notes\n•\nParent Company Guarantor – Medtronic plc\n•\nSubsidiary Issuer – Medtronic, Inc.\n•\nSubsidiary Guarantor – Medtronic Luxco\nGuarantees of Medtronic Luxco Senior Notes\n•\nParent Company Guarantor – Medtronic plc\n•\nSubsidiary Issuer – Medtronic Luxco\n•\nSubsidiary Guarantor – Medtronic, Inc.\nGuarantees of CIFSA Senior Notes\n•\nParent Company Guarantor – Medtronic plc\n•\nSubsidiary Issuer – CIFSA\n•\nSubsidiary Guarantors – Medtronic Luxco, Covidien Ltd., and Covidien Group Holdings Ltd. (CIFSA Subsidiary Guarantors)\nThe following tables present summarized financial information for the six months ended October 24, 2025 and summarized balance sheet information at October 24, 2025 and April 25, 2025 for the obligor groups of Medtronic and Medtronic Luxco Senior Notes, and CIFSA Senior Notes. The obligor group consists of the parent company guarantor, subsidiary issuer, and subsidiary guarantors for the applicable senior notes. The summarized financial information is presented after elimination of (i) intercompany transactions and balances among the guarantors and issuers and (ii) equity in earnings from and investments in any subsidiary that is a non-guarantor or issuer. \n50\nThe summarized results of operations information for the six months ended October 24, 2025 was as follows:\n(in millions)\nMedtronic & Medtronic Luxco Senior Notes \n(1)\nCIFSA Senior Notes\n (2)\nNet sales\n$\n1,513 \n$\n— \nOperating profit (loss)\n197 \n5 \nLoss before income taxes\n(69)\n(47)\nNet loss attributable to Medtronic\n(68)\n(89)\nThe summarized balance sheet information at October 24, 2025 was as follows:\n(in millions)\nMedtronic & Medtronic Luxco Senior Notes \n(1)\nCIFSA Senior Notes\n (2)\nTotal current assets\n(3)\n$\n19,387 \n$\n4,399 \nTotal noncurrent assets\n(4)\n11,813 \n5,121 \nTotal current liabilities\n(5)\n28,786 \n12,325 \nTotal noncurrent liabilities\n(6)\n38,660 \n25,710 \nNoncontrolling interests\n204 \n204 \n(1)\nThe Medtronic Senior Notes and Medtronic Luxco Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, and Medtronic, Inc. Refer to the guarantee summary above for further details.\n(2)\nThe CIFSA Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, CIFSA, and CIFSA Subsidiary Guarantors. Refer to the guarantee summary above for further details.\n(3)\nIncludes receivables due from non-guarantor subsidiaries of $16.1 billion and $1.8 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(4)\nIncludes loans receivable due from non-guarantor subsidiaries of $5.0 billion and $4.9 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(5)\nIncludes payables due to non-guarantor subsidiaries of $25.3 billion and $10.7 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(6)\nIncludes loans payable due to non-guarantor subsidiaries of $9.0 billion and $7.7 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\nThe summarized balance sheet information at April 25, 2025 was as follows:\n(in millions)\nMedtronic & Medtronic Luxco Senior Notes \n(1)\nCIFSA Senior Notes\n (2)\nTotal current assets\n(3)\n$\n18,268 \n$\n4,799 \nTotal noncurrent assets\n(4)\n11,356 \n5,207 \nTotal current liabilities\n(5)\n21,099 \n7,625 \nTotal noncurrent liabilities\n(6)\n38,903 \n25,403 \nNoncontrolling interests\n232 \n232 \n(1)\nThe Medtronic Senior Notes and Medtronic Luxco Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, and Medtronic, Inc. Refer to the guarantee summary above for further details.\n(2)\nThe CIFSA Senior Notes obligor group consists of the following entities: Medtronic plc, Medtronic Luxco, CIFSA, and CIFSA Subsidiary Guarantors. Refer to the guarantee summary above for further details.\n(3)\nIncludes receivables due from non-guarantor subsidiaries of $14.2 billion and $1.3 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(4)\nIncludes loans receivable due from non-guarantor subsidiaries of $5.2 billion and $5.2 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(5)\nIncludes payables due to non-guarantor subsidiaries of $16.0 billion and $4.6 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n(6)\nIncludes loans payable due to non-guarantor subsidiaries of $11.3 billion and $7.7 billion for Medtronic & Medtronic Luxco Senior Notes, and CIFSA Senior Notes, respectively.\n51\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q, and other written reports of Medtronic plc, organized under the laws of Ireland (together with its consolidated subsidiaries, Medtronic, the Company, or we, us, or our), and oral statements made by or with the approval of one of the Company’s executive officers from time to time, may include “forward-looking” statements. All statements other than statements of historical fact contained in this Quarterly Report on Form 10-Q, including statements regarding our future results of operations and financial position, business strategy and plans, objectives of management for future operations and current expectations or forecasts of future results, are forward-looking statements. These statements involve known and unknown risks, uncertainties, and other important factors that may cause our actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by the forward-looking statements. Our forward-looking statements may include statements related to: our growth and growth strategies; developments in the markets for our products, therapies and services; financial results; product development launches and effectiveness; research and development strategy; regulatory approvals; competitive strengths; the potential or anticipated direct or indirect impact of public health crises, geopolitical conflicts, or changing governmental executive actions and regulations (including relating to global trade policies, enforcement priorities and compliance requirements), on our business, results of operations and/or financial condition; restructuring and cost-saving initiatives; intellectual property rights; litigation and tax matters; governmental proceedings and investigations; mergers, acquisitions, and divestitures; market acceptance of our products, therapies and services; accounting estimates; financing activities; ongoing contractual obligations; working capital adequacy; the value of our investments; our effective tax rate; our expected returns to shareholders; and sales efforts. In some cases, such statements may be identified by the use of terminology such as “anticipate,” “believe,” “could,” “estimate,” “expect,” “forecast,” “intend,” “looking ahead,” “may,” “plan,” “possible,” “potential,” “project,” “should,” “will,” and similar words or expressions. Forward-looking statements in this Quarterly Report include, but are not limited to, statements regarding: our ability to drive long-term shareholder value; development and future launches of products and continued or future acceptance of products, therapies and services in our segments; expected timing for completion of research studies relating to our products; integration of new technologies, including artificial intelligence (AI) and data analytics, into our products, therapies and services; market positioning and performance of our products, including stabilization of certain product markets; divestitures and the potential benefits thereof; the costs and benefits of integrating previous acquisitions; anticipated timing for United States (U.S.) Food and Drug Administration (U.S. FDA) and non-U.S. regulatory approval of new products; increased presence in new markets, including markets outside the U.S.; changes in the market and our market share; our ability to meet growing demand for our existing products; acquisitions and investment initiatives, including the timing of regulatory approvals as well as integration of acquired companies into our operations; the resolution of tax matters; the effectiveness of our development activities in reducing patient care costs and hospital stay lengths; our approach towards cost containment; our expectations regarding the potential impact of changing governmental executive actions and regulations (including relating to global trade policies, enforcement priorities, and compliance requirements), on our business; our expectations regarding healthcare costs, including potential changes to reimbursement policies and pricing pressures; our expectations regarding changes to patient standards of care; our ability to identify and maintain successful business partnerships; the elimination of certain positions or costs related to restructuring initiatives; outcomes in our litigation matters and governmental proceedings and investigations; general economic conditions; the adequacy of available working capital and our working capital needs; our payment of dividends and redemption of shares; the continued strength of our balance sheet and liquidity; our accounts receivable exposure; our human capital management with respect to our global workforce; and the potential impact of our compliance with governmental regulations and accounting guidance. \nWe have based these forward-looking statements largely on our current expectations and projections about future events and financial trends that we believe may affect our business, results of operations, financial condition, and/or cash flows. These forward-looking statements speak only as of the date of this Quarterly Report on Form 10-Q and are subject to a number of risks, uncertainties and assumptions described in the “Risk Factors” section and elsewhere in our Annual Report on Form 10-K. Because forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified, you should not rely on these forward-looking statements as predictions of future events. One must carefully consider forward-looking statements and understand that such forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified, and involve a variety of risks and uncertainties, known and unknown, including, among others, those discussed in the sections entitled “Government Regulation” within “Item 1. Business” and “Item 1A. Risk Factors” in our Annual Report on Form 10-K, as well as those related to:\n•\ncompetition in the medical device industry,\n•\ndelays in regulatory approvals,\n•\nreduction or interruption in our supply,\n•\nfailure to complete or achieve the intended benefits of acquisitions or divestitures,\n•\nadverse regulatory action,\n•\nlaws and governmental regulations,\n•\nlitigation results,\n•\nquality problems,\n•\nhealthcare policy changes,\n52\n•\npublic health crises,\n•\ncybersecurity and privacy incidents,\n•\ninternational operations, including the impact of armed conflicts,\n•\nself-insurance,\n•\ncommercial insurance,\n•\nchanges in applicable tax rates,\n•\npositions taken by taxing authorities,\n•\ndecreasing selling prices and pricing pressure,\n•\nliquidity shortfalls,\n•\nfluctuations in currency exchange rates,\n•\ninflation, or\n•\ndisruption of our current plans and operations.\nConsequently, no forward-looking statement may be guaranteed, and actual results may vary materially from those projected in the forward-looking statements. We intend to take advantage of the Safe Harbor provisions of the Private Securities Litigation Reform Act of 1995 regarding our forward-looking statements and are including this sentence for the express purpose of enabling us to use the protections of the safe harbor with respect to all forward-looking statements. While we may elect to update these forward-looking statements at some point in the future, whether as a result of any new information, future events, or otherwise, we have no current intention of doing so except to the extent required by applicable law."
}