{
  "item1": "certain insurance subsidiaries Federal Home Loan Bank New York (“FHLBNY”) subsidiary Federal Agricultural Mortgage Corporation. Asia operations geographically diverse encompassing both developed emerging markets. operate nine jurisdictions throughout Asia, largest operation Japan. market products services through range proprietary third-party distribution channels.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations Index Management’s Discussion Analysis Financial Condition Results Operations Forward-Looking Statements Other Financial Information Consolidated Company Outlook Summary Critical Accounting Estimates Acquisitions Dispositions Results Operations Liquidity Capital Resources Adopted Accounting Pronouncements Future Adoption Accounting Pronouncements Non-GAAP Other Financial Disclosures Forward-Looking Statements Other Financial Information purposes discussion, “MetLife,” “Company,” “we,” “our” “us” refer MetLife, Inc., Delaware corporation incorporated 1999, its subsidiaries affiliates. discussion should read conjunction “Note Regarding Forward-Looking Statements,” “Risk Factors,” “Quantitative Qualitative Disclosures About Market Risk” Company’s consolidated financial statements included elsewhere herein. Management’s Discussion Analysis Financial Condition Results Operations may contain incorporate reference information includes based upon forward-looking statements within meaning Private Securities Litigation Reform Act 1995.",
  "item2": "Accounting Pronouncements Non-GAAP Other Financial Disclosures Forward-Looking Statements Other Financial Information Management’s Discussion Analysis Financial Condition Results Operations may contain incorporate reference information includes based upon forward-looking statements within meaning Private Securities Litigation Reform Act 1995. See “Note Regarding Forward-Looking Statements” cautionary language regarding forward-looking statements. Management’s Discussion Analysis Financial Condition Results Operations includes references performance measures, adjusted earnings adjusted earnings available common shareholders, not based accounting principles generally accepted United States America (“GAAP”). See “— Non-GAAP Other Financial Disclosures” definitions discussion these other financial measures, “— Results Operations” “— Investments” reconciliations historical non-GAAP financial measures most directly comparable GAAP measures."
}