{
  "item1": "Aria (including Vdara), Bellagio, Cosmopolitan Las Vegas (“The Cosmopolitan”) (upon its acquisition May 2022), MGM Grand Las Vegas (including Signature), Mandalay Bay (including W Las Vegas Four Seasons), Mirage (until its disposition December 2022), Luxor, New York-New York (including Park), Excalibur, Park MGM (including NoMad Las Vegas). Regional Operations. Regional Operations consists following casino properties: MGM Grand Detroit Detroit, Michigan; Beau Rivage Biloxi, Mississippi; Gold Strike Tunica Tunica, Mississippi (until its disposition February 2023); Borgata Atlantic City, New Jersey; MGM National Harbor Prince George’s County, Maryland; MGM Springfield Springfield, Massachusetts; Empire City Yonkers, New York; MGM Northfield Park Northfield Park, Ohio. Over half net revenue Las Vegas Strip Resorts typically derived non-gaming operations, including hotel, food beverage, entertainment other non-gaming amenities majority net revenue Regional Operations typically derived gaming operations.",
  "item7": "Las Vegas Strip Resorts Consolidated Adjusted EBITDA Includes rent expense related triple net operating ground leases $2.3 billion, $2.3 billion, $2.0 billion 2024, 2023 2022, respectively. See Note 11 discussion leases. Las Vegas Strip Resorts Las Vegas Strip Resorts Segment Adjusted EBITDAR decreased 3% compared 2023. Las Vegas Strip Resorts Segment Adjusted EBITDAR margin decreased 35.2% 2024 compared 36.3% 2023 due primarily increase payroll-related expenses.",
  "item2": "BetMGM North America Venture Non-operating Results Gross interest expense $103 million $112 million three months ended September 30, 2025 2024, $317 million $336 million nine months ended September 30, 2025 2024, respectively. decrease three nine months ended September 30, 2025 due primarily decrease weighted average outstanding debt. See Note 5 accompanying consolidated financial statements discussion long-term debt see “Liquidity Capital Resources” discussion issuances repayments long-term debt. Other, net expense $10 million income $93 million three months ended September 30, 2025 2024, respectively."
}