{
  "source_file": "mhk-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the Company’s financial condition and results of operations from management's perspective should be read in conjunction with the Company’s unaudited condensed consolidated financial statements and related notes included in this report, as well as our audited consolidated financial statements for the year ended December 31, 2024, which are included in our Annual Report on Form 10-K for the year ended December 31, 2024.\nReferences to “Mohawk,” “the Company,” “we,” “our” and “us” refer to Mohawk Industries, Inc. and its consolidated subsidiaries as a whole, unless the context otherwise requires.\nBusiness Summary\nMohawk is a significant supplier of every major flooring category with manufacturing operations in 19 countries and sales in approximately 180 countries. Based on its annual sales, the Company believes it is the world’s largest flooring manufacturer. A majority of the Company’s long-lived assets are located in the United States and Europe, which are also the Company’s primary markets. Additionally, the Company maintains operations in Australia, Brazil, Malaysia, Mexico, New Zealand, Russia and other parts of the world. The Company is a leading provider of flooring for residential and commercial markets and has earned significant recognition for its innovation in design and performance as well as sustainable business practices.\n \nMacroeconomic Conditions\nThe Company continues to be impacted by soft demand across its markets, as inflationary pressures, elevated interest rates, shifting trade policy and geopolitical events are contributing to consumer uncertainty that has led to general deferrals of large discretionary purchases. In addition, mortgage rates remain elevated in most markets, contributing to a stagnant housing market in many regions and impacting the demand for the Company’s products for residential remodeling projects. Commercial channels continue to outperform residential in most of the Company’s markets, as many commercial construction and remodeling projects were planned and approved prior to rising interest rates. Based on historical industry cycles, the Company believes demand in its markets will accelerate when interest rates decline due to pent-up demand in the residential and commercial remodeling and construction markets. However, the ongoing impact of soft demand, inflationary pressures and elevated interest rates to the Company’s business, financial condition, results of operations, and prospects cannot be determined at this time.  \nOver the last several quarters, the Company has, to some extent, offset the impact of lower volume from reduced demand, pricing pressures in competitive markets and higher input costs through productivity gains and benefits from restructuring initiatives. During 2022 and 2023, the Company implemented a number of restructuring actions, productivity initiatives and manufacturing enhancements focused on reducing costs to enhance future performance, including certain facility, asset and product rationalizations and workforce reductions. The Company anticipates that when completed these projects will deliver annual savings of approximately $150 million, with an estimated cost of approximately $215 million. In 2024, the Company announced further restructuring actions, including additional facility, assets and product rationalizations and workforce reductions to further reduce costs and improve the business for the future. The Company anticipates that when completed, these projects will deliver annual savings of approximately $140 million, with an estimated cost of approximately $145 million. In 2025, the Company announced additional restructuring actions, including assets and product rationalizations and workforce reductions to further reduce costs and streamline the business for the future. The Company anticipates that when completed, these projects will deliver annual savings of approximately $50 million, with an estimated cost of approximately $30 million. Execution timelines will vary by project, with some initiatives extending into 2026.\nTariffs Update\nThe Company continues to actively monitor trade policy and tariff announcements, including various executive orders issued by the current U.S. presidential administration. Due to its global footprint and manufacturing operations across 19 countries, the Company is generally able to provide its customers with regional supply. However, the current tariff policies have impacted certain of the Company’s sourcing and upstream and downstream supply chain processes occurring outside the U.S. and certain vendors, suppliers, and customers located outside the U.S. Based on recent changes, engineered wood and laminate imports will now be subject to reciprocal tariffs like other flooring categories, which should benefit domestically produced products. The Company has begun to take steps to mitigate the implemented tariffs through managing inventory of sourced products, adjusting prices as the tariff trade policy evolves and optimizing its supply chain. At a 10% baseline tariff rate, the Company expects to incur an annualized cost of approximately $50 million related to such tariffs. The Company continues to monitor changing tariff levels and adjust its strategies to mitigate their impact as trade policy evolves. However, the duration, magnitude and scope of any additional tariffs, trade restrictions, retaliatory or other measures are difficult to predict, including any related impacts to consumer demand, along with the extent (if any) to which the Company will be able to \n26\nTable of Contents\noffset the impacts of such actions through mitigation efforts. These tariff actions, retaliatory measures, or other trade restrictions, could materially and adversely impact the Company’s business, financial condition, results of operations, and prospects. \nGeopolitical Conflict\nDue to its global footprint, Mohawk’s business is sensitive to geopolitical conflict, including the Russia-Ukraine conflict and the ongoing conflicts in the Middle East. Since the first quarter of 2022, the Company has suspended new investments in Russia in response to ongoing Russian military actions in Ukraine. In addition, continued escalation of conflict in the Middle East region could result in supply chain disruptions, higher energy and raw material prices, decreased consumer demand for the Company’s products and increased transportation barriers, though the extent of the impact on the Company’s business, financial condition, results of operations, and prospects cannot be predicted. The broader consequences of current ongoing military conflicts, which may include further economic sanctions, embargoes, regional instability, and geopolitical shifts; potential retaliatory actions, including nationalization of foreign-owned businesses; increased tensions between the United States and countries in which the Company operates; and the extent of the conflict’s effect on the Company’s business and results of operations, as well as the global economy, cannot be predicted. \nLiquidity and Capital Expenditures Overview\nThe Company believes it is well positioned with a strong balance sheet. Based on its current liquidity and available credit, the Company is in a position to finance internal investments, acquisitions and/or additional stock purchases and pay current debt as it becomes due. For information on risks that could impact the Company’s results, please refer to \nRisk Factors\n in Part I, Item 1A in the Company’s 2024 Annual Report filed on Form 10-K.\nIn 2025, the Company plans to invest approximately $480 million focused on completing capacity expansion projects and targeted initiatives that will drive cost reduction while improving operational performance.\nFor the three months ended September 27, 2025, the net earnings attributable to the Company were $108.8 million compared to the net earnings attributable to the Company of $162.0 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs, higher legal settlements, reserves and fees, higher restructuring, acquisition and integration-related, and other costs, the unfavorable net impact of price and product mix and the unfavorable impact of temporary plant shutdowns, partially offset by productivity gains and lower income tax expenses.\nFor the nine months ended September 27, 2025, the net earnings attributable to the Company was $327.9 million compared to the net earnings attributable to the Company of $424.5 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs, the unfavorable impact of temporary plant shutdowns, lower sales volume, order management system conversion, higher restructuring, acquisition and integration-related, and other costs and the unfavorable net impact of price and product mix, partially offset by productivity gains and lower income tax expenses. The Company believes that a number of circumstances may influence trends in 2025, including the impact of inflation and material availability due to disruptions in the global supply chain, but the extent and duration of such impact cannot be predicted.\nFor the nine months ended September 27, 2025, the Company generated $596.6 million of cash from operating activities. As of September 27, 2025, the Company had cash and cash equivalents of $516.2 million of which $285.6 million was in the U.S. and $230.6 million was in foreign countries.\n \n27\nTable of Contents\nResults of Operations\nQuarter Ended September 27, 2025, as compared with Quarter Ended September 28, 2024 \nNet sales\nNet sales for the three months ended September 27, 2025, were $2,757.9 million compared to net sales of $2,719.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $61 million, partially offset by lower sales volume of approximately $13 million and fewer shipping days for the quarter ended September 27, 2025, of approximately $11 million.\nGlobal Ceramic\n—Net sales for the three months ended September 27, 2025, were $1,104.7 million compared to net sales of $1,058.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $28 million and the favorable net impact of price and product mix of approximately $26 million.\nFlooring NA\n—Net sales for the three months ended September 27, 2025, were $936.8 million compared to net sales of $974.0 million for the three months ended September 28, 2024. The change was primarily attributable to lower sales volume of approximately $34 million. \nFlooring ROW\n—Net sales for the three months ended September 27, 2025, were $716.4 million compared to net sales of $687.0 million for the three months ended September 28, 2024. The change was primarily attributable to the favorable net impact of foreign exchange rates of approximately $34 million and higher sales volume of approximately $27 million, partially offset by the unfavorable net impact of price and product mix of approximately $21 million and fewer shipping days for the quarter ended September 27, 2025, of approximately $11 million.\nGross profit\nGross profit for the three months ended September 27, 2025, was $654.9 million compared to gross profit of $692.6 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $39 million; higher restructuring, acquisition and integration-related, and other costs of approximately $25 million; the unfavorable net impact of price and product mix of approximately $20 million and the unfavorable impact of temporary plant shutdowns of approximately $14 million, partially offset by productivity gains of approximately $57 million.\nSelling, general and administrative expenses\nSelling, general and administrative expenses for the three months ended September 27, 2025, were $518.2 million compared to $480.3 million for the three months ended September 28, 2024. The change was primarily attributable to higher legal settlements, reserves and fees, and restructuring, acquisition and integration-related, and other costs of approximately $15 million; higher input costs of approximately $13 million and the unfavorable net impact of foreign exchange rates of approximately $10 million.\n28\nTable of Contents\nOperating income\nOperating income for the three months ended September 27, 2025, was $136.7 million compared to operating income of $212.3 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $52 million; higher legal settlements, reserves and fees, and restructuring, acquisition and integration-related, and other costs of approximately $41 million; the unfavorable net impact of price and product mix of approximately $20 million and the unfavorable impact of temporary plant shutdowns of approximately $14 million, partially offset by productivity gains of approximately $62 million.\nGlobal Ceramic\n—Operating income was $71.6 million for the three months ended September 27, 2025, compared to operating income of $83.4 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $31 million; higher restructuring, acquisition and integration-related, and other costs of approximately $11 million, partially offset by productivity gains of approximately $24 million.\nFlooring NA\n—Operating income was $54.4 million for the three months ended September 27, 2025, compared to operating income of $73.0 million for the three months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $22 million; the unfavorable impact of temporary plant shutdowns of approximately $13 million and the unfavorable net impact of price and product mix of approximately $10 million, partially offset by productivity gains of approximately $29 million.\nFlooring ROW\n—Operating income was $43.8 million for the three months ended September 27, 2025, compared to operating income of $67.8 million for the three months ended September 28, 2024. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $18 million; higher restructuring, acquisition and integration-related, and other costs of approximately $11 million.\nInterest expense \nInterest expense was $5.0 million for the three months ended September 27, 2025, compared to interest expense of $11.2 million for the three months ended September 28, 2024. The change was primarily attributable to strong cash flow, resulting in lower debt. \nOther income and expense, net\nOther income and expense, net was income of $0.4 million for the three months ended September 27, 2025, compared to other income of $0.7 million for the three months ended September 28, 2024. Other income and expense, net did not significantly change for the three months ended September 27, 2025, from the three months ended September 28, 2024. \nIncome tax expense\nFor the three months ended September 27, 2025, the Company recorded income tax expense of $23.3 million on earnings before income taxes of $132.1 million, for an effective tax rate of 17.6%. For the three months ended September 28, 2024, the Company recorded income tax expense of $39.8 million on earnings before income taxes of $201.8 million, for an effective tax rate of 19.7%. The decrease in the effective tax rate was primarily driven by the Company’s geographic dispersion of profits and losses for the respective periods and prior period tax expenses recognized during the three months ended September 28, 2024, partially offset by an increase in unrecognized tax benefits during the three months ended September 27, 2025. \n29\nTable of Contents\nNine Months Ended September 27, 2025, as compared with Nine Months Ended September 28, 2024 \nNet sales\nNet sales for the nine months ended September 27, 2025, were $8,085.7 million compared to net sales of $8,199.7 million for the nine months ended September 28, 2024. The change was primarily attributable to fewer shipping days for the nine months ending September 27, 2025, of approximately $101 million and lower sales volume of approximately $68 million and the impact of the order management system conversion of approximately $50 million, partially offset by the favorable net impact of price and product mix of approximately $69 million and the favorable net impact of foreign exchange rates of approximately $39 million.\nGlobal Ceramic\n—Net sales for the nine months ended September 27, 2025, were $3,219.3 million compared to net sales of $3,218.4 million for the nine months ended September 28, 2024. The change was primarily attributable to the favorable net impact of price and product mix of approximately $91 million, partially offset by lower sales volume of approximately $48 million; fewer shipping days for the nine months ending September 27, 2025, of approximately $40 million. \nFlooring NA\n—Net sales for the nine months ended September 27, 2025, were $2,746.0 million compared to net sales of $2,832.7 million for the nine months ended September 28, 2024. The change was primarily attributable to the impact of the order management system conversion of approximately $50 million; lower sales volume of approximately $34 million and fewer shipping days for the nine months ending September 27, 2025, of approximately $28 million, partially offset by the favorable net impact of price and product mix of approximately $27 million. \nFlooring ROW\n—Net sales for the nine months ended September 27, 2025, were $2,120.4 million compared to net sales of $2,148.6 million for the nine months ended September 28, 2024. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $49 million and fewer shipping days for the nine months ending September 27, 2025, of approximately $33 million, partially offset by the favorable net impact of foreign exchange rates of approximately $42 million.\nGross profit\nGross profit for the nine months ended September 27, 2025, was $1,952.5 million compared to gross profit of $2,065.9 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $113 million; the unfavorable impact of temporary plant shutdowns of approximately $45 million; lower sales volume of approximately $44 million; higher restructuring, acquisition and integration-related, and other costs of approximately $36 million and order management system conversion of approximately $26 million, partially offset by productivity gains of approximately $146 million. \nSelling, general and administrative expenses\nSelling, general and administrative expenses for the nine months ended September 27, 2025, were $1,531.0 million compared to $1,493.0 million for the nine months ended September 28, 2024. Selling, general and administrative expenses did not significantly change as a percentage of net sales for the nine months ended September 27, 2025, compared to the nine months ended September 28, 2024.\nOperating income\nOperating income for the nine months ended September 27, 2025, was $421.5 million compared to operating income of $572.9 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $156 million; the unfavorable impact of temporary plant shutdowns of approximately $45 million; higher legal settlements, reserves and fees, and restructuring, acquisition and integration-related, and other costs of approximately $42 million; lower sales volume of approximately $40 million; order management system conversion of approximately $30 million and the unfavorable net impact of price and product mix of approximately $24 million, partially offset by productivity gains of approximately $170 million. \nGlobal Ceramic\n—Operating income was $201.5 million for the nine months ended September 27, 2025, compared to operating income of $215.3 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $85 million and lower sales volume of approximately $29 million, partially offset by productivity gains of approximately $63 million and the favorable net impact of price and product mix of approximately $40 million. \n30\nTable of Contents\nFlooring NA\n—Operating income was $116.3 million for the nine months ended September 27, 2025, compared to operating income of $196.3 million for the nine months ended September 28, 2024. The change was primarily attributable to higher input costs of approximately $63 million, partially offset by order system conversion of approximately $30 million; the unfavorable impact of temporary plant shutdowns of approximately $30 million; higher restructuring, acquisition and integration-related, and other costs of approximately $24 million and the unfavorable net impact of price and product mix of approximately $19 million, partially offset by productivity gains of approximately $87 million. \nFlooring ROW\n—Operating income was $168.3 million for the nine months ended September 27, 2025, compared to operating income of $204.3 million for the nine months ended September 28, 2024. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $45 million and lower sales volume of approximately $11 million, partially offset by productivity gains of approximately $19 million. \nInterest expense \nInterest expense was $16.6 million for the nine months ended September 27, 2025, compared to interest expense of $38.6 million for the nine months ended September 28, 2024. The change was primarily attributable to strong cash flow and prepayments of the U.S. and European portions of the Term Loan Facility during the nine months ended September 28, 2024, resulting in lower debt.\nOther income and expense, net \nOther income and expense, net was an expense of $2.2 million for the nine months ended September 27, 2025, compared to other income of $0.2 million for the nine months ended September 28, 2024. Other income and expense, net did not significantly change for the nine months ended September 27, 2025, from the nine months ended September 28, 2024.\nIncome tax expense\nFor the nine months ended September 27, 2025, the Company recorded income tax expense of $74.8 million on earnings before income taxes of $402.7 million, for an effective tax rate of 18.6%. For the nine months ended September 28, 2024, the Company recorded income tax expense of $109.9 million on earnings before income taxes of $534.5 million, for an effective tax rate of 20.6%. The decrease in the effective tax rate was primarily driven by the Company’s geographic dispersion of profits and losses for the respective periods and a tax benefit related to a prior period adjustment to deferred taxes during the nine months ended September 27, 2025, partially offset by an increase in unrecognized tax benefits during the nine months ended September 27, 2025.\n31\nTable of Contents\nLiquidity and Capital Resources\nThe Company’s primary capital requirements are for working capital, capital expenditures and acquisitions. The Company’s capital needs are met primarily through a combination of internally generated funds, commercial paper, bank credit lines, term and senior notes and credit terms from suppliers. \nNet cash provided by operating activities in the first nine months of 2025 was $596.6 million, compared to net cash provided by operating activities of $736.9 million in the first nine months of 2024. The change was primarily attributable to the change in accounts receivable; lower net earnings; change in accounts payable and change in inventories.\nNet cash used in investing activities in the first nine months of 2025 was $245.6 million compared to net cash used in investing activities of $293.6 million in the first nine months of 2024. The change was primarily attributable to the decrease in capital expenditures of $48 million for the nine months ended September 27, 2025, compared to the nine months ended September 28, 2024.\nNet cash used in financing activities in the first nine months of 2025 was $532.4 million compared to net cash used in financing activities of $651.6 million in the first nine months of 2024. The change was primarily attributable to prior year payments of term loan facility of $912.3 million; higher net proceeds from the Senior Credit Facility of $61.2 million, partially offset by the lower net proceeds from commercial paper of $831.1 million (year to date net repayment of $415.4 million in 2025 as compared to net proceeds of $415.7 million in 2024, year to date) and higher share repurchase of $20.8 million.  \nAs of September 27, 2025, the Company had cash of $516.2 million, of which $285.6 million was in the United States and $230.6 million was in foreign countries. The Company plans to permanently reinvest the cash held outside the United States. The Company believes that its cash and cash equivalents on hand, cash generated from operations and availability under its existing credit facilities will be sufficient to meet its capital expenditure, working capital and debt servicing requirements over at least the next twelve months. The Company continually evaluates its projected needs and may conduct additional debt financings, subject to market conditions, to increase its liquidity and to take advantage of attractive financing opportunities. \nOn July 24, 2025, the Company’s Board of Directors approved a new share repurchase program, authorizing the Company to repurchase up to $500 million of its common stock (the “2025 Share Repurchase Program”). On February 10, 2022, the Company’s Board of Directors approved a share repurchases authorization in the amount of $500 million (the “2022 Share Repurchase Program,” and together with the 2025 Share Repurchase Program, the “Share Repurchase Programs”).  For the three months ended September 27, 2025, the Company purchased $40.2 million of its common stock under the Share Repurchase Programs. As of September 27, 2025, there remained $459.9 million authorized under the 2025 Share Repurchase Program. The 2022 Share Repurchase Program was completed in the quarter ended September 27, 2025. \nSee Note 16, \nDebt\n, of the notes to the Condensed Consolidated Financial Statements included in Part I, Item 1 of this Form 10-Q for further discussion of the Company’s long-term debt. The Company may continue, from time to time, to retire its outstanding debt through cash purchases in the open market, privately negotiated transactions or otherwise. Such repurchases, if any, will depend on prevailing market conditions, the Company’s liquidity requirements, contractual restrictions and other factors. The amount involved may be material.\nContractual Obligations\nThere have been no significant changes to the Company’s contractual obligations as disclosed in the Company’s 2024 Annual Report filed on Form 10-K except as described herein. \n    \nCritical Accounting Policies and Estimates\nThere have been no significant changes to the Company’s critical accounting policies and estimates during the period. The Company's critical accounting policies are described in its 2024 Annual Report filed on Form 10-K.\n32\nTable of Contents\nImpact of Inflation\nInflation affects the Company’s manufacturing costs, distribution costs and operating expenses. The Company expects raw material prices, many of which are petroleum-based, to fluctuate based upon worldwide supply and demand of commodities used in the Company’s production processes. Although the Company attempts to pass on increases in raw material, labor, energy and fuel-related costs to its customers, the Company’s ability to do so is dependent upon the rate and magnitude of any increase, competitive pressures and market conditions for the Company’s products. There have been in the past, and may be in the future, periods of time during which increases in these costs cannot be fully recovered. In the past, the Company has often been able to enhance productivity and develop new product innovations to help offset increases in costs resulting from inflation in its operations.\nOff-Balance Sheet Arrangements\nThe Company did not have any off-balance sheet arrangements as of September 27, 2025.\nSeasonality\nThe Company is a calendar year-end company. Global Ceramic and Flooring NA typically have higher net sales in the second and third quarters. Flooring ROW typically has higher net sales in the second and fourth quarters. Because periods of economic downturn can affect the seasonality of each segment, sales for any one quarter are not necessarily indicative of the sales that may be achieved for any other quarter or for the full year."
}