{
  "source_file": "mhk-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nUnless this Form 10-K indicates otherwise or the context otherwise requires, the terms “we,” “our,” “us,” “Mohawk,” or “the Company” as used in this Form 10-K refer to Mohawk Industries, Inc.\nGeneral\n    \nMohawk is a leading global flooring manufacturer that creates products to enhance residential and commercial spaces around the world. The Company’s vertically integrated manufacturing and distribution processes provide competitive advantages in carpet, rugs, ceramic tile, laminate, wood, stone, luxury vinyl tile (“LVT”) and sheet vinyl flooring. The Company’s industry-leading innovation develops products and technologies that differentiate its brands in the marketplace and satisfy all flooring-related remodeling and new construction requirements. The Company’s brands are among the most recognized in the industry and include American Olean\n®\n, Daltile\n®\n, Decortiles\n®\n, Durkan\n®\n, Eliane\n®\n, Elizabeth\n®\n, Feltex\n®\n, Godfrey Hirst\n®\n, IVC Home\n®\n,\n \nKarastan\n®\n, Kerama Marazzi\n®\n, Marazzi\n®\n, Moduleo\n®\n, Mohawk\n®\n, Pergo\n®\n, Quick-Step\n®\n, Unilin\n®\n and Vitromex\n®\n. During the past two decades, the Company has transformed its business from an American carpet manufacturer into the world’s largest flooring company with operations in Asia, Australasia, Europe, North America and South America.   The Company had annual net sales in 2024 of $10.8 billion. Approximately 55% of this amount was generated by sales in the United States, and approximately 45% was generated by sales outside the United States. The Company has three reporting segments: Global Ceramic, Flooring North America (“Flooring NA”) and Flooring Rest of the World (“Flooring ROW”) with their 2024 net sales representing 39%, 35% and 26%, respectively, of the Company’s total revenue. Selected financial information for the three segments, geographic net sales and the location of long-lived assets are set forth in Note 17, \nSegment Reporting\n.\nGlobal Ceramic designs, manufactures, sources, distributes and markets a broad line of ceramic, porcelain and natural stone tile products used for floor and wall applications in residential and commercial channels for both remodeling and new construction. In addition, Global Ceramic manufactures, sources and distributes other products, including natural stone, porcelain slabs and quartz countertops, as well as installation materials. Global Ceramic markets and distributes its products under various brands, including the following:  American Olean\n®\n, Daltile\n®\n, Decortiles\n®\n, Eliane\n®\n, Elizabeth\n®\n, EmilGroup\n®\n, KAI\n®\n, Kerama Marazzi\n®\n, Marazzi\n®\n, Ragno\n®\n and Vitromex\n®\n. The Segment sells its products through home centers, Company-owned service centers and stores, floor covering retailers, ceramic tile specialists, e-commerce retailers, residential builders, independent distributors, commercial contractors and commercial end users. Global Ceramic operations are vertically integrated from the production of raw material for body and glaze preparation to the manufacturing and distribution of the Segment’s product lines.\nFlooring NA designs, manufactures, sources, distributes and markets a broad range of floor covering products in a variety of colors, textures and patterns for both residential and commercial remodeling and new construction channels. The Segment’s product lines include broadloom carpet, carpet tile, rugs and mats, carpet pad, laminate, medium-density fiberboard (“MDF”), wood flooring, LVT and sheet vinyl. Flooring NA markets and distributes its flooring products under various brands, including the following: Aladdin Commercial\n®\n, Durkan\n®\n, Foss\n®\n, IVC Resilient Design\n®\n, Karastan\n®\n, Mohawk\n®\n, Mohawk Group\n®\n, Mohawk Home\n®\n, Pergo\n®\n, Portico\n®\n and Quick-Step\n®\n. The Segment sells its products through floor covering retailers, home centers, mass merchandisers, department stores, e-commerce retailers, shop at home, buying groups, residential builders, independent distributors, commercial contractors and commercial end users. Flooring NA operations are vertically integrated from the production of raw material to the manufacturing and distribution of the Segment’s product lines. \nFlooring ROW designs, manufactures, sources, distributes and markets a broad variety of laminate, LVT and sheet vinyl, wood flooring, broadloom carpet and carpet tile collections used in residential and commercial markets for both remodeling and new construction. In addition, Flooring ROW manufactures roofing panels, insulation boards, mezzanine flooring, MDF, decorative panels and chipboards primarily for the European market. The Segment also licenses certain patents related to flooring manufacturing throughout the world. The Segment markets and distributes its products under various brands, including the following: Feltex\n®\n, GH Commercial\n®\n, Godfrey Hirst\n®\n, Hycraft\n®\n, IVC Home\n®\n, Lentex Flooring\n®\n, Leoline\n®\n, Moduleo\n®\n, Mohawk Group\n®\n, Pergo\n®\n, Quick-Step\n®,\n Redbook\n®\n and Unilin\n®\n. The Segment sells its products through floor covering retailers, wholesalers, home centers, Company-operated distributors, independent distributors, residential builders, commercial contractors and commercial end users. Flooring ROW operations are vertically integrated from the production of raw material to the manufacturing and distribution of the Segment’s product lines.\n4\nTable of Contents\nIndex to Financial Statements\nBusiness Strategy\nMohawk’s business strategy provides a consistent vision for the organization and focuses employees around the globe on key priorities by providing continuity for the Company’s operating principles and ensuring an emphasis on exceeding customer expectations.\nThe strategy’s key points are cascaded down through the organization:\n•\nOptimizing the Company’s position as the industry’s preferred provider by delivering exceptional value to customers;\n•\nTreating employees fairly to retain the best organization;\n•\nDriving innovation in all aspects of the business;\n•\nTaking reasonable, well considered risks to grow the business; and\n•\nEnhancing the communities in which the Company operates.\nMohawk is committed to responsible growth and delivering value to the Company’s stockholders and customers through tailoring its operational presence in the markets the Company serves, including through: \n•\nOperational Excellence\n through simplified operations, improved productivity, expanded sustainable processes, enhanced analytics and automation\n•\nMarket Development & Penetration\n through higher sales to existing customers, sales of existing products to new customers and expansion into new markets\n•\nProduct Innovation & Improvement\n through higher-value product creation, enhanced design and features for existing products & emphasis on sustainable products\n•\n \nNon-Organic Growth \nthrough mergers and acquisitions.\n \n \nMohawk is taking action to optimize the Company’s manufacturing and distribution footprint to reduce complexity, improve productivity, and align capacity with anticipated future market demand. \nDuring 2022 and 2023, the Company implemented restructuring actions, productivity initiatives and manufacturing enhancements focused on reducing costs and improving future performance, including certain facility, asset and product rationalizations and workforce reductions. In 2024, the Company announced further restructuring actions to take advantage of additional opportunities related to the activities described above\n. \nStrengths\nMarket Position\nMohawk’s fashionable and innovative products, successful participation in all sales channels, creative marketing tools and programs and extensive sales resources have enabled the Company to build market leadership positions in multiple geographies, primarily North America, Europe, Latin America and Australasia, as well as to export products to approximately 180 countries. In North America, Mohawk’s largest marketplace, the Company has leveraged its brands, broad offering and award-winning merchandising to build strong positions across all product categories. In Europe, similar advantages have supported market leadership in ceramic tile, premium laminate and sheet vinyl. The Company also has established a strong position in the fast-growing LVT market in the United States and Europe, with investments to expand capacity and align the product offering with market trends. In 2023, the Company further expanded its presence in Brazil through the acquisition of Elizabeth Revestimentos, a leading Brazilian ceramic tile business with four manufacturing facilities strategically located throughout that country. In 2023, the Company also acquired Vitromex, a leading Mexican ceramic tile business with four manufacturing facilities strategically located throughout that country, further solidifying the Company’s position in the Mexico ceramic tile market.\nProduct Innovation\nMohawk drives performance through innovation and process improvements across all product categories. In ceramic, this includes proprietary Reveal Imaging\n®\n printing that replicates the appearance of other surfaces, such as long planks with the visuals and texture of natural wood as well as tiles that mimic natural stone, cement, textiles and other alternatives. The Company has pioneered an innovative ceramic tile technology called StepWise™ that is infused into its top-quality porcelain tile to significantly improve slip resistance. Given the frequent use of ceramic tile in kitchens and baths, the Company has also introduced numerous collections featuring antimicrobial treatment that becomes a permanent part of the product. The Company \n5\nTable of Contents\nIndex to Financial Statements\nmanufactures large-scale porcelain slabs that can replicate the look of natural stone but are harder and more durable. In addition to satisfying demand for their domestic markets, porcelain slabs produced in Europe are also exported to North America, where along with the Company’s quartz countertop and natural stone slab offerings they provide customers with a comprehensive array of surface options. \nIn carpet, the Company’s proprietary fiber technologies include SmartStrand\n®\n and its brand extensions, which are made in part with annually renewable plant-based materials and were the first super-soft stain-resistant products on the market. In the fast-growing polyester carpet category, the Company’s patented Continuum™ process adds bulk and softness to polyester fiber, differentiating the Company’s products in the market. The Company has also launched an innovative carpet backing called Recover™ that is hypoallergenic, latex and VOC free and is easier to install and seam.\nIn laminate, the Company’s patented Uniclic\n®\n installation technology revolutionized the category and has been adapted into the LVT and wood categories, as well. The Company continues to deliver new innovations such as unique HydroSeal™ water-resistance that has extended the laminate category into kitchens and baths, more realistic visuals with GenuEdge\n®\n pressed bevel edges and surface embossing in register that precisely recreates the appearance of wood. As consumer preference for water-proof flooring has increased, the Company has introduced a propriety technology called WetProtect™ that makes the joints of installed laminate and LVT water tight and prevents liquid spills from reaching the subfloor.\nThe Company’s resilient flooring products reflect significant investments in leading-edge technology that yield incredibly realistic reproductions of stone, wood and other materials with embossed finishes that create more realistic visuals. To complement the beauty of its LVT collections, the Company has also enhanced the performance of its premium rigid products with a stone-plastic composite core and an enhanced lacquer finish to provide a dent proof, scratch resistant surface that can withstand today’s active family homes. The Company has recently introduced two PVC-free water-proof flooring options: PureTech™, a sustainable alternative that incorporates 70% recycled content and Solid Tech R™, \n \nwhich utilizes ten recycled plastic bottles per square foot. \nOperational Excellence\nMohawk’s highly efficient manufacturing and distribution assets serve as the foundation for successful growth. By leveraging continuous process improvement and automation, the Company’s operations drive innovation, quality and value. Through its commitment to sustainability practices, the Company has also optimized natural resources and raw materials. The Company has invested to expand capacity, introduce differentiated new products and improve efficiencies. In particular, the Company’s capital investments have improved recently acquired businesses by upgrading product offerings, expanding distribution and improving productivity. \nForbes\n has designated Mohawk as one of the Best Large United States Employers and \nTraining Magazine\n ranked the Company’s training and development programs among the best for more than fifteen years.\nSustainability\nMohawk’s sustainability strategy is founded on three pillars: Better for People, Better for the Planet, and Better for Performance. Through the Better for People pillar, the Company focuses on employee engagement, health and well-being, workforce development, a \nZero-Harm Workplace\n \nand community engagement initiatives.\n \nHighlights of this pillar include Mohawk Group’s \nArtLifting\n \npartnership working with artists with disabilities to include their designs in commercial flooring collections and an extensive internal training initiative from the plant floor to the C-suite. In the United States and Mexico, the Company operates on-site, near-site and virtual Healthy Life Centers to assist employees and their eligible family members with management of chronic conditions as well as treatment of acute illness. Through the Better for the Planet pillar, Mohawk focuses on a climate-positive future through energy conservation, water restoration and product circularity, including waste reduction and responsible sourcing. The Company uses extensive recycled content in many of its products, including transforming billions of discarded plastic bottles annually to create polyester carpet fiber, millions of pounds of recycled and reclaimed wood annually into laminate flooring, chipboards and decorative panels, and millions of pounds of tires annually to produce decorative crumb rubber mats. The Company also produces energy through solar panels, windmills and a waste-to-energy program using scrap wood material. In 2023 and 2024, \nUSA Today\n included Mohawk in its first two lists of America’s Climate Leaders, companies that are making the largest reductions in their carbon emissions. Through the Better for Performance pillar, the Company focuses on sustainability initiatives, ethics, data security and privacy, including creating and maintaining sustainability-related policies. \nMohawk’s annual Impact Report sets forth the Company’s initiatives with respect to these pillars and details how the Company works to manage its operations responsibly and ethically. The Impact Report includes Mohawk’s environmental, social and governance (“ESG”) policies and practices on a variety of matters, including, but not limited to, Board and management sustainability oversight, governance and ethics, environmental sustainability, climate change and greenhouse gas \n6\nTable of Contents\nIndex to Financial Statements\nemissions reduction and employee health and safety management. The scope of the Board’s Nominating & Corporate Governance Committee responsibilities includes oversight of Mohawk’s sustainability programs, and the scope of the Board’s Audit Committee responsibilities includes oversight of climate-related risks. The Impact Report can be found at www.mohawksustainability.com. This website does not constitute part of this Form 10-K.\nSales and Distribution\nGlobal Ceramic\nGlobal Ceramic designs, markets, manufactures, distributes and sources a broad line of ceramic and porcelain tile collections for floors and walls, as well as porcelain slabs and natural stone and quartz countertops. Products are distributed through various channels, including home centers, Company-owned service centers and stores, floor covering retailers, ceramic tile specialists, e-commerce retailers, residential builders, independent distributors, commercial contractors and commercial end users. The business is organized with dedicated sales forces to address the specific customer needs of each distribution channel.\nThe Company provides customers with one of the ceramic tile industry’s broadest product lines—a complete selection of glazed floor tile, glazed wall tile, mosaic tile, porcelain tile, quarry tile, porcelain landscaping pavers, exterior cladding, stone products, porcelain slabs, quartz countertops and installation products. In addition to products manufactured by the Company’s ceramic tile business, the Company also sources products from other manufacturers to enhance its offering to customers.\nGlobal Ceramic markets its products under the American Olean, Daltile, Decortiles, Eliane, Elizabeth, EmilGroup, KAI, Kerama Marazzi, Marazzi, Ragno and Vitromex brand names. These brands are supported by a fully integrated marketing program, displays, merchandising boards, literature, catalogs and websites. Innovative design, quality and response to changes in customer preference enhance recognition in the marketplace. The Company is focused on sales growth opportunities through innovative products and programs in both the residential and commercial channels for both remodeling and new construction. \nGlobal Ceramic utilizes various distribution methods including regional distribution centers, service centers, direct shipping and customer pick-up from Company facilities. The Segment’s sales forces are organized by product type and sales channels in order to best serve each type of customer. The Company believes its distribution methods for Global Ceramic provide high-quality customer service and enhance its ability to plan and manage inventory requirements.  \nFlooring NA\nFlooring NA designs, markets, manufactures, distributes and sources broadloom carpet, carpet tile, carpet pad, rugs, laminate, LVT, sheet vinyl and wood flooring in a broad range of colors, textures and patterns. Flooring NA positions product lines in all price ranges and emphasizes quality, style, performance and service. In addition to products manufactured by Flooring NA, the Company also sources products from other manufacturers to enhance its offering to customers.\nFlooring NA markets and distributes its product lines to floor covering retailers, home centers, mass merchandisers, department stores, e-commerce retailers, shop at home, buying groups, independent distributors, residential builders, commercial contractors and commercial end users. Some products are also marketed through private labeling programs. Sales to customers focused on residential products represent a significant portion of the total industry and the majority of the Segment’s sales.\nThe Company has positioned its brand names across all price ranges. Foss, Karastan, Mohawk, Mohawk Home, Pergo, Portico and Quick-Step are positioned to sell in the residential flooring markets. Aladdin Commercial and Mohawk Group are positioned to sell in the commercial market, which is made up of corporate office space, educational facilities, institutional facilities, healthcare/assisted living facilities and retail space. The Company also sells into the commercial hospitality space (hotels, restaurants, gaming facilities, etc.) under its Durkan brand.\nThe Segment’s sales forces are generally organized by sales channels to best serve each type of customer. Product delivery to independent dealers is facilitated predominantly on Mohawk trucks operating from a strategically positioned national network of warehouses and cross-docks that receive inbound product directly from the Company’s manufacturing operations.\nFlooring ROW\nFlooring ROW designs, markets, manufactures, licenses, distributes and sources laminate, LVT, sheet vinyl, wood flooring, broadloom carpet and carpet tile. It also designs, manufactures, markets and distributes roofing panels, insulation \n7\nTable of Contents\nIndex to Financial Statements\nboards, MDF, chipboards, decorative panels and mezzanine floors. Products are sold through separate distribution channels, consisting of floor retailers, wholesalers, home centers, Company-operated distributors, independent distributors, residential builders, commercial contractors and commercial end users. The business is organized to address the specific customer needs of each distribution channel.\nFlooring ROW markets and sells its flooring products under the Feltex, GH Commercial, Godfrey Hirst, Hycraft, IVC Home, Lentex, Leoline, Moduleo, Mohawk Group, Pergo, Quick-Step and Redbook brands. Flooring ROW also sells private label laminate, wood and vinyl flooring products. The Company believes Quick-Step and Pergo are leading brand names in the European flooring industry, and that Godfrey Hirst and Feltex are leading brand names in the Australasian flooring market. In addition, in Europe, Flooring ROW markets and sells insulation boards and roof panels under the Unilin Insulation brand and MDF, chipboards and high-pressure laminate (HPL) decorative panels under the Unilin Panels brand. The Segment also licenses its intellectual property to flooring manufacturers throughout the world.\nThe Company uses regional distribution centers and direct shipping from manufacturing facilities to provide high-quality customer service and enhance the Company’s ability to plan and manage inventory requirements.\nAdvertising and Promotion\nThe Company’s brands are among the best known and most widely distributed in the industry. The Company vigorously supports the value and name recognition of its brands through traditional advertising channels, including numerous trade publications and unique promotional events that highlight product design and performance, as well as social media initiatives and Internet-based advertising. The Company has invested significantly in websites that educate consumers about the Company’s products, helping them to make informed decisions about purchases, and that identify local retailers that offer the Company’s collections. The Company offers its customers the award-winning Omnify™, an internet platform that automatically syncs updated product and sales information between the Company and its United States aligned retailer websites, ensuring that consumers have access to the most accurate and timely information and creating a faster connection between the consumer and local retailers.\nIn North America, the Company actively supports well known programs such as Susan G. Komen\n®\n (breast cancer research), Habitat for Humanity\n®\n (housing for low income families), Operation Finally Home\n®\n (housing for disabled veterans), water.org\n®\n (accessibility to clean, safe water), ArtLifting\n®\n (opportunities for artists with disabilities and financial instability) and PlasticBank\n®\n (recovering and recycling plastic waste from oceans), which include marketing partnerships that showcase the Company’s products and highlight its corporate values. The Company also sponsors a European cycling team to promote its Quick-Step brand through logo placements and use of the team in its advertising and point-of-sale displays.\nThe Company introduces new products, merchandising and marketing campaigns through participation in regional, national and international trade shows as well as at exclusive dealer conventions. The Company supports sales with its retail customers through cooperative advertising programs that extend the reach of the Company’s promotion as well as with innovative merchandising displays that highlight the Company’s differentiated products and provide samples to consumers. The cost of providing merchandising displays, product samples and point of sale promotional marketing, is partially recovered by the purchase of these items by the Company’s customers.\nManufacturing and Operations\nGlobal Ceramic\nThe Company’s ceramic tile manufacturing operations are vertically integrated from the production of raw material for body and glaze preparation to the manufacturing and distribution of ceramic and porcelain tile, porcelain slabs and quartz countertops. The Company believes that its manufacturing organization’s leading-edge technology offers competitive advantages due to its ability to create a differentiated product line consisting of one of the industry’s broadest offerings of sizes, shapes, colors, textures and finishes, as well as the industry’s largest offering of trim and decorative pieces. In addition, Global Ceramic also sources a portion of its collections to enhance its product offerings. Global Ceramic continues to invest in equipment that uses the latest technologies, which supports the Company’s efforts to increase manufacturing capacity, improve efficiency, meet the growing demand for its innovative products and develop new capabilities. \n8\nTable of Contents\nIndex to Financial Statements\nFlooring NA\nThe Company’s carpet manufacturing operations are vertically integrated and include the extrusion of triexta, nylon, polyester and polypropylene resins, as well as recycled post-consumer plastics, into fiber. Flooring NA is also vertically integrated in yarn processing, carpet backing manufacturing, tufting, weaving, dyeing, coating and finishing. \nThe Segment is also vertically integrated with significant manufacturing assets that produce laminate flooring, MDF board, fiberglass sheet vinyl and LVT. Flooring NA continues to invest in capital expenditures, such as the expansion of the Company’s North American LVT and premium laminate manufacturing capacity. Other investments in state-of-the-art equipment support market growth, increase manufacturing efficiency and improve overall cost competitiveness.\nFlooring ROW\nThe Company’s laminate flooring manufacturing operations in Europe are vertically integrated. The Company believes Flooring ROW has advanced equipment that results in competitive manufacturing in terms of cost and flexibility. In addition, Flooring ROW has significant manufacturing capability for wood flooring, LVT and sheet vinyl. \nFlooring ROW continues to invest in capital expenditures such as LVT, utilizing the latest advances in technologies to enhance its product offering, improve efficiency and develop new capabilities including state-of-the-art, fully integrated production that will leverage the Company’s proven record of bringing innovative and high-quality products to its markets. The manufacturing facilities for roofing panels, insulation boards, MDF, chipboards and HPL decorative panels in Flooring ROW are all configured for cost-efficient manufacturing and production flexibility and are competitive in the European market.\nInputs and Suppliers \nGlobal Ceramic\nThe principal raw materials used in the production of ceramic tile are clay, talc, feldspar, industrial minerals and glazes. The Company has long-term clay mining rights in Brazil, Bulgaria, North America and Russia that satisfy a portion of its clay requirements for producing tile. The Company also purchases a number of different grades of clay for the manufacture of its tile. Glazes are used on a significant percentage of manufactured tiles. Glazes consist of frit (ground glass), zircon, stains and other materials, with frit being the largest component. The Company manufactures a significant amount of its frit requirements. The Company believes that there is an adequate supply of all grades of clay, talc and industrial minerals that are readily available from a number of independent sources. If these suppliers were unable to satisfy the Company’s requirements, the Company believes that alternative supply arrangements would be available. \nFlooring NA\nThe principal raw materials used in the production of carpet are polyester, triexta, nylon, polypropylene, caprolactam, recycled post-consumer plastics, synthetic backing materials, latex and various dyes and chemicals, the majority of which are petroleum-based. The Company uses recycled and reclaimed wood, paper and resins in its production of laminate flooring products.\n \nIn its resilient flooring operations, the Company uses glass fiber, plasticizers and polyvinyl chloride (PVC) resins. Major raw materials used in the Company’s manufacturing process are available from independent sources, and the Company obtains most of its raw materials from major suppliers that provide inputs to each major product category. If these suppliers were unable to satisfy the requirements, the Company believes that alternative supply arrangements would be available. The market for raw materials is sensitive to temporary disruptions. \nFlooring ROW\nThe principal raw materials used in the production of laminate flooring and boards are recycled and reclaimed wood, paper and resins. The principal raw materials used in the production of insulation panels are polyisocyanurate foam and foil-faced film. The wood suppliers provide a variety of wood species, providing the Company with a cost-effective and secure supply of raw material. In its resilient flooring operations, the Company uses glass fiber, plasticizers and PVC resins. The principal raw materials used in the production of broadloom carpet and carpet tile are wool, polyester, triexta, nylon, polypropylene, caprolactam, recycled post-consumer plastics, synthetic backing materials, latex and various dyes and chemicals, the majority of which are petroleum-based. Major raw materials used in the Company’s manufacturing process are available from independent sources, and the Company has long-standing relationships with a number of suppliers. If these suppliers were unable to satisfy the requirements, the Company believes that alternative supply arrangements would be available. The market for raw materials is sensitive to temporary disruptions. \n9\nTable of Contents\nIndex to Financial Statements\nIndustry and Competition\nThe Company is the largest flooring manufacturer in a fragmented industry composed of a wide variety of companies ranging from small, privately-held firms to large multinationals. In 2023, the United States floor covering industry reported $34.1 billion in sales, down approximately 7.4% over 2022’s sales of $36.8 billion.  In 2023, the primary categories of flooring in the United States, based on sales, were carpet and rugs (33.3%), resilient consisting of LVT, sheet vinyl and various other resilient categories (33.0%), ceramic tile (12.6%), wood (11.9%), stone (5.9%) and laminate (3.3%). In 2023, the primary categories of flooring in the United States, based on square feet sold, were resilient consisting of LVT, sheet vinyl and various other resilient categories (39.7%), carpet and rugs (39.5%), ceramic tile (11.4%), wood (5.0%), laminate (3.0%) and stone (1.4%).  Each of these categories is influenced by the residential and commercial construction and residential and commercial remodeling end-use markets. These markets are influenced by many factors including changing consumer preferences, consumer confidence, spending for durable goods, interest rates, inflation, availability of credit, turnover in housing and the overall strength of the economy.\nThe principal methods of competition within the floor covering industry generally are product innovation, style, quality, price, performance technology and service. In each of the markets, price and market coverage are particularly important when competing among product lines. The Company actively seeks to differentiate its products in the marketplace by introducing innovative products with premium features that provide a superior value proposition. The Company’s investments in manufacturing technology, computer systems and distribution networks, as well as the Company’s marketing strategies and resources, contribute to its ability to compete on the basis of performance, quality, style and service, rather than price.\nGlobal Ceramic\nGlobally, the ceramic tile industry is significantly fragmented, though the Company believes it is the world’s largest manufacturer, distributor and marketer of ceramic tile. The Company also believes it is the largest manufacturer, distributor and marketer of ceramic tile in specific markets, including Europe, Russia and the United States, as well as maintaining leading positions in the Brazilian and Mexican markets. The Company has leveraged the advantages of its scale, product innovation and unique designs in these markets to solidify its leadership position, however the Company continues to face pressures in these markets from imported ceramic products as well as alternate flooring categories. Certain regions around the world have established sufficient capacity to allow them to meet domestic needs in addition to exporting product to other markets where their cost, design and/or technical advantages may drive consumer preferences. Some mature markets have seen industry consolidation driven by mergers and acquisitions; however, most markets are comprised of many relatively small manufacturers all working with similar technologies, raw materials and designs. During 2023, the estimated global capacity for ceramic tile was 171 billion square feet – down 5.5% from the prior year primarily due to inflation, an energy crisis, higher interest rates and the resulting slowing demand for flooring that began in the second half of 2022 – with selling prices varying widely based on many factors, including supply within the market, materials used, size, shape and design. While the Company operates ceramic manufacturing facilities in eight countries, the Company has leveraged advantages in technology, design, brand recognition and marketing to extend exports of its products to approximately 160 countries. As a result of this global sales strategy, the Company faces competition in the ceramic tile market from a large number of foreign and domestic manufacturers, all of which compete for sales of ceramic tile to customers through multiple residential and commercial channels. \nFlooring NA\nThe North American flooring industry is highly competitive, with an increasing variety of product categories, shifting consumer preferences, supply chain disruptions and pressures from imported products, particularly in the rug and hard surface categories. Based on industry publications, in 2023, the United States flooring industry had carpet and rug sales of approximately $11.4 billion out of the overall $34.1 billion market. Based on its 2023 net sales, the Company believes it is the largest producer of rugs and the second largest producer of carpet in the world. The Company differentiates its carpet collections in the marketplace through proprietary fiber systems, state-of-the-art manufacturing technologies and unique styling as well as leveraging the strength of some of the best-known brands in the industry. The Company also believes it is the largest manufacturer and distributor of laminate flooring in the United States. The Company’s leading position in laminate flooring is driven by the strength of its premium brands as well as technical innovations such as water resistance, realistic visuals, beveled edges, deeply embossed in register surfaces and patented installation technologies. The United States resilient industry is highly competitive, and according to industry publications, grew more than 8.2% in 2023. Based on industry publications, in 2023, LVT, sheet vinyl and other various resilient categories generated sales of $11.3 billion out of the $34.1 billion total United States flooring market. The Company believes that it is one of the largest manufacturers and distributors of LVT and sheet vinyl in the United States. The Company’s sheet vinyl operations produce fiberglass backed products, which have proven more popular with consumers in the past several years due to superior performance and durability. The Company has expanded its resilient product portfolio to include a renewable polymer core (RPC) category and a stone polymer core (SPC) category made \n10\nTable of Contents\nIndex to Financial Statements\nwith recycled plastic bottles, both of which are a PVC-free alternatives to traditional resilient products while maintaining waterproof capabilities and exceeding the scratch resistance of traditional LVT.  \nFlooring ROW\nThe Company faces competition in the non-U.S. laminate, wood, LVT and sheet vinyl flooring business from a large number of domestic manufacturers as well as pressures from imports. The Company believes it is one of the largest manufacturers and distributors of laminate flooring in the world, with a focus on premium products, which the Company supplies under some of the best-known and most widely marketed brands in its regions. In addition, the Company believes it has a competitive advantage in its laminate flooring markets as a result of the Company’s industry-leading water resistance, realistic visuals and embossed-in-register surfaces as well as patented installation technologies, all of which allow the Company to differentiate its products in the areas of design, performance, installation and assembly. The Company faces competition in the non-U.S. vinyl flooring channel from a large number of domestic and foreign manufacturers, but believes it has a competitive advantage in its LVT and sheet vinyl markets due to industry-leading design, patented technologies, brand recognition and vertical integration. The Company has elevated the performance of its sheet vinyl collections and is now aggressively placing the product in commercial applications. The Company also extended its sheet vinyl business into Eastern Europe with the acquisition of Polish-based Lentex Flooring. After initially extending its geographic footprint by acquiring national hard surface distributors in Australia and New Zealand, the Company acquired Godfrey Hirst, making the Company the largest manufacturer of carpet in both countries. The Company has integrated its Australasian soft and hard surface businesses to provide a comprehensive offering to residential and commercial customers in the region. In Australia and New Zealand, the Company faces competition from a large number of domestic and foreign manufacturers, but believes it has a competitive advantage in its carpet and hard surface offering due to industry-leading design, patented technologies, brand recognition and vertical integration of manufacturing and distribution. Through the acquisitions of Xtratherm and of Ballytherm, the Company has extended its insulation business to the United Kingdom and Ireland while expanding sales in its core Benelux Region. The Company also increased its European wood panels business by acquiring German-based Berghoef and Otto Schneider (mezzanine flooring) and French-based Panneaux De Corrèze (MDF). \nPatents and Trademarks\nIntellectual property is important to the Company’s business and the Company relies on a combination of patent, copyright, trademark and trade secret laws to protect its interests. The Company holds a substantial portfolio of over 3,800 patents spanning 500 families.\nThe Company uses several trademarks that it considers important in the marketing of its products, including American Olean, Daltile, Decortiles, Durkan, Eliane, Elizabeth, EmilGroup, Feltex, Foss, Godfrey Hirst, IVC Home, Karastan, Kerama Marazzi, Lentex Flooring, Leoline, Marazzi, Moduleo, Mohawk, Mohawk Group, Mohawk Home, Pergo, Quick-Step and\n \nUnilin. These trademarks reflect innovations in design, performance and installation, which represent competitive advantages and provide differentiation from competing brands in the market.\nFlooring ROW owns a number of patent families in Europe and the United States, some of which the Company licenses to manufacturers throughout the world. The Company continues to explore additional opportunities to generate revenue from its patent portfolio.\nMajor Customers\nDuring 2024, no single customer accounted for more than 10% of the Company’s total net sales, and the top 10 customers accounted for less than 20% of the Company’s total net sales. The Company believes the loss of one major customer would not have a material adverse effect on its business.\nHuman Capital\nThe Company’s management team recognizes the importance of its employees to the Company’s overall long-term success.  The Company prioritizes its employees by focusing on a number of human capital objectives, including recruitment, development, engagement and retention, as well as safety, health and well-being. \n    \nThe Company’s talent development initiatives center on the education, exposure and experience of its employees, and the Company’s commitment to sustaining a workforce that mirrors the communities in which it operates. The Company prioritizes the development of early-in-career talent to build and expand future generations of leadership. The Company is also dedicated to building community partnerships and leveraging its employer brand to yield a broad-based applicant pool that attracts all of the community’s best candidates for career opportunities. The Company remains committed to promoting fair, equitable and respectful workplaces where all people have equal opportunities to grow and advance. \n11\nTable of Contents\nIndex to Financial Statements\nThe Company is dedicated to creating a working environment that is free from hazards, promotes employee well‑being and prioritizes safety at every level. The Company fosters a collaborative partnership with its employees to uphold safe and secure workplaces across the globe. Each of the Company’s business segments prioritizes enhancement of safety measures within their respective facilities, with a heightened focus on equipment maintenance, machine guards and peer‑to‑peer feedback. By consolidating safety data from all business segments, the Company calculates its corporate recordable incident rate, which serves as a key indicator of its overall safety performance.\nAs of December 31, 2024, the Company employed approximately 41,900 people, consisting of approximately 16,200 in the United States, approximately 14,200 in Europe and approximately 11,500 in other countries. The majority of the Company’s European manufacturing employees are members of unions. The Company has not experienced any major strikes or work stoppages in recent years and believes that its relations with its employees are good.\nGovernmental Regulations\nAs a global manufacturing company, the\n \nCompany’s operations are subject to numerous federal, state and local laws and regulations, both within and outside the U.S., in areas such as environmental protection, international trade, data privacy, tax, consumer protection, government contracts, climate change and others. The Company is subject to import and export controls, tariffs, and other trade-related regulations and restrictions in the countries in which it has operations or otherwise does business. The Company maintains policies intended to ensure that its operations are conducted in compliance with applicable laws and regulations. The Company believes that it is in compliance, in all material respects, with presently applicable laws and regulations.\nThe Company complies with all laws and regulations regarding protection of the environment, and in many cases where laws and regulations are less restrictive, the Company has established and is following its own standards, consistent with the Company’s commitment to environmental responsibility. These compliance requirements align with the Company’s focus on sustainability initiatives. The Company believes that it is in compliance, in all material respects, with presently applicable governmental provisions relating to environmental protection in the countries in which the Company has manufacturing operations. Compliance with these environmental laws and regulations did not have a material effect on capital expenditures, earnings, or the Company’s competitive position in 2024. While the Company cannot predict policy changes by various regulatory agencies or other unexpected developments, the Company expects that compliance with these laws and regulations will not have a material adverse effect on the Company’s competitive position in 2025.\nAvailable Information\nThe Company’s Internet address is https://www.mohawkind.com. The Company makes available the following reports it files on its website, free of charge, under the heading “Investors”:\n•\nannual reports on Form 10-K;\n•\nquarterly reports on Form 10-Q;\n•\ncurrent reports on Form 8-K; and\n•\namendments to the foregoing reports.\nThe foregoing reports are made available on the Company’s website as soon as practicable after they are filed with, or furnished to the Securities and Exchange Commission (“SEC”). In addition to the Company’s website, the SEC maintains an Internet site that contains the Company’s reports, proxy and information statements, and other information that the Company electronically files with, or furnish to, the SEC at www.sec.gov.",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the Company’s financial condition and results of operations from management's perspective and should be read in conjunction with the consolidated financial statements and related notes included in this report. The discussion in this Form 10-K includes a comparison of fiscal 2024 to fiscal 2023. A similar discussion and analysis that compares fiscal 2023 to fiscal 2022 may be found in Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, of the Company’s Form 10-K for the fiscal year ended December 31, 2023.\nReferences to “Mohawk,” “the Company,” “we,” “our” and “us” refer to Mohawk Industries, Inc. and its consolidated subsidiaries as a whole, unless the context otherwise requires.\nOverview\nMohawk is a significant supplier of every major flooring category with manufacturing operations in 19 nations and sales in approximately 180 countries. Based on its annual sales, the Company believes it is the world’s largest flooring manufacturer. A majority of the Company’s long-lived assets are located in the U.S. and Europe, which are also the Company’s primary markets. Additionally, the Company maintains operations in Australia, Brazil, Malaysia, Mexico, New Zealand, Russia and other parts of the world. The Company is a leading provider of flooring for residential and commercial markets and has earned significant recognition for its innovation in design and performance as well as sustainability.\n \nDuring 2022 and 2023, the Company implemented a number of restructuring actions, productivity initiatives and manufacturing enhancements focused on reducing costs to enhance future performance, including certain facility, asset and product rationalizations and workforce reductions. The Company anticipates that when completed these projects will deliver annual savings of approximately $145 million, with an estimated cost of approximately $215 million. In 2024, the Company announced further restructuring actions, including additional facility, assets and product rationalizations and workforce reductions to further reduce costs and improve the business for the future. The Company anticipates that when completed these projects will deliver annual savings of approximately $140 million, with an estimated cost of approximately $140 million. Execution timelines will vary by project, with some savings extending into 2026.\nThe Company derives a majority of its sales from residential and commercial construction and remodeling. Residential remodeling is the primary sales driver of flooring products and historically most flooring is replaced before a home is listed for sale or just after a home purchase is completed. The combination of high interest rates and inflation has made mortgages less affordable and has increased the cost of home improvement projects, impacting the demand for the Company’s products. Although the U.S. Federal Reserve and the European Central Bank cut interest rates in 2024, home mortgage rates remain elevated globally, “locking in” current homeowners and suppressing housing turnover rates. Persistent inflation continues to hinder consumer discretionary spending, causing consumers to postpone large purchases of durable goods such as flooring. In addition, declining costs in energy and raw materials, coupled with lower industry volumes, have continued to exert pressure on selling prices, although energy prices in certain geographies and materials prices in some product categories remain volatile and may change significantly and unpredictably. \nThe Company has, to some extent, offset the impact of a soft housing market and decreased renovation activity through cost containment, productivity and lower input costs, including through the restructuring actions discussed above. Due to low housing availability, aging stock and greater household formation, the Company believes demand in its markets will accelerate when interest rates decline. \nDue to its global footprint, Mohawk’s business is sensitive to geopolitical conflict, including the Russia-Ukraine conflict and the ongoing conflicts in the Middle East. Since the first quarter of 2022, the Company has suspended new investments in Russia in response to ongoing Russian military actions in Ukraine, and the U.S., the European Union and other governments have imposed and broadened sanctions on Russia as well as on certain individuals and financial institutions. In addition, a prolonged and more expansive conflict in the Middle East region could escalate oil and petroleum-based chemical prices as well as lead to the introduction of sanctions or transportation barriers, though the extent of the impact on the Company’s business and results of operations, as well as the global economy, cannot be predicted. \n \nThe broader consequences of current ongoing military conflicts, which may include further economic sanctions, embargoes, regional instability, and geopolitical shifts; potential retaliatory actions, including nationalization of foreign-owned businesses; increased tensions between the U.S. and countries in which the Company operates; and the extent of the conflict’s effect on the Company’s business and results of operations, as well as the global economy, cannot be predicted. \nIncreased restrictions on global trade, including an increase in U.S. tariffs and any countermeasures to these increases, could result in, among other things, increased input costs, volatility in foreign exchange rates and financial markets, supply chain disruptions, and decreased consumer discretionary spending, any of which may adversely affect the Company’s business and supply chain.\n \nWhile the Company has had success sourcing alternate suppliers of raw materials to counteract supply chain \n27\nTable of Contents\nIndex to Financial Statements\ndisruptions, the\n \nCompany may be negatively impacted by additional supply chain disruption in the future caused by further escalation of geopolitical conflict and increases in global trade restrictions. \nThe Company believes it is well positioned with a strong balance sheet. Based on its current liquidity and available credit, the Company is in a position to finance internal investments, acquisitions and/or additional stock purchases and pay current debt as it becomes due. For information on risk that could impact the Company’s results, please refer to \nRisk Factors\n in Part I, Item 1A of this Form 10-K.\nIn 2024, the Company invested approximately $450 million focused on completing capacity expansion projects and targeted initiatives that will drive cost reduction while improving operational performance. In 2025, the Company plans to invest approximately $520 million focused on completing capacity expansion projects and targeted initiatives that will drive cost reduction while improving operational performance. \nNet earnings attributable to the Company were $517.7 million for 2024 compared to a net loss of $439.5 million for 2023. The change was primarily attributable to lower impairment charges; lower input costs; productivity gains; lower legal settlements, reserves and fees, partially offset by the unfavorable net impact of price and product mix.\nFor the year ended December 31, 2024, the Company generated $1,133.9 million of cash from operating activities.  As of December 31, 2024, the Company had cash and cash equivalents of $666.6 million, of which $485.0 million was in the U.S. and $181.6 million was in other countries.\n28\nTable of Contents\nIndex to Financial Statements\nResults of Operations\n \nFor the Years Ended December 31,\n(In millions)\n2024\n2023\nStatement of operations data:\nNet sales\n$\n10,836.9\n \n100.0 \n%\n11,135.1 \n100.0 \n%\nCost of sales \n(1)\n8,149.2\n \n75.2 \n%\n8,425.5 \n75.7 \n%\nGross profit\n2,687.7\n \n24.8 \n%\n2,709.6 \n24.3 \n%\nSelling, general and administrative expenses \n(2)\n1,984.8\n \n18.3 \n%\n2,119.7 \n19.0 \n%\nImpairment of goodwill and indefinite-lived intangibles\n8.2\n \n0.1 \n%\n877.7 \n7.9 \n%\nOperating income (loss)\n694.7\n \n6.4 \n%\n(287.8)\n(2.6)\n%\nInterest expense\n48.5\n \n0.4 \n%\n77.5 \n0.7 \n%\nOther (income) expense, net \n(3)\n0.2\n \n0.0 \n%\n(10.8)\n(0.1)\n%\nEarnings (loss) before income taxes\n646.0\n \n6.0 \n%\n(354.5)\n(3.2)\n%\nIncome tax expense \n(4)\n128.2\n \n1.2 \n%\n84.9 \n0.8 \n%\nNet earnings (loss) including noncontrolling interests\n517.8\n \n4.8 \n%\n(439.4)\n(3.9)\n%\nLess: Net earnings attributable to noncontrolling interests\n0.1\n \n0.0 \n%\n0.1 \n0.0 \n%\nNet earnings (loss) attributable to Mohawk Industries, Inc.\n$\n517.7\n \n4.8 \n%\n(439.5)\n(3.9)\n%\n(1)\n  Cost of sales includes:\nRestructuring, acquisition and integration-related charges and other costs\n$\n79.7\n \n0.7 \n%\n105.0 \n0.9 \n%\nStep up of acquisition inventory\n—\n \n0.0 \n%\n4.5 \n0.0 \n%\nOther charges\n2.3\n \n0.0 \n%\n— \n0.0 \n%\n(2)\n  Selling, general and administrative expenses include:\nRestructuring, acquisition and integration-related charges\n14.4\n \n0.1 \n%\n27.2 \n0.2 \n%\nReserves and fees for Legal settlements, \n9.9\n \n0.1 \n%\n87.8 \n0.8 \n%\nOther charges\n10.7\n \n0.1 \n%\n— \n0.0 \n%\n(3)\n  Other (income) expense includes:\nRelease of indemnification asset\n1.8\n \n0.0 \n%\n(3.0)\n— \n%\nOther charges\n—\n \n0.0 \n%\n(2.9)\n0.0 \n%\n(4)\n  Income tax expense includes:\nForeign tax regulation change\n2.9\n \n0.0 \n%\n(10.0)\n(0.1)\n%\nReversal of uncertain position - Income taxes  \n(1.8)\n0.0 \n%\n3.0 \n— \n%\n29\nTable of Contents\nIndex to Financial Statements\nYear Ended December 31, 2024, as Compared with Year Ended December 31, 2023 \nNet sales\nNet sales for 2024 were $10,836.9 million compared to net sales of $11,135.1 million for 2023. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $397 million and the unfavorable net impact of foreign exchange rates of approximately $68 million, partially offset by more shipping days for the year ended December 31, 2024 of approximately $92 million; higher sales volume attributable to acquisitions of approximately $48 million and higher sales volume of approximately $27 million.\nGlobal Ceramic\n—Net sales for 2024 were $4,226.6 million compared to net sales of $4,300.1 million for 2023. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $64 million; the unfavorable net impact of foreign exchange rates of approximately $64 million and lower sales volume of approximately $35 million, partially offset by higher sales volume attributable to acquisitions of approximately $48 million and more shipping days for the year ended December 31, 2024 of approximately $42 million.\nFlooring NA\n—Net sales for 2024 were $3,769.9 million compared to net sales of $3,829.4 million for 2023. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $126 million, partially offset by higher sales volume of approximately $37 million.\nFlooring ROW\n—Net sales for 2024 were $2,840.4 million compared to net sales of $3,005.6 million for 2023. The change was primarily attributable to the unfavorable net impact of price and product mix of approximately $207 million.\nQuarterly net sales and the percentage changes in net sales by quarter for 2024 versus 2023 were as follows (dollars in millions):\n2024\n2023\nChange\nFirst quarter\n$\n2,679.4\n \n2,806.2 \n(4.5)\n%\nSecond quarter\n2,801.3\n \n2,950.4 \n(5.1)\n%\nThird quarter\n2,719.0\n \n2,766.2 \n(1.7)\n%\nFourth quarter\n2,637.2\n \n2,612.3 \n1.0 \n%\nFull year\n$\n10,836.9\n \n11,135.1 \n(2.7)\n%\nGross profit\nGross profit for 2024 was $2,687.7 million compared to gross profit of $2,709.6 million for 2023. The change was primarily attributable to lower input costs of approximately $260 million; productivity gains of approximately $151 million, partially offset by the unfavorable net impact of price and product mix of approximately $382 million.\nSelling, general and administrative expenses\nSelling, general and administrative expenses for 2024 were $1,984.8 million compared to $2,119.7 million for 2023. The change was primarily attributable to lower legal settlements, reserves and fees of approximately $78 million.\nImpairment of goodwill and indefinite-lived intangibles\nImpairment of goodwill and indefinite-lived intangibles for 2024 was $8.2 million compared to $877.7 million for 2023. During the fourth quarter of 2024, the Company compared the estimated fair values of its indefinite-lived intangible to their carrying values and determined that there was an impairment charge in Global Ceramic. In 2023, the Company recorded impairment charges as a result of a decrease in the Company’s market capitalization, a higher WACC and macroeconomic conditions. See Note 7, \nGoodwill and Other Intangible Assets\n, of the notes to the Consolidated Financial Statements included in Part II, Item 8 of this Form 10-K for further discussion of the Company’s impairment charges. \n30\nTable of Contents\nIndex to Financial Statements\nOperating income (loss)\nOperating income for 2024 was $694.7 million compared to operating loss of $287.8 million for 2023. The change was primarily attributable to lower impairment charges to reduce the carrying amount of goodwill and indefinite-lived intangibles of approximately $870 million; lower input costs of approximately $214 million; productivity gains of approximately $176 million; lower legal settlements, reserves and fees of approximately $78 million, partially offset by the unfavorable net impact of price and product mix of approximately $385 million.\nGlobal Ceramic\n—Operating income was $249.5 million for 2024 compared to operating loss of $166.4 million for 2023. The change was primarily attributable to lower impairment charges to reduce the carrying amount of goodwill and indefinite-lived intangibles of approximately $419 million; productivity gains of approximately $67 million; lower input costs of approximately $50 million, partially offset by the unfavorable net impact of price and product mix of approximately $92 million.\nFlooring NA\n—Operating income was $238.5 million for 2024 compared to operating loss of $57.2 million for 2023. The change was primarily attributable to lower impairment charges to reduce the carrying amount of goodwill and indefinite-lived intangibles of approximately $216 million; lower input costs of approximately $93 million; productivity gains of approximately $67 million, partially offset by the unfavorable net impact of price and product mix of approximately $109 million.\nFlooring ROW\n—Operating income was $265.2 million for 2024 compared to operating income of $69.7 million for 2023. The change was primarily attributable to lower impairment charges to reduce the carrying amount of goodwill and indefinite-lived intangibles of approximately $235 million; lower input costs of approximately $80 million; productivity gains of approximately $41 million, partially offset by the unfavorable net impact of price and product mix of approximately $184 million.\nInterest expense\nInterest expense was $48.5 million for 2024 compared to interest expense of $77.5 million for 2023. The change was primarily attributable to strong cash flow and the resulting lower debt level.\nOther income and expense, net\nOther expense was $0.2 million for 2024 compared to other income of $10.8 million for 2023. Other income and expense, net did not significantly change for the twelve months ended  December 31, 2024 from twelve months ended December 31, 2023.\nIncome tax expense\nFor 2024, the Company recorded income tax expense of $128.2 million on income before income taxes of $646.0 million for an effective tax rate of 19.8%, as compared to an income tax expense of $84.9 million on loss before income taxes of $354.5 million, resulting in an effective tax rate of (23.9)% for 2023. The change in the effective tax rate was primarily driven by a shift from a loss before income taxes to earnings before income taxes and a decrease in the impairment of non-deductible goodwill.\nLiquidity and Capital Resources\n    \nThe Company’s primary capital requirements are for working capital, capital expenditures and acquisitions. The Company’s capital needs are met primarily through a combination of internally generated funds, commercial paper, bank credit lines, term and senior notes and credit terms from suppliers. As of December 31, 2024, the Company had a total of $1,048.8 million available under its Senior Credit Facility. The Company also maintains local currency revolving lines of credit and other credit facilities to provide liquidity to its businesses around the world.  None of such local facilities are material in amount.\nNet cash provided by operating activities for the year ended 2024 was $1,133.9 million, compared to net cash provided by operating activities of $1,329.2 million for the year ended 2023. The change was primarily attributable to the change in inventory and accounts receivable, partially offset by the change in accounts payable and higher net earnings.   \n31\nTable of Contents\nIndex to Financial Statements\nNet cash used in investing activities for the year ended 2024 was $454.4 million compared to net cash used in investing activities of $970.3 million for the year ended 2023. The change was primarily attributable to the decrease in acquisition costs of $515.4 million and the decrease in capital expenditures of $158.5 million, partially offset by the decrease in the redemptions of short-term investments of $158.0 million (net of purchases of short-term investments).\nNet cash used in financing activities for the year ended 2024 was $629.5 million compared to net cash used in financing activities of $210.6 million for the year ended 2023. The change was primarily attributable to higher payments of term loan facility of $912.3 million, lower proceeds from Senior Notes of $600.0 million, higher share repurchase of $162.8 million and lower proceeds from Senior Credit Facility of $124.1 million (net of payments), partially offset by the higher proceeds from commercial paper of $1,360.9 million (net of payments).\nOn February 10, 2022, the Company’s Board of Directors approved a new share repurchase program, authorizing the Company to repurchase up to $500 million of its common stock (the “2022 Share Repurchase Program”). As of December 31, 2024, there remains $67.8 million authorized under the 2022 Share Repurchase Program.\nAs of December 31, 2024, the Company had cash of $666.6 million, of which $181.6 million was held outside the U.S. The Company plans to permanently reinvest the cash held outside the U.S. The Company believes that its cash and cash equivalents, cash generated from operations and availability under its Senior Credit Facility will be sufficient to meet its planned capital expenditures, working capital investments and debt servicing requirements over the next twelve months.\nOn January 31, 2024, the Company prepaid the entirety of the USD portion of the Term Loan Facility, in the amount of $675.0 million. On February 16, 2024, the Company prepaid the entirety of the EUR portion of the Term Loan Facility, in the amount of €220 million.\nSee Note 9, \nLong-Term Debt\n, of the notes to the Consolidated Financial Statements included in Part II, Item 8 of this Form 10-K for further discussion of the Company’s long-term debt. The Company may continue, from time to time, to retire its outstanding debt through cash purchases in the open market, privately negotiated transactions or otherwise.  Such repurchases, if any, will depend on prevailing market conditions, the Company’s liquidity requirements, contractual restrictions and other factors. The amount involved may be material. \n32\nTable of Contents\nIndex to Financial Statements\nContractual Obligations and Commitments\nThe following is a summary of the Company’s future minimum payments under contractual obligations and commitments as of December 31, 2024 (in millions):\nContractual Obligations and Commitments:\nTotal\n2025\n2026\n2027\n2028\n2029\nThereafter\nLong-term debt, including current maturities\n (1)\n$\n2,245.3\n \n559.4 \n19.2 \n536.4 \n612.4 \n8.0 \n509.9 \nInterest payments on long-term debt and finance leases \n(2)\n300.9\n \n89.9 \n64.6 \n63.9 \n54.2 \n18.7 \n9.6 \nOperating leases\n441.4\n \n134.2 \n113.4 \n81.5 \n55.2 \n26.8 \n30.3 \nPurchase commitments \n(3)\n283.6\n \n170.5 \n26.0 \n23.1 \n16.3 \n15.8 \n31.9 \nExpected pension contributions \n(4)\n3.9\n \n3.9 \n— \n— \n— \n— \n— \nUncertain tax positions \n(5)\n29.5\n \n29.5 \n— \n— \n— \n— \n— \nGuarantees \n(6)\n88.0\n \n88.0 \n— \n— \n— \n— \n— \nTotal\n$\n3,392.6\n \n1,075.4 \n223.2 \n704.9 \n738.1 \n69.3 \n581.7 \n(1)\n \nDebt maturity table excludes deferred loan costs. \n(2) \nFor fixed-rate debt, the Company calculated interest based on the applicable rates and payment dates. For variable-rate debt, the Company estimated average outstanding balances for the respective periods and applied interest rates in effect as of December 31, 2024 to these balances.\n(3) \nIncludes volume commitments, primarily for raw material purchases.\n(4) \nIncludes the estimated pension contributions for 2025 only, as the Company is unable to estimate the pension contributions beyond 2025. The Company’s projected benefit obligation and plan assets as of December 31, 2024 were $81.4 and $75.5, respectively. The projected benefit obligation liability has not been presented in the table above due to uncertainty as to amounts and timing regarding future payments.\n(5) \nExcludes $84.9 of non-current accrued income tax liabilities and related interest and penalties for uncertain tax positions. These liabilities have not been presented in the table above due to uncertainty as to amounts and timing regarding future payments.\n(6) \nIncludes bank guarantees and letters of credit. \nCritical Accounting Policies\nIn preparing the Consolidated Financial Statements in conformity with U.S. generally accepted accounting principles, the Company must make decisions which impact the reported amounts of assets, liabilities, revenues and expenses, and related disclosures. Such decisions include the selection of appropriate accounting principles to be applied and the assumptions on which to base accounting estimates. In reaching such decisions, the Company applies judgment based on its understanding and analysis of the relevant circumstances and historical experience. Actual amounts could differ from those estimated at the time the Consolidated Financial Statements are prepared.\nThe Company’s significant accounting policies are described in Note 1 to the Consolidated Financial Statements included in Part II, Item 8 of this Form 10-K. Some of those significant accounting policies require the Company to make subjective or complex judgments or estimates. Critical accounting estimates are defined as those that are both most important to the portrayal of a company’s financial condition and results and require management’s most difficult, subjective, or complex judgment, often as a result of the need to make estimates about the effect of matters that are inherently uncertain and may change in subsequent periods.\nThe Company believes the following accounting policies require it to use judgments and estimates in preparing its consolidated financial statements and represent critical accounting policies.\n•\nAcquisition accounting. \nThe fair value of the consideration the Company pays for each new acquisition is allocated to tangible assets and identifiable intangible assets, liabilities assumed, any noncontrolling interest in the acquired entity and goodwill.  The accounting for acquisitions involves a considerable amount of judgment and estimate, including the fair value of certain forms of consideration; fair value of acquired intangible assets involving projections of future revenues and cash flows that are then either discounted at an estimated discount rate or measured at an estimated royalty rate; fair value of other acquired assets and assumed liabilities, including potential contingencies; and the useful lives of the acquired assets. The assumptions used are determined at the time of the acquisition in accordance with accepted valuation models.  Projections are developed using internal forecasts, available industry and market data and estimates of long-term rates of growth for the business. The impact of prior or future acquisitions on the Company’s financial position or results of operations may be materially impacted by the change in or initial selection \n33\nTable of Contents\nIndex to Financial Statements\nof assumptions and estimates. See Note 2, \nAcquisitions\n, included in Part II, Item 8 of this Form 10-K for further discussion of business combination accounting valuation methodology and assumptions.  \n•\nGoodwill and other intangibles. \nThe Company performs its annual testing of goodwill and indefinite-lived intangibles on the first day of the fourth quarter of each year. Between annual testing dates, the Company monitors factors such as its market capitalization, comparable company market multiples and macroeconomic conditions to identify conditions that could impact the Company’s assumptions used in the determination of the estimated fair values of the Company’s reporting units and indefinite-lived intangible assets significantly enough to trigger an impairment.\nThe goodwill impairment tests are based on determining the fair value of the specified reporting units based on management judgments and assumptions using the discounted cash flows under the income approach classified in Level 3 of the fair value hierarchy and comparable company market valuation classified in Level 2 of the fair value hierarchy approaches. The Company has identified Global Ceramic, Flooring NA and Flooring ROW as its reporting units for the purposes of allocating and testing for impairment. Indefinite-lived intangibles are recorded and tested for impairment at the asset level. The valuation approaches are subject to key judgments and assumptions that are sensitive to change such as judgements and assumptions about appropriate sales growth rates, operating margins, WACC and comparable company market multiples.\nAs a result of a decrease in the Company’s market capitalization, macroeconomic conditions and an increase in the WACC, the Company determined that a triggering event occurred requiring goodwill impairment testing for each of its reporting units as of September 30, 2023. The impairment tests indicated pre-tax, non-cash goodwill impairment charges related to all 3 reporting units of $870.8 million ($859.7 million net of tax) which the Company recorded during 2023. \nThe Company compared the estimated fair values of its indefinite-lived intangibles to their carrying values and determined that there were impairment charges of $8.2 million ($6.3 million net of tax) in Global Ceramic Segment during the fourth quarter of 2024 and $7.0 million ($5.2 million net of tax) in all 3 reporting units during the third quarter of 2023.\nA significant or prolonged deterioration in economic conditions, continued increases in the costs of raw materials and energy combined with an inability to pass these costs on to customers, a further decline in the Company’s market capitalization or comparable company market multiples, projected future cash flows, or increases in the WACC, could impact the Company’s assumptions and require a reassessment of goodwill or indefinite-lived intangible assets for impairment in future periods.  Future declines in estimated after tax cash flows, increases in the WACC or a decline in market capitalization could result in an additional indication of impairment in one or more of the Company’s reporting units.\n•\nLong-lived assets\n. The Company reviews its long-lived asset groups, which include intangible assets subject to amortization, which for the Company are its patents and customer relationships, for impairment whenever events or changes in circumstances indicate that the carrying amount of such asset groups may not be recoverable. Recoverability of asset groups to be held and used is measured by a comparison of the carrying amount of long-lived assets to future undiscounted net cash flows expected to be generated by these asset groups. If such asset groups are considered to be impaired, the impairment recognized is the amount by which the carrying amount of the asset group exceeds the fair value of the asset group. Assets held for sale are reported at the lower of the carrying amount or fair value less estimated costs of disposal and are no longer depreciated.\n•\nIncome taxes.\n The Company’s effective tax rate is based on its income, statutory tax rates and tax planning opportunities available in the jurisdictions in which it operates. Tax laws are complex and subject to different interpretations by the taxpayer and respective governmental taxing authorities. Significant judgment is required in determining the Company’s tax expense and in evaluating the Company’s tax positions. Deferred tax assets represent amounts available to reduce income taxes payable on taxable income in a future period. The Company evaluates the recoverability of these future tax benefits by assessing the adequacy of future expected taxable income from all sources, including reversal of taxable temporary differences, forecasted operating earnings and available tax planning strategies. These sources of income inherently rely on estimates, including business forecasts and other projections of financial results over an extended period of time. In the event that the Company is not able to realize all or a portion of its deferred tax assets in the future, a valuation allowance is provided. The Company would recognize such amounts through a charge to income in the period in which that determination is made or when tax law changes are enacted. For further information regarding the Company’s valuation allowances, see Note 14,\n Income Taxes,\n included in Part II, Item 8 of this Form 10-K.\n34\nTable of Contents\nIndex to Financial Statements\nIn the ordinary course of business there is inherent uncertainty in quantifying the Company’s income tax positions. The Company assesses its income tax positions and records tax benefits for all years subject to examination based upon the Company’s evaluation of the facts, circumstances and information available as of the reporting date. For those tax positions where it is more likely than not that a tax benefit will be sustained, the Company has recorded the largest amount of tax benefit with a greater than 50% likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information, as required by the provisions of the Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) Topic 740-10. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the Consolidated Financial Statements. For further information regarding the Company’s uncertain tax positions, see Note 14, \nIncome Taxes,\n included in Part II, Item 8 of this Form 10-K.\nRecent Accounting Pronouncements\nSee Note 1, \nSummary of Significant Accounting Policies\n, of the Company’s accompanying Consolidated Financial Statements in Part II, Item 8 of this Form 10-K for a description of recent accounting pronouncements and the potential impact on the Company’s financial statements and disclosures.\nImpact of Inflation\nInflation affects the Company’s manufacturing costs, distribution costs and operating expenses. The Company expects raw material prices, many of which are petroleum-based, to fluctuate based upon worldwide supply and demand of commodities used in the Company’s production processes. Although the Company attempts to pass on increases in raw material, labor, energy and fuel-related costs to its customers, the Company’s ability to do so is dependent upon the rate and magnitude of any increase, competitive pressures and market conditions for the Company’s products. There have been in the past, and may be in the future, periods of time during which increases in these costs cannot be fully recovered. In the past, the Company has often been able to enhance productivity and develop new product innovations to help offset increases in costs resulting from inflation in its operations.\nSeasonality\nThe Company is a calendar year-end company. Global Ceramic and Flooring NA typically have higher net sales in the second and third quarters. Flooring ROW typically has higher net sales in the first and second quarters. Because periods of economic downturn can affect the seasonality of each segment, sales for any one quarter are not necessarily indicative of the sales that may be achieved for any other quarter or for the full year.  \n35\nTable of Contents\nIndex to Financial Statements",
  "item2": null
}