{
  "source_file": "mkc-20241130.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nMcCormick is a global leader in flavor. We manufacture, market, and distribute spices, seasoning mixes, condiments, and other flavorful products to the entire food industry: retailers, food manufacturers, and foodservice businesses. We also are partners in a number of joint ventures that are involved in the manufacture and sale of flavorful products, the most significant of which is McCormick de Mexico. Our major sales, distribution, and production facilities are located in North America, Europe, and China. Additional facilities are based in Australia, Central America, Thailand, and South Africa.\nBusiness Segments \nWe operate in two business segments: consumer and flavor solutions. Demand for flavor is growing globally, and across both segments, we have the customer base and product breadth to participate in all types of eating occasions. Our products deliver flavor when cooking at home, dining out, purchasing a quick service meal, or enjoying a snack. We offer our customers and consumers a range of products, extending from premium to value-priced, to meet the increasing demand for certain product attributes such as clean-label, organic, natural, reduced sodium, gluten-free, and non-GMO (genetically modified organisms). \nConsistent with market conditions in each segment, our consumer segment has a higher overall profit margin than our flavor solutions segment. In 2024, the consumer segment contributed approximately 57% of consolidated net sales and 69% of consolidated operating income, and the flavor solutions segment contributed approximately 43% of consolidated net sales and 31% of consolidated operating income.\nConsumer Segment.\n \nFrom locations around the world, our brands reach consumers in approximately 150 countries and territories. Our leading brands in the Americas include McCormick\n®\n, French’s\n®\n, Frank’s RedHot\n®\n, Lawry’s\n®\n, Cholula Hot Sauce\n®\n, and Club House\n®\n, as well as brands such as Gourmet Garden\n® \nand OLD BAY\n®\n. We also market authentic regional and ethnic brands such as Zatarain’s\n®\n, Stubb's\n®\n, Thai Kitchen\n®\n, \nand Simply Asia\n®\n. In the Europe, Middle East, and Africa (EMEA) region, our major brands include the Ducros\n®\n, Schwartz\n®\n, \nKamis\n®\n, and La Drogheria\n®\n brands of spices, herbs, and seasonings and an extensive line of Vahiné\n®\n brand dessert items. In the Asia/Pacific (APAC) region, we market our spices and seasonings under the McCormick brand, DaQiao\n®\n, as well as other brands, our dessert products under the Aeroplane\n®\n brand, and packaged chilled herbs under the Gourmet Garden\n®\n brand.\nApproximately two-thirds of our consumer segment sales are spices and seasonings and condiments and sauces.\n \nWithin the spices and seasoning category, we are the brand leader globally and a category leader in our key markets. In the condiments and sauces category, we are one of the brand leaders globally and in the U.S. There are numerous competitive brands of spices and seasonings and condiments and sauces in the U.S., as well as additional brands in international markets. Some are owned by large food manufacturers, while others are supplied by small privately-owned companies. In this competitive environment, we are leading with innovation and brand marketing, applying our analytical tools to help customers optimize the profitability of their sales of these categories, while simultaneously working to increase our own sales and profit.\nOur customers span a variety of retailers that include grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce retailers, served directly and indirectly through distributors or wholesalers. In addition to marketing our branded products to these customers, we are a leading supplier of private label items, also known as store brands. In our businesses in China, foodservice sales are managed by and reported in our consumer segment.\nFlavor Solutions Segment.\n \nIn our flavor solutions segment, we provide a wide range of products to multinational food manufacturers and foodservice customers. The foodservice customers are supplied with branded, packaged products both directly by us and indirectly through distributors, with the exception of our businesses in China, where foodservice sales are managed by and reported in our consumer segment. We supply food manufacturers and foodservice customers with customized flavor solutions, and many of these customer relationships have been active for decades. Our range of flavor solutions remains one of the broadest in the industry and includes seasoning blends, spices and herbs, condiments, coating systems, and compound flavors. In addition to a broad range of flavor solutions, our long-standing customer relationships are evidence of our effectiveness in building customer \n2\nintimacy. Our customers benefit from our expertise in many areas, including sensory testing, culinary research, food safety, and flavor application.\nOur flavor solutions segment has a number of competitors. Some tend to specialize in a particular range of products and have a limited geographic reach. Other competitors include large publicly held flavor companies that are more global in nature and tend to focus on providing integrated solutions extending beyond flavor through the use of other functional and nutritional ingredients.\nRaw Materials\nThe most significant raw materials used in our business are dairy products, pepper, onion, garlic, capsicums (red peppers and paprika), tomato products, sugar and salts. Pepper and other spices and herbs are generally sourced from countries other than the U.S. Other raw materials, like dairy products and onion, are primarily sourced locally, either within the U.S. or from our international locations. Because these raw materials are agricultural products, they are subject to fluctuations in market price and availability caused by weather, growing and harvesting conditions, market conditions, including inflationary cost increases, and other factors beyond our control. \nWe respond to this volatility in a number of ways, including strategic raw material purchases, purchases of raw material for future delivery, customer price adjustments, and cost savings from our Comprehensive Continuous Improvement (CCI) program. There has been, and there could continue to be, a difference between the timing of when these customer price adjustments and cost savings impact our results of operations and when the impact of cost inflation occurs. Additionally, in some instances, the pricing actions we take have been impacted by price elasticity which unfavorably impacts our sales volume and mix.\nIn addition, we rely on third-party transportation providers to deliver raw materials and our products to our customers. There has been, and could continue to be, reduced availability of transportation capacity due to labor shortages and higher fuel costs, which have caused and may continue to cause an increase in transportation costs for us and our suppliers.\nCustomers\nOur products are sold directly to customers as well as through brokers, wholesalers, and distributors. In the consumer segment, products are then sold to consumers under a number of brands through a variety of retail channels, including grocery, mass merchandise, warehouse clubs, discount and drug stores, and e-commerce. In the flavor solutions segment, products are used by food and beverage manufacturers as ingredients in their finished goods and by foodservice customers for menu items, as well as provided to their own customers for dine-in and take-out occasions, all to enhance the flavor of their foods. Customers in the flavor solutions segment include food manufacturers and the foodservice industry, supplied through a variety of channels, including directly and indirectly through distributors, wholesale foodservice suppliers, and e-commerce.\nWe have a large number of customers for our products. Sales to one of our consumer segment customers, Wal-Mart Stores, Inc., accounted for consolidated sales of approximately 12% in 2024, 2023 and 2022. Sales to one of our flavor solutions segment customers, PepsiCo, Inc., accounted for consolidated sales of approximately 13% in 2024, 13% in 2023, and 11% in 2022. In 2024, 2023, and 2022, the top three customers in our flavor solutions segment represented between 47% and 49% of our global flavor solutions sales. \nTrademarks, Licenses and Patents\nWe own a number of trademark registrations. Although in the aggregate these trademarks are material to our business, the loss of any one of those trademarks, with the exception of our “McCormick,” “French’s,” “Frank’s RedHot,” “Lawry’s,” “Zatarain’s,” “Cholula,” “Stubb's,” “Club House,” “Ducros,” “Schwartz,” “Vahiné,” \"OLD BAY,\" \"Simply Asia,\" \"Thai Kitchen,\" “Kamis,” “La Drogheria,” \"DaQiao,\" and \"Gourmet Garden\" trademarks, would not have a material adverse effect on our business. The “Mc – McCormick” trademark is extensively used in connection with the sale of our food products in the U.S. and certain non-U.S. markets. The terms of the trademark registrations are prescribed by law, and the registrations will be renewed as long as we deem them useful.\nWe have entered into a number of license agreements authorizing the use of our trademarks by affiliated and non-affiliated entities. The loss of these license agreements would not have a material adverse effect on our business. The term of the license agreements is generally two-to-three years or until such time as either party terminates the agreement. Those agreements with specific terms may be renewable upon agreement of the parties.\nWe also own various patents, none of which are individually material to our business.\n3\nSeasonality\nDue to seasonal factors inherent in the business, our sales, operating income, and cash from operations are generally higher in the fourth quarter because of the holiday season. This seasonality reflects customer and consumer buying patterns, primarily in the consumer segment.\nWorking Capital\nIn order to meet increased demand for our consumer products during our fourth quarter, we usually build our inventories during the third quarter of the fiscal year. We generally finance working capital items (inventory and receivables) through short-term borrowings, which include the use of lines of credit and the issuance of commercial paper. For a description of our liquidity and capital resources, see Note 5 of the notes to our consolidated financial statements and the “Liquidity and Financial Condition” section of “Management’s Discussion and Analysis.”\nCompetition\nEach segment operates in highly competitive markets around the world. In this environment, our growth strategies include customer engagement and product innovation based on consumer insights. In the consumer segment, we are building brand recognition and loyalty through advertising and promotions. In our flavor solutions segment, we differentiate ourselves through culinary and consumer-inspired flavor development, as well as the breadth of our product offering and customer engagement.\nGovernmental Regulation\nWe are subject to numerous laws and regulations around the world that apply to our global businesses. In the U.S., the safety, production, transportation, distribution, advertising, labeling, and sale of many of our products and their ingredients are subject to the Federal Food, Drug, and Cosmetic Act; the Food Safety Modernization Act; the Federal Trade Commission Act; state consumer protection laws; competition laws; anti-corruption laws; customs and trade laws; federal, state and local workplace health and safety laws; privacy laws; federal, state, and local environmental protection laws; and other federal, state, and local statutes and regulations. Outside the U.S., our business is subject to numerous similar statutes, laws, and regulatory requirements.\nHuman Capital\nWe believe in the power of people—fostering a culture for our employees that embodies respect and collaboration across the organization. Our high-performance culture is rooted in shared values and respect for all contributions of every employee. Our key human capital objectives are to attract, retain, and develop the highest quality talent. We employ various human resource programs in support of these objectives. We believe diversity, equity, and inclusion are at the core of our values and strategic business priorities. Throughout our business, we champion equality, supporting parity for women and under-represented groups, as we work to create ethical, safe, and supportive workplaces where our employees thrive. We believe a diverse and inclusive workplace results in business growth and encourages increased innovation, retention of talent, and a more engaged workforce. We have various employee ambassador groups that provide a supportive and collaborative space for employees to come together and promote inclusion. We prioritize the mental health and wellness of our employees by offering and encouraging participation in various programs and initiatives. Respect for human rights is fundamental to our business and its commitment to ethical conduct.\nWe had approximately 14,100 full-time employees worldwide as of November 30, 2024. Our operations have not been affected significantly by work stoppages, and, in the opinion of management, employee relations are good. We have approximately 400 employees in the U.S. who are covered by a collective bargaining contract. At our subsidiaries outside the U.S., approximately 2,500 employees are covered by collective bargaining agreements or similar arrangements. \nThrough our continuous listening strategy, we measure employee engagement on an ongoing basis to solicit feedback and understand the views of our employees, work environment, and culture. The results from these surveys are used to implement programs and processes designed to enhance employee engagement and improve the overall employee experience.\nWe are committed to the safety, health, and security of our employees. We believe a hazard-free environment is a critical enabler for the success of our business. Throughout our operations, we strive to ensure that all of our employees have access to safe workplaces that allow them to succeed in their jobs.\nInformation about our Executive Officers\nIn addition to the executive officers indicated in the 2025 Proxy Statement incorporated by reference in Part III, Item 10 of this Report, the other executive officers of McCormick are Marcos M. Gabriel, Katherine A. Jenkins, and Ana G. Sanchez.\n4\nMr. Gabriel is 53 years old and, during the last five years has held the following positions within McCormick:  December 2024 to present - Executive Vice President and Chief Financial Officer; March 2024 to November 2024 - Senior Vice President Global Finance and Capital Markets; June 2023 to February 2024 - Senior Vice President, Finance and Global Business Services; August 2022 to May 2023 - Chief Transformation Officer; and August 2017 to July 2020 - Chief Financial Officer Americas. \nMs. Jenkins is 56 years old and, during the last five years, has held the following positions with McCormick: June 2023 to present - Chief Growth Officer; June 2022 to May 2023 – Chief Strategy Officer & Senior Vice President, Investor Relations; and January 2017 to June 2022, Vice President, Investor Relations.\nMs. Sanchez is 49 years old and, during the last five years, has held the following positions with McCormick:  February 2022 to present - President, EMEA; February 2020 to January 2022 – Vice President Consumer, EMEA, and November 2018 to January 2020 – Vice President Marketing, EMEA. \nOperations Outside of the U.S.\nWe are subject in varying degrees to certain risks typically associated with a global business, such as local economic and market conditions, exchange rate fluctuations, and restrictions on investments, royalties, and dividends. In fiscal year 2024, approximately 39% of sales were from non-U.S. operations. For information on how we manage some of these risks, see the “Market Risk Sensitivity” section of “Management’s Discussion and Analysis.”\nForward-Looking Information\nCertain statements contained in this report, including statements concerning expected performance such as those relating to net sales, gross margin, earnings, cost savings, special charges, acquisitions, brand marketing support, volume and product mix, income tax expense, and the impact of foreign currency rates are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. These statements may be identified by the use of words such as “may,” “will,” “expect,” \"should,\" \"anticipate,\" \"intend,\" “believe,” “plan,” and similar expressions. These statements may relate to: general economic and industry conditions, including consumer spending rates, recessions, interest rates, and availability of capital; expectations regarding sales growth potential in various geographies and markets, including the impact of brand marketing support, product innovation, and customer, channel, category, heat platform, and e-commerce expansion; expected trends in net sales, earnings performance, and other financial measures; the expected impact of pricing actions on the Company's results of operations, including our sales volume and mix as well as gross margins;  the expected impact of the inflationary cost environment on our business; the anticipated effects of factors affecting our supply chain, including the availability and prices of commodities and other supply chain resources such as raw materials, packaging, labor, and transportation; the expected impact of productivity improvements, including those associated with our CCI program and the Global Business Services operating model initiative; the ability to identify, attract, hire, retain, and develop qualified personnel and the next generation of leaders; the impact of ongoing conflicts, including those between Russia and Ukraine and the war in the Middle East, particularly regarding the potential for broader economic disruption; expected working capital improvements; the anticipated timing and costs of implementing our business transformation initiative, which includes the implementation of a global enterprise resource planning (ERP) system; the expected impact of accounting pronouncements; expectations regarding pension and postretirement plan contributions and anticipated charges associated with those plans; the holding period and market risks associated with financial instruments; the impact of foreign exchange fluctuations; the adequacy of internally generated funds and existing sources of liquidity, such as the availability of bank financing; the anticipated sufficiency of future cash flows to enable payments of interest, repayment of short- and long-term debt, working capital needs, planned capital expenditures, quarterly dividends, and our ability to obtain additional short- and long-term financing or issue additional debt securities; and expectations regarding purchasing shares of McCormick's common stock under the existing repurchase authorization.\nThese and other forward-looking statements are based on management’s current views and assumptions and involve risks and uncertainties that could significantly affect expected results. Results may be materially affected by factors such as: the Company's ability to drive revenue growth; the Company's ability to increase pricing to offset, or partially offset, inflationary pressures on the cost of our products; damage to the Company's reputation or brand name; loss of brand relevance; increased private label use; the Company's ability to drive productivity improvements, including those related to our CCI program and other streamlining actions; product quality, labeling, or safety concerns; negative publicity about our products; actions by, and the financial condition of, competitors and customers; the longevity of mutually beneficial relationships with our large customers; the ability to identify, interpret and react to changes in consumer preference and demand; business interruptions due to natural disasters, unexpected events or public health crises; issues affecting the Company's supply chain and procurement of raw \n5\nmaterials, including fluctuations in the cost and availability of raw and packaging materials; labor shortage, turnover and labor cost increases; the impact of the ongoing conflicts between Russia and Ukraine and the war in the Middle East, including the potential for broader economic disruption; government regulation, and changes in legal and regulatory requirements and enforcement practices; the lack of successful acquisition and integration of new businesses; global economic and financial conditions generally, availability of financing, interest and inflation rates, and the imposition of tariffs, quotas, trade barriers and other similar restrictions; foreign currency fluctuations; the effects of our amount of outstanding indebtedness and related level of debt service as well as the effects that such debt service may have on the Company's ability to borrow or the cost of any such additional borrowing, our credit rating, and our ability to react to certain economic and industry conditions; impairments of indefinite-lived intangible assets; assumptions we have made regarding the investment return on retirement plan assets, and the costs associated with pension obligations; the stability of credit and capital markets; risks associated with the Company's information technology systems, including the threat of data breaches and cyber-attacks; the Company's inability to successfully implement our business transformation initiative; fundamental changes in tax laws; including interpretations and assumptions we have made, and guidance that may be issued, and volatility in our effective tax rate; climate change; Environmental, Social and Governance (ESG) matters; infringement of intellectual property rights, and those of customers; litigation, legal and administrative proceedings; the Company's inability to achieve expected and/or needed cost savings or margin improvements; negative employee relations; and other risks described herein under Part I, Item 1A \"Risk Factors.\"\nActual results could differ materially from those projected in the forward-looking statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law.\nAvailable Information\nOur principal corporate internet website address is: www.mccormickcorporation.com. We make available free of charge through our website our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after such documents are electronically filed with, or furnished to, the U.S. Securities and Exchange Commission (the SEC). The information and other content contained on our website are not part of (or incorporated by reference in) this report or any other document we file with the SEC. The SEC maintains an internet website at www.sec.gov that contains reports, proxy and information statements, and other information regarding McCormick. Our website also includes our Corporate Governance Guidelines, Business Ethics Policy and charters of the Audit Committee, Compensation & Human Capital Committee, and Nominating/Corporate Governance Committee of our Board of Directors.",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to help the reader understand McCormick & Company, Incorporated, our operations, and our present business environment from the perspective of management. MD&A is provided as a supplement to, and should be read in conjunction with, our financial statements and the accompanying notes thereto contained in Item 8 of this report. We use certain non-GAAP information—more fully described below under the caption Non-GAAP Financial Measures—that we believe is important for purposes of comparison to prior periods and development of future projections and earnings growth prospects. This information is also used by management to measure the profitability of our ongoing operations and analyze our business performance and trends. The dollar and share information in the charts and tables in MD&A are in millions, except per share data. \nMcCormick is a global leader in flavor. We manufacture, market, and distribute spices, seasoning mixes, condiments and other flavorful products to the entire food and beverage industry–retailers, food manufacturers and foodservice businesses. We manage our business in two operating segments, consumer and flavor solutions, as described in Item 1 of this report.\nOur long-term annual growth objectives in constant currency are to increase sales 4% to 6%, increase adjusted operating income 7% to 9% and increase adjusted earnings per share 9% to 11%. Our actual annual results can vary from our long-term growth objectives.\nOver time, we expect to grow sales with similar contributions from: 1) our base business – driven by brand marketing support, category management, and differentiated customer engagement; 2) new products; and 3) acquisitions. \nBase Business \n– We expect to drive sales growth by optimizing our brand marketing investment through improved speed, quality, and effectiveness. We measure the return on our brand marketing investment and identify digital marketing as one of our highest return investments in brand marketing support. Through digital marketing, we are connecting with consumers in a personalized way to deliver recipes, provide cooking advice, and help them discover new products.\nNew Products \n– For our consumer segment, we believe that scalable and differentiated innovation continues to be one of the best ways to distinguish our brands from our competition, including private label. We are introducing products for every type of cooking occasion, from gourmet, premium items to convenient and value-priced flavors. \nFor flavor solutions customers, we are developing seasonings for snacks and other food products, as well as flavors for new menu items. We have a strong pipeline of flavor solutions products aligned with our customers’ new product launch plans, many of which include clean-label, organic, natural, and “better-for-you” innovation. With over 20 \n22\nproduct innovation centers around the world, we are supporting the growth of our brands and those of our flavor solutions customers with products that appeal to local consumers.\nAcquisitions \n– Acquisitions are expected to approximate one-third of our sales growth over time. We focus on acquisition opportunities that meet the growing demand for flavor and health. Geographically, our focus is on acquisitions that build scale where we currently have presence in both developed and emerging markets.\nExecutive Summary\nIn 2024, we achieved net sales growth of 0.9% over the 2023 level due to the following factors: \n•\nVolume and product mix favorably impacted our net sales growth by 0.3%, exclusive of divestitures. The consumer segment experienced favorable volume and product mix of 0.8% and the flavor solutions segment experienced unfavorable volume and product mix of 0.3%. \n•\nPricing actions contributed 0.5% to the increase in net sales, driven by the favorable impact of pricing actions in our flavor solutions segment.\n•\nDivestitures negatively impacted our net sales by 0.2%. \n•\nNet sales were favorably impacted by fluctuations in currency rates by 0.3%. \n•\nExcluding the impact of divestitures and fluctuations in currency rates, we grew sales, on an organic basis, by 0.8% over the prior year. \nOperating income was $1,060.3 million in 2024 and $963.0 million in 2023. We recognized $9.5 million and $61.2 million of special charges in 2024 and 2023, respectively, related to organization and streamlining actions. In 2024, operating income was positively impacted by the higher level of sales and an improvement in our gross profit margin as a percentage of sales of 90 basis points as compared to the prior year.  The gross profit margin improvement was driven by the effects of favorable pricing actions, favorable product and customer mix, less scrapped inventory, and cost savings led by our CCI and Global Operating Effectiveness (GOE) programs which were partially offset by higher conversion costs, all as compared to the prior year.  A higher level of SG&A expenses resulted in a 40 basis point increase in SG&A as a percentage of sales with approximately half of that basis point increase attributable to an increase in advertising and promotion spend.  In addition, the higher level of SG&A expenses was driven by increased selling and marketing costs and a higher level of research and development expenses that were partially offset by, lower performance-based employee and stock based compensation expense and cost savings led by our CCI and GOE programs, all as compared to the prior year. Excluding special charges, adjusted operating income was $1,069.8 million in 2024, representing a 4.5% increase compared to $1,024.2 million in 2023. In constant currency, adjusted operating income increased 4.6%. For further details and a reconciliation of non-GAAP to reported amounts, see the subsequent discussion under the heading \"Non-GAAP Financial Measures\".\nDiluted earnings per share was $2.92 in 2024 and $2.52 in 2023. In 2024, diluted earnings per share growth was driven primarily by higher operating income, which included the effects of lower special charges, an increase in income from unconsolidated operations and a decrease in the effective tax rate. Special charges lowered earnings per share by $0.03 and $0.18 in 2024 and 2023, respectively. Excluding the effects of special charges, adjusted diluted earnings per share was $2.95 in 2024, compared to $2.70 in 2023, representing an increase of 9.3%.\nNet cash provided by operating activities was $921.9 million, $1,237.3 million, and $651.5 million in 2024, 2023, and 2022, respectively. In 2024, we continued to have a balanced use of cash for debt repayment, capital expenditures, and the return of cash to shareholders through dividends and share repurchases. We are using our cash to fund shareholder dividends, with annual increases in each of the past 39 years, and to fund capital expenditures and acquisitions. In 2024, the return of cash to our shareholders through dividends and share repurchases was $504.1 million. \nA detailed review of our fiscal 2024 performance compared to fiscal 2023 appears in the section titled “Results of Operations – 2024 Compared to 2023.”  A detailed review of our fiscal 2023 performance compared to our fiscal 2022 performance is set forth in Part II, Item 7 of our Form 10-K for the fiscal year ended November 30, 2023 under the caption “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – 2023 Compared to 2022,” which is incorporated herein by reference.\n2025 Outlook\nIn 2025, we expect net sales to grow between 0% and 2% compared to our 2024 net sales, including a 1% unfavorable impact from foreign currency rates, or to grow from 1% to 3% on an organic basis. We anticipate that sales in 2025 will benefit from favorable volume and product mix.\n23\nWe expect our 2025 gross profit margin to improve by 50 to 100 basis points from the 38.5% gross profit margin reported in 2024. This projected increase is primarily driven by (i) positive effects from product mix changes, (ii) anticipated cost savings from our Comprehensive Continuous Improvement (CCI) program, and (iii) a low single-digit percentage impact of inflation in 2025 compared to 2024.\nFor 2025, we anticipate an increase in operating income of 3% to 5% over the 2024 level, including a 1% unfavorable impact from foreign currency rates. This anticipated increase in operating income reflects the expected rise in our gross profit margin and SG&A cost savings from our CCI program, although these will be partially offset by investments aimed at driving volume growth, particularly in brand marketing. We project our brand marketing investments in 2025 to rise by high-single digits compared to 2024. Additionally, we expect approximately $15 million in special charges related to previously announced organizational and streamlining actions; in 2024, special charges totaled $9.5 million. Excluding these special charges, we expect adjusted operating income in 2025 to increase by 3% to 5%, which includes a 1% unfavorable impact from foreign currency rates, or to increase by 4% to 6% on a constant currency basis.\nWe estimate that our 2025 effective tax rate, including the net favorable impact of anticipated discrete tax items, although at a lower amount than in 2024, will be 22.0% as compared to 20.5% in 2024. Excluding projected taxes associated with special charges, we estimate that our adjusted effective tax rate will be approximately 22.0% in 2025, as compared to an adjusted effective tax rate of 20.5% in 2024. \nWe also expect that our income from unconsolidated operations, including the performance of our largest joint venture, McCormick de Mexico, will decline by a mid-teen percentage rate from the 2024 level, reflecting the strengthening of the U.S. dollar against the Mexican peso.\nDiluted earnings per share was $2.92 in 2024. Diluted earnings per share for 2025 is projected to range from $2.99 to $3.04. Excluding the per share impact of special charges, adjusted diluted earnings per share was $2.95 in 2024. Adjusted diluted earnings per share, excluding an estimated per share impact from special charges of $0.04, is projected to range from $3.03 to $3.08 in 2025. We expect adjusted diluted earnings per share to increase by 3% to 5%, which includes a 2% unfavorable impact from currency rates, or to increase by 5% to 7% on a constant currency basis over adjusted diluted earnings per share of $2.95 in 2024.\nRESULTS OF OPERATIONS—2024 COMPARED TO 2023\n2024\n2023\nNet sales\n$\n6,723.7 \n$\n6,662.2 \nPercent growth\n0.9 \n%\n4.9 \n%\nComponents of percent growth in net sales\n–\nincrease (decrease):\nVolume and product mix\n0.3 \n%\n(2.6)\n%\nPricing actions\n0.5 \n%\n8.5 \n%\nDivestiture\n(0.2)\n%\n(0.4)\n%\nForeign exchange\n0.3 \n%\n(0.6)\n%\nSales for 2024 increased by 0.9% from 2023 and by 0.8% on an organic basis (that is, excluding the impact of divestitures and foreign currency exchange as more fully described under the caption, Non-GAAP Financial Measures). Pricing actions, primarily implemented during the prior year, increased sales by 0.5% as compared to 2023. Favorable volume and product mix increased sales by 0.3%. The divestiture of our Giotti canning business unfavorably impacted sales by 0.2% as compared to the prior year. Sales were impacted by favorable foreign currency rates that increased sales by 0.3% in 2024 as compared to the prior year.  Excluding divestitures and the impact of foreign currency rates, our organic sales growth was 0.8%, as compared to 2023. \n2024\n2023\nGross profit\n$\n2,591.0 \n$\n2,502.5 \nGross profit margin\n38.5 \n%\n37.6 \n%\nIn 2024, gross profit increased by $88.5 million, or 3.5%, from 2023. Our gross profit margin for 2024 was 38.5%, an increase of 90 basis points from 37.6% in 2023. The increase was driven by the favorable impact of our pricing actions, favorable product and customer mix, less scrapped inventory and cost savings led by our CCI and GOE programs. These favorable impacts were partially offset by higher conversion costs, as compared to 2023.\n24\n2024\n2023\nSelling, general & administrative expense \n$\n1,521.2 \n$\n1,478.3 \nPercent of net sales\n22.6 \n%\n22.2 \n%\nSelling, general and administrative (SG&A) expense increased by $42.9 million in 2024 as compared to 2023. That increase in SG&A expense was primarily a result of increased advertising and promotional spend, increased selling and marketing costs and a higher level of research and development expenses which were partially offset by lower performance-based employee and stock-based compensation expense, all as compared to 2023. SG&A as a percent of net sales for 2024 increased by 40 basis points from the prior year level, as the net impact of the previously mentioned factors was partially offset by the impact of the higher sales base.\n2024\n2023\nTotal special charges\n$\n9.5 \n$\n61.2 \nWe regularly evaluate whether to implement changes to our organization structure to reduce fixed costs, simplify or improve processes, and improve our competitiveness, and we expect to continue to evaluate such actions in the future. From time to time, those changes are of such significance in terms of both up-front costs and organizational/ structural impact that we obtain advance approval from our Management Committee and classify expenses related to those changes as special charges in our financial statements. \nDuring 2024, we recorded $9.5 million of special charges, consisting principally of $4.5 million associated with the GOE program and $5.0 million associated with the transition of a manufacturing facility in EMEA.\nDuring 2023, we recorded $61.2 million of special charges, consisting principally of $42.8 million associated with the GOE program, $8.7 million associated with the transition of a manufacturing facility in EMEA, and streamlining actions of $8.8 million in the Americas region and $0.9 million in the EMEA region.\nDetails with respect to the composition of special charges are included in the accompanying notes to our financial statements contained in Item 8 of this report. \n2024\n2023\nOperating income\n$\n1,060.3 \n$\n963.0 \nPercent of net sales\n15.8 \n%\n14.5 \n%\nOperating income increased by $97.3 million, or 10.1%, from $963.0 million in 2023 to $1,060.3 million in 2024. Special charges decreased by $51.7 million in 2024, as compared to 2023, positively impacting operating income. Operating income as a percentage of net sales increased by 130 basis points in 2024, to 15.8% in 2024 from 14.5% in 2023 as a result of the factors previously described. Excluding the effect of special charges, adjusted operating income was $1,069.8 million in 2024 as compared to $1,024.2 million in 2023, an increase of $45.6 million or 4.5% from the 2023 level. Adjusted operating income as a percentage of net sales increased by 50 basis points in 2024, to 15.9% in 2024 from 15.4% in 2023.\n2024\n2023\nInterest expense\n$\n209.4 \n$\n208.2 \nOther income, net\n47.4 \n43.9 \nInterest expense was $1.2 million higher in 2024 as compared to the prior year, as a reduction in average borrowing levels was more than offset by the effects of higher interest rates on borrowings. Other income increased $3.5 million as compared to the prior period, driven by an increase in interest income, partially offset by a higher level of foreign currency exchange losses. \n2024\n2023\nIncome from consolidated operations before income taxes\n$\n898.3 \n$\n798.7 \nIncome tax expense\n184.0 \n174.5 \nEffective tax rate\n20.5 \n%\n21.8 \n%\nThe effective tax rate for 2024 was 20.5%, compared to 21.8% in 2023. This reduction in our effective tax rate is primarily due to a higher level of net discrete tax benefits recorded for 2024. Specifically, net discrete tax benefits amounted to $31.7 million in 2024, an increase of $22.1 million from $9.6 million in 2023.\n25\nThe $31.7 million of net discrete tax benefits for 2024 principally included (i) $19.4 million of tax benefits associated with the recognition of a deferred tax asset related to an international legal entity reorganization, (ii) $12.3 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with both the effective settlement from the conclusion of a tax examination and the expiration of statutes of limitations, (iii) $6.0 million of tax benefits resulting from state tax matters, and related deferred taxes, (iv) $1.8 million of tax benefit from an adjustment to a prior year tax accrual and related deferred taxes based on final returns filed, (v) $6.2 million of tax expense associated with the adjustment of valuation allowances due to changes in judgment about the realizability of deferred tax assets, and (vi) $1.8 million of tax expense related to certain unremitted prior year earnings.\nThe $9.6 million of net discrete tax benefits for 2023 principally included (i) $5.6 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with both the settlement and the expiration of statutes of limitation, (ii) $3.2 million of tax benefit associated with the release of valuation allowances due to changes in judgment regarding the realizability of deferred tax assets, (iii) $0.9 million of tax benefit from an adjustment to a prior year tax accrual and related deferred taxes based on final returns filed, and (iv) $1.8 million of tax expense related to certain unremitted prior year earnings.\nSee Note 12 of notes to our consolidated financial statements for a more detailed reconciliation of the U.S. federal tax rate with the effective tax rate.\nNumerous countries have enacted the Organization of Economic Corporation and Development’s framework on a global 15% minimum tax, referred to as Pillar 2, which are generally effective for our fiscal year ending November 30, 2025. We do not expect a material increase to our effective tax rate associated with the adoption of these model rules in the countries in which we operate. \n2024\n2023\nIncome from unconsolidated operations\n$\n74.2 \n$\n56.4 \nIncome from unconsolidated operations, which is presented net of the elimination of earnings attributable to non-controlling interests, increased $17.8 million in 2024 from the prior year. The increase was driven by higher earnings of our largest joint venture, McCormick de Mexico. We own 50% of most of our unconsolidated joint ventures, including McCormick de Mexico, that comprised 95% of the income of our unconsolidated operations for both 2024 and 2023.\nWe reported diluted earnings per share of $2.92 in 2024, compared to $2.52 in 2023. The table below outlines the major components of the change in diluted earnings per share from 2023 to 2024. \n2023 Earnings per share—diluted\n$\n2.52 \nIncrease in operating income\n0.13 \nDecrease in special charges, net of taxes\n0.15 \nIncrease in other income\n0.01 \nIncrease in income from unconsolidated operations\n0.06 \nImpact of change in effective income tax rate, excluding taxes on special charges\n0.05 \n2024 Earnings per share—diluted\n$\n2.92 \nResults of Operations—Segments\nWe measure the performance of our business segments based on operating income, excluding special charges and transaction and integration expenses related to our acquisitions, as applicable. See Note 15 of notes to our consolidated financial statements for additional information on our segment measures as well as for a reconciliation by segment of operating income, excluding special charges and transaction and integration expenses related to our acquisitions. In the following discussion, we refer to our previously described measure of segment profit as \"Segment operating income.\"\n26\nConsumer Segment\n \n2024\n2023\nNet sales\n$\n3,848.5 \n$\n3,807.3 \nPercent - increase \n1.1 \n%\n1.3 \n%\nComponents of percent change in net sales -\n \nincrease\n \n(decrease):\nPricing actions\n— \n%\n6.5 \n%\nVolume and product mix\n0.8 \n%\n(3.9)\n%\nDivestiture\n— \n%\n(0.5)\n%\nForeign exchange\n0.3 \n%\n(0.8)\n%\nSegment operating income\n$\n740.3 \n$\n735.5 \nSegment operating income margin\n19.2 \n%\n19.3 \n%\nSales of our consumer segment in 2024 increased by 1.1% as compared to 2023 and increased by 0.8% on an organic basis. This increase was driven by higher sales of our consumer business in EMEA and the Americas, with a partial offset from a sales decline in the Asia-Pacific region. Asia-Pacific region sales declines were principally attributable to the macro environment in China. Higher volume and product mix added 0.8% to net sales, as compared to 2023. Volume and product mix includes a 0.2% unfavorable impact associated with our decision during 2023 to exit certain low margin business. A favorable impact from foreign currency rates increased sales by 0.3% compared to the prior year and is excluded from our measure of sales growth of 0.8% on an organic basis.\nIn the Americas region, consumer sales increased 0.6% in 2024 as compared to 2023 and increased by 0.7% on an organic basis. Pricing actions, including actions taken in response to price gap management as well as promotional activities, decreased sales by 0.3% as compared to the prior year period. Favorable volume and product mix, driven by growth across core categories, increased sales by 1.0% as compared to the corresponding period in 2023. Volume and product mix includes a 0.3% unfavorable impact of our decision to discontinue certain low margin business. The unfavorable impact of foreign currency rates decreased sales by 0.1% in the year and is excluded from our measure of sales growth of 0.7% on an organic basis.\nIn the EMEA region, consumer sales increased 7.3% in 2024 as compared to 2023 and increased by 4.3% on an organic basis. Pricing actions, principally implemented in the prior year, increased sales by 0.6% as compared to 2023. Favorable volume and product mix increased sales by 3.7% from the prior year level, driven by growth in our major markets across their product categories. The favorable impact of foreign currency exchange rates increased sales by 3.0% compared to 2023 and is excluded from our measure of sales growth of 4.3% on an organic basis.\nIn the APAC region, consumer sales decreased 5.1% in 2024 as compared to 2023 and decreased by 4.1% on an organic basis. Pricing actions, principally implemented in the prior year, increased sales by 0.8% as compared to 2023. Unfavorable volume and product mix decreased sales by 4.9% from the prior year, as slower demand in China was partially mitigated by growth in other parts of the region. The unfavorable impact from foreign currency rates decreased sales by 1.0% compared to the year-ago period and is excluded from our measure of sales decline of 4.1% on an organic basis.\nSegment operating income for our consumer segment increased by $4.8 million, or 0.7%, in 2024 as compared to 2023. The increase in segment operating income was driven by the effects of an increase in gross profit, as a higher level of sales volume, CCI-led and GOE cost savings and lower scrapped inventory was partially offset by higher conversion costs. Segment operating income was also impacted by higher SG&A expenses, including increased advertising and promotional spend, partially offset by lower performance-based employee incentive expenses and lower distribution costs, all as compared to the prior year. Segment operating margin for our consumer segment decreased by 10 basis points in 2024 to 19.2%, as a decrease in consumer gross profit margin was partially offset by a lower level of SG&A as a percentage of net sales, all as compared to the 2023 level. On a constant currency basis, segment operating income for our consumer segment increased by 0.7% in 2024, as compared to 2023.\n27\nFlavor Solutions Segment\n2024\n2023\nNet sales\n$\n2,875.2 \n$\n2,854.9 \nPercent growth\n0.7 \n%\n10.1 \n%\nComponents of percent growth in net sales\n–\nincrease (decrease):\nPricing actions\n1.2 \n%\n11.4 \n%\nVolume and product mix\n(0.3)\n%\n(1.0)\n%\nDivestiture\n(0.5)\n%\n(0.1)\n%\nForeign exchange\n0.3 \n%\n(0.2)\n%\nSegment operating income\n$\n329.5 \n$\n288.7 \nSegment operating income margin\n11.5 \n%\n10.1 \n%\nSales of our flavor solutions segment increased 0.7% in 2024 as compared to 2023 and increased by 0.9% on an organic basis. Pricing actions, principally implemented in the prior year, increased sales by 1.2% in 2024 and were partially offset by 0.3% of unfavorable volume and product mix, both in comparison to the prior year levels. In 2024, the divestiture of our Giotti canning business unfavorably impacted sales by 0.5% and a favorable impact from foreign currency rates increased sales by 0.3%, both as compared to the prior year, and are excluded from our flavor solutions segment organic sales growth of 0.9%. \nIn the Americas region, flavor solutions sales increased by 1.4% during 2024 as compared to 2023 and increased by 1.5% on an organic basis. Pricing actions, principally implemented in the prior year, favorably impacted sales by 1.6% during 2024. Unfavorable volume and product mix decreased flavor solutions sales in the Americas by 0.1% during 2024, as compared to the prior year. An unfavorable impact from foreign currency rates decreased sales by 0.1% compared to 2023 and is excluded from our measure of sales growth of 1.5% on an organic basis.\nIn the EMEA region, flavor solutions sales in 2024 decreased by 3.5% as compared to 2023 and decreased by 3.6% on an organic basis. Pricing actions unfavorably impacted sales by 0.3% in 2024 as compared to the prior period level. Unfavorable volume and product mix decreased segment sales by 3.3% in 2024 as compared to 2023, including the effects of lower sales at quick service restaurants, and a 1.2% unfavorable impact of our decision to exit a low margin business. The divestiture of our Giotti canning business unfavorably impacted sales by 2.3% and a favorable impact from foreign currency rates increased sales by 2.4%, both as compared to 2023 and are excluded from our measure of sales decline of 3.6% on an organic basis.\nIn the APAC region, flavor solutions sales increased 4.1% in 2024 as compared to 2023 and increased by 5.1% on an organic basis. Pricing actions, principally implemented in the prior year, favorably impacted sales by 0.9% as compared to the prior year period. Favorable volume and product mix increased sales by 4.2%, driven by higher sales to quick service restaurant customers in China. An unfavorable impact from foreign currency rates decreased sales by 1.0% compared to 2023 and is excluded from our measure of sales growth of 5.1% on an organic basis.\nSegment operating income for our flavor solutions segment increased by $40.8 million, or 14.1%, in 2024 as compared to 2023. The increase in segment operating income was driven by the effects of an increase in gross profit primarily due to the impacts of pricing actions, product mix and CCI-led and GOE cost savings which more than offset increased conversion costs and the higher level of SG&A expenses, all as compared to the prior year. Segment operating margin for our flavor solutions segment increased by 140 basis points in 2024 to 11.5%, driven by a higher segment gross margin, as previously described, which was partially offset by a higher level of SG&A as a percentage of net sales, as compared to 2023. On a constant currency basis, segment operating income for our flavor solutions segment increased by 14.5% in 2024, as compared to 2023.\nNON-GAAP FINANCIAL MEASURES\nThe following tables include financial measures of organic net sales, adjusted operating income, adjusted operating income margin, adjusted income tax expense, adjusted income tax rate, adjusted net income, and adjusted diluted earnings per share. These represent non-GAAP financial measures which are prepared as a complement to our financial results prepared in accordance with United States generally accepted accounting principles. These financial measures exclude the impact, as applicable, of the following:\n28\n•\nSpecial charges – Special charges consist of expenses and income associated with certain actions undertaken to reduce fixed costs, simplify or improve processes, and improve competitiveness and are of such significance in terms of both up-front costs and organizational/structural impact to require advance approval by our Management Committee. Upon presentation of any such proposed action (generally including details with respect to estimated costs, which typically consist principally of employee severance and related benefits, together with ancillary costs associated with the action that may include a non-cash component, such as an asset impairment, or a component which relates to inventory adjustments that are included in cost of goods sold; impacted employees or operations; expected timing; and expected savings) to the Management Committee and the Committee’s advance approval, expenses associated with the approved action are classified as special charges upon recognition and monitored on an ongoing basis through completion. Special charges for the year ended November 30, 2022 include a $13.6 million gain associated with the sale of the Kohinoor brand name. We exited our Kohinoor rice product line in India in the fourth quarter of fiscal year 2021. Special charges are more fully described in Note 2 of notes to our accompanying consolidated financial statements.\n•\nTransaction and integration expenses associated with acquisitions – We exclude certain costs associated with our acquisitions, including our acquisition of FONA in December 2020, and the subsequent integration into the Company. Such costs, which we refer to as “Transaction and integration expenses,” include transaction costs associated with the acquisition, as well as integration costs following the acquisition, including the impact of the acquisition date fair value adjustment for inventories, together with the impact of discrete tax items, if any, directly related to the acquisition. \n•\nGain on sale of Kitchen Basics – We exclude the gain realized upon our sale of the Kitchen Basics business in August 2022. As more fully described in Note 16 of the notes to the accompanying financial statements, the pre-tax gain associated with the sale was $49.6 million and is included in Other income, net in our consolidated income statement for the year ended November 30, 2022.\nDetails with respect to the special charges and gain on sale of Kitchen Basics for the years and in the amounts set forth below are included in Notes 2 and 16 of notes to our consolidated financial statements. \nWe believe that these non-GAAP financial measures are important. The exclusion of the items noted above provides additional information that enables enhanced comparisons to prior periods and, accordingly, facilitates the development of future projections and earnings growth prospects. This information is also used by management to measure the profitability of our ongoing operations and analyze our business performance and trends.\nThese non-GAAP financial measures may be considered in addition to results prepared in accordance with GAAP; however, they should not be viewed as a substitute for, or superior to, GAAP results. Furthermore, these non-GAAP financial measures may not be comparable to similarly titled measures of other companies, as they may calculate them differently than we do. We intend to continue providing these non-GAAP financial measures as part of our future earnings discussions, ensuring consistency in our financial reporting.\n29\nA reconciliation of these non-GAAP financial measures to GAAP financial results is provided below:\n2024\n2023\n2022\nOperating income\n$\n1,060.3 \n$\n963.0 \n$\n863.6 \nImpact of transaction and integration expenses\n(1)\n— \n— \n2.2 \nImpact of special charges\n(2)\n9.5 \n61.2 \n51.6 \nAdjusted operating income\n$\n1,069.8 \n$\n1,024.2 \n$\n917.4 \n% increase (decrease) versus prior year\n4.5 \n%\n11.6 \n%\n(16.7)\n%\nOperating income margin\n(3)\n15.8 \n%\n14.5 \n%\n13.6 \n%\nImpact of transaction and integration expenses and special charges\n(3)\n0.1 \n%\n0.9 \n%\n0.8 \n%\nAdjusted operating income margin\n(3)\n15.9 \n%\n15.4 \n%\n14.4 \n%\nIncome tax expense \n$\n184.0 \n$\n174.5 \n$\n168.6 \nImpact of transaction and integration expenses\n(1)\n— \n— \n0.6 \nImpact of special charges\n(2)\n2.4 \n14.5 \n13.3 \nImpact of sale of Kitchen Basics\n— \n— \n(11.6)\nAdjusted income tax expense\n$\n186.4 \n$\n189.0 \n$\n170.9 \nIncome tax rate\n(4)\n20.5 \n%\n21.8 \n%\n20.7 \n%\nImpact of transaction and integration expenses, special charges, and sale of Kitchen Basics\n(4)\n— \n%\n0.2 \n%\n0.2 \n%\nAdjusted income tax rate\n(4)\n20.5 \n%\n22.0 \n%\n20.9 \n%\nNet income\n$\n788.5 \n$\n680.6 \n$\n682.0 \nImpact of transaction and integration expenses\n(1)\n— \n— \n1.6 \nImpact of special charges\n(2)\n7.1 \n46.7 \n38.3 \nImpact of after-tax gain on sale of Kitchen Basics\n— \n— \n(38.0)\nAdjusted net income\n$\n795.6 \n$\n727.3 \n$\n683.9 \n% increase (decrease) versus prior year\n9.4 \n%\n6.3 \n%\n(17.0)\n%\nEarnings per share—diluted\n$\n2.92 \n$\n2.52 \n$\n2.52 \nImpact of transaction and integration expenses\n(1)\n— \n— \n0.01 \nImpact of special charges\n(2)\n0.03 \n0.18 \n0.14 \nImpact of after-tax gain on sale of Kitchen Basics\n— \n— \n(0.14)\nAdjusted earnings per share—diluted\n$\n2.95 \n$\n2.70 \n$\n2.53 \n(1)\nTransaction and integration expenses include integration expenses associated with our acquisition of FONA. \n(2)\nSpecial charges are more fully described in Note 2 of notes to our accompanying consolidated financial statements. Special charges for the year ended November 30, 2022 include a $10.0 million non-cash intangible asset impairment charge associated with our exit of our business operations in Russia. We exited our Kohinoor rice product line in India in the fourth quarter of fiscal 2021. Special charges for the year ended November 30, 2022 include a $13.6 million gain associated with the sale of the Kohinoor brand name. \n(3)\nOperating income margin, impact of transaction and integration expenses and special charges, and adjusted operating income margin are calculated as operating income, impact of transaction and integration expenses and special charges, and adjusted operating income as a percentage of net sales for each period presented.\n(4)\nIncome tax rate is calculated as income tax expense as a percentage of income from consolidated operations before income taxes. Adjusted income tax rate is calculated as adjusted income tax expense as a percentage of income from consolidated operations before income taxes excluding transaction and integration expenses, special charges and gain on the sale of Kitchen Basics or $907.8 million, $859.9 million, and $817.0 million for the years ended November 30, 2024, 2023, and 2022, respectively.\n30\nEstimate for the year ending November 30, 2025\nEarnings per share – diluted\n$2.99 to $3.04\nImpact of special charges \n0.04\nAdjusted earnings per share – diluted\n$3.03 to $3.08\nBecause we are a multi-national company, we are subject to variability of our reported U.S. dollar results due to changes in foreign currency exchange rates. Those changes have been volatile over the past several years. The exclusion of the effects of foreign currency exchange, or what we refer to as amounts expressed “on a constant currency basis,” is a non-GAAP measure. We believe that this non-GAAP measure provides additional information that enables enhanced comparison to prior periods excluding the translation effects of changes in rates of foreign currency exchange and provides additional insight into the underlying performance of our operations located outside the U.S. It should be noted that our presentation herein of amounts and percentage changes on a constant currency basis does not exclude the impact of foreign currency transaction gains and losses (that is, the impact of transactions denominated in other than the local currency of any of our subsidiaries in their local currency reported results).\nWe provide organic net sales growth rates for our consolidated net sales and segment net sales. We believe that organic net sales growth rates provide useful information to investors because they provide transparency to underlying performance in our net sales by excluding the effect that foreign currency exchange rate fluctuations, acquisitions, and divestitures, as applicable, have on year-to-year comparability. A reconciliation of these measures from reported net sales growth rates, the relevant GAAP measures, are included in the tables set forth below.\nPercentage changes in organic sales and adjusted operating income expressed on a constant currency basis are presented excluding the impact of foreign currency exchange. To present this information for historical periods, current year results for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at the average exchange rates in effect during the prior fiscal year, rather than at the actual average exchange rates in effect during the current fiscal year. As a result, the foreign currency impact is equal to the current year results in local currencies multiplied by the change in the average foreign currency exchange rate between the current year and the prior fiscal year. The tables set forth below present our growth in net sales and adjusted operating income on a constant currency basis as follows: (1) to present our growth in net sales and adjusted operating income for 2024 on a constant currency basis, net sales and adjusted operating income for 2024 for entities reporting in currencies other than the U.S. dollar have been translated using the average foreign exchange rates in effect for 2023 and compared to the reported results for 2023; and (2) to present our growth in net sales and adjusted operating income for 2023 on a constant currency basis, net sales and operating income for 2023 for entities reporting in currencies other than the U.S. dollar have been translated using the average foreign exchange rates in effect for 2022 and compared to the reported results for 2022.\n \nFor the year ended November 30, 2024\nPercentage change \nas reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nImpact of Acquisitions & Divestitures\nPercentage change on organic basis\nNet sales:\nConsumer segment:\nAmericas\n0.6 \n%\n(0.1)\n%\n0.7 \n%\n— \n%\n0.7 \n%\nEMEA\n7.3 \n%\n3.0 \n%\n4.3 \n%\n— \n%\n4.3 \n%\nAPAC\n(5.1)\n%\n(1.0)\n%\n(4.1)\n%\n— \n%\n(4.1)\n%\nTotal Consumer\n1.1 \n%\n0.3 \n%\n0.8 \n%\n— \n%\n0.8 \n%\nFlavor Solutions segment:\nAmericas\n1.4 \n%\n(0.1)\n%\n1.5 \n%\n— \n%\n1.5 \n%\nEMEA\n(3.5)\n%\n2.4 \n%\n(5.9)\n%\n(2.3)\n%\n(3.6)\n%\nAPAC\n4.1 \n%\n(1.0)\n%\n5.1 \n%\n— \n%\n5.1 \n%\nTotal Flavor Solutions\n0.7 \n%\n0.3 \n%\n0.4 \n%\n(0.5)\n%\n0.9 \n%\nTotal net sales\n0.9 \n%\n0.3 \n%\n0.6 \n%\n(0.2)\n%\n0.8 \n%\n31\nFor the year ended November 30, 2024\nPercentage change \nas reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nAdjusted operating income:\nConsumer segment\n0.7 \n%\n— \n%\n0.7 \n%\nFlavor Solutions segment\n14.1 \n%\n(0.4)\n%\n14.5 \n%\nTotal adjusted operating income\n4.5 \n%\n(0.1)\n%\n4.6 \n%\nFor the year ended November 30, 2023\nPercentage change\nas reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nImpact of Acquisitions & Divestitures\nPercentage change on organic basis\nNet sales:\nConsumer segment:\nAmericas\n0.4 \n%\n(0.4)\n%\n0.8 \n%\n(0.7)\n%\n1.5 \n%\nEMEA\n7.1 \n%\n0.9 \n%\n6.2 \n%\n— \n%\n6.2 \n%\nAPAC\n(1.1)\n%\n(6.2)\n%\n5.1 \n%\n— \n%\n5.1 \n%\nTotal Consumer\n1.3 \n%\n(0.8)\n%\n2.1 \n%\n(0.5)\n%\n2.6 \n%\nFlavor Solutions segment:\nAmericas\n10.7 \n%\n1.1 \n%\n9.6 \n%\n— \n%\n9.6 \n%\nEMEA\n10.3 \n%\n(1.9)\n%\n12.2 \n%\n(0.7)\n%\n12.9 \n%\nAPAC\n5.6 \n%\n(5.4)\n%\n11.0 \n%\n— \n%\n11.0 \n%\nTotal Flavor Solutions\n10.1 \n%\n(0.2)\n%\n10.3 \n%\n(0.1)\n%\n10.4 \n%\nTotal net sales\n4.9 \n%\n(0.6)\n%\n5.5 \n%\n(0.4)\n%\n5.9 \n%\nFor the year ended November 30, 2023\nPercentage change\nas reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nAdjusted operating income:\nConsumer segment\n3.5 \n%\n(0.9)\n%\n4.4 \n%\nFlavor Solutions segment\n39.7 \n%\n1.2 \n%\n38.5 \n%\nTotal adjusted operating income\n11.6 \n%\n(0.4)\n%\n12.0 \n%\nTo present the percentage change in projected 2025 net sales, adjusted operating income, and adjusted earnings per share (diluted) on a constant currency basis, the projected local currency net sales, adjusted operating income, and adjusted net income for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at forecasted exchange rates. These figures are then compared to the 2025 local currency projected results, which are translated into U.S. dollars at the average actual exchange rates in effect during the corresponding months of fiscal year 2024. This comparison determines what the 2025 consolidated U.S. dollar net sales, adjusted operating income, and adjusted earnings per share (diluted) would have been if the relevant currency exchange rates had not changed from those of the comparable 2024 periods.\n32\nProjections for the Year Ending November 30, 2025\nPercentage change in net sales\n0% to 2%\nImpact of unfavorable foreign currency exchange\n1 \n%\nPercentage change in organic net sales\n1% to 3%\nPercentage change in adjusted operating income\n3% to 5%\nImpact of unfavorable foreign currency exchange\n1 \n%\nPercentage change in adjusted operating income in constant currency\n4% to 6%\nPercentage change in adjusted earnings per share - diluted\n3% to 5%\nImpact of unfavorable foreign currency exchange\n2 \n%\nPercentage change in adjusted earnings per share - diluted\n5% to 7%\nLIQUIDITY AND FINANCIAL CONDITION\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n921.9 \n$\n1,237.3 \n$\n651.5 \nNet cash used in investing activities\n(269.0)\n(260.5)\n(146.4)\nNet cash used in financing activities\n(583.1)\n(1,184.2)\n(487.2)\nThe primary objective of our financing strategy is to maintain a prudent capital structure that provides the flexibility to pursue our growth objectives. We use a combination of equity and short- and long-term debt. We use short-term debt, primarily in the form of commercial paper, principally to finance ongoing operations. This includes our requirements for working capital, which encompasses accounts receivable, prepaid expenses, other current assets, and inventories, less accounts payable, accrued payroll, and other accrued liabilities. We are committed to maintaining investment grade credit ratings.\nOur cash flows from operations enable us to fund operating projects and investments that are designed to meet our growth objectives, service our debt, fund or increase our quarterly dividends, fund capital projects and other investments, and make share repurchases, when appropriate. Due to the cyclical nature of a portion of our business, our cash flow from operations has historically been the strongest during the fourth quarter of our fiscal year. Due to the timing of the interest payments on our debt, interest payments are higher in the first and third quarter of our fiscal year. \nWe believe that our sources of liquidity, which include existing cash balances, cash flows from operations, existing credit facilities, our commercial paper program, and access to capital markets, will provide sufficient liquidity to meet our debt obligations, including any repayment or refinancing of debt, working capital needs, planned capital expenditures, and payment of anticipated quarterly dividends for at least the next twelve months.\nIn the cash flow statement, the changes in operating assets and liabilities are presented excluding the translation effects of changes in foreign currency exchange rates, as these do not reflect actual cash flows. In addition, in the cash flow statement, the changes in operating assets and liabilities are presented excluding the effect of disposed operating assets and liabilities, as the cash flow associated with dispositions of businesses is presented as an investing activity. Accordingly, the amounts in the cash flow statement do not agree with changes in the operating assets and liabilities that are presented in the balance sheet.\nThe reported values of our assets and liabilities held in non-U.S. subsidiaries and affiliates can be significantly affected by fluctuations in foreign exchange rates between periods. As of November 30, 2024, the exchange rates for the British pound sterling were higher against the U.S. dollar than on November 30, 2023. Conversely, as of November 30, 2024, the exchange rates for the Euro, Canadian dollar, Mexican peso, Chinese renminbi, Polish zloty, and Australian dollar were lower against the U.S. dollar compared to November 30, 2023.\n33\nOperating Cash Flow \n–\n Operating cash flow was $921.9 million in 2024, $1,237.3 million in 2023, and $651.5 million in 2022. Net income as well as our working capital management, as more fully described below, impacted operating cash flow. In 2024, the decrease in operating cash flow was primarily driven by higher cash used for working capital, including higher inventory levels and higher employee incentive payments related to the prior year, and the timing of income tax payments partially offset by higher net income. In 2023, the increase was primarily driven by an improvement in cash provided by working capital, which was driven by the lower inventory levels and the lower amount of employee incentive payments associated with the prior years, as well as an increase in dividends received from unconsolidated affiliates. This was partially offset by an increased use of cash associated with accounts payable which partially resulted from our lower level of inventory. In 2022, the decrease in operating cash flow was primarily driven by lower net income, including the effect of net income associated with the gain on sale of our Kitchen Basics business and an intangible asset that are reflected as investing cash flows as well as the higher amount of employee incentive payments associated with the prior year.\nOur working capital management – principally related to inventory, trade accounts receivable, and accounts payable – impacts our operating cash flow. The change in inventory was a significant use of cash from operations in 2024 and 2022 and a significant source of cash from operations in 2023. The change in trade accounts receivable was a moderate use of cash in 2024 and 2022 and a source of cash in 2023. The change in accounts payable was a significant source of cash in 2024 and 2022 and a use of cash in 2023.\nIn addition to operating cash flow, we also use a cash conversion cycle (CCC) to measure our working capital management. This metric is different than operating cash flow in that it uses average balances instead of specific point in time measures. CCC is a calculation of the number of days, on average, that it takes us to convert a cash outlay for resources, such as raw materials, to a cash inflow from collection of accounts receivable. Our goal is to lower our CCC over time. We calculate CCC as follows:\nDays sales outstanding (average trade accounts receivable divided by average daily net sales) plus days in inventory (average inventory divided by average daily cost of goods sold) less days payable outstanding (average trade accounts payable divided by average daily cost of goods sold plus the average daily change in inventory).\nThe following table outlines our cash conversion cycle (in days) over the last three years:\n2024\n2023\n2022\nCash Conversion Cycle\n36 \n40 \n51 \nThe decrease in CCC in 2024 from 2023 was primarily due to a reduction in our days in inventory as a result of inventory management based on demand planning. The decrease in CCC in 2023 from 2022 was primarily due to a reduction in our days in inventory as a result of reducing our inventory based on demand planning and elimination of excess safety stock utilized to remedy service issues associated with the COVID-19 pandemic. \nAs more fully described in Note 1 of notes to our consolidated financial statements, we participate in a Supply Chain Financing program (SCF) with several global financial institutions (SCF Banks). Under the SCF, qualifying suppliers may elect to sell their receivables from us to an SCF Bank, enabling participating suppliers to negotiate their receivables sales arrangements directly with the respective SCF Bank. We are not party to those agreements and have no economic interest in a supplier’s decision to sell a receivable. All outstanding amounts related to suppliers participating in the SCF are recorded within the line item 'Trade accounts payable' in our condensed consolidated balance sheets, and the associated payments are included in operating activities in our consolidated statements of cash flows. As of November 30, 2024 and 2023, the amounts due to suppliers participating in the SCF and included in trade accounts payable were approximately $417.4 million and $300.5 million, respectively.\nThe terms of our payment obligations are not impacted by a supplier's participation in the SCF. Our payment terms with our suppliers for similar materials within individual markets are consistent between those suppliers that elect to participate in the SCF and those suppliers that do not participate. Accordingly, our average days outstanding are not significantly impacted by the portion of suppliers included in the SCF. Future changes in our suppliers’ financing policies or economic developments, such as shifts in interest rates, general market liquidity, or our creditworthiness relative to participating suppliers, could affect those suppliers’ participation in the SCF and/or our ability to negotiate extended payment terms with them. However, any such impacts are difficult to predict.\nInvesting Cash Flow \n–\n Net cash used in investing activities was $269.0 million in 2024, $260.5 million in 2023, and $146.4 million in 2022. Our primary investing cash flows include cash used for capital expenditures as well as cash provided by the sale of businesses or other assets. Capital expenditures, including expenditures for capitalized software, were $274.9 million in 2024, $263.9 million in 2023, and $262.0 million in 2022. We expect 2025 capital \n34\nexpenditures to approximate $300 million. In 2022, we received $95.2 million net cash proceeds from the sale of our Kitchen Basics business and $13.6 million net cash proceeds from the sale of the Kohinoor brand name. \nFinancing Cash Flow \n–\n Net cash associated with financing activities was a use of cash of $583.1 million in 2024, $1,184.2 million in 2023, and $487.2 million in 2022. The variability between years is principally a result of changes in our net borrowings, share repurchase activity, and dividends, all as described below. \nThe following table outlines our net borrowing activities:\n2024\n2023\n2022\nNet increase (decrease) in short-term borrowings\n$\n211.1 \n$\n(964.6)\n$\n698.3 \nProceeds from issuance of long-term debt, net of debt issuance costs\n494.5 \n495.3 \n— \nRepayments of long-term debt\n(801.1)\n(268.1)\n(772.0)\nNet cash (used in) net borrowing activities\n$\n(95.5)\n$\n(737.4)\n$\n(73.7)\nIn 2024, we repaid $801.1 million of long-term debt, including the $700.0 million, 3.15% notes that matured in August 2024 as well as $55.0 million, 7.63% to 8.12% notes that matured in August and October 2024. We also issued $500.0 million of 4.70% notes due 2034, with net cash proceeds received of $495.5 million.   \nIn 2023, we repaid $268.1 million of long-term debt, including the $250.0 million, 3.50% notes that matured on September 1, 2023. We also issued $500.0 million of 4.95% notes due 2033, with net cash proceeds received of $496.4 million.\nIn 2022, we repaid $772.0 million of long-term debt, including the $750 million, 2.70% notes that matured on August 15, 2022. \nThe following table outlines the activity in our share repurchase program:\n2024\n2023\n2022\nNumber of shares of common stock\n0.7 \n0.5 \n0.4 \nDollar amount\n$\n53.1 \n$\n35.7 \n$\n38.8 \nAs of November 30, 2024, $448 million remained of a $600 million share repurchase program that was authorized by our Board of Directors in November 2019. The timing and amount of any shares repurchased is determined by our management based on its evaluation of market conditions and other factors.\nDuring 2024, 2023, and 2022, we received proceeds from exercised stock options of $17.5 million, $16.6 million, and $41.4 million, respectively. We repurchased $9.0 million, $10.8 million, and $19.4 million of common stock during 2024, 2023, and 2022, respectively, in conjunction with employee tax withholding requirements associated with our stock compensation plans. \nOur dividend history over the past three years is as follows:\n2024\n2023\n2022\nTotal dividends paid\n$\n451.0 \n$\n418.5 \n$\n396.7 \nDividends paid per share\n1.68 \n1.56 \n1.48 \nPercentage increase per share\n7.7 \n%\n5.4 \n%\n8.8 \n%\nIn November 2024, the Board of Directors approved a 7.1% increase in the quarterly dividend from $0.42 to $0.45 per share. \nMost of our cash is in our subsidiaries outside of the U.S. We manage our worldwide cash requirements by considering available funds among the many subsidiaries through which we conduct our business and the cost effectiveness with which those funds can be accessed. Those balances are generally available without legal restrictions to fund ordinary business operations, capital projects, and future acquisitions. As of November 30, 2024, we have $1.6 billion of earnings from our non-U.S. subsidiaries and joint ventures that are considered indefinitely reinvested. We have not provided any deferred taxes with respect to items such as foreign withholding taxes, other income taxes, or foreign exchange gains or losses with respect to these earnings. It is not practicable for us to determine the amount of unrecognized tax expense on these reinvested international earnings.\nAt November 30, 2024 and 2023, we temporarily used $509.2 million and $531.4 million, respectively, of cash from our non-U.S. subsidiaries to pay down short-term debt in the U.S. During the year, our short-term borrowings vary, but are lower at the end of a year or quarter. The average short-term borrowings outstanding for the years ended \n35\nNovember 30, 2024, 2023, and 2022 were $1,043.1 million, $1,121.9 million, and $1,117.0 million, respectively. Those average short-term borrowings outstanding for the years ended November 30, 2024, 2023, and 2022 included average commercial paper borrowings of $1,033.8 million, $1,098.4 million, and $1,080.4 respectively. The total average debt outstanding for the years ended November 30, 2024, 2023, and 2022 was $4,966.4 million, $5,197.8 million, and $5,422.0 million, respectively.\nCredit and Capital Markets\n – The following summarizes the more significant impacts of credit and capital markets on our business:\nCREDIT FACILITIES\n – Cash flows from operating activities are our primary source of liquidity for funding growth, share repurchases, dividends, and capital expenditures. We also rely on our revolving credit facilities, or borrowings backed by these facilities, to fund working capital needs and other general corporate requirements. \nOur committed revolving credit facilities include a five-year $1.5 billion revolving credit facility, which will expire in June 2026 and a 364-day $500 million revolving credit facility, which was entered into in August 2024 and will expire in August 2025. The current pricing for the five-year credit facility, on a fully drawn basis, is Term SOFR plus 1.25%. The pricing of that credit facility is based on a credit rating grid that contains a fully drawn maximum pricing of the credit facility equal to Term SOFR plus 1.75%. The current pricing for the 364-day credit facility, on a fully drawn basis, is Term SOFR plus 1.23%. The pricing of that credit facility is based on a credit rating grid that contains a fully drawn maximum pricing of the credit facility equal to Term SOFR plus 1.60%. \nThe provisions of each revolving credit facility restrict subsidiary indebtedness and require us to maintain a minimum interest coverage ratio. We do not expect that this covenant would limit our access to either revolving credit facilities for the foreseeable future. The terms of those revolving credit facilities are more fully described in Note 5 of the notes to the consolidated financial statements.\nWe generally use our revolving credit facilities to support our issuance of commercial paper. If the commercial paper market is not available or viable, we could borrow directly under our revolving credit facilities. These facilities are made available by a syndicate of banks, with various commitments per bank. If any of the banks in these syndicates are unable to perform on their commitments, our liquidity could be impacted, which could reduce our ability to grow through funding of seasonal working capital. We engage in regular communication with all banks participating in our credit facilities. During these communications, none of the banks have indicated that they may be unable to perform on their commitments. In addition, we periodically review our banking and financing relationships, considering the stability of the institutions and other aspects of the relationships. Based on these communications and our monitoring activities, we believe our banks will perform on their commitments. In addition to our committed revolving credit facilities, we have uncommitted facilities of $326.8 million as of November 30, 2024 that can be withdrawn based upon the lenders' discretion. See Note 5 of notes to our consolidated financial statements for more details on our financing arrangements.\nWe will continue to have cash requirements to support seasonal working capital needs and capital expenditures, to pay interest, to service debt, and to fund acquisitions. As part of our ongoing operations, we enter into contractual arrangements that obligate us to make future cash payments. Our primary obligations include principal and interest payments on our outstanding short-term borrowings and long-term debt. In the next year, our most significant debt service obligation is the maturity of our $250.0 million, 3.25% notes due in November 2025. Detail on these contractual obligations follows:\nMATERIAL CASH REQUIREMENTS\nThe following table reflects a summary of our future material \nc\nash requirements as of November 30, 2024:\nTotal\nLess than\n1 year   \n1–3  \nyears\n3–5  \nyears\nMore than\n5 years\nShort-term borrowings\n$\n483.1 \n$\n483.1 \n$\n— \n$\n— \n$\n— \nLong-term debt, including finance leases\n3,919.8 \n265.2 \n1,269.0 \n28.3 \n2,357.3 \nInterest payments\n(a)\n959.2 \n124.5 \n218.5 \n241.5 \n374.7 \nTotal contractual cash obligations\n$\n5,362.1 \n$\n872.8 \n$\n1,487.5 \n$\n269.8 \n$\n2,732.0 \n(a)\nInterest payments include expected interest payments on long-term debt. Our short-term borrowings, principally consisting of commercial paper, have short-term maturities. See Note 5 of notes to our consolidated financial statements for additional information.\n36\nOur other cash requirements at November 30, 2024, include raw material purchases, lease payments, income taxes, and pension and postretirement benefits. We acquire various raw materials to satisfy our obligations to our customers, and these outstanding purchase obligations can fluctuate throughout the year based on our response to varying raw material cycles; however, these commitments generally do not extend past one year. In addition, we also have a series of commercial commitments, largely consisting of standby letters of credit. Our standby letters of credit, leases, and pension and other post-retirement obligations are more fully described in Notes 5, 6 and 10, respectively, of notes to our consolidated financial statements.\nThese obligations impact our liquidity and capital resource needs. To meet those cash requirements, we intend to use our existing cash, cash equivalents and internally generated funds, to borrow under our existing credit facilities or under other short-term borrowing facilities, and depending on market conditions and upon the significance of the cost of a particular debt maturity or acquisition to our then-available sources of funds, to obtain additional short- and long-term financing. We believe that cash provided from these sources will be adequate to meet our future cash requirements. \nPENSION ASSETS AND OTHER INVESTMENTS \n– We hold investments in equity and debt securities in both our qualified defined benefit pension plans and through a rabbi trust for our nonqualified defined benefit pension plan. Cash contributions to pension plans, including unfunded plans, were $10.0 million in 2024, $9.2 million in 2023, and $11.4 million in 2022. It is expected that the 2025 total pension plan contributions will be approximately $10 million. Future increases or decreases in pension liabilities and required cash contributions are highly dependent upon changes in interest rates and the actual return on plan assets. We base our investment of plan assets, in part, on the duration of each plan’s liabilities. Across all of our qualified defined benefit pension plans, approximately 18% of assets are invested in equities, 75% in fixed income investments and 7% in other investments. Assets associated with our nonqualified defined benefit pension plan are primarily invested in corporate-owned life insurance, the value of which approximates an investment mix of 50% in equities and 50% in fixed income investments. See Note 10 of notes to our consolidated financial statements, which provides details on our pension funding.\nCUSTOMERS AND COUNTERPARTIES \n– See the subsequent section of this discussion under the heading \"Market Risk Sensitivity–Credit Risk.\"\nPERFORMANCE GRAPH — SHAREHOLDER RETURN\nThe following line graph compares the yearly change in McCormick’s cumulative total shareholder return (stock price appreciation plus reinvestment of dividends) on McCormick’s Non-Voting Common Stock with (1) the cumulative total return of the Standard & Poor’s 500 Stock Price Index, assuming reinvestment of dividends, and (2) the cumulative total return of the Standard & Poor’s Packaged Foods & Meats Index, assuming reinvestment of dividends.\n37\nMARKET RISK SENSITIVITY\nWe utilize derivative financial instruments to enhance our ability to manage risk, including foreign exchange and interest rate exposures, which exist as part of our ongoing business operations. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instrument. The use of derivative financial instruments is monitored through regular communication with senior management and the utilization of written guidelines. The information presented below should be read in conjunction with Notes 5 and 7 of notes to our consolidated financial statements.\nForeign Exchange Risk \n–\n We are exposed to fluctuations in foreign currency in the following main areas: cash flows related to raw material purchases; the translation of foreign currency earnings to U.S. dollars; the effects of foreign currency on loans between subsidiaries and unconsolidated affiliates; and cash flows related to repatriation of earnings from unconsolidated affiliates. Primary exposures include the U.S. dollar versus the Euro, British pound sterling, Chinese renminbi, Canadian dollar, Australian dollar, Polish zloty, Singapore dollar, Swiss franc, and Mexican peso, as well as the Euro versus the British pound sterling, Australian dollar, and Polish zloty, and finally the Canadian dollar versus the British pound sterling. We routinely enter into foreign currency exchange contracts to manage certain of these foreign currency risks.\nDuring 2024, the foreign currency translation component in other comprehensive income was principally related to the impact of exchange rate fluctuations on our net investments in our subsidiaries with a functional currency of the Mexican peso, Euro, Australian dollar, and Chinese renminbi. \n38\nWe also utilize cross currency interest rate swap contracts, which are designated as net investment hedges, to manage the impact of exchange rate fluctuations on our net investments in subsidiaries with a functional currency of the British pound sterling and Euro. Gains and losses on these instruments are included in foreign currency translation adjustments in accumulated other comprehensive income (loss).\nThe following table summarizes the foreign currency exchange contracts held at November 30, 2024. All contracts are valued in U.S. dollars using year-end 2024 exchange rates and have been designated as hedges of foreign currency transactional exposures, firm commitments, or anticipated transactions.\nFOREIGN CURRENCY EXCHANGE CONTRACTS AT NOVEMBER 30, 2024\nCurrency sold\nCurrency received\nNotional\nvalue\nAverage\ncontractual\nexchange\nrate\nFair  \nvalue  \nBritish pound sterling\nU.S. dollar\n$\n245.3 \n1.27 \n$\n(0.7)\nCanadian dollar\nU.S. dollar\n65.9 \n1.26 \n1.9 \nEuro\nU.S. dollar\n27.6 \n1.10 \n0.8 \nPolish zloty\nU.S. dollar\n2.8 \n3.98 \n0.1 \nU.S. dollar\nAustralian dollar\n89.9 \n0.65 \n0.3 \nSwiss franc\nU.S. dollar\n75.0 \n1.14 \n(0.9)\nU.S. dollar\nSingapore dollar\n17.9 \n1.35 \n0.1 \nU.S. dollar\nEuro\n86.5 \n1.05 \n0.4 \nU.S. dollar\nCanadian dollar\n21.4 \n1.41 \n0.1 \nAustralian dollar\nEuro\n21.6 \n1.66 \n(0.3)\nU.S. dollar\nChinese renminbi\n268.4 \n7.00 \n(8.2)\nPolish zloty\nEuro\n5.5 \n4.34 \n— \nCanadian dollar\nBritish pound sterling\n27.8 \n1.76 \n(0.1)\nBritish pound sterling\nEuro\n45.2 \n0.85 \n(0.8)\nU.S. dollar\nMexican peso\n8.5 \n20.66 \n(0.1)\nWe had a number of smaller contracts at November 30, 2024 with an aggregate notional value of $24.9 million to purchase or sell other currencies. The aggregate fair value of these contracts was $0.1 million at November 30, 2024.\nAt November 30, 2023, we had foreign currency exchange contracts with an aggregate notional value of $1,000.4 million to purchase or sell other currencies. The aggregate fair value of these contracts was a loss of $13.5 million at November 30, 2023.\nWe also utilized cross currency interest rate swap contracts that are considered net investment hedges.\nAs of November 30, 2024 and 2023, we had cross currency interest rate swap contracts of (i) $250 million notional value to receive $250 million at USD Secured Overnight Financing Rate (SOFR) plus 0.907% and pay £194.1 million at three-month GBP SONIA plus 0.859% and (ii) £194.1 million notional value to receive £194.1 million at three-month GBP SONIA plus 0.859% and pay €221.8 million at three-month Euro EURIBOR plus 0.808%. These cross-currency interest rate swap contracts expire in August 2027.\nAs of November 30, 2024 and 2023, we also had cross currency interest rate swap contracts of (i) $250 million notional value to receive $250 million at USD SOFR plus 0.684% and pay £184.1 million at GBP SONIA plus 0.574% and (ii) £184.1 million notional value to receive £184.1 million at GBP SONIA plus 0.574% and pay €219.2 million at Euro ESTR plus 0.667%. These contracts expire in April 2030.\nInterest Rate Risk\n – Our policy is to manage interest rate risk by entering into both fixed and variable rate debt arrangements. We are exposed to interest rate volatility, with primary exposures related to movements in U.S. Treasury rates, Secured Overnight Financing Rate (SOFR), and commercial paper rates.\nWe also use interest rate swaps to minimize financing costs and to achieve a desired mix of fixed and variable rate debt. As of November 30, 2024 and 2023, we had interest rate swap contracts of $600 million notional value outstanding to receive fixed rate interest and pay variable rate interest. The table that follows provides principal cash flows and related interest rates, excluding the effect of interest rate swaps and the amortization of any discounts or fees, by fiscal year of maturity at November 30, 2024. For foreign currency-denominated debt, the \n39\ninformation is presented in U.S. dollar equivalents. Variable interest rates are based on the weighted-average rates of the portfolio at the end of the year presented.\nYEARS OF MATURITY AT NOVEMBER 30, 2024\n2025\n2026\n2027\n2028\nThereafter\nTotal  \nFair value\nDebt\nFixed rate\n$\n299.1 \n$\n509.3 \n$\n759.7 \n$\n10.3 \n$\n2,375.3 \n$\n3,953.7 \n$\n3,711.0 \nAverage interest rate\n3.29 \n%\n0.95 \n%\n3.40 \n%\n3.46 \n%\n3.57 \n%\nVariable rate\n$\n449.2 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n449.2 \n$\n449.2 \nAverage interest rate\n4.71 \n%\n— \n%\n— \n— \n— \nThe table above displays the debt, including finance leases, by the terms of the original debt instrument without consideration of fair value, interest rate swaps, and any loan discounts or origination fees. Interest rate swaps have the following effects:\n•\nWe issued $250 million of 3.25% notes due in 2025 in November 2015. Forward treasury lock agreements settled upon issuance of these notes effectively set the interest rate on these notes at a weighted-average fixed rate of 3.45%. Separately, the fixed interest rate on $100 million of the 3.25% notes due in December 2025 was effectively converted to a variable rate by interest rate swaps through the notes maturity in 2025. Net interest payments are based on USD SOFR plus 1.487% with an effective variable rate of 5.92% as of November 30, 2024.\n•\nWe issued $750 million of 3.40% notes due in 2027 in August 2017. Forward treasury lock agreements settled upon issuance of these notes effectively set the interest rate on these $750 million notes at a weighted-average fixed rate of 3.44%. Separately, the fixed interest rate on $250 million of the 3.40% notes due in August 2027 was effectively converted to a variable rate by interest rate swaps through the notes maturity in 2027. Net interest payments are based on USD SOFR plus 0.907% with an effective variable rate of 5.73% as of November 30, 2024. \n•\nWe issued $500 million of 2.50% notes due April 15, 2030. Forward treasury lock agreements settled upon issuance of these notes effectively set the interest rate on these $500 million notes at a weighted-average fixed rate of 2.62%. Separately, the fixed interest rate on $250 million of the 2.50% notes due in April 2030 was effectively converted to a variable rate by interest rate swaps through the notes maturity in 2030. Net interest payments are based on USD SOFR plus 0.684% with an effective variable rate of 5.22% as of November 30, 2024.\n•\nWe issued $500 million of 4.95% notes due April 15, 2033. Forward treasury lock agreements settled upon issuance of these notes effectively set the interest rate on these $500 million notes at a weighted-average fixed rate of 5.00%. \n•\nWe issued $500 million of 4.70% notes due October 15, 2034. Forward treasury lock agreements settled upon issuance of these notes effectively set the interest rate on these $500 million notes at a weighted-average fixed rate of 4.68%.\nCommodity Risk \n– We purchase certain raw materials which are subject to price volatility caused by weather, market conditions, growing and harvesting conditions, governmental actions, and other factors beyond our control. In 2024, our most significant raw materials were dairy products, pepper, onion, garlic, capsicums (red peppers and paprika), tomato products, sugar and salts.\n \nWhile future movements of raw material costs are uncertain, we respond to this volatility in a number of ways, including strategic raw material purchases, purchases of raw material for future delivery, and customer price adjustments. We generally have not used derivatives to manage the volatility related to this risk. \nCredit Risk \n– The customers of our consumer segment are predominantly food retailers and food wholesalers. Consolidations in these industries have created larger customers. In addition, competition has increased with the growth in alternative channels including mass merchandisers, dollar stores, warehouse clubs, discount chains and e-commerce. This has caused some customers to be less profitable and increased our exposure to credit risk. Some of our customers and counterparties are highly leveraged. We continue to closely monitor the credit worthiness of our customers and counterparties. We feel that the allowance for doubtful accounts properly recognizes trade receivables at realizable value. We consider nonperformance credit risk for other financial instruments to be insignificant.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nNew accounting pronouncements are issued periodically that affect our current and future operations. See Note 1 of notes to our consolidated financial statements for further details of these impacts.\nCRITICAL ACCOUNTING ESTIMATES AND ASSUMPTIONS\nIn preparing the financial statements, we are required to make estimates and assumptions that have an impact on the assets, liabilities, revenue, and expenses reported. These estimates can also affect supplemental information disclosed by us, including information about contingencies, risk, and financial condition. We believe, given current facts and circumstances, our estimates and assumptions are reasonable, adhere to U.S. GAAP and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates, and estimates may vary as new facts and circumstances arise. In preparing the financial statements, we make \n40\nroutine estimates and judgments in determining the net realizable value of accounts receivable, inventory, fixed assets and prepaid allowances. Our most critical accounting estimates and assumptions, which are those that have or are reasonably likely to have a material impact on our financial condition or results of operations, are in the following areas:\nCustomer Contracts\nIn several of our major geographic markets, the consumer segment sells our products by entering into annual or multi-year customer arrangements. Known or expected pricing or revenue adjustments, such as trade discounts, rebates, or returns, are estimated at the time of sale. Where applicable, future reimbursements are estimated based on current expectations regarding what was earned through these programs as of the balance sheet date. Key sales terms, such as pricing and quantities ordered, are established on a frequent basis such that most customer arrangements and related incentives have a one-year or shorter duration. Estimates that affect revenue, such as trade incentives and product returns, are monitored and adjusted each period until the incentives or product returns are realized. Certain of our customer arrangements are annual arrangements such that the degree of estimates that affects revenue reduces as a year progresses. We do not believe that there will be significant changes to our estimates of customer consideration when any uncertainties are resolved with customers.\nGoodwill Impairment\nOur reporting units are aligned with our operating segments. Determining the fair value of a reporting unit involves significant judgment and the use of estimates and assumptions, as detailed in Note 1 of our consolidated financial statements. We estimate fair value using a discounted cash flow model, which calculates this value by present valuing the future expected cash flows of our reporting units with a market-based discount rate. As required by the quantitative goodwill impairment test, we then compare the calculated estimated fair value of each reporting unit to its carrying amount, including intangible assets and goodwill. If the carrying amount exceeds the estimated fair value, an impairment charge is recognized. \nAs of November 30, 2024, we had $5,227.5 million of goodwill recorded in our balance sheet ($3,583.1 million in the consumer segment and $1,644.4 million in the flavor solutions segment). Our fiscal year 2024 impairment testing indicated that the estimated fair values of our reporting units were significantly in excess of their carrying values. Accordingly, we believe that only significant changes in the cash flow assumptions would result in an impairment of goodwill. However, variances between the actual performance of the businesses and the assumptions that were used in developing the estimates of fair value could result in impairment charges in future periods.\n \nIndefinite-lived Intangible Asset Impairment\nOur indefinite-lived intangible assets consist of brand names and trademarks. We estimate fair values through the use of the relief-from-royalty method and then compare those fair values to the related carrying amounts of the indefinite-lived intangible asset. In the event that the fair value of any of the brand names or trademarks are less than their related carrying amounts, a non-cash impairment loss would be recognized in an amount equal to the difference.\nThe estimation of fair values of our brand names and trademarks requires us to make significant assumptions, including expectations regarding sales and profits of the respective brands and trademarks, related royalty rates, income tax rates, and appropriate discount rates. These discount rates are based, in part, on current interest rates, adjusted for our assessment of reasonable country- and brand\n-\nspecific risks, considering both past performance and anticipated future performance of the related brand names and trademarks\n.\n The assumptions used to assess impairment consider historical trends, macroeconomic conditions, and projections consistent with our operating strategy. Changes in these estimates can have a significant impact on the assessment of fair value which could result in material impairment losses.\nAs of November 30, 2024, we had $3,043.9 million of brand name assets and trademarks recognized in our consolidated balance sheet, and none of the balances exceeded their estimated fair values at that date. Of the $3,043.9 million in brand name assets and trademarks as of November 30, 2024: (i) $2,320.0 million relates to the French’s, Frank’s RedHot, and Cattlemen’s brand names and trademarks which we group for purposes of our impairment analysis; (ii) $380.0 million relates to the Cholula brand names and trademarks associated with the acquisition of Cholula in November 2020; and (iii) the remaining $343.9 million represents various other brand name assets and trademarks with individual carrying values ranging from $106.4 million to $0.2 million. The percentage excess of estimated fair value over respective book values for each of our brand names and trademarks exceeded 20% as of our fourth quarter annual impairment assessment except for one brand name that has a carrying value of $4.6 million. \n41\nIncome Taxes\nWe estimate income taxes and file tax returns in each taxing jurisdiction where we operate and are required to do so. At the end of each year, we record an estimate for income taxes in our financial statements. Tax returns are typically filed in the third or fourth quarter of the subsequent year. At that time, we perform a reconciliation of the estimate to the final tax return, which may result in changes to the original estimate. While we believe our tax return positions are appropriately supported, tax authorities may challenge certain positions. We evaluate our uncertain tax positions in accordance with GAAP guidance for uncertainty in income taxes. We recognize a tax benefit when it is more likely than not that the position will be sustained upon examination, based on its technical merits. The tax position is measured at the largest amount of benefit that is greater than 50 percent likely to be realized upon ultimate settlement. Any change in judgment regarding the expected resolution of uncertain tax positions is recognized in earnings in the quarter of such change. We believe our reserve for uncertain tax positions, including related interest and penalties, is adequate. \nAs of November 30, 2024, the Company had $20.6 million of unrecognized tax benefits, including interest and penalties, recorded in Other long-term liabilities. The amounts ultimately paid upon resolution of audits could differ materially from those previously included in our income tax expense, potentially impacting our tax provision, net income, and cash flows. We have also recorded valuation allowances to reduce our deferred tax assets to the amount that is more likely than not to be realized. In making this assessment, we have considered future taxable income and tax planning strategies, both of which involve a number of estimates, as more fully described in Note 1 of notes to our consolidated financial statements.\nPension Benefits\nPension plan costs require the use of assumptions regarding discount rates, investment returns, projected salary increases, and mortality rates. We review the actuarial assumptions used in our pension benefit reporting annually and compare them with external benchmarks to ensure they accurately reflect our future pension benefit obligations. While we believe these assumptions are appropriate, changes in various factors—such as actual returns on plan assets versus expected returns, as well as projected future rates of return—can affect the pension expense or income recognized. Specifically, a 1% increase or decrease in the actuarial assumption for the discount rate would impact our 2025 pension benefit expense by approximately $0.1 million. Similarly, a 1% increase or decrease in the expected return on plan assets would affect the 2025 pension expense by approximately $9.5 million.\nWe will continue to evaluate the appropriateness of the assumptions used in the measurement of our pension benefit obligations. In addition, see Note 10 of notes to our consolidated financial statements for a discussion of these assumptions and the effects on the financial statements.",
  "item2": null
}