{
  "source_file": "mkc-20250831.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to help the reader understand McCormick & Company, Incorporated, our operations, and our present business environment from the perspective of management. MD&A is provided as a supplement to, and should be read in conjunction with, our condensed consolidated financial statements and the accompanying notes thereto, included in Item 1 of this report. We use certain non-GAAP information \n– \nmore fully described below under the caption Non-GAAP Financial Measures \n– \nthat we believe is important for purposes of comparison to prior periods and development of future projections and earnings growth prospects. This information is also used by management to measure the profitability of our ongoing operations and analyze our business performance and trends. Unless otherwise noted, the dollar and share information in the charts and tables in MD&A are in millions, except per share data. \n22\nTable of Contents\nBusiness profile\nMcCormick is a global leader in flavor. We manufacture, market, and distribute spices, seasoning mixes, condiments, and other flavorful products to the entire food industry \n– \nretailers, food manufacturers, and the foodservice business. In fiscal year 2024, approximately 39% of our sales were generated outside of the U.S. We also are partners in a number of joint ventures involved in the manufacture and sale of flavorful products, the most significant of which is McCormick de Mexico. We manage our business in two business segments, Consumer and Flavor Solutions. \nRecent Event\nOn August 21, 2025, we signed a definitive agreement, subject to customary closing and regulatory conditions, with Grupo Herdez to acquire an additional 25% ownership interest in McCormick de Mexico, for a purchase price of $750 million, which would increase our ownership in the joint venture to a controlling 75%. The transaction is expected to be completed early in the fiscal year ending November 30, 2026. We believe the acquisition creates opportunities for further growth in the Mexican market and provides a strategic platform for further expansion in Latin America. McCormick de Mexico is a prominent food company in Mexico, with a broad portfolio, including mayonnaise, spices, marmalades, mustard, hot sauce, and tea, sold under McCormick brands. \nExecutive Summary\nIn the third quarter of 2025, we achieved net sales growth of 2.7% as compared to the third quarter of 2024, due to the following factors:\n•\nVolume and product mix favorably impacted net sales by 1.2%. The Consumer segment experienced favorable volume and product mix of 2.2% and the Flavor Solutions segment experienced unfavorable volume and product mix of 0.3%. \n•\nPricing favorably impacted net sales by 0.6%.\n•\nFluctuations in currency rates positively impacted net sales by 0.9%, increasing sales growth by 1.2% in our Consumer segment and 0.6% in our Flavor Solutions segment.\nOperating income was $288.7 million in the third quarter of 2025, compared to $286.5 million in the same period of 2024, reflecting an increase of 0.8%. Our gross profit margin decreased by 130 basis points primarily driven by increased commodity costs including the impact of tariffs, and increased conversion costs including costs to support capacity for future growth, partially offset by CCI-led cost savings. Excluding the effects of special charges included in cost of goods sold, our adjusted gross profit margin decreased by 120 basis points. Selling, general, and administrative (SG&A) expense as a percentage of sales decreased by 100 basis points, primarily driven by lower performance-based employee incentive expense and CCI-led cost savings, including SG&A streamlining initiatives. Excluding special charges, adjusted operating income was $293.6 million in the third quarter of 2025, reflecting an increase of 1.8% compared to $288.4 million in the 2024 period. In constant currency, adjusted operating income increased by 1.6%. \nDiluted earnings per share was $0.84 and $0.83 in the third quarters of 2025 and 2024, respectively. Special charges, including transaction and integration expenses, lowered earnings per share by $0.01 in the third quarter of 2025. Excluding the effects of special charges, diluted earnings per share was $0.85 and $0.83 in the third quarters of 2025 and 2024, respectively. Favorable operating income and lower interest expense were partially offset by lower interest income.\nA detailed review of our performance during the three and nine month periods ended August 31, 2025 compared to the same periods in fiscal year 2024 appears in the section titled “Results of Operations – Company” and “Results of Operations – Segments.” For a reconciliation of non-GAAP to reported amounts, see the subsequent discussion under the heading “Non-GAAP Financial Measures.”\n2025 Outlook \nOur fiscal 2025 outlook reflects plans to mitigate costs related to tariffs, which are currently in place. Our actions to mitigate the impact of tariff costs include sourcing plans supported by advanced analytics, cost savings initiatives, and revenue growth management. Due to the ongoing uncertainty around potential new U.S. import tariffs or retaliatory tariffs put in place by other countries, our outlook is based on tariffs currently in place and does not factor in any potential actions that may arise during the remainder of 2025.\nIn 2025, we expect net sales to grow between 0% and 2% compared to our 2024 net sales, including a 1% unfavorable impact from foreign currency rates, or to grow from 1% to 3% on an organic basis. We anticipate that sales in 2025 will benefit primarily from favorable volume and product mix.\n23\nTable of Contents\nWe expect our 2025 gross profit margin to be flat or comparable to the 38.5% gross profit margin reported in 2024. We expect our gross margin to be impacted by increased commodity costs due to the global trade uncertainty and tariffs currently in place.\nFor 2025, we anticipate an increase in operating income of 1% to 3% over the 2024 level, including a 1% unfavorable impact from foreign currency rates. This anticipated increase in operating income reflects the impact of savings from our CCI program including SG&A streamlining actions, partially offset by investments aimed at driving volume growth, particularly in brand marketing and digital. We project our brand marketing investments in 2025 to rise by mid-single digits compared to 2024. Additionally, we expect approximately $20 million in special charges related to previously announced organizational and streamlining actions and transaction and integration expenses primarily associated with a second quarter 2025 acquisition. In 2024, special charges totaled $9.5 million. Excluding these special charges, we expect adjusted operating income in 2025 to increase by 2% to 4%, which includes a 1% unfavorable impact from foreign currency rates, or to increase by 3% to 5% on a constant currency basis.\nWe estimate our 2025 effective tax rate, including the net favorable impact of anticipated discrete tax items, although at a lower amount than in 2024, to be 22% as compared to 20.5% in 2024. Excluding projected taxes associated with special charges, we estimate our adjusted effective tax rate to also be approximately 22% to 23% in 2025, as compared to an adjusted effective tax rate of 20.5% in 2024.\nWe expect income from unconsolidated operations will decline by a high single digit percentage rate from the 2024 level driven by our largest joint venture, McCormick de Mexico, due to the unfavorable impacts from foreign currency partially offset by continued strength in the underlying performance of the business.\nDiluted earnings per share was $2.92 in 2024. Diluted earnings per share for 2025 is projected to range from $2.95 to $3.00. Excluding the per share impact of special charges, adjusted diluted earnings per share was $2.95 in 2024. Adjusted diluted earnings per share, excluding an estimated per share impact from special charges of $0.05, is projected to range from $3.00 to $3.05 in 2025. We expect adjusted diluted earnings per share to increase by 2% to 4%, which includes a 2% unfavorable impact from currency rates, or to increase by 4% to 6% on a constant currency basis over adjusted diluted earnings per share of $2.95 in 2024.\nRESULTS OF OPERATIONS – COMPANY\n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nNet sales\n$\n1,724.9 \n$\n1,679.8 \n$\n4,989.9 \n$\n4,925.7 \nPercent increase (decrease) \n2.7 \n%\n(0.3)\n%\n1.3 \n%\n0.3 \n%\nComponents of percent change in net sales \n– \nincrease (decrease):\nPricing actions\n0.6 \n%\n(0.2)\n%\n0.3 \n%\n0.8 \n%\nVolume and product mix\n1.2 \n%\n0.6 \n%\n1.5 \n%\n(0.4)\n%\nDivestitures\n— \n%\n(0.3)\n%\n— \n%\n(0.3)\n%\nForeign exchange\n0.9 \n%\n(0.4)\n%\n(0.5)\n%\n0.2 \n%\nGross profit\n$\n645.1 \n$\n649.9 \n$\n1,871.9 \n$\n1,868.8 \nGross profit margin\n37.4 \n%\n38.7 \n%\n37.5 \n%\n37.9 \n%\nSales for the third quarter of 2025 increased by 2.7% from the same period in 2024 and increased by 1.8% on an organic basis (that is, excluding the impact of divestitures and foreign currency exchange as more fully described under the caption, Non-GAAP Financial Measures). Pricing favorably impacted sales by 0.6%.\n F\navorable volume and product mix increased sales by 1.2% driven by favorable volume and product mix from our Consumer segment of 2.2% offset by unfavorable volume and product mix from our Flavor Solutions segment of 0.3%. Foreign currency rates increased sales by 0.9%.\nSales for the nine months ended August 31, 2025 increased by 1.3% from the same period in 2024 and increased by 1.8% on an organic basis. Pricing favorably impacted sales by 0.3%. Favorable volume and product mix increased sales by 1.5%, driven by growth across all three regions in our Consumer segment. Foreign currency rates decreased sales by 0.5%.\nGross profit for the third quarter of 2025 decreased by $4.8 million, or 0.7%, from the same period in 2024. Our gross profit margin was 37.4%, a decrease of 130 basis points, driven by increased commodity costs including the impact of tariffs, and increased conversion cost including costs to support increased capacity for future growth, partially offset by Comprehensive Continuous Improvement (CCI) program-led cost savings. Also, gross profit was impacted by unfavorable customer mix that was offset by the effects of favorable pricing. Excluding the impact of special charges related to the step up of acquired inventory included in cost of goods sold, adjusted gross margin was 37.5% for the third quarter of 2025.\n24\nTable of Contents\nGross profit for the nine months ended August 31, 2025 increased by $3.1 million, or 0.2%, from the same period in 2024. Our gross profit margin was \n37.5%, a decrease of 40 basis points, driven by unfavorable customer mix and increased conversion costs including costs to support increased capacity for future growth, partially offset by favorable pricing and CCI-led cost savings. Excluding the impact of special charges related to the step up of acquired inventory included in cost of goods sold, adjusted gross margin was 37.5% for the nine months ended August 31, 2025.\n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nSelling, general & administrative (SG&A) expense\n$\n352.5 \n$\n361.5 \n$\n1,095.5 \n$\n1,106.8 \nPercent of net sales\n20.5 \n%\n21.5 \n%\n21.9 \n%\n22.5%\nSG&A expense decreased by $9.0 million in the third quarter of 2025 as compared to the same period in 2024, driven primarily by lower performance-based employee incentive expense and CCI-led cost savings including the impact of SG&A streamlining actions. SG&A as a percentage of net sales decreased by 100 basis points.\nSG&A decreased by $11.3 million in the nine months ended August 31, 2025 as compared to the same period in 2024, driven primarily by lower performance-based employee incentive expense and CCI-led cost savings including the impact of SG&A streamlining actions, partially offset by increased selling and marketing expense. SG&A as a percentage of net sales decreased by 60 basis points as compared to the prior year period.\n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nSpecial charges\n$\n3.9 \n$\n1.9 \n$\n16.7 \n$\n7.9 \nDuring the three months ended August 31, 2025, we recorded $3.9 million of special charges, including transaction and integration expenses. Those expenses consisted of $1.3 million associated with employee severance and related benefits associated with our SG&A streamlining actions, $1.7 million associated with other actions and $0.9 million of transaction and integration costs. \nDuring the nine months ended August 31, 2025, we recorded $16.7 million of special charges, including transaction and integration expenses. Those expenses consisted principally of $12.7 million associated with employee severance and related benefits associated with our SG&A streamlining actions, $2.3 million associated with other actions and $1.7 million of transaction and integration costs. \nDuring the three months ended August 31, 2024, we recorded $1.9 million of special charges, consisting principally of $0.7 million associated with our Global Operating Effectiveness (GOE) program and $1.2 million associated with the transition of a manufacturing facility in Europe, Middle East, and Africa (EMEA).\nDuring the nine months ended August 31, 2024, we recorded $7.9 million of special charges, consisting principally of $5.3 million associated with our GOE program, and $2.6 million associated with the transition of a manufacturing facility in EMEA.\nDetails with respect to the composition of special charges, including transaction and integration expenses, are included in Note 2 of the notes to the accompanying condensed consolidated financial statements.\n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nInterest expense\n$\n50.2 \n$\n53.5 \n$\n149.7 \n$\n156.7 \nOther income, net\n9.4 \n13.2 \n29.0 \n36.7 \nInterest expense decreased by $3.3 million and $7.0 million for the three and nine months ended August 31, 2025, respectively, compared to the prior year periods. These decreases were driven by the effects of lower average borrowing levels and lower interest rates. \nOther income, net, decreased by $3.8 million and $7.7 million for the three and nine months ended August 31, 2025, respectively, compared to prior periods primarily due to a lower level of interest income driven by lower interest rates and unfavorable impacts of foreign exchange rates and lower non-service cost income associated with our pension and postretirement benefit plans. \n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nIncome from consolidated operations before income taxes\n$\n247.9 \n$\n246.2 \n$\n639.0 \n$\n634.1 \nIncome tax expense \n39.3 \n41.0 \n130.2 \n116.8 \nEffective tax rate\n15.9 \n%\n16.7 \n%\n20.4 \n%\n18.4 \n%\n25\nTable of Contents\nThe provision for income taxes is based on the estimate of the annual effective tax rate adjusted to reflect the tax impact of items discrete to the fiscal period. We record tax expense or tax benefits that do not relate to ordinary income in the current fiscal year discretely in the period in which such items occur pursuant to the requirements of U.S. GAAP. Examples of such types of discrete items not related to ordinary income include, but are not limited to, excess tax benefits or expense associated with stock-based compensation, changes in estimates of the outcome of tax matters related to prior years, including reversals of reserves upon the lapsing of statutes of limitations, provision-to-return adjustments, the settlement of tax audits, changes in enacted tax rates or other legislation, changes in the assessment of deferred tax valuation allowances, and the tax effects of intra-entity asset transfers (other than inventory).\nIncome tax expense for the three months ended August 31, 2025 included $20.0 million of net discrete tax benefits consisting principally of the following: (i) $8.7 million of tax benefits from the reversal of certain reserves for unrecognized tax benefits and related interest, including $4.4 million associated with the expiration of statutes of limitations, (ii) $8.1 million of tax benefits resulting from state tax matters, and related deferred taxes, and (iii) $3.5 million of tax benefits resulting from an adjustment to a prior year tax accrual, and related deferred taxes, based on the final returns filed.\nIncome tax expense for the nine months ended August 31, 2025 included $27.6 million of net discrete tax benefits consisting principally of the following: (i) $10.2 million of tax benefits from the reversal of certain reserves for unrecognized tax benefits and related interest, including $5.9 million associated with the expiration of statutes of limitations, (ii) $8.0 million of tax benefits resulting from state tax matters, and related deferred taxes, (iii) a $5.0 million tax benefit resulting from the revaluation of deferred taxes associated with enacted legislation, (iv) $3.5 million of tax benefits resulting from an adjustment to a prior year tax accrual, and related deferred taxes, based on the final return filed, and (v) $1.0 million of excess tax benefits associated with stock compensation.    \nIncome tax expense for the three months ended August 31, 2024 included $16.3 million of net discrete tax benefits consisting principally of the following: (i) $5.5 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with the expiration of statutes of limitations, (ii) $5.5 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with the effective settlement from conclusion of a tax examination, (iii) $8.3 million of tax benefits resulting from state tax matters, and related deferred taxes, (iv) $1.5 million of tax benefits resulting from an adjustment to a prior year tax accrual, and related deferred taxes, based on the final returns filed, and (v) $4.6 million of tax expense associated with the adjustment of a valuation allowance due to changes in judgment about the realizability of the deferred tax asset.\nIncome tax expense for the nine months ended August 31, 2024 included $34.9 million of net discrete tax benefits consisting principally of the following: (i) $19.4 million of tax benefits associated with the recognition of a deferred tax asset related to an international legal entity reorganization, (ii) $6.8 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with the expiration of statutes of limitations, (iii) $5.5 million of tax benefit from the reversal of certain reserves for unrecognized tax benefits and related interest associated with the effective settlement from conclusion of a tax examination, (iv) $6.4 million of tax benefits resulting from state tax matters, and related deferred taxes, (v) $1.5 million of tax benefits resulting from an adjustment to a prior year tax accrual, and related deferred taxes, based on the final returns filed, and (vi) $4.6 million of tax expense associated with the adjustment of a valuation allowance due to changes in judgment about the realizability of the deferred tax asset.\nOn July 4, 2025, legislation known as the One Big Beautiful Bill Act (OBBBA) was signed into law. The OBBBA makes changes to the United States corporate income tax system, including, among other provisions, the immediate expensing of research and development expenditures, and 100 percent bonus depreciation on qualified property. While we expect certain provisions of the OBBBA to change the timing of cash tax payments in the current fiscal year and future year periods, we do not expect the legislation to have a material impact on our consolidated financial statements. \n \nThree months ended August 31,\nNine months ended August 31,\n2025\n2024\n2025\n2024\nIncome from unconsolidated operations\n$\n16.9 \n$\n17.9 \n$\n54.0 \n$\n56.0 \nIncome from unconsolidated operations, which is presented net of the elimination of earnings attributable to non-controlling interests, decreased by $1.0 million for the three months ended August 31, 2025, driven by the results of our largest joint venture, McCormick de Mexico, where unfavorable impacts from foreign exchange rates were partially offset by improved operating results. \nIncome from unconsolidated operations decreased by $2.0 million for the nine months ended August 31, 2025, driven by the results of our largest joint venture, McCormick de Mexico, which included unfavorable impacts from foreign exchange rates, which was partially offset by the overall favorable results from our other unconsolidated entities. \n26\nTable of Contents\nThe following table outlines the major components of the change in diluted earnings per share from 2024 to 2025:\nThree months ended August 31,\nNine months ended August 31,\n2024 Earnings per share – diluted\n$\n0.83 \n$\n2.13 \nImpact of change in operating income\n$\n0.02 \n0.05 \nIncrease in special charges \n(0.01)\n(0.03)\nDecrease in interest expense\n0.01 \n0.02 \nDecrease in other income, net\n(0.01)\n(0.02)\nDecrease in income from unconsolidated operations\n— \n(0.01)\nImpact of change in effective income tax rate, excluding taxes on special charges \n— \n(0.05)\n2025 Earnings per share – diluted\n$\n0.84 \n$\n2.09 \nRESULTS OF OPERATIONS — SEGMENTS\nWe measure the performance of our business segments based on operating income, excluding special charges for the periods presented. See Note 10 of the notes to our accompanying condensed consolidated financial statements for additional information on our segment measures as well as for a reconciliation by segment of operating income, excluding special charges, to consolidated operating income. In the following discussion, we refer to our previously described measure of segment profit as segment operating income. \nCONSUMER SEGMENT\n \nThree months ended August 31,\nNine months ended August 31,\n \n2025\n2024\n2025\n2024\n \n \n \n \nNet sales\n$\n973.2 \n$\n937.4 \n$\n2,823.0 \n$\n2,763.4 \nPercent increase\n3.8 \n%\n— \n%\n2.2 \n%\n0.2 \n%\nSegment operating income\n$\n193.8 \n$\n186.8 \n$\n504.1 \n$\n512.4 \nSegment operating income margin\n19.9 \n%\n19.9 \n%\n17.9 \n%\n18.5 \n%\nIn the third quarter of 2025, sales of our Consumer segment increased by 3.8% compared to the third quarter of 2024 and increased by 2.6% on an organic basis. Higher volume and product mix increased sales by 2.2%, driven by growth in the Americas and EMEA regions, partially offset by unfavorable volume and product mix in the APAC region. Pricing actions favorably impacted sales by 0.4%. The favorable impact of foreign currency rates increased sales by 1.2% and is excluded from our measure of sales growth of 2.6% on an organic basis.\nIn the Americas region, Consumer segment sales increased by 2.7% in the third quarter of 2025 compared to the same quarter of 2024 on both a reported and an organic basis. Favorable volume and product mix increased sales by 2.7% driven by growth across core categories. Pricing was comparable. The impact of foreign currency rates was flat and is excluded from our measure of sales growth of 2.7% on an organic basis. \nIn the EMEA region, Consumer segment sales increased by 11.4% in the third quarter of 2025 compared to the same quarter of 2024 and increased by 4.4% on an organic basis. Favorable volume and product mix increased sales by 1.6%. Favorable pricing impacted sales by 2.8%. The favorable impact from foreign currency rates increased sales by 7.0% and is excluded from our measure of sales growth of 4.4% on an organic basis.\nIn the APAC region, Consumer segment sales in the third quarter of 2025 were comparable to the same quarter of 2024 and decreased by 0.8% on an organic basis. Unfavorable volume and product mix decreased sales by 0.6%, driven by lower sales to  foodservice customers in China. Unfavorable pricing impacted sales by 0.2%. The favorable impact from foreign currency rates increased sales by 0.8% and is excluded from our measure of sales decline of 0.8% on an organic basis.\nFor the nine months ended August 31, 2025, sales of our Consumer segment increased 2.2% as compared to the same period in 2024 and increased by 2.3% on an organic basis. Higher volume and product mix increased sales by 2.7%, driven by growth in all regions. Unfavorable pricing impacted sales by 0.4%. The unfavorable impact from foreign currency rates decreased sales by 0.1% and is excluded from our measure of sales growth of 2.3% on an organic basis.\nSegment operating income for our Consumer segment for the third quarter of 2025 increased by $7.0 million, or 3.7%, compared to the same period in 2024, driven by an increase in gross profit and a decrease in SG&A expense. The increase in \n27\nTable of Contents\ngross profit was driven by higher net sales, partially offset by increased conversion cost including costs to support increased capacity for future growth, and increased commodity costs including the impact of tariffs. The decrease in SG&A expense was driven by the items described in the consolidated discussion. On a constant currency basis, segment operating income increased by 3.2%.\nSegment operating income for our Consumer segment for the nine months ended August 31, 2025 decreased by $8.3 million, or 1.6%, as compared to the same period in 2024, driven a decrease in gross profit, partially offset by a decrease in SG&A expense. The decrease in gross profit was driven by unfavorable product mix, increased conversion costs including costs to support increased capacity for future growth and unfavorable pricing actions, partially offset by higher sales volume and CCI-led cost savings. The decrease in SG&A expense was driven by the items described in the consolidated discussion. Segment operating margin decreased by 60 basis points to 17.9%. On a constant currency basis, segment operating income decreased by 1.4%.\nFLAVOR SOLUTIONS SEGMENT\n \nThree months ended August 31,\nNine months ended August 31,\n \n2025\n2024\n2025\n2024\n \nNet sales\n$\n751.7 \n$\n742.4 \n$\n2,166.9 \n$\n2,162.3 \nPercent increase (decrease)\n1.2 \n%\n(0.7)\n%\n0.2 \n%\n0.5 \n%\nSegment operating income\n$\n99.8 \n$\n101.6 \n$\n273.3 \n$\n249.6 \nSegment operating income margin\n13.3 \n%\n13.7 \n%\n12.6 \n%\n11.5 \n%\nIn the third quarter of 2025, sales of our Flavor Solutions segment increased by 1.2% as compared to the third quarter of 2024 and increased by 0.6% an organic basis. Unfavorable volume and product mix decreased sales by 0.3% driven by the Americas and EMEA regions partially offset by growth in the APAC region. Favorable pricing increased sales by 0.9%. The favorable impact of foreign currency rates increased sales by 0.6% and is excluded from our measure of sales growth of 0.6% on an organic basis.\nIn the Americas region, Flavor Solutions sales increased by 0.1% in the third quarter of 2025 compared to the third quarter of 2024 and increased by 0.9% on an organic basis. Unfavorable volume and product mix decreased sales by 1.3% driven by lower sales to branded foodservice and packaged food customers. Favorable pricing impacted sales by 2.2%. The unfavorable impact from foreign currency rates decreased sales by 0.8% and is excluded from our measure of sales growth of 0.9% on an organic basis.\nIn the EMEA region, Flavor Solutions sales increased by 2.1% in the third quarter of 2025 compared to the third quarter of 2024 and decreased by 3.1% on an organic basis. Unfavorable volume and product mix decreased sales by 1.0%, driven by the effect of lower sales to packaged food customers. Unfavorable pricing impacted sales by 2.1%. The favorable impact from foreign currency rates increased sales by 5.2% and is excluded from our measure of sales decline of 3.1% on an organic basis.\nIn the APAC region, Flavor Solutions sales increased by 7.7% in the third quarter of 2025 compared to the third quarter of 2024, and increased by 6.3% on an organic basis. Favorable volume and product mix increased sales by 9.0%, primarily driven by growth in China and Southeast Asia. Pricing unfavorably impacted sales by 2.7%. The favorable impact from foreign currency rates increased sales by 1.4% and is excluded from our measure of sales growth of 6.3% on an organic basis.\nFor the nine months ended August 31, 2025, sales of our Flavor Solutions segment increased 0.2% as compared to the same period in 2024 and increased by 1.2% on an organic basis. Favorable volume and product mix increased sales by 0.1% driven by growth in the APAC region mostly offset by unfavorability in the Americas and EMEA regions. Favorable pricing increased sales by 1.1%, driven by the Americas regions partially offset by unfavorable pricing in the EMEA and APAC regions. The unfavorable impact of foreign currency rates decreased segment sales by 1.0% and is excluded from our measure of sales growth of 1.2% on an organic basis.\nSegment operating income for our Flavor Solutions segment for the third quarter of 2025 decreased by $1.8 million, or 1.8%, compared to the same period in 2024, driven by a decrease in gross profit partially offset by lower SG&A expense. The decrease in gross profit was driven by increased commodity costs including the impact of tariffs, unfavorable product mix and increased conversion costs including costs to support increased capacity for future growth, partially offset by favorable pricing. The decrease in SG&A expense was driven by the items described in the consolidated discussion. Segment operating margin decreased by 40 basis points to 13.3%. On a constant currency basis, segment operating income decreased by 1.6%.\nSegment operating income for our Flavor Solutions segment for the nine months ended August 31, 2025 increased by $23.7 million, or 9.5%, compared to the same period in 2024, driven by an increase in gross profit and lower SG&A expense. The increase in gross profit was driven by the impacts of favorable pricing and CCI-led cost savings, partially offset by increased \n28\nTable of Contents\nconversion costs including costs to support increased capacity for growth. The decrease in SG&A expense was driven by the items described in the consolidated discussion. Segment operating margin increased by 110 basis points to 12.6%. On a constant currency basis, segment operating income increased by 12.0%.\nMARKET RISK SENSITIVITY\nWe utilize derivative financial instruments to enhance our ability to manage risk, including foreign exchange and interest rate exposures, which exist as part of our ongoing business operations. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instrument. The use of derivative financial instruments is monitored through regular communication with senior management and the utilization of written guidelines. \nForeign Exchange Risk\nWe are exposed to foreign currency risk affecting net investments in subsidiaries, transactions (both third-party and intercompany) and earnings denominated in foreign currencies. Management assesses foreign currency risk based on transactional cash flows and translational volatility and may enter into forward contract and currency swaps with highly-rated financial institutions to reduce fluctuations in the long or short currency positions. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instruments. All derivatives are designated as hedges.\nThe following table sets forth the notional values and unrealized net gain (loss) of the portfolio of our forward foreign currency and cross currency swap contracts:\nAugust 31, 2025\nNovember 30, 2024\nForward foreign currency:\nNotional value\n$\n1,136.2 \n$\n1,034.2 \nUnrealized net (loss)\n(2.5)\n(7.3)\nCross currency swaps:\nNotional value\n1,027.2 \n945.5 \nUnrealized net (loss) gain \n(14.4)\n36.8 \nThe outstanding notional value is a result of our decisions on foreign currency exposure coverage, based on our foreign currency and foreign currency translation exposures.\nInterest Rate Risk\nWe manage our interest rate exposure by entering into both fixed and variable rate debt arrangements. We use interest rate swaps to minimize worldwide financing costs and to achieve a desired mix of fixed and variable rate debt. We do not enter into contracts for trading purposes, nor are we a party to any leveraged derivative instruments, and all derivatives are designated as hedges.\nThe following table sets forth the notional values and unrealized net gain (loss) of our interest rate swap contracts:\nAugust 31, 2025\nNovember 30, 2024\nNotional value\n$\n600.0 \n$\n600.0 \nUnrealized net (loss)\n(24.9)\n(37.9)\nThe change in fair values of our interest rate swap contracts is due to changes in interest rates on the notional amounts outstanding as of each date as well as the remaining duration of our interest rate derivative contracts. \nCommodity Risk\nWe purchase certain raw materials which are subject to price volatility caused by weather, market conditions, growing and harvesting conditions, governmental actions, and other factors beyond our control. Our most significant raw materials are dairy products, pepper, onion, garlic, capsicums (red peppers and paprika), tomato products, sugar, and salts. While future movements of raw material costs are uncertain, we respond to this volatility in a number of ways, including strategic raw material purchases, purchases of raw material for future delivery, and customer price adjustments. We generally have not used derivatives to manage the volatility related to this risk.\n29\nTable of Contents\nCredit Risk\nThe customers of our Consumer segment are predominantly food retailers and food wholesalers. Consolidations in these industries have created larger customers. In addition, competition has increased with the growth in alternative channels including mass merchandisers, dollar stores, warehouse clubs, discount chains, and e-commerce. This has caused some customers to be less profitable and increased our exposure to credit risk. Some of our customers and counterparties are highly leveraged. We continue to closely monitor the credit worthiness of our customers and counterparties. We believe that our allowance for doubtful accounts properly recognizes trade receivables at realizable value. We consider nonperformance credit risk for other financial instruments to be insignificant.\nNON-GAAP FINANCIAL MEASURES\nThe following tables include financial measures of organic net sales, adjusted gross profit, adjusted gross profit margin, adjusted operating income, adjusted operating income margin, adjusted income tax expense, adjusted income tax rate, adjusted net income, and adjusted diluted earnings per share. These represent non-GAAP financial measures which are prepared as a complement to our financial results prepared in accordance with United States generally accepted accounting principles. These financial measures exclude the impact, as applicable, of the following:\n•\nSpecial charges - Special charges consist of expenses and income associated with certain actions undertaken by us to reduce fixed costs, simplify or improve processes, and improve our competitiveness and are of such significance in terms of both up-front costs and organizational/structural impact to require advance approval by our Management Committee. Expenses associated with the approved actions are classified as special charges upon recognition and monitored on an ongoing basis through completion. Included in special charges are transaction and integration costs incurred in conjunction with acquisitions. \nDetails with respect to the composition of special charges, including transaction and integration expenses, set forth below are included in Note 2 of the notes to our accompanying condensed consolidated financial statements. Details with respect to the composition of special charges for the year ended November 30, 2024 are included in Note 2 of the notes to the consolidated financial statements included in our Annual Report on Form 10-K for the year ended November 30, 2024. \nWe believe that these non-GAAP financial measures are important. The exclusion of the items noted above provides additional information that enables enhanced comparisons to prior periods and, accordingly, facilitates the development of future projections and earnings growth prospects. This information is also used by management to measure the profitability of our ongoing operations and analyze our business performance and trends.\nThese non-GAAP financial measures may be considered in addition to results prepared in accordance with GAAP; however, they should not be viewed as a substitute for, or superior to, GAAP results. Furthermore, these non-GAAP financial measures may not be comparable to similarly titled measures of other companies, as they may calculate them differently than we do. We intend to continue providing these non-GAAP financial measures as part of our future earnings discussions, ensuring consistency in our financial reporting.\n30\nTable of Contents\nA reconciliation of these non-GAAP financial measures to the related GAAP financial measures follows:\nFor the year ended November 30, 2024\nFor the three months ended \nFor the nine months ended \nEstimated for the year ending November 30, 2025\nAugust 31, 2025\nAugust 31, 2024\nAugust 31, 2025\nAugust 31, 2024\nGross profit\n$\n2,591.0 \n$\n645.1 \n$\n649.9 \n$\n1,871.9 \n$\n1,868.8 \nImpact of special charges included in cost of goods sold\n— \n1.0 \n— \n1.0 \n— \nAdjusted gross profit\n$\n2,591.0 \n$\n646.1 \n$\n649.9 \n$\n1,872.9 \n$\n1,868.8 \nGross profit margin\n \n(1)\n38.5 \n%\n37.4 \n%\n38.7 \n%\n37.5 \n%\n37.9 \n%\nImpact of special charges\n— \n%\n0.1 \n%\n— \n%\n— \n%\n— \n%\nAdjusted gross profit margin\n \n(1)\n38.5 \n%\n37.5 \n%\n38.7 \n%\n37.5 \n%\n37.9 \n%\nOperating income\n$\n1,060.3 \n$\n288.7 \n$\n286.5 \n$\n759.7 \n$\n754.1 \nImpact of special charges \n9.5 \n4.9 \n1.9 \n17.7 \n7.9 \nAdjusted operating income\n$\n1,069.8 \n$\n293.6 \n$\n288.4 \n$\n777.4 \n$\n762.0 \nOperating income margin\n \n(2)\n15.8 \n%\n16.7 \n%\n17.1 \n%\n15.2 \n%\n15.3 \n%\nImpact of special charges \n0.1 \n%\n0.3 \n%\n0.1 \n%\n0.4 \n%\n0.2 \n%\nAdjusted operating income margin\n \n(2)\n15.9 \n%\n17.0 \n%\n17.2 \n%\n15.6 \n%\n15.5 \n%\nIncome tax expense\n$\n184.0 \n$\n39.3 \n$\n41.0 \n$\n130.2 \n$\n116.8 \nImpact of special charges\n2.4 \n1.3 \n0.6 \n4.3 \n2.1 \nAdjusted income tax expense\n$\n186.4 \n$\n40.6 \n$\n41.6 \n$\n134.5 \n$\n118.9 \nIncome tax rate \n(3)\n20.5 \n%\n15.9 \n%\n16.7 \n%\n20.4 \n%\n18.4 \n%\nImpact of special charges \n— \n%\n0.2 \n%\n0.1 \n%\n0.1 \n%\n0.1 \n%\nAdjusted income tax rate\n \n(3)\n20.5 \n%\n16.1 \n%\n16.8 \n%\n20.5 \n%\n18.5 \n%\nNet income\n$\n788.5 \n$\n225.5 \n$\n223.1 \n$\n562.8 \n$\n573.3 \nImpact of special charges \n7.1 \n3.6 \n1.3 \n13.4 \n5.8 \nAdjusted net income\n$\n795.6 \n$\n229.1 \n$\n224.4 \n$\n576.2 \n$\n579.1 \nEarnings per share – diluted\n$\n2.92 \n$\n0.84 \n$\n0.83 \n$\n2.09 \n$\n2.13 \n$2.95 to $3.00\nImpact of special charges\n0.03 \n0.01 \n— \n0.05 \n0.02 \n0.05 \nAdjusted earnings per share – diluted\n$\n2.95 \n$\n0.85 \n$\n0.83 \n$\n2.14 \n$\n2.15 \n$3.00 to $3.05\n(1)\nGross profit margin, impact of special charges, and adjusted gross profit margin are calculated as gross profit, impact of special charges, and adjusted gross profit as a percentage of net sales for each period presented.\n(2)\nOperating income margin, impact of special charges, and adjusted operating income margin are calculated as operating income, impact of special charges, and adjusted operating income as a percentage of net sales for each period presented.\n(3)\nIncome tax rate is calculated as income tax expense as a percentage of income from consolidated operations before income taxes. Adjusted income tax rate is calculated as adjusted income tax expense as a percentage of income from consolidated operations before income taxes excluding special charges of $252.8 million and $248.1 million for the three months ended August 31, 2025 and 2024, respectively, and $656.7 million and $642.0 million for the nine months ended August 31, 2025 and 2024, respectively. Adjusted income tax rate is calculated as adjusted income tax expense as a percentage of income from consolidated operations before income taxes excluding special charges of $907.8 million for the year ended November 30, 2024.\n31\nTable of Contents\nBecause we are a multi-national company, we are subject to variability of our reported U.S. dollar results due to changes in foreign currency exchange rates. Those changes can be volatile. The exclusion of the effects of foreign currency exchange, or what we refer to as amounts expressed “on a constant currency basis,” is a non-GAAP measure. We believe that this non-GAAP measure provides additional information that enables enhanced comparison to prior periods excluding the translation effects of changes in rates of foreign currency exchange and provides additional insight into the underlying performance of our operations located outside of the U.S. It should be noted that our presentation herein of amounts and percentage changes on a constant currency basis does not exclude the impact of foreign currency transaction gains and losses (that is, the impact of transactions denominated in other than the local currency of any of our subsidiaries in their local currency reported results).\nWe provide organic net sales growth rates for our consolidated net sales and segment net sales. We believe that organic net sales growth rates provide useful information to investors because they provide transparency to underlying performance in our net sales by excluding the effect that foreign currency exchange rate fluctuations, acquisitions, and divestitures, as applicable, have on year-to-year comparability. A reconciliation of these measures from reported net sales growth rates, the relevant GAAP measures, are included in the tables set forth below.\nPercentage changes in sales and adjusted operating income expressed on a constant currency basis are presented excluding the impact of foreign currency exchange. To present this information for historical periods, current period results for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at the average exchange rates in effect during the corresponding period of the comparative year, rather than at the actual average exchange rates in effect during the current fiscal year. As a result, the foreign currency impact is equal to the current year results in local currencies multiplied by the change in the average foreign currency exchange rate between the current fiscal period and the corresponding period of the comparative year. \nRates of constant currency and organic growth (decline) follow:\nThree months ended August 31, 2025\nPercentage change as reported\nImpact of foreign currency exchange\nPercentage change on both a constant currency and organic basis\nNet sales:\nConsumer segment:\nAmericas\n2.7 \n%\n— \n%\n2.7 \n%\nEMEA\n11.4 \n%\n7.0 \n%\n4.4 \n%\nAPAC\n— \n%\n0.8 \n%\n(0.8)\n%\nTotal Consumer\n3.8 \n%\n1.2 \n%\n2.6 \n%\nFlavor Solutions segment:\nAmericas\n0.1 \n%\n(0.8)\n%\n0.9 \n%\nEMEA\n2.1 \n%\n5.2 \n%\n(3.1)\n%\nAPAC\n7.7 \n%\n1.4 \n%\n6.3 \n%\nTotal Flavor Solutions\n1.2 \n%\n0.6 \n%\n0.6 \n%\nTotal net sales\n2.7 \n%\n0.9 \n%\n1.8 \n%\n32\nTable of Contents\nNine months ended August 31, 2025\nPercentage change as reported\nImpact of foreign currency exchange\nPercentage change on both a constant currency and organic basis\nNet sales:\nConsumer segment:\nAmericas\n1.6 \n%\n(0.3)\n%\n1.9 \n%\nEMEA\n5.1 \n%\n1.3 \n%\n3.8 \n%\nAPAC\n1.1 \n%\n(0.9)\n%\n2.0 \n%\nTotal Consumer\n2.2 \n%\n(0.1)\n%\n2.3 \n%\nFlavor Solutions segment:\nAmericas\n(0.1)\n%\n(2.0)\n%\n1.9 \n%\nEMEA\n(2.5)\n%\n2.1 \n%\n(4.6)\n%\nAPAC\n7.7 \n%\n(0.4)\n%\n8.1 \n%\nTotal Flavor Solutions\n0.2 \n%\n(1.0)\n%\n1.2 \n%\nTotal net sales\n1.3 \n%\n(0.5)\n%\n1.8 \n%\nThree months ended August 31, 2025\nPercentage change as reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nAdjusted operating income:\nConsumer segment\n3.7 \n%\n0.5 \n%\n3.2 \n%\nFlavor Solutions segment\n(1.8)\n%\n(0.2)\n%\n(1.6)\n%\nTotal adjusted operating income\n1.8 \n%\n0.2 \n%\n1.6 \n%\nNine months ended August 31, 2025\nPercentage change as reported\nImpact of foreign currency exchange\nPercentage change on constant currency basis\nAdjusted operating income:\nConsumer segment\n(1.6)\n%\n(0.2)\n%\n(1.4)\n%\nFlavor Solutions segment\n9.5 \n%\n(2.5)\n%\n12.0 \n%\nTotal adjusted operating income\n2.0 \n%\n(1.0)\n%\n3.0 \n%\nTo present the percentage change in projected 2025 net sales, adjusted operating income, and adjusted earnings per share (diluted) on a constant currency basis, the projected local currency net sales, adjusted operating income, and adjusted net income for entities reporting in currencies other than the U.S. dollar are translated into U.S. dollars at forecasted exchange rates. These figures are then compared to the 2025 local currency projected results, which are translated into U.S. dollars at the average actual exchange rates in effect during the corresponding months of fiscal year 2024. This comparison determines what the 2025 consolidated U.S. dollar net sales, adjusted operating income, and adjusted earnings per share (diluted) would have been if the relevant currency exchange rates had not changed from those of the comparable 2024 periods.\n33\nTable of Contents\nProjections for the Year Ending November 30, 2025\nPercentage change in net sales\n0% to 2%\nImpact of unfavorable foreign currency exchange\n1 \n%\nPercentage change in net sales in constant currency\n1% to 3%\nPercentage change in adjusted operating income\n2% to 4%\nImpact of unfavorable foreign currency exchange\n1 \n%\nPercentage change in adjusted operating income in constant currency\n3% to 5%\nPercentage change in adjusted earnings per share - diluted\n2% to 4%\nImpact of unfavorable foreign currency exchange\n2 \n%\nPercentage change in adjusted earnings per share in constant currency- diluted\n4% to 6%\nLIQUIDITY AND FINANCIAL CONDITION\n \nNine months ended\n \nAugust 31, 2025\nAugust 31, 2024\n \nNet cash provided by operating activities\n$\n420.2 \n$\n463.2 \nNet cash used in investing activities\n(172.2)\n(189.1)\nNet cash used in financing activities\n(378.3)\n(205.9)\nThe primary objective of our financing strategy is to maintain a prudent capital structure that provides us with flexibility to pursue our growth objectives. We use a combination of equity and short- and long-term debt. We use short-term debt, comprised primarily of commercial paper, principally to finance ongoing operations, including our requirements for working capital (accounts receivable, prepaid expenses and other current assets, and inventories, less accounts payable, accrued payroll, and other accrued liabilities). We are committed to maintaining investment grade credit ratings.\nOur cash flows from operations enable us to fund operating projects and investments that are designed to meet our growth objectives, service our debt, fund or increase our quarterly dividends, fund capital projects and other investments, and make share repurchases when appropriate. Due to the cyclical nature of a portion of our business, our cash flow from operations has historically been the strongest during the fourth quarter of our fiscal year. Due to the timing of the interest payments on our long-term debt, interest payments are higher in the second and fourth quarters of our fiscal year.\nWe believe that our sources of liquidity, which include existing cash balances, cash flows from operations, existing credit facilities, our commercial paper program, and access to capital markets, will provide sufficient liquidity to meet our debt obligations, including any repayment of debt or refinancing of debt, working capital needs, planned capital expenditures, the payment associated with an acquisition and payment of anticipated quarterly dividends for at least the next twelve months.\nIn the condensed consolidated cash flow statement, the changes in operating assets and liabilities are presented excluding the translation effects of changes in foreign currency exchange rates as these do not reflect actual cash flows. Accordingly, the amounts in the cash flow statement do not agree with changes in the operating assets and liabilities that are presented in the balance sheet. \nOperating Cash Flow \n— \nNet cash provided by operating activities of $420.2 million for the nine months ended August 31, 2025, decreased $43.0 million as compared to $463.2 million for the corresponding 2024 period. The decrease in operating cash flow was primarily driven by higher cash used for working capital. The higher use of cash associated with working capital was driven by an increased use of cash associated with accounts payable which was partially offset by a lower use of cash associated with inventory in the 2025 period as compared to the 2024 period.\nInvesting Cash Flow \n— \nCash used in investing activities of $172.2 million for the nine months ended August 31, 2025 decreased by $16.9 million as compared to $189.1 million for the corresponding period in 2024. Capital expenditures decreased from the 2024 level of $189.3 million to $138.1 million. We expect 2025 capital expenditures to approximate $250 million. Cash used for the acquisition of a business was $34.1 million.\n34\nTable of Contents\nFinancing Cash Flow \n— \nFinancing activities used cash of $378.3 million for the nine months ended August 31, 2025 and increased $172.4 million as compared to $205.9 million for the corresponding period in 2024. The decrease is a result of changes in our net borrowings, share repurchase activity, and dividends, all as described below.\nThe following table outlines our net borrowing activities:\n \nNine months ended\n \nAugust 31, 2025\nAugust 31, 2024\n \nNet increase in short-term borrowings\n$\n13.2 \n$\n908.6 \nRepayments of long-term debt\n(15.7)\n(752.8)\nLong-term debt borrowings\n2.4 \n— \nNet cash (used) provided by borrowing activities\n$\n(0.1)\n$\n155.8 \nThe following table outlines the activity in our share repurchase program:\nNine months ended\nAugust 31, 2025\nAugust 31, 2024\nNumber of shares of common stock repurchased (in thousands)\n382 \n382 \nDollar amount (in millions)\n$\n29.2 \n$\n29.0 \nAs of August 31, 2025, approximately $419 million remained of the $600 million share repurchase program that was authorized by the Board of Directors in November 2019. The timing and amount of any shares repurchased is determined by our management based on its evaluation of market conditions and other factors.\nDuring the nine months ended August 31, 2025, we received proceeds of $15.1 million from exercised stock options as compared to $12.8 million received in the corresponding 2024 period. We repurchased $13.2 million and $8.9 million of common stock during the nine months ended August 31, 2025 and 2024, respectively, in conjunction with employee tax withholding requirements associated with our stock compensation plans. \nDividends paid increased to $362.2 million, or a per share quarterly dividend of $0.45, in the first nine months of 2025 from $338.3 million, or a per share quarterly dividend of $0.42, of dividends paid in the same period last year. The timing and amount of any future dividends is determined by our Board of Directors.\nMost of our cash is in our subsidiaries outside of the U.S. We manage our worldwide cash requirements by considering available funds among the many subsidiaries through which we conduct our business and the cost effectiveness with which those funds can be accessed. Those balances are generally available without legal restrictions to fund ordinary business operations, capital projects and any possible future acquisitions. \nAt August 31, 2025 and 2024, we temporarily used $652.2 million and $609.0 million, respectively, of cash from our non-U.S. subsidiaries to pay down short-term debt in the U.S. During a quarter, our short-term borrowings vary, but are typically lower at the end of a quarter. The average short-term borrowings outstanding for the nine months ended August 31, 2025 and 2024 were $1,099.4 million and $955.8 million, respectively. Total average debt outstanding for the nine months ended August 31, 2025 and 2024 was $4,899.4 million and $4,970.8 million, respectively. \nThe reported values of our assets and liabilities are significantly affected by fluctuations in foreign exchange rates between periods. At August 31, 2025, the exchange rate for the British pound sterling, Euro, Canadian dollar, Mexican peso, Chinese renminbi, Australian dollar, and Polish zloty were higher than the U.S. dollar at November 30, 2024. \nCredit and Capital Markets\nCash flows from operating activities are our primary source of liquidity for funding growth, dividends, capital expenditures and share repurchases. We also rely on our revolving credit facilities, or borrowings backed by these facilities, to fund working capital needs and other general corporate requirements. \nIn May 2025, we entered into a five-year $2.0 billion revolving credit facility which will expire in May 2030 and simultaneously cancelled the five-year $1.5 billion revolving credit facility which was set to expire in June 2026 and the 364-day $500 million revolving credit facility which was set to expire in August 2025. The current pricing for the five-year credit facility, on a fully drawn basis, is Term SOFR plus 1.125%. The pricing of the revolving credit facility is based on a credit rating grid that contains a fully drawn maximum pricing of the credit facility equal to Term SOFR plus 1.50%. The provisions of the revolving credit facility restrict subsidiary indebtedness and require us to maintain a minimum interest coverage ratio. We do not expect that this covenant will limit our access to those facilities for the foreseeable future. \n35\nTable of Contents\nWe generally use our revolving credit facilities to support our issuance of commercial paper. If the commercial paper market is not available or viable, we could borrow directly under our revolving credit facility. This facility is made available by a syndicate of banks, with various commitments per bank. If any of the banks in this syndicate are unable to perform on their commitments, our liquidity could be impacted, which could reduce our ability to grow through funding of our working capital. We periodically review our banking and financing relationships, considering the stability of the institutions and other aspects of the relationships. In addition, we engage in regular communication with all banks participating in our credit facility. During these communications, none of the banks have indicated that they may be unable to perform on their commitments. Based on these communications and our monitoring activities, we believe our banks will perform on their commitments.\nMaterial Cash Requirements\nWe will continue to have cash requirements to support seasonal working capital needs and capital expenditures, to pay interest, to service debt, and to fund acquisitions. As part of our ongoing operations, we enter into contractual arrangements that obligate us to make future cash payments. Our primary obligations include principal and interest payments on our outstanding short-term borrowings and long-term debt. In the next year, our most significant debt service obligations include the maturity of our $250.0 million, 3.25% notes due in November 2025 and our $500.0 million, 0.90% notes due in February 2026. During the third quarter of 2025 we entered into a definitive agreement, subject to customary closing and regulatory conditions, to acquire an additional 25% ownership interest in our largest joint venture, McCormick de Mexico, for a purchase price of $750 million which is expected to be completed early in the fiscal year ending November 30, 2026. Our other cash requirements include raw material purchases, lease payments, income taxes, anticipated quarterly dividends, and pension and postretirement benefits, as well as other contractual obligations. \nThese obligations impact our liquidity and capital resource needs. To meet those cash requirements, we intend to use our existing cash, cash equivalents and internally generated funds, to borrow under our existing credit facilities or under other short-term borrowing facilities and depending on market conditions and upon the significance of the cost of a particular debt maturity to our then-available sources of funds, to obtain additional short- and long-term financing. We believe that the cash provided from these sources will be adequate to meet our future cash requirements.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nNew accounting pronouncements are issued periodically that affect our current and future operations. See Note 1 of notes to the accompanying condensed consolidated financial statements for further details of these impacts.\nCRITICAL ACCOUNTING ESTIMATES AND ASSUMPTIONS\nIn preparing the financial statements, we are required to make estimates and assumptions that have an impact on the assets, liabilities, revenue and expenses reported. These estimates can also affect supplemental information disclosed by us, including information about contingencies, risk and financial condition. We believe, given current facts and circumstances, our estimates and assumptions are reasonable, adhere to GAAP and are consistently applied. Inherent in the nature of an estimate or assumption is the fact that actual results may differ from estimates, and estimates may vary as new facts and circumstances arise. In preparing the financial statements, we make routine estimates and judgments in determining the net realizable value of accounts receivable, inventory, fixed assets, and prepaid allowances. Our most critical accounting estimates and assumptions are included in our Annual Report on Form 10-K for the fiscal year ended November 30, 2024.\nThere have been no changes in our critical accounting estimates and assumptions included in our Annual Report on Form 10-K for the fiscal year ended November 30, 2024.\nFORWARD-LOOKING INFORMATION\nCertain statements contained in this report, including statements concerning expected performance such as those relating to net sales, gross margin, earnings, cost savings, special charges, including transaction and integration expenses, acquisitions, brand marketing support, volume and product mix, income tax expense, and the impact of foreign currency rates are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. These statements may be identified by the use of words such as “may,” “will,” “expect,” “should,” “anticipate,” “intend,” “believe,” “plan,” and similar expressions. These statements may relate to: general economic and industry conditions, including consumer spending rates, recessions, interest rates, and availability of capital; expectations regarding sales growth potential in various geographies and markets, including the impact of brand marketing support, product innovation, and customer, channel, category, heat platform, and e-commerce expansion; expected trends in net sales, earnings performance, and other financial measures; the expected impact of pricing actions on the Company's results of operations, including our sales volume and mix as well as gross margins; the expected impact of the inflationary cost environment on our business; the anticipated effects of factors affecting our supply chain, including the availability and prices of commodities and other supply chain resources such as raw materials, packaging, labor, and transportation; the potential impact of trade policies, including new tariffs; the expected impact of productivity improvements, including those associated with our CCI program and the Global Business Services operating model initiative; \n36\nTable of Contents\nthe ability to identify, attract, hire, retain, and develop qualified personnel and the next generation of leaders; the impact of ongoing conflicts, including those between Russia and Ukraine and the war in the Middle East, including the potential for broader economic disruption; expected working capital improvements; the anticipated timing and costs of implementing our business transformation initiative, which includes the implementation of a global enterprise resource planning (ERP) system; the expected impact of accounting pronouncements; expectations regarding pension and postretirement plan contributions and anticipated charges associated with those plans; the holding period and market risks associated with financial instruments; the impact of foreign exchange fluctuations; the adequacy of internally generated funds and existing sources of liquidity, such as the availability of bank financing; the anticipated sufficiency of future cash flows to enable payments of interest, repayment of short- and long-term debt, working capital needs, planned capital expenditures, quarterly dividends, and our ability to obtain additional short- and long-term financing or issue additional debt securities; and expectations regarding purchasing shares of McCormick's common stock under the existing repurchase authorization.\nThese and other forward-looking statements are based on management’s current views and assumptions and involve risks and uncertainties that could significantly affect expected results. Results may be materially affected by factors such as: the Company's ability to drive revenue growth; the Company's ability to increase pricing to offset, or partially offset, inflationary pressures on the cost of our products; damage to the Company's reputation or brand name; loss of brand relevance; increased private label use; the Company's ability to offset cost pressures or business impacts related to trade policies, including new tariffs; the Company's ability to drive productivity improvements, including those related to our CCI program and other streamlining actions; product quality, labeling, or safety concerns; negative publicity about our products; actions by, and the financial condition of, competitors and customers; the longevity of mutually beneficial relationships with our large customers; the ability to identify, interpret and react to changes in consumer preference and demand; business interruptions due to natural disasters, unexpected events or public health crises; issues affecting the Company's supply chain and procurement of raw materials, including fluctuations in the cost and availability of raw and packaging materials; labor shortage, turnover and labor cost increases; the impact of the ongoing conflicts between Russia and Ukraine and the war in the Middle East, including the potential for broader economic disruption; government regulation, and changes in legal and regulatory requirements and enforcement practices; the lack of successful acquisition and integration of new businesses; global economic and financial conditions generally, availability of financing, interest and inflation rates, and the imposition of tariffs, quotas, trade barriers and other similar restrictions; foreign currency fluctuations; the effects of our amount of outstanding indebtedness and related level of debt service as well as the effects that such debt service may have on the Company's ability to borrow or the cost of any such additional borrowing, our credit rating, and our ability to react to certain economic and industry conditions; impairments of indefinite-lived intangible assets; assumptions we have made regarding the investment return on retirement plan assets, and the costs associated with pension obligations; the stability of credit and capital markets; risks associated with the Company's information technology systems, including the threat of data breaches and cyber-attacks; the Company's inability to successfully implement our business transformation initiative; fundamental changes in tax laws; including interpretations and assumptions we have made, and guidance that may be issued, and volatility in our effective tax rate; climate change; Environmental, Social and Governance (ESG) matters; infringement of intellectual property rights, and those of customers; litigation, legal and administrative proceedings; the Company's inability to achieve expected and/or needed cost savings or margin improvements; negative employee relations; and other risks described in the Company's filings with the Securities and Exchange Commission.\nActual results could differ materially from those projected in the forward-looking statements. The Company undertakes no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required by law."
}