{
  "source_file": "mlm-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1 – Business\n\n\nPAR\nT I\n\n\nITEM 1 –\n BUSINESS\n\n\nGeneral\n\n\nMartin Marietta Materials, Inc. (the Company or Martin Marietta) is a natural resource-based building materials company. The Company supplies aggregates (crushed stone, sand and gravel) through its network of approximately 390 quarries, mines and distribution yards in 28 states, Canada and The Bahamas. In 2024, aggregates gross profit accounted for 76% of the Company’s total reportable segment gross profit. Martin Marietta also provides cement and downstream products, namely, ready mixed concrete, asphalt and paving services, in targeted markets where the Company has a leading aggregates position. The Company’s heavy-side building materials are used in infrastructure, nonresidential and residential construction projects. Aggregates are also used in agricultural, utility and environmental applications and as railroad ballast. The aggregates, cement, ready mixed concrete, asphalt and paving operations are reported collectively as the “Building Materials business”. The Company also operates a Magnesia Specialties business with production facilities in Michigan and Ohio. The Magnesia Specialties business produces magnesia-based chemical products that are used in industrial, agricultural and environmental applications. It also produces dolomitic lime sold primarily to customers for steel production and soil stabilization. Magnesia Specialties’ products are shipped to customers domestically and worldwide.\n \n\n\nThe Company was formed in 1993 as a North Carolina corporation to serve as successor to the operations of the materials group of the organization that is now Lockheed Martin Corporation. An initial public offering of a portion of the Company’s common stock was completed in 1994, followed by a tax-free exchange transaction in 1996 that resulted in 100% of the Company’s common stock being publicly traded. The Company completed over 100 acquisitions, as well as a number of strategic dispositions, from the time of its initial public offering until the present, which allowed the Company to enhance and expand its aggregates-led presence in the building materials marketplace.\n\n\nOn January 12, 2024, the Company acquired Albert Frei & Sons, Inc., a leading aggregates producer in Colorado. This acquisition provides more than 60 years (at current production levels) of high-quality, hard rock reserves to better serve new and existing customers and enhances the Company's aggregates platform in the Denver metropolitan area.\n\n\nOn February 9, 2024, the Company completed the sale of its South Texas cement business and certain of its related ready mixed concrete operations to CRH Americas Materials, Inc., a subsidiary of CRH plc, for $2.1 billion in cash. Specifically, the divested facilities included the Hunter cement plant in New Braunfels, Texas, related cement distribution terminals and 20 ready mixed concrete plants that served the Austin and San Antonio region. This divestiture optimized the Company's portfolio and product mix and provided proceeds the Company used to consummate the Blue Water Industries LLC acquisition discussed below. The transaction resulted in a pretax gain of $1.3 billion.\n\n\nOn April 5, 2024, the Company completed the acquisition of 20 active aggregates operations in Alabama, South Carolina, South Florida, Tennessee and Virginia from affiliates of Blue Water Industries LLC (BWI Southeast) for $2.05 billion in cash. The BWI Southeast acquisition complements Martin Marietta’s existing geographic footprint in the southeast region by expanding into new growth platforms in target markets, including Tennessee and South Florida.\n\n\nDuring October 2024, the Company acquired pure aggregates assets in South Florida and Southern California. In December 2024, the Company completed an aggregates-led, bolt-on acquisition in West Texas.\n\n\nBusiness Segment Information\n\n\nThe Company conducts its Building Materials business through two reportable segments, organized by geography: East Group and West Group. The East Group provides aggregates and asphalt products. The West Group provides aggregates, cement, downstream products and paving services. The Company’s Magnesia Specialties business is reported as a separate segment and includes its magnesia-based chemicals and dolomitic lime businesses. For more information on the organization and geographic area of the Company’s business segments, see \nNote A: Accounting Policies\n and \nNote O: Segments\n of the \nNotes to Financial Statements\n of the Company’s consolidated financial statements, which appear in\n \nItem 8, Financial Statements and Supplementary Data\n of this Annual Report on Form 10-K (this Form 10-K), which information is incorporated by reference.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n1\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nBuilding Materials Business\n\n\nThe profitability of the Building Materials business, which serves customers in the construction marketplace, is sensitive to national, regional and local economic conditions and construction cyclicality, which are in turn affected by fluctuations in levels of public-sector infrastructure funding; interest rates; access to capital markets; and demographic, geographic, employment and population dynamics. The heavy-side construction business is conducted outdoors, as are much of the Building Materials business’ operations. Therefore, erratic weather patterns, seasonal changes and other weather-related conditions, including precipitation, flooding, hurricanes, snowstorms, extreme temperatures, wildfires, earthquakes and droughts, can significantly affect production schedules, shipments, costs, efficiencies and profitability. Generally, the financial results for the first and fourth quarters are subject to the impacts of winter weather, while the second and third quarters are subject to the impacts of heavy precipitation.\n \n\n\nThe Building Materials business markets its products primarily to the construction industry, with 37% of its 2024 aggregates shipments sold to customers in connection with highway and other public infrastructure projects and the balance of its shipments sold primarily to customers for nonresidential and residential construction projects. The Company believes the business’ mix of public sector-related shipments lessens the impacts of fluctuations in nonresidential and residential, or private-sector, construction spending.\n \n\n\nFunding of public infrastructure, historically the Company’s largest end-use market, is discussed in greater detail under \nBuilding Materials Business’ Key Considerations—Public Infrastructure\n in \nItem 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations\n of this Form 10-K.\n \n\n\nThe Building Materials business covers a wide geographic area. The ten largest revenue-generating states (Texas, North Carolina, Colorado, California, Georgia, Florida, Minnesota, Arizona, South Carolina and Iowa) accounted for 81% of the Building Materials business’ revenues in 2024. The Building Materials business is accordingly affected by the economies in these regions and has been adversely affected in part by episodic recessions and weaknesses in these economies and may be affected by future declines in economic conditions, such as recessions, economic downturns or inflationary conditions.\n \n\n\nAggregates\n\n\nAggregates, consisting of crushed stone, sand and gravel, are an engineered, granular material that is manufactured to specific sizes, grades and chemistry for use primarily in construction applications. The Company’s operations consist primarily of open pit quarries; however, the Company is the largest operator of underground aggregates mines in the United States, with 14 active underground mines located in the East Group.\n\n\nNatural aggregates sources can be found in relatively homogeneous deposits in certain areas of the United States. Proximity of quarry facilities to customers’ plants, construction sites or long-haul transportation corridors is an important factor in competition for the sale of aggregates products. Generally, the distance shipments travel by truck from a given quarry is limited because the cost of transporting processed aggregates to customers is high in relation to the price of the product itself. The Company’s distribution system mainly uses trucks, but also has access to rail and waterborne networks where the per-mile unit costs of transporting aggregates are lower.\n \n\n\nThe Company’s distribution network moves aggregates materials from certain domestic and offshore sources via its long-haul rail and waterborne distribution network to markets where aggregates supply is limited. The Company’s rail network primarily serves its Texas, Southeast and Gulf Coast markets, while the Company’s locations in The Bahamas and Nova Scotia transport materials via oceangoing ships. The Company’s strategic focus includes expanding inland and offshore capacity and acquiring distribution facilities and port locations to offload and sell transported material. As of December 31, 2024, the Company’s aggregates distribution facilities consisted of 78 distribution yards. The Company’s rail-based distribution network, coupled with the extensive use of rail service, increases the Company’s dependence on and exposure to railroad performance, including track congestion, crew availability, railcar availability, locomotive availability and the ability to negotiate favorable railroad shipping contracts. The waterborne distribution network also increases the Company’s exposure to certain risks, including, among other items, meeting minimum tonnage requirements of shipping contracts, demurrage costs, fuel costs, ship availability and weather disruptions. The Company has agreements with shipping companies to provide vessels to transport its aggregates to various coastal ports.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n2\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nThe Company generally acquires contiguous property around existing quarry locations. Such parcels can serve as buffer property or additional mineral reserves, assuming the underlying geology supports economical aggregates mining. In either instance, the acquisition of additional property around an existing quarry typically allows the expansion of the quarry footprint and extension of quarry life. Some locations having limited reserves may be unable to expand.\n \n\n\nDue to the nature of the indigenous aggregates supply in the midwestern United States, a long-term capital focus for the Company is underground limestone aggregates mines. Production costs are generally higher at underground mines than surface quarries because the depth of the aggregates deposits and the access to the reserves result in higher costs related to development, explosives and depreciation costs. However, these locations often possess marketplace transportation advantages that can lead to higher average selling prices than more distant surface quarries.\n\n\nThe construction aggregates industry has been consolidating, and the Company has actively participated in the industry’s consolidation. The Company’s Board of Directors and management continue to review and monitor the Company’s long-term strategic plans, commonly referred to as SOAR (\nS\ntrategic \nO\nperating \nA\nnalysis and \nR\neview), which include assessing portfolio optimization strategies such as business combinations and arrangements with other companies engaged in similar businesses, investing in internal expansion projects in high-growth markets, divesting businesses or nonoperating assets that are not core or do not further management’s strategy and pursuing new opportunities in the Company’s existing markets or new markets. Acquisition opportunities include public companies, public company carve-outs and private sponsor-owned and family-owned businesses, as well as asset swaps and divestitures from companies executing their strategic plans, rationalizing non-core assets and repairing financially-constrained balance sheets. When acquired, new locations sometimes do not satisfy the Company’s internal safety, maintenance, pit development or other standards, and may require additional investments before benefits of the acquisitions are fully realized.\n \n\n\nManagement believes its aggregates reserves are sufficient to permit production at present operational levels for the foreseeable future. The Company does not anticipate any significant difficulty in accessing reserves used for production. The Company’s aggregates reserves average more than 85 years, based on the 2024 annual production level. However, certain locations may be subject to limited reserves and may not be able to expand. Moreover, environmental, zoning and land use regulations will likely make it more difficult for the Company to expand its existing quarries or develop new quarry operations. Although it cannot be predicted what policies will be adopted in the future by federal, state and local governmental bodies regarding these matters, the Company anticipates that future restrictions will likely make zoning and permitting more difficult, thereby potentially enhancing the value of the Company’s existing mineral reserves.\n\n\nThe Company generally sells its aggregates upon receipt of customer orders or requests. The Company generally maintains inventories of aggregates products in sufficient quantities to meet customer requirements.\n \n\n\nCement and Downstream Operations\n\n\nCement is the basic agent used to bind aggregates, sand and water in the production of ready mixed concrete. Similar to aggregates, cement is used in infrastructure projects, nonresidential and residential construction, and the railroad, agricultural, utility and environmental industries. Consequently, the cement industry is cyclical and dependent on the strength of the construction sector. As of December 31, 2024, the Company has one production facility in Midlothian, Texas, south of Dallas/Fort Worth, which produces Portland and specialty cements. Clinker is the intermediate product in cement production, and the Texas production facility has an annual clinker capacity of 2.4 million tons. The Company completed a finishing capacity expansion project at the Midlothian plant in August 2024, which will provide 0.45 million tons of incremental annual cement production capacity. Further, the Company has converted its Midlothian plant to manufacture a less carbon-intensive Portland limestone cement, known as Type 1L, which has been approved by the Texas Department of Transportation and allows the production of more cement with less clinker.\n \n\n\nCalcium carbonate in the form of limestone is the principal raw material used in the production of cement. Management believes that its reserves of limestone are sufficient to permit production at its cement plant at the current operational levels for the foreseeable future.\n \n\n\nCement consumption is dependent on the time of year and prevalent weather conditions. According to the Portland Cement Association, nearly two-thirds of U.S. cement consumption occurs in the six months between May and October. Approximately 70% to 75% of all cement shipments are sent to ready mixed concrete operators. The remainder is shipped to manufacturers of concrete-related products, contractors, materials dealers and oil well/mining/drilling companies. The Company's cement operation generally delivers its products upon receipt of customer orders or requests. Inventory for products is generally maintained in sufficient quantities to meet customers' rapid delivery requirements.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n3\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nReady mixed concrete is measured in cubic yards and specifically batched or produced for customers’ construction projects and then typically transported by mixer trucks and poured at the project site. The aggregate used for ready mixed concrete is a washed material with limited amounts of fines (such as dirt and clay). As of December 31, 2024, the Company operated 72 ready mixed concrete plants in Arizona and Texas. Asphalt is most commonly used in surfacing roads and parking lots and consists of liquid asphalt, or bitumen (the binding medium), and aggregates. Similar to ready mixed concrete, each asphalt batch is produced to customer specifications. As of December 31, 2024, the Company operated 38 asphalt plants in Arizona, California, Colorado and Minnesota. The Company also offers paving services in California and Colorado. Market dynamics for these downstream product lines include a highly competitive environment and lower barriers to entry compared with aggregates and cement.\n \n\n\nThe cement and downstream operations results are affected by volatile factors, including energy-related costs, operating efficiencies and weather, to a greater extent than the Company’s aggregates operations. Liquid asphalt and cement serve as key raw materials in the production of hot mix asphalt and ready mixed concrete, respectively. Therefore, fluctuations in prices for these raw materials directly affect the Company’s operating results.\n \n\n\nMagnesia Specialties Business\n\n\nThe Magnesia Specialties business produces and sells dolomitic lime from its Woodville, Ohio facility and manufactures magnesia-based chemical products for industrial, agricultural and environmental applications at its Manistee, Michigan facility. These magnesia-based chemical products have varying uses, including flame retardants, wastewater treatment, pulp and paper production and other applications. In 2024, 59% of Magnesia Specialties’ revenues were attributable to chemical products, 40% to lime, and 1% to stone sold as construction materials.\n\n\nMagnesia Specialties generally delivers its products upon receipt of customer orders or requests. Inventory for products is generally maintained in sufficient quantities to meet customers' rapid delivery requirements. Dolomitic lime products sold to external customers are used primarily by the steel industry. Accordingly, a portion of the revenues and profitability of the Magnesia Specialties business is affected by the steel industry's production and inventory trends. These trends are guided by the rate of consumer consumption, the flow of offshore imports and other economic factors.\n \n\n\nThe principal raw materials used in the Magnesia Specialties business are dolomitic limestone and magnesium-rich brine.  Management believes that its reserves of dolomitic limestone and brine are sufficient to permit production at the current operational levels for the foreseeable future.\n\n\nIn the Magnesia Specialties business, a significant portion of costs is of a fixed or semi-fixed nature. The production process requires the use of natural gas, coal and petroleum coke. Therefore, fluctuations in their pricing directly affect operating results.\n \n\n\nGiven high fixed costs, low capacity utilization can negatively affect the segment’s results from operations. Management has shifted the strategic focus of the magnesia-based business to grow and diversify the specialty chemicals product portfolio to reliably produce at volume levels that support efficient operations. Accordingly, these products are less dependent on the steel industry than the dolomitic lime product line. Management expects future organic profit growth to result from increased pricing, commercialization of new products, entry into new or adjacent markets and optimization of overall product mix.\n \n\n\nThe Magnesia Specialties business is highly dependent on rail transportation, particularly for movement of dolomitic lime from Woodville to Manistee and direct customer shipments of dolomitic lime and magnesia chemicals products from both Woodville and Manistee. The segment can be affected by the specific transportation and other risks and uncertainties outlined under\n \nItem 1A, Risk Factors\n of this Form 10-K.\n \n\n\nPatents and Trademarks\n\n\nAs of January 31, 2025, the Company owns, has the right to use, or has pending applications for patents pending or granted by the United States and various countries and trademarks related to its business. The Company believes that its rights under its existing patents, patent applications and trademarks are of value to its operations, but no one patent or trademark or group of patents or trademarks is material to the conduct of the Company’s business as a whole.\n\n\nCustomers\n\n\nThe Company’s products are sold principally to commercial customers in private industry. Although large amounts of construction materials are used in public works projects, relatively insignificant sales are made directly to federal, state, county or municipal governments, or agencies thereof. No material part of the business as a whole, or of any segment of the Company,\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n4\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nis dependent upon a single customer or upon a few customers. The loss of any single customer would not have a material adverse effect on the Company.\n \n\n\nCompetition\n\n\nThe nature of the Company’s competition varies among its products due to the widely differing amounts of capital necessary to build and maintain production facilities. Crushed stone production from quarries or mines and sand and gravel production by dredging or otherwise are moderately capital intensive. Construction of cement production facilities is highly capital intensive and requires long lead times to complete engineering design, obtain regulatory permits, acquire equipment and construct a plant. Most domestic cement producers are subsidiaries of large multinational companies that operate in multiple international markets. Many of these producers maintain the capability to import cement from foreign production facilities. Producing ready mixed concrete involves relatively low capital investment to build a concrete batching plant and acquire delivery trucks. Accordingly, economics can lead to lower barriers to entry in some concrete markets. As a result, depending on the local market, the Company may face competition from small producers as well as large, vertically-integrated companies with facilities in many markets.\n \n\n\nThe Company operates in a highly fragmented industry, including large, public companies and a significant number of small privately-held companies. In 2024, other publicly traded companies among the ten-largest U.S. aggregates producers included the following:\n\n\n•\nArcosa, Inc.\n\n\n•\nCEMEX S.A.B. de C.V.\n\n\n•\nCRH plc \n\n\n•\nHeidelberg Materials AG\n\n\n•\nHolcim Ltd.\n\n\n•\nKnife River Corporation\n\n\n•\nSummit Materials, Inc.\n\n\n•\nVulcan Materials Company\n\n\nDue to the localized nature of the industry resulting from the high cost of transportation relative to the price of the product, the Building Materials business primarily operates in smaller distinct areas that can vary from one another. The Company believes that its ability to transport materials by rail and waterborne vessels has enhanced its ability to compete in the building materials industry.\n \n\n\nThe Magnesia Specialties business competes with various companies in different geographic and product areas principally on the basis of quality, price, technological advances and technical support for its products. While the revenues of the Magnesia Specialties business in 2024 were predominantly domestic, a portion was derived from customers located outside the United States.\n \n\n\nEnvironmental and Governmental Regulations\n \n\n\nOverview\n\n\nThe Company’s operations are subject to and affected by federal, state and local laws, rules and regulations relating to zoning, land use, mining, air emissions (including carbon dioxide and other greenhouse gases), water use, allocation and discharges, waste management, noise and dust exposure control, reclamation and other environmental, health and safety, and regulatory matters. Certain of the Company’s operations may occasionally involve the use of substances that are classified as toxic or hazardous within the meaning of these laws and regulations. Environmental operating permits are, or may be, required for certain of the Company’s operations, and such permits are subject to modification, renewal and revocation.\n\n\nEnvironmental Compliance and Costs\n\n\nThe Company regularly monitors and reviews its operations, procedures and policies for compliance with existing laws, rules and regulations, changes in interpretations of existing laws and enforcement policies, new laws that are adopted and new laws that the Company anticipates will be adopted that could affect its operations, including with respect to climate change. The Company has a full-time team of environmental engineers and managers that perform these responsibilities. The direct costs\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n5\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nof ongoing environmental compliance were approximately $58 million in 2024 and $45 million in 2023 and are related to the Company’s environmental staff, ongoing monitoring costs for various matters (including those matters disclosed in this Form 10-K) and asset retirement costs. Capitalized costs related to environmental control facilities were $32 million in 2024 and are expected to be approximately $35 million in both 2025 and 2026. The Company’s capital expenditures for environmental matters were not material to its results of operations or financial condition in 2024 and 2023. However, the Company’s expenditures for environmental matters generally have increased over time and are likely to increase in the future. Despite the Company’s compliance efforts, the risk of environmental liability is inherent in the Company’s businesses, and environmental liabilities could have a material adverse effect on the Company in the future. Complying with governmental and environmental regulations did not have and is not expected to have a material effect on the Company’s capital expenditures, earnings and competitive position, other than as discussed in this section.\n\n\nMany of the applicable requirements of environmental laws are satisfied by procedures that the Company adopts as best practices in the ordinary course of its business. For example, plant equipment that is used to crush aggregates products may, in the ordinary course of operations, have an attached water spray bar that is used to clean the stone. The water spray bar also serves as a dust control mechanism that complies with applicable environmental laws. Moreover, the Company does not separate the portion of the cost, depreciation and other financial information relating to the water spray bar that is attributable only to environmental purposes, because such an allocation would be arbitrary. The incremental portion of such operating costs that is attributable to environmental compliance rather than best operating practices is impractical to quantify. Accordingly, the Company records costs in that category when incurred as operating expenses.\n\n\nConsistent with other cement producers, the Company’s cement operation produces varying quantities of cement kiln dust (CKD). This production by-product consists of fine-grained, solid, highly alkaline material removed from cement kiln exhaust gas by air pollution control devices. Because much of the CKD is unreacted raw materials, it is generally permissible to recycle the CKD back into the production process, and large amounts often are treated in such manner. CKD that is not returned to the production process or sold as a separate product is disposed in landfills. CKD is currently exempted from federal hazardous waste regulations under Subtitle C of the Resource Conservation and Recovery Act.\n\n\nThe environmental accruals recorded by the Company are based on internal studies of the required remediation costs and estimates of potential costs that arise from time to time under federal, state and/or local environmental protection laws. Many of these laws and their attendant regulations are complex and are subject to challenges and new interpretations by regulators and the courts. In addition, new laws are also enacted from time to time. It is often difficult to accurately and fully quantify the costs to comply with new rules until it is determined to which type of operations they will apply and the manner in which they will be implemented is more accurately defined. This process typically takes years to finalize, and the rules often change significantly from the time they are proposed to the time they are final. The Company typically has several appropriate alternatives available to satisfy compliance requirements, which could range from nominal costs to some alternatives that may be satisfied in conjunction with equipment replacement or expansion that also benefit operating efficiencies or capacities and carry significantly higher costs.\n\n\nManagement believes that its current accrual for environmental costs is reasonable, although those amounts may increase or decrease depending on the impact of applicable rules as they are finalized or amended from time to time and changes in facts and circumstances. The Company believes that its operations and facilities, both owned or leased, are in substantial compliance with applicable laws and regulations and any potential noncompliance is not likely to have a material adverse effect on the Company’s operations or financial condition. See \nLegal Proceedings\n under Item 3 of this Form 10-K,\n \nNote N: Commitments and Contingencies\n of the \nNotes to Financial Statements\n of the Company’s consolidated financial statements included under \nItem 8, Financial Statements and Supplemental Data\n of this Form 10-K, and the \nEnvironmental Regulation and Litigation\n section included under\n \nItem 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations\n of this Form 10-K. However, future events, such as changes in or modified interpretations of existing laws and regulations or enforcement policies, or further investigation or evaluation of the potential health hazards of certain products or business activities, may give rise to additional compliance and other costs that could have a material adverse effect on the Company.\n \n\n\nMine Safety and Land Reclamation\n\n\nIn general, mining, production and distribution facilities for aggregates, cement, ready mixed concrete and asphalt must comply with air quality, water quality and other environmental regulations, zoning and special use permitting requirements, applicable mining regulations, and federal health and safety requirements. As the Company locates and acquires new production and distribution facilities, the Company works closely with local authorities during the zoning and permitting processes to design new quarries, mines, production and distribution facilities in such a way as to minimize disturbances. The Company frequently\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n6\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nacquires large tracts of land so that quarry, mine, production and distribution facilities can be situated at a substantial distance from surrounding property owners. Also, in certain markets, the Company’s ability to transport material by rail or water allows it to locate its facilities further away from residential areas. The Company has established policies designed to minimize disturbances to surrounding property owners from its operations.\n\n\nAs is the case with other similarly situated companies, some of the Company’s products contain varying amounts of crystalline silica, a common mineral also known as quartz. Excessive, prolonged inhalation of very small-sized particles of crystalline silica has been associated with lung diseases, including silicosis, and several scientific organizations and some states, such as California, have reported that crystalline silica can cause lung cancer. The Mine Safety and Health Administration (MSHA) and the Occupational Safety and Health Administration (OSHA) have established occupational thresholds for crystalline silica exposure as respirable dust. The Company monitors occupational exposures at its facilities and implements dust control procedures and/or makes available appropriate respiratory protective equipment to maintain the occupational exposures at or below the required levels. The Company, through safety information sheets and other means, also communicates appropriate warnings and cautions its employees and customers about the risks associated with excessive, prolonged inhalation of mineral dust in general and crystalline silica in particular.\n \n\n\nThe Company is generally required by state or local laws or pursuant to the terms of an applicable lease to reclaim quarry sites after use. Future reclamation costs are estimated using statutory reclamation requirements and management’s experience and knowledge in the industry, and are discounted to their present value using a credit-adjusted, risk-free interest rate. The future reclamation costs are not offset by potential recoveries. For additional information regarding compliance with legal requirements, see \nNote N: Commitments and Contingencies\n of the \nNotes to Financial Statements\n of the Company’s consolidated financial statements included in \nItem 8, Financial Statements and Supplemental Data\n \nof this Form 10-K. The Company performs activities on an ongoing basis, as an integral part of the normal quarrying process, that may reduce the ultimate reclamation obligations. For example, the perimeter and interior walls of an open pit quarry are sloped and benched as they are developed to prevent erosion and provide stabilization. This sloping and benching meets both safety regulations required by MSHA for ongoing operations as well as final reclamation requirements. Therefore, these types of activities are included in normal operating costs and are not a part of the asset retirement obligation. Reclaimed quarry sites owned by the Company are from time to time available for sale, typically for commercial development or use as water reservoirs, or have been converted for recreational use by the local community.\n\n\nSustainability Risks and Opportunities\n\n\nThe Board and management have identified certain risks related to a lower-carbon economy, risks related to the physical impacts of climate change and other climate-related opportunities.\n \n\n\nBoard Oversight and the Role of Management\n \nThe Board of Directors has an essential role in determining the Company's strategic priorities, and sustainability matters are an integral part of its governance and oversight of the business. In 1994, the Company established an Ethics, Environment, Safety and Health (EESH) Committee, which currently meets at least four times annually. The EESH Committee receives reports directly from management relating to environmental, safety, ethics and other sustainability matters, including greenhouse gas (GHG) emissions, reviews input and engagement with investors on these matters, and monitors the Company's compliance with environmental, health and safety laws and regulations, as well as its public reporting and disclosure with respect to sustainability risks and opportunities and other environmental issues. The EESH Committee reports to the full Board. A number of other Board committees have overlapping responsibility for sustainability matters, including the Audit Committee, which reviews the Company's significant environmental matters and assesses the potential risks and liabilities they may pose to its business, and the Management Development and Compensation Committee, which reviews management's performance with regard to its sustainability goals and considers those achievements in determining incentive pay. While the Board oversees Martin Marietta's risk management, the executive officers are responsible for the day-to-day risk management processes, and management receives at least quarterly updates from operating personnel directly responsible for compliance relating to EESH matters. Management believes this division of responsibilities is the most effective approach for addressing the risks facing the Company. The Company also has a Head of Sustainability, who reports directly to the General Counsel on environmental and other sustainability matters. The Company believes the above approach has been effective in integrating sustainability as a core element of its corporate governance.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n7\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nTransition Risks\n\n\nThe Company's sustainability risk management framework is designed to identify various transition risks, including policy and legal risks, technology risks, market risks and reputation risks, associated with a lower-carbon economy.\n\n\nPolicy and Legal Risks\n \nA number of governmental bodies, including U.S. regulatory agencies and various U.S. states, have proposed, enacted or are contemplating legislative and regulatory changes to mitigate or address the potential impacts of climate change, including provisions for GHG emissions reporting or reductions, the use of alternative fuels, carbon credits (such as a cap-and-trade system) and a carbon tax. For example, in the United States, the United States Environmental Protection Agency (USEPA) promulgated a rule mandating that companies considered to be large emitters of GHGs report those emissions. The manufacturing operations of the Company’s Magnesia Specialties business release carbon dioxide, methane and nitrous oxides during the production of lime, magnesium oxide and hydroxide products. The Company’s two magnesia-based chemicals facilities, as well as its cement plant in Texas, file annual reports of their GHG emissions in accordance with the USEPA reporting rule. The primary business and operations of the Company, however, including its aggregates, ready mixed concrete and asphalt and paving product lines, are not considered “major” sources of GHG emissions subject to the USEPA reporting rule. Most of the GHG emissions from aggregates plant operations are tailpipe emissions from mobile sources, such as heavy construction and earth-moving equipment.\n \n\n\nThe Company’s cement plant and its Magnesia Specialties plants are strictly regulated with respect to GHG emissions and hold Title V Permits, and each (other than the Manistee, Michigan facility) is also subject to the U.S. Clean Air Act's Prevention of Significant Deterioration (PSD) requirements, which require a permit program for certain new or modified sources of emissions. Although several large-scale projects for carbon capture are in the development phase, no technologies or methods of operation for reducing or capturing GHGs have yet been proven successful in large-scale applications, other than improvements in fuel efficiency. If future modifications to the Company's facilities require PSD review for other pollutants, GHG permitting requirements may be triggered and may require significant additional costs, which the Company expects would be passed on to customers. It is not currently possible to estimate the cost of any such future requirements. In addition, the USEPA and the U.S. Supreme Court have taken different positions with respect to the USEPA's authority to make rules in these and other areas which could create uncertainty regarding regulatory compliance on these matters in the future.\n\n\nVarious states where the Company has operations have enacted or are considering climate change initiatives that apply to the Company. In October 2023, California adopted its California Climate Accountability Package which includes annual reporting of Scope 1, Scope 2 and Scope 3 emissions on a phased-in implementation schedule, climate-related risk reporting for certain companies and heightened disclosure standards around net zero emissions claims, carbon-neutral claims or significant GHG emissions reduction claims and the purchase or use of voluntary carbon offsets used to achieve those claims. These and other state or federal climate-related or anti-climate, social and governance regulations may result in significantly higher compliance costs and risks.\n\n\nThe Company's cement operation, like those of other cement producers, requires combustion of significant amounts of fuel to generate high kiln temperatures and create carbon dioxide as a product of the calcination process, which is presently an unavoidable step in making clinker, the essential component for cement production. Accordingly, the Company continues to closely monitor GHG regulations and legislation and its potential impact on the Company's cement business, financial condition and product demand. The Company anticipates that any increased operating costs or taxes relating to GHG emission limitations at the Woodville lime plant or Midlothian cement plant would be passed on to customers. The magnesium oxide products produced at the Manistee operation, however, compete against other products that, due to the form and/or structure of the source material, require less energy in the calcination process, resulting in the generation of fewer GHGs per ton of production. The Manistee facility may be required to absorb additional costs, including for taxes or capital investments, in order to maintain competitive pricing in that market. In addition, the cement produced by the Company’s cement operation, like other U.S. producers, is subject to strict limits set by the U.S. Department of Transportation (USDOT) and other agencies, including those relating to “clinker substitution”, or the replacement of ground clinker in cement with alternate materials such as pozzolan, slag and fly ash, which has implications for the Company’s fuel use and efforts to reduce GHG emissions from its cement operations. For example, various industry associations are engaged in an effort requesting the USDOT and other agencies to further revise their standards allowing for greater rates of clinker substitution, similar to the rates currently permitted for European cement producers. If higher rates of substitution and blending are, in fact, permitted in the future, the result is likely to be both reduced clinker and power consumption in cement production, which would, in turn, reduce GHGs emitted in connection with each ton of cement produced in the United States. The Company has continued its rollout of Portland\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n8\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nLimestone Cement (PLC cement) with more than 90% of its Type I/II customers converted to the PLC product. PLC cement has reduced the GHG footprint of the Company's cement product line by greater than 10%.\n\n\nIn light of the various regulatory uncertainties, the Company cannot presently reasonably predict the costs of any future compliance requirements. Nonetheless, the Company does not believe it will have a material adverse effect on the financial condition or results of the operations of either the Magnesia Specialties business or Building Materials business.\n \n\n\nTechnology Risks \nConsideration of the impact of technology is integrated into the Company’s risk management process. The Company has adopted a corporate-wide sustainability risk management strategy, which has resulted in multiple initiatives to identify and implement or evaluate GHG reduction processes and technologies that also improve operational efficiencies, including: using alternative fuels such as biodiesel; reducing overall fuel use by converting from quarry trucks to conveyor systems; right-sizing quarry trucks to match the appropriately sized truck with the size of production to reduce the number of required trips; replacing older railcars with more efficient, high-capacity models that reduce the number of required trips; adding rail capacity in lieu of truck movements; and installing state-of-the-art emissions control equipment at the Company’s magnesia plant and tire processing systems for fuel at the Company’s cement plant. The Company’s Midlothian cement plant has been recognized by the USEPA as a high-performing, energy-efficient facility following investments in innovative air pollution control technologies and usage of alternative fuels. The road to Net Zero for the Company and others in its industry requires operational changes, investments in sustainable energy, and in some cases, technology that is not yet available. The Company continues to monitor various pilot projects being conducted relating to the development of carbon capture technology; however, no technologies or methods of operation for reducing or capturing GHGs from cement manufacture have yet been proven successful in a full production environment, other than improvements in fuel efficiency. While awaiting further development of carbon capture technology, the Company has invested heavily and continues to look for opportunities to invest in its sustainability practices.\n\n\nMarket Risks\n The nature of the Company’s competition varies among its products due to the differing amounts of capital necessary to build and maintain production facilities and can be influenced by sustainability risks and opportunities particularly with respect to the Company’s small-but-strategic heritage cement business. Most domestic cement producers are owned by large non-U.S. companies operating in multiple international markets that report their results (including sustainability and emissions-related metrics) on a world-wide consolidated basis. The Company is subject to U.S. environmental regulations and there are critical regulatory differences between the U.S. and the European Union and differing calculation methodologies for carbon intensity calculations, blending and fuel choice that result in meaningful differences in the makeup of corresponding end-products and reported emissions metrics. Those differences, in turn, make like-for-like comparisons of the emissions performance of non-U.S. companies with the performance of the Company's heritage cement business challenging. To the extent that investors or consumers decide to use world-wide comparisons of these metrics in making investment and purchase decisions, the Company could be at a competitive disadvantage. Geography is critically important when assessing market attractiveness and growth opportunities for the Company. Attractive geographies generally exhibit (a) population growth and/or high population density, both of which are drivers of heavy-side building materials consumption; (b) business and employment diversity, drivers of greater economic stability, and (c) a superior state financial position, a driver of public infrastructure investment. All of these factors can be and are influenced by weather patterns and physical risk and opportunities.\n \n\n\nReputation\n Disruptions to the Company’s operations and to its customers' transportation activities by weather-related risks could impact the Company’s reputation and result in additional costs to the Company. Any failure or perceived failure to achieve or accurately report on the Company's current or future sustainability commitments, including its GHG reduction and net zero ambition and targets, and any differences between its commitments and those of any companies to which the Company is compared, could harm the Company's reputation, adversely affect its ability to effectively compete (including as a result of disclosure of proprietary information regarding its plants or changes in its ability to raise capital), adversely affect its recruitment and retention efforts or expose the Company to potential legal liability. In addition, while the Company is committed to pursuing its sustainability objectives, there is no assurance that it will achieve any of its sustainability goals or commitments, that low- or non-carbon-based energy sources and technologies required to meet long-term emissions reductions in some of the sectors in which it operates will be available at scale in the United States on an economically feasible basis or that its suppliers can meet sustainability, emissions reductions and other standards that are required by current or future laws or established by its investors and other stakeholders. Failure to meet these commitments could result in reputational harm to the Company and changes regarding sustainability risk management and practices may result in higher regulatory and compliance risks and costs. Any violations of law (including environmental law) or improper conduct could damage the Company's reputation.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n9\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nPhysical Impacts \nIn addition to impacts from increased regulation, weather patterns may result in physical impacts that could have adverse effects on the Company’s operations or financial condition. Physical impacts may include disruptions in production and/or regional supply or product distribution networks due to major storm events and shifts in regional rainfall and temperature patterns and intensities, as well as flooding from sea level changes. In addition, production and shipment levels for the Building Materials business correlate with general construction activity, which occurs outdoors and, as a result, is affected by erratic weather patterns, seasonal changes and other unusual or unexpected weather-related conditions, which can significantly affect that business. In the Company's cement and downstream operations, the physical impacts of weather may result in disruptions to its operations or its customers’ transportation activities, including impacts on production capabilities and capacities, supply chain interruptions and project delays that can impact the Company's reputation and result in additional costs to the Company. Excessive rainfall and other severe weather jeopardize production, shipments and profitability in all markets served by the Company in its Building Materials business. In addition, inclement weather can reduce the useful life of an asset. In particular, the Company’s operations near the Atlantic Ocean and Gulf Coast regions of the United States and The Bahamas are at risk for hurricane activity, most notably in August, September and October. The Company is also at risk for Pacific Ocean storm activity. The last several years brought an unprecedented amount of precipitation to the United States and particularly to Texas and the southeastern United States, notably the Carolinas, Florida and Georgia, where it impacted the Company’s facilities. In addition, the Company's California operations are at risk for wildfires and water use restrictions in the event of severe drought conditions. An insufficient supply of water for the Company's operations in those areas could impact production. While reconstruction activities may offset some or most of the financial impacts on sales and demand, any of these events could have a material adverse effect on the Company’s business and operations.\n\n\nAs the Company's footprint of quarries and aggregates facilities has grown nationwide, management believes it has bolstered resilience in its operations by maintaining a geographically diverse business and distribution network that is increasingly able to adjust to local disruptions and source materials from different facilities. In addition, because the Company transports aggregates products by various methods, including rail and water, it may be able to mitigate supply or transportation issues in any location caused by severe weather or disruptions in any transport modality.\n\n\nSustainability Opportunities \nNotwithstanding the foregoing risks and uncertainties relating to climate change, there may also be opportunities for the Company to increase its business or revenues through sustainability opportunities. For example, warm and/or moderate temperatures in March and November allow the construction season to start earlier and end later, respectively, which could have meaningfully positive impacts on the Company’s first- and fourth-quarter results, respectively. From a regulatory standpoint, the Infrastructure Investment and Jobs Act (IIJ Act), which was signed into law in November 2021, provides billions of dollars in new funding for roads, bridges and other major infrastructure projects which require aggregates and cement for construction. New public transit and clean energy projects that address climate change may also result in increased demand for the Company's products. Other opportunities are likely to result from the passing of the $1.2 trillion IIJ Act, the Cornyn-Padilla Amendment that allows $104 billion of unused COVID-19 dollars to be directed to infrastructure projects, and $41 billion of voter-approved state and local transportation-related 2024 ballot initiatives, all of which will fund infrastructure growth, repair and development. In addition, the Company’s magnesium hydroxide products are used to increase fuel efficiency in various industries, including both coal- and gas-fired electricity generation, which has a direct impact on reducing energy use and GHG emissions by more GHG-intense companies. Finally, the desire for sustainable building solutions has led to greater recognition of the benefits of concrete construction in the effort to move to a circular economy through innovative products, longevity and recyclability, and increased demand for green construction projects would have a direct impact on the Company’s cement and concrete business.\n\n\nLand Management\n\n\nThe Company owns approximately 170,000 acres of land, the vast majority of which is used in connection with active facilities. The Company regularly reviews its land holdings to determine their highest and best use based on its management expertise. Land holdings that do not have economically recoverable reserves for current or future mining or are otherwise not in locations that complement the Company’s operating facilities are considered candidates for sale or development for sale.\n \n\n\nHuman Capital Resources\n \n\n\nAs of January 31, 2025, the Company has approximately 9,400 employees, of which approximately 7,000 are hourly employees and approximately 2,400 are salaried employees. Approximately 1,200 hourly employees (13% of the Company’s employees) are represented by labor unions, representing 14% of the Building Materials business’ hourly employees and 100% of the Magnesia Specialties segment’s hourly employees. The Company’s principal union contracts for the Magnesia Specialties\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n10\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nbusiness cover employees at the Manistee, Michigan, magnesia-based chemicals plant and the Woodville, Ohio, lime plant. The Woodville and Manistee collective bargaining agreements expire in June 2026 and August 2027, respectively. The Company believes it has good relations with its employees, including its unionized workforce.\n\n\nManagement believes the Company’s success depends on its ability to attract, develop and retain key personnel. Martin Marietta offers a comprehensive benefits package that includes:\n\n\n•\nCompetitive compensation; \n\n\n•\n401(k) with Company match; \n\n\n•\nCompany-funded pension plan; \n\n\n•\nMedical (PPO and HDHP/HSA plan options); \n\n\n•\nDental and vision coverage; \n\n\n•\nPrescription drug coverage;\n\n\n•\nFlexible spending accounts; \n\n\n•\nPaid holidays and generous paid time off; \n\n\n•\nEducational/tuition assistance plan (described in more detail below); \n\n\n•\nEmployee discount program; \n\n\n•\nAdoption assistance program; \n\n\n•\nLife, AD&D and disability insurance; \n\n\n•\nEmployee assistance program; and \n\n\n•\nWellness programs. \n\n\nThe Company significantly enhanced company-provided benefits for its hourly employees in 2022 and 2023. The Company increased the benefit value for hourly employees in its currently fully funded pension plan by 76% in 2022. In conjunction with this increase, the Company embarked on a comprehensive education campaign to help employees better understand their retirement benefits and how that impacts their individual decisions to save for retirement. Additionally, in 2023, the Company added Company-paid, long-term disability insurance for its hourly employees and implemented a more robust paid time off (PTO) policy, which increased PTO benefits for the vast majority of employees.\n \n\n\nThe Company’s management oversees various employee initiatives to develop its employees and the Management Development and Compensation Committee regularly reviews the compensation and development programs to achieve those objectives. The Company offers many training and development opportunities, including the following:\n \n\n\n•\nOn-the-job training in the field and through the Company's Martin Marietta University, an interactive learning management system that serves as the gateway to a variety of valuable learning resources that support employee development; \n\n\n•\nA management associate program which provides entry-level opportunities for finance, human resources, engineering, geology or STEM graduates in the aggregates industry. This is a 12-to-18-month on-the-job training that allows recent college graduates to jump-start their career by gaining cross-functional experience and developing transferable skills at an accelerated pace. The program includes job rotations, training and executive mentorship. \n\n\n•\nAn Educational Assistance Program available for undergraduate and graduate degrees as well as individual vocational, undergraduate or graduate courses specifically related to an employee’s field; \n\n\n•\nA partnership with the University of North Carolina to provide a Leadership Program for senior managers and executives; \n\n\n•\nA partnership with North Carolina State University to provide a Leadership Program for managers; \n\n\n•\nAn internal job board, as well as communications, reminding employees about this resource; and \n\n\n•\nA robust performance review process. \n\n\nThe Company believes that a diverse employee base strengthens its talent pipeline and increases employee engagement and retention. The Company completed an associated awareness communications campaign helping managers and employees better understand how inclusion and engagement are ingrained in Martin Marietta’s culture and values. The campaign supports the Company's employer brand — \nONE\n, which brings together its employees’ unique perspectives, experiences and talents to\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n11\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦\n  Item 1 – Business\n\n\nevolve a shared vision and future. The Company offers three employee resource groups — Military and Veterans Community, Multicultural Employee Resource Group (MERGE) and Women Who Build — that provide opportunities for all employees to share their varied perspectives and experiences, grow their internal networks, develop their careers and give back to their communities. The Company also has expanded its academic outreach by partnering with Shaw University, a historically black university in Raleigh, North Carolina.\n \n\n\nWorkplace health and safety is one of the Company’s core values. The Guardian Angel safety program provides that every employee has the right, and the obligation, to stop any unsafe condition and that zero safety incidents is achievable. It includes the notion that every employee acts as a wingman for other employees, to observe and act on any situation that potentially creates unsafe circumstances. The Company-wide safety performance achieved the eighth consecutive year of world class or better lost-time incident rate and the fourth consecutive year for total injury incidence rate.\n\n\nAvailable Information\n\n\nThe Company maintains an internet address at \nwww.martinmarietta.com\n. The Company makes available free of charge through its internet website its Annual Report on Form 10‑K, Quarterly Reports on Form 10‑Q, Current Reports on Form 8‑K, and amendments to those reports, if any, filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (Exchange Act), which are available as soon as reasonably possible after they are submitted to the Securities and Exchange Commission (SEC). You can access the Company’s filings with the SEC through the SEC website at www.sec.gov or through the Company's website, and the Company strongly encourages you to do so. Martin Marietta routinely posts information that may be important to investors on its website at \nwww.ir.martinmarietta.com\n, and it uses this website address as a means of disclosing material information to the public in a broad, non-exclusionary manner for purposes of the SEC’s Regulation Fair Disclosure (Reg FD). The contents of the Company's website are not incorporated by reference in this Form 10-K and shall not be deemed “filed” under the Securities Exchange Act of 1934, as amended. The Company undertakes no obligation to update any statements herein for revisions or changes after the filing date of this Form 10-K other than as required by law.\n\n\nThe Company has adopted a \nCode of Ethical Business Conduct\n that applies to all of its Board of Directors, officers and employees. The Company’s code of ethics is available on the Company’s website\n \nwww.martinmarietta.com\n. The Company will disclose on its internet website any waivers of or amendments to its code of ethics as it applies to its directors and executive officers.\n\n\nThe Company has adopted a set of \nCorporate Governance Guidelines\n to address matters of fundamental importance relating to the corporate governance of the Company, including director qualifications and responsibilities, responsibilities of key board committees, director compensation and similar matters. Each of the Audit Committee, the Management Development and Compensation Committee, and the Nominating and Corporate Governance Committee of the Board of Directors has adopted a written charter addressing various matters of importance relating to each committee, including the committee’s purposes and responsibilities, an annual performance evaluation of each committee and similar matters. These \nCorporate Governance Guidelines\n, and the charters of each of these committees, are available on the Company’s website at \nwww.martinmarietta.com\n.\n\n\nThe Company’s Chief Executive Officer and Chief Financial Officer are required to file with the SEC each quarter and each year certifications regarding the quality of the Company’s public disclosure of its financial condition. The annual certifications are included as exhibits to this Form 10‑K. The Company’s Chief Executive Officer is also required to certify to the New York Stock Exchange each year that he is not aware of any violation by the Company of the New York Stock Exchange corporate governance listing standards.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n12\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart I  \n♦",
  "item7": "Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nITEM 7 – MANAGEMENT’S DISCUSSI\nON AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \n\n\nINTRODUCTORY OVERVIEW\n\n\n\n\nMartin Marietta Materials, Inc. (the Company or Martin Marietta) is a natural resource-based building materials company, with 2024 revenues of $6.5 billion and 2024 net earnings from continuing operations attributable to Martin Marietta of $2.0 billion, inclusive of a $976 million after-tax nonrecurring gain on the divestiture of the Company's South Texas cement plant and related ready mixed concrete operations (the Divestiture). These results were achieved in part by supplying aggregates (crushed stone, sand and gravel) through its network of approximately 390 quarries, mines and distribution yards in 28 states, Canada and The Bahamas. Martin Marietta also provides cement and downstream products, namely ready mixed concrete, asphalt and paving services, in certain markets where the Company has a leading aggregates position. Specifically, the Company has one cement plant and two cement distribution facilities in Texas, ready mixed concrete operations in Arizona and Texas, and asphalt operations in Arizona, California, Colorado and Minnesota. Paving services are offered in California and Colorado.\n \n\n\nThe Company’s heavy-side building materials are used in infrastructure, nonresidential and residential construction projects. Aggregates are also used in agricultural, utility and environmental applications and as railroad ballast. The aggregates, cement, ready mixed concrete and asphalt and paving product lines are reported collectively as the “Building Materials” business.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n34\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nAs more fully discussed in the \nStrategic Objectives\n section, geography is critically important for the Building Materials business. The Company conducts its Building Materials business through two reportable segments, organized by geography: East Group and West Group. The East Group, consisting of the East and Central divisions, provides aggregates and asphalt products. The West Group is comprised of the Southwest and West divisions and provides aggregates, cement, ready mixed concrete, asphalt and paving services.\n \n\n\n\n\nThe following ten states accounted for 81% of the Building Materials business 2024 revenues: Texas, North Carolina, Colorado, California, Georgia, Florida, Minnesota, Arizona, South Carolina and Iowa.\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n35\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nMagnesia Specialties\n\n\nThe Company operates a Magnesia Specialties business with production facilities in Michigan and Ohio. The Magnesia Specialties business produces magnesia-based chemicals products used in industrial, agricultural and environmental applications. It also produces dolomitic lime sold primarily to customers for steel production and soil stabilization. Magnesia Specialties’ products are shipped to customers domestically and worldwide.\n \n\n\nStrategic Objectives\n \n\n\nThe Company’s strategic planning process, or \nS\ntrategic \nO\nperating \nA\nnalysis and \nR\neview (SOAR), provides the framework for execution of Martin Marietta’s long-term strategic plan. Guided by this framework and considering the cyclicality of the Building Materials business, the Company determines capital allocation priorities to maximize long-term shareholder value creation. The Company’s strategy includes ongoing evaluation of aggregates-led opportunities of scale in new domestic markets (\ni.e.\n, platform acquisitions) and expansion through acquisitions that complement existing operations (\ni.e.\n, bolt-on acquisitions). The Company finances such opportunities with the goal of preserving its financial flexibility by having a leverage ratio (consolidated net debt to consolidated earnings before interest, taxes, depreciation, depletion and amortization, earnings/loss from nonconsolidated equity affiliates and certain other adjustments as specified in the \nResults of Operations \nsection, or Adjusted EBITDA) within a range of 2.0 times to 2.5 times within a reasonable period of time (typically within 18 months) following the completion of a debt-financed transaction. SOAR also includes the identification and potential disposition of assets that are not consistent with stated strategic goals. Notably, the Company completed nearly $6.0 billion worth of portfolio-optimizing transactions in 2024, divesting non-strategic cement and related ready mixed concrete businesses and redeploying the net proceeds into aggregates-led acquisitions in attractive markets (see Note B to the consolidated financial statements).\n\n\nThe Company, by purposeful design, will continue to be an aggregates-led business that focuses on markets with strong, underlying growth fundamentals where it can sustain or achieve a leading market position. Aggregates gross profit represented 76% of 2024 total reportable segment gross profit. For Martin Marietta, strategic cement and targeted downstream operations are located where the Company has, or envisions, among other things, a clear path toward a leading aggregates position. Additionally, strategic cement operations are geared toward markets in which supply cannot be meaningfully interdicted by waterborne product deliveries.\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n36\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nGenerally, the Company’s building materials are both sourced and sold locally. As a result, geography is critically important when assessing market attractiveness and growth opportunities. Attractive geographies generally exhibit (a) population growth and/or high population density, both of which are drivers of heavy-side building materials consumption; (b) business and employment diversity, drivers of greater economic stability; and (c) a superior state financial position, a driver of public infrastructure investment.\n\n\nPopulation growth and density are typically assessed based on a site’s proximity to one of the megaregions in the United States. Megaregions are large networks of metropolitan population centers covering thousands of square miles. According to \nAmerica 2050\n, a planning and policy program of the Regional Plan Association, most of the nation’s population and economic growth through 2050 will occur in 11 megaregions. The Company has a meaningful presence in ten megaregions. As evidence of the successful execution of SOAR, the Company’s leading positions in the Texas Triangle, Colorado’s Front Range, northern and southern California and Arizona’s Sun Corridor megaregions and its growth platform in the southern portion of the Northeast megaregion are the results of acquisitions since 2011. The Company's enhanced positions in the Piedmont Atlantic megaregion and Florida megaregion were expanded with the Blue Water Industries LLC (BWI Southeast) acquisition completed during 2024. The Company has a legacy presence in the southeastern portion of the Great Lakes megaregion, encompassing operations in Indiana and Ohio, as well as the Gulf Coast megaregion in Texas.\n\n\n \n\n\n\n\nThe Company focuses its geographic footprint along significant transportation and commerce corridors, particularly in key Sunbelt metropolitan statistical areas (MSAs) across the Southeast and Southwest. The retail sector (both e-commerce as well as brick and mortar) values transportation corridors, as logistics and distribution are critical considerations for construction supporting that industry. In addition, technology companies view these areas as attractive locations for data centers.\n\n\nThe Company considers a state’s financial health rating, as issued by S&P Global Ratings, in determining the opportunities and attractiveness of areas for both expansion and/or development. The Company’s top ten revenue-generating states have been evaluated and scored a financial health rating of AA- or higher, where AAA is the highest score. The Company also reviews the state’s ability to secure additional infrastructure funding and financing.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n37\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nIn line with the Company’s strategic objectives, management’s overall focus includes:\n \n\n\n•\nUpholding the Company’s commitment to its Mission, Vision and Values\n\n\n•\nBuilding and maintaining the world's safest, best-performing and most-durable aggregates-led public company\n\n\n•\nNavigating effectively through construction cycles to balance investment decisions against expected product demand\n\n\n•\nTracking shifts in population dynamics, as well as local, state and national economic conditions, to ensure changing trends are reflected in the execution of the strategic plan\n\n\n•\nIntegrating acquired businesses efficiently to maximize the return on the investment \n\n\n•\nAllocating capital in a prudent manner consistent with the following long-standing priorities while maintaining financial flexibility:\n\n\n─\nAcquisitions \n\n\n─\nOrganic capital investment\n\n\n─\nReturn of cash to shareholders through both meaningful and sustainable dividends as well as share repurchases\n \n\n\nSafety Performance\n \n\n\nThe Company’s safety culture and performance sets the foundation for its long-term strategic plan and its financial and operational strength. For 2024, the Company achieved a record company-wide Lost-Time Incident Rate (LTIR) of 0.129, the eighth consecutive year of world-class or better LTIR thresholds, and a company-wide Total Injury Incident Rate (TIIR) of 0.650, the fourth consecutive year of world-class or better TIIR thresholds.\n\n\n \n\n\n \n\n\nBUSINESS ENVIRONMENT\n \n\n\nBuilding Materials Business\n \n\n\nThe Building Materials business serves customers in the construction marketplace. The business’ profitability is sensitive to national, regional and local economic conditions and cyclical swings in construction spending, which are affected by fluctuations in levels of public-sector infrastructure funding; interest rates; access to capital markets; and demographic, geographic, employment and population dynamics.\n \n\n\nThe heavy-side construction business, inclusive of much of the Company’s operations, is conducted outdoors. Therefore, erratic weather patterns, precipitation and other weather-related conditions, including flooding, hurricanes, extreme hot and cold temperatures, earthquakes, droughts and wildfires, can significantly affect production schedules, shipments, costs, efficiencies and profitability. Generally, the financial results for the first and fourth quarters are influenced by the impacts of winter weather, while the second and third quarters can be subject to the impacts of heavy precipitation and excessive heat. The impacts of erratic weather patterns are more fully discussed in the \nBuilding Materials Business’ Key Considerations\n section.\n \n\n\nProduct Lines\n\n\nAggregates are an engineered, granular material consisting of crushed stone, sand and gravel, manufactured to specific sizes, grades and chemistry for use primarily in construction applications. The Company’s operations consist mostly of open pit quarries; however, the Company is also the largest operator of underground aggregates mines in the United States, with 14 active underground mines located in the East Group. The Company’s aggregates reserves average more than 85 years at the 2024 annual production level.\n \n\n\nCement is the basic agent used to bind coarse aggregates, sand and water in the production of ready mixed concrete. Calcium carbonate in the form of limestone is the principal raw material used in the production of cement. The Company has a cement production facility in Midlothian, Texas, south of Dallas/Fort Worth, and operates two related distribution terminals. This production facility produces Portland limestone and specialty cements, with an annual clinker (an intermediary product of cement production) capacity at December 31, 2024 of approximately 2.4 million tons. The facility operated at approximately 72% utilization for clinker production in 2024. The Company completed a finishing capacity expansion project at the Midlothian plant in August 2024, which will provide 0.45 million tons of incremental annual cement production capacity. Further, the Company has converted its Midlothian plant to manufacture a less carbon-intensive Portland limestone cement, known as Type 1L, which has been approved by the Texas Department of Transportation and allows the production of more cement with less clinker.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n38\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nReady mixed concrete is measured in cubic yards and specifically batched or produced for customers’ construction projects and then typically transported by mixer trucks and poured at the project site of a customer of the Company. The coarse aggregates used for ready mixed concrete are a washed material with limited amounts of fines (\ni.e.\n, dirt and clay). The Company operates ready mixed concrete plants in Arizona and Texas.\n \n\n\nAsphalt is typically used in surfacing roads and parking lots and consists of liquid asphalt, or bitumen (the binding medium), and aggregates. Similar to ready mixed concrete, each asphalt batch is produced to customer specifications. The Company’s asphalt operations are in Arizona, California, Colorado and Minnesota and related paving services are offered in California and Colorado.\n \n\n\nMarket dynamics for the downstream ready mixed concrete and asphalt product lines include a highly competitive environment and lower barriers to entry compared with the Company’s upstream product lines of aggregates and cement.\n \n\n\nEnd-Use Trends\n\n\nThe principal end-use markets of the Building Materials business are public infrastructure (\ni.e.\n, highways; streets; roads; bridges; and schools); nonresidential construction (\ni.e.\n, manufacturing and distribution facilities; data centers; industrial complexes; office buildings; large retailers and wholesalers; healthcare; hospitality; and energy-related activity); and residential construction (\ni.e.\n, subdivision development; and single- and multi-family housing). Aggregates are also used in agricultural, utility and environmental applications and as railroad ballast, collectively comprising the ChemRock/Rail market.\n \n\n\nPublic infrastructure projects can require several years to complete, while residential and nonresidential construction projects are usually completed within one year. Generally, customer purchase orders do not contain firm quantity commitments, regardless of end-use market.\n \n\n\nInfrastructure\n \n\n\nThe public infrastructure market accounted for 37% of the Company’s aggregates shipments in 2024. The Company’s shipments to this end-use market are in line with the most recent five-year average of 36% and the most recent ten-year average of 37%.\n\n\nPublic construction projects, once awarded, are typically seen through to completion. Thus, delays from weather or other factors can serve to extend the duration of the construction cycle. While construction spending in the public and private market sectors is affected by economic cycles, public infrastructure spending has been comparatively more stable due to the predictability of funding from federal, state and local governments. The Infrastructure Investments and Jobs Act (IIJ Act) was signed into law on November 15, 2021 and contains a five-year surface transportation reauthorization plus $110 billion in new funding for roads, bridges and other hard infrastructure projects.\n\n\nState and local initiatives that support infrastructure funding, including gas tax increases, new funding mechanisms and other ballot initiatives, are increasing in size and number as these governments recognize the need for their expanded role in public infrastructure investment. In November 2024, 77% of all infrastructure funding measures up for vote were approved. These approved infrastructure initiatives are estimated to generate $41 billion in one-time and recurring revenues, with initiatives in Texas, the Company’s largest revenue-generating state, accounting for $5 billion of this total.\n \n\n\nNonresidential\n\n\nThe nonresidential construction market accounted for 35% of the Company’s aggregates shipments in 2024. Large industrial projects of scale led by energy and domestic manufacturing continue to lead the segment, accounting for the majority of total nonresidential shipments. The Company expects enhanced federal investments will further support and accelerate growth trends in this end use, with a renewed focus on data centers for artificial intelligence infrastructure. While light nonresidential demand remained resilient through 2024, despite higher interest rates, high office vacancy rates and tighter commercial lending conditions, the Company expects 2025 demand in this segment to moderate, as it generally follows single-family residential development with a lag.\n\n\nResidential\n\n\nThe residential construction market accounted for 23% of the Company’s aggregates shipments in 2024. This end use typically moves in direct correlation with economic cycles. The Company’s exposure to residential construction is split between aggregates used in the construction of subdivisions (including streets, sidewalks, utilities and storm and sewage drainage), single-family homes and multi-family units. Construction of both subdivisions and single-family homes is nearly three times\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n39\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nmore aggregates intensive than construction of multi-family units. Therefore, the level of new subdivision starts, as well as new single-family housing permits, is a strong leading indicator of residential volumes. According to the United States Census Bureau, for the year ended December 31, 2024, seasonally-adjusted national single-family housing starts decreased 3% to approximately 1.1 million units compared with 2023 and seasonally-adjusted national single-family housing permits decreased 3% versus 2023. Housing demand far exceeds supply in the Company’s key markets; however, a housing recovery is not expected until mortgage rates decline and/or affordability headwinds recede.\n\n\nChemRock/Rail\n\n\nThe remaining 5% of the Company’s 2024 aggregates shipments was to the ChemRock/Rail market, which includes ballast and agricultural limestone. Ballast is an aggregates product used to stabilize railroad track beds. Agricultural lime, a high-calcium carbonate material, is used as a supplement in animal feed, a soil acidity neutralizer and agricultural growth enhancer. Additionally, ChemRock/Rail includes rip rap (used as a stabilizing material to control erosion caused by water runoff at embankments, ocean beaches, inlets, rivers and streams) and high-calcium limestone (used as filler in glass, plastic, paint, rubber, adhesives, grease and paper). Chemical-grade, high-calcium limestone is used as a desulfurization material in utility plants.\n \n\n\nPricing Trends\n \n\n\nMaterials pricing for construction projects is generally based on terms committing to the availability of specified products of a stated quantity at an agreed-upon price during a definitive period. Because infrastructure projects often span multiple years, announced price changes can have a lag time before taking effect while the Company sells products under existing price agreements. Pricing escalators included in multi-year infrastructure contracts serve to somewhat mitigate this effect. However, during periods of heightened or rapid increases in production costs, multi-year infrastructure contract pricing may provide only nominal pricing growth. Additionally, the Company may implement multiple price increases throughout the year, on a market-by-market basis, where appropriate. Pricing is determined locally and is affected by supply and demand characteristics of the local market. For further information on pricing, see the discussion in the \nFinancial Overview\n section.\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n40\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nCost Structure\n \n\n\nCosts of revenues for the Building Materials business are components of costs incurred at the quarries, mines, cement plants, ready mixed concrete plants, asphalt plants, paving operations and distribution yards and facilities. Cost of revenues also includes the cost of resale materials, freight expenses to transport materials from a producing quarry or cement plant to a distribution yard or facility (internal freight), third-party freight and delivery costs incurred by the Company and then billed to customers (external freight) and production overhead costs.\n \n\n\nGenerally, the significant components of cost of revenues for the aggregates product line are (1) labor and benefits; (2) depreciation, depletion and amortization; (3) repairs and maintenance; (4) internal freight; (5) external freight; (6) supplies; (7) energy; and (8) contract services. In 2024, these categories represented 89% of the aggregates product line's total cost of revenues.\n\n\n\n\nVariable costs are expenses that fluctuate with the level of production volume, while fixed costs are expenses that do not vary based on production or sales volume. Production is the key driver in determining the levels of variable costs, as it affects the number of hourly employees and related labor hours. Further, components of energy, supplies and repairs and maintenance costs also increase in connection with higher production volumes. Accordingly, the Company’s operating leverage can be meaningful.\n\n\nGenerally, when the Company invests capital in facilities and equipment, increased capacity and productivity reduce labor and repair costs serving to offset increased fixed depreciation costs. However, the increased productivity and related efficiencies may not be fully realized in a lower-demand environment, resulting in under-absorption of fixed costs.\n\n\nWage and benefit inflation as well as other increases in labor costs may be somewhat mitigated by enhanced productivity in an expanding economy. During economic downturns, the Company reviews its operations and, where practical, temporarily idles certain sites. The Company then serves these markets with other open and proximate facilities. In certain markets, management can create production “super crews” that work on a rotating basis at various locations. For example, within a market, a crew may work three days per week at one quarry and the other two workdays at another quarry. This has allowed the Company to responsibly manage headcount in periods of lower product demand.\n \n\n\nTypically, diesel fuel represents the single-largest component of energy costs for the Building Materials business. The average cost per gallon was $2.82 and $3.25 in 2024 and 2023, respectively. Changes in energy costs also affect the prices that the Company pays for related supplies, including explosives, conveyor belting and tires. Further, the Company’s contracts for shipping products on its rail and waterborne distribution network typically include provisions for escalations or reductions in the amounts paid by the Company if the price of fuel moves outside a stated range.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n41\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nCement production is a capital-intensive operation with high fixed costs requiring plants to operate continuously, except during maintenance shutdowns. Maintenance of kiln and finishing mills typically necessitates a temporary plant shut-down for repairs. The Company adjusts production levels in anticipation of these planned maintenance periods.\n \n\n\nThe production of ready mixed concrete and asphalt requires the use of cement and liquid asphalt raw materials, respectively. Therefore, fluctuations in availability and prices for these raw materials directly affect the Company’s operating results.\n \n\n\nBuilding Materials Business’ Key Considerations\n \n\n\nGrowth markets with limited supply of indigenous stone must be served via a long-haul distribution network\n\n\nThe U.S. Department of the Interior identified possible sources of indigenous rock and documented its limited supply in certain areas of the United States, including the coastal areas from Virginia to Texas. Further, certain interior United States markets may experience limited availability of locally sourced aggregates resulting from increasingly restrictive zoning, permitting and/or environmental laws and regulations. The Company’s long-haul distribution network is used to supplement or, in many cases, wholly supply, the local crushed stone needs of these areas and provides the Company with the flexibility to effectively serve customers primarily in the Southwest and Southeast coastal markets.\n \n\n\nThe long-haul distribution network can also diversify market risk for locations that engage in long-haul transportation of aggregates products. This is particularly true where a producing quarry both serves a local market and transports products via rail, water and/or truck to be sold in other markets. The risk of a downturn in one market may be somewhat mitigated by other distant markets served by the location.\n \n\n\nProduct shipments are moved by truck, rail and water through the Company’s long-haul distribution network. The Company’s rail network primarily serves its Texas, Southeast and Gulf Coast markets, while the Company’s Bahamas and Nova Scotia locations transport materials via oceangoing ships. The Company’s strategic focus includes expanding inland and offshore capacity and acquiring distribution yards and port locations to offload transported material. As of December 31, 2024, the Company's distribution network consisted of 78 aggregates yards and 2 cement terminals.\n\n\n\n\nThe Company’s rail shipments result in continued reliance on railroad operations, which are impacted by track congestion, crew and locomotive availability, the effects of adverse weather conditions and the ability to negotiate favorable railroad shipping contracts. Further, changes in the operating strategy of rail transportation providers can create operational inefficiencies and increased costs from the Company’s rail network.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n42\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nA portion of railcars and all ships in the Company’s long-haul distribution network are under short- and long-term leases, some with purchase options, and contracts of affreightment. The limited availability of water and rail transportation providers, coupled with limited distribution sites, can adversely affect lease rates for such services and ultimately the freight rates.\n \n\n\nThe Company has agreements providing dedicated shipping capacity from its Bahamas and Nova Scotia operations to its coastal ports that expire in 2026 and 2027, respectively. These contracts of affreightment are take-or-pay contracts with minimum and maximum shipping requirements. The minimum requirements were met in 2024. There can be no assurance that such contracts will be renewed upon expiration or that terms will continue without significant increases.\n \n\n\nPublic infrastructure, historically the Company’s largest end-use market, is funded through a combination of federal, state and local sources\n \n\n\nTransportation investments generally boost the economy by creating jobs and enhancing mobility and access, which are priorities of many of the government’s economic plans. Public-sector construction related to transportation infrastructure is funded through a combination of federal, state and local sources. The federal highway bill, currently the IIJ Act, provides annual funding for public-sector highway construction projects and includes spending authorizations, which represent the maximum financial obligation that will result from the immediate or future outlays of federal funds for highway and transit programs. The federal government’s surface transportation programs are funded mostly through the receipts of highway user taxes placed in the Highway Trust Fund, which is divided into the Highway Account and the Mass Transit Account. Revenues credited to the Highway Trust Fund are primarily derived from a federal gas tax, a federal tax on certain other motor fuels and interest on the accounts’ accumulated balances. Of the currently imposed federal gas tax of $0.184 per gallon, which has been static since 1993, $0.15 is allocated to the Highway Account of the Highway Trust Fund.\n \n\n\nSince most states are required to balance their budgets, reductions in revenues generally require a reduction in states’ expenditures. However, the impact of state revenue reductions on highway investment will vary depending on whether the monies come from dedicated revenue sources, such as highway user fees, or whether portions are paid for with general funds.\n \n\n\nIn addition to federal appropriations, each state typically funds its infrastructure investment from specifically allocated amounts collected from various user fees, typically gasoline taxes and vehicle fees. States have assumed a significantly larger role in funding infrastructure investment, including initiating special-purpose taxes and raising state gas taxes. Management believes that financing at the state and local levels, such as bond issuances, toll roads, vehicle miles traveled fees and tax initiatives, will continue to grow and have a fundamental role in advancing infrastructure projects. State infrastructure investment generally leads to increased growth opportunities for the Company. The level of state public-works spending is varied across the nation and dependent upon individual state economies; the degree to which the Company could be affected by a reduction or slowdown in infrastructure spending varies by state. The state economies of the Building Materials business’ ten largest revenue-generating states may disproportionately affect the Company’s financial performance.\n\n\nGovernmental appropriations and expenditures are typically less interest rate-sensitive than private-sector spending. Obligations of federal funds are a leading indicator of highway construction activity in the United States. Before a state or local department of transportation can solicit bids on an eligible construction project, it enters into an agreement with the Federal Highway Administration to obligate the federal government to pay its portion of the project cost. These Federal obligations are subject to annual funding appropriation reviews by Congress.\n\n\nIn addition to highways and bridges, transportation infrastructure includes aviation, mass transit, ports and waterways. Railroad construction continues to benefit from economic growth, which ultimately generates a need for additional maintenance and improvements.\n \n\n\nErratic weather can significantly impact operations\n\n\nProduction and shipment levels for the Building Materials business correlate with general construction activity, most of which occurs outdoors and, as a result, is affected by erratic weather, seasonal changes and other environmental conditions. Typically, due to a general slowdown in heavy construction activity during winter months, the first and fourth quarters experience lower production and shipment activity. As such, temperatures in the months of March and November can meaningfully affect the Company’s first- and fourth-quarter results, respectively, where warm and/or moderate temperatures in March and November allow the construction season to start earlier and end later, respectively. Additionally, extreme heat during summer months can impact construction activities, as outdoor work may be limited to protect the health and safety of construction workers.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n43\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nExcessive rainfall jeopardizes production efficiencies, shipments and profitability in all markets served by the Company. In particular, the Company’s operations near the Atlantic Ocean and Gulf Coast regions of the United States and The Bahamas are at risk for hurricane activity from June through November, but most notably in August, September and October. The Company’s California operations are at risk for flooding, wildfire activity and water use restrictions in severe drought conditions.\n \n\n\nCapital investment decisions are driven by capital intensity of the Building Materials business and focus on land\n\n\nThe Company’s organic capital program is designed to leverage construction market growth through investment in both permanent and portable facilities at the Company’s operations. Over an economic cycle, the Company typically invests organic capital at an annual level that approximates depreciation expense. At mid-cycle and through cyclical peaks, organic capital investment usually exceeds depreciation expense, as the Company supports current capacity needs and future growth. Conversely, at a cyclical trough, the Company may reduce levels of capital investment. Regardless of cycle, the Company sets a priority of investing capital to ensure safe, environmentally sound and efficient operations, as well as to provide the highest quality of customer service and establish a foundation for future growth.\n\n\nThe Company is diligent in its focus on land opportunities, including potential new sites (greensites) and existing site expansion. Land purchases are usually opportunistic and can include contiguous property around existing quarry locations. Such property can serve as buffer property or additional mineral reserves, assuming regulatory hurdles can be cleared and the underlying geology supports economical aggregates mining. In either instance, the acquisition of additional property around an existing quarry typically allows the expansion of the quarry footprint and an extension of quarry life.\n\n\nMagnesia Specialties Business\n\n\nThe Magnesia Specialties business manufactures magnesia-based chemicals products for industrial, agricultural and environmental applications at its Manistee, Michigan facility. The chemical products business focuses on higher-margin specialty chemicals that can be produced at volumes that support efficient operations. The Magnesia Specialties business also produces and sells dolomitic lime from its Woodville, Ohio facility. Dolomitic lime products sold to external customers are primarily used by the domestic steel industry, while the remaining lime shipments are used internally as a raw material for the manufacturing of chemical products.\n \n\n\n\n\nWith 44% of Magnesia Specialties’ 2024 revenues related to products used in the steel industry, a portion of the segment’s revenues and profits is affected by production and inventory trends within the steel industry, which are guided by the rate of consumer consumption, the flow of offshore imports and other economic factors. The dolomitic lime business runs most profitably at 70% or greater steel capacity utilization. Domestic steel production averaged 70% of capacity in 2024 and 74% in 2023.\n \n\n\nWhile revenues of the Magnesia Specialties business were predominantly derived from domestic customers in 2024, financial results can be affected by foreign currency exchange rates, increasing transportation costs or weak economic conditions in\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n44\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nforeign markets. To mitigate the short-term effect of currency exchange rates, foreign transactions are denominated in United States dollars.\n \n\n\nA significant portion of the Magnesia Specialties business’ costs is of a fixed or semi-fixed nature. The production process requires the use of natural gas, coal and petroleum coke; therefore, fluctuations in their pricing directly affect operating results. To help mitigate this risk, the Company has fixed-price agreements for 43% of its anticipated 2025 energy needs for coal, petroleum coke and natural gas. Given inherently high fixed costs, low capacity utilization can negatively affect the segment’s results of operations. Management expects future organic profit growth to result from increased pricing, commercialization of new products, entry into new markets and optimization of overall product mix.\n \n\n\nIn 2024, direct production costs represented 81% of the Magnesia Specialties business' total cost of revenues:\n\n\n\n\nThe Magnesia Specialties business is highly dependent on rail transportation, particularly for movement of dolomitic lime from Woodville to Manistee and direct customer shipments of dolomitic lime and magnesia chemicals products from both Woodville and Manistee. The segment can be affected by the risks mentioned in the long-haul distribution discussion in the \nBuilding Materials Business’ Key Considerations\n section.\n\n\nEnvironmental Regulation and Litigation\n \n\n\nThe expansion and growth of the aggregates industry is subject to increasing challenges from environmental and political advocates aiming to control the pace and direction of future development. Certain environmental groups have published lists of targeted municipal areas, including areas within the Company’s marketplace, for environmental and suburban growth control. The effect of these initiatives on the Company’s growth is typically localized. Further challenges are expected as the momentum of these initiatives ebb and flow. Rail and other transportation alternatives are being heralded by these special-interest groups as solutions to mitigate road traffic congestion and overcrowding.\n \n\n\nThe Company’s operations are subject to and affected by federal, state and local laws, rules and regulations relating to the environment, health and safety and other regulatory matters. Certain of the Company’s operations may occasionally use substances classified as toxic or hazardous. The Company regularly monitors and reviews its operations, procedures and policies for compliance with these laws and regulations. Despite these compliance efforts, risk of environmental liability is inherent in the operation of the Company’s businesses, as it is with other entities engaged in similar businesses.\n \n\n\nEnvironmental operating permits are, or may be, required for certain of the Company’s operations; such permits are subject to modification, renewal and revocation. New permits are generally required for opening new sites or for expansion at existing operations and can take several years to obtain. Moreover, land use, rezoning and special or conditional use permits are increasingly difficult to obtain. Once a permit is issued, the location is required to generally operate in accordance with the approved site plan.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm 10-K  \n♦\n \nPage \n45\n\n\n \n\n\n\n\n\n\n \n\n\n\n\nPart II  \n♦\n  Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\n\n\nThe Clean Air Act, originally passed in 1963 and periodically updated by amendments, is the United States’ national air pollution control program that granted the United States Environmental Protection Agency (USEPA) authority to set limits on the level of various air pollutants. To meet National Ambient Air Quality Standards, a defined geographic area must be below established limits for six pollutants. Environmental groups have been successful in proceedings against the federal and certain state departments of transportation, delaying highway construction in municipal areas not in compliance with the Clean Air Act. The USEPA designates geographic areas as nonattainment areas when the level of air pollutants exceeds the national standard. Nonattainment areas receive deadlines to reduce air pollutants by instituting various control strategies or otherwise face fines or control by the USEPA. Included as nonattainment areas are several major metropolitan areas in the Company’s markets, such as Houston/Brazoria/Galveston, Texas; Dallas/Fort Worth, Texas; Bexar County in San Antonio/New Braunfels, Texas; Denver, Colorado; Boulder, Colorado; Fort Collins/Greeley/Loveland, Colorado; Baltimore, Maryland; Los Angeles-San Bernardino Counties, California; Los Angeles – South Coast Basin, California; Phoenix/Mesa, Arizona; San Diego County, California; San Francisco Bay Area, California; San Joaquin Valley, California; and Sacramento County, California. Federal transportation funding has been directly tied to compliance with the Clean Air Act.\n \n\n\nLarge emitters (facilities that emit 25,000 metric tons or more per year) of greenhouse gases (GHG) must report GHG generation to comply with the USEPA’s Mandatory Greenhouse Gases Reporting Rule (GHG Rule). In 2024, the Company filed annual reports in accordance with the GHG Rule relating to operations at its cement plant in Texas, as well as its Magnesia Specialties facilities in Woodville, Ohio, and Manistee, Michigan, each of which emit certain GHG, including carbon dioxide, methane and nitrous oxide. If Congress passes additional legislation limiting GHG emissions, these operations will likely be subject to such legislation. The Company believes that any increased operating costs or taxes related to GHG emission limitations at its cement or Woodville operations would be passed on to its customers. The Manistee facility may have to absorb extra costs due to the regulation of GHG emissions to maintain competitive pricing in its markets. The Company cannot reasonably predict the amount of those potential increased costs.\n\n\nThe Company is engaged in certain legal and administrative proceedings incidental to its normal business activities. In  management's and counsel's opinion, based upon currently available facts, the likelihood is remote that the ultimate outcome of any litigation or other proceedings, including those pertaining to environmental matters, relating to the Company and its subsidiaries, will have a material adverse effect on the overall results of the Company’s operations, cash flows or financial position.\n\n\nFINANCIAL OVERVIEW\n \n\n\nResults of Operations\n \n\n\nThe following discussion and analysis reflect management’s assessment of the financial condition and results of operations (MD&A) of the Company for continuing operations and should be read in conjunction with the audited consolidated financial statements (",
  "item2": null
}