{
  "source_file": "mmc-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business.\nReferences in this report to \"we\", \"us\" and \"our\" are to Marsh & McLennan Companies, Inc. and its consolidated subsidiaries (the \"Company\" or \"Marsh McLennan\"), unless the context otherwise requires.\nGENERAL\nMarsh McLennan is the world's leading professional services firm in the areas of risk, strategy and people. We help clients build the confidence to thrive through the power of perspective of our four market-leading businesses. With annual revenue of over $24 billion, we have more than 90,000 colleagues advising clients in over 130 countries.\nMarsh\n \nprovides data-driven risk advisory services and insurance solutions to commercial and consumer clients. Guy Carpenter\n \ndevelops\n \nadvanced risk, reinsurance and capital strategies that help clients grow profitably and pursue emerging opportunities. Mercer\n \ndelivers advice and technology-driven solutions that help organizations redefine the world of work, reshape retirement and investment outcomes, and unlock health and well-being for a changing workforce. Oliver Wyman Group\n \nserves as a critical strategic, economic and brand advisor to private sector and governmental clients. Our four businesses also collaborate together to deliver new solutions to help clients manage complex and interconnected risks.\nThe Company conducts business through two segments:\n•\nRisk and Insurance Services\n includes risk management activities (risk advice, risk transfer and risk control and mitigation solutions) as well as insurance and reinsurance broking and services. The Company conducts business in this segment through Marsh and Guy Carpenter.\n•\nConsulting\n includes health, wealth and career advice, solutions and products, and specialized management, strategic, economic and brand consulting services. The Company conducts business in this segment through Mercer and Oliver Wyman Group.\nWe describe our current segments in further detail below. We provide financial information about our segments in our consolidated financial statements included under Part II, Item 8 of this report.\nOUR BUSINESSES\nRISK AND INSURANCE SERVICES\nThe Risk and Insurance Services segment generated approximately \n63%\n of the Company's total revenue in 2024 and employs approxi\nmately 52,400 co\nlleagues worldwide. The Company conducts business in this segment through Marsh and Guy Carpenter.\nMARSH\nMarsh is the world's leading insurance broker and risk advisor, serving companies, institutions and individuals. From its founding in 1871 to the present day, Marsh has demonstrated a commitment to thought leadership, innovation and insurance expertise to meet its clients’ needs. Marsh’s pioneering contributions include introducing the practice of client representation through brokerage, the discipline of risk management, the globalization of risk management services and the development of service platforms that identify, quantify, mitigate and transfer risk.\nCurrently, approxima\ntely 48,800 Marsh\n colleagues provide risk management, insurance broking, insurance program management, risk consulting, analytical modeling and alternative risk financing services to a wide range of businesses, government entities, professional service organizations and individuals in over 130 countries. Marsh generated approximately \n53%\n of the Company's total revenue in 2024\n.\nInsurance Broking and Risk Advisory\nIn its core insurance broking and risk advisory business, Marsh employs a team approach to identify, quantify and address clients' risk management and insurance needs. Marsh’s product and service offerings include risk analysis, insurance program design and placement, insurance program support and administration, claims support and advocacy, alternative risk strategies and a wide array of risk analysis and risk management consulting services. Clients benefit from Marsh’s advanced analytics, deep technical expertise, specialty and industry knowledge, collaborative global culture and the ability to develop innovative solutions and products. \n1\nThe firm’s resources also include nearly three dozen specialty and industry practices, including cyber, construction, renewable energy, healthcare, and financial and professional service practices.\nMarsh provides services to clients of all sizes, including large multinational companies (\"Risk Management\"), high growth middle-market businesses (\"Corporate\"), small commercial enterprises and high net-worth private clients, and affinity group members (\"Commercial & Consumer\"). Marsh's segments are designed to build stronger value propositions and operating models to optimize solutions and services for clients depending on their needs.\nRisk Management.\n \nMarsh has an extensive global footprint and market-leading advisory and placement services that benefit large domestic and international companies and institutions facing complex risk exposures. These clients are also supported by Marsh’s robust analytics and a growing digital experience.\nIn addition, Marsh’s largest global clients are serviced by Marsh Multinational, a dedicated team of colleagues from around the world focused on delivering service excellence and insurance solutions to clients wherever they are located. Marsh is digitizing the client experience through tools such as LINQ, Marsh’s account and service application; Blue[i], a suite of analytics tools for clients; and Bluestream, a digital brokerage platform that enables clients to provide insurance to their customers or suppliers in a B2B2C distribution model. Marsh provides global expertise and an intimate knowledge of local markets, helping clients navigate local regulatory environments to address the worldwide risk issues that confront them.\n•\nMarsh Specialty\n is an integrated and globally coordinated team of experts who provides clients in highly specialized industry and product areas with data driven insights, service, advice and access to global insurance markets. These specialists support clients who require advice and support across aviation & space, credit specialties, construction, energy & power, financial & professional services (FINPRO), marine & cargo, and private equity, mergers & acquisitions (PEMA).\nCorporate. \nMiddle market clients are served by Marsh’s brokerage operations globally; this segment is also serviced by Marsh & McLennan Agency (MMA) in the United States (U.S.).\n•\nMarsh McLennan Agency (MMA)\n provides business insurance, employee health and benefits, retirement and wealth management, and private client insurance solutions to individuals and mid-market organizations. MMA advises on insurance program structure and market dynamics, along with industry expertise and transactional capability. Since its first acquisition in 2009, MMA has acquired more than 125 agencies.\nCommercial & Consumer. \nClients in this market segment typically face less complex risks and are served by Marsh’s innovative product and placement offerings and growing capabilities in digitally enabled distribution and administration.\n•\nVictor Insurance Managers (Victor\n)\n is one of the largest underwriting managers of professional liability, catastrophe, and other specialty insurance programs worldwide. In the U.S., Victor Insurance Managers (US) and ICAT Managers underwrite, solicit, sell and service coverages through a national third-party distribution network of licensed brokers and agents. Through its Victor Small Business platform, Victor deploys cloud-based technology to enable independent insurance agents, on behalf of their small business clients, to obtain online quotes from multiple insurance providers and bind property and casualty and workers compensation insurance policies in real time. Victor also manages Torrent Technologies, the nation’s largest service provider to the National Flood Insurance Program (NFIP). Victor Insurance Managers (Canada), a leading managing general agent in Canada, delivers professional liability and construction insurance and other property and casualty programs and administers group and retiree benefits programs and claims handling operations for individuals, organizations and businesses. Victor also has a business in the U.K., the Netherlands, Italy, Germany and Australia. \n•\nMarsh Affinity\n focuses on insurance programs sold to insureds or vendors through a corporate sponsor using an affinity distribution model.\n•\nHigh Net Worth (HNW).\n \nIndividual high net worth clients and family offices are serviced by MMA in the U.S. and other Marsh personal lines businesses globally. These businesses provide a single-source solution for high net worth clients and are dedicated to sourcing protections across a broad spectrum of risk. Using a consultative approach, Marsh's HNW practices analyze exposures and customize programs to cover individual clients with complex asset portfolios.\n2\nAdditional Services and Adjacent Businesses\nIn addition to insurance broking, Marsh provides certain other specialist advisory or placement services:\nMarsh Advisory\n is a global practice comprising specialists who use data and analytics, including through Marsh’s Blue[i] digital analytics platform. Marsh Advisory’s three main service areas (Consulting, Claims, and Analytics) advise clients on existing and emerging risk exposures, protecting critical business activities and developing strategies to optimize total cost of risk. \nMarsh Captive Solutions\n,\n a prominent part of the Marsh Specialty and Global Placement practice, helps organizations of all sizes retain risks through comprehensive and innovative captive solutions. This team is comprised of captive consultants, actuaries and captive management professionals which offer complete, end-to-end captive management services.\nBowring Marsh\n is an international placement broker. This unit’s core strategy is to modernize risk transfer advice and solutions for clients. This is executed through a combination of data solutions, capacity creation vehicles, segmentation, placement platforms (on-shoring solutions within the network), and improved operational efficiency – all designed to yield a better client outcome and experience. The products Bowring Marsh places include property, casualty, terrorism, product recall, and special risks.\nMercer Marsh Benefits\n provides health benefits brokerage and consulting services to clients of all sizes in numerous countries across the globe, outside of the U.S. As described below, Mercer and Marsh go to market together to provide strategic advice and services to help clients minimize risk, optimize benefits structure, drive efficiencies and maximize employee engagement.\nServices for Insurers\nMarsh's\n Insurer Consulting Group (ICG) \nprovides services to insurance carriers. Through Marsh's patented electronic platform, MarketConnect, and sophisticated data analysis, ICG provides insurers with individualized preference setting and risk identification capabilities, as well as detailed performance data and metrics. Insurer consulting teams review performance metrics and preferences with insurers and provide customized consulting services to insurers designed to improve business planning and strategy implementation. ICG services are designed to improve the product offerings available to clients, assist insurers in identifying new opportunities and enhance insurers’ operational efficiency. The scope and nature of the services vary by insurer and by geography.\nGUY CARPENTER\nGuy Carpenter, the Company’s reinsurance intermediary and advisor, generated approximately \n10%\n of the Company's total revenue in 2024. Currently, approxi\nmately 3,600 Guy C\narpenter colleagues provide clients with a combination of specialized reinsurance broking expertise, strategic advisory services and analytics solutions. Guy Carpenter creates and executes reinsurance and risk management solutions for clients worldwide through risk assessment analytics, actuarial services, highly-specialized product knowledge and trading relationships with reinsurance markets. Client services also include contract and claims management, reinsurance accounting and fiduciary services.\nActing as a broker or intermediary on all classes of reinsurance, Guy Carpenter places two main types of property casualty and life / health reinsurance: treaty reinsurance, which involves the transfer of a portfolio of risks; and facultative reinsurance, which involves the transfer of part or all of the coverage provided by a single insurance policy.\nGuy Carpenter provides reinsurance services in a broad range of centers of excellence, segments and specialties including: Automobile / Motor, Aviation, Captives, Crop/Agriculture, Cyber, Engineering / Construction, Financial Lines, InsurTech, Life / Accident / Health, Marine and Energy, Medical Professional, Personal Lines, Mortgage, Political Risk & Trade Credit, Primary & Excess Casualty, Managing General Agents and Program Manager Solutions, Property, Public Sector, Regional / Mutual, Retrocessional Reinsurance, Surety, Terror, and Workers Compensation / Employer Liability.\nGuy Carpenter also offers clients alternatives to traditional reinsurance, including industry loss warranties and, through its licensed affiliates, capital markets alternatives such as transferring catastrophe risk through the issuance of insurance-linked securities. GC Securities, the Guy Carpenter division of MMC Securities LLC and MMC Securities (Europe) Limited, offers corporate finance solutions, including mergers & acquisitions advice and private debt and equity capital raising, and capital markets-based risk transfer solutions that complement Guy Carpenter's strong industry relationships, analytical capabilities and reinsurance expertise.\n3\nGuy Carpenter also provides its clients with reinsurance-related services, including actuarial, enterprise risk management, financial and regulatory consulting, portfolio analysis and advice on the efficient use of capital. Guy Carpenter's Global Analytics & Advisory (\"GAA\") unit helps clients better understand and quantify the uncertainties inherent in their businesses. Working in close partnership with Guy Carpenter account executives, GAA specialists help support clients' critical decisions in numerous areas, including reinsurance utilization, catastrophe exposure portfolio management, new product and market development, rating agency, regulatory and account impacts, loss reserve risk, capital adequacy and return on capital.\nCompensation for Services in Risk and Insurance Services\nMarsh and Guy Carpenter are compensated for brokerage and consulting services through commissions and fees. Commission rates and fees vary in amount and can depend on a number of factors, including the type of insurance or reinsurance coverage provided, the particular insurer or reinsurer selected, and the capacity in which the broker acts and negotiates with clients. In addition to compensation from its clients, Marsh also receives other compensation, separate from retail fees and commissions, from insurance companies. This other compensation includes, among other things, payments for consulting and analytics services provided to insurers; compensation for administrative and other services (including fees for underwriting services and services provided to or on behalf of insurers relating to the administration and management of quota shares, panels and other facilities in which insurers participate); and contingent commissions, which are paid by insurers based on factors such as volume or profitability of Marsh's placements, primarily driven by MMA and parts of Marsh's international operations.\nMarsh and Guy Carpenter receive interest income on certain funds (such as premiums and claims proceeds) held in a fiduciary capacity for others. For a more detailed discussion of revenue sources and factors affecting revenue in our Risk and Insurance Services segment, refer to Part II, Item 7 (\"Management's Discussion and Analysis of Financial Condition and Results of Operations\") of this report.\nCONSULTING\nThe Company's Consulting segment generated approximately \n37%\n of the Company's total revenue in 2024 and employs approxima\ntely 30,500 c\nolleagues worldwide. The Company conducts business in this segment through Mercer and Oliver Wyman Group\n.\nMERCER\nMercer is a leading provider in delivering advice, solutions and products that help organizations meet the health, wealth and career needs of a changing workforce. Mercer has approximate\nly 23,300 colleagues based in 48 countries. Clients include a majority of the companies in the Fortune 1000 and FTSE\n 100, as well as medium- and small-market organizations, public sector entities and individual customers. Mercer generated approximately \n23%\n of the Company's total revenue in 2024.\nMercer operates in the following areas:\nHealth.\n Mercer helps public and private sector employers design and manage employee health and welfare programs; administer health benefits and flexible benefits programs, including benefits outsourcing; engage employees with their health benefits through a digital experience; and comply with local benefits-related regulations. Mercer provides a range of advice and solutions to clients, which, depending on the engagement, may include: total health and wellness management strategies; global health brokerage solutions; vendor performance and audit; life and disability management; and measurement of healthcare provider performance. These services are provided through fee-based consulting as well as commission-based brokerage services in connection with the selection of insurance companies and healthcare providers. \nMercer also provides consulting and actuarial services to U.S. state governments to support the purchase of healthcare through state Medicaid programs. Mercer offers clients tools to enhance employee engagement with their health benefits through its Darwin\nSM \nplatform.\nOutside of the U.S., Mercer and Marsh go to market together for Health benefits brokerage and consulting under the Mercer Marsh Benefits\nSM\n (MMB) brand, as described above. \nWealth. \nThrough its Wealth business, Mercer assists clients worldwide in the design, governance and risk management of defined benefit, defined contribution, hybrid retirement plans and other pools of assets, and with investment of those assets. \n4\nMercer provides actuarial consulting, investment consulting, investment management and related services to the sponsors and trustees of pension plans and master trusts. Mercer also provides investment consulting and investment management services to foundations, endowments, sovereign wealth funds, U.S. public sector clients, insurance companies, financial intermediaries, family offices and individuals. Mercer provides retirement plan outsourcing, including administration and delivery of defined benefit and defined contribution retirement benefits.\nThe investment consulting and investment management services provided by Mercer and its affiliates (investment management services may also be referred to as \"investment solutions,\" \"delegated solutions,\" \"fiduciary management\" or \"outsourced Chief Investment Officer (OCIO) services\") cover a range of stages of the investment process, from investment research (through its Mercer-Insight service), asset allocation and implementation of investment strategies to ongoing portfolio management services. Mercer provides these services primarily to institutional and other sophisticated investors including retirement plans (e.g., defined benefit and defined contribution), master trusts, endowments and foundations, sovereign wealth funds, U.S. public sector clients, insurance companies and family offices, as well as wealth managers and other financial intermediaries, primarily through manager of manager strategies and funds sponsored and managed by Mercer. Mercer’s clients invest in both traditional asset classes (e.g., equities, fixed income and cash equivalents) and alternative or private market strategies (e.g., private equity, private debt, real estate, other real assets and hedge funds). As of December 31, 2024, Mercer and its global affiliates had assets under management of approximately \n$617 billion\n worldwide.\nMercer also provides services to individual retail clients, including financial planning, high net worth risk solutions and other discretionary investment services. \nCareer. \nMercer advises organizations on the engagement, skill assessment, management and reward of employees; the design of executive remuneration programs; people and workforce strategies during business transformation; improvement of human resource (HR) effectiveness; and the implementation of digital and cloud-based Human Resource Information Systems. In addition, through proprietary survey data and decision support tools, Mercer provides clients with human capital information and analytical capabilities to improve strategic human capital decision making. \nMercer’s Career products include solutions relating to rewards, mobility, engagement, workforce analytics and assessments. \nMercer helps clients plan and implement HR programs and other organizational changes designed to maximize employee engagement.\nMercer also provides advice relating to people and benefits-related issues to buyers and sellers in a variety of types of M&A transactions.\nOLIVER WYMAN GROUP\nWith more tha\nn 7,200 \nprofessionals and offices in over \n34 countries,\n Oliver Wyman Group delivers advisory services to clients through three operating units, each of which is a leader in its field: Oliver Wyman, Lippincott and NERA Economic Consulting. Oliver Wyman Group generated approximately \n14%\n of the Company's total revenue in 2024. \nOliver Wyman \nis a global leader in management consulting and combines deep industry knowledge with specialized expertise in strategy, operations, risk management and organization transformation. \nThe firm works with clients around the world to help optimize their business, improve their operations and risk profile, and accelerate their organizational performance to seize opportunities. \nIndustry groups include:\n•\nConsumer, Telecommunications, and Technology\n•\nEnergy and Natural Resources\n•\nFinancial Services (including corporate and institutional banking, public policy, and retail and business banking)\n•\nGovernment and Public Institutions\n•\nHealthcare and Life Sciences\n•\nInsurance and Asset Management\n•\nPrivate Capital \n•\nTransportation and Advanced Industrials: (including aviation; aerospace and defense; rail; express, postal and third-party logistics; services, including travel and leisure, environmental and facility management, and business and tech services; and CAVOK, which provides technical consulting and market forecasting services)\n5\nOliver Wyman overlays its industry knowledge with expertise in the following specializations:\n•\nActuarial\n. Oliver Wyman’s Actuarial Practice uses mathematical and statistical modeling skills and qualitative assessment methodologies to assist clients in evaluating and addressing risk.\n•\nAI Transformation: \nQuotient is Oliver Wyman’s global AI offering, bringing specialized experience to help clients harness the value of AI.\n•\nClimate and Sustainability\n. Oliver Wyman assists clients in cutting through complex climate systems and solving for operational efficiencies. Oliver Wyman helps clients discover new business opportunities, create new pathways, and respond to climate risk, to make needed changes commercially compelling.\n•\nFinance and Risk\n. Oliver Wyman provides leading financial institutions with custom solutions and insights covering all aspects of risk and finance functions, including credit risk, market risks, asset and liability management and liquidity risks, and non-financial risks, together with integrated risk management topics, such as aggregated risk analyses, business applications and culture and organization.\n•\nRestructuring. \nOliver Wyman offers a complete management solution and \"one-stop-shop\" approach to turning around companies, providing strategic, operational, and financial restructuring advice.\n•\nDigital\n. Oliver Wyman partners with clients to address their digital challenges, blending the power of digital with deep industry expertise. By building strong capabilities and culture, Oliver Wyman  accelerates and embeds digital transformation, working collaboratively with clients’ leaders, employees, stakeholders, and customers to jointly define, design, and achieve lasting results.\n•\nOperations.\n Oliver Wyman helps organizations leverage their operations for a competitive advantage using a comprehensive set of capabilities, including performance improvement, digital operations strategy, and risk management.\n•\nPeople and Organizational Performance. \nOliver Wyman's People and Organizational  Performance capability brings together deep expertise and industry knowledge to enable organizations to work in service of its strategic vision and to address the most pressing organizational, people, and change issues.\n•\nPayments. \nOliver Wyman draws on years of industry-shaping work in the Financial Services and Retail industries using deep digital expertise to help clients - from banks/issuers, to payments providers, to retailers - to build growth strategies, form effective partnerships, optimize costs, and manage risk.\n•\nPricing, Sales, and Marketing. \nOliver Wyman helps organizations drive top-line and margin growth through outstanding strategy and decision making on pricing, marketing optimization, and best practices on sales effectiveness.\n•\nCustomer First\n. Oliver Wyman helps bring together capabilities required to identify customer and business growth, conduct detailed business design, build and launch a business, and maintain a focus on realizing growth while de-risking delivery.\n•\nPerformance Transformation\n. Oliver Wyman helps clients to design, realize and sustain value growth via large-scale transformations.\nLippincott\n is a creative consultancy specializing in brand and innovation that shapes recognized brands and experiences for clients globally. Lippincott's strategy and design experts have helped create some of the world's most recognized brands.\nNERA Economic Consulting\n provides economic analysis and advice to public and private entities to achieve practical solutions to highly complex business and legal issues arising from competition, regulation, public policy, strategy, finance and litigation. NERA professionals operate worldwide assisting clients including corporations, governments, law firms, regulatory agencies, trade associations, and international agencies. NERA's specialized practice areas include: antitrust, securities, complex commercial litigation, energy, environmental economics, network industries, intellectual property, product liability and mass torts and transfer pricing.\nCompensation for Services in Consulting\nOliver Wyman Group is compensated for advice and services primarily through fees paid by clients. Mercer is compensated for advice and services through fees paid by clients, commissions and fees based on assets or members. In the majority of cases, Mercer's Health business is compensated through commissions for the placement of insurance contracts and supplemental compensation from insurers based on such factors as \n6\nvolume, growth of accounts, and total retention of accounts placed by Mercer. Mercer may receive commissions in other parts of its business, such as its Private Client Services business and certain financial advice businesses. Mercer's investments business and certain of Mercer's administration services are compensated typically through fees based on assets under administration or management or fee per member. For a majority of the Mercer-managed investment funds, revenue received from Mercer's investment management clients as sub-advisor fees is reported on a gross basis rather than a net basis. For a more detailed discussion of revenue sources and factors affecting revenue in the Consulting segment, refer to Part II, Item 7 (\"Management's Discussion and Analysis of Financial Condition and Results of Operations\") of this report.\nREGULATION\nThe Company's activities are subject to licensing requirements and extensive regulation under U.S. federal and state laws, as well as laws of other countries in which the Company operates. \nAcross most jurisdictions, we are \nalso subject to various data privacy and data protection laws and regulations that apply to personal information, as well as, in certain jurisdictions, cybersecurity laws and regulations and emerging laws and regulations related to artificial intelligence (\"AI\"). \nIn addition, we are subject to various financial crime laws and regulations through our activities, activities of associated persons, the products and services we provide and our business and client relationships. Such laws and regulations relate to, among other areas, sanctions and export control, anti-bribery, anti-corruption, anti-money-laundering and counter-terrorist financing. In certain circumstances, we are also required to maintain operating funds primarily related to regulatory requirements outside the U.S. \nSee Part I, Item 1A (\"Risk Factors\") below for a discussion of how actions by regulatory authorities or changes in legislation and regulation in the jurisdictions in which we operate may have an adverse effect on our businesses and for more information about the laws and regulations related to data privacy, data protection, cybersecurity and AI and the associated risks to our businesses.\nRisk and Insurance Services\n. \nWhile laws and regulations vary from location to location, every state of the U.S. and most foreign jurisdictions require insurance market intermediaries and related service providers (such as insurance brokers, agents and consultants, reinsurance brokers and managing general agents) to hold an individual or company license from a government agency or self-regulatory organization. Some jurisdictions issue licenses only to individual residents or locally-owned business entities; in those instances, if the Company has no licensed subsidiary, it may maintain arrangements with residents or business entities licensed to act in such jurisdiction. Such arrangements are subject to an internal review and approval process. Licensing of reinsurance intermediaries is generally less rigorous compared to that of insurance brokers, and most jurisdictions require only corporate reinsurance intermediary licenses.\nIn the United Kingdom, our business is regulated by the Financial Conduct Authority (\"FCA\"). The FCA’s responsibilities and powers include licensing of insurance and reinsurance intermediaries and related criteria such as professional competence, financial capacity and the requirement to hold professional indemnity insurance, the broking of premium finance to consumers, and competition powers that enable it to enforce prohibitions on anti-competitive behavior in relation to financial services.\nInsurance authorities in the U.S. and certain other jurisdictions in which the Company's subsidiaries do business, including the FCA in the United Kingdom, also have enacted laws and regulations governing the investment of funds, such as premiums and claims proceeds, held in a fiduciary capacity for others. These laws and regulations typically provide for segregation of these fiduciary funds and limit the types of investments that may be made with them, and generally apply to both the insurance and reinsurance business. \nCertain of the Company's Risk and Insurance Services activities are governed by other regulatory bodies, such as investment, securities and futures licensing authorities. In the U.S., Marsh and Guy Carpenter use the services of MMC Securities LLC, a SEC registered broker-dealer and introducing broker in the U.S. MMC Securities LLC is a member of the Financial Industry Regulatory Authority (\"FINRA\"), the National Futures Association and the Securities Investor Protection Corporation (\"SIPC\"), primarily in connection with capital markets and other investment banking-related services relating to insurance-linked and alternative risk financing transactions. Also in the U.S., Marsh uses the services of MMA Securities LLC, a SEC registered broker-dealer, investment adviser and member of FINRA, SIPC and the Municipal Securities Rulemaking Board (\"MSRB\"), and MMA Asset Management LLC, a SEC registered investment adviser, primarily in connection with retirement, executive compensation and benefits consulting and advisory services to qualified and non-qualified benefits plans, companies and executives and personal wealth management. In the United Kingdom, Marsh and Guy Carpenter use the expertise of MMC Securities Limited, which is authorized and regulated by the FCA to provide advice on \n7\nsecurities and investments, including mergers & acquisitions in the United Kingdom. In the European Union, Guy Carpenter uses MMC Securities (Ireland) Limited, which is authorized and regulated by the Central Bank of Ireland to place certain securities and investments in the European Union. MMC Securities LLC, MMC Securities Limited, MMC Securities (Ireland) Limited, MMA Securities LLC, and MMA Asset Management LLC are indirect, wholly-owned subsidiaries of Marsh & McLennan Companies, Inc.\nConsulting\n.\n Mercer's retirement-related consulting and investment services are subject to pension law and financial regulation in many countries. Depending on the country, Mercer may rely on licensed colleagues or registered legal entities to engage in these services, or may utilize other Marsh McLennan entities or third parties. In addition, trustee services, investment services (including advice to persons, institutions and other entities on the investment of pension assets and assumption of discretionary investment management responsibilities) and retirement and employee benefit program administrative services provided by Mercer and its subsidiaries and affiliates may also be subject to investment and securities regulations in various jurisdictions, including (but not limited to) regulations imposed or enforced by the Securities and Exchange Commission (SEC) and the Department of Labor in the U.S., the Ontario Securities Commission in Canada, the FCA in the United Kingdom, the Central Bank of Ireland and the Australian Prudential Regulation Authority and the Australian Securities and Investments Commission. In the U.S., Mercer provides investment services through Mercer Investments LLC, (formerly Mercer Investment Management, Inc.), an SEC-registered investment adviser, which consolidated the activities of each of Mercer’s affiliated investment adviser entities in the U.S. (including Mercer Investment Consulting LLC and Pavilion Advisory Group) in 2019. Mercer Trust Company, a limited purpose New Hampshire chartered trust bank, may also provide services for certain clients of Mercer’s investment management business in the U.S. The benefits insurance consulting and brokerage services provided by Mercer and its subsidiaries and affiliates are subject to the same licensing requirements and regulatory oversight as the insurance market intermediaries described above regarding our Risk and Insurance Services businesses. Depending on the nature of the client and services performed, Mercer may also be subject to direct oversight by the Department of Health and Human Services and other federal agencies in the U.S. Mercer provides annuity buy-out advice that is subject to regulations (for example, in the U.S., state insurance licensing regulations and ERISA). Mercer uses the services of MMC Securities LLC to provide certain services, including executive benefit and compensation services and securities dealing services. \nFATCA\n.\n Regulations promulgated by the U.S. Treasury Department pursuant to the Foreign Account Tax Compliance Act and related legislation (FATCA) require the Company to take various measures relating to non-U.S. funds, transactions and accounts. The regulations impose on Mercer and MMA certain client financial account obligations relating to non-U.S. financial institution and insurance clients.\nCOMPETITIVE CONDITIONS\nThe Company faces significant competition in all of its businesses from providers of similar products and services, including competition with regard to identifying and pursuing acquisition candidates. The Company also encounters strong competition throughout its businesses from both public corporations and private firms in attracting and retaining qualified employees. As the Company has clients across various geographies, industries and sizes, the competitive landscape is complex and varies across numerous markets. In addition to the discussion below, refer to \"Risks Relating to the Company Generally — Competitive Risks,\" in Part I, Item 1A of this report.\nRisk and Insurance Services\n.\n The Company's combined insurance and reinsurance services businesses are global in scope. Our insurance and reinsurance businesses compete principally on the sophistication, range, quality and cost of the services and products they offer to clients. The Company encounters strong competition from other insurance and reinsurance brokerage firms that operate on a global, regional, national or local scale in every geography in which it operates, from insurance and reinsurance companies that market, distribute and service their insurance and reinsurance products without the assistance of brokers and from other businesses, including commercial and investment banks, accounting firms, consultants and online platforms, that provide risk-related services and products or alternatives to traditional insurance brokerage services. In addition, third party capital providers have entered the insurance and reinsurance risk transfer market offering products and capital directly to the Company’s clients. Their presence in the market increases the competitive pressures that the Company faces.\n8\nCertain insureds and groups of insureds have established programs of self-insurance as a supplement or alternative to purchasing traditional third-party insurance, thereby reducing in some cases their need for third-party insurance placements. Certain insureds also obtain coverage directly from insurance providers. There are also many other providers of managing general agents, affinity programs and private client services that compete with the Company's offerings.\nConsulting\n.\n The Company's consulting businesses face strong competition from other privately and publicly held worldwide and national companies, as well as regional and local firms. These businesses generally compete on the basis of the range, quality and cost of the services and products they provide to clients. Competitors include independent consulting, broking and outsourcing firms, as well as consulting, broking and outsourcing operations affiliated with larger accounting, information systems, technology and financial services firms. Mercer’s Health business faces additional competition from insurers and from non-traditional competitors seeking to enter or expand in the health benefits space (for example, payroll firms, large consumer businesses, and digitally oriented consultancies). Mercer's investments business faces competition from many sources, including investment consulting firms (many of which offer delegated services), investment management firms and other financial institutions. In some cases, clients have the option of handling the services provided by Mercer and Oliver Wyman Group internally, without assistance from outside advisors.\nSegmentation of Activity by Type of Service and Geographic Area of Operation.\nFinancial information relating to the types of services provided by the Company and the geographic areas of its operations is incorporated herein by reference to Note 17, Segment Information, in the notes to the consolidated financial statements included under Part II, Item 8 of this report. \nHUMAN CAPITAL\nAs a professional services firm, we believe the health of our business relies on the strength of our workforce. \nOur People.\n As of December 31, 2024, the Co\nmpany and its consolidated subsidiaries employed more than 90,000 colleagues worldwide, including approximately 52,400 in Risk and Insurance Services and 30,500 in Consulting.\nPeople Leadership and Governance. \nThe Chief People Officer is responsible for leading the development and execution of our enterprise people strategy. This includes the attraction, recruitment, hiring, development and engagement of talent to deliver on our strategy and the design of colleague total rewards programs. The Chief People Officer is also responsible for leading the development and integration of our inclusion approach into our strategy.\nOur ESG Committee and Compensation Committee of the Board of Directors have oversight responsibility for various aspects of the Company’s human capital management and are regularly updated by the Chief People Officer. \nColleague Value Proposition and Engagement. \nIn 2024, we introduced our shared Colleague Value Proposition (CVP), an articulation of why colleagues choose to work and invest their talents at Marsh McLennan. You can be your best here captures the unique experience offered to current and prospective colleagues at Marsh McLennan, and it’s inspired by our own colleagues’ voices. In 2024, we introduced our shared Colleague Value Proposition (CVP), an articulation of why colleagues choose to work and invest their talents at Marsh McLennan. You can be your best here captures the unique experience offered to current and prospective colleagues at Marsh McLennan, and it’s inspired by our own colleagues’ voices. It is embodied in our key pillars: Impact, Leadership, Culture, Career, and Rewards, all of which support our shared purpose: “We build the confidence to thrive through the power of perspective.”\nEach year since 2011, we have asked our colleagues to share their views on working at Marsh McLennan through a company-wide engagement survey that is administered by a third party. In 2024, we expanded the survey with questions on technology and the Company's strategy. The survey enables us to understand the evolution of our culture and identify opportunities to build on strengths and address challenges, all with the intention of furthering our productivity through an engaged workforce that can adapt to changing work environments and business needs.\nTalent & Inclusion\n. Our Company’s greatest strength is the collective talent of our people. We provide resources to support co\nlleagues to be their best at Marsh McLennan. We are committed to helping colleagues perform at their best by encouraging regular discussions about their goals, performance, career aspirations and development \n9\nopportunities. We enable all colleagues to advance their skills through professional development, learning from talented colleagues, and support in taking on new challenges. We deliver professional development via a multi-lingual, digital-first learning strategy, supplemented by formal programs for key groups. In 2024, we offered 520 developmental workshops comprising of professional skills, people management and leadership development. Additionally, we launched our AI Academy to promote development of essential new skills. In the six months since launch, nearly 35,000 colleagues have received their AI Academy credentials.\nHealth and Well-being\n. We are committed to enhancing the well-being of our colleagues through a comprehensive value proposition that prioritizes health, wellness and work-life balance. We offer comprehensive health insurance, including medical coverage and other core health benefits that are competitive in the market. Recognizing the importance of mental wellness, we provide personalized tools and support, along with 24/7 access to Employee Assistance Programs for confidential counselling. Our critical incident support ensures that colleagues receive the help they need in times of crisis, particularly in countries affected by disasters. \nIn addition to these health benefits, we offer competitive time-off policies, including a paid day off each year to volunteer, reflecting our commitment to community engagement and personal fulfillment. We understand that life can bring\n changing circumstances and we are here to support our colleagues through milestone life events, health and economic challenges, and the integration of new technologies.\nTotal Rewards\n. We offer our colleagues rewards that are designed to be competitive in the market, attract and retain highly talented individuals and recognize their performance and contributions. Base pay is one component. We further encourage performance that aligns with the Company’s interests by awarding eligible colleagues with discretionary incentives. These incentives, such as annual bonuses, sales incentives and long-term incentives are awarded to colleagues in roles that have a significant impact on our short and long-term success. In addition to health benefits, our total rewards also include retirement benefits, savings and stock investment plans in most jurisdictions so that our colleagues can experience a full range of rewards that work for them.\n10\nEXECUTIVE OFFICERS OF THE COMPANY\nThe executive officers and executive officer appointees of the Company are appointed annually by the Company’s Board of Directors. The following individuals are the executive officers of the Company as of February 10, 2025:\nPaul Beswick\n, age 50, is Senior Vice President and Global Chief Information and Operations Officer (CIOO) of Marsh McLennan. As CIOO, Mr. Beswick leads the Business and Client Services team and oversees Marsh McLennan's Operations and Technology teams in support of the Company's global businesses. Prior to assuming this expanded role in January 2025, Mr. Beswick served as Chief Information Officer from 2021 to 2025. He was previously a Partner and Global Head of Oliver Wyman Labs and the Digital Practice at Oliver Wyman where he worked in various sectors, including financial services, retail, transportation, telecoms, and consumer goods. Before this, Mr. Beswick headed Oliver Wyman's North American Retail Practice. \nKatherine J. Brennan\n, age 46, is Senior Vice President and General Counsel of Marsh McLennan. In this role, she leads Marsh McLennan’s global legal, compliance and public affairs function, which supports the Company’s four businesses, Marsh, Guy Carpenter, Mercer and Oliver Wyman. She also leads the Company’s sustainability efforts. Ms. Brennan has held several legal and compliance leadership roles at Marsh McLennan, serving most recently as General Counsel, Marsh LLC. She also served as Deputy General Counsel, Corporate Secretary and Chief Compliance Officer for Marsh McLennan from 2017 to 2021, and prior to that, as General Counsel of Guy Carpenter. Ms. Brennan currently serves on the Board of the Red Cross of Greater New York.\nJohn Q. Doyle\n, age 61, is President and Chief Executive Officer of Marsh McLennan. Previously, from 2021 to 2022 he served as Group President and Chief Operating Officer, responsible for the strategy and operational objectives of Marsh McLennan’s four global businesses. He joined the firm in 2016 as President of Marsh, then led Marsh as President and CEO from 2017 to 2021. An industry veteran with more than 35 years of management experience, Mr. Doyle began his career at AIG, where he held several executive positions. He is a member of the Board of the New York Police and Fire Widows’ and Children’s Benefit Fund, a Trustee of the Inner-City Scholarship Fund, a member of the Board of Overseers of the Maurice R. Greenberg School of Risk Management, Insurance and Actuarial Science at St. John’s University and a director of Catalyst Inc. Mr. Doyle serves as the Chairman of the U.S. Federal Advisory Committee on Insurance.\nCarmen Fernandez\n, age 51, is Senior Vice President and Chief People Officer for Marsh McLennan. Prior to her appointment as Chief People Officer in January 2021, Ms. Fernandez held positions within Marsh McLennan for 15 years, most recently Deputy CHRO, CHRO of Guy Carpenter, and HR leadership roles at Mercer, including North America HR Leader, Global HR Leader for the Career business and Chief of Staff in the Office of the CEO. Before joining Marsh McLennan, Ms. Fernandez worked in investment banking at Goldman Sachs and Bank of America. She began her career as a consultant with PricewaterhouseCoopers.\nJohn Jones\n, age 53, is Chief Marketing and Communications Officer of Marsh McLennan. Previously, he served as Chief Marketing and Communications Officer of Marsh from 2018 to 2022. Mr. Jones joined Marsh in 2016 as Senior Vice President of Business Planning, leading strategic planning and global growth initiatives.  Prior to that, Mr. Jones was senior vice president of commercial marketing and strategy for AIG and has more than 25 years of marketing, communications and strategy experience.  \nDean Klisura\n, age 61, is President and Chief Executive Officer of Guy Carpenter and serves as Vice Chair of Marsh McLennan. Prior to assuming this role in January 2022, he was President of Guy Carpenter, overseeing the North America, International, Specialty and Global Analytics & Advisory business units. Prior to joining Guy Carpenter, Mr. Klisura was President of Marsh Global Placement and Advisory Services, leading property and casualty placement activities globally, as well as leading Bowring Marsh, the Insurer Consulting Group, and Marsh Advisory. He joined Marsh in 1993 and held several key global leadership roles including President of Global Specialties. \nMark McGivney\n, age 57, is Chief Financial Officer of Marsh McLennan. Prior to assuming this role in January 2016, Mr. McGivney held a number of senior financial management positions since joining the Company in 2007. Most recently he was Senior Vice President, Corporate Finance of Marsh McLennan, and was responsible for leading and directing the Company’s Corporate Development, Treasury and Investor Relations functions from 2014 until 2016. Prior to that, he served as Chief Financial Officer of Marsh, and Chief Financial Officer and Chief Operating Officer of Mercer. His prior experience includes senior positions at The Hanover Insurance Group, including serving as Senior Vice President of Finance, Treasurer, and Chief Financial Officer of the Property & Casualty business, and investment banking positions at Merrill Lynch and PricewaterhouseCoopers.\n11\nMartin South\n, age 60, is President and Chief Executive Officer of Marsh, a position he assumed in January 2022, and oversees all of Marsh’s businesses and operations globally. He also serves as Vice Chair of Marsh McLennan. With more than 30 years in the insurance industry, Mr. South joined Marsh for the first time in 1985 with Bowring Marsh, a Marsh McLennan broking unit. His industry experience includes senior leadership roles at Zurich Financial Services, where he was a member of the Group Management Board, responsible for all of Zurich’s operations outside of North America and Europe, and CEO of Zurich’s London operations. Since rejoining Marsh in 2007, Mr. South has served as CEO of Marsh’s Asia-Pacific region, CEO of Marsh U.K. and Ireland, CEO of Marsh Europe and CEO of Marsh U.S. and Canada.\nNicholas Studer\n, age 51, is Chief Executive Officer of Oliver Wyman Group, a role he assumed in July of 2021. He also serves as Vice Chair of Marsh McLennan. From 2017 to 2021, Mr. Studer was the Managing Partner of the Consumer, Industrial and Services Practice Group, before becoming Managing Partner of Oliver Wyman in 2021. He has held many senior positions at Oliver Wyman including Managing Partner of the Financial Services Practice Group, Head of the European Finance and Risk Practice and Global head of the Corporate and Institutional Banking practice. He has over 25 years of experience consulting in the U.K., Continental Europe, and North America. Mr. Studer was a founding Director of TheCityUK, a founding advisory board member of the FICC Markets Standards Board and is a member of the Sustainable Markets Initiative.\nPat Tomlinson\n, age 54, is President and Chief Executive Officer of Mercer and Vice Chair of Marsh McLennan, a position he assumed in April of 2024. He also serves as CEO of Marsh McLennan US and Canada, with responsibility for leading across businesses to address clients’ increasingly interconnected risk, strategy and people challenges. From 2020 to 2024, Mr. Tomlinson served as Mercer's President of U.S. and Canada. Prior to that, he served as a U.S. and Canada business leader, leading the U.S. East Market, where he guided Mercer's Health, Wealth, and Career businesses to meet ever-changing client needs. Prior to joining Mercer in 2014, he spent 17 years with Aon and served as an officer in the U.S. Army. \nThe Company is subject to the information reporting requirements of the Securities Exchange Act of 1934. In accordance with the Exchange Act, the Company files with, or furnishes to, the SEC its annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statement for its annual shareholders' meeting. The Company makes these reports and any amendments to these reports available free of charge through its website, \nwww.marshmclennan.com\n, as soon as reasonably practicable after they are filed with or furnished to the SEC. The SEC also maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements and other information regarding issuers, like the Company, that file electronically with the SEC.\nThe Company also posts on its website certain governance and other information for investors.\nThe Company encourages investors to visit these websites from time to time, as information is updated and new information is posted. Website references in this report are provided as a convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, the websites. Therefore, such information should not be considered part of this report.\n12",
  "item7": "Item 7.   Management’s Discussion and Analysis of Financial Condition and Results of Operations. \nGeneral\nMarsh McLennan Companies Inc., and its consolidated subsidiaries (Marsh McLennan or the \"Company\") a global professional services firm in the areas of risk, strategy and people. The Company helps clients build the confidence to thrive through the power of perspective of our four market-leading businesses. With annual revenue of over $24 billion, the Company has more than 90,000 colleagues advising clients in over 130 countries.\nMarsh provides data-driven risk advisory services and insurance solutions to commercial and consumer clients. Guy Carpenter develops advanced risk, reinsurance and capital strategies that help clients grow profitably and pursue emerging opportunities. Mercer delivers advice and technology-driven solutions that help organizations redefine the world of work, reshape retirement and investment outcomes, and unlock health and well-being for a changing workforce. Oliver Wyman Group serves as a critical strategic, economic and brand advisor to private sector and governmental clients. The four businesses also collaborate together to deliver new solutions to help clients manage complex and interconnected risks. \nThe Company conducts business through two segments:\n•\nRisk and Insurance Services\n includes risk management activities (risk advice, risk transfer and risk control and mitigation solutions) as well as insurance and reinsurance broking and services. The Company conducts business in this segment through Marsh and Guy Carpenter.\n•\nConsulting\n includes health, wealth and career advice, solutions and products, and specialized management, strategic, economic and brand consulting services. The Company conducts business in this segment through Mercer and Oliver Wyman Group.\nThe results of operations in the Management Discussion & Analysis (\"MD&A\") include an overview of the Company’s consolidated results for fiscal year 2024, compared to the results for fiscal year 2023, and should be read in conjunction with the consolidated financial statements and notes. This section also includes a discussion of the key drivers impacting the Company’s financial results of operations both on a consolidated basis and by reportable segments. \nWe describe the primary sources of revenue and categories of expense for each reportable segment in the discussion of segment financial results. A reconciliation of segment operating income to total operating income is included in Note 17, Segment Information, in the notes to the consolidated financial statements included in Part II, Item 8, of this report. \nFor information and comparability of the Company's results of operations and liquidity and capital resources for fiscal year 2022, refer to \"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\" of the Company's Form 10-K for the fiscal year ended December 31, 2023.\nThis MD&A contains forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Refer to \"Information Concerning Forward-Looking Statements\" at the outset of this report.\nNon-GAAP Measures\nThe Company reports its financial results in accordance with accounting principles generally accepted in the United States (U.S.), referred to as in accordance with \"GAAP\" or \"reported\" results. The Company also refers to and presents a non-GAAP financial measure in non-GAAP revenue, within the meaning of Regulation G and Item 10(e) of Regulation S-K in accordance with the Securities Exchange Act of 1934. The Company has included a reconciliation of this non-GAAP financial measure to the most directly comparable financial measure calculated in accordance with GAAP as part of the consolidated revenue and expense discussion. Percentage changes, referred to as non-GAAP underlying revenue, are calculated by dividing the period over period change in non-GAAP revenue by the prior period non-GAAP revenue.\n \nThe Company believes this non-GAAP financial measure provides useful supplemental information that enables investors to better compare the Company’s performance across periods. Management also uses this measure internally to assess the operating performance of its businesses and to decide how to allocate resources. However, investors should not consider this non-GAAP measure in isolation from, or as a substitute for, the financial information that the Company reports in accordance with GAAP. The Company's non-GAAP measure includes adjustments that reflect how management views its businesses and may differ from similarly titled non-GAAP measures presented by other companies.\n37\nFinancial Highlights\n•\nConsolidated revenue in 2024 was $24.5 billion, an increase of 8%, or 7% on an underlying basis. \n•\nConsolidated operating income increased $535 million, or 10% to $5.8 billion in 2024, compared to 2023. Net income attributable to the Company was $4.1 billion. Earnings per share on a diluted basis increased to $8.18 from $7.53, or 9%, compared with 2023.\n•\nRisk and Insurance Services revenue in 2024 was $15.4 billion, an increase of 9%, or 8% on an underlying basis. Operating income was $4.4 billion and $3.9 billion in 2024 and 2023, respectively.\n•\nMarsh's revenue in 2024 was $12.5 billion, an increase of 10%, or 7% on an underlying basis. Guy Carpenter's revenue in 2024 was $2.4 billion, an increase of 5%, or 8% on an underlying basis. \n•\nConsulting revenue in 2024 was $9.1 billion, an increase of 5%, or 6%\n \non an underlying basis. Operating income was $1.8 billion and $1.7 billion in 2024 and 2023, respectively.\n•\nMercer's revenue in 2024 was $5.7 billion, an increase of 3%, or 5% on an underlying basis. Oliver Wyman Group's revenue in 2024 was $3.4 billion, an increase of 9%, or 6% on an underlying basis. \n•\nThe Company's results of operations in 2024 included restructuring activities of $276 million, primarily related to severance and lease exit charges for activities focused on workforce actions, technology rationalization and reductions in real estate. \n•\nThe Company completed 17 acquisitions in 2024. On November 15, 2024, the Company completed the acquisition of McGriff Insurance Services, LLC (\"McGriff\") for $7.75 billion in cash consideration. \n•\nOn January 1, 2024, the Company completed the sale of its Mercer U.K. pension administration and U.S. health and benefits administration businesses for approximately $120 million, and recorded a net gain of $35 million in the current year. \n•\nIn November 2024, the Company issued $7.25 billion of senior notes to fund the acquisition of McGriff and for general corporate purposes. In February 2024, the Company issued $500 million of 5.150% senior notes due 2034 and $500 million of 5.450% senior notes due 2054. \n•\nIn 2024, the Company repaid $1.6 billion of senior notes at maturity.\n•\nIn 2024, the Company repurchased 4.3 million shares for $900 million.\n38\nAcquisition of McGriff\nOn November 15, 2024, the Company completed the acquisition of McGriff, an affiliate of TIH Insurance Holdings (the \"McGriff Transaction\") for $7.75 billion in cash consideration, subject to certain customary adjustments. McGriff is an insurance broking and risk management services provider in the United States (U.S.), with approximately $1.3 billion in annual revenue. \nIn connection with the McGriff Transaction, on September 29, 2024, the Company entered into a Bridge Loan Commitment Letter (the “Commitment Letter”) to provide the Company under a 364-day unsecured bridge term loan facility in an amount not to exceed $7.75 billion (the \"Bridge Loan Facility\"). The Company paid approximately $23 million for customary upfront fees related to the Commitment Letter, amortized as interest expense. \nOn November 8, 2024, the Company issued $7.25 billion of senior notes and terminated the Commitment Letter. \nIn connection with the acquisition of McGriff, the Company incurred approximately $63 million of acquisition and retention related costs in 2024. The Company expects to recognize costs of approximately $450 million to $500 million, primarily retention incentives over the next 3 years related to the McGriff acquisition. These costs include retention plans put in place by the seller and were funded through a purchase price adjustment for McGriff. The Company continues to refine its integration plans as it relates to the acquisition of McGriff, which may change the timing and estimates of expected costs and payments. \nMcGriff's results of operations for the period November 15, 2024 through December 31, 2024 were included in the Company’s results of operations for 2024, in Marsh, in the Risk and Insurance Services segment. \nAs of November 15, 2024, the Company assumed the assets and legal liabilities of McGriff. Please see the \"Risk Factors\" section of this Annual Report on Form 10-K for risks associated with acquisitions and dispositions.\n* * * * *\nThe macroeconomic and geopolitical environment including multiple major wars and global conflicts, slower GDP growth or recession, lower interest rates, capital markets volatility, inflation and changes in insurance premium rates could impact our business, financial condition, results of operations and cash flows. For more information about these risks, please see “Risk Factors – Macroeconomic Risks” in this annual report on Form 10-K.\nFor additional details, refer to the Consolidated Results of Operations and Liquidity and Capital Resources sections in this MD&A. \nAcquisitions and dispositions impacting the Risk and Insurance Services and Consulting segments are discussed in Note 5, Acquisitions and Dispositions, in the notes to the consolidated financial statements.\n39\nConsolidated Results of Operations\nFor the Years Ended December 31,\n(In millions, except per share data)\n2024\n2023\n2022\nRevenue\n$\n24,458\n \n$\n22,736 \n$\n20,720 \nExpense:\nCompensation and benefits\n13,996\n \n13,099 \n12,071 \nOther operating expenses\n4,645\n \n4,355 \n4,369 \nOperating expenses\n18,641\n \n17,454 \n16,440 \nOperating income\n$\n5,817\n \n$\n5,282 \n$\n4,280 \nIncome before income taxes\n$\n5,480\n \n$\n5,026 \n$\n4,082 \nNet income before non-controlling interests\n$\n4,117\n \n$\n3,802 \n$\n3,087 \nNet income attributable to the Company\n$\n4,060\n \n$\n3,756 \n$\n3,050 \nNet income per share attributable to the Company\n– Basic\n$\n8.26\n \n$\n7.60 \n$\n6.11 \n– Diluted\n$\n8.18\n \n$\n7.53 \n$\n6.04 \nAverage number of shares outstanding:\n– Basic\n492\n \n494 \n499 \n– Diluted\n496\n \n499 \n505 \nShares outstanding at December 31,\n491\n \n492 \n495 \nConsolidated operating income increased $535 million, or 10% to $5.8 billion in 2024, compared to $5.3 billion in the prior year, reflecting an 8% increase in revenue and a 7% increase in expenses. Revenue growth was driven by increases in the Risk and Insurance Services and Consulting segments of 9% and 5%, respectively.  \nDiluted earnings per share increased to $8.18 from $7.53, or 9% from the prior year. The increase is primarily the result of higher operating income in 2024, compared to the prior year. \n40\nConsolidated Revenue and Expense\nRevenue – Non-GAAP Revenue and Components of Change\nThe Company advises clients in 130 countries. As a result, foreign exchange rate movements may impact period over period comparisons of revenue. Similarly, certain other items such as acquisitions and dispositions, including transfers among businesses, may impact period over period comparisons of revenue. Non-GAAP revenue measures the change in revenue from one period to the next by isolating these impacts on an underlying revenue basis. Percentage changes, referred to as non-GAAP underlying revenue, are calculated by dividing the period over period change in non-GAAP revenue by the prior period non-GAAP revenue.\nThe non-GAAP revenue measure is presented on a constant currency basis excluding the impact of foreign currency fluctuations. The Company isolates the impact of foreign exchange rate movements period over period, by translating the current period foreign currency GAAP revenue into U.S. Dollars based on the difference in the current and corresponding prior period exchange rates.\nThe percentage change for acquisitions, dispositions, and other includes the impact of current and prior year items excluded from the calculation of non-GAAP underlying revenue for comparability purposes. Details on these items are provided in the reconciliation of non-GAAP revenue to GAAP revenue tables.\nThe following tables present the Company's non-GAAP revenue for the years ended December 31, 2024 and 2023 and the related non-GAAP underlying revenue change:\nYear Ended December 31,   \n(In millions, except percentages)\nGAAP Revenue\n% Change \nGAAP\nRevenue*\nNon-GAAP Revenue\nNon-GAAP Underlying Revenue*\n2024\n2023\n2024\n2023\nRisk and Insurance Services\nMarsh\n$\n12,536\n \n$\n11,378 \n10 \n%\n$\n12,218\n \n$\n11,375 \n7 \n%\nGuy Carpenter\n2,362\n \n2,258 \n5 \n%\n2,371\n \n2,188 \n8 \n%\nSubtotal\n14,898\n \n13,636 \n9 \n%\n14,589\n \n13,563 \n8 \n%\nFiduciary interest income\n497\n \n453 \n493\n \n453 \nTotal Risk and Insurance Services\n15,395\n \n14,089 \n9 \n%\n15,082\n \n14,016 \n8 \n%\nConsulting\nMercer \n5,743\n \n5,587 \n3 \n%\n5,629\n \n5,338 \n5 \n%\nOliver Wyman Group\n3,390\n \n3,122 \n9 \n%\n3,294\n \n3,120 \n6 \n%\nTotal Consulting\n9,133\n \n8,709 \n5 \n%\n8,923\n \n8,458 \n6 \n%\nCorporate Eliminations\n(70)\n(62)\n(70)\n(62)\nTotal Revenue\n$\n24,458\n \n$\n22,736 \n8 \n%\n$\n23,935\n \n$\n22,412 \n7 \n%\nThe following table provides more detailed revenue information for certain of the components presented in the previous table:\nYear Ended December 31,\n(In millions, except percentages)\nGAAP Revenue\n% Change \nGAAP\nRevenue*\nNon-GAAP Revenue\nNon-GAAP Underlying Revenue*\n2024\n2023\n2024\n2023\nMarsh:\nEMEA\n$\n3,530\n \n$\n3,262 \n8 \n%\n$\n3,521\n \n$\n3,259 \n8 \n%\nAsia Pacific\n1,414\n \n1,295 \n9 \n%\n1,373\n \n1,295 \n6 \n%\nLatin America\n575\n \n559 \n3 \n%\n613\n \n559 \n10 \n%\nTotal International\n5,519\n \n5,116 \n8 \n%\n5,507\n \n5,113 \n8 \n%\nU.S./Canada\n7,017\n \n6,262 \n12 \n%\n6,711\n \n6,262 \n7 \n%\nTotal Marsh\n$\n12,536\n \n$\n11,378 \n10 \n%\n$\n12,218\n \n$\n11,375 \n7 \n%\nMercer:\nWealth \n$\n2,584\n \n$\n2,507 \n3 \n%\n$\n2,455\n \n$\n2,361 \n4 \n%\nHealth\n2,100\n \n2,061 \n2 \n%\n2,115\n \n1,958 \n8 \n%\nCareer\n1,059\n \n1,019 \n4 \n%\n1,059\n \n1,019 \n4 \n%\nTotal Mercer\n$\n5,743\n \n$\n5,587 \n3 \n%\n$\n5,629\n \n$\n5,338 \n5 \n%\n(*)\n Rounded to whole percentages. \n \n \n41\nRevenue – Reconciliation of Non-GAAP Measures\nThe following table provides the reconciliation of GAAP revenue to Non-GAAP revenue for the years ended December 31, 2024 and 2023:\n2024\n2023\nYear Ended December 31,  \n(In millions)\nGAAP Revenue\nCurrency Impact\nAcquisitions/\nDispositions/\nOther Impact\nNon-GAAP Revenue\nGAAP Revenue\nAcquisitions/\nDispositions/\nOther Impact\nNon-GAAP Revenue\nRisk and Insurance Services\nMarsh \n$\n12,536\n \n$\n73\n \n$\n(391)\n$\n12,218\n \n$\n11,378 \n$\n(3)\n$\n11,375 \nGuy Carpenter (a)\n2,362\n \n7\n \n2\n \n2,371\n \n2,258 \n(70)\n2,188 \nSubtotal\n14,898\n \n80\n \n(389)\n14,589\n \n13,636 \n(73)\n13,563 \nFiduciary interest income\n497\n \n1\n \n(5)\n493\n \n453 \n— \n453 \nTotal Risk and Insurance Services\n15,395\n \n81\n \n(394)\n15,082\n \n14,089 \n(73)\n14,016 \nConsulting\nMercer (b)\n5,743\n \n37\n \n(151)\n5,629\n \n5,587 \n(249)\n5,338 \nOliver Wyman Group (c)\n3,390\n \n(5)\n(91)\n3,294\n \n3,122 \n(2)\n3,120 \nTotal Consulting\n9,133\n \n32\n \n(242)\n8,923\n \n8,709 \n(251)\n8,458 \nCorporate Eliminations\n(70)\n—\n \n—\n \n(70)\n(62)\n— \n(62)\nTotal Revenue\n$\n24,458\n \n$\n113\n \n$\n(636)\n$\n23,935\n \n$\n22,736 \n$\n(324)\n$\n22,412 \nThe following table provides more detailed revenue information for certain of the components presented in the previous table:\n2024\n2023\nYear Ended December 31, \n(In millions)\nGAAP Revenue\nCurrency Impact\nAcquisitions/\nDispositions/\nOther Impact\nNon-GAAP Revenue\nGAAP Revenue\nAcquisitions/\nDispositions/\nOther Impact\nNon-GAAP Revenue\nMarsh:\nEMEA\n$\n3,530\n \n$\n(10)\n$\n1\n \n$\n3,521\n \n$\n3,262 \n$\n(3)\n$\n3,259 \nAsia Pacific\n1,414\n \n25\n \n(66)\n1,373\n \n1,295 \n— \n1,295 \nLatin America\n575\n \n51\n \n(13)\n613\n \n559 \n— \n559 \nTotal International\n5,519\n \n66\n \n(78)\n5,507\n \n5,116 \n(3)\n5,113 \nU.S./Canada \n7,017\n \n7\n \n(313)\n6,711\n \n6,262 \n— \n6,262 \nTotal Marsh\n$\n12,536\n \n$\n73\n \n$\n(391)\n$\n12,218\n \n$\n11,378 \n$\n(3)\n$\n11,375 \nMercer:\nWealth (b)\n$\n2,584\n \n$\n—\n \n$\n(129)\n$\n2,455\n \n$\n2,507 \n$\n(146)\n$\n2,361 \nHealth (b)\n2,100\n \n20\n \n(5)\n2,115\n \n2,061 \n(103)\n1,958 \nCareer\n1,059\n \n17\n \n(17)\n1,059\n \n1,019 \n— \n1,019 \nTotal Mercer\n$\n5,743\n \n$\n37\n \n$\n(151)\n$\n5,629\n \n$\n5,587 \n$\n(249)\n$\n5,338 \n(a)\nAcquisitions, dispositions, and other in 2023 includes a gain from legal settlement with a competitor of $58 million, excluding legal fees.\n(b)\nAcquisitions, dispositions and other in 2024 includes a net gain of $35 million from the sale of the U.K. pension administration and U.S. health and benefits administration businesses, that comprised of a $70 million gain in Wealth, offset by a $35 million loss in Health.\n(c)\nAcquisitions, dispositions, and other in 2024 includes a gain of $20 million from the sale of a business in Oliver Wyman Group.\nNote: Amounts in the tables above are rounded to whole numbers.\n42\nConsolidated Revenue\nConsolidated revenue increased $1.7 billion, or 8%, to $24.5 billion in 2024, compared to $22.7 billion in 2023. Consolidated revenue increased 7% on an underlying basis and 1% from acquisitions. On an underlying basis, revenue increased 8% and 6% in 2024, in the Risk and Insurance Services and Consulting segments, respectively. \nConsolidated revenue growth in 2024 reflects the continued demand for our advice and solutions.\nConsolidated Operating Expenses\nConsolidated operating expenses increased $1.2 billion, or 7%, to $18.6 billion in 2024, compared to $17.5 billion in 2023. Expenses reflect a 2% increase from acquisitions. \nConsolidated operating expenses in 2024 increased primarily due to compensation and benefits, driven by higher base salaries and incentive compensation.\nRestructuring activities\nThe Company incurred a total of $276 million for restructuring activities in \n2024\n, compared to $301 million in 2023. \nIn the fourth quarter of 2022, the Company initiated activities focused on workforce actions, rationalization of technology and functional services, and reductions in real estate. These activities were completed at the end of 2024. The Company incurred approximately $660 million\n \nof these restructuring costs through December 31, 2024, primarily severance and lease exit charges, of which $221 million were incurred in 2024. Related estimated savings are expected to be over $500 million, with over $450 million realized through December 31, 2024. The remaining savings are expected to be realized in 2025.\nAdditional details are included in Note 14, Restructuring Costs, in the notes to the consolidated financial statements.\nRisk and Insurance Services\nIn the Risk and Insurance Services segment, the Company’s subsidiaries and other affiliated entities act as brokers, agents or consultants for insureds, insurance underwriters and other brokers in the areas of risk management, insurance broking, insurance program management, risk consulting, analytical modeling and alternative risk financing services, primarily under the brand of Marsh, and engage in specialized reinsurance broking expertise, strategic advisory services and analytics solutions, primarily under the brand of Guy Carpenter.\nMarsh and Guy Carpenter are compensated for brokerage and consulting services through commissions and fees. Commission rates and fees vary in amount and can depend on a number of factors, including the type of insurance or reinsurance coverage provided, the particular insurer or reinsurer selected,\n \nand the capacity in which the broker acts and negotiates with clients. Revenues can be affected by premium rate levels in the insurance and reinsurance markets, the amount of risk retained by insurance and reinsurance clients, and by the value of the risks that have been insured since commission-based compensation is frequently related to the premiums paid by insureds and reinsureds. In many cases, fee compensation may be negotiated in advance, based on the type of risk, coverage required, and service provided by the Company and ultimately, the extent of the risk placed into the insurance market or retained by the client. The trends and comparisons of revenue from one period to the next can be affected by changes in premium rate levels, fluctuations in client risk retention and increases or decreases in the value of risks that have been insured, as well as new and lost business, and the volume of business from new and existing clients.\nIn addition to compensation from its clients, Marsh also receives other compensation, separate from retail fees and commissions, from insurance companies. This\n \nother\n \ncompensation includes, among other things, payments for consulting and analytics services provided to insurers; compensation for administrative and other services (including fees for underwriting\n \nservices and services provided to or on behalf of insurers relating to the administration and management of quota shares, panels and other facilities in which insurers participate); and contingent commissions, which are paid by insurers based on factors such as volume or profitability of Marsh's placements, primarily driven by Marsh McLennan Agency (\"MMA\") and parts of Marsh's international operations. \nMarsh and Guy Carpenter receive interest income on certain funds (such as premiums and claims proceeds) held in a fiduciary capacity for others. The investment of fiduciary funds is regulated by state and other insurance authorities. These regulations typically require segregation of fiduciary funds and limit the types of investments that may be made. Interest income from these investments varies depending on the amount of funds invested and \n43\napplicable interest rates, both of which vary from time to time. For presentation purposes, fiduciary interest income is segregated from the other revenues of Marsh and Guy Carpenter and separately presented within the segment, as shown in the previous revenue by segments tables.\nThe results of operations for the Risk and Insurance Services segment are as follows: \n(In millions, except percentages)\n2024\n2023\n2022\nRevenue\n$\n15,395\n$\n14,089\n$\n12,645\nCompensation and benefits \n8,499\n7,702\n7,101\nOther operating expenses\n2,531\n2,442\n2,455\nOperating expenses\n11,030\n10,144\n9,556\nOperating income\n$\n4,365\n$\n3,945\n$\n3,089\nOperating income margin\n28.4\n \n%\n28.0 \n%\n24.4 \n%\nRevenue\nRevenue in the Risk and Insurance Services segment increased $1.3 billion, or 9%, to $15.4 billion in 2024, compared to $14.1 billion in 2023. Revenue increased 8% on an underlying basis and 2% from acquisitions, partially offset by a decrease of 1% from the impact of foreign currency translation. Interest earned on fiduciary funds increased $44 million to $497 million in 2024, compared to $453 million in 2023, due to higher average interest rates compared to the prior year.\nIn Risk and Insurance Services, underlying revenue growth in 2024 was driven by strong retention and new business growth at Marsh and Guy Carpenter. Results also benefited from continued economic growth in most major markets and inflation. \nMarsh's revenue increased $1.2 billion, or 10%, to $12.5 billion in 2024, compared to $11.4 billion in 2023. This reflects an increase of 7% on an underlying basis and 3% from acquisitions, partially offset by a decrease of 1% from the impact of foreign currency translation. U.S./Canada rose 7% on an underlying basis. Total International produced underlying revenue growth of 8%, reflecting growth of 10% in Latin America, 8% in EMEA and 6%\n \nin Asia Pacific.\nGuy Carpenter's revenue \nincreased $104 million\n, or 5%, to $2.4 billion in 2024, compared to $2.3 billion in 2023. This reflects an increase of 8% on an underlying basis, partially offset by a decrease of 3% from acquisitions. \nAt Guy Carpenter, underlying revenue growth in 2024 was driven by growth across all regions and global specialties.  Revenue in 2023 includes a gain from a legal settlement with a competitor for $58 million, excluding legal fees of approximately $10 million. \nRisk and Insurance Services segment completed \n10\n acquisitions in 2024. Information regarding these acquisitions is included in Note 5, Acquisitions and Dispositions, in the notes to the consolidated financial statements.\nOperating Expenses\nExpenses in the Risk and Insurance Services segment increased $886 million, or 9%, to $11.0 billion in 2024, compared to $10.1 billion in 2023. Expenses reflect a 3% increase \nfrom acquisitions, partially offset by a decrease of \n1%\n from the impact of foreign currency translation. \nExpenses in 2024 increased primarily due to compensation and benefits driven by higher base salaries and incentive compensation.\nIn 2024, the Company incurred a total of $148 million of restructuring costs in Risk and Insurance Services, compared to $177 million in 2023, primarily related to activities initiated in the fourth quarter of 2022, focused on workforce actions, rationalization of technology and functional services, and reductions in real estate.\n44\nConsulting\nThe Company conducts business in its Consulting segment through Mercer and Oliver Wyman Group. Mercer delivers advice and technology-driven solutions that help organizations redefine the world of work, reshape retirement and investment outcomes, and unlock health and well-being for a changing workforce. Oliver Wyman Group serves as critical strategic, economic and brand advisor to private sector and governmental clients.\nThe major component of revenue in the Consulting business is fees paid by clients for advice and services. Mercer, principally through its health line of business, also earns revenue in the form of commissions received from insurance companies for the placement of group (and occasionally individual) insurance contracts, primarily life, health and accident coverages. Revenue for Mercer’s investment management business and certain of Mercer’s defined benefit and contribution administration services consists principally of fees based on assets under management or administration. For a majority of the Mercer-managed investment funds, revenue is recorded on a gross basis with sub-advisor fees included in other operating expenses.\nRevenue in the Consulting segment is affected by, among other things, global economic conditions, including changes in clients’ particular industries and markets. Revenue is also affected by competition due to the introduction of new products and services, broad trends in employee demographics, including levels of employment and the effect of government policies and regulations. Revenues from investment management services and retirement trust and administrative services are significantly affected by the level of assets under management or administration, which is impacted by securities market performance.\nThe results of operations for the Consulting segment are as follows: \n(In millions, except percentages)\n2024\n2023\n2022\nRevenue\n$\n9,133\n$\n8,709\n$\n8,139\nCompensation and benefits \n5,358\n5,249\n4,827\nOther operating expenses\n2,005\n1,794\n1,759\nOperating expenses\n7,363\n7,043\n6,586\nOperating income\n$\n1,770\n$\n1,666\n$\n1,553\nOperating income margin\n19.4\n \n%\n19.1 \n%\n19.1 \n%\nRevenue\nConsulting revenue increased $424 million, or 5%, to $9.1 billion in 2024, compared to $8.7 billion in 2023. This reflects an increase of 6% on an underlying basis.\nIn Consulting, underlying revenue growth in 2024 was driven by both Mercer and Oliver Wyman Group.\n \nMercer's revenue increased $156 million, or 3%, to $5.7 billion in 2024, compared to $5.6 billion in 2023. This reflects an increase of 5% on an underlying basis, partially offset by a decrease of \n2% from dispositions and 1% from the impact of foreign currency translation\n. On an underlying basis, revenue increased 8% for Health, and 4% for each of Career and Wealth, as compared to the prior year.\nUnderlying revenue growth at Mercer was driven by continued strong growth in Health and solid growth in Career and Wealth. Health reflected growth across all regions. Wealth growth was driven by both investment management and defined benefits consulting. The increase in investment management was driven by positive net flows and the impact of capital markets. Career revenue benefited from continued strong growth in talent and rewards surveys and products.\nRevenue in 2024 includes a net gain of $35 million from the sale of the Mercer U.K. pension administration and U.S. health and benefits administration businesses.\nOliver Wyman Group's revenue increased $268 million, or 9%, to $3.4 billion in 2024, compared to $3.1 billion in 2023. This reflects an increase of 6% on an underlying basis and 3% from acquisitions.\nThe increase in underlying revenue growth at Oliver Wyman Group in 2024 was primarily driven by the Middle East and Asia. Revenue in 2024 includes a gain of $20 million from the sale of the Celent advisory business. \nThe Consulting segment completed 7 acquisitions in 2024. Information regarding these acquisitions is included in Note 5, Acquisitions and Dispositions, in the notes to the consolidated financial statements.\n45\nOperating Expenses\nIn the Consulting segment, expenses increased $320 million, or 5%, to $7.4 billion in 2024, compared to $7.0 billion in 2023. Expenses reflect a decrease of 1% primarily from dispositions. \nExpenses in 2024 increased primarily due to compensation and benefits driven by higher base salaries and incentive compensation, offset by a decrease from dispositions primarily related to the sale of the Mercer U.K. pension administration and U.S. health and benefits administration businesses. Expenses in 2023 included a benefit of $51 million of insurance and indemnity recoveries for a legacy JLT E&O matter relating to suitability of advice provided to individuals for defined benefit pension transfers in the U.K.\nIn 2024, the Company incurred $79 million of total restructuring costs in the Consulting segment, compared to $62 million in the prior year, primarily related to the Company's activities initiated in the fourth quarter of 2022, focused on workforce actions, rationalization of technology and functional services, and reductions in real estate.\nCorporate and Other\nCorporate expenses decreased $11 million, or 3%, to $318 million in 2024, compared to $329 million in 2023, reflecting primarily lower restructuring costs in the current year. \nInterest Income\nInterest income was $83 million in 2024, compared to $78 million in 2023. Interest income increased $5 million in 2024, due to higher average corporate funds compared to the prior year.\nInterest Expense\nInterest expense was \n$700 million in 2024, compared to $578 million\n \nin 2023. Interest expense increased $122 million in 2024, reflecting higher levels of debt from new debt issuances and higher interest rates compared to the prior year. Interest expense in 2024 includes $26 million of financing costs, primarily related to customary upfront fees for the Commitment Letter. \nInvestment Income \nThe caption \"Investment income\" in the consolidated statements of income comprises realized and unrealized gains and losses from investments. It includes, when applicable, other than temporary declines in the value of securities, mark-to-market increases or decreases in equity investments with readily determinable fair values and equity method gains or losses on its investments in private equity funds. The Company's investments may include direct investments in insurance, consulting or other strategically linked companies and investments in private equity funds. The Company recorded net investment \nincome of $12 million in 2024, compared to $5 million in 2023. The increase in 2024 is primarily driven by higher mark-to-market gains from the Company's investments compared to the prior year.\nIncome and Other Taxes\nThe Company's consolidated effective tax rate for 2024 and 2023 was 24.9% and 24.3%, respectively. \nThe tax rates in both years reflect the impact of discrete tax matters such as excess tax benefits related to share-based compensation, enacted tax legislation, changes in uncertain tax positions, deferred tax adjustments, non-taxable adjustments related to contingent consideration for acquisitions, return to provision adjustments, and valuation allowances for certain tax credits. The 2024 effective tax rate reflects the full impact of the previously enacted change in the U.K. corporate income tax rate from 19% to 25%, which was effective April 1, 2023. The blended U.K. statutory tax rate for 2023 was 23.5%. \nIn 2023, the Company released valuation allowances related to its non-U.S. operations. Management determined that there was sufficient positive evidence to conclude that it was more likely than not that deferred tax assets were realizable, primarily due to the sustained profitability of its operations. The release of valuation allowances resulted in a decrease to tax expense of $94 million in 2023.\nThe effective tax rate may vary significantly from period to period. The effective tax rate is sensitive to the geographic mix of earnings and the cost to repatriate the Company's earnings, which may result in higher or lower effective tax rates. Therefore, a shift in the mix of profits among jurisdictions, or changes in the Company's repatriation strategy to access offshore cash, can affect the effective tax rate. In 2024, pre-tax income in the U.K., Canada, Ireland, India, Bermuda, Germany, Australia, United Arab Emirates, Japan, and Singapore accounted for \n46\napproximately 65% of the Company's total non-U.S. pre-tax income, with effective rates in those countries of 25.0%, 28.0%, 16.3%, 27.9%, 0.0%, 30.9%, 36.7%, 17.6%, 38.2%, and 18.0%, respectively.\nIn addition, losses in certain jurisdictions cannot be offset by earnings from other operations and may require valuation allowances that affect the rate in a particular period, depending on estimates of the value of associated deferred tax assets which can be realized. A valuation allowance was recorded to reduce deferred tax assets to the amount that the Company believes is more likely than not to be realized. Details are provided in Note 7, Income Taxes, in the notes to the consolidated financial statements. The effective tax rate is also sensitive to changes in unrecognized tax benefits, including the impact of settled tax audits and expired statutes of limitations. \nThe Company has established liabilities for uncertain tax positions in relation to potential assessments in the jurisdictions in which it operates. In the third quarter of 2024, the Company received closure notices and assessments from the U.K. tax authority in relation to its 2016-2020 examinations which disallowed certain interest expense deductions. The Company has appealed the assessments and resolving this matter through litigation or alternative dispute resolution may take several years. The Company believes the resolution of tax matters will not have a material effect on the consolidated financial position of the Company. However, an adverse resolution of tax matters from current or future audits or tax litigation could have a material impact on the Company's net income or cash flows and on its effective tax rate in a particular future period.\nChanges in tax laws, rulings, policies, or related legal and regulatory interpretations occur frequently and may have significant favorable or adverse impacts on our effective tax rate. In 2021, the Organization for Economic Cooperation and Development's (\"OECD\") released model rules for a 15% global minimum tax, known as Pillar Two. Pillar Two has now been enacted by most key non-U.S. jurisdictions where the Company operates, including the U.K. and Ireland. This minimum tax is treated as a period cost beginning in 2024 and does not have a material impact on the Company's financial results of operations for the current period. The Company continues to monitor legislative developments, as well as additional guidance from countries that have enacted Pillar Two legislation and will ensure it complies with any changes. \nAs a U.S.-domiciled parent holding company, the Company is the issuer of essentially all of the Company's external indebtedness, and incurs the related interest expense in the U.S. The Company’s interest expense deductions are not currently limited. Further, most senior executive and oversight functions are conducted in the U.S. and the associated costs are incurred primarily in the U.S. Some of these expenses may not be deductible in the U.S., which may impact the effective tax rate.\nChanges to the U.S. tax law in recent years have allowed the Company to repatriate foreign earnings without incurring additional U.S. federal income tax costs as foreign income is generally already taxed in the U.S. However, permanent reinvestment continues to be a component of the Company's global capital strategy. The Company continues to evaluate its global investment and repatriation strategy considering its capital requirements and potential costs of repatriation, which are generally limited to local country withholding taxes.\n47\nLiquidity and Capital Resources\nThe Company is organized as a legal entity separate and distinct from its operating subsidiaries. As the Company does not have significant operations of its own, the Company is dependent upon dividends and other payments from its operating subsidiaries to pay principal and interest on its outstanding debt obligations, pay dividends to shareholders, repurchase its shares and pay corporate expenses. The Company can also provide financial support to its operating subsidiaries for acquisitions, investments and certain parts of their business that require liquidity, such as the capital markets business of Guy Carpenter. Other sources of liquidity include borrowing facilities discussed below in the Financing Cash Flows section.\nThe Company derives a significant portion of its revenue and operating profit from operating subsidiaries located outside of the U.S. Funds from those operating subsidiaries are regularly repatriated to the U.S. out of annual earnings. At December 31, 2024, the Company had approximately $1.4 billion of cash and cash equivalents in its foreign operations, which includes $428 million of operating funds required to be maintained for regulatory requirements or as collateral under certain captive insurance arrangements. The Company expects to continue its practice of repatriating available funds from its non-U.S. operating subsidiaries out of current annual earnings. Where appropriate, a portion of the current year earnings will continue to be permanently reinvested.\nIn 2024, the Company recorded foreign currency translation adjustments which decreased net equity by $569 million. Continued strengthening of the U.S. dollar against foreign currencies would further decrease the translated U.S. dollar value of the Company’s net investments in its non-U.S. subsidiarie\ns, as well as the translated U.S. dollar value of cash repatriations from those subsidiaries.\nCash and cash equivalents on our consolidated balance sheets includes funds available for general corporate purposes. Fiduciary assets are shown separately in the consolidated balance sheets as cash and cash equivalents held in a fiduciary capacity, with a corresponding amount in current liabilities. Fiduciary assets cannot be used for general corporate purposes and should not be considered as a source of liquidity for the Company.\nOperating Cash Flows\nThe Company provided $4.3 billion of cash from operations both in 2024 and in 2023. These amounts reflect the net income of the Company during those periods, excluding gains or losses from investments, adjusted for non-cash charges, and changes in working capital which relate primarily to the timing of payme\nnts of accrued liabilities, including incentive compensation, or receipts of receivables and pension contributions. The Company used cash of $270 million and $271 million related to its restructuring activities in 2024 and 2023, respectively. \nPension Related Items\nContributions\nThe Company's policy for funding its tax-qualified defined benefit plans is to contribute amounts at least sufficient to meet the funding requirements set forth in accordance with applicable law. \nIn 2024, the Company contributed $34 million to its U.S. defined benefit pension plans and $59 million to its non-U.S. defined benefit pension plans. In 2023, the Company contributed $33 million to its U.S. defined benefit pension plans and $78 million to its non-U.S. defined benefit pension plans. \nIn the U.S., contributions to the tax-qualified defined benefit plans are based on Employee Retirement Income Security Act (\"ERISA\") guidelines and the Company generally expects to maintain a funded status of 80% or more of the liability determined in accordance with the ERISA guidelines. In 2024, the Company made contributions of $32 million to its non-qualified plans and expects to contribute approximately $35 million in \n2025\n. The Company also made required contributions of \n$2 million \nto its U.S. qualified plans in 2024. In 2025, the Company is expected to be required to make contributions totaling $2 million to its U.S. qualified plans.\nOutside the U.S., the Company has a large number of non-U.S. defined benefit pension plans, the largest of which are in the U.K., which comprise approximately 78% of non-U.S. plan assets at December 31, 2024. Contribution rates for non-U.S. plans are generally base\nd on local funding practices and statutory requirements, which may differ significantly from measurements in accordance with U.S. GAAP.  \nIn the U.K., the assumptions used to determine pension contributions are the result of legally prescribed negotiations between the Company and the plans' trustee that typically occur every three years in conjunction with the actuarial valuation of the plans. Currently, this results in a lower funded status compared to U.S. GAAP and may result in contributions irrespective of the U.S. GAAP funded status.\n48\nIn 2021, the JLT Pension Scheme was merged into the MMC U.K. Pension Fund with a new segregated JLT section created (referred to as the \"JLT section\").\nThe Company contributed $21 million to its U.K. plans, including the JLT section, in 2024. The Company's contributions to its U.K. plans, including the JLT section, for 2025 are expected to be approximately $1 million. The Company made deficit contributions of $20 million to the JLT section in \n2024 \nand is not required to make any deficit contributions to the JLT section in 2025. \nFor the MMC U.K. Pension Fund, excluding the JLT section, an agreement was reached with the trustee in the fourth quarter of 2022, based on the surplus funding position at December 31, 2021. In accordance with the agreement, no deficit funding is at the earliest required until 2026. The funding level will be re-assessed during 2025 as part of the December 31, 2024 actuarial valuation to determine if contributions are required in 2026. In December 2022, the Company renewed its agreement to support annual deficit contributions that may be required by the U.K. operating companies under certain circumstances, up to £450 million (or $566 million) over a seven-year period. This is part of an agreement which gives the Company greater influence over asset allocation and overall investment decisions.\nThe Company expects to contribute approximately\n $43 million to it\ns non-U.S. defined benefit plans in 2025, comprising approximately of \n$1 million to\n the U.K. plans and $42 million \nto \nplans outside of the U.K. \nChanges in Funded Status and Expense\nThe year-over-year change in the funded status of the Company's pension plans is impacted by the difference between actual and assumed results, particularly with regard to return on assets, and changes in the discount rate, as well as the amount of Company contributions, if any. Unrecognized actuarial losses as of December 31, 2024, were approximately $1.4 billion and $3.5 billion for the U.S. plans and non-U.S. plans, respectively, compared with losses of $1.3 billion and $3.2 billion at December 31, 2023. The increase in the U.S. is primarily due to lower than expected returns on plan assets. The increase in the non-U.S. plans is primarily due to lower than expected returns on plan assets partly offset by increases in the discount rates used to measure plan liabilities and the impact of foreign exchange. In the past several years, the amount of unamortized losses has been significantly impacted, both positively and negatively, by actual asset performance and changes in discount rates. The discount rate used to measure plan liabilities for the Company's U.S. and U.K. plans increased in 2024, decreased in 2023 and increased in 2022. An increase in the discount rate decreases the measured plan benefit obligation, resulting in actuarial gains, while a decrease in the discount rate increases the measured plan obligation, resulting in actuarial losses. In 2024, the Company's defined benefit pension plan assets had gains of\n 2.2% and losses of 5.0% \nin the U.S. and U.K., respectively, as compared to gains of 9.3% and 4.1% in the U.S. and U.K., respectively, in 2023. \nOverall, base\nd on the measurement at December 31, 2024, net benefit credits related to the Company’s defined benefit pension plans are expected to be lower by \n$69 million\n in \n2025\n, compared to \n2024. The decrease is primarily due to lower expected return on assets and higher recognized actuarial loss. \nThe Com\npany’s accounting policies for its defined benefit pension plans, including the selection of and sensitivity to assumptions, are discussed in Management’s Discussion of Critical Accounting Estimates. For additional information regarding the Company’s retirement plans, refer to Note 1, Summary of Significant Accounting Policies, and Note 8, Retirement Benefits, in the notes to the consolidated financial statements. \nFinancing Cash Flows\nNet cash provided by financing activities was $4.5 billion in \n2024\n, compared with $1.1 billion used by financing activities in \n2023\n.\nCredit Facilities\nIn \nOctober 2023\n, the Company increased its multi-currency unsecured five-year revolving credit facility (the \"Credit Facility\") capacity to $3.5 billion from $2.8 billion and extended the expiration to \nOctober 2028\n. The interest rate on the Credit Facility was initially based on LIBOR plus a fixed margin which varied with the Company's credit rating. In the second quarter of 2023, the Credit Facility was amended that borrowings under the Credit Facility bear interest at a rate per annum equal, at the Company's option, either at (a) Securities Overnight Financing Rate (\"SOFR\") benchmark rate for U.S. dollar borrowings, or (b) a currency specific benchmark rate, plus an applicable margin which varies with the Company's credit ratings. The Company is required to maintain certain coverage and leverage ratios for the Credit Facility, which are evaluated quarterly. \n49\nThe Credit Facility includes provisions for determining a benchmark replacement rate in the event existing benchmark rates are no longer available or in certain other circumstances, in which an alternative rate may be required. \nAt December 31, 2024 and 2023, the Company had no borrowings under this facility.\nIn October 2023, the Company terminated its one-year uncommitted revolving credit facility (the \"Uncommitted Credit Facility\"). There were no borrowings outstanding under the Uncommitted Credit Facility at \nDecember 31, 2023\n. \nThe Company also maintains other credit and overdraft facilities with various financial institutions aggregating $123 million at \nDecember 31, 2024\n, and $113 million at December 31, 2023. There were no o\nutstanding borrowings under these facilities at December 31, 2024 and 2023. \nThe Company has outstanding guarantees and letters of credit with various banks aggregating $163 million and $139 million at December 31, 2024 and 2023, respectively.\nDebt\nThe Company has a short-term debt financing program through the issuance of commercial paper. The proceeds from the issuance of commercial paper are used for general corporate purposes. In November 2023, the Company increased its short-term commercial paper financing program (the \"Program\") to $3.5 billion from $2.8 billion. The Company did not have any commercial paper outstanding at December 31, 2024 and 2023. \nIn November 2024, the Company issued $7.25 billion in senior notes as follows:\n•\n$950 million 4.550% senior notes due 2027;\n•\n$1 billion 4.650% senior notes due 2030;\n•\n$1 billion 4.850% senior notes due 2031;\n•\n$2 billion 5.000% senior notes due 2035;\n•\n$500 million 5.350% senior notes due 2044;\n•\n$1.5 billion 5.400% senior notes due 2055; and\n•\n$300 million floating rate senior notes due 2027 (the \"Floating Notes\") \ncollectively referred to as the \"November 2024 Notes\". \nFor the Floating Notes, interest is calculated based on a compounded SOFR benchmark rate plus 0.700%.\nThe Company used the net proceeds from the November 2024 Notes offering to fund, in part, the McGriff Transaction, including the payment of related fees and expenses, as well as for general corporate purposes.\nIn June 2024, the Company repaid $600 million of 3.50% senior notes at maturity.\nIn March 2024, the Company repaid $1 billion of 3.875% senior notes at maturity.\nIn February 2024, the Company issued $500 million of 5.150% senior notes due 2034 and $500 million of 5.450% senior notes due 2054. The Company used the net proceeds from these issuances for general corporate purposes.\nIn October 2023, the Company repaid $250 million of 4.05% senior notes at maturity. \nIn September 2023, the Company issued $600 million of 5.400% senior notes due 2033 and $1 billion of 5.700% senior notes due 2053. In March 2023, the Company issued $600 million of 5.450% senior notes due 2053. The Company used the net proceeds from these issuances for general corporate purposes.\nThe Company's senior debt is currently rated A- by Standard & Poor's (\"S&P\"), A3 by Moody's, and A- by Fitch. The Company's short-term debt is currently rated A-2 by S&P, P-2 by Moody's, and F-2 by Fitch. The Company carries a Stable outlook with S&P, Moody's and Fitch.\nBridge Loan Commitment Letter\nIn connection with the McGriff Transaction, on September 29, 2024, the Company entered into a Commitment Letter to provide the Company with a Bridge Loan Facility. The Company paid approximately $23 million of customary upfront fees related to the Commitment Letter, amortized as interest expense. On November 8, 2024, the Company terminated the Commitment Letter. The Bridge Loan Facility agreement is discussed in more detail in Note 13, Debt, in the notes to the consolidated financial statements.\n50\nShare \nRepurchases\nIn 2024, the Company repurchased 4.3 million shares of its common stock for $900 million. At December 31, 2024, the Company remained authorized by the Board of Directors to repurchase up to approximately $2.3 billion in shares of its common stock. There is no time limit on this author\nization. In 2023, the Company repurchased 6.4 million shares of its common stock for $1.15 billion. \nDividends\nThe Company paid divide\nnds on its common stock shares of $1.5 billion \n($3.05 per share)\n in\n 2024, as compared with $1.3 billion ($2.60 per share) in 2023. \nIn January 2025, the Board of Directors of the Company declared a quarterly dividend of $0.815 per share on outstanding common stock, payable in February 2025.\nContingent Payments Related To Acquisitions\nThe classification of contingent consideration in the consolidated statements of cash flows is dependent upon whether the receipt, payment or adjustment was part of the initial liability established on the acquisition date (financing) or an adjustment to the acquisition date liability (operating). \nThe following amounts are included in the consolidated statements of cash flows as operating and financing activities:\nFor the Years Ended December 31,\n(In millions)\n2024\n2023\n2022\nOperating:\nContingent consideration payments for prior year acquisitions\n$\n(92)\n$\n(41)\n$\n(38)\nReceipt of contingent consideration for dispositions\n—\n \n1 \n— \nAcquisition/disposition related net charges for adjustments\n15\n \n29 \n49 \nAdjustments and payments related to contingent consideration\n$\n(77)\n$\n(11)\n$\n11 \nFinancing:\nContingent consideration for prior year acquisitions\n$\n(74)\n$\n(135)\n$\n(32)\nDeferred consideration for prior year acquisitions \n(39)\n(67)\n(126)\nPayments of deferred and contingent consideration for acquisitions\n$\n(113)\n$\n(202)\n$\n(158)\n  Receipt of contingent consideration for dispositions\n$\n1\n \n$\n2 \n$\n3 \nFor acquisitions completed in 2024, and in prior years, remaining estimated future contingent payments of  $161 million, and deferred consideration payments of $179 million, are recorded in accounts payable and accrued liabilities or other liabilities in the consolidated balance sheets at December 31, 2024.\nDerivatives - Net Investment Hedge\nThe Company has investments in various subsidiaries with Euro functional currencies. As a result, the Company is exposed to the risk of fluctuations between the Euro and U.S. dollar exchange rates. As part of its risk management program, the Company designated its €1.1 billion senior note debt instruments (\"Euro notes\") as a net investment hedge (the \"hedge\") of its Euro denominated subsidiaries. The hedge effectiveness is re-assessed each quarter to confirm that the designated equity balance at the beginning of each period continues to equal or exceed 80% of the outstanding balance of the Euro debt instrument and that all the critical terms of the hedging instrument and the hedged net investment continue to match. If the hedge is highly effective, the change in the debt balance related to foreign exchange fluctuations is recorded in accumulated other comprehensive loss in the consolidated balance sheets. \nThe U.S. dollar value of t\nhe Euro n\notes decreased by $75 million in\n 2024 due to change in foreign exchange rates. The Company conclude\nd that the hedge was highly effective and recorded a decrease to accumulated other comprehensive loss for the year ended \nDecember 31, 2024\n.\nPurchase of remaining non-controlling interest\nIn the second quarter of 2023, the Company purchased the remaining interest in a subsidiary for $139 million.\n51\nFiduciary Liabilities\nSince fiduciary assets are not available for corporate use, fiduciary assets are shown separately in the consolidated balance sheets as cash and cash equivalents held in a fiduciary capacity, with a corresponding amount in current liabilities. Financing cash flows reflect an increase of $411 million in 2024 and a decrease of  $255 million in \n2023\n related to fiduciary liabilities.\nInvesting Cash Flows\nNet cash used for investing ac\ntivities amounted to $8.8 billion in 2024, compared with $1.4 billion used for investing activities in 2023.\nThe Company paid $8.5 billion and $976 million, net of cash, cash equivalents and cash and cash equivalents held in a fiduciary capacity acquired, for \nacquisitions in 2024 and 2023, respectively. The outflow of funds in 2024 related primarily to the acquisition of McGriff, where the Company paid $7.0 billion in cash consideration. The remaining outflow of funds in 2024 related primarily to the acquisitions of Cardano, the Horton Group, and Fisher Brown Bottrell Insurance Inc., for $466 million, $384 million and $321 million, respectively. The outflow of funds in 2023 related primarily to the acquisitions of Honan Insurance Group, Graham Company and Westpac for $358 million, $307 million, and $232 million, respectively. \nIn 2024, the Company received cash proceeds from dispositions of $135 million, partially offset by $46 million primarily related to cash and cash equivalents held in fiduciary capacity in the disposed businesses. The Company sold its Mercer U.K. pension administration and U.S. health and benefits administration businesses on January 1, 2024, for approximately $120 million, comprised of cash proceeds of $30 million and deferred consideration of $90 million. The Company received $78 million of deferred consideration in 2024. \nIn connection with the disposition of Mercer's U.S. affinity business in 2022, the Company transferred to the buyer an additional $24 million of cash and cash equivalents held in a fiduciary capacity in 2023.\nThe Company’s additions to fixed assets and capitalized software, which amounted to $316 million in 2024 and $416 million in 2023, related primarily to software development costs, the refurbishing and modernizing of office facilities, and technology equipment purchases.\nCash used for long-term investments in 2024 is primarily due to an investment in a unit trust fund. At December 31, 2024, the Company has commitments for potential future investments of approximately $117 million in private equity funds that invest primarily in financial services companies.\nCommitments and Obligations\nThe fol\nlowing sets forth the Company’s future contractual obligations by type at December 31, 2024:\nPayment due by Period\n(In millions)\nTotal\nWithin 1 Year\n1-3\nYears\n4-5\nYears\nAfter 5\nYears\nCurrent portion of long-term debt\n$\n519 \n$\n519 \n$\n— \n$\n— \n$\n— \nLong-term debt\n19,594 \n— \n2,463 \n1,545 \n15,586 \nInterest on long-term debt\n13,859 \n879 \n1,761 \n1,590 \n9,629 \nNet operating leases\n2,186 \n382 \n668 \n436 \n700 \nService agreements\n540 \n334 \n157 \n47 \n2 \nOther long-term obligations \n(a)\n429 \n106 \n292 \n29 \n2 \nTotal\n$\n37,127 \n$\n2,220 \n$\n5,341 \n$\n3,647 \n$\n25,919 \n(a)\nPrimarily reflects future payments of deferred and contingent purchase consideration.\nThe table does not include the liability for unrecognized tax benefits of $112 million as the Company is unable to reasonably predict the timing of settlement of these liabilities, other than approximately $54 million that may become payable within one year. The table also does not include the remaining transitional tax payments related to the Tax Cuts and Jobs Act (\"TCJA\") of $48 million, which will be paid in installments from 2025 through 2026. \n52\nManagement’s Discussion of Critical Accounting Estimates\nManagement makes estimates and judgments that affect reported amounts of assets, liabilities, revenue and expenses, and disclosure of contingent assets and liabilities. Management considers the following policies to be critical to understanding the Company’s financial statements because their application places the most significant demands on management’s judgment and requires management to make estimates about the effect of matters that are inherently uncertain. Actual results may differ from those estimates.\nRevenue Recognition\nIn the Risk and Insurance Services segment, management makes judgments related to the amount of variable revenue consideration to ultimately be received on placement of quota share reinsurance treaties and contingent commission from insurers. Management also makes judgments and estimates to measure the progress toward completing performance obligations and realization rates for consideration related to contracts as well as potential performance-based fees in the Consulting segment.\nThe Company capitalizes the incremental costs to obtain contracts primarily related to commissions or sales bonus payments. These deferred costs are amortized over the expected life of the underlying customer relationships. The Company also capitalizes certain pre-placement costs that are considered fulfillment costs that are amortized at a point in time when the associated revenue is recognized.\nRefer to Note 2, Revenue, in the notes to the consolidated financial statements for additional information.\nLegal and Other Loss Contingencies\nThe Company and its subsidiaries are subject to numerous claims, lawsuits and proceedings including claims for errors and omissions (\"E&O\"). The Company records a liability when a loss is both probable and reasonably estimable which requires significant management judgment. The Company utilizes case level reviews by inside and outside counsel, an internal actuarial analysis by Oliver Wyman Group, a subsidiary of the Company, and other methods to estimate potential losses. The liability is reviewed quarterly and adjusted based on claims developments. In many cases, the Company has not recorded a liability, other than for legal fees to defend the claim, because the Company is unable, at present time, to make a determination that a loss is both probable and reasonably estimable. Given the unpredictability of E&O claims and of litigation that could arise from such claims, it is possible that an adverse outcome in a particular matter could have a material adverse effect on the Company’s businesses, results of operations, financial condition or cash flows in a given quarterly or annual period.\nIn addition, to the extent that insurance coverage is available, significant management judgment is required to determine the amount of recoveries that are probable of collection under the Company’s various insurance programs.\nRetirement Benefits\nThe Company maintains qualified and non-qualified defined benefit pension and defined contribution plans for its eligible U.S. employees and a variety of defined benefit and defined contribution plans for its eligible non-U.S. employees. The Company’s policy for funding its tax-qualified defined benefit retirement plans is to contribute amounts at least sufficient to meet the funding requirements set forth in the U.S. and applicable foreign laws.\nThe Company recognizes the funded status of its over-funded defined benefit pension and retiree medical plans as a net benefit plan asset and its unfunded and underfunded plans as a net benefit plan liability. The gains or losses and prior service costs or credits that have not been recognized as components of net benefit (credit) cost are recorded as a component of Accumulated Other Comprehensive Income (\"AOCI\"), net of tax, in the Company’s consolidated balance sheets. The gains and losses that exceed specified corridors in accordance with accounting guidance, of the greater of the projected benefit obligation or the market-related value of plan assets, are amortized prospectively out of AOCI over a period that approximates the remaining life expectancy of participants in plans where substantially all participants are inactive or the average remaining service period of active participants for plans with active participants. The vast majority of unrecognized losses relate to inactive plans and are amortized over the remaining life expectancy of the participants.\nThe determination of net periodic benefit (credit) cost is based on a number of assumptions, including an expected long-term rate of return on plan assets, the discount rate, mortality and assumed rate of salary increase. The assumptions used in the calculation of net periodic benefit (credit) cost and pension liabilities are disclosed in Note 8, Retirement Benefits, in the notes to the consolidated financial statements. \n53\nThe long-term rate of return on plan assets assumption is determined for each plan based on the facts and circumstances that exist as of the measurement date, and the specific portfolio mix of each plan’s assets. The Company utilizes a model developed by Mercer, a subsidiary of the Company, to assist in the determination of this assumption. The model takes into account several factors, including: actual and target portfolio allocation, investment, administrative and trading expenses incurred directly by the plan trust, historical portfolio performance, relevant forward-looking economic analysis, and expected returns, variances and correlations for different asset classes. These measures are used to determine probabilities using standard statistical techniques to calculate a range of expected returns on the portfolio.\nThe target asset allocation for the U.S. plans is 50% equities and equity alternatives and 50% fixed income. At the end of 2024, the actual allocation for the U.S. plans was 51% equities and equity alternatives and 49% fixed income. The target asset allocation for the U.K. plans, which comprise approximately 78% of non-U.S. plan assets, is 12% equities and equity alternatives and 88% fixed income. At the end of 2024, the actual allocation for the U.K. plans was 12% equities and equity alternatives and 88% fixed income. \nThe discount rate selected for each U.S. plan is based on a model bond portfolio with coupons and redemptions that closely match the expected liability cash flows from the plan. Discount rates for non-U.S. plans are based on appropriate bond indices adjusted for duration. In the U.K., the plan duration is reflected using the Mercer yield curve.\nThe following table shows the weighted average assumed rate of return and the discount rate at the December 31, 2024 measurement date used to measure pension expense in 2025 for the total Company, the U.S. and the Rest of World (\"ROW\").\nTotal Company\nU.S.\nROW\nAssumed rate of return on plan assets\n5.43 \n%\n6.50 \n%\n4.92 \n%\nDiscount rate\n5.36 \n%\n5.76 \n%\n5.09 \n%\nHolding all other assumptions constant, a 0.5 percentage point change in the rate of return on plan assets and discount rate assumptions would affect net periodic benefit (credit) cost for the U.S. and U.K. plans, which together comprise approximately 83%\n \nof total pension plan liabilities, as follows:\n0.5 Percentage\nPoint Increase\n0.5 Percentage\nPoint Decrease\n(In millions)\nU.S.\nU.K.\nU.S.\nU.K.\nAssumed rate of return on plan assets\n$\n(23)\n$\n(43)\n$\n23 \n$\n43 \nDiscount rate\n$\n— \n$\n3 \n$\n— \n$\n— \nThe impact of discount rate changes relates to the increase or decrease in actuarial gains or losses being amortized through net periodic benefit (credit) cost, as well as the increase or decrease in interest expense, with all other facts and assumptions held constant. It does not contemplate nor include potential future impacts a change in the interest rate environment and discount rates might cause, such as the impact on the market value of the plans’ assets. In addition, the assumed return on plan assets would likely be impacted by changes in the interest rate environment and other factors, including equity valuations, since these factors reflect the starting point used in the Company’s projection models. For example, a reduction in interest rates may result in a reduction in the assumed return on plan assets. Changing the discount rate and leaving the other assumptions constant, may also not be representative of the impact on expense, because the long-term rates of inflation and salary increases are often correlated with the discount rate. Changes in these assumptions will not necessarily have a linear impact on the net periodic benefit (credit) cost.\nThe Company contributes to certain health care and life insurance benefits provided to its retired employees. The cost of these post-retirement benefits for employees in the U.S. is accrued during the period up to the date employees are eligible to retire but is funded by the Company as incurred. The key assumptions and sensitivity to changes in the assumed health care cost trend rate are discussed in Note 8, Retirement Benefits, in the notes to the consolidated financial statements. \n54\nIncome Taxes\nSignificant judgment is required in determining the annual effective tax rate and in evaluating uncertain tax positions. The Company reports a liability for unrecognized tax benefits resulting from uncertain tax positions taken or expected to be taken in a tax return. The evaluation of a tax position is a two-step process:\n•\nFirst, the Company determines whether it is more-likely-than-not a tax position will be sustained upon tax examination, including resolution of any related appeals or litigation, based on only the technical merits of the position. If a tax position does not meet the more-likely-than-not recognition threshold, the benefit of that position is not recognized in the financial statements. \n•\nThe second step is measurement. A tax position that meets the more-likely-than-not recognition threshold is measured to determine the amount of benefit to recognize in the financial statements. The tax position is measured as the largest amount of benefit that is greater than 50% likely to be realized upon ultimate resolution with a taxing authority. Uncertain tax positions are evaluated based upon the facts and circumstances that exist at each reporting period and involve significant management judgment. Subsequent changes in judgment based upon new information may lead to changes in recognition, de-recognition, and measurement. Adjustments may result, for example, upon resolution of an issue with the taxing authorities, or expiration of a statute of limitations barring an assessment for an issue. \nThe Company recognizes interest and penalties, if any, related to unrecognized tax benefits in income tax expense. The Company’s accounting policy follows the portfolio approach that leaves stranded income tax effects in accumulated other comprehensive income. \nCertain items are included in the Company's tax returns at different times than the items are reflected in the financial statements. As a result, the annual tax expense reflected in the consolidated statements of income is different than that reported in the tax returns. Some of these differences are permanent, such as non-deductible expenses, and some differences are temporary and reverse over time, such as depreciation expense. \nTemporary differences create deferred tax assets and liabilities, which are measured using the enacted tax rates expected to apply to taxable income in the periods in which the deferred tax asset or liability is expected to be settled or realized. Deferred tax liabilities generally represent tax expense recognized in the financial statements for which cash tax payments have been deferred, or expense for which a deduction has been taken already in the tax return but the expense has not yet been recognized in the financial statements. Deferred tax assets generally represent items that can be used as a tax deduction or credit in tax returns in future years for which a benefit has already been recorded in the financial statements. \nThe Company evaluates all significant available positive and negative evidence, including the existence of losses in recent years and its forecast of future taxable income by jurisdiction, in assessing the need for a valuation allowance against deferred tax assets. The Company also considers tax planning strategies that would result in realization of deferred tax assets, and the presence of taxable income in prior period tax filings in jurisdictions that allow for the carry back of tax attributes pursuant to the applicable tax law. The underlying assumptions the Company uses in forecasting future taxable income require significant judgment and take into account the Company's recent performance. The ultimate realization of deferred tax assets is dependent on the generation of future taxable income during the periods in which temporary differences or carry-forwards are deductible or creditable. Valuation allowances are established for deferred tax assets when it is estimated that it is more-likely-than-not that future taxable income will be insufficient to fully use a deduction or credit in that jurisdiction.\nFair Value Determinations\nGoodwill Impairment Testing – The Company is required to assess goodwill and any indefinite-lived intangible assets for impairment annually, or more frequently if circumstances indicate impairment may have occurred. The Company performs the annual impairment assessment for each of its reporting units during the third quarter of each year. The reporting unit level is defined as the same level as the Company's operating segments. In accordance with applicable accounting guidance, a company can assess qualitative factors to determine whether it is necessary to perform a quantitative goodwill impairment test. Alternatively, the Company may elect to proceed directly to the quantitative goodwill impairment test.\n \n55\nIn 2024, the Company performed a qualitative impairment assessment. As part of its assessment, the Company considered numerous factors, including:\n•\nthat the fair value of each reporting unit exceeds its carrying value by a substantial margin based on its most recent quantitative assessment in 2023;\n•\nwhether significant acquisitions or dispositions occurred which might alter the fair value of its reporting units;\n•\nmacroeconomic conditions and their potential impact on reporting unit fair values;\n•\nactual performance compared with budget and prior projections used in its estimation of reporting unit fair values;\n•\nindustry and market conditions; and\n•\nthe year-over-year change in the Company’s share price.\nThe Company completed its qualitative assessment in the third quarter of 2024, updated for significant considerations at year-end, and concluded that goodwill was not impaired.\nPurchase Price Allocation\nAssets acquired and liabilities assumed, including contingent consideration, as part of a business acquisition are generally recorded at their fair value at the date of acquisition. The excess of purchase price over the fair value of assets acquired and liabilities assumed is recorded as goodwill. Determining fair value of identifiable assets, particularly intangibles, and liabilities acquired also requires management to make estimates, which are based on all available information and in some cases assumptions with respect to the timing and amount of future revenues and expenses associated with an asset. These estimates directly impact the amount of identified intangible assets recognized and the related amortization expense in future periods.\nNew Accounting Pronouncements\nNote 1, Summary of Significant Accounting Policies, in the notes to the consolidated financial statements contains a summary of the Company’s significant accounting policies, including a discussion of recently issued accounting pronouncements and their impact or potential future impact on the Company’s financial results, if determinable, under the sub-heading \"New Accounting Pronouncements.\"\n56",
  "item2": null
}