{
  "source_file": "mmm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is designed to provide a reader of 3M’s financial statements with a narrative from the perspective of management. The MD&A should be read in conjunction with 3M's consolidated financial statements and the accompanying notes to the consolidated financial statements. 3M’s MD&A is presented in the following sections:\n•\nOverview\n•\nResults of Operations\n•\nPerformance by Business Segment\n•\nFinancial Condition and Liquidity\n•\nCautionary Note Concerning Factors That May Affect Future Results\nForward-looking statements in Part I, Item 2 may involve risks and uncertainties that could cause results to differ materially from those projected (refer to the section entitled \nCautionary Note Concerning Factors That May Affect Future Results\n in Part I, Item 2 and the risk factors provided in Part II, Item 1A for discussion of these risks and uncertainties).\nOverview\n3M is a diversified global manufacturer, technology innovator and marketer of a wide variety of products and services. As discussed in Note 1, certain changes are reflective in this document for all applicable periods presented. \nAs discussed in Note 2, on April 1, 2024, 3M completed the separation of its Health Care business (the Separation) through a pro rata distribution of 80.1% of the outstanding shares of Solventum Corporation (Solventum) to 3M stockholders. As a result, Solventum became an independent public company, 3M no longer consolidates Solventum into 3M’s financial results and the historical net income of Solventum, and applicable assets and liabilities included in the Separation are reported in 3M's consolidated financial statements as discontinued operations. \n3M manages its continuing operations in three operating business segments: Safety and Industrial; Transportation and Electronics; and Consumer. From a geographic perspective, EMEA refers to Europe, the Middle East, and Africa on a combined basis. \nUnless otherwise noted, any sales change analysis compares the third quarter and the first nine months of 2025 with the corresponding periods in 2024, year-on-year (YoY).\nFinancial highlights for the third quarter and first nine months of 2025:\nThree months ended\nSeptember 30, 2025\nNine months ended\nSeptember 30, 2025\nGAAP\nAdjusted\n1\nGAAP\nAdjusted\n1\nNet sales (millions)\n$\n6,517 \n$\n6,318 \n$\n18,815 \n$\n18,256 \nTotal sales change\n3.5 \n%\n4.1 \n%\n1.3 \n%\n2.4 \n%\nOrganic sales change\n2\n \n2.6 \n%\n3.2 \n%\n1.0 \n%\n2.1 \n%\n1\nThe Company refers to various \"adjusted\" amounts or measures on an “adjusted\" basis. These exclude special items. These non-GAAP measures are further described and reconciled to the most directly comparable GAAP financial measures in the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below.\n2\nOrganic sales change (which includes both organic volume and selling price impacts), is defined as the change in net sales, absent the impacts from foreign currency translation and acquisitions, net of divestitures. 3M believes this information is useful to investors and management in understanding ongoing operations and in analysis of ongoing operating trends.\nNet sales change was driven by strength in safety, general industrial, and electronics, partially offset by known softness in auto aftermarket, while consumer remained soft. Sales change also reflected the YoY impact of the manufactured PFAS products special item. \nThree months ended\nSeptember 30, 2025\nNine months ended\nSeptember 30, 2025\nGAAP\nAdjusted\n1\nGAAP\nAdjusted\n1\nOperating income margin\n22.2 \n%\n24.7 \n%\n20.4 \n%\n24.2 \n%\nYoY change in operating income margin\n1.3 \n ppts\n1.7 \n ppts\n0.3 \n ppts\n2.2 \n ppts\nGAAP operating margins were affected by the YoY impact of special items. These primarily included an increase in net costs for significant litigation impacting operating income from the second quarter 2025 PFAS-related New Jersey Settlement (discussed in Note 17), followed by a decrease in the third quarter resulting from insurance recoveries, a third quarter 2025 charge associated with divestiture activity (discussed in Note 4), and manufactured PFAS products. Both GAAP and adjusted operating margins reflect benefits from growth and productivity (outside of special items), and lower restructuring costs, partially offset by growth investments, as well as gross tariff and foreign currency impacts.\n49\nTable of Contents\nAdditionally, margins YoY were impacted by cost dis-synergies (from the ongoing exit of PFAS manufacturing and second quarter 2024 spin of Solventum), and by transition service agreement reimbursement from Solventum, which began in the second quarter of 2024, and by the lower extent of stock-based compensation grants (see the \nCertain Expenses Impacting Multiple Line Items within Results of Operation \ndiscussion below).\nThree months ended\nSeptember 30, 2025\nNine months ended\nSeptember 30, 2025\nGAAP\nAdjusted\n1\nGAAP\nAdjusted\n1\nEarning per diluted share (EPS)\n$\n1.55 \n$\n2.19 \n$\n4.93 \n$\n6.23 \nYoY change in EPS\n(38)\n%\n10 \n%\n(17)\n%\n11 \n%\nGAAP EPS YoY was negatively affected by the net impact of special items. In addition to items relative to operating income discussed above, this primarily included the YOY impact of the change in value of Solventum ownership and a $795 million pre-tax pension settlement charge in the second quarter 2024 (as discussed in Note 13), partially offset by lower imputed interest associated with obligations resulting from significant litigation. Both GAAP and adjusted EPS reflects benefits from growth and productivity (outside of special items) and lower restructuring costs, a second quarter 2025 gain on the sale of an investment (see the \nIncome from Unconsolidated Subsidiaries, Net of Taxes\n discussion below), and the impact of lower share count. These were partially offset by higher growth investments, gross tariff and foreign currency impacts, and a non-operating interest and pension headwind (apart from pension special item).\nAdditionally, EPS YoY was impacted by cost dis-synergies (from the ongoing exit of PFAS manufacturing and second quarter 2024 spin of Solventum), and by transition service agreement reimbursement from Solventum, which began in the second quarter of 2024, and by the lower extent of stock-based compensation grants. \n3M is progressing toward the exit of PFAS manufacturing by the end of 2025 as discussed Part II, Item 1A, “Risk Factors” of this document. Decisions or circumstances associated with the extent and type of remaining non-PFAS activity at particular locations and impacts on assets and potential obligations, among other factors, could result in additional expenses.\nAdditional information regarding certain items impacting pre-2025 periods that may also be relevant in 2025 can be found in the Overview section of Part II, Item 7 as well as in further sections of 3M’s 2024 Annual Report on Form 10-K.\nResults of Operations\nNet Sales: \nPercent change information compares the three and nine months ended September 30, 2025 and 2024, unless otherwise indicated. Discussion of business segment results is provided in the \nPerformance by Business Segment\n section. Information regarding sales by geographic area is included below.\nThree months ended September 30, 2025\n \nAmericas \nAsia Pacific \nEMEA\nWorldwide \nNet sales (millions)\n$\n3,582 \n$\n1,834 \n$\n1,101 \n$\n6,517 \n% of worldwide sales\n55.0 \n %\n28.1 \n %\n16.9 \n %\n100.0 \n %\nComponents of net sales change:\nOrganic sales\n2\n2.9 \n2.9 \n1.3 \n2.6 \nDivestitures\n3\n(0.1)\n— \n— \n(0.1)\nTranslation\n0.1 \n(0.1)\n5.9 \n1.0 \nTotal sales change\n2.9 \n%\n2.8 \n%\n7.2 \n%\n3.5 \n%\nNine months ended September 30, 2025\nAmericas \nAsia Pacific \nEMEA\nWorldwide \nNet sales (millions)\n$\n10,271 \n$\n5,338 \n$\n3,206 \n$\n18,815 \n% of worldwide sales\n54.6 \n %\n28.4 \n %\n17.0 \n %\n100.0 \n %\nComponents of net sales change:\nOrganic sales\n2\n1.7 \n1.5 \n(2.1)\n1.0 \nDivestitures\n3\n0.4 \n0.1 \n0.2 \n0.3 \nTranslation\n(0.6)\n(0.3)\n2.7 \n— \nTotal sales change\n1.5 \n%\n1.3 \n%\n0.8 \n%\n1.3 \n%\n3\nAcquisition and divestiture sales change impacts are measured separately for the first twelve months post-transaction and, beginning April 2024, include, within divestitures, the impact of commercial agreements associated with the separation of Solventum.\nAdditional information beyond what is included in the preceding tables is as follows:\nThree months ended September 30, 2025\nNine months ended September 30, 2025\nNet sales change by particular country\nTotal sales change\nOrganic sales change\n2\nTotal sales change\nOrganic sales change\n2\nUnited States\n3.4 \n%\n3.6 \n%\n2.2 \n%\n1.6 \n%\nChina/Hong Kong\n9.5 \n9.4 \n6.2 \n6.3 \n50\nTable of Contents\nOperating Expenses:\nThree months ended September 30,\nNine months ended September 30,\n(Percent of net sales)\n2025\n2024\nChange\n2025\n2024\nChange\nCost of sales \n58.2\n \n%\n57.9 \n%\n0.3\n \n%\n58.0\n \n%\n57.7 \n%\n0.3\n \n%\nSelling, general and administrative expenses (SG&A) \n12.5\n \n16.9 \n(4.4)\n16.1\n \n17.9 \n(1.8)\nResearch, development and related expenses (R&D)\n4.6\n \n4.3 \n0.3\n \n4.6\n \n4.3 \n0.3\n \nLoss on business divestitures\n2.5\n \n— \n2.5\n \n0.9\n \n— \n0.9\n \nOperating income margin\n22.2\n \n%\n20.9 \n%\n1.3\n \n%\n20.4\n \n%\n20.1 \n%\n0.3\n \n%\nCost of Sales \nmeasured as a percent of sales:\n \nIncreases in the third quarter and first nine months of 2025 were primarily due to foreign currency impacts; tariffs, and the exit of manufactured PFAS products partially, offset by ongoing procurement and logistics savings. Additionally, cost of sales YoY for the nine months ended September 30, 2025, was impacted by cost dis-synergies (from the ongoing exit of PFAS manufacturing and second quarter 2024 spin of Solventum). See also\n Certain Expenses Impacting Multiple Line Items within Results of Operations \nsubsection further below.\nSG&A \nmeasured as a percent of sales:\n \nDecreases in the third quarter and first nine months of 2025 were primarily impacted by benefits from insurance recoveries in the second and third quarter of 2025, along with lower YoY restructuring charges. These were partially offset by net costs for significant litigation impacting operating income from the second quarter 2025 PFAS-related New Jersey Settlement. Additionally, SG&A YoY for the three and nine months ended September 30, 2025, was impacted by the transition service agreement reimbursement, and cost dis-synergies (from the ongoing exit of PFAS manufacturing and second quarter 2024 spin of Solventum). See also\n Certain Expenses Impacting Multiple Line Items within Results of Operations \nsubsection further below.\nR&D \nmeasured as a percent of sales: \n3M continues to invest in a range of R&D activities from application development, product and manufacturing support, product development and technology development aimed at disruptive innovations. See also\n Certain Expenses Impacting Multiple Line Items within Results of Operations \nsubsection further below. \nLoss on Business Divestitures \nmeasured as a percent of sales\n: \nApplicable information on 2025 items is discussed in Note 4, including a write-down for a business classified as held for sale in the third quarter. \nOther Expense (Income), Net: \nInterest expense (net of interest income):\n increased in the third quarter and decreased in the first nine months of 2025, compared to the same periods YoY.\n•\nThe increase in the third quarter was driven by lower interest income due to decreased cash, while both periods were impacted by reduced imputed interest associated with obligations resulting from significant litigation (discussed in Note 17), and debt maturities. \nNon-service pension and postretirement net period cost (benefit):\n increased by approximately $13 million in the third quarter of 2025 and decreased $721 million in the first nine months of 2025, compared to the same periods YoY. \n•\nThis change was largely due to the $795 million pension settlement charge in the second quarter of 2024, which occurred as a result of transferring a portion of U.S. pension payment obligations and related plan assets to an insurance company (see Note 13). See also\n Certain Expenses Impacting Multiple Line Items within Results of Operations \nsubsection further below. \nSolventum ownership - change in value:\n decreased by approximately $675 million in the third quarter of 2025 and $1,452 million in the first nine months of 2025, compared to the same periods YoY.\nProvision for Income Taxes:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(Percent of pre-tax income)\n2025\n2024\n2025\n2024\nEffective tax rate \n26.8\n \n%\n20.3 \n%\n23.7\n \n%\n19.0 \n%\nAdjusted effective tax rate\n1\n19.9\n \n20.5 \n20.5\n \n20.1 \nThe primary factors that increased the Company's effective tax rate for the three months ended September 30, 2025, when compared to 2024, were the tax impacts of: 3M's retained ownership interest in Solventum, Pillar Two Model Rules, and the loss on business divestiture, partially offset by net costs of significant litigation. The primary factors that increased the Company's effective tax rate for the nine months ended September 30, 2025, when compared to 2024, were the tax impact of: 3M's retained ownership interest in Solventum and Pillar Two Model Rules, partially offset by net costs of significant litigation.\n51\nTable of Contents\nIncome from Unconsolidated Subsidiaries, Net of Taxes:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(Millions)\n2025\n2024\n2025\n2024\nIncome from unconsolidated subsidiaries, net of taxes\n$\n2\n$\n3\n$\n51\n$\n7\nIncome from unconsolidated subsidiaries, net of taxes, is attributable to the Company’s accounting under the equity method for ownership interests in certain entities. In the second quarter of 2025, 3M sold its interest in one of these investments, resulting in a pre-tax gain of $47 million. Because this was an ownership disposition, the impact of taxes thereon was reflected separately in provision for income taxes.\nNet Income Attributable to Noncontrolling Interest:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n(Millions)\n2025\n \n2024\n2025\n2024\nNet income attributable to noncontrolling interest \n$\n7\n \n$\n4 \n$\n15\n \n$\n15 \nNet income attributable to noncontrolling interest represents the elimination of the income or loss attributable to non-3M ownership interests in 3M consolidated entities. The primary noncontrolling interest relates to 3M India Limited, of which 3M’s effective ownership is 75 percent.\nCertain Expenses Impacting Multiple Line Items within Results of Operations:\nStock compensation is discussed in Note 18 and impacts cost of sales, SG&A, and R&D. YoY stock compensation expense was impacted by the lower extent of the 2025 annual grant.\nPre-tax defined benefit pension and postretirement service cost expense impacts cost of sales, SG&A, and R&D while the non-service cost component of pension and postretirement benefits impacts the other expense (income), net line item. Refer to Note 13 for additional information.\nOn a continuing operations basis, pre-tax stock compensation expense and defined benefit pension and postretirement expense for the periods presented were the following:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nPre-tax amounts (millions)\n2025\n2024\n2025\n2024\nStock compensation expense\n$\n53\n \n$\n41 \n$\n182\n \n$\n221 \nDefined benefit pension and postretirement benefit expense\nService cost\n$\n43\n \n$\n48 \n$\n127\n \n$\n148 \nNon-service cost (benefit)\n20\n \n7 \n71\n \n792 \nTotal defined pension and postretirement expense\n$\n63\n \n$\n55 \n$\n198\n \n$\n940 \nIn the second quarter of 2024, 3M recorded a non-cash pension settlement charge, part of non-service cost above, as a result of transferring a portion of its U.S. pension payment obligations and related plan assets to an insurance company (as discussed in Note 13). \nThe Company continues to make investments in the implementation of new business systems and solutions, including enterprise resource planning, with the amortization relating to these investments impacting cost of sales, SG&A, and R&D.\n52\nTable of Contents\nPerformance by Business Segment\nDisclosures relating to 3M’s business segments are provided in Note 19. 3M manages its continuing operations in three business segments. The reportable segments are Safety and Industrial; Transportation and Electronics; and Consumer.\nSafety and Industrial Business:\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nSales (millions) \n$\n2,917\n \n$\n2,767\n$\n8,519\n$\n8,258\nSales change analysis:\nOrganic sales\n2\n4.1\n \n %\n \n3.1\n \n %\n \nTranslation\n1.3\n \n0.1\nTotal sales change\n5.4\n \n %\n \n3.2\n \n %\nBusiness segment operating income (millions)\n$\n754\n \n$\n650\n$\n2,171\n$\n1,919\nPercent change\n16.0\n \n%\n13.2\n \n%\nPercent of sales\n25.9\n \n%\n23.5 %\n25.5\n \n%\n23.2 %\nThird quarter 2025 results: \nSales in Safety and Industrial were up 5.4 percent in U.S. dollars. \nOn an organic sales basis:\n•\nSales increased in electrical markets, industrial adhesives and tapes, personal safety, abrasives and industrial specialties, and decreased in roofing granules and automotive aftermarket.\n•\nCommercial excellence helped drive growth, partially offset by continued softness in automotive aftermarket and emerging weakness in roofing granules.\nBusiness segment operating income margins increased YoY driven by benefits from growth, productivity, and lower restructuring costs. These benefits were partially offset by continued growth investments in the business, and cost dis-synergies from the ongoing exit of PFAS manufacturing. \nAdjusting for special item net costs for significant litigation (non-GAAP measure) related to respirator mask/asbestos, business segment operating income margins increased YoY from 24.3 percent to 26.3 percent. Refer to the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below for additional details.\nFirst nine months 2025 results: \nSales in Safety and Industrial were up 3.2 percent in U.S. dollars. \nOn an organic sales basis:\n•\nSales increased in electrical markets, industrial adhesives and tapes, personal safety, abrasives and industrial specialties, and decreased in automotive aftermarket and roofing granules. \n•\nGrowth primarily came from demand in key underlying markets, partially offset by challenges in automotive aftermarket. \nBusiness segment operating income margins increased year-on-year primarily driven by benefits from growth, productivity and lower restructuring costs. These benefits were partially offset by continued growth investments in the business and cost dis-synergies due to the 2024 spin of Solventum and ongoing exit of PFAS manufacturing. \nAdjusting for special item costs for significant litigation (non-GAAP measure) related to respirator mask/asbestos, business segment operating income margins increased YoY from 23.7 percent to 25.9 percent. Refer to the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below for additional details. \n53\nTable of Contents\nTransportation and Electronics Business\n:\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nSales (millions) \n$\n2,191\n$\n2,139\n$\n6,311\n$\n6,386\nSales change analysis:\nOrganic sales\n2\n1.8\n \n %\n(1.2)\n %\nDivestitures\n3\n(0.3)\n(0.1)\nTranslation \n0.9\n \n0.1\n \nTotal sales change \n2.4\n \n %\n(1.2)\n %\nBusiness segment operating income (millions) \n$\n482\n \n$\n436 \n$\n1,296\n \n$\n1,345 \nPercent change \n10.7\n \n %\n(3.6)\n %\nPercent of sales \n22.0\n \n %\n20.4 \n %\n20.5\n \n %\n21.1 \n %\nThird quarter 2025 results: \nSales in Transportation and Electronics were up 2.4 percent in U.S. dollars. \nOn an organic sales basis:\n•\nSales increased in commercial branding and transportation, electronics and automotive and aerospace, and decreased in advanced materials. \n•\nThe main drivers of growth were double digit growth in aerospace, continued momentum in the electronics business, and improvement in automotive after a down first half. Growth was negatively impacted by headwinds related to PFAS manufactured products. \nDivestitures: \n•\n Impact relates to the lost sales year-on-year from a divestiture discussed in Note 4.\nBusiness segment operating income margins increased YoY driven by benefits from growth, productivity, and lower restructuring costs. These benefits were partially offset by continued growth investments in the business, and cost dis-synergies from the ongoing exit of PFAS manufacturing.\nAdjusting for special item PFAS manufactured products (non-GAAP measure), sales of $1,992 million were up 4.2 percent YoY in U.S. dollars, or up 3.6 percent organically; while business segment operating income margins decreased YoY from 24.5 percent to 24.3 percent. Refer to the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below for additional details.\nFirst nine months 2025 results: \nSales in Transportation and Electronics were down 1.2 percent in U.S. dollars.\nOn an organic sales basis:\n•\nSales increased in commercial branding and transportation, and decreased in advanced materials, automotive and aerospace, and electronics.\n•\nGrowth was negatively impacted by headwinds related to PFAS manufactured products, the automotive OEM business, and commercial vehicles. This was partially offset by high single digit growth in aerospace and strength in commercial branding and transportation.\nDivestitures: \n•\n Impact relates to the lost sales year-on-year from a divestiture discussed in Note 4.\nBusiness segment operating income margins decreased YoY due to challenging comparison against last year's strong share gains from spec-in wins and new product introductions in automotive and consumer electronics, continued growth investments in the business, and cost dis-synergies due to the 2024 spin of Solventum and ongoing exit of PFAS manufacturing, partially offset by benefits from growth, productivity and lower restructuring costs. \nAdjusted for special item PFAS manufacturing products (non-GAAP measure), sales of $5,752 million were up 1.9 percent YoY in U.S. dollars, or up 1.9 percent organically; while business segment operating income margins decreased YoY from 24.4 percent to 23.5 percent. Refer to the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below for additional details.\n54\nTable of Contents\nConsumer Business:\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nSales (millions) \n$\n1,312\n$\n1,299\n$\n3,706\n$\n3,702\nSales change analysis:\nOrganic sales\n2\n0.3\n \n %\n0.3\n \n %\nTranslation \n0.6\n \n \n(0.2)\nTotal sales change \n0.9\n \n %\n0.1\n \n %\nBusiness segment operating income (millions) \n$\n291\n \n$\n263 \n$\n778\n \n$\n698 \nPercent change \n11.0\n \n%\n11.5\n \n %\nPercent of sales \n22.2\n \n %\n20.2 \n %\n21.0\n \n %\n18.9 \n %\nThird quarter 2025 results: \nSales in Consumer were up 0.9 percent in U.S. dollars.\nOn an organic sales basis: \n•\nSales increased in home and auto care and consumer safety and well-being, and decreased in packaging and expression and home improvement.\n•\nGrowth driven by strong demand for Filtrete™ filters, Scotch™ tape, and Meguiar's® products supported by new product launches, service improvements, and increased investment in advertising and merchandising; partially offset by soft consumer discretionary spending.\nBusiness segment operating income margins increased YoY driven by benefits from growth and productivity partially offset by continued growth investments in the business, and cost dis-synergies from the ongoing exit of PFAS manufacturing. \nFirst nine months 2025 results: \nSales in Consumer were up 0.1 percent in U.S. dollars.\nOn an organic sales basis: \n•\nSales increased in consumer safety and well-being and home and auto care, grew slightly in home improvement, and decreased in packaging and expression.\n•\nGrowth driven by new product launches, service improvements, and increased advertising and merchandising investment; partially offset by soft consumer discretionary spending.\nBusiness segment operating income margins increased YoY driven by benefits from growth, productivity, and lower restructuring costs partially offset by continued growth investments in the business and cost dis-synergies due to the 2024 spin of Solventum and ongoing exit of PFAS manufacturing. \nCorporate and Other: \nOutside of 3M's reportable operating segments, 3M has Corporate and Other which is not a reportable business segment as it does not meet the segment reporting criteria. Because Corporate and Other includes a variety of miscellaneous items, it is subject to fluctuation on a quarterly and annual basis. Corporate and Other is further described in Note 19.\nRefer to the \nCertain amounts adjusted for special items - (non-GAAP measures)\n section below and Note 19 for details on the components of corporate special items and their impact. Other corporate operating income, net, increased YoY in the third quarter and first nine months of 2025, primarily due to the extent of transition arrangement income from divested businesses (and associated costs) largely related to Solventum's April 2024 Separation as well as the extent of non-discontinued operations-eligible former Solventum-allocated costs included in Corporate and Other prior to the Separation.\n55\nTable of Contents\nCertain amounts adjusted for special items - (non-GAAP measures)\nIn addition to reporting financial results in accordance with U.S. GAAP, 3M also provides certain non-GAAP measures. These measures are not in accordance with, nor are they a substitute for GAAP measures, and may not be comparable to similarly titled measures used by other companies.\nCertain measures adjust for the impacts of special items. Special items for the periods presented include the items described in the section entitled “Description of special items”. Because 3M provides certain information with respect to business segments, it is noteworthy that special items impacting operating income (loss) are reflected in Corporate and Other, except as described with respect to net costs for significant litigation and manufactured PFAS products items in the “Description of special items” section. The reconciliations below, therefore, also include impacted segments as applicable.\nThis document contains measures for which 3M provides the reported GAAP measure and a non-GAAP measure adjusted for special items. The document also contains additional measures which are not defined under U.S. GAAP. These measures and reasons 3M believes they are useful to investors (and, as applicable, used by 3M) include:\nGAAP amounts for which a measure adjusted for special items is also provided:\nReasons 3M believes the measure is useful\n•\nNet sales (and sales change)\nConsidered, in addition to segment operating performance, in evaluating and managing operations; useful in understanding underlying business performance, provides additional transparency to special items\n•\nOperating income (loss), segment operating income (loss) and operating income (loss) margin\n•\nIncome from continuing operations before taxes\n•\nProvision for income taxes and effective tax rate\n•\nNet income from continuing operations \n•\nEPS from continuing operations\nSpecial items for the periods presented include:\nNet costs for significant litigation:\n•\nThese relate to 3M's respirator mask/asbestos (which include Aearo and non-Aearo items), PFAS-related other environmental, and Combat Arms Earplugs matters (as discussed in Note 17). Net costs include the impacts of changes in accrued liabilities (including interest imputation on applicable settlement obligations), legal costs, and insurance recoveries, along with the associated tax impacts. Associated tax impacts of significant litigation include impacts on Foreign Derived Intangible Income (FDII), Global Intangible Low Taxed Income (GILTI), foreign tax credits, and tax costs of repatriation. 3M does not consider the elements of the net costs associated with these matters to be normal, operating expenses related to the Company’s ongoing operations, revenue generating activities, business strategy, industry, and regulatory environment. Net costs related to respirator mask/asbestos are reflected as special items in the Safety and Industrial business segment while those impacting operating income (loss) associated with PFAS-related other environmental and Combat Arms Earplugs matters are reflected as corporate special items in Corporate and Other. \nLoss on business divestitures: \n•\nIn the third quarter of 2025, 3M reflected a write-down for a business classified as held for sale. In second quarter of 2025, 3M completed a divestiture for immaterial proceeds slightly below the business's book value. See Note 4 for additional information. \nDivestiture costs:\n•\nThese include certain limited costs that were not eligible to be included within discontinued operations related to separating and divesting substantially an entire business segment of 3M following public announcement of its intended divestiture. As a result of completion of the April 2024 separation of Solventum, this includes the tax cost of updating 3M’s previous indefinite reinvestment plans on past unrepatriated earnings through the period of the Separation’s close and to tax positions retained by 3M. \nManufactured PFAS products:\n•\nThese amounts relate to sales and estimates of income (loss) regarding manufactured PFAS products that 3M plans to exit by the end of 2025 included within the Transportation and Electronics business segment. Estimated income does not contemplate impacts on non-operating items such as net interest income/expense and the non-service cost components portion of defined benefit plan net periodic benefit costs.\nPension risk transfer charge:\n•\nIn the second quarter of 2024, 3M recorded a non-cash pension settlement charge reflected in other expense (income), net as a result of transferring a portion of its U.S. pension payment obligations and related plan assets to an insurance company (as discussed in Note 13).\n56\nTable of Contents\nSolventum ownership - change in value: \n•\nThis amount relates to the change in value of 3M's retained ownership interest in Solventum common stock reflected in other expense (income), net. \nTransformation costs: \n•\nThese represent net costs associated with 3M's transformation program, intended as a structural redesign of longer-term manufacturing, distribution, and business process services and locations. Accordingly, 3M does not consider the nature or effect of this program to be normal, operating expenses related to the Company’s ongoing operations, revenue generating activities, and day-to-day business strategy. Net costs include restructuring and other related items such as site closure, sale, moving and set-up, accelerated depreciation, and program management.\n \nThree months ended September 30, 2024\n Amounts from continuing operations\n(Dollars in millions, except per share amounts)\nNet sales\nOperating income\nOperating income margin\nIncome before taxes\nProvision for income taxes\nEffective tax rate\nNet income attributable to 3M\nEPS\nSafety and Industrial\nGAAP amounts\n$\n650 \n23.5 \n%\nAdjustments for special items:\nNet costs for significant litigation\n22 \nAdjusted amounts (non-GAAP measures)\n$\n672 \n24.3 \n%\nTransportation and Electronics\nGAAP amounts\n$\n2,139 \n$\n436 \n20.4 \n%\nAdjustments for special items:\nManufactured PFAS products\n(226)\n34 \nAdjusted amounts (non-GAAP measures)\n$\n1,913 \n$\n470 \n24.5 \n%\nTotal company\nGAAP amounts\n$\n6,294 \n$\n1,316 \n20.9 \n%\n$\n1,721 \n$\n348 \n20.3 \n%\n$\n1,372 \n$\n2.48 \nAdjustments for special items:\nNet costs for significant litigation\n— \n47 \n204 \n(75)\n279 \n0.51 \nManufactured PFAS products\n(226)\n34 \n34 \n9 \n25 \n0.04 \nSolventum ownership - change in value\n— \n— \n(581)\n— \n(581)\n(1.05)\nTotal special items\n(226)\n81 \n(343)\n(66)\n(277)\n(0.50)\nAdjusted amounts (non-GAAP measures)\n$\n6,068 \n$\n1,397 \n23.0 \n%\n$\n1,378 \n$\n282 \n20.5 \n%\n$\n1,095 \n$\n1.98 \nThree months ended September 30, 2025\n Amounts from continuing operations\n(Dollars in millions, except per share amounts)\nNet sales\nSales change\nOperating income\nOperating income margin\nIncome before taxes\nProvision for income taxes\nEffective tax rate\nNet income attributable to 3M\nEPS\nEPS percent change\nSafety and Industrial\nGAAP amounts\n$\n754\n \n25.9\n \n%\nAdjustments for special items:\nNet costs for significant litigation\n13\n \nAdjusted amounts (non-GAAP measures)\n$\n767\n \n26.3\n \n%\nTransportation and Electronics\nGAAP amounts\n$\n2,191\n \n2.4\n \n%\n$\n482\n \n22.0\n \n%\nAdjustments for special items:\nManufactured PFAS products\n(199)\n2\n \nAdjusted amounts (non-GAAP measures)\n$\n1,992\n \n4.2\n \n%\n$\n484\n \n24.3\n \n%\nTotal company\nGAAP amounts\n$\n6,517\n \n3.5\n \n%\n$\n1,447\n \n22.2\n \n%\n$\n1,147\n \n$\n308\n \n26.8\n \n%\n$\n834\n \n$\n1.55\n \n(38)\n%\nAdjustments for special items:\nNet costs for significant litigation\n—\n \n(65)\n56\n \n(45)\n101\n \n0.19\n \nLoss on business divestitures\n—\n \n161\n \n161\n \n2\n \n159\n \n0.30\n \nManufactured PFAS products\n(199)\n2\n \n2\n \n1\n \n1\n \n—\n \nSolventum ownership - change in value\n—\n \n—\n \n94\n \n23\n \n71\n \n0.13\n \nTransformation costs\n—\n \n14\n \n14\n \n3\n \n11\n \n0.02\n \nTotal special items\n(199)\n112\n \n327\n \n(16)\n343\n \n0.64\n \nAdjusted amounts (non-GAAP measures)\n$\n6,318\n \n4.1\n \n%\n$\n1,559\n \n24.7\n \n%\n$\n1,474\n \n$\n292\n \n19.9\n \n%\n$\n1,177\n \n$\n2.19\n \n10\n \n %\n57\nTable of Contents\nThree months ended September 30, 2025\nSales Change \nOrganic sales\nAcquisitions\nDivestitures\nTranslation\nTotal sales change\nTotal company\n2.6 \n%\n— \n%\n(0.1)\n%\n1.0 \n%\n3.5 \n%\nRemove manufactured PFAS products special item impact\n0.6 \n— \n— \n— \n0.6 \nAdjusted total company (non-GAAP measures)\n \n3.2 \n%\n— \n%\n(0.1)\n%\n1.0 \n%\n4.1 \n%\nTransportation and Electronics\n1.8 \n%\n— \n%\n(0.3)\n%\n0.9 \n%\n2.4 \n%\nRemove manufactured PFAS products special item impact\n1.8 \n— \n— \n— \n1.8 \nAdjusted Transportation and Electronics (non-GAAP measures)\n3.6 \n%\n— \n%\n(0.3)\n%\n0.9 \n%\n4.2 \n%\nNine months ended September 30, 2024\n Amounts from continuing operations\n(Dollars in millions, except per share amounts)\nNet sales\nOperating income\nOperating income margin\nIncome before taxes\nProvision for income taxes\nEffective tax rate\nNet income attributable to 3M\nEPS\nSafety and Industrial\nGAAP amounts\n$\n1,919 \n23.2 \n%\nAdjustments for special items:\nNet costs for significant litigation\n40 \nAdjusted amounts (non-GAAP measures)\n$\n1,959 \n23.7 \n%\nTransportation and Electronics\nGAAP amounts\n$\n6,386 \n$\n1,345 \n21.1 \n%\nAdjustments for special items:\nManufactured PFAS products\n(743)\n30 \nAdjusted amounts (non-GAAP measures)\n$\n5,643 \n$\n1,375 \n24.4 \n%\nTotal Company\nGAAP amounts\n$\n18,565 \n$\n3,737 \n20.1 \n%\n$\n4,060 \n$\n771 \n19.0 \n%\n$\n3,281 \n$\n5.92 \nAdjustments for special items:\nNet costs for significant litigation\n— \n136 \n699 \n(69)\n768 \n1.39 \nDivestiture costs\n— \n20 \n20 \n(111)\n131 \n0.24 \nManufactured PFAS products\n(743)\n30 \n30 \n7 \n23 \n0.04 \nPension risk transfer charge\n— \n— \n795 \n188 \n607 \n1.09 \nSolventum ownership - change in value\n— \n— \n(1,694)\n— \n(1,694)\n(3.06)\nTotal special items\n(743)\n186 \n(150)\n15 \n(165)\n(0.30)\nAdjusted amounts (non-GAAP measures)\n$\n17,822 \n$\n3,923 \n22.0 \n%\n$\n3,910 \n$\n786 \n20.1 \n%\n$\n3,116 \n$\n5.62 \nNine months ended September 30, 2025\n Amounts from continuing operations\n(Dollars in millions, except per share amounts)\nNet sales\nSales change\nOperating income\nOperating income margin\nIncome before taxes\nProvision for income taxes\nEffective tax rate\nNet income attributable to 3M\nEPS\nEPS percent change\nSafety and Industrial\nGAAP amounts\n$\n2,171\n \n25.5\n \n%\nAdjustments for special items:\nNet costs for significant litigation\n33\n \nAdjusted amounts (non-GAAP measures)\n$\n2,204\n \n25.9\n \n%\nTransportation and Electronics\nGAAP amounts\n$\n6,311\n \n(1.2)\n%\n$\n1,296\n \n20.5\n \n%\nAdjustments for special items:\nManufactured PFAS products\n(559)\n57\n \nAdjusted amounts (non-GAAP measures)\n$\n5,752\n \n1.9\n \n%\n$\n1,353\n \n23.5\n \n%\nTotal Company\nGAAP amounts\n$\n18,815\n \n1.3\n \n%\n$\n3,833\n \n20.4\n \n%\n$\n3,455\n \n$\n818\n \n23.7\n \n%\n$\n2,673\n \n$\n4.93\n \n(17)\n%\nAdjustments for special items:\nNet costs for significant litigation\n—\n \n356\n \n751\n \n(1)\n752\n \n1.39\n \nLoss on business divestitures\n—\n \n164\n \n164\n \n3\n \n161\n \n0.30\n \nManufactured PFAS products\n(559)\n57\n \n57\n \n14\n \n43\n \n0.08\n \nSolventum ownership - change in value\n—\n \n—\n \n(242)\n23\n \n(265)\n(0.49)\nTransformation costs\n—\n \n14\n \n14\n \n3\n \n11\n \n0.02\n \nTotal special items\n(559)\n591\n \n744\n \n42\n \n702\n \n1.30\n \nAdjusted amounts (non-GAAP measures)\n$\n18,256\n \n2.4\n \n%\n$\n4,424\n \n24.2\n \n%\n$\n4,199\n \n$\n860\n \n20.5\n \n%\n$\n3,375\n \n$\n6.23\n \n11\n \n %\n58\nTable of Contents\nNine months ended September 30, 2025\nSales Change\nOrganic sales\nAcquisitions\nDivestitures\nTranslation\nTotal sales change\nTotal Company\n1.0\n \n%\n—\n \n%\n0.3\n \n%\n—\n \n%\n1.3\n \n%\nRemove manufactured PFAS products special item impact\n1.1\n \n—\n \n—\n \n—\n \n1.1\n \nAdjusted total Company (non-GAAP measures)\n2.1\n \n%\n—\n \n%\n0.3\n \n%\n—\n \n%\n2.4\n \n%\nTransportation and Electronics\n(1.2)\n%\n—\n \n%\n(0.1)\n%\n0.1\n \n%\n(1.2)\n%\nRemove manufactured PFAS products special item impact\n3.1\n \n—\n \n—\n \n—\n \n3.1\n \nAdjusted Transportation and Electronics (non-GAAP measures)\n1.9\n \n%\n—\n \n%\n(0.1)\n%\n0.1\n \n%\n1.9\n \n%\nFinancial Condition and Liquidity\nThe strength and stability of 3M’s business model and strong free cash flow capability, together with proven capital markets access, provide financial flexibility to deploy capital in accordance with the Company's stated priorities and meet needs associated with contractual commitments and other obligations. Investing in 3M’s business to drive organic growth and deliver strong returns on invested capital remains the first priority for capital deployment. This includes research and development, capital expenditures, and commercialization capability. The Company also continues to actively manage its portfolio through acquisitions and divestitures to maximize value for shareholders. 3M expects to continue returning cash to shareholders through dividends and share repurchases. To fund cash needs in the United States, the Company relies on ongoing cash flow from U.S. operations, access to capital markets and repatriation of the earnings of its foreign affiliates that are not considered to be permanently reinvested. For those international earnings considered to be reinvested indefinitely, the Company currently has no plans or intentions to repatriate these funds for U.S. operations. \n3M maintains a strong liquidity profile. The Company’s primary short-term liquidity needs are met through cash on hand and U.S. commercial paper issuances. 3M believes it will have continuous access to the commercial paper market. 3M’s commercial paper program permits the Company to have a maximum of $5 billion outstanding with a maximum maturity of 397 days from date of issuance. The Company had no commercial paper outstanding as of September 30, 2025 and December 31, 2024.\nTotal debt: \nThe strength of 3M’s credit profile and significant ongoing cash flows provide 3M proven access to capital markets. Additionally, the Company’s debt maturity profile is staggered to help ensure refinancing needs in any given year are reasonable in proportion to the total portfolio. As of the date of this report, 3M has a credit rating of A3, stable outlook from Moody's Investors Service, a credit rating of BBB+, stable outlook from S&P Global Ratings, and a credit rating of A-, stable outlook from Fitch Ratings.\nThe Company’s total debt at September 30, 2025, decreased when compared to December 31, 2024, due to debt maturities with an aggregate principal amount of $1.8 billion, partially offset by the issuance of $1.1 billion in aggregate principal amount of debt, and a $0.2 billion impact from foreign currency remeasurement. For discussion of repayments of and proceeds from debt refer to the following \nCash Flows from Financing Activities\n section. \nEffective February 8, 2023, the Company renewed its “well-known seasoned issuer” (WKSI) shelf registration statement, which registers an indeterminate amount of debt or equity securities for future issuance and sale. 3M also has a medium-term notes program (Series F) program, originally established in 2016, up to an aggregate principal amount of $18 billion. As of September 30, 2025, the total amount of debt issued under the (Series F) program is approximately $17.6 billion (utilizing the foreign exchange rates applicable at the time of issuance for the euro denominated debt). The Company has not issued any debt under the (Series F) program since February 2019 and does not intend to issue any additional debt under this program in the future.\nInformation with respect to long-term debt issuances and maturities for the periods presented is included in Note 12.\n3M has a $4.25 billion five-year revolving credit facility that expires in May 2028. The revolving credit agreement includes a provision under which 3M may request an increase of up to $1.0 billion (at lenders' discretion), bringing the total facility up to $5.25 billion. The credit facility was undrawn at September 30, 2025. Under the $4.25 billion credit facility, the Company is required to maintain its EBITDA to Interest Ratio as of the end of each fiscal quarter at not less than 3.0 to 1. This is calculated (based on amounts defined in the amended agreement) as the ratio of consolidated total EBITDA for the four consecutive quarters then ended to total interest expense on all funded debt for the same period. At September 30, 2025, 3M was in compliance with this requirement. Debt covenants do not restrict the payment of dividends.\nThe Company also had $0.6 billion in stand-alone letters of credit, bank guarantees, and other similar instruments issued and outstanding at September 30, 2025. These instruments are utilized in connection with normal business activities.\n59\nTable of Contents\nCash, cash equivalents and marketable securities: \nCash, cash equivalents and marketable securities are invested in bank instruments and other high quality securities. The table below provides the breakout of the balance between the Company's foreign subsidiaries and the United States as of September 30, 2025 and December 31, 2024.\n(Billions)\nSeptember 30, 2025\nDecember 31, 2024\nForeign subsidiaries\n$\n3.5\n$\n3.5\nUnited States\n1.7\n4.2\nTotal cash, cash equivalents and marketable securities\n$\n5.2\n$\n7.7\nThe decrease from December 31, 2024, was impacted by $3.2 billion in payments associated with PFAS-related environmental liabilities and the CAE legal settlement (as discussed in Note 17), $2.7 billion in purchases of treasury stock, $1.8 billion in debt maturities, and $1.2 billion in dividend payments. The uses of cash were partially offset by proceeds of $1.2 billion from issuances of treasury shares pursuant to option/benefit plans, $1.1 billion from debt, and $0.6 billion from the sale of a portion of 3M's interest in Solventum. \nSeparately as discussed below, 3M also has current equity investments, comprised of 3M's remaining interest in Solventum Corporation, which it intends to sell within five years of the 2024 spin-off of Solventum. \nNet Debt (non-GAAP measure): \nNet debt is not defined under U.S. GAAP and may not be computed the same as similarly titled measures used by other companies. The Company defines net debt as total debt less the total of cash, cash equivalents and current and long-term marketable securities all on a continuing operations basis. 3M believes net debt is meaningful to investors as 3M considers net debt and its components to be important indicators of liquidity and financial position. The table below provides net debt as of September 30, 2025 and December 31, 2024.\n(Millions)\nSeptember 30, 2025\nDecember 31, 2024\nChange\nTotal debt\n$\n12,603\n$\n13,044\n$\n(441)\nLess: Cash, cash equivalents and marketable securities\n5,204\n7,744\n(2,540)\nNet debt (non-GAAP measure)\n$\n7,399\n$\n5,300\n$\n2,099\n \nRefer to the preceding \nTotal Debt\n and \nCash, Cash Equivalents and Marketable Securities\n sections for additional details.\nCurrent equity investments: \nCurrent equity investments consist of 3M's ownership interest in Solventum Corporation. As of September 30, 2025, 3M owned approximately 15% of Solventum's common stock, with a fair value of $1.9 billion. In August 2025, 3M sold a portion of its holdings, for proceeds of $0.6 billion, and classified its remaining interest as current equity investments (part of other current assets). As previously disclosed, 3M expects to sell its ownership in Solventum within five years of its 2024 spin-off. Sales of 3M's retained stake are subject to regulatory and other restrictions.\nBalance Sheet: \n3M’s strong balance sheet and liquidity provide the Company with significant flexibility to fund its numerous opportunities going forward. The Company will continue to invest in its operations to drive growth, including continual review of acquisition opportunities.\nThe Company uses working capital measures that place emphasis and focus on certain working capital assets, such as accounts receivable and inventory activity.\nWorking capital (non-GAAP measure):\n(Millions)\nSeptember 30, 2025\nDecember 31, 2024\nChange\nCurrent assets\n$\n16,089\n$\n15,884\n$\n205\n \nLess: Current liabilities\n8,733\n11,256\n(2,523)\nWorking capital (non-GAAP measure)\n$\n7,356\n$\n4,628\n$\n2,728\n \nVarious assets and liabilities, including cash and short-term debt, can fluctuate significantly from month to month depending on short-term liquidity needs. Working capital is not defined under U.S. generally accepted accounting principles and may not be computed the same as similarly titled measures used by other companies. The Company defines working capital as current assets minus current liabilities. 3M believes working capital is meaningful to investors as a measure of operational efficiency and short-term financial health. \nWorking capital increased from December 31, 2024, primarily due to lower balances of current liabilities related to PFAS-related environmental liabilities and the CAE legal settlement, reduced short-term borrowings and current portions of long-term debt, and an increased balance of current assets from the classification in 2025 of 3M's remaining interest in Solventum within current equity investments (as discussed above) as well as increases in accounts receivable and inventories. This increase was partially offset by decreases in cash, cash equivalents, and marketable securities.\n60\nTable of Contents\nCash Flows: \nDiscussions of cash flows from operating, investing and financing activities are provided in the sections that follow. The Consolidated Statements of Cash Flows include the results of continuing and discontinued operations and, therefore, also include cash and cash equivalents associated with Solventum through its April 2024 separation from 3M that were presented in current assets of discontinued operations in the 3M Consolidated Balance Sheet. \nCash Flows from Operating Activities: \nCash flows from operating activities can fluctuate significantly from period to period, as working capital movements, tax timing differences and other items such as litigation payments can significantly impact cash flows. \nIn the first nine months of 2025, cash flows provided by operating activities increased by $0.7 billion compared to the same period last year, primarily driven by lower payments associated with PFAS-related environmental liabilities and the CAE legal settlement. \nCash Flows from Investing Activities:\nInvestments in PP&E enable growth across many diverse markets, helping to meet product demand and increasing manufacturing efficiency. 3M invested $0.7 billion on PP&E in the first nine months of 2025. The Company expects 2025 capital spending to be approximately $0.9 billion as 3M continues to invest in growth, productivity and sustainability.\n3M invests in renewal and maintenance programs, which pertain to cost reduction, cycle time, maintaining and renewing current capacity, eliminating pollution, and compliance. Costs related to maintenance, ordinary repairs, and certain other items are expensed. 3M also invests in growth, which adds to capacity, driven by new products, both through expansion of current facilities and new facilities. Finally, 3M also invests in other initiatives, such as information technology (IT), laboratory facilities, and a continued focus on investments in sustainability.\nPurchases of marketable securities and investments and proceeds from maturities and sale of marketable securities and investments are primarily attributable to certificates of deposit/time deposits, commercial paper, and other securities, which are classified as available-for-sale. Proceeds also include those from sale of portions of 3M's remaining interest in Solventum Corporation. Refer to Note 11 for more details about 3M’s diversified marketable securities portfolio. \nCash Flows from Financing Activities: \nDebt cash flow activity includes $1.8 billion aggregate principal amount of debt maturities partially offset by proceeds from issuance of $1.1 billion in aggregate principal amount of debt in the first nine months of 2025. Gross commercial paper issuances and repayments, in addition to repayments of the fixed-rate notes, are largely reflected in “Proceeds from debt (maturities greater than 90 days)” and \"Repayment of debt (maturities greater than 90 days)\". 3M’s primary short-term liquidity needs are met through cash on hand and U.S. commercial paper issuances. Refer to Note 12 for more detail regarding debt.\nIn February 2025, 3M’s Board of Directors replaced the Company’s 2018 repurchase program with a new repurchase program. This new program authorizes the repurchase of up to $7.5 billion of 3M’s outstanding common stock, with no pre-established end date. Repurchases of common stock are made to support the Company’s stock-based employee compensation plans and for other corporate purposes. In the first nine months of 2025, the Company purchased $2.7 billion of its own stock, compared to $1.1 billion of stock purchases in the first nine months of 2024. As of September 30, 2025, approximately $5.2 billion remained available under the authorization. For more information, refer to the table titled “Issuer Purchases of Equity Securities” in Part II, Item 2. The Company does not utilize derivative instruments linked to the Company’s stock. The Company also had $1.2 billion in proceeds from issuance of treasury stock pursuant to stock option and benefit plans in the first nine months of 2025. \n3M has paid dividends since 1916. In February 2025, 3M's Board of Directors declared a first-quarter 2025 dividend of $0.73 per share, an increase of 4 percent. In May 2025, 3M's Board of Directors declared a second-quarter 2025 dividend of $0.73 per share. In August 2025, 3M's Board of Directors declared a third-quarter 2025 dividend of $0.73 per share.\nOther cash flows from financing activities may include various other items, such as cash paid associated with certain derivative instruments, distributions to or sales of noncontrolling interests, changes in overdraft balances, and principal payments for finance leases. \nSignificant Accounting Policies: \nInformation regarding new accounting standards is included in Note 1 to the Consolidated Financial Statements. \nMaterial Cash Requirements from Known Contractual and Other Obligations: \nSee the Financial Condition and Liquidity - Material Cash Requirements from Known Contractual and Other Obligations section of Item 7 of 3M's 2024 Annual Report on Form 10-K. \n61\nTable of Contents\nCautionary Note Concerning Factors That May Affect Future Results\nThis Quarterly Report on Form 10-Q, including “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part I, Item 2, contains forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. The Company may also make forward-looking statements in other reports filed with the United States Securities and Exchange Commission (\"SEC\"), in materials delivered to shareholders and in press releases. In addition, the Company’s representatives may from time to time make oral forward-looking statements.\nForward-looking statements relate to future events and typically address the Company’s expected future business and financial performance. Words such as “plan,” “expect,” “aim,” “believe,” “project,” “target,” “anticipate,” “intend,” “estimate,” “will,” “should,” “could,” \"would,\" “forecast,” \"future,\" \"outlook,\" \"guidance\" and other words and terms of similar meaning, typically identify such forward-looking statements. In particular, these include, among others, statements relating to:\n•\nworldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions and other factors beyond the Company's control, including inflation; recession; military conflicts; trade restrictions such as sanctions, tariffs, reciprocal and retaliatory tariffs, and other tariff-related measures; regulatory requirements, legal actions, or enforcement; and natural and other disasters or climate change affecting the operations of the Company or its customers and suppliers,\n•\nforeign currency exchange rates and fluctuations in those rates,\n•\nliabilities and the outcome of contingencies related to certain fluorochemicals known as \"PFAS,\" including liabilities related to claims, lawsuits, and government regulatory proceedings concerning various PFAS-related products and chemistries, as well as risks related to the Company's plans to exit PFAS manufacturing and work to discontinue use of PFAS across its product portfolio,\n•\nrisks related to the class-action settlement (“PWS Settlement”) to resolve claims by public water suppliers in the United States regarding PFAS, as well as risks related to other settlements related to PFAS,\n•\nlegal proceedings, including significant developments that could occur in the legal and regulatory proceedings described in the Company's reports on Form 10-K, 10-Q, and 8-K, as well as compliance risks related to legal or regulatory requirements, government contract requirements, policies and practices, or other matters that require or encourage the Company or its customers, suppliers, vendors, or channel partners to conduct business in a certain way,\n•\ncompetitive conditions and customer preferences,\n•\nthe timing and market acceptance of new product and service offerings,\n•\nthe availability and cost of purchased components, compounds, raw materials and energy due to shortages, increased demand and wages, tariffs, supply chain interruptions, or natural or other disasters,\n•\nunanticipated problems or delays when implementing new business systems and solutions, including with the phased implementation of a global enterprise resource planning (ERP) system, or security breaches and other disruptions to the Company's information or operational technology infrastructure,\n•\nthe impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from portfolio management actions and other evolving business strategies,\n•\noperational execution, including the extent to which the Company can realize the benefits of planned productivity improvements, as well as the impact of organizational restructuring activities,\n•\nfinancial market risks that may affect the Company's funding obligations under defined benefit pension and postretirement plans,\n•\nthe Company’s credit ratings and its cost of capital,\n•\ntax-related external conditions, including changes in tax rates, laws, or regulations, \n•\nmatters relating to the spin-off of the Company's Health Care business, including the risk that the expected benefits will not be realized; the risk that the costs or dis-synergies will exceed the anticipated amounts; potential impacts on the Company's relationships with its customers, suppliers, employees, regulators and other counterparties; the ability to realize the desired tax treatment; risks under the agreements and obligations entered into in connection with the spin-off, and\n•\nmatters relating to Combat Arms Earplugs (“CAE”) and related products, including those related to the August 2023 settlement that is intended to resolve, to the fullest extent possible, all litigation and alleged claims involving the CAE sold or manufactured by the Company's subsidiary Aearo Technologies and certain of its affiliates (“Aearo Entities”) and/or the Company (“CAE Settlement”).\nThe Company assumes no obligation to update or revise any forward-looking statements. Changes in such assumptions or factors could produce significantly different results.\n62\nTable of Contents\nForward-looking statements are based on certain assumptions and expectations of future events and trends that are subject to risks and uncertainties. Actual future results and trends may differ materially from historical results or those reflected in any such forward-looking statements depending on a variety of factors. Important information as to these factors can be found in this document, including, among others, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” under the headings of “Overview,” “Financial Condition and Liquidity” and annually in “Critical Accounting Estimates.” Discussion of these factors is incorporated by reference from Part II, Item 1A, “Risk Factors,” of this document, and should be considered an integral part of Part I, Item 2, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” For additional information concerning factors that may cause actual results to vary materially from those stated in the forward-looking statements, see our reports on Form 10-K, 10-Q and 8-K filed with the SEC from time to time."
}