{
  "item1": "Monster Energy® Drinks segment primarily generates net operating revenues selling ready-to-drink packaged drinks primarily bottlers full service beverage distributors (“bottlers/distributors”). some cases, sell ready-to-drink packaged drinks directly retail grocery specialty chains, wholesalers, club stores, mass merchandisers, convenience gas chains, drug stores, foodservice customers, value stores, e-commerce retailers military. Strategic Brands segment primarily generates net operating revenues selling “concentrates” and/or “beverage bases” authorized bottling canning operations. Such bottlers generally combine concentrates and/or beverage bases sweeteners, water other ingredients produce ready-to-drink packaged energy drinks.",
  "item7": "continue incur expenditures connection development introduction new products flavors. Value Drivers Business believe key value drivers business include following: International Growth – introduction, development sustained profitability brands internationally remains key value driver corporate growth. One more products distributed approximately 159 countries territories worldwide. – believe “functional” value-added beverage brands supported marketing innovation targeted diverse consumer base, drive profitable growth.",
  "item2": "***Although expenditures described line item determined accordance GAAP meet GAAP requirements, presentation thereof does not conform GAAP presentation requirements. Additionally, definition promotional other allowances may not comparable similar items presented other companies. Promotional other allowances energy drink products primarily include consideration given non-alcohol bottlers/distributors customers including, but not limited following: (i) discounts granted off list prices support price promotions end-consumers retailers; (ii) reimbursements given bottlers/distributors agreed portions promotional spend retailers, including slotting, shelf space allowances other fees both new existing products; (iii) agreed share fees given bottlers/distributors and/or directly retailers advertising, in-store marketing promotional activities; (iv) agreed share slotting, shelf space allowances other fees given directly retailers, club stores and/or wholesalers; (v) incentives given bottlers/distributors and/or retailers achieving exceeding certain predetermined sales goals; (vi) discounted and/or free products cash rebates; (vii) contractual fees given bottlers/distributors related sales made us direct certain customers fall within bottlers’/distributors’ sales territories; (viii) certain commissions paid based sales bottlers/distributors. presentation promotional other allowances facilitates evaluation impact determination net sales spending levels incurred correlated such sales."
}