{
  "source_file": "moh-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. BUSINESS\nOVERVIEW\nABOUT MOLINA HEALTHCARE\nMolina Healthcare, Inc., a FORTUNE 500 company, provides managed healthcare services under the Medicaid and Medicare programs, and through the state insurance marketplaces (the “Marketplace”). Molina was founded in 1980 as a provider organization serving low-income families in Southern California and reincorporated in Delaware in 2002. We served approximately 5.5 million members as of December 31, 2024, located across 21 states. \nOur business footprint, as of December 31, 2024, is illustrated below.  \nFINANCIAL HIGHLIGHTS\n \nYear Ended December 31,\n \n2024\n2023\n(In millions, except per-share amounts)\nPremium Revenue\n$\n38,627 \n$\n32,529 \nTotal Revenue\n$\n40,650 \n$\n34,072 \nMedical Care Ratio (“MCR”) \n(1)\n89.1 \n%\n88.1 \n%\nNet Income\n$\n1,179 \n$\n1,091 \nNet Income per Diluted Share\n$\n20.42 \n$\n18.77 \n_______________________\n(1)\nMedical care ratio represents medical care costs as a percentage of premium revenue.\nOUR SEGMENTS\nWe currently have four reportable segments consisting of: 1) Medicaid; 2) Medicare; 3) Marketplace; and 4) Other.\nThe Medicaid, Medicare, and Marketplace segments represent the government-funded or sponsored programs under which we offer managed healthcare services. The Other segment, which is insignificant to our consolidated results of operations, includes long-term services and supports consultative services in Wisconsin.\nRefer to Notes to Consolidated Financial Statements, Note 16, “Segments,” for further information, including segment revenue and profit information.\nMolina Healthcare, Inc. 2024 Form 10-K | 3\nSEGMENT MEMBERSHIP\nThe following table summarizes our membership by segment as of the dates indicated:\nAs of December 31,\n2024\n2023\nMedicaid\n4,890,000 \n4,542,000 \nMedicare\n242,000 \n172,000 \nMarketplace\n403,000 \n281,000 \nTotal\n5,535,000 \n4,995,000 \nSEGMENT PREMIUM REVENUE\nThe following table presents our consolidated premium revenue by segment for the periods indicated:\nYear Ended December 31,\n2024\n2023\n(In millions)\nMedicaid \n$\n30,579 \n$\n26,327 \nMedicare \n5,542 \n4,179 \nMarketplace\n2,506 \n2,023 \nTotal \n$\n38,627 \n$\n32,529 \nMISSION\nOur mission is to improve the health and lives of our members by delivering high-quality health care. \nVISION\nWe will distinguish ourselves as the low-cost, most effective and reliable health plan delivering government-sponsored care. \nSTRATEGY\nOur long-term growth strategy remains unchanged, as we continue to be a pure-play government-sponsored healthcare business, which provides us with opportunities to compete in high-growth, synergistic market segments with attractive and sustainable margins. Our strategic priorities include: \n•\nOrganic growth of our core businesses by growing with new state procurement opportunities, retaining existing contracts, increasing market share in current service areas and pursuing carve-in and/or adjacent opportunities; \n•\nInorganic growth through accretive acquisitions;\n•\nReinvesting excess capital in the business or returning it to shareholders (e.g., share repurchases); and \n•\nStrong MCR and general and administrative (“G&A”) management to drive attractive and sustainable margins.\nOur strategy analyzes our changing environment to identify the largest opportunities and risks within our portfolio and the adequacy of our capabilities. \nLandscape.\n The competition is fierce, as our markets are attractive. Public policy and demographics continue to be positive catalysts for growth. The integration of Medicaid and low-income Medicare poses an opportunity and a threat, but the Marketplace risk pool continues to stabilize. Our evolving portfolio and environment require us to focus on developing new capabilities. \nRetrospective.\n We have successfully executed our strategic plan and have confidence that we can continue to do so. We have achieved 19% revenue growth and 12% earnings per share growth from 2019 to 2024. We have achieved an 80% new contract win rate, and a 90% re-procurement win rate for Medicaid requests for proposal (“RFPs”) during this timeframe.                     \nThe Plan.\n Our long-term strategy remains unchanged. Our current target is 11% to 13% revenue growth, and 13% to 15% earnings per share growth, leading us to achieve $52 to $55 billion in premium revenue by 2027. We plan to maintain our balanced approach to growth, including market share gains, new state contracts, and mergers and \nMolina Healthcare, Inc. 2024 Form 10-K | 4\nacquisitions. We will continue to focus on driving market share gains through improved execution of enrollment and retention. Our proven track record of RFP success makes us confident in our ability to retain current revenue and to pursue the majority of new state opportunities with a continued high win rate. We plan to continue executing on our acquisitions pipeline at attractive prices and with strong integrations. \nHow We Will Execute.\n To enable the achievement of our growth strategy, we will continue providing low-cost and high quality health care services, with a seamless member experience, evolving capabilities in value-based contracting and strong clinical operations. We will also continue maintaining a strong capital foundation, enhancing the operating model, our management processes and organizational design, harnessing the power of our second line leaders and staff, and seeking continual talent upgrades. As part of our operating enhancements, we are making appreciable investments in AI administrative tools and initiatives to create efficiencies and save costs.\nKEY DEVELOPMENTS\nWe are pleased with the continued success of our profitable growth strategy, which included strong performance on Medicaid state procurements in 2024, and the Bright Health Medicare and ConnectiCare acquisitions that we closed on January 1, 2024, and February 1, 2025, respectively. Collectively, newly reported RFP successes and acquisitions in 2024 represent nearly $7 billion of incremental annual premium revenue, which will be partially realized in 2025, is expected to be mostly realized in 2026 and is expected to be fully realized in 2027 and 2028. More detail on recent developments and accomplishments relating to our growth strategy is presented below: \nConnecticut Acquisition—Marketplace and Medicare. \nEffective February 1, 2025, we closed on our\n \nacquisition of ConnectiCare Holding Company, Inc. (“ConnectiCare”), a wholly owned subsidiary of EmblemHealth, Inc. ConnectiCare is a leading health plan in the state of Connecticut serving approximately 140,000 members across Marketplace, Medicare, and certain commercial products. The purchase price for the transaction was $350 million.\nIdaho Procurement—Medicaid and Medicare\n. In December 2024, the Idaho Department of Health and Welfare announced that it intends to award a contract to our Idaho health plan to administer the state’s Dually-Eligible Medicare/Medicaid Managed Care Plan, which provides access to integrated benefits to the state’s dual eligible population. The new contract, which is expected to commence on January 1, 2026, is expected to have an initial term of four years, with a potential one-year extension. \nGeorgia Procurement—Medicaid. \nIn December 2024, the Georgia Department of Administrative Services issued the Notice of Intent to Award in the Georgia Families Medicaid Managed procurement. Our Georgia health plan was the top scorer, and was noticed for award of one of the four statewide contracts. The new contract was originally scheduled to commence on July 1, 2025; however, due to ongoing procurement protests, we now anticipate implementation beginning on July 1, 2026. \nOhio Procurement—Medicare.\n In November 2024, our Ohio health plan was awarded a contract to provide benefits to the state’s Next Generation MyCare program. The new contract is expected to commence on January 1, 2026 in the 29 counties where MyCare Ohio is currently available, with statewide expansion of the program to follow as quickly as possible. \nMichigan Procurement—Medicare.\n In October 2024, our Michigan health plan was awarded a contract to provide benefits for the state’s Highly Integrated Dual Eligible Special Needs Plan (“HIDE D-SNP”) in six service regions. In November 2024, the Michigan procurement office announced it was cancelling the previously-issued notice of intent to award contracts. The state simultaneously re-issued the RFP. In December 2024, we were re-awarded the contract in eleven service regions, Michigan’s entire lower peninsula. This award facilitates the transition of our existing Medicare-Medicaid Plan (“MMP”) members to a HIDE D-SNP product and ensures a new dual-eligibles growth opportunity by expanding our footprint from two regions to eleven. The new contract, which is expected to commence on January 1, 2026 in select regions, will be implemented statewide in 2027 and is expected to continue for seven years, with up to three renewal options. \nMassachusetts Procurement—Medicare.\n In September 2024, our Massachusetts health plan was selected to proceed to contract negotiations to operate both One Care and Senior Care Options plans. This selection is expected to allow us to operate the One Care 21-64 program, and to retain our position in the Senior Care Options program. The programs provide physical, behavioral, long-term services and supports, and other community services to dual-eligibles. The new contract is expected to commence on January 1, 2026. \nFlorida Procurement—Medicaid.\n In July 2024, we were notified that the Florida Agency for Healthcare Administration awarded a Medicaid managed care contract to Molina Healthcare of Florida. The contract commenced on February 1, 2025 and will run through December 31, 2030. We expect to serve approximately 90,000 Medicaid beneficiaries in Miami-Dade County. \nMolina Healthcare, Inc. 2024 Form 10-K | 5\nNew Mexico Procurement—Medicaid. \nOur new contract with the New Mexico Health Care Authority commenced on July 1, 2024 and will run through December 31, 2026, with a further expected extension. The new contract added approximately 33,000 members.\nWisconsin Procurement—Medicaid.\n In May 2024, the Wisconsin Department of Health Services awarded a contract to provide services under the Family Care and Family Care Partnership program in its Geographic Service Region 5 to our Wisconsin health plan. The contract commenced on January 1, 2025, and is expected to have a duration of two years, with an option for three two-year extensions. Additionally, we were re-awarded our sole contract position in the self-directed long-term services and supports personal care program.\nMichigan Procurement—Medicaid.\n In April 2024, we announced that the Michigan Department of Health and Human Services awarded a Comprehensive Health Care Program contract to our Michigan health plan. We were awarded the contract in six service regions. The new Medicaid contract commenced on October 1, 2024. The new contract is expected to have a duration of five years, with an option for three one-year extensions. \nMississippi Procurement—Medicaid.\n In the second quarter of 2024, the Mississippi Division of Medicaid extended the existing contracts for the state fiscal year that began on July 1, 2024. We now expect the new four-year contract, which will cover both TANF & ABD and CHIP, to commence on July 1, 2025. \nTexas Procurement—Medicaid - STAR CHIP.\n In the first quarter of 2024, we were notified of the Texas Health and Human Services Commission’s intent to award us a contract for Temporary Assistance for Needy Families (“TANF”) and Children’s Health Insurance Program (“CHIP”) (known in Texas as the STAR & CHIP programs, and both existing contracts for Molina), expanding our footprint and expecting to grow our market share. The expected start of operations and other final contract terms are still pending.\nVirginia Procurement—Medicaid.\n In April of 2024, the Virginia Department of Medical Assistance Services (“DMAS”) issued a notice of intent to award which did not include our Virginia health plan as an awardee for its Cardinal Care Managed Care (“CCMC”) procurement. We exercised our right to protest that decision. On April 19, 2024, DMAS upheld its notice of intent to award in response to our protest. On April 26, 2024, Molina filed a legal action in Virginia Circuit Court over DMAS’s decision not to award Molina a CCMC contract. The state court action continues. A trial date has not been set. In addition, DMAS separately notified us that they were exercising the contractual extension option for current contract for the period from July 1, 2024 through June 30, 2025.\nCalifornia Acquisition—Medicare.\n Effective January 1, 2024, we closed on our acquisition of 100% of the issued and outstanding capital stock of Bright Health Medicare, which added approximately 109,000 members. \nCalifornia Procurement—Medicaid.\n Our new contract with the California Department of Health Care Services (“DHCS”) commenced on January 1, 2024, which enabled us to continue servicing Medi-Cal members in most of our existing counties and significantly expanded our footprint in Los Angeles County. \nNebraska Procurement—Medicaid.\n Our new contract with the Nebraska Department of Health and Human Services commenced on January 1, 2024, which added approximately 114,000 members. \nTexas Procurement—Medicaid - STAR+PLUS. \n In the first quarter of 2023, we were notified of the Texas Health and Human Services Commission’s intent to award us a contract for Texas’ Medicaid-managed care program for adults with disabilities or who are age 65 or older (known in Texas as the STAR+PLUS program). The new STAR+PLUS contract began on September 1, 2024 and grew our market share. \nCAPITAL MANAGEMENT\nContinued management of our cash, investments, and capital structure is enabling us to meet the short- and long-term objectives and obligations of our business while maintaining liquidity and financial flexibility. We have continued to execute a capital plan that has produced a strong and stable balance sheet, with a simplified capital structure, which resulted in the following accomplishments in 2024:\n•\nOur regulated health plans paid $997 million in total dividends to the parent company, representing cash in excess of their capital needs. \n•\nInvestment income increased $58 million in 2024, or 15%, due mainly to growth in invested assets. \n•\nIn November 2024, we completed the private offering of $750 million aggregate principal amount of 6.250% senior notes due 2033. We used the approximately $740 million in net proceeds from this offering for general corporate purposes, which may include repayment of indebtedness, share repurchases, funding for acquisitions, capital expenditures, additions to working capital and capital contributions to our health plan subsidiaries to meet statutory requirements in new or existing states. \nMolina Healthcare, Inc. 2024 Form 10-K | 6\n•\nIn the third and fourth quarters of 2024, we completed purchases of our common stock pursuant to stock purchase programs authorized by our board of directors in September 2023 and October 2024, respectively. Under these programs, pursuant to Rule 10b5-1 trading plans, we: \n◦\nPurchased approximately 1,465,000 shares for $500 million in the third quarter of 2024 (average cost of $341.25 per share). \n◦\nPurchased approximately 1,666,000 shares for $500 million in the fourth quarter of 2024 (average cost of $300.04 per share). \nOUR BUSINESS\nMEDICAID\nOverview\nMedicaid was established in 1965 under the U.S. Social Security Act to provide healthcare and long-term services and support to low-income Americans. Although jointly funded by federal and state governments, Medicaid is a state-operated and state-implemented program. Subject to federal laws and regulations, states have significant flexibility to structure their own programs in terms of eligibility, benefits, delivery of services, and provider payments. As a result, there are 56 separate Medicaid programs—one for each U.S. state, each U.S. territory, and the District of Columbia.\nThe federal government guarantees matching funds to states for qualifying Medicaid expenditures based on each state’s federal medical assistance percentage (“FMAP”). A state’s FMAP is calculated annually and varies inversely with average personal income in the state. The approximate average FMAP across all jurisdictions is currently 62%, and currently ranges from a federally established FMAP floor of 50% to as high as 83%. Most states have contracted with managed care plans to provide Medicaid services to beneficiaries, seeking to increase budget predictability, constrain spending, improve access to care and value, and meet other objectives. \nWe expect our Medicaid enrollment to increase by over 100,000 in 2025, to a total of five million members by the end of the year. In 2025, we anticipate a benefit from our recent RFP successes in Florida, New Mexico, Wisconsin, Michigan, Mississippi and Texas, as well as from organic growth.  \nWe participate in the following Medicaid programs:\n•\nTemporary Assistance for Needy Families (“TANF”) – This is the most common Medicaid program. It primarily covers low-income families with children.\n•\nMedicaid Aged, Blind or Disabled (“ABD”) – ABD programs cover low-income persons with chronic physical disabilities or behavioral health impairments. ABD beneficiaries typically use more services than those served by other Medicaid programs because of their critical health issues.\n•\nChildren’s Health Insurance Program (“CHIP”) – CHIP is a joint federal and state matching program that provides healthcare coverage to children whose families earn too much to qualify for Medicaid coverage. States have the option of administering CHIP through their Medicaid programs.\n•\nMedicaid Expansion –\n \nIn states that have elected to participate, Medicaid Expansion provides eligibility to nearly all low-income individuals under age 65 with incomes at or below 138% of the federal poverty line.\n•\nLong Term Services and Supports (“LTSS”) – LTSS programs cover a range of medical and personal care assistance that people may need – for several weeks, months, or years – when they experience difficulty completing self-care tasks as a result of aging, chronic illness, or disability. Such services include, but are not limited to, nursing facility care, adult daycare programs, home health aide services, personal care services, transportation, and supported employment as well as assistance provided by a family caregiver.\nContracts\nOur state Medicaid contracts typically have terms of three to five years, contain renewal options exercisable by the state Medicaid agency, and allow either the state or the health plan to terminate the contract with or without cause. Such contracts are subject to risk of loss in states that issue RFPs open to competitive bidding by other health plans. If one of our health plans is not a successful responsive bidder to a state RFP, its contract may not be renewed. \nIn addition to contract renewal, our state Medicaid contracts may be amended periodically to include or exclude certain health benefits, such as pharmacy services, behavioral health services, or long-term care services, the addition or withdrawal of populations such as the ABD; and expansion into or retraction from certain new regions or service areas. \nMolina Healthcare, Inc. 2024 Form 10-K | 7\nStatus of Significant Contracts\nOur Medicaid premium revenue constituted 79% of our consolidated premium revenue in the year ended December 31, 2024. Our Medicaid contracts with the states of California, New York, Texas, and Washington each accounted for approximately 10% or more of our consolidated Medicaid premium revenues in the year ended December 31, 2024. The current status of each of these contracts is described below.\nCalifornia\n. The three DHCS Medi-Cal contracts and plan-to-plan subcontract for Los Angeles County commenced on January 1, 2024, which enabled us to continue serving Medi-Cal members in Los Angeles, Riverside/San Bernardino, Sacramento, and San Diego counties and significantly expanded our footprint in Los Angeles County. The expansion in Los Angeles County added 500,000 new members. Our California Medicaid contracts represented premium revenue of approximately $4,121 million, or 13%, of our consolidated Medicaid premium revenue in 2024.\nNew York.\n Our presence in New York increased substantially after completion of the Magellan Complete Care acquisition in December 2020, the Affinity Health Plan acquisition in October 2021 and the AgeWell New York acquisition in 2022. Affinity Health Plan is a Medicaid managed care organization serving members in New York City, Westchester, Orange, Nassau, Suffolk, and Rockland counties in New York.  AgeWell is a specialty managed care organization that provides long-term care services at home or in the community for those who are chronically ill or disabled in The Bronx, New York City, Queens, Brooklyn, Nassau, Westchester, and Suffolk counties. Our New York Medicaid contracts represented premium revenue of approximately $3,373 million, or 11%, of our consolidated Medicaid premium revenue in 2024. \nTexas.\n Our new contract for the Texas STAR+PLUS program commenced on September 1, 2024, retaining our entire existing footprint in each of Bexar, Dallas, El Paso, Harris, Hidalgo, Jefferson, Northeast Texas, and Tarrant service areas and grew our market share. In the first quarter of 2024, we were notified of the Texas Health and Human Services Commission’s intent to award us a contract for TANF and CHIP (known in Texas as the STAR & CHIP programs, and both existing contracts for Molina), expanding our footprint, and expecting to grow our market share. The expected start of operations and other final contract terms are still pending. Our Texas Medicaid contracts represented approximately $4,126 million, or 14%, of consolidated Medicaid premium revenue in 2024.\nWashington. \nOur managed care contract with the Washington State Health Care Authority (“HCA”) covers all ten regions of the state’s Apple Health Integrated Managed Care program, and was effective through December 31, 2024. HCA has renewed the contract through December 31, 2025, with a further renewal expected for 2026. HCA is expected to re-procure for Medicaid with an anticipated release of an RFP no earlier than sometime in 2026, with an expected contract effective date of January 1, 2027. Our Washington Medicaid contract represented approximately $3,998 million, or 13%, of consolidated Medicaid premium revenue in 2024. \nA loss of any of our significant Medicaid contracts could have a material adverse effect on our business, financial condition, cash flows, or results of operations.\nBasis for Premium Rates\nUnder our Medicaid contracts, state government agencies pay our health plans per-member per-month (“PMPM”) rates that vary by state, line of business, demographics and, in most instances, health risk factors. CMS requires these rates to be actuarially sound. In exchange for the payment received, Molina arranges, pays for, and manages healthcare services provided to Medicaid beneficiaries. Therefore, our health plans are at risk for the medical costs associated with their members’ healthcare. Premium rates under our Medicaid contracts are subject to each state’s annual appropriation process. The premium rates paid to our health plans may vary substantially between states and among various government programs and may not be commensurate with the current medical cost trends in the states and the health acuity levels of our members. For the year ended December 31, 2024, Medicaid program PMPM premium rates ranged from $290 to $1,380.\nMember Enrollment and Marketing\nMost states allow eligible Medicaid members to select the Medicaid plan of their choice. This opportunity to choose a plan is typically afforded to the member at the time of first enrollment and, at a minimum, annually thereafter. In some of the states in which we operate, a substantial majority of new Medicaid members voluntarily select a plan with the remainder subject to the auto-assignment process described below, while in other states less than half of new members voluntarily choose a plan.\nOur Medicaid health plans may benefit from auto-assignment of individuals who do not choose a plan, but for whom participation in managed care programs is mandatory. Each state differs in its approach to auto-assignment, but one or more of the following criteria is typical in auto-assignment algorithms: a Medicaid beneficiary's previous enrollment with a health plan or experience with a particular provider contracted with a health plan, enrolling family \nMolina Healthcare, Inc. 2024 Form 10-K | 8\nmembers in the same plan, a plan's quality or performance status, a plan’s network and enrollment size, awarding all auto-assignments to a plan with the lowest bid in a county or region, and equal assignment of individuals who do not choose a plan in a specified county or region. \nOur Medicaid marketing efforts are regulated by the states in which we operate, each of which imposes different requirements for, or restrictions on, Medicaid sales and marketing. These requirements and restrictions are revised from time to time. None of the jurisdictions in which we operate permit direct sales by Medicaid health plans.\nMEDICARE\nOverview\nMedicare is a federal program that provides eligible persons age 65 and over, and some disabled persons, with a variety of hospital, medical insurance, and prescription drug benefits. Medicare is funded by Congress, and administered by CMS. Medicare beneficiaries may enroll in a Medicare Advantage plan, under which managed care plans contract with CMS to provide benefits that are comparable to original Medicare. Since 2006, Medicare beneficiaries have had the option of selecting a prescription drug benefit from an existing Medicare Advantage plan. The drug benefit, available to beneficiaries for a monthly premium, is subject to cost-sharing depending upon the specific benefit design of the selected plan. \nOver 12 million low-income elderly and disabled people qualify for both the Medicare and Medicaid programs (“dual eligible” individuals). These beneficiaries are more likely than other Medicare beneficiaries to be frail, live with multiple chronic conditions, and have functional and cognitive impairments. Medicare is their primary source of health insurance coverage. Medicaid supplements Medicare by paying for services not covered by Medicare, such as dental care and long-term care services and supports, and by helping to cover Medicare’s premiums and cost-sharing requirements. Together, these two programs help to shield very low-income Medicare beneficiaries from potentially unaffordable out-of-pocket medical and long-term care costs.\nWe expect our Medicare enrollment to increase by approximately 3% in 2025, to a total of 250,000 members by the end of the year, including the 39,000 members we added as a result of the ConnectiCare acquisition, effective February 1, 2025. In 2025, we are participating in Medicare in all our markets except Florida and Iowa.\nWe participate in the following Medicare programs:\n•\nMedicare Advantage-Part D (“MAPD”) – We contract with CMS under the Medicare Advantage program to provide benefits in excess of original Medicare, including cost-sharing and enhanced prescription drug benefits under Part D, that are targeted towards low-income beneficiaries;\n•\nDual Eligible Special Needs Plan (“D-SNP”) – We contract with CMS to provide benefits in excess of original Medicare, including care coordination complex case management and care management;\n•\nHighly-Integrated Dual Special Needs Plans (“HIDE”) – We contract with CMS and state Medicaid agencies to integrate care at a higher level than a typical D-SNP for dually eligible beneficiaries;\n•\nFully-Integrated Dual Special Needs Plans (“FIDE”) – We contract with CMS and state Medicaid agencies to fully integrate care for dually eligible beneficiaries under a single managed care plan;\n•\nMedicare-Medicaid Plans (“MMP”) – To coordinate care and deliver services in a more financially efficient manner, some states have undertaken demonstration programs to integrate Medicare and Medicaid services for dual-eligible individuals. Our MMPs are transitioning to other products, as described further below.\nContracts\nWe enter into MAPD contracts with CMS annually, and for D-SNP, HIDE, FIDE and MMP (collectively, “dual-eligible programs”), we enter into contracts with CMS, in partnership with each state’s department of health and human services. Such contracts typically have terms of one to three years.\nStatus of MMP Contracts\nIn May 2022, CMS published a Final Rule that addressed the termination of the Financial Alignment Initiative Demonstration. Under a provision within the Final Rule, states can maintain their existing MMP through a two-year extension until December 31, 2025, so long as the applicable state provided CMS with a transition plan by October 1, 2022. In the proposed rule for contract year 2025, CMS has further provided states with a process for identifying a pathway to a FIDE or HIDE D-SNP plan. \nOur California MMP members were transitioned to Molina’s California EAE-SNP products early in 2023. \nIn November 2024, our Ohio health plan was awarded a contract to provide benefits to the state’s Next Generation MyCare program. The new contract is expected to commence on January 1, 2026 in the 29 counties where MyCare \nMolina Healthcare, Inc. 2024 Form 10-K | 9\nOhio is currently available, with statewide expansion of the program following as quickly as possible. \nIn December 2024, our Michigan health plan was awarded a contract to provide benefits for the state’s HIDE D-SNP in eleven service regions. The new contract, which is expected to commence on January 1, 2026 in select regions, will be implemented statewide in 2027. \nIn South Carolina, we expect MMP members to be cross-walked to a HIDE product without an RFP process. In Texas, we expect MMP members to be cross-walked to a FIDE product without an RFP process. Illinois has issued an RFP to transition MMP members to a FIDE D-SNP effective January 1, 2026. \nBasis for Premium Rates\nUnder Medicare Advantage, managed care plans contract with CMS, and for the dual-eligible programs with CMS and state governments, to provide benefits in exchange for a PMPM premium payment that varies based on health plan Star rating and member demographics, including county of residence and health risk factors. The premium payment considers inflation, non-benefit expense requirements, other Medicare Advantage bids submitted to CMS, changes in utilization patterns and average per capita fee-for-service Medicare costs in the calculation of the PMPM premium payment. Amounts payable to us under the dual-eligible programs and Medicare Advantage contracts are subject to annual revision by CMS, including any federal budget cuts or tax changes applicable to Medicare. We elect to participate in each Medicare service area or region on an annual basis. \nCMS developed the Medicare Advantage Star ratings system to help beneficiaries choose among competing plans, awarding between 1.0 and 5.0 stars to Medicare Advantage plans based on performance in certain measures of quality. The Star ratings are used by CMS to award quality bonus payments to Medicare Advantage plans. Beginning with the 2014 Star ratings, Medicare Advantage plans were required to achieve a minimum of 4.0 Stars to qualify for a quality bonus payment. In addition, a Medicare Advantage plan will be determined to be low-performing if it receives fewer than three stars for three consecutive years. Beginning in 2016, those Medicare plans that achieve less than a three-star rating for three consecutive years will be issued a notice of non-renewal of their contract for the following year. See further discussion of Star ratings under \nOperations/Quality\n.\nMedicare Advantage premiums are subject to retroactive increase or decrease based on the health status of our Medicare members, as measured by member risk scores determined pursuant to the CMS risk adjustment model. The data we provide to CMS to determine risk scores is subject to audit by CMS at the contract level, by plan year on an on-going basis. Such risk adjustment data validation (“RADV”) audits can result in retroactive and prospective premium adjustments. We record the estimated impact of audit settlements as a reduction to premium revenues, based upon available information, in the year that CMS determines repayment is required. On January 30, 2023, CMS finalized its approach to RADV audits, including its decision to extrapolate the results of audit samples when calculating payment errors, which will also not include the Fee-For-Service Adjuster. CMS will apply extrapolation to audits for the 2018 payment year. On November 14, 2024, CMS initiated the payment year 2018 MA RADV audits, and CMS expects to begin issuing payment year 2018 audit findings in mid-calendar year 2026. CMS also announced the removal of the Fee-For-Service Adjuster from the risk adjustment data validation audit methodology beginning for payment year 2018. On March 31, 2023, CMS issued its final 2024 Medicare Advantage Rate Announcement, which implements a three-year phase-in of certain changes to the methodology CMS will use to perform risk adjustment for plan years 2024 through 2026. Under the new risk adjustment model that was implemented in 2024, CMS has changed the manner by which over 2,000 diagnosis codes, across a range of disease and condition categories, are considered for purposes of patient risk scoring, with certain of these codes no longer impacting risk scoring. On April 1, 2024, CMS released the 2025 Medicare Advantage Rate Announcement, which continues the three-year phase in by blending 67% of the risk score calculated using the updated 2024 MA risk adjustment model with 33% of the risk score calculated using the 2020 MA risk adjustment model. In addition, CMS also finalized improvements to the Part D drug benefit for 2025, limiting out-of-pocket costs for prescription drugs for seniors to no more than $2,000. \nCompared with our Medicaid programs, Medicare programs generate higher average PMPM revenues and healthcare costs. For the year ended December 31, 2024, Medicare program PMPM premium rates ranged from $1,140 to $4,310.\nMember Enrollment and Marketing\nOur Medicare members may be enrolled through auto-assignment, as described above in “Medicaid—Member Enrollment and Marketing,” or by enrolling in our plans with the assistance of insurance agents employed by Molina, outside brokers, or via the Internet. Generally, the enrollment period occurs between mid-October and early December for coverage that begins on the following January 1.\nMolina Healthcare, Inc. 2024 Form 10-K | 10\nOur Medicare marketing and sales activities are regulated by CMS and the states in which we operate. CMS has oversight over all marketing materials used by Medicare Advantage plans, and in some cases has imposed advance approval requirements. CMS generally limits sales activities to those conveying information regarding benefits, describing the operations of our managed care plans, and providing information about eligibility requirements. \nWe employ our own insurance agents and contract with independent, licensed insurance agents to market our Medicare Advantage products. We have continued to expand our use of independent agents because the cost of these agents is largely variable and we believe the use of independent, licensed agents is more conducive to the shortened Medicare selling season and the open enrollment period. The activities of our independent, licensed insurance agents are also regulated by CMS. We also use direct mail, mass media and the Internet to market our Medicare Advantage products.\nMARKETPLACE\nOverview\nThe ACA authorized the creation of Marketplace insurance exchanges, allowing individuals and small groups to purchase federally subsidized health insurance effective January 1, 2014. Marketplace plans must be ACA-compliant, meeting standards established by the federal government, including a requirement to cover certain essential health benefits. Certain beneficiaries qualify for premium tax credits and cost-sharing reductions based on annual household income. Plans are categorized by metal tiers (Platinum, Gold, Silver or Bronze), which determine how beneficiaries and the plan share costs (e.g., premiums, out-of-pocket costs and deductibles). We\n offer Marketplace plans in many of the states where we offer Medicaid health plans. Our plans allow our Medicaid members to stay with their providers as they transition between Medicaid and the Marketplace. Additionally, our plans remove financial barriers to quality care and seek to minimize members' out-of-pocket expenses. In 2025, \nwe are participating in the Marketplace in all our markets except Arizona, Iowa, Massachusetts, Nebraska, New York, and Virginia.\nWe expect our Marketplace enrollment to increase by almost 50% in 2025, to a total of 580,000 members by the end of the year, including the 66,000 members we added as a result of the ConnectiCare acquisition, effective February 1, 2025. This would represent an estimated Marketplace premium revenue increase of approximately 60% in 2025, while continuing to maintain our target margins.\nContracts\nWe enter into contracts with CMS annually for the state Marketplace programs. These contracts have a one-year term ending on December 31, and must be renewed annually.\nBasis for Premium Rates\nFor Marketplace, we develop each state’s premium rates during the spring of each year for policies effective in the following calendar year. Premium rates are based on our estimates of utilization of services and unit costs, anticipated member risk acuity and related federal risk adjustment transfer amounts, and non-benefit expenses such as administrative costs, taxes, and fees. The premium rates are filed for approval with the various state and federal authorities in accordance with the rules and regulations applicable to the ACA individual market, including, but not limited to,\n \nminimum loss ratio thresholds and adjustments for permissible rate variations by age, geographic area, and variations in plan design. In the year ended December 31, 2024, Marketplace program PMPM premium rates ranged from $400 to $1,980. \nMember Enrollment and Marketing\nOur Marketplace members enroll in our plans with the assistance of insurance agents employed by Molina, outside brokers, vendors, direct to consumer marketing, and via the Internet.\nWhile our Marketplace sales activities are regulated by CMS (such as eligibility determinations), our marketing activities are regulated by the individual states in which we operate. Some states require us to obtain prior approval of our marketing materials, others simply require us to provide them with copies of our marketing materials, and some states do not request our marketing materials. We are able to freely contact our members and provide them with marketing materials as long as those materials are fair and do not discriminate.\nOur Marketplace sales and marketing strategy is to provide high quality, affordable, compliant and consumer-centric Marketplace products through a variety of distribution channels. Our Marketplace products are displayed on the Federally Facilitated Marketplace (“FFM”) and the State Based Marketplace (“SBM”) in the states in which we participate in the Marketplace. We also contract with independent, licensed insurance agents to market our Marketplace products. The activities of our independently licensed insurance agents are also regulated by both \nMolina Healthcare, Inc. 2024 Form 10-K | 11\nCMS and the departments of insurance in the states in which we participate. Our sales cycle typically peaks during the annual Open Enrollment Period (“OEP”) as defined and regulated by CMS and the applicable FFM and SBM\n.\nTRENDS AND UNCERTAINTIES\nREGULATORY DEVELOPMENTS AND RELATED TRENDS\nFederal Economic Stabilization and Other Programs\nThe COVID-19 pandemic was the worst public health crisis of the last 100 years, and a national public health emergency (“PHE”) was declared. The surge of COVID-19 cases, hospitalizations, and testing requirements put increased pressure on medical costs in 2020 and 2021. The increases were more than offset by a reduction in non-COVID related costs, including the postponement and cancellation of elective procedures; however, many of our state Medicaid partners implemented medical cost risk corridors, which resulted in increased rebate payments back to the states. The impact of the pandemic began to decrease in 2022, as the high levels of vaccination, widespread population immunity, and available treatments significantly reduced the risk of severe COVID-19 disease, hospitalization, and death. \nThe Consolidated Appropriations Act of 2023 authorized states to resume redeterminations and terminate coverage for ineligible enrollees starting on April 1, 2023, irrespective of the status of the PHE. Consequently, all states in which we operate had begun disenrolling members, resulting in a loss of members that were gained due to the suspension of redetermination for Medicaid eligibility during the PHE. \nThe PHE officially ended on May 11, 2023. There are several healthcare programs tied to the PHE which were impacted by this change in policy. These include coverage of COVID-19 testing and vaccines, changes to the Medicare fee schedule for COVID-related treatments, and free coverage of at-home COVID-19 diagnostic tests. Per federal statutory and regulatory requirements, some of these programs concluded with the end of the PHE, while some continued through 2024, and some are expected to remain in place permanently.\nOperations\nEnrollment and Premium Revenue\nExcluding acquisitions and our exit from Puerto Rico, we estimate we added approximately one million new Medicaid members since March 31, 2020, when we first began to report on the impacts of the pandemic. We believe this membership increase was mainly due to the suspension of redeterminations for Medicaid eligibility. Due to the resumption of redeterminations discussed above, we estimate we lost approximately 675,000 members, based on our experience to date. The medical cost profile of members who have been disenrolled is more favorable than the Medicaid segment average, and when combined with higher utilization in our continuing population, our Medicaid MCR for the year ended December 31, 2024 was higher than our expectations and above our long-term target. Based on the experience to date, we expect that we will ultimately retain approximately 30% of the membership gained since March 31, 2020. \nLEGISLATIVE AND POLITICAL ENVIRONMENT\nPRESSURES ON FUNDING\nDue to states’ budget challenges and political agendas at both the state and federal levels, there are a number of different legislative proposals being considered, some of which would involve significantly reduced federal or state spending on the Medicaid and Medicare programs, constitute a fundamental change to the federal role in healthcare and, if enacted, could have a material adverse effect on our business, financial condition, cash flows, or results of operations. These proposals include elements such as the following, as well as numerous other potential changes and reforms:\n•\nChanges in the entitlement nature of Medicaid (and perhaps Medicare as well) by capping future increases in federal health spending for these programs, reducing the FMAP, paid to states by the federal government, overall or solely for the ACA Medicaid expansion population in states, and shifting much more of the risk for health costs in the future to states and consumers;\n•\nReversing the ACA’s expansion of Medicaid that enables states to cover low-income childless adults;\n•\nChanging Medicaid to a state block grant program, including potentially capping spending on a per-enrollee basis;\n•\nRequiring Medicaid beneficiaries to work;\n•\nLimiting the amount of lifetime benefits for Medicaid beneficiaries;\n•\nRaising Medicare eligibility to age 67; and\n•\nIn some states, shifting to an alignment of Medicaid and Medicare for dual eligible members.\nMolina Healthcare, Inc. 2024 Form 10-K | 12\nRecently, members of the U.S. House of Representatives have started to weigh a series of legislative proposals targeting Medicaid, Medicare, and other entitlement programs as part of a broader campaign to reduce federal spending, and they may pursue these spending cuts in exchange for their support of raising the debt ceiling, the legal cap that allows the U.S. government to borrow money to pay its bills. In addition, President Trump has issued a number of executive orders intended to reduce government spending, and we expect there will be continued proposals targeting reimbursement methodologies and the number of individuals eligible for government healthcare programs. \nAFFORDABLE CARE ACT\nIn addition to past proposals calling for the full repeal of the Affordable Care Act - proposals which could be renewed again in the future - proposed changes and reforms to the ACA have included, or may include, the following:\n•\nEliminating or reducing the advanced premium tax credits and cost sharing reductions for low-income individuals who purchase their health insurance through the Marketplaces;\n•\nExpanding and encouraging the use of private health savings accounts;\n•\nProviding for insurance plans that offer fewer and less extensive health insurance benefits than under the ACA’s essential health benefits package, including broader use of catastrophic coverage plans, or short-term health insurance;\n•\nEstablishing and funding high risk pools or reinsurance programs for individuals with chronic or high-cost conditions; and\n•\nAllowing insurers to sell insurance across state lines.\nThe passage of any of these changes or other reforms could have a material adverse effect on our business, financial condition, cash flows, or results of operations.\nOPERATIONS\nQUALITY\nOur long-term success depends, to a significant degree, on the quality of the services we provide. We are focused on providing our members effective and appropriate access to care at the right time and in the right setting, including preventive health and wellness and care management. We offer our government customers, members and providers reliable service and a seamless experience. \nAs of December 31, 2024, 19 of our health plans were accredited by the National Committee for Quality Assurance (“NCQA”), and 17 of our health plans have earned NCQA’s Health Equity Accreditation, which is awarded to organizations that lead the market in providing culturally and linguistically sensitive services and work to reduce disparities in health care. Additionally, eight health plans earned NCQA’s Long Term Services and Supports Distinction. We believe that these objective measures of quality are important to state Medicaid agencies, as a growing number of states link reimbursement and patient assignment to quality scores. \nIn October 2022, CMS published its updated Medicare 2023 Star Ratings based on plan year 2021 data. For the 2023 Star Ratings, five of our plans had a decrease of 0.5 Stars, two of our plans had a decrease of 1 Star, one plan had a decrease of 1.5 Stars, and two plans either maintained or increased Star Ratings by 0.5. The decreases to the 2023 Star Ratings impacted the 2024 bonus year payments.  \nIn October 2023, CMS published its updated Medicare 2024 Star Ratings based on plan year 2022 data. For the 2024 Star Ratings, three of our plans had a decrease of 0.5 Stars, one of our plans had a decrease of 1 Star, four plans maintained their ratings, and one plan had an increase of 0.5 Stars. The decreases to the 2024 Star Ratings impact the 2025 bonus year payments. \nIn October 2024, CMS published its updated Medicare 2025 Star Ratings based on plan year 2023 data. For the 2025 Star Ratings, six plans maintained their ratings, two plans had an increase of 0.5 Stars, and one plan had an increase of 1 Star, and three of our plans had a decrease of 0.5 Stars. The 2025 Star Rating included an additional plan reaching 3.5 Stars, strengthening our 2026 rebates. \nApproximately 45% of our 2025 Medicare premium revenue is not impacted by Star Ratings. We are actively working on improvement plans and remain committed to invest in these programs to improve our quality Star scores with a focus on member experience and access measures. \nMolina Healthcare, Inc. 2024 Form 10-K | 13\nFor the states where our health plans are accredited by the NCQA and/or have Medicare Star Ratings, the table below presents such health plans’ NCQA status, as well as their current scores as part of the Medicare Star Ratings, which measures the quality of Medicare plans across the country using a 5-star rating system. \nPROVIDERS\nWe arrange healthcare services for our members through contracts with a vast network of providers, including independent physicians and physician groups, hospitals, ancillary providers, and pharmacies. We strive to ensure that our providers have the appropriate expertise and cultural and linguistic experience. \nThe quality, depth and scope of our provider network are essential if we are to ensure quality, cost-effective care for our members. In partnering with quality, cost-effective providers, we utilize clinical and financial information derived by our medical informatics function, as well as the experience we have gained in serving Medicaid members, to gain insight into the needs of both our members and our providers. \nPhysicians\nWe contract with both primary care physicians and specialists, many of whom are organized into medical groups or independent practice associations. Primary care physicians provide office-based primary care services. Primary care physicians may be paid under capitation or fee-for-service contracts and may receive additional compensation by providing certain preventive care services. Under capitation payment arrangements, healthcare providers receive fixed, pre-arranged monthly payments per enrolled member, whereas under fee-for-service payment arrangements, healthcare providers are paid a fee for each particular service rendered. Our specialists care for patients for a specific episode or condition, usually upon referral from a primary care physician, and are usually compensated on a fee-for-service basis. When we contract with groups of physicians on a capitated basis, we monitor their solvency. \nMolina Healthcare, Inc. 2024 Form 10-K | 14\nHospitals\nWe generally contract with hospitals that have significant experience dealing with the medical needs of the Medicaid population. We reimburse hospitals under a variety of payment methods, including fee-for-service, per diems, diagnostic-related groups, capitation, and case rates.\nAncillary Providers\nOur ancillary agreements provide coverage of medically-necessary care, including laboratory services, home health, physical, speech and occupational therapy, durable medical equipment, radiology, ambulance and transportation services, and are reimbursed on a capitation and fee-for-service basis.\nPharmacy\nWe outsource pharmacy benefit management services, including claims processing, pharmacy network contracting, rebate processing and mail and specialty pharmacy fulfillment services. Via a “Market Check” provision in the agreement with our long-standing pharmacy benefit management (“PBM”) company, CVS Caremark (“Caremark”), we re-negotiated network and administrative costs (for calendar years 2024 through 2026) to Molina’s benefit. The benefit was largely driven by improvements in network rates, partially offset by higher administrative costs.\nMEDICAL MANAGEMENT\nOur mission is to improve the health outcomes and lives of our members by delivering high-quality healthcare. We believe our singular focus on government-sponsored healthcare enables us to identify and implement efficiencies that distinguish us as the low-cost, high-quality health plan of choice. We emphasize primary care physicians as the central point of delivery for routine and preventive care, coordination of referrals to specialists, and appropriate assessment of the need for hospital care. This model has proved to be an effective method of coordinating medical care for our members.\nUtilization Management \nOur goal is to optimize access to low-cost, high-quality care. This is achieved by sound clinical policy based on current evidence-based practices. Additionally, we continuously monitor utilization patterns and strive to identify new opportunities to reduce costs and improve quality of care. Our utilization management process serves as a bridge to identify at-risk members for referral into internally developed case management programs such as “\nTransitions of Care\n,” which facilitates post-discharge safety and appropriate outcomes.\nPopulation Management \nWe believe high-quality, affordable care is achieved through a variety of programs tailored to our members’ emerging needs. Individuals are identified for interventions, and programs are customized, based on predictive analytics and our member assessment process. These tools ensure that the appropriate level of services and support are provided to address physical health, behavioral health, and social determinants of health. This comprehensive and customized approach is designed to help members achieve their goals and improve their overall quality of life.\nPharmacy Management \nOur pharmacy programs are designed to make us a trusted partner in improving member health and healthcare affordability. We strategically partner with physicians and other healthcare providers who treat our members. This collaboration results in drug formularies and clinical initiatives that promote improved patient care. We employ full-time pharmacists and pharmacy technicians who work closely with providers to educate them about our formulary products, clinical programs, and the importance of cost-effective care.\nMedical Cost Management \nWe use various strategies to mitigate the negative effects of healthcare cost inflation. Specifically, our health plans use coordination of care programs for our members, product and benefit designs, hospital inpatient management systems, sophisticated analytics, and care management programs related to complex chronic conditions, prenatal and premature infant care and certain other conditions. Our health plans emphasize preventive healthcare and appropriate use of specialty and hospital services with their contracted independent providers. There can be no assurance, however, that our strategies to mitigate medical care cost inflation will be successful. Competitive pressures, new healthcare and pharmaceutical product introductions, demands from healthcare providers and customers, applicable regulations, or other factors may affect our ability to control medical care costs.\nMolina Healthcare, Inc. 2024 Form 10-K | 15\nINFORMATION TECHNOLOGY\nOur business is dependent on effective and secure information systems that assist us in processing provider claims, monitoring utilization and other cost factors, supporting our medical management techniques, providing data to our regulators, and implementing our data security measures. Our members and providers also depend upon our information systems for enrollment, premium processing, primary care and specialist physician roster access, membership verifications, claims status, provider payments, and other information.\nWe have partnered with third parties to support our information technology systems. This makes our operations vulnerable to adverse effects if such third parties fail to perform adequately. In 2019, we entered into an agreement with a third-party vendor who manages certain of our information technology services including, among other things, our infrastructure operations, end-user services, data centers, public cloud and application management. In 2022, we extended our agreement for an additional seven years.\n \nAs a result of the agreement, we were able to reduce our administrative expenses, while improving the reliability of our information technology functions, and maintain targeted levels of service and operating performance. A portion of these services are provided on our premises, while other portions of the services are performed at the vendor’s facilities. \nOur information systems require an ongoing commitment of significant resources to maintain, protect, and enhance existing systems and develop new systems to keep pace with continuing changes in information processing technology, evolving systems and regulatory standards, changing customer preferences, acquisitions and increased security risks.\nCENTRALIZED SERVICES\nWe provide certain centralized medical and administrative services to our subsidiaries pursuant to administrative services agreements that include, but are not limited to, information technology, product development and administration, underwriting, claims processing, customer service, certain care management services, human resources, marketing, purchasing, risk management, actuarial, finance, accounting, compliance, legal and public relations.\nCOMPETITIVE CONDITIONS AND ENVIRONMENT\nWe face varying levels of competition. Healthcare reform proposals may cause organizations to enter or exit the market for government-sponsored health programs. However, the licensing requirements and bidding and contracting procedures in some states may present partial barriers to entry into our industry.\nWe compete for government contracts, renewals of those government contracts, members, and providers. State agencies consider many factors in awarding contracts to health plans. Among such factors are the health plan’s provider network, quality scores, medical management, degree of member satisfaction, timeliness of claims payment, and financial resources. Potential members typically choose a health plan based on a specific provider being a part of the network, the quality of care and services available, accessibility of services, and reputation or name recognition of the health plan. We believe factors that providers consider in deciding whether to contract with a health plan include potential member volume, payment methods, timeliness and accuracy of claims payment, and administrative service capabilities.\nMedicaid\nThe Medicaid managed care industry is subject to ongoing changes as a result of healthcare reform, business consolidations and new strategic alliances. We compete with national, regional, and local Medicaid managed care companies, and health maintenance organizations, principally on the basis of size, location, quality of the provider network, quality of service, and reputation. There is increasing competition driven by renewed interest from large national health plans. Our primary competitors in the Medicaid managed care industry include Centene Corporation, CVS Health Corporation, Elevance Health, Inc., UnitedHealth Group Inc., and large not-for-profit healthcare organizations. Competition can vary considerably from state to state, and some of our competitors have larger membership bases and/or greater financial resources than our health plans in the markets in which we compete. \nMedicare\nThe Medicare market is highly competitive across the country, with large competitors, such as CVS Health Corporation, Humana Inc., and UnitedHealth Group Inc.\nMarketplace\nMargins and the risk pool are stabilizing with the market returning to rational pricing; however, a potential sunset of enhanced subsidiaries creates risk to near-term growth and risk pool stability. Low-income members who receive \nMolina Healthcare, Inc. 2024 Form 10-K | 16\ngovernment subsidies comprise the vast majority of Marketplace membership, which is served by a limited number of health plans. Our primary competitor for low-income Marketplace membership is Centene Corporation.\nREGULATION\nOur health plans are highly regulated by both state and federal government agencies. Regulation of managed care products and healthcare services varies from jurisdiction to jurisdiction, and changes in applicable laws and rules occur frequently. Regulatory agencies generally have discretion to issue regulations and interpret and enforce laws and rules. Compliance with such laws and rules may lead to additional costs related to the implementation of additional systems, procedures and programs that we have not yet identified. Such agencies have become increasingly active in recent years in their review and scrutiny of health insurers and managed care organizations, including those operating in the Medicaid and Medicare programs.\nHIPAA AND THE HITECH ACT \nIn 1996, Congress enacted the Health Insurance Portability and Accountability Act (“HIPAA”). All health plans are subject to HIPAA, including ours. HIPAA generally requires health plans to:\n•\nEstablish the capability to receive and transmit electronically certain administrative healthcare transactions, such as claims payments, in a standardized format;\n•\nAfford privacy to patient health information; and\n•\nProtect the privacy of patient health information through physical and electronic security measures.\nIn 2009, the Health Information Technology for Economic and Clinical Health Act (“HITECH”) imposed requirements on uses and disclosures of health information; included requirements for HIPAA business associate agreements; extended parts of HIPAA privacy and security provisions to business associates; added data breach notification requirements for covered entities and business associates and reporting requirements to the U.S. Department of Health and Human Services (“HHS”) and, in some cases, to the media; strengthened enforcement; and imposed higher financial penalties for HIPAA violations. In the conduct of our business, depending on the circumstances, we may act as either a covered entity and/or a business associate. HIPAA privacy regulations do not preempt more stringent state privacy laws and regulations that may apply to us.\nWe maintain a HIPAA compliance program, which we believe complies with HIPAA privacy and security regulations, and monitor our compliance with applicable state and federal privacy and security laws and regulations.\nHealthcare reform created additional tools for fraud prevention, including increased oversight of providers and suppliers participating or enrolling in Medicaid, CHIP, and Medicare. Those enhancements included mandatory licensure for all providers, and site visits, fingerprinting, and criminal background checks for higher risk providers. \nFRAUD AND ABUSE LAWS AND THE FALSE CLAIMS ACT\nBecause we receive payments from federal and state governmental agencies, we are subject to various laws commonly referred to as “fraud and abuse” laws, including federal and state anti-kickback statutes, prohibited referrals, and the federal False Claims Act, which permit agencies and enforcement authorities to institute a suit against us for violations and, in some cases, to seek treble damages, criminal and civil fines, penalties, and assessments. Violations of these laws can also result in exclusion, debarment, temporary or permanent suspension from participation in government healthcare programs, or the institution of corporate integrity agreements. Liability under such federal and state statutes and regulations may arise if we know, or it is determined that we should have known, that information we provide to form the basis for a claim for government payment is false or fraudulent. \nFraud, waste and abuse prohibitions encompass a wide range of operating activities, including kickbacks or other inducements for referral of members or for the coverage of products (such as prescription drugs) by a plan, billing for unnecessary medical services by a provider, upcoding, payments made to excluded providers, improper marketing, and the violation of patient privacy rights. In particular, there has recently been increased scrutiny by the Department of Justice on health plans’ risk adjustment practices, particularly in the Medicare program. Companies involved in government healthcare programs such as Medicaid and Medicare are required to maintain compliance programs to detect and deter fraud, waste and abuse, and are often the subject of fraud, waste and abuse investigations and audits. \nThe federal government has taken the position that claims presented in violation of the federal anti-kickback statute may be considered a violation of the federal False Claims Act. In addition, under the federal civil monetary penalty statute, the HHS Office of Inspector General has the authority to impose civil penalties against any person who, among other things, knowingly presents, or causes to be presented, certain false or otherwise improper claims. \nQui tam \nactions under federal and state law are brought by a private individual, known as a relator, on behalf of the \nMolina Healthcare, Inc. 2024 Form 10-K | 17\ngovernment. A relator who brings a successful \nqui tam\n lawsuit can receive 15 to 30 percent of the damages the government recovers from the defendants, which damages are trebled under the False Claims Act. Because of these financial inducements offered to plaintiffs, \nqui tam\n actions have increased significantly in recent years, causing greater numbers of healthcare companies to incur the costs of having to defend false claims actions, many of which are spurious and without merit. In addition, meritorious false claims actions could result in fines, or debarment from the Medicare, Medicaid, or other state or federal healthcare programs.\nLICENSING AND SOLVENCY\nOur health plans are generally licensed by the insurance departments in the states in which they operate, except the following: our California health plans are licensed by the California Department of Managed Health Care; one of our New York health plans is licensed as a prepaid health services plan by the New York State Department of Health; and our Massachusetts health plan is regulated as a risk-bearing entity by the Massachusetts Executive Office of Health and Human Services.\nOur health plans are subject to stringent requirements to maintain a minimum amount of statutory capital determined by statute or regulation, and restrictions that limit their ability to pay dividends to us. For further information, refer to the Notes to Consolidated Financial Statements, Note 15, “Commitments and Contingencies—Regulatory Capital Requirements and Dividend Restrictions.”\nHUMAN CAPITAL \nAs of December 31, 2024, we had just over 18,000 employees. Our diverse employee population reflects the diversity of the members and communities we serve.\nWe continue to focus on providing opportunities for our employees that are intellectually stimulating and emotionally fulfilling, and programs and benefits that are financially rewarding. We are also focused on attracting and retaining top talent in a competitive market. \nWe continue to introduce improvements focused on employee development, leader effectiveness, hiring strategies,  and human capital policies and practices. We believe these improvements help us to achieve our goal to become a destination employer in the government-sponsored healthcare industry.\nAnnually, we invite all employees to participate in our engagement survey. The purpose of our survey is to obtain honest, comprehensive feedback on what is going well, and which strategic, operational or cultural concerns are top of mind for our employees. Our results demonstrate improvement and exceed industry benchmarks.\nSuccession planning and managing our talent pipelines continue to be key to our human capital strategy. We regularly monitor high performer retention and development. Our performance management practices and pay and recognition programs are aligned with meeting and exceeding our corporate objectives. The board of directors has purview to our employee engagement survey results, key executive performance, and succession planning.\nWe offer formal leadership development programs including new leader orientation, executive onboarding, front-line leadership essentials, and experienced leader development. We have targeted development plans for critical roles with an emphasis on leadership and business acumen. \nWe invest in our workforce through market competitive total rewards including pay, benefits and time-off. Our pay and recognition programs are designed to engage, motivate and reward top performers and attract new talent. To foster ownership and align the interests of employees with shareholders, we offer an Employee Stock Purchase Plan and grant equity-based compensation under our long-term incentive plan to eligible employees.\nWe also offer a comprehensive suite of benefits to all eligible employees, including, among others:\n•\nComprehensive health insurance coverage for employees working 30 hours or more per week;\n•\n401(k) employer matching contributions of up to 100% on the first 4% contributed by the employee;\n•\nPersonal time off that provides employees with paid time away from work, combining vacation and sick leave;\n•\nPaid parental leave to support bonding time for new parents; \n•\nVolunteer time off that provides employees with paid time away from work to build strong community partnerships and connect with the people we serve;\n•\nEmployee wellness programs that provide tools and incentives to live a healthy life focusing on physical, emotional, financial, and work well-being;\n•\nSupplemental life insurance and disability plans to provide financial security for our employees and their families;\n•\nEmployee discount and other programs, including tuition reimbursement; and\nMolina Healthcare, Inc. 2024 Form 10-K | 18\n•\nEmployee assistance program benefits that provide up to six confidential counseling sessions per rolling 12-month period and includes assistance with physical, emotional, and financial related matters.\nAVAILABLE INFORMATION\nOur principal executive offices are located at 200 Oceangate, Suite 100, Long Beach, California 90802, and our telephone number is (562) 435-3666. \nYou can access our website at \nwww.molinahealthcare.com\n to learn more about our Company. From that site, you can download and print copies of our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, along with amendments to those reports. You can also download our Corporate Governance Guidelines, board of directors’ committee charters, Code of Business Conduct and Ethics and Environmental, Social and Governance Report. We make periodic reports and amendments available, free of charge, as soon as reasonably practicable after we file or furnish these reports to the U.S. Securities and Exchange Commission (“SEC”). Additionally, the SEC maintains their website, http://www.sec.gov, that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. We will also provide a copy of any of our corporate governance policies published on our website free of charge, upon request. To request a copy of any of these documents, please submit your request to: Molina Healthcare, Inc., 200 Oceangate, Suite 100, Long Beach, California 90802, Attn: Investor Relations. Information on or linked to our website (including the charters, reports, policies and documents noted above) is neither part of nor incorporated by reference into this Form 10-K or any other SEC filings. \nMolina Healthcare, Inc. 2024 Form 10-K | 19",
  "item7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (“MD&A”)\nManagement’s discussion and analysis of financial condition and results of operations as of and for the years ended December 31, 2024 and 2023, are presented in the sections that follow. Our MD&A as of and for the year ended December 31, 2022, may be found in our 2023 Annual Report on Form 10-K, which prior disclosure is incorporated by reference herein. The following discussion and analysis does not include certain items related to the year ended December 31, 2022, including year-to-year comparisons between the year ended December 31, 2023 and the year ended December 31, 2022. For a comparison of our results of operations for the fiscal years ended December 31, 2023 and December 31, 2022, see “Management's Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 13, 2024.\nOVERVIEW\nMolina Healthcare, Inc., a FORTUNE 500 company, provides managed healthcare services under the Medicaid and Medicare programs, and through the state insurance marketplaces (the “Marketplace”). We served approximately 5.5 million members as of December 31, 2024, located across 21 states. \n2024 HIGHLIGHTS \nHighlights of our full-year 2024 results included the following:\n•\nNet income of $1,179 million, or $20.42 per diluted share, compared to $1,091 million, or $18.77 per diluted share in 2023;\n•\nMembership of 5.5 million at December 31, 2024, mainly reflecting the impact of our growth initiatives, which partially offset the impact of Medicaid redeterminations;\n•\nTotal revenue of $40.7 billion, which increased 19% compared to 2023;\n•\nPremium revenue of $38.6 billion, which increased 19% compared to 2023;\n•\nConsolidated medical care ratio (“MCR”) of 89.1%, compared to 88.1% in 2023;\n•\nGeneral and administrative expense ratio (“G&A ratio”) of 6.7%, which decreased from 7.2% in 2023;\n•\nInvestment income of $452 million, which increased 5% compared to 2023; and\n•\nAfter-tax margin of 2.9%, compared to 3.2% in 2023.\nGrowth Initiatives\nIn addition to delivering strong 2024 financial results, we continued to execute on our profitable growth strategy. To recap the growth milestones achieved in 2024 and early 2025: \n•\nEffective January 1, 2024, we closed our acquisition of Bright Health’s California Medicare business (Brand New Day and Central Health Plan of California);\n•\nOn January 1, 2024, we successfully launched our Nebraska health plan and launched our expanded California Medicaid platform, including Los Angeles county, which approximately doubled the size of our business in the state; \n•\nOur new contracts with New Mexico started on July 1, 2024, Texas STAR+PLUS started on September 1, 2024 and Michigan started on October 1, 2024;\n•\nSuccessfully defended RFPs for Medicaid contracts in Florida, Michigan, Mississippi, Texas, and Wisconsin and procured Medicare contracts in Idaho, Massachusetts, Michigan, and Ohio;\n•\nEffective February 1, 2025, we closed on our acquisition of ConnectiCare and expect approximately $1.2 billion of revenue, mostly in our Marketplace segment.\nCollectively, newly reported RFP successes and acquisitions in 2024 represent nearly $7 billion of incremental annual premium revenue, which will be partially realized in 2025, is expected to be mostly realized in 2026 and is expected to be fully realized in 2027 and 2028. \nMolina Healthcare, Inc. 2024 Form 10-K | 39\nFINANCIAL RESULTS SUMMARY\n \nYear Ended December 31,\n \n2024\n2023\n(In millions, except per-share amounts)\nPremium revenue\n$\n38,627 \n$\n32,529 \nLess: medical care costs \n34,428 \n28,669 \nMedical margin \n4,199 \n3,860 \nMCR \n(1)\n89.1 \n%\n88.1 \n%\nOther revenues: \nPremium tax revenue\n1,486 \n1,069 \nInvestment income\n452 \n394 \nOther revenue\n85 \n80 \nGeneral and administrative expenses\n2,743 \n2,462 \nG&A ratio \n(2)\n6.7 \n%\n7.2 \n%\nPremium tax expenses\n1,486 \n1,069 \nDepreciation and amortization \n186 \n171 \nOther \n100 \n128 \nOperating income\n1,707 \n1,573 \nInterest expense\n118 \n109 \nIncome before income tax expense\n1,589 \n1,464 \nIncome tax expense\n410 \n373 \nNet income\n$\n1,179 \n$\n1,091 \nNet income per diluted share \n$\n20.42 \n$\n18.77 \nDiluted weighted average shares outstanding \n57.7 \n58.1 \nOther Key Statistics:\nEnding Membership \n5.5 \n5.0 \nEffective income tax rate\n25.8 \n%\n25.5 \n%\nAfter-tax margin \n(3)\n2.9 \n%\n3.2 \n%\n__________________\n(1)\nMCR represents medical care costs as a percentage of premium revenue.\n(2)\nG&A ratio represents general and administrative expenses as a percentage of total revenue. \n(3)\nAfter-tax margin represents net income as a percentage of total revenue. \nCONSOLIDATED RESULTS\nNET INCOME AND OPERATING INCOME\nNet income amounted to $1,179 million, or $20.42 per diluted share in 2024, compared with net income of $1,091 million, or $18.77 per diluted share, in 2023. \nOperating income was $1,707 million in 2024, compared with $1,573 million in 2023. The increase in operating income was mainly due to the impact of increased premiums and medical margin stemming from our membership growth, improved G&A expense ratio, and increased investment income, partially offset by an increase in the consolidated MCR. In addition, the 2023 results reflect a $41 million credit loss related to 2022 Marketplace risk adjustment receivables. \nMolina Healthcare, Inc. 2024 Form 10-K | 40\nPREMIUM REVENUE\nPremium revenue increased $6.1 billion, or 19%, in 2024, when compared with 2023. The higher premium revenue reflects the impact of a balanced combination of the new Medicaid contract wins, acquisitions, and growth in our current footprint, partially offset by the impact of Medicaid redeterminations.\nMEDICAL CARE RATIO\nThe consolidated MCR increased to 89.1% in 2024, compared with 88.1% in 2023, or 100 basis points, and was slightly above our long-term range. The increase is driven mainly by our Medicaid segment, mainly reflecting the continued impact of redetermination-related acuity shifts, higher utilization among our continuing population, particularly in the second half of 2024, and higher initial MCRs related to new contracts, expansion and the My Choice acquisition, partially offset by minimum MLRs and medical cost corridors, continued disciplined medical cost management and year-over-year improvement in our Medicaid and Marketplace segments. See further discussion in “Reportable Segments—Segment Financial Performance,” below.\nPrior year reserve development has been favorable in 2024, but its impact on earnings has been mostly absorbed by minimum MLRs and medical cost corridors.\nPREMIUM TAX REVENUE AND EXPENSES\nThe premium tax ratio increased to 3.7% in 2024, compared with 3.2% in 2023, due mainly to the reinstatement of the California MCO tax by the state’s Department of Health Care Services effective April 1, 2023, and changes in business mix.\nINVESTMENT INCOME\nInvestment income increased to $452 million in 2024, compared with $394 million in 2023. The increase was primarily driven by an increase in invested assets. \nOTHER REVENUE\nOther revenue increased slightly to $85 million in 2024, compared with $80 million in 2023. Other revenue mainly includes service revenue associated with long-term services and supports consultative services we provide in Wisconsin.\nGENERAL AND ADMINISTRATIVE (“G&A”) EXPENSES\nThe G&A ratio was 6.7% in 2024, compared to 7.2% in 2023. The G&A ratio in 2024 reflects operating discipline, including labor cost management and vendor management, and the continued benefit of fixed cost leverage as we grow our business, partially offset by new business implementation costs associated with the Nebraska and California Medicaid contracts that started in January 2024 and the New Mexico Medicaid contract that started on July 1, 2024. \nDEPRECIATION AND AMORTIZATION\nDepreciation and amortization was $186 million in 2024, compared with $171 million in 2023. The increase is due to impacts of the My Choice Wisconsin and Bright Health Medicare acquisitions.\nOTHER OPERATING EXPENSES\nOther operating expenses totaled $100 million in 2024, compared with $128 million in 2023. The change is primarily due to the $41 million credit loss on 2022 Marketplace risk adjustment receivables recorded in the third quarter of 2023. This was partially offset by increases in non-recurring costs associated with acquisitions. Other operating expenses also include service costs associated with long-term services and supports consultative services we provide in Wisconsin, as noted above.\nINTEREST EXPENSE\nInterest expense was $118 million in 2024, compared with $109 million in 2023. The increase is due to borrowings under the Credit Facility occurring in the third quarter of 2024 and the new $750 million 6.250% Notes due 2033 that were issued in November 2024.\nINCOME TAXES\nIncome tax expense amounted to $410 million in 2024, or 25.8% of pretax income, compared with income tax expense of $373 million in 2023, or 25.5% of pretax income. The difference in the effective tax rate is primarily due to an increase in state and local income taxes and differences in discrete tax benefits recognized in the respective periods, net of a decrease in nondeductible expenses.\nMolina Healthcare, Inc. 2024 Form 10-K | 41\nREPORTABLE SEGMENTS\nAs of December 31, 2024, we served approximately 5.5 million members eligible for Medicaid, Medicare, and other government-sponsored healthcare programs for low-income families and individuals, including Marketplace members, most of whom receive government premium subsidies.\nWe currently have reportable segments consisting of: 1) Medicaid; 2) Medicare; 3) Marketplace; and 4) Other.\nThe Medicaid, Medicare, and Marketplace segments represent the government-funded or sponsored programs under which we offer managed healthcare services. The Other segment, which is insignificant to our consolidated results of operations, includes long-term services and supports consultative services in Wisconsin.\nSee \"Item 1. Business,” for further description of our segments.\nHOW WE ASSESS PERFORMANCE\nWe derive our revenues primarily from health insurance premiums. Our primary customers are state Medicaid agencies and the federal government.\nThe key metrics used to assess the performance of our Medicaid, Medicare, and Marketplace segments are premium revenue, medical margin and medical care ratio (“MCR”). MCR represents the amount of medical care costs as a percentage of premium revenue. Therefore, the underlying medical margin, or the amount earned by the Medicaid, Medicare, and Marketplace segments after medical costs are deducted from premium revenue, represents the most important measure of earnings reviewed by management, and is used by our chief executive officer, who is our chief operating decision maker, to review results, assess performance, and allocate resources. The key metric used to assess the performance of our Other segment is service margin. The service margin is equal to service revenue minus cost of service revenue. \nManagement’s discussion and analysis of the change in medical margin is discussed below under “Segment Financial Performance.” For more information, see Notes to Consolidated Financial Statements, Note 16, “Segments.”\nTRENDS AND UNCERTAINTIES\nFor a discussion of the trends, uncertainties and other developments that affected our reportable segments, refer to “Item 1. Business—Our Business,” “—Trends and Uncertainties,” “—Legislative and Political Environment,” “—Operations—Medical Management,” and “—Regulation.”\nSEGMENT FINANCIAL PERFORMANCE\nThe following table summarizes our membership by segment as of the dates indicated:\nAs of December 31,\n2024\n2023\nMedicaid\n4,890,000 \n4,542,000 \nMedicare\n242,000 \n172,000 \nMarketplace\n403,000 \n281,000 \nTotal\n5,535,000 \n4,995,000 \nThe tables below summarize premium revenue, medical margin, and MCR by segment for the periods indicated (dollars in millions):\nYear Ended December 31,\n2024\n2023\nPremium Revenue\nMedical Margin\nMCR\nPremium Revenue\nMedical Margin\nMCR\nMedicaid \n$\n30,579 \n$\n2,979 \n90.3 \n%\n$\n26,327 \n$\n2,973 \n88.7 \n%\nMedicare \n5,542 \n603 \n89.1 \n4,179 \n388 \n90.7 \nMarketplace\n2,506 \n617 \n75.4 \n2,023 \n499 \n75.3 \nTotal\n$\n38,627 \n$\n4,199 \n89.1 \n%\n$\n32,529 \n$\n3,860 \n88.1 \n%\nMolina Healthcare, Inc. 2024 Form 10-K | 42\nMedicaid\nKey factors affecting results for this segment include:\n•\nOur growth initiatives, including acquisitions and expansion into new states, drove an increase in member months during the year, despite the impact of redeterminations, and changes in membership mix; \n•\nImpact of redetermination, including the loss of approximately 675,000 members, and a moderate impact from the effect of acuity shifts, net of the beneficial impact of risk corridors; and\n•\nContinued focus on managing medical costs amid higher-than-expected utilization, particularly in LTSS, pharmacy and behavioral health services. \nMedicaid premium revenue increased $4.3 billion, or 16% in 2024, when compared with 2023. The higher premium revenue reflects new contract wins in Iowa (commenced in July 2023), Nebraska (commenced in January 2024), and New Mexico (commenced in July 2024), expansions in California and Texas that commenced in January 2024, and September 2024, respectively, and the My Choice acquisition that closed in September 2023. These increases were partially offset by the impact of Medicaid redetermination. \nThe medical margin of our Medicaid program increased $6 million in 2024, when compared with 2023. The change was driven by the impact of increased premium revenues associated with the membership growth discussed above, partially offset by an increase in the MCR, as discussed below. \nThe Medicaid MCR increased 160 basis points to 90.3% in 2024, from 88.7% in 2023. The increase was mainly attributable to the continued impact of redetermination-related acuity shifts, higher utilization among our continuing population, particularly in the second half of the year, and a temporal dislocation between premium rates and medical trend. Also, approximately 30 basis points of the increase is driven by the higher initial MCR associated with the start of new contracts and the My Choice acquisition, and approximately 20 basis points was due to a prior year retroactive premium rate reduction in our California business. The increase was partially offset by minimum MLR and medical cost corridors, and medical cost management. Excluding new contracts and the My Choice acquisition, our legacy Medicaid MCR for the year ended December 31, 2024 is above our long-term target range. \nMedicare\nKey factors affecting results for this segment include:\n•\nPricing and benefit design changes implemented in 2024;\n•\nIncreased utilization of LTSS benefits, high-cost drugs, and outpatient services; and \n•\nThe impact of risk-adjusted premiums that are more commensurate with the acuity of our membership.\nMedicare premium revenue increased $1.4 billion, or 33%, in 2024 compared to 2023. The increase was primarily due to the Bright Health Medicare acquisition that closed on January 1, 2024, the impact of MAPD and D-SNP membership expansion and organic membership growth in existing states, and increased premiums that are more commensurate with the acuity of our population. \nThe medical margin for Medicare increased $215 million in 2024 compared to 2023. The increase was mainly due to the year-over-year growth in membership and premium revenues combined with the decrease in MCR discussed below. \nThe Medicare MCR decreased to 89.1% in 2024, from 90.7% in 2023, or 160 basis points, primarily driven by higher risk adjustment premiums that are commensurate with the acuity of our membership, pricing and benefit design changes implemented in 2024 and operational improvements, partially offset by elevated LTSS and pharmacy costs and higher outpatient utilization within our D-SNP population. The Medicare MCR for the year ended December 31, 2024 is above our long-term target range. \nMarketplace\nKey factors affecting results for this segment include:\n•\nExecution of our product and pricing strategy, to achieve growth and repositioning in the metallic tier membership mix, while maintaining target margins; and\n•\nAchievement of member risk scores and associated risk-adjusted premium that are commensurate with the health status, or acuity, of our Marketplace members.\nMarketplace premium revenue increased $483 million in 2024 compared to 2023. The increase was mainly due to an increase in membership. Our Marketplace membership as of December 31, 2024, amounted to 403,000 members, representing an increase of 122,000 members compared to December 31, 2023, which is in line with our \nMolina Healthcare, Inc. 2024 Form 10-K | 43\nproduct and pricing strategy to achieve growth, while maintaining target margins in this segment, and membership gained from redeterminations this year. \nThe Marketplace medical margin increased $118 million in 2024, primarily due to the growth in premiums and margin associated with the higher membership and the impact of MCR changes discussed below. \nThe Marketplace MCR was 75.4% in 2024 and 75.3% in 2023. The MCR in each year reflects our product and pricing strategy to achieve growth and maintain target margins, changes in membership mix, risk adjustment premiums that are more commensurate with the acuity of our membership, and continued operational improvements. Our 2024 Marketplace MCR was well below our long-term target range.\nOther\nThe Other segment includes service revenues and costs associated with the long-term services and supports consultative services we provide in Wisconsin, and also includes certain corporate amounts not allocated to the Medicaid, Medicare, or Marketplace segments. Such amounts were immaterial to our consolidated results of operations for 2024 and 2023.\nLIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nLIQUIDITY\nWe manage our cash, investments, and capital structure to meet the short- and long-term obligations of our business while maintaining liquidity and financial flexibility. We forecast, analyze, and monitor our cash flows to enable prudent investment management and financing within the confines of our financial strategy.\nWe maintain liquidity at two levels: 1) the regulated health plan subsidiaries; and 2) the parent company. \nOur regulated health plan subsidiaries’ primary liquidity requirements include payment of medical claims and other health care services; payment of certain settlements with our state and federal customers, such as minimum medical loss ratio and risk corridors and Marketplace risk transfers on behalf of CMS; general and administrative costs directly incurred or paid through an administrative services agreement to the parent company; and federal tax payments to the parent company under an intercompany tax sharing agreement. Our regulated health plan subsidiaries meet their liquidity needs by generating cash flows from operating activities, primarily from premium revenue; cash flows from investing activities, including investment income and sales of investments; and capital contributions received from our parent company.\nOur regulated health plan subsidiaries are each subject to applicable state regulations that, among other things, require the maintenance of minimum levels of capital and surplus. We continue to maintain levels of aggregate excess statutory capital and surplus in our regulated health plan subsidiaries that we believe are appropriate. See further discussion under “Regulatory Capital and Dividend Restrictions” below. When available and as permitted by applicable regulations, cash in excess of the capital needs of our regulated health plan subsidiaries is generally paid in the form of dividends to our parent company to be used for general corporate purposes. The regulated health plan subsidiaries paid dividends to the parent company amounting to $997 million in 2024 and $705 million in 2023. \nParent company liquidity requirements generally consist of payment of administrative costs not directly incurred by our regulated operations, including, but not limited to, staffing costs, lease payments, branding and certain information technology services; capital contributions paid to our regulated health plan subsidiaries, including funding for newer health plans; capital expenditures; debt service; funding for common stock purchases, acquisitions and other growth-related activities; and federal tax payments. The parent company contributed capital of $490 million and $221 million in 2024 and 2023, respectively, to our regulated health plan subsidiaries to satisfy statutory capital and surplus requirements. The higher contributions in 2024 were mainly attributed to fund our California, Iowa, Nebraska, and Wisconsin health plans. Our parent company normally meets its liquidity requirements from administrative services fees earned under administrative services agreements; dividends received from our regulated subsidiaries; federal tax payments collected from the regulated subsidiaries; proceeds received from the issuance of debt and equity securities; and cash flows from investing activities, including investment income and sales of investments. \nCash, cash equivalents and investments at the parent company amounted to $445 million and $742 million as of December 31, 2024, and 2023, respectively. The decrease in 2024 was primarily due to funding of our Bright Health Medicare acquisition for $441 million and the purchase of approximately 3.1 million shares of our stock for $1.0 billion in the third and fourth quarter of 2024, partially offset by the $740 million net proceeds from issuing the new 6.250% Notes, net inflows from dividends received from and capital contributions made to our regulated health plan subsidiaries, and the timing of corporate payments. \nMolina Healthcare, Inc. 2024 Form 10-K | 44\nInvestments\nAfter considering expected cash flows from operating activities, we generally invest cash of regulated subsidiaries that exceeds our expected short-term obligations in longer term, investment-grade, and marketable debt securities to improve our overall investment return. These investments are made pursuant to board-approved investment policies which conform to applicable state laws and regulations. \nOur investment policies are designed to provide liquidity, preserve capital, and maximize total return on invested assets, all in a manner consistent with state requirements that prescribe the types of instruments in which our subsidiaries may invest. These investment policies require that our investments have final maturities of less than 15 years, or less than 15 years average life for structured securities. Professional portfolio managers operating under documented guidelines manage our investments and a portion of our cash equivalents. Our portfolio managers must obtain our prior approval before selling investments where the loss position of those investments exceeds certain levels. \nThe overall rating of our portfolio is AA-. Our investment policy has directives in conjunction with state guidelines to minimize risks and exposures in volatile markets. Additionally, our portfolio managers assist us in navigating the current volatility in the capital markets. \nOur restricted investments are invested principally in cash, cash equivalents, U.S. Treasury securities, and corporate debt securities; we have the ability to hold such restricted investments until maturity. All of our unrestricted investments are classified as current assets. \nCash Flow Activities\nOur cash flows are summarized as follows:\nYear Ended December 31,\n2024\n2023\nChange\n(In millions)\nNet cash provided by operating activities\n$\n644 \n$\n1,662 \n$\n(1,018)\nNet cash used in investing activities\n(464)\n(744)\n280 \nNet cash used in financing activities\n(347)\n(58)\n(289)\nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(167)\n$\n860 \n$\n(1,027)\nOperating Activities\nWe typically receive capitation payments monthly, in advance of payments for medical claims; however, government payors may adjust their payment schedules, positively or negatively impacting our reported cash flows from operating activities in any given period. For example, government payors may delay our premium payments, or they may prepay the following month’s premium payment. \nNet cash provided by operations was $644 million in 2024, compared with $1,662 million in 2023. The $1,018 million decrease in 2024 cash flow was due to timing differences in government receivables and payables, including the receipt of Medicare and Medicaid 2024 premium prepayments in the 2023 period, and increased risk corridor settlement activity in 2024. \nInvesting Activities\n \nNet cash used in investing activities was $464 million in 2024, compared with $744 million in 2023. The change in cash flow was primarily due to a $295 million net cash outflow related to the Bright Health Medicare acquisition in January 2024, and $49 million for final purchase consideration paid for the My Choice Wisconsin acquisition, offset by the net activity of proceeds and purchases of investments, which were net purchases of $21 million in 2024 and net purchases of $661 million in 2023. \nFinancing Activities\nNet cash used in financing activities was $347 million in 2024, compared with $58 million in 2023, a decrease in year-over-year cash flow of $289 million. In 2024, financing activity included $740 million of net proceeds from the issuance of the $750 million 6.250% Notes due 2033, offset by common stock purchases of $1,000 million and $300 million in gross borrowings and payments under the Credit Facility. In 2024 and 2023, cash outflows included $57 million and $60 million, respectively, for common stock withheld to settle employee tax obligations. \nMolina Healthcare, Inc. 2024 Form 10-K | 45\nFINANCIAL CONDITION\nWe believe that our cash resources, borrowing capacity available under our Credit Agreement as discussed further below in “Future Sources and Uses of Liquidity—Future Sources,” and internally generated funds will be sufficient to support our operations, regulatory requirements, debt repayment obligations and capital expenditures for at least the next 12 months.\nOn a consolidated basis, as of December 31, 2024, our working capital was $4.9 billion compared with $4.4 billion as of December 31, 2023. At December 31, 2024, our cash and investments amounted to $9.3 billion, compared with $9.4 billion of cash and investments at December 31, 2023. A significant portion of our portfolio is held in cash and cash equivalents and we do not anticipate the fluctuations in the aggregate fair value of our financial assets to have a material impact on our liquidity or capital position since we intend to hold our securities to maturity. Net unrealized losses on our investments classified as current and available for sale decreased to $75 million at December 31, 2024 compared to $108 million at December 31, 2023. We have determined that the unrealized losses primarily resulted from fluctuating interest rates, rather than a deterioration of the creditworthiness of the issuers. \nBecause of the statutory restrictions that inhibit the ability of our health plan subsidiaries to transfer net assets to us, the amount of retained earnings readily available to pay dividends to our stockholders is generally limited to cash, cash equivalents and investments held by our unregulated parent. For more information, see the “Liquidity”\n \ndiscussion presented above.\nRegulatory Capital and Dividend Restrictions \nEach of our regulated, wholly owned subsidiaries must maintain a minimum amount of statutory capital determined by statute or regulations. Such statutes, regulations and capital requirements also restrict the timing, payment and amount of dividends and other distributions, loans or advances that may be paid to us as the sole stockholder. To the extent our subsidiaries must comply with these regulations, they may not have the financial flexibility to transfer funds to us. Based upon current statutes and regulations, the minimum capital and surplus requirement for these subsidiaries was estimated to be approximately $2.6 billion at  December 31, 2024 and $2.3 billion at December 31, 2023. The aggregate capital and surplus of our wholly owned subsidiaries was in excess of these minimum capital requirements as of both dates. \nUnder applicable regulatory requirements, the amount of dividends that may be paid by our wholly owned subsidiaries without prior approval by regulatory authorities as of December 31, 2024, was approximately $400 million in the aggregate. The subsidiaries may pay dividends over this amount, but only after approval is granted by the regulatory authorities. \nBased on our cash and investments balances as of December 31, 2024, management believes that our regulated wholly owned subsidiaries remain well capitalized and exceed their regulatory minimum requirements. We have the ability, and have committed to provide, additional capital to each of our health plans as necessary to ensure compliance with minimum statutory capital and surplus requirements.\nCapital Structure\nIn October 2024, our board of directors authorized the purchase of up to $1 billion of our common stock. This new program supersedes the stock purchase program previously approved by our board of directors in September 2023 and extends through December 31, 2025. \nAs debt held by the parent company comes due, we typically engage in a new private offering of debt to retire and replace the prior issuance. In addition, on November 18, 2024 (the “Settlement Date”), we completed a private offering of $750 million aggregate principal amount of our 6.250% Senior Notes due 2033 (the “6.250% Notes”) pursuant to an indenture, dated as of the Settlement Date with U.S. Bank Trust Company and National Association, as trustee. The 6.250% Notes bear interest at a rate of 6.250% per year. Interest on the 6.250% Notes is payable semi-annually in arrears on January 15 and July 15 of each year, commencing July 15, 2025. Interest accrues from the Settlement Date. The 6.250% Notes will mature on January 15, 2033. \nFor several years we saw a continued decline in interest rates, which benefited our overall cost of capital during that time. However, interest rates have increased since we issued our 3.875% Notes due 2032 in 2021, as we experienced with our most recent issuance of our 6.250% Notes in 2024. Accordingly, future refinancing may occur at a higher rate than those we have achieved historically. This would increase our cost of capital in the future or may cause us to pursue alternative financing sources, should the need arise.\nWe are not a party to any off-balance sheet financing arrangements.\nMolina Healthcare, Inc. 2024 Form 10-K | 46\nDebt Ratings\nEach of our senior notes is rated “BB” by Standard & Poor’s, and “Ba2” by Moody’s Investor Service, Inc. A downgrade in our ratings could adversely affect our borrowing capacity and increase our borrowing costs. \nFinancial Covenants\nOur Credit Agreement contains customary non-financial and financial covenants, including a net leverage ratio and an interest coverage ratio. Such ratios are computed as defined by the terms of the Credit Agreement. \nIn addition, the indentures governing each of our outstanding senior notes contain cross-default provisions that are triggered upon default by us or any of our subsidiaries on any indebtedness in excess of the amount specified in the applicable indenture. As of December 31, 2024, we were in compliance with all financial and non-financial covenants under the Credit Agreement and other long-term debt.\nFUTURE SOURCES AND USES OF LIQUIDITY\nFuture Sources\nOur regulated subsidiaries generate significant cash flows from premium revenue, which is generally received a short time before related healthcare services are paid. Premium revenue is our primary source of liquidity. Thus, any decline in the receipt of premium revenue, and our profitability, could have a negative impact on our liquidity.\nDividends from Subsidiaries. \nWhen available and as permitted by applicable regulations, cash in excess of the capital needs of our regulated health plans is generally paid in the form of dividends to our unregulated parent company to be used for general corporate purposes. For more information on our regulatory capital requirements and dividend restrictions, refer to Notes to Consolidated Financial Statements, Note 15, “Commitments and Contingencies—Regulatory Capital Requirements and Dividend Restrictions,” and Note 17, “Condensed Financial Information of Registrant—Note C - Dividends and Capital Contributions.”\nCredit Agreement Borrowing Capacity.\n On September 20, 2024, we entered into a Second Amendment to our Credit Agreement, which, among other things, increased available commitments under our revolving credit facility (“Credit Facility”) to $1.25 billion, and extended the termination date of lending commitments to September 20, 2029. The Credit Agreement also provides for a $15 million swingline sub-facility and a $100 million letter of credit sub-facility, as well as incremental term loans available to finance certain acquisitions up to $800 million, plus an unlimited amount of such term loans as long as we maintain a minimum consolidated net leverage ratio. As of December 31, 2024, we had available borrowing capacity of $1.25 billion under the Credit Agreement. See further discussion in the Notes to Consolidated Financial Statements, Note 11, “Debt.” \nFuture Uses\nCommon Stock Purchases. \nIn October 2024, our board of directors authorized the purchase of up to $1 billion of our common stock. This new program extends through December 31, 2025 and supersedes the stock purchase program previously approved by our board of directors in September 2023. The exact timing and amount of any repurchase is determined by management based on market conditions and share price, in addition to other factors, and repurchases generally will be made in accordance with the volume, price, and timing parameters under Rule 10b-18 of the Securities Exchange Act of 1934, as amended. As of February 11, 2025, $500 million remained available to purchase our common stock under this program through December 31, 2025. See further information in the Notes to Consolidated Financial Statements, Note 13, “Stockholders' Equity.”\nAcquisitions\n. We have a disciplined and steady approach to growth. Organic growth, which includes leveraging our existing health plan portfolio and winning new territories, is our highest priority. In addition to organic growth, we will consider targeted acquisitions that are a strategic fit that we believe will leverage operational synergies, and lead to incremental earnings accretion. For further information on our acquisitions, refer to the Notes to Consolidated Financial Statements, Note 4, “Business Combinations.”\nConnecticut Acquisition—Marketplace and Medicare. \nEffective February 1, 2025, we closed on our acquisition of 100% of the issued and outstanding capital stock of ConnectiCare Holding Company, Inc. The purchase price for the transaction was $350 million.\nRegulatory Capital Requirements and Dividend Restrictions. \nWe have the ability, and have committed to provide, additional capital to each of our health plans as necessary to ensure compliance with minimum statutory capital requirements.\nThe Molina Healthcare Charitable Foundation.\n In 2020, we announced our formation of The Molina Healthcare Charitable Foundation (the “Foundation”), an independent not-for-profit charitable foundation. We have contributed \nMolina Healthcare, Inc. 2024 Form 10-K | 47\n$20 million to the Foundation on a cumulative basis as of December 31, 2024. Since 2021, the Molina Healthcare Charitable Foundation has funded over 800 grants to local community organizations in 27 states that address social determinants of health, disaster relief, behavioral health, maternal child health, and other health-related concerns that our afflicting our communities in need.\nContractual Obligations. \nWe are party to various contractual obligations that we will be required to satisfy over the short and long term. The majority are discussed in the Notes to Consolidated Financial Statements and primarily include the following: \n•\nMedical claims and benefits payable.\n See Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” and Note 10, “Medical Claims and Benefits Payable,” for further detail. \n•\nAmounts due government agencies.\n See Notes to Consolidated Financial Statements, Notes 2, “Significant Accounting Policies,” for further detail.\n•\nDebt obligations.\n See Notes to Consolidated Financial Statements, Note 11, “Debt,” for further detail of our long-term debt and the timing of expected future payments. Interest payments are paid semi-annually. \n•\nLeases.\n See Notes to Consolidated Financial Statements, Note 8, “Leases,” for further detail of our finance and operating lease obligations and the timing of expected future payments.  \nSome items are based on management’s estimates and assumptions about obligations, including duration, the possibility of renewal, anticipated actions by third parties, and other factors. Because these estimates and assumptions are necessarily subjective, the contractual obligations we will actually pay in future periods may vary. Additionally, we have a variety of other contractual agreements related to acquiring services used in our operations. However, we believe these other agreements do not contain material non-cancelable commitments. \nCRITICAL ACCOUNTING ESTIMATES\nWhen we prepare our consolidated financial statements, we use estimates and assumptions that may affect reported amounts and disclosures. Actual results could differ from these estimates, and some differences could be material. Our most significant accounting estimates, which include a higher degree of judgment and/or complexity, include the following:\n•\nMedical costs, claims and benefits payable. \nSee discussion below, and refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” and Note 10, “Medical Claims and Benefits Payable” for more information.\n•\nPremium Revenue Recognition and Amounts Due Government Agencies: Risk Adjustment.\n For a discussion of this topic, including amounts recorded in our consolidated financial statements, refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies.” \n•\nBusiness Combinations, and Goodwill and intangible assets, net.\n For a comprehensive discussion of this topic, including amounts recorded in our consolidated financial statements, refer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” Note 4, “Business Combinations,” and Note 9, “Goodwill and Intangible Assets, Net.”\nMEDICAL CARE COSTS, MEDICAL CLAIMS AND BENEFITS PAYABLE\nMedical care costs are recognized in the period in which services are provided and include fee-for-service claims, pharmacy benefits, capitation payments to providers, and various other medically-related costs. Under fee-for-service claims arrangements with providers, we retain the financial responsibility for medical care provided and incur costs based on actual utilization of hospital and physician services. Such medical care costs include amounts paid by us as well as estimated medical claims and benefits payable for costs that were incurred but not paid as of the reporting date (“IBNP”). Pharmacy benefits represent payments for members' prescription drug costs, net of rebates from drug manufacturers. We estimate pharmacy rebates based on historical and current utilization of prescription drugs and contractual provisions. Capitation payments represent monthly contractual fees paid to providers, who are responsible for providing medical care to members, which could include medical or ancillary costs like dental, vision and other supplemental health benefits. Such capitation costs are fixed in advance of the periods covered and are not subject to significant accounting estimates. Other medical care costs include all medically-related administrative costs, amounts due to providers pursuant to risk-sharing or other incentive arrangements, provider claims, claim overpayment recoveries, and other healthcare expenses. Examples of medically-related administrative costs include expenses relating to health education, quality assurance, case management, care coordination, disease management, and 24-hour on-call nurses. Additionally, we include an estimate for the cost of settling claims incurred through the reporting date in our medical claims and benefits payable liability.\nMolina Healthcare, Inc. 2024 Form 10-K | 48\nThe following table illustrates consolidated medical care costs by type for the periods indicated: \n \nYear Ended December 31,\n \n2024\n2023\nAmount\n% of\nTotal\nAmount\n% of\nTotal\n(In millions)\nFee-for-service\n$\n25,386 \n73.7 \n%\n$\n21,415 \n74.7 \n%\nPharmacy\n4,331 \n12.6 \n3,987 \n13.9 \nCapitation\n3,048 \n8.9 \n1,651 \n5.8 \nOther\n1,663 \n4.8 \n1,616 \n5.6 \nTotal\n$\n34,428 \n100.0 \n%\n$\n28,669 \n100.0 \n%\nMedical claims and benefits payable consist mainly of fee-for-service IBNP, unpaid pharmacy claims, capitation costs, other medical costs, including amounts payable to providers pursuant to risk-sharing or other incentive arrangements, and amounts payable to providers on behalf of certain state agencies for certain state assessments in which we assume no financial risk. IBNP includes the costs of claims incurred as of the balance sheet date which have been reported to us, and our best estimate of the cost of claims incurred but not yet reported to us. When more complete claims payment information and healthcare cost trend data becomes available, we reflect changes in these estimates as an increase or decrease to medical care costs in the consolidated results of operations in the period in which they are determined.\nThe estimation of the IBNP liability requires a significant degree of judgment in applying actuarial methods, determining the appropriate assumptions and considering numerous factors. Of those factors, we consider estimated completion factors (measures the cumulative percentage of claims expense that will ultimately be paid for a given month of service based on historical payment patterns) and the assumed healthcare cost trend (the year-over-year change in per-member per-month medical care costs) to be the most critical assumptions. Other relevant factors also include, but are not limited to, healthcare service utilization trends, claim inventory levels, changes in membership, product mix, seasonality, benefit changes or changes in fee schedules, provider contract changes, prior authorizations and the incidence of catastrophic or pandemic cases.\nFor claims incurred more than three months before the financial statement date, we mainly use estimated completion factors to estimate the ultimate cost of those claims. Completion factors measure the cumulative percentage of claims expense that will ultimately be paid for a given month of service based on historical claims payment patterns. We analyze historical claims payment patterns by comparing claim incurred dates to claim payment dates to estimate completion factors. The estimated completion factors are then applied to claims paid through the financial statement date to estimate the ultimate claims cost for a given month’s incurred claim activity. The difference between the estimated ultimate claims cost and the claims paid through the financial statement date represents our estimate of claims remaining to be paid as of the financial statement date and is included in our IBNP liability\n.\nFor claims incurred within three months before the financial statement date, actual claims paid are a less reliable measure of our ultimate cost since a large portion of medical claims are not submitted to us until several months after services have been provided. Accordingly, we estimate our IBNP liability for claims incurred during these months based on a blend of estimated completion factors and assumed medical care cost trend. The assumed medical care cost trend represents the year-over-year change in per-member per-month medical care costs, which can be affected by many factors including, but not limited to, our ability and practices to manage medical and pharmaceutical costs, changes in level and mix of services utilized, mix of benefits offered, including the impact of co-pays and deductibles, changes in medical practices, changes in member demographics, catastrophes and epidemics\n,\n and other relevant factors.\nActuarial standards of practice generally require a level of confidence such that our overall best estimate of the IBNP liability has a greater probability of being adequate versus being insufficient, where the liability is sufficient to account for moderately adverse conditions. Accordingly, our reserving practice is to consistently recognize the actuarial best estimate including a provision for moderately adverse conditions for each current period. This provision is reported as part of “Components of medical care costs related to: Current year” in the table presented in Note 10, “Medical Claims and Benefits Payable.” Adverse conditions are situations that may cause actual claims to be higher than the otherwise estimated value of such claims at the time of the estimate, such as changes in the magnitude or severity of claims, uncertainties related to our entry into new geographical markets or provision of \nMolina Healthcare, Inc. 2024 Form 10-K | 49\nservices to new populations, changes in state-controlled fee schedules, and modifications or upgrades to our claims processing systems and practices. Therefore, in many situations, the claim amounts ultimately settled will be less than the estimate that satisfies the actuarial standards of practice. \nWhen subsequent actual claims payments are less than we estimated, we recognize a benefit for favorable prior period development that is reported as part of “Components of medical care costs related to: Prior years” in the table presented in Note 10. Assuming stability in the size of our membership, the use of this consistent methodology, during any given period, usually results in the replenishment of reserves at a level that generally offsets the benefit of favorable prior period development in that period. In the case of material growth or decline of membership, replenishment can exceed or fall short of the favorable development, assuming all other factors remain unchanged.\nBecause of the significant degree of judgment involved in estimation of our IBNP liability, there is considerable variability and uncertainty inherent in such estimates. The following table reflects the hypothetical change in our estimate of claims liability as of December 31, 2024 that would result if we change our completion factors for the fourth through the twelfth months preceding December 31, 2024, by the percentages indicated. A reduction in the completion factor results in an increase in medical claims liabilities. Dollar amounts are in millions.\nIncrease (Decrease) in Estimated Completion Factors\nIncrease \n(Decrease) \nin Medical Claims \nand\nBenefits Payable\n(6)%\n$\n1,139 \n(4)%\n759 \n(2)%\n380 \n2%\n(380)\n4%\n(759)\n6%\n(1,139)\nThe following table reflects the hypothetical change in our estimate of claims liability as of December 31, 2024 that would result if we alter our assumed medical care cost trend factors by the percentages indicated. An increase in the PMPM costs results in an increase in medical claims liabilities. Dollar amounts are in millions.\n(Decrease) Increase in Trended Per Member Per Month Cost Estimates\n(Decrease) \nIncrease \nin Medical Claims \nand\nBenefits Payable\n(6)%\n$\n(394)\n(4)%\n(262)\n(2)%\n(131)\n2%\n131 \n4%\n262 \n6%\n394 \nThere are many related factors working in conjunction with one another that determine the accuracy of our estimates, some of which are qualitative in nature rather than quantitative. Therefore, we are seldom able to quantify the impact that any single factor has on a change in estimate. Given the variability inherent in the reserving process, we will only be able to identify specific factors if they represent a significant departure from expectations. As a result, we do not expect to be able to fully quantify the impact of individual factors on changes in estimates.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nRefer to the Notes to Consolidated Financial Statements, Note 2, “Significant Accounting Policies,” for a discussion of recent accounting pronouncements that affect us.\nMolina Healthcare, Inc. 2024 Form 10-K | 50",
  "item2": null
}