{
  "source_file": "mos-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations should be read in conjunction with the material under the heading “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in the Annual Report on Form 10-K of The Mosaic Company filed with the Securities and Exchange Commission for the year ended December 31, 2024 (the “\n10-K Report\n”) and the material under Item 1 of Part I of this report.\nThroughout the discussion below, we measure units of production, sales and raw materials in metric tonnes, which are the equivalent of 2,205 pounds, unless we specifically state we mean long ton(s), which are the equivalent of 2,240 pounds. In the following tables, there are certain percentages that are not considered to be meaningful and are represented by “NM.”\nResults of Operations\nThe following table shows the results of operations for the three and nine months ended September 30, 2025 and September 30, 2024:\n26\nTable of Contents\nThree months ended\nNine months ended\nSeptember 30,\n2025-2024\nSeptember 30,\n2025-2024\n(in millions, except per share data)\n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nNet sales\n$\n3,452.1 \n$\n2,810.9 \n$\n641.2 \n23 \n%\n$\n9,078.7 \n$\n8,306.9 \n$\n771.8 \n9 \n%\nCost of goods sold\n2,899.8 \n2,394.1 \n505.7 \n21 \n%\n7,519.4 \n7,096.9 \n422.5 \n6 \n%\nGross margin\n552.3\n416.8\n135.5 \n33 \n%\n1,559.3\n1,210.0\n349.3 \n29 \n%\nGross margin percentage\n16%\n15%\n17%\n15%\nSelling, general and administrative expenses\n125.5\n148.2\n(22.7)\n(15)\n%\n415.3\n383.4\n31.9 \n8 \n%\nOther operating expense\n87.0\n153.2\n(66.2)\n(43)\n%\n221.3\n305.0\n(83.7)\n(27)\n%\nOperating earnings\n339.8\n115.4\n224.4 \n194 \n%\n922.7\n521.6\n401.1 \n77 \n%\nInterest expense, net\n(45.6)\n(41.7)\n(3.9)\n9 \n%\n(139.3)\n(136.1)\n(3.2)\n2 \n%\nForeign currency transaction gain (loss)\n(1.2)\n100.9\n(102.1)\nNM\n301.3\n(267.3)\n568.6 \nNM\nOther income (expense)\n306.3\n(0.4)\n306.7 \nNM\n391.7\n6.8\n384.9 \nNM\nEarnings from consolidated companies before income taxes\n599.3\n174.2\n425.1 \nNM\n1,476.4\n125.0\n1,351.4 \nNM\nProvision for income taxes\n175.5\n48.0\n127.5 \nNM\n384.8\n152.9\n231.9 \n152 \n%\nEarnings (loss) from consolidated companies\n423.8\n126.2\n297.6 \nNM\n1,091.6\n(27.9)\n1,119.5 \nNM\nEquity in net earnings of nonconsolidated companies\n0.3\n4.5\n(4.2)\n(93)\n%\n2.2\n64.2\n(62.0)\n(97)\n%\nNet earnings including noncontrolling interests\n424.1\n130.7\n293.4 \nNM\n1,093.8\n36.3\n1,057.5 \nNM\nLess: Net earnings attributable to noncontrolling interests\n12.7\n8.5\n4.2 \n49 \n%\n33.6\n30.4\n3.2 \n11 \n%\nNet earnings attributable to Mosaic\n$\n411.4\n$\n122.2\n$\n289.2 \nNM\n$\n1,060.2\n$\n5.9\n$\n1,054.3 \nNM\nDiluted net earnings per share attributable to Mosaic\n$\n1.29\n$\n0.38\n$\n0.91 \nNM\n$\n3.33\n$\n0.02\n$\n3.31 \nNM\nDiluted weighted average number of shares outstanding\n319.4\n319.4\n318.8\n321.6\nOverview of Consolidated Results for the three months ended September 30, 2025 and 2024\nFor the three months ended September 30, 2025, Mosaic had net income of $411.4 million, or $1.29 per diluted share, compared to net income of $122.2 million, or $0.38 per diluted share, for the prior year period. Gross margin for the three months ended September 30, 2025 increased 33% compared to the same period of the prior year, primarily driven by higher average selling prices across all segments, reflecting strong market dynamics. Net income benefited from an unrealized mark-to-market gain of $308 million on the investment in Ma’aden shares, included in other income (expense). We did not hold this investment in the prior year period.\nSignificant factors affecting our results of operations and financial condition are listed below. Certain of these factors are discussed in more detail in the following sections of this Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nIn our Phosphate segment, operating earnings for the three months ended September 30, 2025 were $102 million compared to  $8 million in the prior year period. Operating results benefited from higher average selling prices and sales volumes in the current year period. Prices were supported by tight global supply conditions, including low inventory levels in the market and export restrictions from China. Increased sales volumes were driven by a strong \"summer fill\" sales program in North America. The current period operating results were unfavorably impacted by higher sulfur costs, which are driven by global supply and demand, and higher unit conversion costs. \nIn our Potash segment, operating earnings for the three months ended September 30, 2025 were $229 million, compared to $109 million in the prior year. Operating results benefited from higher average selling prices and sales volumes in the current year period. Prices have improved due to tight global supply conditions and continued strength in international demand. Sales \n27\nvolumes in the current year period also benefited from strong international demand. Production volumes in the current year period were higher as our annual maintenance turnaround at our Esterhazy, Saskatchewan facility was completed earlier in the year and the prior year also suffered from unplanned downtime. \nIn our Mosaic Fertilizantes segment, operating earnings for the three months ended September 30, 2025 were $96 million, compared to $56 million in the prior year. In the current year period, operating results reflect higher average selling prices driven by a favorable global pricing environment. Sales volumes were down slightly in the current year period. The current year period also reflects a $27 million recovery of customer receivables versus a $32 million bad debt expense in the prior year period. During the current year period, we entered into an agreement to sell our interest in the entity that operates the Taquari potash mine in Brazil. Operating results were negatively impacted by an impairment loss of approximately $73 million related to this transaction.\nCorporate, Eliminations and Other had an operating loss of $(87) million for the three months ended September 30, 2025, compared to a loss of $(58) million in the prior year. Corporate, Eliminations and Other includes the results of the China and India distribution businesses, intersegment eliminations, including profit on intersegment sales, unrealized mark-to-market gains and unrealized losses on derivatives and debt expenses.\nSubsequent to quarter-end, on October 3, 2025, we completed the sale of our idled Patos de Minas phosphate mining unit in Brazil for $111 million, with $51 million paid at closing and the balance of the purchase price to be paid in installments over the next four years.  On November 3, 2025, we completed the sale of our interest in the Taquari potash mine in Brazil for proceeds of up to $27 million, with $12 million received at closing.  \nOverview of Consolidated Results for the nine months ended September 30, 2025 and 2024 \nNet income attributable to Mosaic for the nine months ended September 30, 2025 was $1,060.2 million, or $3.33 per diluted share, compared to a net loss of $5.9 million, or $0.02 per diluted share, for the same period a year ago. Gross margin for the three months ended September 30, 2025 increased 29% compared to the same period of the prior year. This result was primarily driven by higher average selling pricing across all segments, reflecting strong market dynamics, as well as cost efficiencies in our Mosaic Fertilizantes segment as discussed further below. Net income for the nine months ended September 30, 2025 was favorably impacted by a foreign currency transaction gain of $301.3 million, compared to a loss of $(267.3) million in the prior year period. Net income also benefited from an unrealized mark-to-market gain of $407 million on the investment in Ma’aden shares, included in other income (expense). We did not hold this investment in the prior year period.\nResults for the nine months ended September 30, 2025 reflected the factors discussed above in the discussion for the three months ended September 30, 2025, in addition to those noted below. Certain of these factors are discussed in more detail in the following sections of this Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOperating results in our Phosphate segment for the nine months ended September 30, 2025 improved from the prior year, benefitting from higher average selling prices. Prices continued the upward trend that began in the third quarter of 2023, reflecting robust global demand and low inventory levels, which have supported favorable market conditions. Segment earnings were adversely affected by higher input costs, notably sulfur, as well as higher unit conversion and maintenance turnaround expenses, compared to the prior year period. Additionally, sales volumes declined as a result of planned downtime associated with the maintenance turnarounds.\nOperating results in our Potash segment for the nine months ended September 30, 2025 were higher than the prior year, driven by higher average selling prices in the current year period due to improved global markets. Current year sales volumes also benefitted from strength in international demand. These impacts were partially offset by higher production costs, which unfavorably impacted operating results compared to the prior year period.\nFor the nine months ended September 30, 2025, operating results in our Mosaic Fertilizantes segment were more favorable compared to the same period in the prior year. The year-over-year performance reflects a favorable global pricing environment driven by the tight global supply. This benefit was partially offset by the impact of higher purchased product costs for resale. \nCorporate, Eliminations and Other had an operating loss of $(194) million for the nine months ended September 30, 2025 compared to a loss of $(300) million in the prior year. Corporate, Eliminations and Other includes the results of the China and India distribution businesses, intersegment eliminations, including profit on intersegment sales, unrealized mark-to-market gains and unrealized losses on derivatives and debt expenses.\n28\nTable of Contents\nPhosphate Net Sales and Gross Margin \nThe following table summarizes the Phosphate segment’s net sales, gross margin, sales volume, selling prices and raw material prices:\nThree months ended\nNine months ended\nSeptember 30,\n2025-2024\nSeptember 30,\n2025-2024\n(in millions, except price per tonne or unit)\n \n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nNet sales:\nNorth America\n$\n1,088.5 \n$\n814.9 \n$\n273.6 \n34 \n%\n$\n3,047.0 \n$\n2,840.5 \n$\n206.5 \n7 \n%\nInternational\n201.7 \n190.4 \n11.3 \n6 \n%\n514.8 \n513.0 \n1.8 \n0 \n%\nTotal\n1,290.2 \n1,005.3 \n284.9 \n28 \n%\n3,561.8 \n3,353.5 \n208.3 \n6 \n%\nCost of goods sold\n1,146.3 \n863.0 \n283.3 \n33 \n%\n3,147.6 \n2,898.1 \n249.5 \n9 \n%\nGross margin\n$\n143.9 \n$\n142.3 \n$\n1.6 \n1 \n%\n$\n414.2 \n$\n455.4 \n$\n(41.2)\n(9)\n%\nGross margin as a percentage of net sales\n11 \n%\n14 \n%\n12 \n%\n14 \n%\nSales volumes\n(a)\n (in thousands of metric tonnes) \n     DAP/MAP\n760 \n656 \n104 \n16 \n%\n2,317 \n2,384 \n(67)\n(3)\n%\nPerformance and Other\n(b)\n811 \n819 \n(8)\n(1)\n%\n2,298 \n2,431 \n(133)\n(5)\n%\n       Total finished product tonnes\n1,571 \n1,475 \n96 \n7 \n%\n4,615 \n4,815 \n(200)\n(4)\n%\nRock\n539 \n412 \n127 \n31 \n%\n1,298 \n1,316 \n(18)\n(1)\n%\nTotal Phosphate Segment Tonnes\n(a)\n2,110 \n1,887 \n223 \n12 \n%\n5,913 \n6,131 \n(218)\n(4)\n%\nRealized prices ($/tonne)\nAverage finished product selling price\n(c)\n$\n712 \n$\n579 \n$\n133 \n23 \n%\n$\n670 \n$\n583 \n$\n87 \n15 \n%\n    DAP selling price (fob plant)\n$\n714 \n$\n569 \n$\n145 \n25 \n%\n$\n666 \n$\n582 \n$\n84 \n14 \n%\nAverage cost per unit consumed in cost of goods sold:\nAmmonia (metric tonne)\n$\n455 \n$\n482 \n$\n(27)\n(6)\n%\n$\n444 \n$\n436 \n$\n8 \n2 \n%\nSulfur (long ton)\n$\n272 \n$\n126 \n$\n146 \n116 \n%\n$\n220 \n$\n135 \n$\n85 \n63 \n%\nBlended rock (metric tonne)\n$\n80 \n$\n87 \n$\n(7)\n(8)\n%\n$\n78 \n$\n85 \n$\n(7)\n(8)\n%\nProduction volume (in thousands of metric tonnes) - North America\n1,678 \n1,625 \n53 \n3 \n%\n4,606 \n4,877 \n(271)\n(6)\n%\n____________________________\n(a)  \nIncludes intersegment sales volumes.\n(b)  \nIncludes sales volumes of MicroEssentials\n®\n and animal feed ingredients.\n(c)\n \nExcludes sales revenue and tonnes associated with rock sales. Average finished product selling price is calculated as finished goods sales revenue divided by finished goods sales volumes. The prior year amount has been recast to exclude revenue from other non-finished goods. \nThree months ended September 30, 2025 and September 30, 2024\nThe Phosphate segment’s net sales were $1.3 billion for the three months ended September 30, 2025, compared to $1.0 billion for the three months ended September 30, 2024. The year-over-year increase was primarily driven by higher average finished goods sales prices, which contributed approximately $210 million to net sales compared to the prior year period. Additionally, increased sales volumes added approximately $55 million, while freight and other product revenues contributed $20 million, compared to the prior-year period.\nOur average finished product selling price increased 23% to $712 per tonne for the three months ended September 30, 2025, compared to $579 per tonne in the prior year period, due to the factors discussed in the Overview.\nThe Phosphate segment’s sales volumes of finished products increased to 1.6 million for the three months ended September 30, 2025, compared to 1.5 million in the prior year period. \n29\nTable of Contents\nGross margin for the Phosphate segment increased to $143.9 million for the three months ended September 30, 2025, from $142.3 million for the three months ended September 30, 2024. Gross margin in the current year period benefitted from higher average selling prices, which had a favorable impact of approximately $210 million compared to the prior year. In addition, higher finished goods sales volumes had a favorable impact of approximately $10 million and higher sales volumes of rock and other products had a favorable impact of approximately $20 million in the current year period. These benefits were mostly offset by higher raw material costs, primarily sulfur, of approximately $70 million and higher conversion costs of approximately $40 million, compared to the prior year period. Higher plant related costs and freight and vessel costs of approximately $55 million also unfavorably impacted gross margin. Additionally, current year results were also unfavorably impacted by higher costs for maintenance turnarounds of approximately $35 million, higher water costs of approximately $20 million and land reclamation costs of approximately $15 million. \nThe average consumed price for ammonia for our North America operations decreased 6%, to $455 per tonne, for the three months ended September 30, 2025, from $482 in the same period a year ago. The average consumed sulfur price for our North America operations increased 116%, to $272 per long ton, for the three months ended September 30, 2025, from $126 in the same period a year ago. The purchase prices of these raw materials are driven by global supply and demand. The consumed ammonia and sulfur prices also include transportation, transformation and storage costs.\nThe average consumed cost of purchased and produced phosphate rock decreased to $80 per tonne for the three months ended September 30, 2025, from $87 per tonne for the three months ended September 30, 2024. For the three months ended September 30, 2025 and 2024, our North America phosphate rock production was 2.2 million tonnes.\nThe Phosphate segment’s production of crop nutrient dry concentrates and animal feed ingredients increased 3% for the three months ended September 30, 2025 from the prior year period. This resulted in an operating rate for processed phosphate production of 68% for the three months ended September 30, 2025, up from 66% for the same period in 2024.\nNine months ended September 30, 2025 and September 30, 2024 \nThe Phosphate segment’s net sales were $3.6 billion for the nine months ended September 30, 2025, compared to $3.4 billion for the nine months ended September 30, 2024. The year-over-year increase was driven by higher average finished goods sales prices, which contributed approximately $400 million to net sales compared to the prior year period. This benefit was partially offset by lower sales volumes, which resulted in an unfavorable impact of approximately $110 million. Additionally, lower rock sales volumes and freight and other product revenue had an unfavorable impact of approximately $75 million compared to the prior year period.\nOur average finished product selling price was $670 per tonne for the nine months ended September 30, 2025, an increase of $87 per tonne from the same period a year ago, due to the factors discussed in the Overview.\nThe Phosphate segment’s sales volumes of finished products decreased by 4% for the nine months ended September 30, 2025, compared to the same period in the prior year due to the impact of planned maintenance and turnaround activity.\nGross margin for the Phosphate segment decreased to $414.2 million for the nine months ended September 30, 2025, from $455.4 million for the nine months ended September 30, 2024. The decrease was primarily driven by unfavorable cost impacts, including approximately $160 million from higher sulfur and ammonia input costs, and approximately $100 million from higher conversion costs compared to the prior year period. Extended maintenance turnarounds further reduced gross margin by approximately $70 million. Gross margin was also unfavorably impacted by higher plant-related costs of approximately $90 million, higher water treatment costs of approximately $40 million and higher land reclamation costs of approximately $30 million. Additionally, lower finished goods and rock sales volumes unfavorably impacted gross margin by approximately $10 million. These impacts were partially offset by higher finished goods sales prices of approximately $400 million, lower blended rock costs of approximately $60 million. \nThe average consumed price for ammonia for our North America operations was $444 per tonne for the nine months ended September 30, 2025, compared to $436 per tonne in the same period a year ago. The average consumed price for sulfur for our North America operations increased to $220 per long ton for the nine months ended September 30, 2025, from $135 per long ton in the same period a year ago. The purchase prices of these raw materials are driven by global supply and demand.\nThe average consumed cost of purchased and produced phosphate rock decreased to $78 per tonne for the nine months ended September 30, 2025, compared to $85 per tonne for the prior year period. Our North America phosphate rock production \n30\nTable of Contents\nincreased to 7.2 million tonnes for the nine months ended September 30, 2025, compared to 7.0 million for the nine months ended September 30, 2024.\nThe Phosphate segment’s production of crop nutrient dry concentrates and animal feed ingredients decreased by 6%, to 4.6 million tonnes for the nine months ended September 30, 2025, compared to 4.9 million tonnes in the prior year period.  This decrease was due to planned maintenance downtime in the current year. Our operating rate for processed phosphate production decreased to 62% for the nine months ended September 30, 2025, from 66% for the same period in 2023. \nPotash Net Sales and Gross Margin \nThe following table summarizes the Potash segment’s net sales, gross margin, sales volume and selling price:\nThree months ended\nNine months ended\nSeptember 30,\n2025-2024\nSeptember 30,\n2025-2024\n(in millions, except price per tonne or unit)\n \n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nNet sales:\nNorth America\n$\n320.4 \n$\n284.1 \n$\n36.3 \n13 \n%\n$\n1,039.5 \n$\n1,128.3 \n$\n(88.8)\n(8)\n%\nInternational\n374.4 \n241.6 \n132.8 \n55 \n%\n936.0 \n703.6 \n232.4 \n33 \n%\nTotal\n694.8 \n525.7 \n169.1 \n32 \n%\n1,975.5 \n1,831.9 \n143.6 \n8 \n%\nCost of goods sold\n458.9 \n403.8 \n55.1 \n14 \n%\n1,361.6 \n1,311.9 \n49.7 \n4 \n%\nGross margin\n$\n235.9 \n$\n121.9 \n$\n114.0 \n94 \n%\n$\n613.9 \n$\n520.0 \n$\n93.9 \n18 \n%\nGross margin as a percentage of net sales\n34 \n%\n23 \n%\n31 \n%\n28 \n%\nSales volume\n(a)\n (in thousands of metric tonnes)\n     MOP\n2,110 \n1,775 \n335 \n19 \n%\n6,179 \n5,815 \n364 \n6 \n%\nPerformance and Other\n(b)\n169 \n221 \n(52)\n(24)\n%\n556 \n690 \n(134)\n(19)\n%\nTotal Potash Segment Tonnes\n2,279 \n1,996 \n283 \n14 \n%\n6,735 \n6,505 \n230 \n4 \n%\nRealized prices ($/tonne)\nAverage finished product selling price\n(c)\n$\n278 \n$\n233 \n$\n45 \n19 \n%\n$\n263 \n$\n244 \n$\n19 \n8 \n%\nMOP selling price (fob mine)\n$\n271 \n$\n215 \n$\n56 \n26 \n%\n$\n252 \n$\n227 \n$\n25 \n11 \n%\nProduction volume (in thousands of metric tonnes)\n2,258 \n1,904 \n354 \n19 \n%\n6,608 \n6,466 \n142 \n2 \n%\n______________________________\n(a) \nIncludes intersegment sales volumes.\n(b) \nIncludes sales volumes of K-Mag\n®\n, Aspire\n®\n and animal feed ingredients.\n(c)\nAverage finished product selling price is calculated as finished goods sales revenue divided by finished goods sales volumes. The prior year amount has been recast to exclude revenue from non-finished goods.\nThree months ended September 30, 2025 and September 30, 2024 \nThe Potash segment’s net sales increased to $694.8 million for the three months ended September 30, 2025, compared to $525.7 million in the same period a year ago. The increase was due to higher average selling prices and sales volumes, which favorably impacted net sales by approximately $100 million and $70 million, respectively, compared to the same period in the prior year. \nOur average finished product selling price was $278 per tonne for the three months ended September 30, 2025, compared to $233 per tonne for the same period a year ago, as a result of the factors described in the Overview.\nThe Potash segment’s sales volumes of finished products were 2.3 million tonnes for the three months ended September 30, 2025 compared to 2.0 million tonnes for the same period a year ago, as a result of the factor described in the Overview.\nGross margin for the Potash segment increased to $235.9 million for the three months ended September 30, 2025, up from $121.9 million in the prior year period. The increase was primarily driven by favorable finished goods pricing, which contributed approximately $100 million, and higher sales volumes, which contributed approximately $30 million, compared to \n31\nTable of Contents\nthe same period in the prior year. Additionally, gross margin benefited from lower freight rates of approximately $20 million, due to lower domestic sales volumes, and lower maintenance turnaround costs of approximately $10 million, compared to the prior year. These benefits were partially offset by higher Canadian resources taxes of approximately $40 million, compared to the prior year period, as discussed further below. \nWe incurred $\n86.8\n million in Canadian resource taxes for the three months ended September 30, 2025, compared to $44.5 million in the same period a year ago. Canadian royalty expense increased to $12.4 million for the three months ended September 30, 2025, compared to $9.4 million for the three months ended September 30, 2024. The fluctuations in Canadian resource taxes and royalties are a result of increases in our sales revenue and margins.\nOur operating rate for potash production increased to 79% for the three months ended September 30, 2025, from 66% for the same period in 2024. Prior year production was negatively impacted by electrical issues at our Esterhazy and Colonsay, Saskatchewan mines.\nNine months ended September 30, 2025 and September 30, 2024\nThe Potash segment’s net sales were $2.0 billion for the nine months ended September 30, 2025, compared to $1.8 billion in the same period a year ago. Net sales in the current period benefited from higher average selling prices and sales volumes, which contributed approximately $125 million and $55 million, respectively, compared to the same period in the prior year. This was partially offset by an approximate $40 million reduction in freight revenue, reflecting lower freight rates and lower domestic sales volumes in the current year period. \nOur average potash selling price was $263 per tonne for the nine months ended September 30, 2025, compared to $244 per tonne for the same period a year ago, due to the factor discussed above in the Overview.\nThe Potash segment’s sales volumes for the nine months ended September 30, 2025 increased 4%, compared to the same period a year ago, due to the factor discussed above in the Overview.\nGross margin for the Potash segment increased to $613.9 million for the nine months ended September 30, 2025, up from $520.0 million for the same period last year. This increase was largely attributable to higher average selling prices, which contributed approximately $125 million compared to the prior year period. In addition, higher sales volumes contributed approximately $30 million compared to the prior year period. These benefits were partially offset by higher costs which unfavorably impacted gross margin by approximately $50 million, and by higher Canadian resource taxes and royalties of approximately $20 million in the current year period. \nWe incurred $195.8 million in Canadian resource taxes for the nine months ended September 30, 2025, compared to $175.8 million in the same period a year ago. Canadian royalty expense increased to $31.7 million for the nine months ended September 30, 2025, compared to $29.7 million for the nine months ended September 30, 2024. The fluctuations in Canadian resource taxes and royalties are due to the increases in our sales revenues and margin.\nOur operating rate was 77% for the current year period, compared to 75% in the prior year period. \n32\nTable of Contents\n Mosaic Fertilizantes Net Sales and Gross Margin\nThe following table summarizes the Mosaic Fertilizantes segment’s net sales, gross margin, sales volume and selling price.\nThree months ended\nNine months ended\nSeptember 30,\n2025-2024\nSeptember 30,\n2025-2024\n(in millions, except price per tonne or unit)\n \n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nNet Sales\n$\n1,592.2 \n$\n1,399.2 \n$\n193.0 \n14 \n%\n$\n3,700.9\n$\n3,334.5\n$\n366.4 \n11 \n%\nCost of goods sold\n1,409.8 \n1,271.3 \n138.5 \n11 \n%\n3,229.8\n3,029.6\n200.2 \n7 \n%\nGross margin\n$\n182.4 \n$\n127.9 \n$\n54.5 \n43 \n%\n$\n471.1\n$\n304.9\n$\n166.2 \n55 \n%\nGross margin as a percent of net sales\n11 \n%\n9 \n%\n13 \n%\n9 \n%\nSales volume (in thousands of metric tonnes)\nPhosphate produced in Brazil\n(a)\n288 \n521 \n(233)\n(45)\n%\n925 \n1,278 \n(353)\n(28)\n%\nPotash produced in Brazil\n75 \n100 \n(25)\n(25)\n%\n156 \n166 \n(10)\n(6)\n%\nPurchased nutrients for distribution\n2,440 \n2,258 \n182 \n8 \n%\n5,801 \n5,346 \n455 \n9 \n%\nTotal Mosaic Fertilizantes Segment Tonnes\n2,803 \n2,879 \n(76)\n(3)\n%\n6,882 \n6,790 \n92 \n1 \n%\nRealized prices ($/tonne)\nAverage finished product selling price\n(b)\n$\n518 \n$\n447 \n$\n71 \n16 \n%\n$\n486 \n$\n444 \n$\n42 \n9 \n%\n    Brazil MAP price (delivered price to third party)\n$\n738 \n$\n601 \n$\n137 \n23 \n%\n$\n713 \n$\n594 \n$\n119 \n20 \n%\nPurchases ('000 tonnes)\nDAP/MAP from Mosaic\n45 \n43 \n2 \n5 \n%\n128 \n141 \n(13)\n(9)\n%\nMicroEssentials\n®\n from Mosaic\n270 \n337 \n(67)\n(20)\n%\n672 \n790 \n(118)\n(15)\n%\nPotash from Mosaic/Canpotex\n919 \n682 \n237 \n35 \n%\n1,781 \n1,776 \n5 \n— \n%\nAverage cost per unit consumed in cost of goods sold:\n    Ammonia (metric tonne)\n$\n576 \n$\n572 \n$\n4 \n1 \n%\n$\n619 \n$\n626 \n$\n(7)\n(1)\n%\n    Sulfur (long ton)\n$\n325 \n$\n170 \n$\n155 \n91 \n%\n$\n275 \n$\n172 \n$\n103 \n60 \n%\n    Blended rock (metric tonne)\n$\n99 \n$\n105 \n$\n(6)\n(6)\n%\n$\n97 \n$\n108 \n$\n(11)\n(10)\n%\nProduction volume (in thousands of metric tonnes)\n938 \n884 \n54 \n6 \n%\n2,779 \n2,612 \n167 \n6 \n%\n______________________________\n(a) \nExcludes internally produced volumes used in purchased nutrients for distribution.\n(b) \nAverage finished product selling price is calculated as finished goods sales revenue divided by finished goods sales volumes. The prior year amount has been recast to exclude revenue from non-finished goods.\nThree months ended September 30, 2025 and September 30, 2024\nThe Mosaic Fertilizantes segment’s net sales increased to $1.6 billion for the three months ended September 30, 2025, from $1.4 billion during the same period of the prior year. The $193.0 million increase in net sales was driven by approximately $190 million of higher finished product sales prices, partially offset by slightly lower sales volumes, which unfavorably impacted net sales by approximately $20 million. Additionally, both higher sales prices and volumes of other products, primarily gypsum, contributed positively, adding approximately $20 million to net sales. \nOur average finished product selling price was $518 per tonne for the three months ended September 30, 2025, compared to $447 per tonne for the same period a year ago due to the factor discussed in the Overview.\nThe Mosaic Fertilizantes segment’s sales volumes of finished products decreased 3% for the three months ended September 30, 2025, compared to the same period a year ago.\nGross margin for the Mosaic Fertilizantes segment increased to $182.4 million for the three months ended September 30, 2025, from $127.9 million in the same period of the previous year. This increase was primarily driven by higher average selling prices during the current year period, which contributed approximately $190 million compared to the prior year period. This benefit \n33\nTable of Contents\nwas partially offset by higher product costs of approximately $140 million in our distribution operations, along with a decrease in sales volumes, which reduced gross margin by approximately $25 million. Additionally, foreign currency changes positively impacted gross margin by approximately $40 million in the current year period. \nThe average consumed price for ammonia for our Brazilian operations increased to $576 per tonne for the three months ended September 30, 2025, compared to $572 per tonne in the prior year period. The average consumed sulfur price for our Brazilian operations increased to $325 per long ton for the three months ended September 30, 2025, compared to $170 per long ton in the prior year period. The purchase prices of ammonia and sulfur are driven by global supply and demand, and also include transportation, transformation and storage costs. \nThe Mosaic Fertilizantes segment’s production of crop nutrient dry concentrates and animal feed ingredients increased 6% for the three months ended September 30, 2025, compared to the prior year period. For the three months ended September 30, 2025, our phosphate operating rate increased to 84%, compared to 78% in the same period of the prior year. \nFor the three months ended September 30, 2025 and 2024, our Brazilian phosphate rock production was 1.1 million tonnes. We are temporarily idling our Patrocínio mine in Brazil for the months of November and December due to elevated ore inventory levels.\nNine months ended September 30, 2025 and 2024\nThe Mosaic Fertilizantes segment’s net sales were $3.7 billion for the nine months ended September 30, 2025, compared to $3.3 billion in the same period of the prior year. The current period's net sales benefited by approximately $290 million in higher average finished goods sales prices and by approximately $50 million of higher finished goods sales volumes for distribution, compared to the prior year period. Additionally, both higher sales prices and volumes of other products, primarily gypsum, contributed positively, adding approximately $30 million to net sales\nThe average finished product selling price increased $42 per tonne, to $486 per tonne for the nine months ended September 30, 2025, compared to $444 per tonne in the prior year period, primarily due to the continued improvement in global prices mentioned in the Overview and the mix of products sold.\nThe Mosaic Fertilizantes segment’s sales volume increased to 6.9 million tonnes for the nine months ended September 30, 2025, from 6.8 million tonnes in the same period a year ago.\nGross margin for the nine months ended September 30, 2025 increased to $471.1 million from $304.9 million in the same period in the prior year. This improvement was primarily driven by approximately $290 million in higher average selling prices. This benefit was partially offset by approximately $160 million of higher costs for distribution products and approximately $60 million from the impact of lower sales volumes in the current year period. Current period gross margin benefited by approximately $10 million due to lower maintenance turnaround costs. Favorable foreign currency changes contributed approximately $60 million in the current year period, and improved margins on other products contributed approximately $10 million.\nThe Mosaic Fertilizantes segment’s production of crop nutrient dry concentrates and animal feed ingredients increased 6% compared to the prior year period. Our phosphate operating rate increased to 82% for the nine months ended September 30, 2025 compared to 77% in the same period of the prior year.\nFor the nine month period ended September 30, 2025, our Brazilian phosphate rock production increased to 3.1 million tonnes, from 3.0 million tonnes in the prior year period.\nCorporate, Eliminations and Other\nIn addition to our three operating segments, we assign certain costs to Corporate, Eliminations and Other, which is presented separately in Note 18 to our Notes to Condensed Consolidated Financial Statements. Corporate, Eliminations and Other includes the results of the China and India distribution businesses, intersegment eliminations, including profit on intersegment sales, unrealized mark-to-market gains and losses on derivatives and debt expenses. \nFor the three months ended September 30, 2025, gross margin for Corporate, Eliminations and Other was $(9.9) million, compared to $24.7 million for the same period in the prior year. Gross margin in the current year was unfavorably impacted by approximately $27 million from net unrealized loss on derivatives, primarily on foreign currency derivatives, compared to a net \n34\nTable of Contents\nunrealized gain of approximately $38 million in the prior year period. Sales in China and India, collectively, resulted in revenue of $112.4 million and gross margin of $13.2 million in the current year period, compared to revenue of $111.1 million and gross margin of $15.9 million in the prior year period. The China and India gross margin was unfavorably impacted by lower sales volumes in India in the current year period, compared to the prior year period.\nFor the nine months ended September 30, 2025, gross margin for Corporate, Eliminations and Other was $60.1 million, compared to $(70.3) million for the same period in the prior year. Gross margin in the current year was favorably impacted by approximately $83 million from net unrealized gains on derivatives, primarily on foreign currency derivatives, compared to a net unrealized loss of approximately $21 million in the prior year. Sales in China and India, collectively, resulted in revenue of $392.3 million and gross margin of $53.2 million\n, \nin the current year period, compared to revenue of $361.2 million and gross margin of $25.9 million in the prior year period. The China and India gross margin was favorably impacted by higher average selling prices in the current year period, compared to the prior year period. \nOther Income Statement Items\nThree months ended\nNine months ended\nSeptember 30,\n2025-2024\nSeptember 30,\n2025-2024\n(in millions)\n2025\n2024\nChange\nPercent\n2025\n2024\nChange\nPercent\nSelling, general and administrative expenses\n$\n125.5 \n$\n148.2 \n$\n(22.7)\n(15)\n%\n$\n415.3 \n$\n383.4 \n$\n31.9 \n8 \n%\nOther operating expense\n87.0 \n153.2 \n(66.2)\n(43)\n%\n221.3 \n305.0 \n(83.7)\n(27)\n%\nInterest expense\n(59.3)\n(50.6)\n(8.7)\n17 \n%\n(177.7)\n(170.0)\n(7.7)\n5 \n%\nInterest income\n13.7 \n8.9 \n4.8 \n54 \n%\n38.4 \n33.9 \n4.5 \n13 \n%\n      Interest expense, net\n(45.6)\n(41.7)\n(3.9)\n9 \n%\n(139.3)\n(136.1)\n(3.2)\n2 \n%\nForeign currency transaction gain (loss)\n(1.2)\n100.9 \n(102.1)\nNM\n301.3 \n(267.3)\n568.6 \nNM\nOther income (expense)\n306.3 \n(0.4)\n306.7 \nNM\n391.7 \n6.8 \n384.9 \nNM\nProvision for income taxes\n175.5 \n48.0 \n127.5 \nNM\n384.8 \n152.9 \n231.9 \n152 \n%\nEquity in net earnings of nonconsolidated companies\n0.3 \n4.5 \n(4.2)\n(93)\n%\n2.2 \n64.2 \n(62.0)\n(97)\n%\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses for the three months ended September 30, 2025 decreased by $22.7 million compared to the same period of prior year. The current year quarter includes approximately $8 million in higher consulting and professional services costs, while the prior year quarter reflected the addition of a $32 million bad debt reserve in our Mosaic Fertilizantes segment.\nSelling, general and administrative expenses for the nine months ended September 30, 2025 increased $31.9 million compared to the same period of prior year, primarily driven by higher incentive compensation and employee benefit costs of approximately $27 million and higher consulting and professional services costs of approximately $7 million.\nOther Operating Expense\nFor the three months ended September 30, 2025, other operating expenses were $87.0 million, down from $153.2 million reported for the same period of the prior year. Other operating expenses for the current period were approximately $100 million lower than the prior year, primarily due to the timing of annual annual asset retirement obligation (“\nARO\n”) revisions, which will be recorded in the fourth quarter of the current year. The current year period also benefited from reduced environmental and legal reserves of approximately $20 million compared to the current year period. The current year amount includes an impairment loss of approximately $73 million related to the planned sale of the Taquari potash mine in Brazil, which was partially offset by a recovery of customer receivables in Brazil of approximately $27 million.\nFor the nine months ended September 30, 2025, other operating expense decreased to $221.3 million, from $305.0 million in the same period of the prior year. The reduction from the prior year was primarily attributable to the timing of annual ARO adjustments, mentioned above, which resulted in approximately $70 million in lower costs in the current year period. Additionally, lower environmental and legal reserves benefited the current year period by approximately $40 million and lower \n35\nTable of Contents\nfranchise tax expense by approximately $15 million. Other operating expense in the current year also included the previously mentioned impairment loss of approximately $73 million.\nInterest Expense, Net\nFor the three and nine months ended September 30, 2025, net interest expense increased to $45.6 million and $139.3 million, compared to $41.7 million and $136.1 million for the same periods in the prior year. The increase was primarily due to higher short-term debt levels in the current year periods. \nForeign Currency Transaction Gain (Loss)\nFor the three months ended September 30, 2025, fluctuations in foreign currency rates led to a slight transaction loss of $1.2 million compared to a gain of $100.9 million for the same period of the prior year.\nFor the nine months ended September 30, 2025, we recorded a gain of $301.3 million compared to a loss of $267.3 million for the same period in the prior year. For the nine months ended September 30, 2025, the gain was the result of the impact of the U.S. dollar relative to the Canadian dollar on significant intercompany loans and the effect of the weakening of the U.S. dollar relative to the Brazilian real on significant intercompany loans and U.S. dollar-denominated payables held by our Brazilian subsidiaries.\nOther (Income) Expense\nFor the three and nine months ended September 30, 2025, we reported other income of $306.3 million and $391.7 million, respectively, compared to $0.4 million and $6.8 million for the same periods in the prior year. The significant increase in other income for the current year was primarily driven by unrealized mark-to-market gains on our investment in Ma’aden shares of approximately $308 million for the three-month period and $407 million for the nine-month period. For the nine months ended September 30, 2025, we realized a loss of approximately $7 million on marketable securities held in the RCRA Trusts.\nEquity in Net Earnings of Nonconsolidated Companies\nFor the three and nine months ended September 30, 2025, we had equity in net earnings of nonconsolidated companies of $0.3 million and $2.2 million compared to $4.5 million and $64.2 million for the same period in the prior year. The prior period results were primarily related to the operations of MWSPC. In December 2024, we exchanged our ownership in MWSPC for shares in Ma’aden.\nProvision for Income Taxes\nThree months ended\nEffective Tax Rate\nProvision for  Income Taxes\nSeptember 30, 2025\n29.3 \n%\n$\n175.5 \nSeptember 30, 2024\n27.6 \n%\n$\n48.0 \nNine months ended\nEffective Tax Rate\nProvision for  Income Taxes\nSeptember 30, 2025\n26.1 \n%\n$\n384.8 \nSeptember 30, 2024\n122.3 \n%\n$\n152.9 \nIncome tax expense was $175.5 million and $384.8 million, and the effective tax rate was 29.3% and 26.1% for the three and nine months ended September 30, 2025.\nFor the three and nine months ended September 30, 2025, discrete tax items recorded in tax expense was an expense of approximately $2.4 million and a benefit of approximately $\n22.9\n million. The net tax benefit consisted primarily of changes in valuation allowance, share-based costs, true-up of estimates, and other miscellaneous costs. In addition to items specific to the period, our income tax rate is impacted by the mix of earnings across the jurisdictions in which we operate, by a benefit associated with depletion, and by the impact of certain entities being taxed in both their foreign jurisdiction and the U.S., including foreign tax credits for various taxes incurred.\n36\nTable of Contents\nOn July 4, 2025, the U.S. enacted budget reconciliation package H.R. 1 otherwise known as the One Big Beautiful Bill Act (“\nOBBBA\n”). The OBBBA includes a broad range of tax law changes, including the permanent extension of certain expired or expiring provisions of the Tax Cuts and Jobs Act and changes to certain other U.S. tax provisions. The legislation has multiple effective dates, with provisions effective beginning in 2025 and 2026. The Company has reflected the impact of the enacted provisions in its financial statements for the third quarter, and we do not expect it to materially change our effective income tax rate for 2025. \nCritical Accounting Estimates \nThe Condensed Consolidated Financial Statements are prepared in conformity with GAAP. In preparing the Condensed Consolidated Financial Statements, we are required to make various judgments, estimates and assumptions that could have a significant impact on the results reported in the Condensed Consolidated Financial Statements. We base these estimates on historical experience and other assumptions believed to be reasonable by management under the circumstances. Changes in these estimates could have a material effect on our Condensed Consolidated Financial Statements.\nThe basis for our financial statement presentation, including our significant accounting estimates, is summarized in Note 2 to the Condensed Consolidated Financial Statements in this report. A summary description of our significant accounting policies is included in Note 2 to the Consolidated Financial Statements in our 10-K Report. Further detailed information regarding our critical accounting estimates is included in Management’s Discussion and Analysis of Results of Operations and Financial Condition in our 10-K Report.\nLiquidity and Capital Resources \nAs of September 30, 2025, we had cash and cash equivalents of $153.3 million, short-term debt of $1.2 billion, long-term debt, including current maturities, of approximately $3.4 billion, and stockholders’ equity of approximately $12.9 billion. We have a target liquidity buffer of up to $3.0 billion, including cash and available committed and uncommitted credit lines. We expect our liquidity to fluctuate from time to time, especially in the first quarter of each year, to manage through the seasonality of our business. We also target debt leverage ratios that are consistent with investment grade credit metrics. Our capital allocation priorities include maintaining our target investment grade metrics and financial strength, sustaining our assets, including ensuring the safety of our employees and reliability of our assets, investing to grow our business, either through organic growth or taking advantage of strategic opportunities, and returning excess cash to shareholders, including by paying dividends. During the nine months ended September 30, 2025, we paid cash dividends of $210.5 million, and invested $1.0 billion in capital expenditures.\nFunds generated by operating activities, available cash and cash equivalents, and our credit facilities continue to be our most significant sources of liquidity. We believe funds generated from the expected results of operations and available cash, cash equivalents and borrowings under our committed and uncommitted credit facilities, as needed, will be sufficient to finance our operations, including our capital expenditures, existing strategic initiatives, debt repayments and expected dividend payments, for the next 12 months and beyond. There can be no assurance, however, that we will continue to generate cash flows at or above current levels. As of September 30, 2025, we had $2.50 billion available under our $2.50 billion committed revolving credit facility, approximately $0.7 billion available under our uncommitted facilities and had $1.9 billion available under our $2.5 billion commercial paper program that is backed by the revolving credit facility. We consider amounts borrowed under our commercial paper program as a reduction of availability under our revolving credit facility. Our credit facilities, including the revolving credit facility, require us to maintain certain financial ratios, as discussed in Note 11 of our Notes to Consolidated Financial Statements in our 10-K Report and as discussed in Note 9 to our Condensed Consolidated Financial Statements in this report. We were in compliance with these ratios as of September 30, 2025.\nAll of our cash equivalents are diversified in highly rated investment vehicles. Our cash and cash equivalents are held either in the U.S. or held by non-U.S. subsidiaries and are not subject to significant foreign currency exposures, as the majority are held in investments denominated in U.S. dollars as of September 30, 2025. These funds may create foreign currency transaction gains or losses, however, depending on the functional currency of the entity holding the cash. In addition, there are no significant restrictions that would preclude us from bringing these funds back to the U.S., aside from withholding taxes.\n37\nTable of Contents\nThe following table represents a comparison of the net cash provided by operating activities, net cash used in investing activities, and net cash used in financing activities for the nine months ended September 30, 2025 and September 30, 2024:\n(in millions)\nNine months ended\nSeptember 30,\n2025-2024\nCash Flow\n2025\n2024\nChange\nPercent\nNet cash provided by operating activities\n$\n880.9 \n$\n1,079.9 \n$\n(199.0)\n(18)\n%\nNet cash used in investing activities\n(1,022.2)\n(984.5)\n(37.7)\n4 \n%\nNet cash used in financing activities\n(9.4)\n(168.6)\n159.2 \n(94)\n%\nOperating Activities \nDuring the nine months ended September 30, 2025, net cash provided by operating activities was $0.9 billion, compared to net cash provided by operating activities of $1.1 billion for the same period in the prior year. Our results of operations, after non-cash adjustments, contributed $1.5 billion to cash flows from operating activities during the nine months ended September 30, 2025, compared to $1.1 billion as computed on the same basis for the prior year period. During the nine months ended September 30, 2025, we had an unfavorable change in assets and liabilities of $598.9 million, compared to an unfavorable change of $9.9 million during the nine months ended September 30, 2024. \nThe change in assets and liabilities for the nine months ended September 30, 2025, was primarily driven by increases in inventories of $578.9 million and a decrease in accounts payable and accrued liabilities of $169.1 million, partially offset by an increase in other noncurrent liabilities of $49.6 million. The increase in inventories was primarily due to higher inventory volumes, particularly in phosphate rock in Brazil, and raw material prices across our segments in the current year period. The decrease in accounts payable and accrued liabilities was primarily due the payment of dividends and the settlement of AROs, partially offset by an increase in customer prepayments in Brazil. The increase in other noncurrent liabilities was primarily related to increases in ARO obligations and environmental reserves in our Phosphate segment in the current year. \nInvesting Activities\nNet cash used in investing activities was $1,022.2 million for the nine months ended September 30, 2025, compared to $984.5 million for the same period a year ago. We had capital expenditures of $1,009.8 million for the nine months ended September 30, 2025, compared to $957.7 million in the prior year period. \nFinancing Activities\nNet cash used in financing activities for the nine months ended September 30, 2025 was $9.4 million, compared to $168.6 million for the same period in the prior year. During the nine months ended September 30, 2025, we paid dividends of $210.5 million, made payments on long-term debt, net of borrowings, of $49.8 million and made net payments on our structured accounts payable arrangements of $15.9 million. During the current year period, we received net proceeds of $101.2 million under our inventory financing arrangement and $205.4 million under other short-term debt arrangements. \nDebt Instruments, Guarantees and Related Covenants\nSee Notes 11 and 17 to the Consolidated Financial Statements in our 10-K Report.\nFinancial Assurance Requirements\nIn addition to various operational and environmental regulations related to our Phosphate segment, we are subject to financial assurance requirements. In various jurisdictions in which we operate, particularly Florida and Louisiana, we are required to pass a financial strength test or provide credit support, typically in the form of surety bonds, letters of credit, certificates of deposit or trust funds. Further information regarding financial assurance requirements is included in Management’s Discussion and Analysis of Results of Operations and Financial Condition in our 10-K Report, under “EPA RCRA Initiative,” and in Note 8 to our Condensed Consolidated Financial Statements in this report.\n38\nTable of Contents\nOff-Balance Sheet Arrangements and Obligations\nInformation regarding off-balance sheet arrangements and obligations is included in Management’s Discussion and Analysis of Results of Operations and Financial Condition in our 10-K Report and Note 17 to our Condensed Consolidated Financial Statements in this report.\nContingencies\nInformation regarding contingencies is hereby incorporated by reference to Note 17 to our Condensed Consolidated Financial Statements in this report.\n39\nTable of Contents\nForward-Looking Statements\nCautionary Statement Regarding Forward Looking Information\nAll statements, other than statements of historical fact, appearing in this report constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements include, among other things, statements about our expectations, beliefs, intentions or strategies for the future, including statements about proposed or pending future transactions or strategic plans, statements concerning our future operations, financial condition and prospects, statements regarding our expectations for capital expenditures, and other information, and any statements of assumptions regarding any of the foregoing. In particular, forward-looking statements may include words such as “anticipate”, “believe”, “could”, “estimate”, “expect”, “intend”, “may”, “potential”, “predict”, “project” or “should”. These statements involve certain risks and uncertainties that may cause actual results to differ materially from expectations as of the date of this filing.\nFactors that could cause reported results to differ materially from those expressed or implied by the forward-looking statements include, but are not limited to, the following:\n•\nbusiness and economic conditions and governmental policies affecting the agricultural industry where we or our customers operate, including price and demand volatility resulting from periodic imbalances of supply and demand;\n•\nbecause of political and economic instability, civil unrest or changes in government policies in Brazil, Peru or other countries in which we do business, our operations could be disrupted as higher costs of doing business could result, including those associated with implementation of new freight tables and new mining legislation;\n•\npotential changes in trade policies, including the impact of U.S. tariffs and retaliatory tariffs on prices of raw materials and commodities and other economic conditions;  \n•\nchanges in farmers’ application rates for crop nutrients;\n•\nchanges in the operation of world phosphate or potash markets, including consolidation in the crop nutrient industry, particularly if we do not participate in the consolidation;\n•\nthe expansion or contraction of production capacity or selling efforts by competitors or new entrants in the industries in which we operate, including the effects of actions by the other member of Canpotex to prove the production capacity of potash expansion projects, through proving runs or otherwise;\n•\nthe effect of future product innovations or development of new technologies on demand for our products;\n•\nseasonality in our business that results in the need to carry significant amounts of inventory and seasonal peaks in working capital requirements, which may result in excess inventory or product shortages;\n•\nchanges in the costs, or constraints on supplies, of raw materials or energy used in manufacturing our products, or in the costs or availability of transportation for our products;\n•\neconomic and market conditions, including supply chain challenges and increased costs and delays caused by transportation and labor shortages;\n•\ndeclines in our selling prices or significant increases in costs that can require us to write down our inventories to the lower of cost or market, or require us to impair goodwill or other long-lived assets, or establish a valuation allowance against deferred tax assets;\n•\nthe lag in realizing the benefit of falling market prices for the raw materials we use to produce our products that can occur while we consume raw materials that we purchased or committed to purchase in the past at higher prices;\n•\ndisruptions of our operations at any of our key production, distribution, transportation or terminaling facilities, including those of Canpotex or any joint venture in which we participate;\n•\nshortages or other unavailability of trucks, railcars, tugs, barges and ships for carrying our products and raw materials;\n•\nthe effects of and change in trade, monetary, environmental, tax and fiscal policies, laws and regulations, other than tariffs;\n40\nTable of Contents\n•\na material adverse change in our Ma'aden investment with respect to the financial position, performance, operations or prospects of Ma'aden; \n•\nforeign exchange rates and fluctuations in those rates;\n•\ntax regulations, currency exchange controls and other restrictions that may affect our ability to optimize the use of our liquidity;\n•\nadverse weather and climate conditions affecting our operations, including the impact of potential hurricanes, excessive heat, cold, snow, rainfall or drought;\n•\ndifficulties or delays in receiving, challenges to, increased costs of obtaining or satisfying conditions of, or revocation or withdrawal of required governmental and regulatory approvals, including permitting activities;\n•\nchanges in the environmental and other governmental regulations that apply to our operations, including federal legislation or regulatory action expanding the types and extent of water resources regulated under federal law and the possibility of further federal or state legislation or regulatory action affecting or related to greenhouse gas emissions, including carbon taxes or other measures that may be implemented in Canada or other jurisdictions in which we operate, or of restrictions or liabilities related to elevated levels of naturally-occurring radiation that arise from disturbing the ground in the course of mining activities or possible efforts to reduce the flow of nutrients into the Gulf of America, the Mississippi River basin or elsewhere;\n•\nthe potential costs and effects of implementation of federal or state water quality standards for the discharge of nitrogen and/or phosphorus into Florida waterways;\n•\nthe financial resources of our competitors, including state-owned and government-subsidized entities in other countries;\n•\nthe possibility of defaults by our customers on trade credit that we extend to them or on indebtedness that they incur to purchase our products and that we guarantee;\n•\nany significant reduction in customers’ liquidity or access to credit that they need to purchase our products;\n•\nthe effectiveness of the processes we put in place to manage our significant strategic priorities and to successfully integrate and grow acquired businesses;\n•\nactual costs of various items differing from management’s current estimates, including, among others, asset retirement, environmental remediation, reclamation or other environmental obligations;\n•\nthe costs and effects of legal and administrative proceedings and regulatory matters affecting us, including environmental, tax or administrative proceedings, complaints that our operations are adversely impacting nearby farms, businesses, other property uses or properties, settlements thereof and actions taken by courts with respect to approvals of settlements, costs related to defending and resolving global audit, appeal or court activity and other further developments in legal proceedings and regulatory matters;\n•\nthe success of our efforts to attract and retain highly qualified and motivated employees;\n•\nstrikes, labor stoppages or slowdowns by our work force or increased costs resulting from unsuccessful labor contract negotiations, and the potential costs and effects of compliance with new regulations affecting our workforce, which increasingly focus on wages and hours, healthcare, retirement and other employee benefits;\n•\nbrine inflows at our potash mines;\n•\naccidents or other incidents involving our properties or operations, including potential fires, explosions, seismic events, sinkholes, unsuccessful tailings management, ineffective mine safety procedures or releases of hazardous or volatile chemicals;\n•\nterrorism, armed conflict or other malicious intentional acts, including cybersecurity risks such as attempts to gain unauthorized access to, or disable, our information technology systems, or our costs of addressing malicious intentional acts;\n41\nTable of Contents\n•\nactions by the holders of controlling equity interests in businesses in which we hold a noncontrolling interest;\n•\nchanges in our relationships with the other member of Canpotex or any joint venture in which we participate or its or our exit from participation in Canpotex or any such export association or joint venture, and other changes in our commercial arrangements with unrelated third parties; and\n•\nother risk factors reported from time to time in our SEC reports.\nMaterial uncertainties and other factors known to us are discussed in Item 1A, “Risk Factors,” of our 10-K Report, and of this report, and incorporated by reference herein as if fully stated herein.\nWe base our forward-looking statements on information currently available to us, and we undertake no obligation to update or revise any of these statements, whether as a result of changes in underlying factors, new information, future events or other developments.\n42\nTable of Contents"
}