{
  "source_file": "mos-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.  Business.\nOVERVIEW\nThe Mosaic Company is the world’s leading producer and marketer of concentrated phosphate and potash crop nutrients. Through our broad product offering, we are a single source supplier of phosphate- and potash-based crop nutrients and animal feed ingredients. We serve customers in approximately 40 countries. We are the second largest integrated phosphate producer in the world and one of the largest producers and marketers of phosphate-based animal feed ingredients in North America and Brazil. We are the leading fertilizer production and distribution company in Brazil. We mine phosphate rock in Florida, Brazil and Peru. We process rock into finished phosphate products at facilities in Florida, Louisiana and Brazil. We are typically one of the top four global potash producers in the world. We mine potash in Saskatchewan, New Mexico and Brazil. We have other production, blending or distribution operations in Brazil, China, India and Paraguay. Our operations serve the top four nutrient-consuming countries in the world: China, India, U.S. and Brazil.\nThe Mosaic Company is a Delaware corporation that was incorporated in March 2004 and serves as the parent company of the business that was formed through the October 2004 combination of IMC Global Inc. (“\nIMC\n”) and the fertilizer businesses of Cargill, Incorporated. We are publicly traded on the New York Stock Exchange under the ticker symbol “MOS” and are headquartered in Tampa, Florida.\nWe conduct our business through wholly- and majority-owned subsidiaries as well as businesses in which we own less than a majority or a non-controlling interest. We are organized into three reportable business segments: Phosphates, Potash and Mosaic Fertilizantes. Intersegment eliminations, unrealized mark-to-market gains/losses on derivatives, debt expenses, and the results of the China and India distribution businesses are included within Corporate, Eliminations and Other.\nThe following charts show the respective contributions to 2024 sales volumes, net sales and gross margin for each of our business segments in effect at December 31, 2024:\nWe account for approximately 11% of estimated global annual phosphate production. We also account for approximately 12% of estimated global annual potash production.\nPhosphates Segment\n–\nWe sell phosphate-based crop nutrients and animal feed ingredients throughout North America and internationally. We account for approximately 66% of estimated North American annual production of concentrated phosphate crop nutrients.\n 1\nTable of Content\nPotash Segment\n–\nWe sell potash throughout North America and internationally, principally as fertilizer, but also for use in industrial applications and, to a lesser degree, as animal feed ingredients. We account for approximately 35% of estimated North American annual potash production.\nMosaic Fertilizantes Segment\n–\nWe produce and sell phosphate- and potash-based crop nutrients, and animal feed ingredients, in Brazil. In addition to five phosphate rock mines, four chemical plants and a potash mine in Brazil, this segment consists of sales offices, crop nutrient blending and bagging facilities, port terminals and warehouses in Brazil and Paraguay. The Mosaic Fertilizantes segment also serves as a distribution outlet for our Phosphates and Potash segments. We account for approximately 70 to 80% of estimated annual production of concentrated phosphate crop nutrients in Brazil and 100% of estimated annual potash production in Brazil.\nAs used in this report:\n•\n“\nMosaic\n” or “\nCompany\n” means The Mosaic Company;\n•\n“\nwe\n,\n” “\nus\n,\n” and “\nour\n” refer to Mosaic and its direct and indirect subsidiaries, individually or in any combination;\n•\n“\nCargill\n” means Cargill, Incorporated and its direct and indirect subsidiaries, individually or in any combination;\n•\n“\nCargill Crop Nutrition\n” means the crop nutrient business we acquired from Cargill in the Combination;\n•\n“\nCombination\n” means the October 22, 2004 combination of IMC and Cargill Crop Nutrition; and\nstatements as to our industry position reflect information from the most recent period available.\nBusiness Developments During 2024\n•\nIn April 2024, we entered into an agreement with Saudi Arabian Mining Company (“\nMa’aden\n”) to exchange our 25% ownership of the Ma'aden Wa’ad al Shamal Phosphate Company for 111,012,433 shares of Ma’aden. The transaction closed on December 24, 2024, at a value of approximately $1.5 billion, resulting in a pre-tax gain of approximately $0.5 billion. The shares are reflected in Investments in Equity Securities in our Consolidated Balance Sheet at December 31, 2024. \n•\nIn 2024, we repurchased 7,944,507 shares of Common Stock in the open market for approximately $235.4 million at an average purchase price of $29.63. \nIn February 2025, the U.S. imposed tariff increases on imports from several countries, including a 25% tariff on most imports from Canada, including potash.  Subsequently, the implementation of these tariffs has been paused for 30 days following an agreement between the U.S. and Canada.  At this time, we do not expect these tariffs to have a significant impact on our Potash business and operating results.  \nWe have included additional information about these and other developments in our business during 2024 in our Management’s Discussion and Analysis of Financial Condition and Results of Operations (“\nManagement’s Analysis\n”) and in the Notes to Consolidated Financial Statements.\nThroughout the discussion below, we measure units of production, sales and raw materials in metric tonnes, which are the equivalent of 2,205 pounds, or 1.102 tons (U.S. standard), unless we specifically state that we mean short or long ton(s), which are the equivalent of 2,000 pounds and 2,240 pounds, respectively. In addition, we measure natural gas, a raw material used in the production of our products, in MM BTU, which stands for one million British Thermal Units (“\nBTU\n”). One BTU is equivalent to 1.06 Joules.\nInformation concerning our mining properties in this Annual Report on Form 10-K has been prepared in accordance with Subpart 1300 of Regulation S-K (“\nS-K 1300\n”). S-K 1300 requires us to disclose our mineral resources, in addition to our mineral reserves, as of the end of our most recently completed fiscal year, both in the aggregate and for each of our individually material mining properties. We have four material properties: Belle Plaine, Esterhazy, Florida and Tapira. See Item 2. “Properties,” for further information regarding mineral reserves and resource and discussion of our material mining properties.\nThis report includes market share and industry data and forecasts that we obtained from publicly available information and industry publications, surveys, market research, internal company surveys and consultant surveys. We believe these sources to be reliable, but there can be no assurance as to the accuracy and completeness of such information. We have not independently verified the data from third-party sources, nor have we ascertained the underlying economic assumptions relied \n 2\nTable of Content\nupon therein. Similarly, internal company surveys, industry forecasts and market research, which we believe to be reliable based upon management’s knowledge of the industry, have not been verified by any independent sources.\nBUSINESS SEGMENT INFORMATION\nThe discussion below of our business segment operations should be read in conjunction with the following information that we have included in this report:\n•\nThe risk factors discussed in this report in Part I, Item 1A, “Risk Factors”.\n•\nOur Management’s Analysis.\n•\nThe financial statements and supplementary financial information in our Consolidated Financial Statements (“\nConsolidated Financial Statements\n”).\nThis information is incorporated by reference into this section from Part II, Item 8, “Financial Statements and Supplementary Data”.\nPhosphates Segment\nOur Phosphates business segment owns and operates mines and production facilities in Florida which produce concentrated phosphate crop nutrients and phosphate-based animal feed ingredients, and processing plants in Louisiana which produce concentrated phosphate crop nutrients. We have a 75% \neconomic interest in the Miski Mayo Phosphate Mine in Peru (\n“\nMiski Mayo Mine\n”\n), which is included in the results of our Phosphates segment. \nThe following map shows the locations of each of our phosphate concentrates plants in the U.S. and each of our active, temporarily idled, and planned phosphate mine locations, including beneficiation plants, in Florida. The reserves associated with our Ona, Florida location have been allocated to other active mines based on our future mining plans:\n 3\nTable of Content\nU.S. Phosphate Crop Nutrients and Animal Feed Ingredients\nOur U.S. Phosphates operations have capacity to produce approximately 4.5 million tonnes of phosphoric acid (“\nP\n2\nO\n5\n”) per year, or about 7% of world annual capacity and about 60% of North American annual capacity. P\n2\nO\n5\n is produced by reacting finely ground phosphate rock with sulfuric acid. P\n2\nO\n5\n is the key building block for the production of high analysis or concentrated phosphate crop nutrients and animal feed products and is the most comprehensive measure of phosphate capacity and production and a commonly used benchmark in our industry. Our U.S. P\n2\nO\n5\n production totaled approximately 2.9 million tonnes during 2024. Our U.S. operations account for approximately 6% of estimated global annual production and 53% of estimated North American annual output of P\n2\nO\n5\n.\nOur phosphate crop nutrient products are marketed worldwide to crop nutrient manufacturers, distributors, retailers and farmers. Our principal phosphate crop nutrient products are:\n•\nDiammonium Phosphate (18-46-0):\n Diammonium Phosphate (“\nDAP\n”) is the most widely used high-analysis phosphate crop nutrient worldwide. DAP is produced by first combining phosphoric acid with anhydrous ammonia in a reaction vessel. This initial reaction creates a slurry that is then pumped into a granulation plant where it is reacted with additional ammonia to produce DAP. DAP is a solid granular product that is applied directly or blended with other solid plant nutrient products, such as urea and potash.\n•\nMonoammonium Phosphate (11-52-0):\n Monoammonium Phosphate (“\nMAP\n”) is the second most widely used high-analysis phosphate crop nutrient. MAP is also produced by first combining phosphoric acid with anhydrous ammonia in a reaction vessel. The resulting slurry is then pumped into the granulation plant where it is reacted with additional P\n2\nO\n5\n to produce MAP. MAP is a solid granular product that is applied directly or blended with other solid plant nutrient products.\n 4\nTable of Content\n•\nMicroEssentials\n®\n is a value-added ammoniated phosphate product that is enhanced through a patented process that creates very thin platelets of sulfur and other micronutrients, such as zinc, on the granulated product. The patented process incorporates both the sulfate and elemental forms of sulfur, providing season-long availability to crops.\nProduction of our animal feed ingredients products is located at our New Wales, Florida facility. We market our feed phosphate primarily under the leading brand names of Biofos\n®\n and Nexfos\n®\n.\nAnnual capacity by plant as of December 31, 2024 and production volumes by plant for 2024 are listed below:\n(tonnes in millions)\nPhosphoric Acid\nProcessed Phosphate\n(a)\n/DAP/MAP/ MicroEssentials\n®\n/Feed Phosphate\n \nOperational Capacity\n(b)\nOperational Capacity\n(b)\nFacility\nProduction\n(c)\nProduction\n(c)\nFlorida:\nBartow\n1.1 \n0.9 \n2.5 \n2.0 \nNew Wales\n1.7 \n1.0 \n4.0 \n2.3 \nRiverview\n0.9 \n0.5 \n1.8 \n0.9 \n3.7 \n2.4 \n8.3 \n5.2 \nLouisiana:\nFaustina\n— \n— \n1.6 \n1.1 \nUncle Sam\n0.8 \n0.5 \n— \n— \n0.8 \n0.5 \n1.6 \n1.1 \nTotal\n4.5 \n2.9 \n9.9 \n6.3 \n______________________________\n(a)\nOur ability to produce processed phosphate has been less than our annual operational capacity stated in the table above, except to the extent we purchase \nP\n2\nO\n5\n. Factors affecting actual production are described in note (c) below.\n(b)\nOperational capacity is our estimated long-term capacity based on an average amount of scheduled down time, including maintenance and scheduled turnaround time, and product mix, and no significant modifications to operating conditions, equipment or facilities.\n(c)\nActual production varies from annual operational capacity shown in the above table due to factors that include, among others, the level of demand for our products, maintenance and turnaround time, accidents, mechanical failure, product mix, and other operating conditions.\nThe P\n2\nO\n5\n produced at Uncle Sam is shipped to Faustina, where it is used to produce DAP, MAP and MicroEssentials\n®\n.\n \nOur Faustina plant also manufactures ammonia that is mostly consumed in our concentrate plants.\nWe produced approximately 6.3 million tonnes of concentrated phosphate crop nutrients during 2024 and accounted for approximately 66% of estimated North American annual production.\nPhosphate Rock\nPhosphate rock is the key mineral used to produce phosphate crop nutrients and feed phosphate. Our Florida phosphate rock mines produced approximately 8.9 million tonnes in 2024 and accounted for approximately 47% of estimated North American annual production. We are the world’s second largest miner of phosphate rock (excluding China) and currently operate four mines in North America with a combined annual capacity of 17.2 million tonnes. Additionally, we own 75% of the Miski Mayo Mine, which has an annual capacity of 4.8 million tonnes. Production of one tonne of DAP requires between 1.6 and 1.7 tonnes of phosphate rock.\nAll of our wholly-owned phosphate mines and related mining operations in North America are located in central Florida. During 2024, we operated three active mines in Florida: Four Corners, South Fort Meade and Wingate. We plan to explore and develop the DeSoto property and the South Pasture property, which was previously idled, to offset future depletion at our Florida properties. We have a 75% economic interest in the Miski Mayo Mine, which allows us to supplement our other produced rock to meet our overall fertilizer production needs and is the primary source of rock for our Louisiana operations. We have the right to use or sell to third parties 75% of the Miski Mayo Mine’s annual production.\n 5\nTable of Content\nSee “Item 2. Properties” for a discussion of our phosphate mining properties, including processing methods, facilities, production and summaries of our mineral resources and reserves, both in the aggregate and for our individual material phosphate mining properties.\nSulfur\nWe use molten sulfur at our phosphate concentrates plants to produce sulfuric acid, primarily for use in our production of P\n2\nO\n5\n. We purchased approximately 3.0 million long tons of sulfur during 2024. We purchase the majority of this sulfur from North American oil and natural gas refiners who are required to remove or recover sulfur during the refining process. Production of one tonne of DAP requires approximately 0.40 long tons of sulfur. We procure our sulfur from multiple sources and receive it by truck, rail, barge and vessel, either directly at our phosphate plants or have it sent for gathering to terminals that are located on the U.S. gulf coast. In addition, we use formed sulfur received through Tampa, Florida ports, which are delivered by truck to our New Wales facility and melted through our sulfur melter.\nWe own and operate sulfur terminals in Riverview and Tampa, Florida, along with Galveston, Texas and Faustina, Louisiana.\n \nWe also lease terminal space in Beaumont, Texas. We have long-term time charters on two ocean-going tugs/barges and one ocean-going vessel that transports molten sulfur from the Texas terminals to Tampa. We then further transport by truck to our Florida phosphate plants. Our sulfur logistic assets also include a large fleet of leased railcars that supplement our marine sulfur logistic system. Our Louisiana operations are served by truck from nearby refineries.\nAlthough sulfur is readily available from many different suppliers and can be transported to our phosphate facilities by a variety of means, sulfur is an important raw material used in our business that has in the past been, and may in the future, be the subject of volatile pricing and availability. Alternative transportation and terminaling facilities might not have sufficient capacity to fully serve all of our facilities in the event of a disruption to current transportation or terminaling facilities. Changes in the price of sulfur or disruptions to sulfur transportation or terminaling facilities could have a material impact on our business. We have included a discussion of sulfur prices in our Management’s Analysis.\nAmmonia\nWe use ammonia together with P\n2\nO\n5\n to produce DAP, MAP and MicroEssentials\n®\n. We consumed approximately 1.0 million tonnes of ammonia during 2024. Production of one tonne of DAP requires approximately 0.23 tonnes of ammonia. We purchase approximately one-third of our ammonia from various suppliers in the spot market with the remaining two-thirds either purchased through our ammonia supply agreement (the “\nCF Ammonia Supply Agreement\n”) with an affiliate of CF Industries Inc. (“\nCF\n”) or produced internally at our Faustina, Louisiana location.\nOur Florida ammonia needs are currently supplied under multi-year contracts with both domestic and offshore producers. Ammonia for our Florida plants is terminaled through owned ammonia facilities at the Port of Tampa and Port Sutton, Florida. Ammonia is transported by pipeline from the terminals to our production facilities. We have service agreements with the operators of the pipelines for Bartow, New Wales and Riverview, which provide service through June 30, 2025 with two year auto-renewal provisions unless either party objects.\nUnder the CF Ammonia Supply Agreement, we purchased 556,232 metric tonnes in 2024. This contract terminated effective January 1, 2025. We now have agreements with various suppliers to ensure we have reliable sources of supply for ammonia to support competitive pricing in various market conditions.\nWe produce ammonia at Faustina, Louisiana primarily for our own consumption. Our annual capacity is approximately 530,000 tonnes. From time to time, we sell surplus ammonia to unrelated parties and/or may transport surplus ammonia to the Port of Tampa. In certain circumstances, we source ammonia from alternative sources to receive at Faustina.\nAlthough ammonia is readily available from many different suppliers and can be transported to our Phosphates facilities by a variety of means, ammonia is an important raw material used in our business that has in the past been, and may in the future be, the subject of volatile pricing. In addition, alternative transportation and terminaling facilities might not have sufficient capacity to fully serve all of our facilities in the event of a disruption to existing transportation or terminaling facilities. Changes in the price of ammonia or disruptions to ammonia transportation or terminaling could have a material impact on our business. We have included a discussion of ammonia prices in our Management’s Analysis.\n 6\nTable of Content\nNatural Gas for Phosphates\nNatural gas is the primary raw material used to manufacture ammonia. At our Faustina facility, ammonia is manufactured on site. The majority of natural gas is purchased through firm delivery contracts based on published index-based prices and is sourced from Texas and Louisiana via pipelines interconnected to the Henry Hub. We use over-the-counter swap and/or option contracts to forward price portions of future natural gas purchases. We typically purchase approximately 12.0 million MM BTU of natural gas per year for use in ammonia production at Faustina.\nOur ammonia requirements for our Florida operations are purchased rather than manufactured on site. Therefore, while we typically purchase approximately 3.2 million MM BTU of natural gas per year in Florida, it is only used as a thermal fuel for various phosphate production processes.\nFlorida Land Holdings\nWe are a significant landowner in the State of Florida, which has in the past been considered one of the fastest areas of population growth in the U.S. We have land holdings totaling over 368,000 acres. These land holdings give Mosaic access to phosphate rock reserves and exist as fee simple, mining agreements or mineral rights. Some of our land holdings are needed to operate our Phosphates business, while a portion of our land assets, such as certain reclaimed properties, are no longer required for our ongoing operations. As a general matter, more of our reclaimed property becomes available for uses other than for phosphate operations each year. Our real property assets are generally comprised of concentrates plants, port facilities, phosphate mines and other property which we have acquired through our presence in Florida. Our long-term future land use strategy is to optimize the value of our land assets.\nPotash Segment\nWe are one of the leading potash producers in the world. We mine and process potash in Canada and the U.S. and sell potash in North America and internationally. The term “potash” applies generally to the common salts of potassium. Muriate of potash (“\nMOP\n”) is the primary source of potassium for the crop nutrient industry. Red MOP has traces of iron oxide. The granular and standard grade red MOP products are well suited for direct fertilizer application and bulk blending. White MOP has a higher percent potassium oxide (“\nK\n2\nO\n”). White MOP, besides being well suited for the agricultural market, is used in many industrial applications. We also produce a double sulfate of potash magnesia product, which we market under our brand name K-Mag\n®\n, at our Carlsbad, New Mexico facility.\nOur potash products are marketed worldwide to crop nutrient manufacturers, distributors and retailers and are also used in the manufacturing of mixed crop nutrients and, to a lesser extent, in animal feed ingredients. We also sell potash to customers for industrial use. In addition, our potash products are used for de-icing and as a water softener regenerant.\nIn 2024, we operated three potash mines in Canada, including two shaft mines and one solution mine, as well as one potash shaft mine in the U.S. Esterhazy, the largest potash mine in the world, has completed full ramp up of capacity and production. The K3 mine shaft expansion has been supplying the capacity and production needed since the closure of the K1 and K2 shafts in the second quarter of 2021. Decommissioning of the K1 and K2 shafts at our Esterhazy, Saskatchewan mine was completed in 2022. \nMosaic leases approximately 291,500 acres of mineral rights from the government of Saskatchewan, and approximately 99,700 acres of freehold mineral rights in the Kronau/Regina area, which have not been developed. \nWe pay Canadian resource taxes consisting of the Potash Production Tax and resource surcharge. The Potash Production Tax is a Saskatchewan provincial tax on potash production and consists of a base payment and a profits tax. We also pay a percentage of the value of resource sales from our Saskatchewan mines. In addition to the Canadian resource taxes, royalties are payable to the mineral owners in respect of potash reserves or production of potash. We have included a further discussion of the Canadian resource taxes and royalties in our Management’s Analysis.\n 7\nTable of Content\nThe map below shows the location of each of our potash properties in North America:\nOur North American potash annualized operational capacity totals 11.5 million tonnes of product per year and accounts for approximately 14% of world annual capacity and 41% of North American annual operational capacity. Production during 2024 totaled 8.8 million tonnes. We account for approximately 12% of estimated world annual production and 35% of estimated North American annual production.\n 8\nTable of Content\nThe following table shows, for each of our potash mines, annual capacity as of December 31, 2024 and finished product output for 2024:\n(tonnes in millions)\n \n \nFacility\nAnnualized\nProven\nPeaking\nCapacity\n(a)(c)\nAnnual\nOperational\nCapacity\n(a)(b)(e)\nFinished\nProduct\n(b)\nCanada\nBelle Plaine—MOP\n(d)\n3.9 \n3.0 \n3.0 \nColonsay—MOP\n (d)(f)\n2.6 \n1.5 \n0.6 \nEsterhazy—MOP\n(d)(g)\n6.3 \n6.3 \n4.7 \nCanadian Total\n12.8 \n10.8 \n8.3 \nUnited States\nCarlsbad—K-Mag\n®(h)\n0.9 \n0.7 \n0.5 \nUnited States Total\n0.9 \n0.7 \n0.5 \nTotals\n13.7 \n11.5 \n8.8 \n______________________________\n(a)\nFinished product.\n(b)\nActual production varies from annual operational capacity shown in the above table due to factors that include, among others, the level of demand for our products, maintenance and turnaround time, the quality of the reserves and the nature of the geologic formations we are mining at any particular time, accidents, mechanical failure, product mix and other operating conditions.\n(c)\nRepresents full capacity assuming no turnaround or maintenance time.\n(d)\nThe annualized proven peaking capacity shown above is the capacity currently used to determine our share of Canpotex, Limited (“\nCanpotex\n”) sales. Canpotex members’ respective shares of Canpotex sales are based upon the members’ respective proven peaking capacities for producing potash. When a Canpotex member expands an existing mine, the new capacity is added to that member’s proven peaking capacity based on either a 90-day production run at the maximum production levels or an engineering audit of the expansion performed by an independent engineering firm in accordance with approved protocols. The annual operational capacity of a mine reported in the table above can exceed the annualized proven peaking capacity until the proving run or engineering audit has been completed. Our current entitlement percentage of Canpotex is 36.2%, however in 2024, our percentage was 34.5% due to lower shipments as a result electrical equipment problems.  \n(e)\nAnnual operational capacity is our estimated potash production capacity based on the quality of reserves and the nature of the geologic formations expected to be mined, milled and/or processed over the long term, average amount of scheduled down time, including maintenance and scheduled turnaround time, and product mix, and no significant modifications to operating conditions, equipment or facilities. Operational capacities will continue to be updated to the extent new production results impact ore grades assumptions.\n(f)\nOur Colonsay mine operates as a swing mine to meet market demands. We have the ability to reach an annual operating capacity of 2.1 million tonnes over time by increasing our staffing levels and investment in mine development activities. \n(g)\nFollowing completion of our Esterhazy K3 expansion project, a third-party audit assessed our Esterhazy Facility's nameplate capacity at 7.8 million tonnes. To date, we have been unable to rely upon this audit as a basis for an increase to our Canpotex entitlement percentage. We are evaluating when to take the necessary steps to complete the entitlement adjustment process.\n(h)\nK-Mag\n®\n is a specialty product that we produce at our Carlsbad facility.\nSee Item 2. “Properties” for a discussion of our potash mining properties, including processing methods, facilities, production and summaries of our mineral resources and reserves, both in the aggregate and for our individual material potash mining properties.\nNatural Gas\nNatural gas is used at our Belle Plaine solution mine as a fuel to produce steam and to dry potash products. The steam is used to generate electricity and provide thermal energy to the evaporation, crystallization and solution mining processes. The Belle Plaine solution mine typically accounts for approximately 80% of our Potash segment’s total natural gas requirements for potash production. At our shaft mines, natural gas is used as a fuel to heat fresh air supplied to the shaft mines and for drying potash products. Combined natural gas usage for both the solution and shaft mines totaled 17.2 million MM BTU during 2024. We purchase our natural gas requirements on firm delivery index price-based physical contracts and on short-term spot-priced physical contracts. Our Canadian operations purchase physical natural gas from companies in Alberta and Saskatchewan using AECO price indices references and transport the gas to our plants via the TransGas pipeline system. The \n 9\nTable of Content\nU.S. potash operation in New Mexico purchases physical gas in the southwest respective regional market using the El Paso San Juan Basin market pricing reference. We use financial derivative contracts to manage the pricing on portions of our natural gas requirements.\nMosaic Fertilizantes Segment\nOur Mosaic Fertilizantes segment owns and operates mines, chemical plants, crop nutrient blending and bagging facilities, port terminals and warehouses in Brazil and Paraguay, which produce and sell concentrated phosphate crop nutrients, phosphate-based animal feed ingredients and pot\na\nsh fertilizer. The following map shows the locations of our operations in Brazil and Paraguay:\nWe are the largest producer and one of the largest distributors of blended crop nutrients for agricultural use in Brazil. We produce and sell phosphate- and potash-based crop nutrients, and animal feed ingredients through our operations. Our operations in Brazil include five phosphate mines, four chemical plants and a potash mine. We own and operate ten blending plants in Brazil and one blending plant and port in Paraguay. We are currently constructing a one million tonne distribution facility in northern Brazil in Palmeirante. In addition, we lease several other warehouses and blending units depending on sales and production levels. We also have a 62% ownership interest in Fospar, S.A. (“\nFospar\n”). Fospar owns and operates an SSP (defined below) granulation plant, which produces approximately 0.5 million tonnes of SSP per year, and a deep-water port and throughput warehouse terminal facility in Paranagua, Brazil. The port facility at Paranagua handles approximately \n 10\nTable of Content\n3.6 million tonnes of imported crop nutrients. In 2024, Mosaic Fertilizantes sold approximately 9.0 million tonnes of crop nutrient products and accounted for approximately 18% of fertilizer shipments in Brazil.\nWe have the capability to annually produce approximately 4.5 million tonnes of phosphate- and potash-based crop nutrients and animal feed ingredients. Crop nutrient products produced are marketed to crop nutrient manufacturers, distributors, retailers and farmers.\nIn addition to producing crop nutrients, Mosaic Fertilizantes purchases phosphate, potash and nitrogen products which are either used to produce blended crop nutrients (“\nBlends\n”) or for resale. In 2024, Mosaic Fertilizantes purchased 1.2 million tonnes of phosphate-based products, primarily MicroEssentials\n®\n, from our Phosphates segment, and 2.2 million tonnes of potash products from our Potash segment and Canpotex.\nPhosphate Crop Nutrients and Animal Feed Ingredients\nOur Brazilian phosphate operations have capacity to produce approximately 1.1 million tonnes of P\n2\nO\n5\n per year, or about 62% of Brazilian annual capacity. Phosphoric acid is produced by reacting ground phosphate rock with sulfuric acid. P\n2\nO\n5\n is the key building block for the production of high analysis or concentrated phosphate crop nutrients and animal feed products and is the most comprehensive measure of phosphate capacity and production and a commonly used benchmark in our industry. Our Brazilian phosphoric acid production totaled approximately 1.0 million tonnes in 2024 and accounted for approximately 89% of Brazilian annual output.\nOur principal phosphate crop nutrient products are:\n•\nMonoammonium Phosphate (11-52-0) (\n“\nMAP\n”\n):\n  MAP is a crop nutrient composed of two macronutrients, nitrogen and phosphoric acid. This slurry is added inside a rotary drum type granulator with ammonia to complete the neutralization reaction and produce MAP.\n•\nTriple superphosphate (\n“\nTSP\n”\n):  \nTSP is a highly concentrated phosphate crop nutrient. TSP is produced from the phosphate rock reaction with phosphoric acid in a kuhlmann type reactor. The process for the production of TSP in Brazil is run of pile where the product undergoes a curing process of approximately seven days for later granulation.\n•\nSingle superphosphate (\n“\nSSP\n”\n): \n SSP is a crop nutrient with a low concentration of phosphorus that is used in agriculture because of the sulfur content in its formulation. SSP is produced from mixing phosphate rock with sulfuric acid in a kuhlmann or malaxador type reactor. After the reaction, the product goes to the curing process and then feeds the granulation units.\n•\nDicalcium phosphate (\n“\nDCP\n”\n): \n Dicalcium phosphate is produced by the reaction of desulphurized phosphoric acid with limestone. At Uberaba, it is produced from the reaction of concentrated phosphoric acid with limestone slurry. At Cajati, the phosphoric acid is diluted with dry limestone. The reaction of the DCP occurs in a kuhlmann or spinden type reactor.\nOur primary mines and chemical plants are located in the states of Minas Gerais, São Paulo, and Goias. Production of our animal feed ingredients products is located at our Uberaba, Minas Gerais and Cajati, São Paulo facilities. We market our feed phosphate primarily under the brand name Foscálcio.\nAnnual capacity and production volume by plant as of December 31, 2024 are listed below:\n(tonnes of ore in millions)\nPhosphoric Acid\nProcessed Phosphate\n(a)\n (MAP/TSP/SSP/DCP/Feed)\nFacility\nCapacity\n(b)\nProduction\n(c)\nCapacity\n(b)\nProduction\n(c)\nPhosphate\nUberaba\n0.9 \n0.8 \n2.0 \n1.5 \nCajati\n0.2 \n0.2 \n0.5 \n0.3 \nAraxá \n— \n— \n1.1 \n0.9 \nCatalão\n— \n— \n0.4 \n0.4 \nTotal\n1.1 \n1.0 \n4.0 \n3.1 \n______________________________\n 11\nTable of Content\n(a)\nOur ability to produce processed phosphate has been less than our annual operational capacity as stated in the table above, except to the extent we purchase phosphoric acid. Factors affecting actual production are described in note (c) below.\n(b)\nThe annual production capacity was calculated using the hourly capacity, days stopped for annual maintenance and OEE (historical utilization factor and capacity factor).\n(c)\nActual production varies from annual operational capacity shown in the table above due to factors that include, among others, the level of demand for our products, maintenance and turnaround time, accidents and mechanical failure.\nThe phosphoric acid produced at Cajati is used to produce DCP. The phosphoric acid produced at Uberaba is used to produce MAP, TSP and DCP.\nWe produced approximately 2.6 million tonnes of concentrated phosphate crop nutrients during 2024 which accounted for approximately 48% of estimated Brazilian annual production.\nPhosphate Rock\nPhosphate rock is the key mineral used to produce phosphate crop nutrients and animal feed product. Our phosphate rock production in Brazil totaled approximately 3.9 million tonnes in 2024, which accounted for approximately 74% of estimated Brazilian annual production. We are the largest producer of phosphate rock in Brazil and currently have an annual capacity of approximately 4.6 million tonnes. During 2024, we operated five properties; Araxá, Patrocínio and Tapira in the state of Minas Gerais; Catalão in the state of Goiás; and Cajati in the state of São Paulo.\nProduction of one tonne of MAP requires 1.6 to 1.7 tonnes of phosphate rock. Production of one tonne of SSP requires between 0.6 to 0.7 tonnes of phosphate rock. Production of one tonne of TSP requires 1.4 tonnes of phosphate rock.\nSee Item 2. “Properties” for a discussion of our Brazilian mining properties, including processing methods, facilities, production and summaries of our mineral resources and reserves, both in the aggregate and for our individually material Brazilian properties.\nWe are required to pay royalties to mineral owners and resource taxes to the Brazilian government for phosphate and potash production. The resource taxes, known as Compensação Financeira pela Exploração de Recursos Minerais or CFEM\n, \nare regulated by\n \nthe National Mining Agency. In 2024, we paid royalties and resource taxes of approximately $22.1 million.\nSulfur\nWe use molten sulfur at our phosphate concentrates plants to produce sulfuric acid, one of the key components used in the production of phosphoric acid. We consumed approximately 1.0 million long tons of sulfur for our own production during 2024. We purchase approximately 14% of the volume under annual supply agreements from oil and natural gas refiners, who are required to remove or recover sulfur during the refining process. The remaining 86% is purchased in the spot market. \nSulfur is imported through the Tiplam port and transported by rail to the Uberaba plant and by truck to the \nAraxá\n and Cajati locations.\nAlthough sulfur is readily available from many different suppliers and can be transported to our phosphate facilities by a variety of means, sulfur is an important raw material used in our business that has in the past been, and could in the future be, subject to volatile pricing and availability. Alternative transportation and terminaling facilities might not have sufficient capacity to fully serve all of our facilities in the event of a disruption to current transportation or terminaling facilities. Changes in the price of sulfur or disruptions to sulfur transportation or terminaling facilities could have a material impact on our business.\nAmmonia\nWe use ammonia, together with phosphoric acid, to produce MAP, and to a lesser extent for SSP production. We consumed approximately 118,280 tonnes of ammonia during 2024. Production of one tonne of MAP requires approximately 0.137 tonnes of ammonia. We purchase all of our ammonia under a long-term supply agreement with two suppliers. Ammonia is imported through the Tiplam port and transported by truck to Uberaba, Araxá and Catalão.\nWe own approximately 1% of the Tiplam terminal in Santos, São Paulo. Our ownership percentage, along with a contractual agreement, guarantee us unloading priority for ammonia and also provide us unloading capacity for rock, sulfur and crop nutrients.\n 12\nTable of Content\nAlthough ammonia is readily available from many different suppliers and can be transported to our phosphates facilities by a variety of means, ammonia is an important raw material used in our business that has in the past been, and in the future could be, subject to volatile pricing. Alternative transportation and terminaling facilities might not have sufficient capacity to fully serve all of our facilities in the event of a disruption to existing transportation or terminaling facilities. Changes in the price of ammonia or disruptions to ammonia transportation or terminaling could have a material impact on our business. \nBrazilian Potash\nWe conduct potash operations through the leased Taquari-Vassouras shaft mine, which is the only potash mine in Brazil, located in Rosário do Catete in the Brazilian state of Sergipe. We also own a related refinery at the site. We produce and sell potash product domestically. MOP is the primary source of potassium for the crop nutrient industry in Brazil. Red MOP has traces of iron oxide. The granular and standard grade red MOP products are well-suited for direct fertilizer application and bulk blending. Our potash product is marketed in Brazil to crop nutrient manufacturers, distributors and retailers and is also used in the manufacturing of crop nutrients.\nIn 2024, we paid royalties of approximately $6.8 million related to the leasing of potash assets and mining rights for Taquari.\nLand Holdings\nMosaic Fertilizantes owns properties and the surface rights of certain rural lands comprising over 34,000 hectares (84,000 acres) in the States of São Paulo, Minas Gerais, Goiás, Paraná, Mato Grosso, Santa Catarina, Bahia and Sergipe, and has the right to mine additional properties which contain phosphate rock or potash reserves. Most of our land holdings are needed to operate our phosphate and potash production and fertilizer distribution businesses. A portion of our land assets may no longer be required for our current operations and may be leased to third parties, for agricultural or other purposes, or may be set aside for mineral or environmental conservation. Our real property assets are generally comprised of concentrates plants, port facilities and phosphate and potash mines, crop nutrient blending and bagging facilities and other properties which we have acquired through our presence in Brazil.\nIndia and China Distribution Businesses\nOur China and India distribution businesses market phosphate-, potash- and nitrogen-based crop nutrients and provide other ancillary services to wholesalers, cooperatives, independent retailers, and farmers in the Asia-Pacific regions. These operations provide our Phosphates and Potash segments access to key markets outside of North and South America and serve as a marketing agent for our Phosphates segment. In 2024, the India and China operations purchased 25,233 tonnes of phosphate-based products from our Phosphates segment, and 1,077,567 tonnes of potash products from our Potash segment and Canpotex. They also purchase phosphate, potash and nitrogen products from unrelated third parties, which we either use to produce blended crop nutrients or for resale.\nIn China, we own two 300,000-tonne per year capacity blending plants. In 2024, we sold approximately 325,000 tonnes of Blends and distributed another 850,000 tonnes of phosphate and potash crop nutrients in China.\nIn India, we have distribution facilities to import and sell crop nutrients. In 2024, we distributed approximately 201,000 tonnes of potash crop nutrient products in India.\nSALES AND DISTRIBUTION ACTIVITIES\nUnited States and Canada\nWe have a U.S. and Canada sales and marketing team that serves our business segments. We sell to wholesale distributors, retail chains, cooperatives, independent retailers and national accounts.\nCustomer service and the ability to effectively minimize the overall supply chain costs are key competitive factors in the crop nutrient and animal feed ingredients businesses. In addition to our production facilities, to service the needs of our customers, we own or have contractual throughput or other arrangements at strategically located distribution warehouses along or near the Mississippi and Ohio Rivers, as well as in other key agricultural regions of the U.S. and Canada. From these facilities, we distribute Mosaic-produced phosphate and potash products for customers who in turn resell the product into the distribution channel or directly to farmers in the U.S. and Canada.\n 13\nTable of Content\nWe own port facilities in Tampa, Florida which have deep water berth capabilities providing access to the Gulf Coast of the United States. We also own warehouse distribution facilities in: Rosemount, Minnesota; Pekin, Illinois; and Henderson, Kentucky.\nIn addition to the facilities that we own, our U.S. distribution operations also include leased distribution space or contractual throughput agreements in other key geographical areas including California, Florida, Illinois, Indiana, Iowa, Kentucky, Louisiana, Minnesota, Missouri, Nebraska, North Dakota, Ohio, Oklahoma, Texas and Wisconsin.\nOur Canadian customers include independent dealers and national accounts. We also lease or own warehouse facilities in Saskatchewan, Ontario, Quebec and Manitoba in Canada.\nInternational\nOutside of the U.S. and Canada, we market our Phosphates segment’s products through our Mosaic Fertilizantes segment and our China and India distribution businesses, as well as a sales force focused on geographies outside of North America. The countries that account for the largest amount of our phosphates sales outside the U.S., by volume, are Canada, Brazil, Colombia, Australia and Argentina.\nOur sales of potash products outside of the U.S. and Canada are made through Canpotex. Canpotex sales are allocated among its members based on peaking capacity. Our entitlement percentage of Canpotex was 36.2%, however in 2024 our percentage was 34.5% due to lower shipments as a result electrical equipment problems.\nOur potash exports from Carlsbad are sold through our own sales force. We also market our Potash segment’s products through our Mosaic Fertilizantes segment and our China and India distribution businesses, which acquire potash primarily through Canpotex. The countries that account for the largest amount of international potash sales, by volume, are Brazil, China, Indonesia, India and Belgium.\nTo service the needs of our customers, our Mosaic Fertilizantes segment includes a network of strategically located sales offices, crop nutrient blending and bagging facilities, port terminals and warehouse distribution facilities that we own and operate. The blending and bagging facilities primarily produce Blends from phosphate, potash and nitrogen. The average product mix in our Blends (by volume) contains approximately 22% nitrogen, 45% phosphate and 33% potash, although this mix differs based on seasonal and other factors. All of our production in Brazil is consumed within the country.\nOur India and China distribution businesses also includes a network of strategically located sales offices, crop nutrient blending and bagging facilities, port terminals and warehouse distribution facilities. These businesses serve primarily as a sales outlet for our North American phosphate production, both for resale and as an input for Blends. Our Potash segment also has historically furnished the majority of the raw materials needs for the production of Blends, primarily via Canpotex, and is expected to continue to do so in the future.\nOther Products\nWith a strong brand position in a multi-billion dollar animal feed ingredients global market, our Phosphates segment supplies animal feed ingredients for poultry and livestock to customers in North America, Latin America and Asia. Our potash sales to non-agricultural users are primarily to large industrial accounts and the animal feed industry. Additionally, in North America, we sell potash for de-icing and as a water softener regenerant. In Brazil, we also sell phosphogypsum. \nIn 2023, we announced the formation of the Mosaic Biosciences platform, a global initiative to bring the latest science and innovation to the agricultural market. The Mosaic Biosciences portfolio includes biological fertilizer complements which improve nutrient use efficiency and enhance plant growth and vigor. \nThe Mosaic Biosciences platform has grown through the acquisition of Plant Response in late 2021 and organically from the addition of new products. Our portfolio of products has been successful with customers and benefits greatly from our existing fertilizer distribution network to our customers. In 2024, Mosaic Biosciences reached 9 million acres of coverage in key markets this year which is double the prior year. Mosaic Biosciences is included primarily within Corporate, Eliminations and Other.\n 14\nTable of Content\nCOMPETITION\nBecause crop nutrients are global commodities available from numerous sources, crop nutrition companies compete primarily on the basis of delivered price. Other competitive factors include product quality, cost and availability of raw materials, customer service, plant efficiency and availability of product. As a result, markets for our products are highly competitive. We compete with a broad range of domestic and international producers, including farmer cooperatives, subsidiaries of larger companies, and independent crop nutrient companies. Foreign competitors may have access to less expensive raw materials, may not have to comply with as stringent regulatory requirements or are owned or subsidized by governments and, as a result, may have cost advantages over North American companies. We believe that our extensive North American and international production and distribution system provides us with a competitive advantage by allowing us to achieve economies of scale, transportation and storage efficiencies, and obtain market intelligence. Also, we believe our performance products, such as MicroEssentials\n®\n, provide us a competitive advantage with customers in North and South America.\nUnlike many of our competitors, we have our own distribution system to sell phosphate- and potash-based crop nutrients and animal feed ingredients, whether produced by us or by other third parties, around the globe. In North America, we have one of the largest and most strategically located distribution systems for crop nutrients, including warehouse facilities in key agricultural regions. We also have an extensive network of distribution facilities internationally, including in the key growth regions of South America and Asia, with port terminals, warehouses and blending plants in Brazil, Paraguay, China and India. Our global presence allows us to efficiently serve customers in approximately 40 countries.\nPhosphates Segment\nOur Phosphates segment operates in a highly competitive global market. Among the competitors in the global phosphate industry are domestic and foreign companies, as well as foreign government-supported producers in Asia and North Africa. Phosphate producers compete primarily based on price, as well as product quality, service and innovation. Major integrated producers of feed phosphate are located in the U.S., Europe and China. Many smaller producers are located in emerging markets around the world. Many of these smaller producers are not miners of phosphate rock or manufacturers of phosphoric acid and are required to purchase this material on the open market.\nWe believe that we are a low-cost integrated producer of phosphate-based crop nutrients, due in part to our scale, vertical integration and strategic network of production and distribution facilities. As the world’s second largest producer of concentrated phosphate, as well as the second largest miner of phosphate rock in the world and the largest in the U.S., we maintain an advantage over some competitors as the scale of operations effectively reduces production costs per unit. We are also vertically integrated to captively supply one of our key inputs, phosphate rock, to our phosphate production facilities. We believe that our position as an integrated producer of phosphate rock provides us with a significant cost advantage over competitors that are non-integrated phosphate producers. In addition, our ownership in the Miski Mayo Mine allows us to supplement our overall phosphate rock needs.  \nWe produce ammonia at our Faustina, Louisiana concentrates plant in quantities sufficient to meet approximately one third of our total ammonia needs in North America. We do not have ammonia production capacity within Florida to serve our Florida operations, but we have capacity to supply a portion of our requirements by transporting produced ammonia from Louisiana to Florida. We purchase additional ammonia from world markets and thus are subject to significant volatility in our purchase price of ammonia. Our ammonia supply agreements provide us with a supply of a substantial volume of ammonia at prices based on the price of natural gas.\nWith our dedicated sulfur transportation barges and tugs, we are also well-positioned to source an adequate, flexible and cost-effective supply of sulfur, our third key input, to our Florida and Louisiana phosphate production facilities. We believe that our investments in sulfur logistical and melting assets continue to afford us a competitive advantage compared to other producers in cost and access to sulfur.\nWith facilities in both central Florida and Louisiana, we are logistically well positioned to fulfill our material needs at very competitive prices. Those multiple production points also afford us the flexibility to optimally balance supply and demand.\nPotash Segment\nPotash is a commodity available from several geographical regions around the world and, consequently, the market is highly competitive. Through our participation in Canpotex, we compete outside of North America against various independent and state-owned potash producers. Canpotex has substantial expertise and logistical resources for the international distribution of \n 15\nTable of Content\npotash, including strategically located export assets in Portland, Oregon, St. John, New Brunswick and Vancouver, British Columbia. Our principal methods of competition with respect to the sale of potash include product pricing and offering consistent, high-quality products and superior service. We believe that our potash cost structure is competitive in the industry and should improve as we continue to complete our potash expansion projects.\nMosaic Fertilizantes\nThe Mosaic Fertilizantes segment operates in a highly competitive market in Brazil. We compete with a broad range of domestic and international producers, including farmer cooperatives, subsidiaries of larger companies, and independent crop nutrient companies. We believe that having a vertically integrated business, internationally but also in Brazil, provides us with a competitive advantage by allowing us to achieve economies of scale, transportation and storage efficiencies, and obtain market intelligence.\nMosaic Fertilizantes has a wide variety of customers including farmers, blenders and other local distributors. We compete with local businesses that offer a wide variety of products that are available from many sources. We believe the strategic location of our mines and chemical plants, in close proximity to our customers, and the benefit of our own distribution network, gives us an advantage over most of our competitors. The vertical integration of our wholly-owned production, along with our distribution network, as well as our focus on product innovation and customer solutions, position us with an advantage over many of our competitors. We have a strong brand in Brazil. In addition to having access to our own production, our distribution activities have the capability to supply a wide variety of crop nutrients to our dealer and farmer customer base.\nFACTORS AFFECTING DEMAND\nOur results of operations historically have reflected the effects of several external factors which are beyond our control and have in the past produced significant downward and upward swings in operating results. Revenues are highly dependent upon conditions in the agriculture industry and can be affected by, among other factors: crop conditions; changes in agricultural production practices; worldwide economic conditions, including the increasing world population, household incomes, and demand for more protein-rich food, particularly in developing regions such as China, India and Latin America; changing demand for biofuels; variability in commodity pricing; governmental policies; the level of inventories in the crop nutrient distribution channels; customer expectations regarding farmer economics, future crop nutrient prices and availability, and transportation costs, among other matters; market trends in raw material costs; market prices for crop nutrients; and weather. Furthermore, our crop nutrients business is seasonal to the extent farmers and agricultural enterprises in the markets in which we compete purchase more crop nutrient products during the spring and fall. The international scope of our business, spanning the northern and southern hemispheres, reduces to some extent the seasonal impact on our business. The degree of seasonality of our business can change significantly from year to year due to conditions in the agricultural industry and other factors. The seasonal nature of our businesses requires significant working capital for inventory in advance of the planting seasons.\nWe sell products throughout the world. Unfavorable changes in trade protection laws, policies and measures, government policies and other regulatory requirements affecting trade, including the imposition of tariffs; unexpected changes in tax and trade treaties; and strengthening or weakening of foreign economies as well as political relations with the U.S. may cause sales trends to customers in one or more foreign countries to differ from sales trends in the U.S.\nOur international operations are subject to risks from changes in foreign currencies, or government policy, which can affect local farmer economics.\nOTHER MATTERS\nEmployees\nWe had 13,765 employees as of December 31, 2024, consisting of approximately 10,454 salaried and 3,311 hourly employees. This includes approximately 720 salaried employees at the Miski Mayo Mine, of which we own 75% and its results are consolidated within our results of operations.\n 16\nTable of Content\nLabor Relations\nAs of December 31, 2024:\n•\nWe had eight collective bargaining agreements with unions covering certain hourly employees in the U.S. and Canada. Of these employees, approximately 15% are covered under agreements that expire in 2025. All are expected to collectively bargain for new contracts in 2025.\n•\nWe had agreements with 37 unions covering all employees in Brazil. More than one agreement may govern our relations with each of these unions. In general, the agreements are renewable on an annual basis.\nFailure to renew any of our union agreements could result in a strike or labor stoppage that could have a material adverse effect on our operations. However, we have not experienced a significant work stoppage in many years and historically have had good labor relations.\nInformation Available on our Website\nOur Annual Report Form on 10-K (“\nForm 10-K\n”\n)\n, Quarterly Reports on Form 10-Q\n \n(“\nForm 10-Q\n”), Current Reports on Form 8-K (“\nForm 8-K\n”), and amendments thereto, filed with the Securities and Exchange Commission (“\nSEC\n”) pursuant to Section 13(a) of the Securities Exchange Act of 1934, as amended, and the rules and regulations thereunder are made available free of charge on our website (www.mosaicco.com) as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. These reports are also available on the SEC’s website (www.sec.gov). The information contained on our website and the SEC’s website is not being incorporated in this report.\nHUMAN CAPITAL\nOur employees are the foundation of our Company. Our 13,765 colleagues embody Mosaic’s core values of innovation, collaboration, drive and responsibility, and are the key to enabling us to execute our mission to help the world grow the food it needs.\nAs of December 31, 2024, our regular employee base was made up of the following:\nCountry\nMale\nFemale\nTotal\nBrazil\n5,608 \n1,207 \n6,815 \nUnited States\n3,305 \n643 \n3,948 \nCanada\n1,677 \n311 \n1,988 \nPeru\n644 \n76 \n720 \nChina\n112 \n55 \n167 \nIndia\n62 \n7 \n69 \nParaguay\n32 \n18 \n50 \nSaudi Arabia\n8 \n— \n8 \nTotal\n11,448 \n2,317 \n13,765 \nMosaic is committed to the well-being and development of our employees by creating and cultivating an innovative and collaborative workplace that welcomes, values and respects diversity of people, thoughts, and perspectives; a workplace free of discrimination and intolerant of bias. As part of Mosaic’s strategic priorities, we are committed to driving actions and behaviors, both internally and within our communities, that build Mosaic’s brand as a respected and responsible company and to be an employer of choice for generations to come.\nEmployee Health and Safety\n–Safety is a top priority and we strive for zero harm to people and zero environmental incidents. Through the implementation of the Mosaic Management System, we have established a structured approach to effectively manage and control risk for the safety and well-being of our colleagues, the environment and our stockholders. The management system defines processes that help support a safe work environment and establish a continuous improvement cycle to adjust for changing conditions and identified risks. \n 17\nTable of Content\nGlobal Worker Wellness\n–Extending beyond safety, our wellness programs seek to improve the well-being of our employees – and their families – in the areas of physical and psychological health, and financial security. These programs include health screenings, insurance plans, psychological health training and mental health resources, as well as our Environmental, Health and Safety (\n“\nEHS\n”\n) Risk Reduction Program, various trainings and flexible schedules.\nDevelopment\n–Mosaic believes in continually investing in people and their lifelong learning. Mosaic holds training events throughout the year across all of our locations, invests in leadership competencies through facilitated learning opportunities and hosts an online education platform through Workday Learning, which all employees are encouraged to access for mandatory and self-guided education. Mosaic offers companywide educational reimbursement programs to help employees in each of our operating companies acquire new skills and capabilities to better meet their job responsibilities and provide for future career opportunities within the Company. Mosaic supports membership in numerous professional associations and encourages participation in work-related external networking groups.\n•\nIn 2024 Mosaic continued its programs to help employees gain the knowledge and skills that we believe will be necessary for the next evolution of our business through development programs for emerging leaders, front line leaders, mid-level and senior leaders designed to support and address the needs at different career points.  Like any company, Mosaic experiences turnover and the need to replace talent related to retirement and succession. Mosaic seeks to minimize unwanted turnover through its talent review, succession management, performance management, and compensation processes. We seek to build our talent pipeline through targeted student programs. We strive to design career paths through progressions that will enable our employees to grow and evolve their careers at Mosaic.\nCommunity\n–Mosaic is a thoughtful and engaged neighbor who invests carefully and generously through long-term partnerships with organizations that are making a difference. We are proud to support organizations and initiatives that create growth and leave a lasting impact in our communities in three main focus areas: food, water and local community. In 2023, we invested $16.7 million. While the official 2024 investment data will be available in February 2025, preliminary data indicates continued strong support in these areas with investments of over $12 million. In addition to philanthropic grants and sponsorships of local programs, we also support and facilitate volunteerism by our employees. Similarly, we participate on local committees, boards and associations focused on contributing to the vitality of the people and communities around us.\n•\n2024 was the fourth year of the Mosaic Employee Giving Program (the “\nProgram\n”) that provides employees with flexibility to connect their personal causes to corporate giving, matching and volunteerism opportunities. The Program aligns to Mosaic’s strategic priorities and our 2025 Environmental, Social and Governance performance goals. Employees can take advantage of Company matching funds through financial contributions, volunteering on personal time, or both. In North America this can be up to $2,000 annually. \nRemoving Barriers and Creating Opportunities\n–In 2024, Mosaic continued to dedicate resources to identifying barriers to employment, partnership and succession and creating more opportunities for our employees and our communities. We continued to advance progress in creating a more innovative and engaged workforce through our executive-led Employee Inclusion Networks (“\nEIN\n”), expanding community engagement and obtaining feedback and taking action on Mosaic’s workplace and employee experience through the Voice of the Employee survey.  We continued to make progress towards our previously announced global 2030 representation goals and are driving accountability into the business units by implementing business-level initiatives and programs to help foster a more inclusive workplace essential for fostering innovation and collaboration. Ongoing education continues to be a cornerstone of Mosaic’s journey to build and promote a more inclusive culture. We enhanced leadership competencies by providing interactive education on enabling authentic connections, becoming successful ambassadors for progress, and continuing our online, curated, self-directed learning platform to encourage employees to continue their own learning journeys. We continue to focus and expand our recruitment efforts to build awareness and interest in our industry and to attract the best, qualified candidates from a broad variety of sources.\nPay equity is fundamental to our compensation philosophy and our commitment to our employees. Mosaic annually evaluates pay equity and compensation practices to ensure fair and equitable treatment of employees based on our pay-for-performance framework. In 2024, Mosaic continued to enhance ongoing internal analytical capabilities for continuous assessment of pay and performance equity and evolved our annual pay equity audit to bring more employees within scope across our global operations and to enhance our assessment of pay disparities. The results of our internal audit revealed .4% outliers, both men and women, without adequate business justifications that will be addressed during our 2025 compensation cycle. Pay equity will be reviewed internally every year with periodic external independent reviews.\n 18\nTable of Content\nFurther information on our human capital practices is available in our sustainability report. Information contained in our sustainability report, or on our website, is not incorporated by reference into, and does not constitute a part of, this Form 10-K.  \nINFORMATION ABOUT OUR EXECUTIVE OFFICERS \nInformation regarding our executive officers as of March 3, 2025 is set forth below:\nName\nAge\nPosition\nPhilip E. Bauer\n52 \nSenior Vice President, General Counsel and Corporate Secretary\nBruce M. Bodine Jr.\n53 \nChief Executive Officer, President and Director\nWalter F. Precourt III\n60 \nSenior Vice President and Chief Administrative Officer\nLuciano Siani Pires\n55 \nExecutive Vice President and Chief Financial Officer\nKaren A. Swager\n54 \nExecutive Vice President - Operations\nYijun (“Jenny”) Wang\n57 \nExecutive Vice President - Commercial\nPhilip E. Bauer\n. Mr. Bauer was promoted to Senior Vice President, General Counsel and Corporate Secretary in January 2023.  Since joining Mosaic in 2007, Mr. Bauer has managed legal support for business development activities, potash operations, offshore finance, commercial transactions and corporate governance. Before assuming his current role, Mr. Bauer was the Vice President and Deputy General Counsel from October 2022 through December 2022 and immediately prior to that role he served as the Vice President - Growth and Development on Mosaic's Strategy and Growth team from May 2019 to September 2022.  Prior to Mosaic, he was a partner at an international law firm where he focused his practice on mergers and acquisitions, public and private securities offerings and public company compliance matters, as well as general business advising. \nBruce M. Bodine Jr\n. Mr. Bodine was elected our Chief Executive Officer effective January 2024 and our President effective August 2023. He previously served as our Senior Vice President - North America from April 2020 to August 2023, and as our Senior Vice President - Phosphates from January 2019 to April 2020 during which time he also provided executive oversight for the corporate procurement organization. Prior to that, Mr. Bodine served as Senior Vice President - Potash (from June 2016 to December 31, 2018); as Vice President - Potash (from April to May 2016); as Vice President - Supply Chain (from August 2015 to March 2016); as Vice President - Operations Business Development (from October 2014 to August 2015); as Vice President - Operations for our Esterhazy and Colonsay potash production facilities (from July 2013 to October 2014); as the General Manager, Esterhazy (from September 2012 to June 2013); and as the General Manager, Four Corners (from March 2010 to August 2012). Before that, Mr. Bodine held various plant and mine development management positions in the Phosphates segment beginning with Mosaic’s formation in 2004. \nWalter F. Precourt III\n. Mr. Precourt was elected our Senior Vice President and Chief Administrative Officer in November 2023. In this role, Mr. Precourt has responsibility for the Company’s Human Resources, Public Affairs, Procurement and Shared Services teams. He had previously served as our Senior Vice President - Strategy and Growth since January 1, 2019. From June 2016 through March 2020 he also provided executive oversight for the EHS organization. He previously served as Senior Vice President - Phosphates and provided executive oversight for the corporate procurement organization from June 2016 until January 1, 2019, as Senior Vice President - Potash Operations from May 2012 to June 2016, and before that he led the Environment, Health and Safety organization since joining Mosaic in 2009. Prior to joining Mosaic, Mr. Precourt was employed by cement and mineral component producer Holcim (U.S.) where he initially led its safety transformation and later became Vice President of Environment and Government Affairs. Mr. Precourt started his career at The Dow Chemical Company where he served in a variety of roles in Operations, Technology, Capital Project Management, and Environmental, Health and Safety. Mr. Precourt served as a director and was the past Chairman of the Board of the Saskatchewan Potash Producers Association and was a director of Fertilizer Canada.\nLuciano Siani Pires. \nMr. Siani Pires was elected as our Executive Vice President and Chief Financial Officer in January 2025 and previously elected as our Executive Vice President and Chief Financial Officer – Designate in November 2024. Mr. Siani Pires previously served on The Mosaic Company’s Board of Directors from 2018 to 2022. Prior to joining Mosaic, Mr. Siani Pires served as Executive Vice President of Strategy and Business Development, Chief Financial Officer and other strategic roles for Vale S.A., a global mining company. He also served as the chairman of the Board of Directors of VLI S.A., as a senior business development advisor for the Natural Resources Group of Accenture and was a consultant at McKinsey and \n 19\nTable of Content\nCompany and at various leadership roles in The Brazilian Development Bank in the areas of capital Markets, export finance and infrastructure. He serves on the board of Vallourec Societe Anonime, has served as a member of the executive council of o9 solutions, as a member of the advisory board at Barbosa Mello, and as a board member of Suzano Papel e Celulose.\nKaren A. Swager\n. Ms. Swager was elected our Executive Vice President – Operations in November 2023.  In this role, Ms. Swager is responsible for the Company’s enterprise-wide operations, including the Environment, Health and Safety (\n“\nEHS\n”\n) organization, and the North America Supply Chain organization.  Ms. Swager had previously served as our Senior Vice President - Supply Chain, including executive oversite for the Procurement and corporate EHS teams, since April 1, 2020. From January 1, 2019 until her appointment as Senior Vice President - Supply Chain, she served as Senior Vice President - Potash. Previously, Ms. Swager held leadership positions at Mosaic, including Vice President - Minerals, Vice President - Mining Operations and General Manager in our Phosphates business since joining Mosaic upon its formation in 2004. She also led the mine planning and strategy group for the Phosphates business. Ms. Swager serves as a director of MVM Resources International, B.V., the general partner of Compañia Minera Miski Mayo S.R.L., the joint venture that operates the mines in Peru, and as a director of SSR Mining Inc., a publicly traded company.\nYijun (“Jenny”) Wang\n. Ms. Wang was elected Executive Vice President – Commercial in January 2024 after serving as the Company’s Senior Vice President – Global Strategic Marketing since May 2023. From January 2022 until May 2023, Ms. Wang served as our Senior Vice President - Global Strategic Marketing, Head of China and India. From October 15, 2020 until her current appointment, Ms. Wang served as Vice President - Global Strategic Marketing. Prior to October 2020, Ms. Wang served as Vice President - Global Product Management and International Distribution and before May 2019, Ms. Wang served as Country Head for China since joining Mosaic in 2011. Ms. Wang serves on the Board of Directors of Canpotex Limited, the Canadian potash marketing association.\nOur executive officers are generally elected to serve until their respective successors are elected and qualified or until their earlier death, resignation or removal. No “family relationships,” as that term is defined in Item 401(d) of Regulation S-K, exist among any of the listed officers or between any such officer and any member of our Board of Directors.",
  "item7": null,
  "item2": null
}