{
  "source_file": "mpc-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOVERVIEW\nMPC has more than 135 years of history in the energy business, and is a leading, integrated, downstream energy company. We operate one of the nation's largest refining systems with approximately 3.0 million barrels per day of crude oil refining capacity and believe we are one of the largest wholesale suppliers of gasoline and distillates to resellers in the United States. We distribute our refined products through one of the largest terminal operations in the United States and one of the largest private domestic fleets of inland petroleum product barges. Our integrated midstream energy asset network links producers of natural gas and NGLs from some of the largest supply basins in the United States to domestic and international markets. In addition, we are one of the largest producers and marketers of renewable diesel in the United States. \nIn the fourth quarter of 2024, we established a Renewable Diesel segment, which includes renewable diesel activities and assets historically reported in the Refining & Marketing segment. Prior period segment information has been recast for comparability.\nOur operations consist of three reportable operating segments: Refining & Marketing, Midstream and Renewable Diesel. Each of these segments is organized and managed based upon the nature of the products and services it offers.\n•\nRefining & Marketing – refines crude oil and other feedstocks at our refineries in the Gulf Coast, Mid-Continent and West Coast regions of the United States, purchases refined products and ethanol for resale and distributes refined products through transportation, storage, distribution and marketing services provided largely by our Midstream segment. We sell refined products to wholesale marketing customers domestically and internationally, to buyers on the spot market, to independent entrepreneurs who operate primarily Marathon\n® \nbranded outlets and through long-term supply contracts with direct dealers who operate locations mainly under the ARCO\n®\n brand.\n•\nMidstream – gathers, transports, stores and distributes crude oil, refined products, including renewable diesel, and other hydrocarbon-based products principally for the Refining & Marketing segment via refining logistics assets, pipelines, terminals, towboats and barges; gathers, processes and transports natural gas; and transports, fractionates, stores and markets NGLs. The Midstream segment primarily reflects the results of MPLX. MPLX is a diversified, large-cap master limited partnership (“MLP”) formed in 2012 that owns and operates midstream energy infrastructure and logistics assets and provides fuels distribution services. As of December 31, 2024, we owned the general partner of MPLX and approximately 64 percent of the outstanding MPLX common units.\n•\nRenewable Diesel – processes renewable feedstocks into renewable diesel, markets renewable diesel and distributes renewable diesel through our Midstream segment and third parties. We sell renewable diesel to wholesale marketing customers, to buyers on the spot market and through long-term supply contracts with direct dealers who operate locations mainly under the ARCO\n®\n brand.\nCorporate History and Structure\nMPC was incorporated in Delaware on November 9, 2009 in connection with an internal restructuring of Marathon Oil Corporation (“Marathon Oil”). On May 25, 2011, the Marathon Oil board of directors approved the spinoff of its Refining, Marketing & Transportation Business into an independent, publicly traded company, MPC, through the distribution of MPC common stock to the stockholders of Marathon Oil on June 30, 2011. Our common stock trades on the NYSE under the ticker symbol “MPC.” \nOn October 1, 2018, we acquired Andeavor. Andeavor shareholders received in the aggregate approximately 239.8 million shares of MPC common stock valued at $19.8 billion and $3.5 billion in cash. Andeavor was a highly integrated marketing, logistics and refining company operating primarily in the Western and Mid-Continent United States. Our acquisition of Andeavor in 2018 substantially increased our geographic diversification and the scale of our assets, which provides increased opportunities to optimize our system.\nOn May 14, 2021, we completed the sale of Speedway, LLC (“Speedway”), our company-owned and operated retail transportation fuel and convenience store business, to 7-Eleven, Inc. (“7-Eleven”) for cash proceeds of $21.38 billion ($17.22 billion after cash-tax payments). This transaction resulted in a pretax gain of $11.68 billion ($8.02 billion after income taxes), after deducting the book value of the net assets and certain other adjustments.\n4\nT\nable\n of Contents\nOUR OPERATIONS\nRefining & Marketing\nRefineries\nWe currently own and operate refineries in the Gulf Coast, Mid-Continent and West Coast regions of the United States with an aggregate crude oil refining capacity of 2,963 mbpcd. During 2024, our refineries processed 2,714 mbpd of crude oil and 208 mbpd of other charge and blendstocks. During 2023, our refineries processed 2,677 mbpd of crude oil and 226 mbpd of other charge and blendstocks. \nOur refineries include crude oil atmospheric and vacuum distillation, fluid catalytic cracking, hydrocracking, catalytic reforming, coking, desulfurization and sulfur recovery units. The refineries process a wide variety of condensate and light and heavy crude oils purchased from various domestic and foreign suppliers. We produce numerous refined products, ranging from transportation fuels, such as reformulated gasolines, blend-grade gasolines intended for blending with ethanol and ULSD fuel, to heavy fuel oil and asphalt. Additionally, we manufacture NGLs and petrochemicals and propane. See the Refined Product Sales section for further information about the products we produce. \nOur refineries are largely integrated with each other via pipelines, terminals and barges to maximize operating efficiency. The transportation links that connect our refineries allow the movement of intermediate products between refineries to optimize operations, produce higher margin products and efficiently utilize our processing capacity. Also, shipping intermediate products between facilities during partial refinery shutdowns allows us to utilize processing capacity that is not directly affected by the shutdown work.\nPlanned maintenance activities, or turnarounds, requiring temporary shutdown of certain refinery operating units, are periodically performed at each refinery.\nFollowing is a description of each of our refineries and their capacity by region.\nGulf Coast Region (1,237 mbpcd)\nGalveston Bay, Texas City, Texas Refinery (631 mbpcd) \nOur Galveston Bay refinery is a combination of our former Texas City refinery and Galveston Bay refinery. Following the completion of the STAR project in 2023, which added 40 mbpcd of capacity, it is now our largest refinery. The refinery is located on the Texas Gulf Coast southeast of Houston, Texas and can process a wide variety of crude oils into gasoline, distillates, NGLs and petrochemicals, heavy fuel oil and propane. The refinery has access to the export market and multiple options to sell refined products. Our cogeneration facility, which supplies the Galveston Bay refinery, currently has 1,055 megawatts of electrical production capacity and can produce 4.3 million pounds of steam per hour. Approximately 47 percent of the power generated in 2024 was used at the refinery, with the remaining electricity being sold into the electricity grid.\nGaryville, Louisiana Refinery (606 mbpcd) \nOur Garyville refinery is located along the Mississippi River in southeastern Louisiana between New Orleans, Louisiana and Baton Rouge, Louisiana. The Garyville refinery is configured to process a wide variety of crude oils into gasoline, distillates, NGLs and petrochemicals, propane, asphalt and heavy fuel oil. The refinery has access to the export market and multiple options to sell refined products. Our Garyville refinery has earned designation as an OSHA VPP Star site.\nMid-Continent Region (1,174 mbpcd)\nCatlettsburg, Kentucky Refinery (300 mbpcd)\nOur Catlettsburg refinery is located in northeastern Kentucky on the western bank of the Big Sandy River, near the confluence with the Ohio River. The Catlettsburg refinery processes sweet and sour crude oils, including production from the nearby Utica Shale, into gasoline, distillates, asphalt, NGLs and petrochemicals, propane and heavy fuel oil. Our Catlettsburg refinery has earned designation as an OSHA VPP Star site. \nRobinson, Illinois Refinery (253 mbpcd) \nOur Robinson refinery is located in southeastern Illinois. The Robinson refinery processes sweet and sour crude oils into gasoline, distillates, NGLs and petrochemicals, propane and heavy fuel oil. The Robinson refinery has earned designation as an OSHA VPP Star site.\nDetroit, Michigan Refinery (144 mbpcd) \nOur Detroit refinery is located in southwest Detroit. It is the only petroleum refinery currently operating in Michigan. The Detroit refinery processes sweet and heavy sour crude oils into gasoline, distillates, NGLs and petrochemicals, asphalt, propane and heavy fuel oil. Our Detroit refinery has earned designation as an OSHA VPP Star site. \n5\nT\nable\n of Contents\nEl Paso, Texas Refinery (133 mbpcd) \nOur El Paso refinery is located east of downtown El Paso. The El Paso refinery processes sweet and sour crude oils into gasoline, distillates, heavy fuel oil, propane, asphalt and NGLs and petrochemicals. \nSt. Paul Park, Minnesota Refinery (105 mbpcd) \nOur St. Paul Park refinery is located along the Mississippi River southeast of St. Paul Park. The St. Paul Park refinery processes sweet and heavy sour crude oils into gasoline, distillates, asphalt, NGLs and petrochemicals, propane and heavy fuel oil.\nCanton, Ohio Refinery (100 mbpcd)\n \nOur Canton refinery is located south of Cleveland, Ohio. The Canton refinery processes sweet and sour crude oils, including production from the nearby Utica Shale, into gasoline, distillates, asphalt, propane, NGLs and petrochemicals and heavy fuel oil. The Canton refinery has earned designation as an OSHA VPP Star site.\nMandan, North Dakota Refinery (71 mbpcd) \nOur Mandan refinery is located outside of Bismarck, North Dakota. The Mandan refinery processes primarily sweet domestic crude oil from North Dakota into gasoline, distillates, heavy fuel oil, propane and NGLs and petrochemicals.\nSalt Lake City, Utah Refinery (68 mbpcd) \nOur Salt Lake City refinery is the largest in Utah and is located north of downtown Salt Lake City. The Salt Lake City refinery processes crude oil from Utah, Colorado, Wyoming and Canada into gasoline, distillates, heavy fuel oil, NGLs and petrochemicals and propane.\nWest Coast Region (552 mbpcd\n)\nLos Angeles, California Refinery (365 mbpcd) \nOur Los Angeles refinery is located in Los Angeles County, near the Los Angeles Harbor. The Los Angeles refinery is the largest refinery on the West Coast and is a major producer of cleaner burning CARB fuels. The Los Angeles refinery processes heavy crude oil from California’s San Joaquin Valley and Los Angeles Basin, as well as crude oils from the Alaska North Slope, South America, West Africa and other international sources, into CARB gasoline and CARB diesel fuel, as well as conventional gasoline, distillates, NGLs and petrochemicals, propane and heavy fuel oil.\nAnacortes, Washington Refinery (119 mbpcd) \nOur Anacortes refinery is located north of Seattle on Puget Sound. The Anacortes refinery processes Canadian crude oil, domestic crude oil from North Dakota and the Alaska North Slope and international crude oils into gasoline, distillates, heavy fuel oil, propane and NGLs and petrochemicals.\nKenai, Alaska Refinery (68 mbpcd)\nOur Kenai refinery is located on the Cook Inlet, southwest of Anchorage. The Kenai refinery processes mainly Alaska domestic crude oil, domestic crude oil from North Dakota, along with limited international crude oil into distillates, gasoline, heavy fuel oil, asphalt, NGLs and petrochemicals and propane.\nRefined Product Yields\nThe following table sets forth our refinery production by product group for each of the last three years.\n(\nmbpd\n)\n2024\n2023\n2022\nGasoline\n1,490 \n1,526 \n1,494 \nDistillates\n1,070 \n1,037 \n1,068 \nPropane\n67 \n66 \n70 \nNGLs and petrochemicals\n192 \n182 \n178 \nHeavy fuel oil\n59 \n52 \n73 \nAsphalt\n81 \n80 \n89 \nTotal\n2,959 \n2,943 \n2,972 \n6\nT\nable\n of Contents\nCrude Oil Supply\nWe obtain the crude oil we refine through negotiated term contracts and purchases or exchanges on the spot market. Our term contracts generally have market-related pricing provisions. The following table provides information on our sources of crude oil for each of the last three years. The crude oil sourced outside of North America was acquired from various foreign national oil companies, production companies and trading companies.\n(\nmbpd\n)\n2024\n2023\n2022\nUnited States\n1,840 \n1,782 \n1,895 \nCanada\n604 \n597 \n539 \nOther international\n270 \n298 \n327 \nTotal\n2,714 \n2,677 \n2,761 \nOur refineries receive crude oil and other feedstocks and distribute our refined products through a variety of channels, including pipelines, trucks, railcars, ships and barges. \nRefined Product Sales\nOur refined products are sold to independent retailers, wholesale customers, our brand jobbers and direct dealers. In addition, we sell refined products for export to international customers. As of December 31, 2024, there were 7,738 brand jobber outlets in 39 states, the District of Columbia and Mexico where independent entrepreneurs primarily maintain Marathon-branded outlets. We also have long-term supply contracts for 1,161 direct dealer locations primarily in Southern California, largely under the ARCO\n® \nbrand. We believe we are one of the largest wholesale suppliers of gasoline and distillates to resellers and consumers within our market area.\nThe following table sets forth our refined product sales volumes by product group for each of the last three years.\n(\nmbpd\n)\n2024\n(a)\n2023\n(a)\n2022\n(a)\nGasoline\n1,922 \n1,933 \n1,870 \nDistillates\n1,187 \n1,128 \n1,160 \nNGLs and petrochemicals\n231 \n220 \n220 \nAsphalt\n82 \n82 \n89 \nPropane\n104 \n90 \n93 \nHeavy fuel oil\n59 \n57 \n66 \nTotal\n3,585 \n3,510 \n3,498 \n(a)\n    Refined product sales include volumes marketed directly to end-users and trading/supply volumes such as bulk sales to large unbranded resellers and other downstream companies. Marketed volumes directly to end-users, including branded retail stations, were 2,429 mbpd, 2,385 mbpd and 2,356 mbpd for the years ended December 31, 2024, 2023 and 2022, respectively. \nRefined Product Sales Destined for Export\nWe sell gasoline, distillates and asphalt for export, primarily out of our Garyville, Galveston Bay, Anacortes and Los Angeles refineries. The following table sets forth our refined product sales destined for export by product group for the past three years.\n(\nmbpd\n)\n2024\n2023\n2022\nGasoline\n116 \n119 \n105 \nDistillates\n199 \n156 \n158 \nOther\n55 \n64 \n52 \nTotal\n370 \n339 \n315 \nGasoline and Distillates \nWe sell gasoline, gasoline blendstocks and distillates (including No. 1 and No. 2 fuel oils, jet fuel, kerosene and diesel) to wholesale customers, branded jobbers, direct dealers and on the spot market. In addition, we sell diesel fuel and gasoline for export to international customers. The demand for gasoline and distillates is seasonal in many of our markets, with demand typically at its highest levels during the summer months.\nNGLs and Petrochemicals\nWe are a producer and marketer of NGLs and petrochemicals. Product availability varies by refinery and includes, among others, propylene, butane, xylene, benzene, cumene and toluene. We market these products domestically to customers in the chemical, \n7\nT\nable\n of Contents\nagricultural and fuel-blending industries. In addition, we produce fuel-grade coke at our Garyville, Detroit, Galveston Bay and Los Angeles refineries, which is used for power generation and in miscellaneous industrial applications, and anode-grade coke at our Los Angeles and Robinson refineries, which is used to make carbon anodes for the aluminum smelting industry.\nAsphalt\nWe have refinery-based asphalt production capacity of 143 mbpcd, which includes asphalt cements, polymer-modified asphalt, emulsified asphalt, industrial asphalts and roofing flux. We have a broad customer base, including asphalt-paving contractors, resellers, government entities (states, counties, cities and townships) and asphalt roofing shingle manufacturers. We sell asphalt in the domestic and export wholesale markets via rail, barge and vessel.\nPropane\nWe produce propane at all of our refineries. Propane is primarily used for home heating and cooking, as a feedstock within the petrochemical industry, for grain drying and as a fuel for trucks and other vehicles. Our propane sales are split approximately 80 percent and 20 percent between the home heating market and industrial/petrochemical consumers, respectively.\nHeavy Fuel Oil\nWe produce and market heavy residual fuel oil or related components, including slurry, at all of our refineries. Heavy residual fuel oil is primarily used in the utility and ship bunkering (fuel) industries, though there are other more specialized uses of the product.\nRefining & Marketing Joint Ventures\nWe hold a 49.9 percent ownership interest in ethanol production facilities in Albion, Michigan; Logansport, Indiana; Greenville, Ohio and Denison, Iowa. These plants have a combined ethanol production capacity of approximately 405 million gallons per year and are managed by our joint venture partner, The Andersons, Inc. (“The Andersons”).\nWe hold a 49.9 percent equity interest in LF Bioenergy, an emerging producer of renewable natural gas (“RNG”) in the U.S. LF Bioenergy has been focused on developing and growing a portfolio of dairy farm-based, low carbon intensity RNG projects. Currently, there are four facilities in operation, with three additional facilities under construction that are expected to come online over the next 12 months.\nTerminals and Transportation\nWe transport, store and distribute crude oil, feedstocks and refined products through pipelines, terminals and marine fleets owned by MPLX and third parties in our market areas. \nWe own a fleet of transport trucks and trailers for the movement of refined products and crude oil. In addition, we maintain a fleet of leased and owned railcars for the movement and storage of refined products.\nThe locations and detailed information about our Refining & Marketing assets are included under Item 2. Properties and are incorporated herein by reference. \nCompetition, Market Conditions and Seasonality\nThe downstream petroleum business is highly competitive, particularly with regard to accessing crude oil and other feedstock supply and the marketing of refined products. We compete with a number of other companies to acquire crude oil for refinery processing and in the distribution and marketing of a full array of refined products.\nWe compete in four distinct markets for the sale of refined products—wholesale, including exports, spot, branded and retail distribution. Our marketing operations compete with numerous other independent marketers, integrated oil companies and high-volume retailers. We compete with companies in the sale of refined products to wholesale marketing customers, including private-brand marketers and large commercial and industrial consumers; companies in the sale of refined products on the spot market; and refiners or marketers in the supply of refined products to refiner-branded independent entrepreneurs. In addition, we compete with producers and marketers in other industries that supply alternative forms of energy and fuels to satisfy the requirements of our industrial, commercial and retail consumers.\nMarket conditions in the oil and gas industry are cyclical and subject to global economic and political events and new and changing governmental regulations. Our operating results are affected by price changes in crude oil, natural gas and refined products, as well as changes in competitive conditions in the markets we serve. Price differentials between sweet and sour crude oils, ANS, WTI and MEH crude oils and other market structure impacts also affect our operating results. \nDemand for gasoline, diesel fuel and asphalt is higher during the spring and summer months than during the winter months in most of our markets, primarily due to seasonal increases in highway traffic and construction. As a result, the operating results for our Refining & Marketing segment for the first and fourth quarters may be lower than for those in the second and third quarters of each calendar year.\n8\nT\nable\n of Contents\nMidstream \nThe Midstream segment primarily includes the operations of MPLX, our sponsored MLP, and certain related operations retained by MPC.\nMPLX\nMPLX owns and operates a network of crude oil, natural gas and refined product pipelines and has joint ownership interests in crude oil, refined products and other pipelines. MPLX also owns and operates light products terminals, storage assets and maintains a fleet of owned and leased towboats and barges in support of fuels distribution on behalf of MPC. MPLX’s assets also include natural gas gathering systems and natural gas processing and NGL fractionation complexes. \nMPC-Retained Midstream Assets and Investments \nWe own four Jones Act medium range product tankers, three Jones Act 750 Series ATB vessels and have ownership interests in several crude oil and refined products pipeline systems and pipeline companies. \nThe locations and detailed information about our Midstream assets are included under Item 2. Properties and are incorporated herein by reference. \nCompetition, Market Conditions and Seasonality\nOur Midstream operations face competition for natural gas gathering, crude oil transportation and in obtaining natural gas supplies for our processing and related services; in obtaining unprocessed NGLs for gathering, transportation and fractionation; and in marketing our products and services. Competition for natural gas supplies is based primarily on the location of gas gathering systems and gas processing plants, operating efficiency and reliability, residue gas and NGL market connectivity, the ability to obtain a satisfactory price for products recovered and the fees charged for the services supplied to the customer. Competition for oil supplies is based primarily on the price and scope of services, location of gathering/transportation and storage facilities and connectivity to the best priced markets. Competitive factors affecting our fractionation services include availability of fractionation capacity, proximity to supply and industry marketing centers, the fees charged for fractionation services and operating efficiency and reliability of service. Competition for customers to purchase our natural gas and NGLs is based primarily on price, credit and market connectivity. In addition, certain of our Midstream operations are subject to rate regulation, which affects the rates that our common carrier pipelines can charge for transportation services and the return we obtain from such pipelines.\nOur Midstream segment can be affected by seasonal fluctuations in the demand for natural gas and NGLs and the related fluctuations in commodity prices caused by various factors such as changes in transportation and travel patterns and variations in weather patterns from year to year. \nRenewable Diesel\nOur Renewable Diesel segment includes a wholly owned facility that processes renewable feedstocks into renewable diesel and renewable joint ventures that produce renewable diesel and renewable feedstocks.\nWholly Owned Renewable Processing Facilities\nThe Dickinson, North Dakota renewables facility has the capacity to produce 184 million gallons per year of renewable diesel from corn oil, soybean oil, fats and greases. The produced renewable diesel generates federal RINs and LCFS credits when sold in California or similar markets. These instruments are used to help meet our Renewable Fuel Standard and LCFS compliance obligations as a petroleum fuel producer. \nWe own an aggregation facility in Cincinnati, Ohio and a pre-treatment facility in Beatrice, Nebraska. These facilities supply renewable agricultural feedstocks to our Dickinson and Martinez facilities.\nRenewable Diesel Joint Ventures\nThe Martinez renewable diesel joint venture (the “Martinez Renewables joint venture”) is a partnership structured as a 50/50 joint venture with Neste Corporation to refine renewable feedstocks into renewable diesel. The Martinez Renewables facility, which has the capacity to produce 730 million gallons per year including pretreatment capabilities, reached full capacity in late 2024. \nWe formed the Green Bison Soy Processing, LLC (“Green Bison Soy Processing”) joint venture with Archer-Daniels-Midland Company (“ADM”) with ADM owning 75 percent of the joint venture and MPC owning 25 percent. Green Bison Soy Processing’s complex in Spiritwood, North Dakota sources and processes local soybeans and supplies the resulting soybean oil exclusively to MPC and has capacity to produce approximately 600 million pounds of refined soybean oil annually, enough feedstock for approximately 75 million gallons of renewable diesel per year. \nCompetition, Market Conditions and Seasonality\nThe renewable diesel business is evolving, particularly with regard to regulatory credits, access to renewable feedstock supply and the marketing of renewable products. We compete with a number of other companies in acquiring various renewable \n9\nT\nable\n of Contents\nfeedstocks for processing and in the distribution and marketing of renewable diesel and renewable naphtha, primarily on the West Coast.\nWe compete in three distinct markets for the sale of renewable diesel—wholesale, spot and retail distribution. We compete with companies in the sale of renewable diesel to wholesale marketing customers, including private-brand marketers and large commercial and industrial consumers; companies in the sale of renewable diesel on the spot market; and refiners or marketers in the supply of renewable diesel to refiner-branded independent entrepreneurs. In addition, we compete with producers and marketers in other industries that supply alternative forms of energy and fuels to satisfy the requirements of our industrial, commercial and retail consumers.\nMarket conditions in the renewable diesel industry are cyclical and subject to global economic and political events and new and changing governmental regulations. Our operating results are affected by price changes in renewable feedstocks as well as changes in competitive conditions in the markets we serve. Price differentials between the various renewable feedstocks also affect our operating results. \nDemand for renewable diesel may increase during the spring and summer months due to seasonal increases in agricultural activities. As a result, the operating results for our renewable segment for the first and fourth quarters may be lower than for those in the second and third quarters of each calendar year.\nREGULATORY MATTERS\nOur operations are subject to numerous laws and regulations, including those relating to the protection of the environment. Such laws and regulations include, among others, the Clean Air Act (“CAA”) with respect to air emissions, the Clean Water Act (“CWA”) with respect to water discharges, the Resource Conservation and Recovery Act (“RCRA”) with respect to solid and hazardous waste treatment, storage and disposal, the Comprehensive Environmental Response, Compensation, and Liability Act (“CERCLA”) with respect to releases and remediation of hazardous substances and the Oil Pollution Act of 1990 (“OPA-90”) with respect to oil pollution and response. In addition, many states where we operate have similar laws. New laws are being enacted and regulations are being adopted on a continuing basis, and the costs of compliance with such new laws and regulations are very difficult to estimate until finalized.\nFor a discussion of environmental capital expenditures and costs of compliance, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations-Environmental Matters and Compliance Costs. For additional information regarding regulatory risks, see Item 1A. Risk Factors.\nRate Regulation\nSome of our existing pipelines are considered interstate common carrier pipelines subject to regulation by the Federal Energy Regulatory Commission (“FERC”) under the Interstate Commerce Act (the “ICA”), Energy Policy Act of 1992 (“EPAct 1992”) and the rules and regulations promulgated under those laws. The ICA and FERC regulations require that tariff rates for oil pipelines, a category that includes crude oil and petroleum product pipelines, be just and reasonable and the terms and conditions of service must not be unduly discriminatory. The ICA permits interested persons to challenge newly proposed tariff rates or terms and conditions of service, or any change to tariff rates or terms and conditions of service, and authorizes FERC to suspend the effectiveness of such proposal or change for a period of time to investigate. If, upon completion of an investigation, FERC finds that the new or changed service or rate is unlawful, it is authorized to require the carrier to refund the revenues in excess of the prior tariff collected during the pendency of the investigation. An interested person may also challenge existing terms and conditions of service or rates and FERC may order a carrier to change its terms and conditions of service or rates prospectively. Upon an appropriate showing, a shipper may also obtain reparations, from a pipeline, for damages sustained as a result of rates or terms which FERC deemed were not just and reasonable. Such reparation damages may accrue from the complaint through the final order and during the two years prior to the filing of a complaint.\nEPAct 1992 deemed certain interstate petroleum pipeline rates then in effect to be just and reasonable under the ICA. These rates are commonly referred to as “grandfathered rates.” Our rates for interstate transportation service in effect for the 365-day period ending on the date of the passage of EPAct 1992 were deemed just and reasonable and therefore are grandfathered. Subsequent changes to those rates are not grandfathered. New rates have since been established after EPAct 1992 for certain pipelines, and certain of our pipelines have subsequently been approved to charge market-based rates.\nFERC permits regulated oil pipelines to change their rates within prescribed ceiling levels that are tied to an inflation index. A carrier must, as a general rule, utilize the indexing methodology to change its rates. Cost-of-service ratemaking, market-based rates and settlement rates are alternatives to the indexing approach and may be used in certain specified circumstances to change rates.\nAir\nGHG Emissions\nCurrently, legislative and regulatory measures to address GHG emissions are in various phases of review, discussion or implementation. Reductions in GHG emissions could result in increased costs to (i) operate and maintain our facilities, (ii) install \n10\nT\nable\n of Contents\nnew emission controls at our facilities, (iii) capture the emissions from our facilities and (iv) administer and manage any GHG emissions programs, including acquiring emission credits or allotments.\nCongress has from time to time considered legislation to regulate GHG emissions, and it is possible that such legislation could be enacted in the future. In the absence of federal climate legislation in the United States, certain states and regions have adopted, or are considering, rules regulating GHG emissions. These measures may include state actions to develop statewide or regional programs to report emissions and impose emission reductions. These measures may also include low-carbon fuel standards, such as the California program, or a state carbon tax. These measures could result in increased costs to operate and maintain our facilities, capital expenditures to install new emission controls and costs to administer any carbon trading or tax programs implemented. For example, California has enacted a cap-and-trade program. Much of the compliance costs associated with the California program are ultimately passed on to the consumer in the form of higher fuel costs. States are increasingly announcing aspirational goals to be net-zero carbon emissions by a certain date through both legislation and executive orders. To date, these states have not provided significant details as to achievement of these goals; however, meeting these aspirations will require a reduction in fossil fuel combustion and/or a mechanism to capture GHGs from the atmosphere. As a result, we cannot currently predict the impact of these potential regulations on our liquidity, financial position, or results of operations.\nInternational jurisdictions have adopted or are considering adopting laws related to the disclosure and regulation of GHG emissions. For example, the European Union Emissions Trading System (“ETS”) is a cap-and-trade type program. GHG emissions from maritime transport became subject to the ETS in 2024. These laws could result in increased costs to distribute our products to foreign jurisdictions.\nOn December 2, 2023, EPA issued its final rule to regulate methane emissions from the Oil and Natural Gas Sector. The rule titled “Standards of Performance for New, Reconstructed, and Modified Sources and Emissions Guidelines for Existing Sources: Oil and Gas Sector Climate Review” requires MPLX to control and reduce methane emissions within its natural gas gathering and boosting operations and gas processing facilities. The rule is consistent with the voluntary methane reduction programs that MPLX has been implementing through its Focus on Methane Program. As a result, although the rule requires MPLX to make additional investments to further reduce methane emissions, we do not believe the rule will have a material impact to our operations. \nOther Air Emissions\nThe CAA and comparable state laws restrict the emission of air pollutants from many sources and impose various monitoring and reporting requirements. These laws and any implementing regulations may require us to obtain pre-approval for the construction or modification of certain projects or facilities expected to produce or significantly increase air emissions, obtain and strictly comply with stringent air permit requirements, utilize specific equipment or technologies to control emissions, or aggregate two or more of our facilities into one application for permitting purposes. We believe that our operations are in substantial compliance with applicable air permitting and control technology requirements. However, we may be required to incur capital expenditures and may continue to incur capital expenditures in the future for installation of air pollution control equipment and may encounter construction or operational delays while applying for, or awaiting the review, processing and issuance of, new or amended permits, and we may be required to modify certain of our operations which could increase our operating costs.\nIn February 2024, EPA released a final rule to lower the primary (health-based) fine particulate matter annual standard from its current level of 12.0 µg/m3 to 9.0 µg/m3. Lowering of the National Ambient Air Quality Standards (“NAAQS”) and subsequent designation as a nonattainment area could result in increased costs associated with, or result in cancellation or delay of, capital projects at our or our customers’ facilities, or could require emission reductions that could result in increased costs to us or our customers. We cannot predict the effects of the various state implementation plan requirements at this time.\nIn California, the Governing Board for the South Coast Air Quality Management District (“SCAQMD”) adopted Rule 1109.1 in November 2021, which establishes Best Available Retrofit Control Technology (“BARCT”) oxides of nitrogen (“NOx”) and carbon monoxide (“CO”) emission limits for combustion equipment at petroleum refineries. These new requirements will replace the Regional Clean Air Incentives Market (“RECLAIM”) cap-and-trade program which has required a staged refinery-wide reduction of NOx emissions over the last several years and will result in additional emission reductions from our Los Angeles Refinery. Compliance with Rule 1109.1 is being phased in through 2032 and will result in increased costs to operate and maintain our Los Angeles Refinery.\nWater\nOur operations are subject to the CWA, the Safe Drinking Water Act (“SWDA”) and comparable state and local requirements. These laws prohibit discharge into surface waters, ground waters, injection wells and publicly-owned treatment works except in conformance with legal authorization. We maintain numerous pre-treatment permits and discharge permits as required under the National Pollutant Discharge Elimination System program of the CWA and have implemented systems to oversee our compliance with these permits. The CWA also regulates filling or discharges to wetlands and other “waters of the United States.” The scope of water bodies and wetlands covered under the definition of “waters of the United States” has evolved through various rulemakings and court decisions. To the extent the federal rule does not apply, an analogous state law may apply.\nIn addition, we are regulated under OPA-90, which, among other things, requires the owner or operator of a tank vessel or a facility to maintain an emergency plan to respond to releases of oil or hazardous substances. OPA-90 also requires the \n11\nT\nable\n of Contents\nresponsible company to pay resulting removal costs and damages and provides for civil penalties and criminal sanctions for violations of its provisions. We operate tank vessels and facilities from which spills of oil and hazardous substances could occur. We have implemented emergency oil response plans for all of our components and facilities covered by OPA-90 and we have established Spill Prevention, Control and Countermeasures plans for all facilities subject to such requirements. Some coastal states in which we operate have passed state laws similar to OPA-90, but with expanded liability provisions, that include provisions for cargo owner responsibility as well as ship owner and operator responsibility.\nAs part of our emergency response activities, we have used aqueous film forming foam (“AFFF”) containing per- and polyfluoroalkyl substances (“PFAS”) chemicals as a vapor and fire suppressant. At this time, AFFFs containing PFAS are the most effective foams to prevent and control a flammable petroleum-based liquid fire involving a large storage tank or tank containment area. Fluorine-free firefighting foams are currently under development but have not yet proven to be as effective as AFFFs containing PFAS.\nIn May 2016, EPA issued lifetime health advisory levels (“HALs”) and health effects support documents for two PFAS substances - perfluorooctanoic acid (“PFOA”) and perfluorooctane sulfonate (“PFOS”). These HALs were updated in June 2022, when EPA also issued HALs for two additional PFAS substances. In February 2019, EPA issued a PFAS Action Plan identifying actions it is planning to take to study and regulate various PFAS chemicals. EPA identified that it would evaluate, among other actions, (1) proposing national drinking water standards for PFOA and PFOS, (2) developing cleanup recommendations for PFOA and PFOS, (3) evaluating the listing of PFOA and PFOS as hazardous substances under CERCLA, and (4) conducting toxicity assessments for other PFAS chemicals. Also, on April 26, 2024, EPA issued a final rule establishing national drinking water standards for PFOS, PFOA, perfluorohexane sulfonic acid (“PFHxS”), perfluorononanoic acid (“PFNA”), perfluorobutane sulfonic acid (“PFBS”), and hexafluoropropylene oxide dimer acid and its ammonium salt (also known as “GenX”). Congress may also take further action to regulate PFAS. We cannot currently predict the impact of these regulations on our operations.\nIn addition, many states are actively proposing and adopting legislation and regulations relating to the use of AFFFs containing PFAS. Additionally, many states are using EPA HALs for PFOS and PFOA and some states are adopting and proposing state-specific drinking water and cleanup standards for various PFAS, including but not limited to PFOS and PFOA. We cannot currently predict the impact of these regulations on our liquidity, financial position, or results of operations.\nSolid and Hazardous Waste\nWe continue to seek methods to minimize the generation of solid and hazardous wastes in our operations. RCRA establishes standards for the management of solid and hazardous wastes. We may incur liability under RCRA, and comparable or more stringent state statutes, which impose requirements relating to the handling and disposal of non-hazardous and hazardous wastes. It is possible that some wastes generated by us that are currently classified as non-hazardous wastes may in the future be designated as hazardous wastes, resulting in the wastes being subject to more rigorous and costly transportation, storage, treatment and disposal requirements. Besides affecting waste disposal practices, RCRA also addresses the environmental effects of certain past waste disposal operations, the recycling of wastes and the regulation of USTs containing regulated substances.\nRemediation\nWe own or operate, or have owned or operated, certain convenience stores and other locations where, during the normal course of operations, releases of refined products from USTs have occurred. Federal and state laws require that contamination caused by such releases at these sites be assessed and remediated to meet applicable standards. A portion of these remediation costs may be recoverable from the appropriate state UST reimbursement funds once the applicable deductibles have been satisfied. We also have ongoing remediation projects at a number of our current and former refinery and midstream locations. For a discussion of environmental capital expenditures and costs of compliance, see Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations-Environmental Matters and Compliance Costs.\nClaims under CERCLA and similar state acts have been raised with respect to the clean-up of various waste disposal and other sites. CERCLA is intended to facilitate the clean-up of hazardous substances without regard to fault. Potentially responsible parties for each site include present and former owners and operators of, transporters to and generators of the hazardous substances at the site. Liability is strict and can be joint and several. Because of various factors including the difficulty of identifying the responsible parties for any particular site, the complexity of determining the relative liability among them, the uncertainty as to the most desirable remediation techniques and the amount of damages and clean-up costs and the time period during which such costs may be incurred, we are unable to reasonably estimate our ultimate cost of compliance with CERCLA; however, we do not believe such costs will be material to our business, financial condition, results of operations or cash flows. RCRA and similar state laws may also impose liability for removing or remediating releases of hazardous or non-hazardous wastes from impacted properties.\nThe EPA’s rule designating PFOS and PFOA as hazardous substances under CERCLA Section 102(a) became effective on July 8, 2024. In addition, EPA has received three petitions requesting regulatory action on PFAS under RCRA and in February 2024, proposed two regulations that would add nine PFAS, including PFOA and PFOS, to the list of RCRA hazardous constituents and broaden the definition of hazardous waste applicable to corrective action requirements at hazardous waste treatment, storage, and disposal facilities. We cannot currently predict the impact of potential statutes or regulations on our remediation costs.\n12\nT\nable\n of Contents\nVehicle and Fuel Requirements\nFuel Economy and GHG Emission Standards for Vehicles\nThe National Highway Traffic Safety Administration (“NHTSA”) establishes corporate average fuel economy (“CAFE”) standards for passenger cars and light trucks. In addition, EPA establishes carbon dioxide (“CO2”) emission standards for passenger cars and light trucks. A presidential executive order issued on August 5, 2021, set a goal that 50 percent of all new passenger cars and light trucks sold in 2030 be zero emission vehicles. Consistent with this order, EPA and NHTSA promulgated separate rules setting more stringent requirements through model year 2026. NHTSA’s CAFE standards increase in stringency from model year 2023 levels by eight percent annually for model years 2024-2025 and ten percent annually for model year 2026. EPA’s model year 2023-2026 CO2 emission standards result in average fuel economy of 40 mpg in model year 2026. Subsequently, NHTSA and EPA finalized new rules setting even more stringent requirements for model years 2027-2032. NHTSA’s standards would require an increase in fuel efficiency of two percent annually. EPA’s standards would require a significant increase in electric vehicle production to meet the standards. These NHTSA and EPA regulations have been challenged in court. In addition, the executive order setting the 50 percent zero emission vehicle goal has since been rescinded. Higher CAFE and CO2 emission standards for cars and light trucks reduce demand for our transportation fuels.\nIn addition, California may establish different, more stringent vehicle standards that could apply in multiple states if granted a Clean Air Act waiver by the EPA. The EPA reinstated California’s waiver for its Advanced Clean Cars I program, which includes requirements for zero emission vehicle sales through 2025. Following an executive order issued by the Governor, the California Air Resources Board (“CARB”) finalized its Advanced Clean Cars II regulation, which bans the sale of internal combustion engine vehicles in California in 2035. In December 2024, EPA granted California’s waiver for its Advanced Clean Cars II program. Other states have issued, or may issue, zero emission vehicle mandates consistent with California’s programs. \nRenewable Fuels Standards and Low Carbon Fuel Standards\nPursuant to the Energy Policy Act of 2005 and the EISA, Congress established a Renewable Fuel Standard (“RFS”) program that requires annual volumes of renewable fuel be blended into domestic transportation fuel. The statutory volumes apply through calendar year 2022. After calendar year 2022, the statute gives EPA the authority to set the annual volumes. EPA has promulgated annual volumes for 2023-2025 that increase the volume of renewable fuel that must be blended year over year.\nThere is currently no regulatory method for verifying the validity of most RINs sold on the open market. We have developed a RIN integrity program to vet the RINs that we purchase, and we incur costs to audit RIN generators. Nevertheless, if any of the RINs that we purchase and use for compliance are found to be invalid, we could incur costs and penalties for replacing the invalid RINs.\nIn addition to the federal Renewable Fuel Standards, certain states have, or are considering, promulgation of state renewable or low carbon fuel standards. For example, California began implementing its LCFS in January 2011. In September 2015, the CARB approved the re-adoption of the LCFS, which became effective on January 1, 2016, to address procedural deficiencies in the way the original regulation was adopted. The LCFS was amended again in 2018 targeting a 20 percent reduction in fuel carbon intensity from a 2010 baseline by 2030. CARB’s recent amendments to the LCFS, which would increase the carbon intensity reduction from 20 percent to 30 percent by 2030, were disapproved by the California Office of Administrative Law (“OAL”) in February 2025. The CARB can rewrite and resubmit the amendments for OAL approval. We incur costs to comply with LCFS programs, and these costs may increase if the cost of LCFS credits increases.\nIn sum, the RFS has required, and may in the future continue to require, additional capital expenditures or expenses by us to accommodate increased renewable fuels use. We may experience a decrease in demand for refined products due to an increase in combined fleet mileage or due to refined products being replaced by renewable fuels. Demand for our refined products also may decrease as a result of low carbon fuel standard programs or electric vehicle mandates.\nSafety Matters\nWe are subject to oversight pursuant to the federal Occupational Safety and Health Act, as amended (“OSH Act”), as well as comparable state statutes that regulate the protection of the health and safety of workers. We believe that we have conducted our operations in substantial compliance with regulations promulgated pursuant to the OSH Act, including general industry standards, record-keeping requirements and monitoring of occupational exposure to regulated substances.\nWe are also subject at regulated facilities to the Occupational Safety and Health Administration’s Process Safety Management and EPA’s Risk Management Program (“RMP”) requirements, which are intended to prevent or minimize the consequences of catastrophic releases of toxic, reactive, flammable or explosive chemicals. In 2024, EPA finalized revisions to its RMP regulation. The revisions include a requirement that refineries with hydrofluoric acid alkylation units perform a safer technologies and alternatives analysis as part of the process hazard analysis and to document the feasibility of inherent safety measures. The application of these regulations can result in increased compliance expenditures.\nIn general, we expect industry and regulatory safety standards to become more stringent over time, resulting in increased compliance expenditures. While these expenditures cannot be accurately estimated at this time, we do not expect such expenditures will have a material adverse effect on our results of operations.\n13\nT\nable\n of Contents\nThe U.S. Department of Transportation (“DOT”) has adopted safety regulations with respect to the design, construction, operation, maintenance, inspection and management of our pipeline assets. These regulations contain requirements for the development and implementation of pipeline integrity management programs, which include the inspection and testing of pipelines and the correction of anomalies. These regulations also require that pipeline operation and maintenance personnel meet certain qualifications and that pipeline operators develop comprehensive spill response plans. \nSecurity\nWe have several facilities that are subject to the United States Coast Guard’s Maritime Transportation Security Act, and a number of other facilities that are subject to the Transportation Security Administration’s Pipeline Security Guidelines and are designated as “Critical Facilities.” We have an internal inspection program designed to monitor and ensure compliance with all of these requirements. We believe that we are in material compliance with all applicable laws and regulations regarding the security of our facilities.\nTribal Lands\nVarious federal agencies, including EPA and the Department of the Interior, along with certain Native American tribes, promulgate and enforce regulations pertaining to oil and gas operations on Native American tribal lands where we operate. These regulations include such matters as lease provisions, drilling and production requirements, and standards to protect environmental quality and cultural resources. In addition, each Native American tribe is a sovereign nation having the right to enforce certain laws and regulations and to grant approvals independent from federal, state and local statutes and regulations. These laws and regulations may increase our costs of doing business on Native American tribal lands and impact the viability of, or prevent or delay our ability to conduct, our operations on such lands.\nTRADEMARKS, PATENTS AND LICENSES \nOur Marathon and ARCO trademarks are material to the conduct of our refining and marketing operations. We currently hold a number of U.S. and foreign patents and have various pending patent applications. Although in the aggregate our patents and licenses are important to us, we do not regard any single patent or license or group of related patents or licenses as critical or essential to our business as a whole. In general, we depend on our technological capabilities and the application of know-how rather than patents and licenses in the conduct of our operations.\nHUMAN CAPITAL\nWe believe our employees are our greatest asset of strength, and our culture reflects the quality of individuals across our workforce. Our collaborative efforts, which include fostering an inclusive environment, providing broad-based development and mentorship opportunities, recognizing and rewarding accomplishments and offering benefits that support the well-being of our employees and their families, contribute to increased engagement and fulfilling careers. Empowering our people and prioritizing accountability are also key components for developing MPC’s high-performing culture, which is critical to achieving our strategic vision. \nEmployee Profile\nAs of December 31, 2024, we employed approximately 18,300 people in full-time and part-time roles. Many of these employees provide services to MPLX, for which we are reimbursed in accordance with employee service agreements. Approximately 3,800 of our employees are covered by collective bargaining agreements. \nSafety \nWe are committed to safe operations to protect the health and safety of our employees, contractors and communities. Our commitment to safe operations is reflected in our safety systems design, our well-maintained equipment and by learning from our incidents. Part of our effort to promote safety includes our Operational Excellence Management System, which expands on the RC14001® scope, incorporates a Plan-Do-Check-Act continual improvement cycle, and aligns with ISO 9001, incorporating quality and an increased stakeholder and process focus. Together, these components of our safety management system provide us with a comprehensive approach to managing risks and preventing incidents, illnesses and fatalities. Additionally, our annual cash bonus program includes a broad set of measures tied to safety, environmental stewardship and human capital management.\nTalent Management\nOur People Strategy holistically addresses the dynamic business environment we operate in. It enables us to be an employer of choice in the face of shifting talent needs and availability. Executing our People Strategy requires that we attract and retain the best talent with the right capabilities when we need them. Attracting and retaining top talent involves presenting employees with the tools for success and providing opportunities for long-term engagement and career advancement. Our Talent Acquisition team consists of three segments: Executive Recruiting, Experienced Recruiting and University Recruiting. The specialization within each group allows us to specifically address MPC’s broad range of current and future talent needs, as well as devote time and attention to candidates during the hiring process. We believe each candidate brings a new perspective to our workforce, and we actively seek candidates with a variety of backgrounds and experience. \n14\nT\nable\n of Contents\nWe equip our employees at every level with classroom training, online courses and on the job activities that provide the knowledge and skills necessary to perform their daily job functions safely and successfully. Simultaneously, we support our employees with a wide range of career development programs, tools, and key talent processes to help them advance and grow their careers within MPC.\nCompensation and Benefits \nTo ensure we are offering competitive pay packages, we annually benchmark compensation, including base salaries, bonus levels and long-term incentive targets. Our annual bonus program, for which all employees are eligible, is a critical component of our compensation as it rewards employees for MPC’s achievement against preset goals, encouraging employee commitment and ownership of results. Employees in our senior leader pay grades, as well as most other leaders, receive long-term incentive awards annually to align their compensation to the interests of MPC shareholders and MPLX unitholders.\nWe offer comprehensive benefits that are also benchmarked annually, including medical, dental and vision insurance for our employees, their spouses or domestic partners, and their dependents. We also provide retirement programs, life insurance, family building and support programs, sick and disability benefits, education assistance, as well as support the well-being of our employees and their families through a comprehensive Employee Assistance Program and financial wellness tools. In addition, we encourage our employees to refresh and recharge by providing competitive vacation programs and paid parental leave benefits for birth mothers and nonbirth parents. Further, we award a significant number of college and trade school scholarships to high school senior children of our employees through the Marathon Petroleum Scholars Program. Both full-time and part-time employees are eligible for these benefits.\nInclusion\nInclusion is embedded in our People Strategy, guided by our core values, and supported by a dedicated team of subject matter experts and leadership. Our People Strategy is based on three pillars: building a diverse workforce, creating a more inclusive culture, and contributing to our thriving communities.\nWe promote inclusivity and respect among our employees. We recognize that when employees feel valued, it shows in their performance. Our employee networks are fundamental to achieving this goal and connect employees with others who have shared experiences. These seven groups use a member and ally model to promote inclusion - Asian, Black, Disability, Hispanic, LGBTQ+, Veterans and Women. Led by employees with involvement and support from executive sponsors, our networks connect colleagues from across the company and provide opportunities for development, networking, and community involvement.\nEXECUTIVE OFFICERS \nFollowing is information about the executive officers and corporate officers of MPC:\nName\nAge as of February 1, 2025\nPosition with MPC\nMaryann T. Mannen\n62\nPresident and Chief Executive Officer\nMichael J. Hennigan\n65\nExecutive Chairman\nJohn J. Quaid\n53\nExecutive Vice President and Chief Financial Officer\nTimothy J. Aydt\n61\nExecutive Vice President Refining\nMolly R. Benson\n58\nChief Legal Officer and Corporate Secretary\nFiona C. Laird*\n63\nChief Human Resources Officer and Senior Vice President Communications\nDavid R. Heppner*\n58\nChief Strategy Officer and Senior Vice President Business Development\nRick D. Hessling\n58\nChief Commercial Officer\nBrian K. Partee*\n51\nChief Global Optimization Officer\nEhren D. Powell*\n45\nSenior Vice President and Chief Digital Officer \nJames R. Wilkins*\n58\nSenior Vice President Health, Environment, Safety and Security\nErin M. Brzezinski\n42\nVice President and Controller\nKristina A. Kazarian*\n42\nVice President Finance and Investor Relations\nKelly S. Niese*\n45\nVice President Treasury\nGregory S. Floerke\n61\nExecutive Vice President and Chief Operating Officer of MPLX GP LLC\nShawn M. Lyon\n57\nSenior Vice President Logistics & Storage of MPLX GP LLC\n* Corporate officer.\n15\nT\nable\n of Contents\nMs. Mannen\n was appointed President and Chief Executive Officer, and was elected a member of the Board, effective August 1, 2024. She previously served as President since January 1, 2024, and as Executive Vice President and Chief Financial Officer from January 2021 through December 2023. Ms. Mannen also was appointed President and Chief Executive Officer of MPLX, effective August 1, 2024, and has served as a member of MPLX’s Board of Directors since February 2021. Before joining MPC, she served as Executive Vice President and Chief Financial Officer of TechnipFMC (a successor to FMC Technologies, Inc.), a leading global engineering services and energy technology company, since 2017, having previously served as Executive Vice President and Chief Financial Officer of FMC Technologies, Inc. since 2014, as Senior Vice President and Chief Financial Officer since 2011, and in various positions of increasing responsibility with FMC Technologies, Inc. since 1986. Ms. Mannen serves on the executive committee of the American Petroleum Institute (API), the executive committee of American Fuel and Petrochemical Manufacturers (AFPM), and the executive committee of the Ohio Business Roundtable, and is a member of The Business Council.\nMr. Hennigan\n was elected Executive Chairman, effective August 1, 2024, having previously served as Chief Executive Officer since January 1, 2024 and as President and Chief Executive Officer from March 2020 through December 2023. He has served as a member of the Board of Directors since April 2020. Mr. Hennigan also was elected Executive Chairman of the Board of MPLX effective August 1, 2024, having served as Chairman of the Board since April 2020, as Chief Executive Officer since November 2019 and as President since June 2017. Before joining MPLX, Mr. Hennigan was President, Crude, NGL and Refined Products, of the general partner of Energy Transfer Partners L.P., an energy service provider. He was President and Chief Executive Officer of Sunoco Logistics Partners L.P., an oil and gas transportation, terminalling and storage company, from 2012 to 2017, President and Chief Operating Officer beginning in 2010, and Vice President, Business Development, beginning in 2009.\nMr. Quaid\n was appointed Executive Vice President and Chief Financial Officer, effective January 1, 2024, having previously served as MPLX’s Executive Vice President and Chief Financial Officer since September 2021. He also has served as a member of MPLX’s Board since January 2022. Prior to his 2021 appointment at MPLX, Mr. Quaid served as our Senior Vice President and Controller beginning in April 2020, and as Vice President and Controller beginning in 2014. Before joining MPC, Mr. Quaid was Vice President of Iron Ore at United States Steel Corporation, an integrated steel producer, beginning in 2014, and Vice President and Treasurer beginning in 2011, having previously served in various functions including investor relations, business planning, financial planning and analysis and project management. \nMr. Aydt\n was appointed Executive Vice President Refining, effective October 2022, having previously served as Executive Vice President and Chief Commercial Officer of MPLX since August 2020. Prior to his 2020 appointment, he served as Vice President, Business Development, beginning in November 2018, as Vice President, Operations, and President of Marathon Pipe Line LLC beginning in January 2017, as MPC’s Terminal, Transport and Rail General Manager beginning in 2013, and as Project Director for the $2.2 billion Detroit Heavy Oil Upgrade Project beginning in 2008. \nMs. Benson\n was appointed Chief Legal Officer and Corporate Secretary, effective January 1, 2024, having previously served as Vice President, Chief Securities, Governance & Compliance Officer and Corporate Secretary since June 2018, and as Vice President, Chief Compliance Officer and Corporate Secretary since 2016. Prior to her 2016 appointment, Ms. Benson served as Assistant General Counsel, Corporate and Finance, beginning in 2012, and as Group Counsel, Corporate and Finance, beginning in 2011. \nMs. Laird\n was appointed Chief Human Resources Officer and Senior Vice President Communications, effective February 2021, having previously served as Chief Human Resources Officer since October 2018. Prior to her 2018 appointment, she served as Chief Human Resources Officer at Andeavor since February 2018. Before joining Andeavor, Ms. Laird was Chief Human Resources and Communications Officer for Newell Brands, a global consumer goods company, beginning in May 2016 and Executive Vice President, Human Resources, for Unilever, a global consumer goods company, beginning in 2011.\nMr. Heppner\n was appointed Chief Strategy Officer and Senior Vice President Business Development, effective March 1, 2024, having previously served as Senior Vice President Strategy and Business Development since February 2021. Prior to his 2021 appointment, he served as Vice President, Commercial and Business Development, beginning in October 2018, as Senior Vice President of Engineering Services and Corporate Support of Speedway LLC beginning in 2014, and as Director, Wholesale Marketing, beginning in 2010.\nMr. Hessling\n was appointed Chief Commercial Officer, effective January 1, 2024, having previously served as Senior Vice President, Global Feedstocks, since February 2021. Prior to his 2021 appointment, he served as Senior Vice President, Crude Oil Supply and Logistics, beginning in October 2018, as Manager, Crude Oil & Natural Gas Supply and Trading, beginning in 2014, and as Crude Oil Logistics & Analysis Manager beginning in 2011.\nMr. Partee\n was appointed Chief Global Optimization Officer, effective January 1, 2024, having previously served as Senior Vice President, Global Clean Products, since February 2021. Prior to his 2021 appointment, he served as Senior Vice President, Marketing, beginning in October 2018, as Vice President, Business Development, beginning in February 2018, as Director of Business Development beginning in January 2017, as Manager of Crude Oil Logistics beginning in 2014, and as Vice President, Business Development and Franchise, at Speedway beginning in 2012. \n16\nT\nable\n of Contents\nMr. Powell\n was appointed Senior Vice President and Chief Digital Officer, effective July 2020. Before joining MPC, he served as Vice President and Chief Information Officer (“CIO”) at GE Healthcare, a segment of General Electric Company (“GE”) that provides medical technologies and services, beginning in April 2018, having previously served as Senior Vice President and CIO, Services, of GE, a multinational conglomerate, since January 2017 and as CIO, Power Services, with GE Power since 2014, and in various positions of increasing responsibility with GE and its subsidiaries since 2000.\nMr. Wilkins\n was appointed Senior Vice President Health, Environment, Safety and Security, effective February 2021. Prior to this appointment, he served as Vice President, Environment, Safety and Security, beginning in October 2018, Director, Environment, Safety, Security and Product Quality, beginning in February 2016, and Director, Refining Environmental, Safety, Security and Process Safety Management, beginning in 2013.\nMs. Brzezinski\n was appointed Vice President and Controller, effective January 8, 2024. Prior to this appointment, she served as Assistant Controller, Technical Accounting, since August 2021, having previously served as Manager, Accounting, since May 2019. Before joining MPC, Ms. Brzezinski was Director, Assurance and Audit Services, at PricewaterhouseCoopers LLP, a professional services and accounting firm, beginning in 2018, and Senior Manager beginning in 2013. She was Manager, Technical Accounting, at Cooper Tire & Rubber Company, an automotive tire manufacturer, from 2011 to 2013. Previously, Ms. Brzezinski served in positions of increasing responsibility with PricewaterhouseCoopers LLP beginning in 2004.\nMs. Kazarian\n was appointed Vice President Finance and Investor Relations, effective January 2023. Prior to this appointment, she served as Vice President, Investor Relations, beginning in April 2018. Before joining MPC, she was Managing Director and head of the MLP, Midstream and Refining Equity Research teams at Credit Suisse, a global investment bank and financial services company, beginning in September 2017. Previously, Ms. Kazarian was Managing Director of MLP, Midstream and Natural Gas Equity Research at Deutsche Bank, a global investment bank and financial services company, beginning in 2014, and an analyst specializing on various energy industry subsectors with Fidelity Management & Research Company, a privately held investment manager, beginning in 2005. \nMs. Niese\n was appointed Vice President Treasury, effective January 2023. Prior to this appointment, she served as Assistant Treasurer beginning in February 2017, as Corporate Finance Manager beginning in October 2014, and as Brand Coordinating Manager beginning in 2011, having previously served in various analytical roles within Crude Supply, Terminals, Transportation and Rail and Internal Audit since joining MPC in 2003.\nMr. Floerke\n was appointed Executive Vice President and Chief Operating Officer of MPLX, effective February 2021, having previously served as Executive Vice President and Chief Operating Officer, Gathering and Processing, Trucks and Rail, since August 2020. Prior to his 2020 appointment, he served as Executive Vice President, Gathering and Processing, beginning in 2018, as Executive Vice President and Chief Operating Officer, MarkWest Operations, beginning in July 2017, and as Executive Vice President and Chief Commercial Officer, MarkWest Assets, beginning in 2015, at the time of MPLX’s acquisition of MarkWest Energy Partners, L.P. Before joining MPLX, Mr. Floerke was Executive Vice President and Chief Commercial Officer at MarkWest beginning in 2015, and Senior Vice President, Northeast region, at MarkWest beginning in 2013. Previously, Mr. Floerke held senior management positions at Access Midstream Partners, L.P. from 2011 until 2013.\nMr. Lyon\n was appointed Senior Vice President Logistics and Storage of MPLX, effective September 2022, having previously served as Vice President, Operations, and President, Marathon Pipe Line LLC, since November 2018. Prior to his 2018 appointment, he served as Vice President of Operations for Marathon Pipe Line LLC beginning in 2011. Previously, Mr. Lyon served in various roles of increasing responsibility with MPC since 1989, including as Manager, Marketing and Transportation Engineering beginning in 2010, and as District Manager, Transport and Rail beginning in 2008. He served as board chair for Liquid Energy Pipeline Association in 2023 and chairs the board of the Louisiana Offshore Oil Port (“LOOP”).\nAVAILABLE INFORMATION\nGeneral information about MPC, including our Corporate Governance Principles, our Code of Business Conduct and our Code of Ethics for Senior Financial Officers, can be found on our website at \nwww.marathonpetroleum.com/Investors/Corporate-Governance/\n. We would post on our website any amendments to, or waivers from, either of our codes requiring disclosure under applicable rules within four business days following any such amendment or waiver. Charters for the Audit Committee, Compensation and Organization Development Committee, Corporate Governance and Nominating Committee and Sustainability and Public Policy Committee are also available on our website at \nwww.marathonpetroleum.com/About/Board-of-Directors/\n.\nWe use our website, \nwww.marathonpetroleum.com\n, as a channel for routine distribution of important information, including news releases, analyst presentations, financial information and market data. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K, as well as any amendments and exhibits to those reports, are available free of charge through our website as soon as reasonably practicable after the reports are filed or furnished with the SEC, or on the SEC’s website. The SEC maintains a website that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at \nwww.sec.gov\n. These documents are also available in hard copy, free of charge, by contacting our Investor Relations office. In addition, our website allows investors and other interested persons to sign up to automatically receive email alerts when we post news releases and financial information on our website. Information contained on our website is not incorporated into this Annual Report on Form 10-K or other securities filings.\n17\nT\nable\n of Contents",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nAll statements in this section, other than statements of historical fact, are forward-looking statements that are inherently uncertain. See “Disclosures Regarding Forward-Looking Statements” and Item 1A. Risk Factors for a discussion of the factors that could cause actual results to differ materially from those projected in these statements. The following information concerning our business, results of operations and financial condition should also be read in conjunction with the information included under Item 1. Business, Item 1A. Risk Factors and Item 8. Financial Statements and Supplementary Data.\nEXECUTIVE SUMMARY\nBusiness Update\nThe global macro environment continues to deliver refined product demand growth. In 2024, we saw steady year-over-year demand for gasoline and diesel and growing demand for jet fuel. Longer term, demand growth is expected to exceed the net supply impact from limited capacity additions through the end of the decade and announced and expected refinery rationalizations. We anticipate these fundamentals, as well as the U.S. refining industry’s current structural advantages over the rest of the world, will support a constructive environment for U.S. refiners.\nIn June 2023, the California legislature adopted and implemented certain provisions of Senate Bill No.2 (such statute, together with any regulations contemplated or issued thereunder, “SB X1-2”), which authorizes the CEC to establish a “maximum gross gasoline refining margin” with respect to refining activities in California, as well as establish penalties for refiners for exceeding the yet to be issued margin cap. The law further expands on existing reporting requirements for refiners to the CEC. In October 2024, California’s governor signed Assembly Bill No.1 (such statute, together with any regulations contemplated or issued thereunder, “AB X2-1”), into law, authorizing the CEC to require that petroleum refiners maintain a minimum inventory of transportation fuels as well as require petroleum refiners to plan for resupply during scheduled maintenance. We will evaluate the impact that SB X1-2 and AB X2-1 and any associated forthcoming CEC regulations may have on our current or anticipated future operations in California and results of operations when SB X1-2 or AB X2-1 are fully implemented.\nIn response to the current business environment, we continue to focus on the following priorities for our business:\nCommitment to Safety, Reliability and Sustainability\nWe remain steadfast in our commitment to safely and reliably operate our assets and protect the health and safety of our employees. We are focused on sustainable structural changes to improve our cost competitiveness while maintaining safe and reliable operations. Our approach to sustainability spans the environmental, social and governance dimensions of our business. That means strengthening resiliency by lowering the carbon intensity and conserving natural resources; innovating for the future by investing in renewables and emerging technologies; and embedding sustainability in decision-making and in how we engage our people and many stakeholders. Specifically, in 2022, we were the first among U.S. independent refiners to establish a 2030 target to reduce absolute Scope 3 - Category 11 GHG emissions. This goal added to our existing targets for reducing Scope 1 & 2 GHG emissions intensity, for lowering methane emissions intensity and for lowering our freshwater withdrawal intensity. \nOperational Excellence\nWe are committed to achieving operational excellence by reducing costs, improving efficiency, driving operational improvements and being disciplined in capital allocation. This means lowering our costs in all aspects of our business and challenging ourselves to be disciplined in every dollar we spend across our organization. We look to optimize our portfolio of investment opportunities to ensure efficient deployment of capital focusing on projects with the highest returns.\nCommercial Performance\nWe are focused on leveraging the complexity of our facilities by selecting advantaged raw materials, new approaches in the commercial space to be more dynamic amidst changing market conditions and achieving technological improvements to advance our commercial performance. A near-term focus has been securing advantaged renewable feedstocks as we continue to advance our renewable fuels production capabilities.\nIntegrated Value Chain Optimization\nWe are committed to leveraging our value chain so that we are a leader in operational, financial, and sustainability performance. Our goal is to improve value chain optimization with a more integrated and advanced approach to decision making so that each individual asset generates free-cash-flow back to the business and contributes to shareholder returns. With our investments, we are focused on high returning projects that we believe will enhance the competitiveness of our portfolio, including our investments in sustainable fuels and technologies that lower our carbon intensity as the global energy mix evolves.\n44\nT\nable\n of Contents\nStrategic Updates\nMidstream Growth Transactions\nOn July 31, 2024, MPLX exercised its right of first offer under the BANGL, LLC joint venture agreement to purchase an additional 20 percent ownership interest in BANGL, LLC for $210 million cash, increasing total ownership interest to 45 percent. BANGL is a natural gas liquids pipeline system connecting the Delaware and Midland basins to the fractionation market in the Gulf Coast and export markets.\nOn May 29, 2024, MPLX and its joint venture partner contributed their respective membership interest in Whistler Pipeline, LLC to a newly formed joint venture, WPC Parent, LLC and issued a 19 percent voting interest in WPC Parent, LLC to an affiliate of Enbridge Inc. in exchange for the contribution of cash and the Rio Bravo Pipeline project (collectively, the “Whistler Joint Venture Transaction”). The combined platform connects Permian supply to incremental LNG export markets and supports the development of additional pipeline projects. As a result of the transaction, MPLX’s voting interest in the joint venture was reduced from 37.5 percent to 30.4 percent. MPLX recognized a gain of $151 million at closing and received a cash distribution of $134 million, recorded as a return of capital, related to the dilution of the ownership interest. \nOn March 22, 2024, MPLX used $625 million of cash to purchase additional ownership interest in existing joint ventures and gathering assets, which will enhance MPLX’s position in the Utica basin. Prior to the acquisition, MPLX owned an indirect interest in Ohio Gathering Company, L.L.C. (“OGC”) and a direct interest in Ohio Condensate Company, L.L.C. (“OCC”) and now owns a combined 73 percent interest in OGC and a 100 percent interest in OCC, and a dry gas gathering system in the Utica basin.\nSee Item 8. Financial Statements and Supplementary Data – Note 14 for additional information on these transactions.\nShare Repurchase Authorization\nOn November 5, 2024, we announced that our board of directors approved a $5.0 billion share repurchase authorization that is in addition to the $5.0 billion share repurchase authorization announced on April 30, 2024. The share repurchase authorizations have no expiration date. Future repurchases under these authorizations will depend on the macro environment, cash available after opportunities for capital investment and growth of the business and market conditions. As of December 31, 2024, MPC had $7.75 billion remaining under its share repurchase authorizations. \n45\nT\nable\n of Contents\nResults\nIn the fourth quarter of 2024, we established a Renewable Diesel segment, which includes renewable diesel activities historically reported in the Refining & Marketing segment. Prior period segment information has been recast for comparability.\nOur chief operating decision maker (“CODM”) evaluates the performance of our segments using segment adjusted EBITDA. Amounts included in income before income taxes and excluded from segment adjusted EBITDA include: (i) depreciation and amortization; (ii) net interest and other financial costs; (iii) turnaround expenses; and (iv) other adjustments as deemed necessary. These items are either: (i) believed to be non-recurring in nature; (ii) not believed to be allocable or controlled by the segment; or (iii) are not tied to the operational performance of the segment.\nSelect results for continuing operations for 2024 and 2023 are reflected in the following table. \n(Millions of dollars)\n2024\n2023\nSegment adjusted EBITDA for reportable segments\nRefining & Marketing\n$\n5,703 \n$\n13,705 \nMidstream\n6,544 \n6,171 \nRenewable Diesel\n(150)\n(64)\nTotal reportable segments\n$\n12,097 \n$\n19,812 \nReconciliation of segment adjusted EBITDA for reportable segments to income from continuing operations before income taxes\nTotal reportable segments\n$\n12,097 \n$\n19,812 \nCorporate\n(774)\n(737)\nRefining & Renewable Diesel planned turnaround costs\n(1,404)\n(1,201)\nRenewable Diesel JV planned turnaround costs\n(a)\n(9)\n(25)\nGaryville incident response costs\n— \n(16)\nLIFO inventory (charge) credit\n161 \n(145)\nGain on sale of assets\n(b)\n151 \n198 \nDepreciation and amortization\n(3,337)\n(3,307)\nRenewable Diesel JV depreciation and amortization\n(a)\n(89)\n(65)\nNet interest and other financial costs\n(839)\n(525)\nIncome from continuing operations before income taxes\n$\n5,957 \n$\n13,989 \nNet Income attributable to MPC per diluted share\n$\n10.08 \n$\n23.63 \n(a)    \nRepresents MPC’s pro-rata share of expenses from joint ventures included within the Renewable Diesel segment. \n(b)    \n2024 includes the gain from the Whistler Joint Venture Transaction. 2023 includes the $92 million gain associated with the remeasurement of MPLX’s existing equity investment in Torñado arising from the acquisition of the remaining 40 percent interest and the $106 million gain on the sale of our interest in South Texas Gateway. See Item 8. Financial Statements and Supplementary Data - Note 14. \nNet income attributable to MPC decreased $6.24 billion, or $13.55 per diluted share, in 2024 compared to 2023 primarily due to lower Refining & Marketing margins partially offset by a decreased provision for income taxes.\nRefer to the Results of Operations section for a discussion of financial results by segment for the three years ended December 31, 2024.\nMPLX\nWe received limited partner distributions of $2.27 billion and $2.06 billion from MPLX during 2024 and 2023, respectively. We owned approximately 647 million MPLX common units at December 31, 2024 with a market value of $30.99 billion based on the December 31, 2024 closing unit price of $47.86. On January 22, 2025, MPLX declared a quarterly cash distribution of $0.9565 per common unit, which was paid February 14, 2025. As a result, MPLX made distributions totaling $972 million to its common unitholders. MPC’s portion of these distributions was approximately $619 million.\nDuring the year ended December 31, 2024, MPLX repurchased approximately 8 million MPLX common units at an average cost per unit of $43.04 and paid $326 million of cash. As of December 31, 2024, $520 million remained available under the authorization for future repurchases.\nSee Item 8. Financial Statements and Supplementary Data – Note 5 for additional information on MPLX.\n46\nT\nable\n of Contents\nOVERVIEW OF SEGMENTS\nRefining & Marketing\nRefining & Marketing segment adjusted EBITDA depends largely on our refinery throughputs, Refining & Marketing margin, refining operating costs and distribution costs. Our total refining capacity was 2,963 mbpcd, 2,950 mbpcd and 2,898 mbpcd as of December 31, 2024, 2023 and 2022, respectively. \nRefining & Marketing margin is the difference between the prices of refined products sold and the costs of crude oil and other charge and blendstocks refined, including the costs to transport these inputs to our refineries and the costs of products purchased for resale. The crack spread is a measure of the difference between market prices for refined products and crude oil, commonly used by the industry as a proxy for the refining margin. Crack spreads can fluctuate significantly, particularly when prices of refined products do not move in the same relationship as the cost of crude oil. As a performance benchmark and a comparison with other industry participants, we calculate Gulf Coast, Mid-Continent and West Coast crack spreads that we believe most closely track our operations and slate of products. The following are used for these crack-spread calculations:\n•\nThe Gulf Coast crack spread uses three barrels of MEH crude producing two barrels of USGC CBOB gasoline and one barrel of USGC ULSD; \n•\nThe Mid-Continent crack spread uses three barrels of WTI crude producing two barrels of Chicago CBOB gasoline and one barrel of Chicago ULSD; and\n•\nThe West Coast crack spread uses three barrels of ANS crude producing two barrels of LA CARBOB and one barrel of LA CARB Diesel.\nOur refineries can process a variety of sweet and sour crude oil, which typically can be purchased at a discount to crude oil referenced in our Gulf Coast, Mid-Continent and West Coast crack spreads. The amount of these discounts, which we refer to as the sweet differential and the sour differential, can vary significantly, causing our Refining & Marketing margin to differ from blended crack spreads. In general, larger sweet and sour differentials will enhance our Refining & Marketing margin.\nFuture crude oil differentials will be dependent on a variety of market and economic factors, as well as U.S. energy policy.\nThe following table provides sensitivities showing an estimated change in annual Refining & Marketing segment adjusted EBITDA due to potential changes in market conditions. \n(Millions of dollars)\n \nBlended crack spread sensitivity\n(a) \n(per $1.00/barrel change)\n$\n1,100 \nSour differential sensitivity\n(b)\n \n(per $1.00/barrel change)\n515 \nSweet differential sensitivity\n(c)\n \n(per $1.00/barrel change)\n515 \nNatural gas price sensitivity\n(d)\n \n(per $1.00/MMBtu)\n350 \n(a)    \nCrack spread based on 42 percent MEH, 40 percent WTI and 18 percent ANS with Gulf Coast, Mid-Continent and West Coast product pricing, respectively, and assumes all other differentials and pricing relationships remain unchanged.\n(b)    \nSour crude oil basket consists of the following crudes: ANS, Argus Sour Crude Index, Maya and Western Canadian Select. We assume approximately 50 percent of the crude processed at our refineries in 2025 will be sour crude.\n(c)    \nSweet crude oil basket consists of the following crudes: Bakken, Brent, MEH, WTI-Cushing and WTI-Midland. We assume approximately 50 percent of the crude processed at our refineries in 2025 will be sweet crude.\n(d)    \nThis is consumption-based exposure for our Refining & Marketing segment and does not include the sales exposure for our Midstream segment. \nIn addition to the market changes indicated by the crack spreads, the sour differential and the sweet differential, our Refining & Marketing margin is impacted by factors such as:\n•\nthe selling prices realized for refined products;\n•\nthe types of crude oil and other charge and blendstocks processed;\n•\nour refinery yields;\n•\nthe cost of products purchased for resale; \n•\nthe impact of commodity derivative instruments used to hedge price risk; \n•\nthe potential impact of lower of cost or market adjustments to inventories in periods of declining prices;\n•\nthe potential impact of LIFO charges due to changes in historic inventory levels; and\n•\nthe cost of purchasing RINs in the open market to comply with RFS2 requirements.\nInventories are stated at the lower of cost or market. Costs of crude oil, refinery feedstocks and refined products are stated under the LIFO inventory costing method and aggregated on a consolidated basis for purposes of assessing if the cost basis of these inventories may have to be written down to market values. At December 31, 2024, market values for refined products exceed \n47\nT\nable\n of Contents\ntheir cost basis and, therefore, there is no lower of cost or market inventory valuation reserve at the end of the year. Based on movements of refined product prices, future inventory valuation adjustments could have a negative effect to earnings. Such losses are subject to reversal in subsequent periods if prices recover.\nRefining & Marketing segment adjusted EBITDA is also affected by changes in refining operating costs in addition to committed distribution costs. Changes in operating costs are primarily driven by the cost of energy used by our refineries, including purchased natural gas, and the level of maintenance costs. Distribution costs primarily include long-term agreements with MPLX, which as discussed below include minimum commitments to MPLX, and will negatively impact segment adjusted EBITDA in periods when throughput or sales are lower or refineries are idled.\nWe have various long-term, fee-based commercial agreements with MPLX. Under these agreements, MPLX, which is reported in our Midstream segment, provides transportation, storage, distribution and marketing services to our Refining & Marketing segment. Certain of these agreements include commitments for minimum quarterly throughput and distribution volumes of crude oil and refined products and minimum storage volumes of crude oil, refined products and other products. Certain other agreements include commitments to pay for 100 percent of available capacity for certain marine transportation and refining logistics assets. \nMidstream\nOur Midstream segment gathers, transports, stores and distributes crude oil, refined products, including renewable diesel, and other hydrocarbon-based products, principally for our Refining & Marketing segment. Additionally, the segment markets refined products. The profitability of our pipeline transportation operations primarily depends on tariff rates and the volumes shipped through the pipelines. The profitability of our marine operations primarily depends on the quantity and availability of our vessels and barges. The profitability of our light product terminal operations primarily depends on the throughput volumes at these terminals. The profitability of our fuels distribution services primarily depends on the sales volumes of certain refined products. The profitability of our refining logistics operations depends on the quantity and availability of our refining logistics assets. A majority of the crude oil and refined product shipments on our pipelines and marine vessels and the refined product throughput at our terminals serve our Refining & Marketing segment and our refining logistics assets and fuels distribution services are used solely by our Refining & Marketing segment. As discussed above in the Refining & Marketing section, MPLX, which is reported in our Midstream segment, has various long-term, fee-based commercial agreements related to services provided to our Refining & Marketing segment. Under these agreements, MPLX has received various commitments of minimum throughput, storage and distribution volumes as well as commitments to pay for all available capacity of certain assets. The volume of crude oil that we transport is directly affected by the supply of, and refiner demand for, crude oil in the markets served directly by our crude oil pipelines, terminals and marine operations. Key factors in this supply and demand balance are the production levels of crude oil by producers in various regions or fields, the availability and cost of alternative modes of transportation, the volumes of crude oil processed at refineries and refinery and transportation system maintenance levels. The volume of refined products that we transport, store, distribute and market is directly affected by the production levels of, and user demand for, refined products in the markets served by our refined product pipelines and marine operations. In most of our markets, demand for gasoline and distillate peaks during the summer driving season, which extends from May through September of each year, and declines during the fall and winter months. As with crude oil, other transportation alternatives and system maintenance levels influence refined product movements. \nOur Midstream segment also gathers, processes and transports natural gas and transports, fractionates, stores and markets NGLs. NGL and natural gas prices are volatile and are impacted by changes in fundamental supply and demand, as well as market uncertainty, availability of NGL transportation and fractionation capacity and a variety of additional factors that are beyond our control. Our Midstream segment profitability is affected by prevailing commodity prices primarily as a result of processing or conditioning at our own or third‑party processing plants, purchasing and selling or gathering and transporting volumes of natural gas at index‑related prices and the cost of third‑party transportation and fractionation services. To the extent that commodity prices influence the level of natural gas drilling by our producer customers, such prices also affect profitability.\nRenewable Diesel\nOur Renewable Diesel segment processes renewable feedstocks into renewable diesel, markets and distributes renewable diesel and includes joint ventures that produce soybean oil and renewable diesel.\nInventories are stated at the lower of cost or market. Costs of renewable feedstocks and renewable diesel are stated under the LIFO inventory costing method and aggregated on a consolidated basis, including traditional and renewable products, for purposes of assessing if the cost basis of these inventories may have to be written down to market values. At December 31, 2024, market values for all refined product inventories exceed their cost basis and, therefore, there is no lower of cost or market inventory valuation reserve at the end of the year. Based on movements of renewable product prices, future inventory valuation adjustments could have a negative effect to earnings. Such losses are subject to reversal in subsequent periods if prices recover.\nOur Renewable Diesel segment adjusted EBITDA is also affected by changes in operating costs, distribution costs, throughput and certain regulatory credits. \n48\nT\nable\n of Contents\nRESULTS OF OPERATIONS\nThe following discussion includes comments and analysis relating to our results of operations for the years ended December 31, 2024, 2023 and 2022. This discussion should be read in conjunction with Item 8. Financial Statements and Supplementary Data and is intended to provide investors with a reasonable basis for assessing our historical operations, but should not serve as the only criteria for predicting our future performance. \nConsolidated Results of Operations\n(Millions of dollars)\n2024\n2023\n2024 vs. 2023 Variance\n2022\n2023 vs. 2022 Variance\nRevenues and other income:\nSales and other operating revenues\n$\n138,864 \n$\n148,379 \n$\n(9,515)\n$\n177,453 \n$\n(29,074)\nIncome from equity method investments\n1,048 \n742 \n306 \n655 \n87 \nNet gain on disposal of assets\n28 \n217 \n(189)\n1,061 \n(844)\nOther income\n472 \n969 \n(497)\n783 \n186 \nTotal revenues and other income\n140,412 \n150,307 \n(9,895)\n179,952 \n(29,645)\nCosts and expenses:\nCost of revenues (excludes items below)\n126,240 \n128,566 \n(2,326)\n151,671 \n(23,105)\nDepreciation and amortization\n3,337 \n3,307 \n30 \n3,215 \n92 \nSelling, general and administrative expenses\n3,221 \n3,039 \n182 \n2,772 \n267 \nOther taxes\n818 \n881 \n(63)\n825 \n56 \nTotal costs and expenses\n133,616 \n135,793 \n(2,177)\n158,483 \n(22,690)\nIncome from continuing operations\n6,796 \n14,514 \n(7,718)\n21,469 \n(6,955)\nNet interest and other financial costs\n839 \n525 \n314 \n1,000 \n(475)\nIncome from continuing operations before income taxes\n5,957 \n13,989 \n(8,032)\n20,469 \n(6,480)\nProvision for income taxes on continuing operations\n890 \n2,817 \n(1,927)\n4,491 \n(1,674)\nIncome from continuing operations, net of tax\n5,067 \n11,172 \n(6,105)\n15,978 \n(4,806)\nIncome from discontinued operations, net of tax\n— \n— \n— \n72 \n(72)\nNet income\n5,067 \n11,172 \n(6,105)\n16,050 \n(4,878)\nLess net income attributable to:\nRedeemable noncontrolling interest\n27 \n94 \n(67)\n88 \n6 \nNoncontrolling interests\n1,595 \n1,397 \n198 \n1,446 \n(49)\nNet income attributable to MPC\n$\n3,445 \n$\n9,681 \n$\n(6,236)\n$\n14,516 \n$\n(4,835)\n2024 Compared to 2023\n \nNet income attributable to MPC decreased $6.24 billion in 2024 compared to 2023, primarily due to lower Refining & Marketing margins, partially offset by a decreased provision for income taxes.\nTotal revenues and other income decreased $9.90 billion in 2024 compared to 2023 primarily due to:\n•\ndecreased sales and other operating revenues of $9.52 billion primarily due to decreased average refined product sales prices of $0.24 per gallon, or 10 percent, partially offset by increased refined product sales volumes of 75 mbpd, or 2 percent;\n•\nincreased income from equity method investments of $306 million largely due to the gain on the sale of assets resulting from the Whistler Joint Venture Transaction and increased income from our Martinez Renewables joint venture;\n•\ndecreased net gains on disposal of assets of $189 million mainly due to the $106 million gain on the sale of MPC’s 25 percent interest in South Texas Gateway and $92 million associated with the remeasurement of MPLX’s existing equity investment in MarkWest Torñado GP, L.L.C. (“Torñado”), arising from the acquisition of the remaining 40 percent interest in 2023; and\n•\ndecreased other income of $497 million largely due to lower income on RINs sales and lower insurance proceeds.\n49\nT\nable\n of Contents\nTotal costs and expenses decreased $2.18 billion in 2024 compared to 2023 primarily due to:\n•\ndecreased cost of revenues of $2.33 billion primarily due to lower crude oil costs and finished product purchases, partially offset by higher contract services and material and supply expenses related to increased turnaround activity;\n•\nincreased selling, general and administrative expenses of $182 million primarily due to increased contract services costs of $96 million, office and rent expenses of $31 million and $30 million of expense related to decommissioning of non-operating assets; and\n•\ndecreased other taxes of $63 million largely due to a property tax appeal settlement of $49 million related to retroactive tax assessments for prior periods.\nNet interest and other financial costs increased $314 million largely due to decreased interest income of $154 million, primarily on short-term investments, increased pension non-service costs of $52 million and increased interest expense of $41 million due to higher MPLX borrowings. We capitalized interest of $57 million in 2024 and $60 million in 2023. See Item 8. Financial Statements and Supplementary Data – Note 11 for further details.\nWe recorded a combined federal, state and foreign income tax expense of $890 million for the year ended December 31, 2024, which was lower than the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests. We recorded a combined federal, state and foreign income tax expense of $2.82 billion for the year ended December 31, 2023, which was lower than the tax computed at the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests, partially offset by state taxes. See Item 8. Financial Statements and Supplementary Data – Note 12 for further details.\nNet income attributable to noncontrolling interests increased $198 million mainly due to an increase in MPLX’s net income.\n2023 Compared to 2022\nNet income attributable to MPC decreased $4.84 billion in 2023 compared to 2022 primarily due to lower Refining & Marketing margins and net gain on the disposal of assets.\nTotal revenues and other income decreased $29.65 billion in 2023 compared to 2022 primarily due to:\n•\ndecreased sales and other operating revenues of $29.07 billion primarily due to decreased average refined product sales prices of $0.53 per gallon, or 18 percent, partially offset by increased refined product sales volumes of 12 mbpd;\n•\nincreased income from equity method investments of $87 million largely due to increased income from Midstream equity affiliates, partially offset by decreased income from our Martinez Renewables joint venture;\n•\ndecreased net gains on disposal of assets of $844 million mainly due to gains of $549 million on the formation of the Martinez Renewables joint venture and $509 million on a lease reclassification in 2022, partially offset by the $106 million gain on the sale of MPC’s 25 percent interest in South Texas Gateway and $92 million associated with the remeasurement of MPLX’s existing equity investment in Torñado, arising from the acquisition of the remaining 40 percent interest in 2023; and\n•\nincreased other income of $186 million largely due to the receipt of insurance proceeds, partially offset by lower income on RIN sales.\nTotal costs and expenses decreased $22.69 billion in 2023 compared to 2022 primarily due to:\n•\ndecreased cost of revenues of $23.11 billion primarily due to lower crude oil costs;\n•\nincreased depreciation and amortization of $92 million mainly due to assets placed in service;\n•\nincreased selling, general and administrative expenses of $267 million primarily due to increased employee compensation and related expenses, contract services and software maintenance costs; and\n•\nincreased other taxes of $56 million largely due to the reinstated Petroleum Superfund Tax, which was effective January 1, 2023.\n \nNet interest and other financial costs decreased $475 million largely due to increased interest income, primarily on short-term investments, and decreased pension non-service costs, partially offset by increased interest expense due to higher MPLX borrowings. We capitalized interest of $60 million in 2023 and $104 million in 2022. See Item 8. Financial Statements and Supplementary Data – Note 11 for further details.\nWe recorded a combined federal, state and foreign income tax expense of $2.82 billion for the year ended December 31, 2023, which was lower than the tax computed at the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests, partially offset by state taxes. We recorded a combined federal, state and foreign income tax expense of $4.49 billion for the year ended December 31, 2022, which was higher than the tax computed at the U.S. statutory rate primarily due to state taxes, partially offset by permanent tax benefits related to net income attributable to noncontrolling interests. See Item 8. Financial Statements and Supplementary Data – Note 12 for further details.\n50\nT\nable\n of Contents\nNet income attributable to noncontrolling interests decreased $49 million mainly due to MPLX’s redemption of its outstanding Series B preferred units on February 15, 2023.\nSegment Results\nWe classify our business in the following reportable segments: Refining & Marketing, Midstream and Renewable Diesel. Segment adjusted EBITDA represents adjusted EBITDA attributable to the reportable segments. Amounts included in income before income taxes and excluded from segment adjusted EBITDA include: (i) depreciation and amortization; (ii) net interest and other financial costs; (iii) turnaround expenses and (iv) other adjustments as deemed necessary. These items are either: (i) believed to be non-recurring in nature; (ii) not believed to be allocable or controlled by the segment; or (iii) are not tied to the operational performance of the segment.\nOur segment adjusted EBITDA for reportable segments was approximately $12.10 billion, $19.81 billion and $25.03 billion for the years ended December 31, 2024, 2023 and 2022, respectively. \nRefining & Marketing\n \nThe following includes key financial and operating data for 2024, 2023 and 2022.\n(a)    \nIncludes intersegment sales to Midstream and sales destined for export.\n51\nT\nable\n of Contents\nRefining & Marketing Operating Statistics\n2024\n2023\n2022\nNet refinery throughput \n(mbpd\n)\n2,922 \n2,903 \n2,939 \nRefining & Marketing margin, excluding LIFO inventory credit/charge per barrel\n(a)(b)\n$\n15.91 \n$\n23.15 \n$\n28.04 \nLIFO inventory credit (charge) per barrel\n0.10 \n(0.15)\n0.14 \nRefining & Marketing margin per barrel\n(a)(b)\n16.01 \n23.00 \n28.18 \nLess:\nRefining operating costs per barrel\n(c)\n5.34 \n5.31 \n5.34 \nDistribution costs per barrel\n5.48 \n5.33 \n4.86 \nLIFO inventory credit (charge) per barrel\n0.10 \n(0.15)\n0.14 \nOther per barrel\n(d)\n(0.24)\n(0.43)\n(0.11)\nRefining & Marketing adjusted EBITDA per barrel\n5.33 \n12.94 \n17.95 \nLess:\nRefining planned turnaround costs per barrel\n1.31 \n1.11 \n1.04 \nLIFO inventory (credit) charge per barrel\n(0.10)\n0.15 \n(0.14)\nDepreciation and amortization per barrel\n1.65 \n1.72 \n1.66 \nPer barrel fees paid to MPLX included in distribution costs above\n$\n3.70 \n$\n3.62 \n$\n3.40 \n(a)    \nSales revenue less cost of refinery inputs and purchased products, divided by net refinery throughput.\n(b)    \nSee “Non-GAAP Measures” section for reconciliation and further information regarding this non-GAAP measure.\n(c)    \nRefining operating costs exclude planned turnaround and depreciation and amortization expense. \n(d)    \nIncludes income (loss) from equity method investments, net gain (loss) on disposal of assets and other income. \n52\nT\nable\n of Contents\nThe following table presents certain benchmark prices in our marketing areas and market indicators that we believe are helpful in understanding the results of our Refining & Marketing segment. The benchmark crack spreads below do not reflect the market cost of RINs necessary to meet EPA renewable volume obligations for attributable products under the Renewable Fuel Standard.\nBenchmark spot prices\n (dollars per gallon)\n2024\n2023\n2022\nChicago CBOB unleaded regular gasoline\n$\n2.14 \n$\n2.33 \n$\n2.87 \nChicago ultra-low sulfur diesel\n2.32 \n2.61 \n3.43 \nUSGC CBOB unleaded regular gasoline\n2.13 \n2.34 \n2.76 \nUSGC ultra-low sulfur diesel\n2.36 \n2.72 \n3.46 \nLA CARBOB\n2.46 \n2.81 \n3.29 \nLA CARB diesel\n2.44 \n2.91 \n3.51 \nMarket Indicators \n(dollars per barrel)\nWTI\n$\n75.76 \n$\n77.60 \n$\n94.33 \nMEH\n77.35 \n79.08 \n96.19 \nANS\n80.31 \n82.41 \n98.98 \nCrack Spreads\nMid-Continent WTI 3-2-1\n$\n14.09 \n$\n18.61 \n$\n26.93 \nUSGC MEH 3-2-1\n11.75 \n17.49 \n22.17 \nWest Coast ANS 3-2-1\n19.03 \n30.11 \n34.91 \nBlended 3-2-1\n(a)\n14.03 \n20.46 \n26.62 \nCrude Oil Differentials\nSweet\n$\n(1.09)\n$\n(0.48)\n$\n0.21 \nSour\n(4.45)\n(6.31)\n(6.81)\n(a)    \nBeginning in the second quarter of 2024, the blended crack spreads are weighted 42 percent of the USGC crack spread, 40 percent of the Mid-Continent crack spread and 18 percent of the West Coast crack spread. The blended crack spreads for prior periods were weighted 40 percent of the USGC crack spread, 40 percent of the Mid-Continent crack spread and 20 percent of the West Coast crack spread. These blends are based on MPC’s refining capacity by region in each period. \n2024 Compared to 2023 \nRefining & Marketing segment revenues decreased $10.21 billion primarily due to decreased average refined product sales prices of $0.24 per gallon, partially offset by increased refined product sales volumes of 75 mbpd.\nRefinery crude oil capacity utilization was 92 percent during 2024 and net refinery throughput increased 19 mbpd in 2024.\nRefining & Marketing segment adjusted EBITDA decreased $8.0 billion primarily driven by decreased per barrel margins.\nRefining & Marketing margin, excluding LIFO inventory adjustments, was $15.91 per barrel for 2024 compared to $23.15 per barrel for 2023. Refining & Marketing margin is affected by the market indicators shown earlier, which use spot market values and an estimated mix of crude purchases and product sales. Based on the market indicators and our crude oil throughput, we estimate a net negative impact of approximately $7 billion on Refining & Marketing margin, primarily due to lower crack spreads. Our reported Refining & Marketing margin differs from market indicators due to the mix of crudes purchased and their costs, the effects of market structure on our crude oil acquisition prices, RIN prices on the crack spread and other items like refinery yields and other feedstock variances, direct dealer fuel margin, and for 2024, a LIFO inventory credit of $106 million and for 2023, a LIFO inventory charge of $157 million. These factors had an estimated net negative impact on Refining & Marketing segment adjusted EBITDA of approximately $200 million in 2024 compared to 2023.\nFor the year ended December 31, 2024, refining operating costs, excluding depreciation and amortization, were $5.71 billion. This was an increase of $87 million, compared to the year ended December 31, 2023, primarily driven by higher expenses for projects conducted during turnaround activity, partially offset by a property tax appeal settlement related to retroactive tax assessments for prior periods.\nDistribution costs, excluding depreciation and amortization, were $5.86 billion and $5.65 billion for 2024 and 2023, respectively, and include fees paid to MPLX of $3.95 billion and $3.84 billion for 2024 and 2023, respectively. On a per barrel basis, distribution costs, excluding depreciation and amortization, increased $0.15 primarily due to higher pipeline tariff rates and logistics fee escalations.\nRefining planned turnaround costs increased $216 million, or $0.20 per barrel, due to the scope and timing of turnaround activity. \n53\nT\nable\n of Contents\nOther income decreased by $0.19 per barrel mainly due to lower insurance proceeds in 2024.\nWe purchase RINs to satisfy a portion of our RFS2 compliance. Our expenses associated with purchased RINs were $1.07 billion in 2024 and $2.07 billion in 2023 and are included in Refining & Marketing margin. The decrease in 2024 was primarily due to lower average RIN prices, increased RINs generated and acquired from our Martinez Renewables joint venture and lower RIN sale activity.\n2023 Compared to 2022 \nRefining & Marketing segment revenues decreased $29.62 billion primarily due to decreased average refined product sales prices of $0.53 per gallon, partially offset by increased refined product sales volumes of 12 mbpd.\nRefinery crude oil capacity utilization was 92 percent during 2023 and net refinery throughput decreased 36 mbpd in 2023.\nRefining & Marketing segment adjusted EBITDA decreased $5.55 billion primarily driven by decreased per barrel margin and throughput, increased distribution costs, excluding depreciation and amortization, partially offset by increased other income and decreased refining operating costs, excluding depreciation and amortization.\nRefining & Marketing margin, excluding LIFO inventory adjustments, was $23.15 per barrel for 2023 compared to $28.04 per barrel for 2022. Refining & Marketing margin is affected by the market indicators shown earlier, which use spot market values and an estimated mix of crude purchases and product sales. Based on the market indicators and our crude oil throughput, we estimate a net negative impact of approximately $6 billion on Refining & Marketing margin, primarily due to lower crack spreads. Our reported Refining & Marketing margin differs from market indicators due to the mix of crudes purchased and their costs, the effects of market structure on our crude oil acquisition prices, RIN prices on the crack spread and other items like refinery yields and other feedstock variances, direct dealer fuel margin, and for 2023, a LIFO inventory charge of $157 million and for 2022, a LIFO inventory credit of $149 million. These factors had an estimated net positive impact on Refining & Marketing segment adjusted EBITDA of approximately $700 million in 2023 compared to 2022.\nFor the year ended December 31, 2023, refining operating costs, excluding depreciation and amortization, were $5.63 billion. This was a decrease of $101 million, compared to the year ended December 31, 2022, largely due to lower energy costs, partially offset by higher project expense. These expenses relate to projects that are regularly performed during refinery turnarounds, of which we had more in 2023, compared to 2022.\nDistribution costs, excluding depreciation and amortization, were $5.65 billion and $5.21 billion for 2023 and 2022, respectively, and include fees paid to MPLX of $3.84 billion and $3.65 billion for 2023 and 2022, respectively. On a per barrel basis, distribution costs, excluding depreciation and amortization, increased $0.47 primarily due to higher pipeline tariff rates and logistics fee escalations.\nRefining planned turnaround costs increased $62 million, or $0.07 per barrel, due to the scope and timing of turnaround activity. \nDepreciation and amortization per barrel increased by $0.06, primarily due to an increase in costs and a decrease in throughput.\nOther income increased by $0.32 per barrel mainly due to the receipt of insurance proceeds in 2023.\nWe purchase RINs to satisfy a portion of our RFS2 compliance. Our expenses associated with purchased RINs were $2.07 billion in 2023 and $2.40 billion in 2022, including benefits related to retroactive changes in renewable volume obligation requirements, and are included in Refining & Marketing margin. The decrease in 2023 was primarily due to increased RINs acquired with purchased product from third parties and through RINs generated and acquired from our Martinez Renewables joint venture in addition to lower average RINs prices.\n54\nT\nable\n of Contents\nSupplemental Refining & Marketing Statistics \n2024\n2023\n2022\nRefining & Marketing Operating Statistics\nCrude oil capacity utilization percent\n(a)\n92 \n92 \n96 \nRefinery throughputs (\nmbpd\n):\nCrude oil refined\n2,714 \n2,677 \n2,761 \nOther charge and blendstocks\n208 \n226 \n178 \nNet refinery throughput\n2,922 \n2,903 \n2,939 \nSour crude oil throughput percent\n44 \n44 \n47 \nSweet crude oil throughput percent\n56 \n56 \n53 \nRefined product yields (\nmbpd\n):\nGasoline\n1,490 \n1,526 \n1,494 \nDistillates\n1,070 \n1,037 \n1,068 \nPropane\n67 \n66 \n70 \nNGLs and petrochemicals\n192 \n182 \n178 \nHeavy fuel oil\n59 \n52 \n73 \nAsphalt\n81 \n80 \n89 \nTotal\n2,959 \n2,943 \n2,972 \nRefined product export sales volumes \n(mbpd)\n(b)\n370 \n339 \n315 \n(a)    \nBased on calendar-day capacity, which is an annual average that includes down time for planned maintenance and other normal operating activities.\n(b)    \nRepresents fully loaded export cargoes for each time period. These sales volumes are included in the total sales volumes amounts.\nMidstream\nThe following includes key financial and operating data for 2024, 2023 and 2022.\n55\nT\nable\n of Contents\n(a)    \nOn owned common-carrier pipelines, excluding equity method investments.\n(b)    \nIncludes amounts related to MPLX operated unconsolidated equity method investments on a 100 percent basis.\nBenchmark Prices \n2024\n2023\n2022\nNatural Gas NYMEX HH (\nper MMBtu\n)\n$\n2.41 \n$\n2.66 \n$\n6.52 \nC2 + NGL Pricing (\nper gallon\n)\n(a)\n$\n0.84 \n$\n0.69 \n$\n1.03 \n(a)    \nFor 2024, C2 + NGL pricing based on Mont Belvieu prices assuming an NGL barrel of approximately 10 percent ethane, 60 percent propane, five percent Iso-Butane, 15 percent normal butane and 10 percent natural gasoline. For 2023 and 2022, C2 + NGL pricing based on Mont Belvieu prices assuming an NGL barrel of approximately 35 percent ethane, 35 percent propane, six percent Iso-Butane, 12 percent normal butane and 12 percent natural gasoline.\n2024 Compared to 2023 \nMidstream segment adjusted EBITDA increased $373 million. Sales and operating revenues increased $486 million mainly due to rate escalations, contributions from recently acquired assets and higher natural gas gathering and processing volumes. Income from equity method investments increased approximately $35 million. \n2023 Compared to 2022 \nMidstream segment adjusted EBITDA increased $399 million. Sales and operating revenues decreased $82 million mainly due to lower NGL prices, partially offset by rate escalations and higher throughput. This decrease was more than offset by lower purchased product costs of $465 million, primarily due to lower NGL prices of $917 million, partially offset by higher volumes of $405 million, an increase of $47 million due to changes in the fair value of an embedded derivative in a natural gas purchase commitment and an increase in income from equity method investments of approximately $111 million. \n56\nT\nable\n of Contents\nRenewable Diesel\nThe following includes key financial and operating data for 2024, 2023 and 2022.\n(a)    \nIncludes intersegment sales to Refining & Marketing.\n(b    \nIncludes Dickinson facility production and purchased product from our Martinez Renewables joint venture.\n2024 Compared to 2023 \nRenewable Diesel segment revenues increased $440 million primarily due to increased sales volume of 419 thousand gallons per day. Renewable Diesel segment adjusted EBITDA decreased $86 million as reduced production capacity in 2024 due to an event at the refinery in late 2023 resulted in lower throughput and impacted margins. The lower renewable diesel margins and an increased inventory LIFO charge of $43 million were partially offset by increased income from equity method investments of $129 million.\n2023 Compared to 2022 \nRenewable Diesel segment revenues increased $912 million primarily due to increased sales volume of 246 thousand gallons per day. Renewable Diesel segment adjusted EBITDA decreased $67 million mainly due to increased operating costs and distribution costs and decreased income from equity method investments of $39 million, partially offset by increased renewable diesel margins. Additionally, in 2023, the Martinez Renewables joint venture began production which was phased in at reduced rates in order to achieve nameplate capacity by the end of the year. However, operational issues impacted the ramp up and the site remained at reduced rates.\n57\nT\nable\n of Contents\nCorporate\n(millions of dollars)\n2024\n2023\n2022\nCorporate\n(a)\n$\n(864)\n$\n(837)\n$\n(753)\n(a)    \nCorporate costs consist primarily of MPC’s corporate administrative expenses and costs related to certain non-operating assets, except for corporate overhead expenses attributable to MPLX, which are included in the Midstream segment. Corporate costs include depreciation and amortization of $90 million, $100 million and $55 million for the years ended December 31, 2024, 2023 and 2022, respectively.\n2024 Compared to 2023 \nCorporate expenses increased $27 million in 2024 compared to 2023 largely due to increases in contract services of $35 million, office expenses of $24 million and compensation expense of $21 million, partially offset by a decrease in stock-based compensation of $52 million. \n2023 Compared to 2022 \nCorporate expenses increased $84 million in 2023 compared to 2022 largely due to increases in stock-based compensation expense of $48 million, depreciation and amortization of $45 million, compensation expense of $31 million, contract services expense of $26 million and office expense of $22 million, partially offset by increased allocations of corporate costs to the segments of $75 million.\nItems not Allocated to Segments\nOur CODM evaluates the performance of our segments using segment adjusted EBITDA. Items identified in the table below are either believed to be non-recurring in nature or not believed to be allocable, controlled by the segment or are not tied to the operational performance of the segment. \n(millions of dollars)\n2024\n2023\n2022\nItems not allocated to segments:\nGain on sale of assets\n$\n151 \n$\n198 \n$\n1,058 \nRenewable volume obligation requirements\n— \n— \n238 \nLitigation\n— \n— \n27 \nTotal items not allocated to segments\n$\n151 \n$\n198 \n$\n1,323 \n2024 Compared to 2023 \nIn 2024, items not allocated to segments includes a $151 million gain resulting from the Whistler Joint Venture Transaction. In 2023, total items not allocated to segments includes the $106 million gain on the sale of MPC’s 25 percent interest in South Texas Gateway and the $92 million gain associated with the remeasurement of MPLX’s existing equity investment in Torñado arising from the acquisition of the remaining 40 percent interest.\n2023 Compared to 2022 \nCompared to 2023, as discussed above, in 2022, total items not allocated to segments primarily include the gain of $549 million on the formation of the Martinez Renewables joint venture, the gain of $509 million on a lease reclassification, and a $238 million benefit related to retroactive changes in renewable volume obligation requirements published by EPA for 2020 and 2021.\nNon-GAAP Financial Measures\nManagement uses financial measures to evaluate our operating performance that are calculated and presented on the basis of methodologies other than in accordance with GAAP. The non-GAAP financial measures we use are as follows:\nRefining & Marketing Margin\nRefining & Marketing margin is defined as sales revenue less cost of refinery inputs and purchased products. We use and believe our investors use this non-GAAP financial measure to evaluate our Refining & Marketing segment’s operating and financial performance as it is the most comparable measure to the industry’s market reference product margins. This measure should not be considered a substitute for, or superior to, Refining & Marketing gross margin or other measures of financial performance prepared in accordance with GAAP, and our calculations thereof may not be comparable to similarly titled measures reported by other companies.\n58\nT\nable\n of Contents\nReconciliation of Refining & Marketing segment adjusted EBITDA to Refining & Marketing gross margin and Refining & Marketing margin\n(Millions of dollars)\n2024\n2023\n2022\nRefining & Marketing segment adjusted EBITDA\n$\n5,703 \n$\n13,705 \n$\n19,259 \nPlus (Less):\nDepreciation and amortization\n(1,767)\n(1,822)\n(1,783)\nRefining planned turnaround costs\n(1,397)\n(1,181)\n(1,119)\nLIFO inventory credit (charge)\n106 \n(157)\n149 \nSelling, general and administrative expenses\n2,472 \n2,443 \n2,235 \nIncome from equity method investments\n(57)\n(66)\n(51)\nNet gain on disposal of assets\n(1)\n(2)\n(37)\nOther income\n(342)\n(870)\n(678)\nRefining & Marketing gross margin\n4,717 \n12,050 \n17,975 \nPlus (Less):\nOperating expenses (excluding depreciation and amortization)\n11,321 \n10,833 \n10,564 \nDepreciation and amortization\n1,767 \n1,822 \n1,783 \nGross margin excluded from and other income included in Refining & Marketing margin\n(a)\n(425)\n(45)\n82 \nOther taxes included in Refining & Marketing margin\n(259)\n(288)\n(173)\nRefining & Marketing margin\n17,121 \n24,372 \n30,231 \nLIFO inventory (credit) charge\n(106)\n157 \n(149)\nRefining & Marketing margin, excluding LIFO inventory (credit) charge\n$\n17,015 \n$\n24,529 \n$\n30,082 \n(a)    \nReflects the gross margin, excluding depreciation and amortization, of other related operations included in the Refining & Marketing segment and processing of credit card transactions on behalf of certain of our marketing customers, net of other income. \nRenewable Diesel Margin\nRenewable Diesel margin is defined as sales revenue less cost of renewable inputs and purchased products. We use and believe our investors use this non-GAAP financial measure to evaluate our Renewable Diesel segment’s operating and financial performance. This measure should not be considered a substitute for, or superior to, Renewable Diesel gross margin or other measures of financial performance prepared in accordance with GAAP, and our calculation thereof may not be comparable to similarly titled measures reported by other companies.\n59\nT\nable\n of Contents\nReconciliation of Renewable Diesel segment adjusted EBITDA to Renewable Diesel gross margin and Renewable Diesel margin\n(Millions of dollars)\n2024\n2023\n2022\nRenewable Diesel segment adjusted EBITDA\n$\n(150)\n$\n(64)\n$\n3 \nPlus (Less):\nDepreciation and amortization\n(75)\n(65)\n(67)\nRenewable Diesel JV depreciation and amortization\n(a)\n(89)\n(65)\n(1)\nRenewable Diesel planned turnaround costs\n(7)\n(20)\n(3)\nRenewable Diesel JV planned turnaround costs\n(a)\n(9)\n(25)\n— \nLIFO inventory (charge) credit\n55 \n12 \n(1)\nSelling, general and administrative expenses\n59 \n61 \n59 \n(Income) loss from equity method investments\n(70)\n59 \n20 \n Net gain on disposal of assets\n— \n(1)\n— \nOther income\n— \n(1)\n(8)\nRenewable Diesel gross margin\n(286)\n(109)\n2 \nPlus (Less):\nOperating expenses (excluding depreciation and amortization)\n312 \n284 \n119 \nDepreciation and amortization\n75 \n65 \n67 \nMartinez JV depreciation and amortization\n85 \n64 \n1 \nRenewable Diesel margin\n186 \n$\n304 \n189 \nLIFO inventory (credit) charge\n(55)\n(12)\n1 \nRenewable Diesel margin, excluding LIFO inventory (credit) charge\n$\n131 \n$\n292 \n$\n190 \n(a)    \nRepresents MPC’s pro-rata share of expenses from joint ventures included within the Renewable Diesel segment. \nLIQUIDITY AND CAPITAL RESOURCES\nCash Flows\nOur cash and cash equivalents balance was $3.21 billion at December 31, 2024, compared to $5.44 billion at December 31, 2023. Net cash provided by (used in) operating activities, investing activities and financing activities for the past three years is presented in the following table.\n(Millions of dollars)\n2024\n2023\n2022\nNet cash provided by (used in):\nOperating activities - continuing operations\n$\n8,665 \n$\n14,117 \n$\n16,319 \nOperating activities - discontinued operations\n— \n— \n42 \nTotal operating activities\n8,665 \n14,117 \n16,361 \nInvesting activities\n1,534 \n(3,095)\n623 \nFinancing activities\n(12,434)\n(14,207)\n(13,647)\nTotal increase (decrease) in cash\n$\n(2,235)\n$\n(3,185)\n$\n3,337 \nOperating Activities\nContinuing Operations\nNet cash provided by operating activities from continuing operations decreased $5.45 billion in 2024 compared to 2023, primarily due to a decrease in operating results partially offset by a favorable change in working capital of $105 million. Net cash provided by operating activities from continuing operations decreased $2.20 billion in 2023 compared to 2022, primarily due to a decrease in operating results partially offset by a favorable change in working capital of $2.19 billion. The above changes in working capital exclude changes in short-term debt. \nFor 2024, changes in working capital were a net $470 million source of cash, primarily due to the effect of decreases in energy commodity prices and volumes at the end of the year on working capital. Current receivables decreased primarily due to decreases in refined product and crude oil prices and crude oil volumes. Accounts payable increased primarily due to increased crude oil volumes and liability for a purchase of tax credits from a third party, partially offset by decreased crude oil prices. Inventories increased primarily due to increases in refined product and materials and supplies inventories, partially offset by a \n60\nT\nable\n of Contents\ndecrease in crude oil inventory. Additionally, working capital was favorably impacted by changes in income tax receivable and unfavorably impacted by changes in current liabilities and other current assets.\nFor 2023, changes in working capital were a net $365 million source of cash, primarily due to the effect of decreases in energy commodity prices and volumes at the end of the year on working capital. Current receivables decreased primarily due to decreases in crude oil volumes and prices. Accounts payable decreased primarily due to decreases in crude oil prices and volumes. Inventories increased primarily due to increases in refined product, crude oil and materials and supplies inventories. Additionally, working capital was favorably impacted by changes in income tax receivable and current liabilities and other current assets.\nFor 2022, changes in working capital were a net $1.82 billion use of cash, primarily due to the effect of increases in energy commodity prices and volumes at the end of the year on working capital. Current receivables increased primarily due to higher crude oil and refined product volumes and prices. Inventories increased primarily due to increases in crude oil, refined product and materials and supplies inventories. Accounts payable increased primarily due to increases in crude oil prices. Additionally, working capital was unfavorably impacted by changes in income tax receivable and favorably impacted by changes in current liabilities and other current assets.\nDiscontinued Operations\nNet cash provided by operating activities from discontinued operations was $42 million in 2022 largely due to the settlement of working capital related to the Speedway sale, partially offset by the payment of state income tax liabilities. \nInvesting Activities\nNet cash provided by investing activities was $1.53 billion in 2024 and $623 million in 2022, compared to net cash used in investing activities of $3.10 billion in 2023.\n•\nIn 2024, the change in net cash provided was primarily due to maturities and sales of short-term investments of $4.53 billion and $3.30 billion, respectively, partially offset by purchases of short-term investments of $2.95 billion. The cash provided by maturities and sales of short-term investments was primarily used to fund our return of capital initiatives.\n•\nIn 2023, the change in net cash used was primarily due to purchases of short-term investments of $8.62 billion, partially offset by maturities and sales of short-term investments of $5.05 billion and $2.08 billion, respectively. The cash provided by maturities and sales of short-term investments was primarily used to fund our return of capital initiatives announced as part of the Speedway sale.\n•\nIn 2022, the change in net cash provided was primarily due to maturities and sales of short-term investments of $7.16 billion and $1.30 billion, respectively, partially offset by purchases of short-term investments of $6.02 billion. The cash provided by maturities and sales of short-term investments was primarily used to fund our return of capital initiatives announced as part of the Speedway sale.\n•\nCash used for additions to property, plant and equipment was $2.53 billion in 2024, compared to $1.89 billion in 2023 and $2.42 billion in 2022. See the Capital Requirements section for additional information on our capital investment plan.\n•\nCash used for acquisitions was $688 million in 2024 largely due to acquisitions in our Midstream segment. Cash used for acquisitions was $246 million in 2023 due to MPLX’s acquisition of the remaining interest in a gathering and processing joint venture for approximately $270 million, offset by cash acquired of $24 million. Cash used for acquisitions was $413 million in 2022 primarily due to the purchase of Marathon Tanker Holdings LLC (formerly known as Crowley Ocean Partners LLC) and its four subsidiaries from Marathon Coastal Holdings LLC (formerly known as Crowley Coastal Partners LLC) for approximately $485 million, which included $196 million to pay off the debt associated with the four tankers.\n•\nCash used in net investments was $348 million in 2024 and $205 million in 2023, compared to cash provided by net investments of $110 million in 2022. In 2024, investments primarily included a return of capital of $134 million related to the Whistler Joint Venture more than offset by Midstream equity method investments, including a $92 million contribution made in March 2024 for the repayment of MPLX’s share of the Dakota Access joint venture’s debt due in 2024. In 2023, investments primarily included the Martinez Renewables joint venture and the acquisition of a 49.9 percent equity interest in LF Bioenergy for approximately $56 million, partially offset by cash received from the sale of MPC’s 25 percent interest in South Texas Gateway. Investments in 2022 include a $500 million cash distribution received from the Martinez Renewables joint venture at its formation, partially offset by increased contributions to equity method investments, which included the $60 million contribution to MPLX’s Bakken Pipeline joint venture to fund its share of a debt repayment by the joint venture. \n•\nCash provided by disposal of assets totaled $35 million, $36 million and $90 million in 2024, 2023 and 2022, respectively, primarily due to the sale of Corporate and Refining & Marketing assets in 2024 and the sale of Midstream assets in 2023 and 2022. \n61\nT\nable\n of Contents\nThe consolidated statements of cash flows exclude changes to the consolidated balance sheets that did not affect cash. A reconciliation of additions to property, plant and equipment to total capital expenditures and investments follows for each of the last three years.\n(Millions of dollars)\n2024\n2023\n2022\nAdditions to property, plant and equipment per consolidated statements of cash flows\n$\n2,533 \n$\n1,890 \n$\n2,420 \nIncrease (decrease) in capital accruals\n34 \n184 \n(37)\nTotal capital expenditures\n2,567 \n2,074 \n2,383 \nInvestments in equity method investees\n509 \n480 \n405 \nTotal capital expenditures and investments\n$\n3,076 \n$\n2,554 \n$\n2,788 \nFinancing Activities\nFinancing activities were a use of cash of $12.43 billion in 2024, $14.21 billion in 2023 and $13.65 billion in 2022. \n•\nDuring 2024, MPLX issued $1.65 billion aggregate principal amount of 5.50 percent senior notes due June 2034 (the “2034 Senior Notes”) and used the proceeds to repay $1.15 billion aggregate principal amount of senior notes. MPC repaid $750 million aggregate principal amount of senior notes that matured September 2024.\n•\nDuring 2023, MPLX issued $1.6 billion of senior notes and used the proceeds to redeem $1.0 billion of senior notes and all of its outstanding Series B preferred units for $600 million.\n•\nDuring 2022, MPLX issued $2.5 billion of senior notes, redeemed $1.0 billion of senior notes and had net payments of $300 million under its revolving credit facility. \n•\nCash used in common stock repurchases totaled $9.19 billion in 2024, $11.57 billion in 2023 and $11.92 billion in 2022. See the “Capital Requirements” section for further discussion of our stock repurchases.\n•\nCash used in dividend payments totaled $1.15 billion in 2024, $1.26 billion in 2023 and $1.28 billion in 2022. Dividends per share were $3.39 in 2024, $3.08 in 2023 and $2.49 in 2022. The decreases in 2024 and 2023 are primarily due to share repurchases, partially offset by increases in per share dividends.\n•\nCash used in distributions to noncontrolling interests totaled $1.38 billion in 2024, $1.28 billion in 2023 and $1.21 billion in 2022 due to distributions to MPLX common and preferred public unitholders.\n•\nCash used in repurchases of noncontrolling interests totaled $326 million in 2024 and $491 million in 2022 due to MPLX’s repurchases of its common units. There were no repurchases of noncontrolling interests in 2023. See the “Capital Requirements” section for further discussion of MPLX’s unit repurchases.\nDerivative Instruments\nSee Item 7A. Quantitative and Qualitative Disclosures about Market Risk for a discussion of derivative instruments and associated market risk.\n62\nT\nable\n of Contents\nCapital Resources\nMPC, Excluding MPLX\nWe control MPLX through our ownership of the general partner; however, the creditors of MPLX do not have recourse to MPC’s general credit through guarantees or other financial arrangements, except as noted. MPC has effectively guaranteed certain indebtedness of LOOP and LOCAP, in which MPLX holds an interest. Therefore, in the following table, we present the liquidity of MPC, excluding MPLX. MPLX liquidity is discussed in the following section.\nOur liquidity, excluding MPLX, totaled $6.79 billion at December 31, 2024 consisting of:\nDecember 31, 2024\n(Millions of dollars)\nTotal Capacity\nOutstanding Borrowings\nOutstanding Letters \nof Credit\nAvailable\nCapacity\nBank revolving credit facility\n$\n5,000 \n$\n— \n$\n1 \n$\n4,999 \nTrade receivables facility\n(a)\n100 \n— \n— \n100 \nTotal\n$\n5,100 \n$\n— \n$\n1 \n$\n5,099 \nCash and cash equivalents and short-term investments\n(b)\n1,691 \nTotal liquidity\n$\n6,790 \n(a)    \nThe committed borrowing and letter of credit issuance capacity under the trade receivables securitization facility is $100 million. In addition, the facility allows for the issuance of letters of credit in excess of the committed capacity at the discretion of the issuing banks. \n(b)    \nExcludes $1.52 billion of MPLX cash and cash equivalents. \nOn February 10, 2025, MPC issued $2.0 billion aggregate principal amount of senior notes in an underwritten public offering consisting of $1.1 billion aggregate principal amount of 5.150 percent senior notes due March 2030 and $900 million aggregate principal amount of 5.700 percent senior notes due March 2035. We intend to use the net proceeds from this offering to repay, redeem or otherwise retire our outstanding $1.250 billion aggregate principal amount of 4.700 percent senior notes due May 2025 and for general corporate purposes.\nBecause of the alternatives available to us, including internally generated cash flow and access to capital markets and a commercial paper program, we believe that our short-term and long-term liquidity is adequate to fund not only our current operations, but also our near-term (less than twelve months) and long-term funding requirements, including capital spending programs, the repurchase of shares of our common stock, dividend payments, defined benefit plan contributions, repayment of debt maturities and other amounts that may ultimately be paid in connection with contingencies. \nWe have a commercial paper program that allows us to have a maximum of $2.0 billion in commercial paper outstanding, with maturities up to 397 days from the date of issuance. We do not intend to have outstanding commercial paper borrowings in excess of available capacity under our bank revolving credit facility. At December 31, 2024, we had no borrowings outstanding under the commercial paper program.\nMPC’s bank revolving credit facility and trade receivables facility contain representations and warranties, affirmative and negative covenants and restrictions, including financial covenants, and events of default that we consider usual and customary for agreements of a similar type and nature. As of December 31, 2024, we were in compliance with such covenants and restrictions. See Item 8. Financial Statements and Supplementary Data – Note 19 for further discussion of MPC’s revolving bank credit facility, trade receivables facility and related covenants and restrictions.\nOur intention is to maintain an investment-grade credit profile. As of January 31, 2025, the credit ratings on our senior unsecured debt are as follows.\n \nCompany\nRating Agency\nRating\nMPC\nMoody’s\nBaa2 (stable outlook)\nStandard & Poor’s\nBBB (stable outlook)\nFitch\nBBB (stable outlook)\nThe ratings reflect the respective views of the rating agencies and should not be interpreted as a recommendation to buy, sell or hold our securities. Although it is our intention to maintain a credit profile that supports an investment-grade rating, there is no assurance that these ratings will continue for any given period of time. The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant. A rating from one rating agency should be evaluated independently of ratings from other rating agencies.\nThe agreements governing MPC’s debt obligations do not contain credit rating triggers that would result in the acceleration of interest, principal or other payments in the event that our credit ratings are downgraded. However, any downgrades of our senior \n63\nT\nable\n of Contents\nunsecured debt could increase the applicable interest rates, yields and other fees payable under such agreements and may limit our flexibility to obtain financing in the future, including to refinance existing indebtedness. In addition, a downgrade of our senior unsecured debt rating to below investment-grade levels could, under certain circumstances, impact our ability to purchase crude oil on an unsecured basis and could result in us having to post letters of credit under existing transportation services or other agreements.\nSee Item 8. Financial Statements and Supplementary Data – Note 19 for further discussion of our debt.\nMPLX\n \nMPLX’s liquidity totaled $5.02 billion at December 31, 2024 consisting of:\nDecember 31, 2024\n(Millions of dollars)\nTotal Capacity\nOutstanding Borrowings\nOutstanding Letters \nof Credit\nAvailable\nCapacity\nMPLX bank revolving credit facility\n$\n2,000 \n$\n— \n$\n— \n$\n2,000 \nMPC intercompany loan agreement\n1,500 \n— \n— \n1,500 \nTotal\n$\n3,500 \n$\n— \n$\n— \n$\n3,500 \nCash and cash equivalents\n1,519 \nTotal liquidity\n$\n5,019 \nOn May 20, 2024, MPLX issued $1.65 billion aggregate principal amount of 5.50 percent senior notes due June 2034 (the “2034 Senior Notes”) in an underwritten public offering. On December 1, 2024, MPLX used $1,150 million of the net proceeds from the issuance of the 2034 Senior Notes to repay all of (i) MPLX's outstanding $1,149 million aggregate principal amount of 4.875 percent senior notes due December 2024 and (ii) MarkWest's outstanding $1 million aggregate principal amount of 4.875 percent senior notes due December 2024. On February 18, 2025, MPLX used the remaining net proceeds from the issuance of the 2034 Senior Notes to repay all of MPLX's outstanding $500 million aggregate principal amount of 4.000 percent senior notes due February 2025.\nMPLX’s bank revolving credit facility contains representations and warranties, covenants and restrictions, including financial covenants, and events of default that we consider usual and customary for agreements of a similar type and nature. As of December 31, 2024, we were in compliance with such covenants and restrictions. See Item 8. Financial Statements and Supplementary Data – Note 19 for further discussion of MPLX’s bank revolving credit facility and related covenants and restrictions.\nOur intention is to maintain an investment-grade credit profile for MPLX. As of January 31, 2025, the credit ratings on MPLX’s senior unsecured debt are as follows.\n \nCompany\nRating Agency\nRating\nMPLX\nMoody’s\nBaa2 (stable outlook)\nStandard & Poor’s\nBBB (stable outlook)\nFitch\nBBB (stable outlook)\nThe ratings reflect the respective views of the rating agencies and should not be interpreted as a recommendation to buy, sell or hold MPLX securities. Although it is our intention to maintain a credit profile that supports an investment-grade rating for MPLX, there is no assurance that these ratings will continue for any given period of time. The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant. A rating from one rating agency should be evaluated independently of ratings from other rating agencies.\nThe agreements governing MPLX’s debt obligations do not contain credit rating triggers that would result in the acceleration of interest, principal or other payments in the event that MPLX credit ratings are downgraded. However, any downgrades of MPLX senior unsecured debt to below investment grade ratings could increase the applicable interest rates, yields and other fees payable under such agreements. In addition, a downgrade of MPLX senior unsecured debt ratings to below investment-grade levels may limit MPLX’s ability to obtain future financing, including to refinance existing indebtedness. \nSee Item 8. Financial Statements and Supplementary Data – Note 19 for further discussion of MPLX’s debt.\nCapital Requirements\nCapital Spending\nMPC’s capital investment outlook for 2025 totals approximately $1.25 billion for capital projects and investments, excluding capitalized interest, potential acquisitions, if any, and MPLX’s capital investment plan. MPC’s 2025 capital investment outlook \n64\nT\nable\n of Contents\nincludes all of the planned capital spending for Refining & Marketing, Renewable Diesel and Corporate as well as a portion of the planned capital investments for Midstream. The remainder of the planned capital spending for Midstream reflects the capital investment plan for MPLX. We continuously evaluate our capital plan and make changes as conditions warrant. The 2025 capital investment outlook for MPC and MPLX and capital expenditures and investments for each of the last three years are summarized by segment below.\n(Millions of dollars)\n2025 Outlook\n2024\n2023\n2022\nCapital expenditures and investments:\n(a)\nMPC, excluding MPLX\nRefining & Marketing\n$\n1,200 \n$\n1,445 \n$\n998 \n$\n1,275 \nMidstream - Other\n— \n7 \n2 \n8 \nRenewable Diesel\n5 \n8 \n313 \n233 \nCorporate and Other\n(b)\n45 \n63 \n83 \n108 \nTotal MPC, excluding MPLX\n$\n1,250 \n$\n1,523 \n$\n1,396 \n$\n1,624 \nMidstream - MPLX\n(c)\n$\n2,000 \n$\n1,497 \n$\n1,103 \n$\n1,061 \n(a)    \nCapital expenditures include changes in capital accruals.\n(b)    \nExcludes capitalized interest of $56 million, $55 million and $103 million for 2024, 2023 and 2022, respectively. The 2025 capital investment plan excludes capitalized interest.\n(c)    \nThe 2025 capital investment outlook for Midstream - MPLX excludes $242 million of capital expenditures, which is expected to be incurred primarily by MPC and other MPLX customers on MPLX’s behalf. This reimbursable capital will be included in the 2025 MPC Midstream capital expenditures.\nRefining & Marketing\nThe Refining & Marketing segment’s forecasted 2025 capital spending and investments is approximately $1.20 billion. This amount includes approximately $100 million of value enhancing capital for multi-year low carbon initiatives. At our Los Angeles refinery, we are advancing improvements to enhance the competitiveness of the refinery by improving reli\nability and lowering costs. The improvements focus on integrating and modernizing utility systems and increasing energy efficiency, with the added benefit of addressing upco\nming regulation mandating further reductions in emissions. The improvements are expected to be completed by the end of 2025. There is also $750 million of value enhancing capital, which includes a multi-year project to upgrade high sulfur distillate to ULSD and maximize distillate volume expansion at our Galveston Bay refinery, which is expected to be completed by the end of 2027, a project at our Robinson refinery to shift yields to higher value products including the flexibility to maximize jet production to meet growing demand, which is expected to be completed by the end of 2026, and other traditional projects that will enhance the yields of our refineries, improve energy efficiency, and lower our costs as well as investments in our branded marketing footprint. Maintenance capital is expected to be approximately $350 million, which is essential to maintain the safety, integrity and reliability of our assets.\nMajor capital projects completed over the last three years have focused on refinery optimization, production of higher value products, increased capacity to upgrade residual fuel oil and expanded export capacity. We also focused on projects such as the STAR project at our Galveston Bay refinery and projects expected to reduce future operating costs.\nMidstream - MPLX\nMPLX’s capital investment outlook totals approximately $2.0 billion, net of reimbursements and excluding capitalized interest and potential acquisitions, if any, and includes approximately $1.7 billion of growth capital and $300 million of maintenance capital. MPLX’s growth plans are focused on expanding its Permian to Gulf Coast integrated value chain, progressing long-haul pipeline value enhancing projects to support producer activity, and investing in new gas processing plants in the Marcellus and Permian. The remainder of its capital plan targets the expansion of crude gathering pipelines in the Permian and Bakken basins, and the debottlenecking of existing assets to meet customer demand. \nMajor capital projects over the last three years included investments for the development of natural gas and natural gas liquids infrastructure to support MPLX’s producer customers, primarily in the Marcellus, Utica and Permian regions and development of various crude oil and refined petroleum products infrastructure projects.\nRenewable Diesel\nThe Renewable Diesel segment’s forecasted 2025 capital spending and investments is approximately $5 million. Major projects over the last three years included investments in the Martinez Renewables joint venture and the Green Bison Soy Processing joint venture.\n65\nT\nable\n of Contents\nCorporate and Other\nThe 2025 capital forecast includes approximately $45 million to support corporate and other activities. Major projects over the last three years included upgrades to information technology systems. \nShare Repurchases\nFrom January 1, 2012 through December 31, 2024, our board of directors approved $60.05 billion in total share repurchase authorizations and we have repurchased a total of $52.30 billion of our common stock. As of December 31, 2024, MPC had $7.75 billion remaining under its share repurchase authorizations, which reflects the repurchase of 203,173 common shares for $28 million that were transacted in the fourth quarter of 2024 and settled in the first quarter of 2025. The table below summarizes our total share repurchases for the last three years. See Item 8. Financial Statements and Supplementary Data – Note 9 for further discussion of the share repurchase plans.\n(In millions of dollars, except per share data)\n2024\n2023\n2022\nNumber of shares repurchased\n53 \n89 \n131 \nCash paid for shares repurchased\n$\n9,077 \n$\n11,572 \n$\n11,922 \nAverage cost per share\n$\n171.68 \n$\n131.27 \n$\n91.20 \nWe may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, tender offers, accelerated share repurchases or open market solicitations for shares, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended or discontinued at any time.\nMPLX Unit Repurchases\nThe table below summarizes MPLX’s total unit repurchases for the last three years. \n(In millions of dollars, except per unit data)\n2024\n2023\n2022\nNumber of common units repurchased\n8 \n— \n15 \nCash paid for common units repurchased\n$\n326 \n$\n— \n$\n491 \nAverage cost per unit\n$\n43.04 \n$\n— \n$\n31.96 \nAs of December 31, 2024, MPLX had approximately $520 million remaining under its unit repurchase authorization. The repurchase authorization has no expiration date.\nMPLX may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, accelerated unit repurchases, tender offers or open market solicitations for units, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be discontinued at any time.\nSee Item 8. Financial Statements and Supplementary Data – Note 5 for further discussion of the MPLX unit repurchase program.\nMaterial Cash Commitments \nContractual Obligations\nWe have purchase commitments primarily consisting of obligations to purchase and transport crude oil and feedstocks used in our refining operations. As of December 31, 2024, we had purchase obligations for crude oil, NGLs and renewable feedstocks of $17.18 billion, with $14.50 billion payable within 12 months, and crude oil transportation obligations of $7.98 billion, with $892 million payable within 12 months. These contracts include variable price arrangements. For purposes of this disclosure, we have estimated prices to be paid primarily based on futures curves for the commodities to the extent available. Our contractual obligations do not include our contractual obligations to MPLX under various fee-based commercial agreements as these transactions are eliminated in the consolidated financial statements.\nAt December 31, 2024, we had non-cancelable obligations to acquire property, plant and equipment of $260 million, which is all payable within 12 months. \nAt December 31, 2024, we had an aggregate principal amount of outstanding senior notes of $26.90 billion, with $2.95 billion payable within 12 months, and interest on the debt of $16.49 billion, with $1.17 billion payable within 12 months. See Item 8. Financial Statements and Supplementary Data – Note 19 for additional information on our debt. We intend to repay the short-term maturities with existing cash on hand and/or with the proceeds of new long-term debt, depending on, among other things, market conditions.\n66\nT\nable\n of Contents\nOur other contractual obligations primarily consist of pension and post-retirement obligations, finance and operating leases and environmental credits liabilities, for which additional information is included in Item 8. Financial Statements and Supplementary Data – Notes 24, 26 and 22, respectively.\nOther Cash Commitments\nOn January 24, 2025, we announced our board of directors approved a $0.91 per share dividend, payable March 10, 2025 to shareholders of record at the close of business on February 19, 2025.\nWe may, from time to time, repurchase our senior notes and preferred units in the open market, in tender offers, in privately-negotiated transactions or otherwise in such volumes, at such prices and upon such other terms as we deem appropriate.\nTRANSACTIONS WITH RELATED PARTIES\nSee Item 8. Financial Statements and Supplementary Data – Note 7 for discussion of activity with related parties.\nENVIRONMENTAL MATTERS AND COMPLIANCE COSTS \nWe have incurred and may continue to incur substantial capital, operating and maintenance, and remediation expenditures as a result of environmental laws and regulations. If these expenditures, as with all costs, are not ultimately reflected in the prices of our products and services, our operating results will be adversely affected. We believe that substantially all of our competitors must comply with similar environmental laws and regulations. However, the specific impact on each competitor may vary depending on a number of factors, including the age and location of its operating facilities, marketing areas, production processes and whether it is also engaged in the petrochemical business or the marine transportation of crude oil and refined products.\nLegislation and regulations pertaining to fuel specifications, climate change and GHG emissions have the potential to materially adversely impact our business, financial condition, results of operations and cash flows, including costs of compliance and permitting delays. The extent and magnitude of these adverse impacts cannot be reliably or accurately estimated at this time because specific regulatory and legislative requirements have not been finalized and uncertainty exists with respect to the measures being considered, the costs and the time frames for compliance, and our ability to pass compliance costs on to our customers.\nOur environmental expenditures, including non-regulatory expenditures, for each of the last three years were:\n(Millions of dollars)\n2024\n2023\n2022\nCapital\n$\n543 \n$\n236 \n$\n167 \nCompliance:\n(a)\nOperating and maintenance\n1,390 \n1,191 \n987 \nRemediation\n(b)\n56 \n49 \n72 \nTotal\n$\n1,989 \n$\n1,476 \n$\n1,226 \n(a)    \nBased on the American Petroleum Institute’s definition of environmental expenditures.\n(b)    \nThese amounts include spending charged against remediation reserves, where permissible, but exclude non-cash provisions recorded for environmental remediation.\nWe accrue for environmental remediation activities when the responsibility to remediate is probable and the amount of associated costs can be reasonably estimated. As environmental remediation matters proceed toward ultimate resolution or as additional remediation obligations arise, charges in excess of those previously accrued may be required.\nNew or expanded environmental requirements, which could increase our environmental costs, may arise in the future. It is not possible to predict all of the ultimate costs of compliance, including remediation costs that may be incurred and penalties that may be imposed.\nOur environmental capital expenditures accounted for 22 percent, 12 percent and 7 percent of capital expenditures for 2024, 2023 and 2022, respectively, excluding acquisitions. Our environmental capital expenditures are expected to be approximately $298 million, or 9 percent, of total planned capital expenditures in 2025. Actual expenditures may vary as the number and scope of environmental projects are revised as a result of improved technology or changes in regulatory requirements and could increase if additional projects are identified or additional requirements are imposed. \nFor more information on environmental regulations that impact us, or could impact us, see Item 1. Business\n – \nRegulatory Matters and Item 1A. Risk Factors.\n67\nT\nable\n of Contents\nCRITICAL ACCOUNTING ESTIMATES \nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and the disclosure of contingent assets and liabilities as of the date of the consolidated financial statements and the reported amounts of revenues and expenses during the respective reporting periods. Accounting estimates are considered to be critical if (1) the nature of the estimates and assumptions is material due to the levels of subjectivity and judgment necessary to account for highly uncertain matters or the susceptibility of such matters to change; and (2) the impact of the estimates and assumptions on financial condition or operating performance is material. Actual results could differ from the estimates and assumptions used. See Item 8. Financial Statements and Supplementary Data – Note 2 for additional information on these policies and estimates, as well as a discussion of additional accounting policies and estimates.\nFair Value Estimates\nFair value is the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date. There are three approaches for measuring the fair value of assets and liabilities: the market approach, the income approach and the cost approach, each of which includes multiple valuation techniques. The market approach uses prices and other relevant information generated by market transactions involving identical or comparable assets or liabilities. The income approach uses valuation techniques to measure fair value by converting future amounts, such as cash flows or earnings, into a single present value amount using current market expectations about those future amounts. The cost approach is based on the amount that would currently be required to replace the service capacity of an asset. This is often referred to as current replacement cost. The cost approach assumes that the fair value would not exceed what it would cost a market participant to acquire or construct a substitute asset of comparable utility, adjusted for obsolescence.\nThe fair value accounting standards do not prescribe which valuation technique should be used when measuring fair value and do not prioritize among the techniques. These standards establish a fair value hierarchy that prioritizes the inputs used in applying the various valuation techniques. Inputs broadly refer to the assumptions that market participants use to make pricing decisions, including assumptions about risk. Level 1 inputs are given the highest priority in the fair value hierarchy while Level 3 inputs are given the lowest priority. The three levels of the fair value hierarchy are as follows:\n•\nLevel 1 – Observable inputs that reflect unadjusted quoted prices for identical assets or liabilities in active markets as of the measurement date. Active markets are those in which transactions for the asset or liability occur in sufficient frequency and volume to provide pricing information on an ongoing basis.\n•\nLevel 2 – Observable market-based inputs or unobservable inputs that are corroborated by market data. These are inputs other than quoted prices in active markets included in Level 1, which are either directly or indirectly observable as of the measurement date.\n•\nLevel 3 – Unobservable inputs that are not corroborated by market data and may be used with internally developed methodologies that result in management’s best estimate of fair value.\nValuation techniques that maximize the use of observable inputs are favored. Assets and liabilities are classified in their entirety based on the lowest priority level of input that is significant to the fair value measurement. The assessment of the significance of a particular input to the fair value measurement requires judgment and may affect the placement of assets and liabilities within the levels of the fair value hierarchy. We use an income or market approach for recurring fair value measurements and endeavor to use the best information available. See Item 8. Financial Statements and Supplementary Data – Note 17 for disclosures regarding our fair value measurements.\nSignificant uses of fair value measurements include:\n•\nassessment of impairment of long-lived assets, intangible assets, goodwill and equity method investments;\n•\nrecorded values for assets acquired and liabilities assumed in connection with acquisitions; and\n•\nrecorded values of derivative instruments.\nImpairment Assessments of Long-Lived Assets, Intangible Assets, Goodwill and Equity Method Investments\nFair value calculated for the purpose of testing our long-lived assets, intangible assets, goodwill and equity method investments for impairment is estimated using the expected present value of future cash flows method and comparative market prices when appropriate. Significant judgment is involved in performing these fair value estimates since the results are based on forecasted financial information prepared using significant assumptions including:\n•\nFuture operating performance\n. Our estimates of future operating performance are based on our analysis of various supply and demand factors, which include, among other things, industry-wide capacity, our planned utilization rate, end-user demand, capital expenditures and economic conditions, as well as commodity prices. Such estimates are consistent with those used in our planning and capital investment reviews.\n•\nFuture volumes.\n Our estimates of future refinery, pipeline throughput and natural gas and natural gas liquid processing volumes are based on internal forecasts prepared by our Refining & Marketing and Midstream segments operations personnel. Assumptions about our customers’ drilling activity are inherently subjective and contingent upon a number of variable factors (including future or expected crude oil and natural gas pricing considerations), many of which are \n68\nT\nable\n of Contents\ndifficult to forecast. Management considers these volume forecasts and other factors when developing our forecasted cash flows. \n•\nDiscount rate commensurate with the risks involved\n. We apply a discount rate to our cash flows based on a variety of factors, including market and economic conditions, operational risk, regulatory risk and political risk. This discount rate is also compared to recent observable market transactions, if possible. A higher discount rate decreases the net present value of cash flows.\n•\nFuture capital requirements\n. These are based on authorized spending and internal forecasts.\nAssumptions about the macroeconomic environment are inherently subjective and difficult to forecast. We base our fair value estimates on projected financial information which we believe to be reasonable. However, actual results may differ from these projections.\nThe need to test for impairment can be based on several indicators, including a significant reduction in prices of or demand for products produced, a weakened outlook for profitability, a significant reduction in pipeline throughput volumes, a significant reduction in natural gas or natural gas liquids processed, a significant reduction in refining margins, other changes to contracts or changes in the regulatory environment. The following sections detail our critical accounting estimates related to impairment assessments for long-lived assets, goodwill and equity method investments.\nLong-lived Asset Impairment Assessments\nLong-lived assets used in operations are assessed for impairment whenever changes in facts and circumstances indicate that the carrying value of the assets may not be recoverable based on the expected undiscounted future cash flow of an asset group. For purposes of impairment evaluation, long-lived assets must be grouped at the lowest level for which independent cash flows can be identified, which generally is the refinery and associated distribution system level for Refining & Marketing segment assets, and the plant level or pipeline system level for Midstream segment assets. If the sum of the undiscounted estimated pretax cash flows is less than the carrying value of an asset group, fair value is calculated, and the carrying value is written down to the calculated fair value. \nGoodwill Impairment Assessments\nUnlike long-lived assets, goodwill is subject to annual, or more frequent if necessary, impairment testing at the reporting unit level. A goodwill impairment loss is measured as the amount by which a reporting unit's carrying value exceeds its fair value, without exceeding the recorded amount of goodwill.\nAt December 31, 2024, MPC had four reporting units with goodwill totaling approximately $8.24 billion. The majority of this balance is comprised of the Midstream reporting units, including $1.1 billion for the MPLX Crude Gathering reporting unit and $6.6 billion for the MPLX Transportation & Storage reporting unit. For the annual impairment assessment as of November 30, 2024, management performed only a qualitative assessment for three reporting units as we determined it was more likely than not that the fair value of the reporting units exceeded the carrying value. Significant assumptions used to estimate the reporting units’ fair value under a qualitative approach included estimates of future cash flows and market information for comparable assets. A quantitative assessment was performed for the MPLX Crude Gathering reporting unit, which resulted in the fair value of the reporting unit exceeding its carrying value by greater than 10 percent. The fair value of the reporting unit was determined based on applying both a discounted cash flow method (i.e., income approach) as well as a market approach. An increase of one percentage point to the discount rate used to estimate the fair value of the reporting unit would not have resulted in a goodwill impairment charge as of November 30, 2024. Significant assumptions that were used to estimate the Crude Gathering reporting unit’s fair values under the discounted cash flow method included management’s best estimates of the discount rate, as well as estimates of future cash flows, which are impacted primarily by producers’ development plans, which impact the reporting unit’s future volumes and capital requirements. If estimates for future cash flows were to decline, the overall reporting units’ fair values would decrease, resulting in potential goodwill impairment charges. \nFair value determinations require considerable judgment and are sensitive to changes in underlying assumptions and factors. As a result, there can be no assurance that the estimates and assumptions made for purposes of the impairment tests will prove to be an accurate prediction of the future.\nEquity Method Investment Impairment Assessment\nEquity method investments are assessed for impairment whenever factors indicate an other than temporary loss in value. Factors providing evidence of such a loss include the fair value of an investment that is less than its carrying value, absence of an ability to recover the carrying value or the investee’s inability to generate income sufficient to justify our carrying value. At December 31, 2024, we had $6.86 billion of investments in equity method investments recorded on our consolidated balance sheet. \nSee Item 8. Financial Statements and Supplementary Data – Note 14 for additional information on our equity method investments. See Item 8. Financial Statements and Supplementary Data – Note 16 for additional information on our goodwill and intangibles, including a table summarizing our recorded goodwill by segment. \n69\nT\nable\n of Contents\nDerivatives\nWe record all derivative instruments at fair value. Substantially all of our commodity derivatives are cleared through exchanges which provide active trading information for identical derivatives and do not require any assumptions in arriving at fair value. Fair value estimation for all our derivative instruments is discussed in Item 8. Financial Statements and Supplementary Data – Note 17. Additional information about derivatives and their valuation may be found in Item 7A. Quantitative and Qualitative Disclosures about Market Risk.\nVariable Interest Entities\nWe evaluate all legal entities in which we hold an ownership or other pecuniary interest to determine if the entity is a VIE. Our interests in a VIE are referred to as variable interests. Variable interests can be contractual, ownership or other pecuniary interests in an entity that change with changes in the fair value of the VIE’s assets. When we conclude that we hold an interest in a VIE we must determine if we are the entity’s primary beneficiary. A primary beneficiary is deemed to have a controlling financial interest in a VIE. This controlling financial interest is evidenced by both (a) the power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and (b) the obligation to absorb losses that could potentially be significant to the VIE or the right to receive benefits that could potentially be significant to the VIE. We consolidate any VIE when we determine that we are the primary beneficiary. We must disclose the nature of any interests in a VIE that is not consolidated. \nSignificant judgment is exercised in determining that a legal entity is a VIE and in evaluating our interest in a VIE. We use primarily a qualitative analysis to determine if an entity is a VIE. We evaluate the entity’s need for continuing financial support; the equity holder’s lack of a controlling financial interest; and/or if an equity holder’s voting interests are disproportionate to its obligation to absorb expected losses or receive residual returns. We evaluate our interests in a VIE to determine whether we are the primary beneficiary. We use a primarily qualitative analysis to determine if we are deemed to have a controlling financial interest in the VIE, either on a standalone basis or as part of a related party group. We continually monitor our interests in legal entities for changes in the design or activities of an entity and changes in our interests, including our status as the primary beneficiary to determine if the changes require us to revise our previous conclusions. \nChanges in the design or nature of the activities of a VIE, or our involvement with a VIE, may require us to reconsider our conclusions on the entity’s status as a VIE and/or our status as the primary beneficiary. Such reconsideration requires significant judgment and understanding of the organization. This could result in the deconsolidation or consolidation of the affected subsidiary, which would have a significant impact on our financial statements. \nVariable Interest Entities are discussed in Item 8. Financial Statements and Supplementary Data – Note 6.\nPension and Other Postretirement Benefit Obligations\nAccounting for pension and other postretirement benefit obligations involves numerous assumptions, the most significant of which relate to the following:\n•\nthe discount rate for measuring the present value of future plan obligations;\n•\nthe expected long-term return on plan assets;\n•\nthe rate of future increases in compensation levels; \n•\nhealth care cost projections; and\n•\nthe mortality table used in determining future plan obligations.\nWe utilize the work of third-party actuaries to assist in the measurement of these obligations. We have selected different discount rates for each of our pension plans and retiree health and welfare based on the projected benefit payment patterns of each individual plan. The selected rates are compared to various similar bond indexes for reasonableness. In determining the assumed discount rates, we use our third-party actuaries’ discount rate models. These models calculate an equivalent single discount rate for the projected benefit plan cash flows using yield curves derived from Aa or higher corporate bond yields. The yield curves represent a series of annualized individual spot discount rates from 0.5 to 99 years. The bonds used have an average rating of Aa or higher from a recognized rating agency and generally only non-callable bonds are included. Outlier bonds that have a yield to maturity that deviate significantly from the average yield within each maturity grouping are not included. Each issue is required to have at least $300 million par value outstanding.\nOf the assumptions used to measure the year-end obligations and estimated annual net periodic benefit cost, the discount rate has the most significant effect on the periodic benefit cost reported for the plans. Decreasing the discount rates of 5.65 percent for our pension plans and 5.50 percent for our other postretirement benefit plans by 0.25 percent would increase pension obligations and other postretirement benefit plan obligations by $73 million and $16 million, respectively, and would increase defined benefit pension expense and other postretirement benefit plan expense by $10 million and less than $1 million, respectively.\nThe long-term asset rate of return assumption considers the asset mix of the plans (currently targeted at approximately 50 percent equity securities and 50 percent fixed income securities for the primary funded pension plan), past performance and other factors. Certain components of the asset mix are modeled with various assumptions regarding inflation and returns. In addition, our long-term asset rate of return assumption is compared to those of other companies and to historical returns for \n70\nT\nable\n of Contents\nreasonableness. We used the 6.80 percent long-term rate of return to determine our 2024 defined benefit pension expense. After evaluating activity in the capital markets, along with the current and projected plan investments, we increased the asset rate of return for our primary plan to 7.10 percent effective for 2025. Decreasing the 7.10 percent asset rate of return assumption by 0.25 percentage points would increase our defined benefit pension expense by $5 million.\nCompensation change assumptions are based on historical experience, anticipated future management actions and demographics of the benefit plans.\nHealth care cost trend assumptions are developed based on historical cost data, the near-term outlook and an assessment of likely long-term trends.\nWe utilized the 2021 mortality tables from the U.S. Society of Actuaries.",
  "item2": null
}