{
  "item1": "Canton refinery located south Cleveland, Ohio. Canton refinery processes sweet sour crude oils, including production nearby Utica Shale, into gasoline, distillates, asphalt, propane, NGLs petrochemicals heavy fuel oil. Canton refinery earned designation OSHA VPP Star site. Mandan, North Dakota Refinery (71 mbpcd) Mandan refinery located outside Bismarck, North Dakota.",
  "item7": "MPLX Baa2 (stable outlook) BBB (stable outlook) BBB (stable outlook) ratings reflect respective views rating agencies should not interpreted recommendation buy, sell hold MPLX securities. Although intention maintain credit profile supports investment-grade rating MPLX, there no assurance these ratings will continue any given period time. ratings may revised withdrawn entirely rating agencies if, respective judgments, circumstances so warrant. rating one rating agency should evaluated independently ratings other rating agencies.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations DISCLOSURES REGARDING FORWARD-LOOKING STATEMENTS Forward-looking statements include, among other things, statements regarding: future financial operating results; environmental, social governance (“ESG”) plans goals, including those related greenhouse gas emissions intensity, freshwater withdraw intensity, inclusion ESG reporting; future levels capital, environmental maintenance expenditures, general administrative other expenses; success timing completion ongoing anticipated capital maintenance projects; business strategies, growth opportunities expected investments, including plans improve commercial performance, lower costs optimize asset portfolio; consumer demand refined products, natural gas, renewable diesel other renewable fuels NGLs; timing, amount form any future capital return transactions, including dividends share repurchases MPC distributions unit repurchases MPLX; anticipated effects actions third parties such competitors, activist investors, federal, foreign, state local regulatory authorities, plaintiffs litigation. forward-looking statements not guarantees future performance, should not rely unduly them, they involve risks, uncertainties assumptions cannot predict. Forward-looking other statements regarding ESG plans goals not indication these statements material investors required disclosed filings SEC."
}