{
  "source_file": "mpc-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis section should also be read in conjunction with the unaudited consolidated financial statements and accompanying footnotes included under Item 1. Financial Statements and in conjunction with our Annual Report on Form 10-K for the year ended December 31, 2024.\nDISCLOSURES REGARDING FORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q, particularly Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations and Item 3. Quantitative and Qualitative Disclosures about Market Risk, includes forward-looking statements that are subject to risks, contingencies or uncertainties. You can identify forward-looking statements by words such as “anticipate,” “believe,” “commitment,” “could,” “design,” “estimate,” “expect,” “focus,” “forecast,” “goal,” “guidance,” “intend,” “may,” “objective,” “opportunity,” “outlook,” “plan,” “policy,” “position,” “potential,” “predict,” “priority,” “project,” “prospective,” “pursue,” “seek,” “should,” “strategy,” “target,” “will,” “would” or other similar expressions that convey the uncertainty of future events or outcomes.\nForward-looking statements include, among other things, statements regarding: \n•\nfuture financial and operating results; \n•\nenvironmental, social and governance (“ESG”) plans and goals, including those related to greenhouse gas emissions and intensity, freshwater withdraw intensity, inclusion and ESG reporting;\n•\nfuture levels of capital, environmental or maintenance expenditures, general and administrative and other expenses; \n•\nthe success or timing of completion of ongoing or anticipated capital or maintenance projects; \n•\nbusiness strategies, growth opportunities and expected investments, including plans to improve commercial performance, lower costs and optimize our asset portfolio; \n•\nconsumer demand for refined products, natural gas, renewable diesel and other renewable fuels and NGLs; \n•\nthe timing, amount and form of any future capital return transactions, including dividends and share repurchases by MPC or distributions and unit repurchases by MPLX; and\n•\nthe anticipated effects of actions of third parties such as competitors, activist investors, federal, foreign, state or local regulatory authorities, or plaintiffs in litigation. \nOur forward-looking statements are not guarantees of future performance, and you should not rely unduly on them, as they involve risks, uncertainties and assumptions that we cannot predict. Forward-looking and other statements regarding our ESG plans and goals are not an indication that these statements are material to investors or required to be disclosed in our filings with the SEC. In addition, historical, current, and forward-looking ESG-related statements may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve, and assumptions that are subject to change in the future. Material differences between actual results and any future performance suggested in our forward-looking statements could result from a variety of factors, including the following:\n•\ngeneral economic, political or regulatory developments, including the federal government shutdown, tariffs, inflation, interest rates, changes in governmental policies relating to refined petroleum products, crude oil, natural gas, NGLs or renewable diesel and other renewable fuels, or taxation, including changes in tax regulations or guidance promulgated pursuant to the new legislation implemented in the One Big Beautiful Bill Act;\n•\nthe regional, national and worldwide availability and pricing of refined products, crude oil, natural gas, renewable diesel and other renewable fuels, NGLs and other feedstocks;\n•\ndisruptions in credit markets or changes to credit ratings;\n•\nthe adequacy of capital resources and liquidity, including availability, timing and amounts of free cash flow necessary to execute business plans and to effect any share repurchases or to maintain or increase the dividend;\n•\nthe potential effects of judicial or other proceedings on our business, financial condition, results of operations and cash flows;\n•\nthe timing and extent of changes in commodity prices and demand for crude oil, refined products, feedstocks or other hydrocarbon-based products or renewable diesel and other renewable fuels;\n•\nvolatility in or degradation of general economic, market, industry or business conditions, including as a result of pandemics, other infectious disease outbreaks, natural hazards, extreme weather events, regional conflicts such as hostilities in the Middle East and in Ukraine, tariffs, inflation, or rising interest rates;\n•\nour ability to comply with federal and state environmental, economic, health and safety, energy and other policies and regulations and enforcement actions initiated thereunder;\n•\nadverse market conditions or other risks affecting MPLX;\n•\nrefining industry overcapacity or under capacity;\n•\nforeign imports and exports of crude oil, refined products, natural gas and NGLs;\n•\nthe establishment or increase of tariffs on goods, including crude oil and other feedstocks imported into the United States, other trade protection measures or restrictions or retaliatory actions from foreign governments;\n31\nTable of Contents\n•\nchanges in producer customers’ drilling plans or in volumes of throughput of crude oil, natural gas, NGLs, refined products, other hydrocarbon-based products or renewable diesel and other renewable fuels;\n•\nnon-payment or non-performance by our customers;\n•\nchanges in the cost or availability of third-party vessels, pipelines, railcars and other means of transportation for crude oil, natural gas, NGLs, feedstocks, refined products and renewable diesel and other renewable fuels;\n•\nthe price, availability and acceptance of alternative fuels and alternative-fuel vehicles and laws mandating such fuels or vehicles;\n•\npolitical and economic conditions in nations that consume refined products, natural gas, renewable diesel and other renewable fuels and NGLs, including the United States and Mexico, and in crude oil producing regions, including the Middle East, Russia, Africa, Canada and South America;\n•\nactions taken by our competitors, including pricing adjustments, the expansion and retirement of refining capacity and the expansion and retirement of pipeline capacity, processing, fractionation and treating facilities in response to market conditions;\n•\ncompletion of pipeline projects within the United States;\n•\nchanges in fuel and utility costs for our facilities;\n•\nindustrial incidents or other unscheduled shutdowns affecting our refineries, machinery, pipelines, processing, fractionation and treating facilities or equipment, means of transportation, or those of our suppliers or customers;\n•\nacts of war, terrorism or civil unrest that could impair our ability to produce refined products, receive feedstocks or to gather, process, fractionate or transport crude oil, natural gas, NGLs, refined products or renewable diesel and other renewable fuels;\n•\npolitical pressure and influence of environmental groups and other stakeholders that are adverse to the production, gathering, refining, processing, fractionation, transportation and marketing of crude oil or other feedstocks, refined products, natural gas, NGLs, other hydrocarbon-based products or renewable diesel and other renewable fuels;\n•\nlabor and material shortages; \n•\nthe timing and ability to obtain necessary regulatory approvals and permits and to satisfy other conditions necessary to complete planned projects or to consummate planned transactions within the expected timeframe, if at all;\n•\nthe inability or failure of our joint venture partners to fund their share of operations and capital investments;\n•\nthe financing and distribution decisions of joint ventures we do not control;\n•\nthe availability of desirable strategic alternatives to optimize portfolio assets and the ability to obtain regulatory and other approvals with respect thereto, including MPLX’s ability to successfully divest its Rockies gathering and processing operations (the “Rockies”);\n•\nour ability to successfully implement our sustainable energy strategy and principles and achieve our ESG goals and targets within the expected timeframe, if at all; \n•\nthe costs, disruption and diversion of management’s attention associated with campaigns commenced by activist investors;\n•\npersonnel changes; and\n•\nthe imposition of windfall profit taxes, maximum margin penalties, minimum inventory requirements or refinery maintenance and turnaround supply plans on companies operating in the energy industry in California or other jurisdictions.\nFor additional risk factors affecting our business, see the risk factors described in our Annual Report on Form 10-K for the year ended December 31, 2024. We undertake no obligation to update any forward-looking statements except to the extent required by applicable law.\nEXECUTIVE SUMMARY\nBusiness Update\nOur Refining & Marketing segment results for the third quarter of 2025 versus the third quarter of 2024 reflect higher realized refining margins supported by stable demand and by gasoline and distillate inventory levels in the U.S. that were at or below five-year averages during the quarter. Longer term, global demand growth is expected to outpace the net impact of refining capacity additions and rationalizations through the end of the decade. We anticipate these fundamentals, as well as the U.S. refining industry’s current structural advantages over the rest of the world, will support a constructive environment for U.S. refiners.\nOur Midstream segment contributed strong results and continued growth in the third quarter of 2025, benefitting from the expansion of its Permian to Gulf Coast natural gas and NGL value chains with the acquisition of Northwind Delaware Holdings LLC and BANGL, LLC and progression of long-haul pipeline growth projects. We believe our Midstream business is well positioned and has significant opportunities to support the development plans of its producer customers.\n32\nTable of Contents\nStrategic Updates\nMidstream Transactions\nNorthwind Midstream Acquisition\nOn August 29, 2025, MPLX completed the $2.4 billion acquisition of Northwind Delaware Holdings LLC (the “Northwind Midstream Acquisition”), which provides sour gas gathering and treating services in Lea County, New Mexico, enhancing MPLX’s Permian natural gas and NGL value chain. The Northwind Midstream Acquisition provides optionality to direct volumes through our integrated system to accelerate growth opportunities in the Permian. The Northwind Midstream Acquisition was financed, and the incremental capital expenditures associated with in-process expansion projects will be funded, with the net proceeds from MPLX's $4.5 billion senior notes issued in August 2025.\nSee Note 4 to the unaudited consolidated financial statements for additional information on this transaction.\nAnnounced Divestiture of Rockies Operations\nOn August 26, 2025, MPLX entered into a definitive agreement to divest its Rockies operations to a subsidiary of Harvest Midstream (“Harvest”) for $1.0 billion in cash, subject to customary purchase price adjustments. \nThe assets and liabilities to be sold as part of this transaction are shown on the consolidated balance sheet as assets held for sale and liabilities held for sale, respectively, as of September 30, 2025. The Rockies operations are currently reported within the Midstream segment. \nThe transaction is expected to close in the fourth quarter of 2025, subject to customary closing conditions, and is expected to result in an estimated gain in excess of $150 million upon closing.\nSee Note 4 to the unaudited consolidated financial statements for additional information on the Northwind Midstream Acquisition.\nBANGL, LLC Acquisition\nOn July 1, 2025, MPLX purchased the remaining 55 percent interest in BANGL, LLC (“BANGL”) for approximately $703 million in cash, plus an earnout provision of up to $275 million based on targeted EBITDA growth from 2026 to 2029 (the “BANGL Acquisition”). As a result of the BANGL Acquisition, MPLX now owns 100 percent of BANGL and its results are reflected in our Midstream segment within our consolidated financial results. The BANGL Acquisition was accounted for as a business combination, resulting in the recognition of a $484 million gain.\nSee Note 4 to the unaudited consolidated financial statements for additional information on the BANGL Acquisition.\nWhiptail Midstream Acquisition\nOn March 11, 2025, MPLX acquired gathering businesses from Whiptail Midstream, LLC for $237 million in cash. These San Juan basin assets consist primarily of crude and natural gas gathering systems in the Four Corners region. The acquisition was accounted for as a business combination, which requires all the identifiable assets acquired and liabilities assumed to be remeasured to fair value at the date of acquisition. The preliminary determination of the fair value includes $172 million of property, plant and equipment, $41 million of intangibles and $24 million of net working capital. The preliminary values are subject to revision and may result in adjustments as valuations are finalized.\nSee Note 4 to the unaudited consolidated financial statements for additional information on this transaction.\nSale of Interest in Ethanol Joint Venture\nOn July 31, 2025, MPC sold its 49.9 percent interest in The Andersons Marathon Holdings LLC (“TAMH”) to The Andersons Ethanol LLC (the “Ethanol Joint Venture Sale”), in exchange for cash proceeds of $427 million. MPC’s investment in TAMH was accounted for as an equity method investment reported within the Refining & Marketing segment. In the third quarter of 2025, MPC recognized a gain of $254 million resulting from the derecognition of its investment in TAMH upon disposal.\nResults\nOur CODM evaluates the performance of our segments using segment adjusted EBITDA. Amounts included in income before income taxes and excluded from segment adjusted EBITDA include: (i) depreciation and amortization; (ii) net interest and other financial costs; (iii) turnaround expenses; and (iv) other adjustments as deemed necessary. These items are either: (i) believed to be non-recurring in nature; (ii) not believed to be allocable or controlled by the segment; or (iii) are not tied to the operational performance of the segment.\n33\nTable of Contents\nSelect results are reflected in the following table. \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\n2025\n2024\nSegment adjusted EBITDA for reportable segments\nRefining & Marketing\n$\n1,762 \n$\n1,136 \n$\n4,141 \n$\n5,144 \nMidstream\n1,709 \n1,628 \n5,070 \n4,837 \nRenewable Diesel\n(56)\n(61)\n(117)\n(178)\nTotal reportable segments\n$\n3,415 \n$\n2,703 \n$\n9,094 \n$\n9,803 \nReconciliation of segment adjusted EBITDA for reportable segments to income before income taxes\nTotal reportable segments\n$\n3,415 \n$\n2,703 \n$\n9,094 \n$\n9,803 \nCorporate\n(209)\n(196)\n(627)\n(600)\nRefining & Renewable Diesel planned turnaround costs\n(401)\n(290)\n(1,141)\n(1,121)\nRenewable Diesel JV planned turnaround costs\n(a)\n(3)\n— \n(13)\n— \nGain on sale of assets\n(b)\n738 \n— \n738 \n151 \nSRE\n57 \n— \n57 \n— \nTransaction-related costs\n(21)\n— \n(21)\n— \nDepreciation and amortization\n(841)\n(846)\n(2,423)\n(2,511)\nRenewable Diesel JV depreciation and amortization\n(a)\n(22)\n(22)\n(67)\n(67)\nNet interest and other financial costs\n(310)\n(221)\n(933)\n(594)\nIncome before income taxes\n$\n2,403 \n$\n1,128 \n$\n4,664 \n$\n5,061 \nNet income attributable to MPC per diluted share\n$\n4.51 \n$\n1.87 \n$\n8.15 \n$\n8.83 \n(a)    \nRepresents MPC’s pro-rata share of expenses from joint ventures included within the Renewable Diesel segment.\n(b)    \nThe three and nine months ended September 30, 2025 include gains from the BANGL Acquisition and the Ethanol Joint Venture Sale. The first nine months of 2024 includes the gain from the Whistler Joint Venture Transaction. See Note 4 to the unaudited consolidated financial statements for additional information.\nNet income attributable to MPC was $1.37 billion, or $4.51 per diluted share, for the third quarter of 2025 compared to $622 million, or $1.87 per diluted share, for the third quarter of 2024 and $2.51 billion, or $8.15 per diluted share, in the first nine months of 2025 compared to $3.07 billion, or $8.83 per diluted share, in the first nine months of 2024. \nRefer to the Results of Operations section for a discussion of consolidated financial results and Segment Results for the third quarter of 2025 as compared to the third quarter of 2024 and the first nine months of 2025 compared to the first nine months of 2024.\nMPLX\nWe owned approximately 647 million MPLX common units as of September 30, 2025, with a market value of $32.34 billion based on the September 30, 2025 closing price of $49.95 per common unit. On October 28, 2025, MPLX declared a quarterly cash distribution of $1.0765 per common unit, payable on November 14, 2025 to unitholders of record on November 7, 2025. MPC’s portion of this distribution is approximately $697 million. \nWe received limited partner distributions of $1.86 billion from MPLX in the nine months ended September 30, 2025 and $1.65 billion in the nine months ended September 30, 2024. \nDuring the nine months ended September 30, 2025, MPLX repurchased approximately 6 million MPLX common units at an average cost per unit of $51.20 and paid $300 million of cash for the repurchased common units. As of September 30, 2025, approximately $1.22 billion remained available under authorizations for future unit repurchases.\nSee Note 3 to the unaudited consolidated financial statements for additional information on MPLX.\n34\nTable of Contents\nOVERVIEW OF SEGMENTS\nRefining & Marketing\nRefining & Marketing segment adjusted EBITDA depends largely on our refinery throughputs, Refining & Marketing margin, refining operating costs and distribution costs.\nRefining & Marketing margin is the difference between the prices of refined products sold and the costs of crude oil and other charge and blendstocks refined, including the costs to transport these inputs to our refineries and the costs of products purchased for resale. The crack spread is a measure of the difference between market prices for refined products and crude oil, commonly used by the industry as a proxy for the refining margin. Crack spreads can fluctuate significantly, particularly when prices of refined products do not move in the same relationship as the cost of crude oil. As a performance benchmark and a comparison with other industry participants, we calculate Gulf Coast, Mid-Continent and West Coast crack spreads that we believe most closely track our operations and slate of products. The following are used for these crack spread calculations:\n•\nThe Gulf Coast crack spread uses three barrels of MEH crude producing two barrels of USGC CBOB gasoline and one barrel of USGC ULSD;\n•\nThe Mid-Continent crack spread uses three barrels of WTI crude producing two barrels of Chicago CBOB gasoline and one barrel of Chicago ULSD; and\n•\nThe West Coast crack spread uses three barrels of ANS crude producing two barrels of LA CARBOB and one barrel of LA CARB diesel.\nOur refineries can process a variety of sweet and sour crude oil, which typically can be purchased at a discount to crude oil referenced in our Gulf Coast, Mid-Continent and West Coast crack spreads. The amount of these discounts, which we refer to as the sweet differential and the sour differential, can vary significantly, causing our Refining & Marketing margin to differ from blended crack spreads. In general, larger sweet and sour differentials will enhance our Refining & Marketing margin.\nFuture crude oil differentials will be dependent on a variety of market and economic factors, as well as U.S. energy policy.\nThe following table provides sensitivities showing an estimated change in annual Refining & Marketing segment adjusted EBITDA due to potential changes in market conditions. \n(Millions of dollars)\n \nBlended crack spread sensitivity\n(a) \n(per $1.00/barrel change)\n$\n1,100 \nSour differential sensitivity\n(b)\n \n(per $1.00/barrel change)\n515 \nSweet differential sensitivity\n(c)\n \n(per $1.00/barrel change)\n515 \nNatural gas price sensitivity\n(d)\n \n(per $1.00/MMBtu)\n350 \n(a)\nCrack spread based on 42 percent MEH, 40 percent WTI and 18 percent ANS with Gulf Coast, Mid-Continent and West Coast product pricing, respectively, and assumes all other differentials and pricing relationships remain unchanged.\n(b)\nSour crude oil basket consists of the following crudes: ANS, Argus Sour Crude Index, Maya and Western Canadian Select. We assume approximately 50 percent of the crude processed at our refineries in 2025 will be sour crude.\n(c)\nSweet crude oil basket consists of the following crudes: Bakken, Brent, MEH, WTI-Cushing and WTI-Midland. We assume approximately 50 percent of the crude processed at our refineries in 2025 will be sweet crude.\n(d)\nThis is consumption-based exposure for our Refining & Marketing segment and does not include the sales exposure for our Midstream segment.\nIn addition to the market changes indicated by the crack spreads, the sour differential and the sweet differential, our Refining & Marketing margin is impacted by factors such as:\n•\nthe selling prices realized for refined products;\n•\nthe types of crude oil and other charge and blendstocks processed;\n•\nour refinery yields;\n•\nthe cost of products purchased for resale;\n•\nthe impact of commodity derivative instruments used to hedge price risk;\n•\nthe potential impact of lower of cost or market adjustments to inventories in periods of declining prices;\n•\nthe potential impact of LIFO adjustments due to changes in historic inventory levels; and\n•\nthe cost of purchasing RINs in the open market to comply with RFS requirements.\nRefining & Marketing segment adjusted EBITDA is also affected by changes in refining operating costs in addition to committed distribution costs. Changes in operating costs are primarily driven by the cost of energy used by our refineries, including purchased natural gas, and the level of maintenance costs. Distribution costs primarily include long-term agreements with MPLX, which as discussed below include minimum commitments to MPLX, and will negatively impact segment adjusted EBITDA in periods when throughput or sales are lower or refineries are idled.\n35\nTable of Contents\nWe have various long-term, fee-based commercial agreements with MPLX. Under these agreements, MPLX, which is reported in our Midstream segment, provides transportation, storage, distribution and marketing services to our Refining & Marketing segment. Certain of these agreements include commitments for minimum quarterly throughput and distribution volumes of crude oil and refined products and minimum storage volumes of crude oil, refined products and other products. Certain other agreements include commitments to pay for 100 percent of available capacity for certain marine transportation and refining logistics assets. \nMidstream\n \nOur Midstream segment gathers, transports, stores and distributes crude oil, refined products, including renewable diesel, and other hydrocarbon-based products, principally for our Refining & Marketing segment. Additionally, the segment markets refined products. The profitability of our pipeline transportation operations primarily depends on tariff rates and the volumes shipped through the pipelines. The profitability of our marine operations primarily depends on the quantity and availability of our vessels and barges. The profitability of our light product terminal operations primarily depends on the throughput volumes at these terminals. The profitability of our fuels distribution services primarily depends on the sales volumes of certain refined products. The profitability of our refining logistics operations depends on the quantity and availability of our refining logistics assets. A majority of the crude oil and refined product shipments on our pipelines and marine vessels and the refined product throughput at our terminals serve our Refining & Marketing segment and our refining logistics assets and fuels distribution services are used solely by our Refining & Marketing segment. As discussed above in the Refining & Marketing section, MPLX, which is reported in our Midstream segment, has various long-term, fee-based commercial agreements related to services provided to our Refining & Marketing segment. Under these agreements, MPLX has received various commitments of minimum throughput, storage and distribution volumes as well as commitments to pay for all available capacity of certain assets. The volume of crude oil that we transport is directly affected by the supply of, and refiner demand for, crude oil in the markets served directly by our crude oil pipelines, terminals and marine operations. Key factors in this supply and demand balance are the production levels of crude oil by producers in various regions or fields, the availability and cost of alternative modes of transportation, the volumes of crude oil processed at refineries and refinery and transportation system maintenance levels. The volume of refined products that we transport, store, distribute and market is directly affected by the production levels of, and user demand for, refined products in the markets served by our refined product pipelines and marine operations. In most of our markets, demand for gasoline and distillate peaks during the summer driving season, which extends from May through September of each year, and declines during the fall and winter months. As with crude oil, other transportation alternatives and system maintenance levels influence refined product movements. \nOur Midstream segment also gathers, processes and transports natural gas and transports, fractionates, stores and markets NGLs. NGL and natural gas prices are volatile and are impacted by changes in fundamental supply and demand, as well as market uncertainty, availability of NGL transportation and fractionation capacity and a variety of additional factors that are beyond our control. Our Midstream segment profitability is affected by prevailing commodity prices primarily as a result of processing or conditioning at our own or third‑party processing plants, purchasing and selling or gathering and transporting volumes of natural gas at index‑related prices and the cost of third‑party transportation and fractionation services. To the extent that commodity prices influence the level of natural gas drilling by our producer customers, such prices also affect profitability.\nRenewable Diesel\nOur Renewable Diesel segment processes renewable feedstocks into renewable diesel, markets and distributes renewable diesel and includes joint ventures that produce soybean oil and renewable diesel.\nOur Renewable Diesel segment adjusted EBITDA is affected by changes in operating costs, distribution costs, throughput and certain regulatory credits. \n36\nTable of Contents\nRESULTS OF OPERATIONS\nThe following discussion includes comments and analysis relating to our results of operations. This discussion should be read in conjunction with Item 1. Financial Statements and is intended to provide investors with a reasonable basis for assessing our historical operations, but should not serve as the only criteria for predicting our future performance. \nConsolidated Results of Operations\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\nVariance\n2025\n2024\nVariance\nRevenues and other income:\nSales and other operating revenues\n$\n34,809 \n$\n35,107 \n$\n(298)\n$\n100,125 \n$\n105,727 \n$\n(5,602)\nIncome from equity method investments\n976 \n219 \n757 \n1,418 \n796 \n622 \nNet gain (loss) on disposal of assets\n(2)\n(2)\n— \n4 \n17 \n(13)\nOther income\n66 \n49 \n17 \n253 \n406 \n(153)\nTotal revenues and other income\n35,849 \n35,373 \n476 \n101,800 \n106,946 \n(5,146)\nCosts and expenses:\nCost of revenues (excludes items below)\n31,200 \n32,144 \n(944)\n90,585 \n95,682 \n(5,097)\nDepreciation and amortization\n841 \n846 \n(5)\n2,423 \n2,511 \n(88)\nSelling, general and administrative expenses\n863 \n815 \n48 \n2,513 \n2,417 \n96 \nOther taxes\n232 \n219 \n13 \n682 \n681 \n1 \nTotal costs and expenses\n33,136 \n34,024 \n(888)\n96,203 \n101,291 \n(5,088)\nIncome from operations\n2,713 \n1,349 \n1,364 \n5,597 \n5,655 \n(58)\nNet interest and other financial costs\n310 \n221 \n89 \n933 \n594 \n339 \nIncome before income taxes\n2,403 \n1,128 \n1,275 \n4,664 \n5,061 \n(397)\nProvision for income taxes\n460 \n113 \n347 \n765 \n779 \n(14)\nNet income\n1,943 \n1,015 \n928 \n3,899 \n4,282 \n(383)\nLess net income attributable to:\nRedeemable noncontrolling interest\n— \n6 \n(6)\n— \n21 \n(21)\nNoncontrolling interests\n573 \n387 \n186 \n1,387 \n1,187 \n200 \nNet income attributable to MPC\n$\n1,370 \n$\n622 \n$\n748 \n$\n2,512 \n$\n3,074 \n$\n(562)\nThird Quarter 2025 Compared to Third Quarter 2024\nNet income attributable to MPC increased $748 million in the third quarter of 2025 compared to the third quarter of 2024 primarily due to the following:\nRevenues and other income increased $476 million primarily due to:\n•\ndecreased sales and other operating revenues of $298 million mainly due to a decrease in Refining & Marketing segment average refined product sales prices of $0.11 per gallon, partially offset by increased refined product sales volumes of 139 mbpd; and\n•\nincreased income from equity method investments of $757 million largely due to gains from the BANGL Acquisition of $484 million and the Ethanol Joint Venture Sale of $254 million.\nCosts and expenses decreased $888 million primarily due to:\n•\ndecreased cost of revenues of $944 million mainly due to lower crude oil costs; and\n•\nincreased selling, general and administrative expenses of $48 million primarily due to quarterly fair-value remeasurement of outstanding performance-based stock compensation of $41 million and increased contract services costs of $24 million, partially offset by decreased office expenses of $24 million.\nNet interest and other financial costs increased $89 million largely due to decreased interest income and discount amortization, primarily due to the liquidation of short-term investments that were held in the third quarter of 2024, and increased non-service pension costs.\n37\nTable of Contents\nWe recorded combined federal, state and foreign income tax provisions of $460 million and $113 million for the three months ended September 30, 2025 and 2024, respectively, which were lower than the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests, partially offset by state taxes.\nNet income attributable to noncontrolling interests increased $186 million mainly due to an increase in MPLX’s net income in the third quarter of 2025. See further discussion in the Midstream Segment Results section.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024 \nNet income attributable to MPC decreased $562 million in the first nine months of 2025 compared to the first nine months of 2024 primarily due to the following:\nRevenues and other income decreased $5.15 billion primarily due to:\n•\ndecreased sales and other operating revenues of $5.60 billion mainly due to a decrease in Refining & Marketing segment average refined product sales prices of $0.22 per gallon, partially offset by increased refined product sales volumes of 158 mbpd;\n•\nincreased income from equity method investments of $622 million largely due to gains from the BANGL Acquisition of $484 million and the Ethanol Joint Venture Sale of $254 million, partially offset by the absence of the gain on sale of assets resulting from the Whistler Joint Venture Transaction in the first nine months of 2024; and\n•\ndecreased other income of $153 million mainly due to the absence of insurance proceeds in the first nine months of 2024.\nCosts and expenses decreased $5.09 billion primarily due to:\n•\ndecreased cost of revenues of $5.10 billion mainly due to lower crude oil costs; \n•\ndecreased depreciation and amortization of $88 million largely due to major refining assets that were fully depreciated at the end of 2024, partially offset by depreciation from recent acquisitions; and\n•\nincreased selling, general and administrative expenses of $96 million largely due to increases in salaries and employee related expenses of $64 million, contract services costs of $46 million and quarterly fair-value remeasurement of outstanding performance-based stock compensation of $20 million, partially offset by the absence of $30 million of expense in the first nine months of 2024 related to decommissioning of non-operating assets.\nNet interest and other financial costs increased $339 million largely due to decreased interest income and discount amortization, primarily due to the liquidation of short-term investments that were held in the first nine months of 2024, and increased non-service pension costs and interest expense, primarily due to increased MPLX borrowings.\nWe recorded combined federal, state and foreign income tax provisions of $765 million and $779 million for the nine months ended September 30, 2025 and 2024, respectively, which were lower than the U.S. statutory rate primarily due to permanent tax benefits related to net income attributable to noncontrolling interests, partially offset by state taxes.\nNet income attributable to noncontrolling interests increased $200 million mainly due to an increase in MPLX’s net income in the first nine months of 2025. See further discussion in the Midstream Segment Results section.\nSegment Results\nWe classify our business in the following reportable segments: Refining & Marketing, Midstream and Renewable Diesel. Segment adjusted EBITDA represents adjusted EBITDA attributable to the reportable segments. Amounts included in income before income taxes and excluded from segment adjusted EBITDA include: (i) depreciation and amortization; (ii) net interest and other financial costs; (iii) turnaround expenses; and (iv) other adjustments as deemed necessary. These items are either: (i) believed to be non-recurring in nature; (ii) not believed to be allocable or controlled by the segment or (iii) are not tied to the operational performance of the segment.\nOur segment adjusted EBITDA for reportable segments was $9.09 billion and $9.80 billion for the nine months ended September 30, 2025 and 2024, respectively. \n38\nTable of Contents\nRefining & Marketing\nThe following includes key financial and operating data for the third quarter of 2025 compared to the third quarter of 2024 and the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\n(a)\nIncludes intersegment sales to the Midstream segment and sales destined for export. \n39\nTable of Contents\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nRefining & Marketing Operating Statistics\nNet refinery throughput \n(mbpd\n)\n3,005 \n2,980 \n2,972 \n2,896 \nRefining & Marketing margin per barrel\n(a)(b)\n$\n17.60 \n$\n14.63 \n$\n16.26 \n$\n17.08 \nLess:\nRefining operating costs per barrel\n(c)\n5.59 \n5.23 \n5.55 \n5.37 \nDistribution costs per barrel\n(d)\n5.69 \n5.38 \n5.66 \n5.52 \nOther income per barrel\n(e)\n(0.05)\n(0.13)\n(0.05)\n(0.30)\nRefining & Marketing segment adjusted EBITDA per barrel\n$\n6.37 \n$\n4.15 \n$\n5.10 \n$\n6.49 \nRefining planned turnaround costs per barrel\n$\n1.45 \n$\n1.05 \n$\n1.36 \n$\n1.41 \nDepreciation and amortization per barrel\n1.54 \n1.64 \n1.52 \n1.70 \nPer barrel fees paid to MPLX included in distribution costs above\n3.67 \n3.66 \n$\n3.70 \n$\n3.73 \n(a)\nSales revenue less cost of refinery inputs and purchased products, divided by net refinery throughput.\n(b)\nSee “Non-GAAP Financial Measures” section for reconciliation and further information regarding this non-GAAP financial measure.\n(c)\nRefining operating costs exclude planned turnaround and depreciation and amortization expense.\n(d)\nDistribution costs exclude depreciation and amortization expense.\n(e)\nIncludes income or loss from equity method investments, net gain or loss on disposal of assets and other income or loss.\nThe following information presents certain benchmark prices in our marketing areas and market indicators that we believe are helpful in understanding the results of our Refining & Marketing segment. The benchmark crack spreads below do not reflect the market cost of RINs necessary to meet EPA renewable volume obligations for attributable products under the Renewable Fuel Standard.\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nBenchmark Spot Prices \n(dollars per gallon)\nChicago CBOB unleaded regular gasoline\n$\n2.02 \n$\n2.20 \n$\n2.00 \n$\n2.23 \nChicago ULSD\n2.33 \n2.30 \n2.17 \n2.39 \nUSGC CBOB unleaded regular gasoline\n1.96 \n2.11 \n1.96 \n2.21 \nUSGC ULSD\n2.28 \n2.24 \n2.22 \n2.43 \nLA CARBOB\n2.36 \n2.36 \n2.36 \n2.56 \nLA CARB diesel\n2.48 \n2.30 \n2.36 \n2.50 \nMarket Indicators \n(dollars per barrel)\nWTI\n$\n64.97 \n$\n75.27 \n$\n66.65 \n$\n77.61 \nMEH\n66.08 \n76.52 \n67.80 \n79.24 \nANS\n70.10 \n79.00 \n71.61 \n82.32 \nCrack Spreads:\nMid-Continent WTI 3-2-1\n$\n18.19 \n$\n15.62 \n$\n14.45 \n$\n15.92 \nUSGC MEH 3-2-1\n14.28 \n10.14 \n12.41 \n13.12 \nWest Coast ANS 3-2-1\n24.37 \n15.32 \n21.82 \n20.91 \nBlended 3-2-1\n(a)\n17.66 \n13.27 \n14.92 \n15.69 \nCrude Oil Differentials:\nSweet\n$\n(0.61)\n$\n(1.19)\n$\n(0.72)\n$\n(1.33)\nSour\n(2.37)\n(3.92)\n(2.61)\n(4.56)\n(a)\n    Blended 3-2-1 Mid-Continent/USGC/West Coast crack spread is 40/42/18 percent effective April 1, 2024 and 40/40/20 percent for prior periods. \n40\nTable of Contents\nThird Quarter 2025 Compared to Third Quarter 2024 \nRefining & Marketing segment revenues decreased $687 million primarily due to a decrease in average refined product sales prices of $0.11 per gallon, partially offset by increased refined product sales volumes of 139 mbpd.\nRefining & Marketing segment adjusted EBITDA increased $626 million mainly due to increased per barrel margins, partially offset by increased refining operating and distribution costs, both excluding depreciation and amortization. Refining & Marketing segment adjusted EBITDA was $6.37 per barrel for the third quarter of 2025, versus $4.15 per barrel for the third quarter of 2024.\nRefining & Marketing margin was $17.60 per barrel for the third quarter of 2025 compared to $14.63 per barrel for the third quarter of 2024. Refining & Marketing margin is affected by our performance against the market indicators shown earlier, which use spot market values and an estimated mix of crude purchases and product sales. Based on the market indicators and our crude oil throughput, we estimate a net positive impact of approximately $1 billion on Refining & Marketing margin for the third quarter of 2025 compared to the third quarter of 2024, primarily due to higher crack spreads. Our reported Refining & Marketing margin differs from market indicators due to the mix of crudes purchased and their costs, the effect of market structure on our crude oil acquisition prices, the effect of RIN prices on the crack spread, and other items like refinery yields, other feedstock variances and fuel margin from sales to direct dealers. These factors had an estimated net negative effect of approximately $100 million on Refining & Marketing segment adjusted EBITDA in the third quarter of 2025 compared to the third quarter of 2024.\nWe purchase RINs to satisfy a portion of our RFS compliance. Our expenses associated with purchased RINs and included in the Refining & Marketing margin were $212 million and $253 million in the third quarter of 2025 and 2024, respectively. The decrease in the third quarter of 2025 was mainly due to MPC being granted an SRE for one of our refineries for 50 percent of the renewable volume obligation for the 2024 compliance year. There is an additional credit for the 2023 compliance year recognized in items not allocated to the segments. In addition, lower prices and higher RINs generated and acquired from our Martinez Renewables JV were partially offset by increased obligated volumes.\nFor the three months ended September 30, 2025, refining operating costs, excluding depreciation and amortization, increased $111 million, or $0.36 per barrel, largely due to higher repair and energy costs.\nDistribution costs, excluding depreciation and amortization, increased $99 million, or $0.31 per barrel, and include fees paid to MPLX of $1.02 billion and $1.00 billion for the third quarter of 2025 and 2024, respectively. The change in the third quarter of 2025 primarily reflects an increase in refined product sales volume.\nRefining planned turnaround costs increased $0.40 per barrel, or $113 million, due to the scope and timing of turnaround activity.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nRefining & Marketing segment revenues decreased $6.58 billion primarily due to a decrease in average refined product sales prices of $0.22 per gallon, partially offset by increased refined product sales volumes of 158 mbpd.\nNet refinery throughput increased 76 mbpd in the first nine months of 2025 largely due to decreased turnaround activity.\nRefining & Marketing segment adjusted EBITDA decreased $1.0 billion mainly driven by decreased per barrel margins and other income in addition to increased refining operating and distribution costs, both excluding depreciation and amortization. Refining & Marketing segment adjusted EBITDA was $5.10 per barrel for the first nine months of 2025, versus $6.49 per barrel for the first nine months of 2024.\nRefining & Marketing margin was $16.26 per barrel for the first nine months of 2025 compared to $17.08 per barrel for the first nine months of 2024. Refining & Marketing margin is affected by the market indicators shown earlier, which use spot market values and an estimated mix of crude purchases and product sales. Based on the market indicators and our crude oil throughput, we estimate a net negative impact of approximately $1 billion on Refining & Marketing margin for the first nine months of 2025 compared to the first nine months of 2024, primarily due to narrower sour and sweet crude oil differentials. Our reported Refining & Marketing margin differs from market indicators due to the mix of crudes purchased and their costs, market structure on our crude oil acquisition prices, RIN prices on the crack spread, and other items like refinery yields, other feedstock variances and fuel margin from sales to direct dealers. These factors had an estimated net positive effect of approximately $1 billion on Refining & Marketing segment income in the first nine months of 2025 compared to the first nine months of 2024.\nWe purchase RINs to satisfy a portion of our RFS compliance. Our expenses associated with purchased RINs included in Refining & Marketing margin were $880 million and $847 million in the first nine months of 2025 and 2024, respectively. The increase in the first nine months of 2025 was mainly due to increased obligated volumes, partially offset by MPC being granted an SRE for one of our refineries for 50 percent of the renewable volume obligation for the 2024 compliance year. There is an additional credit for the 2023 compliance year recognized in items not allocated to the segments. In addition, we experienced higher RINs generated and acquired from our Martinez Renewables JV.\nFor the nine months ended September 30, 2025, refining operating costs, excluding depreciation and amortization, increased $241 million, or $0.18 per barrel, largely due to higher energy and repair costs, partially offset by decreased maintenance costs and expenses for projects conducted during turnaround activity.\n41\nTable of Contents\nDistribution costs, excluding depreciation and amortization, increased $205 million for the first nine months of 2025, or $0.14 per barrel, and include fees paid to MPLX of $3.01 billion and $2.96 billion for the first nine months of 2025 and 2024, respectively. The increase primarily reflects an increase in refined product sales volume.\nOther income decreased $192 million, or $0.25 per barrel, largely due to the absence of insurance proceeds received in the first nine months of 2024.\nSupplemental Refining & Marketing Statistics\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nRefining & Marketing Operating Statistics\nCrude oil capacity utilization percent\n(a)\n95 \n94 \n94 \n91 \nRefinery throughput (\nmbpd\n):\nCrude oil refined\n2,822 \n2,776 \n2,777 \n2,690 \nOther charge and blendstocks\n183 \n204 \n195 \n206 \nNet refinery throughput\n3,005 \n2,980 \n2,972 \n2,896 \nSour crude oil throughput percent\n42 \n42 \n44 \n44 \nSweet crude oil throughput percent\n58 \n58 \n56 \n56 \nRefined product yields (\nmbpd\n):\nGasoline\n1,464 \n1,494 \n1,492 \n1,464 \nDistillates\n1,103 \n1,101 \n1,083 \n1,056 \nPropane\n62 \n68 \n66 \n66 \nNGLs and petrochemicals\n222 \n212 \n209 \n205 \nHeavy fuel oil\n102 \n63 \n79 \n59 \nAsphalt\n83 \n83 \n79 \n82 \nTotal\n3,036 \n3,021 \n3,008 \n2,932 \nRefined product export sales volumes (\nmbpd\n)\n(b)\n397 \n401 \n394 \n381 \n(a)\nBased on calendar-day capacity, which is an annual average that includes down time for planned maintenance and other normal operating activities.\n(b)\nRepresents fully loaded refined product export cargoes for each time period. These sales volumes are included in the total sales volume amounts.\n42\nTable of Contents\nMidstream\nThe following includes key financial and operating data for the third quarter of 2025 compared to the third quarter of 2024 and the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\n(a)\nOn owned common-carrier pipelines, excluding equity method investments.\n(b)\nIncludes operating data for entities that have been consolidated into the MPLX financial statements as well as operating data for partnership-operated equity method investments.\n43\nTable of Contents\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\nBenchmark Prices\n2025\n2024\n2025\n2024\nNatural Gas NYMEX HH \n(per MMBtu)\n$\n3.07 \n$\n2.23 \n$\n3.48 \n$\n2.22 \nC2 + NGL Pricing \n(per gallon)\n(a)\n$\n0.74 \n$\n0.80 \n$\n0.82 \n$\n0.84 \n(a)\nC2 + NGL pricing based on Mont Belvieu prices assuming an NGL barrel of approximately 10 percent ethane, 60 percent propane, five percent Iso-Butane, 15 percent normal butane and 10 percent natural gasoline.\nThird Quarter 2025 Compared to Third Quarter 2024\nIn the third quarter of 2025, Midstream segment adjusted EBITDA increased $81 million mainly due to increased sales and operating revenues of $130 million primarily driven by higher rates and throughputs plus contributions from recent acquisitions, partially offset by higher operating expenses.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nMidstream segment adjusted EBITDA increased $233 million in the first nine months of 2025 primarily due to increased sales and operating revenues of $519 million resulting from higher rates and throughputs, contributions from recent acquisitions and a $37 million non-recurring benefit associated with a customer agreement, partially offset by higher operating expenses.\nRenewable Diesel\nThe following includes key financial and operating data for the third quarter of 2025 compared to the third quarter of 2024 and the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\n(a)    \nIncludes intersegment sales to the Refining & Marketing segment.\n(b)    \nIncludes Dickinson facility production and purchased product from our Martinez Renewables JV.\n44\nTable of Contents\nThird Quarter 2025 Compared to Third Quarter 2024\nRenewable Diesel segment revenues increased $235 million, primarily due to increased sales volume of 74 thousand gallons per day. Renewable Diesel margin, which was $8 million for the third quarter of 2025 compared to $17 million for the third quarter of 2024, decreased largely due to lower product margins, partially offset by higher environmental credits associated with increased production volume. In the third quarter of 2024, production capacity was reduced due to an event at the Martinez Renewables facility in 2023 that resulted in lower throughput and impacted margins.\nSee “Non-GAAP Financial Measures” section for reconciliation of Renewable Diesel margin.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nRenewable Diesel segment revenues increased $478 million mainly due to increased sales volume of 221 thousand gallons per day. Renewable Diesel segment adjusted EBITDA increased $61 million primarily due to increased Renewable Diesel margins. Margins increased from $49 million to $83 million in the first nine months of 2025 mainly due to higher environmental credits associated with increased production volume, partially offset by lower product margins. In the first nine months of 2024, production capacity was reduced due to an event at the Martinez Renewables facility in 2023 that resulted in lower throughput and impacted margins.\nSee “Non-GAAP Financial Measures” section for reconciliation of Renewable Diesel margin.\nCorporate \n(millions of dollars) \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nCorporate\n(a)\n$\n(238)\n$\n(224)\n$\n(691)\n$\n(675)\n(a)\nCorporate costs consist primarily of MPC’s corporate administrative expenses and costs related to certain non-operating assets, except for corporate overhead expenses attributable to MPLX, which are included in the Midstream segment. Corporate costs include depreciation and amortization of $29 million and $28 million for the third quarter of 2025 and 2024, respectively, and $64 million and $75 million for the nine months ended September 30, 2025 and 2024, respectively.\nThird Quarter 2025 Compared to Third Quarter 2024\nIn the third quarter of 2025, corporate expenses increased $14 million primarily driven by quarterly fair-value remeasurement of outstanding performance-based stock compensation.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nCorporate expenses increased $16 million in the first nine months of 2025 primarily due to increased contract services.\nItems not Allocated to Segments\n(millions of dollars) \nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n2025\n2024\n2025\n2024\nItems not allocated to segments:\nGain on sale of assets\n$\n738 \n$\n— \n$\n738 \n$\n151 \nSRE\n57 \n— \n57 \n— \nTransaction-related costs\n(21)\n— \n(21)\n— \nTotal\n$\n774 \n$\n— \n$\n774 \n$\n151 \nThird Quarter 2025 Compared to Third Quarter 2024\nTotal items not allocated to segments of $774 million in the third quarter of 2025, primarily include gain on sale of assets from the BANGL Acquisition of $484 million and the Ethanol Joint Venture Sale of $254 million. See Note 4 to the unaudited consolidated financial statements for additional information on these transactions. In addition, items not allocated to segments includes the 2023 compliance year SRE credit, partially offset by transaction costs related to Midstream acquisitions during the quarter.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nIn addition to the items noted above, items not allocated to segments includes a gain on sale of assets of $151 million resulting from the Whistler Joint Venture Transaction in the in the first nine months of 2024. See Note 4 to the unaudited consolidated financial statements for additional information on this transaction. \n45\nTable of Contents\nNon-GAAP Financial Measures\n \nManagement uses financial measures to evaluate our operating performance that are calculated and presented on the basis of methodologies other than in accordance with GAAP. The non-GAAP financial measures we use are as follows:\nRefining & Marketing Margin\nRefining & Marketing margin is defined as sales revenue less cost of refinery inputs and purchased products. We use and believe our investors use this non-GAAP financial measure to evaluate our Refining & Marketing segment’s operating and financial performance as it is the most comparable measure to the industry’s market reference product margins. This measure should not be considered a substitute for, or superior to, Refining & Marketing gross margin or other measures of financial performance prepared in accordance with GAAP, and our calculations thereof may not be comparable to similarly titled measures reported by other companies.\nReconciliation of Refining & Marketing segment adjusted EBITDA to Refining & Marketing gross margin and Refining & Marketing margin\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\n2025\n2024\nRefining & Marketing segment adjusted EBITDA\n$\n1,762 \n$\n1,136 \n$\n4,141 \n$\n5,144 \nPlus (Less):\nDepreciation and amortization\n(426)\n(448)\n(1,237)\n(1,345)\nRefining planned turnaround costs\n(400)\n(287)\n(1,104)\n(1,116)\nSelling, general and administrative expenses\n677 \n639 \n1,968 \n1,910 \nIncome from equity method investments\n(3)\n(29)\n(11)\n(46)\nNet loss on disposal of assets\n2 \n1 \n2 \n1 \nOther income\n(36)\n(16)\n(155)\n(309)\nRefining & Marketing gross margin\n1,576 \n996 \n3,604 \n4,239 \nPlus (Less):\nOperating expenses (excluding depreciation and amortization)\n3,032 \n2,783 \n8,819 \n8,498 \nDepreciation and amortization\n426 \n448 \n1,237 \n1,345 \nGross margin excluded from and other income included in Refining & Marketing margin\n(a)\n(95)\n(143)\n(263)\n(322)\nOther taxes included in Refining & Marketing margin\n(74)\n(73)\n(207)\n(205)\nRefining & Marketing margin\n$\n4,865 \n$\n4,011 \n$\n13,190 \n$\n13,555 \n(a)\nReflects the gross margin, excluding depreciation and amortization, of other related operations included in the Refining & Marketing segment and processing of credit card transactions on behalf of certain of our marketing customers, net of other income.\n46\nTable of Contents\nRenewable Diesel Margin\nRenewable Diesel margin is defined as sales revenue plus value attributable to qualifying regulatory credits earned during the period less cost of renewable inputs and purchased product costs. We use and believe our investors use this non-GAAP financial measure to evaluate our Renewable Diesel segment’s operating and financial performance. This measure should not be considered a substitute for, or superior to, Renewable Diesel gross margin or other measures of financial performance prepared in accordance with GAAP, and our calculation thereof may not be comparable to similarly titled measures reported by other companies.\nReconciliation of Renewable Diesel segment adjusted EBITDA to Renewable Diesel gross margin and Renewable Diesel margin\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\n2025\n2024\nRenewable Diesel segment adjusted EBITDA\n$\n(56)\n$\n(61)\n$\n(117)\n$\n(178)\nPlus (Less):\nDepreciation and amortization\n(17)\n(17)\n(53)\n(50)\nRenewable Diesel JV depreciation and amortization\n(a)\n(22)\n(22)\n(67)\n(67)\nRenewable Diesel planned turnaround costs\n(1)\n(3)\n(37)\n(5)\nRenewable Diesel JV planned turnaround costs\n(a)\n(3)\n— \n(13)\n— \nSelling, general and administrative expenses\n8 \n12 \n26 \n40 \nIncome from equity method investments\n(22)\n(14)\n(56)\n(39)\nOther income\n(10)\n— \n(21)\n— \nRenewable Diesel gross margin\n(123)\n(105)\n(338)\n(299)\nPlus (Less):\nOperating expenses (excluding depreciation and amortization)\n92 \n84 \n304 \n234 \nDepreciation and amortization\n17 \n17 \n53 \n50 \nMartinez JV depreciation and amortization\n22 \n21 \n64 \n64 \nRenewable Diesel margin\n$\n8 \n$\n17 \n$\n83 \n$\n49 \n(a)    \nRepresents MPC’s pro-rata share of expenses from joint ventures included within the Renewable Diesel segment. \nLIQUIDITY AND CAPITAL RESOURCES\nCash Flows\nOur consolidated cash and cash equivalents balance was approximately $2.65 billion at September 30, 2025 compared to $3.21 billion at December 31, 2024. Net cash provided by (used in) operating activities, investing activities and financing activities are presented in the following table. \n \nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\nNet cash provided by (used in):\nOperating activities\n$\n5,184 \n$\n6,458 \nInvesting activities\n(5,653)\n1,227 \nFinancing activities\n(88)\n(9,127)\nTotal decrease in cash\n$\n(557)\n$\n(1,442)\nOperating Activities\nNet cash provided by operating activities decreased $1.27 billion in the first nine months of 2025 compared to the first nine months of 2024. The change in net cash provided by operating activities was primarily due to a decrease in operating results and an unfavorable change in working capital of $791 million, when comparing the change in working capital in both periods. \n47\nTable of Contents\nFor the first nine months of 2025, changes in working capital, excluding changes in short-term debt, were a net $818 million use of cash mainly due to the effects of changes in energy commodity volumes and prices at the end of the period. Accounts payable decreased primarily due to decreases in crude oil volumes and prices. Current receivables decreased primarily due to decreases in crude oil prices and crude oil volumes, partially offset by increases in refined product prices. Inventories increased largely due to increases in refined product and materials and supplies inventory volumes, partially offset by a decrease in crude oil inventory volumes.\nFor the first nine months of 2024, changes in working capital, excluding changes in short-term debt, were a net $27 million use of cash mainly due to the effects of changes in energy commodity prices and volumes at the end of the period. Current receivables decreased primarily due to decreases in crude oil and refined product volumes and prices. Accounts payable decreased primarily due to decreases in crude oil volumes. Inventories increased primarily due to increases in refined product and crude oil inventory volumes. Additionally, working capital was favorably impacted by changes in income tax receivable and unfavorably impacted by changes in current liabilities and other current assets.\nInvesting Activities\nInvesting activities were a net $5.65 billion use of cash in the first nine months of 2025 compared to a net $1.23 billion source of cash in the first nine months of 2024. \n•\nShort-term investments were liquidated in the fourth quarter of 2024 and, therefore, there was no activity related to short-term investments in 2025. In the first nine months of 2024, purchases of short-term investments of $2.95 billion were more than offset by maturities and sales of short-term investments of $4.38 billion and $2.30 billion, respectively, for a net source of cash of $3.73 billion.\n•\nAdditions to property, plant and equipment increased $582 million. See the Capital Requirements section for additional information on our capital expenditures and investments.\n•\nCash used for acquisitions of $3.32 billion and $622 million in the first nine months of 2025 and 2024, respectively, were due to acquisitions in our Midstream segment.\n•\nCash used in net investments was $250 million for the first nine months of 2025 compared to $309 million for the first nine months of 2024. In the first nine months of 2025, investments mainly included contributions to Midstream equity method investments, partially offset by proceeds from the Ethanol Joint Venture Sale. In the first nine months of 2024, investments primarily included a return of capital of $134 million related to the Whistler Joint Venture Transaction more than offset by Midstream equity method investments, including a $92 million contribution made in March 2024 for the repayment of MPLX’s share of the Dakota Access JV’s debt due in 2024.\nThe consolidated statements of cash flows exclude changes to the consolidated balance sheets that did not affect cash. A reconciliation of additions to property, plant and equipment per the consolidated statements of cash flows to reported total capital expenditures and investments follows. \n \nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\nAdditions to property, plant and equipment per the consolidated statements of cash flows\n$\n2,305 \n$\n1,723 \nIncrease (decrease) in capital accruals\n105 \n(18)\nTotal capital expenditures\n2,410 \n1,705 \nInvestments in equity method investees\n821 \n450 \nTotal capital expenditures and investments\n$\n3,231 \n$\n2,155 \nFinancing Activities\nFinancing activities were a net $88 million use of cash in the first nine months of 2025 compared to a net $9.13 billion use of cash in the first nine months of 2024. \n•\nLong-term debt borrowings and repayments were a net $4.65 billion source of cash in the first nine months of 2025 compared to a net $805 million source of cash in the first nine months of 2024. During the first nine months of 2025, MPLX issued $6.5 billion aggregate principal amount of senior notes and repaid $1.70 billion aggregate principal amount of senior notes and MPC issued $2.0 billion in aggregate principal amount of senior notes and repaid $1.250 billion in aggregate principal amount of senior notes. During the first nine months of 2024, MPLX issued $1.65 billion aggregate principal amount of senior notes and MPC repaid $750 million aggregate principal amount of senior notes. \n•\nDuring first nine months of 2025, we borrowed and repaid $5.06 billion under our commercial paper program. We had no activity under our commercial paper program during the first nine months of 2024.\n•\nCash used in common stock repurchases, including fees and expenses, totaled $2.49 billion in the first nine months of 2025 compared to $7.82 billion in the first nine months of 2024. See the Capital Requirements section for further discussion of our stock repurchases.\n48\nTable of Contents\n•\nCash used in dividend payments decreased $22 million for the first nine months of 2025 compared to the first nine months of 2024 due to a reduction of shares outstanding resulting from share repurchases, partially offset by a 10 percent increase in per share dividends in the fourth quarter of 2024.\n•\nCash used in distributions to noncontrolling interests increased $99 million for the first nine months of 2025 compared to the first nine months of 2024 primarily due to a 12.5 percent increase in MPLX’s distribution per common unit in the fourth quarter of 2024.\n•\nCash used in repurchases of noncontrolling interests was $300 million in the first nine months of 2025 and $226 million in the first nine months of 2025 related to the repurchase of MPLX common units. See Note 3 to the unaudited consolidated financial statements for further discussion of MPLX.\nDerivative Instruments\nSee Item 3. Quantitative and Qualitative Disclosures about Market Risk for a discussion of derivative instruments and associated market risk.\nCapital Resources\nMPC, Excluding MPLX\nWe control MPLX through our ownership of the general partner; however, the creditors of MPLX do not have recourse to MPC’s general credit through guarantees or other financial arrangements, except as noted. MPC has effectively guaranteed certain indebtedness of LOOP and LOCAP, in which MPLX holds an interest. Therefore, in the following table, we present the liquidity of MPC, excluding MPLX. MPLX liquidity is discussed in the following section.\nOur liquidity, excluding MPLX, totaled $5.99 billion at September 30, 2025 consisting of: \nSeptember 30, 2025\n(Millions of dollars)\nTotal Capacity\nOutstanding Borrowings\nOutstanding\nLetters\nof Credit\nAvailable\nCapacity\nBank revolving credit facility\n$\n5,000 \n$\n— \n$\n1 \n$\n4,999 \nTrade receivables facility\n(a)\n100 \n— \n— \n100 \nTotal\n$\n5,100 \n$\n— \n$\n1 \n$\n5,099 \nCash and cash equivalents and short-term investments\n(b)\n889 \nTotal liquidity\n$\n5,988 \n(a)\nThe committed borrowing and letter of credit issuance capacity under the trade receivables securitization facility is $100 million. In addition, the facility allows for the issuance of letters of credit in excess of the committed capacity at the discretion of the issuing banks.\n(b)\n    \nExcludes cash and cash equivalents of MPLX of $1.77 billion.\nWe have a commercial paper program that allows us to have a maximum of $2.0 billion in commercial paper outstanding. We do not intend to have outstanding commercial paper borrowings in excess of available capacity under our bank revolving credit facility. At September 30, 2025, we had no borrowings outstanding under the commercial paper program.\nBecause of the alternatives available to us, including internally generated cash flow, revolving credit and trade receivable facilities, access to capital markets and a commercial paper program, we believe that our short-term and long-term liquidity is adequate to fund not only our current operations, but also our near-term and long-term funding requirements, including capital spending programs, the repurchase of shares of our common stock, dividend payments, defined benefit plan contributions, repayment of debt maturities and other amounts that may ultimately be paid in connection with contingencies. \nOn February 10, 2025, MPC issued $2.0 billion in aggregate principal amount of senior notes in an underwritten public offering, (“2025 Senior Notes Offering”) consisting of:\n•\n$1.1 billion aggregate principal amount of 5.150 percent senior notes due March 2030; and\n•\n$900 million aggregate principal amount of 5.700 percent senior notes due March 2035. \nThe 2025 Senior Notes Offering replaced the $750 million aggregate principal amount of 3.625 percent senior notes that matured in September 2024, and the net proceeds were used to repay the $1.250 billion aggregate principal amount of 4.700 percent senior notes at maturity on May 1, 2025.\nMPC’s bank revolving credit facility and trade receivables facility contain representations and warranties, affirmative and negative covenants and restrictions, including financial covenants, and events of default that we consider usual and customary for agreements of a similar type and nature. As of September 30, 2025, we were in compliance with such covenants and restrictions. \n49\nTable of Contents\nOur intention is to maintain an investment-grade credit profile. As of September 30, 2025, the credit ratings on our senior unsecured debt are as follows.\n \nCompany\nRating Agency\nRating\nMPC\nMoody’s\nBaa2 (stable outlook)\nStandard & Poor’s\nBBB (stable outlook)\nFitch\nBBB (stable outlook)\nThe ratings reflect the respective views of the rating agencies and should not be interpreted as a recommendation to buy, sell or hold our securities. Although it is our intention to maintain a credit profile that supports an investment grade rating, there is no assurance that these ratings will continue for any given period of time. The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant. A rating from one rating agency should be evaluated independently of ratings from other rating agencies.\nThe agreements governing MPC’s debt obligations do not contain credit rating triggers that would result in the acceleration of interest, principal or other payments in the event that our credit ratings are downgraded. However, any downgrades of our senior unsecured debt could increase the applicable interest rates, yields and other fees payable under such agreements and may limit our flexibility to obtain financing in the future, including to refinance existing indebtedness. In addition, a downgrade of our senior unsecured debt rating to below investment-grade levels could, under certain circumstances, impact our ability to purchase crude oil on an unsecured basis and could result in us having to post letters of credit under existing transportation services or other agreements.\nSee Note 16 to the unaudited consolidated financial statements for further discussion of our debt.\nMPLX\nMPLX’s liquidity totaled $5.27 billion at September 30, 2025 consisting of:\nSeptember 30, 2025\n(Millions of dollars)\nTotal Capacity\nOutstanding Borrowings\nOutstanding\nLetters\nof Credit\nAvailable\nCapacity\nMPLX LP - bank revolving credit facility\n$\n2,000 \n$\n— \n$\n— \n$\n2,000 \nMPC intercompany loan agreement\n1,500 \n— \n— \n1,500 \nTotal\n$\n3,500 \n$\n— \n$\n— \n$\n3,500 \nCash and cash equivalents\n1,765 \nTotal liquidity\n$\n5,265 \nOn February 18, 2025, MPLX repaid all of its outstanding $500 million aggregate principal amount of 4.000 percent senior notes due February 2025 at maturity.\nOn March 10, 2025, MPLX issued $2.0 billion in aggregate principal amount of senior notes in an underwritten public offering, (“March 2025 MPLX Senior Notes Offering”), consisting of:\n•\n$1.0 billion aggregate principal amount of 5.400 percent senior notes due April 2035; and \n•\n$1.0 billion aggregate principal amount of 5.950 percent senior notes due April 2055. \nOn April 9, 2025, MPLX used the net proceeds from the March 2025 MPLX Senior Notes Offering to redeem all of (i) MPLX LP’s outstanding $1,189 million aggregate principal amount of 4.875 percent senior notes due June 2025 and (ii) MarkWest Energy Partners, L.P.’s outstanding $11 million aggregate principal amount of 4.875 percent senior notes due June 2025. MPLX used the remaining net proceeds for general partnership purposes.\nOn July 3, 2025, MPLX used cash on hand to extinguish approximately $656 million of debt principal outstanding, including interest, related to certain term and revolving loans assumed as part of the BANGL Acquisition. See Note 23 to the unaudited consolidated financial statements for additional information on this transaction.\nOn August 11, 2025, MPLX issued $4.5 billion in aggregate principal amount of senior notes in an underwritten public offering, (“August 2025 MPLX Senior Notes Offering”) consisting of:\n•\n$1.25 billion aggregate principal amount of 4.800 percent senior notes due February 2031; \n•\n$750 million aggregate principal amount of 5.000 percent senior notes due January 2033; \n•\n$1.5 billion aggregate principal amount of 5.400 percent senior notes due September 2035; and \n•\n$1.0 billion aggregate principal amount of 6.200 percent senior notes due September 2055. \n50\nTable of Contents\nMPLX used a portion of the net proceeds from the August 2025 MPLX Senior Notes Offering to fund the Northwind Midstream Acquisition, including the payment of related fees and expenses, and to increase cash and cash equivalents following the recently completed BANGL Acquisition and BANGL debt repayment. MPLX intends to use the remainder of the net proceeds from the August 2025 MPLX Senior Notes Offering for general partnership purposes, which may include capital expenditures and working capital.\nMPLX’s bank revolving credit facility contains certain representations and warranties, affirmative and restrictive covenants and events of default that we consider to be usual and customary for an agreement of this type. As of September 30, 2025, MPLX was in compliance with such covenants.\nOur intention is to maintain an investment-grade credit profile for MPLX. As of September 30, 2025, the credit ratings on MPLX’s senior unsecured debt are as follows.\n \nCompany\nRating Agency\nRating\nMPLX\nMoody’s\nBaa2 (stable outlook)\nStandard & Poor’s\nBBB (stable outlook)\nFitch\nBBB (stable outlook)\nThe ratings reflect the respective views of the rating agencies and should not be interpreted as a recommendation to buy, sell or hold MPLX securities. Although it is our intention to maintain a credit profile that supports an investment grade rating for MPLX, there is no assurance that these ratings will continue for any given period of time. The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant. A rating from one rating agency should be evaluated independently of ratings from other rating agencies.\nThe agreements governing MPLX’s debt obligations do not contain credit rating triggers that would result in the acceleration of interest, principal or other payments in the event that MPLX credit ratings are downgraded. However, any downgrades of MPLX senior unsecured debt to below investment-grade ratings could increase the applicable interest rates, yields and other fees payable under such agreements. In addition, a downgrade of MPLX senior unsecured debt ratings to below investment-grade levels may limit MPLX’s ability to obtain future financing, including to refinance existing indebtedness. \nSee Note 16 to the unaudited consolidated financial statements for further discussion of MPLX’s debt.\nCapital Requirements\nCapital Expenditures and Investments\nCapital expenditures and investments in affiliates during the nine months ended September 30, 2025 were primarily for Refining & Marketing segment and Midstream segment projects. Major Refining & Marketing segment projects include advancing improvements focused on integrating and modernizing utility systems and increasing energy efficiency, with the added benefit of addressing upcoming regulation mandating further reductions in emissions at our Los Angeles refinery, a multi-year project to upgrade high sulfur distillate to ULSD and maximize distillate volume expansion at our Galveston Bay refinery and a project to increase flexibility and maximize higher value jet fuel production at our Robinson refinery. In addition to these multi-year investments, the Company is executing short-duration, high-return projects that are expected to enhance the yields of our refineries, improve energy efficiency and lower our costs as well as investments in our branded marketing footprint. \nOur Midstream segment capital expenditures and investments in affiliates were primarily for expanding our Permian to Gulf Coast integrated natural gas and NGL value chain, gas processing plants in the Marcellus and Permian basins and gas gathering projects in the Marcellus, Utica and Permian basins.\n51\nTable of Contents\nCapital expenditures and investments for MPC and MPLX are summarized below. \n \nNine Months Ended \nSeptember 30,\n(Millions of dollars)\n2025\n2024\nCapital expenditures and investments:\n(a)\nMPC, excluding MPLX\nRefining & Marketing\n$\n1,132 \n$\n961 \nMidstream - Other\n17 \n4 \nRenewable Diesel\n18 \n6 \nCorporate and Other\n(b)\n21 \n25 \nTotal MPC, excluding MPLX\n$\n1,188 \n$\n996 \nMidstream - MPLX\n(c)\n$\n1,979 \n$\n1,121 \n(a)\n    Capital expenditures include changes in capital accruals.\n(b)\n    Excludes capitalized interest of $64 million and $38 million for the nine months ended September 30, 2025 and 2024, respectively.\n(c)\n    Includes reimbursable capital of $134 million.\nShare Repurchases\nTotal share repurchases were as follows for the respective periods:\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(In millions, except per share data)\n2025\n2024\n2025\n2024\nNumber of shares repurchased\n3 \n16 \n15 \n44 \nCash paid for shares repurchased\n(a)\n$\n650 \n$\n2,701 \n$\n2,399 \n$\n7,815 \nAverage cost per share\n(b)\n$\n174.32 \n$\n170.99 \n$\n153.83 \n$\n175.20 \n(a)     \nThe nine months ended September 30, 2025 excludes $88 million paid in 2025 for excise tax on 2024 share repurchases.\n(b)\n    The average cost per share includes excise tax on share repurchases resulting from the Inflation Reduction Act of 2022, but the excise tax does not reduce the remaining share repurchase authorization\n.\nFrom January 1, 2012 through September 30, 2025, our board of directors had approved $60.05 billion in total share repurchase authorizations, and we have repurchased a total of $54.67 billion of our common stock. As of September 30, 2025, $5.38 billion remained available for repurchase under the share repurchase authorizations.\nWe may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, accelerated share repurchases, tender offers or open market solicitations for shares, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended, discontinued or restarted at any time.\nSee Note 8 to the unaudited consolidated financial statements for further discussion of our share repurchase authorizations.\nMPLX Unit Repurchases\nTotal unit repurchases were as follows for the respective periods:\nThree Months Ended \nSeptember 30,\nNine Months Ended \nSeptember 30,\n(In millions, except per unit data)\n2025\n2024\n2025\n2024\nNumber of common units repurchased\n2 \n2 \n6 \n6 \nCash paid for common units repurchased\n$\n100 \n$\n76 \n$\n300 \n$\n226 \nAverage cost per unit\n$\n50.86 \n$\n42.89 \n$\n51.20 \n$\n41.32 \n52\nTable of Contents\nAs of September 30, 2025, MPLX had approximately $1.22 billion remaining available under its unit repurchase authorizations.\nOn August 5, 2025, MPLX announced that its board of directors approved a \n$1.0 billion\n common unit repurchase authorization that is in addition to the $1.0 billion common unit repurchase authorization announced on August 2, 2022. The common unit repurchase authorizations have no expiration date.\nMPLX may utilize various methods to effect the repurchases, which could include open market repurchases, negotiated block transactions, accelerated unit repurchases, tender offers or open market solicitations for units, some of which may be effected through Rule 10b5-1 plans. The timing and amount of future repurchases, if any, will depend upon several factors, including market and business conditions, and such repurchases may be suspended, discontinued or restarted at any time.\nCash Commitments\nContractual Obligations\nAs of September 30, 2025, our purchase commitments primarily consist of obligations to purchase and transport crude oil used in our refining operations. During the first nine months of 2025, there were no material changes to our contractual obligations outside the ordinary course of business since December 31, 2024.\nOur other contractual obligations primarily consist of long-term debt and pension and post-retirement obligations, for which additional information is included in Notes 16 and 21, respectively, to the unaudited consolidated financial statements, and financing and operating leases. \nOther Cash Commitments\nOn October 29, 2025, our board of directors declared a dividend of $1.00 per share on common stock. The dividend is payable December 10, 2025 to shareholders of record as of the close of business on November 19, 2025.\nDuring the nine months ended September 30, 2025, we made contributions of $191 million to our funded pension plans and as a result we have no further required minimum funding remaining in 2025, however, we may make additional voluntary contributions at our discretion depending on the anticipated funding status and plan asset performance.\nWe may, from time to time, repurchase our senior notes in the open market, in tender offers, in privately-negotiated transactions or otherwise in such volumes, at such prices and upon such other terms as we deem appropriate.\nENVIRONMENTAL MATTERS AND COMPLIANCE COSTS\nWe have incurred and may continue to incur substantial capital, operating and maintenance, and remediation expenditures as a result of environmental laws and regulations. If these expenditures, as with all costs, are not ultimately reflected in the prices of our products and services, our operating results will be adversely affected. We believe that substantially all of our competitors must comply with similar environmental laws and regulations. However, the specific impact on each competitor may vary depending on a number of factors, including the age and location of its operating facilities, marketing areas, production processes and whether it is also engaged in the petrochemical business or the marine transportation of crude oil and refined products.\nAs previously disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024, actual expenditures may vary as the number and scope of environmental projects are revised as a result of improved technology or changes in regulatory requirements.\nThere have been no additional significant changes to our environmental matters and compliance costs during the nine months ended September 30, 2025.\nCRITICAL ACCOUNTING ESTIMATES\nAs of September 30, 2025, there have been no significant changes to our critical accounting estimates since our Annual Report on Form 10-K for the year ended December 31, 2024 except as noted below.\nAcquisitions\nIn accounting for business combinations, acquired assets, assumed liabilities and contingent consideration are recorded based on estimated fair values as of the date of acquisition. The excess or shortfall of the purchase price when compared to the fair value of the net tangible and identifiable intangible assets acquired, if any, is recorded as goodwill or a bargain purchase gain, respectively. A significant amount of judgment is involved in estimating the individual fair values of property, plant and equipment, intangible assets, contingent consideration and other assets and liabilities. We use all available information to make these fair value determinations and, for certain acquisitions, engage third-party consultants for valuation assistance.\n53\nTable of Contents\nThe fair value of assets and liabilities, including contingent consideration, as of the acquisition date are often estimated using a combination of approaches, including the income approach, which requires us to project future cash flows and associated volumes, and apply an appropriate discount rate; the cost approach, which requires estimates of replacement costs and depreciation and obsolescence estimates; and the market approach which uses market data and adjusts for entity-specific differences. The estimates used in determining fair values are based on assumptions believed to be reasonable but which are inherently uncertain. Accordingly, actual results may differ materially from the projected results used to determine fair value. \nSee Note 4 to the unaudited consolidated financial statements for additional information on our acquisitions. See Note 14 to the unaudited consolidated financial statements for additional information on fair value measurements.\nACCOUNTING STANDARDS NOT YET ADOPTED\nAs discussed in Note 2 to the unaudited consolidated financial statements, certain new financial accounting pronouncements will be effective for our financial statements in the future."
}