{
  "source_file": "mrna-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nModerna is a leader in the creation of the field of messenger RNA (mRNA) medicine. Through the advancement of mRNA technology, we are reimagining how medicines are made and transforming how we treat and prevent disease for everyone. By working at the intersection of science, technology and health for more than a decade, we have developed medicines at unprecedented speed and efficiency, including one of the earliest and most effective COVID vaccines.\nOur mRNA platform has enabled the development of medicines across four franchises: respiratory virus vaccines, latent and other virus vaccines, oncology therapeutics and rare disease therapeutics. With a unique culture and a global team driven by the Moderna values and mindsets to responsibly change the future of human health, we strive to deliver the greatest possible impact to people through mRNA medicines.\nOur first commercial product, Spikevax (our COVID vaccine), has helped hundreds of millions of people worldwide combat COVID-19. SARS-CoV-2, the virus that causes COVID-19, continues to evolve, and in 2023, the COVID vaccine market shifted from a pandemic to an endemic, seasonal commercial market. In 2024, we became a multi-product company with the approval of our second commercial product, mRESVIA, our mRNA respiratory syncytial virus (RSV) vaccine for older adults. In 2024, we achieved net product sales of $3.1 billion, largely from sales of Spikevax.  \nBeyond our commercial products, we continue to demonstrate the potential of our platform technology. In 2024, we shared four positive Phase 3 data readouts across our respiratory portfolio—for our next-generation COVID vaccine, our RSV vaccine for high-risk adults aged 18 to 59, our seasonal flu+COVID combination vaccine and our seasonal flu vaccine. In the area of oncology therapeutics, we continue to demonstrate the potential clinical benefit of our individualized neoantigen therapy (INT) (mRNA-4157), which is being developed in collaboration with Merck. We and Merck have rapidly expanded clinical studies to several tumor types and completed enrollment of the Phase 3 clinical trial for adjuvant melanoma in 2024. Additionally, in 2024, we also took steps to move two of our rare disease therapeutics programs—targeting propionic acidemia (PA) and methylmalonic acidemia (MMA)—toward registrational trials. We also achieved milestones in our latent and other vaccines franchise, including the initiation of a Phase 3 study of our norovirus vaccine.  \nOur success in research and development is a testament to our platform. Moving forward, we are taking a paced approach to our research and development investment. We entered 2025 with a focus on a prioritized portfolio addressing our four franchises where there is unmet need.\nTHE mRNA OPPORTUNITY\nmRNA, the software of life\nmRNA transfers the information stored in our genes to the cellular machinery that makes all the proteins required for life. Our genes are stored as sequences of DNA which contain the instructions to make specific proteins. DNA serves as a hard drive, safely storing these instructions in the cell’s nucleus until they are needed by the cell.\nWhen a cell needs to produce a protein, the instructions to make that protein are copied from the DNA to mRNA, which serves as the template for protein production. Each mRNA molecule contains the instructions to produce a specific protein with a distinct function in the body. mRNA transmits those instructions to cellular machinery, called ribosomes, that make copies of the required protein.\nWe see mRNA functioning as the “software of life.” Every cell uses mRNA to provide real time instructions to make the proteins necessary to drive all aspects of biology, including in human health and disease. This was codified as the central dogma of molecular biology over 60 years ago, and is exemplified in the schematic below.\n6\nTable of Contents\nThe structure of mRNA \nmRNA is a linear polymer comprising four monomers called nucleotides: adenosine (A), guanosine (G), cytosine (C) and uridine (U). Within the region of the molecule that codes for a protein (the coding region), the sequence of these four nucleotides forms a language made up of three-letter words called codons. The first codon, or start codon (AUG), signals where the ribosome should start protein synthesis. To know what protein to make, the ribosome then progresses along the mRNA one codon at a time, appending the appropriate amino acid to the growing protein. To end protein synthesis, three different codons (UAA, UAG, and UGA) serve as stop signals, telling the ribosome where to terminate protein synthesis. In total, there are 64 potential codons, but only 20 amino acids that are used to build proteins; therefore, multiple codons can encode for the same amino acid.\nThe process of protein production is called translation because the ribosome is reading in one language (a sequence of codons) and outputting in another language (a sequence of amino acids). The coding region is analogous to a sentence in English. Much like a start codon, a capitalized word can indicate the start of a sentence. Codons within the coding region resemble groups of letters representing words. The end of the sentence is signaled by a period in English, or a stop codon for mRNA.\nIn every cell, hundreds of thousands of mRNAs make hundreds of millions of proteins every day. A typical protein contains 200-600 amino acids; therefore, a typical mRNA coding region ranges from 600-1,800 nucleotides. In addition to the coding region, mRNAs contain four other key features: (1) the 5’ untranslated region (5’-UTR); (2) the 3’ untranslated region (3’-UTR); (3) the 5’ cap; and (4) a 3’ polyadenosine (poly-A) tail. The sequence of nucleotides in the 5’-UTR influences how efficiently the ribosome initiates protein synthesis, whereas the sequence of nucleotides in the 3’-UTR contains information about which cell types should translate that mRNA and how long the mRNA should last. The 5’ cap and 3’ poly-A tail enhance ribosome engagement and protect the mRNA from attack by intracellular enzymes that digest mRNA from its ends.\n7\nTable of Contents\nThe intrinsic advantages of using mRNA as a medicine\nmRNA possesses inherent characteristics that we believe position it to have a profound impact on human health:\n•\nmRNA is used by every cell to produce all proteins:\n mRNA is used to make every type of protein, including secreted, membrane and intracellular proteins, in varying quantities over time, in different locations and in various combinations. Given the universal role of mRNA in protein production, we believe that mRNA medicines could have broad applicability across human disease.\n•\nMaking proteins inside one’s own cells mimics human biology: \nTailored mRNA can be sent into cells to instruct them to produce specific protein therapeutics or vaccine antigens and provides certain advantages over traditional approaches to medicine, where a protein or chemical is introduced to the body.\n•\nmRNA has a simple and flexible chemical structure:\n Each mRNA molecule comprises four chemically similar nucleotides to encode proteins made\n \nfrom up to 20 chemically different amino acids. To make the full diversity of possible proteins, only simple sequence changes are required in mRNA, instead of starting from scratch for each new vaccine or therapy.\n•\nmRNA has classic pharmacologic features: \nmRNA possesses many of the attractive pharmacologic features of most modern medicines, including reproducible activity, predictable potency and well-behaved dose dependency; mRNA also provides the ability to adjust dosing based on an individual patient’s needs, including stopping or lowering the dose, to seek to promote safety and tolerability.\nOur success in developing, manufacturing and commercializing vaccines against COVID-19 and RSV demonstrates the potential of mRNA medicines to help people and patients in far-reaching ways that could exceed the impact of traditional approaches to medicine.\nWe believe that the main advantages of mRNA as compared to traditional medicine are: \n1.\nmRNA could create an unprecedented abundance and diversity of medicines.\n mRNA’s breadth of applicability has the potential to create an extraordinary number of new mRNA medicines that are currently beyond the reach of recombinant protein technology.\n2.\nAdvances in the development of our mRNA medicines reduce risks across our portfolio. \nmRNA medicines share fundamental features that can\n \nbe leveraged across our portfolio. We believe that once safety and proof of protein production has been established in one program, the technology and biology risks of related programs that use similar mRNA technologies, delivery technologies and manufacturing processes will decrease significantly.  \n3.\nmRNA technology can accelerate discovery and development. \nThe software-like features of mRNA enable rapid\n \nin silico\n \ndesign and the use of\n \nautomated high-throughput synthesis processes that permit discovery to proceed in parallel rather than sequentially. We believe these mRNA features can also accelerate drug development by allowing the use of shared manufacturing processes and infrastructure.\n4.\nThe ability to leverage shared processes and infrastructure can drive significant capital efficiency over time. \nWe believe the manufacturing\n \nrequirements of different mRNA medicines are similar and that at commercial scale, a portfolio of mRNA medicines will benefit from shared capital expenditures.\nOUR STRATEGY\nWe believe that the development of mRNA medicines represents a significant breakthrough for patients, our industry and human health globally. Our success in developing one of the earliest and most effective COVID vaccines, at unprecedented speed and efficiency, demonstrates the promise of mRNA medicine. Our COVID vaccine has helped hundreds of millions of people worldwide combat COVID-19. Beyond COVID, our platform continues to be highly productive, with our RSV vaccine representing our second commercial product and eleven programs in late-stage development. \nWe are currently focused on three strategic priorities: \n1.\nDriving use of Spikevax and mRESVIA.\n Spikevax and mRESVIA are the foundation of our respiratory vaccine portfolio and we expect to participate in the full contracting season in the United States for both in 2025 for the first time. We will continue to work with all market channels to maximize the availability of Spikevax. Internationally, we plan to bring manufacturing plants online in Australia, Canada and the United Kingdom (UK) in 2025, subject to execution of manufacturing plant licensures. With a full season of RSV contracting in 2025, our goal is to increase mRESVIA’s market share in the United States and market access globally.\n2.\nFocusing on ten product approvals over the next three years to drive sales growth.\n Our prioritized programs span our four franchises: respiratory, latent and other virus, oncology and rare diseases. We expect execution of this priority to drive \n8\nTable of Contents\nsales growth and fund our next wave of research and development investment. For nine of these programs, we have near-term milestones, including up to three potential 2025 approvals for our next-generation COVID vaccine, our RSV vaccine for high-risk adults aged 18 to 59, and our flu+COVID combination vaccine for adults 50 years and older. We also anticipate up to six upcoming registrational data readouts for our cytomegalovirus (CMV), seasonal flu, norovirus, INT for adjuvant melanoma, PA and MMA product candidates.\n3.\nDelivering cost efficiency across the business.\n We plan to continue improving efficiency by further reducing our research and development and selling, general and administrative expenses in 2025. By 2027, we expect to decrease annual research and development expenses by approximately $1.0 billion compared to 2024. On cost of sales, we will work to continue to drive efficiency through manufacturing productivity improvements to achieve operating leverage.\nOUR PLATFORM\nOverview of our platform\nOur mRNA “platform” refers to our accumulated knowledge and capabilities in basic and applied sciences. Our platform incorporates advances across three key components—mRNA, delivery and the manufacturing process— to advance our medicines. We integrate these components and combine different versions of mRNA delivery and process into each of our medicines. \nOur platform: mRNA science advancements\nWe continue to invest in both basic and applied research, seeking to advance both the state of our technology and the state of the scientific community’s understanding of mRNA. Examples of advances in mRNA science that combine nucleotide chemistry, sequence engineering and targeting elements are described below.\nmRNA chemistry: Modified nucleotides to mitigate immune system activation: \nThe innate immune system has evolved to protect cells from foreign RNA, such as viral RNA, by inducing inflammation and suppressing mRNA translation once detected. Many cells surveil their environment through sensors called toll-like-receptors (TLRs). These include types that are activated by the presence of double-stranded RNA (TLR3) or uridine containing RNA fragments (TLR7, TLR8). Additionally, all cells have cytosolic double-stranded RNA, sensors, including retinoic acid inducible gene-I (RIG-I) that are sensitive to foreign RNA inside the cell.\nThe immune and cellular response to mRNA is complex, context specific, and often linked to the sensing of uridine. To minimize undesired immune responses to our potential mRNA medicines, our platform employs chemically-modified uridine nucleotides to minimize recognition by both immune cell sensors such as TLR3/7/8, and broadly-distributed cytosolic receptors such as RIG-I. \nmRNA sequence engineering: Maximizing protein expression: \nmRNA exists transiently in the cytoplasm, during which time it can be translated into thousands of proteins before eventually being degraded. Our platform applies bioinformatic, biochemical, and biological screening capabilities, most of which have been invented internally that aim to optimize the amount of protein produced per mRNA. We have identified proprietary sequences for the 5’-UTR that have been observed to increase the likelihood that a ribosome bound to the 5’-end of the mRNA transcript will find the desired start codon and reliably initiate translation of the coding region.\n \nWe additionally design the nucleotide sequence of the coding region to maximize its successful translation into protein. \nTargeting elements: Enabling tissue-targeted translation: \nAll nucleated cells in the body are capable of translating mRNA, resulting in pharmacologic activity in any cell in which mRNA is delivered and translated. To minimize or prevent potential off-target effects, our platform employs technologies that regulate mRNA translation in select cell types. Cells often contain short RNA sequences, called microRNAs or miRNAs, that bind to mRNA to regulate protein translation at the mRNA level. Different cell types have different concentrations of specific microRNAs, in effect giving cells a microRNA signature. microRNA binding directly to mRNA effectively silences or reduces mRNA translation and promotes mRNA degradation. We design microRNA binding sites into the 3’-UTR of our potential mRNA medicines so that if our mRNA is delivered to cells with such microRNAs, it will be minimally translated and rapidly degraded.\nOur platform: Delivery science\nOur mRNA can, in specific instances, be delivered by direct injection to a tissue in a simple saline formulation without lipid nanoparticles (LNPs) to locally produce small amounts of pharmacologically active protein. However, the blood and interstitial fluids in humans contain significant RNA degrading enzymes that rapidly degrade any extracellular mRNA and prevent broader distribution without LNPs. Additionally, cell membranes tend to act as a significant barrier to entry of large, negatively-charged molecules such as mRNA. We have therefore invested heavily in delivery science and have developed LNP technologies to enable delivery of larger quantities of mRNA to target tissues.\n9\nTable of Contents\nLNPs are generally composed of four components: an amino lipid, a phospholipid, cholesterol, and a pegylated-lipid (PEG-lipid). Each component, as well as the overall composition, or mix of components, contributes to the properties of each LNP system. LNPs containing mRNA injected into the body rapidly bind proteins that can drive uptake of LNPs into cells. Once internalized in endosomes within cells, the LNPs are designed to escape the endosome and release their mRNA cargo into the cell cytoplasm, where the mRNA can be translated to make a protein and have the desired therapeutic effect. Any mRNA and LNP components that do not escape the endosome are typically delivered to lysosomes where they are degraded by the natural process of cellular digestion. Examples of tools we developed by using our platform include proprietary LNP formulations that address the steps of mRNA delivery, including cell uptake, endosomal escape, and subsequent lipid metabolism, and for avoidance of counterproductive interactions with the immune system. \nChemistry: Novel lipid chemistry to potentially improve safety and tolerability: \nOur proprietary LNP systems are designed to be highly tolerated and minimize any LNP vehicle-related toxicities with repeat administration \nin vivo\n. To overcome limitations of previous LNP formulations, we have engineered amino lipids to avoid the immune system and to be rapidly biodegradable relative to prior lipids. \nComposition: Proprietary LNPs enhance delivery efficiency: \nOur platform includes extensive in-house expertise in medicinal chemistry, which we have applied to design large libraries of novel lipids. Using these libraries in combination with our discovery biology capabilities, we have conducted high throughput screens for desired LNP properties and believe that we have made fundamental discoveries in preclinical studies about the relationships between structural motifs of lipids and LNP performance for protein expression. \nSurface properties: Novel LNP design to avoid immune recognition: \nWe have designed our proprietary LNP systems for sustained pharmacology upon repeat dosing by eliminating or altering features that activate the immune system. These are based on insights into the surface properties of LNPs. Upon repeated dosing, surface features on traditional LNPs such as amino lipids, phospholipids, and PEG-lipids, can be recognized by the immune system, leading to rapid clearance from the bloodstream, a decrease in potency upon repeat dosing, and an increase in inflammation.\n \nBased on our insights into these mechanisms, we have engineered our LNP systems to reduce or eliminate undesirable surface features. In clinical studies for our systemic therapeutic product candidates that use our novel LNP systems, we have been able to repeat dose with negligible or undetectable loss in potency, liver damage, and immune system activation.\nOur platform: Manufacturing process science\nWe invest significantly in manufacturing process science to impart more potent features to our mRNA and LNPs, and to invent the technological capabilities necessary to manufacture our mRNA medicines at scales ranging from micrograms to kilograms, as well as achieve pharmaceutical properties such as solubility and shelf life. We view developing these goals of manufacturing and pharmaceutical properties as appropriate for each program, based on its stage of development.\nmRNA manufacturing process: Improving pharmacology: \nOur platform creates mRNA using a cell-free approach called \nin vitro\n transcription in which an RNA polymerase enzyme binds to and transcribes a DNA template, adding the nucleotides encoded by the DNA to the growing RNA strand. Following transcription, we employ proprietary purification techniques to ensure that our mRNA is free from undesired synthesis components and impurities that could activate the immune system in an indiscriminate manner. Applying our understanding of the basic science underlying each step in the manufacturing process, we have designed proprietary manufacturing processes to impart desirable pharmacologic features, for example increasing potency in a vaccine. \nLNP manufacturing process: Improving pharmacology:\n Our platform technology includes synthetic processes to produce LNPs. Traditionally LNPs are assembled by dissolving the four molecular components, amino lipid, phospholipid, cholesterol, and PEG-lipid, in ethanol and then mixing this with mRNA in an aqueous buffer. The resulting mixture is then purified to isolate LNPs from impurities. Such impurities include molecular components that have not been incorporated into particles, un-encapsulated mRNA that could activate the immune system, and particles outside of the desired size range.\n \nGoing beyond optimization of traditional manufacturing processes, we have invested in understanding and measuring the various biochemical and physical interactions during LNP assembly and purification. We have additionally developed state-of-the-art analytical techniques necessary to characterize our LNPs and biological systems to analyze their \nin vitro\n and \nin vivo\n performance. With these insights, we have identified manufacturing process parameters that drive LNP performance, for example, the potency in a secreted therapeutic setting. These insights have allowed us to make significant improvements in the efficiency of our processing and the potency of our LNPs. \n10\nTable of Contents\nHarnessing the power of mRNA through modalities \nWithin our platform, we invest in science to invent novel ways to deliver mRNA into various cell types. Each novel delivery system is a new application, called a “modality.” While the programs within a modality may target diverse diseases, they share similar mRNA characteristics and manufacturing processes to achieve shared product features.  \nWe believe that the high technological correlation within a modality allows us to rapidly accelerate the expansion of programs within that modality based on learnings from the earlier programs, while the lower technology correlation between modalities allows us to compartmentalize the technology risks. Additionally, because programs within a modality pursue diverse diseases, they often have uncorrelated biology risk. New modalities and product candidates can create a network effect by helping us gain additional insight into the other programs in our pipeline. \nAlthough developing a new modality is difficult, time-consuming and expensive, we believe our experience and technology provide us with unique advantages in the development of mRNA medicines. Over the last decade, we have developed a number of modalities, each with one or many product candidates in the clinic. We believe that our ongoing investments in our platform will lead to the identification of additional modalities and expand the utility of our existing modalities and the diversity of our pipeline. \nOUR PIPELINE\nOver the last decade, we have advanced in parallel a diverse development pipeline that currently consists of 44 therapeutic and vaccine programs, eleven of which are in late-stage development. The scope of our pipeline reflects the breadth of biology addressable using mRNA technology, and spans four franchises: respiratory virus vaccines, latent and other vaccines, oncology therapeutics, and rare disease therapeutics. \nOur selection process for advancing new product candidates reflects both program-specific and portfolio-wide considerations. Program-specific criteria include, among other relevant factors, the severity of the unmet medical need, the biology risk of our chosen target or disease, the feasibility of clinical development, the costs of development and the commercial opportunity. Portfolio-wide considerations include the ability to demonstrate technical success for our platform components within a modality, thereby increasing the probability of success and learnings for subsequent programs. We are currently focusing our efforts on delivering up to ten prioritized products over the next three years to drive sales growth and fund the next wave of research and development investment.\nThe diversity of proteins made from mRNA within our development pipeline is shown in the figure below.\n11\nTable of Contents\nOur full pipeline is shown in the figure below:\n12\nTable of Contents\nRESPIRATORY FRANCHISE \nWe have two commercial respiratory virus vaccines—Spikevax (our COVID vaccine) and mRESVIA (our RSV vaccine for older adults). Additionally, we have achieved four positive Phase 3 data readouts for our next-generation COVID vaccine (mRNA-1283), our RSV vaccine for high-risk adults aged 18 to 59 (mRNA-1345), our seasonal flu+COVID vaccine (mRNA-1083), and our seasonal flu vaccine (mRNA-1010). We have a total of 15 respiratory programs in our current portfolio, summarized below.\nCOVID vaccines (Spikevax/mRNA-1273, next-generation mRNA-1283) \nSpikevax is approved for use in jurisdictions globally. COVID-19 is caused by the SARS-CoV-2 virus that was first identified in humans in 2019, driving a global pandemic resulting in millions of deaths. The risk of mortality increases with age and the risk of severe disease and mortality increases for persons with certain pre-existing diseases or comorbid conditions, such as cardiovascular disease, diabetes, chronic lung disease and obesity.\n \nAs the SARS-CoV-2 virus continues to evolve, Spikevax continues to be a key tool in fighting COVID-19. As part of our strategy to continue to combat COVID-19, we develop and assess variant-specific versions of our COVID vaccine. In August and September 2024, we received regulatory approvals in major markets for our updated COVID vaccine, targeting the JN.1 (mRNA-1273.167) and KP.2 (mRNA-1273.712) subvariants of SARS-CoV-2, based on the new variant composition requests from different public health bodies. We developed JN.1 and KP.2 formulations of mRNA-1273 in accordance with regulatory guidance, with the goal of broadening vaccine-induced immunity and providing protection against circulating SARS-CoV-2 variants. We have also observed preliminary clinical trial data showing that these vaccines generate a robust immune response (cross-neutralization) against currently circulating variants of SARS-CoV-2.\nThe FDA has approved Spikevax for individuals 12 years and older, and granted Emergency Use Authorization for individuals aged six months through 11 years. Spikevax has also been authorized for individuals six months and older in other key markets, including the European Union (EU), Canada and Japan.\nForward-looking references to our COVID vaccine in this Annual Report on Form 10-K may include future modifications to mRNA-1273 or other product candidates that are designed to provide protection against variants of the SARS-CoV-2 virus. \nIn addition to Spikevax, we have advanced other COVID vaccine candidates into the clinic as part of our effort to fight the evolving SARS-CoV-2 virus. In June 2024, we announced positive Phase 3 efficacy data for our next-generation COVID vaccine, mRNA-1283. In September 2024, we shared additional data for mRNA-1283, which included non-inferior relative vaccine efficacy (rVE) compared to Spikevax. We filed for FDA approval for mRNA-1283 in 2024 using a priority review voucher, and have been assigned a Prescription Drug User Fee Act (PDUFA) goal date of May 31, 2025. Our goal with mRNA-1283 is to facilitate easier distribution and administration by healthcare providers, as it is designed to have enhanced stability in refrigerated conditions and packaged in pre-filled syringes. \nAs SARS-CoV-2 evolves, we continue to perform continuous epidemiological monitoring, genomic surveillance and risk assessments of variants of concern to determine which new variants may have the ability to circumvent immunity provided by currently approved COVID vaccines. For variants that appear to be growing in circulation and have evolved the ability to evade immunity, we proactively develop new product candidates. We have taken several of these candidates to clinical trials, and our monitoring activities allow for expedited delivery of new vaccines in the event that regulatory agencies request specific vaccine composition updates to address public health needs.\nRSV vaccine (mRESVIA/mRNA-1345)\nRespiratory syncytial virus (RSV) is one of the most common causes of lower respiratory disease in children under the age of five and in older adults. Populations that are especially vulnerable to developing severe RSV infections include infants, young children, children and adults with chronic medical conditions and older adults. Most children are infected at least once by age two. In the United States, it is estimated that over two million children younger than five receive medical attention and up to 80,000 are hospitalized due to RSV infection annually. RSV also causes a substantial burden of respiratory illness in older adults. RSV infection causes up to 160,000 hospitalizations and up to 10,000 deaths per year in adults aged 65 years or older in the United States.\nWe are developing an RSV vaccine (mRNA-1345) for children, pregnant women and adults. mRNA-1345 encodes an engineered form of the RSV F protein stabilized in the prefusion conformation and is formulated in our proprietary LNP. In May 2024, we announced the FDA approved mRNA-1345, brand name mRESVIA, for the prevention of RSV-associated lower respiratory tract disease (RSV-LRTD) in adults 60 years or older. Subsequently, the Advisory Committee on Immunization Practices (ACIP) issued a recommendation for all unvaccinated people aged 75 years and older and unvaccinated people aged 60 to 74 who are at increased risk for RSV to receive the vaccine for the prevention of RSV-associated LRTD and acute respiratory disease. mRESVIA was approved in \n13\nTable of Contents\nthe EU in August 2024 and in Canada in November 2024 for the same indication and ages. It has been approved in additional jurisdictions globally.\nIn September 2024, we announced that our Phase 3 (P303) study designed to test immunogenicity and safety in high-risk adults aged 18 to 59 met all primary immunogenicity endpoints and was well-tolerated with no safety concerns identified. We filed a supplemental Biologics License Application (sBLA) for U.S. approval in December 2024 to extend the indicated age range of mRNA-1345 to high-risk adults 18 to 59 years old using a priority review voucher, and have been assigned a PDUFA goal date of June 12, 2025. A Type II Variation in the EU and a Supplemental New Drug Submission in Canada were also filed in January 2025 for extension of the indication in those countries to high-risk adults 18 to 59 years old. \nWe have additional Phase 3 studies that have generated data in adults to explore co-administration with licensed flu or COVID vaccines, revaccination with mRNA-1345, and expansion to adults aged 18 and older who are immunocompromised due to solid organ transplant. In pediatrics, mRNA-1345 has ongoing safety follow up in Phase 1 and Phase 2 studies, and we are conducting a Phase 2 study in maternal populations. In the third quarter of 2024, we announced the discontinuation of our program of RSV in infants (seronegative, <2 years).\nSeasonal influenza vaccines (mRNA-1010, mRNA-1011, mRNA-1012, mRNA-1020 and mRNA-1030) \nThe World Health Organization (WHO) estimates that seasonal influenza viruses cause three to five million cases of severe illness and 290,000 to 650,000 deaths each year, resulting in a severe challenge to public health. Currently licensed seasonal influenza vaccines rarely exceed 60% overall effectiveness and can provide low effectiveness during years when the circulating viruses do not match the strains selected for the vaccine antigens. \nOur mRNA seasonal influenza vaccine program is taking an iterative approach to development. Our first-generation seasonal influenza vaccine candidate (mRNA-1010) encodes for the hemagglutinin (HA) proteins of the strains recommended by the WHO. We are intending to subsequently improve upon the first-generation candidate through inclusion of additional HA antigens that could provide expanded coverage of co-circulating strains, as well as broadening protection through the addition of another influenza protein, the neuraminidase (NA). We also aim to work with the WHO, regulators and public health authorities to enable strain selection closer to the influenza season to provide a better match to the circulating viruses.\nThe inclusion of additional HA antigens is being tested in our mRNA-1011/1012 programs, and the addition of NA antigens is being tested in our mRNA-1020/1030 programs. We aim to ultimately combine both approaches into a single next-generation vaccine. Phase 1/2 studies for our mRNA-1011/1012 and mRNA-1020/1030 programs have been initiated and interim results have been presented at scientific meetings.\nIn February 2023, we announced interim results from the P301 study of mRNA-1010. The results indicated that mRNA-1010 achieved higher seroconversion rates for A/H3N2 and A/H1N1, as well as superiority on geometric mean titer ratios for A/H3N2 and non-inferiority on geometric mean titer rations for A/H1N1. Non-inferiority was not met for either endpoints for the influenza B/Victoria- or B/Yamagata-lineage strains. mRNA-1010 showed an acceptable safety and tolerability profile. In April 2023, we announced the P302 study of mRNA-1010 did not accrue sufficient cases at the interim efficacy analysis to declare early success in the Phase 3 Northern Hemisphere efficacy trial. In September 2023, we announced the P303 immunogenicity and safety study of mRNA-1010 met all 8 co-primary endpoints with an updated formulation that was able to generate an improved immune response to influenza B strains. mRNA-1010 also elicited higher titers than the licensed comparator against all strains in this study. In September 2024, we shared results in an older adult extension study of P303, where mRNA-1010 met all primary immunogenicity endpoints, including superiority for all strains, compared to a licensed enhanced flu vaccine and showed an acceptable reactogenicity profile. We also announced that we are no longer pursuing an accelerated approval pathway for mRNA-1010, and plan to start a confirmatory vaccine efficacy study, funded by project financing through Blackstone Life Sciences, a partnership we announced earlier in 2024. We have initiated the two-season Phase 3 efficacy study (P304) for mRNA-1010.\nCombination vaccines (mRNA-1083 and mRNA-1365)\nWe are developing combination vaccine candidates to simplify and facilitate protection against a range of respiratory diseases. \nmRNA-1083, our next-generation COVID and seasonal influenza combination vaccine, encodes the same antigens as our updated seasonal influenza vaccine (mRNA-1010) and our next-generation COVID vaccine (mRNA-1283). In June 2024, we announced that our Phase 3 clinical trial of mRNA-1083 met its primary endpoints, eliciting higher immune responses against influenza virus and SARS-CoV-2 than licensed flu and COVID vaccines in adults 50 years and older, including an enhanced influenza vaccine in adults 65 years and older. We filed for FDA approval for mRNA-1083 in November 2024. We have also filed mRNA-1083 for approval in other geographies including the EU, Canada, Australia and the UK. Demonstration of vaccine efficacy in our ongoing Phase 3 \n14\nTable of Contents\nmRNA-1010 flu study may be required to support approval of mRNA-1083 in some markets. In addition, we are preparing to start a Phase 2 study evaluating the safety, reactogenicity and immunogenicity of mRNA-1083 in adults aged 18 to 64.\nSafety follow-up continues in our Phase 1 study for mRNA-1365 in children five to 23 months of age.\nWe are evaluating a new COVID, seasonal flu and RSV combination vaccine using our updated mRNA-1010 composition as well as our next-generation COVID vaccine (mRNA-1283), and are planning development in older adults. We also plan to evaluate an updated version of mRNA-1365, our RSV and hMPV combination vaccine in older adults.\nWe have discontinued development of mRNA-1230, our first-generation COVID, seasonal flu and RSV combination vaccine, and mRNA-1045, our seasonal flu and RSV combination vaccine.\nPandemic influenza vaccine (mRNA-1018) \nAn influenza pandemic is a global outbreak of a new influenza A virus that is very different from current and recently circulating human seasonal influenza A viruses. Pandemic strains can arise by antigenic shift, which is the exchange of genetic segments between a (non-human) influenza virus with another influenza virus; this can occur through a simultaneous infection of an animal (e.g., swine) or humans with multiple influenza viruses. \nWe are developing a pandemic influenza vaccine candidate that encodes for hemagglutinin (HA) glycoproteins with the support of Biomedical Advanced Research and Development Authority (BARDA). In 2023, we initiated a Phase 1/2 study to generate safety and immunogenicity data of our investigational pandemic influenza vaccine (mRNA-1018) in healthy adults 18 years of age and older. The study includes vaccine candidates against H5 and H7 avian influenza viruses.\nIn July 2024, we announced a project award of $176 million through the Rapid Response Partnership Vehicle (RRPV) to accelerate the development of mRNA-based pandemic influenza vaccines. In January 2025, the agreement was expanded through the RRPV, funded by BARDA. The agreement provides additional funding up to $590 million to support the late-stage development and licensure of mRNA-based pre-pandemic influenza vaccines. In addition, the funding will enable the expansion of clinical studies for up to five subtypes of pandemic influenza, enhancing our preparedness to address emerging public health threats. \nLATENT AND OTHER FRANCHISE\nWe have prioritized the development of vaccines against two latent and other viruses with unmet or underserved needs: our vaccine against cytomegalovirus (CMV) (mRNA-1647) and our trivalent norovirus vaccine (mRNA-1403). We have a total of 14 latent and other virus vaccines programs in our current portfolio, summarized below.\nVaccines against latent viruses\nCMV vaccine (mRNA-1647)\nCMV is a common human pathogen and member of the herpes virus family. Congenital CMV (cCMV) results when infected mothers transmit the virus to their unborn child and it is the leading infectious cause of birth defects in the United States. cCMV infection is well-established to occur at a rate of approximately 1 in 200 live births or 0.5%. As a result, the total number of infants in the U.S. born each year who are infected with cCMV fall within the range of 14,400-20,500. There is currently no available vaccine for CMV and a vaccine that leads to durable immunity in women of child-bearing age would address a critical unmet need in the prevention of congenital CMV infection. \nOur CMV vaccine candidate, mRNA-1647, combines six mRNAs in one vaccine. These six mRNAs encode proteins located on the surface of CMV: five mRNAs encode the subunits that form the membrane-bound pentamer complex and one mRNA encodes the full-length membrane-bound glycoprotein B (gB). Both pentamer and gB are essential for CMV to infect barrier epithelial surfaces and gain access to the body, which is the first step in CMV infection. mRNA-1647 is designed to produce an immune response against both pentamer and gB for the prevention of CMV infection, which could reduce the risk of birth defects and post-transplant infections.\nWe are conducting an ongoing pivotal Phase 3 study for mRNA-1647, known as CMVictory, to evaluate the safety and efficacy of mRNA-1647 against primary CMV infection in female participants 16 to 40 years of age. The study is fully enrolled and accruing cases. The Data Safety Monitoring Board (DSMB) met to review the initial study data in December 2024, and informed us that the criterion for early efficacy was not met. The DSMB recommended that the study continue as planned. We remain blinded and anticipate final efficacy data from the study in 2025. \n15\nTable of Contents\nWe are also conducting a Phase 1/2 study of mRNA-1647 in participants 9 to 15 years of age. The study is enrolling and will evaluate the safety and immunogenicity of mRNA-1647 to inform the selection of a dose level for subsequent development in this age group.\n \nAdditionally, in April 2023 we announced that a Phase 2 proof-of-concept study for mRNA-1647 in allogeneic hematopoietic cell transplant (HCT) patients had started enrollment. Enrollment is ongoing.\nEBV vaccine (mRNA-1189 and mRNA-1195)\nEpstein-Barr virus (EBV) is a member of the herpesvirus family that infects approximately 90% of people in the U.S. by adulthood, with primary infection typically occurring during childhood or late adolescence (approximately 50% and 89% seropositivity, respectively). EBV is the major cause of infectious mononucleosis, accounting for over 90% of the cases in the U.S. each year. Infectious mononucleosis can debilitate patients for weeks to months and, in some cases, can lead to hospitalization due to complications such as splenic rupture. EBV infection is also associated with the development and progression of certain lymphoproliferative disorders, cancers and autoimmune diseases. In particular, EBV infection and infectious mononucleosis are associated with increased risk of developing multiple sclerosis (MS), an autoimmune disease of the central nervous system. MS is the most common neurodegenerative disorder of the central nervous system, affecting approximately 2.8 million individuals worldwide of which approximately 1 million live in the U.S. MS leads to progressive disability, with profound socioeconomic impact on the patients, caregivers and the healthcare system.\nWe are developing two EBV vaccine candidates—a vaccine to prevent infectious mononucleosis (mRNA-1189) and a vaccine to prevent or treat the longer-term sequelae of EBV infection (mRNA-1195). We believe that an effective EBV vaccine must generate an immune response against antigens that are required for viral entry and reactivation in susceptible cell types. mRNA-1189 is designed to elicit an immune response to EBV envelope glycoproteins, which are required for infection of both epithelial and B cells. mRNA-1195 encodes for entry glycoproteins and latent antigens aimed at inducing an antibody and T cell response, and will be investigated in the context of post-transplant lymphoproliferative disorders and multiple sclerosis.\nWe are conducting Phase 1, randomized, observer-blind, placebo-controlled studies of mRNA-1189 and mRNA-1195. The primary purpose of these studies is to assess the safety, tolerability and immunogenicity of these vaccine candidates. In March 2024, we shared Phase 1 data for mRNA-1189, where the randomized, observer-blind, placebo-controlled study showed mRNA-1189 was immunogenic and generally well tolerated across all dose levels.\n \nWe have since initiated a dose finding Phase 2 study for mRNA-1189 that is currently in active enrollment. Our Phase 1 study for mRNA-1195 is ongoing, and we announced in March 2024 that the first part of the study was fully enrolled.\nHSV vaccine (mRNA-1608)\nHerpes simplex viruses (HSV), commonly known as herpes, are categorized into two types: HSV-1 primarily spreads by oral contact and is most commonly associated with cold sores, while HSV-2 spreads through sexual contact and is the main cause of recurrent genital herpes. Both viruses establish life-long latent infections within nearby sensory neurons from which they can reactivate and re-infect the skin. There is a significant burden of disease from HSV genital infections. Diagnosed, symptomatic genital herpes causes a reduction in quality of life, which antivirals (current standard of care) only partially restore. In the United States, approximately 18.6 million adults aged 18 to 49 years are living with HSV-2. Globally, an estimated 520 million persons have HSV-2 infection, representing 13% of the world’s population aged 15 to 49 years. We believe that an HSV vaccine could offer significant therapeutic benefit to patients, improve treatment compliance and quality of life. We aim to induce a strong antibody response with neutralizing and effector functionality combined with cell-mediated immunity.\nWe are conducting a Phase 1/2, randomized, observer-blind, controlled, dose-ranging study of mRNA-1608, our HSV vaccine candidate against recurrent HSV-2 disease, in health adults 18 to 55 years of age with recurrent HSV-2 genital herpes. The primary purpose of this study is to assess safety and immunogenicity data, and establish a proof-of-concept of clinical benefit. In March 2024, we announced that this study is fully enrolled with over 300 participants in the U.S.\nVZV vaccine (mRNA-1468)\nHerpes zoster, also known as shingles, is caused by reactivation of the varicella zoster virus (VZV) and occurs in approximately one in three adults in their lifetime, with incidence significantly increasing after 50 years of age. Protective immunity against VZV wanes as the immune system ages, allowing reactivation of the virus from latently infected neurons, causing painful and itchy lesions. Serious herpes zoster complications include postherpetic neuralgia (10-13% of herpes zoster cases), bacterial coinfections and cranial and peripheral palsies; 1-4% of individuals with herpes zoster cases are hospitalized for complications. Severity of disease and likelihood of complications, including postherpetic neuralgia (PHN) also increases with age. People with immunocompromising conditions, people using immunosuppressive therapies, people living with HIV, and hematopoietic stem cell (HSCT) and solid organ transplant \n16\nTable of Contents\n(SOT) recipients have an increased risk of developing herpes zoster. The current standard of care for prevention of shingles is Shingrix, an FDA-approved vaccine for use in adults 50 years and older, and other patients at increased risk for shingles due to immunodeficiency or immunosuppression caused by known disease or therapy. Shingrix was found to be more than 90% efficacious against herpes zoster in adults aged 50 to 70 over more than three years of follow-up in pivotal trials, with only a slight reduction in efficacy in adults over age 70.\nWe are conducting an ongoing Phase 1/2, randomized, observer-blind, active-controlled, dose-ranging study to evaluate the safety, reactogenicity and immunogenicity of mRNA-1468, compared head-to-head with Shingrix, in healthy adults, aged 50 years and older. The first participant was dosed in February 2023 and enrollment of 500 participants was completed in June 2023. Subsequently, we expanded the study to evaluate two additional dose levels, with enrollment now totaling over 650 participants. In March 2024, we presented initial data from a Phase 1/2 trial, which showed that mRNA-1468 elicited strong antigen-specific T cell responses at one month after the second dose and was generally well-tolerated. Results of the first interim analysis support the further clinical development of mRNA-1468 for the prevention of shingles.\nHIV vaccine (mRNA-1644 and mRNA-1574)\nHIV is the virus responsible for acquired immunodeficiency syndrome (AIDS), a lifelong, progressive illness with no effective cure. Approximately 38 million people worldwide are currently living with HIV, with 1.2 million in the U.S. Approximately 1.5 million new infections of HIV are acquired worldwide every year and approximately 680,000 people die annually due to complications from HIV/AIDS. The primary routes of transmission are sexual intercourse and IV drug use, putting young adults at the highest risk of infection. From 2000 to 2015, a total of $562.6 billion globally was spent on care, treatment and prevention of HIV, representing a significant economic burden.\nWe are developing two HIV vaccine candidates—mRNA-1644 and mRNA-1574—both of which are in Phase 1 clinical trials. In collaboration with the International AIDS Vaccine Initiative (IAVI), NIAID and the Gates Foundation, mRNA-1644 is testing a novel HIV vaccine strategy in humans as delivered by mRNA to elicit broadly neutralizing HIV-1 antibodies (bnAbs) through sequential vaccination of novel prime and boost antigens that induce specific B-cell responses. In collaboration with IAVI, Scripps, NIH and the HIV Vaccine Trials Network, mRNA-1574 is testing multiple native-like HIV trimer mRNAs in humans to improve our understanding of how to make stable and immunogenic native-HIV trimers. \nVaccines against enteric viruses\nNorovirus vaccines (mRNA-1403 and mRNA-1405) \nNorovirus is the leading cause of acute gastroenteritis (AGE), responsible for approximately 1 in 5 of all AGE cases worldwide and resulting in substantial health care burden. Annually, norovirus causes an estimated 677 million AGE cases and 213,000 deaths globally, including more than 70,000 deaths in children under the age of five. The global economic impact is estimated at $64.5 billion per year. The incidence of norovirus AGE is highest among young children, while disease severity is most pronounced in young children, older adults, and individuals with underlying medical conditions. In high-income settings such as the U.S., deaths are concentrated among older adults. Norovirus is highly infectious and difficult to control, often causing large and costly outbreaks in closed or semi-closed settings, including daycares, schools, cruise ships, long term care facilities and healthcare institutions. In the U.S., norovirus accounts for an estimated 20 million infections, 100,000 hospitalizations and 900 deaths annually, with an associated economic cost of approximately $10.6 billion. The burden of norovirus among older adults is expected to rise alongside societal aging and the rising demand for institutionalized care.  \nNorovirus has broad genetic diversity; the virus is classified into 10 genogroups and 49 genotypes, 30 of which are known to infect humans. Vaccine development has been challenging to date for many reasons, including the lack of a robust cell culture system, no reliable immune markers of norovirus protection and the broad and shifting diversity of genotypes. A multivalent vaccine with broad genotype coverage is needed to maximize protection against the genotypes most frequently associated with AGE in young children and older adults.\nWe are currently developing pentavalent (mRNA-1405) and trivalent (mRNA-1403) vaccine candidates for norovirus. Both candidates were reviewed in a Phase 1 study to evaluate safety, reactogenicity and immunogenicity in healthy adult participants 18 to 49 years of age and 60 to 80 years of age. Approximately 660 participants were enrolled in the Phase 1 study, and dosing was completed in December 2023. In March 2024, we presented data demonstrating that a single dose of trivalent vaccine candidate mRNA-1403 was well-tolerated across all dose levels evaluated and elicited robust antibody responses against vaccine-matched norovirus genogroup I & II selected genotypes, including functional HBGA-blocking antibodies. In September 2024, we presented additional data that mRNA-1403 elicited robust histo-blood group antigen (HBGA) blocking antibody titers against a second strain in genotype II in older and younger adults. \n17\nTable of Contents\nIn September 2024, we began dosing participants in a Phase 3 study of mRNA-1403. This Phase 3 trial is a randomized, observer-blind, placebo-controlled trial evaluating the efficacy, safety and immunogenicity of mRNA-1403. The trial aims to enroll up to 30,000 participants 18 years of age and older globally, across countries in the Northern Hemisphere (U.S., Canada, UK, Japan), and Panama and Australia. Up to 25,000 participants 60 years of age and older and up to 5,000 participants between 18 and 59 years of age will be enrolled to assess the ability of mRNA-1403 to protect against virus-matched moderate to severe norovirus AGE, with a focus on the older adult age group that is at greatest risk of severe outcomes including hospitalization and death. \nThe two-season Phase 3 study of mRNA-1403 is fully enrolled in the Northern Hemisphere and we are preparing second season enrollment in the Southern Hemisphere. The trial is currently on FDA clinical hold following a single adverse event report of a case of Guillain-Barré syndrome, which is currently under investigation. We do not expect an impact on the study's efficacy readout timeline as enrollment in the Northern Hemisphere has already been completed. \nBacterial vaccines\nLyme vaccines (mRNA-1975 and mRNA-1982)\nLyme disease is an illness caused by Borrelia bacteria, and is usually spread from the bite of a tick carrying the bacteria. Lyme disease affects approximately 120,000 people annually in the U.S. and Europe, with incidence increasing due to expanding tick territories driven by rising temperatures. The disease burden follows a bimodal age distribution, predominantly impacting children under 15 and older adults. Symptoms include rash, fever, headaches, fatigue, joint pain, swelling, stiffness, and headaches. While no vaccines are currently approved, prior Phase 3 trials of outer surface protein A (OspA) antigen-based vaccines achieved efficacy up to 92%, with protection linked to high levels of antigen-specific antibodies.\nWe are conducting a randomized, observer-blind, placebo-controlled, dose-ranging Phase 1/2 trial in healthy participants aged 18 to 70. This trial evaluates the safety and immunogenicity of a heptavalent (mRNA-1975) and monovalent (mRNA-1982) approach in parallel. mRNA-1982 targets Borrelia burgdorferi, responsible for nearly all Lyme cases in the U.S., while mRNA-1975 targets the four major Borrelia species causing disease in the U.S. and Europe.\nNo safety concerns have been identified across the evaluated dose levels for three injections of mRNA-1975/1982. Furthermore, three injections of mRNA-1975/1982 elicit robust anti-OspA IgG antibody responses, with titers up to ~1,300 times above baseline for OspA serotype 1 of Borrelia burgdorferi.\nPublic health vaccines\nZika vaccine (mRNA-1893)\nThe Zika virus is a single stranded RNA virus of the Flaviviridae family. Sero-epidemiology data suggest that it is endemic to regions of Africa and Asia, where the Aedes mosquito vectors are found. Zika virus is predominantly spread by mosquitos from the Aedes genus, but it can also be transmitted congenitally, sexually and through blood donation. Zika infection is usually asymptomatic or mild in adults, leading to fever, rash and conjunctivitis. However, infection of women during pregnancy can result in devastating fetal outcomes, including miscarriages, stillbirths, premature births, and congenital anomalies collectively known as congenital Zika syndrome (microcephaly, limb contractures, high muscle tone, eye abnormalities and hearing loss) in newborns. Microcephaly is a birth defect characterized by an abnormally small head and brain, associated with lifelong neurodevelopmental delay, seizures, intellectual disability, balance problems and dwarfism/short stature, resulting in significant disability and requiring lifelong support. In 2007, a Zika infection outbreak progressed across the Pacific islands. An outbreak observed in Brazil in 2015 soon spread across the Americas, which led the WHO to declare Zika a public health emergency of international concern in 2016. During the period, tens of thousands of cases of microcephaly and congenital Zika syndrome were reported in infants. Zika has also been associated with certain neurological sequelae, such as Guillain-Barré syndrome, reported in adults.\nOur Zika vaccine candidate, mRNA-1893, encodes for the prME structural protein encapsulated in our proprietary LNP. In partnership with BARDA, we conducted Phase 1 and Phase 2 studies. Results of the Phase 1 study were previously published. \nIn November 2024, we presented data from the randomized, observer-blind, placebo-controlled, dose confirmation Phase 2 trial to evaluate the safety, tolerability, and immunogenicity of three regimens of mRNA-1893: a single dose regimen (100 μg) or 2-dose regimens (30 μg or 100 μg given 28 days apart), in adults aged 18 to 65 living in flavivirus endemic and non-endemic areas. The trial enrolled 808 participants (approximately 200 participants per study arm) from the continental United States and Puerto Rico.\n \nThe main portion of the trial followed participants for 6 months after the last dose, with an optional extension phase for follow up to 22 months after last dose. Key findings from the main study showed that mRNA-1893 was generally safe and well tolerated, with no new safety concerns identified. Both 2-dose regimens (30 μg and 100 μg) elicited strong immune responses with no significant differences \n18\nTable of Contents\nin neutralizing antibody (nAb) geometric mean titers across baseline serostatus. Our data (up to end of main study) suggests that a single vaccination of mRNA-1893 in a flavivirus-experienced population may be sufficient to induce robust nAb\n \nresponses against Zika virus; in contrast, a prime-boost strategy with 2-doses of the mRNA-1893 will likely be required in a flavivirus-naive population to obtain a similar level of immunogenicity/protection.\nApproximately half of the main study participants opted in the extension phase, which was completed in 2024; data analysis of the extension phase will provide insight into the long-term safety and durability of immune response to mRNA-1893. At this time, we do not anticipate advancing the Zika program into further development in the absence of external funding.\nNipah vaccine (mRNA-1215) \nNipah virus (NiV) is a zoonotic virus transmitted to humans from animals, contaminated food or through direct human-to-human transmission and causes a range of illnesses including fatal encephalitis. Severe respiratory and neurologic complications from NiV have no treatment other than intensive supportive care. The case fatality rate among those infected is estimated at 40-75%. NiV outbreaks cause significant economic burden to impacted regions due to loss of human life and interventions to prevent further spread, such as the slaughter of infected animals. NiV has been identified as the cause of isolated outbreaks in India, Bangladesh, Malaysia and Singapore since 2000 and is included on the WHO R&D Blueprint list of epidemic threats needing urgent research and development action. \nIn collaboration with the NIH-Vaccine Research Center (VRC), we are conducting an ongoing Phase 1 clinical trial of mRNA-1215, our vaccine candidate against NiV, and testing will be focused on pandemic preparedness. This Phase 1 dose-escalation, open-label clinical trial is the first study of mRNA-1215 in healthy adults to evaluate the safety, tolerability and immunogenicity of a NiV mRNA vaccine candidate. The trial is sponsored and funded by the National Institute of Allergy and Infectious Diseases (NIAID).\nMpox vaccine (mRNA-1769)\nMpox is an infectious viral disease that affects humans and some other animals. It is caused by the monkeypox virus, a member of the Orthopoxvirus genus, which also includes Variola virus, the causative agent of smallpox. Although smallpox was eradicated in 1977, continued protection from smallpox is of great interest given the lethality of the infection and potential for use as an agent of bioterrorism. Other viruses associated with the Orthopoxvirus genus include cowpox, rabbitpox and camelpox.\nThere are two subtypes of the monkeypox virus—Clade I and Clade II, with Clade I endemic in Central Africa and Clade II in West Africa. Clade I is historically associated with more severe disease and increased mortality. Prior to 2022, mpox outbreaks were primarily sporadic, driven by zoonotic spillover in endemic regions. Transmission occurs mainly through close contact with lesions, bodily fluids and contaminated surfaces. Respiratory transmission via face-to-face interaction is also possible. The incubation period ranges from three to 17 days, followed by characteristic progressive rash and systemic symptoms, including fever, chills, lymphadenopathy, fatigue, muscle ache and headache. In 2022, a global outbreak of the Clade II mpox virus was declared a Public Health Emergency of International Concern by the WHO. The outbreak resulted in more than 124,000 confirmed cases across 128 countries. The main mode of transmission during the 2022 global outbreak was sexual transmission. More recently, the Clade I monkeypox virus has also been linked to sexual transmission, during the ongoing outbreak in the Democratic Republic of the Congo (DRC), and with reports of travel-related cases of Clade I in non-endemic areas (North America, Europe, Asia), there is concern that it may lead to further global outbreaks. \nThe current standard of care for mpox is JYNNEOS, which is approved by the FDA for the prevention of mpox and smallpox disease. Our mpox vaccine (mRNA-1769) expresses four antigens from the monkeypox virus and has been shown to provide protection against multiple routes of infection with monkeypox virus. In 2024, we published pre-clinical data showing that, in a stringent non-human primate model, mRNA-1769 resulted in lower lesions and reduced viral replication and induced enhanced neutralizing and functional antibodies compared to existing treatment. Additionally, neutralizing responses were found to cover a broad range of orthopox viruses, including ectromelia, rabbitpox, cowpox and camelpox viruses.\nWe are conducting a randomized, placebo-controlled, dose-ranging, observer-blind Phase 1/2 study to evaluate the safety, tolerability and immunogenicity of three dose levels of mRNA-1769 in healthy participants.\nONCOLOGY THERAPEUTICS FRANCHISE \nWithin our oncology therapeutics franchise, we are developing INT (mRNA-4157) in collaboration with Merck. We and Merck are targeting a variety of tumor types, with Phase 3 trials ongoing in adjuvant melanoma, adjuvant non-small cell lung cancer (NSCLC) and adjuvant NSCLC post neoadjuvant treatment. The Phase 3 clinical trial for adjuvant melanoma completed enrollment in 2024. We \n19\nTable of Contents\nand Merck also have multiple Phase 2 and earlier trials ongoing. We have a total of 8 oncology programs in our current portfolio, summarized below.\nIndividualized Neoantigen Therapy (INT) (mRNA-4157) \nAs tumors grow, they acquire mutations, some of which create new protein segments, or neoantigens, that can be presented on human leukocyte antigen (HLA) molecules in the tumor and recognized as non-self by T cells. While some of these neoantigens could be shared across tumors, the majority are completely unique to an individual patient’s tumor, in addition the presentation of those neoantigens is also dependent on a patient’s specific HLA type. \nOur INT, mRNA-4157, uses next generation sequencing and a machine-learning based algorithm to design an mRNA that encodes up to 34 neoantigens against each individual patient’s tumor mutations with specificity to their HLA type, and is predicted to elicit both class I (CD8) and class II (CD4) responses. The neoantigens are encoded in a single mRNA sequence and formulated in our proprietary LNPs designed for intramuscular injection. INT is manufactured using an automated workflow to enable a rapid turnaround time. \nWe are developing mRNA-4157 in collaboration with Merck. In September 2022, Merck exercised its option for personalized cancer vaccines, including mRNA-4157, pursuant to the terms of our existing PCV Collaboration and License Agreement with Merck, which was amended and restated in 2018 (PCV Agreement, also referred to as the INT Agreement). Pursuant to the PCV Agreement, we and Merck will collaborate on further development and commercialization of mRNA-4157, and we will share costs and any profits and losses worldwide related to mRNA-4157 equally\n.\nIn December 2022, we announced that the randomized Phase 2 trial of mRNA-4157 had met its primary endpoint. The open-label Phase 2 study is investigating a 1 mg dose of mRNA-4157 in combination with Merck’s pembrolizumab (KEYTRUDA®), compared to pembrolizumab alone, for the adjuvant treatment of high-risk resected melanoma. The study showed that mRNA-4157 in combination with KEYTRUDA reduced the risk of recurrence or death by 44% (HR=0.56 [95% CI, 0.31-1.02]; one-sided p value=0.0266) compared with KEYTRUDA alone. The results were the first demonstration of efficacy for an investigational mRNA cancer treatment in a randomized clinical trial in melanoma. Adverse events observed were consistent with those previously reported in a Phase 1 clinical trial, which showed mRNA-4157 to be well-tolerated at all dose levels. \nIn February 2023, mRNA-4157 received a Breakthrough Therapy Designation from the FDA, and in April 2023 mRNA-4157 received PRIME Scheme Designation from the EMA.   \nIn December 2023, we announced that at a planned median follow-up of approximately three years, mRNA-4157 in combination with KEYTRUDA showed sustained benefit, reducing the risk of recurrence or death by 49% (HR=0.510 [95% CI, 0.288-0.906]; one-sided nominal p=0.0095) and the risk of distant metastasis or death by 62% (HR=0.384 [95% CI, 0.172-0.858]; one-sided nominal p= 0.0077) compared to KEYTRUDA alone in stage III/IV melanoma patients with high risk of recurrence following complete resection. This data was presented at the American Society of Clinical Oncology (ASCO) in June 2024, as well as translational biomarker data that suggests mRNA-4157 may benefit a broad patient population, irrespective of the status of PD-L1, TMB, ctDNA, and HLA heterozygosity. Three-year exploratory endpoint data also showed an encouraging trend in overall survival (OS) with the combination versus pembrolizumab monotherapy. \nWe and Merck have rapidly expanded the INT program, initiating Phase 3 studies in the adjuvant setting in patients with high-risk melanoma and NSCLC, and the Phase 3 high-risk melanoma study completing enrollment in 2024. In 2024 we further expanded development into a Phase 3 allowing neoadjuvant treatment in patients with NSCLC; a Phase 2 adjuvant treatment in patients with renal cell carcinoma (RCC), or kidney cancer; a Phase 2 adjuvant treatment in patients with high-risk muscle-invasive bladder cancer (MIBC); and a Phase 2/3 neoadjuvant and adjuvant treatment in patients with cutaneous squamous cell carcinoma (cSCC). \nCheckpoint adaptive immune modulation therapy (mRNA-4359)\nWe are developing a checkpoint adaptive immune modulation therapy (AIM-T) (mRNA-4359) that encodes Indoleamine \n2,3\n-dioxygenase (IDO) and programmed death-ligand 1 (PD-L1) antigens. We designed mRNA-4359 with the goal of stimulating effector T cells that target and kill suppressive immune and tumor cells that express the target antigens. Our initial indications for mRNA-4359 are advanced or metastatic cutaneous melanoma and NSCLC. \nWe presented data from the Phase 1a study of mRNA-4359 at the European Society for Medical Oncology (ESMO) Congress in 2024, where in a population of patients with heavily pre-treated, advanced stage cancers, eight of 16 response-evaluable patients achieved a best overall response (BOR) of stable disease.\n \nTranslational data showed antigen-specific T-cell responses were elicited by mRNA-4359 treatment; a proportion of activated, cytotoxic, and memory T cells were elevated and a proportion of regulatory T cells \n20\nTable of Contents\nand myeloid-derived suppressor cells (MDSCs) were diminished on-treatment.\n \nmRNA-4359 monotherapy was tolerable at all dose levels tested with most adverse events of low grade (grade 1–2) and manageable. Enrollment in the phase 1b portion of the study, which studied mRNA-4359 in combination with pembrolizumab in patients with advanced or metastatic checkpoint inhibitor refractory melanoma and NSCLC, is complete and results will be submitted to a scientific congress for presentation. Following results of the Phase 1b study, we began enrollment of the Phase 2 portion of the study in June 2024.\nRARE DISEASE FRANCHISE\nIn our prioritized portfolio, we are pursuing rare disease therapies targeting two organic acidemias caused by deficient metabolic enzymes—propionic acidemia (PA) and methylmalonic acidemia (MMA). We have a total of seven rare disease programs in our current portfolio, summarized below.  \nPropionic acidemia (PA) (mRNA-3927)\nPA is a rare, inherited metabolic disorder with significant morbidity and mortality, affecting one in 100,000-150,000 individuals worldwide. PA is caused by pathogenic variants in the propionyl-coenzyme A carboxylase (PCC) α or β subunits (PCCA and PCCB genes, respectively), leading to PCC deficiency and subsequent accumulation of toxic metabolites. PA is characterized by recurrent life-threatening metabolic decompensation events (MDEs) and multisystemic complications. Multisystemic complications include neurological manifestations, cardiomyopathy, arrythmias, growth retardation, recurrent pancreatitis, bone marrow suppression and predisposition to infection. Long-term, insults by toxic metabolites cause complications in various organs, and cognitive outcome is negatively correlated with the number of MDEs. Currently, there is no approved therapy for PA that targets the underlying root cause of the disease. \nOur PA therapy candidate, mRNA-3927, is a novel, IV-administered, LNP-encapsulated dual mRNA therapy that encodes for PCCA and PCCB subunit proteins to restore functional PCC enzyme activity in the liver. By encoding for intracellular proteins, mRNA therapy has a potential role in preventing and treating acute metabolic decompensations.\nThe global Phase 1/2 clinical trial for mRNA-3927, the Paramount Study, is ongoing and we have fully enrolled all five dose optimization cohorts, as well as a dose confirmation cohort. The objective of the study is to evaluate the safety and pharmacology of mRNA-3927 in patients aged one year and older with PA. The primary endpoints are safety, pharmacokinetics and pharmacodynamics. Secondary endpoints include incidence and severity of adverse events and change in plasma biomarkers: methylcitric acid (2-MC) and 3-Hydroxypropionic acid (3-HP). \nWe have received Rare Pediatric Disease Designation, Orphan Drug Designation and Fast Track Designation from the FDA and Orphan Designation from the European Commission for the PA program. \nSeveral critical milestones have been reached in the trial. mRNA-3927 has been generally well-tolerated to date with no events meeting protocol-defined dose-limiting toxicity criteria. Early results suggest potential decreases in annualized MDE frequency compared to pre-treatment, and the majority of patients have elected to continue on the open label extension study.\n \nDue to the objective and disease-defining nature of MDEs, regulators have provided initial support for MDE as a clinically meaningful, preferred primary clinical endpoint for development. We began generating registrational trial data in the Phase 1/2 study in 2024.\nMethylmalonic acidemia (MMA) (mRNA-3705)\nMMA is a rare, inherited metabolic disorder with significant morbidity and mortality caused by a deficiency in an enzyme called methylmalonyl-CoA mutase (MUT). There are an estimated 500-2,000 people with MMA MUT deficiency in the United States based on estimated birth prevalence (0.3-1.2:100,000 newborns) and mortality rates. Mortality is significant, with mortality rates of 50% for those with complete MUT deficiency (mut 0) (median age of death 2 years) and 40% for MMA patients with partial MUT deficiency (mut -) (median age of death 4.5 years) reported in a large European study. MMA mainly affects the pediatric population and usually presents in the first few days or weeks of life. The occurrence of acute metabolic decompensations is the hallmark of the disorder and decompensations are typically more frequent in the first few years of life. Each decompensation is life-threatening and often requires hospitalization and management at an intensive care unit. Survivors often suffer from numerous complications including chronic renal failure and neurologic complications such as movement disorders, developmental delays, and seizures. Consequently, the health-related quality of life for MMA patients and their families is significantly impaired. There are currently no approved therapies that address the underlying defect for MMA. \nOur MMA therapy candidate, mRNA-3705, encodes for a missing or deficient hepatic enzyme. In an ongoing Phase 1/2 study, fifteen participants have been dosed. Thus far, all eligible participants have opted to participate in the Open-Label Extension study. To date, mRNA-3705 was generally well-tolerated to date with no discontinuations due to safety and no events meeting protocol-defined dose-limiting toxicity criteria. Initial data is encouraging, with reductions in methylmalonic acid and other pathway biomarkers in participants, particularly at doses of at least 0.4 mg/kg Q2W. Early results suggest potential decreases in annualized rates of MMA-related hospitalizations and MDEs compared to pre-treatment rates. We are working to identify an optimal dose and continue to \n21\nTable of Contents\nengage with the FDA, via the START Program, and other global regulators. We have agreed with the FDA on the pivotal study design, and we expect to start a registrational study in 2025.\n \nGlycogen storage disease type 1a (GSD1a) (mRNA-3745)\nGSD1a is a rare, inherited metabolic disorder caused by a deficiency in the catalytic activity of the intracellular protein glucose 6-phostphatase (G6Pase). GSD1a patients suffer from severe fasting hypoglycemia, hepatomegaly, nephromegaly, lactic acidemia, hypertriglyceridemia, hyperuricemia, hypercholesterolemia, hepatic steatosis and growth retardation. In addition, hepatocellular adenomas occur in 70% to 80% of GSD1a patients by their third decade of life and carries risk of transformation into hepatocellular carcinomas. Proteinuria has been observed in over half of patients above 25 years of age. GSD1a occurs in approximately 1:100,000 live births in the United States and the EU but is more common in Ashkenazi Jews where the incidence is reported to be 1:20,000 live births. There are an estimated 2,500 people in the United States and over 4,000 people in the EU with GSD1a. Although strict diet therapy, including frequent feeding with uncooked cornstarch, allows GSD1a patients to live into adulthood by preventing hypoglycemia, the underlying pathological processes remain uncorrected resulting in the development of many long-term complications including liver adenomas and hepatocellular carcinoma.\nOur GSD1a therapy candidate, mRNA-3745, consists of an mRNA encoding for modified human G6Pase, and has been granted Orphan Drug Designation by the FDA and the European Medicines Agency (EMA). A Phase 1/2 study to evaluate the safety and pharmacology of mRNA-3745 in GSD1a patients 18 years of age and older is ongoing. We have observed encouraging signs of clinical benefit with mRNA-3745.\nOrnithine transcarbamylase (OTC) deficiency (mRNA-3139)\nOrnithine transcarbamylase (OTC) deficiency (OTCD) is an X-linked recessive disorder that is the most common urea cycle disorders (UCDs) in humans. OTCD prevents the breakdown and excretion of ammonia, allowing ammonia to accumulate, rising to toxic levels where it affects the central nervous system. With an incidence of approximately 1:57,000 live births, OTCD accounts for nearly half of all UCDs. OTCD causes high mortality and morbidity, particularly in males.\nOur OTCD therapy candidate, mRNA-3139, is in preclinical development. mRNA-3139 is a chronic intravenous, mRNA, enzyme replacement therapy for OTCD, which may act as a bridge to liver transplant or a standalone therapeutic depending on efficacy. mRNA-3139 uses the same LNP as in our GSD1a program.\nPhenylketonuria (PKU) (mRNA-3210)\nPKU is a rare inherited metabolic disease, affecting approximately 40,000 patients in the United States, France, Germany, Italy, Spain and the UK. Mutations in the phenylalanine hydroxylase (PAH) gene encoding the PAH enzyme result in the inability to metabolize the essential amino acid Phe to Tyr in the liver. There is a high unmet medical need for patients with PKU with early and continuous treatment throughout life being fundamental to prevent the development of irreversible neuropsychiatric outcomes.\nWe determined that the product profile of our preclinical candidate, mRNA-3210, did not meet our criteria to move into the clinic. We are evaluating other preclinical assets for this indication.  \nCrigler-Najjar Syndrome Type 1 (CN-1) (mRNA-3351)\nCN-1 is a severe condition caused by the mutations in the UGT1A1 gene. CN-1 is characterized by high levels of a toxic substance called bilirubin in the blood (hyperbilirubinemia). It is caused by mutations in the UGT1A1 gene, which results in an inability to break down bilirubin, a substance made by the liver. Without the UGT1A1 enzyme, bilirubin can build up in the body and lead to jaundice and damage to the brain, muscles and nerves. The symptoms become apparent shortly after birth and can be life-threatening. It is estimated that there are only approximately 70-100 known cases of CN-1 in the world. Affected individuals rely on current standard of care, phototherapy treatments of up to 12 hours a day, throughout life. The only definitive treatment is liver transplant, which is associated with its own set of side effects and risk of death.\nOur CN-1 therapy candidate, mRNA-3351, consists of an mRNA encoding human UGT1A1 encapsulated in our proprietary LNPs. It is designed to restore the missing or dysfunctional protein that causes CN-1. We have licensed mRNA-3351 to Institute for Life Changing Medicines (ILCM) with no upfront fees and without any downstream payments. The goal of the collaboration is to make an mRNA therapy for the treatment of CN-1 available at no cost to patients. We are collaborating with the ILCM in developing a preclinical package for Investigational New Drug application and Clinical Trial Application filings. ILCM will be responsible for the clinical development of mRNA-3351.\n22\nTable of Contents\nCystic Fibrosis (CF) (mRNA-3692/VX-522)\nCF is a rare genetic disease, which is progressive from birth and leads to multi-organ damage and early death due to lung dysfunction. It is caused by the mutations in the cystic fibrosis transmembrane conductance regulator (CFTR) gene, which results in the loss of CFTR chloride ion channel function. This decreased function of CFTR at the cell surface leads to thick, sticky mucus in multiple organ systems but most pathologically the lungs. There are approximately 92,000 patients living with cystic fibrosis in the United States, Europe, Australia and Canada, with over 5,000 of these patients not being able to benefit from the approved CFTR modulators. \nWe are collaborating with Vertex on our CF candidate, mRNA-3692/VX-522, which is designed to treat the underlying cause of CF by enabling cells in the lungs to produce functional CFTR protein for the treatment of the 10% of patients who do not produce any modulator-responsive CFTR protein. This would be our first demonstration of a nebulized mRNA therapy. The FDA has granted VX-522 Fast Track designation.\nThe multiple ascending dose (MAD) portion of the Phase 1/2 study of VX-522 is underway, with data expected in the first half of 2025.\nPROGRAMS DISCONTINUED IN 2024\nAs a result of portfolio prioritization and emerging clinical data, we elected to discontinue a number of programs in 2024 as we focus our research and development efforts. We do not have current plans for future development of the following programs:\n•\nmRNA-0184: Relaxin (program wrapping up Phase 1)\n•\nmRNA-1045: Seasonal flu and RSV combination vaccine\n•\nmRNA-1230: First-generation COVID, seasonal flu and RSV combination vaccine \n•\nmRNA-1287: Endemic HCoV (the preclinical program will not advance to Phase 1)\n•\nmRNA-1345 and mRNA-1365: We have discontinued RSV development in children < 2 years (seronegative)\n•\nmRNA-6981: PD-L1 (the preclinical program will not advance to Phase 1)\n•\nmRNA-5671: KRAS antigen-specific therapy (no further development plans)\n•\nmRNA-2752: OX40L/IL-23/IL-36\nγ\n (Triplet) (we have deprioritized further development based on emerging clinical data)\nMANUFACTURING \nManufacturing plays a critical role in our value chain and our ability to develop our medicines. Our manufacturing capabilities support every stage of the development of our products, from discovery to commercialization. During the research stage of product development, manufacturing provides mRNA drug substance and drug product for platform research and therapeutic area drug discovery. During early development of our product candidates, we manufacture mRNA and drug product for IND-enabling GLP toxicology studies and initial human clinical studies. For late clinical development, we produce mRNA and drug product for Phase 3 trials. At the commercial stage, we manufacture drug substance and drug product in collaboration with our contract manufacturing organizations (CMOs), both in the United States and internationally.\nOverview of our manufacturing operating model \nOur manufacturing activities generally focus on: \n•\nCommercial Production:\n Our manufacturing capabilities include state-of-the-art technologies for mRNA and drug substance manufacturing, as well as quality control testing to attain a robust and consistent supply that matches target product profiles. Our manufacturing technology is built to scale-up and support production of products for commercial approval. Our platform allows for efficient manufacturing at scale. \n•\nResearch and Development Support:\n The product supply enables platform research and drug discovery in our therapeutic and vaccine areas, in addition to activities related to clinical studies of our product candidates. \nWe have built a dedicated in-house, multi-building manufacturing campus in Norwood, Massachusetts, the Moderna Technology Center (MTC). In December 2024, we purchased the MTC campus, including the underlying land and buildings, providing greater operational flexibility and long-term stability in supporting our manufacturing and development capabilities. The MTC provides supply for our preclinical research, IND-enabling GLP toxicology study supplies, our Phase 1 and Phase 2 pipeline activities, later-stage clinical development activities (e.g., Phase 3 CMV vaccine clinical trials), as well as drug substance commercial production for vaccines. Our vaccine drug substance production for the U.S. market is completed at our MTC campus. The MTC has been designed to allow us to continue to optimize our mRNA products as we explore new pharmaceutical delivery forms in our manufacturing \n23\nTable of Contents\nnetwork such as prefilled syringes. The MTC campus has been designed with a high level of automation and state-of-the-art digital integration to handle manufacturing execution, product testing and release, and regulatory filings.  \nIn the second quarter of 2023, we acquired a newly constructed, \n140,000\n square feet biomanufacturing facility in Marlborough, Massachusetts. The facility is undergoing enhancements, including the addition of \n60,000\n square feet to the existing structure. We expect the facility to be operational in 2025. This new site is strategically intended to support our INT program.\nInternationally, we expect to bring state-of-the-art mRNA manufacturing facilities online in Australia, Canada and the United Kingdom in 2025. The government in each of these countries has entered into a multi-year commitment to purchase mRNA products from us once the covered respiratory vaccine products are approved and the local facilities are licensed for production. We expect that these local manufacturing facilities will provide direct access to rapid pandemic response capabilities and our respiratory virus vaccine candidates. We may seek to enter into future agreements with other governments to provide similar manufacturing capabilities in other geographies. \nIn addition to our internal manufacturing facilities, we also maintain relationships with CMOs in the United States and abroad, providing critical raw material production and fill-finish capacity for our vaccines.   \nManufacturing technology development \nTo support our broad pipeline of products, which spans multiple therapeutic areas and routes of administration, our platform research and technical development teams closely collaborate to facilitate rapid and seamless clinical translation of scientific breakthroughs. This enables us to develop potential medicines to serve a broad patient population. \nTechnical development encompasses the design and optimization of robust and consistent manufacturing processes, product characterization, fit-for-purpose formulations and product presentations. For instance, our novel hardware platforms’ automation and robotics, coupled with the flexibility of our in-house digital development systems, allows for thousands of experiments and process parameters across our projects, thus supporting our drug product pharmaceutical readiness. Moreover, our recent technical manufacturing advances have enabled internalization of new key capabilities, including DNA plasmids and small molecules. \nIn parallel, we continue to refine existing processes, resulting in increased manufacturing capabilities. These improvements allow us better control over our supply chain, resulting in larger production yields and longer shelf life of our products. Furthermore, formulation development advancements have added new drug product images, including lyophilization, giving us a path from frozen to refrigerated storage conditions. \nOur substantial investments in recent years in technical development has enabled the breadth and depth of our pipeline, and laid the foundation to help meet the needs and requirements associated with late-stage development and the commercialization of our products. \nSupply of mRNA for All Stages of Product Development and Commercialization \nSupply for Research \nHigh-throughput automation and custom engineered equipment allow us to produce and deliver high quality mRNA and formulated constructs in a short period of time: our proprietary platform is capable of producing up to 1,000 lots of mRNA sequences and formulations per month with a turnaround time of a few weeks from sequence to final product. The typical scale of mRNA manufactured by this team is 1-1,000 mg. This has been possible, in part, due to the ability of researchers in the Moderna ecosystem to order constructs through an integrated digital portal that tracks materials end-to-end in less than 45 days. In addition, multiple integrated algorithms that leverage artificial intelligence and machine learning optimize manufacturability, reduce failures and increase quality of mRNA sequences. \nSupply for Clinical Development \nWe have established manufacturing capabilities that support the early development stage of product development in three key areas: GLP Tox, Clinical Studies and INTs. We supply formulated product to conduct IND-enabling GLP toxicology studies. In addition, human clinical studies rely on supply to meet required cGMP standards. This is achieved via internal manufacturing at the MTC campus. Our MTC campus is also suited to enable rapid technology development and scale-up for future needs.  \nOur manufacturing also produces cGMP INTs. Due to the specialized nature of personalized medicine (i.e., where a batch is specifically designed and manufactured for a single patient), the manufacturing process for INTs has unique requirements. We digitally integrate patient-specific data from sequencing tumor samples to automatically design INTs for patients. We have developed proprietary bioinformatics designed algorithms linked to an automated manufacturing process for rapid production of formulated \n24\nTable of Contents\nmRNA, with a typical turnaround time of a few weeks. We have operationalized INT manufacturing at the MTC campus to meet our Phase 1 and 2 pipeline supply needs by using single-use systems with fast “needle-to-needle” turnaround times. Unlike traditional process development, each INT batch is manufactured for a single patient and thus scaled-out (in parallel) with extensive use of automation and robotics to account for the larger number of patients involved in later phases of development and commercialization. We have shown consistent quality in our production of many patient batches, each with unique mRNA sequences. In the second quarter of 2023, we acquired a new manufacturing facility in Marlborough, Massachusetts, which we expect to support our INT program. Upon completion, the facility will have state-of-the-art mRNA manufacturing areas, including a full manufacturing clean room, quality control laboratories, and a just-in-time satellite warehouse.\nOur manufacturing capabilities have allowed us to build our broad pipeline of development programs, including the output required to supply related toxicological and human clinical studies. While the technology that underpins these programs is the same, each program typically requires customization based on target product profiles. These custom features range from varying molecular architecture to different routes of administration, often requiring multivalent products. All programs, except for INT, require that we progressively scale up supply to meet clinical demand requirements across development phases, in addition to the necessary preparation for regulatory approval and commercial production, which demand larger batch sizes. In contrast, the INT program seeks to develop a cancer therapeutic that is designed and manufactured for a specific patient, thus increasing the number of unique batches. As we scale manufacturing output for each program, we plan to continuously improve yield, purity and the pharmaceutical properties of our product candidates. \nSupply for Late-Stage Development and Commercialization \nOur development pipeline continues to advance to later-stage development and towards commercialization. Our platform approach allows us to continue to evolve our manufacturing suites and other capabilities at our manufacturing facilities. mRNA manufacturing is flexible and one plant can manufacture multiple vaccines and therapeutics. Our manufacturing facilities also permit us to manufacture products in parallel. For instance, we can produce drug substance and drug product for our Phase 3 CMV clinical trial while manufacturing COVID-19 drug substance in the same facilities. \nQuality Unit \nQuality is core to the way we operate. We seek to ensure quality at Moderna through a combination of a robust Quality Management System (QMS), our quality culture and our people. In accordance with applicable regulations, we have established, documented and implemented a QMS to assure continued compliance with the requirements therein. The QMS facilitates cGMP compliance by implementing practices that identify the various required processes, their application throughout the organization and the sequence of interaction of these processes. \nThe primary mode of documenting these key practices is through policies, standard operating procedures (SOPs), forms and other quality records, which include an overarching Quality Policy and Quality Manual. We have implemented tools and metrics to monitor, measure, and analyze these practices to support cGMP operations, achieve planned results, and support continuous improvement. We monitor these quality metrics through formal governance processes, including Quality Management Review (QMR), to enable continuous improvement. We have also established an independent Quality Unit that fulfills quality assurance and quality control responsibilities. \nEnvironment, Health, and Safety \nWe have established a global Environment, Health, and Safety (EHS) organization to foster a safe and healthy work environment with a focus on sustainability and compliance. Our approach integrates environmentally responsible practices with health and safety measures focused on risk reduction to promote long-term workplace well-being and environmental stewardship. We achieve this through a combination of training, procedures, digital data collection and reporting tools, and corporate programs that drive towards continuous improvement. \nSupply Chain Unit \nWe have established a global supply chain to enable supply of the raw materials and components used to produce our products, consistent with clinical and preclinical demands. We have worked with our external vendors to characterize critical raw materials and to understand their impact on the quality of drug substance and formulated drug product. We also assess the quality system and performance of our external vendors and work with them to comply with regulatory requirements. In addition, we have established an infrastructure to enable direct-to-customer shipments for our commercial products. We leverage third-party wholesalers and integrate with artificial intelligence-driven data analytics to ensure successful ordering and delivery.\n25\nTable of Contents\nEngineering\nOur global engineering organization is structured to deliver exceptional facilities and services. We partner closely with external and internal service providers to incorporate robotics, automation and predictive analysis for equipment operation. Engineering plays a critical role in the design, build, operation and maintenance of our facilities.\nDIGITAL AND AI STRATEGY\nSince our founding, we have been a digital-first company, seeking to use the power of digital information to maximize our impact on patients. mRNA is an information molecule, and our company was built on the premise that the natural flow of information in life can be used to develop medicines. Leveraging over a decade of experience developing mRNA medicines, we have built a large library of data that, combined with our platform approach and cloud-native infrastructure, positions us well to scale a digital operating model using artificial intelligence (AI).\nLed by our Chief People and Digital Technology Officer, our digital organization partners across all Moderna functions to perpetuate and grow Moderna's AI-native culture. To that end, in 2021, we launched our AI Academy, which offers cross-organization training to all of our employees on how they can use AI to transform the way we work. Through the AI Academy, our employees learn how to leverage AI in their specific job functions to augment their capacity and capabilities, and to maximize our impact on patients. \nAI helps optimize each aspect of our value chain, from drug design to commercial manufacturing and beyond. At the research stage, our digital and AI infrastructure allows our scientists to design novel mRNA constructs, use AI algorithms to optimize them and order them from our high throughput preclinical scale production line. Our capabilities allow us to design mRNA, protein and LNP components with desired properties, such as reduced toxicity or increased stability. At the product development stage, AI helps to improve the efficiency of our clinical trial operations by, for example, forecasting participant enrollment and automating clinical trial data processing. \nOur manufacturing processes likewise utilize the power of AI. For example, we leverage a series of fully autonomous, integrated AI algorithms in connection with manufacturing mRNA-4157, our INT candidate. Our machine-learning based algorithms design the specific therapy for each individual patient and optimize the timely manufacture and delivery of INT to each patient. \nAt the commercial stage, our digital and commercial organizations partner to drive performance and prepare for product launches. Digital and AI are key components of our commercialization strategy and are vital to our ability to increase our speed to market, enhance our commercial capabilities and continuously improve the quality of our products. We believe that our ability to move with both scale and speed positions us well to pursue our goals related to future product launches.\nIn early 2023, we began a collaboration with OpenAI to co-innovate with a shared vision of AI’s transformative potential in the future of business and healthcare. In 2024, our AI culture led to the deployment across the company of ChatGPT Enterprise and its enhanced capabilities such as Advanced Analytics, Image Generation and GPTs. These GPTs are now embedded across our business functions, including legal, research, manufacturing and commercial, helping to drive productivity. For example, our Dose ID GPT uses ChatGPT Enterprise’s Advanced Data Analytics feature to further evaluate the optimal vaccine dose selected by the clinical study team. By applying standard dose selection criteria and principles, Dose ID provides a rationale, references its sources, and generates informative charts illustrating the key findings. This allows for a detailed review, led by humans and augmented with AI input, while prioritizing safety and optimizing the vaccine dose profile prior to further development in late-stage clinical trials.  \nWe believe that the integrated AI ecosystem we are building at Moderna will accelerate our mission to deliver the greatest possible impact to people through mRNA medicines. \nCOMMERCIAL\nWe continue to build our differentiated commercial model, with active commercial subsidiaries in key markets across North America, Europe and the Asia-Pacific region. Our commercial footprint provides us with local commercial teams in major markets where respiratory vaccines have high utilization rates and sales. To support the build out of our commercial activities in markets worldwide, we have hired talent with extensive pharmaceutical company experience. Our commercial teams also work with third-party distributors and other partners in countries where we do not have a direct presence. Our commercial activities are dependent on regulatory approvals and on agreements that we have made or may make in the future with strategic collaborators. \nWe currently have two commercial products—Spikevax (our COVID vaccine) and mRESVIA (our RSV vaccine), which is approved for adults aged 60 and older. The commercial markets for these vaccines are seasonal and characterized, particularly in the U.S. (our largest market), by a fragmented customer base, unpredictability in orders and seasonality of deliveries. The private vaccine market is also characterized by market practices regarding rebates, discounts and returns. The respiratory vaccine market, and markets for \n26\nTable of Contents\nCOVID and RSV vaccines in particular, depends on many factors such as medical need, viral evolution, public health authority recommendations and consumer motivation to vaccinate. The market volume for COVID vaccines has been relatively stable for two years, and public health recommendations for vaccinations are normalizing. We are encouraged to see the emergence of a sizable and durable long-term COVID vaccine market. \nBeyond Spikevax and mRESVIA, we continue to advance a broad seasonal respiratory vaccine franchise, consisting of single-agent, next-generation and combination vaccines against respiratory viruses that have the highest medical bur\nden. In 2024, we filed for regulatory approval of our next-generation COVID vaccine, our RSV vaccine for high-risk adults aged 18 to 59, and our flu+COVID combination vaccine for adults 50 years and older. We anticipate potential product launches for each of these products as early as 2025, with additional potential approvals of our seasonal flu vaccine and flu+COVID combination vaccine for adults aged 18 to 49\n over the next several years.\nIn addition to our respiratory vaccine franchise, we are also investing in building out our commercial capabilities for other franchises, including latent and other virus vaccines, rare disease therapeutics and oncology therapeutics. We expect to launch products in each of these franchises over the next several years.\nAdditionally, we expect to bring state-of-the-art mRNA manufacturing facilities online in Australia, Canada and the United Kingdom in 2025. The government in each of these countries has entered into a multi-year commitment to purchase mRNA products from us once the covered respiratory vaccine products are approved and the local facilities are licensed for production. See “—Manufacturing” above for further detail.\nTHIRD-PARTY STRATEGIC ALLIANCES\nStrategic alliances\nWe are party to strategic alliances with a diverse group of collaborators, including pharmaceutical and biotechnology companies, government agencies, academic laboratories, foundations and research institutes with therapeutic area expertise and resources. Through our collaborations, we seek to advance our discovery and development programs, while leveraging our platform and our research and early development capabilities. From time to time, we also partner with and invest in companies developing other types of therapeutics, such as gene editing and cell-therapy, where we believe we can leverage our core mRNA and LNP capabilities to expand the reach of our technology.\nThrough certain of our strategic alliances, we share the rewards and risks of developing a new mRNA modality or program, where we may have early research data and desire a strategic collaborator to join us in advancing early development candidates within such modality into the clinic. Representative relationships and associated programs include those with Merck, for our INT programs (mRNA-4157), and Vertex, for our CF program (mRNA-3692).\nTo maintain the integrity of our platform, our strategic collaboration agreements generally grant either us the rights to develop and commercialize potential mRNA medicines we design and manufacture, or grant our collaborators those rights. These agreements do not allow collaborators to use our platform to generate new mRNA technologies, and we generally retain ownership of intellectual property related to our platform arising from research conducted under the alliance. We may continue to identify potential strategic collaborators who can contribute meaningful technology and insights to our programs and allow us to expand our impact more rapidly to broader patient populations. \nBelow are brief descriptions of certain of our ongoing collaborations.\nMerck—Strategic Alliance for Individualized Neoantigen Therapies\nIn June 2016, we entered into a Collaboration and License Agreement with Merck for the development and commercialization of personalized mRNA cancer vaccines (also known as INTs), which was subsequently amended and restated in 2018 (the INT Agreement), to develop and commercialize INTs for individual patients using our mRNA vaccine and formulation technology. Under the strategic alliance, we identify genetic mutations present in a particular patient’s tumor cells, synthesize mRNA for these mutations, encapsulate the mRNA in one of our proprietary LNPs and administer to each patient a unique INT designed to specifically activate the patient’s immune system against her or his own cancer cells.\nPursuant to the INT Agreement, we received an upfront payment of $200 million from Merck and we were responsible for designing and researching INTs, providing manufacturing capacity and manufacturing INTs and conducting Phase 1 and Phase 2 clinical trials for INTs, alone and in combination with KEYTRUDA (pembrolizumab), Merck’s anti-PD-1 therapy, all in accordance with an agreed upon development plan and budget.\n27\nTable of Contents\nIn September 2022, Merck exercised its option for INTs, including mRNA-4157, pursuant to the terms of the INT Agreement and in October 2022 paid us an option exercise fee of $250 million. Pursuant to the INT Agreement, we and Merck have agreed to collaborate on further development and potential commercialization of INTs, with costs and any profits or losses generally shared equally on a worldwide basis, subject to certain exceptions as outlined in the agreement. \nVertex—2016 Strategic Alliance in Cystic Fibrosis\nIn July 2016, we entered into a Strategic Collaboration and License Agreement (Vertex Agreement) with Vertex Pharmaceuticals Incorporated, and Vertex Pharmaceuticals (Europe) Limited (together, Vertex). The Vertex Agreement is aimed at the discovery and development of potential mRNA medicines for the treatment of CF by enabling cells in the lungs of people with CF to produce functional CFTR proteins.\nOther Collaborations\nWe have entered into additional collaborations where we have agreed to provide funding in areas where we believe we can leverage our mRNA technology. These collaborations include those with:\n•\nCarisma Therapeutics\n, to discover, develop and commercialize \nin vivo \nengineered chimeric antigen receptor monocyte (CAR-M) therapeutics for the treatment of cancer, including solid tumors, and autoimmune diseases.\n•\nCytomX Therapeutics\n, to create investigational mRNA-based conditionally activated therapies utilizing our mRNA technologies and CytomX\n’\ns Probody platform.\n•\nGeneration Bio Co.\n, to combine our biological and technical expertise with core technologies of Generation Bio's non-viral genetic platform. \n•\nImmatics N.V.\n, to pioneer novel and transformative therapies for cancer patients with high unmet medical need.\n•\nLife Edit Therapeutics\n, to discover and develop \nin vivo\n mRNA gene editing therapies.\nWe have made equity investments in Carisma and Generation Bio pursuant to those collaborations.\nStrategic alliances with government organizations and foundations\nDefense Advanced Research Projects Agency (DARPA)\nIn September 2020, we entered into an agreement with DARPA to fund development of a mobile manufacturing prototype leveraging our existing manufacturing technology that is capable of rapidly producing vaccines and therapeutics.\nBiomedical Advanced Research and Development Authority (BARDA)\nCOVID vaccine program\nIn April 2020, we entered into an agreement with BARDA for an award of up to \n$483 million\n to accelerate development of mRNA-1273, our original COVID vaccine. The agreement has been subsequently amended to provide for additional commitments to support various late-stage clinical development efforts of mRNA-1273, including a 30,000 participant Phase 3 study,\n \npediatric clinical trials, adolescent clinical trials and pharmacovigilance studies. The maximum award from BARDA, inclusive of all amendments, was approximately \n$1.8 billion\n. All contract options have been exercised. As of \nDecember 31, 2024\n, the remaining available funding, net of revenue earned was \n$63 million\n.\nPandemic influenza program\nIn June 2024, we were awarded up to \n$176 million\n through the Rapid Response Partnership Vehicle (RRPV) Consortium, funded by BARDA, to accelerate the development of mRNA-based pandemic influenza vaccines. The project award will support the late-stage development of an mRNA-based vaccine to enable the licensure of a pre-pandemic vaccine against the H5 influenza virus. This subtype of the influenza virus causes a highly infectious and severe disease in birds known as avian influenza and poses a risk of spillover into the human population. The agreement also includes additional options to prepare and accelerate a response to future public health threats.\nIn January 2025, we were awarded up to \n$590 million\n through the RRPV, funded by BARDA. This funding builds on the \n$176 million\n award received in June 2024 and will provide additional support for late-stage development and licensure of pre-pandemic mRNA-based influenza vaccines. The agreement will also support the expansion of clinical studies for up to five additional subtypes of pandemic influenza.\n28\nTable of Contents\nInstitute for Life Changing Medicines (ILCM)\nIn September 2021, we entered into a collaboration agreement with the ILCM to develop a new mRNA therapeutic (mRNA-3351) for type 1 Crigler-Najjar syndrome (CN-1). Under the terms of the agreement, we agreed to license mRNA-3351 to ILCM with no upfront fees, and without any downstream payments. ILCM will be responsible for the clinical development of mRNA-3351.\nThe Gates Foundation\nIn January 2016, we entered a global health project framework agreement with the Bill & Melinda Gates Foundation (n/k/a the Gates Foundation) to advance mRNA development projects for various infectious diseases. The Gates Foundation has committed up to $20 million in grant funding to support our initial project related to the evaluation of antibody combinations in a preclinical setting as well as the conduct of a first-in-human Phase 1 clinical trial of a potential mRNA medicine to help prevent HIV infections. Follow-on projects, which could bring total potential funding under the framework agreement up to $100 million (including the HIV antibody project) to support the development of additional mRNA projects for various infectious diseases, can be proposed and approved until the sixth anniversary of the framework agreement, subject to the terms of the framework agreement, including our obligation to grant to the Gates Foundation certain non-exclusive licenses.\nINTELLECTUAL PROPERTY\nWe rely on a combination of intellectual property laws, including patent, trademark, copyright and trade secret, as well as confidentiality and license agreements, to protect our intellectual property and proprietary rights. \nProtecting our platform, modality and program investments: Building an expansive, multi-layered IP estate\nWe have built a substantial IP estate that includes numerous patents and patent applications related to the development and commercialization of mRNA vaccine and therapeutic development candidates, including related platform technologies. Our platform IP protects advances in mRNA design and engineering, proprietary LNP components, delivery systems, processes for the manufacture and purification of drug substances and products and analytical methods. A significant portion of our platform IP estate further provides multi-layered protection for our modalities and programs.\nWith respect to our IP estate, our solely-owned patent portfolio consists of more than 260 issued or allowed U.S. patents or patent applications and more than 140 granted or allowed patents in jurisdictions outside of the U.S. (including granted European patents that have been validated in numerous European countries) covering certain of our proprietary platform technology, inventions and improvements, and covering key aspects of our clinical and most advanced development candidates. We have 700 additional pending patent applications that, in many cases, are counterparts to the foregoing U.S. and foreign patents.\nMost of the patents and applications (if issued) in our portfolio will not expire until 2033 at the earliest. Any patent that may issue from our most recently filed patent applications is projected to expire between 2043 and 2044, at the earliest. We file additional U.S. and foreign patent applications in key markets as necessary to protect our evolving intellectual property positions.\nWe also rely on trademarks, copyright, trade secrets and know-how relating to our proprietary technology and programs, continuing innovation, and in-licensing opportunities to develop, strengthen and maintain our proprietary position in the field of mRNA therapeutic and vaccine technologies. We take additional steps, such as entering into confidentiality and license agreements, to protect our intellectually property and proprietary rights. We additionally plan to rely on data exclusivity, market exclusivity and patent term extensions when and where available, and plan to seek and rely on regulatory protection afforded through orphan drug designations. We also possess substantial proprietary know-how associated with related manufacturing processes and expertise.\nIP protecting our platform\nWe have a broad IP estate covering key aspects of our platform. This estate provides multiple layers of protection covering the making and use of the mRNA drug substance and delivery technologies.\nWith respect to our platform, we have a portfolio that includes U.S. and foreign patents or patent applications covering platform innovations that are related to the design, manufacturing and formulating of mRNA medicines. For example, these patents and patent applications include claims directed to:\n•\nmRNA chemistry imparting improved properties for vaccine and therapeutic uses;\n•\nmethods for mRNA sequence optimization to enhance the levels and fidelity of proteins expressed from our mRNA medicines;\n•\nmethods for identifying epitopes having superior suitability in cancer vaccine contexts;\n•\nengineering elements tailored to enhance stability and the\n in vivo\n performance of mRNA medicines;\n29\nTable of Contents\n•\nLNP delivery systems, including novel lipid components designed for optimal delivery and expression of both therapeutic and vaccine nucleic acids, in particular, prophylactic infectious disease and cancer vaccine nucleic acids, intratumoral immuno-oncology therapeutics, local regenerative therapeutics, systemic therapeutics, and inhaled pulmonary therapeutics; and\n•\ninnovative processes for the manufacture and analysis of mRNA drug substance and formulated drug product.\nIP protection\nOur IP estate provides protection for the multiple programs both at the product-specific level and at various broader levels. For example, we have patent coverage for LNP-encapsulated mRNAs having specific chemical modification suited for vaccine and therapeutic mRNA use. Our estate also includes IP covering certain LNP-encapsulated mRNAs coding for infectious disease antigens for use in preventing or treating infectious diseases, including those caused by respiratory and latent viruses, as well as bacterial, viral and parasitic diseases known to threaten public health. Our mRNA chemistry, formulation and manufacturing patent applications and related know-how, along with trade secrets, may also provide us with additional IP protection relating to our development candidates.\nRespiratory vaccines\nFor our respiratory vaccines programs, we have pursued patent protection featuring composition of matter and method of use claims. Where we may pursue patent protection may vary based on the unique geographic prevalence of various infectious diseases.\nWe have filed several patent applications covering our betacoronavirus vaccine program. We are pursuing patent protection for both our existing and next generation betacoronavirus vaccines. A non-exhaustive list of granted patents covering our COVID vaccine can be found in the following table.\nPatent Number\nCountry/Region*\nPatent Type\nExpiration Date**\n12,208,288\nUnited States\nComposition of Matter\nOctober 21, 2036\n11,622,972\nUnited States\nComposition of Matter\nOctober 22, 2041\n11,524,023\nUnited States\nComposition of Matter\nOctober 22, 2041\n11,485,972\nUnited States\nComposition of Matter\nMay 18, 2038 \n10,898,574\nUnited States\nComposition of Matter and Method of Use\nApril 2, 2032\n10,703,789\nUnited States\nComposition of Matter\nMarch 9, 2033\n10,702,600\nUnited States\nComposition of Matter\nOctober 21, 2036\n10,577,403\nUnited States\nComposition of Matter\nMarch 9, 2033\n10,442,756\nUnited States\nComposition of Matter\nSeptember 16, 2036\n10,266,485\nUnited States\nComposition of Matter\nSeptember 16, 2036\n10,064,959\nUnited States\nComposition of Matter\nOctober 3, 2031\n9,868,692\nUnited States\nComposition of Matter\nSeptember 16, 2036\n3 590 949\nEurope\nComposition of Matter and Method of Use\nOctober 3, 2031\n3 718 565\nEurope\nComposition of Matter\nOctober 21, 2036\n* Selected granted patents in the U.S. and Europe only. Additional granted and pending patents in the U.S., Europe and other countries may be available.\n** Expiration dates listed here include any granted or anticipated patent term adjustment (PTA), but not any patent term extension (PTE) or supplementary protection certificates (SPC).\n30\nTable of Contents\nRSV\nWe have filed several patent applications covering our RSV vaccine.\n \nOur RSV patent portfolio includes multiple families of differing patent breadth\n. A non-exhaustive list of granted patents covering our RSV vaccine can be found in the following table.\nPatent Number\nCountry/Region*\nPatent Type\nExpiration Date**\n11,622,972\nUnited States\nComposition of Matter\nOctober 22, 2041\n11,524,023\nUnited States\nComposition of Matter\nOctober 22, 2041\n11,464,848\nUnited States\nComposition of Matter\nMarch 15, 2038\n10,898,574\nUnited States\nComposition of Matter and Method of Use\nApril 2, 2032\n10,703,789\nUnited States\nComposition of Matter\nMarch 9, 2033\n10,577,403\nUnited States\nComposition of Matter\nMarch 9, 2033\n10,442,756\nUnited States\nComposition of Matter\nSeptember 16, 2036\n10,266,485\nUnited States\nComposition of Matter\nSeptember 16, 2036\n10,064,959\nUnited States\nComposition of Matter\nOctober 3, 2031\n9,868,692\nUnited States\nComposition of Matter\nSeptember 16, 2036\n3 590 494\nEurope\nComposition of Matter and Method of Use\nOctober 3, 2031\n3 350 157\nEurope\nComposition of Matter\nSeptember 16, 2036\n* Selected granted patents in the U.S. and Europe only. Additional granted and pending patents in the U.S., Europe and other countries may be available.\n** Expiration dates listed here include any granted or anticipated patent term adjustment (PTA), but not any patent term extension (PTE) or supplementary protection certificates (SPC).\nInfluenza\nWe have multiple patent families spanning different levels of breadth, design and antigen valency pending in the U.S., \nEurope\n and around the world, including several granted patents.\nhMPV\nHuman metapneumovirus (hMPV) is a single-stranded RNA virus that is used in a combination program. We have patent applications covering our hMPV vaccine pending in the U.S. and Europe, with a granted patent in the U.S.\nLatent vaccines\nWe have vaccine programs and patent applications directed to diseases caused by various latent viruses, including CMV, EBV, HSV and VZV, in some cases, using both preventative vaccines targeting the acute phase and therapeutic vaccines for treating the latent diseases in those who do become infected.\nCMV\nThe patent coverage for our human CMV vaccine candidate is extensive and is based on a vaccine with six mRNAs encoding a pentamer surface glycoprotein complex and the gB surface glycoprotein. Both pentamer and gB facilitate entry of the virus into different cell types and therefore immune responses targeting these proteins can block virus entry, spread and reactivation. The current patent portfolio contains both compositions of matter and methods of treating subjects using the vaccine. In the U.S., our CMV vaccine is covered by multiple issued U.S. patents of differing breadth. Each family has counterparts consisting of pending applications and issued patents in non-U.S. jurisdictions, including, in some cases, Europe and Japan. A separate family of CMV patents, which includes mRNA-1647 plus mRNA-1443 for use in CMV vaccines for transplant indications, is also yielding patents and applications in foreign jurisdictions are pending.\nEBV, HSV and VZV\nSimilar to CMV, we have filed patent applications, and in some cases multiple patent families, for each of EBV, HSV and VZV, e.g., covering prophylactic and/or therapeutic indications. In addition to patent applications filed in the United States, certain of these patent families have foreign counterparts, such as \nin Europe.\n31\nTable of Contents\nPublic health vaccines\nWe maintain a multi-program effort at developing vaccines for potential future pandemics and for use in parts of the world with less well-established health care systems. This group of programs include infectious diseases such as flaviviruses such as Zika and dengue viruses, HIV, Nipah virus, and the Mpox virus. In addition, programs are ongoing in many bacterial diseases. While patent applications are filed on some potential public health targets, in some scenarios, platform patents rather than target specific patents may be used to provide patent protection for public health target vaccines.\nINT\nComposition of matter and method claims are being pursued to protect programs within our oncology therapeutics franchise. Proprietary methods around the making and therapeutic use of our INTs and resulting vaccine compositions are described and claimed in one granted U.S. patent, eight pending U.S. patent applications, six pending European patent applications, one granted patent and five pending patent applications in Japan, three pending patent applications and one granted patent in China, and several pending patent applications in New Zealand, South Africa, Asian and South American countries, as well as one PCT application. These applications also relate to various vaccine design formats, in particular, polyepitopic vaccine formats, and methods of treating cancer with such INTs. We also possess substantial know-how and trade secrets relating to the development and commercialization of our cancer vaccine programs, including related manufacturing process and technology.\nRare diseases\nWe have programs featuring expression of therapeutic proteins, e.g., intracellular enzymes for the treatment of rare diseases. For our rare disease programs, we generally pursue patent protection featuring composition of matter and method of use claims, for example, pharmaceutical composition and method of treatment claims. We have patent applications granted, pending and/or published for our most advanced rare disease development candidates targeting PA and MMA. In addition, we have patent applications granted, pending and/or published for our other rare disease candidates targeting Glycogen Storage Disorder, Type 1a (GSD1a), PKU, Crigler-Najjar Syndrome Type 1 (CN-1) and ornithine transcarbamylase deficiency (OTC).\nAny U.S. and foreign patents that may issue from these patent families would be expected to expire in 2036 for the earliest of the MMA patents and 2038 to 2042 for the remaining MMA, PA, PKU, GSD1a and CN-1 patents, excluding any patent term adjustments, any patent term extensions and any terminal disclaimers.\nAs further described below, as we continue the development of our intended products, we continue to identify additional means of protecting our assets that would potentially enhance commercial success, including possible patent protection for additional methods of use, formulation, or manufacture.\nCystic fibrosis\nOur CF development candidate is covered by pending U.S., European and PCT patent applications.\nGene editing\nOur gene editing program currently has one filed patent family that includes issued patents in the U.S., Europe and Japan, and also pending applications in these jurisdictions. We plan to file patent applications on development candidates and other aspects of gene editing technology as we continue to innovate both internally and through strategic collaborations.\nTrademarks\nOur trademark portfolio currently contains at least 1,250 trademark registrations, including at least 30 registrations in the United States and the remaining in Canada, the European Union, the United Kingdom, Israel, China, Japan, Australia, and elsewhere. In addition, we have at least 360 pending trademark applications in more than 55 jurisdictions, including in the aforementioned locations and additional countries throughout Africa, Asia, and South America.\nIn-licensed intellectual property\nWhile we develop and manufacture our potential mRNA medicines using our internally created mRNA technology platform, we also seek out and evaluate third party technologies and IP that may be complementary to our platform.\n32\nTable of Contents\nPatent sublicense agreements with Cellscript and mRNA RiboTherapeutics\nThe Trustees of the University of Pennsylvania owns several issued U.S. patents, granted European patents and pending U.S. patent applications directed, in part, to nucleoside-modified mRNAs and their uses (the Penn Modified mRNA Patents). mRNA RiboTherapeutics, Inc. (MRT) obtained an exclusive license to the Penn Modified mRNA Patents and granted its affiliate, Cellscript, LLC (Cellscript), a sublicense to the Penn Modified mRNA Patents in certain fields of use.\nIn June 2017, we entered into two sublicense agreements, one with Cellscript, and one with MRT, which agreements we collectively refer to as the Cellscript-MRT Agreements. Together, the Cellscript-MRT Agreements grant us a worldwide, sublicensable sublicense to the Penn Modified mRNA Patents to research, develop, make, and commercialize products covered by the Penn Modified mRNA Patents (licensed products), for all\n in vivo\n uses in humans and animals, including therapeutic, prophylactic, and diagnostic applications. The Cellscript-MRT Agreements are non-exclusive, although Cellscript and MRT are subject to certain time restrictions on granting additional sublicenses for\n in vivo\n uses in humans under the Penn Modified mRNA Patents. The Cellscript-MRT Agreements require us to pay royalties based on annual net sales of licensed products at rates in the low single digits for therapeutic, prophylactic, and diagnostic uses, and royalties based on annual net sales of licensed products sold for research uses at rates in the mid-single digits, subject to certain reductions, with an aggregate minimum floor.\nThe Cellscript-MRT Agreements will terminate upon the expiration or abandonment of the last to expire or become abandoned of the Penn Modified mRNA Patents. Cellscript or MRT, as applicable, may terminate its respective Cellscript-MRT Agreement if we fail to make required payments or otherwise materially breach the applicable agreement, subject to specified notice and cure provisions. Cellscript or MRT, as applicable, may also terminate the applicable Cellscript-MRT Agreement upon written notice in the event of our bankruptcy or insolvency or if we challenge the validity or enforceability of the Penn Modified mRNA Patents. We have the right to terminate each Cellscript-MRT Agreement at will upon 60 days’ prior notice to Cellscript or MRT, as applicable, provided that we cease all development and commercialization of licensed products upon such termination. If rights to MRT or Cellscript under the Penn Modified mRNA Patents are terminated (e.g., due to bankruptcy of MRT or Cellscript), the terminated party will assign its interest in the respective Cellscript-MRT Agreement to the licensor from which it received rights under the Penn Modified mRNA Patents and our rights will continue under the new licensor.\nPatent license agreements with NIAID\nIn December 2022, we entered into a non-exclusive patent license agreement with the National Institute of Allergy and Infectious Diseases (NIAID), an Institute or Center of the National Institutes of Health (NIH), to license certain patent rights concerning stabilizing prefusion coronavirus spike proteins and the resulting stabilized proteins for use in COVID vaccine products. Pursuant to the agreement, we have agreed to pay low single-digit royalties on future net sales, a minimum annual royalty payment and certain contingent development, regulatory and commercial milestone payments on a licensed product-by-licensed product basis.\nIn January 2025, we entered into a non-exclusive patent license agreement with NIAID to license certain patent rights concerning prefusion RSV F proteins and their use. Pursuant to the agreement, we have agreed to pay tiered, low-to-mid single-digit royalties on net sales of our RSV vaccine, a minimum annual royalty payment, and certain contingent development, regulatory and commercial milestone payments on a licensed product-by-licensed product basis.  \nFormulation technology in-licenses\nOur development candidates use internally developed formulation technology that we own. We do, however, have rights to use and exploit multiple issued and pending patents covering formulation technologies under licenses from other entities. If in the future we elect to use or to grant our strategic collaborators sublicenses to use these in-licensed formulation technologies, we or our strategic collaborators may be liable for milestone and royalty payment obligations arising from such use. We consider the commercial terms of these licenses and their provisions regarding diligence, insurance, indemnification and other similar matters, to be reasonable and customary for our industry.\nHUMAN CAPITAL\nWe had approximately 5,800 full-time employees in 18 countries as of \nDecember 31, 2024\n. \nWe operate in a highly competitive environment for talent, particularly as we seek to attract and retain talent with experience in the biotechnology and pharmaceutical sectors. Our workforce is highly educated, and as of December 31, 2024, 43% of our employees hold Ph.D., Doctorate, M.D., J.D. or Master’s degrees. Among our employees, as of December 31, 2024, 49% are female. Among our leadership (which we define as employees at the vice president level and above), as of December 31, 2024, approximately 38% are female. 45% of our U.S. employees identify as racially or ethnically diverse as of December 31, 2024. In 2024, for the third year in a row, an outside statistical pay equity analysis confirmed zero statistically significant differences in pay across gender globally and across gender, race and ethnicity in the United States.\n33\nTable of Contents\nOur approach to attracting and retaining talent \nWe are committed to ensuring that our employees find that their careers at Moderna are filled with purpose, growth and fulfillment. We believe that a career at Moderna provides opportunity for:\n•\nImpact\n: Our people will have the opportunity to do work that is unparalleled in terms of its innovation and scope of impact on people’s lives.\n•\nGrowth\n: We provide incredible opportunities for growth and we obsess over learning (as demonstrated, in part, by our Mindsets (see below). We invest substantially in the development of our people. \n•\nWell-being\n: We are committed to the health and well-being of our employees and their families and provide numerous family-friendly benefits and opportunities to be healthy, including monthly contributions to employee lifestyle spending accounts.\n•\nInclusion\n: We believe in the benefits of bringing together a diverse set of perspectives and backgrounds, and creating an environment where differences are celebrated and leveraged. We measure and hold management accountable to creating an environment where everyone's voice is heard.\n•\nCompelling rewards\n: To attract and retain the best talent, we provide competitive rewards that help to drive groundbreaking work and allow employees to share in the value we will create together, including through our equity programs.\n•\nGiving and volunteering: \nOur people have the opportunity to give back to their communities and directly support causes that they are passionate about through volunteer and employee matching donation programs.\nTo help promote alignment between our employees and our shareholders, all employees participate in our corporate equity programs through the receipt of equity awards, and the percentage of equity as a component of overall pay mix increases with seniority. We also allow our employees to select how they want the value of their award to be split between stock options and restricted stock units (RSUs). We believe that in addition to incentivizing growth that leads to shareholder value, broad eligibility for our equity programs further embeds our \"We behave like owners\" mindset and helps promote employee retention as these awards generally vest over a four-year period.\nNone of our employees have entered into a collective bargaining agreement with us. A small number of employees in France, Italy and Spain are covered by statutory collective bargaining agreements governing certain benefits and working conditions. Employees in our Madrid work center are represented by a works council. None of our other employees are represented by a labor union or a works council. We consider our employee relations to be good.\nWe believe that our employees are highly engaged, and our company and team have been publicly recognized for our leadership, innovation and good corporate citizenship. \nScience\n magazine ranked us as a top employer for each of the last ten years. Additionally, in 2024, \nBiospace\n ranked us the number one large employer in its 2025 Best Places to Work in Biopharma report for the fourth consecutive year. We also received a perfect score from the Human Rights Campaign's Corporate Equality Index for 2025. We measure employee engagement through a vendor-supplied engagement software, using validated external benchmarks to track employee engagement factors.\nWe continually monitor employee turnover rates, as our success depends upon retaining our highly trained personnel. We believe that the competitive compensation we offer, along with the combination of the factors listed above, among other factors, have helped reduce voluntary turnover. In 2024, our voluntary turnover rate was approximately 6%.\nOur approach to training our employees\nTo further invest in our teams, we have established a structured training curriculum for our employees so that every employee becomes deeply familiar with our core technology and technologies that might further enable our innovation. In addition, we are focused on creating strong leaders through various management and leadership trainings. We have also built an online library of videos of a variety of scientific material that our employees can access flexibly. This content includes presentations by external speakers at in-house scientific seminars, scientific courses at external universities and peer-to-peer video series in which in-house experts provide an introductory view of complex topics they tackle within their teams.\nNew employees participate in our Moderna ONE onboarding program, which is an interactive learning experience designed to immerse our people in our culture and Mindsets from day one. Following onboarding, our employees continue to learn throughout their careers at Moderna and we deploy a digital learning management system to track and administer training programs for each of employee. \nIn December 2021, we launched our Artificial Intelligence (AI) Academy. The AI Academy is intended to educate and empower our employees to identify and integrate AI and machine learning solutions into every Moderna system and process to bring mRNA medicines to patients. In 2024, we enhanced the AI Academy with a required GPT training to empower employees to transform the way they work with the power of AI.\n34\nTable of Contents\nOur culture\nAs an organization, we are bold, collaborative, curious and relentless. These values are underpinned by a core set of what we call “basecamp” values— integrity, quality, respect. Additionally, with the continued rapid growth of our company, we articulated the Moderna Mindsets, which define how we behave, lead and make decisions. We believe our Mindsets will be integral to our future success, and we integrate them into every facet of how we identify, onboard, grow and manage our talent.  \nTo further develop and retain our workforce, we conduct periodic talent reviews that identify key talent within the organization. We use that data to inform specific development opportunities for key current and potential future leaders, and to support our periodic succession planning activities for key roles. These steps together ensure we have a robust understanding of our workforce and a talent pipeline to grow future leaders, and provide our employees an opportunity to continuously grow and advance in a way that meets their aspirations and talents.\nCORPORATE SOCIAL RESPONSIBILITY \nAs we pursue our mission to deliver the greatest possible impact to people through mRNA medicines, we have developed a corporate social responsibility (CSR) program that demonstrates our commitment to patients, employees, the environment and local communities. Our CSR framework consists of five key focus areas: medicines for patients, community, governance and ethics, employees and environment. Please refer to our \n2023\n ESG Report under the “Responsibility—Corporate policies” section of our website, which can be found at www.modernatx.com/responsibility/corporate-policies, as well as our proxy statement related to our \n2025\n Annual Meeting of Stockholders that we will file with the SEC, for a description of some of the measures we have taken to progress our commitment to corporate social responsibility.\nCOMPETITION\nThe biotechnology and pharmaceutical industries utilize rapidly advancing technologies and are characterized by intense competition. There is also a strong emphasis on defense of intellectual property and proprietary products. \nmRNA Medicines \nWe believe that mRNA as a medicine coupled with our capabilities across mRNA technology, drug discovery, development and manufacturing provide us with a competitive advantage. However, we face competition from others developing mRNA vaccines and therapeutics, as well as other medicines that compete or could compete with our products. We face competition from various sources, including large pharmaceutical companies, biotechnology companies, academic institutions, government agencies and public and private research institutions. The continued growth of the mRNA field is leading to increased competitive pressure, including from large and more established pharmaceutical companies. We also face competition when entering into strategic alliances to advance and grow our pipeline. \nWe largely compete against Pfizer and BioNTech for sales of our COVID vaccine, whose vaccine is also based on mRNA technology. We also compete against other vaccines, including Sanofi and Novavax’s. Other companies and academic institutions are conducting research on, and may develop, vaccines against COVID or other coronaviruses that could compete with our vaccine. Additionally, some competitors have developed COVID treatments, including Pfizer’s antiviral pill, and the existence of such treatments may reduce demand for vaccines. With respect to our RSV vaccine, we compete against Pfizer and GlaxoSmithKline, who entered the U.S. market prior to us and achieved larger market shares in 2024. Unlike 2024, we expect to participate in the full contracting season in the United States in 2025, and our goal is to increase our market share in the United States and market access globally.  \nCompetition for the sale of our products is impacted by many factors, including, among others, actual and perceived vaccine efficacy, safety and tolerability, perceptions of mRNA technology, storage and handling conditions and the relative ease of distribution and administration, the timing and scope of regulatory approvals, reimbursement coverage and production and distribution costs. \nIn markets that we enter after competitors have already introduced a competing product, we may have difficulty achieving market share, as was the case in connection with the launch of our RSV vaccine. See “Risk Factors—The vaccines market, and pharmaceutical market more generally, is intensely competitive, and we may not compete effectively in the market for existing or new products, treatment methods or technologies.”\nThere are additional companies working on mRNA medicines, some of which have reached commercialization. These companies include BioNTech, Pfizer, Sanofi and GlaxoSmithKline in collaboration with CureVac.\n35\nTable of Contents\nOur Collaborations \nWe and our strategic collaborators also face competition in other therapeutic areas beyond the field of mRNA medicines. These competitors include a growing number of pharmaceutical, biotechnology and academic institutions researching and developing therapies (e.g., CAR-T) against which we could compete in the future. Potentially competitive products are at various stages of development.   \nGOVERNMENT REGULATION\nGovernment authorities in the United States at the federal, state and local level and in other countries and regions, such as in the EU regulate, among other things, the research, development, manufacture and marketing of our products. Generally, before a new medicine can be marketed, considerable data demonstrating its quality, safety and efficacy must be obtained and submitted for review and approved by the competent regulatory authority.\nU.S. drug and biological product development\nIn the United States, the FDA regulates drugs under the Federal Food, Drug, and Cosmetic Act (FDCA) and biologics under the FDCA, the Public Health Service Act (PHSA), each in conjunction with their implementing regulations. Both drugs and biologics also are subject to other federal, state and local statutes and regulations. Failure to comply with applicable U.S. requirements at any time during the product development process, approval process or following approval may subject us to administrative or judicial sanctions. These sanctions could include, among other actions, the FDA’s refusal to approve pending applications, license revocation, a clinical hold, untitled or warning letters, product recalls, market withdrawals, product seizures, total or partial suspension of production or distribution, injunctions, fines, refusals of government contracts, restitution, disgorgement and civil or criminal penalties. \nAny of our product candidates must be approved by the FDA through a BLA or new drug application (NDA), or supplemental BLA or supplemental NDA, process before they may be legally marketed in the United States. \nPreclinical studies\nBefore any of our development candidates may be tested in humans, the development candidate must undergo rigorous preclinical testing. Preclinical studies include laboratory evaluation of product chemistry and formulation, as well as\n in vitro\n and animal studies to assess the potential for adverse events and in some cases to establish a rationale for therapeutic use. The conduct of preclinical studies is subject to federal regulations and requirements, including GLP regulations for safety/toxicology studies. An IND sponsor must submit the results of the preclinical tests, together with manufacturing information, analytical data, any available clinical data or literature and plans for clinical studies, among other things, to the FDA as part of an IND. An IND is a request for authorization from the FDA to administer an investigational product to humans and must become effective before human clinical trials may begin. Unless the FDA raises concerns, an IND automatically becomes effective 30 days after receipt by the FDA. In such a case, the IND sponsor and the FDA must resolve any outstanding concerns before the clinical trial can begin. \nClinical trials\nThe clinical stage of development involves the administration of the investigational medicine to healthy volunteers or patients under the supervision of qualified investigators and in accordance with GCP requirements. Clinical trials are conducted under protocols detailing, among other things, the objectives of the clinical trial, dosing procedures, subject selection and exclusion criteria and the parameters to be used to monitor subject safety and assess efficacy. Each protocol, and any subsequent amendments to the protocol, must be submitted to the FDA as part of the IND. Furthermore, each clinical trial must be reviewed and approved by an Institutional Review Board (IRB) for each institution at which the clinical trial will be conducted to ensure that the risks to individuals participating in the clinical trials are minimized and are reasonable in relation to anticipated benefits. The IRB also approves the informed consent form that must be provided to clinical trial subjects and monitors the clinical trial until completed. Further, progress reports detailing the results of the clinical trials, among other information, must be submitted at least annually to the FDA and more frequently in other situations, including the occurrence of serious adverse events. Information about certain clinical trials must be submitted within specific timeframes for publication on the www.clinicaltrials.gov website.\nUnder the U.S. National Institutes of Health Guidelines for Research Involving Recombinant DNA Molecules (NIH Guidelines), supervision of human gene transfer trials includes evaluation and assessment by an institutional biosafety committee (IBC), a local institutional committee that reviews and oversees research utilizing recombinant or synthetic nucleic acid molecules at that institution. While the NIH Guidelines are only mandatory for research being conducted at or sponsored by institutions receiving NIH funding of recombinant or synthetic nucleic acid molecule research, many companies and other institutions not otherwise subject to the NIH Guidelines voluntarily follow them.\n36\nTable of Contents\nForeign studies conducted under an IND must meet the same requirements that apply to studies being conducted in the United States. Data from a foreign study not conducted under an IND may be submitted in support of a BLA if the study was conducted in accordance with GCP requirements, and the FDA is able to validate the data.\nClinical trials generally are conducted in three sequential phases, which may overlap:\n•\nPhase 1 clinical trials generally involve a small number of healthy volunteers or disease-affected patients to assess the metabolism, pharmacologic action, side effect tolerability, and safety of the investigational medicine.\n•\nPhase 2 clinical trials generally involve disease-affected patients to evaluate proof of concept and/or determine the dosing regimen(s) for subsequent investigations. At the same time, safety and further pharmacokinetic and pharmacodynamic information is collected, possible adverse effects and safety risks are identified, and a preliminary evaluation of efficacy is conducted.\n•\nPhase 3 clinical trials generally involve a large number of disease-affected patients at multiple sites and are designed to provide the data necessary to demonstrate the effectiveness of the investigational medicine for its intended use, its safety in use and to establish the overall benefit/risk relationship of the investigational medicine, and provide an adequate basis for product labeling.\nThe FDA may also require post-approval Phase 4 non-registrational studies to explore scientific questions to further characterize safety and efficacy during commercial use of a drug.\nThe FDA or the clinical trial site may suspend or terminate a clinical trial at any time on various grounds, including a finding that the patients are being exposed to an unacceptable health risk. Similarly, an IRB can suspend or terminate approval of a clinical trial at its institution if the clinical trial is not being conducted in accordance with the IRB’s requirements or if the drug or biologic has been associated with unexpected serious harm to patients. Additionally, some clinical trials are overseen by an independent group of qualified experts organized by the clinical trial sponsor, known as a data safety monitoring board or committee. This group provides authorization for whether a clinical trial may move forward at designated check points based on access to certain data from the clinical trial. \nFDA review process\nFollowing completion of the clinical trials, data are analyzed to assess whether the investigational product is safe and effective for the proposed indicated use or uses. The results of preclinical studies and clinical trials are then submitted to the FDA as part of a BLA or NDA, along with proposed labeling, chemistry, and manufacturing information to ensure product quality and other relevant data. A BLA is a request for approval to market a biologic for one or more specified indications and must contain proof of the biologic’s safety, purity, and potency. An NDA for a new drug must contain proof of the drug’s safety and efficacy. To support marketing approval, the data submitted must be sufficient in quality and quantity to establish the safety and efficacy of the investigational product to the satisfaction of the FDA. FDA approval of a BLA or NDA must be obtained before a biologic or drug may be marketed in the United States. \nBefore approving a BLA or NDA, the FDA will conduct a pre-approval inspection of the manufacturing facilities for the new product to determine whether the facilities comply with cGMP requirements and are adequate to assure consistent production of the product within required specifications. The FDA also may audit data from clinical trials to ensure compliance with GCP requirements. Additionally, the FDA may refer applications for novel products or products which present difficult questions of safety or efficacy to an advisory committee of expert advisors for review, evaluation and a recommendation as to whether the application should be approved and under what conditions, if any. The committee makes a recommendation to the FDA that is not binding but is generally followed. \nAfter the FDA evaluates a BLA or NDA, it will grant marketing approval, request additional information or issue a complete response letter (CRL) outlining the deficiencies in the submission. The CRL may require additional testing or information, including additional preclinical or clinical data, for the FDA to reconsider the BLA or NDA. Even if such additional information and data are submitted, the FDA may decide that the BLA or NDA still does not meet the standards for approval. If the FDA grants approval, it issues an approval letter that authorizes commercial marketing of the product with specific prescribing information for specific indications.\nOrphan drug designation\nUnder the Orphan Drug Act, the FDA may grant orphan designation to a drug or biologic product intended to treat a rare disease or condition, which is generally a disease or condition that affects fewer than 200,000 individuals in the United States, or more than 200,000 individuals in the United States and for which there is no reasonable expectation that the cost of developing and making the product available in the United States for this type of disease or condition will be recovered from sales of the product. \nIf a product that has orphan designation subsequently receives the first FDA approval for the disease or condition for which it has such designation, the product is entitled to orphan drug exclusivity, which means that the FDA may not approve any other applications to \n37\nTable of Contents\nmarket the same drug for the same indication for seven years from the date of such approval, except in very limited circumstances, such as if the latter product is shown to be clinically superior to the orphan product. \nExpedited development and review programs\nThe FDA may employ one of several tools to facilitate and expedite the development and review of a medicine, including fast track designation, breakthrough therapy designation, accelerated approval and priority review designation. Fast track designation is designed to facilitate the development and review of a medicine that treats a serious condition and fills an unmet medical need. Breakthrough therapy designation is designed to expedite the development and review of a medicine that treats a serious condition and preliminary clinical evidence demonstrates substantial improvement over available therapies. Priority review designation means the FDA’s goal is to take action on an application within six months of filing. The FDA may grant priority review designation to a medicine that would provide significant improvement in the safety or effectiveness of a treatment, diagnosis or prevention of a serious condition.\nA product may also be eligible for accelerated approval if it treats a serious or life-threatening condition and generally provides a meaningful advantage over available therapies. In addition, such product must demonstrate an effect on a surrogate endpoint that is reasonably likely to predict clinical benefit or on a clinical endpoint that can be measured earlier than irreversible morbidity or mortality (IMM) that is reasonably likely to predict an effect on IMM or other clinical benefit. As a condition of approval, the FDA may require that a sponsor of a drug or biologic receiving accelerated approval perform adequate and well-controlled post-marketing clinical trials with due diligence. If the FDA concludes that a drug or biologic shown to be effective can be safely used only if distribution or use is restricted, it will require such post-marketing restrictions, as it deems necessary to assure safe use of the product. Under the Food and Drug Omnibus Reform Act of 2022 (FDORA), the FDA is now permitted to require, as appropriate, that such trials be underway prior to approval or within a specific time period after the date of approval for a product granted accelerated approval. Additionally, under FDORA, the FDA has increased authority for expedited procedures to withdraw its accelerated approval for such drug or biologic if, for example, the confirmatory trial fails to verify the predicted clinical benefit of the product.\nEven if a product qualifies for one or more of these programs, the FDA may later decide that the product no longer meets the conditions for qualification or that the time period for FDA review or approval may not be shortened. Furthermore, fast track designation, priority review, accelerated approval, and breakthrough therapy designation do not change the standards for approval.\nEmergency Use Authorization (EUA)\nThe Secretary of Health and Human Services (HHS) may authorize unapproved medical products to be marketed in the context of an actual or potential emergency that has been designated by the U.S. government. The COVID-19 pandemic has been designated as such an emergency. After an emergency has been announced, the Secretary of HHS may authorize the issuance of and thereafter, the FDA Commissioner may issue EUAs for the use of specific products based on certain criteria, including that the product may be effective in diagnosing, treating, or preventing serious or life-threatening diseases when there are no adequate, approved, and available alternatives. An EUA terminates when the emergency determination underlying the EUA terminates. An EUA is not a long-term alternative to obtaining FDA approval, licensure, or clearance for a product. The FDA may revoke an EUA for a variety of reasons, including if the underlying health emergency no longer exists or warrants such authorization.\nIn the United States, the Public Readiness and Emergency Preparedness Act (PREP Act) provides immunity for manufacturers from all claims under state or federal law for “loss” arising out of the administration or use of a “covered countermeasure.” However, injured persons may still bring a suit for “willful misconduct” against the manufacturer under some circumstances. “Covered countermeasures” include “qualified pandemic or epidemic products,” including products intended to diagnose or treat pandemic or epidemic disease, such as pandemic vaccines. For these immunities to apply, the Secretary of HHS must issue a declaration in cases of public health emergency or “credible risk” of a future public health emergency. \nOn March 17, 2020, the Secretary of HHS issued a declaration under the PREP Act and has issued subsequent amendments thereto to provide liability immunity for activities related to certain countermeasures against COVID-19. While we believe our products sold to the U.S. Government will continue to be covered under the provisions of the PREP Act, this cannot be assured.\nPediatric information\nUnder the Pediatric Research Equity Act of 2003, all marketing applications for new active ingredients, indications, dosage forms, dosing regimens or routes of administration must contain an assessment of the safety and effectiveness of the product for the claimed indication in pediatric patients unless this requirement is waived, deferred or inapplicable.\nUnder the Best Pharmaceuticals for Children Act, a product may be eligible for pediatric exclusivity, which adds six months to existing exclusivity periods and patent terms. This exclusivity may be granted based on the voluntary completion of a pediatric study in accordance with an FDA-issued written request for such a study.\n38\nTable of Contents\nPost-approval requirements\nFollowing approval of a new product, the manufacturer and the approved product are subject to continuing regulation by the FDA, including, among other things, monitoring and record-keeping activities, reporting of adverse experiences, complying with promotion and advertising requirements, and limitations on industry-sponsored scientific and educational activities. Although physicians may prescribe legally available products for off-label uses, manufacturers may not market or promote such uses. Prescription drug and biologic promotional materials must be submitted to the FDA in conjunction with their first use. Further, if there are any modifications to the drug or biologic, including changes in indications, labeling or manufacturing processes or facilities, the applicant may be required to submit and obtain FDA approval of a new BLA or NDA or BLA or NDA supplement, which may require the development of additional data or preclinical studies and clinical trials.\nThe FDA may also place other conditions on approvals including the requirement for a Risk Evaluation and Mitigation Strategy (REMS) to assure that the benefits of the product outweigh the risks. A REMS could include medication guides, physician communication plans, or elements to assure safe use, such as restricted distribution methods, patient registries, and other risk minimization tools. Newly discovered or developed safety or effectiveness data may require changes to a product’s approved labeling, including the addition of new warnings and contraindications, and also may require the implementation of other risk management measures, including a REMS or the conduct of post-marketing studies to assess a newly discovered safety issue. Product approvals may be withdrawn for non-compliance with regulatory standards, or if problems occur following initial marketing.\nFDA regulations require that products be manufactured in specific approved facilities and in accordance with cGMP regulations. Entities involved in the manufacture and distribution of approved drugs or biologics and their third-party manufacturers must comply with cGMP regulations that require, among other things, quality control and quality assurance, the maintenance of records and documentation, and the obligation to investigate and correct any deviations from cGMP. Such entities are required to register their establishments with the FDA and certain state agencies, and are subject to periodic unannounced inspections for compliance with cGMP requirements and other laws. The discovery of violations could result in enforcement actions, and the discovery of problems with a product after approval may result in restrictions on a product, manufacturer, or holder of an approved BLA or NDA, including recall.\nU.S. patent term restoration and regulatory data exclusivity\nIn certain circumstances, some U.S. patents may be eligible for limited patent term extension under the Drug Price Competition and Patent Term Restoration Act of 1984, commonly referred to as the Hatch Waxman Amendments. The Hatch Waxman Amendments permit restoration of the patent term of up to five years as compensation for patent term lost during product development and FDA regulatory review process. Patent term restoration, however, cannot extend the remaining term of a patent beyond a total of 14 years from the product’s approval date. The patent term restoration period is generally one half the time between the effective date of an IND and the submission date of a BLA or NDA, plus the time between the submission date of a BLA or NDA and the approval of that application. Only one patent applicable to an approved product is eligible for such an extension and the application for the extension must be submitted prior to the expiration of the patent. The USPTO, in consultation with the FDA, reviews and approves the application for any patent term extension or restoration.\nIf the FDA approves a drug product that contains an active ingredient not previously approved, the product is typically entitled to five years of non-patent regulatory data exclusivity. Other products may be entitled to three years of regulatory data exclusivity if approval was based on the FDA’s reliance on new clinical studies essential to approval submitted by the NDA applicant. If the NDA applicant studies the product for use by children, the FDA may grant pediatric exclusivity, which extends by 180 days each existing exclusivity (patent and regulatory) related to the product. \nAn abbreviated approval pathway for biological products shown to be biosimilar to, or interchangeable with, an FDA-licensed reference biological product was created by the Biologics Price Competition and Innovation Act of 2009 (the BPCI Act). Biosimilarity requires a showing that the product is “highly similar” to the reference product notwithstanding minor differences in clinically inactive components and that there are no clinically meaningful differences between the product and the reference product in terms of safety, purity, and potency. Interchangeability requires that a biological product be biosimilar to the reference product and that the product can be expected to produce the same clinical results as the reference product in any given patient and, for products administered multiple times to an individual, that the product and the reference product may be alternated or switched after one has been previously administered without increasing safety risks or risks of diminished efficacy relative to exclusive use of the reference biological product. A reference biological product is granted 12 years of regulatory data exclusivity from the time of first licensure of the product and the FDA will not accept an application for a biosimilar or interchangeable product based on the reference biological product until four years after the date of first licensure of the reference product. \n39\nTable of Contents\nDrug development in the European Economic Area (EEA)\nMedicinal products can be marketed in the EEA, which is comprised of the 27 Member States of the EU and Norway, Iceland and Liechtenstein, only if a marketing authorization from the competent regulatory authority has been obtained. Similar to the United States, the various phases of preclinical and clinical research in the EU/EEA are subject to significant regulatory controls. Effective since January 2022, the Clinical Trials Regulation (EC) No. 536/2014 aims to streamline and harmonize the procedures for assessment and governance of clinical trials throughout the EU and to require that information on the authorization, conduct and results of each clinical trial conducted in the EU be publicly available.\nPediatric investigation plan\nAn application for marketing authorization of a medicinal product for human use that is not yet authorized in the EU must include a Pediatric Investigational Plan (PIP) pursuant to the Regulation No. 1901/2006 on medicinal products for pediatric use (known as the Paediatric Regulation), unless a waiver applies. A scientific committee established at the European Medicines Agency (EMA), the Paediatric Committee (PDCO) assesses the content of any PIP, waivers, and deferrals for a medicinal product submitted to it and formulates an opinion thereon.\nReview and approval process\nIn the EU/EEA, in order to obtain a marketing authorization from the applicable regulatory authority, a company may submit marketing authorization applications either under a centralized or decentralized procedure. The centralized procedure, which is compulsory for medicines produced by certain biotechnological processes, advanced therapy medicinal products (ATMPs), orphan medicinal products, or those medicines containing a new active substance and intended to treat specific diseases (HIV/AIDS, cancer, neurodegenerative disorders, diabetes, autoimmune and other immune dysfunctions and viral diseases), and optional for those medicines that are highly innovative or contain a new active substance, provides for the grant of a single marketing authorization that is valid throughout the EU/EEA. In addition to the centralized procedure, a marketing authorization can also be obtained in the EU/EEA through a national procedure, which requires a separate application to and approval determination by each country; a decentralized procedure, whereby applicants submit identical applications to several countries and receive simultaneous approval; and a mutual recognition procedure, where applicants submit an application to one country for review and other countries may accept or reject the initial decision.\nA conditional marketing authorization may be granted in the EU when comprehensive clinical data for the safety and efficacy of the medicinal product have not been supplied but all the following requirements are met: (i) the risk-benefit balance of the medicine is positive; (ii) it is likely that the applicant will be in a position to provide the comprehensive clinical data post-authorization; (iii) the medicine fulfills an unmet medical need; and (iv) the benefit to public health of the immediate availability on the market of the medicine outweighs the risk that additional data is still required. Conditional marketing authorizations are valid for one year, on a renewable basis. The marketing authorization holder will be required to fulfil specific obligations within certain timeframes, which may include completing ongoing trials or conducting new trials to confirm that the benefit-risk balance is positive. Once such obligations are fulfilled, provided the benefit-risk balance is still positive, a conditional marketing authorization can be converted into a standard marketing authorization.\nEuropean regulatory data protection\nIn the EU, new innovative products authorized for marketing qualify for regulatory data protection consisting of eight years of data exclusivity and an additional two years of market protection upon the grant of a marketing authorization. Data exclusivity prevents generic or biosimilar applicants from referencing the innovator’s data when applying for a generic or biosimilar marketing authorization. \nDuring the additional two-year period of market protection, a generic or biosimilar marketing authorization application can be submitted, and the innovator’s data may be referenced, but no generic or biosimilar product can be marketed until the expiration of the market protection period. \nThere is no guarantee that a product will be considered by the EU’s regulatory authorities to be an innovative medicinal product, and products may not qualify for regulatory data protection.\nEuropean orphan designation and exclusivity\nOrphan drug designation is available in the EU to promote the development of products that are intended for the diagnosis, prevention, or treatment of life threatening or chronically debilitating conditions affecting not more than five in 10,000 persons in the EU community, or where it is unlikely that the development of the medicine would generate sufficient return to justify the necessary investment in its development, and in each case for which no satisfactory method of diagnosis, prevention, or treatment has been authorized (or, if a method exists, the product would be a significant benefit to those affected). Medicinal products that receive and maintain orphan drug designation following approval are entitled to 10 years of market exclusivity, which protects against applications for and the grant of marketing authorizations for similar medicinal products in the same therapeutic indication. This period may be \n40\nTable of Contents\nreduced to six years if, at the end of the fifth year, it is established that the orphan drug designation criteria are no longer met. During the period of market exclusivity, marketing authorization may only be granted to a similar medicinal product for the same therapeutic indication if: (i) a second applicant can establish that its product, although similar to the authorized product, is safer, more effective or otherwise clinically superior; (ii) the marketing authorization holder for the authorized product consents to a second orphan medicinal product application; or (iii) the marketing authorization holder for the authorized product cannot supply enough orphan medicinal product \nThe aforementioned EU rules are generally applicable in the EEA.\nEuropean data protection regulations\nThe EU General Data Protection Regulation (GDPR) governs the collection and use of personal data in the EU. The GDPR imposes strict requirements relating to the consent of the individuals to whom the personal data relates, the information provided to the individuals, the security and confidentiality of the personal data, data breach notification and the use of third-party processors in connection with the processing of the personal data. The GDPR also imposes strict rules on the transfer of personal data out of the EU, provides an enforcement authority and imposes large penalties for noncompliance, including the potential for fines of up to €20.0 million or 4% of the annual global revenues of the infringer, whichever is greater. The GDPR also confers a private right of action on data subjects and consumer associations to lodge complaints with competent national data protection authorities, seek judicial remedies and obtain compensation for damages resulting from violations of the GDPR. Non-compliance could also result in the imposition of orders to stop data processing activities.\nThe UK has incorporated the GDPR into UK law (the UK GDPR). The UK GDPR and the UK Data Protection Act 2018 set out the UK’s data protection regime, which is independent from but aligned to the EU’s data protection regime. Although the UK is regarded as a third country under the EU’s GDPR, the European Commission has issued a decision recognizing the UK as providing adequate protection under the EU GDPR and, therefore, transfers of personal data originating in the EU to the UK remain unrestricted. Like the GDPR, the UK GDPR restricts personal data transfers outside the UK to countries not regarded by the UK as providing adequate protection. The UK government has confirmed that personal data transfers from the UK to the EEA remain free flowing. Non-compliance with the UK GDPR may result in monetary penalties of up to £17.5 million or 4% of worldwide revenue, whichever is higher.\nMarketing of medicines in the EU\nSimilar to the Anti-Kickback Statute prohibition in the United States discussed below, the provision of benefits or advantages to physicians to induce or encourage the prescription, recommendation, endorsement, purchase, supply, order, or use of medicinal products is prohibited in the EU. Infringement of relevant EU laws could result in substantial fines and imprisonment. Payments may be made to physicians in limited circumstances, and in certain EU Member States such payments must be publicly disclosed. Moreover, agreements with physicians for the provision of services often must be the subject of prior notification and approval by the physician’s employer, his or her competent professional organization, and/or the regulatory authorities of the individual EU Member States. These requirements are provided in the national laws, industry codes, or professional codes of conduct, applicable in the EU Member States. Failure to comply with these requirements could result in reputational risk, public reprimands, administrative penalties, fines, or imprisonment.\nRest of the world regulation\nOutside of the United States and the EU, the requirements governing the conduct of clinical trials, product licensing, pricing, and reimbursement vary from country to country. If we fail to comply with such requirements, we may be subject to, among other things, fines, suspension or withdrawal of regulatory approvals, product recalls, seizure of products, operating restrictions, or criminal prosecution.\nCoverage and reimbursement\nPatients who are provided medical treatment for their conditions generally rely on third-party payors to reimburse all or part of the costs associated with their treatment. Coverage and adequate reimbursement from governmental healthcare programs, such as Medicare and Medicaid, and commercial payors is critical to new product acceptance. Government authorities and other third-party payors, such as private health insurers and health maintenance organizations, decide which drugs and treatments they will cover and the amount of reimbursement.\nIn the United States, no uniform policy of coverage and reimbursement for products exists among third-party payors. As a \nresult, obtaining coverage and reimbursement approval of a product from a government or other third-party payor is a time-consuming and costly process that could require us to provide to each payor supporting scientific, clinical and cost-effectiveness data for the use of \n41\nTable of Contents\nour products on a payor-by-payor basis, with no assurance that coverage and adequate reimbursement will be obtained. In the United States, the principal decisions about reimbursement for new medicines are typically made by the Centers for Medicare & Medicaid Services (CMS). CMS decides whether and to what extent a new medicine will be covered and reimbursed under Medicare and private payors tend to follow CMS to a substantial degree. Even if we obtain coverage for a given product, the resulting reimbursement payment rates might not be adequate for us to achieve or sustain profitability or may require co-payments that patients find unacceptably high. Additionally, third-party payors may not cover, or provide adequate reimbursement for, long-term follow-up evaluations required following the use of product candidates, once approved. Patients are unlikely to use our product candidates, once approved, unless coverage is provided and reimbursement is adequate to cover a significant portion of their cost. There is significant uncertainty related to insurance coverage and reimbursement of newly approved products. It is difficult to predict at this time what third-party payors will decide with respect to the coverage and reimbursement for our product candidates.\nNet prices for drugs may be reduced by mandatory discounts or rebates required by government healthcare programs or private payors and by any future relaxation of laws that presently restrict imports of drugs from countries where they may be sold at lower prices than in the United States. In addition, many pharmaceutical manufacturers must calculate and report certain price reporting metrics to the government, such as average sales price and best price. Penalties may apply in some cases when such metrics are not submitted accurately and timely.\nWe expect that healthcare reform measures that may be adopted in the future may result in more rigorous coverage criteria and in additional downward pressure on the price that we receive for any approved product. Additionally, legislative and regulatory proposals have been made to expand post-approval requirements and restrict sales and promotional activities for pharmaceutical products.\nIn addition, in some foreign countries, the proposed pricing for a drug must be approved before it may be lawfully marketed. The requirements governing drug pricing vary widely from country to country. For example, the EU provides options for its Member States to restrict the range of medicinal products for which their national health insurance systems provide reimbursement and to control the prices of medicinal products for human use. To obtain reimbursement or pricing approval, some of these countries may require the completion of clinical trials that compare the cost effectiveness of a particular product candidate to currently available therapies. A Member State may approve a specific price for the medicinal product or it may instead adopt a system of direct or indirect controls on the profitability of the company placing the medicinal product on the market. There can be no assurance that any country that has price controls or reimbursement limitations for pharmaceutical products will allow favorable reimbursement and pricing arrangements for any of our product candidates. Historically, products launched in the EU do not follow price structures of the United States and generally prices tend to be significantly lower.\nFor further information on certain risks associated with the pricing and reimbursement of our products see \n“Risk Factors\n—Sales of pharmaceutical products depend on the availability and extent of reimbursement from third-party payors, and we may be adversely impacted by changes to such reimbursement policies or rules.\n”\nOther healthcare laws\nHealthcare providers, physicians, and third-party payors, including governmental payors, such as Medicare and Medicaid in the United States, will play a primary role in the recommendation and prescription of any marketed products. Any arrangements with these parties implicate certain fraud and abuse and other healthcare laws and regulations. In the United States, these laws include, among others:\n•\nThe Anti-Kickback Statute, which makes it illegal for any person to knowingly and willfully solicit, receive, offer, or pay any remuneration, directly or indirectly, in cash or in kind, that is intended to induce or reward referrals, including the purchase, recommendation, order or prescription of a particular drug or any other good or service, for which payment may be made under a federal healthcare program, such as Medicare or Medicaid. \n•\nThe federal False Claims Act, which imposes civil penalties, including through civil whistleblower or qui tam actions, against individuals or entities (including manufacturers) for, among other things, knowingly presenting, or causing to be presented, false or fraudulent claims for payment by a federal healthcare program or making a false statement or record material to payment of a false claim or avoiding, decreasing, or concealing an obligation to pay money to the federal government.\n•\nHealth Insurance Portability and Accountability Act of 1996 (HIPAA), which imposes criminal and civil liability for, among other things, knowingly and willfully executing a scheme, or attempting to execute a scheme, to defraud any healthcare benefit program, including private payors, or falsifying, concealing, or covering up a material fact or making any materially false statements in connection with the delivery of or payment for healthcare benefits, items or services. \n•\nHIPAA, as amended by the Health Information Technology for Economic and Clinical Health Act of 2009 (HITECH), and their respective implementing regulations, which impose, among other things, requirements on covered entities and their business associates relating to the privacy and security of individually identifiable health information. \n•\nThe Physician Payments Sunshine Act, enacted as part of the Patient Protection and Affordable Care Act (ACA), which requires certain pharmaceutical manufacturers with products reimbursed under certain government programs to disclose annually to the \n42\nTable of Contents\nfederal government (for re-disclosure to the public) certain payments and other transfers of value provided to physicians, teaching hospitals and certain other licensed health care practitioners. \n•\nFederal government price reporting laws, which require us to calculate and report complex pricing metrics in an accurate and timely manner to government programs.\n•\nFederal consumer protection and unfair competition laws, which broadly regulate marketplace activities and activities that potentially harm consumers.\n•\nAnalogous state fraud and abuse laws and regulations, such as state anti-kickback and false claims laws, which may be broader in scope and apply regardless of payor. \nAdditionally, certain state and foreign laws also govern the privacy and security of health information. Such data privacy and security laws may differ from each other in significant ways and often are not pre-empted by HIPAA, thus complicating compliance efforts. For example, the California Consumer Protection Act (CCPA) established a comprehensive privacy framework for covered businesses by creating an expanded definition of personal information, establishing new data privacy rights for consumers in the State of California, imposing special rules on the collection of consumer data from minors, and creating a new and potentially severe statutory damages framework for violations of the CCPA and for businesses that fail to implement reasonable security procedures and practices to prevent data breaches. Further, the California Privacy Rights Act (CPRA), which took effect on January 1, 2023, has established additional obligations with respect to processing and storing personal information. The CPRA significantly modified the CCPA, including by expanding customers' rights with respect to certain sensitive personal information. While clinical trial data and information governed by HIPAA are currently exempt from the current versions of the CCPA and CPRA, other personal information is applicable due to the CPRA’s broader scope. Similar laws have been passed or proposed in numerous other states.\nThe scope and enforcement of each of these laws is uncertain and subject to rapid change in the current environment of healthcare reform. \nCurrent and future healthcare reform legislation\nIn the United States and foreign jurisdictions, there have been a number of legislative and regulatory changes and proposed changes regarding the healthcare system that could prevent or delay marketing approval of our investigational medicines, restrict or regulate post-approval activities and affect our ability to profitably sell any approved products. The ACA, for example, contains provisions that subject biological products to potential competition by lower-cost biosimilars and may reduce the profitability of drug products through increased rebates for drugs reimbursed by Medicaid programs, extension of Medicaid rebates to Medicaid managed care plans, mandatory discounts for certain Medicare Part D beneficiaries and, annual fees based on pharmaceutical companies’ share of sales to federal health care programs. Current laws, as well as other healthcare reform measures that may be adopted in the future, may result in more rigorous coverage criteria and in additional downward pressure on the price for any approved products.\nIn the United States, it is unclear whether the ACA will be overturned or further amended. We cannot predict what effect further changes to the ACA would have on our business. Additionally, other federal health reform measures have been proposed and adopted in the United States since the ACA was enacted, including the Budget Control Act of 2011, which includes provisions to reduce the federal deficit. The Budget Control Act, as amended, resulted in the imposition of 2% reductions in Medicare payments to providers, which began in April 2013 and will remain in effect through 2031 unless additional Congressional action is taken. In 2021, President Biden signed the American Rescue Plan Act of 2021 into law, which eliminated the statutory Medicaid drug rebate cap, previously set at 100% of a drug’s average manufacturer price, for single source and innovator multiple source drugs, beginning in 2024. These laws and regulations may result in additional reductions in Medicare and other healthcare funding and otherwise affect the prices we may obtain for any of our product candidates for which we may obtain regulatory approval or the frequency with which any such product candidate is prescribed or used. \nIn August 2022, the Inflation Reduction Act of 2022 (IRA) was signed into law. The IRA includes several provisions that will impact our business to varying degrees, including provisions that create a $2,000 out-of-pocket cap for Medicare Part D beneficiaries, impose new manufacturer financial liability on all drugs in Medicare Part D, allow the U.S. government to negotiate Medicare Part B and Part D pricing for certain high-cost drugs and biologics without generic or biosimilar competition, require companies to pay rebates to Medicare for drug prices that increase faster than inflation and delay the rebate rule that would require pass through of pharmacy benefit manager rebates to beneficiaries. The effect of IRA on our business and the healthcare industry in general is not yet known. \nFurther, there has been heightened governmental scrutiny over the manner in which manufacturers set prices for their marketed products, which have resulted in several Congressional inquiries and proposed bills designed to, among other things, bring more transparency to product pricing, review the relationship between pricing and manufacturer patient programs and reform government program reimbursement methodologies for products. In addition, the federal government, state legislatures, and foreign governments have shown significant interest in implementing cost containment programs, including price-controls and price transparency, restrictions on reimbursement, and requirements for substitution of generic products for branded prescription drugs to limit the growth of government paid health care costs. For example, the federal government has passed legislation requiring pharmaceutical \n43\nTable of Contents\nmanufacturers to provide rebates and discounts to certain entities and governmental payors to participate in federal healthcare programs.  \nEnvironment\nWe are subject to state and federal laws regarding environmental protection and hazardous substances, including the Occupational Safety and Health Act, the Resource Conservation and Recovery Act and the Toxic Substances Control Act. These and other laws govern the use, handling and disposal of various biologic, chemical and radioactive substances used in, and wastes generated by, operations. If our operations result in contamination of the environment, breach of our regulatory obligations or expose individuals to harm, we could be liable for damages and governmental fines. Equivalent laws have been adopted in foreign countries that impose similar obligations.\nCORPORATE INFORMATION\nWe were incorporated under the laws of the State of Delaware on July 22, 2016. We are the successor in interest to Moderna LLC, a limited liability company formed under the laws of the State of Delaware in 2013. Moderna LLC was the successor in interest to Moderna Therapeutics, Inc., a Delaware corporation incorporated in 2009 as Newco LS18, Inc. by Flagship Pioneering. In August 2018, we changed our name from Moderna Therapeutics, Inc. to Moderna, Inc. Our principal corporate office is located at 325 Binney Street, Cambridge, MA 02142, and our telephone number is (617) 714-6500.\nOur website, www.modernatx.com, including the Investor Relations section, www.investors.modernatx.com; corporate blog www.modernatx.com/moderna-blog, and our Statements and Perspectives webpage, https://investors.modernatx.com/Statements--Perspectives/default.aspx; as well as our social media channels: Facebook, www.facebook.com/modernatx; X, www.x.com/moderna_tx; and LinkedIn, www.linkedin.com/company/modernatx; contain a significant amount of information about us, including financial and other information for investors. We encourage investors to visit these websites and social media channels as information is frequently updated and new information is shared. The information on our website and that we disclose through social media channels is not incorporated by reference in this Annual Report on Form 10-K or in any other filings we make with the Securities and Exchange Commission (the SEC).\nWe make available free of charge on or through our website certain reports and amendments to those reports that we file with or furnish to the SEC pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. These include our Annual Reports on Form 10-K, our Quarterly Reports on Form 10-Q and our Current Reports on Form 8-K, and amendments to those reports.\nThe SEC also maintains an Internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding us and other issuers that file electronically with the SEC.\n44\nTable of Contents",
  "item7": "Item 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion and analysis of our financial condition and results of operations together with our consolidated financial statements and related notes and other financial information appearing elsewhere in this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our plans and strategy for our business, includes forward-looking statements that involve risks and uncertainties. As a result of many factors, including those factors set forth in “Part I, Item 1A - Risk Factors” section of this Annual Report on Form 10-K, our actual results could differ materially from the results described in or implied by the forward-looking statements contained in the following discussion and analysis.\nOverview \nWe are a biotechnology company advancing a new class of medicines made of messenger RNA (mRNA). mRNA medicines are designed to direct the body’s cells to produce intracellular, membrane or secreted proteins that have a therapeutic or preventive benefit with the potential to address a broad spectrum of diseases. Our platform builds on continuous advances in basic and applied mRNA science, delivery technology and manufacturing, providing us the capability to pursue in parallel a robust pipeline of new development candidates. We are developing medicines across four franchises: respiratory virus vaccines, latent and other virus vaccines, oncology therapeutics and rare disease therapeutics.\nSince our founding in 2010, we have transformed from a research-stage company advancing programs in the field of mRNA to a commercial enterprise with a diverse clinical portfolio of vaccines and therapeutics across several modalities, a broad intellectual property portfolio and integrated manufacturing capabilities that allow for rapid clinical and commercial production at scale. We have a diverse and extensive development pipeline of 34 development candidates across our 44 development programs, of which 41 are in clinical studies currently.\nOur COVID vaccine is our first commercial product and is marketed, where approved, under the name Spikevax®. Our original vaccine, mRNA-1273, targeted the SARS-CoV-2 ancestral strain, and we have leveraged our mRNA platform to rapidly adapt our vaccine to emerging SARS-CoV-2 strains to provide protection as the virus evolves and regulatory guidance is updated. In May 2024, the U.S. Food and Drug Administration (FDA) granted approval for mRESVIA® (mRNA-1345), our mRNA vaccine against respiratory syncytial virus (RSV), to protect adults aged 60 and older from lower respiratory tract disease caused by RSV infection. This marks our second approved mRNA product and underscores our ongoing commitment to delivering solutions for patients by addressing global public health threats related to infectious diseases.\n2024 Business Highlights\n \nRespiratory Vaccines\nDuring the fourth quarter of 2024, we achieved significant milestones in our respiratory vaccine portfolio. We filed for regulatory approval with the FDA for our next-generation COVID vaccine (mRNA-1283), supported by positive Phase 3 efficacy and immunogenicity data, leveraging a priority review voucher, and have been assigned a Prescription Drug User Fee Act (PDUFA) goal date of May 31, 2025. We also submitted a regulatory application for our respiratory syncytial virus (RSV) vaccine, mRESVIA (mRNA-1345), for high-risk adults aged 18 to 59, following positive Phase 3 data and using a priority review voucher, and have been assigned a PDUFA goal date of June 12, 2025. Additionally, we filed for FDA approval of our flu+COVID combination vaccine (mRNA-1083), based on positive Phase 3 immunogenicity data in adults aged 50 years and older.\nNet Product Sales and Net (Loss) Earnings Per Share\nFor the year ended December 31, 2024, we recognized net product sales of $3.1 billion from sales of our COVID and RSV vaccines, compared to $6.7 billion and $18.4 billion for the years ended December 31, 2023 and 2022, respectively. Loss per share was $(9.28) for the year ended December 31, 2024, compared to (loss) earnings per share of $(12.33) and $20.12 for the years ended December 31, 2023 and 2022, respectively.\nProgram Developments\n \nAs of December 31, 2024, eleven of our 44 development programs are in late-stage development, including nine programs in Phase 3 and two rare disease programs that are expected to generate pivotal data in 2025. \n83\nRespiratory Vaccines\n•\nNext-generation COVID vaccine:\n We shared positive Phase 3 vaccine efficacy and immunogenicity data for our next-generation COVID vaccine (mRNA-1283) at our 2024 R&D Day event in September 2024. We have filed for regulatory approval of mRNA-1283 with the FDA using a priority review voucher. The FDA has accepted our Biologics License Application (BLA) for mRNA-1283 and has assigned a PDUFA goal date of May 31, 2025.\n•\nRSV vaccine:\n We received regulatory approval of our RSV vaccine mRESVIA (mRNA-1345) for adults aged 60 years and older in 2024. We shared positive Phase 3 data for mRNA-1345 in high-risk adults aged 18 to 59 at our 2024 R&D Day event and have since submitted an application to the FDA for regulatory approval using a priority review voucher, and have been assigned a PDUFA goal date of June 12, 2025.\n•\nSeasonal flu + COVID vaccine:\n We shared positive Phase 3 immunogenicity data for our flu+COVID combination vaccine (mRNA-1083) for adults aged 50 years and older at our 2024 R&D Day event. We have filed with the FDA for regulatory approval of mRNA-1083, which may require vaccine efficacy data from our ongoing Phase 3 seasonal flu vaccine study.\n•\nSeasonal flu vaccine:\n We have shared positive Phase 3 immunogenicity and safety data for our seasonal flu vaccine (mRNA-1010). We are conducting a two-season Phase 3 efficacy study (P304), where the timing of the efficacy readout depends on case accrual and could happen in the current season. \nLatent and Other Vaccines\n•\nCytomegalovirus (CMV) vaccine:\n The pivotal Phase 3 study of our CMV vaccine candidate (mRNA-1647) is fully enrolled and accruing cases, evaluating its efficacy, safety and immunogenicity in the prevention of primary infection in women of childbearing age. The Data Safety Monitoring Board (DSMB) met to review the initial study data and has informed us that the criterion for early efficacy was not met. The DSMB recommended that the study continue as planned. We remain blinded and anticipate final efficacy data from the study in 2025.\n•\nNorovirus vaccine: \nThe two-season Phase 3 study evaluating the efficacy, safety and immunogenicity of our trivalent vaccine candidate against norovirus (mRNA-1403) is fully enrolled in the Northern Hemisphere and we are preparing second season enrollment in the Southern Hemisphere. The trial is currently on FDA clinical hold following a single adverse event report of Guillain-Barré syndrome, which is currently under investigation. We do not expect an impact on the study's efficacy readout timeline as enrollment in the Northern Hemisphere has already been completed. The timing of the Phase 3 readout will be dependent on case accruals.\nOncology Therapeutics \n•\nIndividualized Neoantigen Therapy (INT):\n We continue to demonstrate the potential clinical benefit of our INT (mRNA-4157). In collaboration with Merck, the Phase 3 clinical trial for adjuvant melanoma is fully enrolled. Two Phase 3 studies for non-small cell lung cancer are enrolling. A randomized Phase 2 study for high-risk muscle invasive bladder cancer is enrolling, and a randomized Phase 2 study for adjuvant renal cell carcinoma is enrolling.\nRare Diseases\n•\nPropionic acidemia (PA) therapeutic:\n In an ongoing Phase 1/2 study designed to evaluate safety and pharmacology in trial participants with PA, our investigational therapeutic (mRNA-3927) has been generally well-tolerated to date with no events meeting protocol-defined dose-limiting toxicity criteria. Early results suggest potential decreases in annualized metabolic decompensation event (MDE) frequency compared to pre-treatment, and the majority of patients have elected to continue on the open label extension study. We began generating registrational trial data in 2024.\n•\nMethylmalonic acidemia (MMA) therapeutic: \nOur investigational therapeutic for MMA (mRNA-3705) has been selected by the FDA for the Support for Clinical Trials Advancing Rare Disease Therapeutics (START) pilot program. We and the FDA have agreed on the pivotal study design. We expect to start a registrational study in the first half of 2025.\nOther Business Updates\nIn March 2024, we entered into a development and commercialization funding agreement with Blackstone Life Sciences (Blackstone) to advance our flu program. As part of the agreement, Blackstone has committed up to $750 million in funding to support development efforts. Blackstone will be eligible for low-single digit royalties and milestone payments based on cumulative net sales of \n84\nour future flu and combination vaccines, contingent upon regulatory approval in the U.S. and the success of the funded activities. The funding is recognized as a reduction to the expenses of our flu program. We will retain full rights and control of our flu program.\nIn April 2024, we entered a non-exclusive out-licensing agreement with a pharmaceutical company based in Japan for mRNA COVID-related intellectual property for the territory of Japan. We received an upfront payment of $50 million, which includes a $20 million prepayment creditable against future royalties. Additionally, we are entitled to low double-digit royalties on the net sales of the company’s COVID product.\nIn June 2024, we were awarded up to $176 million through the Rapid Response Partnership Vehicle (RRPV), funded by BARDA, to accelerate the development of mRNA-based pandemic influenza vaccines. The project award will support the late-stage development of an mRNA-based vaccine to enable the licensure of a pre-pandemic vaccine against the H5 influenza virus. This subtype of the influenza virus causes a highly infectious and severe disease in birds known as avian influenza and poses a risk of spillover into the human population. The agreement also includes additional options to prepare for and accelerate responses to future public health threats.\nDuring the third quarter of 2024, we updated our COVID vaccine to target the KP.2 and JN.1 strains of the SARS-CoV-2 virus for the 2024-2025 season, consistent with guidance from regulators. Our vaccine targeting the KP.2 strain received approval from the FDA and Health Canada, while our vaccine targeting the JN.1 strain was approved by regulatory authorities in the European Union (EU), the United Kingdom, Japan, Taiwan, and other jurisdictions.\nIn May 2024, the FDA approved mRESVIA to protect adults aged 60 years and older from lower respiratory tract disease caused by RSV infection. The approval was granted under a breakthrough therapy designation. Subsequently, the Advisory Committee on Immunization Practices (ACIP) issued a recommendation for all unvaccinated people 75 years of age and older and unvaccinated people aged 60 to 74 who are at increased risk. In August 2024, the European Commission (EC) granted marketing authorization for mRESVIA to protect adults aged 60 years and older from lower respiratory tract disease caused by RSV infection. The authorization is valid in all 27 EU member states, as well as Iceland, Liechtenstein and Norway. We have also filed for mRNA-1345 approval with regulators in multiple markets worldwide and commenced sales in the U.S. in the third quarter of 2024.\nIn September 2024, our manufacturing facility in Laval, Quebec, received a Drug Establishment License (DEL) from Health Canada, certifying the site’s compliance with the required safety and quality standards to produce drug substance. This certification marked a significant step in enabling our Canadian facility to become fully operational, supporting domestic manufacturing of mRNA vaccines, including COVID vaccines, with production expected to begin in 2025.\nIn January 2025, we entered into a new agreement with the RRPV, funded by BARDA. The agreement provides up to $590 million to support the late-stage development and licensure of mRNA-based pre-pandemic influenza vaccines. In addition, the funding will enable the expansion of clinical studies for up to five additional subtypes of pandemic influenza, enhancing our preparedness to address emerging public health threats. \n85\nFinancial Operations Overview\nRevenue\nNet product sales \nNet product sales by customer geographic location were as follows for the periods presented (in millions):\nYears Ended December 31,\n2024\n2023\n2022\nUnited States\n$\n1,726 \n$\n1,720 \n$\n4,405 \nEurope\n573 \n1,353 \n6,732 \nRest of world\n810 \n3,598 \n7,298 \nTotal \n$\n3,109 \n$\n6,671 \n$\n18,435 \nNet product sales by product were as follows (in millions):\nYears Ended December 31,\n2024\n2023\n2022\nCOVID\n$\n3,084 \n$\n6,671 \n$\n18,435 \nRSV\n25 \n— \n— \nTotal \n$\n3,109 \n$\n6,671 \n$\n18,435 \nAs of December 31, 2024, we have two commercial products authorized for use, our COVID vaccine and our RSV vaccine. The RSV vaccine was approved by the FDA in May 2024 for adults aged 60 years and older.\nIn the third quarter of 2023, we commenced sales of our COVID vaccine to the U.S. commercial market, in addition to continuing sales to foreign governments and international organizations. We also commenced sales of our RSV vaccine in the third quarter of 2024. In the U.S., our COVID and RSV vaccines are sold primarily to wholesalers and distributors, and to a lesser extent, directly to retailers and healthcare providers. Net product sales are recognized net of estimated wholesaler chargebacks, invoice discounts for prompt payments and pre-orders, provisions for sales returns and government rebates, and other related deductions.\nThe following table summarizes product sales provision for the periods presented (in millions): \nYears Ended December 31,\n2024\n2023\n2022\nGross product sales \n$\n4,517 \n$\n8,203 \n$\n18,435 \nProduct sales provision:\nWholesaler chargebacks, discounts and fees\n(1,141)\n(976)\n— \nReturns, rebates and other fees\n(267)\n(556)\n— \nTotal product sales provision\n(1)\n$\n(1,408)\n$\n(1,532)\n$\n— \nNet product sales \n$\n3,109 \n$\n6,671 \n$\n18,435 \n_______\n(1)\nIncludes an adjustment of approximately $216 million for the full year 2024, reflecting a reduction in prior year provision estimates, primarily related to returns and chargebacks for the previous COVID vaccine season.\nPrior to the third quarter of 2023, we sold our COVID vaccine to the U.S. Government, foreign governments and international organizations. The agreements and related amendments with these entities generally do not include variable consideration, such as discounts, rebates or returns. Certain of these agreements entitle us to upfront deposits for our COVID vaccine supply, initially recorded as deferred revenue. As of December 31, 2024, we had deferred revenue of $188 million associated with customer deposits received or billable under supply agreements for delivery of our COVID vaccine, with the majority in 2025. \nOther revenue\n \nOther revenue comprises grant revenue, collaboration revenue, and licensing and royalty revenue. Grant and collaboration revenues have been primarily derived from government-sponsored and private organizations including the Biomedical Advanced Research and \n86\nDevelopment Authority (BARDA), the Defense Advanced Research Projects Agency (DARPA) and the Gates Foundation and from strategic alliances with Merck & Co., Inc (Merck), Vertex Pharmaceuticals Incorporated and Vertex Pharmaceuticals (Europe) Limited (together, Vertex) and others to discover, develop, and commercialize potential mRNA medicines. Licensing and royalty revenue is related to our out-licensing agreement for mRNA COVID related intellectual property in Japan, executed in 2024.\nThe following table summarizes other revenue for the periods presented (in millions):\nYears Ended December 31,\n2024\n2023\n2022\nGrant revenue\n$\n37 \n$\n94 \n$\n388 \nCollaboration revenue\n48 \n83 \n440 \nLicensing and royalty revenue\n42 \n— \n— \nTotal other revenue\n$\n127 \n$\n177 \n$\n828 \nCost of sales\nCost of sales includes raw materials, personnel and facility and other costs associated with manufacturing our commercial products. These costs include production materials, production costs at our manufacturing facilities, third-party manufacturing costs, and final formulation and packaging costs. Cost of sales also includes shipping costs, indirect overhead costs associated with our product sales during the period, third-party royalties on net sales of our products, and charges for inventory valuation, excess and obsolete inventory and losses on firm purchase commitments. \nResearch and development expenses\nThe nature of our business and primary focus of our activities generate a significant amount of research and development costs.\nResearch and development expenses represent costs incurred by us for the following:\n•\ncost to develop our platform;\n•\ndiscovery efforts leading to development candidates;\n•\npreclinical, nonclinical, and clinical development costs for our programs;\n•\ncost to develop our manufacturing technology and infrastructure; and\n•\ndigital infrastructure costs related to our drug discovery efforts and clinical trials.\nThe costs above comprise the following categories:\n•\npersonnel-related expenses, including salaries, benefits, and stock-based compensation expense;\n•\nexpenses incurred under agreements with third parties, such as consultants, investigative sites, contract research organizations (CROs), that conduct our preclinical studies and clinical trials, and in-licensing arrangements;\n•\nexpenses associated with developing manufacturing, modification of formulation or design of a product or process, advancing the design to meet specific functional and economic requirements for manufacture and obtaining materials for preclinical studies, clinical trials and pre-launch inventory from internal and third-party contract manufacturing organizations (CMOs);\n•\nexpenses incurred for the procurement of materials, laboratory supplies, and non-capital equipment used in the research and development process; \n•\nupfront fees and milestones paid to third-parties for licenses and technologies that had not reached technological feasibility and did not have an alternative future use; and\n•\nfacilities, depreciation, and amortization, and other direct and allocated expenses incurred as a result of research and development activities.\nWe use our employee and infrastructure resources for the advancement of our platform, and for discovering and developing programs. Due to the number of ongoing programs and our ability to use resources across several projects, indirect or shared operating costs incurred for our research and development programs are generally not recorded or maintained on a program- or therapeutic area-specific basis.\n87\nThe following table reflects our research and development expenses, including direct program specific expenses summarized by therapeutic area and indirect or shared operating costs summarized under other research and development expenses during the years ended December 31, 2024, 2023, and 2022 (in millions):\nYears Ended December 31,\n2024\n2023\n2022\nProgram-specific expenses by therapeutic area:\nRespiratory vaccines \n$\n837 \n$\n1,554 \n$\n1,363 \nLatent and other virus vaccines\n460 \n349 \n133 \nOncology\n154 \n62 \n28 \nRare disease and other therapeutics\n82 \n67 \n12 \nTotal program-specific expenses by therapeutic area\n(1)\n$\n1,533 \n$\n2,032 \n$\n1,536 \nOther research and development expenses:\nDiscovery and platform research\n$\n557 \n$\n751 \n$\n397 \nTechnical development and manufacturing expenses\n1,081 \n1,116 \n713 \nShared discovery and development expenses\n1,108 \n789 \n556 \nStock-based compensation\n264 \n157 \n93 \nTotal research and development expenses\n$\n4,543 \n$\n4,845 \n$\n3,295 \n__________\n(1)\nIncludes a total of 34 development candidates at December 31, 2024, 42 development candidates at December 31, 2023, and 45 development candidates at December 31, 2022. Program-specific expenses are reflected as of the beginning of the period in which the program was internally advanced to development.\nThe program-specific expenses by therapeutic area summarized in the table above include external development costs, such as fees paid to outside consultants, central laboratories, investigative sites, and CROs in connection with our preclinical studies and clinical trials. We generally do not allocate personnel-related costs, including stock-based compensation, costs associated with our general platform research, technical development, and other shared costs on a program-specific basis. These costs were therefore excluded from the summary of program-specific expenses by therapeutic area. \nDiscovery and platform research expenses include costs associated with early-stage research activities for preclinical programs and the development of technical advances in mRNA science, delivery science, and manufacturing process design. These costs include external CRO and lab services, personnel-related costs, computer equipment, facilities, and other administrative costs.\nTechnology development and manufacturing expenses are primarily related to manufacturing process development and manufacturing costs, including expenses for acquiring and manufacturing pre-launch inventory, mRNA supply for preclinical studies and clinical trials.\nShared discovery and development expenses are research and development costs such as personnel-related costs and other costs, such as the purchase of priority review vouchers. These expenses are not otherwise included in development programs, discovery and platform research, technical development, manufacturing expenses, or stock-based compensation. \nHistorically, we have made substantial investments in research and development activities, including development of our platform, mRNA technologies, and manufacturing technologies. We expense research and development costs as incurred and cannot reasonably estimate the nature, timing, and estimated costs required to complete the development of the development candidates and investigational medicines we are currently developing or may develop in the future. \nChanges in expectations or outcomes of any of the known or unknown risks and uncertainties may materially impact our expected research and development expenditures. Continued research and development is central to the ongoing activities of our business. Investigational medicines in later stages of clinical development, such as our norovirus vaccine, seasonal flu vaccine, new generations of COVID vaccines, combination vaccines, CMV vaccine, and our INT program, generally have higher development costs than those in earlier stages of clinical development, primarily due to the increased size and duration of later-stage clinical trials. We expect our research and development costs to be substantial in the near term as our investigational medicines advance through development phases and as we identify and develop additional programs. \n88\nThere are numerous factors associated with the successful commercialization of any of our investigational medicines, including future trial design and various regulatory requirements, many of which cannot be determined with accuracy at this time due to the early stage of development of many of our investigational medicines. Moreover, future commercial and regulatory factors beyond our control will impact our clinical development programs and plans.\nSelling, general and administrative expenses\nSelling, general and administrative expenses consist primarily of personnel-related costs, including stock-based compensation, for executives, finance, legal, human resources, business development, commercial, marketing, and other administrative and operational functions, professional fees, accounting and legal services, information technology and facility-related costs, and expenses associated with obtaining, maintaining, and defending intellectual property (IP). These costs relate to the operation of the business, unrelated to the research and development function, or any individual program.\nPrior to 2024, selling, general and administrative expenses increased annually as we expanded our commercial infrastructure to support the global commercialization of our COVID vaccine. These increases were driven by investments in building regulatory, sales, and marketing teams, establishing subsidiaries in multiple countries, and supporting operational growth. In 2024, selling, general and administrative expenses decreased significantly by $375 million, or 24%, compared to 2023. This decline reflects our focus on productivity improvements, cost-saving initiatives, and targeted investments that strengthen our overall efficiency.\nInterest income\nInterest income consists of interest generated from our investments in cash and cash equivalents, money market funds, and high-quality fixed income securities.\nOther expense, net\nOther expense, net consists of interest expense, gains or losses related to the sale of investments in marketable securities, changes in fair value of investments in equity securities, foreign currency transactions, remeasurements and hedges, and other income and expense unrelated to our core operations. Interest expense is primarily derived from our finance leases related to our Moderna Technology Center prior to its acquisition in December 2024, and certain contract manufacturing service agreements.\nCritical accounting policies and significant judgments and estimates\nOur management’s discussion and analysis of our financial condition and results of operations is based on our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these consolidated financial statements requires us to make judgments and estimates that affect the reported amounts of assets, liabilities, revenues, and expenses and the disclosure of contingent assets and liabilities in our consolidated financial statements. We base our estimates on historical experience, known trends and events, and various other factors that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. On an ongoing basis, we evaluate our judgments and estimates in light of changes in circumstances, facts, and experience. The effects of material revisions in estimates, if any, are reflected in the consolidated financial statements prospectively from the date of change in estimates.\nWhile our significant accounting policies are described in more detail in the notes to our consolidated financial statements appearing elsewhere in this Annual Report on Form 10-K, we believe the following accounting policy used in the preparation of our \nconsolidated financial statements require the most significant judgments and estimates.\nNet product sales\nPrior to the third quarter of 2023, we sold our COVID vaccine to the U.S. Government, foreign governments and organizations. The agreements and related amendments with these entities generally do not include variable consideration, such as discounts, rebates or returns. In the third quarter of 2023, we commenced sales of our latest COVID vaccine to the U.S. commercial market, in addition to continuing sales to foreign governments and organizations. We also commenced sales of our RSV vaccine in the third quarter of 2024. In the U.S., our COVID vaccine and RSV vaccine are sold primarily to wholesalers and distributors, and to a lesser extent, directly to retailers and healthcare providers.\nWe recognize net product sales when control of the product transfers to the customer, typically upon delivery. Net product sales are recognized net of estimated wholesaler chargebacks, invoice discounts for prompt payments and pre-orders, provisions for sales \n89\nreturns, government rebates, and other related deductions. These provisions are recorded based on contractual terms, our estimate of returns for product sold, and other relevant considerations, during the period, using the expected value method or the most likely amount method. Estimates are assessed each period and adjusted as required to revise information or actual experience. Please refer to \nNote 2\n to our consolidated financial statements for further discussion and analysis of each significant category of product sales provisions and the accounting policy.\nThe application of our critical accounting policies necessitates substantial management judgment and estimation, particularly when determining the amount of variable consideration to recognize. The subjectivity of this process is heightened when assessing factors outside our direct control such as the limited historical data, constrained third-party information, and evolving market dynamics. Among all variables, estimating returns presents the most significant judgment due to the broad range of potential outcomes and the current lack of established return trends. While we now have one year of data on our product returns, this remains insufficient to establish reliable patterns. We will continue to enhance our projections as additional information becomes available. The actual results could differ from our estimates, and such differences could have a material impact to our financial statements. \nRecently issued accounting pronouncements\nSee \nNote 2\n - Summary of Significant Accounting Policies, to the consolidated financial statements, under the caption “Recently Issued Accounting Standards”.\nResults of operations\nA discussion regarding our results of operations for the year ended December 31, 2024 compared to 2023 is presented below. A discussion regarding our results of operations for the year ended December 31, 2023 compared to 2022 can be found under Part II -Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the Securities and Exchange Commission (SEC) on February 23, 2024.\nThe following table summarizes our consolidated statements of operations for the periods presented (in millions):\nYears Ended December 31,\nChange 2024 vs. 2023\n2024\n2023\nChange\n%\nRevenue:\nNet product sales\n$\n3,109 \n$\n6,671 \n$\n(3,562)\n(53)\n%\nOther revenue\n127 \n177 \n(50)\n(28)\n%\nTotal revenue\n3,236 \n6,848 \n(3,612)\n(53)\n%\nOperating expenses:\nCost of sales\n1,464 \n4,693 \n(3,229)\n(69)\n%\nResearch and development\n4,543 \n4,845 \n(302)\n(6)\n%\nSelling, general and administrative\n1,174 \n1,549 \n(375)\n(24)\n%\nTotal operating expenses\n7,181 \n11,087 \n(3,906)\n(35)\n%\nLoss from operations\n(3,945)\n(4,239)\n294 \n(7)\n%\nInterest income\n425 \n421 \n4 \n1 \n%\nOther expense, net\n(87)\n(124)\n37 \n(30)\n%\nLoss before income taxes\n(3,607)\n(3,942)\n335 \n(8)\n%\n(Benefit from) provision for income taxes\n(46)\n772 \n(818)\n(106)\n%\nNet loss\n$\n(3,561)\n$\n(4,714)\n$\n1,153 \n(24)\n%\nRevenue\nTotal revenue decreased by $3.6 billion, or 53%, in 2024, primarily attributable to a significant reduction in net product sales of our COVID vaccine. Net product sales decreased by $3.6 billion, or 53%, in 2024, mainly due to lower sales volumes in Europe and the rest of the world. This decline reflects the transition to a seasonal commercial market for COVID vaccine, as revenue from these regions was previously generated largely through advance purchase agreements with foreign governments and international organizations during the pandemic. In the United States, sales remained relatively consistent compared to 2023. However, 2024 sales include an approximately $216 million benefit related to a reversal of prior-year sales provisions. Excluding this adjustment, product sales volume in the United States declined compared to 2023, primarily due to lower vaccination rates and increased market \n90\ncompetition. Although we commenced sales of our RSV vaccine in the third quarter of 2024, these sales did not have a significant impact on our overall product sales for the year. Other revenue decreased by $50 million, or 28%, in 2024, primarily due to lower grant and collaboration revenue, partially offset by license and royalty revenue related to the licensing agreement for mRNA COVID-related intellectual property in Japan, executed in 2024.  \nProduct sales are expected to decline further in 2025, driven by a potential reduction in vaccination rates, lower sales under advanced purchase agreements as most have been fulfilled, and increasing competitive pressures in the market.\nOperating expenses\nCost of sales\nOur cost of sales was $1.5 billion, or 47% of our net product sales, in 2024, including third-party royalties of $155 million, inventory write-downs of $495 million, primarily for raw materials and our finished and semi-finished COVID vaccine inventory, wind-down costs of $263 million, unutilized manufacturing capacity of $105 million, and losses from non-cancellable raw material purchase commitments of $60 million. Our cost of sales was $4.7 billion, or 70% of our net product sales, in 2023, including third-party royalties of $301 million, inventory write-downs of $2.2 billion, unutilized manufacturing capacity and wind down costs of $981 million, and losses on firm purchase commitments and cancellation fees of $205 million. These charges in 2024, other than royalties, were largely driven by customer demand forecast adjustments, termination of third-party contract manufacturing service agreements, and commitments for manufacturing capacity and raw material purchase agreements. Charges in 2023, other than royalties, were primarily attributable to a shift in product demand to the latest variant-targeted COVID vaccine and a decline in customer demand, which ultimately led to our strategic initiative implemented in the third quarter of 2023 to optimize our COVID business by resizing manufacturing operations in response to the shift toward an endemic seasonal market. Refer to \nNote 7\n to our consolidated financial statements for further details on inventory related charges and this initiative.\nCost of sales for 2024 decreased by $3.2 billion, or 69%, compared to 2023. Cost of sales as a percentage of net product sales for 2024 decreased by 23 percentage points to 47% from 70% in 2023. The decrease in cost of sales was primarily driven by reduced inventory write-downs, unutilized manufacturing capacity, purchase commitment and cancellation fees, and lower sales volume. Additionally, the reduction reflects the impact of our strategic initiative launched, which incurred $1.6 billion in charges during 2023, contributed to improved manufacturing efficiency and cost reductions in 2024. Of the wind-down costs incurred in 2024, $238 million related to the termination of a contract manufacturing agreement during the fourth quarter, as part of our continued efforts to optimize our manufacturing footprint in alignment with the transition to a seasonal endemic market. The decrease in cost of sales as a percentage of net product sales was primarily attributable to these reduced costs, partially offset by the lower product sales. \nIn 2025, we anticipate a reduction in cost of sales, primarily due to lower anticipated product sales. However, we expect cost of sales as a percentage of net product sales to increase compared to 2024, driven by excess manufacturing capacity and the impact of fixed costs being allocated across a lower sales volume.\nResearch and development expenses\nResearch and development expenses decreased by $302 million, or 6%, in 2024. The decrease was primarily attributable to decreases in clinical trial expenses of $427 million, clinical manufacturing expenses of $286 million, and preclinical research expenses of $246 million. These reductions were partially offset by an increase of $231 million in personnel-related costs, including stock-based compensation, and the purchase of two priority review vouchers. The decrease was largely attributable to reduced spending across our COVID, RSV, seasonal flu, CMV and combination vaccine programs. The decrease in expenses for the seasonal flu program was primarily due to funding provided by Blackstone. Please refer to \nNote 5\n to our consolidated financial statements for details on the research and development funding arrangement with Blackstone. These reductions were partially offset by increased spending on our norovirus and INT programs. The increase in personnel-related costs and stock-based compensation was mainly due to higher headcount to support our continued research and development efforts.\nWe expect research and development costs to decline in 2025 as we focus our investments on prioritized programs and strategic areas, aligning resources with our long-term objectives. However, we still anticipate incurring a significant amount of research and development expenses in 2025 as we continue to develop our pipeline and advance our product candidates into later-stage development, in particular those in ongoing Phase 3 studies, including our norovirus, flu+COVID combination, CMV, and RSV vaccine programs, as well as our INT program. \n91\nSelling, general and administrative expenses\nSelling, general and administrative expenses decreased by $375 million, or 24%, in 2024. The decrease was mainly due to a $342 million reduction in consulting and outside services across all functions, along with a $72 million reduction in commercial and marketing expenses. The decrease reflects cost discipline and operational efficiencies gained by reducing reliance on external consultants and bringing more functions in-house.\nWhile we continue to make selective investments to support our key priorities, we expect a slight decrease in spending in 2025 as we maintain an efficient and scalable operational structure. \nInterest income\nInterest income generated from our investments in marketable securities increased by $4 million in 2024, mainly attributable to an overall higher interest rate environment, partially offset by lower average investment balances.\nOther expense, net\nThe following table summarizes other expense, net for the periods presented (in millions):\nYears Ended December 31,\nChange 2024 vs. 2023\n2024\n2023\nChange\n%\nLoss on investments\n$\n(56)\n$\n(72)\n$\n16 \n(22)\n%\nInterest expense\n(24)\n(38)\n14 \n(37)\n%\nOther expense, net\n(7)\n(14)\n7 \n(50)\n%\nTotal other expense, net\n$\n(87)\n$\n(124)\n$\n37 \n(30)\n%\nTotal other expense, net decreased by $37 million, or 30%, in 2024. The decrease was primarily driven by a reduction in net realized losses on available-for-sale debt securities and lower interest expense. Interest expense, which is primarily related to our finance leases, declined due to the termination or expiration of certain finance leases in 2023. Please refer to \nNote 10\n to our consolidated financial statements for additional information.\nProvision for income taxes\nProvision for income taxes decreased by $818 million, or 106%, in 2024, primarily due to the establishment of a $1.7 billion valuation allowance on deferred tax assets in the third quarter of 2023. This valuation allowance has been applied consistently since its initial recognition. Our effective tax rate for the year ended December 31, 2024 was 1.3%, which is lower than the statutory rate. It is mainly driven by the increase in valuation allowances on deferred tax assets, partially offset by tax benefits from research and development credits. As a result of the valuation allowance, the 2024 effective tax rate is not comparable to the prior year. Please refer to \nNote 13\n to our consolidated financial statements for additional details.\nLiquidity and capital resources\nThe following table summarizes our cash, cash equivalents, investments and working capital for each period presented (in millions):\nDecember 31,\n2024\n2023\nFinancial assets:\nCash and cash equivalents\n$\n1,927 \n$\n2,907 \nInvestments\n5,098 \n5,697 \nInvestments, non-current\n2,494 \n4,677 \nTotal\n$\n9,519 \n$\n13,281 \nWorking capital:\nCurrent assets\n$\n8,099 \n$\n10,325 \nCurrent liabilities\n2,206 \n3,015 \nTotal\n$\n5,893 \n$\n7,310 \n92\nOur cash, cash equivalents and investments are invested in accordance with our investment policy, primarily with a view to liquidity and capital preservation. Our investments, consisting primarily of government and corporate debt securities, are stated at fair value. Cash, cash equivalents and investments as of December 31, 2024 decreased by $3.8 billion, or 28%, compared to December 31, 2023. For the year ended December 31, 2024, we had a net cash outflow from operations of $3.0 billion, and purchases of property, plant and equipment of $1.1 billion.\nWorking capital, defined as current assets less current liabilities, as of December 31, 2024 decreased by $1.4 billion, or 19%, compared to December 31, 2023. This was primarily due to a $1.6 billion decrease in cash, cash equivalents and short-term investments, mainly used to fund our operating activities, and a $534 million decrease in accounts receivable, primarily driven by timing of collections. These decreases were partially offset by a $415 million reduction in short-term deferred revenue, mainly resulting from revenue recognized from deferred revenue in excess of customer deposits received, and a $371 million decrease in accrued liabilities, reflecting an overall reduction in spend.\nCash flow\nThe following table summarizes the primary sources and uses of cash for the periods presented (in millions):\nYears Ended December 31,\n2024\n2023\nNet cash (used in) provided by:\nOperating activities\n$\n(3,004)\n$\n(3,118)\nInvesting activities\n1,949 \n4,206 \nFinancing activities\n56 \n(1,377)\nNet decrease in cash and cash equivalents\n$\n(999)\n$\n(289)\nOperating activities\nWe derive cash flows from operations primarily from cash collected from customer deposits and accounts receivable related to our product sales, as well as certain government-sponsored and private organizations, strategic alliances and funding arrangements. Our cash flows from operating activities are significantly affected by our use of cash for operating expenses and working capital to support the business. Beginning in the third quarter of 2020, we entered into supply agreements with the U.S. Government, foreign governments and international organizations for the supply of our COVID vaccine and received upfront deposits. In the third quarter of 2023, we commenced sales of our COVID vaccine to the U.S. commercial market, in addition to continuing sales to foreign governments and international organizations. In the U.S., our COVID vaccine is sold primarily to wholesalers and distributors, and to a lesser extent, directly to retailers and healthcare providers. We also commenced sales of our RSV vaccine in the third quarter of 2024. Wholesalers and distributors typically do not make upfront payments to us. As of December 31, 2024, we had $188 million in deferred revenue related to customer deposits received or billable.\nNet cash used by operating activities in 2024 was $3.0 billion and consisted of net loss of $3.6 billion and non-cash adjustments of $635 million, plus a net change in assets and liabilities of $78 million. Non-cash items primarily included stock-based compensation of $429 million and depreciation and amortization of $189 million. The net change in assets and liabilities was primarily due to a decrease in deferred revenue of $439 million due to revenue recognized from deferred revenue in excess of customer deposits received, and a decrease in accounts payable and accrued liabilities of $454 million resulting from overall lower spend in the period. These were partially offset by a decrease in accounts receivable of $534 million, mainly due to timing of collections, a decrease in prepaid expenses and other assets of $145 million, primarily driven by reductions in vendor prepayments, as well as a decrease in inventory of $83 million, largely due to inventory sold and write-downs.\nNet cash used by operating activities decreased by $114 million, or 4%, in 2024 compared to 2023. This decrease was primarily driven by a decrease in net loss of $1.2 billion, a change in deferred revenue of $1.6 billion, reflecting less revenue recognized from deferred revenue in excess of customer deposits received in 2024. This was partially offset by a change in prepaid expenses and other assets of $1.7 billion, mainly due to a decrease in deferred income tax assets in 2023 resulting from the establishment of a valuation allowance and reductions in vendor prepayments, and a change in inventory of $664 million, driven by a smaller reduction in inventory write-downs.\nInvesting activities\nOur primary investing activities consist of purchases, sales, and maturities of our investments, capital expenditures for land, building, leasehold improvements, manufacturing, laboratory, computer equipment and software, and business development.\n93\nNet cash provided by investing activities in 2024 was $1.9 billion, which primarily included proceeds from maturities of marketable securities of $5.6 billion and proceeds from sales of marketable securities of $4.0 billion, partially offset by purchases of marketable securities of $6.5 billion, and purchases of property, plant and equipment of $1.1 billion.\nNet cash flows provided by investing activities decreased by $2.3 billion, or 54%, in 2024 compared to 2023, primarily due to increases in purchases of marketable securities of $2.8 billion, and purchases of property, plant and equipment of $344 million, partially offset by an increase in proceeds from sale of marketable securities of $761 million.\nFinancing activities\nOur primary financing activities consist of issuance of common stock related to our equity plans, repurchases of common stock, and finance leases. \nNet cash provided by financing activities in 2024 was $56 million, consisting of net proceeds from the issuance of common stock in connection with the exercise of stock options and employee stock purchases under our equity plans of $66 million.\nNet cash provided by financing activities increased by $1.4 billion, or 104%, in 2024 compared to 2023, mainly due to a decrease in repurchases of common stock.\nOperation and funding requirements\nOur principal sources of funding as of December 31, 2024 consisted of cash and cash equivalents, investments, and cash we may generate from operations. We reported a net loss of $3.6 billion and $4.7 billion for the years ended December 31, 2024 and 2023, respectively. In contrast, we generated net income of $8.4 billion and $12.2 billion for the years ended December 31, 2022 and 2021, respectively, following the authorization of our first commercial product in December 2020. From our inception to the end of 2020, we incurred significant losses from operations due to our significant research and development expenses. We have retained earnings of $10.0 billion as of December 31, 2024. \nWe have significant future capital requirements including expected operating expenses to conduct research and development activities, operate our organization, and meet capital expenditure needs. We anticipate maintaining substantial expenses across all areas of our ongoing activities, particularly as we continue research and development of our development candidates and clinical activities for our investigational medicines. This also extends to our manufacturing costs, including our arrangements with our supply and manufacturing partners. Our ongoing work on our norovirus, flu+COVID combination, CMV, RSV, and next-generation COVID vaccine candidates, INT, development of any new COVID vaccines against variants of SARS-CoV-2, late-stage clinical development, investments in digital capabilities and artificial intelligence technologies, and buildout of global commercial, regulatory, sales and marketing infrastructure and manufacturing facilities will require significant cash outflows in future periods, most of which may not be reimbursed or otherwise paid for by our partners or collaborators. In addition, we have substantial facility, lease and purchase obligations. We have also entered into various collaboration and licensing agreements, as well as a research and development funding arrangement with a third party. These arrangements collectively encompass the funding of specific research and development activities, with the distinction that under the research and development funding arrangement, we receive funding. However, for all these arrangements, we may be obligated to make potential future milestone and royalty payments.\nWe believe that our cash, cash equivalents, and investments as of December 31, 2024, together with cash expected to be generated from product sales, will be sufficient to enable us to fund our projected operations and capital expenditures through at least the next 12 months from the issuance of the financial statements\n \nincluded in this Annual Report on Form 10-K. We are subject to all the risks related to the development and commercialization of novel medicines, and we may encounter unforeseen expenses, difficulties, complications, delays, and other unknown factors, which may adversely affect our business. For example, we experienced a decline in customer demand for our COVID vaccine in 2023, and this trend continued into 2024, reflecting the market's ongoing transition to a seasonal commercial pattern in the endemic COVID vaccine market. We foresee that our commitment to investing in our business for future product launches may lead to continued negative cash flows from operations in upcoming periods. Our forecast of the period of time through which our financial resources will be adequate to support our operations is a forward-looking statement and involves risks and uncertainties, and actual results could vary as a result of a number of factors. We have based this estimate on assumptions that may prove to be wrong, and we could utilize our available capital resources sooner than we currently expect. \n94\nContractual obligations and commitments\nThe following table summarizes our contractual obligations as of December 31, 2024 and the effects that such obligations are expected to have on our liquidity and cash flows in future periods (in millions):\nPayments Due by Period\nTotal\nLess than 1\nyear\n1 - 3 years\n3 - 5 years\nMore than 5\nyears\nOperating leases\n \n$\n1,129 \n$\n64 \n$\n149 \n$\n162 \n$\n754 \nFinancing leases\n67 \n26 \n41 \n— \n— \nPurchase obligations\n(1)\n1,045 \n601 \n439 \n5 \n— \nTotal contractual cash obligations\n$\n2,241 \n$\n691 \n$\n629 \n$\n167 \n$\n754 \n_______\n(1)\nThe amounts represent non-cancelable fixed payment obligations related to purchases of raw materials, contract manufacturing services, research and development and other goods or services in the normal course of business. As of December 31, 2024, $60 million of the purchase commitments related to raw materials was recorded as an accrued liability for loss on future firm purchase commitments and is included in the purchase obligations line above.\nWe have agreements with certain vendors for various services, including services related to clinical operations and support and contract manufacturing, which we are not contractually able to terminate for convenience. Certain agreements provide for termination rights subject to termination fees or wind down costs. Under such agreements, we are contractually obligated to make certain payments to vendors, mainly to reimburse them for their unrecoverable outlays incurred prior to cancellation. The exact amounts of such obligations are dependent on the timing of termination, and the exact terms of the relevant agreement and cannot be reasonably estimated. At December 31, 2024, we had cancelable open purchase orders of $2.9 billion in total under such agreements for our clinical operations and support and contract manufacturing. These amounts represent only our estimate of those items for which we had a contractual commitment to pay at December 31, 2024, assuming we would not cancel these agreements. The actual amounts we pay in the future to the vendors under such agreements may differ from the cancelable open purchase order amounts of $2.9 billion.\nIn addition to the above obligations, we enter into a variety of agreements and financial commitments in the normal course of business. The terms generally allow us the option to cancel, reschedule, and adjust our requirements based on our business needs, prior to the delivery of goods or performance of services. It is not possible to predict the maximum potential amount of future payments under these agreements due to the conditional nature of our obligations and the unique facts and circumstances involved in each particular agreement.\nAs of December 31, 2024, we did not have any off-balance sheet arrangements, other than those obligations and commitments disclosed herein, that were material or reasonably likely to become material to our financial condition or results of operations. \n95",
  "item2": null
}