{
  "source_file": "msci-20250930.htm",
  "form_type": "10-Q",
  "item1": "Item 1: Business\n” in our Form 10-K.\nAs of September 30, 2025, we served approximately 6,900\n1\n clients in more than 95 countries.\nOur principal business model is generally to license annual, recurring subscriptions for the majority of our Index, Analytics and Sustainability and Climate products and services for a fee due in advance of the service period. Private Assets products are also licensed annually through subscriptions, which are generally recurring, for a fee which is paid in advance when products are generally delivered ratably over the subscription period or in arrears after the product is delivered. A portion of our fees comes from clients who use our indexes as the basis for index-linked investment products. Such fees are primarily based on a client’s assets under management (“AUM”), trading volumes and fee levels.\nIn evaluating our financial performance, we focus on revenue and profit growth, including results accounted for under generally accepted accounting principles in the United States (“GAAP”), as well as non-GAAP measures, for the Company as a whole and by operating segment.\nWe present revenues disaggregated by types and by segments, which represent our major product lines. We also review expenses by activity, which provides more transparency into how resources are being deployed. In addition, we utilize operating metrics including Run Rate, subscription sales and Retention Rate to manage and assess performance and to provide deeper insights into the recurring portion of our business.\n1\nRepresents the aggregate of all related clients under their respective parent entity. At acquisition, we align an acquired company’s client count to our methodology.\n25\nTable of Contents\nIn the first quarter of 2025, we renamed our “ESG and Climate” operating and reportable segment to “Sustainability and Climate” to reflect the breadth of our product offerings. There were no changes to the composition of our reportable segments or information reviewed by the chief operating decision maker and no impact on our historical segment operating results.\nIn the discussion that follows, we provide certain variances excluding the impact of foreign currency exchange rate fluctuations and acquisitions. Foreign currency exchange rate fluctuations reflect the difference between the current period results as reported compared to the current period results recalculated using the foreign currency exchange rates in effect for the comparable prior period. While operating revenues adjusted for the impact of foreign currency fluctuations includes asset-based fees that have been adjusted for the impact of foreign currency fluctuations, the underlying AUM, which is the primary component of asset-based fees, is not adjusted for foreign currency fluctuations. Approximately three-fifths of the AUM is invested in securities denominated in currencies other than the U.S. dollar, and accordingly, any such impact is excluded from the disclosed foreign currency-adjusted variances.\nFor the nine months ended September 30, 2025, our largest client organization by revenue, BlackRock, accounted for 10.6% of our consolidated operating revenues, with 96.4% of the operating revenues from BlackRock coming from fees based on the assets in BlackRock’s ETFs and non-ETF products that are based on our indexes.\nThe discussion of our results of operations for the three and nine months ended September 30, 2025 and 2024 are presented below. The results of operations for interim periods may not be indicative of future results.\nCritical Accounting Policies and Estimates\nWe describe our significant accounting policies in Note 1, “Introduction and Basis of Presentation,” of the Notes to Consolidated Financial Statements included in our Form 10-K. There have been no significant changes in our accounting policies or critical accounting estimates during the nine months ended September 30, 2025.\nGoodwill\nWe recognize goodwill in business combination transactions when the purchase price exceeds the fair value of the acquired net tangible and separately identifiable intangible assets. We test goodwill for impairment annually on July 1 or when interim triggers arise at the reporting unit level. When testing goodwill for impairment, we first assess qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test; however, on a periodic basis, we may elect to bypass the qualitative assessment and proceed directly to the quantitative test. \nAs of July 1, 2025, the Company has selected to bypass the optional qualitative assessment for the Real Assets and Private Capital Solutions (“PCS”) reporting units. This decision was based on the relatively low excess of fair value over carrying value observed in the prior year’s analysis. Therefore, a quantitative goodwill impairment test was performed for both Real Assets and PCS. For the Index, Analytics, and Sustainability and Climate reporting units, the company performed a qualitative assessment. The quantitative test for impairment used an equal weighting of the income approach and the market approach to estimate the fair value of the Real Assets and PCS reporting units. \nThe income approach requires significant judgments in estimating future cash flows, including assumptions, amongst others, about revenue growth rates and EBITDA margins, and the selection of an appropriate discount rate, which reflects the reporting unit’s cost of capital. Forecasted future cash flows are estimated based on a combination of historical experience and assumptions regarding future growth and profitability of each reporting unit. Discount rates are selected for each reporting unit being valued based on each reporting unit’s estimated weighted-average cost of capital. The weighted-average cost of capital is estimated based on both the capital structure that we believe a market participant would utilize as well as the discount rates of guideline public companies that have similar characteristics to each reporting unit being valued, adjusted for the risk inherent in each reporting unit. Terminal growth rates are selected based on growth rates used during the reporting unit’s forecast period in combination with economic conditions. \nThe market approach utilizes valuation multiples of revenue and cash flows derived from guideline public companies that have similar characteristics to each reporting unit being valued. Selecting appropriate guideline companies, valuation multiples and other key assumptions such as revenue growth rates and discount rates requires significant management judgment, and changes to these estimates could materially impact the fair value determination of each reporting unit. We perform sensitivity analyses around key assumptions in order to assess the reasonableness of the assumptions and the impact on the estimated fair value.\nImpairment occurs when the estimated fair value of the reporting unit is below the carrying value. As of July 1, 2025, all reporting units had fair values exceeding their carrying values. As a result, no goodwill impairment was recorded as of this date. \n26\nTable of Contents\nAt September 30, 2025, the carrying value of goodwill of the Real Assets and Private Capital Solutions reporting units were $691.3 million and $617.8 million, respectively. As of July 1, 2025, the fair value of the Real Assets and Private Capital Solutions reporting units exceeded their carrying values by appr\noximately 39% and 15%,\n respectively. If we experience a prolonged downturn in the business environment or financial markets, weaker-than-expected performance of one of our businesses or a sustained decline in our common stock price, our goodwill could be impaired in the future, which may be material to our results of operations and financial position.\nFor the Real Assets and PCS reporting units, individually, a hypothetical decrease in revenue growth rates by 100 basis points or a hypothetical 100 basis point increase in the weighted average cost of capital would not result in an impairment. See Note 6, “Goodwill and Intangible Assets, Net” of the Notes to the Condensed Consolidated Financial Statements included herein for additional information on goodwill.\nResults of Operations\nOperating Revenues\nOur operating revenues are grouped by the following types: recurring subscriptions, asset-based fees and non-recurring. We also group operating revenues by major product as follows: Index, Analytics, Sustainability and Climate and \nAll Other – Private Assets\n.\nThe following table presents operating revenues by type for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nIndex\nRecurring subscriptions\n$\n242,569 \n$\n223,945 \n8.3\n%\n$\n711,546 \n$\n653,929 \n8.8\n%\nAsset-based fees\n197,515 \n168,622 \n17.1\n%\n559,002 \n482,162 \n15.9\n%\nNon-recurring\n11,076 \n12,315 \n(10.1\n%)\n37,188 \n39,855 \n(6.7\n%)\nIndex total\n451,160 \n404,882 \n11.4\n%\n1,307,736 \n1,175,946 \n11.2\n%\nAnalytics\nRecurring subscriptions\n178,292 \n168,150 \n6.0\n%\n517,828 \n490,829 \n5.5\n%\nNon-recurring\n3,878 \n4,226 \n(8.2\n%)\n14,230 \n11,508 \n23.7\n%\nAnalytics total\n182,170 \n172,376 \n5.7\n%\n532,058 \n502,337 \n5.9\n%\nSustainability and Climate\nRecurring subscriptions\n88,676 \n81,536 \n8.8\n%\n258,440 \n235,954 \n9.5\n%\nNon-recurring\n1,449 \n2,107 \n(31.2\n%)\n5,215 \n5,428 \n(3.9\n%)\nSustainability and Climate total\n90,125 \n83,643 \n7.7\n%\n263,655 \n241,382 \n9.2\n%\nAll Other - Private Assets\nRecurring subscriptions\n69,524 \n62,991 \n10.4\n%\n206,656 \n190,434 \n8.5\n%\nNon-recurring\n447 \n813 \n(45.0\n%)\n1,826 \n2,520 \n(27.5\n%)\nAll Other - Private Assets total\n69,971 \n63,804 \n9.7\n%\n208,482 \n192,954 \n8.0\n%\nRecurring subscriptions total\n579,061 \n536,622 \n7.9\n%\n1,694,470 \n1,571,146 \n7.8\n%\nAsset-based fees\n197,515 \n168,622 \n17.1\n%\n559,002 \n482,162 \n15.9\n%\nNon-recurring\n16,850 \n19,461 \n(13.4\n%)\n58,459 \n59,311 \n(1.4\n%)\nTotal operating revenues\n$\n793,426 \n$\n724,705 \n9.5\n%\n$\n2,311,931 \n$\n2,112,619 \n9.4\n%\nTotal operating revenues increased 9.5% for the three months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, total operating revenues would have increased 9.0%.\n27\nTable of Contents\nTotal operating revenues increased 9.4% for the nine months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, total operating revenues would have increased 9.0%.\nRefer to the section titled “Segment Results” that follows for further discussion of segment revenues.\nOperating Expenses\nWe group our operating expenses into the following activity categories:\n•\nCost of revenues;\n•\nSelling and marketing;\n•\nResearch and development (“R&D”);\n•\nGeneral and administrative (“G&A”);\n•\nAmortization of intangible assets; and\n•\nDepreciation and amortization of property, equipment and leasehold improvements.\nCosts are assigned to these activity categories based on the nature of the expense or, when not directly attributable, an estimated allocation based on the type of effort involved. Cost of revenues, selling and marketing, R&D and G&A all include both compensation as well as non-compensation related expenses.\nThe following table presents operating expenses by activity category for the periods indicated: \nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating expenses:\nCost of revenues\n$\n132,528 \n$\n126,192 \n5.0\n%\n$\n406,985 \n$\n382,815 \n6.3\n%\nSelling and marketing\n79,856 \n70,763 \n12.8\n%\n236,773 \n214,385 \n10.4\n%\nResearch and development\n44,807 \n38,584 \n16.1\n%\n136,472 \n120,182 \n13.6\n%\nGeneral and administrative\n41,805 \n41,561 \n0.6\n%\n137,251 \n137,958 \n(0.5\n%)\nAmortization of intangible assets\n40,937 \n41,939 \n(2.4\n%)\n128,569 \n121,316 \n6.0\n%\nDepreciation and amortization of property,  equipment and leasehold improvements\n5,803 \n4,332 \n34.0\n%\n15,934 \n12,639 \n26.1\n%\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n6.9\n%\n$\n1,061,984 \n$\n989,295 \n7.3\n%\nTotal operating expenses increased 6.9% for the three months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, the increase would have been 6.1%.\nTotal operating expenses increased 7.3% for the nine months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, the increase would have been 7.4%.\nDescriptions of MSCI’s operating expense categories are provided in “Item 7 — Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Form 10-K. The discussion below focuses on year-over-year changes and key drivers.\nCost of Revenues\nCost of revenues increased 5.0% and 6.3% for the three and nine months ended September 30, 2025, respectively, \nprimarily driven by increases in compensation and benefits costs as a result of increased headcount costs and higher severance costs, as well as increases in non-compensation costs reflecting higher information technology costs.\n28\nTable of Contents\nSelling and Marketing\nSelling and marketing expenses increased 12.8% and 10.4% for the three and nine months ended September 30, 2025, respectively, \nprimarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs.\nResearch and Development\nR&D expenses increased 16.1% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase is also driven by increases in non-compensation costs reflecting higher information technology costs.\nR&D expenses increased 13.6% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs, partially offset by increased capitalization of costs related to internally developed software projects. The increase is also driven by increases in non-compensation costs reflecting higher information technology costs.\nGeneral and Administrative\nG&A expenses increased 0.6% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs, partially offset by decreases in non-compensation costs reflecting lower transaction costs.\nG&A expenses decreased 0.5% for the nine months ended September 30, 2025, primarily driven by decreases in non-compensation costs reflecting lower transaction costs, partially offset by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs.\nThe following table presents operating expenses using compensation and non-compensation categories, rather than using activity categories, for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nCompensation and benefits\n$\n215,259 \n$\n194,809 \n10.5\n%\n$\n672,432 \n$\n618,421 \n8.7\n%\nNon-compensation expenses\n83,737 \n82,291 \n1.8\n%\n245,049 \n236,919 \n3.4\n%\nAmortization of intangible assets\n40,937 \n41,939 \n(2.4\n%)\n128,569 \n121,316 \n6.0\n%\nDepreciation and amortization of property,  equipment and leasehold improvements\n5,803 \n4,332 \n34.0\n%\n15,934 \n12,639 \n26.1\n%\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n6.9\n%\n$\n1,061,984 \n$\n989,295 \n7.3\n%\nCompensation and Benefits\nWe had 6,253 employees as of September 30, 2025, compared to 6,118 employees as of September 30, 2024, reflecting a 2.2% increase in the number of employees. Continued growth of our emerging market centers around the world is an important factor in our ability to manage and control the growth of our compensation and benefits costs. As of September 30, 2025, 70% of our employees were located in emerging market centers compared to 69% as of September 30, 2024. \nCompensation and benefits costs increased 10.5% and 8.7%, respectively, for the three and nine months ended September 30, 2025, p\nrimarily driven by increased headcount costs and higher severance costs\n. \nAdjusting for the impact of foreign currency exchange rate fluctuations, compensation and benefits costs would have increased by 9.3% and increased by 8.9%, respectively, for the three and nine months ended September 30, 2025.\nNon-Compensation Expenses\nNon-compensation expenses increased 1.8% for the three months ended September 30, 2025, primarily driven by higher information technology costs, partially offset by lower transaction costs.\n29\nTable of Contents\nNon-compensation expenses increased\n \n3.4% for the nine months ended September 30, 2025, primarily driven by higher information technology and market data costs, partially offset by lower transaction costs.\nAdjusting for the impact of foreign currency exchange rate fluctuations, non-compensation expenses would have increased by 1.4% and 3.4%, respectively, for the three and nine months ended September 30, 2025.\nAmortization of Intangible Assets\nAmortization of intangible assets expense decreased 2.4% for the three months ended September 30, 2025, primarily driven by certain intangible assets becoming fully amortized during the period, partially offset by higher amortization of internally developed software.\nAmortization of intangible assets expense increased 6.0% for the nine months ended September 30, 2025, primarily driven by higher amortization of internally developed software.\nDepreciation and Amortization of Property, Equipment and Leasehold Improvements\nDepreciation and amortization of property, equipment and leasehold improvements increased 34.0% and 26.1% for the three and nine months ended September 30, 2025, respectively, primarily driven by higher depreciation on computer and related equipment.\nTotal Other Expense (Income), Net\nThe following table shows our other expense (income), net for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nInterest income\n$\n(5,109)\n$\n(5,217)\n(2.1\n%)\n$\n(11,914)\n$\n(17,375)\n(31.4\n%)\nInterest expense\n53,620 \n46,688 \n14.8\n%\n146,296 \n139,995 \n4.5\n%\nOther expense (income)\n2,671 \n2,927 \n(8.7\n%)\n10,147 \n7,881 \n28.8\n%\nTotal other expense (income), net\n$\n51,182 \n$\n44,398 \n15.3\n%\n$\n144,529 \n$\n130,501 \n10.7\n%\nTotal other expense (income), net increased 15.3% for the three months ended September 30, 2025, primarily driven by higher interest expenses reflecting higher debt levels.\nTotal other expense (income), net increased 10.7% for the nine months ended September 30, 2025, primarily driven by higher interest expenses reflecting higher debt levels, lower interest income reflecting lower average cash balances as well as unfavorable foreign currency exchange rate fluctuations.\nIncome Taxes\nThe effective tax rate for the three months ended September 30, 2025 and 2024 was 17.9% and 21.3%, respectively. The rate is primarily driven by favorable prior-year items in the current year, compared to unfavorable prior-year items in the preceding year. \nThe effective tax rate for the nine months ended September 30, 2025 and 2024 was 17.0% and 19.1%, respectively. The decrease is primarily driven by the benefit of prior-year refund claims in the current year, partially offset by a decrease in excess tax benefits recognized on share-based compensation vested.\nNet Income\nThe following table shows our net income for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nNet income\n$\n325,386 \n$\n280,901 \n15.8 \n%\n$\n917,636 \n$\n803,613 \n14.2 \n%\n30\nTable of Contents\nAs a result of the factors described above, net income increased 15.8% for the three months ended September 30, 2025, and increased 14.2% for the nine months ended September 30, 2025.\nWeighted Average Shares and Common Shares Outstanding\nThe following table shows our weighted average shares outstanding for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change\nNine Months Ended\nSeptember 30,\n% Change\n(in thousands)\n2025\n2024\n2025\n2024\nWeighted average shares outstanding:\nBasic\n76,460\n78,499\n(2.6\n%)\n77,159\n78,925\n(2.2\n%)\nDiluted\n76,579\n78,729\n(2.7\n%)\n77,290\n79,159\n(2.4\n%)\n    \nThe following table shows our common shares outstanding for the periods indicated:\nAs of\n% Change\n(in thousands)\nSeptember 30,\n2025\nDecember 31,\n2024\nCommon shares outstanding\n75,181 \n77,745 \n(3.3\n%)\nThe decrease in weighted average shares and common shares outstanding for the three and nine months ended September 30, 2025 primarily reflects the impact of share repurchases made pursuant to the Company’s stock repurchase program, partially offset by the vesting of certain stock-based awards.\nNon-GAAP Financial Measures\nAdjusted EBITDA\n“Adjusted EBITDA,” a non-GAAP measure used by management to assess operating performance, is defined as net income before (1) provision for income taxes, (2) other expense (income), net, (3) depreciation and amortization of property, equipment and leasehold improvements, (4) amortization of intangible assets and, at times, (5) certain other transactions or adjustments, including, when applicable, certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA expenses,” a non-GAAP measure used by management to assess operating performance, is defined as operating expenses less depreciation and amortization of property, equipment and leasehold improvements and amortization of intangible assets and, at times, certain other transactions or adjustments, including, when applicable, certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA margin” is defined as Adjusted EBITDA divided by operating revenues.\nAdjusted EBITDA, Adjusted EBITDA expenses and Adjusted EBITDA margin are believed to be meaningful measures for management to assess the operating performance of the Company because they adjust for significant one-time, unusual or non-recurring items as well as eliminate the accounting effects of certain capital spending and acquisitions that do not directly affect what management considers to be the Company’s ongoing operating performance in the period. All companies do not calculate adjusted EBITDA, adjusted EBITDA expenses and adjusted EBITDA margin in the same way. These measures can differ significantly from company to company depending on, among other things, long-term strategic decisions regarding capital structure, the tax jurisdictions in which companies operate and capital investments. Accordingly, the Company’s computation of the Adjusted EBITDA, Adjusted EBITDA expenses and Adjusted EBITDA margin measures may not be comparable to similarly titled measures computed by other companies.\n31\nTable of Contents\nThe following table presents non-GAAP Adjusted EBITDA for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues\n$\n793,426\n$\n724,705\n$\n2,311,931\n$\n2,112,619\nAdjusted EBITDA expenses\n298,996\n274,003\n917,481\n848,389\nAdjusted EBITDA\n$\n494,430\n$\n450,702\n$\n1,394,450\n$\n1,264,230\nOperating margin %\n56.4\n%\n55.4\n%\n54.1\n%\n53.2\n%\nAdjusted EBITDA margin %\n62.3\n%\n62.2\n%\n60.3\n%\n59.8\n%\nReconciliation of Net Income to Adjusted EBITDA and Operating Expenses to Adjusted EBITDA Expenses\nThe following table presents the reconciliation of net income to Adjusted EBITDA for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nNet income\n$\n325,386 \n$\n280,901 \n$\n917,636 \n$\n803,613 \nProvision for income taxes\n71,122 \n76,035 \n187,782 \n189,210 \nOther expense (income), net\n51,182 \n44,398 \n144,529 \n130,501 \nOperating income\n447,690 \n401,334 \n1,249,947 \n1,123,324 \nAmortization of intangible assets\n40,937 \n41,939 \n128,569 \n121,316 \nDepreciation and amortization of property, equipment and leasehold improvements\n5,803 \n4,332 \n15,934 \n12,639 \nAcquisition-related integration and transaction costs\n(1)\n— \n3,097 \n— \n6,951 \nConsolidated Adjusted EBITDA\n$\n494,430 \n$\n450,702 \n$\n1,394,450 \n$\n1,264,230 \nIndex Adjusted EBITDA\n350,263 \n314,148 \n991,992 \n898,898 \nAnalytics Adjusted EBITDA\n90,038 \n90,287 \n258,674 \n244,171 \nSustainability and Climate Adjusted EBITDA\n34,806 \n29,989 \n90,304 \n75,010 \nAll Other - Private Assets Adjusted EBITDA\n19,323 \n16,278 \n53,480 \n46,151 \nConsolidated Adjusted EBITDA\n$\n494,430 \n$\n450,702 \n$\n1,394,450 \n$\n1,264,230 \n___________________________\n(1)\nRepresents transaction expenses and other costs directly related to the acquisition and integration of acquired businesses, including professional fees, severance expenses, regulatory filing fees and other costs, in each case that are incurred no later than 12 months after the close of the relevant acquisition.\n32\nTable of Contents\nThe following table presents the reconciliation of operating expenses to Adjusted EBITDA expenses for the periods indicated: \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n$\n1,061,984 \n$\n989,295 \nAmortization of intangible assets\n40,937 \n41,939 \n128,569 \n121,316 \nDepreciation and amortization of property, equipment and leasehold improvements\n5,803 \n4,332 \n15,934 \n12,639 \nAcquisition-related integration and transaction costs\n(1)\n— \n3,097 \n— \n6,951 \nConsolidated Adjusted EBITDA expenses\n$\n298,996 \n$\n274,003 \n$\n917,481 \n$\n848,389 \nIndex Adjusted EBITDA expenses\n$\n100,897 \n$\n90,734 \n$\n315,744 \n$\n277,048 \nAnalytics Adjusted EBITDA expenses\n92,132 \n82,089 \n273,384 \n258,166 \nSustainability and Climate Adjusted EBITDA expenses\n55,319 \n53,654 \n173,351 \n166,372 \nAll Other - Private Assets Adjusted EBITDA expenses\n50,648 \n47,526 \n155,002 \n146,803 \nConsolidated Adjusted EBITDA expenses\n$\n298,996 \n$\n274,003 \n$\n917,481 \n$\n848,389 \n___________________________\n(1)\nRepresents transaction expenses and other costs directly related to the acquisition and integration of acquired businesses, including professional fees, severance expenses, regulatory filing fees and other costs, in each case that are incurred no later than 12 months after the close of the relevant acquisition.\nSegment Results\nIndex Segment\nThe following table presents the results for the Index segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n242,569\n$\n223,945\n8.3%\n$\n711,546\n$\n653,929\n8.8\n%\nAsset-based fees\n197,515\n168,622\n17.1%\n559,002\n482,162\n15.9\n%\nNon-recurring\n11,076\n12,315\n(10.1%)\n37,188\n39,855\n(6.7\n%)\nOperating revenues total\n451,160\n404,882\n11.4%\n1,307,736\n1,175,946\n11.2\n%\nAdjusted EBITDA expenses\n100,897\n90,734\n11.2%\n315,744\n277,048\n14.0\n%\nAdjusted EBITDA\n$\n350,263\n$\n314,148\n11.5%\n$\n991,992\n$\n898,898\n10.4\n%\nAdjusted EBITDA margin %\n77.6 \n%\n77.6 \n%\n75.9 \n%\n76.4 \n%\nIndex operating revenues increased 11.4% for the three months ended September 30, 2025, driven by growth from asset-based fees as well as recurring subscriptions. Adjusting for the impact of foreign currency exchange rate fluctuations, Index operating revenues would have increased 11.4%.\nOperating revenues from recurring subscriptions increased 8.3% for the three months ended September 30, 2025, primarily driven by growth from market cap-weighted Index products. \nOperating revenues from asset-based fees increased 17.1% for the three months ended September 30, 2025, primarily driven by growth in revenues from ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. Operating revenues from ETFs linked to MSCI equity indexes increased by 24.1%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. Operating revenues from non-ETF indexed funds linked to MSCI indexes increased by 8.5%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees.\n33\nTable of Contents\nIndex operating revenues increased 11.2% for the nine months ended September 30, 2025, primarily driven by growth from asset-based fees as well as recurring subscriptions. Adjusting for the impact of foreign currency exchange rate fluctuations, Index operating revenues would have increased 11.1%.\nOperating revenues from recurring subscriptions increased 8.8% for the nine months ended September 30, 2025, primarily driven by growth from market cap-weighted Index products. \nOperating revenues from asset-based fees increased 15.9% for the nine months ended September 30, 2025, primarily driven by growth in revenues from ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. Operating revenues from ETFs linked to MSCI equity indexes increased by 18.9%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. Operating revenues from non-ETF indexed funds linked to MSCI indexes increased 13.9%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. \nThe following table presents the value of AUM in ETFs linked to MSCI equity indexes and the sequential change of such assets as of the end of each of the periods indicated:\nPeriod Ended\n2024\n2025\n(in billions)\nMarch\n31,\nJune\n30,\nSeptember\n30,\nDecember\n31,\nMarch\n31,\nJune\n30,\nSeptember\n30,\nAUM in ETFs linked to MSCI equity indexes\n(1) (2)\n$\n1,582.6 \n$\n1,631.9 \n$\n1,761.8 \n$\n1,724.7 \n$\n1,783.1 \n$\n2,024.6 \n$\n2,211.0 \nSequential Change in Value\nMarket Appreciation/(Depreciation)\n$\n92.8 \n$\n21.2 \n$\n111.3 \n$\n(85.3)\n$\n16.4 \n$\n193.0 \n$\n140.0 \nCash Inflows\n20.9 \n28.1 \n18.6 \n48.2 \n42.0 \n48.5 \n46.4 \nTotal Change\n$\n113.7 \n$\n49.3 \n$\n129.9 \n$\n(37.1)\n$\n58.4 \n$\n241.5 \n$\n186.4 \nThe following table presents the average value of AUM in ETFs linked to MSCI equity indexes for the periods indicated:\n2024\n2025\n(in billions)\nMarch\nJune\nSeptember\nDecember\nMarch\nJune\nSeptember\nAUM in ETFs linked to MSCI equity indexes\n(1) (2)\nQuarterly average\n$\n1,508.8 \n$\n1,590.6 \n$\n1,677.0 \n$\n1,755.4 \n$\n1,793.7 \n$\n1,868.7 \n$\n2,108.4 \nYear-to-date average\n$\n1,508.8 \n$\n1,549.7 \n$\n1,592.1 \n$\n1,632.9 \n$\n1,793.7 \n$\n1,831.2 \n$\n1,923.6 \n___________________________\n(1)\nThe historical values of the AUM in ETFs linked to our equity indexes as of the last day of the month and the monthly average balance can be found under the link “AUM in ETFs Linked to MSCI Equity Indexes” on our Investor Relations homepage at \nhttp://ir.msci.com\n. This information is updated mid-month each month. Information contained on our website is not deemed part of or incorporated by reference into this Quarterly Report on Form 10-Q or any other report filed with the SEC. The AUM in ETFs also includes AUM in Exchange Traded Notes, the value of which is less than 1.0% of the AUM amounts presented.\n(2)\nThe value of AUM in ETFs linked to MSCI equity indexes is calculated by multiplying the equity ETF net asset value by the number of shares outstanding.\nThe average value of AUM in ETFs linked to MSCI equity indexes for the three months ended September 30, 2025, was up $431.4 billion, or 25.7%. For the nine months ended September 30, 2025, the average value of AUM in ETFs linked to MSCI equity indexes was up $331.5 billion, or 20.8%.\nIndex segment Adjusted EBITDA expenses increased 11.2% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs and professional fees. Adjusting for the impact of foreign currency exchange rate fluctuations, Index segment Adjusted EBITDA expenses would have increased\n \nby 10.2%.\nIndex segment Adjusted EBITDA expenses increased 14.0% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs and professional fees. Adjusting for the impact of foreign currency exchange rate fluctuations, Index segment Adjusted EBITDA expenses would have increased by 14.1%.\n34\nTable of Contents\nAnalytics Segment\nThe following table presents the results for the Analytics segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n178,292 \n$\n168,150 \n6.0\n%\n$\n517,828 \n$\n490,829 \n5.5\n%\nNon-recurring\n3,878 \n4,226 \n(8.2\n%)\n14,230 \n11,508 \n23.7\n%\nOperating revenues total\n182,170 \n172,376 \n5.7\n%\n532,058 \n502,337 \n5.9\n%\nAdjusted EBITDA expenses\n92,132 \n82,089 \n12.2\n%\n273,384 \n258,166 \n5.9\n%\nAdjusted EBITDA\n$\n90,038 \n$\n90,287 \n(0.3\n%)\n$\n258,674 \n$\n244,171 \n5.9\n%\nAdjusted EBITDA margin %\n49.4 \n%\n52.4 \n%\n48.6 \n%\n48.6 \n%\nAnalytics operating revenues increased 5.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.6%.\nAnalytics segment Adjusted EBITDA expenses increased 12.2% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 11.5%.\nAnalytics operating revenues increased 5.9% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.8%.\nAnalytics segment Adjusted EBITDA expenses increased 5.9% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 6.3%.\nSustainability and Climate Segment\nThe following table presents the results for the Sustainability and Climate segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n88,676 \n$\n81,536 \n8.8\n%\n$\n258,440 \n$\n235,954 \n9.5\n%\nNon-recurring\n1,449 \n2,107 \n(31.2\n%)\n5,215 \n5,428 \n(3.9\n%)\nOperating revenues total\n90,125 \n83,643 \n7.7\n%\n263,655 \n241,382 \n9.2\n%\nAdjusted EBITDA expenses\n55,319 \n53,654 \n3.1\n%\n173,351 \n166,372 \n4.2\n%\nAdjusted EBITDA\n$\n34,806 \n$\n29,989 \n16.1\n%\n$\n90,304 \n$\n75,010 \n20.4\n%\nAdjusted EBITDA margin %\n38.6 \n%\n35.9 \n%\n34.3 \n%\n31.1 \n%\nSustainability and Climate operating revenues increased 7.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 5.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 3.1% for the three months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance \n35\nTable of Contents\ncosts. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 2.0%.\nSustainability and Climate operating revenues increased 9.2% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 7.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 4.2% for the nine months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 4.2%.\nAll Other – Private Assets\nThe following table presents the results for All Other – Private Assets for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n69,524 \n$\n62,991 \n10.4\n%\n$\n206,656 \n$\n190,434 \n8.5\n%\nNon-recurring\n447 \n813 \n(45.0\n%)\n1,826 \n2,520 \n(27.5\n%)\nOperating revenues total\n69,971 \n63,804 \n9.7\n%\n208,482 \n192,954 \n8.0\n%\nAdjusted EBITDA expenses\n50,648 \n47,526 \n6.6\n%\n155,002 \n146,803 \n5.6\n%\nAdjusted EBITDA\n$\n19,323 \n$\n16,278 \n18.7\n%\n$\n53,480 \n$\n46,151 \n15.9\n%\nAdjusted EBITDA margin %\n27.6 \n%\n25.5 \n%\n25.7 \n%\n23.9 \n%\nAll Other – Private Assets operating revenues increased 9.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Total Plan Portfolio Management and Private Capital Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 8.3%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 6.6% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.4%.\nAll Other – Private Assets operating revenues increased 8.0% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Private Capital Intel, Total Plan Portfolio Management and Transparency Data products, as well as growth from recurring subscription in Real Assets related to Index Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 7.2%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 5.6% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.2%.\n Operating Metrics\nA substantial portion of MSCI’s operating revenues is derived from recurring subscriptions or licenses for products and services that are ongoing in nature and provided over contractually agreed periods, which are subject to renewal or cancellation upon the expiration of the then-current term. In addition, we generate non-recurring revenues from one-time sales and other transactions or services that are discrete in nature or that have a defined life. The operating metrics defined below help management assess the \n36\nTable of Contents\nstability and growth of this recurring-revenue base and track non-recurring revenues. There have been no changes to the methodologies used to compute these metrics compared with prior periods.\nRun Rate\nRun Rate estimates, at a specific point in time, the annualized value of the recurring portion of executed client contracts (“Client Contracts”) expected to generate revenues over the next 12 months, assuming that all such Client Contracts are renewed and using fixed foreign exchange rates. Run Rate includes new Client Contracts upon execution, even if the license start date and related revenue recognition occur later.\nFor Client Contracts where fees are linked to an investment product’s assets or trading volume or fees (referred to as “Asset-based Fees”), the Run Rate calculation is based on:\n•\nFor exchange-traded funds (“ETFs”): assets under management as of the last trading day of the period;\n•\nFor non-ETF products: the most recent client-reported assets under management; and\n•\nFor listed futures and options contracts: the most recent quarterly volumes and/or reported exchange fees.\nRun Rate excludes fees associated with one-time or other non-recurring transactions.\nWe remove from Run Rate the annualized fee value associated with products or services under any Client Contracts when (i) we have received a notice of termination, reduction in fees, non-renewal or other clear indication that the client does not intend to continue its subscription at then current fees; and (ii) management has determined that such notice or indication reflects the client’s final decision to terminate, not renew or renew at a lower fee the applicable products or services, even if such termination or non-renewal is not yet effective (each such event, a “Subscription Cancellation”).\nIn general, when a client reduces the fees paid to MSCI associated with a reduction in the number of products or services to which it subscribes within a segment, or a switch between products or services within a segment, unless the client switches to a product or service that management considers a replacement, such reduction or switch is treated as a Subscription Cancellation, including for purposes of calculating MSCI’s Retention Rate (as detailed below). In the cases where the client switches products or services to a replacement service, only the net decrease, if any, is reported as a cancellation.\n•\nIn the Analytics and Sustainability and Climate operating segments, substantially all such product or service switches are treated as replacements and are netted accordingly.\n•\nIn contrast, in the Index, Real Assets, and Private Capital Solutions operating segments, such netting treatment is applied only in limited circumstances.\nRun Rate may differ from revenues recognized in accordance with Accounting Standards Codification (“ASC”) Topic 606, Revenue from Contracts with Customers. Changes in our recurring revenues typically lag changes in Run Rate. Key factors include, but are not limited to:\n•\nImmediate recognition of the annualized value of newly executed recurring Client Contracts;\n•\nImmediate removal of the annualized value of Subscription Cancellations on Client Contracts;\n•\nImmediate updates to reflect modifications to existing Client Contracts, including changes in price or scope of services;\n•\nTiming differences between the effective date of service delivery and contract execution (e.g., Client Contracts with implementation periods, fee waivers or future-dated start terms);\n•\nVariability in revenues driven by exogenous factors, such as changes in reference asset values, currency exchange rates or investment flows;\n•\nVariability in revenues tied to trading volumes of futures and options contracts linked to MSCI indexes; and\n•\nThe effects of acquisitions and divestitures.\n•\nMulti-period agreements with contractual price escalators where the total revenue is recognized ratably over the contract period.\n37\nTable of Contents\nOrganic recurring subscription Run Rate growth is defined as the period-over-period growth in Run Rate, excluding:\n•\nThe impact of changes in foreign currency exchange rates;\n•\nThe impact of acquisitions during the first 12 months following the transaction date; and\n•\nThe impact of divestitures, where Run Rate from divested businesses are excluded from prior period Run Rates.\nThe following table presents Run Rates as of the dates indicated and the growth percentages over the periods indicated:\nAs of\n(in thousands)\nSeptember 30,\n2025\nSeptember 30,\n2024\nRun Rate Growth %\nOrganic Run Rate Growth %\nIndex:\nRecurring subscriptions\n$\n988,125 \n$\n906,803 \n9.0 \n%\n9.0 \n%\nAsset-based fees\n799,744 \n683,462 \n17.0\n%\n17.0\n%\nIndex total\n1,787,869 \n1,590,265 \n12.4\n%\n12.4\n%\nAnalytics\n742,404 \n691,333 \n7.4\n%\n6.9\n%\nSustainability and Climate\n370,809 \n344,015 \n7.8\n%\n5.8\n%\nAll Other - Private Assets\n285,418 \n268,577 \n6.3\n%\n5.5\n%\nTotal Run Rate\n$\n3,186,500 \n$\n2,894,190 \n10.1\n%\n9.7\n%\nRecurring subscriptions total\n$\n2,386,756 \n$\n2,210,728 \n8.0\n%\n7.4\n%\nAsset-based fees\n799,744 \n683,462 \n17.0\n%\n17.0\n%\nTotal Run Rate\n$\n3,186,500 \n$\n2,894,190 \n10.1\n%\n9.7\n%\nTotal Run Rate increased 10.1%, driven by a 8.0% increase from recurring subscriptions, primarily driven by increases in the asset manager, banks and broker-dealer, hedge fund and asset owner client segments, as well as a 17.0% increase from asset-based fees.\nRun Rate from Index recurring subscriptions increased 9.0%, primarily driven by growth from market cap-weighted and custom Index products. The increase reflected growth across all regions and client segments.\nRun Rate from Index asset-based fees increased 17.0%, primarily driven by higher AUM in both ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. \nRun Rate from Analytics products increased 7.4%, primarily driven by growth in both Equity Analytics and Multi-Asset Class products, and reflected growth across all regions.\nRun Rate from Sustainability and Climate products increased 7.8%, driven by growth in Ratings and Climate products, with growth primarily attributable to EMEA. The increase is primarily driven by growth in asset manager and wealth manager client segments. \nRun Rate from All Other - Private Assets increased 6.3%, primarily driven by growth from Private Capital Solutions related to Total Plan Portfolio Management, Private Capital Intel and Transparency Data products, and reflected growth across all regions. The increase is primarily driven by growth in asset owner and asset manager client segments.\nSales\nSales represents the annualized value of products and services that clients have committed to purchase from MSCI and that are expected to result in additional operating revenues.\n38\nTable of Contents\nNon-recurring sales represent the aggregate value of client agreements entered into during the period that generate non-recurring fees and are not included in Run Rate (as defined elsewhere herein), even if such agreements span multiple periods or years.\nNew recurring subscription sales represent the annualized value of additional client commitments entered into during the period - such as new Client Contracts, expansions of existing Client Contracts or price increases - that contribute to Run Rate.\nNet new recurring subscription sales represent new recurring subscription sales minus the impact of Subscription Cancellations, capturing the net impact to Run Rate for the period.\nTotal gross sales is the sum of new recurring subscription sales and non-recurring sales.\nTotal net sales is total gross sales minus the impact of Subscription Cancellations.\nChanges in foreign currency are calculated by applying the exchange rates from the prior comparable period to the current period’s foreign currency-denominated Run Rate.\n39\nTable of Contents\nThe following table presents our recurring subscription sales, cancellations and non-recurring sales for the periods indicated:\nThree Months Ended\nNine Months Ended\n(in thousands)\nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nIndex\nNew recurring subscription sales\n$\n29,443 \n$\n25,271 \n$\n81,141 \n$\n80,081 \nSubscription cancellations\n(9,911)\n(9,862)\n(27,406)\n(34,876)\nNet new recurring subscription sales\n$\n19,532 \n$\n15,409 \n$\n53,735 \n$\n45,205 \nNon-recurring sales\n$\n12,657 \n$\n13,883 \n$\n42,504 \n$\n44,687 \nTotal gross sales\n$\n42,100 \n$\n39,154 \n$\n123,645 \n$\n124,768 \nTotal Index net sales\n$\n32,189 \n$\n29,292 \n$\n96,239 \n$\n89,892 \nAnalytics\nNew recurring subscription sales\n$\n21,961 \n$\n20,780 \n$\n60,923 \n$\n56,137 \nSubscription cancellations\n(9,853)\n(10,307)\n(28,710)\n(28,001)\nNet new recurring subscription sales\n$\n12,108 \n$\n10,473 \n$\n32,213 \n$\n28,136 \nNon-recurring sales\n$\n3,508 \n$\n7,293 \n$\n11,549 \n$\n13,812 \nTotal gross sales\n$\n25,469 \n$\n28,073 \n$\n72,472 \n$\n69,949 \nTotal Analytics net sales\n$\n15,616 \n$\n17,766 \n$\n43,762 \n$\n41,948 \nSustainability and Climate\nNew recurring subscription sales\n$\n7,424 \n$\n9,333 \n$\n24,959 \n$\n39,361 \nSubscription cancellations\n(5,509)\n(5,575)\n(15,535)\n(17,496)\nNet new recurring subscription sales\n$\n1,915 \n$\n3,758 \n$\n9,424 \n$\n21,865 \nNon-recurring sales\n$\n734 \n$\n2,345 \n$\n3,975 \n$\n6,852 \nTotal gross sales\n$\n8,158 \n$\n11,678 \n$\n28,934 \n$\n46,213 \nTotal Sustainability and Climate net sales\n$\n2,649 \n$\n6,103 \n$\n13,399 \n$\n28,717 \nAll Other - Private Assets\nNew recurring subscription sales\n$\n9,693 \n$\n9,959 \n$\n29,270 \n$\n29,877 \nSubscription cancellations\n(4,458)\n(4,610)\n(15,956)\n(15,112)\nNet new recurring subscription sales\n$\n5,235 \n$\n5,349 \n$\n13,314 \n$\n14,765 \nNon-recurring sales\n$\n939 \n$\n520 \n$\n2,757 \n$\n2,361 \nTotal gross sales\n$\n10,632 \n$\n10,479 \n$\n32,027 \n$\n32,238 \nTotal All Other - Private Assets net sales\n$\n6,174 \n$\n5,869 \n$\n16,071 \n$\n17,126 \nConsolidated\nNew recurring subscription sales\n$\n68,521 \n$\n65,343 \n$\n196,293 \n$\n205,456 \nSubscription cancellations\n(29,731)\n(30,354)\n(87,607)\n(95,485)\nNet new recurring subscription sales\n$\n38,790 \n$\n34,989 \n$\n108,686 \n$\n109,971 \nNon-recurring sales\n$\n17,838 \n$\n24,041 \n$\n60,785 \n$\n67,712 \nTotal gross sales\n$\n86,359 \n$\n89,384 \n$\n257,078 \n$\n273,168 \nTotal net sales\n$\n56,628 \n$\n59,030 \n$\n169,471 \n$\n177,683 \n40\nTable of Contents\nRetention Rate\nThe following table presents our Retention Rate for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nIndex\n95.8%\n95.4%\n96.1%\n94.6%\nAnalytics\n94.4%\n93.8%\n94.5%\n94.4%\nSustainability and Climate\n93.6%\n93.0%\n94.0%\n92.7%\nAll Other - Private Assets\n93.3%\n92.7%\n92.0%\n92.0%\nTotal\n94.7%\n94.2%\n94.8%\n93.9%\nRetention Rate is a key performance metric that provides insight into the stability and durability of MSCI’s recurring revenue base. Subscription cancellations reduce Run Rate and, over time, lower future operating revenues.\nFor full-year periods, Retention Rate is calculated as the retained subscription Run Rate, which is defined as the subscription Run Rate at the beginning of the fiscal year minus actual subscription cancellations during the fiscal year, expressed as a percentage of the subscription Run Rate at the beginning of the fiscal year.\nFor interim (non-annual) periods, Retention Rate is presented on an annualized basis. The annualized Retention Rate is calculated by:\n1.\nDividing annualized subscription cancellations in the period by the subscription Run Rate at the beginning of the fiscal year, to determine a cancellation rate; and\n2.\nSubtracting that rate from 100%, to derive the annualized Retention Rate.\nRetention Rate is calculated by operating segment and is based on an individual product or service level within each segment. We do not calculate Retention Rate for the portion of Run Rate attributable to Asset-based Fees.\nLiquidity and Capital Resources\nWe require capital to fund ongoing operations, internal growth initiatives and acquisitions. Our primary sources of liquidity are cash flows generated from our operations, existing cash and cash equivalents and credit capacity under our existing credit facility. In addition, we believe we have access to additional funding in the public and private markets. We intend to use these sources of liquidity to, among other things, service our existing and future debt obligations, fund our working capital requirements for capital expenditures, investments, acquisitions and dividend payments, and make repurchases of our common stock. In connection with our business strategy, we regularly evaluate acquisition and strategic partnership opportunities. We believe our liquidity, along with other financing alternatives, will provide the necessary capital to fund these transactions and achieve our planned growth.\nSenior Notes and Credit Agreement\nAs of September 30, 2025, we had an aggregate of $5.5 billion in Senior Notes outstanding. In addition, we had as of September 30, 2025 an aggregate of $0.1 billion in outstanding borrowings under the Revolving Credit Facility. See Note 7, “Debt” of the Notes to Condensed Consolidated Financial Statements (Unaudited) included herein for additional information on our outstanding indebtedness and revolving credit facility.\nOn August 8, 2025, we issued $1.25 billion aggregate principal amount of 5.25% Senior Unsecured Notes due 2035 (the “2035 Senior Notes”) in a registered public offering. The 2035 Senior Notes mature on September 1, 2035. At any time prior to June 1, 2035, we may redeem all or part of the 2035 Senior Notes at a redemption price equal to the sum of (i) 100% of the principal amount thereof, plus (ii) a make-whole premium as of the date of redemption, plus (iii) accrued and unpaid interest, if any, thereon to, but not including, the redemption date. On or after June 1, 2035, the 2035 Senior Notes are redeemable at 100% of the principal amount, plus accrued and unpaid interest to, but not including, the redemption date.\nOn August 20, 2025, we entered into a Third Amended and Restated Credit Agreement (the “Credit Agreement”) amending and restating in its entirety the Company’s prior Second Amended and Restated Credit Agreement (the “Prior Credit Agreement”). The Credit Agreement increases the aggregate revolving commitments to $1.6 billion (from $1.25 billion under the Prior Credit Agreement) under a revolving credit facility (the “Revolving Credit Facility”), and extends the availability period until August 20, 2030. Prior to entering into the Credit Agreement, we applied the proceeds of the offering of the 2035 Senior Notes to repay in full all outstanding borrowings under the Prior Credit Agreement. The obligations under the Credit Agreement are unsecured senior obligations of the Company.\n41\nTable of Contents\nThe indentures governing our Senior Notes (the “Indentures”)\n contain covenants that limit our and our subsidiaries’ ability to, among other things, incur liens, enter into sale/leaseback transactions and consolidate, merge or sell all or substantially all of our assets, and that limit the ability of our subsidiaries to incur certain indebtedness. \nThe Credit Agreement also contains covenants that limit our and our subsidiaries’ ability to, among other things, incur liens, enter into sale/leaseback transactions and consolidate, merge or sell all or substantially all of our assets, and that limit the ability of our subsidiaries to incur certain indebtedness.\nThe Credit Agreement and the Indentures also contain customary events of default, including those relating to non-payment, breach of representations, warranties or covenants, cross-default and cross-acceleration, and bankruptcy and insolvency events, and, in the case of the Credit Agreement, invalidity or impairment of loan documentation, change of control and customary ERISA defaults in addition to the foregoing. None of the restrictions above are expected to impact our ability to effectively operate the business.\nThe Credit Agreement also requires us and our subsidiaries to achieve financial and operating results sufficient to maintain compliance with the following financial ratios on a consolidated basis through the termination of the Credit Agreement: (1) the maximum Consolidated Leverage Ratio (as defined in the Credit Agreement) measured quarterly on a rolling four-quarter basis not to exceed 4.25:1.00 (or 4.50:1.00 for four fiscal quarters following a material acquisition) and (2) during any Non-Investment Grade Covenant Period (as defined in the Credit Agreement), the minimum Consolidated Interest Coverage Ratio (as defined in the Credit Agreement) measured quarterly on a rolling four-quarter basis of at least 3.00:1.00. As of September 30, 2025, our Consolidated Leverage Ratio was 2.70:1.00.\nShare Repurchases\nThe following table provides information with respect to repurchases of the Company’s common stock pursuant to open market repurchases:\nNine months ended\n(in thousands except per share data)\nAverage\nPrice\nPaid Per\nShare\nTotal\nNumber of\nShares\nRepurchased\nDollar\nValue of\nShares\nRepurchased\n(1)\nSeptember 30, 2025\n$\n559.44 \n2,703\n$\n1,512,260 \nSeptember 30, 2024\n$\n500.52 \n880\n$\n440,265 \n___________________________\n(1)\nThe values in this column exclude the 1% excise tax incurred on share repurchases pursuant to the Inflation Reduction Act. Any excise tax incurred is recognized as part of the cost of the shares acquired in the Unaudited Condensed Consolidated Statement of Shareholders’ Equity (Deficit).\nOn October 25, 2025, the Board of Directors authorized a new stock repurchase program for the repurchase of up to an aggregate of $3.0 billion worth of shares of MSCI’s common stock (the “2025 Repurchase Program”), which supersedes and replaces the 2024 Repurchase Program authorized. Share repurchases made pursuant to the 2025 Repurchase Program may take place in the open market or in privately negotiated transactions from time to time based on market and other conditions. This authorization may be modified, suspended or terminated by the Board of Directors at any time without prior notice.\nCash Dividends\nOn October 27, 2025, the Board of Directors declared a quarterly cash dividend of $1.80 per share for the three months ending September 30, 2025. The fourth quarter 2025 dividend is payable on November 28, 2025 to shareholders of record as of the close of trading on November 14, 2025.\nCash Flows\nThe following table presents the Company’s cash and cash equivalents, including restricted cash, as of the dates indicated:\nAs of\n(in thousands)\nSeptember 30,\n2025\nDecember 31,\n2024\nCash and cash equivalents (includes restricted cash of $3,656 and \n   $3,497 at September 30, 2025 and December 31, 2024, respectively)\n$\n400,089 \n$\n409,351 \nWe typically seek to maintain minimum cash balances globally of approximately $225.0 million to $275.0 million for general operating purposes. As of September 30, 2025 and December 31, 2024, $253.5 million and $265.5 million, respectively, of the Company’s cash and cash equivalents were held by foreign subsidiaries. Repatriation of some foreign cash may be subject to certain withholding taxes in local jurisdictions and other distribution restrictions. We believe the global cash and cash equivalent balances that \n42\nTable of Contents\nare maintained will be available to meet our global needs whether for general corporate purposes or other needs, including acquisitions or expansion of our products.\nWe believe that global cash flows from operations, together with existing cash and cash equivalents and funds available under our existing revolving credit facility and our ability to access bank debt, private debt and the capital markets for additional funds, will continue to be sufficient to fund our global operating activities and cash commitments for investing and financing activities, such as material capital expenditures and share repurchases, for at least the next 12 months and for the foreseeable future thereafter. In addition, we expect that foreign cash flows from operations, together with existing cash and cash equivalents, will continue to be sufficient to fund our foreign operating activities and cash commitments for investing activities, such as material capital expenditures, for at least the next 12 months and for the foreseeable future thereafter.\nNet Cash Provided by (Used In) Operating, Investing and Financing Activities\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\nNet cash provided by operating activities\n$\n1,087,316 \n$\n1,070,994 \nNet cash (used in) investing activities\n(93,614)\n(107,522)\nNet cash (used in) provided by financing activities\n(1,012,200)\n(926,125)\nEffect of exchange rate changes\n9,236 \n1,939 \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(9,262)\n$\n39,286 \nCash Flows From Operating Activities\nCash flows from operating activities consist of net income adjusted for certain non-cash items and changes in assets and liabilities. The year-over-year change was primarily driven by higher cash collections from customers, partially offset by higher payments for cash expenses.\nOur primary uses of cash from operating activities a\nre for the payment of cash compensation expenses, income taxes, interest expenses, technology costs, professional fees, market data costs and office rent. Historically, the payment of cash for compensation and benefits is at its highest level in the first quarter when we pay discretionary employee compensation related to the previous fiscal year.\nCash Flows From Investing Activities\nThe year-over-year change was due to prior year acquisitions partially offset by increased capital expenditures.\nCash Flows From Financing Activities\nThe year-over-year change was primarily driven by the impact of higher share repurchases, repayment of borrowings and dividend payments, partially offset by proceeds from borrowings.\nItem 3.    Quantitative and Qualitative Disclosures about Market Risk\nForeign Currency Risk\nWe are subject to foreign currency exchange fluctuation risk. Exchange rate movements can impact the U.S. dollar-reported value of our revenues, expenses, assets and liabilities denominated in non-U.S. dollar currencies or where the currency of such items is different than the functional currency of the entity where these items were recorded.\nWe generally invoice our clients in U.S. dollars; however, we invoice a portion of our clients in Euros, British pounds sterling, Japanese yen and a limited number of other non-U.S. dollar currencies. For the nine months ended September 30, 2025 and 2024, 17% and 17%, respectively, of our revenues are subject to foreign currency exchange rate risk and primarily included clients billed in foreign currency as well as U.S. dollar exposures on non-U.S. dollar foreign operating entities. Of the 17% of non-U.S. dollar exposure for the nine months ended September 30, 2025, 43% was in Euros, 32% was in British pounds sterling and 18% was in Japanese yen. Of the 17% of non-U.S. dollar exposure for the nine months ended September 30, 2024, 42% was in Euros, 33% was in British pounds sterling and 18% was in Japanese yen.\n43\nTable of Contents\nRevenues from asset-based fees represented 24% and 23% of operating revenues for the nine months ended September 30, 2025 and 2024, respectively. While a substantial portion of our asset-based fees are invoiced in U.S. dollars, the fees are based on the assets in investment products, of which approximately three-fifths are invested in securities denominated in currencies other than the U.S. dollar. Accordingly, declines in such other currencies against the U.S. dollar will decrease the fees payable to us under such licenses. In addition, declines in such currencies against the U.S. dollar could impact the attractiveness of such investment products resulting in net fund outflows, which would further reduce the fees payable under such licenses. \nWe are exposed to additional foreign currency risk in certain of our operating costs. Approximately 42% and 42% of our operating expenses for the nine months ended September 30, 2025 and 2024, respectively, were denominated in foreign currencies, the significant majority of which were denominated in British pounds sterling, Indian rupees, Euros, Hungarian forints and Mexican pesos.\nWe have certain monetary assets and liabilities denominated in currencies other than local functional amounts, and when these balances are remeasured into their local functional currency, either a gain or a loss results from the change of the value of the functional currency as compared to the originating currencies. We manage foreign currency exchange rate risk, in part, through the use of derivative financial instruments comprised principally of forward contracts on foreign currency which are not designated as hedging instruments for accounting purposes. The objective of the derivative instruments is to minimize the impact on the income statement of the volatility of amounts denominated in certain foreign currencies. We recognized total foreign currency exchange losses of $6.4 million and $5.0 million for the nine months ended September 30, 2025 and 2024, respectively.\nItem 4.    Controls and Procedures\nOur Chief Executive Officer and Chief Financial Officer have evaluated our disclosure controls and procedures, as defined in Rule 13a-15(e) or 15d-15(e) of the Securities Exchange Act of 1934, as amended, (the “Exchange Act”), as of the end of the period covered by this report, and have concluded that these disclosure controls and procedures are effective to ensure that information required to be disclosed by us in the reports that we file or submit under the Exchange Act is recorded, processed, summarized and reported within the time specified in the SEC’s rules and forms. These disclosure controls and procedures include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in the reports we file or submit under the Exchange Act is accumulated and communicated to management, including the Chief Executive Officer and the Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure.\nThere have been no changes in our internal control over financial reporting (as defined in Rules 13a-15(f) and 15d-15(f) under the Exchange Act) during the three months ended September 30, 2025 that have materially affected, or are reasonably likely to materially affect, our internal control over financial reporting.\n44\nTable of Contents\nPART II – OTHER INFORMATION\nItem 1.    Legal Proceedings\nVarious lawsuits, arbitrations, claims, government inquiries, requests for information, subpoenas, regulatory investigations, examinations, inspections and other legal or regulatory processes have been or may be instituted or asserted against the Company in the ordinary course of business. While the potential losses could be substantial, due to uncertainties surrounding the potential outcomes, management cannot currently reasonably estimate the possible loss or range of loss that may arise from these matters. Consequently, it is possible that MSCI’s business, operating results, financial condition or cash flows in a particular period could be materially affected by these matters. However, based on facts currently available, we believe that the disposition of matters that are currently pending or asserted will not, individually or in the aggregate, have a material effect on MSCI’s business, operating results, financial condition or cash flows.",
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINDEX TO MANAGEMENT’S DISCUSSION AND ANALYSIS\nPage\nOverview\n25\nCritical Accounting Estimates\n26\nResults of Operations\n27\nSegment Results\n33\nLiquidity and Capital Resources\n41\nCash Flows\n42\nThe following discussion and analysis of the financial condition and results of operations should be read in conjunction with the condensed consolidated financial statements and related notes included elsewhere in this Form 10-Q and in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 (the “Form 10-K”). This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those discussed below. Factors that could cause or contribute to such differences include, but are not limited to, those identified below and those discussed in “Item 1A.—Risk Factors,” in our Form 10-K.\nExcept as the context otherwise indicates, the terms “MSCI,” the “Company,” “we,” “our” and “us” refer to MSCI Inc., together with its subsidiaries.\nOverview\nWe are a leading provider of critical decision support tools and solutions for the global investment community. Our mission-critical offerings help investors navigate the complexities of a dynamic and evolving investment landscape. Leveraging our deep knowledge of the global investment process and our expertise in research, data and technology, we enable our clients to understand and analyze key drivers of risk and return and build portfolios more effectively. The Company has five operating segments: Index, Analytics, Sustainability and Climate, Real Assets and Private Capital Solutions which\n are presented as the following three reportable segments: Index, Analytics, and Sustainability and Climate. For reporting purposes, the Real Assets and Private Capital Solutions operating segments are combined and presented as All Other – Private Assets, as they did not meet the required thresholds for separate reportable segment disclosure.\nOur growth strategy includes: (a) extending leadership in research-enhanced content across asset classes, (b) leading the enablement of sustainability and climate investment integration, (c) enhancing distribution and content-enabling technology, (d) expanding solutions that empower client customization, (e) strengthening client relationships and expanding our presence in key geographic areas and (f) executing strategic partnerships and acquisitions with complementary data, content and technology companies. For more information about our Company’s operations, see “\nItem 1: Business\n” in our Form 10-K.\nAs of September 30, 2025, we served approximately 6,900\n1\n clients in more than 95 countries.\nOur principal business model is generally to license annual, recurring subscriptions for the majority of our Index, Analytics and Sustainability and Climate products and services for a fee due in advance of the service period. Private Assets products are also licensed annually through subscriptions, which are generally recurring, for a fee which is paid in advance when products are generally delivered ratably over the subscription period or in arrears after the product is delivered. A portion of our fees comes from clients who use our indexes as the basis for index-linked investment products. Such fees are primarily based on a client’s assets under management (“AUM”), trading volumes and fee levels.\nIn evaluating our financial performance, we focus on revenue and profit growth, including results accounted for under generally accepted accounting principles in the United States (“GAAP”), as well as non-GAAP measures, for the Company as a whole and by operating segment.\nWe present revenues disaggregated by types and by segments, which represent our major product lines. We also review expenses by activity, which provides more transparency into how resources are being deployed. In addition, we utilize operating metrics including Run Rate, subscription sales and Retention Rate to manage and assess performance and to provide deeper insights into the recurring portion of our business.\n1\nRepresents the aggregate of all related clients under their respective parent entity. At acquisition, we align an acquired company’s client count to our methodology.\n25\nTable of Contents\nIn the first quarter of 2025, we renamed our “ESG and Climate” operating and reportable segment to “Sustainability and Climate” to reflect the breadth of our product offerings. There were no changes to the composition of our reportable segments or information reviewed by the chief operating decision maker and no impact on our historical segment operating results.\nIn the discussion that follows, we provide certain variances excluding the impact of foreign currency exchange rate fluctuations and acquisitions. Foreign currency exchange rate fluctuations reflect the difference between the current period results as reported compared to the current period results recalculated using the foreign currency exchange rates in effect for the comparable prior period. While operating revenues adjusted for the impact of foreign currency fluctuations includes asset-based fees that have been adjusted for the impact of foreign currency fluctuations, the underlying AUM, which is the primary component of asset-based fees, is not adjusted for foreign currency fluctuations. Approximately three-fifths of the AUM is invested in securities denominated in currencies other than the U.S. dollar, and accordingly, any such impact is excluded from the disclosed foreign currency-adjusted variances.\nFor the nine months ended September 30, 2025, our largest client organization by revenue, BlackRock, accounted for 10.6% of our consolidated operating revenues, with 96.4% of the operating revenues from BlackRock coming from fees based on the assets in BlackRock’s ETFs and non-ETF products that are based on our indexes.\nThe discussion of our results of operations for the three and nine months ended September 30, 2025 and 2024 are presented below. The results of operations for interim periods may not be indicative of future results.\nCritical Accounting Policies and Estimates\nWe describe our significant accounting policies in Note 1, “Introduction and Basis of Presentation,” of the Notes to Consolidated Financial Statements included in our Form 10-K. There have been no significant changes in our accounting policies or critical accounting estimates during the nine months ended September 30, 2025.\nGoodwill\nWe recognize goodwill in business combination transactions when the purchase price exceeds the fair value of the acquired net tangible and separately identifiable intangible assets. We test goodwill for impairment annually on July 1 or when interim triggers arise at the reporting unit level. When testing goodwill for impairment, we first assess qualitative factors to determine whether it is necessary to perform the quantitative goodwill impairment test; however, on a periodic basis, we may elect to bypass the qualitative assessment and proceed directly to the quantitative test. \nAs of July 1, 2025, the Company has selected to bypass the optional qualitative assessment for the Real Assets and Private Capital Solutions (“PCS”) reporting units. This decision was based on the relatively low excess of fair value over carrying value observed in the prior year’s analysis. Therefore, a quantitative goodwill impairment test was performed for both Real Assets and PCS. For the Index, Analytics, and Sustainability and Climate reporting units, the company performed a qualitative assessment. The quantitative test for impairment used an equal weighting of the income approach and the market approach to estimate the fair value of the Real Assets and PCS reporting units. \nThe income approach requires significant judgments in estimating future cash flows, including assumptions, amongst others, about revenue growth rates and EBITDA margins, and the selection of an appropriate discount rate, which reflects the reporting unit’s cost of capital. Forecasted future cash flows are estimated based on a combination of historical experience and assumptions regarding future growth and profitability of each reporting unit. Discount rates are selected for each reporting unit being valued based on each reporting unit’s estimated weighted-average cost of capital. The weighted-average cost of capital is estimated based on both the capital structure that we believe a market participant would utilize as well as the discount rates of guideline public companies that have similar characteristics to each reporting unit being valued, adjusted for the risk inherent in each reporting unit. Terminal growth rates are selected based on growth rates used during the reporting unit’s forecast period in combination with economic conditions. \nThe market approach utilizes valuation multiples of revenue and cash flows derived from guideline public companies that have similar characteristics to each reporting unit being valued. Selecting appropriate guideline companies, valuation multiples and other key assumptions such as revenue growth rates and discount rates requires significant management judgment, and changes to these estimates could materially impact the fair value determination of each reporting unit. We perform sensitivity analyses around key assumptions in order to assess the reasonableness of the assumptions and the impact on the estimated fair value.\nImpairment occurs when the estimated fair value of the reporting unit is below the carrying value. As of July 1, 2025, all reporting units had fair values exceeding their carrying values. As a result, no goodwill impairment was recorded as of this date. \n26\nTable of Contents\nAt September 30, 2025, the carrying value of goodwill of the Real Assets and Private Capital Solutions reporting units were $691.3 million and $617.8 million, respectively. As of July 1, 2025, the fair value of the Real Assets and Private Capital Solutions reporting units exceeded their carrying values by appr\noximately 39% and 15%,\n respectively. If we experience a prolonged downturn in the business environment or financial markets, weaker-than-expected performance of one of our businesses or a sustained decline in our common stock price, our goodwill could be impaired in the future, which may be material to our results of operations and financial position.\nFor the Real Assets and PCS reporting units, individually, a hypothetical decrease in revenue growth rates by 100 basis points or a hypothetical 100 basis point increase in the weighted average cost of capital would not result in an impairment. See Note 6, “Goodwill and Intangible Assets, Net” of the Notes to the Condensed Consolidated Financial Statements included herein for additional information on goodwill.\nResults of Operations\nOperating Revenues\nOur operating revenues are grouped by the following types: recurring subscriptions, asset-based fees and non-recurring. We also group operating revenues by major product as follows: Index, Analytics, Sustainability and Climate and \nAll Other – Private Assets\n.\nThe following table presents operating revenues by type for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nIndex\nRecurring subscriptions\n$\n242,569 \n$\n223,945 \n8.3\n%\n$\n711,546 \n$\n653,929 \n8.8\n%\nAsset-based fees\n197,515 \n168,622 \n17.1\n%\n559,002 \n482,162 \n15.9\n%\nNon-recurring\n11,076 \n12,315 \n(10.1\n%)\n37,188 \n39,855 \n(6.7\n%)\nIndex total\n451,160 \n404,882 \n11.4\n%\n1,307,736 \n1,175,946 \n11.2\n%\nAnalytics\nRecurring subscriptions\n178,292 \n168,150 \n6.0\n%\n517,828 \n490,829 \n5.5\n%\nNon-recurring\n3,878 \n4,226 \n(8.2\n%)\n14,230 \n11,508 \n23.7\n%\nAnalytics total\n182,170 \n172,376 \n5.7\n%\n532,058 \n502,337 \n5.9\n%\nSustainability and Climate\nRecurring subscriptions\n88,676 \n81,536 \n8.8\n%\n258,440 \n235,954 \n9.5\n%\nNon-recurring\n1,449 \n2,107 \n(31.2\n%)\n5,215 \n5,428 \n(3.9\n%)\nSustainability and Climate total\n90,125 \n83,643 \n7.7\n%\n263,655 \n241,382 \n9.2\n%\nAll Other - Private Assets\nRecurring subscriptions\n69,524 \n62,991 \n10.4\n%\n206,656 \n190,434 \n8.5\n%\nNon-recurring\n447 \n813 \n(45.0\n%)\n1,826 \n2,520 \n(27.5\n%)\nAll Other - Private Assets total\n69,971 \n63,804 \n9.7\n%\n208,482 \n192,954 \n8.0\n%\nRecurring subscriptions total\n579,061 \n536,622 \n7.9\n%\n1,694,470 \n1,571,146 \n7.8\n%\nAsset-based fees\n197,515 \n168,622 \n17.1\n%\n559,002 \n482,162 \n15.9\n%\nNon-recurring\n16,850 \n19,461 \n(13.4\n%)\n58,459 \n59,311 \n(1.4\n%)\nTotal operating revenues\n$\n793,426 \n$\n724,705 \n9.5\n%\n$\n2,311,931 \n$\n2,112,619 \n9.4\n%\nTotal operating revenues increased 9.5% for the three months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, total operating revenues would have increased 9.0%.\n27\nTable of Contents\nTotal operating revenues increased 9.4% for the nine months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, total operating revenues would have increased 9.0%.\nRefer to the section titled “Segment Results” that follows for further discussion of segment revenues.\nOperating Expenses\nWe group our operating expenses into the following activity categories:\n•\nCost of revenues;\n•\nSelling and marketing;\n•\nResearch and development (“R&D”);\n•\nGeneral and administrative (“G&A”);\n•\nAmortization of intangible assets; and\n•\nDepreciation and amortization of property, equipment and leasehold improvements.\nCosts are assigned to these activity categories based on the nature of the expense or, when not directly attributable, an estimated allocation based on the type of effort involved. Cost of revenues, selling and marketing, R&D and G&A all include both compensation as well as non-compensation related expenses.\nThe following table presents operating expenses by activity category for the periods indicated: \nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating expenses:\nCost of revenues\n$\n132,528 \n$\n126,192 \n5.0\n%\n$\n406,985 \n$\n382,815 \n6.3\n%\nSelling and marketing\n79,856 \n70,763 \n12.8\n%\n236,773 \n214,385 \n10.4\n%\nResearch and development\n44,807 \n38,584 \n16.1\n%\n136,472 \n120,182 \n13.6\n%\nGeneral and administrative\n41,805 \n41,561 \n0.6\n%\n137,251 \n137,958 \n(0.5\n%)\nAmortization of intangible assets\n40,937 \n41,939 \n(2.4\n%)\n128,569 \n121,316 \n6.0\n%\nDepreciation and amortization of property,  equipment and leasehold improvements\n5,803 \n4,332 \n34.0\n%\n15,934 \n12,639 \n26.1\n%\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n6.9\n%\n$\n1,061,984 \n$\n989,295 \n7.3\n%\nTotal operating expenses increased 6.9% for the three months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, the increase would have been 6.1%.\nTotal operating expenses increased 7.3% for the nine months ended September 30, 2025. Adjusting for the impact of foreign currency exchange rate fluctuations, the increase would have been 7.4%.\nDescriptions of MSCI’s operating expense categories are provided in “Item 7 — Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Form 10-K. The discussion below focuses on year-over-year changes and key drivers.\nCost of Revenues\nCost of revenues increased 5.0% and 6.3% for the three and nine months ended September 30, 2025, respectively, \nprimarily driven by increases in compensation and benefits costs as a result of increased headcount costs and higher severance costs, as well as increases in non-compensation costs reflecting higher information technology costs.\n28\nTable of Contents\nSelling and Marketing\nSelling and marketing expenses increased 12.8% and 10.4% for the three and nine months ended September 30, 2025, respectively, \nprimarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs.\nResearch and Development\nR&D expenses increased 16.1% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase is also driven by increases in non-compensation costs reflecting higher information technology costs.\nR&D expenses increased 13.6% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs, partially offset by increased capitalization of costs related to internally developed software projects. The increase is also driven by increases in non-compensation costs reflecting higher information technology costs.\nGeneral and Administrative\nG&A expenses increased 0.6% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs, partially offset by decreases in non-compensation costs reflecting lower transaction costs.\nG&A expenses decreased 0.5% for the nine months ended September 30, 2025, primarily driven by decreases in non-compensation costs reflecting lower transaction costs, partially offset by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs.\nThe following table presents operating expenses using compensation and non-compensation categories, rather than using activity categories, for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nCompensation and benefits\n$\n215,259 \n$\n194,809 \n10.5\n%\n$\n672,432 \n$\n618,421 \n8.7\n%\nNon-compensation expenses\n83,737 \n82,291 \n1.8\n%\n245,049 \n236,919 \n3.4\n%\nAmortization of intangible assets\n40,937 \n41,939 \n(2.4\n%)\n128,569 \n121,316 \n6.0\n%\nDepreciation and amortization of property,  equipment and leasehold improvements\n5,803 \n4,332 \n34.0\n%\n15,934 \n12,639 \n26.1\n%\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n6.9\n%\n$\n1,061,984 \n$\n989,295 \n7.3\n%\nCompensation and Benefits\nWe had 6,253 employees as of September 30, 2025, compared to 6,118 employees as of September 30, 2024, reflecting a 2.2% increase in the number of employees. Continued growth of our emerging market centers around the world is an important factor in our ability to manage and control the growth of our compensation and benefits costs. As of September 30, 2025, 70% of our employees were located in emerging market centers compared to 69% as of September 30, 2024. \nCompensation and benefits costs increased 10.5% and 8.7%, respectively, for the three and nine months ended September 30, 2025, p\nrimarily driven by increased headcount costs and higher severance costs\n. \nAdjusting for the impact of foreign currency exchange rate fluctuations, compensation and benefits costs would have increased by 9.3% and increased by 8.9%, respectively, for the three and nine months ended September 30, 2025.\nNon-Compensation Expenses\nNon-compensation expenses increased 1.8% for the three months ended September 30, 2025, primarily driven by higher information technology costs, partially offset by lower transaction costs.\n29\nTable of Contents\nNon-compensation expenses increased\n \n3.4% for the nine months ended September 30, 2025, primarily driven by higher information technology and market data costs, partially offset by lower transaction costs.\nAdjusting for the impact of foreign currency exchange rate fluctuations, non-compensation expenses would have increased by 1.4% and 3.4%, respectively, for the three and nine months ended September 30, 2025.\nAmortization of Intangible Assets\nAmortization of intangible assets expense decreased 2.4% for the three months ended September 30, 2025, primarily driven by certain intangible assets becoming fully amortized during the period, partially offset by higher amortization of internally developed software.\nAmortization of intangible assets expense increased 6.0% for the nine months ended September 30, 2025, primarily driven by higher amortization of internally developed software.\nDepreciation and Amortization of Property, Equipment and Leasehold Improvements\nDepreciation and amortization of property, equipment and leasehold improvements increased 34.0% and 26.1% for the three and nine months ended September 30, 2025, respectively, primarily driven by higher depreciation on computer and related equipment.\nTotal Other Expense (Income), Net\nThe following table shows our other expense (income), net for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nInterest income\n$\n(5,109)\n$\n(5,217)\n(2.1\n%)\n$\n(11,914)\n$\n(17,375)\n(31.4\n%)\nInterest expense\n53,620 \n46,688 \n14.8\n%\n146,296 \n139,995 \n4.5\n%\nOther expense (income)\n2,671 \n2,927 \n(8.7\n%)\n10,147 \n7,881 \n28.8\n%\nTotal other expense (income), net\n$\n51,182 \n$\n44,398 \n15.3\n%\n$\n144,529 \n$\n130,501 \n10.7\n%\nTotal other expense (income), net increased 15.3% for the three months ended September 30, 2025, primarily driven by higher interest expenses reflecting higher debt levels.\nTotal other expense (income), net increased 10.7% for the nine months ended September 30, 2025, primarily driven by higher interest expenses reflecting higher debt levels, lower interest income reflecting lower average cash balances as well as unfavorable foreign currency exchange rate fluctuations.\nIncome Taxes\nThe effective tax rate for the three months ended September 30, 2025 and 2024 was 17.9% and 21.3%, respectively. The rate is primarily driven by favorable prior-year items in the current year, compared to unfavorable prior-year items in the preceding year. \nThe effective tax rate for the nine months ended September 30, 2025 and 2024 was 17.0% and 19.1%, respectively. The decrease is primarily driven by the benefit of prior-year refund claims in the current year, partially offset by a decrease in excess tax benefits recognized on share-based compensation vested.\nNet Income\nThe following table shows our net income for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nNet income\n$\n325,386 \n$\n280,901 \n15.8 \n%\n$\n917,636 \n$\n803,613 \n14.2 \n%\n30\nTable of Contents\nAs a result of the factors described above, net income increased 15.8% for the three months ended September 30, 2025, and increased 14.2% for the nine months ended September 30, 2025.\nWeighted Average Shares and Common Shares Outstanding\nThe following table shows our weighted average shares outstanding for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change\nNine Months Ended\nSeptember 30,\n% Change\n(in thousands)\n2025\n2024\n2025\n2024\nWeighted average shares outstanding:\nBasic\n76,460\n78,499\n(2.6\n%)\n77,159\n78,925\n(2.2\n%)\nDiluted\n76,579\n78,729\n(2.7\n%)\n77,290\n79,159\n(2.4\n%)\n    \nThe following table shows our common shares outstanding for the periods indicated:\nAs of\n% Change\n(in thousands)\nSeptember 30,\n2025\nDecember 31,\n2024\nCommon shares outstanding\n75,181 \n77,745 \n(3.3\n%)\nThe decrease in weighted average shares and common shares outstanding for the three and nine months ended September 30, 2025 primarily reflects the impact of share repurchases made pursuant to the Company’s stock repurchase program, partially offset by the vesting of certain stock-based awards.\nNon-GAAP Financial Measures\nAdjusted EBITDA\n“Adjusted EBITDA,” a non-GAAP measure used by management to assess operating performance, is defined as net income before (1) provision for income taxes, (2) other expense (income), net, (3) depreciation and amortization of property, equipment and leasehold improvements, (4) amortization of intangible assets and, at times, (5) certain other transactions or adjustments, including, when applicable, certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA expenses,” a non-GAAP measure used by management to assess operating performance, is defined as operating expenses less depreciation and amortization of property, equipment and leasehold improvements and amortization of intangible assets and, at times, certain other transactions or adjustments, including, when applicable, certain acquisition-related integration and transaction costs.\n“Adjusted EBITDA margin” is defined as Adjusted EBITDA divided by operating revenues.\nAdjusted EBITDA, Adjusted EBITDA expenses and Adjusted EBITDA margin are believed to be meaningful measures for management to assess the operating performance of the Company because they adjust for significant one-time, unusual or non-recurring items as well as eliminate the accounting effects of certain capital spending and acquisitions that do not directly affect what management considers to be the Company’s ongoing operating performance in the period. All companies do not calculate adjusted EBITDA, adjusted EBITDA expenses and adjusted EBITDA margin in the same way. These measures can differ significantly from company to company depending on, among other things, long-term strategic decisions regarding capital structure, the tax jurisdictions in which companies operate and capital investments. Accordingly, the Company’s computation of the Adjusted EBITDA, Adjusted EBITDA expenses and Adjusted EBITDA margin measures may not be comparable to similarly titled measures computed by other companies.\n31\nTable of Contents\nThe following table presents non-GAAP Adjusted EBITDA for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues\n$\n793,426\n$\n724,705\n$\n2,311,931\n$\n2,112,619\nAdjusted EBITDA expenses\n298,996\n274,003\n917,481\n848,389\nAdjusted EBITDA\n$\n494,430\n$\n450,702\n$\n1,394,450\n$\n1,264,230\nOperating margin %\n56.4\n%\n55.4\n%\n54.1\n%\n53.2\n%\nAdjusted EBITDA margin %\n62.3\n%\n62.2\n%\n60.3\n%\n59.8\n%\nReconciliation of Net Income to Adjusted EBITDA and Operating Expenses to Adjusted EBITDA Expenses\nThe following table presents the reconciliation of net income to Adjusted EBITDA for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nNet income\n$\n325,386 \n$\n280,901 \n$\n917,636 \n$\n803,613 \nProvision for income taxes\n71,122 \n76,035 \n187,782 \n189,210 \nOther expense (income), net\n51,182 \n44,398 \n144,529 \n130,501 \nOperating income\n447,690 \n401,334 \n1,249,947 \n1,123,324 \nAmortization of intangible assets\n40,937 \n41,939 \n128,569 \n121,316 \nDepreciation and amortization of property, equipment and leasehold improvements\n5,803 \n4,332 \n15,934 \n12,639 \nAcquisition-related integration and transaction costs\n(1)\n— \n3,097 \n— \n6,951 \nConsolidated Adjusted EBITDA\n$\n494,430 \n$\n450,702 \n$\n1,394,450 \n$\n1,264,230 \nIndex Adjusted EBITDA\n350,263 \n314,148 \n991,992 \n898,898 \nAnalytics Adjusted EBITDA\n90,038 \n90,287 \n258,674 \n244,171 \nSustainability and Climate Adjusted EBITDA\n34,806 \n29,989 \n90,304 \n75,010 \nAll Other - Private Assets Adjusted EBITDA\n19,323 \n16,278 \n53,480 \n46,151 \nConsolidated Adjusted EBITDA\n$\n494,430 \n$\n450,702 \n$\n1,394,450 \n$\n1,264,230 \n___________________________\n(1)\nRepresents transaction expenses and other costs directly related to the acquisition and integration of acquired businesses, including professional fees, severance expenses, regulatory filing fees and other costs, in each case that are incurred no later than 12 months after the close of the relevant acquisition.\n32\nTable of Contents\nThe following table presents the reconciliation of operating expenses to Adjusted EBITDA expenses for the periods indicated: \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\n2025\n2024\nTotal operating expenses\n$\n345,736 \n$\n323,371 \n$\n1,061,984 \n$\n989,295 \nAmortization of intangible assets\n40,937 \n41,939 \n128,569 \n121,316 \nDepreciation and amortization of property, equipment and leasehold improvements\n5,803 \n4,332 \n15,934 \n12,639 \nAcquisition-related integration and transaction costs\n(1)\n— \n3,097 \n— \n6,951 \nConsolidated Adjusted EBITDA expenses\n$\n298,996 \n$\n274,003 \n$\n917,481 \n$\n848,389 \nIndex Adjusted EBITDA expenses\n$\n100,897 \n$\n90,734 \n$\n315,744 \n$\n277,048 \nAnalytics Adjusted EBITDA expenses\n92,132 \n82,089 \n273,384 \n258,166 \nSustainability and Climate Adjusted EBITDA expenses\n55,319 \n53,654 \n173,351 \n166,372 \nAll Other - Private Assets Adjusted EBITDA expenses\n50,648 \n47,526 \n155,002 \n146,803 \nConsolidated Adjusted EBITDA expenses\n$\n298,996 \n$\n274,003 \n$\n917,481 \n$\n848,389 \n___________________________\n(1)\nRepresents transaction expenses and other costs directly related to the acquisition and integration of acquired businesses, including professional fees, severance expenses, regulatory filing fees and other costs, in each case that are incurred no later than 12 months after the close of the relevant acquisition.\nSegment Results\nIndex Segment\nThe following table presents the results for the Index segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n242,569\n$\n223,945\n8.3%\n$\n711,546\n$\n653,929\n8.8\n%\nAsset-based fees\n197,515\n168,622\n17.1%\n559,002\n482,162\n15.9\n%\nNon-recurring\n11,076\n12,315\n(10.1%)\n37,188\n39,855\n(6.7\n%)\nOperating revenues total\n451,160\n404,882\n11.4%\n1,307,736\n1,175,946\n11.2\n%\nAdjusted EBITDA expenses\n100,897\n90,734\n11.2%\n315,744\n277,048\n14.0\n%\nAdjusted EBITDA\n$\n350,263\n$\n314,148\n11.5%\n$\n991,992\n$\n898,898\n10.4\n%\nAdjusted EBITDA margin %\n77.6 \n%\n77.6 \n%\n75.9 \n%\n76.4 \n%\nIndex operating revenues increased 11.4% for the three months ended September 30, 2025, driven by growth from asset-based fees as well as recurring subscriptions. Adjusting for the impact of foreign currency exchange rate fluctuations, Index operating revenues would have increased 11.4%.\nOperating revenues from recurring subscriptions increased 8.3% for the three months ended September 30, 2025, primarily driven by growth from market cap-weighted Index products. \nOperating revenues from asset-based fees increased 17.1% for the three months ended September 30, 2025, primarily driven by growth in revenues from ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. Operating revenues from ETFs linked to MSCI equity indexes increased by 24.1%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. Operating revenues from non-ETF indexed funds linked to MSCI indexes increased by 8.5%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees.\n33\nTable of Contents\nIndex operating revenues increased 11.2% for the nine months ended September 30, 2025, primarily driven by growth from asset-based fees as well as recurring subscriptions. Adjusting for the impact of foreign currency exchange rate fluctuations, Index operating revenues would have increased 11.1%.\nOperating revenues from recurring subscriptions increased 8.8% for the nine months ended September 30, 2025, primarily driven by growth from market cap-weighted Index products. \nOperating revenues from asset-based fees increased 15.9% for the nine months ended September 30, 2025, primarily driven by growth in revenues from ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. Operating revenues from ETFs linked to MSCI equity indexes increased by 18.9%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. Operating revenues from non-ETF indexed funds linked to MSCI indexes increased 13.9%, primarily driven by an increase in average AUM, partially offset by a decrease in average basis point fees. \nThe following table presents the value of AUM in ETFs linked to MSCI equity indexes and the sequential change of such assets as of the end of each of the periods indicated:\nPeriod Ended\n2024\n2025\n(in billions)\nMarch\n31,\nJune\n30,\nSeptember\n30,\nDecember\n31,\nMarch\n31,\nJune\n30,\nSeptember\n30,\nAUM in ETFs linked to MSCI equity indexes\n(1) (2)\n$\n1,582.6 \n$\n1,631.9 \n$\n1,761.8 \n$\n1,724.7 \n$\n1,783.1 \n$\n2,024.6 \n$\n2,211.0 \nSequential Change in Value\nMarket Appreciation/(Depreciation)\n$\n92.8 \n$\n21.2 \n$\n111.3 \n$\n(85.3)\n$\n16.4 \n$\n193.0 \n$\n140.0 \nCash Inflows\n20.9 \n28.1 \n18.6 \n48.2 \n42.0 \n48.5 \n46.4 \nTotal Change\n$\n113.7 \n$\n49.3 \n$\n129.9 \n$\n(37.1)\n$\n58.4 \n$\n241.5 \n$\n186.4 \nThe following table presents the average value of AUM in ETFs linked to MSCI equity indexes for the periods indicated:\n2024\n2025\n(in billions)\nMarch\nJune\nSeptember\nDecember\nMarch\nJune\nSeptember\nAUM in ETFs linked to MSCI equity indexes\n(1) (2)\nQuarterly average\n$\n1,508.8 \n$\n1,590.6 \n$\n1,677.0 \n$\n1,755.4 \n$\n1,793.7 \n$\n1,868.7 \n$\n2,108.4 \nYear-to-date average\n$\n1,508.8 \n$\n1,549.7 \n$\n1,592.1 \n$\n1,632.9 \n$\n1,793.7 \n$\n1,831.2 \n$\n1,923.6 \n___________________________\n(1)\nThe historical values of the AUM in ETFs linked to our equity indexes as of the last day of the month and the monthly average balance can be found under the link “AUM in ETFs Linked to MSCI Equity Indexes” on our Investor Relations homepage at \nhttp://ir.msci.com\n. This information is updated mid-month each month. Information contained on our website is not deemed part of or incorporated by reference into this Quarterly Report on Form 10-Q or any other report filed with the SEC. The AUM in ETFs also includes AUM in Exchange Traded Notes, the value of which is less than 1.0% of the AUM amounts presented.\n(2)\nThe value of AUM in ETFs linked to MSCI equity indexes is calculated by multiplying the equity ETF net asset value by the number of shares outstanding.\nThe average value of AUM in ETFs linked to MSCI equity indexes for the three months ended September 30, 2025, was up $431.4 billion, or 25.7%. For the nine months ended September 30, 2025, the average value of AUM in ETFs linked to MSCI equity indexes was up $331.5 billion, or 20.8%.\nIndex segment Adjusted EBITDA expenses increased 11.2% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs and professional fees. Adjusting for the impact of foreign currency exchange rate fluctuations, Index segment Adjusted EBITDA expenses would have increased\n \nby 10.2%.\nIndex segment Adjusted EBITDA expenses increased 14.0% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs and professional fees. Adjusting for the impact of foreign currency exchange rate fluctuations, Index segment Adjusted EBITDA expenses would have increased by 14.1%.\n34\nTable of Contents\nAnalytics Segment\nThe following table presents the results for the Analytics segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n178,292 \n$\n168,150 \n6.0\n%\n$\n517,828 \n$\n490,829 \n5.5\n%\nNon-recurring\n3,878 \n4,226 \n(8.2\n%)\n14,230 \n11,508 \n23.7\n%\nOperating revenues total\n182,170 \n172,376 \n5.7\n%\n532,058 \n502,337 \n5.9\n%\nAdjusted EBITDA expenses\n92,132 \n82,089 \n12.2\n%\n273,384 \n258,166 \n5.9\n%\nAdjusted EBITDA\n$\n90,038 \n$\n90,287 \n(0.3\n%)\n$\n258,674 \n$\n244,171 \n5.9\n%\nAdjusted EBITDA margin %\n49.4 \n%\n52.4 \n%\n48.6 \n%\n48.6 \n%\nAnalytics operating revenues increased 5.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.6%.\nAnalytics segment Adjusted EBITDA expenses increased 12.2% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 11.5%.\nAnalytics operating revenues increased 5.9% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to both Equity Analytics and Multi-Asset Class products. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics operating revenues would have increased 5.8%.\nAnalytics segment Adjusted EBITDA expenses increased 5.9% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Analytics segment Adjusted EBITDA expenses would have increased 6.3%.\nSustainability and Climate Segment\nThe following table presents the results for the Sustainability and Climate segment for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n88,676 \n$\n81,536 \n8.8\n%\n$\n258,440 \n$\n235,954 \n9.5\n%\nNon-recurring\n1,449 \n2,107 \n(31.2\n%)\n5,215 \n5,428 \n(3.9\n%)\nOperating revenues total\n90,125 \n83,643 \n7.7\n%\n263,655 \n241,382 \n9.2\n%\nAdjusted EBITDA expenses\n55,319 \n53,654 \n3.1\n%\n173,351 \n166,372 \n4.2\n%\nAdjusted EBITDA\n$\n34,806 \n$\n29,989 \n16.1\n%\n$\n90,304 \n$\n75,010 \n20.4\n%\nAdjusted EBITDA margin %\n38.6 \n%\n35.9 \n%\n34.3 \n%\n31.1 \n%\nSustainability and Climate operating revenues increased 7.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 5.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 3.1% for the three months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance \n35\nTable of Contents\ncosts. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 2.0%.\nSustainability and Climate operating revenues increased 9.2% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions related to Ratings and Climate products, with growth primarily attributable to EMEA. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate operating revenues would have increased 7.1%.\nSustainability and Climate segment Adjusted EBITDA expenses increased 4.2% for the nine months ended September 30, 2025, primarily driven by higher benefits and compensation costs as a result of increased headcount costs as well as higher severance costs. The increase was also driven by non-compensation expenses reflecting higher information technology costs. Adjusting for the impact of foreign currency exchange rate fluctuations, Sustainability and Climate segment Adjusted EBITDA expenses would have increased 4.2%.\nAll Other – Private Assets\nThe following table presents the results for All Other – Private Assets for the periods indicated:\nThree Months Ended\nSeptember 30,\n% Change \nNine Months Ended\nSeptember 30,\n% Change \n(in thousands)\n2025\n2024\n2025\n2024\nOperating revenues:\nRecurring subscriptions\n$\n69,524 \n$\n62,991 \n10.4\n%\n$\n206,656 \n$\n190,434 \n8.5\n%\nNon-recurring\n447 \n813 \n(45.0\n%)\n1,826 \n2,520 \n(27.5\n%)\nOperating revenues total\n69,971 \n63,804 \n9.7\n%\n208,482 \n192,954 \n8.0\n%\nAdjusted EBITDA expenses\n50,648 \n47,526 \n6.6\n%\n155,002 \n146,803 \n5.6\n%\nAdjusted EBITDA\n$\n19,323 \n$\n16,278 \n18.7\n%\n$\n53,480 \n$\n46,151 \n15.9\n%\nAdjusted EBITDA margin %\n27.6 \n%\n25.5 \n%\n25.7 \n%\n23.9 \n%\nAll Other – Private Assets operating revenues increased 9.7% for the three months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Total Plan Portfolio Management and Private Capital Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 8.3%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 6.6% for the three months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.4%.\nAll Other – Private Assets operating revenues increased 8.0% for the nine months ended September 30, 2025, primarily driven by growth from recurring subscriptions in Private Capital Solutions related to Private Capital Intel, Total Plan Portfolio Management and Transparency Data products, as well as growth from recurring subscription in Real Assets related to Index Intel products. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other – Private Assets operating revenues would have increased 7.2%.\nAll Other – Private Assets Adjusted EBITDA expenses increased 5.6% for the nine months ended September 30, 2025, primarily driven by increases in compensation and benefits costs as a result of increased headcount costs as well as higher severance costs. Adjusting for the impact of foreign currency exchange rate fluctuations, All Other - Private Assets Adjusted EBITDA expenses would have increased 5.2%.\n Operating Metrics\nA substantial portion of MSCI’s operating revenues is derived from recurring subscriptions or licenses for products and services that are ongoing in nature and provided over contractually agreed periods, which are subject to renewal or cancellation upon the expiration of the then-current term. In addition, we generate non-recurring revenues from one-time sales and other transactions or services that are discrete in nature or that have a defined life. The operating metrics defined below help management assess the \n36\nTable of Contents\nstability and growth of this recurring-revenue base and track non-recurring revenues. There have been no changes to the methodologies used to compute these metrics compared with prior periods.\nRun Rate\nRun Rate estimates, at a specific point in time, the annualized value of the recurring portion of executed client contracts (“Client Contracts”) expected to generate revenues over the next 12 months, assuming that all such Client Contracts are renewed and using fixed foreign exchange rates. Run Rate includes new Client Contracts upon execution, even if the license start date and related revenue recognition occur later.\nFor Client Contracts where fees are linked to an investment product’s assets or trading volume or fees (referred to as “Asset-based Fees”), the Run Rate calculation is based on:\n•\nFor exchange-traded funds (“ETFs”): assets under management as of the last trading day of the period;\n•\nFor non-ETF products: the most recent client-reported assets under management; and\n•\nFor listed futures and options contracts: the most recent quarterly volumes and/or reported exchange fees.\nRun Rate excludes fees associated with one-time or other non-recurring transactions.\nWe remove from Run Rate the annualized fee value associated with products or services under any Client Contracts when (i) we have received a notice of termination, reduction in fees, non-renewal or other clear indication that the client does not intend to continue its subscription at then current fees; and (ii) management has determined that such notice or indication reflects the client’s final decision to terminate, not renew or renew at a lower fee the applicable products or services, even if such termination or non-renewal is not yet effective (each such event, a “Subscription Cancellation”).\nIn general, when a client reduces the fees paid to MSCI associated with a reduction in the number of products or services to which it subscribes within a segment, or a switch between products or services within a segment, unless the client switches to a product or service that management considers a replacement, such reduction or switch is treated as a Subscription Cancellation, including for purposes of calculating MSCI’s Retention Rate (as detailed below). In the cases where the client switches products or services to a replacement service, only the net decrease, if any, is reported as a cancellation.\n•\nIn the Analytics and Sustainability and Climate operating segments, substantially all such product or service switches are treated as replacements and are netted accordingly.\n•\nIn contrast, in the Index, Real Assets, and Private Capital Solutions operating segments, such netting treatment is applied only in limited circumstances.\nRun Rate may differ from revenues recognized in accordance with Accounting Standards Codification (“ASC”) Topic 606, Revenue from Contracts with Customers. Changes in our recurring revenues typically lag changes in Run Rate. Key factors include, but are not limited to:\n•\nImmediate recognition of the annualized value of newly executed recurring Client Contracts;\n•\nImmediate removal of the annualized value of Subscription Cancellations on Client Contracts;\n•\nImmediate updates to reflect modifications to existing Client Contracts, including changes in price or scope of services;\n•\nTiming differences between the effective date of service delivery and contract execution (e.g., Client Contracts with implementation periods, fee waivers or future-dated start terms);\n•\nVariability in revenues driven by exogenous factors, such as changes in reference asset values, currency exchange rates or investment flows;\n•\nVariability in revenues tied to trading volumes of futures and options contracts linked to MSCI indexes; and\n•\nThe effects of acquisitions and divestitures.\n•\nMulti-period agreements with contractual price escalators where the total revenue is recognized ratably over the contract period.\n37\nTable of Contents\nOrganic recurring subscription Run Rate growth is defined as the period-over-period growth in Run Rate, excluding:\n•\nThe impact of changes in foreign currency exchange rates;\n•\nThe impact of acquisitions during the first 12 months following the transaction date; and\n•\nThe impact of divestitures, where Run Rate from divested businesses are excluded from prior period Run Rates.\nThe following table presents Run Rates as of the dates indicated and the growth percentages over the periods indicated:\nAs of\n(in thousands)\nSeptember 30,\n2025\nSeptember 30,\n2024\nRun Rate Growth %\nOrganic Run Rate Growth %\nIndex:\nRecurring subscriptions\n$\n988,125 \n$\n906,803 \n9.0 \n%\n9.0 \n%\nAsset-based fees\n799,744 \n683,462 \n17.0\n%\n17.0\n%\nIndex total\n1,787,869 \n1,590,265 \n12.4\n%\n12.4\n%\nAnalytics\n742,404 \n691,333 \n7.4\n%\n6.9\n%\nSustainability and Climate\n370,809 \n344,015 \n7.8\n%\n5.8\n%\nAll Other - Private Assets\n285,418 \n268,577 \n6.3\n%\n5.5\n%\nTotal Run Rate\n$\n3,186,500 \n$\n2,894,190 \n10.1\n%\n9.7\n%\nRecurring subscriptions total\n$\n2,386,756 \n$\n2,210,728 \n8.0\n%\n7.4\n%\nAsset-based fees\n799,744 \n683,462 \n17.0\n%\n17.0\n%\nTotal Run Rate\n$\n3,186,500 \n$\n2,894,190 \n10.1\n%\n9.7\n%\nTotal Run Rate increased 10.1%, driven by a 8.0% increase from recurring subscriptions, primarily driven by increases in the asset manager, banks and broker-dealer, hedge fund and asset owner client segments, as well as a 17.0% increase from asset-based fees.\nRun Rate from Index recurring subscriptions increased 9.0%, primarily driven by growth from market cap-weighted and custom Index products. The increase reflected growth across all regions and client segments.\nRun Rate from Index asset-based fees increased 17.0%, primarily driven by higher AUM in both ETFs linked to MSCI equity indexes and non-ETF indexed funds linked to MSCI indexes. \nRun Rate from Analytics products increased 7.4%, primarily driven by growth in both Equity Analytics and Multi-Asset Class products, and reflected growth across all regions.\nRun Rate from Sustainability and Climate products increased 7.8%, driven by growth in Ratings and Climate products, with growth primarily attributable to EMEA. The increase is primarily driven by growth in asset manager and wealth manager client segments. \nRun Rate from All Other - Private Assets increased 6.3%, primarily driven by growth from Private Capital Solutions related to Total Plan Portfolio Management, Private Capital Intel and Transparency Data products, and reflected growth across all regions. The increase is primarily driven by growth in asset owner and asset manager client segments.\nSales\nSales represents the annualized value of products and services that clients have committed to purchase from MSCI and that are expected to result in additional operating revenues.\n38\nTable of Contents\nNon-recurring sales represent the aggregate value of client agreements entered into during the period that generate non-recurring fees and are not included in Run Rate (as defined elsewhere herein), even if such agreements span multiple periods or years.\nNew recurring subscription sales represent the annualized value of additional client commitments entered into during the period - such as new Client Contracts, expansions of existing Client Contracts or price increases - that contribute to Run Rate.\nNet new recurring subscription sales represent new recurring subscription sales minus the impact of Subscription Cancellations, capturing the net impact to Run Rate for the period.\nTotal gross sales is the sum of new recurring subscription sales and non-recurring sales.\nTotal net sales is total gross sales minus the impact of Subscription Cancellations.\nChanges in foreign currency are calculated by applying the exchange rates from the prior comparable period to the current period’s foreign currency-denominated Run Rate.\n39\nTable of Contents\nThe following table presents our recurring subscription sales, cancellations and non-recurring sales for the periods indicated:\nThree Months Ended\nNine Months Ended\n(in thousands)\nSeptember 30,\n2025\nSeptember 30,\n2024\nSeptember 30,\n2025\nSeptember 30,\n2024\nIndex\nNew recurring subscription sales\n$\n29,443 \n$\n25,271 \n$\n81,141 \n$\n80,081 \nSubscription cancellations\n(9,911)\n(9,862)\n(27,406)\n(34,876)\nNet new recurring subscription sales\n$\n19,532 \n$\n15,409 \n$\n53,735 \n$\n45,205 \nNon-recurring sales\n$\n12,657 \n$\n13,883 \n$\n42,504 \n$\n44,687 \nTotal gross sales\n$\n42,100 \n$\n39,154 \n$\n123,645 \n$\n124,768 \nTotal Index net sales\n$\n32,189 \n$\n29,292 \n$\n96,239 \n$\n89,892 \nAnalytics\nNew recurring subscription sales\n$\n21,961 \n$\n20,780 \n$\n60,923 \n$\n56,137 \nSubscription cancellations\n(9,853)\n(10,307)\n(28,710)\n(28,001)\nNet new recurring subscription sales\n$\n12,108 \n$\n10,473 \n$\n32,213 \n$\n28,136 \nNon-recurring sales\n$\n3,508 \n$\n7,293 \n$\n11,549 \n$\n13,812 \nTotal gross sales\n$\n25,469 \n$\n28,073 \n$\n72,472 \n$\n69,949 \nTotal Analytics net sales\n$\n15,616 \n$\n17,766 \n$\n43,762 \n$\n41,948 \nSustainability and Climate\nNew recurring subscription sales\n$\n7,424 \n$\n9,333 \n$\n24,959 \n$\n39,361 \nSubscription cancellations\n(5,509)\n(5,575)\n(15,535)\n(17,496)\nNet new recurring subscription sales\n$\n1,915 \n$\n3,758 \n$\n9,424 \n$\n21,865 \nNon-recurring sales\n$\n734 \n$\n2,345 \n$\n3,975 \n$\n6,852 \nTotal gross sales\n$\n8,158 \n$\n11,678 \n$\n28,934 \n$\n46,213 \nTotal Sustainability and Climate net sales\n$\n2,649 \n$\n6,103 \n$\n13,399 \n$\n28,717 \nAll Other - Private Assets\nNew recurring subscription sales\n$\n9,693 \n$\n9,959 \n$\n29,270 \n$\n29,877 \nSubscription cancellations\n(4,458)\n(4,610)\n(15,956)\n(15,112)\nNet new recurring subscription sales\n$\n5,235 \n$\n5,349 \n$\n13,314 \n$\n14,765 \nNon-recurring sales\n$\n939 \n$\n520 \n$\n2,757 \n$\n2,361 \nTotal gross sales\n$\n10,632 \n$\n10,479 \n$\n32,027 \n$\n32,238 \nTotal All Other - Private Assets net sales\n$\n6,174 \n$\n5,869 \n$\n16,071 \n$\n17,126 \nConsolidated\nNew recurring subscription sales\n$\n68,521 \n$\n65,343 \n$\n196,293 \n$\n205,456 \nSubscription cancellations\n(29,731)\n(30,354)\n(87,607)\n(95,485)\nNet new recurring subscription sales\n$\n38,790 \n$\n34,989 \n$\n108,686 \n$\n109,971 \nNon-recurring sales\n$\n17,838 \n$\n24,041 \n$\n60,785 \n$\n67,712 \nTotal gross sales\n$\n86,359 \n$\n89,384 \n$\n257,078 \n$\n273,168 \nTotal net sales\n$\n56,628 \n$\n59,030 \n$\n169,471 \n$\n177,683 \n40\nTable of Contents\nRetention Rate\nThe following table presents our Retention Rate for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nIndex\n95.8%\n95.4%\n96.1%\n94.6%\nAnalytics\n94.4%\n93.8%\n94.5%\n94.4%\nSustainability and Climate\n93.6%\n93.0%\n94.0%\n92.7%\nAll Other - Private Assets\n93.3%\n92.7%\n92.0%\n92.0%\nTotal\n94.7%\n94.2%\n94.8%\n93.9%\nRetention Rate is a key performance metric that provides insight into the stability and durability of MSCI’s recurring revenue base. Subscription cancellations reduce Run Rate and, over time, lower future operating revenues.\nFor full-year periods, Retention Rate is calculated as the retained subscription Run Rate, which is defined as the subscription Run Rate at the beginning of the fiscal year minus actual subscription cancellations during the fiscal year, expressed as a percentage of the subscription Run Rate at the beginning of the fiscal year.\nFor interim (non-annual) periods, Retention Rate is presented on an annualized basis. The annualized Retention Rate is calculated by:\n1.\nDividing annualized subscription cancellations in the period by the subscription Run Rate at the beginning of the fiscal year, to determine a cancellation rate; and\n2.\nSubtracting that rate from 100%, to derive the annualized Retention Rate.\nRetention Rate is calculated by operating segment and is based on an individual product or service level within each segment. We do not calculate Retention Rate for the portion of Run Rate attributable to Asset-based Fees.\nLiquidity and Capital Resources\nWe require capital to fund ongoing operations, internal growth initiatives and acquisitions. Our primary sources of liquidity are cash flows generated from our operations, existing cash and cash equivalents and credit capacity under our existing credit facility. In addition, we believe we have access to additional funding in the public and private markets. We intend to use these sources of liquidity to, among other things, service our existing and future debt obligations, fund our working capital requirements for capital expenditures, investments, acquisitions and dividend payments, and make repurchases of our common stock. In connection with our business strategy, we regularly evaluate acquisition and strategic partnership opportunities. We believe our liquidity, along with other financing alternatives, will provide the necessary capital to fund these transactions and achieve our planned growth.\nSenior Notes and Credit Agreement\nAs of September 30, 2025, we had an aggregate of $5.5 billion in Senior Notes outstanding. In addition, we had as of September 30, 2025 an aggregate of $0.1 billion in outstanding borrowings under the Revolving Credit Facility. See Note 7, “Debt” of the Notes to Condensed Consolidated Financial Statements (Unaudited) included herein for additional information on our outstanding indebtedness and revolving credit facility.\nOn August 8, 2025, we issued $1.25 billion aggregate principal amount of 5.25% Senior Unsecured Notes due 2035 (the “2035 Senior Notes”) in a registered public offering. The 2035 Senior Notes mature on September 1, 2035. At any time prior to June 1, 2035, we may redeem all or part of the 2035 Senior Notes at a redemption price equal to the sum of (i) 100% of the principal amount thereof, plus (ii) a make-whole premium as of the date of redemption, plus (iii) accrued and unpaid interest, if any, thereon to, but not including, the redemption date. On or after June 1, 2035, the 2035 Senior Notes are redeemable at 100% of the principal amount, plus accrued and unpaid interest to, but not including, the redemption date.\nOn August 20, 2025, we entered into a Third Amended and Restated Credit Agreement (the “Credit Agreement”) amending and restating in its entirety the Company’s prior Second Amended and Restated Credit Agreement (the “Prior Credit Agreement”). The Credit Agreement increases the aggregate revolving commitments to $1.6 billion (from $1.25 billion under the Prior Credit Agreement) under a revolving credit facility (the “Revolving Credit Facility”), and extends the availability period until August 20, 2030. Prior to entering into the Credit Agreement, we applied the proceeds of the offering of the 2035 Senior Notes to repay in full all outstanding borrowings under the Prior Credit Agreement. The obligations under the Credit Agreement are unsecured senior obligations of the Company.\n41\nTable of Contents\nThe indentures governing our Senior Notes (the “Indentures”)\n contain covenants that limit our and our subsidiaries’ ability to, among other things, incur liens, enter into sale/leaseback transactions and consolidate, merge or sell all or substantially all of our assets, and that limit the ability of our subsidiaries to incur certain indebtedness. \nThe Credit Agreement also contains covenants that limit our and our subsidiaries’ ability to, among other things, incur liens, enter into sale/leaseback transactions and consolidate, merge or sell all or substantially all of our assets, and that limit the ability of our subsidiaries to incur certain indebtedness.\nThe Credit Agreement and the Indentures also contain customary events of default, including those relating to non-payment, breach of representations, warranties or covenants, cross-default and cross-acceleration, and bankruptcy and insolvency events, and, in the case of the Credit Agreement, invalidity or impairment of loan documentation, change of control and customary ERISA defaults in addition to the foregoing. None of the restrictions above are expected to impact our ability to effectively operate the business.\nThe Credit Agreement also requires us and our subsidiaries to achieve financial and operating results sufficient to maintain compliance with the following financial ratios on a consolidated basis through the termination of the Credit Agreement: (1) the maximum Consolidated Leverage Ratio (as defined in the Credit Agreement) measured quarterly on a rolling four-quarter basis not to exceed 4.25:1.00 (or 4.50:1.00 for four fiscal quarters following a material acquisition) and (2) during any Non-Investment Grade Covenant Period (as defined in the Credit Agreement), the minimum Consolidated Interest Coverage Ratio (as defined in the Credit Agreement) measured quarterly on a rolling four-quarter basis of at least 3.00:1.00. As of September 30, 2025, our Consolidated Leverage Ratio was 2.70:1.00.\nShare Repurchases\nThe following table provides information with respect to repurchases of the Company’s common stock pursuant to open market repurchases:\nNine months ended\n(in thousands except per share data)\nAverage\nPrice\nPaid Per\nShare\nTotal\nNumber of\nShares\nRepurchased\nDollar\nValue of\nShares\nRepurchased\n(1)\nSeptember 30, 2025\n$\n559.44 \n2,703\n$\n1,512,260 \nSeptember 30, 2024\n$\n500.52 \n880\n$\n440,265 \n___________________________\n(1)\nThe values in this column exclude the 1% excise tax incurred on share repurchases pursuant to the Inflation Reduction Act. Any excise tax incurred is recognized as part of the cost of the shares acquired in the Unaudited Condensed Consolidated Statement of Shareholders’ Equity (Deficit).\nOn October 25, 2025, the Board of Directors authorized a new stock repurchase program for the repurchase of up to an aggregate of $3.0 billion worth of shares of MSCI’s common stock (the “2025 Repurchase Program”), which supersedes and replaces the 2024 Repurchase Program authorized. Share repurchases made pursuant to the 2025 Repurchase Program may take place in the open market or in privately negotiated transactions from time to time based on market and other conditions. This authorization may be modified, suspended or terminated by the Board of Directors at any time without prior notice.\nCash Dividends\nOn October 27, 2025, the Board of Directors declared a quarterly cash dividend of $1.80 per share for the three months ending September 30, 2025. The fourth quarter 2025 dividend is payable on November 28, 2025 to shareholders of record as of the close of trading on November 14, 2025.\nCash Flows\nThe following table presents the Company’s cash and cash equivalents, including restricted cash, as of the dates indicated:\nAs of\n(in thousands)\nSeptember 30,\n2025\nDecember 31,\n2024\nCash and cash equivalents (includes restricted cash of $3,656 and \n   $3,497 at September 30, 2025 and December 31, 2024, respectively)\n$\n400,089 \n$\n409,351 \nWe typically seek to maintain minimum cash balances globally of approximately $225.0 million to $275.0 million for general operating purposes. As of September 30, 2025 and December 31, 2024, $253.5 million and $265.5 million, respectively, of the Company’s cash and cash equivalents were held by foreign subsidiaries. Repatriation of some foreign cash may be subject to certain withholding taxes in local jurisdictions and other distribution restrictions. We believe the global cash and cash equivalent balances that \n42\nTable of Contents\nare maintained will be available to meet our global needs whether for general corporate purposes or other needs, including acquisitions or expansion of our products.\nWe believe that global cash flows from operations, together with existing cash and cash equivalents and funds available under our existing revolving credit facility and our ability to access bank debt, private debt and the capital markets for additional funds, will continue to be sufficient to fund our global operating activities and cash commitments for investing and financing activities, such as material capital expenditures and share repurchases, for at least the next 12 months and for the foreseeable future thereafter. In addition, we expect that foreign cash flows from operations, together with existing cash and cash equivalents, will continue to be sufficient to fund our foreign operating activities and cash commitments for investing activities, such as material capital expenditures, for at least the next 12 months and for the foreseeable future thereafter.\nNet Cash Provided by (Used In) Operating, Investing and Financing Activities\nNine Months Ended\nSeptember 30,\n(in thousands)\n2025\n2024\nNet cash provided by operating activities\n$\n1,087,316 \n$\n1,070,994 \nNet cash (used in) investing activities\n(93,614)\n(107,522)\nNet cash (used in) provided by financing activities\n(1,012,200)\n(926,125)\nEffect of exchange rate changes\n9,236 \n1,939 \nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n(9,262)\n$\n39,286 \nCash Flows From Operating Activities\nCash flows from operating activities consist of net income adjusted for certain non-cash items and changes in assets and liabilities. The year-over-year change was primarily driven by higher cash collections from customers, partially offset by higher payments for cash expenses.\nOur primary uses of cash from operating activities a\nre for the payment of cash compensation expenses, income taxes, interest expenses, technology costs, professional fees, market data costs and office rent. Historically, the payment of cash for compensation and benefits is at its highest level in the first quarter when we pay discretionary employee compensation related to the previous fiscal year.\nCash Flows From Investing Activities\nThe year-over-year change was due to prior year acquisitions partially offset by increased capital expenditures.\nCash Flows From Financing Activities\nThe year-over-year change was primarily driven by the impact of higher share repurchases, repayment of borrowings and dividend payments, partially offset by proceeds from borrowings."
}