{
  "source_file": "msi-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThis commentary should be read in conjunction with the condensed consolidated financial statements and related notes thereto of Motorola Solutions, Inc. (“Motorola Solutions,” the “Company,” “we,” “our,” or “us”) for the three and nine months ended September 27, 2025 and September 28, 2024, as well as our consolidated financial statements and related notes thereto and management’s discussion and analysis of financial condition and results of operations in our Annual Report on Form 10-K for the year ended December 31, 2024 (the \"Form 10-K\").\nForward-Looking Statements\nStatements in this Quarterly Report on Form 10-Q for the quarter ended September 27, 2025 (this “Form 10-Q”) which are not historical in nature are forward-looking statements within the meaning of applicable federal securities law. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 and generally include words such as “believes,” “expects,” “intends,” “aims,” “estimates” and similar expressions. We can give no assurance that any future results or events discussed in these statements will be achieved. Any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. Readers are cautioned that such forward-looking statements are subject to a variety of risks and uncertainties that could cause our actual results to differ materially from the statements contained in this Form 10-Q. Some of these risks and uncertainties include, but are not limited to, those discussed in Part I, Item 1A “Risk Factors” of the Form 10-K, and those described elsewhere in our other SEC filings. Forward-looking statements include, but are not limited to, statements included in: (1) “Management's Discussion and Analysis of Financial Condition and Results of Operations,” about: (a) the impact of changes in the global trade environment, volatility in the global supply chain and our expected ability to mitigate increased costs related thereto; (b) the impact of the \"One Big Beautiful Bill Act\" on our business and our government customers; (c) the impact of a prolonged U.S. government shutdown to our business; (d) the impact of acquisitions on our business; (e) our plans to assess the impact of changes to tax law on our business; (f) the return of capital to shareholders through dividends and/or repurchasing shares; (g) future payments, charges, and use of accruals associated with our reorganization of business programs and employee separation costs; (h) expected payments of exit costs related to our exit of Emergency Services Network (\"ESN\") contract with the U.K. Home Office; (i) our ability and cost to repatriate funds; (j) the liquidity of our investments; (k) our ability and cost to access the capital markets; (l) our ability to borrow and the use of proceeds of and amount available under our credit facilities; (m) adequacy of internal resources to generate adequate amount of cash to meet expected working capital, capital expenditure and cash requirements; (n) future cash flows generated from operations, and future uses of such cash; and (o) the impact of the adoption of accounting pronouncements on our financial results; (2) “Quantitative and Qualitative Disclosures about Market Risk,” about: (a) the impact of foreign currency risk; and (b) future hedging activity and expectations of the Company; and (3) “Legal Proceedings,” about the ultimate disposition of legal matters and timing. We undertake no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise, except as legally required.\nExecutive Overview\nBusiness Overview\nThe Company manages the business organizationally through two segments: “Products and Systems Integration” and “Software and Services.\" Within these segments the Company has three principal product lines in which the Company reports net sales: Mission Critical Networks (\"MCN\"), Video Security and Access Control (\"Video\") and Command Center. With the acquisition of Silvus Technologies Holdings Inc. (“Silvus”) in August 2025, the Company will now report net sales from its principal product lines by combining the former Land Mobile Radio Communications and newly acquired Silvus under the new technology name Mission Critical Networks. This name change does not require any financial information to be reclassified from previous periods.\n•\nMCN: Infrastructure, mobile ad-hoc network technology (\"MANET\"), devices (two-way radio and broadband, including both for public safety and professional and commercial radio (PCR)) and software inclusive of installation and integration, and backed by managed and support services to help assure mission-critical communications availability, security and resiliency.\n•\nVideo: Cameras (fixed, body-worn, in-vehicle), access control, sensors, infrastructure, video management, software and artificial intelligence (\"AI\")-powered analytics that help enable visibility to what's happening and bring attention to what’s important to help inform decisions and actions.\n•\nCommand Center: Command center solutions and software applications, including AI-powered analytics, that unify voice, video, and data from public safety agencies, enterprises and the community, enabling a broad informational view of operations and incidents to help accelerate workflows and improve the accuracy and speed of decisions.\n30\nThird Quarter Financial Results\n•\nNet sales were $3.0 billion in the third quarter of 2025 compared to $2.8 billion in the third quarter of 2024.\n•\nOperating earnings were $770 million in the third quarter of 2025 compared to $711 million in the third quarter of 2024.\n•\nNet earnings attributable to Motorola Solutions, Inc. was $562 million, or $3.33 per diluted common share, in the third quarter of 2025, compared to $562 million, or $3.29 per diluted common share, in the third quarter of 2024. \n•\nOperating cash flow increased $260 million to $1.6 billion in the first nine months of 2025 compared to $1.3 billion in the first nine months of 2024. \n•\nWe repurchased $664 million of common stock and paid $546 million in dividends in the first nine months of 2025.\nRecent Events\nMacroeconomic Environment Update\nThe current global trade environment is complex and evolving. In early 2025, the U.S. initiated a series of trade actions which imposed new tariffs and increased existing tariffs on goods imported from various countries, contributing to a global trade landscape subject to evolving tariffs, import/export regulations, including restrictions around rare earth minerals, trade barriers and trade disputes. As a result, we continue to observe elevated volatility and uncertainty around the global supply chain.\nWe engage with global suppliers across a diverse network of locations around the world. We continue to work with our global supply base to mitigate our exposure to the risks to global reciprocal (and sectoral) tariffs and import/export regulations that have developed, and which may continue to develop, in order to ensure supply continues at levels in order to meet our current customer demand. As a result of the dynamic tariff environment, we have experienced increased costs on materials and components, which we have substantially mitigated during the year and for which we expect to continue to develop mitigation actions going forward.\nWe continue to see demand for our products and services supported by a multitude of funding sources. In July 2025, the “One Big Beautiful Bill Act” (“OBBB”) was enacted into law by the President of the United States, which provided a number of changes, including funding over the next four years for border security, national security and other opportunities. We expect OBBB to provide an additional source of funding to our federal government customers over the four-year period available through OBBB.\nAs of October 1, 2025 the U.S. government entered into a shutdown, which, as of October 30, 2025, is still ongoing. A prolonged shutdown may impact our ability to ship and fulfill contracts for certain federal government customers, which may negatively impact our results of operations.\n31\nRecent Acquisitions\nSegment(s)\nTechnology\nAcquisition\nDescription\nPurchase Price\nDate of Acquisition\nProducts and Systems Integration\n&\nSoftware and Services\nMission Critical Networks\nSilvus Technologies\nDesigner and developer of software-defined high-speed MANET technology.\n$4.4 billion and share-based compensation of $20 million\nAugust 6, 2025\nSoftware and Services\nCommand Center\nTheatro\nCreator of AI and voice-powered communication and digital workflow software for frontline workers.\n$174 million and share-based compensation of $5 million\nMarch 6, 2025\nSoftware and Services\nCommand Center\nRapidDeploy\nProvider of cloud-native 911 solutions.\n$240 million and share-based compensation of $6 million\nFebruary 21, 2025\nSoftware and Services\nCommand Center\n3tc Software\nProvider of control room software solutions.\n$23 million and share-based compensation of $4 million\nOctober 29, 2024\nSoftware and Services\nCommand Center\nNoggin\nProvider of cloud-based business continuity planning, operational resilience and critical event management software.\n$92 million and share-based compensation of $19 million\nJuly 1, 2024\nSoftware and Services\nVideo Security and Access Control\nUnnamed vehicle location and management solutions business\nProvider of vehicle location and management solutions.\n$132 million and share-based compensation of $3 million\nJuly 1, 2024\nProducts and Systems Integration\nVideo Security and Access Control\nSilent Sentinel\nProvider of specialized, long-range cameras.\n$37 million\nFebruary 13, 2024\n32\nResults of Operations\n \nThree Months Ended\nNine Months Ended\n(Dollars in millions, except per share amounts)\nSeptember 27, 2025\n% of\nSales*\nSeptember 28, 2024\n% of\nSales*\nSeptember 27, 2025\n% of\nSales*\nSeptember 28, 2024\n% of\nSales*\nNet sales from products\n$\n1,751\n \n$\n1,670 \n$\n4,731\n \n$\n4,639 \nNet sales from services\n1,258\n \n1,120 \n3,571\n \n3,167 \nNet sales\n3,009\n \n2,790 \n8,302\n \n7,806 \nCosts of products sales\n728\n \n41.6\n \n%\n688 \n41.2 \n%\n1,948\n \n41.2\n \n%\n1,941 \n41.8 \n%\nCosts of services sales\n727\n \n57.8\n \n%\n669 \n59.7 \n%\n2,087\n \n58.4\n \n%\n1,902 \n60.1 \n%\nCosts of sales\n1,455\n \n1,357 \n4,035\n \n3,843 \nGross margin\n1,554\n \n51.6\n \n%\n1,433 \n51.4 \n%\n4,267\n \n51.4\n \n%\n3,963 \n50.8 \n%\nSelling, general and administrative expenses\n485\n \n16.1\n \n%\n439 \n15.7 \n%\n1,371\n \n16.5\n \n%\n1,265 \n16.2 \n%\nResearch and development expenditures\n237\n \n7.9\n \n%\n234 \n8.4 \n%\n700\n \n8.4\n \n%\n671 \n8.6 \n%\nOther charges\n62\n \n2.1\n \n%\n49 \n1.8 \n%\n152\n \n1.8\n \n%\n153 \n2.0 \n%\nOperating earnings\n770\n \n25.6\n \n%\n711 \n25.5 \n%\n2,044\n \n24.6\n \n%\n1,874 \n24.0 \n%\nOther income (expense):\nInterest expense, net\n(86)\n(2.9)\n%\n(58)\n(2.1)\n%\n(192)\n(2.3)\n%\n(171)\n(2.2)\n%\nOther, net\n41\n \n1.4\n \n%\n42 \n1.5 \n%\n100\n \n1.2\n \n%\n(519)\n(6.6)\n%\nTotal other expense\n(45)\n(1.5)\n%\n(16)\n(0.6)\n%\n(92)\n(1.1)\n%\n(690)\n(8.8)\n%\nNet earnings before income taxes\n725\n \n24.1\n \n%\n695 \n24.9 \n%\n1,952\n \n23.5\n \n%\n1,184 \n15.2 \n%\nIncome tax expense\n161\n \n5.4\n \n%\n132 \n4.7 \n%\n442\n \n5.3\n \n%\n214 \n2.7 \n%\nNet earnings\n564\n \n18.7\n \n%\n563 \n20.2 \n%\n1,510\n \n18.2\n \n%\n970 \n12.4 \n%\nLess: Earnings attributable to non-controlling interests\n2\n \n0.1\n \n%\n1 \n— \n%\n5\n \n0.1\n \n%\n4 \n0.1 \n%\nNet earnings attributable to Motorola Solutions, Inc.\n$\n562\n \n18.7\n \n%\n$\n562 \n20.2 \n%\n$\n1,505\n \n18.1\n \n%\n$\n966 \n12.3 \n%\nEarnings per diluted common share\n$\n3.33\n \n$\n3.29 \n \n$\n8.89\n \n$\n5.66 \n* Percentages may not add due to rounding\n33\nResults of Operations—Three months ended September 27, 2025 compared to three months ended September 28, 2024 \nThe results of operations for the third quarter of 2025 are not necessarily indicative of the operating results to be expected for the full year. Historically, we have experienced higher revenues in the fourth quarter as compared to the rest of the quarters of our fiscal year as a result of the purchasing patterns of our customers.\nWe use the following U.S. GAAP key financial performance measures to manage our business on a consolidated basis and by reporting segment, and to monitor and assess our results of operations:\n•\nNet sales: a measure of our revenue for the current period.\n•\nOperating earnings: a measure of our earnings from operations, before non-operating expenses and income taxes.\n•\nOperating margins: a measure of our operating earnings as a percentage of total net sales.\nConsidered together, we believe these measures are strong indicators of our overall performance and our ability to create shareholder value. A discussion of our results of operations and financial condition follows.\nThree Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n(In millions)\nProducts and Systems Integration\nSoftware and Services\nTotal\nProducts and Systems Integration\nSoftware and Services\nTotal\nNet sales by region:\nNorth America\n$\n1,360\n \n$\n761\n \n$\n2,121\n \n$\n1,304 \n$\n703 \n$\n2,007 \nInternational\n537\n \n351\n \n888\n \n480 \n303 \n783 \n$\n1,897\n \n$\n1,112\n \n$\n3,009\n \n$\n1,784 \n$\n1,006 \n$\n2,790 \nNet sales by major products and services:\nMission Critical Networks (MCN)\n$\n1,598\n \n$\n643\n \n$\n2,241\n \n$\n1,492 \n$\n596 \n$\n2,088 \nVideo \n299\n \n235\n \n534\n \n292 \n208 \n500 \nCommand Center\n—\n \n234\n \n234\n \n— \n202 \n202 \n$\n1,897\n \n$\n1,112\n \n$\n3,009\n \n$\n1,784 \n$\n1,006 \n$\n2,790 \nOperating earnings\n$\n458\n \n$\n312\n \n$\n770\n \n$\n446 \n$\n265 \n$\n711 \nOperating margins\n24.1\n \n%\n28.1\n \n%\n25.6\n \n%\n25.0 \n%\n26.3 \n%\n25.5 \n%\nNet Sales\nThe Products and Systems Integration segment’s net sales represented 63% of our net sales in the third quarter of 2025 and 64% in the third quarter of 2024. The Software and Services segment’s net sales represented 37% of our net sales in the third quarter of 2025 and 36% in the third quarter of 2024.\nNet sales increased $219 million, or 8%, in the third quarter of 2025 compared to the third quarter of 2024. The $113 million, or 6% increase in net sales within the Products and Systems Integration segment was driven by an increase of 12% in the International region and an increase of 4% in the North America region. The $106 million, or 11%, increase in net sales within the Software and Services segment was driven by an increase of 8% in the North America region and an increase of 16% in the International region. Net sales includes:\n•\nan increase in the Products and Systems Integration segment, inclusive of $111 million of revenue from acquisitions, driven by an increase in MCN and Video; \n•\nan increase in the Software and Services segment, inclusive of $12 million of revenue from acquisitions, driven by an increase in MCN, Command Center and Video; and\n•\ninclusive of $21 million from favorable currency rates. \nRegional results include:\n•\na 6% increase in the North America region, inclusive of revenue from acquisitions, driven by an increase in MCN, Command Center and Video; and\n•\na 13% increase in the International region, inclusive of revenue from acquisitions, driven by an increase in MCN, Video and Command Center.\n34\nProducts and Systems Integration\nThe 6% increase in the Products and Systems Integration segment was driven by the following:\n•\n$106 million, or 7%, growth in MCN, inclusive of revenue from acquisitions, driven by the International and North America regions; \n•\n$7 million, or 2%, growth in Video, driven by the North America and International regions; and\n•\ninclusive of $11 million from favorable currency rates.\nSoftware and Services\nThe 11% increase in the Software and Services segment was driven by the following:\n•\n$47 million, or 8%, growth in MCN, inclusive of revenue from acquisitions, driven by the International and North America regions; \n•\n$32 million, or 16%, growth in Command Center, inclusive of revenue from acquisitions, driven by the North America and International regions; \n•\n$27 million, or 13%, growth in Video, driven by the International and North America regions; and\n•\ninclusive of $10 million from favorable currency rates.\nGross Margin \n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nGross margin from Products and Systems Integration\n$\n1,019\n \n$\n962 \n6 \n%\nGross margin from Software and Services\n535\n \n471 \n14 \n%\nGross margin\n$\n1,554\n \n$\n1,433 \n8 \n%\nGross margin was 51.6% of net sales in the third quarter of 2025 compared to 51.4% in the third quarter of 2024. The primary drivers of this increase in gross margin as a percentage of net sales were:\n•\na 1.3% increase in gross margin as a percentage of net sales in the Software and Services segment, inclusive of acquisitions, primarily driven by higher sales; partially offset by\n•\na 0.2% decrease in gross margin as a percentage of net sales in the Products and Systems Integration segment, inclusive of acquisitions, primarily driven by higher tariffs.\nSelling, General and Administrative (\"SG&A\") Expenses\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSG&A expenses from Products and Systems Integration\n$\n384\n \n$\n346 \n11 \n%\nSG&A expenses from Software and Services\n101\n \n93 \n9 \n%\nSG&A expenses\n$\n485\n \n$\n439 \n10 \n%\nSG&A expenses increased 10% in the third quarter of 2025 compared to the third quarter of 2024 primarily driven by:\n•\na $38 million, or 11%, increase in Products and Systems Integration SG&A expenses primarily due to higher employee incentive costs, including share-based compensation, and higher expenses associated with acquired businesses; and\n•\nan $8 million, or 9%, increase in Software and Services SG&A expenses primarily due to higher expenses associated with acquired businesses and higher employee incentive costs.\nSG&A expenses were 16.1% of net sales in the third quarter of 2025 compared to 15.7% of net sales in the third quarter of 2024. \n35\nResearch and Development (\"R&D\") Expenditures\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nR&D expenditures from Products and Systems Integration\n$\n146\n \n$\n146 \n— \n%\nR&D expenditures from Software and Services\n91\n \n88 \n3 \n%\nR&D expenditures\n$\n237\n \n$\n234 \n1 \n%\nR&D expenditures increased $3 million, or 1%, in the third quarter of 2025 compared to the third quarter of 2024 primarily driven by higher expenses associated with acquired businesses. R&D expenditures were 7.9% of net sales in the third quarter of 2025 and 8.4% of net sales in the third quarter of 2024. \nOther Charges\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOther charges from Products and Systems Integration\n$\n31\n \n$\n24 \nOther charges from Software and Services\n31\n \n25 \nOther charges\n$\n62\n \n$\n49 \nOther charges increased $13 million in the third quarter of 2025 compared to the third quarter of 2024. The increase was primarily driven by:\n•\n$55 million of acquisition related transaction fees, primarily related to the acquisition of Silvus, in the third quarter of 2025 compared to $4 million of acquisition related transaction fees in the third quarter of 2024; \n•\n$66 million of intangible amortization expense in the third quarter of 2025 compared to $38 million of intangible amortization expense in the third quarter of 2024; and\n•\n$12 million of reorganization of business expenses in the third quarter of 2025 compared to $5 million of reorganization of business expenses in the third quarter of 2024; partially offset by\n•\n$74 million of gains on the Hytera litigation for amounts recovered through legal proceedings due to the theft of our trade secrets in the third quarter of 2025 that did not occur in the third quarter of 2024.\nOperating Earnings\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOperating earnings from Products and Systems Integration\n$\n458\n \n$\n446 \nOperating earnings from Software and Services\n312\n \n265 \nOperating earnings\n$\n770\n \n$\n711 \nOperating earnings increased $59 million, or 8%, in the third quarter of 2025 compared to the third quarter of 2024. The increase in Operating earnings was due to:\n•\na $47 million increase in the Software and Services segment, primarily driven by higher sales and improved operating leverage, partially offset by higher expenses associated with acquired businesses and higher employee incentive costs, including share-based compensation; and\n•\na $12 million increase in the Products and Systems Integration segment, primarily driven by higher sales, improved operating leverage, and a $74 million gain on the Hytera litigation for amounts recovered through legal proceedings due to the theft of our trade secrets, partially offset by an increase in acquisition related transaction fees related to the Silvus acquisition, higher intangible amortization expense, higher employee incentive costs, including share-based compensation, higher expenses associated with acquired businesses, and higher tariffs.\n36\nInterest Expense, net\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nInterest expense, net\n$\n(86)\n$\n(58)\nThe $28 million increase in Interest expense, net in the third quarter of 2025 compared to the third quarter of 2024 was primarily driven by higher outstanding debt, partially offset by higher interest income.\nOther, net\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOther, net\n$\n41\n \n$\n42 \nThe $1 million decrease in Other, net in the third quarter of 2025 compared to the third quarter of 2024 was primarily driven by:\n•\na $4 million gain on foreign currency in the third quarter of 2025 compared to a $26 million loss on foreign currency in the third quarter of 2024; partially offset by\n•\na $6 million loss on derivatives in the third quarter of 2025 compared to a $22 million gain on derivatives in the third quarter of 2024.\nEffective Tax Rate\n \nThree Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nIncome tax expense\n$\n161\n \n$\n132 \nThe effective tax rate for the three months ended September 27, 2025 of 22% was higher than the effective tax rate for the three months ended September 28, 2024 of 19%, primarily due to non-deductible transaction costs related to the acquisition of Silvus, favorable U.S. return-to-provision adjustments from implementing a business initiative in 2024, and tax benefits recognized upon settlement of audits with taxing authorities in foreign jurisdictions in 2024, partially offset by higher excess tax benefits of share-based compensation in 2025.\nOn July 4, 2025, the \"One Big Beautiful Bill Act\" was enacted into law, introducing a broad range of changes to the U.S. corporate income tax framework. The legislation includes business provisions that impact our tax position, including tax cut extensions and modifications to the international tax framework and corporate income tax deductions. We have evaluated the effects of these changes on our income tax provision, income tax payable, and deferred tax asset balances, which are reflected in this quarter's results. As of the three months ended September 27, 2025, the 2025 impact of the enacted legislation on our tax position was not material. We will continue to recognize the effects of the legislation in accordance with the effective dates of the applicable provisions, and plan to continue to assess the ongoing impact of this legislation as further guidance is made available.\n37\nResults of Operations—Nine months ended September 27, 2025 compared to Nine months ended September 28, 2024\nNine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\n(In millions)\nProducts and Systems Integration\nSoftware and Services\nTotal\nProducts and Systems Integration\nSoftware and Services\nTotal\nNet sales by region:\nNorth America\n$\n3,789\n \n$\n2,211\n \n$\n6,000\n \n$\n3,631 \n$\n1,985 \n$\n5,616 \nInternational\n1,306\n \n996\n \n2,302\n \n1,302 \n888 \n2,190 \n$\n5,095\n \n$\n3,207\n \n$\n8,302\n \n$\n4,933 \n$\n2,873 \n$\n7,806 \nNet sales by major products and services:\nMission Critical Networks (MCN)\n$\n4,269\n \n$\n1,878\n \n$\n6,147\n \n$\n4,112 \n$\n1,739 \n$\n5,851 \nVideo \n826\n \n672\n \n1,498\n \n821 \n553 \n1,374 \nCommand Center\n—\n \n657\n \n657\n \n— \n581 \n581 \n$\n5,095\n \n$\n3,207\n \n$\n8,302\n \n$\n4,933 \n$\n2,873 \n$\n7,806 \nOperating earnings\n$\n1,173\n \n$\n871\n \n$\n2,044\n \n$\n1,135 \n$\n739 \n$\n1,874 \nOperating margins\n23.0\n \n%\n27.2\n \n%\n24.6\n \n%\n23.0 \n%\n25.7 \n%\n24.0 \n%\nNet Sales\nThe Products and Systems Integration segment's net sales represented 61% of our net sales in the first nine months of 2025 and 63% in the first nine months of 2024. Net sales from the Software and Services segment represented 39% of our net sales in the first nine months of 2025 and 37% in the first nine months of 2024.\nNet sales increased $496 million, or 6%, in the first nine months of 2025 compared to the first nine months of 2024. The $334 million, or 12%, increase in net sales within the Software and Services segment was driven by an increase of 11% in the North America region and an increase of 12% in the International region. The $162 million, or 3%, increase in net sales within the Products and Systems Integration segment was driven by an increase of 4% in the North America region and an increase of $4 million in the International region. Net sales includes:\n•\nan increase in the Software and Services segment, inclusive of $83 million of revenue from acquisitions, driven by an increase in MCN, Video and Command Center; \n•\nan increase in the Products and Systems Integration segment, inclusive of $111 million of revenue from acquisitions, driven by an increase in MCN and Video; and\n•\ninclusive of $5 million from favorable currency rates.\nRegional results include:\n•\na 7% increase in the North America region, inclusive of revenue from acquisitions, driven by an increase in MCN, Video and Command Center; and\n•\na 5% increase in the International region, inclusive of revenue from acquisitions, driven by an increase in MCN, Video and Command Center.\nProducts and Systems Integration\nThe 3% increase in the Products and Systems Integration segment was driven by the following:\n•\n$157 million, or 4% growth in MCN, inclusive of revenue from acquisitions, driven by the North America and International regions; \n•\n$5 million, or 1% growth in Video, driven by the North America region, partially offset by International region; and\n•\ninclusive of $1 million from favorable currency rates.\n38\nSoftware and Services\nThe 12% increase in the Software and Services segment was driven by the following:\n•\n$139 million, or 8% growth in MCN, inclusive of revenue from acquisitions, driven by the North America and International regions; \n•\n$119 million, or 22% growth in Video, inclusive of revenue from acquisitions, driven by the North America and International regions;\n•\n$76 million, or 13% growth in Command Center, inclusive of revenue from acquisitions, driven by the North America and International regions; and\n•\ninclusive of $4 million from favorable currency rates.\nGross Margin \n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nGross margin from Products and Systems Integration\n$\n2,746\n \n$\n2,611 \n5 \n%\nGross margin from Software and Services\n1,521\n \n1,352 \n13 \n%\nGross margin\n$\n4,267\n \n$\n3,963 \n8 \n%\nGross margin was 51.4% of net sales in the first nine months of 2025 compared to 50.8% in the first nine months of 2024. The primary drivers of this increase in gross margin as a percentage of net sales were:\n•\na 1.0% increase in gross margin as a percentage of net sales in the Products and Systems Integration segment, inclusive of acquisitions, primarily driven by higher sales, favorable mix and lower direct material costs, despite higher tariffs; and\n•\na 0.3% increase in gross margin as a percentage of net sales in the Software and Services segment, inclusive of acquisitions, primarily driven by higher sales and improved operating leverage.\nSelling, General and Administrative (\"SG&A\") Expenses\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nSG&A expenses from Products and Systems Integration\n$\n1,079\n \n$\n1,000 \n8 \n%\nSG&A expenses from Software and Services\n292\n \n265 \n10 \n%\nSG&A expenses\n$\n1,371\n \n$\n1,265 \n8 \n%\nSG&A expenses increased 8% in the first nine months of 2025 compared to the first nine months of 2024 primarily driven by:\n•\na $79 million, or 8%, increase in Products and Systems Integration SG&A expenses primarily due to higher employee incentive costs, including share-based compensation and investments in video, higher expenses related to legal matters, including Hytera-related legal expenses, increased reorganization expenses and higher expenses associated with acquired businesses; and\n•\na $27 million, or 10%, increase in Software and Services SG&A expenses primarily due to higher expenses associated with acquired businesses and higher employee incentive costs, including investments in video.\nSG&A expenses were 16.5% of net sales in the first nine months of 2025 compared to 16.2% of net sales in the first nine months of 2024.\n39\nResearch and Development (\"R&D\") Expenditures\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\n% Change\nR&D expenditures from Products and Systems Integration\n$\n430\n \n$\n422 \n2 \n%\nR&D expenditures from Software and Services\n270\n \n249 \n8 \n%\nR&D expenditures\n$\n700\n \n$\n671 \n4 \n%\nR&D expenditures increased 4% in the first nine months of 2025 compared to the first nine months of 2024 primarily driven by:\n•\na $21 million, or 8%, increase in Software and Services R&D expenditures primarily due to higher employee incentive costs, including investments in video and share-based compensation, and higher expenses associated with acquired businesses; and\n•\nan $8 million, or 2%, increase in Products and Systems Integration R&D expenditures primarily due to higher employee incentive costs, and higher expenses associated with acquired businesses.\nR&D expenditures were 8.4% of net sales in the first nine months of 2025 compared to 8.6% of net sales in the first nine months of 2024.\nOther Charges\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOther charges from Products and Systems Integration\n$\n64\n \n$\n54 \nOther charges from Software and Services\n88\n \n99 \nOther charges\n$\n152\n \n$\n153 \nOther charges decreased by $1 million in the first nine months of 2025 compared to the first nine months of 2024. The decrease was driven primarily by:\n•\n$94 million of gains on the Hytera litigation for the amounts recovered through legal proceedings due to the theft of our trade secrets in the first nine months of 2025 that did not occur in the first nine months of 2024; partially offset by\n•\n$63 million of acquisition related transaction fees, primarily related to the acquisition of Silvus, in the first nine months of 2025 compared to $11 million of acquisition related transaction fees in the first nine months of 2024; \n•\n$142 million of intangible amortization expense in the first nine months of 2025 compared to $114 million of intangible amortization expense in the first nine months of 2024; and\n•\n$33 million of reorganization of business expense in the first nine months of 2025 compared to $16 million in the first nine months of 2024.\nOperating Earnings\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOperating earnings from Products and Systems Integration\n$\n1,173\n \n$\n1,135 \nOperating earnings from Software and Services\n871\n \n739 \nOperating earnings\n$\n2,044\n \n$\n1,874 \nOperating earnings increased $170 million, or 9%, in the first nine months of 2025 compared to the first nine months of 2024. The increase in Operating earnings was due to:\n•\na $132 million increase in the Software and Services segment, primarily driven by higher sales, partially offset by higher expenses associated with acquired businesses, higher employee incentive costs, including investments in video and share-based compensation, and increased reorganization expenses; and\n•\na $38 million increase in the Products and Systems Integration segment, primarily driven by higher sales, $94 million of gains on the Hytera litigation for amounts recovered through legal proceedings due to the theft of our trade secrets, favorable mix, and lower direct material costs, despite higher tariffs, partially offset by higher employee incentive costs, including share-based compensation and investments in video, an increase in acquisition related transaction fees primarily related to the Silvus acquisition, increased intangible amortization expenses, higher expenses related to legal matters, including Hytera-related legal expenses, higher expenses associated with acquired businesses and increased reorganization expenses.\n40\nInterest Expense, net\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nInterest expense, net\n$\n(192)\n$\n(171)\nThe $21 million increase in Interest expense, net in the first nine months of 2025 compared to the first nine months of 2024 was primarily driven by higher outstanding debt, partially offset by interest accruals related to audits with tax authorities in foreign jurisdictions in 2024 and higher interest income. \nOther, net\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nOther, net\n$\n100\n \n$\n(519)\nThe $619 million increase in Other, net in the first nine months of 2025 compared to the first nine months of 2024 was primarily driven by:\n•\na $585 million loss from the extinguishment of the $1.0 billion of 1.75% senior convertible notes issued to Silver Lake Partners (the \"Silver Lake Convertible Debt\") which was recognized in the first nine months of 2024;\n•\na $41 million gain on derivative instruments in the first nine months of 2025 compared to a $7 million gains on derivative instruments in the first nine months of 2024;\n•\na $21 million gain on fair value adjustments to equity investments in the first nine months of 2025 compared to a $4 million loss on fair value adjustments to equity investments in the first nine months of 2024; and\n•\nan $11 million loss on assessments of uncertain tax positions in the first nine months of 2024 that did not occur in the first nine months of 2025; partially offset by\n•\na $57 million loss on foreign currency in the first nine months of 2025 compared to a $22 million losses on foreign currency in the first nine months of 2024.\nEffective Tax Rate\n \nNine Months Ended\n(In millions)\nSeptember 27, 2025\nSeptember 28, 2024\nIncome tax expense\n$\n442\n \n$\n214 \nThe effective tax rate for the nine months ended September 27, 2025 of 23% was higher than the effective tax rate for the nine months ended September 28, 2024 of 18%, primarily due to the tax benefit recognized upon the Company's decision to implement a business initiative in 2024 which allowed for additional utilization of foreign tax credit carryforwards and a higher foreign derived intangible income deduction on its 2023 U.S. tax return, and tax benefits recognized upon settlement of audits with taxing authorities in foreign jurisdictions in 2024, partially offset by the non-tax deductible loss on the extinguishment of the Silver Lake Convertible Debt in 2024.\nOn July 4, 2025, the \"One Big Beautiful Bill Act\" was enacted into law, introducing a broad range of changes to the U.S. corporate income tax framework. The legislation includes business provisions that impact our tax position, including tax cut extensions and modifications to the international tax framework and corporate income tax deductions. We have evaluated the effects of these changes on our income tax provision, income tax payable, and deferred tax asset balances, which are reflected in this quarter's results. As of September 27, 2025, the 2025 impact of the enacted legislation on our tax position was not material. We will continue to recognize the effects of the legislation in accordance with the effective dates of the applicable provisions, and plan to continue to assess the ongoing impact of this legislation as further guidance is made available.\nReorganization of Business\nDuring the third quarter of 2025, we recorded net reorganization of business charges of $14 million, consisting of $12 million of charges in Other charges and $2 million of charges in Cost of sales in our Condensed Consolidated Statements of Operations. Included in the $14 million were charges of $13 million related to employee separation costs and $1 million related to exit costs.\nDuring the first nine months of 2025, we recorded net reorganization of business charges of $45 million, including $33 million of charges recorded within Other charges and $12 million of charges in Costs of sales in our Condensed Consolidated Statements of Operations. Included in the $45 million were charges of $46 million related to employee separation costs and $2 million related to exit costs, partially offset by $3 million of reversals for employee separation accruals no longer needed.\n41\nDuring the third quarter of 2024, we recorded net reorganization of business charges of $7 million, including $5 million of charges recorded within Other charges and $2 million of charges in Cost of sales in our Condensed Consolidated Statements of Operations. Included in the $7 million were charges of $8 million related to employee separation costs, partially offset by $1 million of reversals for employee separation accruals that are no longer needed.\nDuring the first nine months of 2024, we recorded net reorganization of business charges of $21 million, including $16 million of charges recorded within Other charges and $5 million of charges in Costs of sales in our Condensed Consolidated Statements of Operations. Included in the $21 million were charges of $30 million related to employee separation costs, partially offset by $4 million of reversals for exit cost accruals no longer needed and $5 million of reversals for employee separation accruals no longer needed.\nThe following table displays the net charges incurred by segment:\n \nThree Months Ended\nNine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\nProducts and Systems Integration\n$\n9\n \n$\n6 \n$\n31\n \n$\n20 \nSoftware and Services\n5\n \n1 \n14\n \n1 \n \n$\n14\n \n$\n7 \n$\n45\n \n$\n21 \nCash payments for employee severance in connection with the reorganization of business plans were $48 million in the first nine months of 2025 and $27 million in the first nine months of 2024. The reorganization of business accrual at September 27, 2025 was $22 million related to employee separation costs that are expected to be paid primarily within one year.\nAt January 1, 2025, we had an accrual of $1 million for exit costs related to our exit of the ESN contract with the U.K. Home Office. The $1 million of exit costs are recorded in Accrued liabilities in our Condensed Consolidated Balance Sheets at September 27, 2025, and are expected to be paid within one year.\nLiquidity and Capital Resources\nNine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nCash flows provided by (used for):\nOperating activities\n$\n1,581\n \n$\n1,321 \nInvesting activities\n(4,972)\n(400)\nFinancing activities\n2,111\n \n(1,234)\nEffect of exchange rates on cash and cash equivalents\n72\n \n12 \nDecrease in cash and cash equivalents\n$\n(1,208)\n$\n(301)\nCash and Cash Equivalents\nAt September 27, 2025, $645 million of the $894 million cash and cash equivalents balance was held in the U.S. and $249 million was held in other countries. \nOperating Activities\nThe increase in cash flows provided by operating activities from the first nine months of 2024 to the first nine months of 2025 was driven primarily by higher earnings, net of non-cash charges.\nInvesting Activities\nThe increase in cash flows used for investing activities in the first nine months of 2025 compared to the first nine months of 2024 was primarily due to the $4.4 billion in cash used in the acquisition of Silvus.\n42\nFinancing Activities\nThe increase in cash flows provided by financing activities in the first nine months of 2025 compared to the cash flows used for financing activities in the first nine months of 2024 was primarily driven by (see also further discussion in the \"Debt,\" \"Share Repurchase Program\" and \"Dividends\" sections below in this Part I, Item 2 of this Form 10-Q): \n•\n$1.4 billion increase in net proceeds from the issuance of debt in the first nine months of 2025 driven by the issuance of our 4.85% senior notes due 2030, 5.2% senior notes due 2032, 5.55% senior notes due 2035, 364-day delayed draw term loan and our three-year delayed draw term loan (\"term loan due 2028\") compared to the issuance of debt in the first nine months of 2024 driven by the issuance of our 5.0% senior notes due 2029 and 5.4% senior notes due 2034; \n•\n$1.6 billion decrease in the repayment of debt driven by the repayment of our 7.5% debentures and 6.5% debentures in the first nine months of 2025 compared to the repurchase of the Silver Lake Convertible Debt in the first nine months of 2024; and\n•\n$923 million increase in net proceeds from short-term borrowings, including commercial paper, in the first nine months of 2025 which did not occur in the first nine months of 2024; partially offset by\n•\n$523 million increase in share repurchases in the first nine months of 2025 compared to the first nine months of 2024;\n•\n$56 million increase in the payment of dividends in the first nine months of 2025 compared to the first nine months of 2024; and\n•\n$22 million increase in cash used for the issuance of common stock primarily driven by an increase in tax withholdings in the first nine months of 2025 compared to the first nine months of 2024.\nSales of Receivables\nThe following table summarizes the proceeds received from sales of accounts receivable and long-term customer financing receivables for the three and nine months ended September 27, 2025 and September 28, 2024: \n \nThree Months Ended\nNine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27, 2025\nSeptember 28, 2024\nAccounts receivable sales proceeds\n$\n19\n \n$\n15 \n$\n19\n \n$\n15 \nLong-term receivables sales proceeds\n$\n58\n \n$\n56 \n171\n \n82 \nTotal proceeds from receivable sales\n$\n77\n \n$\n71 \n$\n190\n \n$\n97 \nDebt\nWe had outstanding debt of $9.3 billion at September 27, 2025, of which $928 million was current. We had outstanding debt of $6.0 billion at December 31, 2024, of which $322 million was current.\nOn June 16, 2025, we issued $600 million of 4.85% senior notes due 2030, $500 million of 5.2% senior notes due 2032, $900 million of 5.55% senior notes due 2035. We recognized net proceeds of approximately $2.0 billion after debt issuance costs and discounts. The proceeds from these notes were used to fund a portion of the acquisition of Silvus.\nOn August 6, 2025 we borrowed $1.5 billion of senior delayed draw term loan facilities comprised of a $750 million 364-day facility and a $750 million term loan due 2028 to fund a portion of the acquisition of Silvus. We must comply with certain customary covenants including a maximum leverage ratio, as defined in the 364-Day Term Loan Credit Agreement and the Three-Year Term Loan Credit Agreement, each entered into on July 21, 2025. We were in compliance with our financial covenants as of September 27, 2025. During the three months ended September 27, 2025, the weighted average interest rate of the 364-day facility and term loan due 2028 was 5.30% and 5.25%, respectively.\nDuring the three months ended September 27, 2025, we repaid the $70 million aggregate principal amount of the 6.5% debentures due 2025. Additionally, during the nine months ended September 27, 2025, we repaid the $252 million aggregate principal amount of the 7.5% debentures due 2025.\nOn April 25, 2025, we entered into a $2.25 billion syndicated, unsecured revolving credit facility scheduled to mature in April 2030 which can be used for general corporate purposes and letters of credit (the \"2025 Motorola Solutions Credit Agreement\"), which replaced our $2.25 billion 2021 Motorola Solutions Credit Agreement scheduled to mature in March 2026. Borrowings under the facility bear interest at the prime rate plus the applicable margin, or at a spread above the Secured Overnight Financing Rate (SOFR), at our option. An annual facility fee is payable on the undrawn amount of the credit line. The interest rate and facility fee are subject to adjustment if our credit rating changes. We must comply with certain customary covenants including a maximum leverage ratio, as defined in the 2025 Motorola Solutions Credit Agreement. We were in compliance with our financial covenants as of September 27, 2025. \nWe have an unsecured commercial paper program, backed by the 2025 Motorola Solutions Credit Agreement, under which we may issue unsecured commercial paper notes up to a maximum aggregate principal amount of $2.2 billion outstanding at any one time. Proceeds from the issuances of the notes are expected to be used for general corporate purposes. As of September 27, 2025 we had outstanding other short-term borrowings of $179 million, inclusive of the commercial paper program, with a weighted-average interest rate of 4.52% during the three months ended September 27, 2025. \n43\nWe have investment grade ratings on our senior unsecured long-term debt. We continue to believe that we will be able to maintain sufficient access to the capital markets in the next twelve months and the foreseeable future.\nShare Repurchase Program\nDuring the three and nine months ended September 27, 2025, we repurchased approximately 0.3 million and 1.5 million shares at an average price of $467.10 and $434.41 per share for an aggregate amount of $121 million and $664 million, excluding transaction costs and excise tax. As of September 27, 2025, we had used approximately $16.4 billion of the share repurchase authority to repurchase shares, leaving $1.6 billion of authority available for future repurchases.\nDividends\nDuring the three and nine months ended of 2025 we paid $182 million and $546 million, respectively, in cash dividends to holders of our common stock. Subsequent to the quarter, we paid an additional $182 million in cash dividends to holders of our common stock.\nAdequate Internal Funding Resources\nWe believe that we have adequate internal resources available to generate adequate amounts of cash to meet our expected working capital, capital expenditure and cash requirements for the next twelve months and the foreseeable future, as supported by the level of cash and cash equivalents in the U.S., the ability to repatriate funds from foreign jurisdictions, cash provided by operations, as well as liquidity provided by our commercial paper program backed by the 2025 Motorola Solutions Credit Agreement. \nWe do not anticipate a material decrease to net future cash flows generated from operations. We expect to use our available cash, investments, and debt facilities to support and invest in our business. This includes investing in our existing products and technologies, seeking new acquisition opportunities related to our strategic growth initiatives and returning cash to shareholders through common stock cash dividend payments (subject to the discretion of our Board of Directors) and share repurchases. \nSubsequent to entering into a purchase and sale agreement with Silvus, our corporate credit ratings were reaffirmed by the major rating agencies. Fitch Ratings and S&P Global Ratings reaffirmed our BBB ratings, and Moody's Investors Service reaffirmed our Baa2 rating.\nLong-Term Customer Financing Commitments\nWe had outstanding commitments to provide long-term financing to third parties totaling $218 million at September 27, 2025, compared to $105 million at December 31, 2024. \nRecent Accounting Pronouncements\nSee “Recent Accounting Pronouncements” and \"Recently Adopted Accounting Pronouncements\" in Note 1, “Basis of Presentation” to our condensed consolidated financial statements included in Part I, Item 1 of this Form 10-Q."
}