{
  "source_file": "mtch-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nUpdated Financial Metrics\nWe have updated the title of our primary non-GAAP measure to “Adjusted EBITDA” from our previous title “Adjusted Operating Income.” We believe this updated title better aligns with our peers. Numerically, Adjusted EBITDA is the same as Adjusted Operating Income; however the starting point of the reconciliation to the most comparable GAAP financial measure has changed from operating income to net income. See “Non-GAAP Financial Measures” below for the full definition of Adjusted EBITDA and a reconciliation of net income attributable to Match Group, Inc. shareholders to Adjusted EBITDA.\nKey Terms:\nOperating and financial metrics:\n•\nTinder \nconsists of the world-wide activity of the brand Tinder\n®\n.\n•\nHinge\n consists of the world-wide activity of the brand Hinge\n®\n.\n•\nEvergreen & Emerging (“E&E”) \nconsists of the world-wide activity of our Evergreen brands, which include Match®, Meetic®, OkCupid®, Plenty Of Fish®, and a number of demographically focused brands, and our Emerging brands, which include BLK®, Chispa™, The League®, Archer®, Upward®, Yuzu™, Salams\n®\n, HER™, and other smaller brands.\n•\nMatch Group Asia (“MG Asia”)\n consists of the world-wide activity of the brands primarily focused on Asia and the Middle East, including Pairs™ and Azar®, which has expanded into Europe and the U.S.\n•\nCorporate and unallocated costs\n includes 1) corporate expenses (such as executive management, investor relations, corporate development, board of directors and public company listing fees), 2) portions of corporate services (such as legal, human resources, accounting, and tax), and 3) certain centrally managed services and technology that have not been allocated to the individual business segments (such as central trust and safety operations and certain shared software).\n•\nDirect Revenue\n is revenue that is received directly from end users of our services and includes both subscription and à la carte revenue.\n•\nIndirect Revenue\n is revenue that is not received directly from an end user of our services, a majority of which is advertising revenue.\n•\nPayers\n are unique users at a brand level in a given month from whom we earned Direct Revenue. When presented as a quarter-to-date or year-to-date value, Payers represents the average of the monthly values for the respective period presented. At a consolidated level and a business unit level to the extent a business unit consists of multiple brands, duplicate Payers may exist when we earn revenue from the same individual at multiple brands in a given month, as we are unable to identify unique individuals across brands in the Match Group portfolio.\n•\nRevenue Per Payer (“RPP”)\n is the average monthly revenue earned from a Payer and is Direct Revenue for a period divided by the Payers in the period, further divided by the number of months in the period.\nOperating costs and expenses:\n•\nCost of revenue \nconsists primarily of the amortization of in-app purchase fees, Variable Expenses (defined below), and employee compensation expense and stock-based compensation expense for personnel engaged in data center and customer care functions.\n•\nSelling and marketing expense \nconsists primarily of cost of acquisition expense and employee compensation expense and stock-based compensation expense for personnel engaged in selling and marketing, sales support, and public relations functions.\n•\nGeneral and administrative expense \nconsists primarily of employee compensation expense and stock-based compensation expense for personnel engaged in executive management, finance, accounting, legal, tax, and human resources, fees for professional services (including transaction-related costs for acquisitions), and facilities costs.\n31\nTable of Contents\n•\nProduct development expense \nconsists primarily of employee compensation expense and stock-based compensation expense that are not capitalized for personnel engaged in the design, development, testing, and enhancement of service offerings and related technology.\n•\nIn-app purchase fees\n consists of the amortization of in-app purchase fees, which are monies paid to Apple and Google in connection with the processing of in-app purchases of subscriptions and service features through the in-app payment systems provided by Apple and Google.\n•\nVariable Expenses\n consists primarily of hosting fees, credit card processing fees, and rent, energy, and bandwidth costs associated with data centers. \n•\nCost of acquisition\n consists primarily of advertising expenditures, including online marketing (fees paid to search engines and social media sites), offline marketing, including television and print advertising, and production of advertising content.\n•\nEmployee compensation expense\n consists primarily of compensation expense (excluding stock-based compensation expense) and other employee-related costs that are not capitalized.\n•\nStock-based compensation expense\n consists principally of expense, that is not otherwise capitalized, associated with awards of restricted stock units (“RSUs”), performance-based RSUs, and market-based awards. These expenses are not paid in cash.\nLong-term debt:\n•\nCredit Facility\n - The revolving credit facility under the credit agreement of MG Holdings II. As of September 30, 2025 and December 31, 2024, there was $0.6 million outstanding in letters of credit and $499.4 million of availability under the Credit Facility.\n•\nTerm Loan \n- The former term loan facility under the credit agreement of MG Holdings II. At December 31, 2024, the Term Loan bore interest at a term secured overnight financing rate plus an applicable adjustment (“Adjusted Term SOFR”), plus 1.75%, and the then applicable rate was 6.22%. On January 21, 2025, we repaid the $425 million Term Loan in full utilizing cash on hand.\n•\n5.00% Senior Notes\n - MG Holdings II’s 5.00% Senior Notes due December 15, 2027, with interest payable each June 15 and December 15, which were issued on December 4, 2017. As of September 30, 2025, $450 million aggregate principal amount was outstanding.\n•\n4.625% Senior Notes\n - MG Holdings II’s 4.625% Senior Notes due June 1, 2028, with interest payable each June 1 and December 1, which were issued on May 19, 2020. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n•\n5.625% Senior Notes\n - MG Holdings II’s 5.625% Senior Notes due February 15, 2029, with interest payable each February 15 and August 15, which were issued on February 15, 2019. As of September 30, 2025, $350 million aggregate principal amount was outstanding.\n•\n4.125% Senior Notes\n - MG Holdings II’s 4.125% Senior Notes due August 1, 2030, with interest payable each February 1 and August 1, which were issued on February 11, 2020. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n•\n3.625% Senior Notes\n - MG Holdings II’s 3.625% Senior Notes due October 1, 2031, with interest payable each April 1 and October 1, which were issued on October 4, 2021. As of September 30, 2025, $500 million aggregate principal amount was outstanding.\n•\n6.125% Senior Notes\n - MG Holdings II’s 6.125% Senior Notes due September 15, 2033, with interest payable each March 15 and September 15, commencing on March 15, 2026, which were issued on August 20, 2025. As of September 30, 2025, $700 million aggregate principal amount was outstanding.\n•\n2026 Exchangeable Notes\n - The 0.875% Exchangeable Senior Notes due June 15, 2026 issued by Match Group FinanceCo 2, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each June 15 and December 15. On September 8, 2025, we repurchased $76.4 million of 2026 Exchangeable Notes. As of September 30, 2025, $499 million aggregate principal amount was outstanding and is presented as a current liability. \n32\nTable of Contents\n•\n2030 Exchangeable Notes\n - The 2.00% Exchangeable Senior Notes due January 15, 2030 issued by Match Group FinanceCo 3, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each January 15 and July 15. As of September 30, 2025, $575 million aggregate principal amount was outstanding.\nNon-GAAP financial measure:\n•\nAdjusted Earnings Before Interest, Taxes, Depreciation and Amortization (“Adjusted EBITDA”) \n- is a Non-GAAP financial measure. See “Non-GAAP Financial Measures” below for the definition of Adjusted EBITDA and a reconciliation of net income attributable to Match Group, Inc. to Adjusted EBITDA.\nManagement Overview\nMatch Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n®\n, Hinge\n®\n, Match\n®\n, Meetic\n®\n, OkCupid\n®\n, Pairs™, Plenty Of Fish\n®\n, Azar\n®\n, BLK®, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.\nWe manage our portfolio of brands in four business units: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia.\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nFor a more detailed description of the Company’s operating businesses, see “Item 1. Business” of the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\nAdditional Information\nInvestors and others should note that we announce material financial and operational information to our investors using our investor relations website at \nhttps://ir.mtch.com\n, our newsroom website at \nhttps://mtch.com/news\n, Tinder’s newsroom website at \nwww.tinderpressroom.com\n, Hinge’s newsroom website at \nhttps://hinge.co/press\n, Securities and Exchange Commission (“SEC”) filings, press releases, and public conference calls. We use these channels as well as social media to communicate with our users and the public about our company, our services, and other issues. It is possible that the information we post on social media could be deemed to be material information. Accordingly, investors, the media, and others interested in our company should monitor the websites listed above and the social media channels listed on our investor relations website in addition to following our SEC filings, press releases, and public conference calls. Neither the information on our website, nor the information on the website of any Match Group business, is incorporated by reference into this report, or into any other filings with, or into any other information furnished or submitted to, the SEC.\n33\nTable of Contents\nResults of Operations for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024\nRevenue\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n2025\n$ Change\n% Change\n2024\n(In thousands, except RPP)\nDirect Revenue:\nTinder\n$\n490,613 \n$\n(12,604)\n(3)%\n$\n503,217 \n$\n1,399,167 \n$\n(65,482)\n(4)%\n$\n1,464,649 \nHinge\n184,671 \n39,246 \n27%\n145,425 \n504,417 \n101,670 \n25%\n402,747 \nEvergreen & Emerging\n152,241 \n(6,149)\n(4)%\n158,390 \n449,254 \n(38,671)\n(8)%\n487,925 \nMG Asia\n69,136 \n(3,028)\n(4)%\n72,164 \n201,723 \n(15,584)\n(7)%\n217,307 \nTotal Direct Revenue\n896,661 \n17,465 \n2%\n879,196 \n2,554,561 \n(18,067)\n(1)%\n2,572,628 \nIndirect Revenue\n17,614 \n1,326 \n8%\n16,288 \n54,630 \n8,061 \n17%\n46,569 \nTotal Revenue\n$\n914,275 \n$\n18,791 \n2%\n$\n895,484 \n$\n2,609,191 \n$\n(10,006)\n—%\n$\n2,619,197 \nPayers:\nTinder\n9,258 \n(687)\n(7)%\n9,945 \n9,111 \n(653)\n(7)%\n9,764 \nHinge\n1,873 \n271 \n17%\n1,602 \n1,772 \n269 \n18%\n1,503 \nEvergreen & Emerging\n2,284 \n(337)\n(13)%\n2,621 \n2,329 \n(397)\n(15)%\n2,726 \nMG Asia\n1,112 \n66 \n6%\n1,046 \n1,060 \n58 \n6%\n1,002 \nTotal\n14,527 \n(687)\n(5)%\n15,214 \n14,272 \n(723)\n(5)%\n14,995 \n(Change calculated using non-rounded numbers)\nRPP:\nTinder\n$\n17.66 \n$\n0.79 \n5%\n$\n16.87 \n$\n17.06 \n$\n0.39 \n2%\n$\n16.67 \nHinge\n$\n32.87 \n$\n2.61 \n9%\n$\n30.26 \n$\n31.62 \n$\n1.85 \n6%\n$\n29.77 \nEvergreen & Emerging\n$\n22.22 \n$\n2.08 \n10%\n$\n20.14 \n$\n21.43 \n$\n1.54 \n8%\n$\n19.89 \nMG Asia\n$\n20.73 \n$\n(2.27)\n(10)%\n$\n23.00 \n$\n21.16 \n$\n(2.95)\n(12)%\n$\n24.11 \nTotal\n$\n20.58 \n$\n1.32 \n7%\n$\n19.26 \n$\n19.89 \n$\n0.83 \n4%\n$\n19.06 \nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nTinder Direct Revenue declined $12.6 million, or 3%, in 2025 versus 2024. The decrease in Direct Revenue was driven by a 7% decrease in Payers, partially offset by a 5% increase in RPP, which was positively impacted by the weakening of the U.S. dollar compared to the Euro and British Pound. On a consistent foreign exchange rate basis, the decline in revenue was $20.8 million, or 4%, in 2025 compared to 2024.\nHinge Direct Revenue grew $39.2 million, or 27%, in 2025 versus 2024. Revenue growth was driven by both growth in the U.S. and other English-speaking markets as well as continued expansion efforts in certain European markets. Payers increased 17% compared to 2024, and RPP increased 9% over 2024, which was positively impacted by the weakening of the U.S. dollar compared to the Euro.\nE&E Direct Revenue declined 4% in 2025 versus 2024. The overall decline at E&E was driven by a decline in Payers of 13% compared to 2024, partially offset by increased RPP of 10%. The Direct Revenue decline was driven by the Evergreen brands.\nMG Asia Direct Revenue declined $3.0 million, or 4%, in 2025 versus 2024. Excluding revenue from Hakuna, which was shut down in the third quarter of 2024, MG Asia revenue remained flat compared to 2024. RPP decreased 10% from 2024, partially offset by a 6% increase in Payers compared to 2024. RPP was negatively impacted by the shut down of the Hakuna app in 2024 due to the high RPP associated with those Payers.\n34\nTable of Contents\nIndirect Revenue increased due to higher ad impressions compared to 2024, driven by continued strength in the advertising business.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nTinder Direct Revenue declined $65.5 million, or 4%, in 2025 versus 2024. The decrease in Direct Revenue was driven by a 7% decrease in Payers, partially offset by a 2% increase in RPP. Additionally, revenue was positively impacted by the weakening of the U.S. dollar compared to the Euro and British Pound, partially offset by the strength of the U.S. dollar compared to the Argentine Peso. On a consistent foreign exchange rate basis, the decline was $67.0 million or 5%.\nHinge Direct Revenue grew $101.7 million, or 25%, in 2025 versus 2024. Revenue growth was driven by both growth in the U.S. and other English-speaking markets as well as continued expansion efforts in certain European markets. Payers increased 18% compared to 2024, and RPP increased 6% over 2024, as a result of pricing optimizations.\nE&E Direct Revenue declined 8% in 2025 versus 2024. The overall decline at E&E was driven by a decline in Payers of 15% compared to 2024, partially offset by increased RPP of 8%. The decline is also partially due to our decision to terminate certain live streaming services in the second half of 2024.\nMG Asia Direct Revenue declined $15.6 million, or 7%, in 2025 versus 2024. Excluding revenue from Hakuna, which was shut down in the third quarter of 2024, MG Asia revenue increased $0.7 million. Revenue was also negatively impacted by the strength of the U.S. dollar compared to the Turkish Lira, partially offset by weakness to the Japanese Yen.\nIndirect Revenue increased primarily driven by the factors described above in the three-month discussion.\nCost of revenue (exclusive of depreciation)\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nCost of revenue\n$\n247,043 \n$\n(6,086)\n(2)%\n$\n253,129 \nPercentage of revenue\n27%\n28%\nCost of revenue decreased primarily due to a $4.0 million decrease in Variable Expenses predominantly at Tinder driven by lower web hosting fees, and at MG Asia, due to a decrease in partner fees as a result of the termination of the Hakuna app and certain of our live streaming services in the second half of 2024. These declines were partially offset by an increase in in-app purchase fees of $2.8 million primarily at Hinge as revenue continues to grow.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nCost of revenue\n$\n725,889 \n$\n(28,970)\n(4)%\n$\n754,859 \nPercentage of revenue\n28%\n29%\nCost of revenue decreased 4% primarily due to a decrease in Variable Expenses of $25.9 million predominately at E&E and MG Asia as a result of the termination of certain of our live streaming services and the shut down of the Hakuna app in the second half of 2024.\n35\nTable of Contents\nSelling and marketing expense\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nSelling and marketing expense\n$\n169,142 \n$\n12,486 \n8%\n$\n156,656 \nPercentage of revenue\n19%\n17%\nSelling and marketing expense increased 8% primarily due to higher cost of acquisition expense of $13.9 million predominately at Hinge, Tinder, and MG Asia, partially offset by decreases at E&E.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nSelling and marketing expense\n$\n474,492 \n$\n(2,093)\n—%\n$\n476,585 \nPercentage of revenue\n18%\n18%\nSelling and marketing expense remained flat as compared to 2024.\nGeneral and administrative expense\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nGeneral and administrative expense\n$\n148,021 \n$\n44,098 \n42%\n$\n103,923 \nPercentage of revenue\n16%\n12%\nGeneral and administrative expense increased primarily due to a legal settlement at Tinder in the amount of $60.5 million, partially offset by (i) a decrease in non-cash compensation of $10.6 million primarily due to adjustments for certain performance award estimates at E&E and the departure of an executive at Tinder and (ii) a decrease in employee compensation of $5.2 million primarily within Tinder and E&E due to a decrease in headcount in 2025.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nGeneral and administrative expense\n$\n396,096 \n$\n71,628 \n22%\n$\n324,468 \nPercentage of revenue\n15%\n12%\nGeneral and administrative expense increased primarily due to (i) a legal settlement at Tinder in the amount of $60.5 million, (ii) a settlement with the FTC in the amount of $14.0 million related to certain E&E applications, and (iii) severance expense of $11.7 million primarily within Corporate and Unallocated Costs and E&E. Partially offsetting these increases was a decrease in non-cash compensation of $7.1 million primarily within E&E related to adjustments for certain performance award estimates and reductions in headcount.\n36\nTable of Contents\nProduct development expense\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nProduct development expense\n$\n104,969 \n$\n1,245 \n1%\n$\n103,724 \nPercentage of revenue\n11%\n12%\nProduct development expense remained relatively flat as compared to the prior period due to an increase of $2.9 million in stock-based compensation expense mainly at Hinge, partially offset by decreases in employee compensation at Tinder and MG Asia due to decreased headcount. \nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nProduct development expense\n$\n340,334 \n$\n7,297 \n2%\n$\n333,037 \nPercentage of revenue\n13%\n13%\nProduct development expense increased primarily due to severance expense of $9.4 million in 2025 primarily at Tinder and E&E, and an increase in other operating expenses related to increases in software subscriptions primarily at Tinder and Hinge.\nDepreciation\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nDepreciation\n$\n14,845 \n$\n(10,457)\n(41)%\n$\n25,302 \nPercentage of revenue\n2%\n3%\nDepreciation was lower in 2025 compared to 2024 primarily due to (i) a decrease in depreciation of internally developed software at Tinder as certain assets became fully depreciated during the period and (ii) the write off of internally developed software associated with our live streaming services in 2024.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nDepreciation\n$\n54,635 \n$\n(12,280)\n(18)%\n$\n66,915 \nPercentage of revenue\n2%\n3%\nDepreciation was lower in 2025 compared to 2024 primarily due to (i) a decrease in internally developed software at Tinder as certain assets became fully depreciated during the period and (ii) the write off of internally developed software associated with our live streaming services in 2024. These decreases were partially offset by increases in internally developed software at E&E.\n37\nTable of Contents\nImpairments and amortization of intangibles\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nImpairments and amortization of intangibles\n$\n8,921 \n$\n(33,169)\n(79)%\n$\n42,090 \nPercentage of revenue\n1%\n5%\nImpairments and amortization of intangibles decreased primarily due to impairments of intangible assets at E&E and MG Asia in the prior year as a result of the termination of our live streaming services and Hakuna brand in 2024.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nImpairments and amortization of intangibles\n$\n29,897 \n$\n(33,512)\n(53)%\n$\n63,409 \nPercentage of revenue\n1%\n2%\nImpairments and amortization of intangibles decreased primarily due to the factors described above in the three-month discussion.\n38\nTable of Contents\nNet Income, Operating income, and Adjusted EBITDA\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nNet income attributable to Match Group, Inc. shareholders\n$\n160,749 \n$\n24,268 \n18%\n$\n136,481 \n$\n403,797 \n$\n10,817 \n3%\n$\n392,980 \nOperating income (loss)\nTinder\n$\n183,743 \n$\n(50,561)\n(22)%\n$\n234,304 \n$\n594,059 \n$\n(68,817)\n(10)%\n$\n662,876 \nHinge\n46,314 \n4,107 \n10%\n42,207 \n113,865 \n22,939 \n25%\n90,926 \nEvergreen & Emerging\n31,447 \n28,337 \nNM\n3,110 \n33,728 \n(6,339)\n(16)%\n40,067 \nMG Asia\n801 \n19,696 \nNM\n(18,895)\n3,986 \n35,913 \nNM\n(31,927)\nCorporate and unallocated costs\n(40,971)\n9,095 \n(18)%\n(50,066)\n(157,790)\n4,228 \n(3)%\n(162,018)\nOperating income\n$\n221,334 \n$\n10,674 \n5%\n$\n210,660 \n$\n587,848 \n$\n(12,076)\n(2)%\n$\n599,924 \nAdjusted EBITDA\nTinder\n$\n203,818 \n$\n(62,507)\n(23)%\n$\n266,325 \n$\n678,500 \n$\n(79,358)\n(10)%\n$\n757,858 \nHinge\n62,623 \n11,197 \n22%\n51,426 \n159,033 \n36,427 \n30%\n122,606 \nEvergreen & Emerging\n47,373 \n5,805 \n14%\n41,568 \n92,119 \n(30,041)\n(25)%\n122,160 \nMG Asia\n15,290 \n(2,550)\n(14)%\n17,840 \n50,222 \n5,305 \n12%\n44,917 \nCorporate and unallocated costs\n(27,698)\n6,921 \n(20)%\n(34,619)\n(113,327)\n5,791 \n(5)%\n(119,118)\nAdjusted EBITDA\n$\n301,406 \n$\n(41,134)\n(12)%\n$\n342,540 \n$\n866,547 \n$\n(61,876)\n(7)%\n$\n928,423 \n______________________\nNM = Not meaningful\nFor a reconciliation of operating income to Adjusted EBITDA for each reportable segment, see “Non-GAAP Financial Measures.”\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\n•\nTinder’s operating income was $183.7 million, down 22%, and Adjusted EBITDA was $203.8 million, down 23%, primarily due to costs associated with legal settlements and the decrease in revenue.\n•\nHinge’s operating income was $46.3 million, an increase of 10%, and Adjusted EBITDA was $62.6 million, an increase of 22%, primarily due to continued Payer growth across all markets.\n•\nE&E’s operating income was $31.4 million and Adjusted EBITDA was $47.4 million, an increase of 14%, both improving primarily due to the termination of live streaming services in 2024. The increase in operating income is also due to the decrease in impairments and amortization of intangible assets as a result of the termination of live streaming services in 2024 and decreases in employee compensation, including stock-based compensation expense associated with adjustments for certain performance award estimates and reductions in headcount.\n•\nMG Asia’s operating income was $0.8 million, an improvement over the prior year operating loss of $18.9 million, and Adjusted EBITDA was $15.3 million. The improvement of operating income is related to impairments and amortization of intangible assets in the prior year as a result of the shut down of the Hakuna app in the second half of 2024.\n39\nTable of Contents\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\n•\nTinder’s operating income was $594.1 million, down 10%, and Adjusted EBITDA was $678.5 million, down 10%, primarily due to costs associated with legal settlements and the decrease in revenue.\n•\nHinge’s operating income was $113.9 million, an increase of 25%, and Adjusted EBITDA was $159.0 million, an increase of 30%, primarily due to continued Payer growth across all markets.\n•\nE&E’s operating income was $33.7 million, down 16%, and Adjusted EBITDA was $92.1 million, down 25%, primarily due to continued decreases in revenue. Operating income was also favorably impacted by the decrease in impairments and amortization of intangible assets as a result of the termination of live streaming services in 2024 and decreases in employee compensation, including stock-based compensation expense associated with reductions in headcount and adjustments for certain performance award estimates.\n•\nMG Asia’s operating income was $4.0 million, an improvement over the prior year of $35.9 million, and Adjusted EBITDA was $50.2 million. The change in operating income is primarily due to the decrease in impairments and amortization of intangible assets as a result of impairments in the prior year related to the shut down of the Hakuna app in the second half of 2024.\nAt September 30, 2025, there was $365.4 million of unrecognized compensation cost, net of estimated forfeitures, related to stock-based awards, which is expected to be recognized over a weighted average period of approximately 2.0 years.\nInterest expense\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nInterest expense\n$\n37,024 \n$\n(3,096)\n(8)%\n$\n40,120 \nInterest expense decreased primarily due to the decrease in the outstanding balance of the Term Loan which was repaid in full in January 2025, partially offset by the issuance of the 6.125% Senior Notes in August 2025.\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nInterest expense\n$\n104,440 \n$\n(16,071)\n(13)%\n$\n120,511 \nInterest expense decreased primarily driven by the factors described above in the three-month discussion.\n40\nTable of Contents\nOther income, net \nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nInterest Income\n$\n5,519 \n$\n(5,753)\n(51)%\n$\n11,272 \nForeign currency gains (losses)\n1,521 \n5,556 \nNM\n(4,035)\nOther\n2,288 \n2,425 \n(1,770)%\n(137)\nOther income, net\n$\n9,328 \n$\n2,228 \n31%\n$\n7,100 \nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nInterest income\n$\n13,202 \n$\n(18,464)\n(58)%\n$\n31,666 \nForeign currency losses\n(7,527)\n(2,848)\nNM\n(4,679)\nOther\n2,213 \n2,101 \n1,876%\n112 \nOther income, net\n$\n7,888 \n$\n(19,211)\n(71)%\n$\n27,099 \nIncome tax provision\nFor the three months ended September 30, 2025 compared to the three months ended September 30, 2024\nThree Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nIncome tax provision\n$\n32,882 \n$\n(8,277)\n(20)%\n$\n41,159 \nEffective income tax rate\n17%\n23%\nIn 2025, the effective rate of 17% is lower than the statutory rate primarily due to changes in tax reserves.\nIn 2024, the effective tax rate of 23% was higher than the statutory rate primarily due to the effects of nondeductible stock-based compensation, state income taxes, and foreign income taxed at higher rates. These effects were partially offset by a lower tax rate on U.S. income derived from foreign sources and research credits.\n41\nTable of Contents\nFor the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nNine Months Ended September 30,\n2025\n$ Change\n% Change\n2024\n(Dollars in thousands)\nIncome tax provision\n$\n87,491 \n$\n(25,986)\n(23)%\n$\n113,477 \nEffective income tax rate\n18%\n22%\nIn 2025, the effective tax rate of 18% is lower than the statutory rate primarily due to a lower tax rate on U.S. income derived from foreign sources and excess tax benefits generated by the exercise or vesting of stock-based awards. These effects were partially offset by nondeductible stock-based compensation and state income taxes.\nIn 2024, the effective tax rate of 22% was higher than the statutory rate primarily due the effects of nondeductible stock-based compensation, state income taxes, and unfavorable tax adjustments upon the vesting of certain stock-based awards due to a higher stock price on the date such awards vested compared to the grant date fair value of such awards. These effects were partially offset by a lower tax rate on U.S. income derived from foreign sources, research credits, and a tax benefit realized upon the conclusion of certain state income tax audits.\nOn July 4, 2025, the U.S. government enacted the One Big Beautiful Bill Act (“the Act”). The Act provides changes to U.S. federal tax law, including current expensing of U.S. research expenditures, immediate expensing of eligible capital expenditures, modifications to the limitation of business interest expense, and changes to other tax provisions in 2025 and later years. We expect the provisions of the Act to result in a reduction to our 2025 and 2026 cash tax payments. Additionally, we expect that the 2025 effective tax rate will be negatively affected by passage of the Act, primarily due to a lower deduction for U.S. income derived from foreign sources as a result of the current expensing of U.S. research expenditures. We continue to monitor interpretive guidance related to the Act. The impacts of the legislation are reflected in the consolidated financial statements as of and for the period ended September 30, 2025. \nA number of countries have enacted or are actively drafting legislation to implement the Organization for Economic Cooperation and Development's (\"OECD\") international tax framework, including the Pillar II minimum tax regime. The Company analyzed the impact of enacted legislation and determined it does not have a material impact to the income tax provision. The Company is continuing to monitor future developments.\nFor further details of income tax matters see “Note 2—Income Taxes” to the consolidated financial statements included in “Item 1—Consolidated Financial Statements.”\n42\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nMatch Group reports Adjusted EBITDA and Revenue excluding foreign exchange effects, both of which are supplemental measures to U.S. generally accepted accounting principles (“GAAP”). Adjusted EBITDA is among the primary metrics by which we evaluate the performance of our business, on which our internal budget is based, and by which management is compensated. Revenue excluding foreign exchange effects provides a comparable framework for assessing how our business performed without the effect of exchange rate differences when compared to prior periods. We believe that investors should have access to the same set of tools that we use in analyzing our results. These non-GAAP measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for or superior to GAAP results. Match Group endeavors to compensate for the limitations of the non-GAAP measures presented by providing the comparable GAAP measures with equal or greater prominence and descriptions of the reconciling items, including quantifying such items, to derive the non-GAAP measures. We encourage investors to examine the reconciling adjustments between the GAAP and non-GAAP measures, which we discuss below.\nAdjusted EBITDA\nAdjusted EBITDA \nis defined as net income attributable to Match Group, Inc. shareholders excluding: (1) net income attributable to noncontrolling interests; (2) income tax provision or benefit; (3) other income (expense), net; (4) interest expense; (5) depreciation; (6) acquisition-related items consisting of amortization of intangible assets and impairments of goodwill and intangible assets, if applicable; and (7) stock-based compensation expense. We believe Adjusted EBITDA is useful to analysts and investors as this measure allows a more meaningful comparison between our performance and that of our competitors. Adjusted EBITDA has certain limitations because it excludes certain expenses. At a segment level, the closest GAAP measure is operating income (loss) as items outside operating income (loss) are not allocated to segments.\nNon-Cash Expenses That Are Excluded From Adjusted EBITDA\nStock-based compensation expense\n consists principally of expense associated with the grants of RSUs, performance-based RSUs, and market-based awards. These expenses are not paid in cash, and we include the related shares in our fully diluted shares outstanding using the treasury stock method; however, performance-based RSUs and market-based awards are included only to the extent the applicable performance or market condition(s) have been met (assuming the end of the reporting period is the end of the contingency period). To the extent stock-based awards are settled on a net basis, we remit the required tax-withholding amounts from current funds.\nDepreciation \nis a non-cash expense relating to our property and equipment and is computed using the straight-line method to allocate the cost of depreciable assets to operations over their estimated useful lives, or, in the case of leasehold improvements, the lease term, if shorter.\nAmortization of intangible assets and impairments of goodwill and intangible assets \nare non-cash expenses related primarily to acquisitions. At the time of an acquisition, the identifiable definite-lived intangible assets of the acquired company, such as customer lists, trade names, and technology, are valued and amortized over their estimated lives. Value is also assigned to (i) acquired indefinite-lived intangible assets, which consist of trade names and trademarks, and (ii) goodwill, which are not subject to amortization. An impairment is recorded when the carrying value of an intangible asset or goodwill exceeds its fair value. We believe that intangible assets represent costs incurred by the acquired company to build value prior to acquisition and the related amortization and impairment charges of intangible assets or goodwill, if applicable, are not ongoing costs of doing business.\n43\nTable of Contents\nThe following tables reconcile net income attributable to Match Group, Inc. shareholders to Adjusted EBITDA for the Company’s reportable segments and at a consolidated level:\nThree Months Ended September 30, 2025\nTinder\nHinge\nE&E\nMG Asia\nCorporate & unallocated costs\nTotal Match Group\n(In thousands)\nNet income attributable to Match Group, Inc. shareholders\n$\n160,749 \nAdd back:\nNet income attributable to redeemable noncontrolling interests\na\n7 \nIncome tax provision\na\n32,882 \nOther income, net\na\n(9,328)\nInterest expense\na\n37,024 \nOperating income (loss)\n$\n183,743 \n$\n46,314 \n$\n31,447 \n$\n801 \n$\n(40,971)\n$\n221,334 \nStock-based compensation expense\n17,624 \n15,238 \n5,956 \n5,332 \n12,156 \n56,306 \nDepreciation\n2,451 \n1,071 \n6,268 \n3,938 \n1,117 \n14,845 \nAmortization of intangibles\n— \n— \n3,702 \n5,219 \n— \n8,921 \nAdjusted EBITDA\n$\n203,818 \n$\n62,623 \n$\n47,373 \n$\n15,290 \n$\n(27,698)\n$\n301,406 \nThree Months Ended September 30, 2024\nTinder\nHinge\nE&E\nMG Asia\nCorporate & unallocated costs\nTotal Match Group\n(In thousands)\nNet income attributable to Match Group, Inc. shareholders\n$\n136,468 \nAdd back:\nNet income attributable to redeemable noncontrolling interests\na\n13 \nIncome tax provision\na\n41,159 \nOther income, net\na\n(7,100)\nInterest expense\na\n40,120 \nOperating income (loss)\n$\n234,304 \n$\n42,207 \n$\n3,110 \n$\n(18,895)\n$\n(50,066)\n$\n210,660 \nStock-based compensation expense\n22,601 \n8,599 \n13,310 \n5,844 \n14,134 \n64,488 \nDepreciation\n9,420 \n620 \n5,918 \n8,031 \n1,313 \n25,302 \nImpairments and amortization of intangibles\n— \n— \n19,230 \n22,860 \n— \n42,090 \nAdjusted EBITDA\n$\n266,325 \n$\n51,426 \n$\n41,568 \n$\n17,840 \n$\n(34,619)\n$\n342,540 \n44\nTable of Contents\nNine Months Ended September 30, 2025\nTinder\nHinge\nE&E\nMG Asia\nCorporate & unallocated costs\nTotal Match Group\n(In thousands)\nNet income attributable to Match Group, Inc. shareholders\n$\n403,797 \nAdd back:\nNet income attributable to redeemable noncontrolling interests\na\n8 \nIncome tax provision\na\n87,491 \nOther income, net\na\n(7,888)\nInterest expense\na\n104,440 \nOperating income (loss)\n$\n594,059 \n$\n113,865 \n$\n33,728 \n$\n3,986 \n$\n(157,790)\n$\n587,848 \nStock-based compensation expense\n66,661 \n42,514 \n28,592 \n15,818 \n40,582 \n194,167 \nDepreciation\n17,780 \n2,654 \n19,085 \n11,235 \n3,881 \n54,635 \nAmortization of intangibles\n— \n— \n10,714 \n19,183 \n— \n29,897 \nAdjusted EBITDA\n$\n678,500 \n$\n159,033 \n$\n92,119 \n$\n50,222 \n$\n(113,327)\n$\n866,547 \nNine Months Ended September 30, 2024\nTinder\nHinge\nE&E\nMG Asia\nCorporate & unallocated costs\nTotal Match Group\n(In thousands)\nNet income attributable to Match Group, Inc. shareholders\n$\n392,980 \nAdd back:\nNet income attributable to redeemable noncontrolling interests\na\n55 \nIncome tax provision\na\n113,477 \nOther income, net\na\n(27,099)\nInterest expense\na\n120,511 \nOperating income (loss)\n$\n662,876 \n$\n90,926 \n$\n40,067 \n$\n(31,927)\n$\n(162,018)\n$\n599,924 \nStock-based compensation expense\n66,557 \n29,978 \n41,978 \n20,683 \n38,979 \n198,175 \nDepreciation\n28,425 \n1,702 \n15,910 \n16,957 \n3,921 \n66,915 \nImpairments and amortization of intangibles\n— \n— \n24,205 \n39,204 \n— \n63,409 \nAdjusted EBITDA\n$\n757,858 \n$\n122,606 \n$\n122,160 \n$\n44,917 \n$\n(119,118)\n$\n928,423 \n______________________\n(a)\nManagement does not allocate these items to segments.\n45\nTable of Contents\nEffects of Changes in Foreign Exchange Rates on Revenue\nThe impact of foreign exchange rates on the Company, due to its global reach, may be an important factor in understanding period over period comparisons if movement in exchange rates is significant. Since our results are reported in U.S. dollars, international revenue is favorably impacted as the U.S. dollar weakens relative to other currencies, and unfavorably impacted as the U.S. dollar strengthens relative to other currencies. We believe the presentation of revenue excluding the effects from foreign exchange, in addition to reported revenue, helps improve investors’ ability to understand the Company’s performance because it excludes the impact of foreign currency volatility that is not indicative of Match Group’s core operating results.\nRevenue excluding foreign exchange effects compares results between periods as if exchange rates had remained constant period over period. Revenue excluding foreign exchange effects is calculated by translating current period revenue using prior period exchange rates. The percentage change in revenue excluding foreign exchange effects is calculated by determining the change in current period revenue over prior period revenue where current period revenue is translated using prior period exchange rates.\nThe following tables present the impact of foreign exchange effects on total revenue and Direct Revenue by segment for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n$ Change\n% Change\n2024\n2025\n$ Change\n% Change\n2024\n \n(Dollars in thousands)\nTotal Revenue, as reported\n$\n914,275 \n$\n18,791 \n2%\n$\n895,484 \n$\n2,609,191 \n$\n(10,006)\n—%\n$\n2,619,197 \nForeign exchange effects\n(12,182)\n(3,955)\nTotal Revenue excluding foreign exchange effects\n$\n902,093 \n$\n6,609 \n1%\n$\n895,484 \n$\n2,605,236 \n$\n(13,961)\n(1)%\n$\n2,619,197 \nTinder Direct Revenue, as reported\n$\n490,613 \n$\n(12,604)\n(3)%\n$\n503,217 \n$\n1,399,167 \n$\n(65,482)\n(4)%\n$\n1,464,649 \nForeign exchange effects\n(8,207)\n(1,490)\nTinder Direct Revenue, excluding foreign exchange effects\n$\n482,406 \n$\n(20,811)\n(4)%\n$\n503,217 \n$\n1,397,677 \n$\n(66,972)\n(5)%\n$\n1,464,649 \nHinge Direct Revenue, as reported\n$\n184,671 \n$\n39,246 \n27%\n$\n145,425 \n$\n504,417 \n$\n101,670 \n25%\n$\n402,747 \nForeign exchange effects\n(1,641)\n(1,699)\nHinge Direct Revenue, excluding foreign exchange effects\n$\n183,030 \n$\n37,605 \n26%\n$\n145,425 \n$\n502,718 \n$\n99,971 \n25%\n$\n402,747 \nE&E Direct Revenue, as reported\n$\n152,241 \n$\n(6,149)\n(4)%\n$\n158,390 \n$\n449,254 \n$\n(38,671)\n(8)%\n$\n487,925 \nForeign exchange effects\n(2,479)\n(3,257)\nE&E Direct Revenue, excluding foreign exchange effects\n$\n149,762 \n$\n(8,628)\n(5)%\n$\n158,390 \n$\n445,997 \n$\n(41,928)\n(9)%\n$\n487,925 \nMG Asia Direct Revenue, as reported\n$\n69,136 \n$\n(3,028)\n(4)%\n$\n72,164 \n$\n201,723 \n$\n(15,584)\n(7)%\n$\n217,307 \nForeign exchange effects\n302 \n2,326 \nMG Asia Direct Revenue, excluding foreign exchange effects\n$\n69,438 \n$\n(2,726)\n(4)%\n$\n72,164 \n$\n204,049 \n$\n(13,258)\n(6)%\n$\n217,307 \n46\nTable of Contents\nFINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES\nFinancial Position\nSeptember 30, 2025\nDecember 31, 2024\n(In thousands)\nCash and cash equivalents:\nUnited States\n$\n684,578 \n$\n705,967 \nAll other countries\n368,662 \n260,026 \nTotal cash and cash equivalents\n1,053,240 \n965,993 \nShort-term investments\n3,561 \n4,734 \nTotal cash and cash equivalents and short-term investments\n$\n1,056,801 \n$\n970,727 \nLong-term debt:\nCredit Facility due March 20, 2029\n(a)\n$\n— \n$\n— \nTerm Loan due February 13, 2027\n— \n425,000 \n5.00% Senior Notes due December 15, 2027\n450,000 \n450,000 \n4.625% Senior Notes due June 1, 2028\n500,000 \n500,000 \n5.625% Senior Notes due February 15, 2029\n350,000 \n350,000 \n4.125% Senior Notes due August 1, 2030\n500,000 \n500,000 \n3.625% Senior Notes due October 1, 2031\n500,000 \n500,000 \n6.125% Senior Notes due September 15, 2033\n700,000 \n— \n2026 Exchangeable Notes due June 15, 2026\n498,629 \n575,000 \n2030 Exchangeable Notes due January 15, 2030\n575,000 \n575,000 \nTotal debt\n4,073,629 \n3,875,000 \nLess: Current maturities of long-term debt\n498,629 \n— \nLess: Unamortized original issue discount\n1,169 \n2,554 \nLess: Unamortized debt issuance costs\n26,113 \n23,463 \nTotal long-term debt, net\n$\n3,547,718 \n$\n3,848,983 \n______________________\n(a)\nThe maturity date of the Credit Facility is the earlier of (x) March 20, 2029 and (y) the date that is 91 days prior to the maturity date of the existing senior notes due 2027, 2028, or 2029, or any new indebtedness used to refinance such senior notes that matures prior to the date that is 91 days after March 20, 2029, in each case if and only if at least $250 million in aggregate principal amount of such debt is outstanding on such date.\nLong-term Debt\nFor a detailed description of long-term debt, see “Note 4—Long-term Debt, net” to the consolidated financial statements included in “Item 1—Consolidated Financial Statements.”\n47\nTable of Contents\nCash Flow Information\nIn summary, the Company’s cash flows are as follows:\nNine Months Ended September 30,\n2025\n2024\n(In thousands)\nNet cash provided by operating activities\n$\n757,600 \n$\n678,009 \nNet cash used in investing activities\n(67,883)\n(51,072)\nNet cash used in financing activities\n(617,184)\n(636,126)\n2025\nNet cash provided by operating activities in 2025 includes adjustments to income of $194.2 million of stock-based compensation expense, $54.6 million of depreciation, $35.2 million of deferred income taxes, and $29.9 million of amortization of intangibles. The increase in cash from changes in working capital primarily consists of a decrease in other assets of $43.8 million, an increase in accounts payable and other liabilities of $36.6 million, primarily related to the timing of payments, and an increase in net income taxes payable of $31.1 million due to timing of payments, all of which was partially offset by an increase in accounts receivable of $16.5 million and a decrease in deferred revenue of $8.4 million.\nNet cash used in investing activities in 2025 consists primarily of capital expenditures of $42.1 million primarily related to internal development of software and purchases of computer hardware and $25.8 million of other investing cash outflows.\nNet cash used in financing activities in 2025 is primarily due to purchases of treasury stock of $549.9 million, the repayment of the Term Loan of $425.0 million, dividends paid of $140.9 million, payments of $115.6 million of withholding taxes paid on behalf of employees for net-settled stock-based awards, and payment to repurchase a portion of the 2026 Exchangeable Notes of $74.4 million. These uses of cash were partially offset by proceeds from the issuance of the 6.125% Senior Notes of $700.0 million.\n2024\nNet cash provided by operating activities in 2024 includes adjustments to income of $198.2 million of stock-based compensation expense, $66.9 million of depreciation, and $63.4 million of impairments and amortization of intangibles.  The decrease in cash from changes in working capital primarily consists of an increase in accounts receivable of $41.4 million primarily related to the timing of cash receipts and a decrease in deferred revenue of $29.6 million, partially offset by an increase in net income taxes payable and receivable of $11.4 million due to the timing of tax payments. \nNet cash used in investing activities in 2024 consists primarily of capital expenditures of $43.0 million primarily related to internal development of software and purchases of computer hardware.\nNet cash used in financing activities in 2024 is primarily due to purchases of treasury stock of $630.6 million and payments of $11.4 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $9.4 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nLiquidity and Capital Resources\nThe Company’s principal sources of liquidity are its cash and cash equivalents as well as cash flows generated from operations. As of September 30, 2025, $499.4 million was available under the Credit Facility.\nThe Company has various obligations related to long-term debt instruments and operating leases. For additional information on long-term debt, including maturity dates and interest rates, see “Note 4—Long-term Debt, net” to the consolidated financial statements included in “Item 1—Consolidated Financial Statements.” For additional information on operating lease payments, including a schedule of obligations by year, see “Note 13—Leases” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data” of the Company’s Annual Report on Form 10-K for the year ended December 31, 2024. The Company believes it has sufficient cash flows from operations to satisfy these future obligations.\n48\nTable of Contents\nOn January 21, 2025, the Company repaid the Term Loan in full utilizing cash on hand.\nOn August 20, 2025, we completed a private offering of $700 million aggregate principal amount of 6.125% Senior Notes due 2033. The proceeds from the issuance of these notes will be used to repay all of the outstanding 0.875% exchangeable senior notes due 2026 at or prior to their maturity and the remaining proceeds will be used for general corporate purposes.\nOn September 8, 2025, we repurchased $76 million aggregate principal amount of 0.875% exchangeable senior notes due 2026.\nThe Company anticipates that it will need to make capital and other expenditures in connection with the development and expansion of its operations. The Company expects that 2025 cash capital expenditures will be between $55 million and $65 million, an increase compared to 2024 cash capital expenditures primarily related to internally developed software.\nWe have entered into various purchase commitments, primarily consisting of web hosting services. Our obligations under these various purchase commitments are $1.5 million for 2025, $88.2 million for 2026, $75.1 million for 2027, and $70.3 million for 2028.\nAt September 30, 2025, we do not have any off-balance sheet arrangements, other than as described above.\nOn January 30, 2024, the Board of Directors of the Company approved a share repurchase program for the repurchase of up to $1.0 billion in aggregate value of shares of Match Group stock (the “January 2024 Share Repurchase Program”). On December 10, 2024, the Board of Directors authorized a new repurchase program of up to $1.5 billion in aggregate value of shares of Match Group common stock (the “December 2024 Share Repurchase Program”). The December 2024 Share Repurchase Program took effect when the January 2024 Share Repurchase Program was exhausted, which occurred in April 2025. Under the December 2024 Share Repurchase Program, $1.10 billion in aggregate value of shares of Match Group common stock remains available as of October 31, 2025. Under the December 2024 Share Repurchase Program, shares of our common stock may be purchased on a discretionary basis from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases, privately negotiated transactions or other means, including through Rule 10b5-1 trading plans. The December 2024 Share Repurchase Program may be commenced, suspended or discontinued at any time. During the nine months ended September 30, 2025, we repurchased 17.4 million shares for $549.9 million on a trade date basis under the January 2024 and December 2024 Share Repurchase Programs. Between October 1 and October 31, 2025, we repurchased 3.0 million shares for $100.0 million on a trade date basis under the December 2024 Share Repurchase Program.\nThe Company currently settles substantially all stock-based awards on a net basis. Assuming all stock-based awards outstanding on October 31, 2025 were net settled at the closing price on that date, we would issue 8.8 million shares of common stock (of which 0.2 million are related to vested awards and 8.6 million are related to unvested awards) and, assuming a 50% withholding rate, would remit $283.2 million in cash for withholding taxes (of which $5.6 million is related to vested awards and $277.6 million is related to unvested awards). If we did not settle awards on a net basis and instead issued a sufficient number of shares to cover the $283.2 million employee withholding tax obligation, 8.8 million additional shares would be issued by the Company.\nAs of September 30, 2025, all of the Company’s international cash can be repatriated without significant tax consequences.\nOur indebtedness could limit our ability to: (i) obtain additional financing to fund working capital needs, acquisitions, capital expenditures, debt service, or other requirements; and (ii) use operating cash flow to pursue acquisitions or invest in other areas, such as developing properties and exploiting business opportunities. The Company may need to raise additional capital through future debt or equity financing to make additional acquisitions and investments or to provide for greater financial flexibility. Additional financing may not be available on terms favorable to the Company or at all.\n49\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nManagement of the Company is required to make certain estimates, judgments and assumptions during the preparation of its consolidated financial statements in accordance with U.S. GAAP. These estimates, judgments and assumptions impact the reported amount of assets, liabilities, revenue and expenses and the related disclosure of contingent assets and liabilities. Actual results could differ from these estimates. \nDuring the nine months ended September 30, 2025, there were no material changes to the Company’s critical accounting policies and estimates since the disclosure in our Annual Report on Form 10-K for the year ended December 31, 2024.\n50\nTable of Contents"
}