{
  "source_file": "mtch-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.     Business\nWho we are\nMatch Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n®\n, Hinge\n®\n, Match\n®\n, Meetic\n®\n, OkCupid\n®\n, Pairs™, Plenty Of Fish\n®\n, Azar\n®\n, BLK\n®\n, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nThe business of creating meaningful connections\nOur goal is to spark meaningful connections for users around the world. Consumers’ preferences vary significantly, influenced in part by demographics, geography, cultural norms, religion, and intent (for example, seeking friendship, casual dating, or more serious relationships). As a result, the market for social connection apps is fragmented, and no single service has been able to effectively serve all of those seeking social connections.\nPrior to the proliferation of the internet and mobile devices, human connections traditionally were limited by social circles, geography, and time. People met through work colleagues, friends and family, in school, at church, at social gatherings, in bars and restaurants, or in other social settings. Today, the adoption of mobile technology and the internet has significantly expanded the ways in which people can create new interactions, and develop meaningful connections and relationships. Additionally, the ongoing adoption of technology into more aspects of daily life continues to further erode biases and stigmas across the world that previously served as barriers to individuals using technology to help find and develop those connections.\nWe believe that technologies that bring people together serve as a natural extension of the traditional means of meeting people and provide a number of benefits for users, including:\n•\nExpanded options\n: Social connection apps provide users access to a large pool of people they otherwise would not have a chance to meet.\n•\nEfficiency\n: The search and recommending features, as well as the profile information available on social connection apps, allow users to filter a large number of individuals in a short period of time, increasing the likelihood that users will make a connection with someone.\n•\nMore comfort and control\n: Compared to the traditional ways that people meet, social connection apps provide an environment that reduces the awkwardness around identifying and reaching out to new people who are interested in connecting. This leads to many people who would otherwise be passive participants taking a more active role.\n•\nSafely meet new people:\n Social connection apps can offer a safer way to contact new people for the first-time by allowing people to limit the amount of personal information exchanged and providing an opportunity to vet a new connection before meeting in person, including via video communication.\n•\nConvenience\n: The nature of the internet and the proliferation of mobile devices allow users to connect with new people at any time, regardless of where they are.\nDepending on a person’s circumstances at any given time, social connection apps can act as a supplement to, or substitute for, traditional means of meeting people. When selecting a social connection app, we believe that users consider the following attributes:\n•\nBrand recognition and scale\n: Brand is very important. Users generally associate strong brands with a higher likelihood of success and more tools to help the user connect safely and securely. Generally, successful brands depend on large, active communities of users, strong algorithmic filtering technology, and awareness of successful usage among similar users.\n4\nTable of Contents\n•\nSuccessful experiences\n: Demonstrated success of other users attracts new users through word-of-mouth recommendations. Successful experiences also drive repeat usage.\n•\nCommunity identification\n: Users typically look for social connection apps that offer a community or communities to which the user can relate. By selecting a social connection app that is focused on a particular demographic, religion, geography, or intent, users can increase the likelihood that they will make a connection with someone with whom they identify.\n•\nService features and user experience\n: Users tend to gravitate towards social connection apps that offer features and user experiences that resonate with them, such as question-based matching algorithms, location-based features, or search capabilities. User experience is also driven by the type of user interface (for example, using our patented Swipe\n®\n technology versus scrolling), a particular mix of free and paid features, ease of use, privacy, and security. Users expect every interaction with a social connection app to be seamless and intuitive.\nGiven varying consumer preferences, we have adopted a brand portfolio approach, through which we attempt to offer social connection apps that collectively appeal to the broadest spectrum of consumers. We believe that this approach maximizes our ability to attract additional users.\nOur portfolio\nTinder\nTinder\n®\n was launched in 2012 and has since risen to scale and popularity faster than any other service in the online dating category. Tinder’s patented Swipe\n®\n technology has led to significant adoption, particularly among 18 to 25 year-old users, who were historically underserved by the online dating category. Tinder employs a freemium model, through which users are allowed to enjoy many of the core features of Tinder for free, including limited use of the Swipe Right\n®\n feature with unlimited communication with other users. However, to enjoy premium features, such as unlimited use of the Swipe Right feature, a Tinder user must subscribe to one of several subscription offerings: Tinder Plus\n®\n, Tinder Gold\n®\n, or Tinder Platinum\n®\n. Tinder users and subscribers may also pay for certain premium features, such as Super Likes™ and Boosts, on a pay-per-use basis. Tinder Explore is an additional feature available for users to discover and interact with others in ways that are non-traditional to Tinder.\nHinge\nHinge\n®\n launched in 2012 and has grown to be a popular app for relationship-minded individuals, particularly among the millennial and younger generations, in English speaking countries and several other European markets. Hinge is a mobile-only experience and employs a freemium model. Hinge is Designed to be Deleted® and focuses on users with a higher level of intent to enter into a relationship and its services are designed to reinforce that purpose. Hinge has Video Prompts, Voice Prompts, and Voice Notes, which allows users to better showcase who they are through text, photos, video, and voice at different points in their dating journey. Hinge offers two premium subscription offerings: Hinge+ and HingeX.\nEvergreen & Emerging (“E&E”)\nOur collections of brands within E&E include well-known pioneers in online relationships (which we refer to as Evergreen brands) and newer brands which target specific demographics (which we refer to as Emerging brands). The following brands are included in E&E:\nMatch. \nThe Match\n®\n platform was launched in 1995 and helped create the online dating category with the ability to search profiles and receive algorithmic recommendations. Match is a brand that focuses on users with a higher level of intent to enter into a serious relationship and its services and marketing are designed to reinforce that purpose.\nMeetic. \nMeetic\n®\n, a leading European online dating brand based in France, was launched in 2001. Meetic is the most recognized dating app for singles over age 35 in Europe. Meetic is a brand that focuses on users with a higher level of intent to enter into a serious relationship and its service and marketing are designed to reinforce that purpose. Meetic also has online audio and video chat rooms available for users.\n5\nTable of Contents\nOkCupid. The \nOkCupid\n®\n service was launched in 2004 and has attracted users through a Q&A approach to the dating category. OkCupid relies on a freemium model and has a loyal, culturally progressive user base predominately located in larger metropolitan areas in English-speaking markets.\nPlenty Of Fish. The \nPlenty Of Fish\n®\n dating service launched in 2003. Among its distinguishing features is the ability to both search profiles and receive algorithmic recommendations. Plenty Of Fish has grown in popularity over the years and relies on a freemium model. Plenty Of Fish has broad appeal in the United States, Canada, the United Kingdom, and a number of other international markets.\nBLK.\n BLK\n®\n brings the Swipe\n®\n feature made popular by Tinder to the Black community.\nMatch Group Asia (“MG Asia”)\nThe focus of the MG Asia brands has primarily been to serve various Asian and Middle Eastern markets. Recently, Azar has expanded into European and U.S. markets. The following brands are included in MG Asia:\nPairs. The \nPairs™ app was launched in 2012 and is a leading provider of online dating services in Japan, with a presence in Taiwan and South Korea. Pairs is a dating platform that was specifically designed to address social barriers generally associated with the use of dating services in Japan.\nAzar.\n Azar\n®\n was launched in 2014 and acquired in 2021 through our acquisition of Hyperconnect. Azar is a one-to-one video chat service that allow users to meet and interact with a variety of people across the globe in their native language. Azar is primarily focused in the Middle East region, with growth in Western Europe and recent expansion into the U.S.\nOur Portfolio Strategy\nWe strive to empower individual brand leaders with the authority and incentives to grow their respective brands. Our brands compete with each other and with third-party businesses on brand characteristics, service features, and business model, however we also work to apply a centralized discipline and share best practices across our brands in order to quickly introduce new services and features, optimize marketing, increase growth, reduce costs, improve user safety, and maximize profitability. Additionally, we centralize certain other administrative functions, such as legal, accounting, finance, treasury, real estate and facilities, and tax. We attempt to centrally facilitate excellence and efficiency across the entire portfolio by:\n•\ncentralizing operational functions across certain brands where we have strength in personnel and sufficient commonality of business interest (for example, ad sales, online marketing, and business technology are centralized across some, but not all, brands);\n•\ndeveloping talent across the portfolio to allow for development of specific proficiencies and promoting career advancement while maintaining the ability to deploy the best talent in the most critical positions across the company at any given time; and\n•\nsharing analytics to leverage services and marketing successes across our businesses rapidly for competitive advantage.\nStaying competitive\nThe industry for social connection apps is competitive and has no single, dominant brand globally. We compete with a number of other companies that provide similar technologies for people to meet each other, including other online dating platforms; other social media platforms and social-discovery apps, such as Facebook, Instagram (owned by Meta), Snap, TikTok, Twitter/X, LinkedIn (owned by Microsoft), Twitch (owned by Amazon), and YouTube (owned by Alphabet); offline dating services, such as in-person matchmakers; and other traditional means of meeting people.\nWe believe that our ability to attract new users to our brands as well as retain existing users will depend primarily upon the following factors:\n•\nour ability to increase consumer acceptance and adoption of technologies to meet other people, particularly among younger generations being first introduced to our services and in emerging markets and parts of the world where the associated stigma has not yet fully eroded;\n6\nTable of Contents\n•\ncontinued growth in internet access and smart phone adoption in certain regions of the world, particularly emerging markets;\n•\nthe continued strength of our well-known brands and the growth of our emerging brands;\n•\nthe authenticity, breadth, and depth of our active communities of users;\n•\nour brands’ reputations for trust and safety;\n•\nour ability to evolve our services and introduce new services to keep up with user requirements, social trends, and the ever-evolving technological landscape;\n•\nour brands’ ability to keep up with the constantly changing regulatory landscape, in particular, as it relates to the regulation of consumer digital media platforms;\n•\nour ability to efficiently acquire new users for our services;\n•\nour ability to continue to optimize our monetization strategies;\n•\nthe design and functionality of our services; and\n•\nmacroeconomic and geopolitical conditions.\nA large portion of customers use multiple services over a given period of time, either concurrently or sequentially, making our broad portfolio of brands a competitive advantage.\nHow we earn our revenue\nMany of our brands enable users to establish a profile and review other users’ profiles without charge. Each brand also offers additional features, some of which are free, and some of which require payment depending on the particular service. In general, access to premium features requires a subscription, which is typically offered in packages (generally ranging from one week to six months), depending on the service and circumstance. Prices can differ meaningfully within a given brand depending on the duration of a subscription, the bundle of paid features that a user chooses to access, and whether or not a user is taking advantage of any special offers. In addition to subscriptions, many of our brands offer users certain features, such as the ability to promote themselves for a given period of time, or highlight themselves to a specific user, and these features are offered on a pay-per-use, or à la carte, basis. The precise mix of paid and premium features is established over time on a brand-by-brand basis and is subject to constant iteration and evolution.\nOur direct revenue is primarily derived from users in the form of recurring subscriptions, which typically provide unlimited access to a package of features for a specified period of time, and to a lesser extent from à la carte features, where users pay a non-recurring fee for a specific consumable benefit or feature. Each of our brands offers a combination of free and paid features targeted to its unique user base. In addition to direct revenue from our users, we generate indirect revenue from advertising, which comprises a much smaller percentage of our overall revenue as compared to direct revenue.\nDependencies on services provided by others\nApp Stores\nWe rely on the Apple App Store and the Google Play Store to distribute and monetize our mobile applications. While our mobile applications are free to download from these stores, we offer our users the opportunity to purchase subscriptions and certain à la carte features through these applications. We determine the prices at which these subscriptions and features are sold; however, purchases of these subscriptions and features are required in most cases to be processed through the in-app payment systems provided by Apple and Google, although some of our applications are currently able to use their own payment systems for in-app purchases made on Android devices. We pay Apple and Google a meaningful share of the revenue we receive from in-app transactions. For additional information, see “Item 1A Risk factors—Risks relating to our business—As the distribution of our services through app stores increases, in order to maintain our profit margins, we have taken steps, and in the future may need to take further steps, to offset increasing app store fees by decreasing traditional marketing expenditures, increasing user volume or monetization per user, consolidating back-office and technical functions, or by engaging in other efforts to increase revenue or decrease costs generally.”\n7\nTable of Contents\nAdditionally, when our users and subscribers access and pay through the app stores, Apple and Google may receive personal data about our users and subscribers that we would otherwise receive if we transacted with our users and subscribers directly. Apple and Google have restricted our access to much of that data.\nBoth Apple and Google believe they have broad discretion to unilaterally change the terms and conditions governing their respective app stores, including, among other things, the amount of, and requirement to pay, certain fees associated with purchases required to be made through their payment systems. Apple or Google could also make changes to their operating systems or payment services that could negatively impact our business, including by unilaterally raising the prices for those services. For additional information, see “Item 1A Risk factors—Risks relating to our business—Distribution and marketing of, and access to, our services rely, in significant part, on a variety of third-party platforms, in particular, mobile app stores. If these third parties limit, prohibit, or otherwise interfere with features or services or change their policies in any material way, it could adversely affect our business, financial condition, and results of operations.”\nThe manner in which Apple and Google operate these services is being reviewed by legislative and regulatory bodies globally and challenged in courts in multiple jurisdictions. Notably, the European Union (the “EU”) has, under the Digital Markets Act, designated Apple and Google as “gatekeepers.” As such, we expect Apple and Google to be restricted from, among other things, (i) imposing fees or other requirements that are not fair, reasonable and non-discriminatory to all application developers and (ii) prohibiting application developers from informing users about alternative payment options, offering their own in-app payment systems and making their applications available through alternate app stores on iOS and Android devices or through direct download. In addition, the Republic of Korea has adopted legislation that prohibits Apple and Google from requiring that developers exclusively use Apple and Google to process payments. Further, courts and regulators in several jurisdictions, including the U.S., France, India, and the Netherlands have found that certain app store commissions and policies, such as the requirement that application developers exclusively use their payment systems, violate laws in those jurisdictions. Multiple other jurisdictions, including the United Kingdom, Japan, Mexico, Brazil, Indonesia, Chile, and Australia, are investigating, considering regulatory action or considering legislation to restrict or prohibit these practices. The United States Congress, as well as a number of state legislatures, are also considering legislation that would regulate certain terms of the relationships between developers and Apple and Google and prohibit Apple and Google from requiring the use of their respective payment systems for in-app purchases. \nCloud and Other Services\nWe rely on third parties, primarily data centers and cloud-based, hosted web service providers, such as Amazon Web Services, as well as third party computer systems, service providers, software providers, and broadband and other communications systems, in connection with the provision of our applications generally, as well as to facilitate and process certain transactions with our users. We have no control over any of these third parties or their operations and such third party systems are increasingly complex.\nProblems experienced by third-party data centers and cloud-based, hosted web service providers upon which our brands including Tinder, Hinge, and Pairs rely, the telecommunications network providers with which we or they contract, or with the systems through which telecommunications providers allocate capacity among their customers could also adversely affect us. Any changes in service levels at our data centers or hosted web service providers or any interruptions, outages or delays in our systems or those of our third-party providers, or deterioration in the performance of such systems, could impair our ability to provide our services or process transactions with our users, which would adversely impact our business, financial condition and results of operations. For additional information, see “Item 1A Risk factors—Risks relating to our business—Our success depends, in part, on the integrity of third-party systems and infrastructure.”\nSales and marketing \nAll of our brands rely on word-of-mouth, or free, user acquisition and also paid user acquisition, both to varying degrees. Our online marketing activities generally consist of purchasing social media advertising, advertising on streaming services, banner, and other display advertising, search engine marketing, email campaigns, video advertising, business development or partnership arrangements, creating content, and partnering with influencers, among other means to promote our services. Our offline marketing activities generally consist of television advertising, out-of-home advertising, and public relations efforts.\n8\nTable of Contents\nIntellectual property \nWe regard our intellectual property rights, including trademarks, domain names, and other intellectual property, as critical to our success.\nFor example, we rely heavily upon the use of trademarks (primarily Tinder\n®\n, Hinge\n®\n, Match\n®\n, Plenty Of Fish\n®\n, OkCupid\n®\n, Meetic\n®\n, Pairs™, Swipe\n®\n, Azar\n®\n, and BLK®, and associated domain names, taglines and logos) to market our services and applications and build and maintain brand loyalty and recognition. We maintain an ongoing trademark and service mark registration program, pursuant to which we register our brand names, service names, taglines and logos and renew existing trademark and service mark registrations in the United States and other jurisdictions to the extent we determine it to be necessary or otherwise appropriate and cost-effective. In addition, we have a trademark and service mark monitoring policy pursuant to which we monitor applications filed by third parties to register trademarks and service marks that may be confusingly similar to ours, as well as potential unauthorized use of our material trademarks and service marks. Our enforcement of this policy affords us valuable protection under current laws, rules, and regulations. We also reserve and register (to the extent available) and renew existing registrations for domain names that we believe are material to our business.\nWe also rely upon a combination of in-licensed third-party and proprietary trade secrets, including proprietary algorithms, and upon patented and patent-pending technologies, processes, and features relating to our recommendation process systems or features and services with expiration dates from 2025 to 2041. We have an ongoing invention recognition program pursuant to which we apply for patents to the extent we determine it to be core to our service or businesses or otherwise appropriate and cost-effective.\nWe rely on a combination of internal and external controls, including applicable laws, rules, and regulations, and contractual restrictions with employees, contractors, customers, suppliers, affiliates, and others, to establish, protect, and otherwise control access to our various intellectual property rights.\nGovernment regulation\nWe are subject to a variety of laws and regulations in the United States and abroad that involve matters that are related to our business, many of which are still evolving and being tested in courts, and could be interpreted in ways that could harm our business. These laws and regulations involve matters including antitrust and competition, broadband internet access, online commerce, advertising, user privacy, data protection, intermediary liability, protection of minors, biometrics, consumer protection, general safety, sex-trafficking, taxation, money laundering, accessibility, artificial intelligence, and securities law compliance. We have and could again in the future be subject to actions based on negligence, regulatory compliance, various torts, and trademark and copyright infringement, among other actions. See “Item 1A Risk factors—Risks relating to our business—Our business is subject to complex and evolving U.S. and international laws and regulations, including with respect to data privacy and platform liability. These laws and regulations are subject to change and uncertain interpretation, and could result in changes to our business practices, increased cost of operations, declines in user growth or engagement, claims, monetary penalties, or other harm to our business” and “—Risks relating to our business—We may fail to adequately protect our intellectual property rights or may be accused of infringing the intellectual property rights of third parties.”\nBecause we receive, store, and use a substantial amount of information received from or generated by our users, we are particularly impacted by laws and regulations governing privacy; the storage, sharing, use, processing, disclosure, transfer, and protection of personal data; and data breaches, in many of the countries in which we operate. For example, in the EU we are subject to the General Data Protection Act (“GDPR”), which applies to companies established in the EU or otherwise providing services or monitoring the behavior of people located in the EU and provides for significant penalties in case of non-compliance as well as a private right of action for individual claimants. GDPR will continue to be interpreted by EU data protection regulators, which have and may in the future require that we make changes to our business practices, and could generate additional costs, risks, and liabilities. See “Item 3 Legal Proceedings—Irish Data Protection Commission Inquiry Regarding Tinder’s Practices.” The EU is also considering an update to its Privacy and Electronic Communications (so-called “e-Privacy”) Directive, notably to amend rules on the use of cookies, direct marketing and processing of private communications and related metadata, which may also require that we make changes to our business practices and could generate additional costs, risks and liabilities. In 2020, the Court of Justice of the EU declared transfers of personal data on the basis of the European Commission’s Privacy Shield Decision illegal and \n9\nTable of Contents\nstipulated stricter requirements for the transfer of personal data based on standard contract clauses to non-EU countries. In 2023, the EU-U.S. Data Privacy Framework was adopted and extended to certain other European countries to provide U.S. organizations with reliable mechanisms for personal data transfers to the United States from the EU as well as certain other European countries, while ensuring data protection that is consistent with applicable law. Compliance with the various EU data transfer requirements, and the resulting interpretations, decisions, and guidelines from EU supervisory authorities, may require changes to our business practices and generate additional costs, risks, and liabilities.\nAt the same time, many countries in which we do business have already adopted or are also currently considering adopting privacy and data protection laws and regulations. For instance, multiple legislative proposals concerning privacy and the protection of user information have been introduced in the U.S. Congress. Various U.S. state legislatures are also considering privacy legislation in 2025 and beyond. Some U.S. state legislatures have already passed and enacted privacy legislation, most prominently the California Consumer Privacy Act of 2018, which came into effect in 2020. Also, the California Privacy Rights Act of 2020 (the “CPRA”) was enacted, which expanded the state’s consumer privacy laws and created a new government organization, the California Privacy Protection Agency, to enforce the law. The majority of the CPRA’s provisions entered into force on January 1, 2023, with a lookback to January 2022. In addition to California, comprehensive privacy laws were passed in Virginia, Colorado, Connecticut, and Utah, each of which came into force in 2023, as well as Florida, Montana, Oregon, and Texas, each of which came into force in 2024. Additionally, the Federal Trade Commission has increased its focus on privacy and data security practices at digital companies, as evidenced by its levying of several large fines against digital companies for privacy violations in recent years. Finally, talks of a U.S. federal privacy law are ongoing in Congress, with multiple proposals being considered, and may lead to the passing of a new law in the coming years.\nConcerns about harms and the use of dating services and social networking platforms for illegal conduct, such as romance scams, promotion of false or inaccurate information, financial fraud, and sex-trafficking, have produced and could continue to produce future legislation or other governmental action. For example, the EU’s Digital Services Act (the “DSA”), which went into effect in 2024, imposes additional requirements on technology companies around moderation, transparency, and the overall safety of their platforms. In addition, the UK’s Online Safety Bill imposes similar requirements to those provided in the DSA. Of note, this law places new requirements on social media companies, including online dating companies, to protect children from being exposed to inappropriate material. Most of the provisions of this law are scheduled to go into effect in 2025.\nIn the United States, government authorities, elected officials, and political candidates have called for amendments to Section 230 of the Communications Decency Act (the “CDA”) that aim to limit or remove protections afforded to technology companies. Additionally, there are multiple ongoing legal challenges to the CDA in U.S. federal courts, which could further alter its scope and applicability. If these legislative or judicial efforts succeed in weakening the protections afforded by the CDA, we may be required to make changes to our services that could restrict or impose additional costs upon the conduct of our business generally or otherwise expose us to additional liability. Any weakening of the CDA could also result in increased litigation costs, as well as a potentially increased chance of liability. See “Item 1A Risk factors—Risks relating to our business—Inappropriate actions by certain of our users could be attributed to us and damage our brands’ reputations, which in turn could adversely affect our business.”\nOur global businesses are subject to a variety of complex and continuously evolving income and other tax frameworks. For example, sweeping international tax reform known as Pillar Two has gone into effect in certain jurisdictions starting in 2024. The work is being undertaken by the Organization for Economic Cooperation and Development’s (“OECD”) Inclusive Framework and organized by the OECD’s Centre for Tax Policy and Administration. Pillar Two establishes a global minimum corporate tax rate of 15 percent for multinational enterprises with €750 million or more in annual revenue. Multinational enterprises will need to conform to the various rules in every Pillar Two country in which they operate. The Company analyzed the impact of enacted legislation and determined it does not have a material impact to the income tax provision. The Company is continuing to monitor future developments.\nAs a provider of subscription services, we are also subject to laws and regulations in certain U.S. states and other countries that apply to our automatically-renewing subscription payment models. For example, the EU’s Payment Services Directive (PSD2), which became effective in 2018, has impacted our ability to process auto-renewal payments and offer promotional or differentiated pricing for users in the EU. Also, new legislation in \n10\nTable of Contents\nGermany and France has imposed additional obligations on providers of subscription services regarding the automatic renewal and cancellation of online subscriptions. Similar legislation or regulation, or changes to existing laws or regulations governing subscription payments, have been adopted or are being considered in many U.S. states and in the UK.\nThe EU, the U.S. Congress, and many U.S. states are considering, or have already enacted, legislation or regulations that would impact the use of generative artificial intelligence (“AI”) by companies. For example, several states, including Colorado, California, and Utah, have already passed laws prescribing how AI can be used or what permissions must be granted before it can be used, and several more states are considering similar legislation. In addition, the Federal Trade Commission has a compulsory process in nonpublic investigations involving products and services that use or claim to be produced using generative AI or claim to detect its use. Further, the EU is enacting legislation aimed at updating liability rules, providing for specific liability related to generative AI or extending product liability to software and digital services. As we seek to further integrate AI technologies into our services, compliance with existing, new, and changing laws, regulations, and industry standards relating to AI may limit some uses of AI and may impose significant operational costs.\nFinally, certain U.S. states and certain countries in the Middle East and Asia have laws that specifically govern dating services. At the same time, a number of U.S. states, the U.S. Congress, and some other countries such as Brazil are considering legislation that would directly regulate online dating services.\nHuman capital\nOur people are critical to Match Group’s continued success, and we work hard to attract, retain and motivate qualified talent. As of December 31, 2024, we had approximately 2,500 full-time and approximately 10 part-time employees, which represents a 2% year-over-year decrease in employee headcount. We expect our overall headcount to grow modestly in 2025 as we expect to continue to focus on recruiting employees in technical functions such as software and product at growing brands and where critical needs arise, as well as to hire a number of employees and contractors to support our innovation and artificial intelligence initiatives.\nAs of December 31, 2024, approximately 67%, 1%, 13%, and 19% of our employees reside in the North America, Latin America, EMEA, and Asia-Pacific regions, respectively, spanning 21 countries and reflecting various cultures, backgrounds, ages, sexes, gender identities, sexual orientations, and ethnicities. Our global workforce is highly educated, with the majority of our employees working in engineering or technical roles that are central to the technological and service innovations that drive our business. Competition for software engineers and other technical staff has historically been intense, and we expect will remain so for the foreseeable future as we continue to recruit in the most competitive markets.\nWe have four business units supported by a central team. These four business units consist of Tinder, Hinge, Evergreen & Emerging, and Match Group Asia. The employee distributions in each business unit are 25%, 13%, 25%, and 17%, respectively, leaving 20% to support in a centralized capacity. These distributions generally align with the size and complexity of each business unit. \nOur compensation and benefits programs are designed to attract and reward talented individuals who possess the skills necessary to support our business objectives, assist in the achievement of our strategic goals, and create long-term value for our stockholders. In addition to salaries, these programs (which vary by country/region) include annual bonuses, stock-based awards, an employee stock purchase plan, retirement benefits, healthcare and insurance benefits, paid time off, family leave, flexible work schedules, mental health and wellness programs, and employee assistance programs. We are committed to providing competitive and equitable pay. We base our compensation on market data and conduct evaluations of our compensation practices at all levels on a regular basis to determine the competitiveness and fairness of our packages.\nWe are committed to empowering our people with career advancement and learning opportunities. Our talent, learning and development programs provide employees with resources to help achieve their career goals, build strong foundational technical and leadership skills, and contribute to and, where applicable, lead their organizations.\nWe regularly conduct anonymous surveys to seek feedback from our employees on a variety of topics, including but not limited to, confidence in company leadership, competitiveness of our compensation and benefits, career growth opportunities, and ways to improve our company’s position as an employer of choice. \n11\nTable of Contents\nThe results are shared with our employees and reviewed by senior leadership, who analyze areas of progress or opportunity and prioritize actions and activities in response to this feedback to drive meaningful improvements in employee engagement.\nWe believe that our approach to talent has been instrumental in our growth, and has made Match Group a desirable destination for current and future employees.\nAdditional information\nCompany website and public filings.  \nInvestors and others should note that we announce material financial and operational information to our investors using our investor relations website at \nhttps://ir.mtch.com\n, our newsroom website at \nhttps://mtch.com/news\n, Tinder’s newsroom website at \nwww.tinderpressroom.com\n, Hinge’s newsroom website at \nhttps://hinge.co/press\n, Securities and Exchange Commission (“SEC”) filings, press releases, and public conference calls. We use these channels as well as social media to communicate with our users and the public about our company, our services, and other issues. It is possible that the information we post on social media could be deemed to be material information. Accordingly, investors, the media, and others interested in our company should monitor the websites listed above and the social media channels listed on our investor relations website in addition to following our SEC filings, press releases, and public conference calls. Neither the information on our website, nor the information on the website of any Match Group business, is incorporated by reference into this report, or into any other filings with, or into any other information furnished or submitted to, the SEC.\nThe Company makes available, free of charge through its website, its Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K (including related exhibits and amendments) as soon as reasonably practicable after they have been electronically filed with (or furnished to) the SEC.\nCode of ethics.  \nThe Company’s code of ethics applies to all employees (including Match Group’s principal executive officer, principal financial officer, and principal accounting officer) and directors and is posted on the Company’s website at \nhttps://ir.mtch.com\n under the heading of “Corporate Governance.” This code of ethics complies with Item 406 of SEC Regulation S-K and the rules of The Nasdaq Stock Market LLC. Any changes to the code of ethics that affect the provisions required by Item 406 of Regulation S-K, and any waivers of such provisions of the code of ethics for Match Group’s executive officers, senior financial officers, or directors, will also be disclosed on Match Group’s website.\n12\nTable of Contents",
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nKey Terms:\nOperating and financial metrics:\n•\nTinder \nconsists of the world-wide activity of the brand Tinder\n®\n.\n•\nHinge\n consists of the world-wide activity of the brand Hinge\n®\n.\n•\nEvergreen & Emerging (“E&E”)\n consists of the world-wide activity of our Evergreen brands, which include Match®, Meetic®, OkCupid®, Plenty Of Fish®, and a number of demographically focused brands, and our Emerging brands, which include BLK®, Chispa™, The League®, Archer®, Upward®, Yuzu™, and other smaller brands.\n•\nMatch Group Asia (“MG Asia”)\n consists of the world-wide activity of the brands primarily focused on Asia and the Middle East, including Pairs™ and Azar®, which has expanded into Europe and the U.S.\n•\nCorporate and unallocated costs\n includes 1) corporate expenses (such as executive management, investor relations, corporate development, and board of directors and public company listing fees), 2) portions of corporate services (such as legal, human resources, accounting, and tax), and 3) certain centrally managed services and technology that have not been allocated to the individual business segments (such as central trust and safety operations and certain shared software).\n•\nDirect Revenue\n is revenue that is received directly from end users of our services and includes both subscription and à la carte revenue.\n•\nIndirect Revenue\n is revenue that is not received directly from an end user of our services, substantially all of which is advertising revenue.\n•\nPayers\n are unique users at a brand level in a given month from whom we earned Direct Revenue. When presented as a quarter-to-date or year-to-date value, Payers represents the average of the monthly values for the respective period presented. At a consolidated level, and a business unit level to the extent a business unit consists of multiple brands, duplicate Payers may exist when we earn revenue from the same individual at multiple brands in a given month, as we are unable to identify unique individuals across brands in the Match Group portfolio.\n•\nRevenue Per Payer (“RPP”)\n is the average monthly revenue earned from a Payer and is Direct Revenue for a period divided by the Payers in the period, further divided by the number of months in the period.\nOperating costs and expenses:\n•\nCost of revenue \nconsists primarily of the amortization of in-app purchase fees, Variable Expenses (defined below), and employee compensation expense and stock-based compensation expense for personnel engaged in data center and customer care functions.\n•\nSelling and marketing expense \nconsists primarily of cost of acquisition expense, employee compensation expense, and stock-based compensation expense for personnel engaged in selling and marketing, sales support, and public relations functions.\n•\nGeneral and administrative expense \nconsists primarily of employee compensation expense and stock-based compensation expense for personnel engaged in executive management, finance, legal, tax, and human resources, fees for professional services (including transaction-related costs for acquisitions), and facilities costs.\n•\nProduct development expense \nconsists primarily of employee compensation expense and stock-based compensation expense that are not capitalized for personnel engaged in the design, development, testing, and enhancement of product offerings and related technology.\n•\nIn-app purchase fees\n consists of the amortization of in-app purchase fees, which are monies paid to Apple and Google in connection with the processing of in-app purchases of subscriptions and service features through the in-app payment systems provided by Apple and Google.\n34\nTable of Contents\n•\nVariable Expenses\n consists primarily of hosting fees, credit card processing fees, and rent, energy, and bandwidth costs associated with data centers. \n•\nCost of acquisition\n consists primarily of advertising expenditures, including online marketing (fees paid to search engines and social media sites), offline marketing, including television and print advertising, and production of advertising content.\n•\nEmployee compensation expense\n consists primarily of compensation expense (excluding stock-based compensation expense) and other employee-related costs that are not capitalized.\n•\nStock-based compensation expense\n consists principally of expense associated with awards of restricted stock units (“RSUs”), performance-based RSUs, and market-based awards that is not capitalized. These expenses are not paid in cash.\nLong-term debt:\n•\nCredit Facility\n - The revolving credit facility under the credit agreement of MG Holdings II. On March 20, 2024, we entered into an amendment to reduce the borrowing availability under the Credit Facility from $750 million to $500 million and extend the maturity date of the Credit Facility. At December 31, 2024, there was $0.6 million outstanding in letters of credit and $499.4 million of availability under the Credit Facility.\n•\nTerm Loan \n- The term loan facility under the credit agreement of MG Holdings II. At December 31, 2023, the Term Loan bore interest at a term secured overnight financing rate plus an applicable adjustment (“Adjusted Term SOFR”) plus 1.75% and the then applicable rate was 7.27%. As of December 31, 2024, $425 million was outstanding under the Term Loan, which bore interest at 6.22%. On January 21, 2025, we repaid the Term Loan in full utilizing cash on hand.\n•\n5.00% Senior Notes\n - MG Holdings II’s 5.00% Senior Notes due December 15, 2027, with interest payable each June 15 and December 15, which were issued on December 4, 2017. At December 31, 2024, $450 million aggregate principal amount was outstanding.\n•\n4.625% Senior Notes\n - MG Holdings II’s 4.625% Senior Notes due June 1, 2028, with interest payable each June 1 and December 1, which were issued on May 19, 2020. At December 31, 2024, $500 million aggregate principal amount was outstanding.\n•\n5.625% Senior Notes\n - MG Holdings II’s 5.625% Senior Notes due February 15, 2029, with interest payable each February 15 and August 15, which were issued on February 15, 2019. At December 31, 2024, $350 million aggregate principal amount was outstanding.\n•\n4.125% Senior Notes\n - MG Holdings II’s 4.125% Senior Notes due August 1, 2030, with interest payable each February 1 and August 1, which were issued on February 11, 2020. At December 31, 2024, $500 million aggregate principal amount was outstanding.\n•\n3.625% Senior Notes\n - MG Holdings II’s 3.625% Senior Notes due October 1, 2031, with interest payable each April 1 and October 1, which were issued on October 4, 2021. At December 31, 2024, $500 million aggregate principal amount was outstanding.\n•\n2026 Exchangeable Notes\n - The 0.875% Exchangeable Senior Notes due June 15, 2026 issued by Match Group FinanceCo 2, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each June 15 and December 15. At December 31, 2024, $575 million aggregate principal amount was outstanding.\n•\n2030 Exchangeable Notes\n - The 2.00% Exchangeable Senior Notes due January 15, 2030 issued by Match Group FinanceCo 3, Inc., a subsidiary of the Company, which are exchangeable into shares of the Company's common stock. Interest is payable each January 15 and July 15. At December 31, 2024, $575 million aggregate principal amount was outstanding.\nNon-GAAP financial measure:\n•\nAdjusted Operating Income \n- is a Non-GAAP financial measure. See “Non-GAAP Financial Measures” for the definition of Adjusted Operating Income and a reconciliation of operating income to Adjusted Operating Income.\n35\nTable of Contents\nMANAGEMENT OVERVIEW\nMatch Group, Inc., through its portfolio companies, is a leading provider of digital technologies designed to help people make meaningful connections. Our global portfolio of brands includes Tinder\n®\n, Hinge\n®\n, Match\n®\n, Meetic\n®\n, OkCupid\n®\n, Pairs™, Plenty Of Fish\n®\n, Azar\n®\n, BLK®, and more, each built to increase our users’ likelihood of connecting with others. Through our trusted brands, we provide tailored services to meet the varying preferences of our users. Our services are available in over 40 languages to our users all over the world.\nWe manage our portfolio of brands in four business units: Tinder, Hinge, Evergreen and Emerging, and Match Group Asia.\nAs used herein, “Match Group,” the “Company,” “we,” “our,” “us,” and similar terms refer to Match Group, Inc. and its subsidiaries, unless the context indicates otherwise.\nSources of Revenue\nAll of our services provide the use of certain features for free as well as a variety of additional features through a subscription or, for certain features, on a pay-per-use, or à la carte, basis. Our revenue is primarily derived directly from users in the form of recurring subscription fees and à la carte purchases.\nSubscription revenue is presented net of credits and credit card chargebacks. Payers who purchase subscriptions or à la carte features pay in advance, primarily by using a credit card or through mobile app stores, and, subject to certain conditions identified in our terms and conditions, all purchases are final and nonrefundable. Fees collected, or contractually due, in advance for subscriptions are deferred and recognized as revenue using the straight-line method over the term of the applicable subscription period, which primarily ranges from one week to six months, and corresponding in-app purchase fees incurred on such transactions, if any, are deferred and expensed over the same period. Revenue from the purchase of à la carte features is recognized based on usage. We also earn revenue from online advertising, which is recognized each time an ad is displayed.\nTrends affecting our business\nEach brand in our portfolio has the goal of using technology to help people make meaningful connections. While the goal is the same for each brand, the means to achieve that goal can be differentiated by how a specific brand targets their primary demographic. With users of our apps often utilizing multiple apps, our brands can often have overlap on targeted users. The overall trends affecting all brands within our portfolio, include the following:\nIncrease in acceptance and growth of technologies to meet people globally.\n Over the past decade, there has been meaningful growth in the use of technologies to meet people in North America and Western Europe, and we see the potential for similar growth in the rest of the world in the years ahead. As more internet-connected people seeking connections utilize technologies to meet people, we believe there remains potential for accelerating growth in the use of these technologies in certain global markets where adoption lags more developed countries. As a result, new services, entrants to the market, and business models are likely to continue to emerge, sometimes at the expense of our existing brands, by harnessing a new technology, such as generative artificial intelligence (“AI”) or a new or existing distribution channel, creating a new or different approach to connecting people, or some other means.\nIn-App Purchase Fees.\n \nPurchases made by our customers through mobile applications, as opposed to desktop or mobile web, continue to increase, and are required in most cases to be processed through the in-app payment systems provided by Apple and Google, although some of our applications are currently able to use their own payment systems for in-app purchases made on Android devices. Where we are required to use Apple’s or Google’s payment systems, we pay Apple and Google, as applicable, a meaningful share (generally 30% or, for subscriptions purchased on Android devices, 15%) of the revenue we receive from these transactions. Where payments on Android devices are processed through other payment systems, we are also required to pay Google a meaningful share. We have entered into a partnership, which started in the second quarter of 2024 and will continue through the first quarter of 2027, with Google that will provide value exchange across our broad relationship with them, which we expect to help offset the additional costs that some of our brands incurred or expect to incur associated with implementing Google’s User Choice Billing system, which allows application developers to offer an additional billing system alongside Google Play’s billing system. \n36\nTable of Contents\nAdditionally, while Apple was recently ordered to change its rules in the U.S. marketplace on anti-steering to allow for payment processing outside its payment systems, Apple has stated that it will still charge up to 27% for those transactions. We do not expect to realize any meaningful decrease in app store fees in the U.S. market as a result of this change. In the European Union, the Digital Markets Act went into effect in March 2024. Apple’s compliance plan lowers the 30% service fee in the EU to 17% for our applications, but also adds a payment processing fee of 3%, as well as a 0.50 Euro fee per download (including updates) per year. Apple’s plan is subject to approval by the European Commission, which has launched infringement proceedings against Apple and may require further concessions from Apple. For additional information, see “Item 1 Business—Dependencies on services provided by others—App Stores.”\nImplementing new technologies that enhance our user experience.\n We expect new technologies, including those utilizing generative AI, will be needed to continue to drive user engagement. As new technologies develop, we evaluate whether those technologies can be incorporated into our apps to enhance the user experience. In particular, we are working to further integrate AI technologies into our services, such as the recent launch of several AI integration initiatives, including the introduction of AI photo selection features to the Tinder and Hinge services, and an enhanced recommendation system, as well as integrated dating support, to the Hinge service. These integrations, and others that may be launched in the future, may become important to our operations over time. The rapid evolution of AI will require the dedication of significant resources to develop, test, and maintain these technologies. We expect other technologies to evolve and be tested in our services and incorporated into our apps in the future.\nIn addition to the trends affecting our overall portfolio, some of our individual brands are affected by certain other trends, including the following:\nTinder.\n When Tinder was first developed, the smart phone provided a unique way of offering connections that traditional desktop-based services did not offer. Tinder was able to capitalize on the rise in the use of smart phones and with its younger audience was able to achieve considerable scale through word-of-mouth and viral moments on social media without the need to supplement with significant marketing. As the availability of services catering to human connections has increased, we have begun to supplement Tinder’s viral growth with marketing to build out Tinder’s brand narrative and grow the size of its user base, which has resulted in an increase in selling and marketing expenses at Tinder. In the past two years, Tinder has experienced a decline in user growth, with plans to return to growth through product initiatives that focus on the female experience and younger users.\nHinge.\n Hinge has developed a strong user base in English speaking markets and began expanding into European markets in the latter half of 2022. Its strong user growth in English speaking and other European markets has helped to contribute to a high level of revenue growth. As Hinge continues to expand its footprint globally, we intend to continue to focus on adding new features to its service to continue to drive user satisfaction for its target audience of intentioned daters, and to drive additional opportunities for monetization. In the near term, we expect to continue to make investments in the business to support Hinge’s growth, including investments in product development as well as marketing.\nEvergreen & Emerging.\n Our collections of brands within E&E include well-known pioneers in online relationships (which we refer to as Evergreen brands) and newer brands which target specific demographics (which we refer to as Emerging brands). Revenues from the Evergreen brands have declined in recent years, while Emerging brands are in the early stages of growth and in many cases are relying on marketing to increase the size of their user base. We are in the middle of our multi-year process of consolidating technology platforms across various Evergreen and Emerging brands to enable faster new feature releases and to reduce the cost to maintain those platforms.\nMG Asia.\n Our Azar app, which provides one to one video chat, has a strong presence in the Middle East, growth in Europe, and expanded into the U.S. in 2024. Azar leverages AI capabilities to drive user growth and monetization globally. Our Pairs brand is a leader in dating in Japan. Pairs began advertising on television in 2024. We expect the advertising to continue to increase Pairs’ brand recognition while we work to grow users through various product initiatives and by partnering with local governments to improve declining marriage rates in the country. Pairs also has plans to expand into other Asian countries in 2025.\n37\nTable of Contents\nOther trends or factors affecting the comparability of our results\nCost of Acquisition.\n  Our cost of acquisition has consistently been one of our larger operating expenses. How we deploy our advertising spend varies among brands, with the majority of our advertising spend taking place online, including social media sites, streaming services, search engines, and influencers. Additionally, some brands utilize offline and out-of-home marketing campaigns, such as on television and outdoor billboards. For established brands, we seek to optimize for total return on advertising spend by frequently analyzing and adjusting spend to focus on marketing channels and markets that generate returns above our thresholds. Our data-driven approach provides us the flexibility to scale and optimize our advertising spend. We spend advertising dollars against an expected lifetime value of a Payer that is realized over a multi-year period. While this advertising spend is intended to be profitable on that basis, it is nearly always negative during the period in which the expense is incurred. For newer brands that are gaining scale, or existing brands that are expanding into new geographies, we may make incremental advertising investments to establish the brand before optimizing monetization of the brand. Our advertising spend may be incurred unevenly throughout the year.\nInternational markets.\n  Our services are available across the world. Our international revenue represented 54% of our total revenue for both years ended December 31, 2024 and 2023. We vary our pricing to align with local market conditions and our international businesses typically earn revenue in local currencies. As foreign currency exchange rates fluctuate, translation of the statement of operations of our international businesses into U.S. dollars affects year-over-year comparability of operating results.\n2024 Consolidated Results\nIn 2024, total revenue grew 3%, operating income decreased 10%, and Adjusted Operating Income was flat year-over-year. Revenue growth was primarily due to growth at Hinge, and to a lesser extent Tinder, offset by declines at E&E and MG Asia. Operating income and Adjusted Operating Income were positively affected by the increase in revenue. Operating income declined due to increases in non-cash compensation, impairments of certain intangible assets, and depreciation.\n38\nTable of Contents\nResults of Operations for the years ended December 31, 2024, 2023 and 2022\nThe following discussion should be read in conjunction with “Item 8. Consolidated Financial Statements and Supplementary Data.” \nRevenue\nYears Ended December 31,\n2024\nChange\n% Change\n2023\nChange\n% Change\n2022\n(Amounts in thousands, except RPP)\nDirect Revenue\nTinder\n$\n1,940,619 \n$\n22,990 \n1%\n$\n1,917,629 \n$\n123,162 \n7%\n$\n1,794,467 \nHinge\n550,435 \n153,950 \n39%\n396,485 \n112,817 \n40%\n283,668 \nEvergreen & Emerging\n642,988 \n(48,438)\n(7)%\n691,426 \n(38,946)\n(5)%\n730,372 \nMG Asia\n283,936 \n(18,655)\n(6)%\n302,591 \n(19,123)\n(6)%\n321,714 \nTotal Direct Revenue\n$\n3,417,978 \n$\n109,847 \n3%\n$\n3,308,131 \n$\n177,910 \n6%\n$\n3,130,221 \nIndirect Revenue\n61,395 \n5,022 \n9%\n56,373 \n(2,249)\n(4)%\n58,622 \nTotal Revenue\n$\n3,479,373 \n$\n114,869 \n3%\n$\n3,364,504 \n$\n175,661 \n6%\n$\n3,188,843 \nPayers:\nTinder\n9,696 \n(679)\n(7)%\n10,375 \n(502)\n(5)%\n10,877 \nHinge\n1,532 \n290 \n23%\n1,242 \n262 \n27%\n980 \nEvergreen & Emerging\n2,666 \n(400)\n(13)%\n3,066 \n(421)\n(12)%\n3,487 \nMG Asia\n1,004 \n85 \n9%\n919 \n(73)\n(7)%\n992 \nTotal\n14,898 \n(704)\n(5)%\n15,602 \n(734)\n(4)%\n16,336 \n(Change calculated using non-rounded numbers)\nRPP:\nTinder\n$\n16.68 \n$\n1.28 \n8%\n$\n15.40 \n$\n1.65 \n12%\n$\n13.75 \nHinge\n$\n29.94 \n$\n3.33 \n13%\n$\n26.61 \n$\n2.50 \n10%\n$\n24.11 \nEvergreen & Emerging\n$\n20.10 \n$\n1.31 \n7%\n$\n18.79 \n$\n1.33 \n8%\n$\n17.46 \nMG Asia\n$\n23.56 \n$\n(3.94)\n(14)%\n$\n27.50 \n$\n0.46 \n2%\n$\n27.04 \nTotal\n$\n19.12 \n$\n1.45 \n8%\n$\n17.67 \n$\n1.70 \n11%\n$\n15.97 \nFor the year ended December 31, 2024 compared to the year ended December 31, 2023 \nTinder Direct Revenue grew $23.0 million, or 1%, in 2024 versus 2023. Revenue growth was negatively impacted by the strength of the U.S. dollar compared to the Argentine Peso, Turkish Lira, and Japanese Yen, primarily. On a consistent foreign exchange rate basis, the growth was $68.6 million or 4%. Increased Direct Revenue was driven by an increase in RPP of 8% due to subscription pricing optimization, partially offset by decreases in á la carte revenue. The increase in RPP was partially offset by a 7% decrease in Payers.\nHinge Direct Revenue grew $154.0 million, or 39%, in 2024 versus 2023. Revenue growth was driven by both growth in the U.S. market as well as continued expansion efforts in certain European markets. Payers increased 23% compared to 2023. Additionally, RPP increased 13% over 2023 primarily due to pricing optimizations and increased spend on á la carte features.\nE&E Direct Revenue declined 7% in 2024 versus 2023. Within E&E, Evergreen brands declined 12%, while Emerging brands grew 17%. The overall decline at E&E was driven by a decline in Payers of 13% compared to 2023, partially offset by increased RPP of 7%. Our decision to terminate certain live streaming services in the second half of 2024 also contributed to the revenue decline compared to 2023.\nMG Asia Direct Revenue declined $18.7 million, or 6%, in 2024 versus 2023. Excluding revenue from Hakuna, which was shut down in the third quarter of 2024, MG Asia revenue declined $7.7 million or 3%. Revenue growth was also negatively impacted by the strength of the U.S. dollar compared to the Turkish Lira and Japanese Yen, primarily. On a consistent foreign exchange basis, Direct Revenue grew $7.5 million, or 2%, year-over-year as a result of Payer growth at Azar partially offset by modest Payer declines at Pairs.\n39\nTable of Contents\nIndirect Revenue increased $5.0 million primarily due to higher ad impressions as well as higher rates per ad impression compared to 2023.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nTinder Direct Revenue grew 7% in 2023 versus 2022, driven by growth in RPP due to pricing optimizations in the U.S. market and new weekly subscription offerings, partially offset by a decrease in Payers partially attributable to the pricing optimizations.\nHinge Direct Revenue grew 40% in 2023 versus 2022, driven by 27% growth in Payers and 10% growth in RPP. The Payer growth at Hinge was across geographies, but in particular in the Americas and Europe, which was a focus of international expansion in 2023 for Hinge. RPP increased as a result of pricing optimizations in the U.S.\nE&E Direct Revenue declined 5% in 2023 versus 2022, as we continued to moderate marketing spend at our Evergreen brands. The decline at our Evergreen brands was partially offset by growth at our Emerging brands.\nMG Asia Direct Revenue declined 6% in 2023 versus 2022, driven by declines at Hakuna and Pairs, partially offset by growth at Azar.\nIndirect Revenue decreased $2.2 million primarily due to a lower rate per ad impression compared to the prior year, partially offset by higher ad impressions.\nCost of revenue (exclusive of depreciation)\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nCost of revenue\n$\n991,273 \n$\n37,259 \n4%\n$\n954,014 \n$\n(5,949)\n(1)%\n$\n959,963 \nPercentage of revenue\n28%\n28%\n30%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nCost of revenue increased 4% primarily due to an increase in in-app purchase fees of $49.9 million primarily at Hinge as revenue increased and as a result of escrow payments returned in the prior year associated with the Google litigation, which are included in Corporate and Unallocated costs. The increase in in-app purchase fees was partially offset by a decrease in Variable Expenses of $13.9 million primarily at E&E and MG Asia as a result of the termination of certain of our live streaming services and the Hakuna app in 2024. Total in-app purchase fees were $696.6 million in 2024.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nCost of revenue decreased 1% primarily due to a decrease in Variable Expenses of $20.9 million, primarily related to costs associated with our live streaming services within MG Asia, and a decrease in employee compensation expense of $6.4 million, primarily within Corporate and Unallocated costs and Tinder. The decreases in Variable Expenses and employee compensation expense were partially offset by an increase in in-app purchase fees of $24.2 million, primarily at Tinder and Hinge, partially offset by the benefit from the escrow payments returned in 2023 associated with the Google litigation, which are included in Corporate and Unallocated costs. Total in-app purchase fees were $646.7 million and $622.5 million in 2023 and 2022, respectively.\n40\nTable of Contents\nSelling and marketing expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nSelling and marketing expense\n$\n622,100 \n$\n35,838 \n6%\n$\n586,262 \n$\n51,745 \n10%\n$\n534,517 \nPercentage of revenue\n18%\n17%\n17%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nSelling and marketing expense increased primarily due to higher cost of acquisition expense of $27.2 million primarily at Hinge and Tinder, partially offset by decreases at E&E and MG Asia.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nSelling and marketing expense increased primarily due to higher cost of acquisition expense of $44.7 million primarily at Tinder and Hinge, partially offset by decreases at E&E and MG Asia.\nGeneral and administrative expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nGeneral and administrative expense\n$\n438,839 \n$\n25,230 \n6%\n$\n413,609 \n$\n(22,259)\n(5)%\n$\n435,868 \nPercentage of revenue\n13%\n12%\n14%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nGeneral and administrative expense increased primarily due to an increase in digital sales taxes of $11.1 million, the majority of which relates to Canada’s implementation of a digital sales tax in June 2024 retroactive to 2022. Additionally, employee compensation expense increased $8.3 million and stock-based compensation expense increased $5.0 million across all segments and within Corporate and Unallocated costs.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nGeneral and administrative expense declined primarily due to a decrease in legal and other professional fees of $25.5 million within Corporate and Unallocated costs and a decrease in stock-based compensation expense of $7.6 million due to forfeitures of equity awards and modification of certain stock-based awards in the prior year, partially offset by an increase in employee compensation expense of $15.7 million, primarily within Corporate and Unallocated costs.\nProduct development expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nProduct development expense\n$\n442,175 \n$\n57,990 \n15%\n$\n384,185 \n$\n50,546 \n15%\n$\n333,639 \nPercentage of revenue\n13%\n11%\n10%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nProduct development expense increased primarily due to increases in employee compensation expense of $24.5 million and stock-based compensation expense of $26.3 million, both due to increased headcount at Hinge and Tinder, partially offset by a decrease at E&E.\n41\nTable of Contents\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nProduct development expense increased primarily due to increases in employee compensation expense of $18.3 million and stock-based compensation expense of $33.7 million, both due to increased headcount at both Hinge and Tinder.\nDepreciation\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nDepreciation \n$\n87,499 \n$\n25,692 \n42%\n$\n61,807 \n$\n18,213 \n42%\n$\n43,594 \nPercentage of revenue\n3%\n2%\n1%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nDepreciation was higher in 2024 as compared to 2023 primarily due to internally developed software at Tinder, MG Asia, and E&E.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nDepreciation was higher in 2023 as compared to 2022 primarily due to an increase in internally developed software placed in service at Tinder and MG Asia.\nImpairments and amortization of intangibles\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nImpairments and amortization of intangibles\n$\n74,175 \n$\n26,444 \n55%\n$\n47,731 \n$\n(318,526)\n(87)%\n$\n366,257 \nPercentage of revenue\n2%\n1%\n11%\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nImpairments and amortization of intangibles increased primarily due to impairments of intangible assets of $30.6 million at E&E and MG Asia as a result of the termination of certain of our live streaming services and our Hakuna app in 2024.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nImpairments and amortization of intangibles decreased primarily due to impairments of both indefinite-lived intangible assets and definite-lived intangible assets in the prior period primarily at MG Asia.\n42\nTable of Contents\nOperating Income and Adjusted Operating Income\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nOperating income (loss):\nTinder\n$\n889,222 \n$\n(66,297)\n(7)%\n$\n955,519 \n$\n(951)\n—%\n$\n956,470 \nHinge\n121,482 \n47,221 \n64%\n74,261 \n(4,462)\n(6)%\n78,723 \nEvergreen & Emerging\n66,088 \n(16,372)\n(20)%\n82,460 \n46,581 \n130%\n35,879 \nMG Asia\n(32,345)\n(23,670)\n273%\n(8,675)\n303,352 \n(97)%\n(312,027)\nCorporate and unallocated costs\n(221,135)\n(34,466)\n18%\n(186,669)\n57,371 \n(24)%\n(244,040)\nOperating income\n$\n823,312 \n$\n(93,584)\n(10)%\n$\n916,896 \n$\n401,891 \n78%\n$\n515,005 \nAdjusted Operating Income (Loss):\nTinder\n$\n1,017,023 \n$\n(32,337)\n(3)%\n$\n1,049,360 \n$\n21,477 \n2%\n$\n1,027,883 \nHinge\n166,478 \n58,832 \n55%\n107,646 \n16,498 \n18%\n91,148 \nEvergreen & Emerging\n170,418 \n6,622 \n4%\n163,796 \n4,079 \n3%\n159,717 \nMG Asia\n60,806 \n(984)\n(2)%\n61,790 \n27,358 \n79%\n34,432 \nCorporate and unallocated costs\n(162,358)\n(38,299)\n31%\n(124,059)\n60,385 \n(33)%\n(184,444)\nAdjusted Operating Income\n$\n1,252,367 \n$\n(6,166)\n—%\n$\n1,258,533 \n$\n129,797 \n11%\n$\n1,128,736 \nFor a reconciliation of operating income to Adjusted Operating Income, see “Non-GAAP Financial Measures.”\nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nOperating income decreased 10% or $93.6 million, and Adjusted Operating Income was relatively flat compared to 2023. Operating income and Adjusted Operated Income each benefited from the increase in revenue of $114.9 million, which was driven by growth at Hinge, offset by increased (i) cost of revenue, primarily due to increased in-app purchase fees as revenue at Hinge increased and as a result of returned escrow payments associated with the Google litigation in the prior year, (ii) selling and marketing expense, primarily due to increased cost of acquisition expense, (iii) general and administrative expense, primarily due to increased digital sales taxes, and (iv) product development expense, primarily due to increased employee compensation expense. Operating income was further impacted by increased (i) stock-based compensation expense of $35.3 million, primarily due to increased headcount within product development at Tinder and Hinge, (ii) impairments and amortization of intangible assets of $26.4 million, primarily related to impairments at MG Asia and E&E in 2024, and (iii) depreciation of $25.7 million, primarily related to internally developed software at Tinder, MG Asia, and E&E.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\nOperating income increased 78% or $401.9 million, and Adjusted Operating Income increased 11% or $129.8 million. Operating income and Adjusted Operated Income each benefited from the increase in revenue of $175.7 million which was driven by growth at Tinder and Hinge, and lower general and administrative expense primarily related to decreases in legal and other professional fees. That benefit was partially offset by increases in selling and marketing spend and an increase in product development expense primarily due to increased compensation expense. Operating income further benefited from decreases in impairments of intangible assets of $316.1 million, partially offset by increased stock-based compensation expense primarily due to new stock-based awards granted during the year.\n43\nTable of Contents\nAt December 31, 2024, there was $359.8 million of unrecognized compensation cost, net of estimated forfeitures, related to all stock-based awards, which is expected to be recognized over a weighted average period of approximately 1.8 years.\nInterest expense\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nInterest expense\n$\n160,071 \n$\n184 \n—%\n$\n159,887 \n$\n14,340 \n10%\n$\n145,547 \nFor the year ended December 31, 2024 compared to the year ended December 31, 2023\nInterest expense remained relatively flat as compared to the prior year.\nFor the year ended December 31, 2023 compared to the year ended December 31, 2022\n Interest expense increased primarily due to a higher interest rate on the Term Loan in 2023 as compared to the prior year.\nOther income, net \nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nInterest income\n$\n41,105 \n$\n14,333 \n54%\n$\n26,772 \n$\n22,404 \n513%\n$\n4,368 \nForeign currency losses\n(579)\n7,340 \n(93)%\n(7,919)\n(5,947)\n302%\n(1,972)\nOther\n289 \n(630)\n(69)%\n919 \n(4,718)\n(84)%\n5,637 \nOther income, net\n$\n40,815 \n$\n21,043 \n106%\n$\n19,772 \n$\n11,739 \n146%\n$\n8,033 \nIncome tax provision\nYears Ended December 31,\n2024\n$ Change\n% Change\n2023\n$ Change\n% Change\n2022\n(Dollars in thousands)\nIncome tax provision\n$\n152,743 \n$\n27,434 \n22%\n$\n125,309 \n$\n109,948 \nNM\n$\n15,361 \nEffective income tax rate\n22%\n16%\n4%\n______________________\nNM = Not Meaningful\nFor discussion of income taxes, see “Note 3—Income Taxes” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.”\nFor the year ended December 31, 2024, the Company recorded an income tax provision from continuing operations of $152.7 million at an effective tax rate of 22%, which is higher than the statutory rate primarily due to state income taxes and nondeductible stock-based compensation, partially offset by a lower tax rate on U.S. income derived from foreign sources and research credits.\nFor the year ended December 31, 2023, the Company recorded an income tax provision from continuing operations of $125.3 million at an effective tax rate of 16%, which is lower than the statutory rate primarily due to (i) a release of a valuation allowance associated with U.S. foreign tax credits that we now expect to utilize, (ii) a lower tax rate on U.S. income derived from foreign sources, and (iii) the generation of federal and state research credits. These benefits were partially offset by state income taxes and nondeductible stock-based compensation.\n44\nTable of Contents\nFor the year ended December 31, 2022, the Company recorded an income tax provision from continuing operations of $15.4 million at an effective tax rate of 4%, which is lower than the statutory rate primarily due to (i) excess tax benefits generated by the exercise and vesting of stock-based awards, (ii) a release of a valuation allowance on certain foreign deferred tax assets that we expect to utilize, (iii) favorable outcomes of tax audits and (iv) a lower tax rate on U.S. income derived from foreign sources. The benefits were partially offset by higher state income taxes due to higher taxable income in the U.S.\nA number of countries have enacted or are actively drafting legislation to implement the Organization for Economic Cooperation and Development's (\"OECD\") international tax framework, including the Pillar II minimum tax regime. The Company analyzed the impact of enacted legislation and determined it does not have a material impact to the income tax provision. The Company is continuing to monitor future developments.\n45\nTable of Contents\nNON-GAAP FINANCIAL MEASURES\nMatch Group reports Adjusted Operating Income and Revenue excluding foreign exchange effects, both of which are supplemental measures to U.S. generally accepted accounting principles (“GAAP”). Adjusted Operating Income is among the primary metrics by which we evaluate the performance of our business, on which our internal budget is based, and by which management is compensated. Revenue excluding foreign exchange effects provides a comparable framework for assessing how our business performed without the effect of exchange rate differences when compared to prior periods. We believe that investors should have access to the same set of tools that we use in analyzing our results. These non-GAAP measures should be considered in addition to results prepared in accordance with GAAP, but should not be considered a substitute for or superior to GAAP results. Match Group endeavors to compensate for the limitations of the non-GAAP measures presented by providing the comparable GAAP measures with equal or greater prominence and descriptions of the reconciling items, including quantifying such items, to derive the non-GAAP measures. We encourage investors to examine the reconciling adjustments between the GAAP and non-GAAP measures, which we discuss below.\nAdjusted Operating Income\nAdjusted Operating Income \nis defined as operating income excluding: (1) stock-based compensation expense; (2) depreciation; and (3) acquisition-related items consisting of (i) amortization of intangible assets and impairments of goodwill and intangible assets, if applicable, and (ii) gains and losses recognized on changes in the fair value of contingent consideration arrangements, as applicable. We believe this measure is useful to analysts and investors as this measure allows a more meaningful comparison between our performance and that of our competitors. The above items are excluded from our Adjusted Operating Income measure because they are non-cash in nature. Adjusted Operating Income has certain limitations because it excludes the impact of certain expenses.\nNon-Cash Expenses That Are Excluded From Adjusted Operating Income\nStock-based compensation expense\n consists principally of expense associated with the grants of restricted stock units (“RSUs”), performance-based RSUs, and market-based awards. These expenses are not paid in cash, and we include the related shares in our fully diluted shares outstanding using the treasury stock method; however, performance-based RSUs and market-based awards are included only to the extent the applicable performance or market condition(s) have been met (assuming the end of the reporting period is the end of the contingency period). To the extent stock-based awards are settled on a net basis, we remit the required tax-withholding amounts from current funds.\nDepreciation \nis a non-cash expense relating to our property and equipment and is computed using the straight-line method to allocate the cost of depreciable assets to operations over their estimated useful lives, or, in the case of leasehold improvements, the lease term, if shorter.\nAmortization of intangible assets and impairments of goodwill and intangible assets \nare non-cash expenses related primarily to acquisitions. At the time of an acquisition, the identifiable definite-lived intangible assets of the acquired company, such as customer lists, trade names, and technology, are valued and amortized over their estimated lives. Value is also assigned to (i) acquired indefinite-lived intangible assets, which consist of trade names and trademarks, and (ii) goodwill, which are not subject to amortization. An impairment is recorded when the carrying value of an intangible asset or goodwill exceeds its fair value. We believe that intangible assets represent costs incurred by the acquired company to build value prior to acquisition and the related amortization and impairment charges of intangible assets or goodwill, if applicable, are not ongoing costs of doing business.\n46\nTable of Contents\nThe following table reconciles operating income (loss) to Adjusted Operating Income (Loss) for the Company’s reportable segments and at a consolidated level:\nYear Ended December 31, 2024\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nImpairments and Amortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n889,222 \n$\n90,141 \n$\n37,660 \n$\n— \n$\n1,017,023 \nHinge\n121,482 \n42,673 \n2,323 \n— \n166,478 \nEvergreen & Emerging\n66,088 \n54,922 \n21,732 \n27,676 \n170,418 \nMG Asia\n(32,345)\n25,818 \n20,834 \n46,499 \n60,806 \nCorporate and unallocated costs\n(221,135)\n53,827 \n4,950 \n— \n(162,358)\nTotal\n$\n823,312 \n$\n267,381 \n$\n87,499 \n$\n74,175 \n$\n1,252,367 \nYear Ended December 31, 2023\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nAmortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n955,519 \n$\n68,644 \n$\n25,197 \n$\n— \n$\n1,049,360 \nHinge\n74,261 \n31,459 \n1,926 \n— \n107,646 \nEvergreen & Emerging\n82,460 \n50,268 \n18,732 \n12,336 \n163,796 \nMG Asia\n(8,675)\n23,399 \n11,671 \n35,395 \n61,790 \nCorporate and unallocated costs\n(186,669)\n58,329 \n4,281 \n— \n(124,059)\nTotal\n$\n916,896 \n$\n232,099 \n$\n61,807 \n$\n47,731 \n$\n1,258,533 \nYear Ended December 31, 2022\nOperating Income (Loss)\nStock-based Compensation\nDepreciation\nImpairments and Amortization of Intangibles\nAdjusted Operating Income (Loss)\n(In thousands)\nTinder\n$\n956,470 \n$\n56,085 \n$\n15,328 \n$\n— \n$\n1,027,883 \nHinge\n78,723 \n10,794 \n1,631 \n— \n91,148 \nEvergreen & Emerging\n35,879 \n52,498 \n17,971 \n53,369 \n159,717 \nMG Asia\n(312,027)\n28,294 \n5,277 \n312,888 \n34,432 \nCorporate and unallocated costs\n(244,040)\n56,209 \n3,387 \n— \n(184,444)\nTotal\n$\n515,005 \n$\n203,880 \n$\n43,594 \n$\n366,257 \n$\n1,128,736 \n47\nTable of Contents\nEffects of Changes in Foreign Exchange Rates on Revenue\nThe impact of foreign exchange rates on the Company, due to its global reach, may be an important factor in understanding period over period comparisons if movement in exchange rates is significant. Since our results are reported in U.S. dollars, international revenue is favorably impacted as the U.S. dollar weakens relative to other currencies, and unfavorably impacted as the U.S. dollar strengthens relative to other currencies. We believe the presentation of revenue excluding the effects from foreign exchange, in addition to reported revenue, helps improve investors’ ability to understand the Company’s performance because it excludes the impact of foreign currency volatility that is not indicative of Match Group’s core operating results.\nRevenue excluding foreign exchange effects compares results between periods as if exchange rates had remained constant period over period. Revenue excluding foreign exchange effects is calculated by translating current period revenue using prior period exchange rates. The percentage change in revenue excluding foreign exchange effects is calculated by determining the change in current period revenue over prior period revenue where current period revenue is translated using prior period exchange rates.\nThe following tables present the impact of foreign exchange effects on total revenue and Direct Revenue by segment for the year ended December 31, 2024 compared to the year ended December 31, 2023:\n \nYears ended December 31,\n \n2024\n$ Change\n% Change\n2023\n \n(Dollars in thousands)\nTotal Revenue, as reported\n$\n3,479,373 \n$\n114,869 \n3%\n$\n3,364,504 \nForeign exchange effects\n73,769 \nTotal Revenue excluding foreign exchange effects\n$\n3,553,142 \n$\n188,638 \n6%\n$\n3,364,504 \nTinder Direct Revenue, as reported\n$\n1,940,619 \n$\n22,990 \n1%\n$\n1,917,629 \nForeign exchange effects\n45,564 \nTinder Direct Revenue, excluding foreign exchange effects\n$\n1,986,183 \n$\n68,554 \n4%\n$\n1,917,629 \nHinge Direct Revenue, as reported\n$\n550,435 \n$\n153,950 \n39%\n$\n396,485 \nForeign exchange effects\n(371)\nHinge Direct Revenue, excluding foreign exchange effects\n$\n550,064 \n$\n153,579 \n39%\n$\n396,485 \nE&E Direct Revenue, as reported\n$\n642,988 \n$\n(48,438)\n(7)%\n$\n691,426 \nForeign exchange effects\n1,462 \nE&E Direct Revenue, excluding foreign exchange effects\n$\n644,450 \n$\n(46,976)\n(7)%\n$\n691,426 \nMG Asia Direct Revenue, as reported\n$\n283,936 \n$\n(18,655)\n(6)%\n$\n302,591 \nForeign exchange effects\n26,163 \nMG Asia Direct Revenue, excluding foreign exchange effects\n$\n310,099 \n$\n7,508 \n2%\n$\n302,591 \n48\nTable of Contents\nFINANCIAL POSITION, LIQUIDITY AND CAPITAL RESOURCES\nFinancial Position\nDecember 31, 2024\nDecember 31, 2023\n(In thousands)\nCash and cash equivalents:\nUnited States\n$\n705,967 \n$\n647,177 \nAll other countries\n260,026 \n215,263 \nTotal cash and cash equivalents\n965,993 \n862,440 \nShort-term investments\n4,734 \n6,200 \nTotal cash and cash equivalents and short-term investments\n$\n970,727 \n$\n868,640 \nLong-term debt, net:\nCredit Facility due March 20, 2029\n(a)\n$\n— \n$\n— \nTerm Loan due February 13, 2027\n425,000 \n425,000 \n5.00% Senior Notes due December 15, 2027\n450,000 \n450,000 \n4.625% Senior Notes due June 1, 2028\n500,000 \n500,000 \n5.625% Senior Notes due February 15, 2029\n350,000 \n350,000 \n4.125% Senior Notes due August 1, 2030\n500,000 \n500,000 \n3.625% Senior Notes due October 1, 2031\n500,000 \n500,000 \n2026 Exchangeable Notes due June 15, 2026\n575,000 \n575,000 \n2030 Exchangeable Notes due January 15, 2030\n575,000 \n575,000 \n     Total long-term debt\n3,875,000 \n3,875,000 \n     Less: Unamortized original issue discount\n2,554 \n3,479 \n     Less: Unamortized debt issuance costs\n23,463 \n29,279 \nTotal long-term debt, net\n$\n3,848,983 \n$\n3,842,242 \n______________________\n(a)\nThe maturity date of the Credit Facility is the earlier of (x) March 20, 2029 and (y) the date that is 91 days prior to the maturity date of the Term Loan or the existing senior notes due 2027, 2028, or 2029, or any new indebtedness used to refinance the Term Loan or such senior notes that matures prior to the date that is 91 days after March 20, 2029, in each case if and only if at least $250 million in aggregate principal amount of such debt is outstanding on such date.\nLong-term Debt\nFor a detailed description of long-term debt, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8. Consolidated Financial Statements and Supplementary Data.”\n49\nTable of Contents\nCash Flow Information\nIn summary, the Company’s cash flows from continuing operations are as follows:\nYears ended December 31,\n2024\n2023\n2022\n(In thousands)\nNet cash provided by operating activities attributable to continuing operations\n$\n932,719 \n$\n896,791 \n$\n525,688 \nNet cash used in investing activities attributable to continuing operations\n(58,538)\n(76,581)\n(71,702)\nNet cash used in financing activities attributable to continuing operations\n(758,304)\n(534,068)\n(689,173)\n2024\nNet cash provided by operating activities attributable to continuing operations in 2024 includes adjustments to earnings consisting primarily of $267.4 million of stock-based compensation expense; $87.5 million of depreciation; $74.2 million of impairments and amortization of intangibles; deferred income taxes of $15.0 million; and other adjustments of $2.0 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of a decrease in deferred revenue of $43.1 million as weekly subscriptions have increased and an increase in accounts receivable of $29.8 million primarily related to the timing of receipts and an increase in revenue from app stores. These decreases in cash were partially offset by an increase from other assets of $25.3 million, primarily related to amortization of certain assets, and an increase in income taxes payable of $22.2 million due to the timing of tax payments.\nNet cash used in investing activities attributable to continuing operations in 2024 consists primarily of capital expenditures of $50.6 million that are primarily related to internal development of software and purchases of computer hardware.\nNet cash used in financing activities attributable to continuing operations in 2024 is primarily due to purchases of treasury stock of $752.7 million and payments of $11.4 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $13.6 million of proceeds from the issuance of common stock pursuant to stock-based awards.\n2023\nNet cash provided by operating activities attributable to continuing operations in 2023 includes adjustments to earnings consisting primarily of $232.1 million of stock-based compensation expense; $61.8 million of depreciation; $47.7 million of impairments and amortization of intangibles; deferred income taxes of $26.6 million; and other adjustments of $9.9 million, which includes amortization of deferred financing costs of $6.5 million. The decrease in cash from changes in working capital primarily consists of an increase in accounts receivable of $107.4 million primarily related to the timing of receipts and an increase in revenue from app stores, and a decrease in deferred revenue of $41.2 million as weekly subscriptions have increased. These decreases in cash were partially offset by an increase from other assets of $25.1 million.\nNet cash used in investing activities attributable to continuing operations in 2023 consists primarily of capital expenditures of $67.4 million that are primarily related to internal development of software and computer hardware to support our services.\nNet cash used in financing activities attributable to continuing operations in 2023 is primarily due to purchases of treasury stock of $546.2 million and payments of $5.9 million of withholding taxes paid on behalf of employees for net-settled stock-based awards. These uses of cash were partially offset by $19.9 million of proceeds from the issuance of common stock pursuant to stock-based awards.\n2022\nNet cash provided by operating activities attributable to continuing operations in 2022 includes adjustments to earnings consisting primarily of $366.3 million of impairments and amortization of intangibles; $203.9 million of stock-based compensation expense; $43.6 million of depreciation; and other adjustments of $7.0 million, which includes amortization of deferred financing costs of $6.7 million. Partially offsetting these \n50\nTable of Contents\nadjustments was a deferred income tax benefit of $30.0 million. The decrease in cash from changes in working capital primarily consists of a decrease in accounts payable and other liabilities of $472.6 million due mainly to the settlement payment for \nRad, et al. v. IAC/InterActiveCorp, et al. \nand related arbitrations, and timing of other payments; an increase in accounts receivable of $6.7 million primarily related to increased revenue from mobile applications; and a decrease in deferred revenue of $6.5 million. These uses of cash were partially offset by an increase from other assets of $59.6 million primarily due to the amortization of prepaid hosting services.\nNet cash used in investing activities attributable to continuing operations in 2022 consists primarily of capital expenditures of $49.1 million that are primarily related to internal development of software and computer hardware to support our services, and cash used in an acquisition, net of cash acquired, of $25.7 million.\nNet cash used in financing activities attributable to continuing operations in 2022 is primarily due to purchases of treasury stock of $482.0 million, payments of $176.3 million to settle the outstanding 2022 Exchangeable Notes, payments of $109.3 million of withholding taxes paid on behalf of employees for net-settled stock-based awards, purchases of non-controlling interests for $10.6 million, and payments of $7.5 million to settle outstanding warrants associated with the 2022 Exchangeable Notes. These uses of cash were partially offset by proceeds of $75.9 million related to the settlement of certain note hedges associated with the 2022 Exchangeable Notes, and $20.5 million of proceeds from the issuance of common stock pursuant to stock-based awards.\nLiquidity and Capital Resources\nThe Company’s principal sources of liquidity are its cash and cash equivalents as well as cash flows generated from operations. At December 31, 2024, $499.4 million was available under the Credit Facility.\nThe Company has various obligations related to long-term debt instruments and operating leases. For additional information on long-term debt, including maturity dates and interest rates, see “Note 7—Long-term Debt, net” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” For additional information on the operating leases, including a schedule of obligations by year, see “Note 13—Leases” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.” The Company believes it has sufficient cash flows from operations to satisfy these future obligations.\nOn January 21, 2025, the Company repaid the Term Loan in full utilizing cash on hand.\nThe Company anticipates that it will need to make capital and other expenditures in connection with the development and expansion of its operations. The Company expects that 2025 cash capital expenditures will be between $45 million and $50 million, flat to 2024 cash capital expenditures.\nWe have entered into various purchase commitments, primarily consisting of web hosting services that are currently committed through January 2028. Our obligations under these various purchase commitments, which were impacted by usage rates in 2024, are $68.6 million for 2025, $8.7 million for 2026, $9.8 million for 2027, and $9.0 million for 2028.\nThe Company does not have any off-balance sheet arrangements at December 31, 2024, other than those described above.\nIn January 2024, the Board of Directors of the Company approved a share repurchase program of up to $1.0 billion in aggregate value of shares of Match Group stock (the “January Share Repurchase Program”). On December 10, 2024, the Board of Directors authorized a new repurchase program of up to $1.5 billion in aggregate value of shares of Match Group common stock (the “December Share Repurchase Program”). The December Share Repurchase Program will take effect when the January Share Repurchase Program, of which $247 million in aggregate value of shares of Match Group common stock remains available as of December 31, 2024, is exhausted. Under both the January and December Share Repurchase Programs, shares of our common stock may be purchased on a discretionary basis from time to time, subject to general business and market conditions and other investment opportunities, through open market purchases, privately negotiated transactions or other means, including through Rule 10b5-1 trading plans. Both the January and December Share Repurchase Programs may be commenced, suspended or discontinued at any time. During the year ended \n51\nTable of Contents\nDecember 31, 2024, we repurchased 22.2 million shares for $752.7 million under the January Share Repurchase Program.\nBeginning mid-January 2025, the Company settles substantially all equity awards on a net basis. Assuming all equity awards outstanding on January 31, 2025 were net settled at the closing price on that date, we would issue 8.5 million shares of common stock (of which 0.6 million are related to vested awards and 7.9 million are related to unvested awards) and, assuming a 50% withholding rate, would remit $302.5 million in cash for withholding taxes (of which $20.7 million is related to vested awards and $281.8 million is related to unvested awards). If we did not settle awards on a net basis and instead issued a sufficient number of shares to cover the $302.5 million employee withholding tax obligation, 8.5 million additional shares would be issued by the Company.\nAt December 31, 2024, most of the Company’s international cash can be repatriated without significant tax consequences.\nOur indebtedness could limit our ability to: (i) obtain additional financing to fund working capital needs, acquisitions, capital expenditures, debt service, or other requirements; and (ii) use operating cash flow to pursue acquisitions or invest in other areas, such as developing properties and exploiting business opportunities. The Company may need to raise additional capital through future debt or equity financing to make additional acquisitions and investments or to provide for greater financial flexibility. Additional financing may not be available on terms favorable to the Company or at all.\n52\nTable of Contents\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe following disclosure is provided to supplement the descriptions of Match Group’s accounting policies contained in “Note 2—Summary of Significant Accounting Policies” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data” in regard to significant areas of judgment. Management of the Company is required to make certain estimates, judgments and assumptions during the preparation of its consolidated financial statements in accordance with GAAP. These estimates, judgments and assumptions impact the reported amount of assets, liabilities, revenue and expenses and the related disclosure of contingent assets and liabilities. Actual results could differ from these estimates. Because of the size of the financial statement elements to which they relate, some of our accounting policies and estimates have a more significant impact on our consolidated financial statements than others. What follows is a discussion of some of our more significant accounting policies and estimates.\nBusiness Combinations\nAcquisitions have historically been an important part of our growth strategy. The purchase price of each acquisition is attributed to the assets acquired and liabilities assumed based on their fair values at the date of acquisition, including identifiable intangible assets that either arise from a contractual or legal right or are separable from goodwill. The fair value of these intangible assets is based on valuations that use information and assumptions provided by management. The excess purchase price over the net tangible and identifiable intangible assets is recorded as goodwill and is assigned to the reporting unit that is expected to benefit from the combination as of the acquisition date.\nRecoverability of Goodwill and Indefinite-Lived Intangible Assets\nGoodwill is the Company’s largest asset with a carrying value of $2.3 billion at each of December 31, 2024 and 2023, representing 52% of the Company’s total assets on both dates. Indefinite-lived intangible assets, which consist of certain of the Company’s acquired trade names and trademarks, have a carrying value of $96.9 million and $183.1 million at December 31, 2024 and 2023, respectively.\nThe Company assesses goodwill on its four reporting units and indefinite-lived intangible assets for impairment annually as of October 1, or more frequently if an event occurs or circumstances indicate that it is more likely than not the fair value of a reporting unit or the fair value of an indefinite-lived intangible asset is below its carrying value.\nGoodwill\nWhen the Company elects to perform a qualitative assessment and concludes it is not more likely than not that the fair value of the reporting unit is less than its carrying value, no further assessment of that reporting unit’s goodwill is necessary; otherwise, a quantitative assessment is performed to further assess if any goodwill impairment exists.\nIf the Company concludes that it is more likely than not that there may be an impairment, the fair value of each reporting unit will be determined and compared to its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, goodwill of the reporting unit is not impaired. If the carrying value of a reporting unit exceeds its estimated fair value, an impairment loss equal to the excess is recorded.\nAs a result of the change to our operating segments in the third quarter of 2024, we reassessed our reporting units and determined that the four operating segments are also our reporting units for the purpose of evaluating goodwill for impairment. The Company re-allocated goodwill to each of the four reporting units based on their relative fair values as of September 30, 2024. This change in reporting units is considered a triggering event that requires a goodwill impairment assessment to be performed immediately before and after the change. There was no goodwill impairment identified in either the before or after impairment tests. In measuring the estimated fair value of each operating unit, the Company used a combination of an income approach and a market approach. Under the income approach, a discounted cash flow analysis is performed with assumptions and estimates of forecast operating cash flows, including revenue growth rates, profitability margins, and discount rates, which all vary among reporting units. The market approach utilizes the guideline public companies method and is based on revenue and earnings multiple data derived from publicly traded peer group companies.\n53\nTable of Contents\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its reporting units are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of each reporting unit exceeded their carrying values. Additionally, the 2023 annual assessment did not identify any goodwill impairments.\nIndefinite-Lived Intangible Assets\nThe Company has the option to qualitatively assess whether it is more likely than not that the fair values of its indefinite-lived intangible assets are less than their carrying values. The Company performed a qualitative impairment assessment as of October 1, 2024 and concluded that it was more likely than not that the fair values of our indefinite-lived intangible assets exceeded the carrying values.\nFor assets in which a quantitative assessment is performed, the Company determines the fair value of its indefinite-lived intangible assets using an avoided royalty discounted cash flow (“DCF”) valuation analysis. Significant judgments inherent in this analysis include the selection of appropriate royalty and discount rates and estimating the amount and timing of expected future cash flows. The discount rates used in the DCF analyses are intended to reflect the risks inherent in the expected future cash flows generated by the respective intangible assets. The royalty rates used in the DCF analyses are based upon an estimate of the royalty rates that a market participant would pay to license the specific trade names and trademarks. The future cash flows are based on the Company’s most recent forecast and budget and, for years beyond the budget, the Company’s estimates are based, in part, on forecasted growth rates. Assumptions used in the avoided royalty DCF analyses, including the discount rate and royalty rate, are assessed when a quantitative assessment is performed based on the actual and projected cash flows related to the asset, as well as macroeconomic and industry specific factors. The discount rates used in the Company’s 2023 quantitative assessments as part of the annual indefinite-lived impairment assessment ranged from 15% to 18%, and the royalty rates used ranged from 3% to 8%.\nIf the carrying value of an indefinite-lived intangible asset exceeds its estimated fair value, an impairment equal to the excess is recorded.\nDuring the third quarter ended September 30, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $28.7 million related to indefinite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. For certain assets with no remaining cash flows, the Company fully impaired the asset. For assets with remaining cash flows, the Company conducted discounted cash flow valuations. During the year ended December 31, 2022, the Company recognized impairment charges of $244.3 million in the Match Group Asia segment related to the Azar and Hakuna brands at Hyperconnect, $43.9 million in the Evergreen & Emerging segment related to the Meetic and Match brands in Europe, and $5.5 million in the Evergreen & Emerging segment related to certain Affinity brands in the U.S., all of which are included within “Impairment and amortization of intangibles” in the consolidated statement of operations.\nAt December 31, 2023, the aggregate indefinite-lived intangible asset balance for which the estimate of fair value was less than 110% of carrying values was approximately $76.5 million. These assets identified at December 31, 2023 had additional impairments taken during the year ended December 31, 2024 and the assets were either fully impaired as no additional cash flows were identified or impaired and moved to definite-lived intangible assets during the year ended December 31, 2024. At December 31, 2024, based on our qualitative analysis performed, none of the Company’s remaining indefinite-lived intangible assets fair values were identified as being near their carrying value.\nIn connection with the annual impairment assessment, the Company reviews the useful lives for intangible assets and whether events or changes in circumstances indicate that an indefinite life may no longer be appropriate. During the year ended December 31, 2024, the Company reclassified certain indefinite-lived intangible assets with a carrying value of $47.2 million to the definite-lived intangible asset category because these assets were no longer considered to have an indefinite life.\nRecoverability and Estimated Useful Lives of Definite-lived Intangible Assets\nWe review the carrying value of all definite-lived intangible assets for impairment whenever events or changes in circumstances indicate that the carrying value of an asset may not be recoverable. The carrying value \n54\nTable of Contents\nof a definite-lived intangible asset is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. If the carrying value is deemed not to be recoverable, an impairment loss is recorded equal to the amount by which the carrying value of the definite-lived intangible asset exceeds its fair value. In addition, the Company reviews the useful lives of its definite-lived intangible assets whenever events or changes in circumstances indicate that these lives may be changed. During the year ended December 31, 2024, in connection with our decision to terminate certain of our live streaming services and our Hakuna app, we recognized impairment charges of $1.9 million related to definite-lived intangible assets in the Match Group Asia and Evergreen & Emerging segments. The carrying value of definite-lived intangible assets was $118.5 million and $122.7 million, at December 31, 2024 and 2023, respectively.\nIncome Taxes\nMatch Group is subject to income taxes in the United States and numerous foreign jurisdictions. Significant judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws.\nWe record a provision for income taxes for the anticipated tax consequences of our reported results of operations using the asset and liability method. Under this method, we recognize deferred income tax assets and liabilities for the future tax consequences of temporary differences between the financial reporting and tax bases of asset and liabilities, as well as for net operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which those temporary differences are expected to be realized or settled. We recognize the deferred income tax effects of a change in tax rates in the period of enactment.\nA valuation allowance is provided on deferred tax assets if it is determined that it is more likely than not that the deferred tax asset will not be realized. We consider all available evidence, both positive and negative, including historical levels of income, expectations and risks associated with estimates of future taxable income, and tax planning strategies in assessing the need for a valuation allowance.\nWe recognize tax benefits from uncertain tax positions only if we believe that it is more likely than not that the tax position will be sustained based on the technical merits of the position. Such tax benefits are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement. This measurement step is inherently difficult and requires subjective estimations of such amounts to determine the probability of various possible outcomes. We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustment. We make adjustments to our unrecognized tax benefits when facts and circumstances change, such as the closing of a tax audit or the refinement of an estimate. Although we believe that we have adequately reserved for our uncertain tax positions, the final outcome of these matters may vary significantly from our estimates. To the extent that the final outcome of these matters is different from the amounts recorded, such differences will affect the income tax provision in the period in which such determination is made, and could have a material impact on our financial condition and operating results.\nStock-Based Compensation\nThe Company recorded stock-based compensation expense of $267.4 million and $232.1 million for the years ended December 31, 2024 and 2023, respectively.\nAccounting for stock-based compensation at the Company is often complex due to the variety of instruments we use to attract, retain, and reward employees at many of our brands by allowing them to benefit from the value they help to create. We also utilize stock-based awards as part of our acquisition strategy. We accomplish these objectives, in part, by issuing awards denominated in the equity of our non-public subsidiaries as well as in Match Group, Inc. We further refine this approach by tailoring the terms of awards as appropriate. For example, we issue certain awards with vesting conditioned on the achievement of specified performance targets such as revenue or profits; these awards are referred to as performance awards. In other cases, we condition the vesting of awards to the achievement of value targets for a specific subsidiary or the Company’s stock price; these awards are referred to as market-based awards.\nThe Company issues RSUs and performance-based RSUs (“PSUs”). The value of RSUs with vesting subject only to continued service is based on the fair value of Match Group common stock on the grant date. The value \n55\nTable of Contents\nof RSUs that include a market condition is based on fair value estimated using a lattice model. The value of RSUs is expensed as stock-based compensation expense over the applicable vesting term. For PSU awards, the expense is measured at the grant date as the fair value of Match Group common stock and expensed as stock-based compensation over the vesting term if the performance targets are considered probable of being achieved.\nRecent Accounting Pronouncements \nFor a discussion of recent accounting pronouncements, see “Note 2—Summary of Significant Accounting Policies” to the consolidated financial statements included in “Item 8—Consolidated Financial Statements and Supplementary Data.”\n56\nTable of Contents",
  "item2": null
}