{
  "source_file": "mtd-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with the Unaudited Interim Consolidated Financial Statements included herein.\nGeneral\nOur interim consolidated financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America. Operating results for the three and nine months ended September 30, 2025 are not necessarily indicative of the results to be expected for the full year ending December 31, 2025. \nChanges in local currencies exclude the effect of currency exchange rate fluctuations. Local currency amounts are determined by translating current and previous year consolidated financial information at an index utilizing historical currency exchange rates. We believe local currency information provides a helpful assessment of business performance and a useful measure of results between periods. We do not, nor do we suggest that investors should, consider such non-GAAP financial measures in isolation from, or as a substitute for, financial information prepared in accordance with GAAP. We present non-GAAP financial measures in reporting our financial results to provide investors with an additional analytical tool to evaluate our operating results.\nWe also include in the discussion below disclosures of immaterial qualitative factors that are not quantified. Although the impact of such factors is not considered material, we believe these disclosures can be useful in evaluating our operating results.\n- 26 -\nTable of Contents\nResults of Operations – Consolidated\nThe following tables set forth certain items from our interim consolidated statements of operations and comprehensive income for the three and nine month periods ended September 30, 2025 and 2024 (amounts in thousands).\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\n \n(unaudited)\n%\n(unaudited)\n%\n(unaudited)\n%\n(unaudited)\n%\nNet sales\n$\n1,029,699 \n100.0 \n$\n954,535 \n100.0 \n$\n2,896,664 \n100.0 \n$\n2,827,234 \n100.0 \nCost of sales\n420,243 \n40.8 \n382,068 \n40.0 \n1,181,453 \n40.8 \n1,140,966 \n40.4 \nGross profit\n609,456 \n59.2 \n572,467 \n60.0 \n1,715,211 \n59.2 \n1,686,268 \n59.6 \nResearch and development\n51,143 \n5.0 \n47,117 \n4.9 \n146,774 \n5.1 \n139,303 \n4.9 \nSelling, general and administrative\n248,391 \n24.1 \n228,777 \n24.0 \n738,488 \n25.5 \n698,963 \n24.7 \nAmortization\n20,022 \n1.9 \n18,243 \n1.9 \n54,796 \n1.9 \n54,649 \n1.9 \nInterest expense\n17,695 \n1.7 \n18,599 \n1.9 \n51,127 \n1.7 \n56,781 \n2.0 \nRestructuring charges\n5,972 \n0.6 \n2,631 \n0.3 \n13,296 \n0.5 \n17,624 \n0.6 \nOther charges (income), net\n(3,003)\n(0.2)\n(1,852)\n(0.2)\n(9,105)\n(0.4)\n(3,728)\n(0.1)\nEarnings before taxes\n269,236 \n26.1 \n258,952 \n27.2 \n719,835 \n24.9 \n722,676 \n25.6 \nProvision for taxes\n51,743 \n5.0 \n47,436 \n5.0 \n136,407 \n4.8 \n111,837 \n4.0 \nNet earnings\n$\n217,493 \n21.1 \n$\n211,516 \n22.2 \n$\n583,428 \n20.1 \n$\n610,839 \n21.6 \nRecent developments in global trade disputes/tariffs\nIn 2025, the U.S. government enacted incremental tariff rates at various levels ranging from 10% to 145% on U.S. imports from certain foreign countries. In response to the U.S. tariffs, the Chinese government implemented an additional tariff of 125% on imports from the U.S. that has been reduced to 10%. We estimate we will incur costs before mitigation actions from the incremental 2025 tariff rates of approximately $50 million in 2025. We are implementing various actions to fully offset the effect of the current incremental tariffs in 2026. Incremental tariff rates during 2025 are currently 39% on imports from Switzerland, 25% on non-USMCA imports from Mexico, 30% on imports from China, 15% on imports from the European Union and 10% on imports from the United Kingdom. The U.S. government has indicated it may make further changes to tariff rates in the future, especially related to China, that may adversely impact our financial results in future periods.\nThe recent escalation in global trade disputes/tariffs has increased economic uncertainty in\nour end markets and the global economic environment, including increasing the risk of recession in many countries, and market conditions may change quickly. Although we are implementing various actions to mitigate the effect of the tariffs, they could adversely impact our financial results and could have a greater impact on our operating results in future periods. Please refer to Part 1, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024 for more information.\nNet sales\nNet sales were $1.0 billion and $954.5 million for the three months ended September 30, 2025, and 2024, respectively, and $2.9 billion and $2.8 billion for nine month periods ended September 30, 2025 and 2024, respectively. Sales in U.S. dollars increased 8% for the three month period and 2% for the nine month period ended September 30, 2025. Excluding the effect of currency exchange rate fluctuations, or in local currencies, net sales increased 6% for the three month period and 2% for the nine month period ended September 30, 2025. Net sales in local currencies increased 5% for the three month period ended September 30, 2025 excluding acquisitions. We estimate that net sales growth for the nine months ended September 30, 2025 was reduced approximately 2% from the recovery of previously disclosed shipping delays during the three months ended March 31, 2024 related to a new external European logistics service provider. \n- 27 -\nTable of Contents\nExcluding this impact, sales increased 4% in local currency for the nine months ended September 30, 2025 compared to the corresponding period in 2024. \nWe continue to benefit from the execution of our global sales and marketing programs, our innovative product portfolio, and investments in our field organization, particularly surrounding digital tools and techniques. However, the recent escalation in global trade disputes/tariffs has increased uncertainty in our end markets and the global economic environment, including increasing the risk of recession in many countries, and market conditions may change quickly. The ongoing developments related to global trade disputes/tariffs, governmental policies, the geopolitical environment, the conflict in Ukraine, and continuing instability in the Middle East also present several risks to our business as further described in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024. These topics could adversely impact our financial results and could have a greater impact on our operating results in future periods. \nNet sales by geographic destination for the three months ended September 30, 2025 in U.S. dollars increased 10% in the Americas, 13% in Europe, and 1% Asia/Rest of World. In local currencies, our net sales by geographic destination increased 10% in the Americas, 6% in Europe, and 1%\n in \nAsia/Rest of World. Net sales in the Americas benefited approximately 1% from acquisitions for the three months ended September 30, 2025. Our net sales by geographic destination for the nine months ended September 30, 2025 in U.S. dollars increased 4% in the Americas, 3% in Europe, and 1% in Asia/Rest of World. Net sales by geographic destination for the nine months ended September 30, 2025 in local currencies increased 4% in the Americas and 1%\n \nAsia/Rest of World, and were flat in Europe. Net sales in Asia/Rest of World in local currency includes an increase of 2% and flat sales in China during the three and nine months ended September 30, 2025. Excluding the impact of the recovery of delayed shipments in the prior year, local currency sales during the nine months ended September 30, 2025 increased 5% in the Americas, 3% in Europe, and 2% in Asia/Rest of World, with a 1% increase in China. A discussion of sales by operating segment is included below.\nAs described in Note 18 to our consolidated financial statements for the year ended December 31, 2024, our net sales comprise product sales of precision instruments and related services. Service revenues are primarily derived from repair and other services, including regulatory compliance qualification, calibration, certification, preventative maintenance and spare parts.\nNet sales of products increased 7% in U.S. dollars and 5% in local currencies for the three months ended September 30, 2025 and increased 1% in U.S. dollars and were flat in local currencies for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Service revenue (including spare parts) increased 10% in U.S. dollars and 8% in local currencies for the three months ended September 30, 2025 and increased 7% in U.S. dollars and 6%\n in \nlocal currencies for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Service revenue benefited approximately 1% from acquisitions for the three months ended September 30, 2025. \nNet sales of our laboratory products and services, which represented approximately 55% of our total net sales, increased 6% in U.S. dollars and 4% in local currencies for the three months ended September 30, 2025, and increased 1% in both U.S. dollars and local currencies for the nine months ended September 30, 2025. Laboratory net sales growth for the nine months ended September 30, 2025 was reduced by approximately 3% from the recovery of previously disclosed shipping delays during the nine month period ended September 30, 2024. The local currency increase in net sales of our laboratory-related products for the three and nine months ended September 30, 2025 includes growth in most product categories, with particularly strong growth in process analytics during the three months ended September 30, 2025.\nNet sales of our industrial products and services, which represented approximately 40% of our total net sales, increased 11% in U.S. dollars and 9% in local currencies for the three months ended September 30, 2025, and increased 5% in U.S. dollars and 4%\n \nlocal currencies for the nine months ended September 30, 2025. Net sales of our industrial products and services benefited approximately 1% from acquisitions for the three months ended September 30, 2025. Industrial net \n- 28 -\nTable of Contents\nsales growth for the nine months ended September 30, 2025 was reduced by approximately 1% from the recovery of previously disclosed shipping delays during the nine month period ended September 30, 2024. The local currency increase in net sales of our industrial-related products for the three months ended September 30, 2025 includes strong growth in most product categories, especially core-industrial products. The nine months ended September 30, 2025 also benefited from excellent growth in product inspection.\nNet sales in our food retailing products and services, which represented approximately 5% of our total net sales, increased 8% in U.S. dollars and 5% in local currencies for the three months ended September 30, 2025, and decreased 1% in U.S. dollars and 2% in local currencies for the nine months ended September 30, 2025. Retail net sales growth for the nine months ended September 30, 2025 was reduced by approximately 3% from the recovery of the previously disclosed shipping delays during the nine month period ended September 30, 2024. The local currency net sales of our food retailing products for the three and nine months ended September 30, 2025 are impacted by the timing of customer project activity with strong growth in Europe during the three month period ended September 30, 2025.\nGross profit\nGross profit as a percentage of net sales was 59.2% and 60.0% for the three months ended September 30, 2025 and 2024, respectively, and 59.2% and 59.6% for the nine months ended September 30, 2025 and 2024, respectively.\nGross profit as a percentage of net sales for products was 61.0% and 61.8% for the three months ended September 30, 2025 and 2024, respectively, and 61.0% and 61.7% for the nine months ended September 30, 2025 and 2024, respectively. \nGross profit as a percentage of net sales for services (including spare parts) was 53.9% and 54.4% for the three months ended September 30, 2025 and 2024, respectively, and 53.9% and 53.4% for the nine months ended September 30, 2025 and 2024, respectively.\nThe decrease in gross profit as a percentage of net sales for the three and nine months ended September 30, 2025 primarily reflects increased tariff costs and unfavorable business mix, partially offset by favorable price realization and benefits from our SternDrive program. The decrease in gross profit as a percentage of net sales for the nine months ended September 30, 2025 also includes lower sales volume related to the recovery of shipping delays in the prior year.\nThe escalation in global trade disputes/tariffs may negatively impact our gross margins in future periods. As previously mentioned, we have implemented various actions to mitigate the effect of the tariffs.  \nResearch and development and selling, general and administrative expenses\nResearch and development expenses as a percentage of net sales was 5.0% and 4.9% for the three months ended September 30, 2025 and 2024, respectively, and was 5.1% and 4.9%\n \nfor the nine months ended September 30, 2025 and 2024, respectively. Research and development expenses increased 9% in U.S. dollars and 4% in local currencies for the three months ended September 30, 2025, and increased 5% in U.S. dollars and 3%\n \nin local currencies for the nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024.\nSelling, general and administrative expenses as a percentage of net sales were 24.1% and 24.0% for the three months ended September 30, 2025 and 2024, respectively, and were 25.5% and 24.7% for the nine months ended September 30, 2025 and 2024, respectively. Selling, general and administrative expenses increased 9% in U.S. dollars and 6% in local currencies for the three months ended September 30, 2025, and increased 6% in U.S. dollars and 4%\n \nlocal currencies for the nine months ended September 30, 2025. The local currency increase for the three and nine months ended September 30, 2025 includes sales and marketing investments, offset in part by savings from our cost savings initiatives.\n- 29 -\nTable of Contents\nAmortization, interest expense, restructuring charges, other charges (income), net and taxes \nAmortization expense was $20.0 million and $18.2 million for the three months ended September 30, 2025 and 2024, respectively, and $54.8 million and $54.6 million for the nine months ended September 30, 2025 and 2024, respectively.\nInterest expense was $17.7 million and $18.6 million for the three months ended September 30, 2025 and 2024, respectively, and $51.1 million and $56.8 million for the nine months ended September 30, 2025 and 2024, respectively. \nRestructuring charges were $6.0 million and $2.6 million for the three months ended September 30, 2025 and 2024, respectively, and $13.3 million and $17.6 million for the nine months ended September 30, 2025 and 2024, respectively. Restructuring expenses are primarily comprised of employee-related costs.\nOther charges (income), net includes non-service pension costs (benefits), net (gains) losses from foreign currency transactions and hedging activities, interest income and other items. Non-service pension benefits were $3.5 million and $1.9 million for the three months ended September 30, 2025 and 2024, respectively, and $10.1 million and $5.7 million for the nine months ended September 30, 2025 and 2024, respectively. Other charges (income), net also includes $1.3 million of acquisition transaction costs for the three and nine months ended September 30, 2025.\nOur reported tax rate was 19.2% and 18.3% during the three months ended September 30, 2025 and 2024, respectively, and 18.9% and 15.5% during the nine months ended September 30, 2025 and 2024, respectively. The reported tax rate for the nine month period ended September 30, 2024 includes a non-cash discrete tax benefit of $23.0 million resulting from the reduction of uncertain tax position liabilities related to the settlement of a tax audit. The provision for taxes is based upon our projected annual effective tax rate of 19.0% before non-recurring discrete tax items for the periods ended September 30, 2025 and 2024. The difference between our projected annual effective tax rate and the reported tax rate is related to the timing of excess tax benefits associated with stock option exercises and the non-recurring discrete tax item in the prior year.\nOn July 4, 2025, the United States enacted new tax legislation into law. We reflected the impact of the legislation, which was not material, during the three months ended September 30, 2025. We do not expect the legislation to have a material impact on our projected annual income tax rate or consolidated financial statements.\n- 30 -\nTable of Contents\nResults of Operations – by Operating Segment\nThe following is a discussion of the financial results of our operating segments. We currently have five reportable segments: U.S. Operations, Swiss Operations, Western European Operations, Chinese Operations and Other Operations. A more detailed description of these segments is outlined in Note 18 to our consolidated financial statements for the year ended December 31, 2024.\nU.S. Operations (amounts in thousands)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n%\n2025\n2024\n%\nNet sales to external customers\n$\n385,850 \n$\n351,042 \n10%\n$\n1,104,124 \n$\n1,059,380 \n4%\nNet sales to other segments\n35,784 \n37,411 \n(4)%\n109,050 \n110,846 \n(2)%\nSegment net sales\n421,634 \n388,453 \n9%\n1,213,174 \n1,170,226 \n4%\nSegment cost of sales\n186,632 \n167,199 \n12%\n536,803 \n505,417 \n6%\nSegment period expense\n135,097 \n123,977 \n9%\n399,470 \n373,649 \n7%\nSegment profit\n$\n99,905 \n$\n97,277 \n3%\n$\n276,901 \n$\n291,160 \n(5)%\nSegment net sales increased 9%\n \nand\n \n4%\n \nfor the three and nine months ended September 30, 2025, respectively, compared with the corresponding periods in 2024. Net sales to external customers increased 10% and 4% for the three and nine months ended September 30, 2025, respectively, compared with the corresponding periods in 2024. Net sales to external customers and segment net sales benefited 1% from acquisitions for the three months ended September 30, 2025. The growth in net sales to external customers during the nine months ended September 30, 2025 was reduced approximately 1% from the recovery of previously disclosed shipping delays during the nine months ended September 30, 2024. Net sales to external customers for the three and nine months ended September 30, 2025 includes particularly strong growth in process analytics and product inspection. Net sales to external customers for the three months ended September 30, 2025 also includes strong growth in core industrial.\nSegment profit increased $2.6 million\n \nand decreased $14.3 million\n \nfor the three and nine months ended September 30, 2025, compared to the corresponding periods in 2024. Segment profit during the three and nine months ended September 30, 2025 includes higher tariff costs offset in part by pricing. Segment profit during the nine months ended September 30, 2025 was also negatively impacted by lower sales volume in the first quarter related to the previously disclosed shipping delay recovery in the prior year.\nSwiss Operations (amounts in thousands)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n%\n1)\n2025\n2024\n%\n1)\nNet sales to external customers\n$\n52,072 \n$\n53,435 \n(3)%\n$\n148,929 \n$\n157,870 \n(6)%\nNet sales to other segments\n218,605 \n188,956 \n16%\n594,434 \n581,521 \n2%\nSegment net sales\n270,677 \n242,391 \n12%\n743,363 \n739,391 \n1%\nSegment cost of sales\n126,308 \n106,381 \n19%\n345,338 \n369,557 \n(7)%\nSegment period expense\n62,336 \n55,815 \n12%\n184,416 \n174,749 \n6%\nSegment profit\n$\n82,033 \n$\n80,195 \n2%\n$\n213,609 \n$\n195,085 \n9%\n1)\nRepresents U.S. dollar growth (decline).\n    \nSegment net sales increased 12% in U.S. dollars and 4% in local currency for the three months ended September 30, 2025, and increased 1% in U.S. dollars and decreased 4% in local currency for the nine months ended September 30, 2025, respectively, compared to the \n- 31 -\nTable of Contents\ncorresponding periods in 2024. Net sales to external customers decreased 3% in U.S. dollars and 7% in local currency for the three months ended September 30, 2025 and decreased 6% in U.S. dollars and 8% in local currency for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. The decline in net sales to external customers during the nine months ended September 30, 2025 includes a 4% decline from the recovery of previously disclosed shipping delays during the nine months ended September 30, 2024. Net sales to external customers for the three and nine months ended September 30, 2025 includes declines in most product categories.\nSegment profit increased $1.8 million and $18.5 million\n \nfor the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024. Segment profit increased during the three months ended September 30, 2025 primarily due to higher net sales to other segments, offset in part by unfavorable foreign currency translation.\nWestern European Operations (amounts in thousands)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n%\n1)\n2025\n2024\n%\n1)\nNet sales to external customers\n$\n227,176 \n$\n201,837 \n13%\n$\n629,461 \n$\n618,915 \n2%\nNet sales to other segments\n52,029 \n43,605 \n19%\n147,663 \n133,513 \n11%\nSegment net sales\n279,205 \n245,442 \n14%\n777,124 \n752,428 \n3%\nSegment cost of sales\n126,898 \n113,969 \n11%\n345,947 \n349,169 \n(1)%\nSegment period expense\n95,061 \n87,513 \n9%\n279,006 \n263,864 \n6%\nSegment profit\n$\n57,246 \n$\n43,960 \n30%\n$\n152,171 \n$\n139,395 \n9%\n1)\nRepresents U.S. dollar growth (decline).\nSegment net sales increased 14% in U.S. dollars and 7% in local currencies for the three months ended September 30, 2025 and increased 3% in U.S. dollars and were flat in local currencies for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Net sales to external customers increased 13% in U.S. dollars and 6% in local currencies for the three months ended September 30, 2025, and increased 2% in U.S. dollars and decreased 1% in local currencies for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. The growth in net sales to external customers during the nine months ended September 30, 2025 was reduced approximately 3% from the recovery of previously disclosed shipping delays during the nine month period ended September 30, 2024. Net sales to external customers for the three months ended September 30, 2025 includes very strong growth in core industrial and retail products. \nSegment profit increased $13.3 million\n \nand $12.8 million for the three and nine month periods ended September 30, 2025, respectively, compared to the corresponding periods in 2024. The increase in segment profit during the three and nine months ended September 30, 2025 includes increased net sales and benefits from our margin expansion initiatives, as well as favorable foreign currency translation. \n- 32 -\nTable of Contents\nChinese Operations (amounts in thousands)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n%\n1)\n2025\n2024\n%\n1)\nNet sales to external customers\n$\n166,964 \n$\n164,400 \n2%\n$\n470,149 \n$\n471,982 \n—%\nNet sales to other segments\n87,272 \n78,069 \n12%\n247,664 \n240,604 \n3%\nSegment net sales\n254,236 \n242,469 \n5%\n717,813 \n712,586 \n1%\nSegment cost of sales\n112,946 \n107,650 \n5%\n323,415 \n315,640 \n2%\nSegment period expense\n47,034 \n45,384 \n4%\n134,787 \n132,191 \n2%\nSegment profit\n$\n94,256 \n$\n89,435 \n5%\n$\n259,611 \n$\n264,755 \n(2)%\n1)\nRepresents U.S. dollar growth (decline).\nSegment net sales increased 5% in both U.S. dollars and local currency for the three months ended September 30, 2025 and increased 1%\n \nin both U.S. dollars and local currency for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Net sales to external customers increased 2% in U.S. dollars and 1% in local currency by origin for the three months ended September 30, 2025 and were flat in both U.S. dollars and local currency during the nine months ended September 30, 2025, compared to the corresponding periods in 2024. The growth in net sales to external customers during the nine months ended September 30, 2025 was reduced approximately 1% from the recovery of previously disclosed shipping delays during the nine month period ended September 30, 2024. Net sales to external customers for the three months ended September 30, 2025 includes modest growth in both industrial and laboratory-related products.\nSegment profit increased $4.8 million and decreased $5.1 million\n \nfor the three and nine month periods ended September 30, 2025, respectively, compared to the corresponding periods in 2024. The increase in segment profit during the three months ended September 30, 2025 includes higher sales volume and benefits from our margin expansion initiatives. \nOther Operations (amounts in thousands)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n%\n1)\n2025\n2024\n%\n1)\nNet sales to external customers\n$\n197,637 \n$\n183,821 \n8%\n$\n544,001 \n$\n519,087 \n5%\nNet sales to other segments\n11,213 \n5,786 \n94%\n28,899 \n16,722 \n73%\nSegment net sales\n208,850 \n189,607 \n10%\n572,900 \n535,809 \n7%\nSegment cost of sales\n113,874 \n105,255 \n8%\n308,978 \n295,760 \n4%\nSegment period expense\n58,292 \n52,897 \n10%\n171,644 \n158,785 \n8%\nSegment profit\n$\n36,684 \n$\n31,455 \n17%\n$\n92,278 \n$\n81,264 \n14%\n1)\nRepresents U.S. dollar growth (decline).\nSegment net sales increased 10% in U.S. dollars and 9% in local currency for the three months ended September 30, 2025 and increased 7% in U.S. dollars and 8% in local currency for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Net sales to external customers increased 8% in U.S. dollars and 6% in local currencies for the three months ended September 30, 2025 and increased 5% in both U.S. dollars and local currencies for the nine months ended September 30, 2025, compared to the corresponding periods in 2024. Other Operations net sales to external customers and segment net sales benefited approximately 1% from acquisitions for the three months ended September 30, 2025.  The growth in net sales to external customers during the nine months ended September 30, 2025 was reduced approximately 3% from the recovery of previously disclosed shipping delays during the nine months ended September 30, 2024. Net sales to external customers for the three and nine months ended September 30, 2025 includes strong growth in most product categories, particularly process analytics.\n- 33 -\nTable of Contents\nSegment profit increased $5.2 million and $11.0 million\n \nfor the three and nine months ended September 30, 2025, respectively, compared to the corresponding periods in 2024. The increase in segment profit for the three and nine months ended September 30, 2025 is primarily related to increased sales volume and benefits from our margin expansion initiatives.\nLiquidity and Capital Resources\nLiquidity is our ability to generate sufficient cash flows from operating activities to meet our obligations and commitments. In addition, liquidity includes available borrowings under our Credit Agreement, the ability to obtain appropriate financing and our cash and cash equivalent balances. Currently, our liquidity needs are primarily driven by working capital requirements, capital expenditures, share repurchases and acquisitions. Global market conditions can be uncertain, and our ability to generate cash flows could be reduced by a deterioration in global markets. \nWe currently believe that cash flows from operating activities, together with liquidity available under our Credit Agreement, local working capital facilities, and cash balances, will be sufficient to fund currently anticipated working capital needs and spending requirements for at least the foreseeable future.\nCash provided by operating activities totaled $730.2 million during the nine months ended September 30, 2025, compared to $702.2 million in the corresponding period in 2024. The increase for the nine months ended September 30, 2025 includes lower tax payments and favorable working capital, offset in part by higher cash incentive payments of approximately $36 million related to prior year performance.\nCapital expenditures are made primarily for investments in information systems and technology, machinery, equipment and the purchase and expansion of facilities. Our capital expenditures totaled $65.6 million for the nine months ended September 30, 2025 compared to $62.6 million in the corresponding period in 2024. \nWe continue to explore potential acquisitions. In connection with any acquisition, we may incur additional indebtedness. During the third quarter of 2025, we acquired several acquisitions related to our North America distribution and an extension of our life science equipment offering. The cumulative initial cash payments were $72.6 million and we may be required to pay additional consideration of up to $31.2 million. Goodwill recorded in connection with the acquisitions totaled $48.4 million. We also recorded $31.8 million of identified intangibles primarily pertaining to customer relationships in connection with the acquisitions, which will be amortized on a straight-line basis over 5 to 10 years. For additional information related to these acquisitions, refer to Note 4 to the interim consolidated financial statements.\nCash flows used in financing activities are primarily comprised of share repurchases. In accordance with our share repurchase program, we spent $656.2 million and $637.5 million on the repurchase of 542,416 shares and 482,413 shares, during the nine months ended September 30, 2025 and 2024, respectively. \n- 34 -\nTable of Contents\nSenior Notes and Credit Facility Agreement\nOur debt consisted of the following at September 30, 2025:\nU.S. Dollar\nOther Principal Trading Currencies\nTotal\n3.91% $75 million ten-year Senior Notes due June 25, 2029\n75,000 \n— \n75,000 \n5.45% $150 million ten-year Senior Notes due March 1, 2033\n150,000 \n— \n150,000 \n2.83% $125 million twelve-year Senior Notes due July 22, 2033\n125,000 \n— \n125,000 \n3.19% $50 million fifteen-year Senior Notes due January 24, 2035\n50,000 \n— \n50,000 \n2.81% $150 million fifteen-year Senior Note due March 17, 2037\n150,000 \n— \n150,000 \n2.91% $150 million fifteen-year Senior Note due September 1, 2037\n150,000 \n— \n150,000 \n1.47% Euro 125 million fifteen-year Senior Notes due June 17, 2030\n— \n146,260 \n146,260 \n1.30% Euro 135 million fifteen-year Senior Notes due November 6, 2034\n— \n157,961 \n157,961 \n1.06% Euro 125 million fifteen-year Senior Notes due March 19, 2036\n— \n146,260 \n146,260 \n3.80% Euro 100 million 10 1/2-year Senior Notes due July 9, 2035\n— \n117,008 \n117,008 \nDebt issuance costs, net\n(2,141)\n(1,807)\n(3,948)\nTotal Senior Notes\n697,859 \n565,682 \n1,263,541 \n$1.35 billion Credit Agreement, interest at benchmark plus 87.5 basis points \n(a)\n491,556 \n381,515 \n873,071 \nOther local arrangements\n13,100 \n60,146 \n73,246 \nTotal debt\n1,202,515 \n1,007,343 \n2,209,858 \nLess: current portion\n(3,898)\n(59,711)\n(63,609)\nTotal long-term debt\n$\n1,198,617 \n$\n947,632 \n$\n2,146,249 \n(a)\n The benchmark interest rate is determined by the borrowing currency. The benchmark rates by borrowing currency are as follows: SOFR for U.S. dollars (plus a 10 basis points spread adjustment), SARON for Swiss franc, EURIBOR for Euro and SONIA for Great British pounds.\n    \nOn May 30, 2024, we entered into a $1.35 billion Credit Agreement (the Credit Agreement), which amended our $1.25 billion Amended and Restated Credit Agreement (the Prior Credit Agreement), that is further described in Note 8 of our consolidated financial statements. \nAs of September 30, 2025, we had $472.4 million of additional borrowings available under our Credit Agreement, and we maintained $69.1 million of cash and cash equivalents. \nChanges in exchange rates between the currencies in which we generate cash flows and the currencies in which our borrowings are denominated affect our liquidity. In addition, because we borrow in a variety of currencies, our debt balances fluctuate due to changes in exchange rates. Further, we do not have any downgrade triggers relating to ratings from rating agencies that would accelerate the maturity dates of our debt. We were in compliance with our debt covenants as of September 30, 2025.\nIn January 2025, we entered into an agreement to issue and sell EUR 100 million 10 1/2-year Senior Notes with a fixed interest rate of 3.8% (3.8% Euro Senior Notes) in a private placement, which will mature in July 2035. The 3.8% Euro Senior Notes are unsecured obligations of the Company and the terms are consistent with the previous Notes as disclosed in Note 10 to our consolidated financial statements for the year ended December 31, 2024. We used the proceeds from the sale of the Notes to refinance existing indebtedness and for other general corporate purposes.\n- 35 -\nTable of Contents\nOther Local Arrangements\nIn April 2018, two of our non-U.S. pension plans issued loans totaling $39.6 million (Swiss franc 38 million) to a wholly owned subsidiary of the Company. The loans have the same terms and conditions which include an interest rate of SARON plus 87.5 basis points. The loans were renewed for one year in April 2025. \nShare Repurchase Program\nIn November 2025, the Company's Board of Directors authorized an additional $2.75 billion to be added to our share repurchase program, which had $1.1 billion of remaining availability as of September 30, 2025. The share repurchases are expected to be funded from cash generated from operating activities, borrowings, and cash balances. Repurchases will be made through open market transactions, and the amount and timing of purchases will depend on business and market conditions, the stock price, trading restrictions, the level of acquisition activity, and other factors. \nWe have purchased 32.9 million shares at an average price per share of $317.56 since the inception of the program in 2004 through September 30, 2025. During the nine months ended September 30, 2025 and 2024, we spent $656.2 million and $637.5 million on the repurchase of 542,416 and 482,413 shares at an average price per share of $1,209.84 and $1,321.46, respectively. We also reissued 21,400 shares and 58,909 shares held in treasury upon the exercise of stock options and vesting of restricted stock units during the nine months ended September 30, 2025 and 2024, respectively. In addition, we incurred $2.2 million and $1.8 million of excise tax during the three months ended September 30, 2025 and 2024, respectively, and $6.3 million and $5.8 million of excise tax during the nine months ended September 30, 2025 and 2024, respectively related to the Inflation Reduction Act which is reflected as a reduction in shareholders' equity in our consolidated financial statements.\nEffect of Currency on Results of Operations\nOur earnings are affected by changes in exchange rates. We are most sensitive to changes in the exchange rates between the Swiss franc, euro, Chinese renminbi, and U.S. dollar. We have more Swiss franc expenses than we do Swiss franc sales because we develop and manufacture products in Switzerland that we sell globally, and have a number of corporate functions located in Switzerland. When the Swiss franc strengthens against our other trading currencies, particularly the U.S. dollar and euro, our earnings decrease. We also have significantly more sales in the euro than we do expenses. When the euro weakens against the U.S. dollar and Swiss franc, our earnings also decrease. We estimate a 1% strengthening of the Swiss franc against the euro would reduce our earnings before tax by approximately $2.6 million to $2.9 million annually.\nWe also conduct business in many geographies throughout the world, including Asia Pacific, the United Kingdom, Eastern Europe, Latin America, and Canada. Fluctuations in these currency exchange rates against the U.S. dollar can also affect our operating results. The most significant of these currency exposures is the Chinese renminbi. The impact on our earnings before tax of the Chinese renminbi weakening 1% against the U.S. dollar is a reduction of approximately $2.1 million to $2.4 million annually.\nIn addition to the effects of exchange rate movements on operating profits, our debt levels can fluctuate due to changes in exchange rates, particularly between the U.S. dollar, the Swiss franc and the euro. Based on our outstanding debt at September 30, 2025, we estimate that a 5% weakening of the U.S. dollar against the currencies in which our debt is denominated would result in an increase of approximately $53.1 million in the reported U.S. dollar value of our debt.\n- 36 -\nTable of Contents\nForward-Looking Statements Disclaimer\nYou should not rely on forward-looking statements to predict our actual results. Our actual results or performance may be materially different than reflected in forward-looking \nstatements because of various risks\n and uncertainties. You can identify forward-looking statements by terminology such as “may,” “will,” “could,” “would,” “should,” “expect,” “plan,” “anticipate,” “intend,” “believe,” “estimate,” “predict,” “potential,” or “continue.”\nWe make forward-looking statements in this Quarterly Report about future events or our future financial performance, including sales and earnings growth, earnings per share, strategic plans and contingency plans, growth opportunities or economic downturns, our ability to respond to changes in market conditions, planned research and development efforts and product introductions, adequacy of facilities, access to and the costs of raw materials, shipping and supplier costs, gross margins, customer demand, our competitive position, pricing, capital expenditures, cash flow, share repurchases, tax-related matters, the impact of foreign currencies, compliance with laws, effects of acquisitions, the impact of inflation, ongoing developments related to global trade disputes/tariffs, governmental policies, the geopolitical environment, the conflict in Ukraine and continuing instability in the Middle East on our business.\nOur forward-looking statements may not be accurate or complete, speak only as of the date of this Quarterly Report, and we do not intend to update or revise them in light of actual results. New risks also periodically arise. Please consider the risks and factors that could cause our results to differ materially from what is described in our forward-looking statements, including ongoing developments related to global trade disputes/tariffs, governmental policies, the geopolitical environment, inflation, the conflict in Ukraine and continuing instability in the Middle East. See in particular “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2024 and other reports filed with the SEC from time to time."
}