{
  "item1": "Onboard Other Revenue All three brands generate onboard other revenue additional products services which not included cruise fare, including casino operations, certain food beverage, shore excursions, gift shop purchases, spa services, communication services other similar items. Food beverage, casino operations shore excursions generally managed directly us while retail shops, spa services, art auctions communication services may managed through contracts third-party concessionaires. These contracts generally entitle us percentage gross sales derived these concessions. Norwegian’s ticket prices typically include meals certain dining facilities many onboard activities such entertainment, pool-side activities various sports programs.",
  "item7": "positively impacts net income, believe changes Adjusted Gross Margin, Net Yield, Net Cruise Cost Adjusted Net Cruise Cost Excluding Fuel most relevant indicators performance. believe Adjusted EBITDA appropriate supplemental financial measure used management assess operating performance. also believe Adjusted EBITDA useful measure determining performance reflects certain operating drivers business, such sales growth, operating costs, marketing, general administrative expense other operating income expense. addition, management uses Adjusted EBITDA performance measure incentive compensation.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations Cautionary Statement Concerning Forward-Looking Statements Some statements, estimates projections contained report “forward-looking statements” within meaning U.S. federal securities laws intended qualify safe harbor liability established Private Securities Litigation Reform Act 1995. All statements other than statements historical facts contained, incorporated reference, report, including, without limitation, expectations regarding results operations, future financial position, including liquidity requirements future capital expenditures, plans, prospects, actions taken strategies being considered respect liquidity position, including respect refinancing, amending terms of, extending maturity indebtedness, ability comply covenants under debt agreements, expectations regarding exchangeable notes, valuation appraisals assets, expectations regarding deferred tax assets valuation allowances, expected fleet additions, including expected timing thereof, expectations regarding impact macroeconomic conditions recent global events, expectations relating sustainability program decarbonization efforts may forward-looking statements."
}