{
  "source_file": "ndaq-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOVERVIEW\nNasdaq is a global technology company serving corporate clients, investment managers, banks, brokers, and exchange operators as they navigate and interact with the global capital markets and the broader financial system. We aspire to deliver world-leading platforms that improve the liquidity, transparency, and integrity of the global economy. Our diverse offering of data, analytics, software, exchange capabilities, and client-centric services enables clients to optimize and execute their business vision with confidence.\nWe manage, operate and provide our products and services in three business segments: Capital Access Platforms, Financial Technology and Market Services.\nHISTORY\nNasdaq was founded in 1971 as a wholly-owned subsidiary of FINRA. Beginning in 2000, FINRA restructured and broadened ownership in Nasdaq by selling shares to FINRA members, investment companies and issuers listed on The Nasdaq Stock Market. In connection with this restructuring, FINRA fully divested its ownership of Nasdaq in 2006, and The Nasdaq Stock Market became an independent registered national securities exchange in 2007.\nIn February 2008, Nasdaq and OMX AB combined their businesses, and we changed our corporate name to The NASDAQ OMX Group, Inc. This transformational combination resulted in the expansion of our business from a U.S.-based exchange operator to a global exchange company offering technology that powers our own exchanges and markets as well as many other marketplaces around the world. We operated as the NASDAQ OMX Group until we rebranded our business as Nasdaq, Inc. in 2015. \nIn November 2023, we accelerated our transformation as a leading technology provider to the global financial system through the acquisition of Adenza and its two flagship solutions, AxiomSL and Calypso.\nGROWTH STRATEGY\nTo enable success in the evolving global financial system, we have established our purpose, vision, and value proposition together with a focused growth strategy:\nOur Purpose: \nWe advance economic progress for all.\nOur Vision: \nWe will be the trusted fabric of the world’s financial system.\nOur Value Proposition: \nWe deliver world-leading platforms that improve the liquidity, transparency and integrity of the global economy.\nOur Strategy: \nIn 2017, we implemented a new strategic direction with the aim of optimizing the deployment of resources, human capital, and financial assets towards our most promising growth opportunities. These opportunities, \nwhich we identified as substantial and expanding opportunities, included solutions for combating financial crime, compliance solutions, marketplace technology, workflow for investment managers and asset owners as well as insight solutions. Our strengths in technology, proprietary data, analytics, and capital markets expertise, in conjunction with our broad client base and innovative brand has positioned us favorably to meet the evolving demands of our clientele and deliver in a sustainable way. \nIn order to amplify our strategy, we aligned our company more closely with the evolving client needs with an aim to drive growth across our key pillars of liquidity, transparency and integrity:\n•\nLiquidity: \nWithin our Financial Technology and Market Services segments, we continue to modernize markets by utilizing technology to maximize the liquidity of the global economy. New technologies, including cloud, blockchain, machine learning and AI, present significant opportunities to further enhance market resiliency and scalability and make markets even more accessible. We believe that these technologies will enable more opportunities for market participants and new asset classes to be integrated across markets globally. \n•\nTransparency\n: With nearly 10,000 corporate clients and 5,000 clients across the investment management ecosystem, our Capital Access Platforms segment is a trusted partner to enable the corporate and investment communities in making more informed decisions. Leveraging the insights and capabilities across our listings, advisory, data, index, and analytics teams, we believe that Capital Access Platforms segment serves as a bridge between the investor and corporate communities, focused on enhancing the client experience by providing efficient routes to capital, delivering more holistic, actionable insights and intelligence, modernizing workflows, and navigating the climate and sustainability landscape.\n•\nIntegrity: \nFinancial Crime Management Technology and Regulatory Technology, within our Financial Technology segment, include Nasdaq’s fraud detection, anti-money laundering, surveillance and risk data management and regulatory reporting solutions businesses. These businesses remain focused on capturing the opportunities arising from protecting the integrity of the financial system by fighting financial crime and helping our clients solve their most complex risk and compliance challenges. \n1\nPRODUCTS AND SERVICES \nCapital Access Platforms\nOur Capital Access Platforms segment delivers liquidity, transparency and integrity to the corporate issuer and investment community by empowering our clients to effectively navigate the capital markets, achieve their sustainability goals, and drive governance excellence. We offer a suite of products to assist companies in managing corporate governance standards.\nOur Capital Access Platforms segment comprises Data & Listing Services, Index and Workflow & Insights.\nData & Listing Services\nOur North American and European data products enhance transparency of market activity within our exchanges and provide critical information to professional and non-professional investors globally. Our Data business distributes historical and real-time market data to sell-side customers, the institutional investing community, retail online brokers, proprietary trading firms, and other venues, as well as internet portals and data distributors. \nWe collect, process, and create information and earn revenues as a distributor of our own, as well as select third-party, content. We provide varying levels of quote and trade information to market participants and to data distributors who in turn provide subscriptions for this information. Our systems enable distributors to gain access to our market depth, order imbalances, market sentiment and other analytical data. \nWe distribute this proprietary market information to both market participants and non-participants through a number of proprietary products, including Nasdaq TotalView, our flagship market depth quote product. We offer TotalView products for The Nasdaq Stock Market and our Nasdaq BX, Nasdaq PSX and Nordic markets. We also offer Nordic Equity TotalView, Nordic Derivatives TotalView and Nordic Fixed Income TotalView for Nordic markets.\nWe operate several other proprietary services and data products to provide market information, including Nasdaq Basic, a lower cost alternative to the industry Level 1 feed and Nasdaq Canada Basic, a lower cost alternative to other data feeds. We also provide various other data, including data relating to our U.S. equities and options exchanges and Nordic equities, derivatives, fixed income and futures.\nWe operate a variety of listing platforms around the world to provide multiple global capital raising solutions for public companies. Companies listed on our markets represent a diverse array of industries including, among others, healthcare, consumer products, telecommunication services, information technology, financial services, industrials and energy. Our main listing markets are The Nasdaq Stock Market and the Nasdaq Nordic and Nasdaq Baltic exchanges.\nCompanies seeking to list securities on The Nasdaq Stock Market may do so on one of the three market tiers: The Nasdaq Global Select Market, The Nasdaq Global Market, or The Nasdaq Capital Market. To qualify, companies must meet minimum listing requirements, including specified financial and corporate governance criteria. Once listed, companies must maintain rigorous listing and corporate governance standards. \nAs of December 31, 2024, a total of 5,249 companies listed securities on our U.S., Nasdaq Nordic, Nasdaq Baltic and Nasdaq First North exchanges. As of December 31, 2024, a total of 4,075 companies listed securities on The Nasdaq Stock Market, with 1,383 listings on The Nasdaq Global Select Market, 1,366 on The Nasdaq Global Market and 1,326 on The Nasdaq Capital Market.\nWe seek new listings from companies conducting IPOs, including SPACs, and direct listings as well as companies looking to switch from alternative exchanges. The 2024 new listings were comprised of the following:\nOperating company IPOs\n130\nSPAC IPOs\n50\nSwitches from the New York Stock Exchange LLC, or NYSE, and the NYSE American LLC, or NYSE American\n17\nUpgrades from OTC\n22\nETPs and Other Listings\n244\nTotal\n463\nThe Nasdaq Stock Market eligible IPO win rates:\n2024 total\n82 \n%\nOperating companies\n80 \n%\nDuring 2024, we had 17 new listings resulting from operating companies switching their listings from NYSE or NYSE American to join The Nasdaq Stock Market as well as 13 ETP switches, included in ETPs and other listings in the table above. More than $180 billion in global equity market capitalization switched to The Nasdaq Stock Market. Eligible IPO win rate only includes companies that meet quantitative Nasdaq listing standards.\nWe also offer listings on the exchanges that comprise Nasdaq Nordic and Nasdaq Baltic. For smaller companies and growth companies, we offer access to the financial markets through the Nasdaq First North alternative marketplaces. As of December 31, 2024, a total of 1,174 companies listed securities on our Nordic and Baltic exchanges.\nOur European listing customers include companies, funds and governments. Customers issue securities in the form of cash equities, depository receipts, warrants, ETPs, convertibles, rights, options, bonds or fixed-income related products. In 2024, a total of 31 new companies listed on our Nordic and Baltic exchanges. \n2\nIndex\nOur Index business develops and licenses Nasdaq-branded indices and financial products. License fees for our trademark licenses vary by product based on a percentage of underlying assets, dollar value of a product issuance, number of products or number of contracts traded. We also license cash-settled options, futures and options on futures on our indices.\nAs of December 31, 2024, 401 ETPs listed on 28 exchanges in over 20 countries tracked a Nasdaq index and accounted for $647 billion in AUM. Our flagship index, the Nasdaq-100 Index, or NDX, includes the top 100 non-financial companies listed on The Nasdaq Stock Market. More than 150 ETPs worldwide track indices in the NDX ecosystem, which had over $520 billion in assets tracking the indices as of December 31, 2024, or 80% of total AUM. \nWe provide index data products based on Nasdaq indices. Index data products include our Global Index Data Service, which delivers real-time index values throughout the trading day, and Global Index Watch/Global Index File Delivery Service, which delivers daily and historical weightings and components data, corporate actions and a breadth of additional data for the indices that we operate. \nWorkflow & Insights\nWorkflow & Insights includes our analytics and corporate solutions products.\nOur analytics products provide asset managers, investment consultants and institutional asset owners with information and analytics to make data-driven investment decisions, deploy their resources more productively, and provide liquidity solutions for private funds. Through our eVestment and Solovis platforms, we provide a suite of cloud-based solutions that help institutional investors and consultants conduct pre-investment due diligence, and monitor their portfolios post-investment. The eVestment platform also enables asset managers to efficiently distribute information about their firms and funds to asset owners and consultants worldwide.\nThe Nasdaq Fund Network and Nasdaq Data Link are additional platforms in our suite of investment data analytics offerings and data management tools. Nasdaq Fund Network gathers and distributes daily net asset values from over 50,000 funds and other investment vehicles across North America. Nasdaq Data Link strengthens our position as a leading source for financial, economic, and alternative datasets.\nCorporate solutions serves both public and private companies and organizations through our Investor Relations Intelligence, Governance Solutions and Sustainability Solutions products. Our public company clients can be companies listed on our exchanges or other U.S. and global exchanges. Our private company clients include a diverse group of organizations ranging from family-owned companies, government organizations, law firms, privately held entities, and various non-profit organizations to hospitals and healthcare systems.\nOur Investor Relations Intelligence offerings include a global team of expert consultants that deliver advisory services including Equity Surveillance & Shareholder Analysis, Investor Engagement and Perception Studies, as well as an industry-leading platform, Nasdaq IR Insight, to investor relations professionals and executive teams. These solutions allow investor relations officers and executives to better manage their investor relations programs, understand their investor base, target new investors, manage meetings and consume key data such as investor profiles, equity research, consensus estimates and news.\nThrough our Governance Solutions products, we provide an industry-leading board meeting management platform, Nasdaq Boardvantage, and consulting services that streamline the meeting process for board of directors and executive leadership teams and enable them to accelerate decision making and strengthen governance.\nOur Sustainability Solutions includes consulting services and purpose built sustainability reporting software. Our advisory practice helps companies analyze, assess and action best practices as it relates to their sustainability programs. Nasdaq Metrio is our SaaS-based end-to-end sustainability reporting platform that enables corporates to collect, measure, disclose and communicate investor-grade, audited ESG data efficiently across dozens of raters, rankers and framework organizations to drive strategic outcomes and attract investors.\nFinancial Technology\nThe Financial Technology segment delivers world leading platforms that improve the liquidity, transparency and integrity of the global economy by architecting and operating the world’s best markets. This segment comprises Financial Crime Management Technology, Regulatory Technology and Capital Markets Technology businesses.\nWe are a leading global technology solutions provider and partner to exchanges, clearing organizations, central securities depositories, banks, brokers, buy-side firms and corporate businesses, and power more than 135 marketplaces (including those operated by Nasdaq) and regulators, in more than 55 countries. Our solutions can handle a wide array of assets, including but not limited to cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products and digital currencies. Our solutions can also be used in the creation of new asset classes by non-capital markets customers, as discussed further below. \n3\nFinancial Crime Management Technology\nFinancial Crime Management Technology includes our Nasdaq Verafin solution which delivers a leading anti-financial crime platform improving the integrity and transparency of the financial world. Nasdaq Verafin provides a SaaS solution to financial institutions for fraud detection and management, AML and countering the financing of terrorism compliance and management, high-risk customer management, sanctions screening and management, and information sharing.\nNasdaq Verafin has leveraged AI for more than 20 years to deliver industry-leading financial crime management solutions, combining deep domain and technical expertise with consortium data. Nasdaq Verafin's comprehensive solutions help financial institutions tackle complex problems, including payments fraud targeting all payment channels. \nOur innovative AI-based Targeted Typology Analytics solution examines a range of behavioral, transactional, third-party, and consortium insights for more effective detection of crimes with fewer false positives and high quality results.\nOur Nasdaq Verafin solution provides the tools to help more than 2,600 North American financial institutions with regulatory compliance as well as detect, investigate and report money laundering and financial fraud. \nRegulatory Technology\nRegulatory Technology includes AxiomSL and surveillance solutions.\nAxiomSL is a global leader in risk data management and regulatory reporting solutions for the financial industry, including banks, broker dealers and asset managers. Its unique enterprise data management platform delivers data lineage, risk aggregation, analytics, workflow automation, reconciliation, validation and audit functionality, as well as disclosures. \nAxiomSL’s platform supports compliance across a wide range of global and local regulations and delivers solutions and services for financial regulatory reporting, liquidity, capital and credit, operations, trade and transaction reporting, and ESG reporting.\nOur surveillance solutions include a SaaS platform designed for banks, brokers and other market participants to assist in complying with market rules, regulations and internal market surveillance policies and serves more than 170 clients. We also provide a solution to regulators and exchanges with a robust platform to manage cross-market, cross-asset and multi-venue surveillance. This offering powers surveillance for more than 50 exchanges and 18 regulators.\nCapital Markets Technology\nCapital Markets Technology includes our Calypso and market technology solutions as well as trade management services.\nCalypso is a leading platform providing cross-asset, front-to-back trading, treasury, risk and collateral management solutions. The Calypso solution provides customers with a single platform designed to enable consolidation, innovation and growth. The platform supports front, middle and back office activities in exchange-traded and OTC instruments and supports multiple financial asset classes and the associated financial instruments. Calypso’s software application specializes in capital markets, investment management, risk management, clearing, collateral, treasury and liquidity management. \nThe Calypso platform, leveraging modern technology, is versatile and serves customers across different industries, including banks, central banks, buy-side clients, government-sponsored entities and corporate clients, and can quickly adapt to changing paradigms including new asset classes, regulations, trading venues, and trading and processing workflows. \nNasdaq’s market technology solutions are utilized by leading markets in North America, Europe, Asia, Middle East, Latin America and Africa. These solutions can handle a wide array of assets, including but not limited to cash equities, equity derivatives, currencies, various interest-bearing securities, commodities, energy products and digital currencies. Our solutions can also be used in the creation of new asset classes by non-capital markets customers. We continue to develop our SaaS business portfolio by extending and migrating our current offerings to SaaS. \nWe provide and deliver mission-critical solutions to market infrastructure operators, which include exchanges, regulators, clearinghouses and central securities depositories. These solutions are designed to cover all aspects of a market operator’s needs, from trading and clearing to risk management, index development, data, management, testing and quality assurance. \nIn addition to serving the market operators in the core capital markets, there is a demand for mission critical solutions to enable robust operation of new emerging asset classes such as crypto currencies and native digital markets. Our market technology business currently offers its services to several digital assets exchanges, and the SaaS-based Marketplace Services Platform provides next-generation marketplace capabilities spanning the transaction lifecycle to facilitate the exchange of assets, services and information across various types of market ecosystems and machine-to-machine transactions. \nOur market technology business also provides complex delivery management and systems integration. Through our integration services, we can assume responsibility for projects that involve migration to a new system and the establishment of entirely new marketplaces. We also offer operation and support for the applications, systems platforms, networks and other components included in an information technology solution, as well as advisory services. \n4\nOur trade management services provide market participants with a wide variety of alternatives for connecting to and accessing our markets for a fee. Our marketplaces may be accessed via a number of different protocols used for quoting, order entry, trade reporting and connectivity to various data feeds. WorkX, a web-based, front-end interface allows market participants to view data, utilize risk management tools, and submit and review trade reports. WorkX enables a seamless workflow and enhanced trade intelligence. In addition, we offer a variety of add-on compliance tools to help market participants comply with regulatory requirements.\nWe provide colocation services to market participants, whereby we offer firms cabinet space and power to house their own equipment and servers within our data centers. Additionally, we offer a number of wireless connectivity offerings between certain data centers using millimeter wave and microwave technology. \nMarket Services\nOur Market Services segment includes our equity derivative trading and clearing, cash equity trading, fixed income, currency and commodities trading. We operate 19 exchanges across several asset classes, including derivatives, commodities, cash equity, debt, structured products and ETPs.\nWe provide trading services in North America and Europe. In the U.S., we operate six options exchanges: Nasdaq PHLX, The Nasdaq Options Market, Nasdaq BX Options, Nasdaq ISE, Nasdaq GEMX and Nasdaq MRX. These exchanges facilitate the trading of equity, ETF, index and foreign currency options. Our combined options market share in 2024 represented the largest share of the U.S. market for multi-listed equity options. Our options trading platforms provide trading opportunities to retail investors, algorithmic trading firms and market makers, who tend to prefer electronic trading, and institutional investors, who typically require high touch services to execute their trades, which are often performed on our trading floor in Philadelphia.\nWe also operate three cash equity exchanges: The Nasdaq Stock Market, Nasdaq BX and Nasdaq PSX. Our U.S. cash equity exchanges offer trading of both Nasdaq-listed and non-Nasdaq-listed securities. The Nasdaq Stock Market is the largest single venue of liquidity for trading U.S.-listed cash equities. Market participants include market makers, broker-dealers, ATSs, institutional investors, and registered securities exchanges. We also operate a U.S. corporate bond exchange for the listing of corporate bonds. \nOur Market Services segment also includes revenues from U.S. Tape plans. The plan administrators sell quotation and last sale information for all transactions, whether traded on The Nasdaq Stock Market or other exchanges, to market participants and to data distributors, who\n \nthen provide the information to subscribers. After deducting costs, the plan administrators distribute the tape revenues to the respective plan participants based on a formula required by Regulation NMS that takes into account both trading and quoting activity.\nIn Canada, we operate an exchange with three independent markets for the trading of Canadian-listed securities: Nasdaq Canada CXC, Nasdaq Canada CX2 and Nasdaq Canada CXD.\nIn Europe, we operate exchanges in Tallinn (Estonia), Riga (Latvia) and Vilnius (Lithuania) as Nasdaq Baltic and exchanges in Stockholm (Sweden), Copenhagen (Denmark), Helsinki (Finland), and Reykjavik (Iceland) together with the clearing operations of Nasdaq Clearing, as Nasdaq Nordic. \nCollectively, the Nasdaq Nordic and Nasdaq Baltic exchanges offer trading in cash equities, depository receipts, warrants, convertibles, rights, fund units and ETFs, as well as trading and clearing of derivatives and clearing of resale and repurchase agreements. Our platform allows the exchanges to share the same trading system, which enables efficient cross-border trading and settlement, cross-exchange membership and a single source for Nordic data products. Settlement and registration of cash equity trading takes place in Sweden, Finland, and Denmark via the local central securities depositories. In addition, Nasdaq owns a central securities depository that provides notary, settlement, central maintenance and other services in the Baltic countries and Iceland.\nIn Europe, Nasdaq Nordic offers trading in derivatives, such as stock options and futures and index options and futures. Nasdaq Clearing offers CCP clearing services for stock options and futures and index options and futures.\nNasdaq Fixed Income, or NFI, provides a wide range of products and services, such as trading and clearing, for fixed income products in Sweden, Denmark, Finland, Iceland, Estonia, Lithuania and Latvia. Nasdaq is the largest bond listing venue in the Nordics, with more than 5,600 listed retail and institutional bonds. In addition, Nasdaq Nordic facilitates the trading and clearing of Nordic fixed income derivatives in a unique market structure. Buyers and sellers agree to trades in fixed income derivatives through bilateral negotiations and then report those trades to Nasdaq Clearing. Nasdaq Clearing offers CCP clearing services for fixed-income options and futures and interest rate swaps. Nasdaq Clearing also operates a clearing service for the resale and repurchase agreement market.\nNasdaq Commodities is the brand name for Nasdaq’s European commodity-related products and services such as trading and clearing. Nasdaq Commodities’ offerings include derivatives in power, natural gas and carbon emission \n5\nmarkets, seafood and electricity certificates. These products are listed on Nasdaq Oslo ASA, except for seafood, which is listed on Fish Pool, a third-party platform. In June 2023, we entered into an agreement to sell our Nordic power trading and clearing business, which was subsequently terminated in June 2024. In January 2025, we entered into a new agreement to transfer existing open positions in our Nordic power derivatives trading and clearing business to a European exchange. The completion of this transaction is subject to customary regulatory approvals. Additionally, beginning in January 2025, Nasdaq no longer offered seafood derivatives clearing.\nNasdaq Oslo ASA is the commodity derivatives exchange for European products. All trades with Nasdaq Oslo ASA are subject to clearing with Nasdaq Clearing, which offers CCP clearing services for commodities options and futures.\nWe also own a majority stake in Puro.earth, a Finnish-based leading platform for carbon removal. Puro.earth offers engineered carbon removal instruments that are verified and tradable through an open, online platform. Puro.earth’s marketplace capabilities add to our suite of sustainability-focused technologies and workflow solutions and give our clients further resources to achieve their sustainability objectives. \nENABLERS, DIFFERENTIATORS AND COMPETITION\nTechnology\nTechnology plays a key role in ensuring the growth, reliability and regulation of financial markets. We have established a technology risk program to evaluate the resiliency of critical systems, including risks associated with cybersecurity. This program is focused on identifying areas for improvement in systems, and implementing changes and upgrades to technology and processes to minimize future risk. We have continued our focus on improving the security of our technology with an emphasis on employee awareness through training, targeted phishing education campaigns, and new tool deployment for our securities operations team. See “Item 1A. Risk Factors” in this Annual Report on Form 10-K for further discussion.\nWe are focused on amplifying the impact that AI has on the business and in our products. We continue to develop products and services using AI, including generative AI, and the use of AI in product development remains a priority for us in 2025. We are currently leveraging AI to further develop products and solutions in areas such as investment analytics, investor relations and fraud and anti-money laundering, as well as to modernize markets with the SEC approval of the first AI-powered order type. For example, we are working on developing AI systems to track financial transactions across the ecosystem to determine potential fraud, money laundering, or other actions. These solutions can be utilized by our clients, including banks, other exchanges and brokers firms that use our solutions to reduce or eliminate threats.\nWe are committed to the ethical and responsible use of AI in our products, services and business operations. Our AI governance structure aligns the application of AI with our core values through a framework that addresses the new and unique risks that AI technology presents, while enabling us to explore innovation and take advantage of opportunities that AI presents to better serve our customers, advance our business objectives and bring value to our shareholders. Our AI governance framework applies risk management across AI-related product development and business usage in the company through a multi-disciplinary approach. The framework puts into practice Nasdaq’s responsible AI usage principles and considers the U.S. National Institute of Standards and Technology AI Risk Management Framework. It is administered through company-wide policies, procedures and supporting preventative and detective controls.\nWe believe that our focus on AI to enhance features of our existing offerings and in the development of new solutions, together with our significant proprietary data sets and our use of AI to drive internal operating efficiencies, provides us with a competitive advantage.\nDuring 2024, Nasdaq continued its shift from traditional on-premises deployments by utilizing and deploying cloud infrastructure. We believe that migrating our exchanges to the cloud, through our partnership with AWS, will result in improved performance and increased flexibility for our customers. We expect to move additional markets to the cloud with AWS during the next several years. The shift to cloud-based markets enables Nasdaq to provide its clients access to enhanced capabilities, including virtual connectivity services, market analytics and machine learning. We also expect to continue to leverage the cloud-based infrastructure for our market technology clients, assisting such clients in developing their own platforms and customizing their offerings for their local, rapidly changing industry dynamics. Additionally, we expanded our existing colocation facility to meet the growing demand of market participants that seek proximity to the Nasdaq trading systems. Our expanded and enhanced facility is designed to provide the optimal environment for the next generation of compute workloads and offer clients access to a wider range of services and capabilities. \nTo facilitate the exchange migration to AWS, Nasdaq will also leverage its Fusion technology platform. Fusion positions Nasdaq’s North American and European markets to manage, operate and deploy a common platform that can be used across our nine Nasdaq derivative markets, while enabling our markets for cloud deployment\n. \nCompetitive Strengths\nWe are a global, client-focused technology company with expertise in markets and financial technology. We deploy robust technology capabilities and have developed innovative solutions to further address client needs across the financial ecosystem. Our business segments complement each other and we believe that our strong competitive position in large, high-growth markets positions us for sustained growth.\n6\nOur Value Proposition\nWe operate leading platforms that can improve the liquidity, transparency, and integrity of the global financial ecosystem, allowing us to:\n•\nDevelop efficient and reliable technologies to facilitate and protect the financial system across asset classes;\n•\nEmpower our clients to effectively navigate the capital markets, achieve their sustainability goals, and maintain corporate governance excellence; and\n•\nProvide data, tools and insights that drive sound decision making while complying with evolving regulatory requirements.\nTechnological Strength\nThe strength and resiliency of our technology, enhanced by our Financial Technology segment, in meeting the advancing demands of our global customer base is vital to the continued success of our business and distinguishes us from our competitors.\nWe strive to be a trusted partner to a diverse range of clients that participate across the global financial ecosystem, including:\n•\nBanks and Financial Institutions:\n Providing banks and financial institutions with safety and integrity through a suite of trade surveillance, cloud-native fraud and anti-money laundering solutions and robust regulatory reporting software.\n•\nMarket Infrastructure Operators:\n Assisting market infrastructure operators in increasing efficiency, meeting customer needs, and growing revenue across the trade lifecycle.\n•\nBrokers and Traders:\n Helping brokers and traders to confidently plan, optimize, manage risk and execute their business vision.\n•\nMarket Participants:\n Providing market participants with access to liquidity and enabling them to efficiently consume, monitor, analyze\n,\n and capitalize on real-time market changes.\n•\nListed Companies:\n Enabling companies to access capital markets effectively, manage stakeholders and leverage technology to operate and govern effectively. \n•\nInvestors and Asset Managers:\n Offering products and services to assist investors and asset managers in optimizing their portfolios and offerings.\nCompetition\nCapital Access Platforms\nOur Data business includes proprietary data products. Proprietary data products are made up exclusively of data derived from each exchange’s systems. Competition in the data business is influenced by rapidly changing technology and the creation of new product and service offerings.\nOur proprietary data products face competition globally from alternative exchanges and trading venues that offer similar products. Our data business competes with other exchanges and third-party vendors to provide information to market participants. \nOur Listing Services business in both the U.S. and Europe provides a means of facilitating capital formation through public capital markets. There are competing ways of raising capital, and we seek to demonstrate the benefits of listing shares on our exchange. Our primary competitor for larger company stock share listings in the U.S. is NYSE. The Nasdaq Stock Market competes with local and international markets located outside the U.S. for listings of equity securities of both U.S. and non-U.S. companies that choose to list (or dual-list) outside of their home country. For example, The Nasdaq Stock Market competes for listings with exchanges in Europe and Asia. Additionally, we face competition from private equity firms that may elect to keep their portfolio companies as private companies.\nThe Listings Services business in Europe is characterized by a large number of exchanges competing for new or secondary listings. Each country has one or more national exchanges, which are often the first choice of companies in each respective country. For those considering an alternative, competing European exchanges that frequently attract many listings from outside their respective home countries include LSE, Euronext N.V. and Deutsche Börse AG. In addition to the larger exchanges, companies seeking capital or liquidity from public capital markets are able to raise capital without a regulated market listing and can consider trading their shares on smaller markets and quoting facilities.\nOur Index business offers Nasdaq-branded indices and financial products and faces competition from providers of various competing financial indices. For example, there are a number of indices that aim to track the technology sector and thereby compete with the Nasdaq-100 Index and the Nasdaq Composite Index. We face competition from investment banks, dedicated index providers, markets and other product developers, including S&P Dow Jones Indices, MSCI and FTSE Russell.\nWorkflow & Insights includes our analytics and corporate solutions businesses. Our analytics business faces competition from a broad array of data and analytics suppliers, both established firms and small start-ups.\nOur corporate solutions business faces competition that can be varied and fragmented. Other exchange operators are partnering with firms that have capabilities in this area and seeking to acquire relevant assets in order to provide investor relations services to customers alongside listing services. Our Sustainability Solutions, including Nasdaq Metrio and sustainability consulting services, are positioned in evolving markets with competitors offering multiple point solutions providing software, data or consulting services. Our Governance Solutions products compete against a wide range of companies that vary by customer segment and geography.\n7\nFinancial Technology\nFor our Financial Crime Management Technology and trade and market surveillance businesses, competitors include core banking solution providers ranging from small to large, independent solution providers, FinTech start-ups and in-house custom builds. We compete against enterprise solution providers and point solutions for clients with larger AUM. Competitors also include companies that serve multiple industries in addition to financial services with generalized solutions, such as business intelligence tools, data integrators, investigation platforms and software covering the broader compliance lifecycle. Recently, there has been an increase of FinTech start-ups shifting into the surveillance, fraud detection and AML space offering highly-specialized solutions for advanced data analytics, AI and machine learning technology. The Financial Crime Management Technology and surveillance offerings compete on a number of factors, including but not limited to, increased workflow efficiency, quality of the data, quality of alerts and pricing.\nOur Financial Crime Management Technology and surveillance offerings must demonstrate the ability to decrease false-positives and provide in-depth views into potential abuses and risks that stem from those cases. These offerings help firms reduce both the reputational and regulatory risk as well as the complexity in efforts to keep markets and financial institutions safe.\nCompetitors to our AxiomSL solutions, which includes financial, statistical and prudential reporting as well as shareholder disclosures, trade reporting and ESG reporting, include large independent solution providers, in-house solutions at financial institutions as well as some smaller independent point solution providers. As regulatory reporting becomes more granular and time sensitive, the ability of our platform to operate with speed at scale, and with consistency across functional business domains continues to set AxiomSL apart.\nCompetitors to our Calypso product, which includes solutions for cross-asset, front-to-back trading, treasury, risk and collateral management, include enterprise solution providers as well as local and regional providers focusing on smaller clients. Competition among larger clients, such as global banks, typically includes internally developed solutions. Other competitors include point solution companies, such as pricing library providers, and post-trade service providers.\nOur market technology business faces competition from exchanges and exchange-related businesses that internally develop their technology. This model has gradually changed as many operators have recognized the cost-savings made possible by buying technology from third parties. As a result, two types of competitors have emerged in our market technology business: exchange operators and technology providers unaffiliated with exchanges. These organizations make available a range of off-the-shelf technology, including trading, clearing, settlement, depository and information dissemination, and offer customization and operation \nexpertise. Market conditions in market technology are evolving rapidly, which makes continuous investment and innovation a necessity. Our partnership with AWS enables us to compete with other companies that are developing cloud-based exchanges and market technology offerings.\nOur trade management services business competes with other exchange operators, extranet providers, and data center providers. \nMarket Services\nWe face intense competition in North America and Europe. We seek to provide market participants with greater functionality, trading system stability and performance, high levels of customer service, and efficient pricing. In both North America and Europe, our competitors include other exchange operators, operators of non-exchange trading systems and banks and brokerages that operate their own internal trading pools and platforms.\nIn the U.S., our options markets compete with exchanges operated by Cboe Global Markets, Inc., or Cboe, Miami International Holdings, Inc., or MIAX, Intercontinental Exchange, Inc., or ICE, Members Exchange and BOX Options Market. In the U.S., our cash equities markets compete with exchanges operated by Cboe, ICE, MIAX, The Investors Exchange, Members Exchange and Long Term Stock Exchange. We also face competition from ATSs, known as “dark pools,” and other less-heavily regulated broker-owned trade facilitation systems, as well as from other types of OTC trading. In Canada, our cash equities exchange competes principally with exchanges such as the Toronto Stock Exchange, or TSX. \nOur U.S. Tape plans earn revenue from consolidated data products which are distributed by SEC-mandated consolidators (one for Nasdaq-listed stocks and another for NYSE and other-listed stocks) that share the revenue among the exchanges that contribute data. The consolidated data business is under competitive pressure from other securities exchanges that trade Nasdaq-listed securities. In addition, The Nasdaq Stock Market similarly competes for the tape fees from the sale of information on securities listed on other markets.\nIn Europe, our cash equities markets compete with exchanges such as Euronext N.V., Deutsche Börse AG, London Stock Exchange Group plc, or LSE, and many Multilateral Trading Facilities, or MTFs, such as Cboe, Turquoise and Aquis. Our competitors in the trading and clearing of options and futures on European equities include Eurex, Cboe, ICE Futures Europe and London Clearing House, or LCH. In addition, in equities markets in Europe, we face competition from other broker-owned systems, dark pools, Systematic Internalizers, or SIs, and other types of OTC trading. Competition among exchanges for trading European equity derivatives tends to occur where there is competition in the trading of the underlying equities. In addition to exchange-based competition, we face competition from OTC derivative markets.\n8\nThe implementation of MiFID II and MiFIR has resulted in further competitive pressure on our European trading business. SIs are attracting a significant share of electronically matched volume and compete aggressively for the trading of equity securities listed on our Nordic exchanges. Different bilateral trading systems pursuing block business also remain active in Europe.  \nOur European fixed income and commodities products\n \nand services are subject to competitive pressure from European exchanges and clearinghouses. \nINTELLECTUAL PROPERTY\nWe believe that our intellectual property assets are important for maintaining the competitive differentiation of our products, systems, software and services, enhancing our ability to access technology of third parties and maximizing our return on research and development investments.\nTo support our business objectives and benefit from our investments in research and development, we actively create and maintain a wide array of intellectual property assets, including patents and patent applications related to our innovations, products and services; trademarks related to our brands, products and services; copyrights in software and creative content; trade secrets; and through other intellectual property rights, licenses of various kinds and contractual provisions. We enter into confidentiality and invention assignment agreements with our employees and contractors, and utilize non-disclosure agreements with third parties with whom we conduct business in order to secure and protect our proprietary rights and to limit access to, and disclosure of, our proprietary information.\nWe own, or have licensed, rights to trade names, trademarks, domain names and service marks that we use in conjunction with our operations and services. We have registered many of our most important trademarks in the U.S. and in foreign countries. For example, our primary “Nasdaq” mark is a registered trademark that we actively seek to protect in the U.S. and in over 50 other countries worldwide.\nOver time, we have accumulated a robust portfolio of issued patents in the U.S. and in many other jurisdictions across the world. We currently hold rights to patents relating to certain aspects of our products, systems, software and services, but we primarily rely on the innovative skills, technical competence and marketing abilities of our personnel. No single patent is in itself core to the operations of Nasdaq or any of its principal business areas.\nCORPORATE VENTURE PROGRAM\nWe operate a corporate venture program to make minority investments primarily in emerging growth FinTech companies that are strategically relevant to, and aligned with, Nasdaq. Investments are made through the venture program to further our research and development efforts and accelerate the path to commercial viability. We expect that capital invested will continue to be modest and will not have a material impact on our consolidated financial statements, existing capital return or deployment priorities. Since its inception in 2017, our venture program has grown in size and has invested in companies covering various sectors, including data, analytics and workflow technologies, blockchain and digital assets, market infrastructure, anti-financial crime, new marketplaces and enabling technologies. As of December 31, 2024, our investments, which primarily include equity and convertible debt investments, were valued at $218 million.\nENVIRONMENTAL, SOCIAL AND GOVERNANCE MATTERS\nNasdaq is committed to our long-term governance and sustainability strategy, advocacy and oversight. We continue to engage with internal and external stakeholders at all levels regarding sustainability matters. During 2024, we continued our corporate, community and commercial ESG efforts, including furthering our commitment to climate change awareness, reducing our environmental impact, building a workplace culture of inclusivity and evolving our portfolio of sustainability-related solutions and services.\nThe Nominating & ESG Committee has formal responsibility and oversight for corporate ESG policies and programs and receives regular reports on key ESG matters and initiatives. Our Corporate ESG Steering Committee serves as the central coordinating body for our ESG strategy; it is co-chaired by executive leaders and comprised of a cross-functional group of Nasdaq senior executives.\nWe continued to be committed to our decarbonization and climate strategy. We have taken steps to achieve carbon neutrality across all our business operations for the seventh consecutive year after we retire our remaining carbon offsets for 2024 by the third quarter of 2025. We are working towards our short- and long-term net-zero science-based targets, which were validated and approved by the Science Based Targets initiative in 2022. In 2024, we were named to the Dow Jones Best-in-Class World Index for the first time, the Dow Jones Best-in-Class North America Index for the ninth consecutive year and Just Capital’s Just100 list of America’s most just companies for the second consecutive year. In addition, Nasdaq maintained industry leading scores from ESG rating agencies, including a rating of “AA,” from MSCI placing Nasdaq in MSCI’s “Leaders” category.\n9\nOur environmental footprint is relatively small due to the nature of our business operations. We remain committed to reducing our environmental impact, focusing on several key areas, including our energy use, the management of our workspaces and how we conduct business travel, and engagement with our value chain. We seek to reduce our atmospheric carbon emissions and we manage our water use and the waste associated with our business operations. \nWe help companies of all maturity levels through our robust combination of technology, tools, data, insights and capital market solutions.\nOur sustainability-focused solutions are centered around three strategic pillars to meet our audience’s needs in a rapidly evolving market:\n•\nRegulatory-focused Workflows:\n A powerful, built-for-purpose sustainability data management platform with user-friendly workflows for the most impactful regulation and climate strategy needs.\n•\nAI-powered Insights:\n Proprietary insights powered by trusted data sources and generative AI to provide our users with a better lens to make faster sustainability decisions.\n•\nIn-house Expertise:\n In-house sustainability expertise combined with technology to provide full-service support to organizations navigating global compliance requirements, while also monitoring the capital markets.\nDuring 2024, we also maintained, and continued to expand, our portfolio of sustainability services and solutions for our clients and stakeholders.\nIn 2024, we requested our existing leading suppliers by spend to attest to our Supplier Code of Ethics. The Supplier Code of Ethics, which is available on our website, encourages our suppliers and vendors to adopt sustainability and environmental practices in line with our published Environmental Practices Statement. Additionally, our new suppliers are required to attest to the Supplier Code of Ethics in connection with the commencement of their engagement.\nREGULATION\nWe are subject to extensive regulation in the U.S., Canada and Europe.\nU.S. Regulation\nU.S. federal securities laws establish a system of cooperative regulation of securities markets, market participants and listed companies. SROs conduct the day-to-day administration and regulation of the nation’s securities markets under the close supervision of, and subject to extensive regulation, oversight and enforcement by, the SEC. SROs, such as national securities exchanges, are registered with the SEC.\nThis regulatory framework applies to our U.S. business in the following ways:\nNational Securities Exchanges.\n SROs in the securities industry are an essential component of the regulatory scheme of the Exchange Act responsible for providing fair and orderly markets and protecting investors. The Exchange Act and the rules thereunder, as well as each SRO’s own rules, impose many regulatory and operational responsibilities on SROs, including the day-to-day responsibilities for market and broker-dealer oversight. Moreover, an SRO is responsible for enforcing compliance by its members, and persons associated with its members, with the provisions of the Exchange Act, the rules and regulations thereunder, and the rules of the SRO, including rules and regulations governing the business conduct of its members.\nNasdaq currently operates three cash equity, six options markets and one corporate bond market in the U.S. We operate The Nasdaq Stock Market, The Nasdaq Options Market and the Corporate Bond Market pursuant to The Nasdaq Stock Market’s SRO license; Nasdaq BX and Nasdaq BX Options pursuant to Nasdaq BX’s SRO license; Nasdaq PSX and Nasdaq PHLX pursuant to Nasdaq PHLX’s SRO license; and Nasdaq ISE, Nasdaq GEMX and Nasdaq MRX, each of which operates an options market under its own SRO license. As SROs, each entity has separate rules pertaining\n \nto its broker-dealer members and listed companies, as applicable. Broker-dealers that choose to become members of our exchanges are subject to the rules of those exchanges.\nAll of our U.S. national securities exchanges are subject to SEC oversight, as prescribed by the Exchange Act, including periodic and special examinations by the SEC. Our exchanges also are potentially subject to regulatory or legal action by the SEC at any time in connection with alleged regulatory violations. We have been subject to a number of routine reviews and inspections by the SEC or external auditors in the ordinary course, and we have been and may in the future be subject to SEC enforcement proceedings. To the extent such actions or reviews and inspections result in regulatory or other changes, we may be required to modify the manner in which we conduct our business, which may adversely affect our business, operating results and financial condition.\nSection 19 of the Exchange Act provides that our exchanges must submit to the SEC proposed changes to any of the SROs’ rules, practices and procedures, including revisions to provisions of our certificate of incorporation and by-laws that constitute SRO rules. The SEC will typically publish such proposed changes for public comment, after which the SEC may approve or disapprove the proposal, as it deems appropriate. SEC approval requires a finding by the SEC that the proposal is consistent with the requirements of the Exchange Act and the rules and regulations thereunder. Pursuant to the requirements of the Exchange Act, our exchanges must file with and seek approval from the SEC for, among other things, all proposals to change their pricing structure.\n10\nNasdaq conducts real-time market monitoring, certain equity surveillance not involving cross-market activity, most options surveillance, rulemaking, enforcement and membership functions through our Nasdaq Regulation department. We review suspicious trading behavior discovered by our regulatory staff, and depending on the nature of the activity, may refer the activity to FINRA for further investigation. Pursuant to regulatory services agreements between FINRA and our SROs, FINRA provides certain regulatory services to our markets, including some regulation of trading activity and surveillance and investigative functions. Our SROs retain ultimate regulatory responsibility for all regulatory activities performed under regulatory agreements by FINRA, and for fulfilling all regulatory obligations for which FINRA does not have responsibility under the regulatory services agreements. \nIn addition to its other SRO responsibilities, The Nasdaq Stock Market, as a listing market, also is responsible for overseeing each listed company’s compliance with The Nasdaq Stock Market’s financial and corporate governance standards. Our listing qualifications department evaluates applications submitted by issuers seeking to list their securities on The Nasdaq Stock Market to determine whether the quantitative and qualitative listing standards have been satisfied. Once securities are listed, the listing qualifications department monitors each issuer’s on-going compliance with The Nasdaq Stock Market’s continued listing standards.\nBroker-dealer regulation.\n Nasdaq’s broker-dealer subsidiaries are subject to regulation by the SEC, the SROs and various state securities regulators. Nasdaq operates three broker-dealers: Nasdaq Execution Services, LLC, NFSTX, LLC, and Nasdaq Capital Markets Advisory LLC. Each broker-dealer is registered with the SEC, a member of FINRA and registered in the U.S. states and territories required by the operation of its business.\n \nIn addition, we own a minority interest in NPM.\nNasdaq Execution Services operates as our routing broker for sending orders from Nasdaq’s U.S. cash equity and options exchanges to other venues for execution. NFSTX is a registered ATS and acts as an intermediary to facilitate secondary transactions in certain funds (both registered or not registered under the Investment Company Act of 1940), business development companies, certain closed-end funds and private real estate investment funds. Nasdaq Capital Markets Advisory acts as a third-party advisor to privately-held or publicly-traded companies during IPOs and various other offerings.\nThe SEC, FINRA and SROs adopt, and require strict compliance with, rules and regulations applicable to broker-dealers. The SEC, SROs and state securities commissions may conduct administrative proceedings which can result in censures, fines, the issuance of cease-and-desist orders or the suspension or expulsion of a broker-dealer, its officers or employees. The SEC and state regulators may also institute proceedings against broker-dealers seeking an injunction or other sanction. All broker-dealers have an SRO that is \nassigned by the SEC as the broker-dealer’s Designated Examining Authority. The Designated Examining Authority is responsible for examining a broker-dealer for compliance with the SEC’s financial responsibility rules. FINRA is the current Designated Examining Authority for each of our broker-dealer subsidiaries.\nOur registered broker-dealers are subject to regulatory requirements intended to ensure their general financial soundness and liquidity, which require that they comply with certain minimum capital requirements. As of December 31, 2024, each of our broker-dealers were in compliance with applicable capital requirements.\nRegulatory contractual relationships with FINRA.\n \nOur SROs have signed a series of regulatory service agreements covering the services FINRA provides to the respective SROs. Under these agreements, FINRA personnel act as our agents in performing the regulatory functions outlined above, and FINRA bills us a fee for these services. These agreements ensure that the markets for which we are responsible are properly regulated. In conjunction with these agreements, we also perform certain of these functions ourselves. In addition, our SROs retain ultimate regulatory responsibility for all regulatory activities performed under these agreements by FINRA.\nExchange Act Rule 17d-2 permits SROs to enter into agreements, commonly called Rule 17d-2 agreements, approved by the SEC with respect to enforcement of common rules relating to common members. Our SROs have entered into several such agreements under which FINRA assumes regulatory responsibility for various rules or areas covered by agreements.\nRegulation NMS and Options Intermarket Linkage Plan.\n We are subject to Regulation NMS for our cash equity markets, and our options markets have joined the Options Intermarket Linkage Plan. These are designed to facilitate the routing of orders among exchanges to create a national market system as mandated by the Exchange Act. One of the principal purposes of a national market system is to ensure that brokers may execute investors’ orders at the best market price. Both Regulation NMS and the Options Intermarket Linkage Plan require that exchanges avoid trade-throughs, locking or crossing of markets and provide market participants with electronic access to the best prices among the markets for the applicable cash equity or options order.\nIn addition, Regulation NMS requires that every national securities exchange on which an NMS stock is traded and every national securities association act jointly pursuant to one or more national market system plans to disseminate consolidated information, including a national best bid and national best offer, on quotations for transactions in NMS stocks, and that such plan or plans provide for the dissemination of all consolidated information for an individual NMS stock through a single plan processor.\n11\nThe UTP Plan was filed with and approved by the SEC as a national market system plan in accordance with the Exchange Act and Regulation NMS to provide for the collection,\n \nconsolidation and dissemination of such information for Nasdaq-listed securities. The Nasdaq Stock Market serves as the processor for the UTP Plan pursuant to a contract for a two-year term through October 2025. The Nasdaq Stock Market also serves as the administrator for the UTP Plan. To fulfill its obligations as the processor, The Nasdaq Stock Market has designed, implemented, maintained, and operated a data processing and communications system, hardware, software and communications infrastructure to provide processing for the UTP Plan. As the administrator, The Nasdaq Stock Market manages the distribution of market data, the collection of the resulting market data revenue, and the dissemination of that revenue to plan members in accordance with the terms of the UTP Plan and of Regulation NMS.\nRegulation SCI.\n Regulation SCI is a set of rules designed to strengthen the technology infrastructure of the U.S. securities markets. Regulation SCI applies to national securities exchanges, operators of certain ATSs, market data information providers and clearing agencies, subjecting these entities to extensive compliance obligations, with the goals of reducing the occurrence of technical issues that disrupt the securities markets and improving recovery time when disruptions occur.\n \nWe implemented an inter-disciplinary program to ensure compliance with Regulation SCI. We have also created Regulation SCI policies and procedures, updated internal policies and procedures, and developed an information technology governance program to ensure compliance.\nRegulation of Registered Investment Advisor Subsidiary.\n Our subsidiary Nasdaq Dorsey Wright, or NDW, is an investment advisor registered with the SEC under the Investment Advisors Act of 1940. In this capacity, NDW is subject to oversight and inspections by the SEC. Among other things, registered investment advisors like NDW must comply with certain disclosure obligations, advertising and fee restrictions and requirements relating to client suitability and custody of funds and securities. Registered investment advisors are also subject to anti-fraud provisions under both federal and state law.\nCFTC Regulation. \nThe Dodd-Frank Wall Street Reform and Consumer Protection Act resulted in increased CFTC regulation of our use of certain regulated derivatives products, as well as the operations of some of our subsidiaries outside the U.S. and their customers.\nCanadian Regulation\nRegulation of Nasdaq Canada is performed by the Canadian Securities Administrators, an umbrella organization of Canada’s provincial and territorial securities regulators. As a recognized exchange in Ontario, Nasdaq Canada must comply with the terms and conditions of its exchange recognition order. While exempt from exchange recognition in each jurisdiction in Canada other than Ontario where \nNasdaq Canada carries on business, Nasdaq must also comply with the terms and conditions of an exemption order granted by the other jurisdictions in order to maintain its exemptive status. Oversight of the exchange is performed by Nasdaq Canada’s lead regulator, the Ontario Securities Commission. \nNasdaq Canada is subject to several national marketplace related instruments which set out requirements for marketplace operations, trading rules and managing electronic trading risk. Exchange terms and conditions include but are not limited to, requirements for governance, regulation, rules and rulemaking, fair access, conflict management and financial viability.\nEuropean Regulation\nRegulation of our markets in the European Union and the European Economic Area focuses on matters relating to financial services, listing and trading of securities, clearing and settlement of securities and commodities, as well as issues related to market abuse.\nWe are subject to MiFID II and MiFIR, the European Union’s Market Abuse Regulation, which primarily affects our European trading businesses. Many of the provisions of MiFID II and MiFIR are implemented through technical standards drafted by the European Securities and Markets Authority and approved by the European Commission. In addition, in 2016, the European Union adopted legislation on governance and control of the production and use of benchmark indices. The Benchmark Regulation became effective in the European Union beginning in 2018, and Nasdaq must comply beginning January 1, 2026 in relation to benchmarks provided by non-European Nasdaq entities as well as European Nasdaq entities. As the regulatory environment continues to evolve and related opportunities arise, we intend to continue developing our products and services to ensure that the exchanges and clearinghouse that comprise Nasdaq Nordic and Nasdaq Baltic maintain favorable liquidity and offer fair and efficient trading. \nIn addition, proposed rules under MiFID II and MiFIR rules include provisions potentially impacting various parts of Nasdaq’s exchanges and data business, including a proposal to establish a European consolidated tape of pre- and/or post-trade data. \nThe entities that operate trading venues in the Nordic and Baltic countries are each subject to local regulations. As a result, we have a strong local presence in each jurisdiction in which we operate regulated businesses. The regulated entities have decision-making power and can adopt policies and procedures and retain resources to manage all operations subject to their license. In Sweden, general supervision of the Nasdaq Stockholm exchange is carried out by the SFSA, while Nasdaq Clearing’s role as CCP in the clearing of derivatives is supervised by the SFSA and overseen by the Swedish central bank (Riksbanken). Additionally, as a function of the Swedish two-tier supervisory model, certain surveillance of the exchange market is carried out by the \n12\nNasdaq Stockholm exchange, through its surveillance function.\nNasdaq Stockholm’s exchange activities are regulated primarily by the SSMA, which implements MiFID II into Swedish law and which sets up basic requirements for the board of directors of the exchange and the exchange’s share capital, and which also outlines the conditions on which exchange licenses are issued. The SSMA also provides that any changes to the exchange’s articles of association following initial registration must be approved by the SFSA. Nasdaq Clearing holds the license as a CCP under EMIR.\nThe SSMA requires exchanges to conduct their activities in an honest, fair and professional manner, and in such a way as to maintain public confidence in the securities markets. When operating a regulated market, an exchange must apply the principles of free access (i.e., that each person which meets the requirements established by law and by the exchange may participate in trading), neutrality (i.e., that the exchange’s rules for the regulated market are applied in a consistent manner to all those who participate in trading) and transparency (i.e., that the participants must be given prompt, simultaneous and correct information concerning trading and that the general public must be given the opportunity to access this information). Additionally, the exchange operator must identify and manage the risks that may arise in its operations, use secure technical systems and identify and handle the conflicts of interest that may arise between the exchange or its owners’ interests and the interest in safeguarding effective risk management and secure technical systems. Similar requirements are set up by EMIR in relation to clearing operations.\nThe SSMA also contains the framework for both the SFSA’s supervisory work in relation to exchanges and clearinghouses and the surveillance to be carried out by the exchanges themselves. The latter includes the requirement that an exchange should have “an independent surveillance function with sufficient resources and powers to meet the exchange’s obligations.” That requires the exchange to, among other things, supervise trading and price information, compliance with laws, regulations and good market practice, participant compliance with trading participation rules, financial instrument compliance with relevant listing rules and the extent to which issuers meet their obligation to submit regular financial information to relevant authorities.\nDue to the underlying EU regulation, the regulatory requirements in the other Nordic and Baltic countries in which a Nasdaq entity has a trading venue are similar to the requirements in Sweden described above. The supervisory authorities in Sweden, Iceland, Denmark, Finland and Norway all cooperate to safeguard effective and comprehensive supervision of the exchanges comprising Nasdaq Nordic and the systems operated by it, and to ensure a common supervisory approach. \nNasdaq owns a central securities depository known as Nasdaq CSD SE (Societas Europaea)¸ that provides notary, settlement, central maintenance and other services in the Baltic countries and in Iceland. Nasdaq CSD SE is licensed under the European Central Securities Depositories Regulation and is supervised by the respective regulatory institutions.\nWe operate a licensed exchange, Nasdaq Oslo ASA, in Norway that trades and lists commodity derivatives. Although Norway is not a member of the EU, as a result of the European Economic Area, or EEA, agreement (entered into between the EU and European Free Trade Association) the regulatory environment is broadly similar to what applies in EU member states. Since Norway has adopted legislation mirroring the provisions of MiFID II and MIFIR, the regulatory environment in Norway is similar to Sweden. The Financial Supervisory Authority of Norway supervises the Norwegian exchange on an autonomous basis and the Norwegian exchange also has a separate market surveillance function overseen by the Financial Supervisory Authority.\nConfidence in capital markets is paramount for trading to function properly. Nasdaq Nordic carries out market surveillance through an independent unit that is separate from the business operations. The surveillance work is conceptually organized into two functions: one for the review and admission of listing applications and surveillance activities related to issuers (issuer surveillance) and one for surveillance of trading (trading surveillance). The real-time trading surveillance for the Finnish, Icelandic, Danish and Swedish markets has been centralized in Stockholm. In addition, there are designated personnel who carry out surveillance activities at Nasdaq Oslo and the three Baltic exchanges. In Finland, Sweden and Estonia, decisions to list new companies on the main market are made by listing committees that have external members in addition to members from each respective exchange and in the other countries the decision is made either by the respective president of the exchange or by the executive board.\nIf there is suspicion that a listed company or member has acted in breach of exchange regulations, the matter is handled by the respective surveillance department. Serious breaches are considered by the respective disciplinary committee in Denmark, Finland, Iceland, Sweden and Norway. Suspected insider trading is reported to the appropriate authorities in the respective country.\n13\nIn the United Kingdom, The Nasdaq Stock Market, Nasdaq Oslo ASA, Nasdaq Stockholm AB, Nasdaq Copenhagen A/S, and Nasdaq Helsinki Ltd are each subject to regulation by the Financial Conduct Authority as “Recognised Overseas Investment Exchanges.” Nasdaq Clearing is registered as a recognized third country CCP with the Bank of England under the temporary recognition regime. The registration became effective on December 31, 2020 and lasts until December 31, 2026 (which may be extended further), during which time Nasdaq Clearing may continue to act as a CCP vis-a-vis UK members. Nasdaq Clearing has submitted its application for permanent recognition and is awaiting further information as to the process and timeline from the Bank of England.\nHUMAN CAPITAL MANAGEMENT\nNasdaq has continued to strengthen our commitment to, and investment in, attracting, retaining, developing and motivating our employees during 2024. \nWe also continued our efforts to create an inclusive work environment of equal opportunity, where employees feel respected and valued for their contributions, and where Nasdaq and its employees have opportunities to make positive contributions to our local communities. \nAdditional information regarding our human capital management matters can be found in our annual Sustainability Report, which will be available on our website later in 2025. Our Sustainability Report and other information on our website are not incorporated by reference into this Annual Report on Form 10-K.\nAs of December 31, 2024, Nasdaq had 9,162 full and part-time employees, including employees of non-wholly owned consolidated subsidiaries. \nFlexible and Hybrid Workplace\nFollowing the COVID pandemic, we re-shaped our expectations of the work environment. Most of our employees balance their time between several days in the office and several days working from home, contributing to a positive work-life balance. In addition to vacation time, we provide every employee six paid “flex” days per year, to be used as extra vacation days for mental health, family time, or any other purpose. We have found this flexibility has contributed both to our high engagement scores among current employees, as well as a positive element in attracting new talent to join Nasdaq. \nTalent Management and Development\nWe continued to increase our efforts in attracting and retaining our employees. Nasdaq seeks to hire world-class and innovative talent across the globe. \nIn 2024, our internal employee engagement score, based on our biannual employee engagement surveys, which most recently had a 94% participation rate, reached its record high rating of 80% favorable, with 14% neutral, placing us in the top 10% of tech companies, according to our survey provider. Our workforce voluntary attrition rate during 2024 was approximately 6.7%, which was nearly one percentage point lower than 2023.\nDuring 2024, we continued a series called the Manager Forum, facilitated by our CEO and other senior and mid-career leaders, to engage managers in sustained leadership development, alongside our existing formal leadership development curriculum. \nOur AI-driven career development platform, the Career Hub, matches employees, based on their career aspirations, to internal training, potential mentors, short-term projects and full-time internal roles. This helped us again increase our career satisfaction scores in our biannual employee engagement survey and supported employee retention.\nWe have invested in professional development for our employees, including offering access to professional development programs; providing tuition assistance to employees enrolled in degree-granting academic programs; holding internal career fairs and career development programs; connecting employees to our formal mentoring programs and providing one-on-one professional coaching opportunities. Our 2024 AI training initiative saw 98% of the firm participating in at least one program to bolster their AI knowledge and skills.\nTo reward our employees at various stages of their tenure with Nasdaq, we continued our anniversary recognition program that includes Nasdaq-branded merchandise, and, for major milestones, recognition on our Nasdaq Tower in Times Square. Additionally, our peer-to-peer employee recognition program rewards employees and highlights recognized employees on our internal social media channels, further amplifying the recognition. In 2024, more than 18,600 peer-to-peer recognition awards were issued by employees to other employees across the organization.  \nA Culture of Inclusion\nAt Nasdaq, three pillars guide our inclusion efforts: \nWorkforce, Workplace and Marketplace\n. \n•\nWorkforce \nseeks to ensure that\n \nour employee population is representative of the communities in which we operate. \n•\nWorkplace\n seeks to create a positive, equitable workplace experience for all employees of Nasdaq. \n•\nMarketplace \naims to positively influence our peers in the capital market ecosystem and invest in the local communities where we operate.\n14\nWorkplace Demographics\nOur global female employee base in 2024 was approximately 36%. Our minority representation in the U.S., which includes Asian, Black/African American, Hispanic/Latino, Multiracial, Native American, Native Hawaiian, and Pacific Islander employees, was 33% in 2024.\nGender and Ethnicity Data as of December 31, 2024 and 2023 are presented below:\n \n* In the charts above, the \"not disclosed\" percentage includes employees that have chosen not to disclose and race and ethnicities that are less than 0.3% of our total employee headcount. \nCompensation and Benefits \nOur Total Rewards program is designed to attract, retain, and empower employees to successfully execute our growth strategy and our mission to better serve our clients. Our comprehensive Total Rewards program reflects our commitment to protecting our employees’ health, well-being and financial security.\n15\nOur pay-for-performance compensation programs includes market-competitive base salaries, annual bonuses or sales commissions, and equity grants.\n \nThe majority of our employees are granted annual, long-term equity awards, enabling them to be owners of the company, committed to our long-term success and aligning their interests with the short-term and long-term interests of our shareholders.\nBeyond compensation, we offer a suite of programs, benefits, perquisites, and resources. Our core benefits include health (medical, dental, and vision) and risk insurances (life and disability), retirement plans, and an employee stock purchase plan. We also offer robust paid time-off benefits which include vacation, incidental sick days and parental leave. In addition, all Nasdaq employees, regardless of their location in any of our global offices, are offered paid time off for key life events such as bereavement leave and volunteer days. Our North American employees continue to have access to our flexible time off policy. These programs, coupled with our hybrid work schedules, are designed to meet the various needs of our workforce. \nIn 2024, we continued to build awareness of our wellness programs and increase support to our employees through on-site and virtual events such as Wellness Week and World Mental Health Day. Wellness Week included six virtual webinars for U.S. employees to learn about the scope of wellness benefits offered. World Mental Health Day was a month-long campaign where managers and employees could participate in webinars to learn about mental health in the workplace. The benefits team also started “well-being moments,” which are monthly reminders shared in employee newsletters and town hall meetings to improve the physical, mental and financial health of our employees in their personal and professional life.  \nCommunity Involvement\nNasdaq’s “Purpose” initiative comprises our philanthropic, community outreach, entrepreneurial support and employee volunteerism programs, all designed to leverage our unique place at the center of capital creation, markets, and technology and drive stronger economies, more equitable opportunities and contribute to a more sustainable world.   \nThrough our Nasdaq GoodWorks Corporate Responsibility Program, we have committed to supporting the communities in which we live and work by providing eligible full and part-time employees with two paid days off per year to volunteer. We also match charitable donations of all Nasdaq employees and contractors up to $1,000, or more in certain circumstances, per calendar year. In 2024, Nasdaq employees raised over $550,000, including donations and matches, supporting more than 800 charities worldwide.  \nDuring 2024, Nasdaq held its fourth annual Purpose Week, a week dedicated to celebrating and advancing economic progress for all. Throughout Purpose Week, we hosted employees from around the world for panels and workshops highlighting our continued purpose of advancing economic progress for all. Employees participated in a variety of activities, including packing Thanksgiving food kits, preparing financial literacy guidebooks and building solar lights for communities affected by natural disasters \nAdditionally, Nasdaq also hosted its second annual Purpose Forum in 2024, focusing on the theme “A Better Tomorrow: Built for Purpose.” The Purpose Forum convened thought leaders, change-makers, and innovators to discuss creating positive impact through embracing and adopting purpose-driven strategy, culture, and brand. \nThe Nasdaq Foundation works with organizations that promote and support under-resourced communities by reimagining investor engagement and equipping communities with the financial knowledge needed to share in the wealth that markets create. During 2024, the Nasdaq Foundation provided grants to 23 organizations that share that mission. These grants were awarded to, among others: The Legal Aid Society, which provides through its Community Development Project legal trainings and technical assistance to small businesses in New York City; Future Founders, which empowers entrepreneurs ages 18-30 to launch and grow their own businesses; and World Services for the Blind, in collaboration with Penny Forward, which will create the first investing courses specifically designed for people who are blind or have low vision. \nNASDAQ WEBSITE AND AVAILABILITY OF SEC FILINGS\nWe file periodic reports, proxy statements and other information with the SEC. The SEC maintains a website that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. The address of that site is www.sec.gov.\nOur website is ir.nasdaq.com. Information on our website is not a part of this Form 10-K. We make available free of charge on our website, or provide a link to our SEC filings, including our Forms 10-K, Forms 10-Q and Forms 8-K and any amendments to these documents, that are filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. To access these filings, go to our website and click on “Financials” then click on “SEC Filings.”\n16",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the financial condition and results of operations of Nasdaq refers to the year over year comparison for the fiscal years ended December 31, 2024 and 2023 and should be read in conjunction with our consolidated financial statements and related notes included in this Form 10-K, as well as the discussion under “Part I, Item 1A. Risk Factors.” For further discussion of our growth strategy, products and services, and competitive strengths, see “Part I, Item 1. Business.” For a similar discussion comparing the fiscal years ended December 31, 2023 and 2022, refer to “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, which was previously filed with the SEC on February 21, 2024.\nThe period over period percentages below are calculated based on exact dollars, and therefore may not recalculate exactly using rounded numbers as presented in millions in the tables below. \nEXECUTIVE OVERVIEW\nNasdaq is a global technology company serving corporate clients, investment managers, banks, brokers, and exchange operators as they navigate and interact with the global capital markets and the broader financial system. We aspire to deliver world-leading platforms that improve the liquidity, transparency, and integrity of the global economy. Our diverse offering of data, analytics, software, exchange capabilities, and client-centric services enables clients to optimize and execute their business vision with confidence.\nWe manage, operate and provide our products and services in three business segments: Capital Access Platforms, Financial Technology and Market Services.\n2024 Highlights\n•\nThroughout 2024, Nasdaq substantially completed the integration of AxiomSL and Calypso. \n•\nIn 2024, our Financial Technology segment delivered more than 10% ARR growth, reflecting an increase in new clients, cross-sells and upsells. \n•\nNasdaq extended listing leadership in 2024 with its sixth consecutive year as the top U.S. exchange by number of IPOs and proceeds raised.\n•\nIn 2024, Nasdaq achieved an 82% win rate among Nasdaq-eligible IPOs in the U.S., representing 180 deals and $23 billion in total proceeds raised.\n•\nIn 2024, our Index business had $80 billion of net inflows, including $28 billion in the fourth quarter, and reported its fifth consecutive record quarter in ETP AUM, reaching $647 billion as of December 31, 2024. In addition, the Index business launched a record 116 new products with its clients.\n•\nIn 2024, our Market Services segment achieved record net revenue. The Closing Cross set full year records in both share volume and notional value traded.\nMacroeconomic environment\nOur business performance can be positively or negatively impacted by a number of factors, including general economic conditions, current or expected inflation, interest rate fluctuations, market volatility, changes in investment patterns and priorities, regulatory changes, pandemics and other factors that are generally beyond our control. For example, higher overall U.S. trading volumes in 2024 as compared to 2023 has led to an increase in our U.S. Equity Derivative Trading and U.S. Cash Equity Trading revenues. Market factors also contributed to higher valuations in Nasdaq Indices. In our corporate solutions business, we managed through market challenges, as corporate buying cycles remained elongated throughout the year. To the extent that global or national economic conditions weaken and result in slower growth or recessions, our business may be negatively impacted. See “Part I, Item 1A. Risk Factors” for further discussion. \n36\nNasdaq\n’\ns Operating Results\nThe following table summarizes our financial performance for the year ended December 31, 2024 compared to the same period in 2023 and for the year ended December 31, 2023 compared to the same period in 2022. The comparability of our results of operations between reported periods is impacted by the acquisition of Adenza in November 2023. See Note 4, “Acquisition,” to the consolidated financial statements for further discussion. For a detailed discussion of our results of operations, see “Segment Operating Results” below.\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions, except per share amounts)\n \n \nRevenues less transaction-based expenses\n$\n4,649 \n$\n3,895 \n$\n3,582 \n19.4 \n%\n8.8 \n%\nOperating expenses\n2,851 \n2,317 \n2,018 \n23.0 \n%\n14.9 \n%\nOperating income\n$\n1,798 \n$\n1,578 \n$\n1,564 \n13.9 \n%\n0.8 \n%\nNet income attributable to Nasdaq\n$\n1,117 \n$\n1,059 \n$\n1,125 \n5.5 \n%\n(5.9)\n%\nDiluted earnings per share\n$\n1.93 \n$\n2.08 \n$\n2.26 \n(7.4)\n%\n(7.8)\n%\nCash dividends declared per common share\n$\n0.94 \n$\n0.86 \n$\n0.78 \n9.3 \n%\n10.3 \n%\nIn countries with currencies other than the U.S. dollar, revenues and expenses are translated using monthly average exchange rates. Impacts on our revenues less transaction-based expenses and operating income associated with fluctuations in foreign currency are discussed in more detail under “Item 7A. Quantitative and Qualitative Disclosures About Market Risk.”\nThe following chart summarizes our ARR (in millions): \nARR for a given period is the current annualized value derived from subscription contracts with a defined contract value. This excludes contracts that are not recurring, are one-time in nature, or where the contract value fluctuates based on defined metrics. ARR is currently one of our key performance metrics to assess the health and trajectory of our recurring business. ARR does not have any standardized definition and is therefore unlikely to be comparable to similarly titled measures presented by other companies. ARR should be viewed independently of revenue and deferred revenue and is not intended to be combined with or to replace either of those items. For AxiomSL and Calypso recurring revenue contracts, the amount included in ARR is consistent with the amount that we invoice the customer during the current period. Additionally, for AxiomSL and Calypso recurring revenue contracts that include annual values that increase over time, we include in ARR only the annualized value of components of the contract that are considered active as of the date of the ARR calculation. We do not include the future committed increases in the contract value as of the date of the ARR calculation. ARR is not a forecast and the active contracts at the end of a reporting period used in calculating ARR may or may not be extended or renewed by our customers.\n37\nThe ARR chart includes:\n▪\nCapital Access Platforms\n◦\nProprietary market data subscriptions and annual listing fees within our Data & Listing Services business\n◦\nIndex data subscriptions and guaranteed minimum on futures contracts within our Index business\n◦\nSubscription contracts under our Workflow & Insights business\n▪\nFinancial Technology\n◦\nFinancial Crime Management Technology SaaS subscription contracts excluding one-time service requests\n◦\nRegulatory Technology SaaS subscription and support contracts excluding one-time service requests\n◦\nCapital Markets Technology SaaS subscription and support contracts excluding one-time service requests\nThe following chart summarizes our quarterly annualized SaaS revenues for Solutions, which comprises our Capital Access Platforms and Financial Technology segments, for December 31, 2024, 2023 and 2022 (in millions):\nSEGMENT OPERATING RESULTS\nThe following table presents our revenues by segment:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\n \nCapital Access Platforms\n$\n1,972 \n$\n1,770 \n$\n1,682 \n11.4 \n%\n5.2 \n%\nFinancial Technology\n1,621 \n1,099 \n864 \n47.5 \n%\n27.1 \n%\nMarket Services\n3,771 \n3,156 \n3,632 \n20.9 \n%\n(13.4)\n%\nOther revenues\n36 \n39 \n48 \n(8.6)\n%\n(16.9)\n%\nTotal revenues\n$\n7,400 \n$\n6,064 \n$\n6,226 \n22.0 \n%\n(2.6)\n%\nTransaction rebates\n(2,026)\n(1,838)\n(2,092)\n10.2 \n%\n(12.1)\n%\nBrokerage, clearance and exchange fees\n(725)\n(331)\n(552)\n119.1 \n%\n(40.1)\n%\nTotal revenues less transaction-based expenses\n$\n4,649 \n$\n3,895 \n$\n3,582 \n19.4 \n%\n8.8 \n%\nThe following chart presents our Capital Access Platforms, Financial Technology and Market Services segments as a percentage of our total revenues, less transaction-based expenses. \n38\nCapital Access Platforms\nThe following tables present revenues and ARR from our Capital Access Platforms segment:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\n \nData & Listing Services\n$\n754 \n$\n749 \n$\n727 \n0.7 \n%\n3.0 \n%\nIndex\n706 \n528 \n486 \n33.7 \n%\n8.6 \n%\nWorkflow & Insights\n512 \n493 \n469 \n3.8 \n%\n5.2 \n%\nTotal Capital Access Platforms\n$\n1,972 \n$\n1,770 \n$\n1,682 \n11.4 \n%\n5.2 \n%\nAs of December 31,\n2024\n2023\n2022\nARR (in millions)\n$\n1,268 \n$\n1,235 \n$\n1,190 \nData & Listing Services Revenues\nThe following tables present key drivers from our Data & Listing Services business:\nYear Ended December 31,\n2024\n2023\n2022\nIPOs\nThe Nasdaq Stock Market\n180 \n130 \n161\nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n14 \n7 \n38\nTotal new listings\nThe Nasdaq Stock Market\n463 \n330 \n366 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n31 \n23 \n63\nAs of December 31,\n2024\n2023\n2022\nNumber of listed companies\nThe Nasdaq Stock Market\n4,075 \n4,044 \n4,230 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n1,174 \n1,218 \n1,251 \nARR (in millions)\n691 \n682 \n664 \nIn the table above:\n•\nFor the years ended December 31, 2024, 2023 and 2022, IPOs included 50, 27 and 74 SPACs, respectively. The number of total listed companies on The Nasdaq Stock Market for the years ended December 31, 2024, 2023 and 2022 included 768, 600 and 528 ETPs, respectively. \n•\nIPOs, new listings (which includes IPOs) and total listed companies for exchanges that comprise Nasdaq Nordic and Nasdaq Baltic represent companies listed on the Nasdaq Nordic and Nasdaq Baltic exchanges and companies listed on the alternative markets of Nasdaq First North.\nData & Listing Services revenues increased in 2024 compared with the same period in 2023 as higher data usage, price increases on regulated data, higher initial listing fees and new data sales were partially offset by lower annual fees due to the impact of 2023 delistings and downgrades and lower amortization of prior period initial listing fees.\nIndex Revenues\nThe following table presents key drivers from our Index business:\nAs of or \nYear Ended December 31,\n2024\n2023\n2022\nNumber of licensed ETPs\n401 \n364 \n348\nTTM change in period end ETP AUM tracking Nasdaq indices (in billions)\nBeginning balance\n$\n473 \n$\n315 \n$\n424 \nNet appreciation (depreciation)\n110 \n128 \n(142)\nNet impact of ETP sponsor switches\n(16)\n(1)\n(1)\nNet inflows\n80 \n31 \n34 \nEnding balance\n$\n647 \n$\n473 \n$\n315 \nAnnual average ETP AUM tracking Nasdaq indices (in billions)\n$\n558 \n$\n396 \n$\n351 \nARR (in millions)\n$\n76 \n$\n72 \n$\n68 \nIn the table above, TTM represents trailing twelve months. The number of listed ETPs as of December 31, 2023 and 2022 has been updated to reflect a revised methodology whereby an ETP listed on multiple exchanges is counted as one product, rather than formerly being counted per exchange. This change has no impact on reported AUM. \nIndex revenues increased in 2024 compared with the same period in 2023 primarily due to higher AUM in exchange traded products linked to Nasdaq indices and growth in trading volume on futures contracts linked to the Nasdaq-100 Index. The increase in 2024 also includes a $16 million one-time item related to a legal settlement to recoup revenue.\nWorkflow & Insights Revenues\nThe following table presents key drivers from our Workflow & Insights business:\nAs of or \nYear Ended December 31\n2024\n2023\n2022\n(in millions)\nARR\n$\n501 \n$\n481 \n$\n458 \nQuarterly annualized SaaS revenues\n431 \n411 \n388 \nWorkflow & Insights revenues increased in 2024 compared with the same period in 2023 primarily due to an increase in analytics revenue, particularly our Data Link and eVestment product offerings.  \n39\nFinancial Technology\nThe following table presents revenues from our Financial Technology segment:\nYear Ended December 31,\nPercentage Change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n(in millions)\nFinancial Crime Management Technology\n$\n273 \n$\n223 \n$\n176 \n22.2 \n%\n26.5 \n%\nRegulatory Technology\n352 \n212 \n130 \n66.3 \n%\n63.5 \n%\nCapital Markets Technology\n996 \n664 \n558 \n50.0 \n%\n18.9 \n%\nTotal Financial Technology\n$\n1,621 \n$\n1,099 \n$\n864 \n47.5 \n%\n27.1 \n%\nFinancial Crime Management Technology Revenues\nThe following table presents key drivers for our Financial Crime Management Technology business:\nAs of or \nYear Ended December 31\n2024\n2023\n2022\n(in millions)\nARR and Quarterly annualized SaaS revenues\n$\n278 \n$\n226 \n$\n182 \nFinancial Crime Management Technology revenues increased in 2024 compared with the same period in 2023 primarily due to revenue recognition from the full year impact of contracts signed in 2023, including higher value contracts, new sales and price increases to existing clients and new customer acquisitions, particularly small and medium-sized businesses.\nRegulatory Technology Revenues\nThe following table presents key drivers for our Regulatory Technology business:\nAs of or \nYear Ended December 31\n2024\n2023\n2022\n(in millions)\nARR\n$\n354 \n$\n325 \n$\n130 \nQuarterly annualized SaaS revenues\n191 \n165 \n116 \nRegulatory Technology revenues increased in 2024 compared with the same period in 2023 primarily due to the inclusion of revenues from AxiomSL associated with our acquisition of Adenza and higher surveillance revenues, partially offset by a one-time revenue reduction recognized in the third quarter of 2024 related to a purchase accounting adjustment. See Note 3, “Revenue from Contracts with Customers,” to the consolidated financial statements for discussion on the measurement period adjustment.\nCapital Markets Technology Revenues\nThe following table presents key drivers for our Capital Markets Technology business:\nAs of or \nYear Ended December 31\n2024\n2023\n2022\n(in millions)\nARR \n$\n868 \n$\n799 \n$\n499 \nQuarterly annualized SaaS revenues\n134 \n108 \n39 \nCapital Markets Technology revenues increased in 2024 compared with the same period in 2023. The increase was primarily due to the inclusion of revenues from Calypso associated with our acquisition of Adenza. The increase was also driven by higher trade management services revenues mainly driven by demand for additional colocation and connectivity services following our recent data center expansion and higher market technology license and support revenues, partially offset by lower market technology professional services revenue due to a large project delivery in the comparable period in 2023\n.\nMarket Services\nThe following table presents revenues from our Market Services segment:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\n \nMarket Services \n$\n3,771 \n$\n3,156 \n$\n3,632 \n20.9 \n%\n(13.4)\n%\nTransaction-based expenses:\nTransaction rebates\n(2,026)\n(1,838)\n(2,092)\n10.2 \n%\n(12.1)\n%\nBrokerage, clearance and exchange fees\n(725)\n(331)\n(552)\n119.1 \n%\n(40.1)\n%\nTotal Market Services, net\n$\n1,020 \n$\n987 \n$\n988 \n3.4 \n%\n(0.1)\n%\nThe following table presents net revenues by product from our Market Services segment:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\nU.S. Equity Derivative Trading\n$\n395 \n$\n374 \n$\n371 \n5.7 \n%\n0.7 \n%\nCash Equity Trading\n430 \n397 \n397 \n8.3 \n%\n— \n%\nU.S. Tape plans\n125 \n141 \n149 \n(11.5)\n%\n(5.4)\n%\nOther\n70 \n75 \n71 \n(6.2)\n%\n4.6 \n%\nTotal Market Services, net\n$\n1,020 \n$\n987 \n$\n988 \n3.4 \n%\n(0.1)\n%\n40\nIn the preceding table, Other includes Nordic fixed income trading & clearing, Nordic derivatives and Canadian cash equities trading.\nU.S. Equity Derivative Trading \nThe following tables present total revenues, transaction-based expenses, and total revenues less transaction-based expenses as well as key drivers from our U.S. Equity Derivative Trading business:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\nU.S. Equity Derivative Trading Revenues\n$\n1,428 \n$\n1,257 \n$\n1,252 \n13.6 \n%\n0.4 \n%\nSection 31 fees\n87 \n55 \n89 \n56.9 \n%\n(37.9)\n%\nTransaction-based expenses:\n \nTransaction rebates\n(1,030)\n(879)\n(878)\n17.1 \n%\n0.2 \n%\nSection 31 fees\n(87)\n(55)\n(89)\n56.9 \n%\n(37.9)\n%\nBrokerage and clearance fees\n(3)\n(4)\n(3)\n(16.5)\n%\n13.9 \n%\nU.S. Equity Derivative Trading Revenues, net\n$\n395 \n$\n374 \n$\n371 \n5.7 \n%\n0.7 \n%\nSection 31 fees are recorded as U.S. equity derivative and cash equity trading revenues with a corresponding amount recorded in transaction-based expenses. We are assessed these fees from the SEC and pass them through to our customers in the form of incremental fees. Pass-through fees can increase or decrease due to rate changes by the SEC, our percentage of the overall industry volumes processed on our systems, and differences in actual dollar value traded. Section 31 fees increased in 2024 compared with the same period in 2023 primarily due to higher average SEC fee rates as a result of an increase in the SEC fee rate in May 2024. Since the amount recorded in revenues is equal to the amount recorded as Section 31 fees, there is no impact on our net revenues. \nYear Ended December 31,\n \n2024\n2023\n2022\nU.S. equity options\n \nTotal industry average daily volume (in millions)\n44.4 \n40.4 \n38.2 \nNasdaq PHLX matched market share\n10.0 \n%\n11.3 \n%\n11.6 \n%\nThe Nasdaq Options Market matched market share\n5.5 \n%\n6.1 \n%\n8.0 \n%\nNasdaq BX Options matched market share\n2.1 \n%\n3.3 \n%\n2.8 \n%\nNasdaq ISE Options matched market share\n6.9 \n%\n5.9 \n%\n5.7 \n%\nNasdaq GEMX Options matched market share\n2.6 \n%\n2.4 \n%\n2.3 \n%\nNasdaq MRX Options matched market share\n2.7 \n%\n2.0 \n%\n1.6 \n%\nTotal matched market share executed on Nasdaq’s exchanges\n29.8 \n%\n31.0 \n%\n32.0 \n%\nU.S. equity derivative trading revenues and U.S. equity derivative trading revenues, net increased in 2024 compared with the same period in 2023 primarily due to higher industry trading volumes, partially offset by lower overall matched market share executed on Nasdaq’s exchanges. U.S. equity derivative trading revenues also increased in 2024 compared with the same period in 2023 due to higher gross capture.\nTransaction rebates, in which we credit a portion of the execution charge to the market participant, increased in 2024 compared with the same period in 2023 primarily due to higher rebate capture rate and industry trading volumes, partially offset by lower overall U.S. matched market share executed on Nasdaq’s exchanges.\n41\nCash Equity Trading Revenues\nThe following tables present total revenues, transaction-based expenses, and total revenues less transaction-based expenses as well as key drivers and other metrics from our Cash Equity Trading business:\nYear Ended December 31,\nPercentage Change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n(in millions)\nCash Equity Trading Revenues\n$\n1,428 \n$\n1,355 \n$\n1,605 \n5.4 \n%\n(15.6)\n%\nSection 31 fees\n611 \n253 \n436 \n141.7 \n%\n(42.0)\n%\nTransaction-based expenses:\n \n \n \nTransaction rebates\n(974)\n(939)\n(1,184)\n3.8 \n%\n(20.8)\n%\nSection 31 fees\n(611)\n(253)\n(436)\n141.7 \n%\n(41.9)\n%\nBrokerage and clearance fees\n(24)\n(19)\n(24)\n29.5 \n%\n(22.3)\n%\nCash equity trading revenues, net\n$\n430 \n$\n397 \n$\n397 \n8.3 \n%\n— \n%\nSee the discussion in \"U.S. Equity Derivative Trading\" for an explanation of Section 31 fees for 2024 as compared with the same period in 2023. \nYear Ended December 31,\n \n2024\n2023\n2022\nTotal U.S.-listed securities\n \nTotal industry average daily share volume (in billions)\n12.2 \n11.0 \n11.9 \nMatched share volume (in billions)\n479.4 \n455.6 \n522.8 \nThe Nasdaq Stock Market matched market share\n15.1 \n%\n15.8 \n%\n16.2 \n%\nNasdaq BX matched market share\n0.3 \n%\n0.4 \n%\n0.5 \n%\nNasdaq PSX matched market share\n0.2 \n%\n0.3 \n%\n0.8 \n%\nTotal matched market share executed on Nasdaq’s exchanges\n15.6 \n%\n16.5 \n%\n17.5 \n%\nMarket share reported to the FINRA/Nasdaq Trade Reporting Facility\n44.3 \n%\n36.7 \n%\n35.2 \n%\nTotal market share\n59.9 \n%\n53.2 \n%\n52.7 \n%\nNasdaq Nordic and Nasdaq Baltic securities\n \nAverage daily number of equity trades executed on Nasdaq’s exchanges\n651,455\n666,411\n908,813 \nTotal average daily value of shares traded (in billions)\n$\n4.5 \n$\n4.5 \n$\n5.4 \nTotal market share executed on Nasdaq’s exchanges\n71.9 \n%\n71.0 \n%\n71.5 \n%\n \nCash equity trading revenues and cash equity trading revenues, net increased in 2024 compared with the same period in 2023 primarily due to higher U.S. industry trading volumes, partially offset by lower overall U.S. matched market share executed on Nasdaq's exchanges. \nTransaction rebates increased in 2024 compared with the same period in 2023 primarily due to higher U.S. industry volumes, partially offset by lower overall U.S. matched market share executed on Nasdaq’s exchanges. For The Nasdaq Stock Market and Nasdaq PSX, we credit a portion of the per share execution charge to the market participant that provides the liquidity, and for Nasdaq BX, we credit a portion of the per share execution charge to the market participant that takes the liquidity. \nU.S. Tape Plans\nThe following table presents revenues from our U.S. Tape plans business:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\nU.S. Tape plans\n$\n125 \n$\n141 \n$\n149 \n(11.5)\n%\n(5.4)\n%\nU.S. Tape plans revenues decreased in 2024 compared with the same period in 2023 primarily due to lower industry-wide usage volume and the impact of one-time industry-wide adjustments.\nOther\nOther includes Nordic fixed income trading and clearing, Nordic derivatives and Canadian cash equities trading. The following tables present revenues and a key driver from our Other business:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\nOther\n$\n70 \n$\n75 \n$\n71 \n(6.2)\n%\n4.6 \n%\nIn the preceding table, Other includes Canadian cash equity transaction rebates of $22 million, $20 million and $30 million \nfor the years ended \nDecember 31, 2024, 2023 and 2022, respectively.\nOther revenues decreased in 2024 compared with the same period in 2023 primarily due to a decrease in Nordic derivatives revenues due to a non-recurring payment received in 2023, partially offset by an increase in Nordic fixed income trading and clearing. \n42\nOther Revenues\nFor the years ended December 31, 2024, 2023 and 2022, Other revenues include revenues related to our Nordic power trading and clearing business, following our announcement in June 2023 that we entered into an agreement to sell this business, which was subsequently terminated in June 2024. In January 2025, we entered into a new agreement to transfer existing open positions in our Nordic power derivatives trading and clearing business to a European exchange. The completion of this transaction is subject to customary regulatory approvals. Revenues from this business will continue to be reflected in Other revenues. Prior to June 2023, these revenues were included in our Market Services and Capital Access Platforms segments. For the years ended December 31, 2023 and 2022, Other revenues also include revenues related to a transitional services agreement associated with a divested business. For the year ended December 31, 2022, Other revenues also include revenues related to our Nordic broker services business for which we completed the wind-down in June 2022. Prior to June 2022, these revenues were included in our Market Services and Capital Access Platforms segments. \nEXPENSES\nOperating Expenses \nThe following table presents our operating expenses:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\n \nCompensation and benefits\n$\n1,324 \n$\n1,082 \n$\n1,003 \n22.4%\n7.9%\nProfessional and contract services\n152 \n128 \n140 \n18.4%\n(8.6)%\nTechnology and communication infrastructure\n281 \n233 \n207 \n20.9%\n12.7%\nOccupancy\n112 \n129 \n104 \n(12.9)%\n23.7%\nGeneral, administrative and other\n109 \n113 \n125 \n(3.6)%\n(9.8)%\nMarketing and advertising\n54 \n47 \n51 \n16.4%\n(8.8)%\nDepreciation and amortization\n613 \n323 \n258 \n89.3%\n25.5%\nRegulatory\n55 \n34 \n33 \n60.8%\n4.4%\nMerger and strategic initiatives\n35 \n148 \n82 \n(76.5)%\n79.7%\nRestructuring charges\n116 \n80 \n15 \n44.3%\n454.5%\nTotal operating expenses\n$\n2,851 \n$\n2,317 \n$\n2,018 \n23.0%\n14.9%\nThe increase in compensation and benefits expense in 2024 compared with the same period in 2023 was primarily driven by the inclusion of a full year of compensation costs related to Adenza employees as compared to two months in 2023, a pre-tax charge of $23 million resulting from the finalization of the termination of our pension plan and higher incentive compensation.\nHeadcount, including employees of non-wholly owned consolidated subsidiaries, increased to 9,162 employees as of December 31, 2024 from 8,525 employees as of December 31, 2023, primarily due to an increase in our Financial Technology segment as we support revenue growth and innovation.\nProfessional and contract services expense increased in 2024 compared with the same period in 2023 primarily due to an increase in expenses related to the inclusion of Adenza.\nTechnology and communication infrastructure expense increased in 2024 compared with the same period in 2023 primarily due to an increase in expenses related to the inclusion of Adenza and an increase in investment in technology expense related to our cloud initiatives and software licensing.\nOccupancy expense decreased in 2024 compared with the same period in 2023 primarily due to $18 million in impairment charges and exit related costs recorded in 2023 following the abandonment of leased office space, partially offset by an increase in costs related to the inclusion of Adenza office space. \nGeneral, administrative and other expense decreased in 2024 compared with the same period in 2023 primarily due to a one-time accrual in 2023 related to a legal matter, partially offset by the inclusion of Adenza expense for a full year in 2024 and insurance recoveries related to legal matters recorded in 2023.\nMarketing and advertising expense increased in 2024 compared with the same period in 2023 primarily due to higher client incentive spending resulting from higher IPO activity.\nDepreciation and amortization expense increased in 2024 compared with the same period in 2023 primarily due to an increase in amortization related to the intangible assets acquired as part of the Adenza acquisition.\nRegulatory expense increased in 2024 compared with the same period in 2023 primarily due to the settlement of a previously disclosed SFSA inquiry.\n43\nWe have pursued various strategic initiatives and completed acquisitions and \ndivestitures i\nn recent years, which have resulted in expenses which would not have otherwise been incurred. These expenses generally include integration costs, as well as legal, due diligence and other third-party transaction costs and vary based on the size and frequency of the activities described above. For the years ended December 31, 2024 and 2023, these costs primarily relate to the Adenza acquisition. For the year ended December 31, 2024, these costs were partially offset by the recognition of a termination fee received by Nasdaq in 2024 related to the termination of the proposed divestiture of our Nordic power trading and clearing business.\nRestructuring charges increased in 2024 compared with the same period in 2023 as a result of charges from our Adenza restructuring program, which we implemented to optimize our efficiencies as a combined organization, and our divisional alignment program, which was completed in September 2024. \nWe further expanded our Adenza restructuring program in the fourth quarter of 2024 to accelerate our momentum. In connection with this program, we expect to incur approximately $140 million in pre-tax charges. Actions taken as part of this program are expected to be completed by the end of 2025, while certain costs may be recognized in the first half of 2026. We expect to achieve benefits primarily in the form of expense synergies with annual cost savings of $140 million by the end of 2025, inclusive of the $80 million of net expense synergies related to the AxiomSL and Calypso acquisition.\nThe divisional alignment program concluded on September 30, 2024, incurring total pre-tax charges of $139 million over a two-year period, within the projected range of $115 million to $145 million. In addition to significantly boosting the scalability of our platforms, and thus revenue opportunities, we expect to achieve benefits from the 2022 divisional alignment program through combined annual run-rate operational efficiencies of approximately $30 million annually by 2025.\nFor further discussion related to both programs described above, see Note 20, “Restructuring Charges,” to the consolidated financial statements.\nNon-Operating Income and Expenses\nThe following table presents our non-operating income and expenses:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. \n2023\n2023 vs. 2022\n \n(in millions)\nInterest income\n$\n28 \n$\n115 \n$\n7 \n(75.5)\n%\n1,538.3 \n%\nInterest expense\n(414)\n(284)\n(129)\n45.6 \n%\n120.2 \n%\nNet interest expense\n(386)\n(169)\n(122)\n128.3 \n%\n38.4 \n%\nOther income (loss)\n21 \n(1)\n2 \n(5,232.5)\n%\n(121.9)\n%\nNet income (loss) from unconsolidated investees\n16 \n(7)\n31 \n(328.7)\n%\n(122.9)\n%\nTotal non-operating expense\n$\n(349)\n$\n(177)\n$\n(89)\n97.4 \n%\n96.7 \n%\nThe following table presents our interest expense:\n \nYear Ended December 31,\nPercentage Change\n \n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n \n(in millions)\n \nInterest expense on debt\n$\n398 \n$\n272 \n$\n120 \n46.3 \n%\n126.8 \n%\nAccretion of debt issuance costs and debt discount\n13 \n9 \n7 \n33.9 \n%\n37.0 \n%\nOther fees\n3 \n3 \n2 \n18.7 \n%\n21.2 \n%\nInterest expense\n$\n414 \n$\n284 \n$\n129 \n45.6 \n%\n120.2 \n%\nInterest income decreased in 2024 compared with the same period in 2023 primarily due to a higher cash balance in 2023 during the period between the issuance of the senior unsecured notes in June 2023 and the close of the Adenza acquisition in November 2023.\nInterest expense increased in 2024 compared with the same period in 2023 primarily due to debt issued in June 2023 to finance the Adenza acquisition. See “Financing of the Adenza Acquisition,” of Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion.\nOther income (loss) primarily represents realized and unrealized gains and losses from strategic investments related to our corporate venture program.\nNet income (loss) from unconsolidated investees increased in 2024 compared with the same period in 2023 primarily due to higher income recognized from our equity method investment in OCC and lower losses from our equity method investment in NPM. See “Equity Method Investments,” of Note 6, “Investments,” to the consolidated financial statements for further discussion.\n44\nTax Matters\nThe following table presents our income tax provision and effective tax rate:\nYear Ended December 31,\nPercentage Change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n(in millions)\nIncome tax provision\n$\n334\n$\n344\n$\n352\n(2.8)\n%\n(2.1)\n%\nEffective tax rate\n23.1 \n%\n24.6 \n%\n23.9 \n%\nFor further discussion of our tax matters, see Note 17, “Income Taxes,” to the consolidated financial statements.\nNON-GAAP FINANCIAL MEASURES\nIn addition to disclosing results determined in accordance with U.S. GAAP, we also provide non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share in this Annual Report on Form 10-K. Management uses this non-GAAP information internally, along with U.S. GAAP information, in evaluating our performance and in making financial and operational decisions. We believe our presentation of these measures provides investors with greater transparency and supplemental data relating to our financial condition and results of operations. In addition, we believe the presentation of these measures is useful to investors for period-to-period comparisons of our ongoing operating performance.\nThese measures are not in accordance with, or an alternative to, U.S. GAAP, and may be different from non-GAAP measures used by other companies. In addition, other companies, including companies in our industry, may calculate such measures differently, which reduces their usefulness as comparative measures. Investors should not rely on any single financial measure when evaluating our business. This non-GAAP information should be considered as supplemental in nature and is not meant as a substitute for our operating results in accordance with U.S. GAAP. We recommend investors review the U.S. GAAP financial measures included in this Annual Report on Form 10-K, including our consolidated financial statements and the notes thereto. When viewed in conjunction with our U.S. GAAP results and the accompanying reconciliation, we believe these non-GAAP measures provide greater transparency and a more complete understanding of factors affecting our business than U.S. GAAP measures alone.\nWe understand that analysts and investors regularly rely on non-GAAP financial measures, such as non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share, to assess operating performance. We use non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share because they highlight trends more clearly in our business that may not otherwise be apparent when relying solely on U.S. GAAP financial measures, since these measures eliminate from our results specific financial items that have less bearing on our ongoing operating performance. \nThe following table presents reconciliations between U.S. GAAP net income attributable to Nasdaq and diluted earnings per share and non-GAAP net income attributable to Nasdaq and diluted earnings per share:\n45\n \nYear Ended December 31,\n2024\n2023\n2022\n(in millions, except per share amounts)\nU.S. GAAP net income attributable to Nasdaq\n$\n1,117 \n$\n1,059 \n$\n1,125 \nNon-GAAP adjustments:\nAdenza purchase accounting adjustment\n34 \n— \n— \nAmortization expense of acquired intangible assets\n488 \n206 \n153 \nMerger and strategic initiatives expense\n35 \n148 \n82 \nRestructuring charges\n116 \n80 \n15 \nLease asset impairments\n— \n25 \n— \nExtinguishment of debt\n4 \n— \n16 \nNet (income) loss from unconsolidated investees\n(16)\n7 \n(29)\nLegal and regulatory matters\n20 \n12 \n26 \nPension settlement charge\n23 \n9 \n— \nOther (income) loss\n(15)\n21 \n2 \nTotal non-GAAP adjustments\n$\n689 \n$\n508 \n$\n265 \nTotal non-GAAP tax adjustments\n(208)\n(134)\n(66)\nTax on intra-group transfer of IP assets\n33 \n— \n— \nTotal non-GAAP adjustments, net of tax\n$\n514 \n$\n374 \n$\n199 \nNon-GAAP net income attributable to Nasdaq\n$\n1,631 \n$\n1,433 \n$\n1,324 \nU.S. GAAP effective tax rate\n23.1 \n%\n24.6 \n%\n23.9 \n%\nTotal adjustments from non-GAAP tax rate\n0.7 \n%\n0.4 \n%\n0.1 \n%\nNon-GAAP effective tax rate\n23.8 \n%\n25.0 \n%\n24.0 \n%\nWeighted-average common shares outstanding for diluted earnings per share\n579.2 \n508.4 \n497.9 \nU.S. GAAP diluted earnings per share\n$\n1.93 \n$\n2.08 \n$\n2.26 \nTotal adjustments from non-GAAP net income\n0.89 \n0.74 \n0.40 \nNon-GAAP diluted earnings per share\n$\n2.82 \n$\n2.82 \n$\n2.66 \nWe believe that excluding the following items from the non-GAAP net income attributable to Nasdaq provides a more meaningful analysis of Nasdaq’s ongoing operating performance and comparisons in Nasdaq’s performance between periods:\n•\nAdenza purchase accounting adjustment: \nAs discussed in Note 3, “Revenue from Contracts with Customers,” to the consolidated financial statements, during the third quarter of 2024, as part of finalizing the purchase accounting of the Adenza acquisition, a one-time revenue reduction of $32 million was recorded, reflecting the net impact of the accounting change on AxiomSL subscription revenue from the date of the Adenza acquisition. We have excluded the reduction of $34 million as this relates to the prior year impact of this change from our non-GAAP results. We have not excluded the $2 million offsetting impact of this change as it is related to current year results.  \n•\nAmortization expense of acquired intangible assets: \nWe amortize intangible assets acquired in connection with various acquisitions. Intangible asset amortization expense can vary from period to period due to episodic acquisitions completed, rather than from our ongoing business operations. As such, if intangible asset amortization is included in performance measures, it is more difficult to assess the day-to-day operating performance of the businesses and the relative operating performance of the businesses between periods.\n•\nMerger and strategic initiatives expense:\n We have pursued various strategic initiatives and completed acquisitions and divestitures in recent years that have resulted in expenses which would not have otherwise been incurred. The frequency and the amount of such expenses vary significantly based on the size, timing and complexity of the transaction. These expenses primarily include integration costs, as well as legal, due diligence and other third-party transaction costs. For the years ended December 31, 2024 and 2023, these costs primarily relate to the Adenza acquisition. For the year ended December 31, 2024, these costs were partially offset by the recognition of a termination fee received by Nasdaq in 2024, related to the termination of the proposed divestiture of our Nordic power trading and clearing business.\n•\nRestructuring charges:\n In the fourth quarter of 2023, following the closing of the Adenza acquisition, our management approved, committed to and initiated a restructuring program, to optimize our efficiencies as a combined organization. We further expanded this restructuring program in the fourth quarter of 2024 to accelerate our momentum. In October 2022, following our September 2022 announcement to realign our segments and leadership, we initiated a divisional alignment program with a focus on realizing the full potential of this structure. We completed this program in September 2024. See Note 20, “Restructuring Charges,” to the consolidated financial statements for further discussion of these programs. \n46\n•\nNet (income) loss from unconsolidated investees\n: We exclude our share of the earnings and losses of our equity method investments. This provides a more meaningful analysis of Nasdaq’s ongoing operating performance or comparisons in Nasdaq’s performance between periods. See “Equity Method Investments,” of Note 6, “Investments,” to the consolidated financial statements for further discussion. \n•\nOther items: \nWe have excluded certain other charges or gains, including certain tax items, that are the result of other non-comparable events to measure operating performance. We believe the exclusion of such amounts allows management and investors to better understand the ongoing financial results of Nasdaq. Other significant items include: \n◦\nLease asset impairments: \nFor the year ended December 31, 2023, other items include impairment charges related to our operating lease assets and leasehold improvements associated with vacating certain leased office space, which are recorded in occupancy and depreciation and amortization expense in the Consolidated Statements of Income. See Note 16, “Leases,” to the consolidated financial statements for further discussion. \n◦\nExtinguishment of debt:\n For the years ended December 31, 2024 and 2022 this includes a loss on extinguishment of debt, which is recorded under general, administrative and other expense in the Consolidated Statements of Income. See Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion.\n◦\nLegal and regulatory matters: \nFor the year ended December 31, 2024, other items primarily include the settlement of a previously disclosed SFSA inquiry, and accruals related to certain legal matters. For 2023 and 2022, other items also includes accruals related to certain legal matters. For 2023, these charges were partially offset by insurance recoveries related to certain legal matters. The charges and related insurance recoveries are recorded in professional and contract services and general, administrative and other expense in the Consolidated Statements of Income. For 2022, this also includes a charge related to an administrative fine imposed by the SFSA related to the clearing default that occurred in 2018. This charge was included in regulatory expense in the Consolidated Statements of Income.\n◦\nPension settlement charge: \nFor the years ended December 31, 2024 and 2023, we recorded a pre-tax charge as a result of settling our U.S. pension plan. The plan was terminated and partially settled in 2023, with final settlement occurring during the first quarter of 2024. The pre-tax charge is recorded in compensation and benefits expense in the Consolidated Statements of Income. See Note 10, “Retirement Plans,” to the consolidated financial statements for further discussion.\n◦\nOther (income) loss\n: For the years ended December 31, 2024 and 2022, other items include net gains from strategic investments entered into through our corporate venture program, which are included in other income (loss) in the Consolidated Statements of Income. For 2023, other items included certain financing costs related to the Adenza acquisition and a net loss from a strategic investments entered into through our corporate venture program.\n•\nSignificant tax items: \nThe non-GAAP adjustment to the income tax provision for all periods primarily includes the tax impact of each non-GAAP adjustment. In addition, for the year ended December 31, 2024, tax items also include a one-time net tax expense of $33 million related to the completion of an intra-group transfer of certain intellectual property, or IP, assets to our U.S. headquarters as well as a tax benefit related to return to provision adjustments and release of tax reserves due to lapse in statute of limitations.\nLIQUIDITY AND CAPITAL RESOURCES\nHistorically, we have funded our operating activities and met our commitments through cash generated by operations, augmented by the periodic issuance of debt. Currently, our cost and availability of funding remain healthy. We continue to prudently assess our capital deployment strategy through balancing internal investments, debt repayments, and shareholder return activity, including dividends and share repurchases, and potential acquisitions.\nWe expect that our current cash and cash equivalents combined with cash flows provided by operating activities, supplemented with our borrowing capacity and access to additional financing, including our revolving credit facility and our commercial paper program, provides us additional flexibility to meet our ongoing obligations and the capital deployment strategic actions described above, while allowing us to invest in activities and product development that support the long-term growth of our operations. \nPrincipal factors that could affect the availability of our internally-generated funds include:\n•    deterioration of our revenues in any of our business segments;\n•    changes in regulatory and working capital requirements; and\n•\nan increase in our expenses.\nPrincipal factors that could affect our ability to obtain cash from external sources include:\n•    operating covenants contained in our credit facilities that limit our total borrowing capacity;\n•    credit rating downgrades, which could limit our access to additional debt;\n•    a significant decrease in the market price of our common stock; and\n•    volatility or disruption in the public debt and equity markets.\n47\nThe following table summarizes selected measures of our liquidity and capital resources:\n \nDecember 31, 2024\nDecember 31, 2023\n \n(in millions)\nCash and cash equivalents\n$\n592 \n$\n453 \nFinancial investments\n184 \n188 \nWorking capital\n(116)\n71 \nThe decrease in working capital is primarily driven by the reclassification of the 2025 Notes to short-term debt in 2024 and an increase in current deferred revenue, partially offset by a decrease in commercial paper, net, as further described below under “\nDebt Obligations.\n”\nCash and Cash Equivalents\nCash and cash equivalents includes all non-restricted cash in banks and highly liquid investments with original maturities of 90 days or less at the time of purchase. The balance retained in cash and cash equivalents is a function of anticipated or possible short-term cash needs, prevailing interest rates, our investment policy, and alternative investment choices. As of December 31, 2024, our cash and cash equivalents of $592 million were primarily invested in money market funds, commercial paper and bank deposits.\nRepatriation of Cash\nOur cash and cash equivalents held outside of the U.S. in various foreign subsidiaries totaled $181 million as of December 31, 2024 and $236 million as of December 31, 2023. The remaining balance held in the U.S. totaled $411 million as of December 31, 2024 and $217 million as of December 31, 2023. \nCash Flow Analysis\nThe following table summarizes the changes in cash flows:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nNet cash provided by (used in):\n(in millions)\nOperating activities\n$\n1,939 \n$\n1,696 \n$\n1,706 \nInvesting activities\n(953)\n(5,994)\n49 \nFinancing activities\n(2,561)\n4,220 \n1,036 \nNet Cash Provided by Operating Activities\nNet cash provided by operating activities primarily consists of net income adjusted for certain non-cash items, including, but not limited to, depreciation and amortization expense, expense associated with share-based compensation, deferred income taxes and the effects of changes in working capital. Changes in working capital include changes in accounts receivable and deferred revenue which are impacted by the timing of customer billings and related collections from our customers; accounts payable and accrued expenses due to timing of payments; accrued personnel costs, which are impacted by employee performance targets and the timing of payments related to employee bonus incentives; and Section 31 fees payable to the SEC, which is impacted by the changes in SEC fee rates and the timing of collections from customers and payments to the SEC.\nNet cash provided by operating activities increased $243 million for the year ended December 31, 2024 compared with the same period in 2023. The increase was primarily driven by an increase in net income and the impact of certain non-cash items on net income, primarily an increase in amortization expense due to acquired intangibles related to the Adenza acquisitions offset by a decrease in deferred income tax liabilities. \nThe changes in our operating assets and liabilities primarily included higher Section 31 fees payable to the SEC due to changes in Section 31 fee rate between periods, partially offset by higher cash outflows from accounts payable and accrued expenses, primarily due to interest paid relating to the senior unsecured notes and the settlement of a legal matter, and higher cash outflows from higher receivables, net, primarily due to higher Market Services receivables driven by higher Section 31 fee rate as well as higher billings. \nNet Cash Used in Investing Activities\nNet cash used in investing activities for the year ended December 31, 2024 related to net purchases of investments related to default funds and margin deposits of $707 million, purchases of property and equipment of $207 million, other investing activities primarily related to our corporate venture program of $32 million and net purchases of trading securities, net, of $7 million.\nNet cash used in investing activities for the year ended December 31, 2023 related to $5,766 million paid for the acquisition of Adenza, net of cash and cash equivalents acquired, purchases of property and equipment of $158 million, net purchases of investments related to default funds and margin deposits of $74 million and $3 million from other investing activities, partially offset by proceeds from the sale and redemption of trading securities, net of $7 million.\n48\nNet Cash Provided by (Used in) Financing Activities\nNet cash used in financing activities for the year ended December 31, 2024 primarily related to a decrease in default funds and margin deposits of $1,030 million, dividend payments to our shareholders of $541 million, 2023 Term Loan repayment of $340 million, net repayments of our commercial paper of $291 million, repayments of debt and credit commitments of $181 million and repurchases of common stock of $145 million.\nNet cash provided by financing activities for the year ended December 31, 2023 primarily related to $5,608 million in proceeds from issuances of senior unsecured notes and the 2023 Term Loan, in connection with the Adenza acquisition, net of debt issuance costs partially offset by dividend payments to our shareholders of $441 million, repayments of our commercial paper, net of $371 million, repurchases of common stock of $269 million and partial repayment of the 2023 Term Loan of $260 million.\nSee Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion of our debt obligations.\nSee “Share Repurchase Program,” and “Cash Dividends on Common Stock,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of our share repurchase program and cash dividends declared and paid on our common stock. \nFinancial Investments\nOur financial investments totaled $184 million as of December 31, 2024 and $188 million as of December 31, 2023. Of these securities, $171 million as of December 31, 2024 and $168 million as of December 31, 2023 are assets primarily utilized to meet regulatory capital requirements, mainly for our clearing operations at Nasdaq Clearing. See Note 6, “Investments,” to the consolidated financial statements for further discussion. \nRegulatory Capital Requirements\nClearing Operations Regulatory Capital Requirements\nWe are required to maintain minimum levels of regulatory capital for the clearing operations of Nasdaq Clearing. The level of regulatory capital required to be maintained is dependent upon many factors, including market conditions and creditworthiness of the counterparty. As of December 31, 2024, our required regulatory capital of $129 million was primarily comprised of highly rated European government debt securities that are included in financial investments in the Consolidated Balance Sheets.\nBroker-Dealer Net Capital Requirements\nOur broker-dealer subsidiaries, Nasdaq Execution Services, NFSTX, LLC, and Nasdaq Capital Markets Advisory, are subject to regulatory requirements intended to ensure their general financial soundness and liquidity. These requirements obligate these subsidiaries to comply with minimum net capital requirements. As of December 31, 2024, the combined required minimum net capital totaled $1 million and the combined excess capital totaled $24 million, substantially all of which is held in cash and cash equivalents in the Consolidated Balance Sheets. The required minimum net capital is included in restricted cash and cash equivalents in the Consolidated Balance Sheets. \nNordic and Baltic Exchange Regulatory Capital Requirements\nThe entities that operate trading venues in the Nordic and Baltic countries are each subject to local regulations and are required to maintain regulatory capital intended to ensure their general financial soundness and liquidity. As of December 31, 2024, our required regulatory capital of $35 million was primarily invested in European government bills and mortgage bonds that are included in financial investments in the Consolidated Balance Sheets and cash, which is included in restricted cash and cash equivalents in the Consolidated Balance Sheets. \nOther Capital Requirements\nWe operate several other businesses which are subject to local regulation and are required to maintain certain levels of regulatory capital. As of December 31, 2024, other required regulatory capital of $12 million, primarily related to Nasdaq Central Securities Depository, was primarily invested in European government debt securities that are included in financial investments in the Consolidated Balance Sheets.\nEquity and dividends\nShare Repurchase Program\nSee “Share Repurchase Program,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of our share repurchase program.\nCash Dividends on Common Stock\nThe following table presents our quarterly cash dividends paid per common share on our outstanding common stock:\n2024\n2023\nFirst quarter\n$\n0.22 \n$\n0.20 \nSecond quarter\n0.24 \n0.22 \nThird quarter\n0.24 \n0.22 \nFourth quarter\n0.24 \n0.22 \nTotal\n$\n0.94 \n$\n0.86 \nSee “Cash Dividends on Common Stock,” of Note 12, “Nasdaq Stockholders’ Equity,” to the consolidated financial statements for further discussion of the dividends. \n49\nDebt Obligations\nThe debt obligations, by contractual maturity, at December 31, 2024 are as follows (in U.S. Dollar millions):\nn\n Euro Notes  \nn\n U.S. Notes \nIn the fourth quarter of 2024, we repurchased an aggregate amount of $181 million of outstanding notes, primarily related to the 2025 Notes, 2028 Notes and 2034 Notes. In February 2025, Nasdaq commenced a cash tender offer to repurchase up to an aggregate principal amount of $200 million of our 2028, 2034 and 2052 Notes.\nFor the year ended December 31, 2024, the weighted average interest rate on our debt obligations was approximately 3.95%. This rate can fluctuate based on changes in interest rates for our variable rate debts, changes in foreign currency exchange rates and changes in the amount and duration of outstanding debt. In addition to the 2022 Revolving Credit Facility, we also have other credit facilities primarily to support our Nasdaq Clearing operations in Europe, as well as to provide a cash pool credit line. These European credit facilities, which are available in multiple currencies, totaled $174 million as of December 31, 2024 and $191 million as of December 31, 2023 in available liquidity, none of which was utilized.\nFinancing of the Adenza Acquisition\nIn June 2023, Nasdaq issued six series of notes for total proceeds of $5,016 million, net of debt issuance costs of $38 million, with various maturity dates ranging from 2025 to 2063. The net proceeds from these notes were used to finance the majority of the cash consideration due in connection with the Adenza acquisition.\nIn addition, in connection with the financing of the Adenza acquisition, we entered into the 2023 Term Loan agreement. The 2023 Term Loan provided us with the ability to borrow up to $600 million to finance a portion of the cash consideration for the Adenza acquisition and other amounts incurred in connection with this transaction. On November 1, 2023, we borrowed $599 million, net of fees, under this term loan, which was used towards payment of the cash consideration due in connection with the Adenza acquisition, a portion of which had been repaid in the fourth quarter of 2023. The term loan was fully repaid in 2024.\nAs of December 31, 2024, we were in compliance with the covenants of all of our debt obligations.\nSee Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion of our debt obligations.\nCONTRACTUAL OBLIGATIONS AND CONTINGENT COMMITMENTS\nNasdaq has contractual obligations to make future payments under debt obligations by contract maturity, operating lease payments, and other obligations. The following table summarizes material cash requirements for known contractual and other obligations as of December 31, 2024, and the estimated timing thereof.\n50\nPayments Due by Period\n(in millions)\nTotal\n<1 year\n1-3 years\n3-5 years\n5+ years\nDebt obligation by contractual maturity\n$\n15,252 \n$\n761 \n$\n1,171 \n$\n2,148 \n$\n11,172 \nOperating lease obligations\n617 \n75 \n140 \n129 \n273 \nPurchase obligations\n384 \n96 \n115 \n89 \n84 \nTotal\n$\n16,253 \n$\n932 \n$\n1,426 \n$\n2,366 \n$\n11,529 \nIn the table above:\n•\nDebt obligations by contractual maturity include both principal and interest obligations. For our Euro denominated notes interest is calculated on an actual basis while all other debt obligations were primarily calculated on a 365-day basis at the contractual fixed rate multiplied by the aggregate principal amount as of December 31, 2024. See Note 9, “Debt Obligations,” to the consolidated financial statements for further discussion.\n•\nOperating lease obligations represent our undiscounted operating lease liabilities as of December 31, 2024, as well as legally binding minimum lease payments for leases signed but not yet commenced. See Note 16, “Leases,” to the consolidated financial statements for further discussion of our leases.\n•\nPurchase obligations primarily represent minimum outstanding obligations due under software license agreements. The balance as of December 31, 2024 is primarily comprised of our multi-year AWS partnership contract.\nOFF-BALANCE SHEET ARRANGEMENTS\nFor discussion of off-balance sheet arrangements see:\n•    Note 15, “Clearing Operations,” to the consolidated financial statements for further discussion of our non-cash default fund contributions and margin deposits received for clearing operations; and\n•    Note 18, “Commitments, Contingencies and Guarantees,” to the consolidated financial statements for further discussion of:\n◦\nGuarantees issued and credit facilities available;\n◦\nOther guarantees; and\n◦\nRouting brokerage activities.\nQUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\nAs a result of our operating, investing and financing activities, we are exposed to market risks such as interest rate risk and foreign currency exchange rate risk. We are also exposed to credit risk as a result of our normal business activities.\nWe have implemented policies and procedures to measure, manage, monitor and report risk exposures, which are reviewed regularly by management and the board of directors. We identify risk exposures and monitor and manage such risks on a daily basis.\nWe perform sensitivity analyses to determine the effects of market risk exposures. We may use derivative instruments solely to hedge financial risks related to our financial positions or risks that are incurred during the normal course of business. We do not use derivative instruments for speculative purposes.\nInterest Rate Risk\nWe are subject to the risk of fluctuating interest rates in the normal course of business. Our exposure to market risk for changes in interest rates relates primarily to our financial investments and debt obligations, which are discussed below. Substantially all of our debt obligations are fixed-rate obligations. We may enter into transactions that expose us to interest rate risk, for which we may utilize interest rate swap agreements to manage that risk.\nFinancial Investments\nAs of December 31, 2024, our investment portfolio was primarily comprised of highly rated European government debt securities, which pay a fixed rate of interest. These securities are subject to interest rate risk and the fair value of these securities will decrease if market interest rates increase. The impact of an immediate increase to market interest rates, uniformly, by a hypothetical 100 basis points from levels as of December 31, 2024, would not have a material impact on our financial statements. \nDebt Obligations\nAs of December 31, 2024, substantially all of our debt obligations are fixed-rate obligations. Interest rates on certain tranches of notes are subject to adjustment to the extent our debt rating is downgraded below investment grade, as further discussed in Note 9, “Debt Obligations,” to the consolidated financial statements. While changes in interest rates will have no impact on the interest we pay on fixed-rate obligations, we are exposed to changes in interest rates as a result of the borrowings under our 2022 Revolving Credit Facility, as this facility has a variable interest rate. We are also exposed to changes in interest rates as a result of the amounts outstanding from the sale of commercial paper under our commercial paper program, which have variable interest rates. As of December 31, 2024, there were no outstanding borrowings under our 2022 Revolving Credit Facility or commercial paper program.\nForeign Currency Exchange Rate Risk\nWe are subject to foreign currency exchange rate risk. Our primary transactional exposure to foreign currency denominated revenues less transaction-based expenses and operating income for the years ended December 31, 2024 and 2023 is presented in the following tables:\n51\nEuro\nSwedish Krona\nCanadian Dollar\nOther Foreign Currencies\nU.S. Dollar\n(in millions, except currency rate)\nYear Ended December 31, 2024\nAverage foreign currency rate to the U.S. dollar\n1.082\n0.095\n0.730\n# \nN/A\nPercentage of revenues less transaction-based expenses\n7.9%\n3.4%\n0.7%\n3.7%\n84.3%\nPercentage of operating income\n11.8%\n(5.9)%\n(7.8)%\n(10.5)%\n112.4%\nImpact of a 10% adverse currency fluctuation on revenues less transaction-based expenses\n$(37)\n$(16)\n$(3)\n$(17)\n$—\nImpact of a 10% adverse currency fluctuation on operating income\n$(21)\n$(11)\n$(14)\n$(19)\n$—\nEuro\nSwedish Krona\nCanadian Dollar\nOther Foreign Currencies\nU.S. Dollar\n(in millions, except currency rate)\nYear Ended December 31, 2023\nAverage foreign currency rate to the U.S. dollar\n1.081\n0.094\n0.741\n# \nN/A\nPercentage of revenues less transaction-based expenses\n6.6%\n4.0%\n0.8%\n3.0%\n85.6%\nPercentage of operating income\n10.7%\n(3.8)%\n(7.0)%\n(8.3)%\n108.4%\nImpact of a 10% adverse currency fluctuation on revenues less transaction-based expenses\n$(26)\n$(15)\n$(3)\n$(12)\n$—\nImpact of a 10% adverse currency fluctuation on operating income\n$(17)\n$(6)\n$(11)\n$(13)\n$—\n__________\n#    Represents multiple foreign currency rates.\nN/A    Not applicable.\nThe adverse impacts shown in the preceding tables should be viewed individually by currency and not in aggregate due to the correlation between changes in exchange rates for certain currencies. Additionally, the table does not include the offsetting impact of our hedging programs.\nWe may use foreign exchange contracts to hedge a portion of our forecasted foreign currency denominated revenues and expenses in the normal course of business. We do not use these contracts for speculative trading purposes. We hedge these cash flow exposures to reduce the risk that our earnings and cash flows will be adversely affected by changes in exchange rates. These foreign exchange contracts are carried at fair value, with maturities that can range up to 24 months. We record changes in fair value of these cash flow hedges of foreign currency denominated revenue and expenses in accumulated other comprehensive loss in the Consolidated Balance Sheets, until the forecasted transaction occurs. When the forecasted transaction affects earnings, we reclassify the related gain or loss on the cash flow hedge to revenue or operating expenses, as applicable. In the event the underlying forecasted transaction does not occur, or it becomes probable that it will not occur, we reclassify the gain or loss on the related cash flow hedge from accumulated other comprehensive loss to revenue or operating expenses, as applicable. As of December 31, 2024, the fair value of our derivatives designated as cash flow hedging instruments are not material. \nOur investments in foreign subsidiaries are exposed to volatility in currency exchange rates through translation of the foreign subsidiaries’ net assets or equity to U.S. dollars. Substantially all of our foreign subsidiaries operate in functional currencies other than the U.S. dollar. The financial statements of these subsidiaries are translated into U.S. dollars for consolidated reporting using a current rate of exchange, with net gains or losses recorded in accumulated other comprehensive loss in the Consolidated Balance Sheets.\nOur primary exposure to net assets in foreign currencies as of December 31, 2024 is presented in the following table:\n \nNet Assets\nImpact of a 10% Adverse Currency Fluctuation\n \n(in millions)\nSwedish Krona\n$\n2,737 \n$\n(274)\nBritish Pound\n136 \n(14)\nNorwegian Krone\n134 \n(13)\nCanadian Dollar\n107 \n(11)\nAustralian Dollar\n89 \n(9)\nIn the table above, Swedish Krona includes goodwill of $2,028 million and intangible assets, net of $439 million.\nCredit Risk\nCredit risk is the potential loss due to the default or deterioration in credit quality of customers or counterparties. We are exposed to credit risk from third parties, including customers, counterparties and clearing agents. These parties may default on their obligations to us due to bankruptcy, lack of liquidity, operational failure or other reasons. We limit our \n52\nexposure to credit risk by evaluating the counterparties with which we make investments and execute agreements. For our investment portfolio, our objective is to invest in securities to preserve principal while maximizing yields, without significantly increasing risk. Credit risk associated with investments is minimized substantially by ensuring that these financial assets are placed with governments which have investment grade ratings, well-capitalized financial institutions and other creditworthy counterparties. \nOur subsidiary, Nasdaq Execution Services, may be exposed to credit risk due to the default of trading counterparties in connection with the routing services it provides for our trading customers. System trades in cash equities routed to other market centers for members of our cash equity exchanges are routed by Nasdaq Execution Services for clearing to the NSCC. In this function, Nasdaq Execution Services is to be neutral by the end of the trading day, but may be exposed to intraday risk if a trade extends beyond the trading day and into the next day, thereby leaving Nasdaq Execution Services susceptible to counterparty risk in the period between accepting the trade and routing it to the clearinghouse. In this interim period, Nasdaq Execution Services is not novating like a clearing broker but instead is subject to the short-term risk of counterparty failure before the clearinghouse enters the transaction. Once the clearinghouse officially accepts the trade for novation, Nasdaq Execution Services is legally removed from trade execution risk. However, Nasdaq has membership obligations to NSCC independent of Nasdaq Execution Services’ arrangements.\nPursuant to the rules of the NSCC and Nasdaq Execution Services’ clearing agreement, Nasdaq Execution Services is liable for any losses incurred due to a counterparty or a clearing agent’s failure to satisfy its contractual obligations, either by making payment or delivering securities. Adverse movements in the prices of securities that are subject to these transactions can increase our credit risk. However, we believe that the risk of material loss is limited, as Nasdaq Execution Services’ customers are not permitted to trade on margin and NSCC rules limit counterparty risk on self-cleared transactions by establishing credit limits and capital deposit requirements for all brokers that clear with NSCC. Historically, Nasdaq Execution Services has never incurred a liability due to a customer’s failure to satisfy its contractual obligations as counterparty to a system trade. Credit difficulties or insolvency, or the perceived possibility of credit difficulties or insolvency, of one or more larger or visible market participants could also result in market-wide credit difficulties or other market disruptions. \nWe have credit risk related to transaction and subscription-based revenues that are billed to customers on a monthly or quarterly basis, in arrears. Our potential exposure to credit losses on these transactions is represented by the receivable balances in the Consolidated Balance Sheets. We review and evaluate changes in the status of our counterparties’ creditworthiness. Credit losses such as those described above could adversely affect our consolidated financial position and results of operations.\nWe also are exposed to credit risk through our clearing operations with Nasdaq Clearing. See Note 15, “Clearing Operations,” to the consolidated financial statements for further discussion. Our clearinghouse holds material amounts of clearing member cash deposits, which are held or invested primarily to provide security of capital while minimizing credit, market and liquidity risks. While we seek to achieve a reasonable rate of return, we are primarily concerned with preservation of capital and managing the risks associated with these deposits. As the clearinghouse may remit to the members interest earned at prevailing market rates, less a spread, this could include negative or reduced yield due to market conditions. The following is a summary of the risks associated with these deposits and how these risks are mitigated.\n•\nCredit Risk: \nWhen the clearinghouse has the ability to hold cash collateral at a central bank, the clearinghouse utilizes its access to the central bank system to minimize credit risk exposures. When funds are not held at a central bank, we seek to substantially mitigate credit risk by ensuring that investments are primarily placed in large, highly rated financial institutions, highly rated government debt instruments and other creditworthy counterparties.\n•\nLiquidity Risk:\n Liquidity risk is the risk a clearinghouse may not be able to meet its payment obligations in the right currency, in the right place and the right time. To mitigate this risk, the clearinghouse monitors liquidity requirements closely and maintains funds and assets in a manner which minimizes the risk of loss or delay in the access by the clearinghouse to such funds and assets. For example, holding funds with a central bank where possible or investing in highly liquid government debt instruments serves to reduce liquidity risks.\n•\nInterest Rate Risk: \nInterest rate risk is the risk that interest rates rise causing the value of purchased securities to decline. If we were required to sell securities prior to maturity, and interest rates had risen, the sale of the securities might be made at a loss relative to the latest market price. Our clearinghouse seeks to manage this risk by making short term investments of members’ cash deposits. In addition, the clearinghouse investment guidelines allow for direct purchases or repurchase agreements with short dated maturities of high quality sovereign debt (for example, European government and U.S. Treasury securities), central bank certificates and multilateral development bank debt instruments.\n53\n•\nSecurity Issuer Risk:\n Security issuer risk is the risk that an issuer of a security defaults on its payment when the security matures. This risk is mitigated by limiting allowable investments and collateral under reverse repurchase agreements to high quality sovereign, government agency or multilateral development bank debt instruments.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES \nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires management to make judgments, assumptions, and estimates that affect the amounts reported in the consolidated financial statements and accompanying notes. Note 2, “Summary of Significant Accounting Policies,” to the consolidated financial statements describes the significant accounting policies and methods used in the preparation of the consolidated financial statements. The accounting policies described below are significantly affected by critical accounting estimates. Such accounting policies require significant judgments, assumptions, and estimates used in the preparation of the consolidated financial statements, and actual results could differ materially from the amounts reported based on these policies\n.\nRevenue Recognition\nAs part of our market technology product offering, within our Capital Markets Technology business, we enter into certain long-term contracts with customers to develop customized technology solutions, license the right to use software and provide support and other services to our customers which results in these contracts containing multiple performance obligations. We allocate the contract transaction price to each performance obligation using our best estimate of the standalone selling price of each distinct good or service in the contract. In instances where standalone selling price is not directly observable, such as when we do not sell the product or service separately, we determine the standalone selling price predominantly through an expected cost plus a margin approach.\nWe generally recognize revenue over time as our customers simultaneously receive and consume the benefits provided by our performance because our customer controls the asset for which we are creating, our performance does not create an asset with alternative use, and we have a right to payment for performance completed to date. For these services, we recognize revenue over time using costs incurred to date relative to total estimated costs at completion to measure progress toward satisfying our performance obligation. Incurred costs represent work performed, which corresponds with, and thereby depicts, the transfer of control to the customer.\nAccounting for our long-term contracts requires judgment relative to assessing risks and their impact on the estimate of revenues and costs. Our estimates are impacted by factors such as the potential for schedule and technical issues, \nproductivity and the complexity of work performed. Revenue and cost estimates for our long-term contracts are reviewed and reassessed at least quarterly. When adjustments in estimated total contract costs are required, any changes in the estimated revenues from prior estimates are recognized in the current period for the effect of such change. If estimates of total costs to be incurred on a contract exceed estimates of total revenues, a provision for the entire estimated loss on the contract is recorded in the period in which the loss is determined. \nOur Calypso product, also part of our Capital Markets Technology business, provides cross-asset, front-to-back trading, treasury, risk and collateral management solutions for the financial markets. This offering is also provided as an on-premises software solution. A license for on-premises software provides customers with the right to use the software at its current state at the time made available to the customer. These contracts generally consist of the following distinct performance obligations: license and PCS. In allocating the contractual price to each performance obligation, we have used our best estimate of the stand-alone selling price. Consideration is first allocated to performance obligations with established stand-alone selling prices based on observable evidence, with the residual being split between license and PCS.\nLicense revenue is recognized upfront at the point in time when the software is made available to the customer as this is the point the user of the software can direct the use of and obtain substantially all of the remaining benefits from the software license. PCS revenue is recognized over time on a ratable basis over the contract period beginning on the date that our service is made available to the customer since the customer receives and consumes the benefit as Nasdaq provides the service.\nAccounting for these contracts requires judgment relative to the allocation of the contractual price to each performance obligation.\nDue to the significance of judgment in the estimation process, as discussed above, changes in assumptions and estimates may adversely or positively affect financial performance in future periods.\nFor further discussion related to recognition of these revenues, see “Revenue From Contracts with Customers - Revenue Recognition - Capital Markets Technology,” of Note 2, “Summary of Significant Accounting Policies,” to the consolidated financial statements.\nBusiness Combination\nWe account for business acquisitions under the acquisition method of accounting. The assets acquired and liabilities assumed in connection with business acquisitions are recorded at the date of acquisition at their estimated fair values, with any excess of the purchase price over the estimated fair values of the net assets acquired recorded as goodwill. Within one year from the date of acquisition, we may update the value allocated to the assets acquired and \n54\nliabilities assumed, and the resulting goodwill balance, based on information received regarding the valuation of such assets and liabilities that was not available at the time of purchase.\nWe use various methods to determine fair value depending on the type of assets acquired and liabilities assumed. We make estimates and assumptions about projected future cash flows including, but not limited to, forecasted revenue, cash flows, attrition rates, long term growth rates, royalty rates, EBITDA margin and discount rates.\nSignificant judgment is required in estimating the fair value of assets acquired and liabilities assumed and in assigning useful lives to certain definite-lived intangible and tangible assets. Accordingly, we may engage third-party valuation specialists to assist in these determinations. The fair value estimates are based on available information as of the acquisition date and assumptions deemed reasonable by management but are inherently uncertain.\nIn the third quarter of 2024 we recorded a purchase accounting adjustment to the estimated purchase price allocation shown above, and disclosed as of December 31, 2023. This adjustment relates to the impact of the change from upfront to ratable revenue recognition for AxiomSL on-premises contracts entered into prior to the acquisition date, as described above, and decreased accrued income (which reflects revenue earned but not yet billed and included in receivables above) by $46 million, increased deferred revenue by $56 million and increased goodwill by $77 million, net of a deferred tax asset of $25 million. During 2023 and 2022, we have not recorded any material measurement period adjustments to purchase price allocations.\nSee Note 4, “Acquisition,” to the consolidated financial statements for further discussion of the Adenza Acquisition.\nGoodwill, Indefinite-Lived Intangible Assets and Related Impairment Testing\nGoodwill represents the excess of purchase price over the value assigned to the net assets, including identifiable intangible assets, of a business acquired. Goodwill is allocated to our reporting units based on the assignment of the fair values of each reporting unit of the acquired company. We recognize specifically identifiable intangibles, such as customer relationships, technology, exchange and clearing registrations, trade names and licenses when a specific right or contract is acquired. Goodwill and intangible assets deemed to have indefinite useful lives, primarily exchange and clearing registrations, are not amortized but instead are tested for impairment at least annually as of October 1 and more frequently whenever events or changes in circumstances indicate that the fair value of the asset may be less than its carrying amount, such as changes in the business climate, poor indicators of operating performance or the sale or disposition of a significant portion of a reporting unit. We perform our goodwill impairment test at the reporting unit level for our three reporting units: Capital \nAccess Platforms, Financial Technology and Market Services segments.\nWhen testing goodwill and indefinite-lived intangible assets for impairment, we have the option of first performing a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit or indefinite-lived intangible asset is less than their respective carrying amounts as the basis to determine if it is necessary to perform a quantitative impairment test. If we choose not to complete a qualitative assessment, or if the initial assessment indicates that it is more likely than not that the carrying amount of a reporting unit or the carrying amount of an indefinite-lived intangible asset exceeds their respective estimated fair values, a quantitative test is required. Our decision to perform a qualitative impairment assessment in a given year is influenced by a number of factors, including but not limited to, the size of the reporting unit’s goodwill, the significance of the excess of the reporting unit’s estimated fair value or the indefinite-lived intangible asset’s fair value over their respective carrying amounts at the last quantitative assessment date, and the amount of time in between quantitative fair value assessments.\nIn performing a quantitative impairment test, we compare the fair value of each reporting unit and indefinite-lived intangible asset with their respective carrying amounts. The fair value of each reporting unit is estimated using a combination of a discounted cash flow valuation, which incorporates assumptions regarding future growth rates, terminal values, and discount rates, as well as guideline public company valuations, which incorporates relevant trading multiples of comparable companies and other factors. The estimates and assumptions used consider historical performance and are consistent with the assumptions used in determining future profit plans for each reporting unit, which are approved by our board of directors. The fair value of indefinite-lived intangible assets is primarily determined on the basis of estimated discounted value, using the Greenfield Approach for exchange and clearing registrations and licenses, and the relief from royalty approach or excess earnings approach for trade names, both of which incorporate assumptions regarding future revenue projections and discount rates. If the carrying amounts of the reporting unit or the indefinite-lived intangible asset exceed their respective fair values, an impairment charge is recognized in an amount equal to the difference, limited to the total amount of goodwill allocated to that reporting unit or the total carrying value of the indefinite-lived intangible asset.\nThe following table presents the carrying value of goodwill for our reportable segments at the time of our 2024 annual impairment test:\n \nOctober 1, 2024\n(in millions)\nCapital Access Platforms\n$\n4,210 \nFinancial Technology \n7,945 \nMarket Services\n2,010 \n \n$\n14,165 \n55\nIn 2024, we performed a qualitative impairment test for goodwill on all reporting units and indefinite-lived intangible assets, as the excesses of their fair values over their respective carrying amounts, at the time of the last quantitative test in 2023, were significant. In conducting the qualitative assessment, we evaluated the performance of each of these reporting units and indefinite-lived intangible assets since the last quantitative test, as well as future financial projections to determine if there were any changes in the key inputs used to determine their respective fair values. We also considered the qualitative factors in FASB ASC Topic 350, “Intangibles–Goodwill and Other,” as well as other relevant events and circumstances. Based on the results of the qualitative assessment for each reporting unit and indefinite-lived intangible asset, and the predominance of positive indicators and the weight of such indicators, we concluded that the fair values of our reporting units and indefinite-lived intangible assets are more likely than not greater than their respective carrying amounts and as a result, quantitative analyses were not needed. No impairment of goodwill or indefinite-lived intangible assets was recorded in 2024, 2023 and 2022.\nAlthough we believe our estimates of fair value are reasonable, the determination of certain valuation inputs is subject to management’s judgment. Changes in these inputs could materially affect the results of our impairment review. If our forecasts of cash flows or other key inputs are negatively revised in the future, the estimated fair value of each reporting unit and of our indefinite-lived intangible assets would be adversely impacted, potentially leading to an impairment in the future that could materially affect our operating results.\nSubsequent to our annual impairment test, no indications of impairment were identified.\nOther Long-Lived Assets and Related Impairment\nWe review our other long-lived assets, such as finite-lived intangible assets, property and equipment, and operating lease assets for potential impairment when there is evidence that events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. The carrying amount of an asset is not recoverable if it exceeds the sum of the undiscounted cash flows expected to result from the use and eventual disposition of the asset. Fair value of finite-lived intangible assets and property and equipment is based on various valuation techniques. Any required impairment loss is measured as the amount by which the carrying amount of the asset exceeds its fair value and is recorded as a reduction in the carrying amount of the related asset and a charge to operating results.\nThere were no material finite-lived intangible assets impairment charges in 2024, 2023 and 2022.  \nWe recorded pre-tax, non-cash property and equipment asset impairment charges, primarily in relation to our restructuring programs of $37 million in 2024, $12 million in 2023 and $8 million in 2022. See Note 20, “Restructuring Charges,” to the consolidated financial statements for a discussion of these plans.\nIn 2023, we initiated a review of our real estate and facility capacity requirements due to our new and evolving work models. As a result of this ongoing review, we recorded impairment charges of $23 million in 2023 of which $18 million related to operating lease asset impairment and exit costs and is included in occupancy expense in the Consolidated Statements of Income and $5 million related to impairment of leasehold improvements, which are recorded in depreciation and amortization expense in the Consolidated Statements of Income.  \nNo material impairments were recorded to reduce the carrying value of our other long-lived assets during 2024, 2023 or 2022.\nIncome Taxes\nEstimates and judgments are required in the calculation of certain tax liabilities and in the determination of the recoverability of certain deferred tax assets, which arise from net operating loss carryforwards, tax credit carryforwards and temporary differences between the tax and financial statement recognition of revenues and expenses. Our deferred tax assets are reduced by a valuation allowance if it is more likely than not that some portion or all of the recorded deferred tax assets will not be realized in future periods. Management is required to determine whether a tax position is more likely than not to be sustained upon examination, including resolution of any related appeals or litigation processes, based on the technical merits of the position. Once it is determined that a position meets the recognition thresholds, the position is measured to determine the amount of benefit to be recognized in the consolidated financial statements. \nIn assessing the need for a valuation allowance, we consider all available evidence including past operating results, the existence of cumulative losses in the most recent fiscal years, estimates of future taxable income and the feasibility of tax planning strategies. In the event that we change our determination as to the amount of deferred tax assets that can be realized, we will adjust our valuation allowance with a corresponding impact to the provision for income taxes in the period in which such determination is made.\nIn addition, the calculation of our tax liabilities involves uncertainties in the application of tax regulations in the U.S. and other tax jurisdictions. We recognize potential liabilities for anticipated tax audit issues in such jurisdictions based on our estimate of whether, and the extent to which, additional taxes and interest may be due. While we believe that our tax liabilities reflect the probable outcome of identified tax uncertainties, it is reasonably possible that the ultimate resolution of any tax matter may be greater or less than the \n56\namount accrued. If events occur and the payment of these amounts ultimately proves unnecessary, the reversal of the liabilities would result in tax benefits being recognized in the period when we determine the liabilities are no longer necessary. If our estimate of tax liabilities proves to be less than the ultimate assessment, a further charge to expense would result.",
  "item2": null
}