{
  "source_file": "ndaq-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the financial condition and results of operations of Nasdaq should be read in conjunction with our condensed consolidated financial statements and related notes included in this Form 10-Q.\nCertain percentages and per share amounts herein may not sum or recalculate due to rounding. \nEXECUTIVE OVERVIEW\nNasdaq is a global technology company serving corporate clients, investment managers, banks, brokers, and exchange operators as they navigate and interact with the global capital markets and the broader financial system. We aspire to deliver world-leading platforms that improve the liquidity, transparency, and integrity of the global economy. Our diverse offering of data, analytics, software, exchange capabilities, and client-centric services enables clients to optimize and execute their business vision with confidence.\nWe manage, operate and provide our products and services in three business segments: Capital Access Platforms, Financial Technology and Market Services.\nThird Quarter 2025 Highlights\n•\nNasdaq delivered a strong quarter in Listing Services, highlighting the Company’s continued market leadership and welcomed U.S. operating companies that raised $6.0 billion in proceeds.\n•\nIndex had $17 billion in net inflows in the third quarter  and a record $91 billion in net inflows over the last twelve months. End of period ETP AUM reached $829 billion \nand average ETP AUM over the third quarter was $\n777\n billion \nat quarte\nr-end, an all-time high. Nasdaq launched 30 new Index products in the third quarter, including 18 international products and 13 in the institutional insurance annuity space.\n•\nThe Financial Technology segment delivered 12% ARR growth, reflecting an increase in new clients, cross-sells and upsells.\n•\nMarket Services delivered record U.S. equity derivatives revenue and volumes. Within our U.S. derivatives business, Nasdaq Index options volumes also achieved record levels in the third quarter. \n•\nIn September, Nasdaq’s Closing Cross set a new daily notional value record.\nMacroeconomic environment\nOur business performance can be positively or negatively impacted by a number of factors, including general economic conditions, the geopolitical environment, current or expected inflation, interest rate fluctuations, the threat or imposition of broad-based tariffs, market volatility, changes in investment patterns and priorities, regulatory changes, pandemics and other factors that are generally beyond our control. For example, higher overall U.S. trading volumes in the first nine months of 2025, as compared to the same period in 2024, has led to an increase in our U.S. Equity Derivative Trading and U.S. Cash Equity Trading revenues. Market factors also contributed to higher valuations in Nasdaq indices. The impact of global uncertainty due to tariff policies has caused some delays in IPOs; however, the expectation of a lower cost of capital, U.S. economic resilience and certain deregulation efforts have created more investor confidence in new issuances. To the extent that global or national economic conditions weaken and result in slower growth or recessions, or we experience an extended U.S. federal government shutdown, our business may temporarily be negatively impacted.\n28\nNasdaq\n’\ns Operating Results\nThe following tables summarize our financial performance for the three and nine months ended September 30, 2025 compared to the same periods in 2024. For a detailed discussion of our results of operations, see “Segment Operating Results” below.\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions, except per share amounts)\nRevenues less transaction-based expenses\n$\n1,315 \n$\n1,146 \n14.8 \n%\nOperating expenses\n729 \n698 \n4.4 \n%\nOperating income\n$\n586 \n$\n448 \n31.0 \n%\nNet income attributable to Nasdaq\n$\n423 \n$\n306 \n38.4 \n%\nDiluted earnings per share\n$\n0.73 \n$\n0.53 \n38.4 \n%\nCash dividends declared per common share\n$\n0.27 \n$\n0.24 \n12.5 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions, except per share amounts)\n \nRevenues less transaction-based expenses\n$\n3,857 \n$\n3,422 \n12.7 \n%\nOperating expenses\n2,155 \n2,141 \n0.7 \n%\nOperating income\n$\n1,702 \n$\n1,281 \n32.9 \n%\nNet income attributable to Nasdaq\n$\n1,270 \n$\n762 \n66.6 \n%\nDiluted earnings per share\n$\n2.19 \n$\n1.32 \n66.6 \n%\nCash dividends declared per common share\n$\n0.78 \n$\n0.70 \n11.4 \n%\nIn countries with currencies other than the U.S. dollar, revenues and expenses are translated using monthly average exchange rates. Impacts on our revenues less transaction-based expenses and operating income associated with fluctuations in foreign currency are discussed in more detail under “Item 3. Quantitative and Qualitative Disclosures About Market Risk.”\nThe following chart summarizes our ARR (in millions): \nARR for a given period is the current annualized value derived from subscription contracts with a defined contract value. This excludes contracts that are not recurring, are one-time in nature, or where the contract value fluctuates based on defined metrics. ARR is currently one of our key performance metrics to assess the health and trajectory of our recurring business. ARR does not have any standardized definition and is therefore unlikely to be comparable to similarly titled measures presented by other companies. ARR should be viewed independently of revenue and deferred revenue and is not intended to be combined with or to replace either of those items. For AxiomSL and Calypso recurring revenue contracts, the amount included in ARR is consistent with the amount that we invoice the customer during the current period. Additionally, for AxiomSL and Calypso recurring revenue contracts that include annual values that increase over time, we include in ARR only the annualized value of components of the contract that are considered active as of the date of the ARR calculation. We do not include the future committed increases in the contract value as of the date of the ARR calculation. ARR is not a forecast and the active contracts at the end of a reporting period used in calculating ARR may or may not be extended or renewed by our customers.\n29\nThe ARR chart includes:\n▪\nCapital Access Platforms\n◦\nProprietary market data subscriptions and annual listing fees within our Data & Listing Services business\n◦\nIndex data subscriptions and guaranteed minimum on futures contracts within our Index business\n◦\nSubscription contracts under our Workflow & Insights business\n▪\nFinancial Technology\n◦\nFinancial Crime Management Technology SaaS subscription contracts excluding one-time service requests\n◦\nRegulatory Technology SaaS and subscription and support contracts excluding one-time service requests\n◦\nCapital Markets Technology SaaS and subscription and support contracts excluding one-time service requests\nThe following chart summarizes our quarterly annualized SaaS revenues for Solutions, which comprises our Capital Access Platforms and Financial Technology segments, for September 30, 2025 and 2024 (in millions):\nSEGMENT OPERATING RESULTS\nThe following tables present our revenues by segment:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nCapital Access Platforms\n$\n546 \n$\n501 \n9.1 \n%\nFinancial Technology\n457 \n371 \n23.3 \n%\nMarket Services\n946 \n1,022 \n(7.4)\n%\nOther revenues\n9 \n8 \n1.7 \n%\nTotal revenues\n$\n1,958 \n$\n1,902 \n3.0 \n%\nTransaction rebates\n(637)\n(513)\n24.1 \n%\nBrokerage, clearance and exchange fees\n(6)\n(243)\n(97.2)\n%\nTotal revenues less transaction-based expenses\n$\n1,315 \n$\n1,146 \n14.8 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nCapital Access Platforms\n$\n1,588 \n$\n1,460 \n8.8 \n%\nFinancial Technology\n1,352 \n1,183 \n14.4 \n%\nMarket Services\n3,171 \n2,700 \n17.4 \n%\nOther revenues\n27 \n27 \n0.1 \n%\nTotal revenues\n$\n6,138 \n$\n5,370 \n14.3 \n%\nTransaction rebates\n(1,845)\n(1,478)\n24.8 \n%\nBrokerage, clearance and exchange fees\n(436)\n(470)\n(7.3)\n%\nTotal revenues less transaction-based expenses\n$\n3,857 \n$\n3,422 \n12.7 \n%\n30\nThe following charts present our Capital Access Platforms, Financial Technology and Market Services segments as a percentage of our total revenues, less transaction-based expenses. \nCapital Access Platforms\nThe following tables present revenues and ARR from our Capital Access Platforms segment:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nData & Listing Services\n$\n204 \n$\n190 \n7.4 \n%\nIndex\n206 \n182 \n13.5 \n%\nWorkflow & Insights\n136 \n129 \n5.4 \n%\nTotal Capital Access Platforms\n$\n546 \n$\n501 \n9.1 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nData & Listing Services\n$\n594 \n$\n562 \n5.8 \n%\nIndex\n595 \n517 \n14.9 \n%\nWorkflow & Insights\n399 \n381 \n4.8 \n%\nTotal Capital Access Platforms\n$\n1,588 \n$\n1,460 \n8.8 \n%\nAs of September 30,\n2025\n2024\nARR (in millions)\n$\n1,345 \n$\n1,254 \n31\nData & Listing Services Revenues\nThe following tables present key drivers from our Data & Listing Services business:\nThree Months Ended September 30,\n2025\n2024\nIPOs\nThe Nasdaq Stock Market\n76 \n48 \nThe Nasdaq Stock Market - SPACs\n30 \n15 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n2 \n1 \nTotal new listings\nThe Nasdaq Stock Market\n205 \n138 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n4 \n6 \nNine Months Ended September 30,\n2025\n2024\nIPOs\nThe Nasdaq Stock Market\n218 \n114 \nThe Nasdaq Stock Market - SPACs\n89 \n28 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n12 \n7 \nTotal new listings\nThe Nasdaq Stock Market\n569 \n301 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n19 \n18 \nAs of September 30,\n2025\n2024\nNumber of listed companies\nThe Nasdaq Stock Market\n4,359 \n4,039 \nExchanges that comprise Nasdaq Nordic and Nasdaq Baltic\n1,133 \n1,186 \nARR (in millions)\n743 \n683 \nIn the tables above:\n•\nThe number of total listed companies on The Nasdaq Stock Market for the nine months ended September 30, 2025 and 2024 included 1,000 and 712 ETPs, respectively. \n•\nIPOs, new listings (which includes IPOs) and total listed companies for exchanges that comprise Nasdaq Nordic and Nasdaq Baltic represent companies listed on the Nasdaq Nordic and Nasdaq Baltic exchanges and companies listed on the alternative markets of Nasdaq First North.\nData & Listing Services revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 due to new listings, an increase in data net sales and usage, and pricing, partially offset by delistings and lower amortization of prior period initial listing fees. \nIndex Revenues\nThe following table presents key drivers from our Index business:\nAs of or \nThree Months Ended September 30,\n2025\n2024\nNumber of licensed ETPs\n439 \n388 \nTTM change in period end ETP AUM tracking Nasdaq indices (in billions)\nBeginning balance\n$\n600 \n$\n411 \nNet appreciation\n138 \n143 \nNet impact of ETP sponsor switches\n— \n(16)\nNet inflows\n91 \n62 \nEnding balance\n$\n829 \n$\n600 \nQuarterly average ETP AUM tracking Nasdaq indices (in billions)\n$\n777 \n$\n575 \nARR (in millions)\n$\n81 \n$\n74 \nIn the table above, TTM represents trailing twelve months.\nIndex revenues increased for the three months ended September 30, 2025 compared with the same period in 2024 primarily due to higher average AUM in exchange traded products linked to Nasdaq indices, partially offset by lower revenues on derivatives contracts linked to the Nasdaq-100 index. Index revenues increased for the nine months ended September 30, 2025 compared with the same period in 2024 due to higher average AUM in exchange traded products linked to Nasdaq indices and growth in revenues due to higher trading volume on derivatives contracts linked to the Nasdaq-100 Index. This increase was partially offset by a $16 million one-time item recognized in the first quarter of 2024 related to a legal settlement to recoup revenue.\nWorkflow & Insights Revenues\nThe following table presents key drivers from our Workflow & Insights business:\nAs of or \nThree Months Ended September 30,\n2025\n2024\n(in millions)\nARR\n$\n521 \n$\n497 \nQuarterly annualized SaaS revenues\n450 \n427 \nWorkflow & Insights revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 due to an increase in analytics revenues, largely driven by eVestment and Nasdaq Alternative Data sales growth.  \n32\nFinancial Technology\nThe following tables present revenues from our Financial Technology segment:\n \nThree Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nFinancial Crime Management Technology\n$\n84 \n$\n69 \n22.0 \n%\nRegulatory Technology\n109 \n68 \n61.6 \n%\nCapital Markets Technology\n264 \n234 \n12.6 \n%\nTotal Financial Technology\n$\n457 \n$\n371 \n23.3 \n%\nNine Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nFinancial Crime Management Technology\n$\n241 \n$\n200 \n20.7 \n%\nRegulatory Technology\n315 \n253 \n24.2 \n%\nCapital Markets Technology\n796 \n730 \n9.2 \n%\nTotal Financial Technology\n$\n1,352 \n$\n1,183 \n14.4 \n%\nFinancial Crime Management Technology Revenues\nThe following table presents key drivers for our Financial Crime Management Technology business:\nAs of or \nThree Months Ended September 30,\n2025\n2024\n(in millions)\nARR and Quarterly annualized SaaS revenues\n$\n316 \n$\n268 \nFinancial Crime Management Technology revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher subscription revenues from new sales and price increases to existing clients, and new client contracts.\nRegulatory Technology Revenues\nThe following table presents key drivers for our Regulatory Technology business:\nAs of or \nThree Months Ended September 30,\n2025\n2024\n(in millions)\nARR\n$\n389 \n$\n350 \nQuarterly annualized SaaS revenues\n213 \n188 \nRegulatory Technology revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to increased subscription revenue from new sales and price increases to existing clients, and revenue from new clients from our AxiomSL and Surveillance product offerings. Revenues also increased as compared to the same periods in 2024 due to a one-time revenue reduction recognized in the third quarter of 2024 related to a purchase accounting adjustment. See Note 3, “Revenue from Contracts with Customers,” to the condensed consolidated financial statements for discussion on the measurement period adjustment.\nCapital Markets Technology Revenues\nThe following table presents key drivers for our Capital Markets Technology business:\nAs of or \nThree Months Ended September 30,\n2025\n2024\n(in millions)\nARR \n$\n957 \n$\n864 \nQuarterly annualized SaaS revenues\n153 \n128 \nCapital Markets Technology revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024. The increase for both periods was primarily due to an increase in our trade management services business due to data center growth. The increase for these periods is also attributable to higher subscription revenues from new sales and price increases to existing clients, as well as revenues from new clients from our Calypso business. For the nine months ended September 30, 2025 the increase was also driven by price increases and upsells in our market technology business.\n33\nMarket Services\nThe following tables present revenues from our Market Services segment:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nMarket Services \n$\n946 \n$\n1,022 \n(7.4)\n%\nTransaction-based expenses:\nTransaction rebates\n(637)\n(513)\n24.1 \n%\nBrokerage, clearance and exchange fees\n(6)\n(243)\n(97.2)\n%\nTotal Market Services, net\n$\n303 \n$\n266 \n14.1 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nMarket Services \n$\n3,171 \n$\n2,700 \n17.4 \n%\nTransaction-based expenses:\nTransaction rebates\n(1,845)\n(1,478)\n24.8 \n%\nBrokerage, clearance and exchange fees\n(436)\n(470)\n(7.3)\n%\nTotal Market Services, net\n$\n890 \n$\n752 \n18.3 \n%\nThe following tables present net revenues by product from our Market Services segment:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nU.S. Equity Derivative Trading\n$\n124 \n$\n107 \n15.5 \n%\nCash Equity Trading\n127 \n107 \n19.0 \n%\nU.S. Tape plans\n33 \n35 \n(7.4)\n%\nOther\n19 \n17 \n18.5 \n%\nTotal Market Services, net\n$\n303 \n$\n266 \n14.1 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\nU.S. Equity Derivative Trading\n$\n346 \n$\n289 \n19.8 \n%\nCash Equity Trading\n381 \n317 \n20.1 \n%\nU.S. Tape plans\n103 \n94 \n8.7 \n%\nOther\n60 \n52 \n15.8 \n%\nTotal Market Services, net\n$\n890 \n$\n752 \n18.3 \n%\nIn the preceding tables, Other includes Nordic fixed income trading & clearing, Nordic derivatives and Canadian cash equities trading.\nU.S. Equity Derivative Trading \nThe following tables present total revenues, transaction-based expenses, and total revenues less transaction-based expenses as well as key drivers from our U.S. Equity Derivative Trading business:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nU.S. Equity Derivative Trading Revenues\n$\n416 \n$\n374 \n11.4 \n%\nSection 31 fees\n— \n27 \n(100.0)\n%\nTransaction-based expenses:\nTransaction rebates\n(292)\n(266)\n9.9 \n%\nSection 31 fees\n— \n(27)\n(100.0)\n%\nBrokerage and clearance fees\n— \n(1)\n(44.4)\n%\nU.S. Equity Derivative Trading Revenues, net\n$\n124 \n$\n107 \n15.5 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\nU.S. Equity Derivative Trading Revenues\n$\n1,234 \n$\n1,031 \n19.7 \n%\nSection 31 fees\n47 \n57 \n(17.5)\n%\nTransaction-based expenses:\n \nTransaction rebates\n(885)\n(740)\n19.7 \n%\nSection 31 fees\n(47)\n(57)\n(17.5)\n%\nBrokerage and clearance fees\n(3)\n(2)\n25.3 \n%\nU.S. Equity Derivative Trading Revenues, net\n$\n346 \n$\n289 \n19.8 \n%\nSection 31 fees are recorded as U.S. equity derivative and U.S. cash equity trading revenues with a corresponding amount recorded in transaction-based expenses. We are assessed these fees from the SEC and pass them through to our customers in the form of incremental fees. Pass-through fees can increase or decrease due to rate changes by the SEC, our percentage of the overall industry volumes processed on our systems, and differences in actual dollar value traded. Section 31 fees decreased for the three and nine months  ended September 30, 2025 compared with the same periods in 2024 primarily due to a rate change by the SEC in the second quarter of 2025. Since the amount recorded in revenues is equal to the amount recorded as Section 31 fees, there is no impact on our net revenues. \n34\nThree Months Ended September 30,\n2025\n2024\nTotal industry average daily volume (in millions)\n55.8 \n44.5 \nNasdaq PHLX matched market share\n10.4\n%\n9.4\n%\nThe Nasdaq Options Market matched market share\n2.5\n%\n5.8\n%\nNasdaq BX Options matched market share\n1.6\n%\n2.3\n%\nNasdaq ISE Options matched market share\n7.0\n%\n6.8\n%\nNasdaq GEMX Options matched market share\n3.5\n%\n2.7\n%\nNasdaq MRX Options matched market share\n3.5\n%\n3.2\n%\nTotal matched market share executed on Nasdaq’s exchanges\n28.5\n%\n30.2\n%\nNine Months Ended September 30,\n \n2025\n2024\nU.S. equity options\n \nTotal industry average daily volume (in millions)\n54.0 \n43.3 \nNasdaq PHLX matched market share\n9.7\n%\n9.9\n%\nThe Nasdaq Options Market matched market share\n3.9\n%\n5.5\n%\nNasdaq BX Options matched market share\n1.7\n%\n2.3\n%\nNasdaq ISE Options matched market share\n6.8\n%\n6.7\n%\nNasdaq GEMX Options matched market share\n3.9\n%\n2.6\n%\nNasdaq MRX Options matched market share\n3.0\n%\n2.6\n%\nTotal matched market share executed on Nasdaq’s exchanges\n29.0\n%\n29.6\n%\nU.S. equity derivative trading revenues and U.S. equity derivative trading revenues, net increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher industry trading volumes, partially offset by lower capture and lower matched market share executed on Nasdaq’s exchanges.\nTransaction rebates, in which we credit a portion of the execution charge to the market participant, increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher industry trading volumes.\nCash Equity Trading Revenues\nThe following tables present total revenues, transaction-based expenses, and total revenues less transaction-based expenses as well as key drivers and other metrics from our Cash Equity Trading business:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nCash Equity Trading Revenues\n$\n471 \n$\n354 \n33.1 \n%\nSection 31 fees\n— \n210 \n(100.0)\n%\nTransaction-based expenses:\nTransaction rebates\n(338)\n(242)\n39.7 \n%\nSection 31 fees\n— \n(210)\n(100.0)\n%\nBrokerage and clearance fees\n(6)\n(5)\n17.2 \n%\nCash equity trading revenues, net\n$\n127 \n$\n107 \n19.0 \n%\nNine Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nCash Equity Trading Revenues\n$\n1,340 \n$\n1,056 \n27.0 \n%\nSection 31 fees\n367 \n394 \n(7.1\n%)\nTransaction-based expenses:\n \n \n \nTransaction rebates\n(940)\n(722)\n30.2\n%\nSection 31 fees\n(367)\n(394)\n(7.1\n%)\nBrokerage and clearance fees\n(19)\n(17)\n13.4\n%\nCash equity trading revenues, net\n$\n381 \n$\n317 \n20.1 \n%\nSee the discussion above for an explanation of Section 31 fees for the three and nine months ended September 30, 2025 as compared with the same periods in 2024. \n35\nThree Months Ended September 30,\n2025\n2024\nTotal U.S.-listed securities\nTotal industry average daily share volume (in billions)\n17.6 \n11.5 \nMatched share volume (in billions)\n158.6 \n118.2 \nThe Nasdaq Stock Market matched market share\n13.7\n%\n15.6\n%\nNasdaq BX matched market share\n0.3\n%\n0.3\n%\nNasdaq PSX matched market share\n0.1\n%\n0.2\n%\nTotal matched market share executed on Nasdaq’s exchanges\n14.1\n%\n16.1\n%\nMarket share reported to the FINRA/Nasdaq Trade Reporting Facility\n47.6\n%\n44.7\n%\nTotal market share\n61.7\n%\n60.8\n%\nNasdaq Nordic and Nasdaq Baltic securities\nAverage daily number of equity trades executed on Nasdaq’s exchanges\n627,568\n609,167\nTotal average daily value of shares traded (in billions)\n$\n4.5 \n$\n4.1 \nTotal market share executed on Nasdaq’s exchanges\n72.8\n%\n72.3\n%\nNine Months Ended September 30,\n \n2025\n2024\nTotal U.S.-listed securities\nTotal industry average daily share volume (in billions)\n17.2 \n11.7 \nMatched share volume (in billions)\n454.4 \n354.3 \nThe Nasdaq Stock Market matched market share\n13.8\n%\n15.6\n%\nNasdaq BX matched market share\n0.3\n%\n0.4\n%\nNasdaq PSX matched market share\n0.1\n%\n0.2\n%\nTotal matched market share executed on Nasdaq’s exchanges\n14.2\n%\n16.2\n%\nMarket share reported to the FINRA/Nasdaq Trade Reporting Facility\n47.7\n%\n43.0\n%\nTotal market share\n61.9\n%\n59.2\n%\nNasdaq Nordic and Nasdaq Baltic securities\nAverage daily number of equity trades executed on Nasdaq’s exchanges\n736,829\n645,622\nTotal average daily value of shares traded (in billions)\n$\n5.2 \n$\n4.5 \nTotal market share executed on Nasdaq’s exchanges\n71.8\n%\n72.2\n%\nCash equity trading revenues and cash equity trading revenues, net increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher U.S. and European industry trading volumes, partially offset by lower overall U.S. matched market share executed on Nasdaq's exchanges and lower capture.\nTransaction rebates increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher U.S. industry volumes, partially offset by lower overall U.S. matched market share executed on Nasdaq’s exchanges. For The Nasdaq Stock Market and Nasdaq PSX, we credit a portion of the per share execution charge to the market participant that provides the liquidity, and for Nasdaq BX, we credit a portion of the per share execution charge to the market participant that takes the liquidity. \nU.S. Tape Plans\nThe following tables present revenues from our U.S. Tape plans business:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nU.S. Tape plans\n$\n33 \n$\n35 \n(7.4)\n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\nU.S. Tape plans\n$\n103 \n$\n94 \n8.7 \n%\nU.S. Tape plans revenues decreased for the three months ended September 30, 2025 compared with the same period in 2024 primarily due to lower audit revenue collection, partially offset by higher usage volume. The increase for the nine months ended September 30, 2025 compared with the same period in 2024 was primarily due to higher one-time industry-wide adjustments and higher usage volume.\nOther\nOther includes Nordic fixed income trading and clearing, Nordic derivatives and Canadian cash equities trading. The following tables present revenues from these businesses:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nOther\n$\n19 \n$\n17 \n18.5 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\nOther\n$\n60 \n$\n52 \n15.8 \n%\nIn the preceding tables, Other is presented net of Canadian cash equity transaction rebates of $7 million and $5 million \nfor the three months ended \nSeptember 30, 2025 and 2024, respectively, and $20 million and $16 million \nfor the nine months ended \nSeptember 30, 2025 and 2024, respectively.\nOther revenues increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 due to an increase in Nordic derivatives revenues and Canadian cash equity revenues. \n36\nOther Revenues\nFor the three and nine months ended September 30, 2025 and 2024, Other revenues include revenues related to our Nordic power futures business. See Note 4, \"Divestitures,\" for further discussion. \nEXPENSES\nOperating Expenses \nThe following tables present our operating expenses:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nCompensation and benefits\n$\n353 \n$\n332 \n6.5 \n%\nProfessional and contract services\n38 \n36 \n6.7 \n%\nTechnology and communication infrastructure\n80 \n71 \n11.9 \n%\nOccupancy\n32 \n28 \n15.0 \n%\nGeneral, administrative and other\n22 \n26 \n(18.6)\n%\nMarketing and advertising\n13 \n11 \n17.0 \n%\nDepreciation and amortization\n158 \n153 \n3.3 \n%\nRegulatory\n12 \n9 \n32.8 \n%\nMerger and strategic initiatives\n9 \n10 \n(12.3)\n%\nRestructuring charges\n12 \n22 \n(44.4)\n%\nTotal operating expenses\n$\n729 \n$\n698 \n4.4 \n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nCompensation and benefits\n$\n1,033 \n$\n1,000 \n3.3%\nProfessional and contract services\n112 \n108 \n4.5%\nTechnology and communication infrastructure\n236 \n207 \n14.2%\nOccupancy\n90 \n85 \n7.0%\nGeneral, administrative and other\n51 \n84 \n(39.7)%\nMarketing and advertising\n41 \n34 \n19.9%\nDepreciation and amortization\n471 \n460 \n2.3%\nRegulatory\n41 \n37 \n10.1%\nMerger and strategic initiatives\n53 \n23 \n129.8%\nRestructuring charges\n27 \n103 \n(74.4)%\nTotal operating expenses\n$\n2,155 \n$\n2,141 \n0.7%\nThe increase in compensation and benefits expense for the three and nine months ended September 30, 2025 compared with the same periods in 2024 was primarily driven by increased headcount and higher incentive compensation. The increase in the first nine month of 2025 compared with the same period in 2024 was partially offset by a pre-tax charge of $23 million in the first quarter of 2024 resulting from the finalization of the termination of our pension plan.\nHeadcount, including employees of non-wholly owned consolidated subsidiaries, increased to 9,625 employees as of September 30, 2025 from 9,120 employees as of September 30, 2024, as we support revenue growth and innovation.\nProfessional and contract services expense increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to increased consulting costs. For the nine months ended September 30, 2025, these costs were partially offset by a decrease in certain legal fees.\nTechnology and communication infrastructure expense increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to increased investment in technology, particularly our cloud initiatives and software licensing.\nOccupancy expense increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to colocation data center growth.\n37\nGeneral, administrative and other expense decreased for the three and nine months ended September 30, 2025 as compared with the same periods in 2024 due to a change in classification of costs related to the CAT from general, administrative and other expense to regulatory expense, beginning in the fourth quarter of 2024 and a gain on extinguishment of debt recorded in the first nine months of 2025. See Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion.\nMarketing and advertising expense increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to higher client acquisition costs.\nDepreciation and amortization expense increased slightly for the three and nine months ended September 30, 2025 compared with the same periods in 2024 due to increased depreciation of capitalized software projects.\nRegulatory expense increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to an increase in CAT operating fees and the change in classification of these costs, as described above.\nWe have pursued various strategic initiatives and completed acquisitions and \ndivestitures i\nn recent years, which have resulted in expenses which would not have otherwise been incurred. These expenses generally include integration costs, as well as legal, due diligence and other third-party transaction costs and vary based on the size and frequency of the activities described above. For the three and nine months ended September 30, 2025, and 2024 these costs included Adenza integration costs and other strategic initiative costs. For the nine months ended September 30, 2024, these costs were partially offset by recognition of a termination fee due to Nasdaq in the second quarter of 2024, related to the termination of the then proposed divestiture of our Nordic power futures business. For the nine months ended September 30, 2025, these costs included a repayment of a portion of this fee due to the closing of the transaction with another buyer, as designated in the settlement agreement. \nRestructuring charges decreased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to the completion of our divisional realignment program in September 2024. \nWe further expanded our Adenza restructuring program in the fourth quarter of 2024 to accelerate our momentum. In connection with this program, we expect to incur up to approximately $140 million in pre-tax charges. Initiatives taken as part of this program are expected to be actioned by the end of 2025, while certain costs may be recognized in the first half of 2026. We have surpassed the initial program target by actioning approximately $150 million of net expense synergies through September 30, 2025, inclusive of the $80 million of net expense synergies related to the AxiomSL and Calypso acquisition. \nFor further discussion related to both programs described above, see Note 19, “Restructuring Charges,” to the condensed consolidated financial statements.\nNon-Operating Income and Expenses\nThe following tables present our non-operating income and expenses:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nInterest income\n$\n8 \n$\n8 \n—%\nInterest expense\n(87)\n(102)\n(14.5)\n%\nNet interest expense\n(79)\n(94)\n(15.7)\n%\nNet gain (loss) on divestitures\n(2)\n— \nN/M\nOther income\n— \n1 \n(119.9)\n%\nNet income from unconsolidated investees\n24 \n1 \n2,361.0 \n%\nTotal non-operating expense \n$\n(57)\n$\n(92)\n(39.0)\n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\nInterest income\n$\n32 \n$\n20 \n55.4 \n%\nInterest expense\n(279)\n(313)\n(10.9)\n%\nNet interest expense\n(247)\n(293)\n(15.5)\n%\nNet gain (loss) on divestitures\n37 \n— \nN/M\nOther income\n— \n15 \n(99.7)\n%\nNet income from unconsolidated investees\n73 \n7 \n1,012.5 \n%\nTotal non-operating expense\n$\n(137)\n$\n(271)\n(36.0)\n%\n38\nThe following tables present our interest expense:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nInterest expense on debt\n$\n84 \n$\n98 \n(14.3)\n%\nAccretion of debt issuance costs and debt discount\n2 \n3 \n(16.8)\n%\nOther fees\n1 \n1 \n(21.1)\n%\nInterest expense\n$\n87 \n$\n102 \n(14.5)\n%\n \nNine Months Ended September 30,\nPercentage Change\n \n2025\n2024\n \n(in millions)\n \nInterest expense on debt\n$\n269 \n$\n301 \n(10.6)\n%\nAccretion of debt issuance costs and debt discount\n8 \n10 \n(18.4)\n%\nOther fees\n2 \n2 \n(15.2)\n%\nInterest expense\n$\n279 \n$\n313 \n(10.9)\n%\nInterest income increased for the nine months ended September 30, 2025 compared with the same period in 2024 primarily due to a higher average cash balance.\nInterest expense decreased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 primarily due to lower average outstanding debt following the repayment of our 2025 Notes and the partial repurchases of several series of outstanding senior unsecured notes. See Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion.\nFor the nine months ended September 30, 2025, net gain (loss) on divestitures includes gains on divestitures of our Nordic power futures business and our Nasdaq Risk Modelling for Catastrophes business, net of costs to sell, of which a portion are reflected for the three months ended September 30, 2025. See Note 4, “Divestitures,” to the condensed consolidated financial statements for further discussion of these transactions.\nOther income primarily represents realized and unrealized gains and losses from strategic investments related to our corporate venture program.\nNet income from unconsolidated investees increased for the three and nine months ended September 30, 2025 compared with the same periods in 2024 due to higher income recognized from our equity method investment in OCC driven by higher industry volumes. See “Equity Method Investments,” of Note 6, “Investments,” to the condensed consolidated financial statements for further discussion.\nTax Matters\nThe following tables present our income tax provision and effective tax rate:\nThree Months Ended September 30,\nPercentage Change\n2025\n2024\n($ in millions)\nIncome tax provision\n$\n106 \n$\n51 \n106.9 \n%\nEffective tax rate\n20.0 \n%\n14.3 \n%\nNine Months Ended September 30,\nPercentage Change\n2025\n2024\n(in millions)\nIncome tax provision\n$\n296\n$\n250\n18.8 \n%\nEffective tax rate\n18.9 \n%\n24.8 \n%\nFor further discussion of our tax matters, see Note 16, “Income Taxes,” to the condensed consolidated financial statements.\nNON-GAAP FINANCIAL MEASURES\nIn addition to disclosing results determined in accordance with U.S. GAAP, we also provide non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share in this Quarterly Report on Form 10-Q. Management uses this non-GAAP information internally, along with U.S. GAAP information, in evaluating our performance and in making financial and operational decisions. We believe our presentation of these measures provides investors with greater transparency and supplemental data relating to our financial condition and results of operations. In addition, we believe the presentation of these measures is useful to investors for period-to-period comparisons of our ongoing operating performance.\nThese measures are not in accordance with, or an alternative to, U.S. GAAP, and may be different from non-GAAP measures used by other companies. In addition, other companies, including companies in our industry, may calculate such measures differently, which reduces their usefulness as comparative measures. Investors should not rely on any single financial measure when evaluating our business. This non-GAAP information should be considered as supplemental in nature and is not meant as a substitute for our operating results in accordance with U.S. GAAP. We recommend investors review the U.S. GAAP financial measures included in this Quarterly Report on Form 10-Q, including our condensed consolidated financial statements and the notes thereto. When viewed in conjunction with our U.S. GAAP results and the accompanying reconciliation, we believe these non-GAAP measures provide greater transparency and a more complete understanding of factors affecting our business than U.S. GAAP measures alone.\n39\nWe understand that analysts and investors regularly rely on non-GAAP financial measures, such as non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share, to assess operating performance. We use non-GAAP net income attributable to Nasdaq and non-GAAP diluted earnings per share because they highlight trends more clearly in our business that may not otherwise be apparent when relying solely on U.S. GAAP financial measures, since these measures eliminate from our results specific financial items that have less bearing on our ongoing operating performance. \nThe following tables present reconciliations between U.S. GAAP net income attributable to Nasdaq and diluted earnings per share and non-GAAP net income attributable to Nasdaq and diluted earnings per share:\n \nThree Months Ended September 30,\n2025\n2024\n(in millions, except per share amounts)\nU.S. GAAP net income attributable to Nasdaq\n$\n423 \n$\n306 \nNon-GAAP adjustments:\nAdenza purchase accounting adjustment\n— \n34 \nAmortization expense of acquired intangible assets\n122 \n122 \nMerger and strategic initiatives expense\n9 \n10 \nRestructuring charges\n12 \n22 \nNet (gain) loss on divestitures\n2 \n— \nNet income from unconsolidated investees\n(24)\n(1)\nLegal and regulatory matters\n1 \n— \nOther loss\n4 \n1 \nTotal non-GAAP adjustments\n$\n126 \n$\n188 \nNon-GAAP tax adjustments\n(38)\n(51)\nOther tax adjustments\n— \n(14)\nTotal non-GAAP adjustments, net of tax\n$\n88 \n$\n123 \nNon-GAAP net income attributable to Nasdaq\n$\n511 \n$\n429 \nU.S. GAAP effective tax rate\n20.0 \n%\n14.3 \n%\nTotal adjustments from non-GAAP tax rate\n2.0 \n%\n7.0 \n%\nNon-GAAP effective tax rate\n22.0 \n%\n21.3 \n%\nWeighted-average common shares outstanding for diluted earnings per share\n579.0 \n579.0 \nU.S. GAAP diluted earnings per share\n$\n0.73 \n$\n0.53 \nTotal adjustments from non-GAAP net income\n0.15 \n0.21 \nNon-GAAP diluted earnings per share\n$\n0.88 \n$\n0.74 \n \nNine Months Ended September 30,\n2025\n2024\n(in millions, except per share amounts)\nU.S. GAAP net income attributable to Nasdaq\n$\n1,270 \n$\n762 \nNon-GAAP adjustments:\nAdenza purchase accounting adjustment\n— \n34 \nAmortization expense of acquired intangible assets\n365 \n366 \nMerger and strategic initiatives expense\n53 \n23 \nRestructuring charges\n27 \n103 \nGain on extinguishment of debt\n(19)\n— \nNet (gain) loss on divestitures\n(37)\n— \nNet income from unconsolidated investees\n(73)\n(7)\nLegal and regulatory matters\n3 \n16 \nPension settlement charge\n— \n23 \nOther (income) loss\n6 \n(8)\nTotal non-GAAP adjustments\n$\n325 \n$\n550 \nNon-GAAP tax adjustments\n(108)\n(137)\nOther tax adjustments\n(27)\n19 \nTotal non-GAAP adjustments, net of tax\n$\n190 \n$\n432 \nNon-GAAP net income attributable to Nasdaq\n$\n1,460 \n$\n1,194 \nU.S. GAAP effective tax rate\n18.9 \n%\n24.8 \n%\nTotal adjustments from non-GAAP tax rate\n3.9 \n%\n(1.2)\n%\nNon-GAAP effective tax rate\n22.8 \n%\n23.6 \n%\nWeighted-average common shares outstanding for diluted earnings per share\n579.3 \n579.0 \nU.S. GAAP diluted earnings per share\n$\n2.19 \n$\n1.32 \nTotal adjustments from non-GAAP net income\n0.33 \n0.74 \nNon-GAAP diluted earnings per share\n$\n2.52 \n$\n2.06 \nWe believe that excluding the following items from the non-GAAP net income attributable to Nasdaq provides a more meaningful analysis of Nasdaq’s ongoing operating performance and comparisons in Nasdaq’s performance between periods:\n40\n•\nAdenza purchase accounting adjustment:\n During the third quarter of 2024, as part of finalizing the purchase accounting of the Adenza acquisition, a one-time revenue reduction of $32 million was recorded, reflecting the net impact of the accounting change on AxiomSL subscription revenue from the date of the Adenza acquisition. For the nine months ended September 30, 2024, we excluded the reduction of $34 million as this relates to the prior year's impact of this change from our non-GAAP results. We did not exclude the $2 million offsetting impact of this change as it is related to the 2024 results.\n•\nAmortization expense of acquired intangible assets: \nWe amortize intangible assets acquired in connection with various acquisitions. Intangible asset amortization expense can vary from period to period due to episodic acquisitions completed, rather than from our ongoing business operations. As such, if intangible asset amortization is included in performance measures, it is more difficult to assess the day-to-day operating performance of the businesses and the relative operating performance of the businesses between periods.\n•\nMerger and strategic initiatives expense:\n We have pursued various strategic initiatives and completed acquisitions and divestitures in recent years that have resulted in expenses which would not have otherwise been incurred. The frequency and the amount of such expenses vary significantly based on the size, timing and complexity of the transaction. These expenses primarily include integration costs, as well as legal, due diligence and other third-party transaction costs. \n◦\nFor the three and nine months ended September 30, 2025, and September 30, 2024, these costs included Adenza integration costs and other strategic initiative costs. For the nine months ended September 30, 2024, these costs were partially offset by the recognition of a termination fee due to Nasdaq in the second quarter of 2024, related to the termination of the then proposed divestiture of our Nordic power futures business. For the nine months ended September 30, 2025, these costs included a repayment of this fee due to the sale of the Nordic power futures business to another buyer, as designated in the settlement agreement. \n•\nRestructuring charges:\n In the fourth quarter of 2023, following the closing of the Adenza acquisition, our management approved, committed to and initiated a restructuring program, to optimize our efficiencies as a combined organization. We further expanded this restructuring program in the fourth quarter of 2024 to accelerate our momentum. In addition, we completed our divisional realignment program in September 2024. See Note 19, “Restructuring Charges,” to the condensed consolidated financial statements for further discussion of these programs. \n•\nNet income from unconsolidated investees\n: We exclude our share of the earnings and losses of our equity method investments. This provides a more meaningful analysis of Nasdaq’s ongoing operating performance or comparisons in Nasdaq’s performance between periods. See “Equity Method Investments,” of Note 6, “Investments,” to the condensed consolidated financial statements for further discussion. \n•\nOther items: \nWe have excluded certain other charges or gains, including certain tax items, that are the result of other non-comparable events to measure operating performance. We believe the exclusion of such amounts allows management and investors to better understand the ongoing financial results of Nasdaq. Other significant items include: \n◦\nNet (gain) loss on divestitures: \nFor the nine months ended \nSeptember 30, 2025, this includes gains on divestitures of our Nordic power futures business and our Nasdaq Risk Modelling for Catastrophes business, net of costs to sell, of which a portion are reflected for the three months ended September 30, 2025. See Note 4, “Divestitures,” to the condensed consolidated financial statements for further discussion of these transactions.\n◦\nGain on extinguishment of debt:\n For the nine months ended September 30, 2025, this includes a gain on extinguishment of debt, which is recorded under general, administrative and other expense in the Condensed Consolidated Statements of Income. See Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion.\n◦\nLegal and regulatory matters: \nFor the three and nine months ended September 30, 2025, this includes accruals relating to certain legal matters, which are recorded in professional and contract services in the Condensed Consolidated Statements of Income. For the nine months ended September 30, 2024, this primarily related to the settlement of an SFSA fine, and accruals related to certain legal matters. \n◦\nPension settlement charge: \nFor the nine months ended September 30, 2024, we recorded a pre-tax charge as a result of settling our U.S. pension plan. The plan was terminated and partially settled in 2023, with final settlement occurring during the first quarter of 2024. The pre-tax charge is recorded in compensation and benefits expense in the Condensed Consolidated Statements of Income. \n◦\nOther: \nFor the three and nine months ended September 30, 2025 and 2024, other items include net gains and losses from strategic investments entered into through our corporate venture program, which are included in other income in our Condensed Consolidated Statements of Income.\n41\n•\nTax adjustments: \nThe non-GAAP adjustment to the income tax provision primarily includes the tax impact of each non-GAAP adjustment. For the nine months ended September 30, 2025, this also includes a release of a prior year reserve following a favorable audit settlement. For the nine months ended September 30, 2025 and for the three and nine months ended September 30, 2024, other tax adjustments reflect a tax benefit related to payments made to certain former Adenza employees. For the nine months ended September 30, 2024, other tax adjustments also included a one-time net tax expense of $33 million related to the completion of an intra-group transfer of certain IP assets to our U.S. headquarters.\nLIQUIDITY AND CAPITAL RESOURCES\nHistorically, we have funded our operating activities and met our commitments through cash generated by operations, augmented by the periodic issuance of debt. Currently, our cost and availability of funding remain healthy. We continue to prudently assess our capital deployment strategy through balancing internal investments, debt repayments, and shareholder return activity, including dividends and share repurchases, and potential acquisitions.\nWe expect that our current cash and cash equivalents combined with cash flows provided by operating activities, supplemented with our borrowing capacity and access to additional financing, including our revolving credit facility and our commercial paper program, provides us additional flexibility to meet our ongoing obligations and the capital deployment strategic actions described above, while allowing us to invest in activities and product development that support the long-term growth of our operations. \nPrincipal factors that could affect the availability of our internally-generated funds include:\n•    deterioration of our revenues in any of our business segments;\n•    changes in regulatory and working capital requirements; and\n•\nan increase in our expenses.\nPrincipal factors that could affect our ability to obtain cash from external sources include:\n•    operating covenants contained in our credit facilities that limit our total borrowing capacity;\n•    credit rating downgrades, which could limit our access to additional debt;\n•    a significant decrease in the market price of our common stock; and\n•    volatility or disruption in the public debt and equity markets.\nThe following table summarizes selected measures of our liquidity and capital resources:\n \nSeptember 30, 2025\nDecember 31, 2024\n \n(in millions)\nWorking capital\n$\n(108)\n$\n(116)\nCash and cash equivalents\n470 \n592 \nFinancial investments\n53 \n184 \nWorking Capital\nThe increase in working capital from December 31, 2024 to September 30, 2025, excluding default funds and margin deposits, which are both equal and offsetting, is primarily due to a decrease in current liabilities, partially offset by a decrease in current assets.\nDecreased current liabilities were primarily due to:\n•\ndecreased Section 31 fees payable due to decrease in fee rate and timing of payment,\n•\na decrease in accounts payable and accrued expenses, and\n•\na decrease in accrued personnel costs due to timing of incentive compensation payments; partially offset by,\n•\nreclassification of 2026 Notes to short-term debt, partially offset by the repayment of the 2025 Notes and the partial repayment of the 2026 Notes,\n•\nan increase in other current liabilities, and\n•\nan increase in deferred revenue.\nDecreased current assets were primarily due to:\n•\ndecreased receivables, net due to timing of billings,\n•\nlower financial investments at fair value offset in restricted cash below,\n•\na decrease in cash and cash equivalents, and\n•\na decrease in other current assets; partially offset by\n•\nhigher restricted cash primarily due to the movement of regulatory capital to shorter term investments qualifying as cash equivalents.\nCash and Cash Equivalents\nCash and cash equivalents includes all non-restricted cash in banks and highly liquid investments with original maturities of 90 days or less at the time of purchase. The balance retained in cash and cash equivalents is a function of anticipated or possible short-term cash needs, prevailing interest rates, our investment policy, and alternative investment choices. As of September 30, 2025, our cash and cash equivalents of $470 million were primarily invested in money market funds, European government debt securities and bank deposits.\n42\nRepatriation of Cash\nOur cash and cash equivalents held outside of the U.S. in various foreign subsidiaries totaled $227 million as of September 30, 2025 and $181 million as of December 31, 2024. The remaining balance held in the U.S. totaled $243 million as of September 30, 2025 and $411 million as of December 31, 2024. \nRestricted Cash and Cash Equivalents\nRestricted cash and cash equivalents, which was $227 million as of September 30, 2025 and $31 million as of December 31, 2024, is restricted from withdrawal due to a contractual or regulatory requirement or not available for general use and as such is classified as restricted in the Condensed Consolidated Balance Sheets. The increase in this balance as of September 30, 2025 is primarily due to more regulatory capital being invested in shorter term investments, which are classified as cash equivalents, and are included in restricted cash and cash equivalents in the Condensed Consolidated Balance Sheets as of September 30, 2025. As of December 31, 2024, more regulatory capital was invested in longer term investments, which were classified as financial investments in the Condensed Consolidated Balance Sheets.\nCash Flow Analysis\nThe following table summarizes the changes in cash flows:\n \nNine Months Ended September 30,\n \n2025\n2024\nNet cash provided by (used in):\n(in millions)\nOperating activities\n$\n1,630 \n$\n1,234 \nInvesting activities\n(462)\n55 \nFinancing activities\n(2,386)\n(2,537)\nNet Cash Provided by Operating Activities\nNet cash provided by operating activities primarily consists of net income adjusted for certain non-cash items, including, but not limited to, depreciation and amortization expense, expense associated with share-based compensation, net income from unconsolidated investees and the effects of changes in working capital. Refer to the above discussion regarding changes in working capital.\nNet cash provided by operating activities increased $396 million for the nine months ended September 30, 2025 compared with the same period in 2024. The increase was primarily driven by an increase in net income, partially offset by changes in working capital, as discussed above. \nNet Cash Provided by (Used in) Investing Activities\nNet cash used in investing activities for the nine months ended September 30, 2025 primarily relates to net purchases of investments related to default funds and margin deposits of $419 million, purchases of property and equipment of $177 million and other investing activities of $76 million primarily related to our corporate venture program, partially offset by proceeds from sales and redemption of securities, net, of $158 million and proceeds from divestitures of $52 million. \nNet cash provided by investing activities for the nine months ended September 30, 2024 primarily related to net proceeds from sales and redemption of investments related to default funds and margin deposits of $237 million, partially offset by purchases of property and equipment of $147 million, other investing activities primarily related to our corporate venture program of $24 million and purchases of trading securities, net, of $11 million.\nNet Cash Used in Financing Activities\nNet cash used in financing activities for the nine months ended September 30, 2025 primarily relates to a decrease in default funds and margin deposits of $847 million, repayments of debt including the repayment of our 2025 Notes for $400 million, the partial repayment of our 2028, 2034 and 2052 Notes for $257 million and the partial repayment of our 2026 Notes for $69 million, dividend payments to our shareholders of $448 million, repurchases of common stock of $330 million and payments related to employee shares withheld for taxes of $63 million, partially offset by proceeds received from employee stock activity and other issuances of $28 million. \nNet cash used in financing activities for the nine months ended September 30, 2024 related to a decrease in default funds and margin deposits of $1,320 million, dividend payments to our shareholders of $403 million, repayment of the 2023 Term Loan of $340 million, repayments of our commercial paper, net, of $291 million, repurchases of common stock of $145 million and payments related to employee shares withheld for taxes of $56 million, partially offset by proceeds received from employee stock activity and other issuances of $21 million.\nSee Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion of our debt obligations.\nSee “Share Repurchase Program,” and “Cash Dividends on Common Stock,” of Note 11, “Nasdaq Stockholders’ Equity,” to the condensed consolidated financial statements for further discussion of our share repurchase program and cash dividends declared and paid on our common stock. \n43\nFinancial Investments\nOur financial investments totaled $53 million as of September 30, 2025 and $184 million as of December 31, 2024. Of these securities, $43 million as of September 30, 2025 and $171 million as of December 31, 2024 are assets primarily utilized to meet regulatory capital requirements, mainly for our clearing operations at Nasdaq Clearing. See Note 6, “Investments,” to the condensed consolidated financial statements for further discussion.  \nRegulatory Capital Requirements\nClearing Operations Regulatory Capital Requirements\nWe are required to maintain minimum levels of regulatory capital for the clearing operations of Nasdaq Clearing. The level of regulatory capital required to be maintained is dependent upon many factors, including market conditions and creditworthiness of the counterparty. As of September 30, 2025, our required regulatory capital of $159 million was primarily comprised of cash and cash equivalents that are included in restricted cash and cash equivalents in the Condensed Consolidated Balance Sheets.\nBroker-Dealer Net Capital Requirements\nOur broker-dealer subsidiaries, Nasdaq Execution Services, NFSTX, LLC, and Nasdaq Capital Markets Advisory, are subject to regulatory requirements intended to ensure their general financial soundness and liquidity. These requirements obligate these subsidiaries to comply with minimum net capital requirements. As of September 30, 2025, the combined required minimum net capital totaled $1 million and the combined excess capital totaled $23 million, substantially all of which is held in cash and cash equivalents in the Condensed Consolidated Balance Sheets. The required minimum net capital is included in restricted cash and cash equivalents in the Condensed Consolidated Balance Sheets. \nNordic and Baltic Exchange Regulatory Capital Requirements\nThe entities that operate trading venues in the Nordic and Baltic countries are each subject to local regulations and are required to maintain regulatory capital intended to ensure their general financial soundness and liquidity. As of September 30, 2025, our required regulatory capital of $43 million was primarily invested in European government bills that are included in financial investments in the Condensed Consolidated Balance Sheets and cash, which is included in restricted cash and cash equivalents in the Condensed Consolidated Balance Sheets. \nOther Capital Requirements\nWe operate several other businesses which are subject to local regulation and are required to maintain certain levels of regulatory capital. As of September 30, 2025, other required regulatory capital of $13 million, primarily related to Nasdaq Central Securities Depository, was primarily invested in European government debt securities that are included in financial investments in the Condensed Consolidated Balance Sheets and cash, which is included in restricted cash and cash equivalents in the Condensed Consolidated Balance Sheets. \nEquity and dividends\nShare Repurchase Program\nSee “Share Repurchase Program,” of Note 11, “Nasdaq Stockholders’ Equity,” to the condensed consolidated financial statements for further discussion of our share repurchase program.\nCash Dividends on Common Stock\nThe following table presents our quarterly cash dividends paid per common share on our outstanding common stock:\n2025\n2024\nFirst quarter\n$\n0.24 \n$\n0.22 \nSecond quarter\n0.27 \n0.24 \nThird quarter\n0.27 \n0.24 \nTotal\n$\n0.78 \n$\n0.70 \nSee “Cash Dividends on Common Stock,” of Note 11, “Nasdaq Stockholders’ Equity,” to the condensed consolidated financial statements for further discussion of the dividends. \n44\nDebt Obligations\nOur outstanding debt obligations, by contractual maturity, at September 30, 2025 are as follows (in U.S. Dollar millions):\nn\n U.S. Notes  \nn\n Euro Notes   \nIn the third quarter of 2025, we repurchased an aggregate principal amount of $69 million of our 2026 Notes. In the second quarter of 2025, we repaid in full the 2025 Notes for an aggregate of $400 million. In the first quarter of 2025, we repurchased an aggregate principal amount of $279 million of our 2028, 2034 and 2052 Notes, for a net purchase price of $257 million, excluding accrued interest. \nFor the three months ended September 30, 2025, the weighted average interest rate on our debt obligations was approximately 3.75% and for the nine months ended September 30, 2025, the weighted average interest rate on our debt obligations was approximately 3.83%. This rate can fluctuate based on changes in interest rates for our variable rate debts, changes in foreign currency exchange rates and changes in the amount and duration of outstanding debt. In addition to the 2022 Revolving Credit Facility, we also have other credit facilities primarily to support our Nasdaq Clearing operations in Europe, as well as to provide a cash pool credit line. These European credit facilities, which are available in multiple currencies, totaled $204 million as of September 30, 2025 and $174 million as of December 31, 2024 in available liquidity, none of which was utilized.\nAs of September 30, 2025, we were in compliance with the covenants of all of our debt obligations.\nSee Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion of our debt obligations.\nCONTRACTUAL OBLIGATIONS AND CONTINGENT COMMITMENTS\nNasdaq has contractual obligations to make future payments under debt obligations by contract maturity, operating lease payments, and other obligations. The following table summarizes material cash requirements for known contractual and other obligations as of September 30, 2025, and the estimated timing thereof.\nPayments Due by Period\n(in millions)\nTotal\n<1 year\n1-3 years\n3-5 years\n5+ years\nDebt obligation by contractual maturity\n$\n14,436 \n$\n773 \n$\n1,530 \n$\n1,951 \n$\n10,182 \nOperating lease obligations\n628 \n76 \n153 \n140 \n259 \nPurchase obligations\n1,515 \n134 \n252 \n279 \n850 \nTotal\n$\n16,579 \n$\n983 \n$\n1,935 \n$\n2,370 \n$\n11,291 \nIn the table above:\n•\nDebt obligations by contractual maturity include both principal and interest obligations. For our Euro Notes, interest is calculated on an actual basis while all other debt obligations were primarily calculated on a 365-day basis at the contractual fixed rate multiplied by the aggregate principal amount as of September 30, 2025. See Note 8, “Debt Obligations,” to the condensed consolidated financial statements for further discussion.\n45\n•\nOperating lease obligations represent our undiscounted operating lease liabilities as of September 30, 2025, as well as legally binding minimum lease payments for leases signed but not yet commenced. See Note 15, “Leases,” to the condensed consolidated financial statements for further discussion of our leases.\n•\nPurchase obligations primarily represent minimum outstanding obligations due under software license agreements. The balance as of September 30, 2025 is primarily comprised of our multi-year Amazon Web Services partnership contract, which we expanded and extended in the first quarter of 2025. This contract will benefit both our Financial Technology and Market Services segments, including their modernization. The expansion of this contract is not expected to increase our cloud expense compared to our expectation over the short term or the life of the contract, and preserves flexibility beyond our forecast.\nOFF-BALANCE SHEET ARRANGEMENTS\nFor discussion of off-balance sheet arrangements see:\n•    Note 14, “Clearing Operations,” to the condensed consolidated financial statements for further discussion of our non-cash default fund contributions and margin deposits received for clearing operations; and\n•    Note 17, “Commitments, Contingencies and Guarantees,” to the condensed consolidated financial statements for further discussion of:\n◦\nGuarantees issued and credit facilities available;\n◦\nOther guarantees; and\n◦\nRouting brokerage activities."
}