{
  "item1": "then provide information subscribers. After deducting costs, plan administrators distribute tape revenues respective plan participants based formula required Regulation NMS takes into account both trading quoting activity. Canada, operate exchange three independent markets trading Canadian-listed securities: Nasdaq Canada CXC, Nasdaq Canada CX2 Nasdaq Canada CXD. Europe, operate exchanges Tallinn (Estonia), Riga (Latvia) Vilnius (Lithuania) Nasdaq Baltic exchanges Stockholm (Sweden), Copenhagen (Denmark), Helsinki (Finland), Reykjavik (Iceland) together clearing operations Nasdaq Clearing, Nasdaq Nordic.",
  "item7": "Net cash provided (used in): Operating activities Investing activities Financing activities Net Cash Provided Operating Activities Net cash provided operating activities primarily consists net income adjusted certain non-cash items, including, but not limited to, depreciation amortization expense, expense associated share-based compensation, deferred income taxes effects changes working capital. Changes working capital include changes accounts receivable deferred revenue which impacted timing customer billings related collections customers; accounts payable accrued expenses due timing payments; accrued personnel costs, which impacted employee performance targets timing payments related employee bonus incentives; Section 31 fees payable SEC, which impacted changes SEC fee rates timing collections customers payments SEC. Net cash provided operating activities increased $243 million year ended December 31, 2024 compared same period 2023. increase primarily driven increase net income impact certain non-cash items net income, primarily increase amortization expense due acquired intangibles related Adenza acquisitions offset decrease deferred income tax liabilities.",
  "item2": "Revenues less transaction-based expenses Net income attributable Nasdaq Diluted earnings per share Cash dividends declared per common share countries currencies other than U.S. dollar, revenues expenses translated using monthly average exchange rates. Impacts revenues less transaction-based expenses operating income associated fluctuations foreign currency discussed more detail under “Item 3. Quantitative Qualitative Disclosures About Market Risk.” following chart summarizes ARR (in millions): ARR given period current annualized value derived subscription contracts defined contract value."
}