{
  "source_file": "ndsn-20241031.htm",
  "form_type": "10-K",
  "item1": "Item 1.  Business\nGeneral Description of Business\nNordson is an innovative precision technology company that leverages a scalable growth framework to deliver top tier growth with leading margins and returns. We engineer, manufacture and market differentiated products and systems used for precision dispensing, applying and controlling of adhesives, coatings, polymers, sealants, biomaterials, and other fluids, to test and inspect for quality, and to treat and cure surfaces and various medical products such as: catheters, cannulas, medical balloons and medical tubing. These products are supported with extensive application expertise and direct global sales and service. We serve a wide variety of consumer non-durable, consumer durable and technology end markets including packaging, electronics, medical, appliances, energy, transportation, precision agriculture, building and construction, and general product assembly and finishing.\nOur strategy for long-term growth is based on solving customers’ needs globally. We were incorporated in the State of Ohio in 1954 and are headquartered in Westlake, Ohio. Our products are marketed through a network of direct operations in more than 35 countries. Consistent with this global strategy, approximately 67 percent of our revenues were generated outside the United States in 2024.\nAs of October 31, 2024, we had approximately \n8,000\n employees worldwide. Our principal manufacturing facilities are located in the United States, the People’s Republic of China, Germany, Ireland, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nCorporate Purpose and Goals\nWe strive to be a vital, self-renewing, worldwide organization that, within the framework of ethical behavior and enlightened citizenship, grows and produces wealth for our customers, employees, shareholders and communities.\nWe operate for the purpose of creating balanced, long-term benefits for all of our constituencies.\nWe focus on long-term growth and returns. Each quarter, we may not produce increased sales, net income, or earnings per share, or exceed the comparative prior year's quarter. When short-term swings occur, we do not intend to alter our foundational objectives in efforts to mitigate the impact of these temporary occurrences.\nIn 2021, we launched the Ascend strategy, which is designed to deliver top tier revenue growth with leading margins and returns. Ascend is driven by three interconnected pillars: the NBS (\"Nordson Business System\") Next growth framework; Owner Mindset, our division-led organizational structure; and Winning Teams, our talent strategy. These three pillars are built upon the foundation of what makes Nordson special: our culture and our values. \nThe NBS Next growth framework, the heart of the Ascend strategy, uses data-based segmentation to identify our greatest opportunities for profitable growth and ensure we are investing our resources in those areas. Using data in a consistent and disciplined way, leaders across the Company are defining their strategic business priorities. \nWe drive organic growth by continually introducing new products and technology, providing high levels of customer service and support, capturing rapidly expanding opportunities in emerging geographies and leveraging existing technology into new applications. Additional growth comes through the acquisition of companies that have differentiated precision technology-based product portfolios, serve attractive high-growth end-markets applications and have a customer-centric business model. The primary goals of our acquisition strategy are to complement our current capabilities, diversify our business into new industry sectors with new customers and expand the scope of the solutions we can offer to our customers.\nWe strive to provide genuine customer satisfaction – it is the foundation upon which we continue to build our business.\nComplementing our business strategy is the objective to provide opportunities for employee self-fulfillment, growth, security, recognition and equitable compensation. This goal is met through the Human Resources department’s facilitation of employee training, leadership training and the creation of on-the-job growth opportunities. The result is a highly qualified and \nNordson Corporation 4\nTable of Contents\nprofessional global team capable of meeting corporate objectives. For more information, see \"Human Capital Resources\" below.\nWe recognize the value of employee participation in the planning process. Strategic and operating plans are developed by all divisions, resulting in a sense of ownership and commitment on the part of employees in accomplishing our objectives.\nWe are an equal opportunity employer.\nAt Nordson, we have a long and proud history of investing in the communities where we live and work. We are committed to contributing up to five percent of domestic pretax earnings to education, human welfare services and other charitable activities, particularly in communities where we have significant operations. Through the Nordson Corporation Foundation, we give back by providing grants to nonprofits in communities where we have facilities employing approximately 100 people. In recent years, we have extended our reach internationally through our 2:1 employee Matching Gifts, as well as community giving programs in ten international locations. Since 1989, we have donated more than $173 million to communities where we live and work. In addition, our employees volunteered more than 113,000 hours through our Time ‘N Talent and Dollars for Doers programs. \nPrincipal Products and Uses\nWe are a diversified precision technology company that engineers, manufactures and markets differentiated products and systems used to dispense, apply and control adhesives, coatings, polymers, sealants, biomaterials, medical components, and other fluids, to test and inspect for quality, and to treat and cure surfaces. Our precision technology can be found in manufacturing facilities around the world producing a wide range of goods for consumer durable, consumer non-durable, medical and technology end markets. Equipment ranges from single-use components to manual, stand-alone units for low-volume operations to microprocessor-based automated systems for high-speed, high-volume production lines.\nWe market our products globally, primarily through a direct sales force, and also through qualified distributors and sales representatives. We have built a worldwide reputation for creativity and expertise in the design and engineering of high-technology application equipment that meets the specific needs of our customers. We create value for our customers by developing solutions that increase uptime, enable faster line speeds and reduce consumption of materials. We serve a broad customer base, both in terms of industries and geographic regions. In 2024, no single customer accounted for ten percent or more of our sales.\nThe following is a summary of the product lines and markets served by our operating segments:\nIndustrial Precision Solutions\n    \nThis segment delivers proprietary dispensing and material processing technology, as well as measurement, inspection and control solutions to diverse end markets. Product line specific solutions reduce material consumption, increase line efficiency and enhance product quality and appearance. Technologies are used for processing polymers, inspection and measurement of food, tubing and films and dispensing adhesives, coatings, sealants and other materials. This segment primarily serves the consumer durables, non-durables, agriculture and industrial markets.\n•\nIndustrial Coatings\n – Automated and manual dispensing products and systems for cold materials, container coating, liquid finishing and powder coating, as well as ultraviolet equipment used primarily in curing and drying operations. Key strategic markets include beverage containers and food cans, electric battery, appliances, automotive, building and construction, composites, electronics and medical. \n•\nMeasurement and Control Solutions\n – In-line measurement sensors, gauges and analyzers using near-infrared, laser, X-ray, optical and nucleonic technologies, as well as proprietary algorithms and software. These precision applications ensure quality and reliability within the customers’ manufacturing processes. Key strategic markets include consumer non-durable, film extrusion and converting, cable and tubing and energy storage.\n•\nNonwovens\n – Dispensing, coating and laminating systems for applying adhesives, lotions, liquids and fibers to disposable products and continuous roll goods. Key strategic markets include adult incontinence products, baby diapers and child-training pants, hygiene products and surgical drapes, gowns, shoe covers and face masks.\n•\nPackaging\n – Automated adhesive dispensing systems used in the rigid packaged goods industries. Key strategic markets include packaging for food and beverage, pharmaceutical and other consumer goods.\n•\nPolymer Processing\n – Components and systems used in the thermoplastic and biopolymer melt stream in extrusion, injection molding, compounding, polymerization and recycling processes. Key strategic markets include flexible packaging, electronics, medical, building and construction, transportation and aerospace, and general consumer goods.\nNordson Corporation 5\nTable of Contents\n•\nPrecision Agriculture\n – Precision agriculture spraying solutions, including fluid components, such as nozzles, pumps and filters; smart components that measure and control the flow, quantity and location of dispensed fluid; and control systems that provide a greater variety of input and functionality to the customer. This broad product portfolio is supported by differentiated software and data capabilities. \n•\nProduct Assembly\n – Dispensing, coating and laminating systems for the assembly of plastic, metal and wood products, for paper and paperboard converting applications and for the manufacturing of continuous roll goods. Key strategic markets include appliances, automotive components, building and construction materials, electronics, furniture, solar energy, and the manufacturing of bags, sacks, books, envelopes and folding cartons.\nMedical and Fluid Solutions\nThis segment includes components and device solutions for medical, life science, high-tech industrial and other diverse end markets. \n•\nMedical \n–\n \nComponents and devices for minimally invasive interventional surgical procedures, including cannulas, catheters and medical balloons. Products also include proprietary single-use plastic components in medical applications, including biopharmaceutical, patient care/surgical and diagnostic systems.\n•\nFluid Management\n – Precision manual and semi-automated dispensers and highly engineered single-use plastic molded syringes, cartridges, tips and fluid connection components. Products are used within critical medical and industrial production processes and for applying and controlling the flow of adhesives, sealants and lubricants. Key strategic markets include electronics, industrial, medical and animal health.\nAtrion Acquisition\nOn August 21, 2024, Nordson acquired Atrion Corporation, a Delaware corporation (“Atrion”), pursuant to the Agreement and Plan of Merger (the “Merger Agreement”), dated as of May 28, 2024, among Nordson, Alpha Medical Merger Sub, Inc., a Delaware corporation and a wholly owned subsidiary of Nordson (“Merger Sub”) and Atrion. Headquartered in Allen, Texas, Atrion is a manufacturer of proprietary medical products and generated approximately $169 million in annual revenue in 2023. Established in 1944, Atrion supports customers globally through three FDA registered U.S. Food and Drug Administration manufacturing facilities located in the United States. Atrion’s portfolio is included in the Company's Medical and Fluid Solutions segment. It consists of three key businesses that we believe will significantly expand Nordson’s addressable market in infusion and cardiovascular therapies:  \n•\nHalkey Roberts is a leader in infusion fluid delivery solutions, including single-use original equipment manufacturer (\"OEM\") medical components such as swabable needle free and pressure relief valves.  \n•\nAtrion Medical is a leading provider of OEM interventional inflation devices for balloon catheterization, stent deployment and fluid delivery in structural heart, ears, nose and throat and gastrointestinal procedures.   \n•\nQuest Medical’s highly differentiated myocardial protection devices and single-use consumables deliver real-time precise drug administration during cardiovascular surgery.  \nAdvanced Technology Solutions\nThis segment integrates our proprietary product technologies into the progressive stages of a customer’s production processes, such as surface treatment, precisely controlled dispensing of material and pre- and post-dispense test and inspection to ensure quality. This segment predominantly serves customers in the electronics end markets.\n•\nElectronics Systems \n–\n Automated dispensing systems for high-speed, accurate application of a broad range of attachment, protection and coating fluids, and related gas plasma treatment systems for cleaning and conditioning surfaces prior to dispense. Key strategic markets include the breadth of the electronics industry manufacturing supply chain that produces semiconductor, printed circuit board assemblies and electronic components.\n•\nTest and Inspection \n–\n Bond testing and automated optical, acoustic microscopy and x-ray inspection systems used in the semiconductor and printed circuit board industries. Key strategic markets include mobile phones, tablets, personal computers, wearable technology, liquid crystal displays, micro hard drives, microprocessors, printed circuit boards, flexible circuits, micro mechanical systems and semiconductor packaging.\nManufacturing, Raw Materials and Other Resources \nOur production operations include machining, molding and assembly. We manufacture specially designed parts and assemble components into finished equipment. Many components are made in standard modules that can be used in more than one product or in combination with other components for a variety of models. We have principal manufacturing operations and \nNordson Corporation 6\nTable of Contents\nsources of supply in the United States in Ohio, Georgia, California, Colorado, Connecticut, Illinois, Michigan, Minnesota,  Pennsylvania, Rhode Island, Tennessee, Florida, Texas, Alabama and Wisconsin; as well as in the People’s Republic of China, Germany, Ireland, India, Israel, Italy, Mexico, the Netherlands and the United Kingdom.\nPrincipal materials used to make our products are metals and plastics, typically in sheets, bar stock, castings, forgings, tubing and pellets. We also purchase many electrical and electronic components, fabricated metal parts, high-pressure fluid hoses, packings, seals and other items integral to our products. Suppliers are competitively selected based on cost, quality and service. Most significant raw materials that we use are available through multiple sources. We purchase most raw materials and other components on the open market and rely on third parties to provide certain finished goods. While these items are generally available from multiple sources, the cost of products sold may be affected by changes in the market price of raw materials and tariffs on certain raw materials, particularly imports from China, as well as disruptions in availability of raw materials, components and sourced finished goods.\nWe monitor and investigate alternative suppliers and materials based on numerous attributes including quality, service, financial stability and price. We currently source raw materials and components from a number of suppliers, but our ongoing efforts to improve service and manage compliance requirements and the cost effectiveness of our products may result in a reduction in the number of our suppliers.\nSenior operating management supervises an extensive quality control program for our equipment, machinery and systems, and manufacturing processes.\nNatural gas, electricity and other fuels are our primary energy sources. However, standby capacity for alternative sources is available if needed.\nWe continue to see a stabilization of the global supply chain, improved lead times and lower inflation risk. We enhanced our risk mitigation and sourcing efforts as a result of the COVID-19 pandemic and geopolitical tensions. Logistics flows have improved, and global forwarding rates have returned closer to pre-pandemic levels, except for Asia-origin shipments, which continue to be more volatile. We continue to see moderate rate increases on parcel and domestic trucking activity. \nIntellectual Property \nWe rely on a combination of intellectual property rights, including patents, trademarks, copyrights, trade secrets and contractual provisions to protect our intellectual property. Our worldwide intellectual property portfolio is strengthened through innovation and brand recognition, and our comprehensive approach for protection and enforcement. We enter into confidentiality and intellectual property agreements with our employees that require them to disclose any inventions created in the scope of employment, convey all rights to those inventions to us and restrict the distribution of proprietary information. Risk factors associated with our intellectual property are discussed in Item 1A, \"Risk Factors.\"\nWe protect and promote our intellectual property portfolio and take those actions we deem appropriate to enforce our intellectual property rights and to defend our rights to sell our products both domestically and internationally. Although in the aggregate, our global portfolio of more than 2,100 granted and pending patents and more than 1,000 trademarks are valuable assets that are important to our operations, we believe that our competitive advantage is also largely attributable to the technical, marketing and sales competence and capabilities of our employees, rather than on any individual patent or trademark. Therefore, we do not consider the expiration or loss of any single patent, trademark or intellectual property right, to be material to our business as a whole. \nSeasonal Variation in Business\nHistorically, the highest volume of sales occurs in the second half of the fiscal year due in large part to the timing of customers’ capital spending programs. Accordingly, fiscal first quarter sales volume is typically the lowest of the year due to timing of customers’ capital spending programs and customer holiday shutdowns. \nCompetitive Conditions\nWe operate in a competitive global marketplace and compete with many large, well-established and highly competitive manufacturers and service providers. Our business is affected by a range of macroeconomic conditions, including industry capacity changes, global competition and economic conditions in the U.S. and abroad, as well as fluctuations in currency exchange rates. Our equipment is sold in competition with a wide variety of alternative bonding, sealing, finishing, coating, processing, testing, inspecting and fluid control techniques. Potential uses for our equipment include any production processes that require preparation, modification or curing of surfaces; dispensing, application, processing or control of fluids and materials; or testing and inspecting for quality.\nNordson Corporation 7\nTable of Contents\nMany factors influence our competitive position, including pricing, product quality and service. We maintain a leadership position in our business segments by delivering high-quality, innovative products and technologies, as well as global service and technical support. Working with customers to understand their processes and developing the application solutions that help them meet their production requirements also contributes to our leadership position. Our worldwide network of direct sales and technical resources also is a competitive advantage.\nCompliance with Governmental Regulations\nOur global operations are subject to a variety of federal, state, local and international laws, regulations and compliance obligations relating to the manufacturing, designing and servicing of highly complex products and solutions. Examples of such regulations include, but are not limited to, import and export controls, data privacy, environmental, product safety, corruption, bribery, employment and labor. To support our policy of compliance in every jurisdiction we do business, we have robust internal controls, quality management systems, and management systems of compliance that govern our internal actions and mitigate our risk of non-compliance. We also have safeguards established to identify non-compliance concerns through internal and external audits and risk assessments, as well as an ethics helpline reporting system. The following describes certain significant regulations that may impact our business.  For additional information about the risks associated with these laws and regulations, see Part I, Item 1A, \"Risk Factors.\"\nWe transact with customers and suppliers in numerous geographies around the world and are required to comply with U.S. and non-U.S. import, export and sanctions laws (collectively “Trade Laws”). We have developed compliance programs and training to prevent violations of Trade Laws, and we regularly monitor and adjust our programs and training to reflect changes in Trade Laws or changes in our business. Geopolitical events may result in changes to Trade Laws that may impact our ability to transact business involving certain countries, certain items or certain counterparties, or may impose additional costs or complexity relating to tariffs, taxes, duties or adjustments to our compliance programs, training, or personnel requirements.\nWe are also required to comply with increasingly complex and changing laws and regulations enacted to protect business and personal data in the United States and other jurisdictions regarding privacy, data protection and data security, including those related to the collection, storage, use, transmission and protection of personal information and other consumer, customer, vendor or employee data. The risk of data privacy breaches cannot be entirely eliminated, creating risks of fines and penalties.  Additionally,  privacy and data protection laws and regulations, including with respect to the European Union’s General Data Protection Regulation (\"GDPR\"), and the California Consumer Privacy Act of 2018 (\"CCPA\"), and the interpretation and enforcement of these and similar laws and regulations, are continuously evolving and there is significant uncertainty with respect to how compliance with these laws and regulations may develop and the costs and complexity of future compliance.\nWe are also subject to federal, state, local and foreign environmental, safety and health laws and regulations concerning, among other things, emissions to the air, discharges to land and water and the generation, handling, treatment and disposal of hazardous waste and other materials. Under certain of these laws, we can be held strictly liable for hazardous substance contamination of any real property we have ever owned, operated or used as a disposal site or for natural resource damages associated with such contamination. We are also required to maintain various related permits and licenses, many of which require periodic modification and renewal. The operation of manufacturing plants unavoidably entails environmental, safety and health risks, and we could incur material unanticipated costs or liabilities in the future if any of these risks were realized in ways or to an extent that we did not anticipate.\nWe believe that we operate in compliance, in all material respects, with applicable environmental laws and regulations. Compliance with environmental laws and regulations requires continuing management effort and expenditures. We have incurred, and will continue to incur, costs and capital expenditures to comply with these laws and regulations and to obtain and maintain the necessary permits and licenses. We maintain insurance coverage that may cover certain costs or legal claims related to environmental regulations, and we accrue for estimated environmental liabilities with charges to expense and believe our environmental accrual is adequate to provide for our portion of the costs of all such known environmental liabilities. We believe that the cost of complying with environmental laws and regulations will not have a material effect on our earnings, liquidity or competitive position but cannot assure that material compliance-related costs and expenses may not arise in the future. For example, future adoption of new or amended environmental laws, regulations or requirements or newly discovered contamination or other circumstances could require us to incur costs and expenses that may have a material effect, but cannot be presently anticipated.\nWe believe that policies, practices and procedures have been properly designed to prevent unreasonable risk of material regulation or compliance obligations arising from our operations. Compliance with federal, state, local and foreign regulation and laws during 2024 had no material effect on our capital expenditures, earnings or competitive position. Based upon consideration of currently available information, we believe liabilities for any such matters will not have a material adverse effect on our financial position, operating results or liquidity, but we cannot guarantee that material liabilities may not arise from regulation and compliance obligations in the future.\nNordson Corporation 8\nTable of Contents\nHuman Capital Resources \nEmployee Profile\nAs of October 31, 2024, we had approximately 8,000 employees. \nTotal Rewards\nAs part of our compensation philosophy, we believe that we must offer and maintain market competitive total rewards programs for our employees in order to attract and retain superior talent. These programs not only include base wages and incentives in support of our pay for performance culture, but also health, welfare and retirement benefits. We focus many programs on employee wellness and have implemented solutions including mental health support access, telemedicine and healthy weight loss programs. We believe that these solutions have helped us successfully manage healthcare and prescription drug costs for our employee population. \nIn the U.S., we match contributions to a tax-qualified defined contribution retirement savings plan (the “Savings Plan”) for all eligible employees, in an amount equal to 50 cents for every dollar contributed by the employee until the employee contributions reach 6% of her or his base compensation. In addition, non-union new hires and re-hires as of July 1, 2021 are eligible for an additional enhanced 401(k) contribution of 3% eligible earnings. All contributions by employees into the Savings Plan are fully vested immediately. Company contributions, both the match and enhanced contribution, have a three-year graded vesting schedule and vest at 33 1/3% each year until fully vested after three years of employment. We also maintain a non-qualified, unfunded and unsecured deferred compensation plan for the benefit of eligible management. In addition, non-union employees hired prior to July 1, 2021 are eligible to participate in a Company-sponsored tax-qualified pension plan for U.S.-based employees (the “Salaried Pension Plan”). The Salaried Pension Plan is designed to work together with social security benefits to provide employees with up to 30 years of service retirement income replacement that is approximately 55% of eligible compensation, subject to the Internal Revenue Code maximum monthly benefit. Participants fully vest in the Salaried Pension Plan after five years of service. All eligible union employees hired prior to November 1, 2004 participate in a Company-sponsored tax-qualified pension plan for U.S.-based employees (the “Hourly Pension Plan”). The Hourly Pension Plan provides a multiplier for each year of service to supplement employees’ retirement income. We also maintain a supplemental retirement benefit restoration plan (“Excess Defined Benefit Pension Plan”), which is an unfunded, non-qualified plan that is designed to provide retirement benefits to U.S.-based eligible officers hired prior to July 1, 2021, as a replacement for retirement benefits limited by regulations under the Internal Revenue Code. \nIn 2022, we launched a global recognition program that allows managers and peers to recognize the special achievements of others through both written recognition shared on a company awards feed, as well as monetary recognition that allows a recipient to choose a physical gift, gift card or donate the value of their recognition to charity. We also continue our service award program, which demonstrates appreciation and thanks to longstanding employees with five or more years of service. Service milestones are recognized at each five-year increment by presentation of a digital and/or printed certificate with an invitation to select a recognition award via an online catalog.\nTalent\nOur key talent philosophy is to develop talent from within and supplement with external hires. This approach has yielded a deep understanding among our employee base of our business, products and customers, while adding new employees and ideas in support of our continuous improvement mindset. Attracting and retaining the best talent relies on our ability to provide a diverse and inclusive workplace, personal and professional growth opportunities, and a rewarding employee experience. We strive to uphold a culture of shared knowledge, appreciation and success. We believe that our average tenure across the globe reflects our positive workplace culture and the strong engagement of our employees. Our talent acquisition team uses internal and external resources to recruit highly skilled and talented workers, and we encourage employee referrals for open positions.\nTalent development and succession planning for critical roles is a cornerstone of our talent program. Development plans are created and monitored to ensure progress is made along the established timelines. Development plans also intersect with our mission, particularly as we strive to be responsible to our communities. \nOne of our core values—Respect for People—reflects the behavior we strive to include in every aspect of the way we conduct business. Our approach encompasses inclusion awareness and skill-building, intentionality with respect to diversity in our hiring and selection process and performance management and succession planning that recognizes the importance of diversity.  Nordson’s employee resource groups strengthen our commitment to fostering an inclusive, diverse workplace where everyone feels like they belong. Participation in these groups is open to all employees. We regularly reflect on our progress and explore opportunities to improve our inclusion and diversity programs, including at the executive leadership and Board levels. \nNordson Corporation 9\nTable of Contents\nAvailable Information\nOur annual report, quarterly reports and current reports (Form \"8-K\") and amendments to those reports filed or furnished with the Securities and Exchange Commission (\"SEC\") pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge at https://investors.nordson.com as soon as reasonably practical after such material is electronically filed with, or furnished to, the SEC. Copies of these reports may also be obtained free of charge by sending written requests to Corporate Communications, Nordson Corporation, 28601 Clemens Road, Westlake, Ohio 44145. The contents of our website are not incorporated by reference herein and are not deemed to be a part of this annual report.",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nNOTE REGARDING AMOUNTS AND FISCAL YEAR REFERENCES\nIn this annual report, all amounts related to United States dollars and foreign currency and to the number of Nordson Corporation’s common shares, except for per share earnings and dividend amounts, are expressed in thousands. Unless the context otherwise indicates, all references to “we,” “us,” “our,” or the “Company” mean Nordson Corporation.\nUnless otherwise noted, all references to years relate to our fiscal year ending October 31.\nCritical Accounting Policies and Estimates\nOur Consolidated Financial Statements and accompanying notes have been prepared in accordance with accounting principles generally accepted in the United States. The preparation of these financial statements requires management to make estimates, judgments and assumptions that affect reported amounts of assets, liabilities, revenues and expenses. On an ongoing basis, we evaluate the accounting policies and estimates that are used to prepare financial statements. We base our estimates on historical experience and assumptions believed to be reasonable under current facts and circumstances. Actual amounts and results could differ from these estimates used by management.\nCertain accounting policies that require significant management estimates and are deemed critical to our results of operations or financial position are discussed below. On a regular basis, critical accounting policies are reviewed with the Audit Committee of the board of directors.\nRevenue recognition - \nA contract exists when it has approval and commitment from both parties, the rights of the parties are identified, payment terms are identified, the contract has commercial substance and collectability of the consideration is probable. Revenue is recognized when performance obligations under the terms of the contract with a customer are satisfied. Generally, our revenue results from short-term, fixed-price contracts and is recognized as of a point in time when the product is shipped or at a later point when the control of the product transfers to the customer. Refer to Note 1 to the Consolidated Financial Statements for further discussion regarding the Company's revenue recognition policy.\nBusiness combinations - \nThe acquisitions of our businesses are accounted for under the acquisition method of accounting. The amounts assigned to the identifiable assets acquired and liabilities assumed in connection with acquisitions are based on estimated fair values as of the date of the acquisition, with the remainder, if any, recorded as goodwill. The fair values are determined by management, taking into consideration information supplied by the management of the acquired entities, and other relevant information. Such information typically includes valuations obtained from independent appraisal experts, which management reviews and considers in its estimates of fair values. The valuations are generally based upon future cash flow projections for the acquired assets, discounted to present value. Determining the fair value of assets acquired and liabilities assumed requires management’s judgment and often involves the use of significant estimates and assumptions, including assumptions with respect to future revenue growth rates and EBITDA margins, discount rates, customer attrition rates, and asset lives, among other items. This judgment could result in either a higher or lower value assigned to amortizable or depreciable assets. The impact could result in either higher or lower amortization and/or depreciation expense.\nGoodwill -\n Goodwill is the excess of purchase price over the fair value of tangible and identifiable intangible net assets acquired in various business combinations. Goodwill is not amortized but is tested for impairment annually at the reporting unit level, or more often if indications of impairment exist. \nWe test goodwill in accordance with Accounting Standards Codification (\"ASC\") 350. We did not record any goodwill impairment charges in 2024. We use an independent valuation specialist to assist with refining our assumptions and methods used to determine fair values. To test for goodwill impairment, we estimate the fair value of each of our reporting units using a combination of the discounted cash flow method (\"Income Approach\") and the Market Approach. \nThe Income Approach uses assumptions for revenue growth, operating margin and working capital turnover that are based on management’s strategic plans tempered by performance trends and reasonable expectations about those trends. Terminal value calculations employ a published formula known as the Gordon Growth Model Method that essentially captures the present value of perpetual cash flows beyond the last projected period assuming a constant Weighted Average Cost of Capital (\"WACC\") methodology and growth rate. For each reporting unit, a sensitivity analysis is performed to vary the discount and terminal growth rates in order to provide a range of reasonableness for detecting impairment. Discount rates are developed using a WACC methodology. \nThe WACC represents the blended average required rate of return for equity and debt capital based on observed market return data and company specific risk factors. For 2024, the WACC rates used ranged from 8.0 percent to 9.0 percent depending upon the reporting unit's size, end market volatility and projection risk. See Note 5 to the Consolidated Financial Statements for further details regarding the valuation methodologies used.\nNordson Corporation 26\nTable of Contents\nIn 2024, 2023 and 2022, the results of our annual impairment tests indicated no impairment.\nThe fair value (\"FV\") was compared to the carrying value (\"CV\") for each reporting unit. Based on the results shown in the table below and based on our measurement date of August 1, 2024, our conclusion is that no goodwill was impaired in 2024. Potential events or circumstances, such as a sustained downturn in global economies, could have a negative effect on estimated fair values.\nWACC\nExcess of\nFV over CV\nGoodwill\nIndustrial Precision Solutions Segment - Adhesives\n8.0%\n330%\n$\n1,183,342 \nIndustrial Precision Solutions Segment - Industrial Coating Systems\n9.0%\n3,451%\n$\n24,083 \nAdvanced Technology Solutions Segment - Electronics Systems\n8.5%\n252%\n$\n27,442 \nAdvanced Technology Solutions Segment - Test & Inspection\n8.5%\n173%\n$\n375,707 \nMedical and Fluid Solutions Segment - Fluid Management\n8.5%\n170%\n$\n1,175,199 \nPension plan in the United States \n- The measurement of the liabilities related to our domestic pension plan is based on management’s assumptions related to future factors, including interest rates, return on pension plan assets, compensation increases, mortality and turnover assumptions and health care cost trend rates. The liabilities associated with the Company's international pension plans and OPEB are not as materially sensitive to changes in assumptions as the pension plan in the United States. \nThe weighted-average discount rate used to determine the present value of our domestic pension plan obligations was 5.27 percent at October 31, 2024 and 6.08 percent at October 31, 2023. The discount rate used was determined by using quality fixed income investments with a duration period approximately equal to the period over which pension obligations are expected to be settled.\nIn determining the expected return on plan assets, we consider both historical performance and an estimate of future long-term rates of return on assets similar to those in our plans. We consult with and consider the opinions of financial and actuarial experts in developing appropriate return assumptions. The expected rate of return (long-term investment rate) on domestic pension assets used to determine net benefit costs was 6.50 percent and 6.40 percent in 2024 and 2023, respectively.\nThe assumed rate of compensation increases used to determine the present value of our domestic pension plan obligations was 3.96 percent and 3.92 percent at October 31, 2024 and October 31, 2023, respectively. \nAnnual expense amounts are determined based on the discount rate used at the end of the prior year. Differences between actual and assumed investment returns on pension plan assets result in actuarial gains or losses that are amortized into expense over a period of years. \nEconomic assumptions have a significant effect on the amounts reported. The effect of a one percent change in the discount rate, expected return on assets and compensation increase is shown in the table below. Bracketed numbers represent decreases in expense and obligation amounts.\n1% Point\nIncrease\n1% Point\nDecrease\nDiscount rate:\nEffect on total net periodic pension cost in 2024\n$\n(1,234)\n$\n3,137 \nEffect on pension obligation as of October 31, 2024\n$\n(46,287)\n$\n57,461 \nExpected return on assets:\nEffect on total net periodic pension cost in 2024\n$\n(4,094)\n$\n4,094 \nCompensation increase:\nEffect on total net periodic pension cost in 2024\n$\n2,252 \n$\n(2,006)\nEffect on pension obligation as of October 31, 2024\n$\n17,371 \n$\n(15,630)\nIncome taxes \n– Income taxes are estimated based on income for financial reporting purposes. Deferred income taxes reflect the net tax effect of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes and certain changes in valuation allowances. We provide valuation allowances against deferred tax assets if, based on available evidence, it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nNordson Corporation 27\nTable of Contents\nManagement believes the valuation allowances are adequate after considering future taxable income, allowable carryforward periods and ongoing prudent and feasible tax planning strategies. In the event we were to determine that we would be able to realize the deferred tax assets in the future in excess of the net recorded amount (including the valuation allowance), an adjustment to the valuation allowance would increase income in the period such determination was made. Conversely, should we determine that we would not be able to realize all or part of the net deferred tax asset in the future, an adjustment to the valuation allowance would be expensed in the period such determination was made.\nFurther, at each interim reporting period, we estimate an effective income tax rate that is expected to be applicable for the full year. Significant judgment is involved regarding the application of global income tax laws and regulations and when projecting the jurisdictional mix of income. Additionally, interpretation of tax laws, court decisions or other guidance provided by taxing authorities influences our estimate of the effective income tax rates. As a result, our actual effective income tax rates and related income tax liabilities may differ materially from our estimated effective tax rates and related income tax liabilities. Any resulting differences are recorded in the period they become known.\nAtrion Acquisition\nOn August 21, 2024, the Company completed the acquisition of Atrion, pursuant to the terms of the Merger Agreement with Merger Sub and Atrion. Pursuant to the Merger Agreement, Merger Sub merged with and into Atrion (the “Merger”), with Atrion surviving the Merger as a wholly owned subsidiary of Nordson. Atrion is a leader in \nproprietary medical infusion fluid delivery and niche cardiovascular solutions and will operate within our Medical and Fluid Solutions segment. \nThe all-cash acquisition of Atrion of $789,996, net of cash acquired, was funded using borrowings under our revolving credit facility, and the 364-day term loan agreement with a group of banks for a delayed draw term loan facility in the aggregate principal amount of $500,000 (the \"364-Day Term Loan Agreement\") (see Note 8 to the Consolidated Financial Statements for additional details) and cash on hand. Based on the fair value of the assets acquired and the liabilities assumed, a preliminary purchase price allocation resulted in the recognition of $494,279 of goodwill and $129,600 of identifiable intangible assets. The identifiable intangible assets consist primarily of $40,100 of tradenames (amortized over 15 years), $24,900 of technology (amortized over 15 years), and $64,600 of customer relationships (amortized over 19 years). The financial results of the Atrion acquisition are not expected to have a material impact on our Consolidated Financial Statements. \nResults of Operations\nBelow is a detailed comparison of our results of operations for the fiscal years ended October 31, 2024 and October 31, 2023. For a discussion of other changes from the fiscal year ended October 31, 2023 to the fiscal year ended October 31, 2022, refer to Part II, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, of our Annual Report on Form 10-K for the fiscal year ended October 31, 2023.\nAs used throughout this annual report, geographic regions include the Americas (United States, Canada, Mexico and Central and South America), Asia Pacific and Europe.\nConsolidated Financial Results \nConsolidated financial results for the years ended October 31, 2024, 2023 and 2022 were as follows:\nChange\nChange\n(In thousands except for per-share amounts)\n2024\nfrom 2023\n2023\nfrom 2022\n2022\nSales\n$\n2,689,921\n \n2.3 \n%\n$\n2,628,632 \n1.5 \n%\n$\n2,590,278 \nCost of sales\n1,203,792\n \n— \n%\n1,203,227 \n3.4 \n%\n1,163,742 \nGross margin\n1,486,129\n \n4.3 \n%\n1,425,405 \n(0.1)\n%\n1,426,536 \nGross margin %\n55.2%\n1.0 \n%\n54.2%\n(0.9)\n%\n55.1%\nSelling and administrative expenses\n812,128\n \n7.9 \n%\n752,644 \n3.9 \n%\n724,176 \nOperating profit\n674,001\n \n0.2 \n%\n672,761 \n(4.2)\n%\n702,360 \nInterest expense\n(88,924)\n49.4 \n%\n(59,505)\n165.5 \n%\n(22,413)\nInterest and investment income\n4,913\n \n83.3 \n%\n2,680 \n32.3 \n%\n2,026 \nPension settlement charge for U.S. Plans\n—\n \n \n— \n \n(41,221)\nOther - net\n(4,509)\n655.3 \n%\n(597)\n(107.0)\n%\n8,527 \nIncome before income taxes\n585,481\n \n(4.9)\n%\n615,339 \n(5.2)\n%\n649,279 \nIncome tax expense\n118,197\n \n(7.5)\n%\n127,846 \n(6.1)\n%\n136,176 \nNet income\n$\n467,284\n \n(4.1)\n%\n$\n487,493 \n(5.0)\n%\n$\n513,103 \nNordson Corporation 28\nTable of Contents\nNet Sales\nNet sales for the Industrial precision solutions (IPS), Medical and Fluid Solutions (MFS) and Advanced technology solutions (ATS) segments were as follows:\nTwelve Months Ended\nVariance - Increase (Decrease)\nOct 31, 2024\n% of Total\nOct 31, 2023\n% of Total\nOrganic\nAcquisitions\nCurrency\nTotal\nIPS\n$\n1,484,249\n \n55.2%\n$\n1,391,046 \n52.9%\n0.1 \n%\n6.6 \n%\n— \n%\n6.7 \n%\nMFS\n695,452\n \n25.9%\n660,316 \n25.1%\n(0.2)\n%\n5.4 \n%\n0.1 \n%\n5.3 \n%\nATS\n510,220\n \n19.0%\n577,270 \n22.0%\n(11.4)\n%\n— \n%\n(0.2)\n%\n(11.6)\n%\nTotal\n$\n2,689,921\n \n$\n2,628,632 \n(2.5)\n%\n4.8 \n%\n— \n%\n2.3 \n%\nThe IPS organic sales increase of 0.1 percent was driven by increases in packaging, nonwovens, and industrial coatings product lines, principally offset by declines in measurements and controls and polymer processing. The MFS organic sales decrease of 0.2% was driven by a decrease in the medical fluid components product line, partially offset by an increase in the fluid solutions product line. The ATS organic sales decrease of 11.4 percent was driven by lower demand in electronics dispense product lines as well as test and inspection product lines.\nNet Sales by region were as follows:\nTwelve Months Ended\nVariance - Increase (Decrease)\nOct 31, 2024\n% of Total\nOct 31, 2023\n% of Total\nOrganic\nAcquisitions\nCurrency\nTotal\nAmericas\n$\n1,178,626\n \n43.8%\n$\n1,149,760 \n43.7%\n(1.9)\n%\n4.3 \n%\n0.1 \n%\n2.5 \n%\nEurope\n726,100\n \n27.0%\n682,676 \n26.0%\n(5.1)\n%\n10.2 \n%\n1.3 \n%\n6.4 \n%\nAsia Pacific\n785,195\n \n29.2%\n796,196 \n30.3%\n(1.0)\n%\n1.0 \n%\n(1.4)\n%\n(1.4)\n%\nTotal\n$\n2,689,921\n \n$\n2,628,632 \n(2.5)\n%\n4.8 \n%\n— \n%\n2.3 \n%\nSales outside the United States accounted for 66.6 percent of total sales in 2024, as compared to 66.2 percent in 2023. \nOperating Profit\nOperating profit for the IPS, MFS and ATS segments were as follows:\nTwelve Months Ended\nOct 31, 2024\n% of Sales\nOct 31, 2023\n% of Sales\n% of Sales Change\nIncrease (Decrease)\nIPS\n$\n470,559\n \n31.7%\n$\n460,889 \n33.1%\n(1.4)%\n$\n9,670 \n2.1 \n%\nMFS\n187,731\n \n27.0%\n189,367 \n28.7%\n(1.7)%\n(1,636)\n(0.9)\n%\nATS\n94,231\n \n18.5%\n101,662 \n17.6%\n0.9%\n(7,431)\n(7.3)\n%\nCorporate\n(78,520)\n \n(79,157)\n \n637 \n(0.8)\n%\nTotal\n$\n674,001\n \n25.1%\n$\n672,761 \n25.6%\n(0.5)%\n$\n1,240 \n0.2 \n%\nConsolidated operating margin decreased by \n50\n basis points primarily driven by costs related to the first-year effect of acquisitions, which more than offset favorable product mix. \nGross margins improved 1.0 percentage point reflecting the impact of favorable product mix and lower incremental inventory step-up amortization related to acquisitions of $7,703 in 2024 versus $8,862 in 2023, while the increase in selling and administrative expenses was primarily driven by acquisitions. \nIPS operating profit \ndeclined\n \n140 \nbasis points due to an unfavorable acquisition impact and severance costs. MFS operating margin declined \n170 basis points\n due to \n$10,761 in\n fees, severance, and non-cash inventory charges associated with the Atrion acquisition which offset improvements in operating efficiencies. ATS operating margin improved by \n90 basis points\n on lower sales volumes due to cost reduction actions and favorable mix.\nInterest and Other expenses\nInterest expense in 2024 was $88,924, an increase of $29,419, or 49.4 percent, from \n2023\n. The increase reflects higher average debt levels compared to the prior year due to funding of acquisitions. Other expense in 2024 was $4,509 compared to other expense of $597 in \n2023\n. Included in other expense in 2024 were $5,499 in net foreign currency losses, which were partially offset by pension gains. Included in the prior year’s other expense were $7,742 in foreign currency losses, which were largely offset by pension gains. \nNordson Corporation 29\nTable of Contents\nIncome tax expense\nIncome tax expense in 2024 was $118,197, or 20.2 percent of pre-tax income, as compared to $127,846, or 20.8 percent of pre-tax income in \n2023\n. The effective tax rate decreased 60 basis points primarily due to a decline in the impact of foreign tax rate variances. The income tax provision for 2024 included a tax benefit of $4,037 due to our share-based payment transactions. Our income tax provision for 2023 included a tax benefit of $4,286 due to our share-based payment transactions.\nNet Income\nNet income was $467,284, or $8.11 per diluted share, in 2024, compared to net income of $487,493, or $8.46 per diluted share, in 2023. This represented a 4.1 percent decrease in net income and a 4.1 percent decrease in diluted earnings per share. The decrease of $0.35 per diluted share was primarily driven by higher interest expense in 2024 compared to 2023.\nLiquidity and Capital Resources\nCash and cash equivalents increased $273 in 2024 to $115,952 as of October 31, 2024 compared to $115,679 as of October 31, 2023. Approximately 81 percent of our consolidated cash and cash equivalents were held at various foreign subsidiaries as of October 31, 2024.   \nA comparison of cash flow changes from 2024 to 2023 as follows:\nTwelve Months Ended\nOctober 31, 2024\nOctober 31, 2023\nIncrease (Decrease)\nNet Income and non-cash items\n$\n609,342 \n$\n615,496 \n$\n(6,154)\nChanges in operating assets and liabilities\n(53,149)\n25,786 \n(78,935)\nNet cash provided by operating activities    \n556,193 \n641,282 \n(85,089)\nAdditions to property, plant and equipment\n(64,410)\n(34,583)\n(29,827)\nAcquisitions of businesses, net of cash acquired    \n(789,996)\n(1,422,780)\n632,784 \nOther - net\n10,008 \n20,484 \n(10,476)\nNet cash used in investing activities\n(844,398)\n(1,436,879)\n592,481 \nIssuance of long-term debt\n464,353 \n976,043 \n(511,690)\nRepayment of finance lease obligations\n(6,148)\n(6,840)\n692 \nDividends paid\n(161,438)\n(150,356)\n(11,082)\nIssuance of common shares\n31,067 \n21,373 \n9,694 \nPurchase of treasury shares\n(33,339)\n(89,708)\n56,369 \nNet cash provided by financing activities\n$\n294,495 \n$\n750,512 \n$\n(456,017)\nThe changes in operating assets and liabilities were principally driven by decreases in customer advance payments and income taxes payable. Additions to property, plant and equipment were largely driven by productivity and growth projects, including a new manufacturing facility.\nWe have a $1,150,000 unsecured multi-currency credit facility with a group of banks that provides for a term loan facility in the aggregate principal amount of $300,000, maturing in June 2026, and a multicurrency revolving credit facility in the aggregate principal amount of $850,000, maturing in June 2028. In anticipation of the ARAG acquisition, the Company entered into a €760,000 senior unsecured term loan facility with a group of banks in August 2023 (the \"364-Day Term Loan Facility\"). On September 13, 2023, the Company completed an underwritten public offering of $350,000 aggregate principal amount of the Company’s 5.600% Notes due 2028 (the “2028 Notes”) and $500,000 aggregate principal amount of the Company’s 5.800% Notes due 2033 (together with the 2028 Notes, the “Notes\"). The Company used the net proceeds from the sale of the Notes to repay its borrowings under the 364-Day Term Loan Facility. At October 31, 2024, we had $280,000 outstanding on the term loan facility and $240,000 outstanding on the revolving credit facility. \nIn anticipation of the Atrion acquisition, the Company entered into a 364-Day Term Loan Agreement with Morgan Stanley Senior Funding for $500,000 on June 21, 2024, with a maturity date of August 20, 2025. In September 2024, the Company completed an underwritten public offering of $600,000 aggregate principal amount of 4.500% Notes due 2029 (the \"2029 Notes\"). The Company used a portion of the net proceeds from the sale of the 2029 Notes to repay all of the outstanding borrowings under the 364-Day Term Loan Agreement plus accrued and unpaid interest. \nNordson Corporation 30\nTable of Contents\nOur operating performance, balance sheet position and financial ratios for 2024 remained strong. The Company is well-positioned to manage liquidity needs that arise from working capital requirements, capital expenditures and contributions related to pension and postretirement obligations, as well as principal and interest payments on our outstanding debt. Primary sources of capital to meet these needs, as well as other opportunistic investments, are a combination of cash on hand, which was $115,952 as of October 31, 2024, cash provided by operations, which was $556,193 in 2024, and available borrowings under our loan agreements and unused bank lines of credit which totaled $785,880 as of October 31, 2024. Cash from operations, which when combined with our available borrowing capacity and ready access to capital markets, is expected to be more than adequate to fund our liquidity needs over the twelve months and the foreseeable future thereafter. The Company believes it has the ability to generate and obtain adequate amounts of cash to meet its long-term needs for cash. \nContractual and Other Material Cash Obligations\nThe following table summarizes contractual and other material cash obligations as of October 31, 2024:\nPayments Due by Period\nTotal\nLess than\n1 Year\n1-3\nYears\n4-5\nYears\nAfter 5\nYears\nDebt \n(1)\n$\n2,223,928 \n$\n103,928 \n$\n970,000 \n$\n650,000 \n$\n500,000 \nInterest payments on long-term debt\n (1)\n507,213 \n77,925 \n240,462 \n101,826 \n87,000 \nFinance lease obligations \n(2)\n19,015 \n5,713 \n7,273 \n1,854 \n4,175 \nOperating leases \n(2)\n106,686 \n18,784 \n31,815 \n21,441 \n34,646 \nContributions related to pension and postretirement benefits\n (3)\n6,622 \n6,622 \n— \n— \n— \nPurchase obligations \n(4)\n178,684 \n174,321 \n4,357 \n6 \n— \nTotal obligations\n$\n3,042,148 \n$\n387,293 \n$\n1,253,907 \n$\n775,127 \n$\n625,821 \n(1)\nRefer to Note 8 to the Consolidated Financial Statements for further discussion.\n(2)\nRefer to Note 9 to the Consolidated Financial Statements for further discussion.\n(3)\nPension and postretirement plan funding amounts reflect known amounts over the next twelve months. Future amounts will be determined based on the future funded status of the plans and therefore cannot be estimated at this time. Refer to Note 6 to the Consolidated Financial Statements for further discussion.\n(4)\nPurchase obligations primarily represent commitments for materials used in our manufacturing processes that are not recorded on our Consolidated Balance Sheet.\nWe believe that the combination of present capital resources, cash from operations and unused financing sources such as our credit facilities, including our revolving credit facility, are more than adequate to meet cash requirements for the twelve months and the foreseeable future thereafter. There are no significant restrictions limiting the transfer of funds from international subsidiaries to the parent company.\nNew Accounting Standards\nIn November 2023, the FASB issued ASU 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n. ASU 2023-07 requires enhanced disclosures about significant segment expenses and enhanced disclosures in interim periods. The guidance in ASU 2023-07 will be applied retrospectively and is effective for annual reporting periods in fiscal years beginning after December 15, 2023 and interim reporting periods in fiscal years beginning after December 31, 2024, with early adoption permitted. The Company is currently evaluating the impact that the adoption of ASU 2023-07 will have on its consolidated financial statements and disclosures and anticipates adoption in 2025. \nIn December 2023, the FASB issued ASU 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n. ASU 2023-09 is intended to improve income tax disclosure requirements by requiring specific disclosure in the rate reconciliation and additional information for reconciling items that meet a quantitative threshold. The guidance in ASU 2023-09 will be effective for annual reporting periods in fiscal years beginning after December 15, 2024. The Company is currently evaluating the impact that the adoption of ASU 2023-09 will have on its consolidated financial statements and disclosures and anticipates adoption in fiscal 2026.\nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement (Topic 220): Reporting Comprehensive Income.\n ASU 2024-03 does not change or remove current expense presentation requirements within the Consolidated Statements of Income. However, the amendments require disclosure, on an annual and interim basis, disaggregated information about certain income statement expense line items within the notes to the consolidated financial statements. The amendments in this update are \nNordson Corporation 31\nTable of Contents\neffective for annual reporting periods beginning after December 15, 2026, and interim reporting periods beginning after December 15, 2027. The Company is currently evaluating the impact that the adoption of ASU 2024-03 will have on its consolidated financial statements and disclosures and anticipates adoption in fiscal 2028.\nEffects of Foreign Currency\nThe impact of changes in foreign currency exchange rates on sales and operating results cannot be precisely measured due to fluctuating selling prices, sales volume, product mix and cost structures in each country where we operate. As a general rule, a weakening of the United States dollar relative to foreign currencies has a favorable effect on sales and net income, while a strengthening of the dollar has a detrimental effect.\nIn 2024, as compared with 2023, the United States dollar was slightly stronger against foreign currencies. If 2023 exchange rates had been in effect during 2024, sales would have been approximately $3,352 higher and third-party costs would have been approximately $903 higher. In 2023, as compared with 2022, the United States dollar was generally stronger against foreign currencies. If 2022 exchange rates had been in effect during 2023, sales would have been approximately $23,153 higher and third-party costs would have been approximately $15,210 higher. These effects on reported sales do not include the impact of local price adjustments made in response to changes in currency exchange rates.\nTrends\nOur solid historical performance is attributed to our diverse geographic and end market participation and our long-term commitment to develop and provide quality products and worldwide service to meet our customers’ changing needs.\nSafe Harbor Statements Under the Private Securities Litigation Reform Act of 1995\nThis annual report, particularly “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” contains forward-looking statements within the meaning of the Securities Act of 1933, as amended, the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995. Such statements relate to, among other things, income, earnings, cash flows, changes in operations, operating improvements, businesses in which we operate and the United States and global economies. Statements in this annual report that are not historical are hereby identified as “forward-looking statements” and may be indicated by words or phrases such as “anticipates,” “supports,” “plans,” “projects,” “expects,” “believes,” “should,” “would,” “could,” “hope,” “forecast,” “management is of the opinion,” use of the future tense and similar words or phrases. These forward-looking statements reflect management’s current expectations and involve a number of risks and uncertainties. These risks and uncertainties include, but are not limited to, U.S. and international economic and political conditions; financial and market conditions; currency exchange rates and devaluations; possible acquisitions including the Company’s ability to complete and successfully integrate acquisitions, including the integration of Atrion and ARAG; the Company’s ability to successfully divest or dispose of businesses that are deemed not to fit with its strategic plan; the effects of changes in U.S. trade policy and trade agreements; the effects of changes in tax law; and the possible effects of events beyond our control, such as political unrest, including the conflicts in Europe and the Middle East, acts of terror, natural disasters and pandemics.\nIn light of these risks and uncertainties, actual events and results may vary significantly from those included in or contemplated or implied by such forward-looking statements. Readers are cautioned not to place undue reliance on such forward-looking statements. These forward-looking statements speak only as of the date made. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. \nFactors that could cause our actual results to differ materially from the expected results are discussed in Part 1, Item 1A, Risk Factors of this annual report.\nNordson Corporation 32\nTable of Contents",
  "item2": null
}