{
  "item1": "NEER provides commodities-related products customers, engages energy-related commodity marketing trading activities includes operations retail electricity provider ownership interests natural gas oil shale formations located primarily South region U.S. Through NextEra Energy Resources' subsidiary, NextEra Energy Marketing, LLC, NEER: manages risk associated fluctuating commodity prices optimizes value NEER's power generation natural gas oil production assets through use swaps, options, futures forwards; sells output NEER's plants not sold under long-term contracts procures fuel use NEER's generation fleet; provides full energy capacity requirements customers; markets trades energy-related commodity products, including power fuel, well marketing trading services customers. MARKETS COMPETITION Electricity markets U.S. Canada regional diverse character.",
  "item7": "Item 7. Management's Discussion Analysis Financial Condition Results Operations MISO Midcontinent Independent System Operator One million British thermal units mortgage deed trust dated January 1, 1944, FPL Deutsche Bank Trust Company Americas, supplemented amended MW NEE NextEra Energy, Inc. NEECH NextEra Energy Capital Holdings, Inc. NEER operating segment comprised NextEra Energy Resources NEET NEET NextEra Energy Transmission, LLC NERC North American Electric Reliability Corporation net ownership interest pipeline(s) capacity net generating capacity net ownership interest plant(s) capacity net ownership interest plant(s) generation Note __ consolidated financial statements NextEra Energy Resources NextEra Energy Resources, LLC NRC U.S.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations One million British thermal units MW NEE NextEra Energy, Inc. NEECH NextEra Energy Capital Holdings, Inc. NEER operating segment comprised NextEra Energy Resources NEET NEET NextEra Energy Transmission, LLC net ownership interest plant(s) generation NextEra Energy Resources NextEra Energy Resources, LLC Note __ condensed consolidated financial statements NRC U.S."
}