{
  "source_file": "nem-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.       BUSINESS \n(dollars in millions, except per share, per ounce and per pound amounts)\nIntroduction\nNewmont Corporation was incorporated in 1921 and is primarily a gold producer with significant operations and/or assets in the United States, Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, Fiji and Ghana. At December 31, 2024, Newmont had attributable proven and probable gold reserves of 134.1 million ounces, attributable measured and indicated gold resources of 99.4 million ounces, attributable inferred gold resources of 70.6 million ounces, and an aggregate land position of approximately 25,500 square miles (66,000 square kilometers). Newmont is also engaged in the production of copper, silver, lead, and zinc. As the world’s leading gold company, Newmont remains committed to creating value and improving lives through sustainable and responsible mining. \nNewmont’s corporate headquarters are in Denver, Colorado, U.S. In this report, “Newmont,” the “Company,” “our,” and “we” refer to Newmont Corporation together with our affiliates and subsidiaries, unless the context otherwise requires.\nOn November 6, 2023, we completed the acquisition of Newcrest Mining Limited (\"Newcrest\") (“the Newcrest transaction”). Results of Newcrest for the period November 6 to December 31, 2023 and the year ended December 31, 2024 are included in this report. For further information, refer to Note 3 to the Consolidated Financial Statements.\nBased on a comprehensive review of the Company’s portfolio of assets following the Newcrest transaction, the Company’s Board of Directors approved a portfolio optimization program to divest six non-core assets and a development project in February 2024. The non-core assets to be divested include Akyem, CC&V, Éléonore, Porcupine, Musselwhite, Telfer, and a development project in Canada. In February 2024, the Company concluded that these non-core assets and the development project met the accounting requirements to be presented as held for sale in the first quarter of 2024. Subsequently in the second half of 2024, the Company entered into definitive agreements to sell the Telfer, Akyem, Musselwhite, Éléonore, and CC&V reportable segments, of which Telfer closed in 2024. In January 2025, the Company entered into a definitive agreement to sell the Porcupine reportable segment. Refer to Note 3 to the Consolidated Financial Statements for further information on divestitures. \nSegment Information\nThe Company's reportable segments consist of each of its 16 mining operations that it manages and its 38.5% proportionate interest in Nevada Gold Mines (\"NGM\") which it does not directly manage. The reportable segments at December 31, 2024 include certain reportable segments that are designated as held for sale and exclude those which have been divested. Refer to Note 3 to the Consolidated Financial Statements for further information on divestitures.\nFor information on acquisitions and divestitures impacting the comparability of our results, refer to Note 3 to the Consolidated Financial Statements.\nRefer to Item 1A, Risk Factors, below, and Note 4 to the Consolidated Financial Statements for further information relating to our reportable segments. Refer to Note 5 to the Consolidated Financial Statements for information relating to domestic and export sales and lack of dependence on a limited number of customers.\nProducts\nReferences in this report to “attributable” means that portion of gold, copper, silver, lead, or zinc produced, sold or included in proven and probable reserves and measured, indicated, and inferred resources based on our proportionate ownership, unless otherwise noted.\nGold\nGeneral.\n \nThe details of our consolidated and attributable gold production from continuing operations are set forth below:\nYear Ended December 31,\n2024\n2023\n2022\nConsolidated gold ounces produced (thousands)\n6,545 \n5,401 \n5,786 \nAttributable gold ounces produced (thousands)\n6,849 \n5,545 \n5,956 \nAttributable gold ounces produced from equity method investments (thousands):\nPueblo Viejo (40.0%)\n235 \n224 \n285 \nFruta del Norte\n \n(32.0%)\n (1)\n138 \n— \n— \n373 \n224 \n285 \n____________________________\n5\nTable of Contents\n(1)\nThe Fruta del Norte mine is wholly owned and operated by Lundin Gold Inc. (\"Lundin Gold\"). The Company acquired a 32.0% interest in Lundin Gold through the Newcrest transaction, which is accounted for as an equity method investment on a quarterly lag. As a result, results of operations were not reported until the first quarter of 2024. Refer to Notes 3 and 15 to the Consolidated Financial Statements for additional information.\nFor the years ended December 31, 2024, 2023 and 2022, 85%, 89% and 87%, respectively, of our \nSales\n were attributable to gold. Most of our \nSales\n come from the sale of refined gold. The end product at our gold operations, however, is generally doré bars. Doré is an alloy consisting primarily of gold but also containing silver and other metals. Doré is sent to refiners to produce bullion that meets the required market standard of 99.95% gold. Under the terms of our refining agreements, the doré bars are refined for a fee, and our share of the refined gold and the separately-recovered silver is credited to our account or delivered to buyers. Additionally, a portion of gold is sold in concentrate containing other metals such as copper, silver, lead, and/or zinc.\nGold Uses.\n Gold generally is used for fabrication or investment. Fabricated gold has a variety of end uses, including jewelry, electronics, dentistry, industrial and decorative uses, medals, medallions, and official coins. Gold investors buy gold bullion, official coins, and jewelry.\nGold Supply.\n A combination of mine production, recycling and draw-down of existing gold stocks held by governments, financial institutions, industrial organizations and private individuals make up the annual gold supply. Based on public information available, for the years ended December 31, 2022 through 2024, mine production has averaged approximately 75% of the annual gold supply with the remainder primarily sourced from recycled gold.\nGold Price.\n The following table presents the annual high, low, and average daily afternoon LBMA Gold Price over the past ten years on the London Bullion Market ($/ounce):\nYear\nHigh\nLow\nAverage\n2025 (through February 13, 2025)\n$\n2,928 \n$\n2,636 \n$\n2,759 \n2024\n$\n2,778 \n$\n1,985 \n$\n2,386 \n2023\n$\n2,078 \n$\n1,811 \n$\n1,941 \n2022\n$\n2,039 \n$\n1,629 \n$\n1,800 \n2021\n$\n1,943 \n$\n1,684 \n$\n1,799 \n2020\n$\n2,067 \n$\n1,474 \n$\n1,770 \n2019\n$\n1,546 \n$\n1,270 \n$\n1,393 \n2018\n$\n1,355 \n$\n1,178 \n$\n1,268 \n2017\n$\n1,346 \n$\n1,151 \n$\n1,257 \n2016\n$\n1,366 \n$\n1,077 \n$\n1,251 \n2015\n$\n1,296 \n$\n1,049 \n$\n1,160 \nOn February 13, 2025, the afternoon LBMA gold price was $2,928 per ounce.\nRefer to Note 2 to the Consolidated Financial Statements for information on how we recognize revenue for gold sales from doré production.\nOther Co-product Metals\nGenerally, if a metal expected to be mined represents more than 10% to 20% of the life of mine sales value of all the metal expected to be mined, the metal is considered a co-product and recognized as \nSales \nin the Consolidated Financial Statements. \nCopper production at Red Chris, Boddington, Cadia, and Telfer and silver, lead, and zinc production at Peñasquito are considered co-products. Copper, silver, lead, and zinc sales are generally in the form of concentrate that is sold to smelters for further treatment and refining.\nThe following table details consolidated co-product production and the percentage of \nSales \nthat was attributable to copper, silver, lead, and zinc for the years ended December 31, 2024, 2023, and 2022:\n2024\n2023\n2022\nCo-product Production\nSales as % of Total Sales\nCo-product Production\nSales as % of Total Sales\nCo-product Production\nSales as % of Total Sales\nCopper (pounds/millions)\n (1)\n338\n7 \n%\n145\n5 \n%\n84\n3 \n%\nSilver (ounces/millions)\n (2)\n33\n4 \n%\n18\n3 \n%\n30\n5 \n%\nLead (pounds/millions)\n (2)\n212\n1 \n%\n113\n1 \n%\n149\n1 \n%\nZinc (pounds/millions)\n (2)\n569\n3 \n%\n230\n2 \n%\n377\n4 \n%\n____________________________\n(1)\nFor the years December 31, 2024 and 2023,\n \ncopper co-product production came from Red Chris, Boddington, Cadia, and Telfer. All of our copper co-product production came from Boddington for the year ended December 31, 2022.\n6\nTable of Contents\n(2)\nAll of our silver, lead, and zinc co-product production came from Peñasquito.\nBy-product Metals\nIf a metal expected to be mined falls below the co-product sales value percentages, the metal is considered a by-product. Revenues from by-product sales are credited to \nCosts applicable to sales\n in the Consolidated Financial Statements.\nAside from the co-product sales at Red Chris, Peñasquito, Boddington, Cadia, and Telfer, copper and silver produced at other Newmont sites are by-product metals.\nGold and Other Metals Processing Methods\nDoré.\n \nGold is extracted from naturally-oxidized ores by either milling or heap leaching, depending on the amount of gold contained in the ore, the amenability of the ore to treatment and related capital and operating costs. Higher grade oxide ores are generally processed through mills, where the ore is ground into a fine powder and mixed with water into a slurry, which then passes through a carbon-in-leach circuit to recover the gold. Lower grade oxide ores are generally processed using heap leaching. Heap leaching consists of stacking crushed or run-of-mine ore on impermeable, synthetically lined pads where a weak cyanide solution is applied to the surface of the heap to dissolve the gold contained within the ore. In both cases, the gold-bearing solution is then collected and pumped to process facilities to remove the gold by collection on carbon or by zinc precipitation.\nGold contained in ores that are not naturally-oxidized can be directly milled if the gold is liberated and amenable to cyanidation, generally known as free milling ores. Ores that are not amenable to cyanidation, known as refractory ores, require more costly and complex processing techniques than oxide or free milling ore. Higher grade refractory ores are processed through either roasters or autoclaves. Roasters heat finely ground ore to a high temperature, burn off the carbon and oxidize the sulfide minerals that prevent efficient leaching. Autoclaves use heat, oxygen and pressure to oxidize sulfide ores.\nSome gold sulfide ores may be processed through a flotation plant. In flotation, ore is finely ground, turned into slurry, then placed in a tank known as a flotation cell. Chemicals are added to the slurry causing the gold-containing sulfides to attach to air bubbles and float to the top of the tank. The sulfides are removed from the cell and converted into a concentrate that can then be processed in an autoclave, roaster, or fine grinding circuit to recover the gold through leaching. Gold-bearing solution is then plated onto cathodes in an electrowinning process or precipitated using zinc powder. In both cases, the precipitate is melted with fluxes in a furnace to produce doré\n.\nConcentrate.\n Ore containing zinc, silver, lead, and gold is delivered to a crushing and grinding plant which feeds a sulfide processing plant. The sulfide processing plant primarily comprises lead and zinc flotation stages. In the lead and zinc flotation, the slurry is conditioned with reagents to activate the desired minerals and produce lead and zinc concentrate. The lead concentrate is highly enriched in gold and silver, with a smaller fraction of the precious metal recovered in the zinc concentrate. The resulting concentrate is sold to smelters or traders for further processing.\nOre containing copper and gold is crushed to a coarse size at the mine and then transported via conveyor to a process plant, where it is further crushed and then finely ground as a slurry. The ore is initially treated by successive stages of flotation resulting in a gold/copper concentrate containing approximately 10% to 26% copper and is dewatered and transported off-site. The flotation tailings have a residual gold content that is recovered in a carbon-in-leach circuit.\n7\nTable of Contents\nA summary of product and form by segment is set forth below.\nSegment\nProducts\n (1)\nForm\nBrucejack, Canada\nGold\nDoré, Concentrate\nRed Chris, Canada\nGold, Copper\nConcentrate\nPeñasquito, Mexico\nGold, Silver, Lead, Zinc\nDoré, Concentrate\n (2)\nMerian, Suriname\nGold\nDoré\nCerro Negro, Argentina\nGold\nDoré\nYanacocha, Peru\nGold\nDoré\nBoddington, Australia\nGold, Copper\nDoré, Concentrate\nTanami, Australia\nGold\nDoré\nCadia, Australia\nGold, Copper\nDoré, Concentrate\nLihir, Papua New Guinea\nGold\nDoré\nAhafo, Ghana\nGold\nDoré\nNGM, U.S.\nGold\nDoré, Concentrate\nHeld for Sale \n(3)\nCC&V, U.S.\nGold\nDoré\nMusselwhite, Canada\nGold\nDoré\nPorcupine, Canada\nGold\nDoré\nÉléonore, Canada\nGold\nDoré\nAkyem, Ghana\nGold\nDoré\nDivested \n(4)\nTelfer, Australia\nGold, Copper\nDoré, Concentrate\n____________________________\n(1)\nProducts listed are only for gold and co-product metals. See above for further information on co-product classification.\n(2)\nIn the fourth quarter of 2023, the Company abandoned the pyrite leach plant at Peñasquito resulting in no production of doré for the year ended 2024. Refer to Note 9 to the Consolidated Financial Statements for further information.\n(3)\nRefer to Note 3 to the Consolidated Financial Statements for further information on held for sale.\n(4)\nIn the fourth quarter of 2024, the Company completed the sale of the assets of the Telfer reportable segment. Refer to Note 3 to the Consolidated Financial Statements for further information.\nCompetition\nThe top 10 producers of gold comprise approximately twenty-five percent of total worldwide mined gold production. We currently rank as the top gold producer with approximately five percent of estimated total worldwide mined gold production. Our competitive position is based on the size and grade of our ore bodies anchored in a large portfolio of Tier 1 assets located in favorable mining jurisdictions. A Tier 1 asset is defined as having, on average over such asset’s mine life: (1) production of over 500,000 GEOs per year on a consolidated basis, (2) average AISC per oz in the lower half of the industry cost curve, (3) an expected mine life of over 10 years, and (4) operations in countries that are classified in the A and B rating ranges for Moody’s, S&P and Fitch.\nWe have a diverse portfolio of mining operations with varying ore grades and cost structures. Our costs are driven by the location, grade and nature of our ore bodies, and the level of input costs, including energy, labor and equipment. The metals markets are cyclical, and our ability to maintain our competitive position over the long term is based on our ability to acquire and develop quality deposits, hire and retain a skilled workforce, and to manage our costs.\nLicenses and Concessions\nOther than operating licenses for our mining and processing facilities, there are no third-party patents, operating licenses or franchises material to our business. In many countries, however, we conduct our mining and exploration activities pursuant to land-related licenses which include leases, concessions, claims, or prospecting licenses granted by the host government. These countries include, among others, the United States, Canada, Mexico, Peru, Suriname, Chile, Argentina, Australia, Papua New Guinea, Ecuador, Fiji, and Ghana. Refer to Item 2, Properties, below for further information on land-related licenses and concessions by property. The concessions and contracts are subject to the political risks associated with the host country. Refer to Item 1A, Risk Factors, below for further information.\nCondition of Physical Assets and Insurance\nOur business is capital intensive and requires ongoing capital investment for the replacement, modernization or expansion of equipment and facilities. Refer to Results of Consolidated Operations and Liquidity and Capital Resources within Part II, Item 7, MD&A, for further information.\n8\nTable of Contents\nWe maintain insurance policies against property loss and business interruption and insure against risks that are typical in the operation of our business, in amounts that we believe to be reasonable. Such insurance, however, contains exclusions and limitations on coverage, particularly with respect to environmental liability and political risk. There can be no assurance that claims would be paid under such insurance policies in connection with a particular event. Refer to Item 1A, Risk Factors, below for further information.\nEnvironmental, Social and Governance\nOverview.\n Focusing on environmental, social and governance (\"ESG\") practices are an important part of Newmont’s business. Widely recognized for our principled ESG practices, we have been consistently ranked as a leader in the mining and metal sector S&P Global, and we have been listed on the Dow Jones Sustainability World Index since 2007.\nESG is a key part of how we make investment decisions and central to our culture and purpose to create value and improve lives through sustainable and responsible mining. Sustainability and safety are integrated into the business at all levels of the organization through our global policies, standards, strategies, business plans, and remuneration plans. Our global strategies, notably those related to Sustainability and Health, Safety, and Security, direct all levels of our business in environmental stewardship, strong workforce safety and health practices, social responsibility and good governance. With clear targets, open communication and transparent reporting, we strive for continuous improvement to meet the evolving expectations of investors, governments, communities and other key stakeholders, and to contribute to a sustainable future for all.\nStakeholder Engagement.\n We engage regularly with relevant stakeholders, who we consider to be any person or organization potentially impacted by our activities or influential to our success, which allows us to gain a greater understanding of their needs, interests and perspectives while, at the same time, encouraging shared decision making to promote mutually beneficial outcomes. These engagements also inform what information is most useful for stakeholders for the purposes of our non-financial reporting. Newmont also engages with and commits to meeting the expectations of a variety of organizations at a global, regional, national and local level - and where applicable - adhering to these organizations' high standards of governance, social and environmental policies and performance. These memberships and other external commitments reflect our values, support our approach to working collaboratively on best practices across several key matters and allow external stakeholders to hold us accountable. Our participation in industry initiatives, wherein we often take a leadership role, allows us to inform and influence global standards and practices, as well as gain insight into emerging expectations and issues.\nReporting.\n We believe that transparency and accountability are key attributes of governance. Since 2003, Newmont has been reporting on how we manage the sustainability issues of relevance to stakeholders around the globe. Our sustainability report provides an annual review of non-financial performance on governance, strategy and management approach, risk management, and performance and targets in key areas that include health, safety and security, workforce, the environment, supply chain, social responsibility, business integrity and compliance, value sharing, and equity, inclusion and diversity domains. Our sustainability report is compiled in accordance with the Global Reporting Initiative (\"GRI\") 2021 Universal Standards Core option, the GRI Mining and Metals Sector Supplement, and the Sustainability Accounting Standards Board (\"SASB\") Metals & Mining standards. Data is subject to an external limited assurance review and reflects Newmont’s commitment to transparency and reporting obligations as a founding member of the International Council on Mining and Metals (\"ICMM\") and as an early adopter of the United Nations (\"UN\") Guiding Principles Reporting Framework. Additionally, our sustainability report aligns with the requirements the ICMM's Mining Principles' Performance Expectations and Position Statements, the GISTM and the World Gold Council's Responsible Gold Mining Principles.\nNewmont’s sustainability reporting suite also includes our sustainability-linked bond framework, ESG data tables, conflict-free gold report, modern slavery statement, policy influence disclosures, political spending disclosures, taxes and royalties contributions report, CDP (formerly, “Carbon Disclosure Project”) responses, and other reports and responses, which can be found on our website at www.newmont.com/sustainability. \nThe information on our website, including, without limitation, in the annual sustainability report and climate report, should not be deemed incorporated by reference into this annual report or otherwise “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that section.\nEnvironmental Practices\nClimate Change\n.\n We accept the Intergovernmental Panel on Climate Change’s (\"IPCC\") assessment of climate science, and we acknowledge that human activities contribute to climate change and business has an important role in addressing this global challenge. It is our firm belief that climate change is one of the greatest global challenges of our time. For a discussion of climate-related risks, refer to Item 1A, Risk Factors. \nClimate Targets and Initiatives to Achieve.\n We believe that value-creation industries like mining have a responsibility to drive actions to transition us to a low-carbon economy. In an effort to play our part in addressing climate change, in 2020 we announced science-based, GHG emissions reduction targets of 32% for Scope 1 and Scope 2 and 30% for Scope 3 by 2030 (\"2030 climate targets\"), with an ultimate goal of being carbon neutral by 2050. Newmont's emission calculation methodology framework dictates that any change of 5% resulting from divestitures or acquisitions requires recalculation of baseline data. The acquisition of Newcrest in November 2023 triggered Newmont to recalculate the target baseline years and trailing years of GHG emissions data. We are continuing to review our targets and roadmap which may result in amendments in the future. Investors are reminded that climate-\n9\nTable of Contents\nrelated targets are subject to aspirational management goals and forward-looking statements, which remain subject to risks and uncertainties. Refer to Forward-Looking Statements, below, and Item 1A, Risk Factors of this report under the heading \"\nOur operations and projects are subject to a range of risks related to transitioning the business to meet regulatory, societal and investor expectations for operating in a low-carbon economy.\n\"\nOur most significant opportunities to reduce emissions exist in building or deploying cleaner energy solutions at our mine sites, as well as the greening of the electrical grid that supplies energy to our operations. Since announcing our 2030 climate targets, we have taken steps to invest in climate change initiatives in support of our goal. We also see sustainable finance as a way to further demonstrate Newmont's focus on climate change. In December 2021, Newmont became the first in the mining industry to issue a sustainability-linked bond, with the registered public offering of $1 billion aggregate principal amount of 2.6% Sustainability-Linked Senior Notes due 2032 (the \"Notes\"), with the coupon linked to Newmont’s performance against key ESG goals regarding 2030 climate targets. In connection with the issuance of the Notes, Newmont published a Sustainability-Linked Bond Framework and obtained a second party opinion on the framework from Institutional Shareholder Services group of companies (\"ISS\") ESG. The Notes align Newmont’s business and financing by creating a direct link between its sustainability performance and funding strategies.\nIn addition to our focus on reducing carbon emissions, we believe that access to clean, safe water is a human right, and reliable water supplies are vital for hygiene, sanitation, livelihoods and the health of the environment. Because water is also critical to our business, we recognize the need to use water efficiently, protect water resources, and collaborate with the stakeholders within the watersheds where we operate to effectively manage this shared resource. We operate in water-stressed areas with limited supply and increasing population and water demand. Increasing pressure on water use may occur due to increased populations in and around communities in proximity to our operations.\nBiodiversity.\n Our operations span five continents in a range of ecosystems that include tropical, desert and arctic climates. We understand the impact our activities can have on the environment and are committed to protect and prevent – or otherwise minimize, mitigate and remediate – those impacts in the areas where we operate through responsible management during all aspects of the mine lifecycle and collaboration with stakeholders to develop integrated approaches to land use. \nOur Environmental Impact.\n \nWe conduct our operations so as to protect public health and the environment and believe our operations are in compliance with applicable laws and regulations in all material respects. Our mining and exploration activities are subject to various laws and regulations in multiple jurisdictions governing the protection of the environment. These laws and regulations are continually changing.\nOur Environmental Reclamation and Remediation Commitments.\n Each operating mine has a reclamation plan in place that meets, in all material respects, applicable legal and regulatory requirements. We are also involved in several matters concerning environmental obligations associated with former, primarily historical, mining activities. Generally, these matters concern developing and implementing remediation plans at the various sites. The reclamation and remediation stage is a multifaceted process with complex risks. Successfully closing and reclaiming mines is crucial for gaining stakeholder trust and maintaining social acceptance. Notably, Newmont is committed to the implementation of the GISTM and disclosure of implementation status for tailings facilities by August 2025. Conformance with the GISTM remains ongoing and has and may continue to result in further increases to our sustaining costs and estimated closure costs. Additionally, laws, regulations and permit requirements focused on water management and discharge requirements for operations and water treatment in connection with closure are becoming increasingly stringent. Compliance with water management and discharge quality remains dynamic and has and may continue to result in further increases to our estimated closure costs. For a discussion of the most significant reclamation and remediation activities, refer to Note 6 and Note 25 to the Consolidated Financial Statements. For discussion of regulatory, tailings storage facilities, water, climate and other environmental risks, refer to Item 1A, Risk Factors, for additional information. \nSocial Practices\nOur People.\n At Newmont, one of the strategic pillars is people. \nThe success of our business comes from the accomplishments and well-being of our employees and contractors. That is why we strive to build a workplace culture that fosters leaders where everyone belongs, thrives, and is valued.\nAt December 31, 2024, approximately 22,200 people were employed by Newmont and Newmont subsidiaries and approximately 20,400 people were working as contractors in support of Newmont’s operations and attainment of our objectives. Additionally, at December 31, 2024, approximately 30% of our workforce were members of a union or participated in collective bargaining. We are committed to fostering solid relationships with all members of our workforce based on trust, treating workers fairly and providing them with safe and healthy working conditions. For a discussion of related risks, refer to Item 1A, Risk Factors.\nOur people strategy represents a multi-year journey, and its three pillars and respective aspirations include: (i) leadership – grow and attract exceptional leaders for our Company, the industry and beyond; (ii) inclusion, diversity and equity - through bold actions cultivate an inclusive, diverse and engaged workforce; and (iii) people experiences - foster a meaningful work experience that enables our culture and strategy to flourish. The Board of Directors’ Leadership Development and Compensation Committee holds reviews with management every quarter and on an ad hoc basis as needed to ensure appropriate management of human capital and progress against our stated goals.\n10\nTable of Contents\nThe people who work on our behalf give us a competitive advantage. Through our global people strategy, we align our talent management efforts with the overall business strategy. The strategy’s focus areas include enhancing the employee experience and evolving for future workforce needs; building our bench strength and leadership capabilities; developing effective labor relations that align stakeholders with a shared future; and improving inclusion.\nInclusion, Diversity, and Equity.\n Inclusion is one of our five core values. We support this through a focus on our culture and four key areas of inclusion: (i) start with respect; (ii) listen to and engage employees; (iii) leverage dissonance, consistency, and persistence toward a future state culture; and (iv) focus on the career progress of underrepresented team members. Newmont is an equal employment opportunity employer and Newmont's policy is to not make employment-related decisions based on gender or any other protected basis.\nIn our annual sustainability report, Newmont voluntarily reports workforce and labor information in accordance with GRI Standards, including data on workforce demographics, compensation and equal remuneration, gender diversity, union representation, labor relations, employee turnover, hiring representation, and training and development. Newmont also reports employment data in U.S. Equal Employment Opportunity Commission EEO-1 reports which can be found on our website. The information in our sustainability report and on our website is not incorporated by reference in this annual report.\nESG Performance-based Compensation.\n The importance of ESG performance is emphasized with our workforce through our training and development programs and our compensation design. Employees eligible for our short-term incentive plan are held accountable for the Company’s health, safety, and sustainability performance through Newmont’s performance-based compensation structure. ESG will comprise 30% of the Company’s Short-term Incentive Plan payout for 2024, with 20% allocated to health & safety metrics and 10% to sustainability performance based community and environment metrics.\nAdditional information regarding the Company’s compensation programs and performance will be provided in the 2025 Proxy Statement. \nHealth and Safety.\n Safeguarding the health and safety of our employees and contractors is fundamental to how we operate. Mining activities pose risks and hazards that must be effectively managed and controlled to minimize their impact. Safety is one of Newmont's core values, and our global Health, Safety, and Security strategy aims to advance our journey toward a workplace free from fatalities, injuries and illnesses. We believe that our operations are in compliance with applicable laws and regulations in all material respects. We continue to sustain robust controls at our operations and offices around the globe. We measure the effectiveness of our approach to managing the wide range of health and safety risks by setting measurable objectives and targets. The quality and effectiveness of our health and safety controls are audited regularly as part of our assurance and governance process. \nCommitments to Communities.\n \nGaining and maintaining the trust of stakeholders impacted by a business is an ongoing endeavor. At Newmont, we use a methodical approach to managing stakeholder relationships and earning social acceptance. Through understanding and managing our activities' impacts on communities and involving local stakeholders in decision making, we aim to build ensuring relationships based on respect and mutually beneficial and sustainable development outcomes. We monitor various metrics and performance objectives to assess the effectiveness of our social acceptance approach, and to better understand both the positive and negative impacts that our activities have on host communities. We seek to include impacted communities and groups in determining mitigation or optimization of these impacts in a manner that is culturally appropriate and with the consent of those impacted. We also recognize our responsibility to respect and promote human rights.\nGovernance Practices \nBoard of Directors Oversight.\n Newmont believes that strong corporate governance, with management accountability and active oversight from an experienced Board of Directors, is essential for mitigating risk, serving in the best interests of all stakeholders and creating long-term value. The highest level of oversight at Newmont resides with Newmont’s Board of Directors (the “Board”). The Board plays a critical role, overseeing the Company’s business strategy and the overall goal of delivering long-term value creation for stockholders and other stakeholders. The members of Newmont’s Board bring a broad range of backgrounds, experiences and talents, along with ethnic, racial and gender diversity, to our governance process. As of December 31, 2024, the Board was comprised of 13 directors (12 independent non-executive directors and one executive director) with more than 58% of the independent directors with a form of ethnic, racial or gender diversity to the Board, with 42% female representation among independent directors. \nFour core Board committees, Audit, Corporate Governance and Nominating, Leadership Development and Compensation, and Safety and Sustainability, provide oversight and guidance in these key areas. Each committee assists the Board in carrying out responsibilities such as assessing major risks, ensuring high standards of ethical business conduct, succession planning and talent management, and approving and providing oversight of the sustainability strategy, which includes commitments to adoption of best practices in promotion of a healthy and safe work environment, and environmentally sound and socially responsible mining and resource development. All members of these four core Committees are independent, as defined in the listing standards of the New York Stock Exchange and Newmont’s Corporate Governance Guidelines. More information on Newmont’s Board, governance practices and risk oversight can be found in our annual Proxy Statement. \n Code of Conduct.\n Our global Code of Conduct (the “Code”), which was adopted and approved by Newmont’s Board, forms the foundation for our integrity expectations, and six overarching policies, along with our standards on Anti-Corruption, Conflicts of \n11\nTable of Contents\nInterest, Gifts and Entertainment and U.S. Export Compliance, state the minimum requirements for conducting business honestly, ethically and in the best interests of Newmont. Our Code reflects our belief that as important as what we do is how we do it. It requires all representatives of Newmont to demonstrate our values – safety, integrity, sustainability, inclusion and responsibility – in every aspect of our professional lives and ultimately, to live up to our purpose, which is to create value and improve lives through sustainable and responsible mining. \nGovernance Materials.\n Our Corporate Governance Guidelines, Proxy Statement, policies, and the charters for the Committees of Board of Directors are available on our website, www.newmont.com, and are available free of charge upon request to Investor Relations at our principal executive office. We also file with the New York Stock Exchange an annual certification that our Chief Executive Officer is unaware of any violation of the NYSE’s corporate governance standards. We make available free of charge through our website this annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. The information on our website is not incorporated by reference in this report.\nRisk Factor Summary\nWe are subject to a variety of risks and uncertainties, including risks related to our operations and business, financial risks, risks related to our industry, environmental and climate risks, risks related to the jurisdictions in which we operate, risks related to our workforce, legal risks and risks related to our common stock, which could have a material adverse effect on our business, financial condition, results of operations and cash flows. Risks that we deem material are described in Item 1A, Risk Factors of this report. These risks include, but are not limited to, the following:\n•\nA substantial or extended decline in gold, copper, silver, lead or zinc prices would have a material adverse effect on us.\n•\nWe may be unable to replace gold, copper, silver, lead or zinc reserves as they become depleted.\n•\nEstimates of proven and probable reserves and measured, indicated and inferred resources are uncertain and actual recoveries may vary from our estimates.\n•\nEstimates relating to projects and mine plans of existing operations are uncertain and we may incur higher costs and lower economic returns than estimated.\n•\nIncreased operating and capital costs could affect our profitability.\n•\nMine closure, reclamation and remediation costs for environmental liabilities may exceed the provisions we have made.\n•\nDamage to our reputation may result in decreased investor confidence, challenges in maintaining positive community relations and can pose additional obstacles to our ability to develop our projects, which may result in a material adverse impact on our business, financial position, results of operations and growth prospects.\n•\nWe are dependent upon information technology and operational technology systems, which are subject to disruption, damage, failure or cybersecurity attacks and risks associated with implementation, upgrade, operation and integration.\n•\nTo the extent we hold or acquire interests in any joint ventures or enter into any joint ventures, our interests in these properties is subject to risks normally associated with the conduct of joint ventures.\n•\nOur operations and business have in the past been affected by the COVID-19 pandemic, and may be materially and adversely impacted in the future by pandemics, epidemics and other health emergencies.\n•\nIncreased exposure to foreign exchange fluctuations and capital controls may adversely affect Newmont’s costs, earnings and the value of some of our assets.\n•\nFuture funding requirements may affect our business, our ability to pursue new business opportunities, invest in existing and new projects, pay cash dividends or engage in share repurchase transactions. \n•\nOur long-lived assets and goodwill could become impaired, which could have a material non-cash adverse effect on our results of operations.\n•\nOur ability to recognize the benefits of deferred tax assets is dependent on future cash flows and taxable income.\n•\nAny downgrade in the credit ratings assigned to our debt securities could increase our future borrowing costs and adversely affect the availability of new financing.\n•\nReturns for investments in pension plans are uncertain.\n•\nWe may experience increased costs or losses resulting from the hazards and uncertainties associated with mining.\n•\nMining operations involve a high degree of risk, including hazards related to the use of explosives and hazardous chemicals and critical equipment failure. \n12\nTable of Contents\n•\nWe rely on our supply chain operations to procure goods and services to support our operations and projects, and competition with other natural resource companies, and shortage of critical parts, services and equipment may adversely affect our operations and development projects.\n•\nWe may be unable to obtain or retain necessary permits and land or mining tenure which could adversely affect our operations and projects.\n•\nMining companies are increasingly required to consider and provide benefits to the communities and countries in which they operate in order to maintain operations. \n•\nIllegal mining and artisanal mining occurs on or adjacent to certain of our properties exposing such sites to security risks.\n•\nCivil disturbances and criminal activities can disrupt business and expose the Company to liability.\n•\nOur operations and projects face substantial regulation of health and safety.\n•\nOur operations and projects are subject to extensive environmental laws and regulations.\n•\nOur operations and projects are subject to a range of risks related to transitioning the business to meet regulatory, societal and investor expectations for operating in a low-carbon economy.\n•\nOur operations and projects are subject to a range of transitional and physical risks related to climate change. \n•\nOur Company and the mining industry are facing continued geotechnical, geothermal and hydrogeological challenges, which could adversely impact our production and profitability.\n•\nOur operations and projects may be adversely affected by rising energy prices or energy shortages.\n•\nOur operations and projects are dependent on the availability of sufficient water supplies and subject to water-related risks.\n•\nOur operations and projects are subject to risks related to our relationships and/or agreements with local communities, including Indigenous Peoples, and laws for the protection of cultural heritage.\n•\nOur operations and projects are subject to risks of doing business in multiple jurisdictions.\n•\nNew or changing legislation and tax risks in certain operating jurisdictions could negatively affect us.\n•\nChanges in mining or investment policies or shifts in political and social attitudes in the jurisdictions in which we operate may adversely affect our operations or profitability.\n•\nOur operations at Yanacocha and projects in Peru are subject to political and social unrest risks.\n•\nOur Merian operation in Suriname is subject to political, security and economic risks.\n•\nOur operations at Ahafo and Akyem in Ghana are subject to political, economic, security and other risks.\n•\nOur operations in Argentina are susceptible to risk as a result of economic and political instability in Argentina, regulatory risk and labor unrest.\n•\nOur operations at Lihir and project at Wafi-Golpu in Papua New Guinea are subject to political and regulatory risks and other uncertainties.\n•\nOur operations and projects in Canada are subject to legal and regulatory risks and other uncertainties in connection with claims and challenges by Indigenous groups.\n•\nOur business depends on good relations with our employees.\n•\nOur Peñasquito operation in Mexico is subject to social, political, regulatory, and economic risks.\n•\nWe may not be able to operate successfully if we are unable to recruit, hire, retain and develop key personnel and a qualified and diverse workforce. In addition, we are dependent upon our employees being able to perform their jobs in a safe and respectful work environment.\n•\nWe rely on contractors to conduct a significant portion of our operations and construction projects.\n•\nOur business is subject to the U.S. Foreign Corrupt Practices Act, and other related anti-bribery laws and regulations. A breach or violation of these rules and regulations could lead to substantial sanctions and civil and criminal prosecution, as well as fines and penalties, litigation, loss of licenses or permits and other collateral consequences and reputational harm.\n•\nOur business is subject to U.S. export control laws, economic sanctions, and other international trade compliance regulations with extraterritorial reach. A breach or violation of these laws could lead to substantial sanctions, civil and criminal prosecution, fines, penalties, litigation, loss of licenses or permits, and other collateral consequences, including reputational harm.\n•\nTitle to some of our properties may be insufficient, defective, or challenged. \n13\nTable of Contents\n•\nThe price of our common stock may be volatile, which may make it difficult for you to sell the common stock at the price you paid or at prices you find attractive.\n•\nHolders of our common stock, CDIs and PDIs may not receive dividends.\n•\nCompliance with exchange listing rules as a foreign exempt listing may differ from investor expectations.\n•\nAssets held for sale may not ultimately be divested and we may not receive all or any deferred compensation.\n•\nThe Company’s asset divestitures place demands on the Company’s management and resources, the sale of divested assets may not occur as planned or at all, and the Company may not realize the anticipated benefits of such divestitures.\nAdditional risks and uncertainties not presently known to us or that we currently deem immaterial also may impair our business, financial condition, results of operations and cash flows.\nForward-Looking Statements\nCertain statements contained in this report (including information incorporated by reference herein) are “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and are intended to be covered by the safe harbor provided for under these sections. Words such as “expect(s),” “feel(s),” “believe(s),” “will,” “may,” “anticipate(s),” “estimate(s),” “should,” “intend(s),” \"target(s),\" \"plan(s),\" \"potential,\" and similar expressions are intended to identify forward-looking statements. Our forward-looking statements may include, without limitation:\n•\nestimates regarding future earnings and the sensitivity of earnings to gold, copper, silver, lead, zinc and other metal prices;\n•\nestimates of future mineral production and sales;\n•\nestimates of future production costs, other expenses and taxes for specific operations and on a consolidated basis, including estimates of future costs applicable to sales and all-in sustaining costs;\n•\nestimates of future cash flows and the sensitivity of cash flows to gold, copper, silver, lead, zinc and other metal prices;\n•\nestimates of future capital expenditures, including development and sustaining capital, as well as construction or closure activities and other cash needs, for specific operations and on a consolidated basis, and expectations as to the funding or timing thereof;\n•\nestimates as to the projected development of certain ore deposits or projects, such as the Tanami Expansion 2, Ahafo North, Yanacocha Sulfides, Pamour, Cerro Negro District Expansion 1, Cadia Panel Caves, Red Chris Block Cave and Wafi-Golpu, including without limitation expectations for the production, milling, costs applicable to sales, all-in sustaining costs, mine-life extension, the costs of such development and other capital costs, financing plans for these deposits and expected production commencement dates, construction completion dates and other timelines;\n•\nestimates of reserves and resources statements regarding future exploration results and reserve and resource replacement and the sensitivity of reserves to metal price changes;\n•\nstatements regarding the availability of, and terms and costs related to, future borrowing or financing and expectations regarding future share repurchase transactions, debt repayments or debt tender transactions; \n•\nstatements regarding future cash flows and returns to stockholders, including with respect to future dividends, the dividend framework and expected payout levels;\n•\nestimates regarding future exploration expenditures and discoveries;\n•\nstatements regarding fluctuations in financial and currency markets;\n•\nestimates regarding potential cost savings, productivity, operating performance and ownership and cost structures;\n•\nexpectations regarding statements regarding future or recently completed transactions, including, without limitation, statements related to projected benefits, synergies and costs associated with acquisitions and related matters; \n•\nexpectations regarding potential divestments, including, without limitation, assets held for sale;\n•\nestimates of future cost reductions, synergies, including pre-tax synergies, savings and efficiencies, and future cash flow enhancements through portfolio optimization;\n•\nexpectations of future equity and enterprise value;\n•\nexpectations regarding the start-up time, design, mine life, production and costs applicable to sales and exploration potential of our projects;\n•\nstatements regarding future hedge and derivative positions or modifications thereto;\n•\nstatements regarding local, community, political, economic or governmental conditions and environments;\n14\nTable of Contents\n•\nstatements and expectations regarding the impacts of COVID-19 and variants thereof and other health and safety conditions; \n•\nstatements regarding the impacts of changes in the legal and regulatory environment in which we operate, including, without limitation, relating to regional, national, domestic and foreign laws;\n•\nstatements regarding climate strategy and expectations regarding greenhouse gas emission targets and related operating costs and capital expenditures;\n•\nstatements regarding expected changes in the tax regimes in which we operate, including, without limitation, estimates of future tax rates and estimates of the impacts to income tax expense, valuation of deferred tax assets and liabilities, and other financial impacts;\n•\nestimates of income taxes and expectations relating to tax contingencies or tax audits;\n•\nestimates of future costs, accruals for reclamation costs and other liabilities for certain environmental matters, including without limitation, in connection with water treatment, such as the Yanacocha water treatment plants, and tailings management;\n•\nstatements relating to potential impairments, revisions or write-offs, including without limitation, the result of fluctuation in metal prices, unexpected production or capital costs, or unrealized reserve potential;\n•\nestimates of pension and other post-retirement costs;\n•\nstatements regarding estimates of timing of adoption of recent accounting pronouncements and expectations regarding future impacts to the financial statements resulting from accounting pronouncements; and\n•\nestimates of future cost reductions, synergies, savings and efficiencies in connection with full potential programs and initiatives.\nWhere we express an expectation or belief as to future events or results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. However, our forward-looking statements are subject to risks, uncertainties and other factors, which could cause actual results to differ materially from future results expressed, projected or implied by those forward-looking statements. Such risks include, but are not limited to:\n•\nthere being no significant change to current geotechnical, metallurgical, hydrogeological and other physical conditions;\n•\nthe price of gold, copper, silver, lead, zinc and other metal prices and commodities;\n•\nthe cost of operations and prices for key supplies;\n•\ncurrency fluctuations, including exchange rate assumptions;\n•\nother macroeconomic events impacting inflation, interest rates, supply chain, and capital markets; \n•\noperating performance of equipment, processes and facilities;\n•\nenvironmental impacts and geotechnical challenges including in connection with climate-related and other catastrophic events;\n•\nlabor relations;\n•\nhealthy and safety impacts including in connection with global events, pandemics, and epidemics; \n•\ntiming of receipt of necessary governmental and regulatory permits or approvals;\n•\ndomestic and foreign laws or regulations, particularly relating to the environment, mining and processing;\n•\nchanges in tax laws;\n•\npolitical developments in any jurisdiction in which Newmont operates being consistent with its current expectations;\n•\nour ability to obtain or maintain necessary financing; and\n•\nother risks and hazards associated with mining operations.\nMore detailed information regarding these factors is included in Item 1A, Risk Factors and elsewhere throughout this report. Many of these factors are beyond our ability to control or predict. Given these uncertainties, readers are cautioned not to place undue reliance on our forward-looking statements.\nAll subsequent written and oral forward-looking statements attributable to Newmont or to persons acting on its behalf are expressly qualified in their entirety by these cautionary statements. We disclaim any intention or obligation to update publicly any forward-looking statements, whether as a result of new information, future events or otherwise, except as may be required under applicable securities laws.\n15\nTable of Contents\nAvailable Information\nNewmont maintains a website at www.newmont.com and makes available, through the Investor Relations section of the website, its Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, Section 16 filings and all amendments to those reports, as soon as reasonably practicable after such material is electronically filed with the SEC. Certain other information, including Newmont’s Corporate Governance Guidelines, the charters of key committees of its Board of Directors and its Code of Conduct are also available on the website.",
  "item7": "ITEM 7.       MANAGEMENT’S DISCUSSION AND ANALYSIS OF CONSOLIDATED FINANCIAL CONDITION AND RESULTS OF OPERATIONS \n(dollars in millions, except per share, per ounce and per pound amounts)\nThe following Management’s Discussion and Analysis of Consolidated Financial Condition and Results of Operations (“MD&A”) provides information that management believes is relevant to an assessment and understanding of the consolidated financial condition and results of operations of Newmont Corporation, a Delaware corporation, and its subsidiaries (collectively, “Newmont,” the “Company,” “our” and “we”). We use certain non-GAAP financial measures in our MD&A. For a detailed description of each of the non-GAAP measures used in this MD&A, please refer to the discussion under Non-GAAP Financial Measures. This item should be read in conjunction with our Consolidated Financial Statements and the notes thereto included in this annual report.\nThe following MD&A generally discusses our consolidated financial condition and results of operations for 2024 and 2023 and year-to-year comparisons between 2024 and 2023. Discussions of our consolidated financial condition and results of operations for 2022 and year-to-year comparisons between 2023 and 2022 are included in Item 7, Management’s Discussion and Analysis of Consolidated Financial Condition and Results of Operations, of the Company’s \nAnnual Report on Form 10-K\n, filed with the Securities and Exchange Commission on February 29, 2024.\nOverview\nNewmont is the world’s leading gold company and is the only gold company included in the S&P 500 Index and the Fortune 500 list of companies. We have been included in the Dow Jones Sustainability Index-World since 2007 and have adopted the World Gold Council’s Conflict-Free Gold Policy. In June 2024, the Company was named as the only miner in TIME’s top 100 green firms ranking. Since 2015, Newmont has been ranked as the mining and metal sector’s top gold miner by the S&P Global Corporate Sustainability Assessment. Newmont has been ranked the top miner in 3BL Media’s 100 Best Corporate Citizens list which ranks the 1,000 largest publicly traded U.S. companies on ESG transparency and performance since 2020. We are primarily engaged in the exploration for and acquisition of gold properties, some of which may contain copper, silver, lead, zinc or other metals. We have significant operations and/or assets in the U.S., Canada, Mexico, Dominican Republic, Peru, Suriname, Argentina, Chile, Australia, Papua New Guinea, Ecuador, Fiji, and Ghana. Our goal is to create value and improve lives through sustainable and responsible mining. \nRefer to the Consolidated Financial Results, Results of Consolidated Operations, Liquidity and Capital Resources and non-GAAP Financial Measures for information about the continued impacts from inflationary pressures, effects of certain countermeasures taken by central banks, and supply chain disruptions, with particular consideration on the outlook for increased costs specific to labor, materials, consumables and fuel and energy on operations, as well as impacts on the timing and cost of capital expenditures and the risk of potential impairment to certain assets. Refer to discussion of Risk and Uncertainties within Note 2 to the Consolidated Financial Statements for further information.\nNon-core Asset Divestitures\nBased on a comprehensive review of the Company’s portfolio of assets following the Newcrest acquisition, the Company’s Board of Directors approved a portfolio optimization program to divest six non-core assets and a development project in February 2024. The non-core assets to be divested include Akyem, CC&V, Éléonore, Porcupine, Musselwhite, Telfer, and a development project in Canada. In February 2024, the Company concluded that these non-core assets and the development project met the accounting requirements to be presented as held for sale in the first quarter of 2024, based on progress made through our active sales program and management’s expectation that the sale is probable and will be completed within 12 months. As of December 31, 2023, the aggregate net book value of the non-core assets and the development project was $3,419. While the Company remains committed to a plan to sell these assets for a fair price, there is a possibility that the assets held for sale may exceed one year due to events or circumstances beyond the Company's control. \nIn the second half of 2024, the Company entered into a definitive agreement to sell the assets of the Telfer reportable segment, which closed in the fourth quarter 2024. As a result of the sale, a loss of $160 was recognized in \nLoss on assets held for sale\n. Additionally, in the fourth quarter of 2024 the Company entered into definitive agreements to sell the reportable segments of Akyem, Musselwhite, Éléonore, and CC&V and in January 2025 the Company entered into a definitive agreement to sell the Porcupine reportable segment. All of which are expected to close in the first half of 2025 and remained designated as held for sale at December 31, 2024.\nThe non-core assets and the development project classified as held for sale are recorded at the lower of the carrying value or fair value, less costs to sell. These assets are periodically valued until sale occurs with any resulting gain or loss recognized in \nLoss on assets held for sale\n. As a result, for the year ended December 31, 2024 a loss of $859 was recognized within \nLoss on assets held for sale\n, of which $160 and $699 related to Telfer and the disposal groups remaining as held for sale as of December 31, 2024, respectively. The $699 loss on the disposal groups remaining as held for sale resulted in an aggregate net book value of $2,432 at December 31, 2024. A resulting tax impact of $255 was recognized for the year ended December 31, 2024, resulting in a total loss of $1,114 recognized for the year ended December 31, 2024, within \nLoss on assets held for sale\n.\nFor further information, refer to Note 3 to the Consolidated Financial Statements.\n92\nTable of Contents\nNewcrest Acquisition\nOn November 6, 2023, the Company completed its business combination transaction with Newcrest Mining Limited, a public Australian mining company limited by shares (\"Newcrest\"), whereby Newmont, through Newmont Overseas Holdings Pty Ltd, an Australian proprietary company limited by shares (“Newmont Sub”), acquired all of the ordinary shares of Newcrest in a fully stock transaction for total non-cash consideration of $13,549. Newcrest became a direct wholly owned subsidiary of Newmont Sub and an indirect wholly owned subsidiary of Newmont (such acquisition, the “Newcrest transaction”). The combined company continues to be traded on the New York Stock Exchange under the ticker NEM. The combined company is also listed on the Toronto Stock Exchange under the ticker NGT, on the Australian Securities Exchange under the ticker NEM, and on the Papua New Guinea Securities Exchange under the ticker NEM. For further information, refer to Note 3 to the Consolidated Financial Statements.\nFor information on asset sales impacting comparability of below results, refer to Note 9 to the Consolidated Financial Statements.\nConsolidated Financial Results\nThe details of our \nNet income (loss) from continuing operations attributable to Newmont stockholders\n are set forth below:\nYear Ended December 31,\nIncrease\n(decrease)\n2024\n2023\nNet income (loss) from continuing operations attributable to Newmont stockholders \n$\n3,280 \n$\n(2,521)\n$\n5,801 \nNet income (loss) from continuing operations attributable to Newmont stockholders per common share, diluted\n$\n2.86 \n$\n(3.00)\n$\n5.86 \nYear Ended December 31,\nIncrease\n(decrease)\n2023\n2022\nNet income (loss) from continuing operations attributable to Newmont stockholders \n$\n(2,521)\n$\n(459)\n$\n(2,062)\nNet income (loss) from continuing operations attributable to Newmont stockholders per common share, diluted\n$\n(3.00)\n$\n(0.58)\n$\n(2.42)\nNet income (loss) from continuing operations attributable to Newmont stockholders \nincreased during the year ended December 31, 2024, compared to the same period in 2023, partially due to the impact of sites acquired in the Newcrest transaction which contributed $1,047 to the increase.\nExcluding the impact of the sites acquired in the Newcrest transaction, the increase in \nNet income (loss) from continuing operations attributable to Newmont stockholders\n for the year ended 2024 compared to the same period in 2023 was primarily due to (i) higher average realized prices for all metals; (ii) lower \nImpairment\n \ncharges\n; (iii) lower \nReclamation and remediation\n; and (iv) and higher net income at Peñasquito which had been impacted in 2023 as a result of the labor strike. This increase was partially offset by the \nLoss on assets held for sale\n and higher income and mining tax expense.\nRefer below for further information on the change in \nCosts applicable to sales\n and \nDepreciation and amortization.\nThe details and analyses of our \nSales\n for all periods presented are set forth below. Refer to Note 5 to the Consolidated Financial Statements for additional information.\nYear Ended December 31,\nIncrease\n(decrease)\n2024\n2023\nGold\n$\n15,746 \n$\n10,593 \n$\n5,153 \nCopper\n1,327 \n575 \n752 \nSilver\n792 \n335 \n457 \nLead\n195 \n96 \n99 \nZinc\n622 \n213 \n409 \n$\n18,682 \n$\n11,812 \n$\n6,870 \n93\nTable of Contents\nYear Ended December 31,\nIncrease\n(decrease)\n2023\n2022\nGold\n$\n10,593 \n$\n10,416 \n$\n177 \nCopper\n575 \n316 \n259 \nSilver\n335 \n549 \n(214)\nLead\n96 \n133 \n(37)\nZinc\n213 \n501 \n(288)\n$\n11,812 \n$\n11,915 \n$\n(103)\nYear Ended December 31, 2024\nGold\nCopper\nSilver\nLead\nZinc\n(ounces)\n(pounds)\n(ounces)\n(pounds)\n(pounds)\nConsolidated sales:\nGross before provisional pricing and streaming impact\n$\n15,701 \n$\n1,377 \n$\n724 \n$\n200 \n$\n691 \nProvisional pricing mark-to-market\n105 \n— \n14 \n(2)\n8 \nSilver streaming amortization\n— \n— \n91 \n— \n— \nGross after provisional pricing and streaming impact\n15,806 \n1,377 \n829 \n198 \n699 \nTreatment and refining charges\n(60)\n(50)\n(37)\n(3)\n(77)\nNet\n$\n15,746 \n$\n1,327 \n$\n792 \n$\n195 \n$\n622 \nConsolidated ounces/pounds sold \n(1)(2)\n6,539 \n332 \n33 \n213 \n545 \nAverage realized price (per ounce/pound):\n (3)\nGross before provisional pricing and streaming impact\n$\n2,401 \n$\n4.15 \n$\n22.05 \n$\n0.94 \n$\n1.27 \nProvisional pricing mark-to-market\n16 \n— \n0.42 \n(0.01)\n0.02 \nSilver streaming amortization\n— \n— \n2.79 \n— \n— \nGross after provisional pricing and streaming impact\n2,417 \n4.15 \n25.26 \n0.93 \n1.29 \nTreatment and refining charges\n(9)\n(0.15)\n(1.13)\n(0.02)\n(0.15)\nNet\n$\n2,408 \n$\n4.00 \n$\n24.13 \n$\n0.91 \n$\n1.14 \n____________________________\n(1)\nAmounts reported in millions except gold ounces, which are reported in thousands. \n(2)\nFor the year ended December 31, 2024, the Company sold 150 thousand tonnes of copper, 97 thousand tonnes of lead, and 247 thousand tonnes of zinc. \n(3)\nPer ounce/pound measures may not recalculate due to rounding.\nYear Ended December 31, 2023\nGold\nCopper\nSilver\nLead\nZinc\n(ounces)\n(pounds)\n(ounces)\n(pounds)\n(pounds)\nConsolidated sales:\nGross before provisional pricing and streaming impact\n$\n10,605 \n$\n601 \n$\n312 \n$\n103 \n$\n281 \nProvisional pricing mark-to-market\n34 \n15 \n7 \n(4)\n(15)\nSilver streaming amortization\n— \n— \n42 \n— \n— \nGross after provisional pricing and streaming impact\n10,639 \n616 \n361 \n99 \n266 \nTreatment and refining charges\n(46)\n(41)\n(26)\n(3)\n(53)\nNet\n$\n10,593 \n$\n575 \n$\n335 \n$\n96 \n$\n213 \nConsolidated ounces/pounds sold \n(1)(2)\n5,420 \n155 \n17 \n107 \n222 \nAverage realized price (per ounce/pound):\n (3)\nGross before provisional pricing and streaming impact\n$\n1,957 \n$\n3.87 \n$\n18.53 \n$\n0.96 \n$\n1.27 \nProvisional pricing mark-to-market\n6 \n0.10 \n0.44 \n(0.03)\n(0.07)\nSilver streaming amortization\n— \n— \n2.56 \n— \n— \nGross after provisional pricing and streaming impact\n1,963 \n3.97 \n21.53 \n0.93 \n1.20 \nTreatment and refining charges\n(9)\n(0.26)\n(1.56)\n(0.03)\n(0.24)\nNet\n$\n1,954 \n$\n3.71 \n$\n19.97 \n$\n0.90 \n$\n0.96 \n____________________________\n(1)\nAmounts reported in millions except gold ounces, which are reported in thousands. \n(2)\nFor the year ended December 31, 2023, the Company sold 71 thousand tonnes of copper, 49 thousand tonnes of lead, and 101 thousand tonnes of zinc. \n(3)\nPer ounce/pounds measures may not recalculate due to rounding.\n94\nTable of Contents\nYear Ended December 31, 2022\nGold\nCopper\nSilver\nLead\nZinc\n(ounces)\n(pounds)\n(ounces)\n(pounds)\n(pounds)\nConsolidated sales:\nGross before provisional pricing and streaming impact\n$\n10,461 \n$\n337 \n$\n533 \n$\n145 \n$\n583 \nProvisional pricing mark-to-market\n(2)\n(11)\n(11)\n(1)\n(9)\nSilver streaming amortization\n— \n— \n73 \n— \n— \nGross after provisional pricing and streaming impact\n10,459 \n326 \n595 \n144 \n574 \nTreatment and refining charges\n(43)\n(10)\n(46)\n(11)\n(73)\nNet\n$\n10,416 \n$\n316 \n$\n549 \n$\n133 \n$\n501 \nConsolidated ounces/pounds sold\n (1)(2)\n5,812 \n85 \n30 \n147 \n373 \nAverage realized price (per ounce/pound):\n (3)\nGross before provisional pricing and streaming impact\n$\n1,800 \n$\n3.94 \n$\n17.90 \n$\n0.98 \n$\n1.56 \nProvisional pricing mark-to-market\n— \n(0.13)\n(0.35)\n— \n(0.02)\nSilver streaming amortization\n— \n— \n2.45 \n— \n— \nGross after provisional pricing and streaming impact\n1,800 \n3.81 \n20.00 \n0.98 \n1.54 \nTreatment and refining charges\n(8)\n(0.12)\n(1.55)\n(0.07)\n(0.20)\nNet\n$\n1,792 \n$\n3.69 \n$\n18.45 \n$\n0.91 \n$\n1.34 \n____________________________\n(1)\nAmounts reported in millions except gold ounces, which are reported in thousands. \n(2)\nFor the year ended December 31, 2022, the Company sold 39 thousand tonnes of copper, 67 thousand tonnes of lead, and 169 thousand tonnes of zinc. \n(3)\nPer ounce/pound measures may not recalculate due to rounding.\nThe change in consolidated sales is due to:\nYear Ended December 31,\n2024 vs. 2023\nGold\nCopper\nSilver\nLead\nZinc\n(ounces)\n(pounds)\n(ounces)\n(pounds)\n(pounds)\nIncrease (decrease) in consolidated ounces/pounds sold\n$\n2,197 \n$\n698 \n$\n346 \n$\n98 \n$\n387 \nIncrease (decrease) in average realized price\n2,970 \n63 \n122 \n1 \n46 \nDecrease (increase) in treatment and refining charges\n(14)\n(9)\n(11)\n— \n(24)\n$\n5,153 \n$\n752 \n$\n457 \n$\n99 \n$\n409 \nYear Ended December 31,\n2023 vs. 2022\nGold\nCopper\nSilver\nLead\nZinc\n(ounces)\n(pounds)\n(ounces)\n(pounds)\n(pounds)\nIncrease (decrease) in consolidated ounces/pounds sold\n$\n(704)\n$\n266 \n$\n(260)\n$\n(39)\n$\n(233)\nIncrease (decrease) in average realized price\n884 \n24 \n26 \n(6)\n(75)\nDecrease (increase) in treatment and refining charges\n(3)\n(31)\n20 \n8 \n20 \n$\n177 \n$\n259 \n$\n(214)\n$\n(37)\n$\n(288)\nSales\n increased during the year ended December 31, 2024, compared to the same period in 2023, by $6,870, primarily due to a net increase in gold and copper sales of $5,153 and $752, respectively. Of the gold and copper sales increases, $2,807 and $786, were attributable to sites acquired in the Newcrest transaction, respectively.\nFor discussion regarding drivers impacting sales volumes by site, refer to Results of Consolidated Operations below.\n95\nTable of Contents\nThe details of our \nCosts applicable to sales\n are set forth below.\nYear Ended December 31,\nIncrease\n(decrease)\n2024\n2023\nGold\n$\n7,364 \n$\n5,689 \n$\n1,675 \nCopper\n696 \n359 \n337 \nSilver\n360 \n300 \n60 \nLead\n116 \n98 \n18 \nZinc\n427 \n253 \n174 \n$\n8,963 \n$\n6,699 \n$\n2,264 \nYear Ended December 31,\nIncrease\n(decrease)\n2023\n2022\nGold\n$\n5,689 \n$\n5,423 \n$\n266 \nCopper\n359 \n181 \n178 \nSilver\n300 \n454 \n(154)\nLead\n98 \n94 \n4 \nZinc\n253 \n316 \n(63)\n$\n6,699 \n$\n6,468 \n$\n231 \nThe increase in \nCosts applicable to sales\n during the year ended December 31, 2024, compared to the same period in 2023, is primarily due to the impact of sites acquired in the Newcrest transaction, which contributed $1,551 to the increase to \nCosts applicable to sales\n.\nThe increase in \nCosts applicable to sales\n during the year ended December 31, 2024, compared to the same period in 2023, was further impacted by (i) an increase of $319 at Peñasquito due to reduced operations in 2023 as a result of the labor strike, (ii) a drawdown of inventory and higher royalties at Ahafo, Akyem and Yanacocha, (iii) higher equipment maintenance costs at Tanami, and (iv) higher contracted services and labor costs at Ahafo; partially offset by a decrease in \nCosts applicable to sales\n at Boddington and Cerro Negro due to lower production.\nFor discussion regarding other significant drivers impacting\n Costs applicable to sales \nby site, refer to Results of Consolidated Operations below.\nThe Company uses both straight-line and UOP methods of depreciation. \nDepreciation and amortization\n will vary as a result of fluctuations in sales volumes and depreciation rates utilized at our mining sites. The details of our \nDepreciation and amortization\n are set forth below. Refer to Note 4 to the Consolidated Financial Statements for additional information.\nYear Ended December 31,\nIncrease\n(decrease)\n2024\n2023\nGold\n$\n1,918 \n$\n1,730 \n$\n188 \nCopper\n217 \n53 \n164 \nSilver\n159 \n134 \n25 \nLead\n52 \n45 \n7 \nZinc\n162 \n105 \n57 \nOther\n68 \n41 \n27 \n$\n2,576 \n$\n2,108 \n$\n468 \nYear Ended December 31,\nIncrease\n(decrease)\n2023\n2022\nGold\n$\n1,730 \n$\n1,838 \n$\n(108)\nCopper\n53 \n34 \n19 \nSilver\n134 \n151 \n(17)\nLead\n45 \n32 \n13 \nZinc\n105 \n96 \n9 \nOther\n41 \n34 \n7 \n$\n2,108 \n$\n2,185 \n$\n(77)\n96\nTable of Contents\nThe increase in \nDepreciation and amortization\n during the year ended December 31, 2024, compared to the same period in 2023, is primarily due to the impact of sites acquired in the Newcrest transaction, which contributed $582 to the increase in \nDepreciation and amortization.\nExcluding the impact of the sites acquired in the Newcrest transaction, \nDepreciation and amortization\n decreased by $114 during the year ended December 31, 2024, compared to the same period in 2023, primarily due to the cessation of depreciation at sites classified as held for sale beginning in March 2024, partially offset by higher ounces mined at Peñasquito in the current year due to the Peñasquito labor strike in 2023 and higher ounces mined and asset additions at Ahafo.\nFor discussion regarding other significant drivers impacting\n Depreciation and amortization \nby site, refer to Results of Consolidated Operations below.\nGeneral and administrative \nexpense was $442, $299, and $276 in 2024, 2023, and 2022, respectively. \nGeneral and administrative \nexpense\n \nincreased in 2024, compared to 2023, primarily due to higher salaries and benefits, non-integration related consulting and other charges resulting from the Newcrest transaction, and higher travel costs during the year. \nGeneral and administrative\n expense as a percentage of \nSales\n was 2.4%, 2.5%, and 2.3% for 2024, 2023 and 2022 respectively.\nInterest expense, net of capitalized interest\n was $375, $243, and $227 in 2024, 2023, and 2022, respectively. Capitalized interest totaled $114, $89, and $69 in each year, respectively. \nInterest expense, net of capitalized interest\n increased in 2024, compared to 2023, as a result of the interest expense recognized for the entire year on the debt acquired in the Newcrest transaction in November 2023.\nIncome and mining tax expense (benefit)\n was\n $1,397, $526, and $455 \nin 2024, 2023 and 2022\n, respectively. The effective tax rate is driven by a number of factors and the comparability of our income tax expense for the reported periods will be primarily affected by (i) variations in our income before income taxes; (ii) geographic distribution of that income; (iii) impacts of the changes in tax law; (iv) valuation allowances on tax assets; (v) percentage depletion; (vi) fluctuation in the value of the United States dollar and foreign currencies; and (vii) the impact of specific transactions and assessments including significant impairments of goodwill during 2023 and 2022. As a result, the effective tax rate will fluctuate, sometimes significantly, year to year. This trend is expected to continue in future periods. Refer to Note 10 to the Consolidated Financial Statements for further discussion of income taxes.\nYear Ended December 31,\n2024\n2023\nIncome\n(Loss)\n (1)\nEffective\nTax Rate\nIncome Tax\n(Benefit)\nProvision\nFederal and State Cash Tax (Refund)\nMining Cash Tax/(Refund)\nIncome\n(Loss)\n (1)\nEffective\nTax Rate\nIncome Tax\n(Benefit)\nProvision\nFederal and State Cash Tax (Refund)\nMining Cash Tax/(Refund)\nNevada\n$\n733 \n18 \n%\n$\n133 \n$\n— \n$\n40 \n$\n431 \n12 \n%\n$\n52 \n$\n— \n$\n19 \nCC&V\n88 \n13 \n11 \n— \n— \n71 \n8 \n6 \n— \n— \nCorporate & Other\n(285)\n(37)\n106 \n11 \n(3)\n— \n(391)\n26 \n(100)\n15 \n(3)\n— \nTotal US\n536 \n47 \n250 \n11 \n40 \n111 \n(38)\n(42)\n15 \n19 \nAustralia\n1,741 \n34 \n596 \n295 \n(3)\n47 \n794 \n50 \n398 \n302 \n113 \nGhana\n998 \n35 \n348 \n418 \n— \n481 \n35 \n167 \n223 \n— \nSuriname\n82 \n17 \n14 \n28 \n— \n53 \n19 \n10 \n10 \n— \nPeru\n346 \n37 \n129 \n9 \n12 \n(1,083)\n(2)\n17 \n10 \n4 \nCanada\n(171)\n138 \n(236)\n17 \n47 \n(610)\n(6)\n37 \n(9)\n7 \nMexico\n601 \n19 \n112 \n3 \n(3)\n4 \n(1,805)\n5 \n(97)\n29 \n64 \nArgentina\n— \n— \n35 \n17 \n(3)\n— \n(71)\n— \n— \n9 \n— \nPapua New Guinea\n441 \n32 \n140 \n31 \n— \n89 \n29 \n26 \n14 \n— \nOther Foreign\n3 \n300 \n9 \n— \n— \n10 \n100 \n10 \n— \n— \nConsolidated\n$\n4,577 \n31 \n%\n(2)\n$\n1,397 \n$\n829 \n$\n150 \n$\n(2,031)\n(26)\n%\n(2)\n$\n526 \n$\n603 \n$\n207 \n____________________________\n(1)\nRepresents income (loss) from continuing operations by geographic location before income taxes and equity in affiliates. These amounts will not reconcile to the Segment Information for the reasons stated in Note 4 to the Consolidated Financial Statements.\n(2)\nThe consolidated effective income tax rate is a function of the combined effective tax rates for the jurisdictions in which we operate. Variations in the relative proportions of jurisdictional income could result in fluctuations to our combined effective income tax rate.\n(3)\nIncludes $19 and $28 of withholding tax for the year ended December 31, 2024 and 2023, respectively.\nRecently Enacted Legislation\nIn 2024, Pillar II went into effect. The Pillar II agreement was signed by numerous countries with the intent to equalize corporate tax around the world by implementing a global minimum tax of 15%. As Newmont primarily does business in jurisdictions with a tax rate greater than 15%, the Company does not anticipate a material impact to the Consolidated Financial Statements.\n97\nTable of Contents\nNet income (loss) from discontinued operations\n was $68, $27, and $30 in 2024, 2023, and 2022, respectively. \nNet income (loss) from discontinued operations \nincreased in 2024, compared to 2023, primarily due to the sale of the Batu and Elang contingent consideration assets, including the income tax benefit associated with a release of a valuation allowance on the capital loss carryforward in the U.S. Refer to Note 14 to the Consolidated Financial Statements for additional information.\nRefer to the Notes to the Consolidated Financial Statements for explanations of other financial statement line items.\nResults of Consolidated Operations\nNewmont has developed gold equivalent ounces (“GEO”) metrics to provide a comparable basis for analysis and understanding of our operations and performance related to copper, silver, lead and zinc. Gold equivalent ounces are calculated as pounds or ounces produced or sold multiplied by the ratio of the other metals’ price to the gold price, using the metal prices in the table below:\nGold\nCopper\nSilver\nLead\nZinc\n(ounce)\n(pound)\n(ounce)\n(pound)\n(pound)\n2024 GEO Price\n (1)\n$\n1,400 \n$\n3.50 \n$\n20.00 \n$\n1.00 \n$\n1.20 \n2023 GEO Price\n$\n1,400 \n$\n3.50 \n$\n20.00 \n$\n1.00 \n$\n1.20 \n2022 GEO Price\n$\n1,200 \n$\n3.25 \n$\n23.00 \n$\n0.95 \n$\n1.15 \n____________________________\n(1)\nEffective January 1, 2025, GEO pricing was updated to align with reserve metal price assumptions as follows: Gold ($1,700/oz.), Copper ($3.50/lb.), Silver ($20.00/oz.), Lead ($0.90/lb.), and Zinc ($1.20/lb.). The update to GEO pricing will have an impact on the calculated gold equivalent ounces. This will result in an impact to costs allocated to the respective GEOs, particularly resulting in higher costs allocated to gold.\n98\nTable of Contents\nGold or Other Metals Produced\nCosts Applicable to Sales\n (1)\nDepreciation and Amortization\nAll-In Sustaining Costs\n (2)\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nGold\n(ounces in thousands)\n($ per ounce sold)\n($ per ounce sold)\n($ per ounce sold)\nBrucejack\n (3)\n258 \n29 \n— \n$\n1,254 \n$\n1,898 \n$\n— \n$\n691 \n$\n617 \n$\n— \n$\n1,603 \n$\n2,646 \n$\n— \nRed Chris\n (3)\n40 \n5 \n— \n$\n1,225 \n$\n905 \n$\n— \n$\n367 \n$\n298 \n$\n— \n$\n1,607 \n$\n1,439 \n$\n— \nPeñasquito\n299 \n143 \n566 \n$\n776 \n$\n1,219 \n$\n771 \n$\n355 \n$\n516 \n$\n258 \n$\n984 \n$\n1,590 \n$\n968 \nMerian\n274 \n322 \n403 \n$\n1,457 \n$\n1,207 \n$\n915 \n$\n305 \n$\n256 \n$\n199 \n$\n1,852 \n$\n1,541 \n$\n1,105 \nCerro Negro\n238 \n269 \n278 \n$\n1,325 \n$\n1,257 \n$\n1,007 \n$\n521 \n$\n524 \n$\n525 \n$\n1,631 \n$\n1,509 \n$\n1,262 \nYanacocha\n354 \n276 \n244 \n$\n1,003 \n$\n1,069 \n$\n1,254 \n$\n279 \n$\n310 \n$\n380 \n$\n1,196 \n$\n1,266 \n$\n1,477 \nBoddington\n590 \n745 \n798 \n$\n1,056 \n$\n847 \n$\n802 \n$\n193 \n$\n144 \n$\n145 \n$\n1,288 \n$\n1,067 \n$\n921 \nTanami\n408 \n448 \n484 \n$\n947 \n$\n759 \n$\n675 \n$\n300 \n$\n249 \n$\n207 \n$\n1,281 \n$\n1,060 \n$\n960 \nCadia\n (3)\n464 \n97 \n— \n$\n653 \n$\n1,079 \n$\n— \n$\n263 \n$\n130 \n$\n— \n$\n1,048 \n$\n1,271 \n$\n— \nLihir\n (3)\n614 \n134 \n— \n$\n1,270 \n$\n1,117 \n$\n— \n$\n270 \n$\n153 \n$\n— \n$\n1,512 \n$\n1,517 \n$\n— \nAhafo\n798 \n581 \n574 \n$\n904 \n$\n947 \n$\n990 \n$\n270 \n$\n312 \n$\n292 \n$\n1,072 \n$\n1,222 \n$\n1,178 \nNGM\n1,039 \n1,170 \n1,169 \n$\n1,219 \n$\n1,070 \n$\n989 \n$\n413 \n$\n387 \n$\n404 \n$\n1,605 \n$\n1,397 \n$\n1,220 \nHeld for Sale \n(4)\nCC&V\n146 \n172 \n182 \n$\n1,390 \n$\n1,156 \n$\n1,302 \n$\n90 \n$\n136 \n$\n386 \n$\n1,691 \n$\n1,644 \n$\n1,697 \nMusselwhite\n212 \n180 \n173 \n$\n1,045 \n$\n1,186 \n$\n1,135 \n$\n86 \n$\n444 \n$\n464 \n$\n1,541 \n$\n1,843 \n$\n1,531 \nPorcupine\n284 \n260 \n280 \n$\n1,097 \n$\n1,167 \n$\n1,004 \n$\n127 \n$\n455 \n$\n369 \n$\n1,437 \n$\n1,577 \n$\n1,248 \nÉléonore\n240 \n232 \n215 \n$\n1,339 \n$\n1,263 \n$\n1,228 \n$\n88 \n$\n433 \n$\n531 \n$\n1,811 \n$\n1,838 \n$\n1,599 \nAkyem\n204 \n295 \n420 \n$\n1,596 \n$\n931 \n$\n804 \n$\n271 \n$\n413 \n$\n340 \n$\n1,816 \n$\n1,210 \n$\n972 \nDivested \n(15)\nTelfer\n (3)(5)\n83 \n43 \n— \n$\n2,377 \n$\n1,882 \n$\n— \n$\n142 \n$\n87 \n$\n— \n$\n2,993 \n$\n1,988 \n$\n— \nTotal/Weighted Average\n (6)\n6,545 \n5,401 \n5,786 \n$\n1,126 \n$\n1,050 \n$\n933 \n$\n304 \n$\n327 \n$\n322 \n$\n1,516 \n$\n1,444 \n$\n1,211 \nMerian (25%)\n(69)\n(80)\n(101)\nYanacocha (—%, —%, and 43.65%, respectively)\n (7)\n— \n— \n(14)\nAttributable to Newmont\n6,476 \n5,321 \n5,671 \nGold equivalent ounces - other metals\n(ounces in thousands)\n($ per ounce sold)\n($ per ounce sold)\n($ per ounce sold)\nRed Chris\n (3)(8)\n144 \n20 \n— \n$\n1,209 \n$\n1,020 \n$\n— \n$\n366 \n$\n181 \n$\n— \n$\n1,640 \n$\n1,660 \n$\n— \nPeñasquito\n (9)\n1,102 \n529 \n1,048 \n$\n831 \n$\n1,283 \n$\n828 \n$\n343 \n$\n561 \n$\n267 \n$\n1,090 \n$\n1,756 \n$\n1,112 \nBoddington\n (10)\n206 \n245 \n227 \n$\n994 \n$\n830 \n$\n782 \n$\n189 \n$\n144 \n$\n145 \n$\n1,172 \n$\n1,067 \n$\n894 \nCadia\n (3)(11)\n478 \n90 \n— \n$\n603 \n$\n1,017 \n$\n— \n$\n263 \n$\n127 \n$\n— \n$\n987 \n$\n1,342 \n$\n— \nDivested \n(15)\nTelfer\n (3)(5)(12)\n14 \n7 \n— \n$\n2,398 \n$\n1,703 \n$\n— \n$\n161 \n$\n109 \n$\n— \n$\n2,885 \n$\n2,580 \n$\n— \nTotal/Weighted-Average\n (6)\n1,944 \n891 \n1,275 \n$\n834 \n$\n1,127 \n$\n819 \n$\n307 \n$\n378 \n$\n245 \n$\n1,161 \n$\n1,579 \n$\n1,114 \nCopper\n(tonnes in thousands)\nRed Chris\n (3)(8)\n26 \n4 \n— \nBoddington\n (10)\n37 \n44 \n38 \nCadia\n (3)(11)\n87 \n16 \n— \nDivested\n (15)\nTelfer \n(3)(5)(12)\n3 \n1 \n— \nTotal/Weighted-Average\n153 \n65 \n38 \nLead\n(tonnes in thousands)\nPeñasquito\n (9)\n96 \n51 \n68 \nZinc\n(tonnes in thousands)\nPeñasquito\n (9)\n258 \n104 \n171 \nAttributable gold from equity method investments\n (13)\n(ounces in thousands)\nPueblo Viejo (40%)\n235 \n224 \n285 \nFruta del Norte\n (3)(14)\n138 \n— \n— \nAttributable to Newmont\n373 \n224 \n285 \n99\nTable of Contents\n____________________________\n(1)\nExcludes\n Depreciation and amortization\n and \nReclamation and remediation\n.\n(2)\nAll-in sustaining costs is a non-GAAP financial measure. Refer to Non-GAAP Financial Measures below. \n(3)\nSites acquired through the Newcrest transaction during the fourth quarter of 2023, and as such, the comparative results of operations information is not meaningful. Refer to Note 3 to the Consolidated Financial Statements for further information on the Newcrest transaction.\n(4)\nSites were classified as held for sale beginning in the first quarter of 2024, and as such, the Company ceased recording depreciation and amortization at these sites in March 2024. Refer to Note 3 of the Consolidated Financial Statements for further discussion of our assets and liabilities held for sale.\n(5)\nDuring the second quarter, seepage points were detected on the outer wall and around the tailings storage facility at Telfer and we temporarily ceased placing new tailings on the facility. Production resumed at the end of the third quarter upon successful remediation of the tailings storage facility. During the fourth quarter of 2024, we recognized a benefit of $50 related to business insurance proceeds as a result of the event, recorded in \nCosts applicable to sales\n. \n(6)\nAll-in sustaining costs and \nDepreciation and amortization\n include expense for Corporate and Other.\n(7)\nThe Company acquired the remaining interest in Yanacocha in 2022, resulting in 100% ownership interest at December 31, 2022. The Company recognized amounts attributable to non-controlling interests for Yanacocha for the periods prior to acquiring 100% ownership. Refer to Note 1 to the Consolidated Financial Statement for further information.\n(8)\nFor the year ended December 31, 2024 and 2023, Red Chris produced 58 million and 8 million pounds of copper, respectively. \n(9)\nFor the year ended December 31, 2024, Peñasquito produced 33 million ounces of silver, 212 million pounds of lead and 569 million pounds of zinc. For the year ended December 31, 2023, Peñasquito produced 18 million ounces of silver, 113 million pounds of lead and 230 million pounds of zinc. For the year ended December 31, 2022, Peñasquito produced 30 million ounces of silver, 149 million pounds of lead and 377 million pounds of zinc.\n(10)\nFor the years ended December 31, 2024, 2023 and 2022, Boddington produced 83 million, 98 million and\n \n84 million pounds of copper, respectively.\n(11)\nFor the year ended December 31, 2024 and 2023, Cadia produced 191 million and 36 million pounds of copper, respectively.\n(12)\nFor the year ended December 31, 2024 and 2023, Telfer produced 6 million and 3 million pounds of copper, respectively.\n(13)\nIncome and expenses of equity method investments are included in \nEquity income (loss) of affiliates\n. Refer to Note 15 to the Consolidated Financial Statements for further discussion of our equity method investments.\n(14)\nThe Fruta del Norte mine is wholly owned and operated by Lundin Gold. Newmont holds a 32.0% interest in Lundin Gold and accounts for it on a quarterly-lag as an equity method investment. As a result, results of operations was first reported in the first quarter of 2024.\n(15)\nIn the fourth quarter of 2024, the Company completed the sale of the assets of the Telfer reportable segment. Telfer was classified as held for sale beginning in the first quarter of 2024, and as such, the Company ceased recording depreciation and amortization in March 2024. Refer to Note 3 to the Consolidated Financial Statements for further information.\nPeñasquito, Mexico\n. Gold production increased 109% and gold equivalent ounces – other metals production increased 108% primarily due to higher mill throughput in the current year due to the Peñasquito labor strike in 2023 which ended in the fourth quarter of 2023, higher ore grade milled and higher mill recovery, partially offset by a higher buildup of in-circuit inventory. \nCosts applicable to sales\n per gold ounce decreased 36% primarily due to higher gold ounces sold in the current year as a result of the Peñasquito labor strike in 2023, partially offset by higher energy costs, higher contracted services costs, and higher materials costs. \nCosts applicable to sales\n per gold equivalent ounce – other metals decreased 35% primarily due to higher gold equivalent ounces sold in the current year as a result of the Peñasquito labor strike in 2023 and lower inventory write-downs in the current year, partially offset by higher energy costs, higher contracted services costs, higher materials costs, higher selling costs, and higher workers participation costs. \nDepreciation and amortization\n per gold ounce decreased 31% and \nDepreciation and amortization\n per gold equivalent ounce – other metals decreased 39% primarily due to higher gold ounces sold and gold equivalent ounces - other metals sold respectively, as a result of the Peñasquito labor strike in 2023. All-in sustaining costs per gold ounce decreased 38% primarily due to lower cost applicable to sales per gold ounce. All-in sustaining costs per gold equivalent ounce – other metals decreased 38% primarily due to lower cost applicable to sales per gold equivalent ounce - other metals, partially offset by higher treatment and refining costs.\nMerian, Suriname.\n Gold production decreased 15% primarily due to lower ore grade milled. \nCosts applicable to sales\n per gold ounce increased 21% primarily due to lower gold ounces sold and higher labor costs. \nDepreciation and amortization\n per gold ounce increased 19% primarily due to lower gold ounces sold. All-in sustaining costs per gold ounce increased 20% primarily due to higher costs applicable to sales per gold ounce.\nCerro Negro, Argentina.\n Gold production decreased 12% primarily due to lower mill throughput as a result of temporarily suspending mining at the site due to the tragic fatalities during the second quarter of 2024, partially offset by higher ore grade milled. \nCosts applicable to sales\n per gold ounce increased 5% primarily due to lower gold ounces sold, higher labor costs, and higher materials costs, partially offset by lower export duties. \nDepreciation and amortization\n per gold ounce was generally in line with the prior year. All-in sustaining costs per gold ounce increased 8% primarily due to higher costs applicable to sales per gold ounce and higher sustaining capital spend.\nYanacocha, Peru. \nGold production increased 28% primarily due to higher leach pad production as a result of injection leaching. \nCosts applicable to sales\n per gold ounce decreased 6% primarily due to higher gold ounces sold. \nDepreciation and amortization\n per gold ounce decreased 10% primarily due to higher gold ounces sold. All-in sustaining costs per gold ounce decreased 6% primarily due to lower costs applicable to sales per gold ounce.\nBoddington, Australia.\n Gold production decreased 21% and gold equivalent ounces – other metals production decreased 16% primarily due to lower ore grade milled and lower mill throughput. \nCosts applicable to sales\n per gold ounce increased 25% primarily \n100\nTable of Contents\ndue to lower gold ounces sold and higher equipment maintenance costs. \nCosts applicable to sales\n per gold equivalent ounce – other metals increased 20% primarily due to lower gold equivalent ounces - other metals sold and higher equipment maintenance costs. \nDepreciation and amortization\n per gold ounce increased 34% primarily due to lower gold ounces sold and higher depreciation rates due to changes in mine life. \nDepreciation and amortization\n per gold equivalent ounce - other metals increased 31% primarily due to lower gold equivalent ounces - other metals sold and higher depreciation rates due to changes in mine life. All-in sustaining costs per gold ounce increased 21% primarily due to higher costs applicable to sales per gold ounce, partially offset by lower sustaining capital spend. All-in sustaining costs per gold equivalent ounce – other metals increased 10% primarily due to higher \nCosts applicable to sales \nper gold equivalent ounce - other metals, partially offset by lower sustaining capital spend.\nTanami, Australia.\n Gold production decreased 9% primarily due to lower ore grade milled. \nCosts applicable to sales\n per gold ounce increased 25% primarily due to higher equipment maintenance cost and lower gold ounces sold. \nDepreciation and amortization\n per gold ounce increased 20% primarily due to asset additions and lower gold ounces sold. All-in sustaining costs per gold ounce increased 21% primarily due to higher costs applicable to sales per gold ounce.\nAhafo, Ghana.\n Gold production increased 37% primarily due to higher ore grade milled and higher mill throughput. \nCosts applicable to sales\n per gold ounce decreased 5% primarily due to higher gold ounces sold, partially offset by higher third-party royalties, and higher contracted services and labor costs. The higher mill throughput in the current year relates in part to a conveyor crusher failure and damage that was discovered in the SAG mill girth gear that limited mill operations below its full capacity in 2023. The conveyor was rebuilt and fully commissioned in the third quarter of 2023, and the SAG mill girth gear was replaced in the second quarter of 2024. \nDepreciation and amortization\n per gold ounce decreased 13% primarily due to higher gold ounces sold, partially offset by higher depreciation rates as a result of higher gold ounces mined and asset additions. All-in sustaining costs per gold ounce decreased 12% primarily due to lower sustaining capital spend and lower \nCosts applicable to sales\n per gold ounce. \nNGM, U.S.\n Attributable gold production decreased 11% due to lower ore grade milled at Carlin and Cortez, lower leach pad production at Cortez, partially offset by higher mill throughput at Carlin and Cortez. \nCosts applicable to sales\n per gold ounce increased 14% primarily due to lower gold ounces sold at Cortez, Carlin and Turquoise Ridge, higher contracted services and maintenance costs at Cortez and Turquoise Ridge, and higher inventory write-downs at Cortez in the current year, partially offset by lower inventory write-downs at Carlin in the current year. \nDepreciation and amortization\n per gold ounce increased 7% primarily due to lower gold ounces sold at Cortez, Carlin and Turquoise Ridge. All-in sustaining costs per gold ounce increased 15% primarily due to higher costs applicable to sales per gold ounce and higher sustaining capital spend at Carlin, partially offset by lower sustaining capital spend at Cortez.\nCC&V, U.S.\n Gold production decreased 15% primarily due to lower leach pad production as a result of lower ore tonnes mined. \nCosts applicable to sales\n per gold ounce increased 20% primarily due to lower gold ounces sold. \nDepreciation and amortization\n per gold ounce decreased 34% primarily due to cessation of depreciation and amortization as a result of classifying the asset as held for sale. All-in sustaining costs per gold ounce were generally in line with the prior year.\nMusselwhite, Canada.\n Gold production increased 18% primarily due to higher ore grade milled. Costs\n applicable to sales\n per gold ounce decreased 12% primarily due to higher gold ounces sold. \nDepreciation and amortization \nper gold ounce decreased 81% primarily due to cessation of depreciation and amortization as a result of classifying the asset as held for sale. All-in sustaining costs per gold ounce decreased 16% primarily due to lower costs applicable to sales per gold ounce and lower sustaining capital spend.\nPorcupine, Canada.\n Gold production increased 9% primarily due to higher ore grade milled and higher mill recovery. \nCosts applicable to sales\n per gold ounce decreased 6% primarily due to higher gold ounces sold. \nDepreciation and amortization\n per gold ounce decreased 72% primarily due to cessation of depreciation and amortization as a result of classifying the asset as held for sale. All-in sustaining costs per gold ounce decreased 9% primarily due to lower costs applicable to sales per gold ounce and lower reclamation and exploration spend.\nÉléonore, Canada.\n Gold production was generally in line with prior year. \nCosts applicable to sales\n per gold ounce increased 6% primarily due to higher contracted services costs, higher labor costs, and higher materials costs. \nDepreciation and amortization\n per gold ounce decreased 80% primarily due to cessation of depreciation and amortization as a result of classifying the asset as held for sale. All-in sustaining costs per gold ounce were generally in line with prior year.\nAkyem, Ghana.\n Gold production decreased 31% primarily due to lower ore grade milled, partially offset by higher mill throughput. \nCosts applicable to sales\n per gold ounce increased 71% primarily due to a drawdown of stockpile inventory, higher third-party royalties, and lower gold ounces sold. \nDepreciation and amortization\n per gold ounce decreased 34% primarily due to cessation of depreciation and amortization as a result of classifying the asset as held for sale. All-in sustaining costs per gold ounce increased 50% primarily due to higher costs applicable to sales per gold ounce, partially offset by lower reclamation spend and lower sustaining capital spend.\nPueblo Viejo, Dominican Republic\n. Attributable gold production increased 5% primarily due to higher mill throughput, partially offset by lower mill recovery and a buildup of in-circuit inventory compared to a drawdown in the prior year. Refer to Note 15 of the Consolidated Financial Statements for further discussion of our equity method investments.\n101\nTable of Contents\nForeign Currency Exchange Rates\nOur foreign operations sell their gold, copper, silver, lead, and zinc production based on USD metal prices. Therefore, fluctuations in foreign currency exchange rates do not have a material impact on our revenue. Despite selling gold and silver in London, we have no exposure to the euro or the British pound.\nForeign currency exchange rates can increase or decrease profits to the extent costs are paid in foreign currencies. In 2024, approximately 58% of \nCosts applicable to sales\n were paid in currencies other than the U.S. dollar as follows:\nYear Ended\nDecember 31, 2024\nAustralian Dollar\n26 \n%\nCanadian Dollar\n15 \n%\nMexican Peso\n6 \n%\nPapua New Guinean Kina\n4 \n%\nArgentine Peso\n3 \n%\nSurinamese Dollar\n3 \n%\nPeruvian Sol\n1 \n%\nGhanaian Cedi\n— \n%\nVariations in the local currency exchange rates in relation to the USD at our foreign mining operations decreased \nCosts applicable to sales\n at sites held prior to the Newcrest transaction by $122 per gold ounce during the year ended December 31, 2024, respectively, compared to the same period in 2023. The decrease was primarily due to significant currency devaluation in Argentina that occurred starting in the fourth quarter of 2023. Excluding the impact of the Argentine peso devaluation, \nCosts applicable to sales \nat sites held prior to the Newcrest transaction decreased by $5 per gold ounce during the year ended December 31, 2024 compared to the same period in 2023, resulting from variations in the local currency exchange rates in relation to the USD at our other foreign mining operations.\nVariations in the local currency exchange rates in relation to the USD at our foreign mining operations decreased \nCosts applicable to sales \nper gold equivalent ounce\n \nat sites held prior to the Newcrest transaction by $12, primarily in Mexico, during the year ended December 31, 2024 compared to the same periods in 2023.\nAt December 31, 2024, the Company held AUD- and CAD-denominated fixed forward contracts to mitigate variability in the USD functional cash flows related to the AUD- and CAD-denominated operating expenditures to be incurred between October 2024 and December 2025 at certain sites, respectively. The unrealized changes in fair value for the fixed forward contracts are recorded in \nAccumulated other comprehensive income (loss)\n and will be reclassified to earnings through\n Costs applicable to sales \nbeginning October 2024. Refer to Note 14 of the Consolidated Financial Statements for further information on our hedging instruments.\nHyperinflationary Economies\nHyperinflationary economies are defined by the International Monetary Fund as economies in which the projected three-year cumulative inflation exceeds 100%. For the year ended December 31, 2024, hyperinflationary economies in which the Company held operations included Ghana, Argentina, and Suriname. \nGhana.\n Our Ahafo and Akyem mines are located in Ghana and are USD functional currency entities. In 2021, the Bank of Ghana created a gold purchase program in the effort to stabilize the local currency and build up gold reserves through domestic gold purchases conducted in local currency at prevailing market rates. As the gold purchase program was voluntary, there was no significant impact to Ahafo. The majority of Ahafo’s activity has historically been denominated in USD; as a result, the devaluation of the Ghanaian cedi has resulted in an immaterial impact on our financial statements. Therefore, future devaluation of the Ghanaian cedi is not expected to have a material impact on our financial statements.\nArgentina.\n Our Cerro Negro mine is located in Argentina and is a USD functional currency entity. Beginning in 2020, Argentina’s central bank enacted a number of foreign currency controls in an effort to stabilize the local currency, including requiring the Company to convert USD proceeds from metal sales to local currency within 60 days from shipment date or 20 business days from receipt of cash, whichever happens first, as well as restricting payments to foreign-related entities denominated in foreign currency, such as dividends or distributions to the parent and related companies and royalties and other payments to foreign beneficiaries. These restrictions directly impact Cerro Negro's ability to repay intercompany debt to the Company. In the third quarter of 2024, certain restrictions were lifted or modified, allowing companies to repay intercompany debt in certain circumstances. We continue to monitor the foreign currency exposure risk and the evolution of limitations of repatriating cash to the U.S. Currently, these currency controls are not expected to have a material impact on our financial statements.\nSuriname.\n Our Merian mine is located in Suriname and is a USD functional currency entity. In 2021, the Central Bank took steps to stabilize the local currency, while the government introduced new legislation to narrow the gap between government revenues \n102\nTable of Contents\nand spending. The measures to increase government revenue mainly consist of tax increases; however, Newmont and the Republic of Suriname have a Mineral Agreement in place that supersedes such measures. The Central Bank of Suriname adopted a controlled floating rate system, which resulted in a concurrent devaluation of the Surinamese dollar. The majority of Merian’s activity has historically been denominated in USD; as a result, the devaluation of the Surinamese dollar has resulted in an immaterial impact on our financial statements. Therefore, future devaluation of the Surinamese dollar is not expected to have a material impact on our financial statements.\nLiquidity and Capital Resources\nLiquidity Overview\nWe have a disciplined capital allocation strategy of maintaining financial flexibility to execute our capital priorities and generate long-term value for our stockholders. Consistent with that strategy, we aim to self-fund development projects and make strategic partnerships focused on profitable growth, while reducing our debt and returning cash to stockholders through dividends and share repurchases.\nThe Company continues to experience the impacts from geopolitical and macroeconomic pressures. With the resulting volatile environment, we continue to monitor inflationary conditions, the effects of certain countermeasures taken by central banks, and the potential for further supply chain disruptions, as well as an uncertain and evolving labor market. Depending on the duration and extent of the impact of these events, or changes in commodity prices, the prices for gold and other metals, and foreign exchange rates, we could continue to experience volatility; transportation industry disruptions could continue, including limitations on shipping produced metals; our supply chain could continue to experience disruption; cost inflation rates could further increase; or we could incur credit related losses of certain financial assets, which could materially impact our results of operations, cash flows and financial condition.\nAs of December 31, 2024, we believe our available liquidity allows us to manage the short- and, possibly, long-term material adverse impacts of these events on our business. Refer to Note 2 to the Consolidated Financial Statements for further discussion on risks and uncertainties.\nAt December 31, 2024, the Company had $3,664 in \nCash and cash equivalents\n, of which $3,619 was included in \nCash and cash equivalents \nand $45 was included in \nAssets held for sale \nrelated to certain non-core assets that were classified as held for sale in the first quarter of 2024\n. \nThe majority of our cash and cash equivalents are invested in a variety of highly liquid and low-risk investments with original maturities of three months or less that are available to fund our operations as necessary. We may have investments in prime money market funds that are classified as cash and cash equivalents; however, we continually monitor the need for reclassification under the SEC requirements for money market funds, and the potential that the shares of such funds could have a net asset value of less than their par value. We believe that our liquidity and capital resources are adequate to fund our operations and corporate activities.\nAt December 31, 2024, $1,970 of \nCash and cash equivalents \nwas held in foreign subsidiaries and is primarily held in USD denominated accounts with the remainder in foreign currencies readily convertible to USD. Cash and cash equivalents denominated in Argentine peso are subject to regulatory restrictions. Refer to Foreign Currency Exchange Rates above for further information. At December 31, 2024, $1,655 in consolidated cash and cash equivalents was held at certain foreign subsidiaries that, if repatriated, may be subject to withholding taxes. We expect that there would be no additional tax burden upon repatriation after considering the cash cost associated with any potential withholding taxes.\nWe believe our existing consolidated \nCash and cash equivalents\n, available capacity on our revolving credit facility, and cash generated from continuing operations will be adequate to satisfy working capital needs, fund future growth, meet debt obligations and meet other liquidity requirements for the foreseeable future. At December 31, 2024, our borrowing capacity on our revolving credit facility was $4,000 and we had no borrowings outstanding. We continue to remain compliant with covenants and do not currently anticipate any events or circumstances that would impact our ability to access funds available on this facility. Refer to Note 20 to the Consolidated Financial Statements for further information on our \nDebt\n.\nOur financial position was as follows:\nAt December 31,\n2024\nAt December 31,\n2023\nCash and cash equivalents\n$\n3,619 \n$\n3,002 \nCash and cash equivalents included in assets held for sale\n (1)\n45 \n— \nAvailable borrowing capacity on revolving credit facilities\n (2)\n4,000 \n3,077 \nTotal liquidity\n$\n7,664 \n$\n6,079 \nNet debt\n (3)\n$\n5,308 \n$\n6,434 \n____________________________\n(1)\nDuring the first quarter of 2024, certain non-core assets were determined to meet the criteria for assets held for sale. As a result, the related \nCash and cash equivalents\n was reclassified to \nAssets held for sale\n. Refer to Note 3 to the Consolidated Financial Statements for additional information.\n103\nTable of Contents\n(2)\nIn connection with the Newcrest transaction, the Company acquired bilateral bank facilities that were repaid in full in the first quarter of 2024. Additionally, the revolving credit facility was amended in February 2024 to increase the available borrowing capacity to $4,000. Refer to Note 20 to the Consolidated Financial Statements for further information.\n(3)\nNet debt is a non-GAAP financial measure used by management to evaluate financial flexibility and strength of the Company's balance sheet. Refer to Non-GAAP Financial Measures below.\nCash Flows\nAt December 31,\n2024\nAt December 31,\n2023\nNet cash provided by (used in) operating activities of continuing operations\n$\n6,318 \n$\n2,754 \nNet cash provided by (used in) investing activities of continuing operations\n$\n(2,855)\n$\n(1,002)\nNet cash provided by (used in) financing activities\n$\n(2,953)\n$\n(1,603)\nNet cash provided by (used in) operating activities of continuing operations\n was $6,318 in 2024, an increase in cash provided of $3,564 from the year ended December 31, 2023, primarily due to the impact of sites acquired in the Newcrest transaction, which contributed $1,562 of cash provided by operating activities. Excluding the impact of the sites acquired in the Newcrest transaction, the increase in cash provided was primarily due to an increase in \nSales\n resulting from the reduction of sales in 2023 as a result of the Peñasquito labor strike and higher average realized gold prices in 2024. These inflows were partially offset by an increase in accounts receivable due to the timing of sales and shipments, and a payment of $291 made in the first quarter for stamp duty tax related to the Newcrest transaction. Refer to Consolidated Financial Results, above, for more information on our \nSales\n.\nNet cash provided by (used in) investing activities of continuing operations\n was $(2,855) in 2024, an increase in cash used of $1,853 from the year ended December 31, 2023, primarily due to lower net maturities of time deposits, higher capital expenditures in 2024, and cash acquired as a result of the Newcrest transaction in 2023, partially offset by the proceeds from the sale of the assets of Telfer in the fourth quarter of 2024. Refer to Note 3 to the Consolidated Financial Statements for further information on the Telfer sale.\nNet cash provided by (used in) financing activities\n was $(2,953) in 2024, an increase in cash used of $1,350 from the year ended December 31, 2023, primarily due to partial redemptions of certain senior notes and repurchases of common stock, partially offset by proceeds received from the issuance of debt and lower dividend payments in 2024. Refer to Note 20 to the Consolidated Financial Statements for additional information on our \nDebt\n transactions.\nCapital Resources\nIn February 2025, the Board declared a dividend of $0.25 per share. The declaration and payment of future dividends remains at the full discretion of the Board and will depend on the Company’s financial results, cash requirements, future prospects and other factors deemed relevant by the Board.\nIn February 2024, the Board of Directors authorized a stock repurchase program to repurchase shares of outstanding common stock to provide returns to stockholders, provided that the aggregate value of shares of common stock repurchased under the new program does not exceed $1 billion. The program will expire after 24 months (in February 2026). In October 2024, the Board of Directors authorized an additional $2 billion stock repurchase program to repurchase shares of outstanding common stock. The program will expire after 24 months (in October 2026). The programs will be executed at the Company’s discretion, utilizing open market repurchases to occur from time to time throughout the authorization period. The repurchase programs may be discontinued at any time, and the programs do not obligate the Company to acquire any specific number of shares of its common stock or to repurchase the full authorized amount during the authorization period. Consequently, the Board of Directors may revise or terminate such share repurchase authorization in the future. For the year ended December 31, 2024, we executed and settled trades totaling $1,246 of common stock repurchases under the previously authorized program.\nCapital Expenditures\nCash generated from operations is used to execute our capital priorities, which include sustaining and developing our global portfolio of long-lived assets. Our near-term development capital projects include Tanami Expansion 2, Ahafo North, and Cadia Panel Caves.\nThese projects are being funded from existing liquidity and will continue to be funded from future operating cash flows. Capital costs are estimated to be between $1,700 and $1,800 for Tanami Expansion 2 with an expected commercial production date in the second half of 2027. Capital costs are estimated to be between $950 and $1,050 for Ahafo North with an expected commercial production date in late 2025. Capital costs are estimated to be between $1,000 and $1,200 for the PC2-3 Cadia Panel Caves project with development capital costs expected to continue until the second half of 2026.\nWe consider sustaining capital as those capital expenditures that are necessary to maintain current production and execute the current mine plan. Capital expenditures to develop new operations or related to projects at existing operations, where these projects will enhance production or reserves, are considered non-sustaining or development capital. The Company’s decision to \n104\nTable of Contents\nreprioritize, sell or abandon a development project, which may include returning mining concessions to host governments, could result in a future impairment charge.\nThe Company continues to evaluate strategic priorities and deployment of capital to projects in the pipeline to ensure we execute on our capital priorities and provide long-term value to stockholders. Included in the Company's continuous evaluation is consideration of current market opportunities or pressures. In response, the Company has chosen to continue deferring the investment decision for the Yanacocha Sulfides project. With the delay of the Yanacocha Sulfides project, management will focus its efforts on optimizing its allocation of funds to current operations and other capital commitments, while also assessing execution options and project plans options, up to and including transitioning Yanacocha operations into full closure. Refer to Note 2 to the Consolidated Financial Statements for further discussion. Additionally, the Company has decided to reprioritize capital at Cerro Negro, shifting focus from ongoing underground mine life extension initiatives to surface infrastructure projects at Cerro Negro and other opportunities within its portfolio. \nFor the years ended December 31, 2024, 2023, and 2022 we had \nAdditions to property, plant and mine development\n as follows:\n2024\n2023\n2022\nDevelopment Projects\nSustaining Capital\nTotal\nDevelopment Projects\nSustaining Capital\nTotal\nDevelopment Projects\nSustaining Capital\nTotal\nBrucejack\n (1)\n$\n3 \n$\n67 \n$\n70 \n$\n1 \n$\n21 \n$\n22 \n$\n— \n$\n— \n$\n— \nRed Chris\n (1)\n90 \n60 \n150 \n16 \n9 \n25 \n— \n— \n— \nPeñasquito\n— \n129 \n129 \n— \n113 \n113 \n14 \n169 \n183 \nMerian\n— \n81 \n81 \n— \n84 \n84 \n— \n56 \n56 \nCerro Negro\n125 \n61 \n186 \n107 \n55 \n162 \n78 \n54 \n132 \nYanacocha\n39 \n22 \n61 \n288 \n24 \n312 \n416 \n23 \n439 \nBoddington\n— \n129 \n129 \n— \n164 \n164 \n6 \n66 \n72 \nTanami\n321 \n116 \n437 \n291 \n122 \n413 \n230 \n113 \n343 \nCadia\n (1)\n246 \n291 \n537 \n42 \n33 \n75 \n— \n— \n— \nLihir\n (1)\n89 \n104 \n193 \n2 \n51 \n53 \n— \n— \n— \nAhafo\n274 \n108 \n382 \n176 \n134 \n310 \n180 \n88 \n268 \nNGM\n97 \n351 \n448 \n138 \n334 \n472 \n78 \n230 \n308 \nCorporate and Other\n— \n22 \n22 \n8 \n43 \n51 \n15 \n30 \n45 \nHeld for sale \n(2)\nCC&V\n— \n26 \n26 \n— \n64 \n64 \n— \n44 \n44 \nMusselwhite\n— \n97 \n97 \n— \n104 \n104 \n1 \n53 \n54 \nPorcupine\n122 \n79 \n201 \n98 \n68 \n166 \n103 \n49 \n152 \nÉléonore\n— \n100 \n100 \n— \n106 \n106 \n6 \n54 \n60 \nAkyem\n1 \n23 \n24 \n3 \n37 \n40 \n4 \n30 \n34 \nDivested\n (3)\nTelfer\n (1)\n12 \n39 \n51 \n1 \n8 \n9 \n— \n— \n— \nAccrual basis\n$\n1,419 \n$\n1,905 \n$\n3,324 \n$\n1,171 \n$\n1,574 \n$\n2,745 \n$\n1,131 \n$\n1,059 \n$\n2,190 \nDecrease (increase) in non-cash adjustments\n78 \n(79)\n(59)\nCash basis \n$\n3,402 \n$\n2,666 \n$\n2,131 \n____________________________\n(1)\nSites acquired through the Newcrest transaction. Refer to Note 3 to the Consolidated Financial Statements for further information.\n(2)\nSites are classified as held for sale as of December 31, 2024. Refer to Note 3 to the Consolidated Financial Statements for further discussion of our assets and liabilities held for sale.\n(3)\nIn the fourth quarter of 2024, the Company completed the sale of the assets of the Telfer reportable segment. Refer to Note 3 to the Consolidated Financial Statements for further information.\nFor the year ended December 31, 2024, development projects primarily included Red Chris Block Caves, Pamour at Porcupine, Cerro Negro expansions projects, Yanacocha Sulfides, Tanami Expansion 2, Cadia Panel Caves, Phase 14A Wall construction at Lihir, Ahafo North, and the Goldrush Complex at NGM. Development capital costs (excluding capitalized interest) on our Tanami Expansion 2, Ahafo North, and Cadia Panel Caves projects since approval were $1,020, $616, and $248, respectively, of which $268, $241, and $212 related to the year ended December 31, 2024, respectively.\nFor the year ended December 31, 2023, development projects included Pamour at Porcupine, Cerro Negro expansion projects, Yanacocha Sulfides, Tanami Expansion 2, Cadia Panel Caves, Ahafo North, and the TS Solar Plant and Goldrush Complex at NGM.\n105\nTable of Contents\nFor the year ended December 31, 2022, development projects included Pamour at Porcupine, Yanacocha Sulfides, Cerro Negro expansion projects, Tanami Expansion 2 and Power Generation Civil Upgrade at Tanami, Ahafo North and Subika Mining Method Change at Ahafo, and Goldrush Complex and Turquoise Ridge 3rd Shaft at NGM.\nThe Company will from time to time enter into hedging relationships to mitigate variability in development capital spend denominated in foreign currency. In June 2024, the Company entered into A$1,126 of AUD-denominated fixed forward contracts, designated as foreign currency cash flow hedges, to mitigate variability in the USD functional cash flows related to the AUD-denominated capital expenditures expected to be incurred between October 2024 and December 2025, related to the construction and development phase of the Tanami Expansion 2, Cadia Panel Caves, and Cadia Tailings projects. The capital expenditures hedged for the Tanami Expansion 2 project under these fixed forward contracts will be for spend not covered by the A$574 hedges entered into in October 2022. In October 2022, the Company entered into A$574 of AUD-denominated fixed forward contracts, designated as foreign currency cash flow hedges, to mitigate variability in the USD functional cash flows related to the AUD-denominated capital expenditures expected to be incurred in 2023 and 2024 during the construction and development phase of the Tanami Expansion 2 project. Refer to Note 14 to the Consolidated Financial Statements for further information.\nFor the years ended December 31, 2024, 2023, and 2022, sustaining capital includes capital expenditures such as tailings facility construction, underground and surface mine development, capital component purchases, mining equipment, reserves drilling conversion, and infrastructure improvements. Additionally, for the year ended December 31, 2023, sustaining capital included haul truck purchases for the Autonomous Haulage System at Boddington. The Company currently expects to incur higher annual sustaining capital spend over the next few years at our ongoing operations, excluding those operations that are designated as held for sale, relative to historical amounts as we continue to advance the critical tailings work at Cadia and strengthen operating efficiency across our portfolio.\nFor the years ended December 31, 2024, 2023, and 2022, drilling and related costs capitalized and included in mine development costs were as follows:\nYear Ended December 31,\n2024\n2023\n2022\nTanami\n$\n61 \n$\n65 \n$\n60 \nNGM\n19 \n33 \n27 \nAhafo\n14 \n5 \n9 \nMerian\n4 \n1 \n5 \nÉléonore\n (1)\n2 \n3 \n6 \nMusselwhite\n (1)\n1 \n3 \n4 \nCerro Negro\n— \n13 \n23 \nPorcupine\n (1)\n— \n4 \n7 \nAkyem\n (1)\n— \n2 \n— \nPeñasquito\n— \n1 \n— \nYanacocha\n— \n— \n3 \n$\n101 \n$\n130 \n$\n144 \n____________________________\n(1)\nSites are classified as held for sale as of December 31, 2024. Refer to Note 3 to the Consolidated Financial Statements for further discussion of our assets and liabilities held for sale.\nDuring 2024, 2023, and 2022, $74, $69, and $11, respectively, of pre-stripping costs were capitalized and included in mine development costs.\nRefer to Note 4 to our Consolidated Financial Statements and Non-GAAP Financial Measures, \"All-In Sustaining Costs\", below, for further information.\nDebt\nDebt and Corporate Revolving Credit Facilities.\n The Company from time to time will redeem its outstanding senior notes ahead of their scheduled maturity dates utilizing \nCash and cash equivalents. \nAdditionally, depending upon market conditions and strategic considerations, we may choose to refinance debt in the capital markets.\nAt December 31, 2024, our future debt maturities of $8,791 of which $928 has been classified as current based on intent to redeem in the next 12 months. We generally expect to be able to fund maturities of debt from \nNet cash provided by (used in) operating activities\n, existing cash balances and available credit facilities.\nIn connection with the Newcrest transaction, the Company acquired bilateral bank debt facilities held with 13 banks. The bilateral bank debt facilities had a total borrowing capacity of $2,000, of which $1,923 was outstanding at December 31, 2023, and \n106\nTable of Contents\n$462 due February 7, 2024, $769 due March 1, 2024, and $692 due March 1, 2026. On February 7, 2024, the Company repaid $462 of the amount outstanding.\nOn February 15, 2024, the Company completed an amendment and restatement of its existing $3,000 revolving credit agreement dated as of April 4, 2019 (the “Existing Credit Agreement”). The Existing Credit Agreement was entered into with a syndicate of financial institutions and provided for borrowings in U.S. dollars and contained a letter of credit sub-facility. Per the amendment, the expiration date of the credit facility was extended from March 30, 2026 to February 15, 2029 and the borrowing capacity was increased to $4,000. Interest is based on Term SOFR plus a credit spread adjustment and margin.\nOn February 20, 2024, the Company completed a drawdown on the $4,000 revolving credit agreement and used the proceeds thereof to repay the remaining $1,461 owed on the remaining bilateral bank debt facilities.\nIn March 2024, we issued $2,000 of unsecured Senior Notes comprised of $1,000 due March 30, 2026 (“2026 Senior Notes”) and $1,000 due March 30, 2034 (\"2034 Senior Notes\"). Net proceeds from the 2026 and 2034 Senior Notes were $1,980, which were used to fully repay the drawdown on the revolving credit facility. Interest will be paid semi-annually at a rate of 5.30% and 5.35% per annum for the 2026 and the 2034 Senior Notes, respectively.\nIn 2024, the Company redeemed an aggregate amount of $483 of certain Senior Notes, resulting in a gain on extinguishment of $38, partially offset by the acceleration of $6 loss from \nAccumulated other comprehensive income (loss) \nrelated to the previously terminated interest rate cash flow hedges,\n \nrecognized in \nOther income (loss), net\n for the year ended December 31, 2024. \nIn February 2025, the Company fully redeemed all of the outstanding 2026 Senior Notes for a redemption price of $957. The redemption price equaled the principal amount of the outstanding 2026 Senior Notes of $928 plus accrued and unpaid interest of $19 in accordance with the terms of the 2026 Notes, and a make-whole provision of $10.\nRefer to Note 20 to the Consolidated Financial Statements for more information.\nDebt Covenants\nOur senior notes and revolving credit facilities contain various covenants and default provisions including payment defaults, limitation on liens, leases, sales and leaseback agreements and merger restrictions. Furthermore, our senior notes and corporate revolving credit facility contain covenants that include, limiting the sale of all or substantially all of our assets, certain change of control provisions and a negative pledge on certain assets.\nThe corporate revolving credit facility contains a financial ratio covenant requiring us to maintain a net debt (total debt net of \nCash and cash equivalents\n) to total capitalization ratio of less than or equal to 62.50% in addition to the covenants noted above.\nAt December 31, 2024, we were in compliance with all existing debt covenants and provisions related to potential defaults.\nLetters of Credit and Other Guarantees \nWe have off-balance sheet arrangements of $2,086 of outstanding surety bonds, bank letters of credit and bank guarantees (refer to Note 25 to the Consolidated Financial Statements). At December 31, 2024, none of the $4,000 corporate revolving credit facility was used to secure the issuance of letters of credit. Refer to Note 20 to the Consolidated Financial Statements for additional information.\nCo-Issuer and Supplemental Guarantor Information\nThe Company filed a shelf registration statement with the SEC on Form S-3 under the Securities Act, of 1933, as amended, which enables us to issue an indeterminate number or amount of common stock, preferred stock, depository shares, debt securities, guarantees of debt securities, warrants and units (the “Shelf Registration Statement”). Under the Shelf Registration Statement, our debt securities may be guaranteed by Newmont USA Limited (“Newmont USA”), one of our consolidated subsidiaries.\nNewmont and Newcrest Finance, as issuers, and Newmont USA, as guarantor, are collectively referred to herein as the \"Obligor Group\".\nThese guarantees are full and unconditional, and none of our other subsidiaries guarantee any security issued and outstanding. The cash provided by operations of the Obligor Group, and all of its subsidiaries, is available to satisfy debt repayments as they become due, and there are no material restrictions on the ability of the Obligor Group to obtain funds from subsidiaries by dividend, loan, or otherwise, except to the extent of any rights, noncontrolling interests, foreign currency or regulatory restrictions limiting repatriation of cash. Net assets attributable to noncontrolling interests were $181 at December 31, 2024. All noncontrolling interests relate to non-guarantor subsidiaries.\nNewmont and Newmont USA are primarily holding companies with no material operations, sources of income or assets other than equity interest in their subsidiaries and intercompany receivables or payables. Newcrest Finance is a finance subsidiary with no material assets or operations other than those related to issued external debt. Newmont USA’s primary investments are comprised of \n107\nTable of Contents\nits 38.5% interest in NGM. For further information regarding these and our other operations, refer to Note 4 to the Consolidated Financial Statements and Results of Consolidated Operations within Part II, Item 7, MD&A.\nIn addition to equity interests in subsidiaries, the Obligor Group’s balance sheets consisted primarily of the following intercompany assets, intercompany liabilities, and external debt. The remaining assets and liabilities of the Obligor Group are considered immaterial at December 31, 2024.\nDecember 31, 2024\nObligor Group\nNewmont USA\nCurrent intercompany assets\n$\n19,387 \n$\n12,147 \nNon-current intercompany assets\n$\n531 \n$\n470 \nCurrent intercompany liabilities\n$\n19,964 \n$\n1,564 \nCurrent external debt\n$\n924 \n$\n— \nNon-current external debt\n$\n7,546 \n$\n— \nNewmont USA's subsidiary guarantees (the “subsidiary guarantees”) are general unsecured senior obligations of Newmont USA and rank equal in right of payment to all of Newmont USA's existing and future senior unsecured indebtedness and senior in right of payment to all of Newmont USA's future subordinated indebtedness. The subsidiary guarantees are effectively junior to any secured indebtedness of Newmont USA to the extent of the value of the assets securing such indebtedness.\nAt December 31, 2024, Newmont USA had approximately $8,470 of consolidated indebtedness (including guaranteed debt), all of which relates to the guarantees of indebtedness of Newmont.\nUnder the terms of the subsidiary guarantees, holders of Newmont’s securities subject to such subsidiary guarantees will not be required to exercise their remedies against Newmont before they proceed directly against Newmont USA.\nNewmont USA will be released and relieved from all its obligations under the subsidiary guarantees in certain specified circumstances, including, but not limited to, the following:\n•\nupon the sale or other disposition (including by way of consolidation or merger), in one transaction or a series of related transactions, of a majority of the total voting power of the capital stock or other interests of Newmont USA (other than to Newmont or any of Newmont’s affiliates);\n•\nupon the sale or disposition of all or substantially all the assets of Newmont USA (other than to Newmont or any of Newmont’s affiliates); or\n•\nupon such time as Newmont USA ceases to guarantee more than $75 aggregate principal amount of Newmont’s debt (at December 31, 2024, Newmont USA guaranteed $600 aggregate principal amount of debt of Newmont that did not contain a similar fall-away provision).\nNewmont’s debt securities are effectively junior to any secured indebtedness of Newmont to the extent of the value of the assets securing such indebtedness, and structurally subordinated to all debt and other liabilities of Newmont’s non-guarantor subsidiaries. At December 31, 2024, (i) Newmont’s total consolidated indebtedness was approximately $8,972, none of which was secured (other than $496 of \nLease and other financing obligations\n), and (ii) Newmont’s non-guarantor subsidiaries had $8,867 of total liabilities (including trade payables, but excluding intercompany, external debt, and reclamation and remediation liabilities), which would have been structurally senior to Newmont’s debt securities.\nFor further information on our debt, refer to Note 20 to the Consolidated Financial Statements.\n108\nTable of Contents\nContractual Obligations\nOur contractual obligations at December 31, 2024 are summarized as follows:\nPayments Due by Period\nContractual Obligations\nTotal\nCurrent\nNon-Current\nDebt\n (1)\n$\n13,271 \n$\n1,321 \n$\n11,950 \nFinance lease and other financing obligations\n (2)\n661 \n117 \n544 \nRemediation and reclamation liabilities\n (3)\n11,613 \n1,042 \n10,571 \nEmployee-related benefits\n (4)\n974 \n236 \n738 \nUncertain income tax liabilities and interest\n (5)\n125 \n— \n125 \nOperating leases and other obligations\n (6)\n99 \n20 \n79 \nMinimum royalty payments\n (7)\n61 \n48 \n13 \nPurchase obligations\n (8)\n1,233 \n441 \n792 \nOther\n (9)\n517 \n223 \n294 \n$\n28,554 \n$\n3,448 \n$\n25,106 \n____________________________\n(1)\nDebt includes principal of $8,791 on Senior Notes and estimated interest payments of $4,480 on Senior Notes, assuming no early extinguishment.\n(2)\nFinance lease and other financing obligations includes finance lease payments of $658 and additional payments of $3 for finance leases that have not yet commenced.\n(3)\nMining operations are subject to extensive environmental regulations in the jurisdictions in which they operate. Pursuant to environmental regulations, we are required to close our operations and reclaim and remediate the lands that operations have disturbed. The estimated undiscounted cash outflows of these \nReclamation and remediation liabilities\n are reflected here. For more information regarding reclamation and remediation liabilities, refer to Note 6 to the Consolidated Financial Statements.\n(4)\nContractual obligations for \nEmployee-related benefit\ns include severance, workers’ participation, pension and other benefit plans. Pension plan and other benefit payments beyond 2034 cannot be reasonably estimated given variable market conditions and actuarial assumptions and are not included.\n(5)\nWe are unable to reasonably estimate the timing of our uncertain income tax liabilities and interest payments due to uncertainties in the timing of the effective settlement of tax positions.\n(6)\nOperating lease and other obligations includes operating lease payments of $99 and additional payments of $— for operating leases that have not yet commenced.\n(7)\nMinimum royalty payments are related to continuing operations and are presented net of recoverable amounts.\n(8)\nPurchase obligations are not recorded in the Consolidated Financial Statements. Purchase obligations represent contractual obligations for purchase of power, materials and supplies, consumables, inventories and capital projects.\n(9)\nOther includes service contracts and other obligations not recorded in our Consolidated Financial Statements, as well as the obligation related to the funding of Barrick's portion of pre-feasibility costs associated with Norte Abierto deferred payment obligations accrued in \nOther current liabilities\n and \nOther non-current liabilities\n.\nEnvironmental\nOur mining and exploration activities are subject to various federal and state laws and regulations governing the protection of the environment. We have made, and expect to make in the future, expenditures to comply with such laws and regulations, but cannot predict the full amount of such future expenditures. We perform a comprehensive review of our reclamation and remediation liabilities annually and review changes in facts and circumstances associated with these obligations at least quarterly. Newmont is committed to the implementation of the GISTM and the disclosure of implementation status for tailings facilities by August 2025. Conformance with the GISTM is on-going and has and may continue to result in further increases to our estimated sustaining costs and closure costs for existing operations and non-operating sites. Additionally, laws, regulations and permit requirements focused on water management and discharge requirements for operations and water treatment in connection with closure are becoming increasingly stringent. Compliance with water management and discharge quality remains dynamic and has and may continue to result in further increases to our estimated closure costs. \nAt December 31, 2024 and 2023, $7,015 and $8,385, respectively, were accrued for reclamation costs relating to currently or recently producing or development stage mineral properties, of which $928 and $558, respectively, were classified as current liabilities.\nIn addition, we are involved in several matters concerning environmental obligations associated with former, primarily historical, mining activities. Based upon our best estimate of our liability for these matters, $370 and $401 were accrued for such obligations at December 31, 2024 and 2023, respectively, of which $63 and $61, respectively, were classified as current liabilities. We spent $82, $44, and $56 during 2024, 2023, and 2022, respectively, for environmental obligations related to the former mining activities.\nReclamation and remediation adjustments during 2024 primarily related to decrease spend at portions of the Yanacocha site that are no longer in production and with no expected substantive economic value (i.e., non-operating) as a result of updated cost estimates. Newmont anticipates spending an average of $600 annually over the next two years on water treatment plants at \n109\nTable of Contents\nYanacocha, with expenditures expected to decline starting in 2027 upon project completion and in line with the regulatory compliance commitment. Yanacocha’s ongoing closure planning studies continue to address several complex closure issues, including water management, social impacts and tailings. The long-term water management solution under construction at Yanacocha will replace five existing water treatment facilities with two, addressing the watersheds along the continental divide.\nReclamation and remediation adjustments during 2023 primarily related to (i) increased water management costs at portions of our Yanacocha and Porcupine site operations that are non-operating (ii) increased costs due to closure plan design changes at our Porcupine site operations (iii) higher waste disposal costs and project execution delays at the Midnite mine and Dawn mill sites and (iv) higher estimated closure costs due to cost inflation.\nDuring the year ended December 31, 2024, 2023, and 2022, capital expenditures were approximately $35, $41, and $29, respectively, to comply with environmental regulations.\nOur sustainability strategy is a foundational element in achieving our purpose to create value and improve lives through sustainable and responsible mining. Sustainability and safety are integrated into the business at all levels of the organization through our global policies, standards, strategies, business plans and remuneration plans. For more information on the Company’s reclamation and remediation liabilities, refer to Notes 6 and 25 to the Consolidated Financial Statements. For discussion of regulatory, tailings, water, climate and other environmental risks, refer to Part I, Item 1A. Risk Factors, for additional information.\nForward-Looking Statements\nThe foregoing discussion and analysis, as well as certain information contained elsewhere in this Annual Report, contain “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, and are intended to be covered by the safe harbor created thereby. For a more detailed discussion of risks and other factors that might impact forward-looking statements and other important information about forward-looking statements, refer to the discussion in Forward-Looking Statements in Part I, Item 1, Business and Part I, Item 1A, Risk Factors.\nNon-GAAP Financial Measures\nNon-GAAP financial measures are intended to provide additional information only and do not have any standard meaning prescribed by GAAP. These measures should not be considered in isolation or as a substitute for measures of performance prepared in accordance with GAAP. Unless otherwise noted, we present the non-GAAP financial measures of our continuing operations in the tables below. For additional information regarding our discontinued operations, refer to Note 1 to the Consolidated Financial Statements.\nEarnings before interest, taxes and depreciation and amortization and Adjusted earnings before interest, taxes and depreciation and amortization\nManagement uses earnings before interest, taxes and depreciation and amortization (“EBITDA”) and EBITDA adjusted for non-core or certain items that have a disproportionate impact on our results for a particular period (“Adjusted EBITDA”) as non-GAAP measures to evaluate the Company’s operating performance. EBITDA and Adjusted EBITDA do not represent, and should not be considered an alternative to, net income (loss), operating income (loss), or cash flow from operations as those terms are defined by GAAP, and do not necessarily indicate whether cash flows will be sufficient to fund cash needs. Although Adjusted EBITDA and similar measures are frequently used as measures of operations and the ability to meet debt service requirements by other companies, our calculation of Adjusted EBITDA is not necessarily comparable to such other similarly titled captions of other companies. The Company believes that Adjusted EBITDA provides useful information to investors and others in understanding and evaluating our operating results in the same manner as our management and Board of Directors. Management’s determination of the components of Adjusted EBITDA are evaluated periodically and based, in part, on a review of non-GAAP financial measures used by mining industry analysts. \nNet income (loss) attributable to Newmont stockholders\n is reconciled to EBITDA and Adjusted EBITDA as follows:\n110\nTable of Contents\nYear Ended December 31,\n2024\n2023\n2022\nNet income (loss) attributable to Newmont stockholders\n$\n3,348 \n$\n(2,494)\n$\n(429)\nNet income (loss) attributable to noncontrolling interests\n33 \n27 \n60 \nNet (income) loss from discontinued operations\n (1)\n(68)\n(27)\n(30)\nEquity loss (income) of affiliates\n(133)\n(63)\n(107)\nIncome and mining tax expense (benefit)\n1,397 \n526 \n455 \nDepreciation and amortization\n2,576 \n2,108 \n2,185 \nInterest expense, net of capitalized interest\n375 \n243 \n227 \nEBITDA\n$\n7,528 \n$\n320 \n$\n2,361 \nAdjustments:\nLoss on assets held for sale\n (2)\n$\n1,114 \n$\n— \n$\n— \nImpairment charges\n (3)\n78 \n1,891 \n1,320 \nNewcrest transaction and integration costs\n (4)\n72 \n464 \n— \nReclamation and remediation charges\n (5)\n(71)\n1,260 \n713 \nChange in fair value of investments and options\n (6)\n(62)\n47 \n46 \nSettlement costs\n (7)\n44 \n7 \n22 \nRestructuring and severance\n (8)\n38 \n24 \n4 \n(Gain) loss on asset and investment sales\n (9)\n(35)\n197 \n(35)\nGain on debt extinguishment\n (10)\n(32)\n— \n— \nPension settlements \n(11)\n1 \n9 \n137 \nCOVID-19 specific costs\n (12)\n— \n1 \n3 \nOther\n (13)\n— \n(5)\n(21)\nAdjusted EBITDA\n$\n8,675 \n$\n4,215 \n$\n4,550 \n____________________________\n(1)\nFor additional information regarding our discontinued operations, refer to Note 1 to our Consolidated Financial Statements.\n(2)\nLoss on assets held for sale, included in \nLoss on assets held for sale\n, represents the loss recorded to recognize the six non-core assets and the development project designated as held for sale at the lower of carrying value or fair value in 2024. Refer to Note 3 of the Consolidated Financial Statements for further information.\n(3)\nImpairment charges, included in \nImpairment charges,\n represents non-cash write-downs of long-lived assets and goodwill. Refer to Note 7 to our Consolidated Financial Statements for further information.\n(4)\nNewcrest transaction and integration costs, included in \nOther expense, net\n, represents costs incurred related to Newmont's acquisition of Newcrest completed in 2023 as well as subsequent integration costs. For the year ended December 31, 2023, these costs primarily include $316 related to the stamp duty tax incurred in connection with the transaction.\n(5)\nReclamation and remediation charges, included in \nReclamation and remediation\n, represents revisions to the reclamation and remediation plans and cost estimates at the Company’s former operating properties and historic mining operations that have entered the closure phase and have no substantive future economic value. For additional information, refer to Note 6 in the Consolidated Financial Statements.\n(6)\nChange in fair value of investments and options, included in \nOther income (loss), net\n, primarily represents unrealized gains and losses related to the Company's investments in current and non-current marketable and other equity securities. For additional information regarding our investments, refer to Note 15 to our Consolidated Financial Statements.\n(7)\nSettlement costs, included in \nOther expense, net\n, primarily represents wind-down and demobilization costs related to the French Guiana project in 2024; costs related to additional employee related accruals as a result of the Australian Fair Work legislation in 2023; and a legal settlement and a voluntary contribution made to support humanitarian efforts in Ukraine in 2022.\n(8)\nRestructuring and severance, included in \nOther expense, net\n, primarily represents severance and related costs associated with significant organizational and operating model changes implemented by the Company for all periods presented.\n(9)\n(Gain) loss on asset and investment sales, included in \nOther income (loss), net\n, primarily represents the loss on the abandonment of the near-pit sizing and conveying system at Peñasquito, partially offset by the gain recognized on the sale of the Streaming Credit Facility Agreement (\"SCFA\") in 2024; the impairment loss on the abandonment of the pyrite leach plant at Peñasquito offset by the net gain recognized on the exchange of Maverix shares and warrants to Triple flag and the subsequent sale of Triple Flag shares in 2023; and gains recognized on the sale of the investment in Minera Agua Rica Alumbrera Limited (\"MARA\"), on disposal of trucks at Boddington, and the sale of royalty interests at NGM, partially offset by the loss recognized on the sale of the La Zanja equity method investment in 2022. For additional information, refer to Note 9 to our Consolidated Financial Statements.\n(10)\nGain on debt extinguishment, included in \nOther income (loss), net\n, primarily represents the net gain on the partial redemption of certain Senior Notes and losses on the debt tender offer and subsequent extinguishment of the 2023 Newmont Senior Notes in 2024. Refer to Note 20 to our Consolidated Financial Statements.\n(11)\nPension settlements, included in \nOther income (loss), net, \nprimarily represents pension settlement charges related to lump sum payments to participants in 2024, lump sum payments to participants in 2023, and the annuitization of certain defined benefit plans and lump sum payments to participants in 2022. Refer to Note 11 to our Consolidated Financial Statements for further information.\n(12)\nCOVID-19 specific costs, included in \nOther expense, net\n, primarily includes amounts distributed from Newmont Global Community Support Fund to help host communities, governments and employees combat the COVID-19 pandemic for all periods presented and includes incremental direct costs incurred as a result of actions taken to protect against the impacts of the COVID-19 pandemic. Refer to Note 8 to our Consolidated Financial Statements for further information.\n111\nTable of Contents\n(13)\nOther, included in \nOther income (loss), net\n, in 2023 represents income received during the first quarter of 2023 on the favorable settlement of certain matters that were outstanding at the time of sale of the related investment in 2022. Amounts related to 2022 are primarily comprised of a reimbursement of certain historical Goldcorp operational expenses related to a legacy project that reached commercial production in the second quarter of 2022 and penalty income from an energy vendor early terminating a contract in 2022.\nAdjusted Net Income (Loss)\nManagement uses Adjusted net income (loss) to evaluate the Company’s operating performance and for planning and forecasting future business operations. The Company believes the use of Adjusted net income (loss) allows investors and analysts to understand the results of the continuing operations of the Company and its direct and indirect subsidiaries relating to the sale of products, by excluding certain items that have a disproportionate impact on our results for a particular period. Adjustments to continuing operations are presented before tax and net of our partners’ noncontrolling interests, when applicable. The tax effect of adjustments is presented in the Tax effect of adjustments line and is calculated using the applicable tax rate. Management’s determination of the components of Adjusted net income (loss) are evaluated periodically and based, in part, on a review of non-GAAP financial measures used by mining industry analysts. \nNet income (loss) attributable to Newmont stockholders\n is reconciled to Adjusted net income (loss) as follows:\nYear Ended December 31, 2024\nper share data\n (1)\nbasic\ndiluted\nNet income (loss) attributable to Newmont stockholders\n$\n3,348 \n$\n2.92 \n$\n2.92 \nNet loss (income) attributable to Newmont stockholders from discontinued operations\n (2)\n(68)\n(0.06)\n(0.06)\nNet income (loss) attributable to Newmont stockholders from continuing operations\n3,280 \n2.86 \n2.86 \nLoss on assets held for sale\n (3)\n1,114 \n0.97 \n0.97 \nImpairment charges\n (4)\n78 \n0.07 \n0.07 \nNewcrest transaction and integration costs\n (5)\n72 \n0.06 \n0.06 \nReclamation and remediation charges\n (6)\n(71)\n(0.06)\n(0.06)\nChange in fair value of investments and options\n (7)\n(62)\n(0.05)\n(0.05)\nSettlement costs\n (8)\n44 \n0.04 \n0.04 \nRestructuring and severance\n (9)\n38 \n0.03 \n0.03 \n(Gain) loss on asset and investment sales\n (10)\n(35)\n(0.03)\n(0.03)\nGain on debt extinguishment\n (11)\n(32)\n(0.03)\n(0.03)\nPension settlements\n (12)\n1 \n— \n— \nTax effect of adjustments\n (13)\n(315)\n(0.27)\n(0.27)\nValuation allowance and other tax adjustments\n (14)\n(121)\n(0.11)\n(0.11)\nAdjusted net income (loss)\n$\n3,991 \n$\n3.48 \n$\n3.48 \nWeighted average common shares (millions):\n (15)\n1,146 \n1,148 \n____________________________\n(1)\nPer share measures may not recalculate due to rounding.\n(2)\nFor additional information regarding our discontinued operations, refer to Note 1 to our Consolidated Financial Statements.\n(3)\nLoss on assets held for sale, included in \nLoss on assets held for sale\n, represents the loss recorded to recognize the six non-core assets and the development project designated as held for sale at the lower of carrying value or fair value in 2024. Refer to Note 3 of the Consolidated Financial Statements for further information.\n(4)\nImpairment charges, included in \nImpairment charges,\n represents non-cash write-downs of long-lived assets. Refer to Note 7 to our Consolidated Financial Statements for further information.\n(5)\nNewcrest transaction and integration costs, included in \nOther expense, net\n, represents costs incurred related to Newmont's acquisition of Newcrest completed in 2023 as well as subsequent integration costs.\n(6)\nReclamation and remediation charges, net, included in \nReclamation and remediation\n, represents revisions to the reclamation and remediation plans and cost estimates at the Company’s former operating properties and historic mining operations that have entered the closure phase and have no substantive future economic value. Refer to Note 6 to our Consolidated Financial Statements for further information.\n(7)\nChange in fair value of investments and options, included in \nOther income (loss), net\n, primarily represents unrealized gains and losses related to the Company's investment in current and non-current marketable and other equity securities. For additional information regarding our investments, refer to Note 15 to our Consolidated Financial Statements.\n(8)\nSettlement costs, included in \nOther expense, net\n, primarily represents wind-down and demobilization costs related to the French Guiana project.\n(9)\nRestructuring and severance, included in \nOther expense, net\n, primarily represents severance and related costs associated with significant organizational and operating model changes implemented by the Company.\n(10)\n(Gain) loss on asset and investment sales, included in \nOther income (loss), net\n, primarily represents the loss on the abandonment of the near-pit sizing and conveying system at Peñasquito, partially offset by the gain recognized on the sale of the Streaming Credit Facility Agreement (\"SCFA\") in 2024. For additional information, refer to Note 9 to our Consolidated Financial Statements.\n112\nTable of Contents\n(11)\nGain on debt extinguishment, included in \nOther income (loss), net\n, primarily represents the net gain on the partial redemption of certain Senior Notes and losses on the debt tender offer and subsequent extinguishment of the 2023 Newmont Senior Note in 2024. Refer to Note 20 to our Consolidated Financial Statements.\n(12)\nPension settlements, included in \nOther income (loss), net,\n primarily represents pension settlement charges related to lump sum payments to participants. Refer to Note 11 to our Consolidated Financial Statements for further information.\n(13)\nThe tax effect of adjustments, included in \nIncome and mining tax benefit (expense)\n, represents the tax effect of adjustments in footnotes (3) through (12), as described above, and are calculated using the applicable tax rate.\n(14)\nValuation allowance and other tax adjustments, included in \nIncome and mining tax benefit (expense)\n, is recorded for items such as foreign tax credits, alternative minimum tax credits, capital losses, disallowed foreign losses, and the effects of changes in foreign currency exchange rates on deferred tax assets and deferred tax liabilities. The adjustment reflects the net increase or (decrease) to net operating losses, capital losses, tax credit carryovers, and other deferred tax assets subject to valuation allowance of $(302), the effects of changes in foreign exchange rates on deferred tax assets and liabilities of $(30), net reductions to the reserve for uncertain tax positions of $(63), recording of a deferred tax liability for the outside basis difference at Akyem of $49 due to the status change to held for sale, and other tax adjustments of $225.\n(15)\nAdjusted net income (loss) per diluted share is calculated using diluted common shares, which are calculated in accordance with GAAP.\nYear Ended December 31, 2023\nper share data\n (1)\nbasic\ndiluted\nNet income (loss) attributable to Newmont stockholders\n$\n(2,494)\n$\n(2.97)\n$\n(2.97)\nNet loss (income) attributable to Newmont stockholders from discontinued operations\n (2)\n(27)\n(0.03)\n(0.03)\nNet income (loss) attributable to Newmont stockholders from continuing operations\n (3)\n(2,521)\n(3.00)\n(3.00)\nImpairment charges, net\n (4)\n1,888 \n2.25 \n2.25 \nReclamation and remediation charges\n (5)\n1,260 \n1.50 \n1.50 \nNewcrest transaction and integration costs\n (6)\n464 \n0.56 \n0.56 \n(Gain) loss on asset and investment sales\n (7)\n197 \n0.23 \n0.23 \nChange in fair value of investments\n (8)\n47 \n0.05 \n0.05 \nRestructuring and severance\n (9)\n24 \n0.03 \n0.03 \nPension settlements\n (10)\n9 \n0.01 \n0.01 \nSettlement costs\n (11)\n7 \n0.01 \n0.01 \nCOVID-19 specific costs\n (12)\n1 \n— \n— \nOther\n (13)\n(5)\n— \n— \nTax effect of adjustments\n (14)\n(613)\n(0.73)\n(0.73)\nValuation allowance and other tax adjustments\n (15)\n566 \n0.66 \n0.66 \nAdjusted net income (loss)\n$\n1,324 \n$\n1.57 \n$\n1.57 \nWeighted average common shares (millions):\n (3)\n841 \n841 \n____________________________\n(1)\nPer share measures may not recalculate due to rounding.\n(2)\nFor additional information regarding our discontinued operations, refer to Note 1 to our Consolidated Financial Statements.\n(3)\nAdjusted net income (loss) per diluted share is calculated using diluted common shares, which are calculated in accordance with GAAP. For the year ended December 31, 2023, potentially dilutive shares, which were insignificant, were excluded from the computation of diluted loss per common share attributable to Newmont stockholders in the Consolidated Statement of Operations as they were antidilutive. These shares were included in the computation of adjusted net income per diluted share for the year ended December 31, 2023.\n(4)\nImpairment charges, net, included in \nImpairment charges\n represents non-cash write-downs of long-lived assets and goodwill. Refer to Note 7 to our Consolidated Financial Statements for further information. Amount is presented net of pre-tax income (loss) attributable to noncontrolling interests of $(3).\n(5)\nReclamation and remediation charges, included in \nReclamation and remediation\n, represents revisions to the reclamation and remediation plans and cost estimates at the Company’s former operating properties and historic mining operations that have entered the closure phase and have no substantive future economic value. Refer to Note 6 to our Consolidated Financial Statements for further information.\n(6)\nNewcrest transaction and integration costs, included in \nOther expense, net\n, represents costs incurred related to Newmont's acquisition of Newcrest completed in 2023 as well as subsequent integration costs. These costs primarily include $316 in relation to the stamp duty tax incurred in connection with the transaction.\n(7)\n(Gain) loss on asset and investment sales, included in \nOther income (loss), net\n, primarily represents the loss on the abandonment of the pyrite leach plant at Peñasquito offset by the net gain recognized on the exchange of Maverix shares and warrants to Triple flag and the subsequent sale of Triple Flag shares. For additional information, refer to Note 9 to our Consolidated Financial Statements.\n(8)\nChange in fair value of investments, included in \nOther income (loss), net\n, primarily represents unrealized gains and losses related to the Company's investment in current and non-current marketable and other equity securities. For additional information regarding our investments, refer to Note 15 to our Consolidated Financial Statements.\n(9)\nRestructuring and severance, included in \nOther expense, net\n, primarily represents severance and related costs associated with significant organizational and operating model changes implemented by the Company.\n(10)\nPension settlements, included in \nOther income (loss), net,\n represents pension settlement charges related to lump sum payments to participants. Refer to Note 11 to our Consolidated Financial Statements for further information.\n113\nTable of Contents\n(11)\nSettlement costs, included in \nOther expense, net\n, primarily represents costs related to additional employee related accruals as a result of the Australian Fair Work legislation.\n(12)\nCOVID-19 specific costs, included in \nOther expense, net\n, represents amounts distributed from the Newmont Global Community Fund to help host communities, governments and employees combat the COVID-19 pandemic. Adjusted net income (loss) has not been adjusted for $1 of incremental COVID-19 costs incurred as a result of actions taken to protect against the impacts of the COVID-19 pandemic at our operational sites. Refer to Note 8 to our Consolidated Financial Statements for further information.\n(13)\nOther, included in \nOther income (loss), net\n, primarily represents income received during the first quarter of 2023 on the favorable settlement of certain matters that were outstanding at the time of sale of the related investment in 2022.\n(14)\nThe tax effect of adjustments, included in \nIncome and mining tax benefit (expense)\n, represents the tax effect of adjustments in footnotes (4) through (13), as described above, and are calculated using the applicable tax rate.\n(15)\nValuation allowance and other tax adjustments, included in \nIncome and mining tax benefit (expense)\n, is recorded for items such as foreign tax credits, alternative minimum tax credits, capital losses, disallowed foreign losses, and the effects of changes in foreign currency exchange rates on deferred tax assets and deferred tax liabilities. The adjustment reflects the net increase or (decrease) to net operating losses, capital losses, tax credit carryovers, and other deferred tax assets subject to valuation allowance of $357, the effects of changes in foreign exchange rates on deferred tax assets and liabilities of $(3), net removal to the reserve for uncertain tax positions of $(28), and other tax adjustments of $240.\nYear Ended December 31, 2022\nper share data\n (1)\nbasic\ndiluted\nNet income (loss) attributable to Newmont stockholders\n$\n(429)\n$\n(0.54)\n$\n(0.54)\nNet loss (income) attributable to Newmont stockholders from discontinued operations\n (2)\n(30)\n(0.04)\n(0.04)\nNet income (loss) attributable to Newmont stockholders from continuing operations\n (3)\n(459)\n(0.58)\n(0.58)\nImpairment charges\n (4)\n1,320 \n1.66 \n1.66 \nReclamation and remediation charges\n (5)\n713 \n0.90 \n0.90 \nPension settlements\n (6)\n137 \n0.17 \n0.17 \nChange in fair value of investments\n (7)\n46 \n0.06 \n0.06 \nGain on asset and investment sales\n (8)\n(35)\n(0.04)\n(0.04)\nSettlement costs\n (9)\n22 \n0.03 \n0.03 \nRestructuring and severance\n (10)\n4 \n0.01 \n0.01 \nCOVID-19 specific costs\n (11)\n3 \n— \n— \nOther\n (12)\n(21)\n(0.03)\n(0.03)\nTax effect of adjustments\n (13)\n(344)\n(0.44)\n(0.44)\nValuation allowance and other tax adjustments\n (14)\n82 \n0.11 \n0.11 \nAdjusted net income (loss)\n$\n1,468 \n$\n1.85 \n$\n1.85 \nWeighted average common shares (millions):\n (3)\n794 \n795 \n____________________________\n(1)\nPer share measures may not recalculate due to rounding.\n(2)\nFor additional information regarding our discontinued operations, refer to Note 1 to our Consolidated Financial Statements.\n(3)\nAdjusted net income (loss) per diluted share is calculated using diluted common shares, which are calculated in accordance with GAAP. For the year ended December 31, 2022, potentially dilutive shares of 1 million were excluded from the computation of diluted loss per common share attributable to Newmont stockholders in the Consolidated Statement of Operations as they were antidilutive. These shares were included in the computation of adjusted net income per diluted share for the year ended December 31, 2022.\n(4)\nImpairment charges, included in \nImpairment charges\n represents non-cash write-downs of long-lived assets and goodwill. Refer to Note 7 to our Consolidated Financial Statements for further information.\n(5)\nReclamation and remediation charges, included in \nReclamation and remediation\n, represent revisions to reclamation and remediation plans and cost estimates at the Company’s former operating properties and historic mining operations that have entered the closure phase and have no substantive future economic value. Refer to Note 6 to our Consolidated Financial Statements for further information.\n(6)\nPension settlements, included in \nOther income (loss), net,\n represents pension settlement charges related to the annuitization of certain defined benefit plans. Refer to Note 11 to our Consolidated Financial Statements for further information.\n(7)\nChange in fair value of investments, included in \nOther income (loss), net\n, primarily represents unrealized gains and losses related to the Company's investment in current and non-current marketable and other equity securities. For additional information regarding our investments, refer to Note 15 to our Consolidated Financial Statements.\n(8)\n(Gain) loss on asset and investment sales, included in \nOther income (loss), net\n, primarily represents gains recognized on the sale of the investment in MARA, disposal of trucks at Boddington, and the sale of royalty interests at NGM, partially offset by the loss recognized on the sale of the La Zanja equity method investment. For additional information, refer to Note 9 to our Consolidated Financial Statements.\n(9)\nSettlement costs, included in \nOther expense, net\n, primarily represents a legal settlement and a voluntary contribution made to support humanitarian efforts in Ukraine.\n(10)\nRestructuring and severance, included in \nOther expense, net\n, primarily represents severance and related costs associated with significant organizational and operating model changes implemented by the Company.\n(11)\nCOVID-19 specific costs, included in \nOther expense, net\n, represents amounts distributed from the Newmont Global Community Fund to help host communities, governments and employees combat the COVID-19 pandemic. Adjusted net income (loss) has not been adjusted for $35 of \n114\nTable of Contents\nincremental COVID-19 costs incurred as a result of actions taken to protect against the impacts of the COVID-19 pandemic at our operational sites. Refer to Note 8 to our Consolidated Financial Statements for further information.\n(12)\nOther, included \nOther income (loss), net\n, primarily represents a $11 reimbursement of certain historical Goldcorp operational expenses related to a legacy project that reached commercial production in the second quarter of 2022 and $7 of penalty income from an energy vendor early terminating a contract in 2022.\n(13)\nThe tax effect of adjustments, included in \nIncome and mining tax benefit (expense)\n, represents the tax effect of adjustments in footnotes (4) through (12), as described above, and are calculated using the applicable tax rate.\n(14)\nValuation allowance and other tax adjustments, included in \nIncome and mining tax benefit (expense)\n, is recorded for items such as foreign tax credits, alternative minimum tax credits, capital losses, disallowed foreign losses, and the effects of changes in foreign currency exchange rates on deferred tax assets and deferred tax liabilities. The adjustment reflects the net increase or (decrease) to net operating losses, capital losses, tax credit carryovers, and other deferred tax assets subject to valuation allowance of $246, the expiration of U.S. foreign tax credit carryovers of $31, the effects of changes in foreign exchange rates on deferred tax assets and liabilities of $(86), net removal to the reserve for uncertain tax positions of $(8), a tax settlement in Mexico of $(125) and other tax adjustments of $24. Total amount is presented net of income (loss) attributable to noncontrolling interests of $82.\nFree Cash Flow\nManagement uses Free Cash Flow as a non-GAAP measure to analyze cash flows generated from operations. Free Cash Flow is \nNet cash provided by (used in) operating activities\n less \nNet cash provided by (used in) operating activities of discontinued operations\n less \nAdditions to property, plant and mine development\n as presented on the Consolidated Statements of Cash Flows. The Company believes Free Cash Flow is also useful as one of the bases for comparing the Company’s performance with its competitors. Although Free Cash Flow and similar measures are frequently used as measures of cash flows generated from operations by other companies, the Company’s calculation of Free Cash Flow is not necessarily comparable to such other similarly titled captions of other companies.\nThe presentation of non-GAAP Free Cash Flow is not meant to be considered in isolation or as an alternative to net income as an indicator of the Company’s performance, or as an alternative to cash flows from operating activities as a measure of liquidity as those terms are defined by GAAP, and does not necessarily indicate whether cash flows will be sufficient to fund cash needs. The Company’s definition of Free Cash Flow is limited in that it does not represent residual cash flows available for discretionary expenditures due to the fact that the measure does not deduct the payments required for debt service and other contractual obligations or payments made for business acquisitions. Therefore, the Company believes it is important to view Free Cash Flow as a measure that provides supplemental information to the Company’s Consolidated Statements of Cash Flows.\nThe following table sets forth a reconciliation of Free Cash Flow, a non-GAAP financial measure, to \nNet cash provided by (used in) operating activities\n, which the Company believes to be the GAAP financial measure most directly comparable to Free Cash Flow, as well as information regarding \nNet cash provided by (used in) investing activities\n and \nNet cash provided by (used in) financing activities.\nYear Ended December 31,\n2024\n2023\n2022\nNet cash provided by (used in) operating activities\n$\n6,363 \n$\n2,763 \n$\n3,220 \nLess: Net cash used in (provided by) operating activities of discontinued operations\n(45)\n(9)\n(22)\nNet cash provided by (used in) operating activities of continuing operations\n6,318 \n2,754 \n3,198 \nLess: Additions to property, plant and mine development\n(3,402)\n(2,666)\n(2,131)\nFree Cash Flow\n$\n2,916 \n$\n88 \n$\n1,067 \nNet cash provided by (used in) investing activities\n (1)\n$\n(2,702)\n$\n(1,002)\n$\n(2,983)\nNet cash provided by (used in) financing activities\n$\n(2,953)\n$\n(1,603)\n$\n(2,356)\n____________________________\n(1)\nNet cash provided by (used in) investing activities \nincludes\n Additions to property, plant and mine development,\n which is included in the Company’s computation of Free Cash Flow.\nNet Debt\nManagement uses Net Debt to measure the Company’s liquidity and financial position. Net Debt is calculated as \nDebt\n and \nLease and other financing obligations\n less \nCash and cash equivalents\n, as presented on the Consolidated Balance Sheets. \nCash and cash equivalents\n are subtracted from \nDebt\n and \nLease and other financing obligations \nas these could be used to reduce the Company's debt obligations. The Company believes the use of Net Debt allows investors and others to evaluate financial flexibility and strength of the Company's balance sheet. Net Debt is intended to provide additional information only and does not have any standardized meaning prescribed by GAAP and should not be considered in isolation or as a substitute for measures of liquidity prepared in accordance with GAAP. Other companies may calculate this measure differently. \nThe following table sets forth a reconciliation of Net Debt, a non-GAAP financial measure, to \nDebt\n and \nLease and other financing obligations\n, which the Company believes to be the GAAP financial measures most directly comparable to Net Debt.\n115\nTable of Contents\nAt December 31, 2024\nAt December 31, 2023\nDebt\n$\n8,476 \n$\n8,874 \nLease and other financing obligations\n496 \n562 \nLess: Cash and cash equivalents\n(3,619)\n(3,002)\nLess: Cash and cash equivalents included in assets held for sale\n (1)\n(45)\n— \nNet debt\n$\n5,308 \n$\n6,434 \n____________________________\n(1)\nDuring the first quarter of 2024, certain non-core assets were determined to meet the criteria for assets held for sale. As a result, the related \nCash and cash equivalents \nwas reclassified to \nAssets held for sale\n. Refer to Note 3 to the Consolidated Financial Statements for additional information.\nCosts Applicable to Sales per Ounce/Gold Equivalent Ounce\nCosts applicable to sales\n per ounce/gold equivalent ounce are non-GAAP financial measures. These measures are calculated by dividing the costs applicable to sales of gold and other metals by gold ounces or gold equivalent ounces sold, respectively. These measures are calculated for the periods presented on a consolidated basis. We believe that these measures provide additional information to management, investors and others that aids in the understanding of the economics of our operations and performance compared to other producers and provides investors visibility into the direct and indirect costs related to production, excluding depreciation and amortization, on a per ounce/gold equivalent ounce basis. Costs applicable to sales per ounce/gold equivalent ounce statistics are intended to provide additional information only and do not have any standardized meaning prescribed by GAAP and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with GAAP. The measures are not necessarily indicative of operating profit or cash flow from operations as determined under GAAP. Other companies may calculate these measures differently.\nThe following tables reconcile these non-GAAP measures to the most directly comparable GAAP measures.\nGold\n (1)\nGEO\n (2)\nYear Ended December 31,\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\nCosts applicable to sales\n (3)\n$\n7,364 \n$\n5,689 \n$\n5,423 \n$\n1,599 \n$\n1,010 \n$\n1,045 \nGold/GEO sold (thousand ounces)\n (4)\n6,539 \n5,420 \n5,812 \n1,916 \n896 \n1,275 \nCosts applicable to sales per ounce\n (5)\n$\n1,126 \n$\n1,050 \n$\n933 \n$\n834 \n$\n1,127 \n$\n819 \n____________________________\n(1)\nIncludes by-product credits of $179, $124, and $109 in 2024, 2023, and 2022, respectively.\n(2)\nIncludes by-product credits of $61, $13, and $8 in 2024, 2023, and 2022, respectively.\n(3)\nExcludes\n Depreciation and amortization\n and \nReclamation and remediation\n.\n(4)\nGold equivalent ounces is calculated as pounds or ounces produced multiplied by the ratio of the other metals price to the gold price, using Gold ($1,400/oz.), Copper ($3.50/lb.), Silver ($20.00/oz.), Lead ($1.00/lb.) and Zinc ($1.20/lb.) pricing for 2024 and 2023, and Gold ($1,200/oz.), Copper ($3.25/lb.), Silver ($23.00/oz.), Lead ($0.95/lb.) and Zinc ($1.15/lb.) pricing for 2022.\n(5)\nPer ounce measures may not recalculate due to rounding.\nAll-In Sustaining Costs\nCurrent GAAP measures used in the mining industry, such as cost of goods sold, do not capture all of the expenditures incurred to discover, develop and sustain production. Therefore, Newmont calculates All-in sustaining costs (“AISC”) based on the definition published by the World Gold Council. The World Gold Council is a market development organization for the gold industry comprised of and funded by gold mining companies around the world and is a regulatory organization. \nAISC is a metric that expands on GAAP measures, such as cost of goods sold, and non-GAAP measures, such as costs applicable to sales per ounce, to provide visibility into the economics of our mining operations related to expenditures, operating performance and the ability to generate cash flow from our continuing operations. We believe that AISC is a non-GAAP measure that provides additional information to management, investors and others that aids in the understanding of the economics of our operations and performance compared to other producers and provides investors visibility by better defining the total costs associated with production.\nAISC amounts are intended to provide additional information only and do not have any standardized meaning prescribed by GAAP and should not be considered in isolation or as a substitute for measures of performance prepared in accordance with GAAP. The measures are not necessarily indicative of operating profit or cash flow from operations as determined under GAAP. Other companies may calculate these measures differently as a result of differences in the underlying accounting principles, policies applied and in accounting frameworks such as in IFRS, or by reflecting the benefit from selling non-gold metals as a reduction to AISC. Differences may also arise related to definitional differences of sustaining versus development (i.e. non-sustaining) activities based upon each company’s internal policies.\n116\nTable of Contents\nThe following disclosure provides information regarding the adjustments made in determining the AISC measure:\nCosts applicable to sales\n. Includes all direct and indirect costs related to current production incurred to execute the current mine plan. We exclude certain exceptional or unusual amounts from CAS, such as significant revisions to recovery amounts. CAS includes by-product credits from certain metals obtained during the process of extracting and processing the primary ore-body. CAS is accounted for on an accrual basis and excludes \nDepreciation and amortization\n and \nReclamation and remediation\n, which is consistent with our presentation of CAS on the Consolidated Statements of Operations. In determining AISC, only the CAS associated with producing and selling an ounce of gold is included in the measure. Therefore, the amount of gold CAS included in AISC is derived from the CAS presented in the Company’s Consolidated Statements of Operations less the amount of CAS attributable to the production of other metals. The other metals' CAS at those mine sites is disclosed in Note 4 to the Consolidated Financial Statements. The allocation of CAS between gold and other metals is based upon the relative sales value of gold and other metals produced during the period.\nReclamation costs\n. Includes accretion expense related to reclamation liabilities and the amortization of the related ARC for the Company’s operating properties. Accretion related to the reclamation liabilities and the amortization of the ARC assets for reclamation does not reflect annual cash outflows but are calculated in accordance with GAAP. The accretion and amortization reflect the periodic costs of reclamation associated with current production and are therefore included in the measure. The allocation of these costs to gold and other metals is determined using the same allocation used in the allocation of CAS between gold and other metals.\nAdvanced projects, research and development and exploration\n. Includes incurred expenses related to projects that are designed to sustain current production and exploration. We note that as current resources are depleted, exploration and advanced projects are necessary for us to replace the depleting reserves or enhance the recovery and processing of the current reserves to sustain production at existing operations. As these costs relate to sustaining our production, and are considered a continuing cost of a mining company, these costs are included in the AISC measure. These costs are derived from the \nAdvanced projects, research and development\n and \nExploration\n amounts presented in the Consolidated Statements of Operations less incurred expenses related to the development of new operations, or related to major projects at existing operations where these projects will materially benefit the operation in the future. The allocation of these costs to gold and other metals is determined using the same allocation used in the allocation of CAS between gold and other metals. We also allocate these costs incurred at Corporate and Other using the proportion of CAS between gold and other metals. \nGeneral and administrative\n. Includes costs related to administrative tasks not directly related to current production, but rather related to supporting our corporate structure and fulfilling our obligations to operate as a public company. Including these expenses in the AISC metric provides visibility of the impact that general and administrative activities have on current operations and profitability on a per ounce basis. We allocate these costs to gold and other metals at Corporate and Other using the proportion of CAS between gold and other metals.\nOther expense, net\n. Excludes certain exceptional or unusual expenses, such as restructuring, as these are not indicative to sustaining our current operations. Furthermore, this adjustment to \nOther expense, net\n is also consistent with the nature of the adjustments made to \nNet income (loss) attributable to Newmont stockholders\n as disclosed in the Company’s non-GAAP financial measure Adjusted net income (loss). The allocation of these costs to gold and other metals is determined using the same allocation used in the allocation of CAS between gold and other metals.\nTreatment and refining costs\n. Includes costs paid to smelters for treatment and refining of our concentrates to produce the salable metal. These costs are presented net as a reduction of \nSales\n on the Consolidated Statements of Operations. The allocation of these costs to gold and other metals is determined using the same allocation used in the allocation of CAS between gold and other metals.\nSustaining capital and finance lease payments\n. We determined sustaining capital and finance lease payments as those capital expenditures and finance lease payments that are necessary to maintain current production and execute the current mine plan. We determined development (i.e. non-sustaining) capital expenditures and finance lease payments to be those payments used to develop new operations or related to projects at existing operations where those projects will materially benefit the operation and are excluded from the calculation of AISC. The classification of sustaining and development capital projects and finance leases is based on a systematic review of our project portfolio in light of the nature of each project. Sustaining capital and finance lease payments are relevant to the AISC metric as these are needed to maintain the Company’s current operations and provide improved transparency related to our ability to finance these expenditures from current operations. The allocation of these costs to gold and other metals is determined using the same allocation used in the allocation of CAS between gold and other metals. We also allocate these costs incurred at Corporate and Other using the proportion of CAS between gold and other metals.\n117\nTable of Contents\nYear Ended\nDecember 31, 2024\nCosts Applicable to Sales\n (1)(2)(3)\nReclamation Costs\n (4)\nAdvanced Projects, Research and Development and Exploration\n (5)\nGeneral and Administrative\nOther Expense, Net\n (6)\nTreatment and Refining Costs\nSustaining Capital and Lease Related Costs\n (7)(8)\nAll-In Sustaining Costs\nOunces (000) Sold\nAll-In Sustaining Costs per Ounce\n (9)\nGold\nBrucejack\n$\n312 \n$\n5 \n$\n13 \n$\n— \n$\n— \n$\n3 \n$\n66 \n$\n399 \n249 \n$\n1,603 \nRed Chris\n47 \n2 \n1 \n— \n— \n— \n12 \n62 \n39 \n$\n1,607 \nPeñasquito\n225 \n8 \n— \n— \n— \n16 \n36 \n285 \n290 \n$\n984 \nMerian \n401 \n8 \n15 \n— \n— \n1 \n83 \n508 \n274 \n$\n1,852 \nCerro Negro\n312 \n6 \n2 \n1 \n2 \n— \n61 \n384 \n236 \n$\n1,631 \nYanacocha\n353 \n34 \n9 \n— \n3 \n— \n22 \n421 \n352 \n$\n1,196 \nBoddington\n613 \n16 \n1 \n— \n— \n13 \n105 \n748 \n581 \n$\n1,288 \nTanami\n390 \n3 \n7 \n— \n— \n— \n127 \n527 \n411 \n$\n1,281 \nCadia\n297 \n2 \n9 \n— \n— \n16 \n152 \n476 \n454 \n$\n1,048 \nLihir\n787 \n12 \n16 \n— \n2 \n— \n121 \n938 \n620 \n$\n1,512 \nAhafo\n722 \n19 \n5 \n— \n1 \n1 \n108 \n856 \n798 \n$\n1,072 \nNGM\n1,263 \n18 \n13 \n9 \n4 \n6 \n350 \n1,663 \n1,036 \n$\n1,605 \nCorporate and Other \n(10)\n— \n— \n111 \n386 \n19 \n— \n18 \n534 \n— \n$\n— \nHeld for Sale \n(11)\nCC&V\n200 \n11 \n3 \n— \n2 \n— \n27 \n243 \n144 \n$\n1,691 \nMusselwhite\n224 \n4 \n6 \n— \n1 \n— \n96 \n331 \n215 \n$\n1,541 \nPorcupine\n310 \n12 \n5 \n— \n— \n— \n79 \n406 \n282 \n$\n1,437 \nÉléonore\n325 \n5 \n11 \n— \n— \n— \n99 \n440 \n243 \n$\n1,811 \nAkyem\n338 \n21 \n1 \n— \n1 \n— \n23 \n384 \n212 \n$\n1,816 \nDivested \n(12)\nTelfer\n245 \n11 \n10 \n— \n— \n4 \n38 \n308 \n103 \n$\n2,993 \nTotal Gold\n7,364 \n197 \n238 \n396 \n35 \n60 \n1,623 \n9,913 \n6,539 \n$\n1,516 \nGold equivalent ounces - other metals\n (13)(14)\nRed Chris\n172 \n5 \n4 \n— \n— \n5 \n47 \n233 \n142 \n$\n1,640 \nPeñasquito\n903 \n32 \n1 \n2 \n2 \n117 \n129 \n1,186 \n1,088 \n$\n1,090 \nBoddington\n204 \n3 \n— \n— \n— \n11 \n22 \n240 \n205 \n$\n1,172 \nCadia\n280 \n2 \n10 \n— \n— \n32 \n136 \n460 \n465 \n$\n987 \nCorporate and Other \n(10)\n— \n— \n14 \n44 \n— \n— \n1 \n59 \n— \n$\n— \nDivested \n(12)\nTelfer\n40 \n2 \n1 \n— \n— \n2 \n4 \n49 \n16 \n$\n2,885 \nTotal Gold Equivalent Ounces\n1,599 \n44 \n30 \n46 \n2 \n167 \n339 \n2,227 \n1,916 \n$\n1,161 \nConsolidated\n$\n8,963 \n$\n241 \n$\n268 \n$\n442 \n$\n37 \n$\n227 \n$\n1,962 \n$\n12,140 \n____________________________\n(1)\nExcludes \nDepreciation and amortization\n and \nReclamation and remediation\n.\n(2)\nIncludes by-product credits of $240.\n(3)\nIncludes stockpile, leach pad, and product inventory adjustments of $2 at Brucejack, $27 at Red Chris, $1 at Peñasquito, $9 at Cerro Negro, $21 at NGM, and $32 at Telfer.\n(4)\nIncludes operating accretion of $153, included in \nReclamation and remediation\n, and amortization of asset retirement costs $88; excludes accretion and reclamation and remediation adjustments at former operating properties that have entered the closure phase and have no substantive future economic value of $219 and $(44), respectively, included in \nReclamation and remediation\n.\n(5)\nExcludes development expenditures of $8 at Red Chris, $12 at Peñasquito, $6 at Merian, $17 at Cerro Negro, $3 at Boddington, $21 at Tanami, $36 at Ahafo, $10 at NGM, $70 at Corporate and Other, $4 at CC&V, $1 at Porcupine, $4 at Akyem, and $3 at Telfer, totaling $195 related to developing new operations or major projects at existing operations where these projects will materially benefit the operation.\n(6)\nOther expense, net is adjusted for Newcrest transaction-related costs of $72, settlement costs of $44, and restructuring and severance costs of $38, included in \nOther expense, net\n.\n(7)\nExcludes capitalized interest related to sustaining capital expenditures. Refer to Liquidity and Capital Resources within Part II, Item 7, MD&A for sustaining capital by segment.\n(8)\nIncludes finance lease payments for sustaining projects of $84 and excludes finance lease payments for development projects of $37.\n(9)\nPer ounce measures may not recalculate due to rounding.\n(10)\nCorporate and Other is a non-operating segment and includes the Company's business activities relating to its corporate and regional offices and all equity method investments. Refer to Note 4 to the Consolidated Financial Statements for further information. \n118\nTable of Contents\n(11)\nSites are classified as held for sale as of December 31, 2024. Refer to Note 3 to the Consolidated Financial Statements for further discussion of our assets and liabilities held for sale.\n(12)\nIn the fourth quarter of 2024, the Company completed the sale of the assets of the Telfer reportable segment. Refer to Note 3 to the Consolidated Financial Statements for further information.\n(13)\nGold equivalent ounces is calculated as pounds or ounces produced multiplied by the ratio of the other metals price to the gold price, using Gold ($1,400/oz.), Copper ($3.50/lb.), Silver ($20.00/oz.), Lead ($1.00/lb.) and Zinc ($1.20/lb.) pricing for 2024.\n(14)\nFor the year ended December 31, 2024, Red Chris sold 26 thousand tonnes of copper, Peñasquito sold 33 million ounces of silver, 97 thousand tonnes of lead and 247 thousand tonnes of zinc, Boddington sold 37 thousand tonnes of copper, Cadia sold 84 thousand tonnes of copper, and Telfer sold 3 thousand tonnes of copper.\nYear Ended\nDecember 31, 2023\nCosts Applicable to Sales\n (1)(2)(3)\nReclamation Costs\n (4)\nAdvanced Projects, Research and Development and Exploration\n (5)\nGeneral and Administrative\nOther Expense, Net\n (6)\nTreatment and Refining Costs\nSustaining Capital and Lease Related Costs\n (7)(8)\nAll-In Sustaining Costs\nOunces (000) Sold\nAll-In Sustaining Costs per Ounce\n (9)\nGold\nCC&V\n$\n198 \n$\n10 \n$\n10 \n$\n— \n$\n2 \n$\n— \n$\n62 \n$\n282 \n171 \n$\n1,644 \nMusselwhite\n214 \n5 \n10 \n— \n— \n— \n104 \n333 \n181 \n$\n1,843 \nPorcupine\n301 \n23 \n12 \n— \n— \n— \n71 \n407 \n258 \n$\n1,577 \nÉléonore\n295 \n9 \n10 \n— \n— \n— \n114 \n428 \n233 \n$\n1,838 \nBrucejack\n (10)\n69 \n— \n7 \n— \n1 \n3 \n16 \n96 \n36 \n$\n2,646 \nRed Chris\n (10)\n4 \n— \n— \n— \n— \n— \n2 \n6 \n4 \n$\n1,439 \nPeñasquito\n158 \n7 \n1 \n— \n2 \n9 \n29 \n206 \n130 \n$\n1,590 \nMerian \n385 \n7 \n14 \n— \n— \n1 \n85 \n492 \n319 \n$\n1,541 \nCerro Negro\n328 \n5 \n5 \n— \n5 \n— \n51 \n394 \n261 \n$\n1,509 \nYanacocha\n294 \n24 \n7 \n— \n— \n— \n24 \n349 \n275 \n$\n1,266 \nBoddington\n634 \n17 \n5 \n— \n— \n18 \n125 \n799 \n749 \n$\n1,067 \nTanami\n337 \n3 \n1 \n— \n— \n— \n130 \n471 \n444 \n$\n1,060 \nCadia\n (10)\n129 \n— \n1 \n— \n— \n6 \n16 \n152 \n120 \n$\n1,271 \nTelfer\n (10)\n126 \n— \n2 \n— \n— \n3 \n2 \n133 \n67 \n$\n1,988 \nLihir\n (10)\n146 \n— \n2 \n— \n— \n— \n51 \n199 \n131 \n$\n1,517 \nAhafo\n547 \n20 \n2 \n— \n2 \n— \n135 \n706 \n578 \n$\n1,222 \nAkyem\n275 \n44 \n1 \n— \n— \n— \n37 \n357 \n296 \n$\n1,210 \nNGM\n1,249 \n17 \n13 \n11 \n2 \n6 \n332 \n1,630 \n1,167 \n$\n1,397 \nCorporate and Other \n(11)\n— \n— \n89 \n255 \n6 \n— \n37 \n387 \n— \n$\n— \nTotal Gold\n5,689 \n191 \n192 \n266 \n20 \n46 \n1,423 \n7,827 \n5,420 \n$\n1,444 \nGold equivalent ounces - other metals\n (12)(13)\nRed Chris\n (10)\n17 \n— \n— \n— \n— \n3 \n7 \n27 \n16 \n$\n1,660 \nPeñasquito\n651 \n30 \n5 \n1 \n1 \n82 \n120 \n890 \n507 \n$\n1,756 \nBoddington\n204 \n3 \n1 \n— \n— \n15 \n39 \n262 \n246 \n$\n1,067 \nCadia\n (10)\n116 \n— \n1 \n— \n— \n19 \n17 \n153 \n114 \n$\n1,342 \nTelfer\n (10)\n22 \n— \n2 \n— \n— \n4 \n5 \n33 \n13 \n$\n2,580 \nCorporate and Other \n(11)\n— \n— \n11 \n32 \n— \n— \n6 \n49 \n— \n$\n— \nTotal Gold Equivalent Ounces\n1,010 \n33 \n20 \n33 \n1 \n123 \n194 \n1,414 \n896 \n$\n1,579 \nConsolidated\n$\n6,699 \n$\n224 \n$\n212 \n$\n299 \n$\n21 \n$\n169 \n$\n1,617 \n$\n9,241 \n____________________________\n(1)\nExcludes \nDepreciation and amortization\n and \nReclamation and remediation\n.\n(2)\nIncludes by-product credits of $137.\n(3)\nIncludes stockpile and leach pad inventory adjustments of $3 at Porcupine, $5 at Éléonore, $2 at Brucejack, $32 at Peñasquito, $2 at Cerro Negro, $5 at Yanacocha, $4 at Telfer, $1 at Akyem, and $43 at NGM.\n(4)\nIncludes operating accretion of $97, included in \nReclamation and remediation\n, and amortization of asset retirement costs $127; excludes accretion and reclamation and remediation adjustments at former operating properties that have entered the closure phase and have no substantive future economic value of $148 and $1,288, respectively, included in \nReclamation and remediation\n.\n(5)\nExcludes development expenditures of $3 at CC&V, $5 at Porcupine, $5 at Peñasquito, $9 at Merian, $5 at Cerro Negro, $4 at Yanacocha, $29 at Tanami, $38 at Ahafo, $18 at Akyem, $16 at NGM and $121 at Corporate and Other, totaling $253 related to developing new operations or major projects at existing operations where these projects will materially benefit the operation.\n(6)\nOther expense, net is adjusted for settlement costs of Newcrest transaction-related costs of $464, restructuring and severance costs of $24, settlement costs of $7, and distributions from the Newmont Global Community Support fund of $1, included in \nOther expense, net\n.\n119\nTable of Contents\n(7)\nExcludes capitalized interest related to sustaining capital expenditures. Refer to Liquidity and Capital Resources within Part II, Item 7, MD&A for sustaining capital by segment.\n(8)\nIncludes finance lease payments for sustaining projects of $64 and excludes finance lease payments for development projects of $36.\n(9)\nPer ounce measures may not recalculate due to rounding.\n(10)\nSites acquired through the Newcrest transaction. Refer to Note 3 to the Consolidated Financial Statements for further information.\n(11)\nCorporate and Other is a non-operating segment and includes the Company's business activities relating to its corporate and regional offices and all equity method investments. Refer to Note 4 to the Consolidated Financial Statements for further information. \n(12)\nGold equivalent ounces is calculated as pounds or ounces produced multiplied by the ratio of the other metals price to the gold price, using Gold ($1,400/oz.), Copper ($3.50/lb.), Silver ($20.00/oz.), Lead ($1.00/lb.) and Zinc ($1.20/lb.) pricing for 2023.\n(13)\nFor the year ended December 31, 2023, Red Chris sold 3 thousand tonnes of copper, Peñasquito sold 17 million ounces of silver, 49 thousand tonnes of lead and 101 thousand tonnes of zinc, Boddington sold 45 thousand tonnes of copper, Cadia sold 21 thousand tonnes of copper, and Telfer sold 2 thousand tonnes of copper.\nYear Ended\nDecember 31, 2022\nCosts Applicable to Sales\n (1)(2)(3)\nReclamation Costs\n (4)\nAdvanced Projects, Research and Development and Exploration\n (5)\nGeneral and Administrative\nOther Expense, Net\n (6)(7)\nTreatment and Refining Costs\nSustaining Capital and Lease Related Costs\n (8)(9)(10)\nAll-In Sustaining Costs\nOunces (000) Sold\nAll-In Sustaining Costs per Ounce\n (11)\nGold\nCC&V\n$\n241 \n$\n16 \n$\n10 \n$\n— \n$\n3 \n$\n— \n$\n45 \n$\n315 \n185 \n$\n1,697 \nMusselwhite\n195 \n5 \n8 \n— \n1 \n— \n53 \n262 \n172 \n$\n1,531 \nPorcupine\n281 \n6 \n11 \n— \n— \n— \n52 \n350 \n280 \n$\n1,248 \nÉléonore\n266 \n9 \n5 \n— \n3 \n— \n63 \n346 \n217 \n$\n1,599 \nPeñasquito\n (12)\n442 \n10 \n4 \n1 \n3 \n23 \n72 \n555 \n573 \n$\n968 \nMerian \n369 \n6 \n11 \n— \n2 \n— \n57 \n445 \n403 \n$\n1,105 \nCerro Negro\n283 \n5 \n1 \n2 \n10 \n— \n54 \n355 \n281 \n$\n1,262 \nYanacocha\n313 \n19 \n2 \n1 \n11 \n— \n23 \n369 \n250 \n$\n1,477 \nBoddington\n652 \n17 \n5 \n— \n2 \n16 \n56 \n748 \n813 \n$\n921 \nTanami\n328 \n2 \n7 \n— \n6 \n— \n124 \n467 \n486 \n$\n960 \nAhafo\n566 \n11 \n5 \n— \n2 \n— \n90 \n674 \n572 \n$\n1,178 \nAkyem\n334 \n35 \n2 \n— \n1 \n— \n32 \n404 \n415 \n$\n972 \nNGM\n1,153 \n9 \n15 \n10 \n— \n4 \n230 \n1,421 \n1,165 \n$\n1,220 \nCorporate and Other \n(13)\n— \n— \n76 \n224 \n3 \n— \n24 \n327 \n— \n$\n— \nTotal Gold\n5,423 \n150 \n162 \n238 \n47 \n43 \n975 \n7,038 \n5,812 \n$\n1,211 \nGold equivalent ounces - other metals\n (14)(15)\nPeñasquito\n (12)\n864 \n19 \n10 \n1 \n5 \n130 \n132 \n1,161 \n1,044 \n$\n1,112 \nBoddington\n181 \n2 \n2 \n— \n— \n10 \n12 \n207 \n231 \n$\n894 \nCorporate and Other \n(13)\n— \n— \n11 \n37 \n1 \n— \n4 \n53 \n— \n$\n— \nTotal Gold Equivalent Ounces\n1,045 \n21 \n23 \n38 \n6 \n140 \n148 \n1,421 \n1,275 \n$\n1,114 \nConsolidated\n$\n6,468 \n$\n171 \n$\n185 \n$\n276 \n$\n53 \n$\n183 \n$\n1,123 \n$\n8,459 \n____________________________\n(1)\nExcludes \nDepreciation and amortization\n and \nReclamation and remediation\n.\n(2)\nIncludes by-product credits of $117.\n(3)\nIncludes stockpile and leach pad inventory adjustments of $37 at CC&V, $3 at Merian, $37 at Yanacocha, $9 at Ahafo, $19 at Akyem, and $51 at NGM.\n(4)\nIncludes operating accretion of $65, included in \nReclamation and remediation\n, and amortization of asset retirement costs $106; excludes accretion and reclamation and remediation adjustments at former operating properties that have entered the closure phase and have no substantive future economic value of $114 and $742, respectively, included in \nReclamation and remediation\n.\n(5)\nExcludes development expenditures of $1 at CC&V, $3 at Porcupine, $5 at Peñasquito, $10 at Merian, $24 at Cerro Negro, $20 at Yanacocha, $21 at Tanami, $21 at Ahafo, $12 at Akyem, $17 at NGM and $141 at Corporate and Other, totaling $275 related to developing new operations or major projects at existing operations where these projects will materially benefit the operation.\n(6)\nOther expense, net includes incremental COVID-19 costs incurred as a result of actions taken to protect against the impacts of the COVID-19 pandemic at our operational segments of $1 at Musselwhite, $3 at Éléonore, $7 at Peñasquito, $3 at Merian, $7 at Cerro Negro, $6 at Yanacocha,$2 at Boddington, $6 at Tanami, totaling $35, included in \nOther expense, net\n.\n(7)\nOther expense, net is adjusted for settlement costs of $22, restructuring and severance costs of $4 and distributions from the Newmont Global Community Support Fund of $3, included in \nOther expense, net\n.\n(8)\nIncludes sustaining capital expenditures of $1,059. Refer to Liquidity and Capital Resources within Part II, Item 7, MD&A for sustaining capital by segment.\n120\nTable of Contents\n(9)\nExcludes development capital expenditures, capitalized interest and the change in accrued capital totaling $1,072. Refer to Liquidity and Capital Resources within Part II, Item 7, Management's Discussion and Analysis for the discussion of major development projects. \n(10)\nIncludes finance lease payments for sustaining projects of $64 and excludes finance lease payments for development projects of $36.\n(11)\nPer ounce measures may not recalculate due to rounding.\n(12)\nCosts applicable to sales\n includes $70 related to the Peñasquito Profit-Sharing Agreement associated with 2021 site performance. For further information, refer to Note 4 to the Consolidated Financial Statements. \n(13)\nCorporate and Other is a non-operating segment and includes the Company's business activities relating to its corporate and regional offices and all equity method investments. Refer to Note 4 to the Consolidated Financial Statements for further information. \n(14)\nGold equivalent ounces is calculated as pounds or ounces produced multiplied by the ratio of the other metals price to the gold price, using Gold ($1,200/oz.), Copper ($3.25/lb.), Silver ($23.00/oz.), Lead ($0.95/lb.) and Zinc ($1.15/lb.) pricing for 2022.\n(15)\nFor the year ended December 31, 2022, Peñasquito sold 30 million ounces of silver, 67 thousand tonnes of lead and 169 thousand tonnes of zinc, and Boddington sold 39 thousand tonnes of copper.\nAccounting Developments\nFor a discussion of Recently Adopted and Recently Issued Accounting Pronouncements, refer to Note 2 to the Consolidated Financial Statements.\nCritical Accounting Estimates\nOur discussion of financial condition and results of operations is based upon the information reported in our Consolidated Financial Statements. The preparation of these Consolidated Financial Statements in conformity with GAAP requires us to make assumptions and estimates that affect the reported amounts of assets, liabilities, revenues, and expenses, as well as the disclosure of contingent assets and liabilities as of the date of our financial statements. We have identified the accounting estimates listed below as critical to understanding and evaluating the financial results reported in our Consolidated Financial Statements. These accounting estimates require the application of significant management judgment and are critical due to the significant level of estimation uncertainty regarding the assumptions involved and the magnitude of the asset, liability, revenue or expense being reported. We base our assumptions and estimates on historical experience and various other sources that we believe to be reasonable under the circumstances. We review the underlying factors used in our estimates regularly, including reviewing the significant accounting policies impacting the estimates, to ensure compliance with GAAP. However, due to the uncertainty inherent in our estimates, actual results may materially differ from the estimates we calculate due to changes in circumstances, global economics and politics, and general business conditions. A summary of our significant accounting policies is detailed in Note 2 to the Consolidated Financial Statements. \nBusiness Combinations\nWe recognize and measure the assets acquired and liabilities assumed in a business combination based on their estimated fair values at the acquisition date, while transaction and integration costs related to business combinations are expensed as incurred. Any excess of the purchase consideration when compared to the fair value of the net tangible and intangible assets acquired, if any, is recorded as goodwill. For material acquisitions, we engage independent appraisers to assist with the determination of the fair value of assets acquired, liabilities assumed, noncontrolling interest, if any, and goodwill, based on recognized business valuation methodologies. An income, market or cost valuation method may be utilized to estimate the fair value of the assets acquired, liabilities assumed, and noncontrolling interest, if any, in a business combination. The income valuation method represents the present value of future cash flows over the life of the asset using: (i) discrete financial forecasts, which rely on management’s estimates of reserves, resources and exploration potential quantities, costs to produce and develop reserves, revenues, and operating expenses; (ii) short-term and long-term metal price assumptions, (iii) long-term growth rates; (iv) appropriate discount rates; and (v) expected future capital requirements (“income valuation method”). The market valuation method uses prices paid for a similar asset by other purchasers in the market, normalized for any differences between the assets (“market valuation method”). The cost valuation method is based on the replacement cost of a comparable asset at the time of the acquisition adjusted for depreciation and economic and functional obsolescence of the asset (“cost valuation method”). If the initial accounting for the business combination is incomplete by the end of the reporting period in which the acquisition occurs, an estimate is recorded. Subsequent to the acquisition date, and not later than one year from the acquisition date, we record any material adjustments to the initial estimate based on new information obtained that would have existed as of the date of the acquisition. Any adjustment that arises from information obtained that did not exist as of the date of the acquisition is recorded in the period the adjustments arises.\nCarrying value of long-lived assets\nWe review and evaluate our long-lived assets for impairment when events or changes in circumstances indicate that the related carrying amounts may not be recoverable. Significant negative industry or economic trends, adverse social or political developments, declines in our market capitalization, geotechnical difficulties, reduced estimates of future cash flows from our reporting segments or other disruptions to our business are a few examples of events that we monitor, as they could indicate that the carrying value of the Company’s long-lived assets, including development projects, may not be recoverable. In such cases, a recoverability test may be necessary to determine if an impairment charge is required.\nFor development projects, including our Conga project which is discussed further below, we review and evaluate changes to project plans and timing to determine continued technical, economic and social viability of the projects. If the Company determines to \n121\nTable of Contents\nsell or abandon a project due to uncertainty from changes in circumstances related to technical, economic, social, political or community factors, or other evolving circumstances indicate that the carrying value may not be recoverable, then a recoverability test is performed to determine if an impairment charge should be recorded.\nAn impairment loss is measured and recorded based on the estimated fair value of the long-lived assets being tested for impairment and their carrying amounts. Fair value is typically determined through the use of an income approach utilizing estimates of discounted pre-tax future cash flows or a market approach utilizing recent transaction activity for comparable properties. These approaches are primarily considered Level 3 fair value measurements. Occasionally, such as when an asset is held for sale, market prices are used. We believe our estimates and models used to determine fair value are similar to what a market participant would use.\nThe estimated undiscounted cash flows used to assess recoverability of long-lived assets and to measure the fair value of our mining operations are derived from current business plans, which are developed using short-term price forecasts reflective of the current price environment and our projections for long-term average metal prices. In addition to short- and long-term metal price assumptions, other assumptions include estimates of commodity-based and other input costs; proven and probable mineral reserves estimates, including the timing and cost to develop and produce the reserves; value beyond proven and probable mineral reserve estimates; estimated future closure costs; the use of appropriate discount rates; and applicable U.S. dollar long-term exchange rates. Refer to Item 7A, Quantitative and Qualitative Disclosures About Market Risk.\nThe significant assumption in determining the future cash flows for each mine site at December 31, 2024 is a long-term gold price of $1,900 per ounce. A decrease of $100 per ounce in the long-term gold price assumption could result in an impairment of our long-lived assets, including goodwill, of up to approximately $1,039 before consideration of other value beyond proven and probable reserves which may significantly decrease the amount of any potential impairment charge.\nAs discussed above under Depreciation and amortization, various factors could impact our ability to achieve our forecasted production schedules from proven and probable reserves which could impact the carrying value of our long-lived assets. The ability to achieve the estimated quantities of recoverable minerals from exploration stage mineral interests involves further risks in addition to those factors applicable to mineral interests where proven and probable reserves have been identified, due to the lower level of confidence that the identified measured, indicated and inferred resources could ultimately be mined economically. Assets classified as exploration potential have the highest level of risk that the carrying value of the asset can be ultimately realized, due to the still lower level of geological confidence and economic modeling.\nEvents that could result in additional impairment of our long-lived assets include, but are not limited to, decreases in future metal prices, unfavorable changes in foreign exchange rates, increases in future closure costs, and any event that might otherwise have a material adverse effect on mine site cash flows.\nGoodwill\nGoodwill represents the excess of the purchase price over the estimated fair value of the net assets acquired in a business acquisition. Goodwill is allocated to reporting units and tested for impairment annually and when events or changes in circumstances indicate that the carrying value of a reporting unit exceeds its fair value. Each operating mine is considered a distinct reporting unit for purposes of goodwill impairment testing. \nThe Company may elect to perform a qualitative assessment when it is more likely than not that the fair value of a reporting unit is higher than its carrying value. At the Company's election or if it is determined to be more likely than not that the fair value is less than the carrying value, a quantitative goodwill impairment test is performed to determine the fair value of the reporting unit. The fair value of a reporting unit is determined using either the income approach utilizing estimates of discounted future cash flows or the market valuation approach utilizing recent transaction activity for comparable properties. These approaches are considered Level 3 fair value measurements. If the carrying amount of the reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, limited to the total amount of goodwill allocated to that reporting unit. Any impairment loss recognized in the current period is not reversed in future periods. The Company recognizes its pro rata share of goodwill and any subsequent goodwill impairment losses recorded by entities that are proportionately consolidated.\nWhen the income approach is utilized to determine fair value, the estimated cash flows used to assess the fair value of a reporting unit are derived from the Company’s current business plans, which are developed using short-term price forecasts reflective of the current price environment and management’s projections for long-term average metal prices. The significant assumption in determining the future cash flows for each mine site at December 31, 2024 is a long-term gold price of $1,900 per ounce. In addition to short- and long-term metal price assumptions, other assumptions include estimates of commodity-based and other input costs; proven and probable mineral reserves estimates, including the timing and cost to develop and produce the reserves; value beyond proven and probable estimates; estimated future closure costs; the use of appropriate discount rates; and applicable U.S. dollar long-term exchange rates. Refer to Item 7A, Quantitative and Qualitative Disclosures About Market Risk.\nFair value determinations require considerable judgment and are sensitive to changes in underlying assumptions and factors. For testing purposes of our reporting units, management's best estimates of the expected future results are the primary driver in determining the fair value. However, there can be no assurance that the estimates and assumptions made for purposes of the goodwill impairment tests will prove to be an accurate prediction of the future. Examples of events or circumstances that could reasonably be \n122\nTable of Contents\nexpected to negatively affect the underlying key assumptions and ultimately impact the estimated fair value of our reporting units include, but are not limited to, such items as: (i) a decrease in forecasted production levels if we are unable to realize the mineable reserves, resources and exploration potential at our mining properties and extend the life of mine (ii) increased production or capital costs (iii) adverse changes in macroeconomic conditions including the market price of metals and changes in the equity and debt markets or country specific factors which could result in higher discount rates, (iv) significant unfavorable changes in tax rates including increased corporate income or mining tax rates, and (v) negative changes in regulation, legislation, and political environments which could impact our ability to operate in the future. Refer to Notes 7 and 19 to the Consolidated Financial Statements for further information regarding goodwill. \nCarrying value of Conga\nWe review and evaluate the Company’s Conga development project for recoverability whenever events or changes in circumstances indicate that the carrying amount may not be recoverable. We have considered a variety of technical, economic, social and political developments related to the Conga project during our evaluation of impairment indicators since November 2011, when construction and development activities at the project were largely suspended. Project activities in recent years have focused on continued engagement with the local communities and maintaining and protecting existing project infrastructure and equipment through our active care and maintenance program. Although we have reclassified Conga reserves to resources and reallocated exploration and development capital to other projects, we continue to evaluate long-term options to progress development of the Conga project and improve social and political acceptance. While we have reprioritized the Yanacocha Sulfides project ahead of the Conga project, we have delayed the full-funds decision and are currently in the process of assessing project plan options for the Yanacocha Sulfides project. The Company also periodically updates the economic model for its Conga project to understand changes to the estimated capital costs, cash flows, and economic returns from the project. As of December 31, 2024, we have not identified events or changes in circumstances that indicate that the carrying value of the Conga project is not recoverable. \nReclamation and remediation obligations\nThe Company records the estimated asset retirement obligations associated with operating and non-operating mine sites when an obligation is incurred and the estimated costs can be reasonably measured. Fair value is measured as the present value of expected cash flow estimates, after considering inflation, our credit-adjusted risk-free rates and a market risk premium appropriate for our operations. Reclamation costs are allocated to expense over the life of the related assets and are periodically adjusted to reflect changes in the estimated present value resulting from the passage of time and revisions to the estimates of either the timing or amount of the reclamation costs. Reclamation obligations are based on our best estimate of when the expected spending for an existing environmental disturbance will occur. Our cost estimates are reflected on a third-party cost basis and comply with our legal obligation to retire long-lived assets in the period incurred. Changes in reclamation estimates at non-operating mines where the mine or portion of the mine site has entered the closure phase and has no substantive future economic value are reflected in earnings in the period an estimate is revised. Costs included in estimated asset retirement obligations are discounted to their present value and are estimated over a period of up to fifty years. We review, on at least an annual basis, the reclamation obligation at each mine.\nRemediation costs are accrued when it is probable that an obligation has been incurred and the cost can be reasonably estimated. Such cost estimates may include ongoing care, maintenance and monitoring costs. Changes in remediation estimates at non-operating mines are reflected in earnings in the period an estimate is revised. Water treatment costs included in environmental remediation obligations are discounted to their present value and are estimated over a period of up to fifty years.\nAccounting for reclamation and remediation obligations requires management to make estimates unique to each mining operation of the future costs the Company expects to incur to complete the reclamation and remediation work required to comply with existing laws and regulations. These estimates require considerable judgment and are sensitive to changes in underlying inputs and assumptions. Such changes, including, but not limited to, (i) changes to environmental laws and regulations, which could increase the scope and extent of work required, (ii) changes in the timing of reclamation and remediation activities, which could occur over an extended future period and (iii) changes in the methods and technology utilized to settle reclamation and remediation obligations, could have a material impact on our business, financial condition, results of operations and cash flows.\nRefer to Note 6 to the Consolidated Financial Statements for further information regarding reclamation and remediation obligations.\nIncome and mining taxes\nWe account for income taxes using the liability method, recognizing certain temporary differences between the financial reporting basis of our liabilities and assets and the related income tax basis for such liabilities and assets. This method generates either a net deferred income tax liability or asset for us, as measured by the statutory tax rates in effect. We derive our deferred income tax charge or benefit by recording the change in either the net deferred income tax liability or asset balance for the year. The financial statement effects of changes in tax law are recorded as discrete items in the period enacted as part of income tax expense or benefit from continuing operations, regardless of the category of income or loss to which the deferred taxes relate. We have exposure to the impact of foreign exchange fluctuations on tax positions in certain jurisdictions, such movements are recorded within \nIncome and mining tax benefit (expense)\n related to deferred income tax assets and liabilities, as well as non-current uncertain tax positions, while foreign exchange fluctuations impacting current tax positions are recorded within \nOther income (loss), net\n as foreign currency \n123\nTable of Contents\nexchange gains (losses). With respect to the earnings that we derive from the operations of our consolidated subsidiaries, in those situations where the earnings are indefinitely reinvested, no deferred taxes have been provided on the unremitted earnings (including the excess of the carrying value of the net equity of such entities for financial reporting purposes over the tax basis of such equity) of these consolidated companies.\nMining taxes represent state and provincial taxes levied on mining operations and are classified as income taxes as such taxes are based on a percentage of mining profits.\nOur operations are in multiple jurisdictions where uncertainties arise in the application of complex tax regulations. Some of these tax regimes are defined by contractual agreements with the local government, while others are defined by general tax laws and regulations. We are subject to reviews of our income tax filings and other tax payments, and disputes can arise with the taxing authorities over the interpretation of its contracts or laws. We recognize potential liabilities and record tax liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether it is more likely than not, and the extent to which, additional taxes will be due. We adjust these reserves in light of changing facts and circumstances; however, due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. If our estimate of tax liabilities proves to be less than the ultimate assessment, an additional charge to expense would result. If the estimate of tax liabilities proves to be greater than the ultimate assessment, a tax benefit would result. We recognize interest and penalties, if any, related to unrecognized tax benefits in \nIncome and mining tax benefit (expense)\n. In certain jurisdictions, we must pay a portion of the disputed amount to the local government in order to formally appeal the assessment. Such payment is recorded as a receivable if we believe the amount is ultimately collectible.\nValuation of deferred tax assets\nOur deferred income tax assets include certain future tax benefits. We record a valuation allowance against any portion of those deferred income tax assets when we believe, based on the weight of available evidence, it is more likely than not that some portion or all of the deferred income tax asset will not be realized. We review the likelihood that we will realize the benefit of our deferred tax assets and therefore the need for valuation allowances on a quarterly basis, or more frequently if events indicate that a review is required. In determining the requirement for a valuation allowance, the historical and projected financial results of the legal entity or consolidated group recording the net deferred tax asset is considered, along with all other available positive and negative evidence.\nCertain categories of evidence carry more weight in the analysis than others based upon the extent to which the evidence may be objectively verified. We look to the nature and severity of cumulative pretax losses (if any) in the current three-year period ending on the evaluation date or the expectation of future pretax losses and the existence and frequency of prior cumulative pretax losses.\nWe utilize a rolling twelve quarters of pre-tax income or loss as a measure of our cumulative results in recent years. Concluding that a valuation allowance is not required is difficult when there is significant negative evidence which is objective and verifiable, such as cumulative losses in recent years. However, a cumulative three year loss is not solely determinative of the need for a valuation allowance. We also consider all other available positive and negative evidence in our analysis.\nOther factors considered in the determination of the probability of the realization of the deferred tax assets include, but are not limited to:\n•\nEarnings history;\n•\nProjected future financial and taxable income based upon existing reserves and long-term estimates of commodity prices;\n•\nThe duration of statutory carry forward periods;\n•\nPrudent and feasible tax planning strategies readily available that may alter the timing of reversal of the temporary difference;\n•\nNature of temporary differences and predictability of reversal patterns of existing temporary differences; and\n•\nThe sensitivity of future forecasted results to commodity prices and other factors.\nThe Company assesses available positive and negative evidence to estimate if sufficient future taxable income will be generated to utilize the existing deferred tax assets. A significant piece of objective negative evidence is recent pretax losses and/or expectations of future pretax losses. Such objective evidence limits the ability to consider other subjective evidence including projections for future growth. On the basis of this evaluation, a valuation allowance has been recorded in Peru and Argentina. The amount of the deferred tax asset considered realizable, however, could be adjusted if estimates of future taxable income during the carryforward period are increased or if objective negative evidence in the form of cumulative losses is no longer present and additional weight may be given to subjective evidence such as our projections for growth.\nRefer to Note 10 to the Consolidated Financial Statements for additional detail on the valuation allowance. \nFor additional risk factors that could impact the Company’s ability to realize the deferred tax assets, refer to Note 2 to the Consolidated Financial Statements.\n124\nTable of Contents",
  "item2": null
}