{
  "source_file": "nflx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the federal securities laws.  These forward-looking statements include, but are not limited to, statements regarding: our core strategy; our ability to improve our content offerings and service; our future financial performance, including expectations regarding revenues, deferred revenue, operating income and margin, net income, expenses, and profitability; liquidity, including the sufficiency of our capital resources, net cash provided by (used in) operating activities, access to financing sources and free cash flows; capital allocation strategies, including any stock repurchases or repurchase programs; seasonality; stock price volatility; impact of foreign exchange rate fluctuations, including on net income, revenues; expectations regarding hedging activity; impact of interest rate fluctuations; adequacy of existing facilities; future regulatory changes and their impact on our business; intellectual property; cybersecurity; price changes and testing; accounting treatment for changes related to content assets; acquisitions; actions by competitors; partnerships; advertising; multi-household usage; reporting of membership-related data; member viewing patterns; dividends; future contractual obligations, including unknown content obligations and timing of payments; our global content and marketing investments, including investments in original programming, consumer products and live experiences; impact of work stoppages; content amortization; resolution of tax examinations; tax expense; unrecognized tax benefits; deferred tax assets; outcome of Brazilian non-income tax matters; payment of deposits relating to Brazilian non-income tax matters; impact of Brazilian non-income taxes; the impact of the One Big Beautiful \n24\nTable of Contents\nBill Act; resolution of disputes and other proceedings; our ability to effectively manage change and growth; our company culture; and our ability to attract and retain qualified employees and key personnel.  These forward-looking statements are subject to risks and uncertainties that could cause actual results and events to differ materially from those included in forward-looking statements.  Factors that might cause or contribute to such differences include, but are not limited to, those discussed in our Annual Report on Form 10-K for the year ended December 31, 2024 filed with the Securities and Exchange Commission (“SEC”) on January 27, 2025, in particular the risk factors discussed under the heading “Risk Factors” in Part I, Item 1A. \nWe assume no obligation to revise or publicly release any revision to any forward-looking statements contained in this Quarterly Report on Form 10-Q, unless required by law.\nInvestors and others should note that we announce material financial and other information to our investors using our investor relations website (\nir.netflix.net\n), SEC filings, press releases, public conference calls and webcasts.  We use these channels, as well as social media and blogs to communicate with our members and the public about our company, our services and other issues.  It is possible that the information we post on social media and blogs could be deemed to be material information.  Therefore, we encourage investors, the media, and others interested in our company to review the information we post on the social media channels and blogs listed on our investor relations website.\nOverview\nWe are one of the world’s leading entertainment services offering TV series, films and games across a wide variety of genres and languages.  Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \nOur core strategy is to grow our business globally within the parameters of our operating margin target.  We strive to continuously improve our members' experience by offering compelling content that delights them and attracts new members.  We aim to offer a range of pricing plans, including our ad-supported subscription plan, to meet a variety of consumer needs.  We seek to drive conversation around our content to further enhance member joy, and we are continuously enhancing our user interface to help our members more easily choose content that they will find enjoyable.\nResults of Operations\nThe following represents our consolidated performance highlights\n(1)\n:\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nFinancial Results:\nRevenues\n$\n11,510,307 \n$\n9,824,703 \n$\n1,685,604 \n17 \n%\nConstant currency change in revenues\n(2)\n17 \n%\nOperating income\n$\n3,248,247 \n$\n2,909,477 \n$\n338,770 \n12 \n%\nOperating margin\n28.2 \n%\n29.6 \n%\n(1.4)\n%\nNet income\n$\n2,546,916 \n$\n2,363,509 \n$\n183,407 \n8 \n%\n(1) We have discontinued the quarterly reporting of membership numbers, focusing instead on revenue and operating margin as the primary financial metrics that we believe best represent our business performance.  Effective with the Quarterly Report on Form 10-Q for the quarter ended March 31, 2025, we discontinued reporting streaming membership metrics, including paid net membership additions (losses), paid memberships at end of period, average paying memberships and average monthly revenue per paying membership.\n(2) See the \n“Non-GAAP Constant Currency Information”\n section below for additional details on our use of constant currency revenue.\nOperating margin for the three months ended September 30, 2025 decreased by approximately one percentage point as compared to the prior comparative period.  The decrease in operating margin was primarily driven by the growth in cost of revenues and sales and marketing expenses outpacing the growth in revenues, partially offset by a slower rate of growth in technology and development expenses and general and administrative expenses relative to revenue growth.\nNet income fo\nr the three months ended September 30, 2025 increased $183 million as compared to the prior comparative period, primarily due to a $339 million increase in operating income, driven by a $1,686 million increase in revenues and partially offset by a $1,044 million increase in cost of revenues primarily due to the increase in other cost of revenues and content amortization.  The impact of higher operating income was partially offset by a $223 million increase in the provision for income taxes.\n25\nTable of Contents\nRevenues\nWe primarily derive revenues from monthly membership fees for services related to streaming content to our members.  We offer a variety of streaming membership plans, the price of which varies by country and the features of the plan.  As of September 30, 2025, pricing on our plans ranged from the U.S. dollar equivalent of $1 to $35 per month, and pricing on our extra member sub accounts ranged from the U.S. dollar equivalent of $2 to $9 per month.  We expect that from time to time the prices of our membership plans in each country may change and we may test other plan and price variations.\nWe also earn revenues from advertisements presented on our streaming service, consumer products, live experiences and various other sources.  Revenues earned from sources other than monthly membership fees were not a material component of revenues for the three and nine months ended September 30, 2025 and September 30, 2024.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n \n(in thousands, except percentages)\nRevenues\n$\n11,510,307 \n$\n9,824,703 \n$\n1,685,604 \n17 \n%\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n \n(in thousands, except percentages)\nRevenues\n$\n33,132,274 \n$\n28,754,453 \n$\n4,377,821 \n15 \n%\nRevenues for the three and nine months ended September 30, 2025 increased 17% and 15% as compared to the three and nine months ended September 30, 2024, respectively, primarily due to the growth in memberships, price increases, and increased advertising revenue.  Additionally, revenues for the nine months ended September 30, 2025 as compared to the same period in 2024 were unfavorably impacted by changes in foreign exchange rates, net of hedging.\nThe following tables summarize revenues by region for the three and nine months ended September 30, 2025 and 2024.  Total revenues are inclusive of hedging gains (losses) of $(129) million and $(2) million for the three and nine months ended September 30, 2025, respectively, and $48 million and $70 million for the three and nine months ended September 30, 2024, respectively.  See Note 7 \nDerivative Financial Instruments and Hedging Activities\n to the consolidated financial statements for further information regarding the Company’s derivative and non-derivative financial instruments.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n \n(in thousands, except percentages)\nUnited States and Canada (UCAN)\n$\n5,071,781 \n$\n4,322,476 \n$\n749,305 \n17 \n%\nEurope, Middle East, and Africa (EMEA)\n3,699,052 \n3,133,466 \n565,586 \n18 \n%\nLatin America (LATAM)\n1,370,913 \n1,240,892 \n130,021 \n10 \n%\nAsia-Pacific (APAC)\n1,368,561 \n1,127,869 \n240,692 \n21 \n%\nTotal Revenues\n$\n11,510,307 \n$\n9,824,703 \n$\n1,685,604 \n17 \n%\n26\nTable of Contents\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n \n(in thousands, except percentages)\nUnited States and Canada (UCAN)\n$\n14,617,882 \n$\n12,842,351 \n$\n1,775,531 \n14 \n%\nEurope, Middle East, and Africa (EMEA)\n10,641,903 \n9,099,431 \n1,542,472 \n17 \n%\nLatin America (LATAM)\n3,939,582 \n3,610,045 \n329,537 \n9 \n%\nAsia-Pacific (APAC)\n3,932,907 \n3,202,626 \n730,281 \n23 \n%\nTotal Revenues\n$\n33,132,274 \n$\n28,754,453 \n$\n4,377,821 \n15 \n%\nNon-GAAP Constant Currency Information\nWe believe the non-GAAP financial measure of constant currency revenue is useful in analyzing period-to-period comparisons in revenues absent foreign currency fluctuations.  However, this non-GAAP financial measure should be considered in addition to, not as a substitute for, or superior to other financial measures prepared in accordance with GAAP.\nIn order to exclude the effect of foreign currency rate fluctuations on revenue, we calculate current period revenue assuming foreign exchange rates had remained constant with foreign exchange rates from each of the corresponding months of the prior-year period and exclude the impact of hedging gains or losses realized as revenues.  Constant currency percentage change in revenues is calculated as the percentage change between current period constant currency revenue and the prior comparative period revenue.  The impact of hedging gains or losses is excluded from both the current and prior periods.\nThe tables below summarize constant currency revenues by region for the three and nine months ended September 30, 2025 and the constant currency percentage change in revenues by region for the three and nine months ended September 30, 2025 as compared to the three and nine months ended September 30, 2024:\nThree Months Ended\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\nAs Reported\nConstant Currency Adjustment\nHedging (Gains) Losses Included in Revenues\nConstant Currency Revenues\nAs Reported\nHedging (Gains) Losses Included in Revenues\nRevenues \nLess Hedging Impact\nReported Change\nConstant Currency Change\n(in thousands, except percentages)\nUCAN\n$\n5,071,781 \n$\n1,816 \n$\n(2,196)\n$\n5,071,401 \n$\n4,322,476 \n$\n(3,265)\n$\n4,319,211 \n17 \n%\n17 \n%\nEMEA\n3,699,052 \n(199,597)\n113,580 \n3,613,035 \n3,133,466 \n(1,857)\n3,131,609 \n18 \n%\n15 \n%\nLATAM\n1,370,913 \n53,678 \n26,300 \n1,450,891 \n1,240,892 \n(34,654)\n1,206,238 \n10 \n%\n20 \n%\nAPAC\n1,368,561 \n(14,750)\n(8,319)\n1,345,492 \n1,127,869 \n(8,408)\n1,119,461 \n21 \n%\n20 \n%\nTotal Revenues\n$\n11,510,307 \n$\n(158,853)\n$\n129,365 \n$\n11,480,819 \n$\n9,824,703 \n$\n(48,184)\n$\n9,776,519 \n17 \n%\n17 \n%\nNine Months Ended\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\nAs Reported\nConstant Currency Adjustment\nHedging (Gains) Losses Included in Revenues\nConstant Currency Revenues\nAs Reported\nHedging (Gains) Losses Included in Revenues\nRevenues \nLess Hedging Impact\nReported Change\nConstant Currency Change\n(in thousands, except percentages)\nUCAN\n$\n14,617,882 \n$\n33,190 \n$\n(23,179)\n$\n14,627,893 \n$\n12,842,351 \n$\n(5,617)\n$\n12,836,734 \n14 \n%\n14 \n%\nEMEA\n10,641,903 \n(175,286)\n50,404 \n10,517,021 \n9,099,431 \n(12,514)\n9,086,917 \n17 \n%\n16 \n%\nLATAM\n3,939,582 \n458,052 \n26,397 \n4,424,031 \n3,610,045 \n(30,147)\n3,579,898 \n9 \n%\n24 \n%\nAPAC\n3,932,907 \n31,327 \n(51,668)\n3,912,566 \n3,202,626 \n(21,966)\n3,180,660 \n23 \n%\n23 \n%\nTotal Revenues\n$\n33,132,274 \n$\n347,283 \n$\n1,954 \n$\n33,481,511 \n$\n28,754,453 \n$\n(70,244)\n$\n28,684,209 \n15 \n%\n17 \n%\n27\nTable of Contents\nCost of Revenues\nCost of revenues primarily consists of the amortization of content assets.  Other costs of revenues include expenses associated with the acquisition, licensing and production of content, streaming delivery costs, and other operating costs.\nExpenses related to the acquisition, licensing and production of content not included in content amortization may include payroll, stock-based compensation, facilities, and other personnel-related expenses, costs associated with obtaining rights to music included in our content, overall deals with talent, miscellaneous production-related costs and participations and residuals.  Streaming delivery costs are primarily related to our global content delivery network (“Open Connect”).  We have built our own Open Connect network to help us efficiently stream a high volume of content to our members over the internet. Delivery expenses, therefore, include equipment costs related to Open Connect, payroll and related personnel expenses and all third-party costs, such as cloud computing costs, associated with delivering content over the internet.  Other operating costs include customer service and payment processing fees, including those we pay to our integrated payment partners, as well as other costs directly incurred in making our content available to members.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nCost of revenues\n$\n6,164,250\n$\n5,119,884\n$\n1,044,366 \n20 \n%\nAs a percentage of revenues\n54 \n%\n52 \n%\nThe increase in cost of revenues was primarily due to an increase in other cost of revenues, driven primarily by the accrual of a loss of $619 million related to non-income tax assessments in Brazil, coupled with a $303 million increase in content amortization relating to our existing and new content.  We do not expect that non-income taxes incurred in Brazil will materially impact our results of operations in future periods.  See Note 8 \nCommitments and Contingencies\n in the accompanying notes to our consolidated financial statements for further detail on our non-income tax matters.\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n(in thousands, except percentages)\nCost of revenues\n$\n16,752,708\n$\n15,271,100\n$\n1,481,608 \n10 \n%\nAs a percentage of revenues\n51 \n%\n53 \n%\nThe increase in cost of revenues was primarily due to an increase in other cost of revenues, driven primarily by the accrual of a loss of $619 million related to non-income tax assessments in Brazil, coupled with a $518 million increase in content amortization relating to our existing and new content.  We do not expect that non-income taxes incurred in Brazil will materially impact our results of operations in future periods.  See Note 8 \nCommitments and Contingencies\n in the accompanying notes to our consolidated financial statements for further detail on our non-income tax matters.\nSales and Marketing\nSales and marketing expenses consist primarily of expenses for promotional activities such as digital and television advertising, and certain payments made to marketing and advertising sales partners.  Our marketing partners include consumer electronics manufacturers, multichannel video programming distributors, mobile operators, and internet service providers.  Our advertising sales partners include advertising technology providers and advertising agencies.  Sales and marketing expenses also include payroll, stock-based compensation, facilities, and other related expenses for personnel that support advertising sales and marketing activities.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nSales and marketing\n$\n786,295\n$\n642,926\n$\n143,369 \n22 \n%\nAs a percentage of revenues\n7 \n%\n7 \n%\nThe increase in sales and marketing expenses was primarily driven by a $104 million increase in marketing expenses, coupled with a $41 million increase in personnel-related costs due to the growth in advertising sales headcount.\n28\nTable of Contents\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n(in thousands, except percentages)\nSales and marketing\n$\n2,187,930\n$\n1,941,350\n$\n246,580 \n13 \n%\nAs a percentage of revenues\n7 \n%\n7 \n%\nThe increase in sales and marketing expenses was primarily driven by a $114 million increase in personnel-related costs due to the growth in advertising sales headcount, coupled with a $98 million increase in other marketing expenses, and a $44 million increase in expenses incurred in connection with our advertising offering, including increased payments to advertising sales partners and other advertising distribution expenses.\nTechnology and Development\nTechnology and development expenses consist primarily of payroll, stock-based compensation, facilities, and other related expenses for technology personnel responsible for making improvements to our service offerings, including testing, maintaining and modifying our user interface, our recommendations and infrastructure.  Technology and development expenses also include costs associated with general use computer hardware and software.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nTechnology and development\n$\n853,584\n$\n735,063\n$\n118,521 \n16 \n%\nAs a percentage of revenues\n7 \n%\n7 \n%\nThe increase in technology and development expenses was primarily due to a $110 million increase in personnel-related costs.\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n(in thousands, except percentages)\nTechnology and development\n$\n2,501,090\n$\n2,148,790\n$\n352,300 \n16 \n%\nAs a percentage of revenues\n8 \n%\n7 \n%\nThe increase in technology and development expenses was primarily due to a $340 million increase in personnel-related costs.\nGeneral and Administrative\nGeneral and administrative expenses consist primarily of payroll, stock-based compensation, facilities, and other related expenses for corporate personnel.  General and administrative expenses also include professional fees and other general corporate expenses.\n29\nTable of Contents\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nGeneral and administrative\n$\n457,931\n$\n417,353\n$\n40,578 \n10 \n%\nAs a percentage of revenues\n4 \n%\n4 \n%\nThe increase in general and administrative expenses was primarily due to a $20 million increase in personnel-related costs and a $10 million increase in third-party expenses.\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n(in thousands, except percentages)\nGeneral and administrative\n$\n1,320,606\n$\n1,248,365\n$\n72,241 \n6 \n%\nAs a percentage of revenues\n4 \n%\n4 \n%\nThe increase in general and administrative expenses was primarily due to a $37 million increase in third-party expenses and a $23 million increase in personnel-related costs.\nInterest Expense\nInterest expense consists primarily of the interest associated with our outstanding debt obligations, including the amortization of debt issuance costs.  See Note 6 \nDebt\n in the accompanying notes to our consolidated financial statements for further detail on our debt obligations.\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n \nThree Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n \n(in thousands, except percentages)\nInterest expense\n$\n175,294\n$\n184,830\n$\n(9,536)\n(5)\n%\nAs a percentage of revenues\n2 \n%\n2 \n%\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n \n(in thousands, except percentages)\nInterest expense\n$\n542,115\n$\n526,130\n$\n15,985\n3 \n%\nAs a percentage of revenues\n2 \n%\n2 \n%\nInterest expense primarily consists of interest on our Notes of $175 million and $541 million for the three and nine months ended September 30, 2025, respectively.  The decrease in interest expense for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024 was due to the lower average aggregate principal of our Notes outstanding.  The increase in interest expense for the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024 was due to the higher average aggregate principal of our Notes outstanding.\nInterest and Other Income (Expense)\nInterest and other income (expense) consists primarily of foreign exchange gains and losses on foreign currency denominated balances, gains and losses on certain derivative instruments, and interest earned on cash, cash equivalents and short-term investments.\n30\nTable of Contents\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n \nThree Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n \n(in thousands, except percentages)\nInterest and other income (expense)\n$\n36,457\n$\n(21,693)\n$\n58,150\n268 \n%\nAs a percentage of revenues\n— \n%\n— \n%\nInterest and other income (expense) increased in the three months ended September 30, 2025 primarily due to foreign exchange losses of $25 million, net of the impacts of derivatives and hedging, compared to losses of $91 million for the corresponding period in 2024.  In the three months ended September 30, 2025, the foreign exchange losses were primarily driven by the remeasurement of cash and content liability positions in currencies other than the functional currencies.  In the three months ended September 30, 2024, the foreign exchange losses were primarily driven by the non-cash loss of $105 million from the remeasurement of our Senior Notes denominated in euro, net of hedging impacts, partially offset by the remeasurement of cash and content liability positions in currencies other than the functional currencies.  The change in foreign currency gains and losses was partially offset by a $9 million decrease in interest income earned in the three months ended September 30, 2025 as compared to the corresponding period in 2024. \nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n \n(in thousands, except percentages)\nInterest and other income (expense)\n$\n126,986\n$\n212,671\n$\n(85,685)\n(40)\n%\nAs a percentage of revenues\n— \n%\n1 \n%\nInterest and other income (expense) decreased in the nine months ended September 30, 2025 primarily due to foreign exchange losses of $97 million, net of the impacts of derivatives and hedging, compared to gains of $24 million for the corresponding period in 2024.  In the nine months ended September 30, 2025, the foreign exchange losses were primarily driven by the non-cash loss of $82 million from the remeasurement of our Senior Notes denominated in euro, net of hedging impacts, coupled with the remeasurement of cash and content liability positions in currencies other than the functional currencies.  In the nine months ended September 30, 2024, the foreign exchange gains were primarily driven by the non-cash gain of $69 million from the remeasurement of our Senior Notes denominated in euro, net of hedging impacts, partially offset by the remeasurement of cash and content liability positions in currencies other than the functional currencies.  The change in foreign currency gains and losses was partially offset by a $15 million increase in interest income earned in the nine months ended September 30, 2025 as compared to the corresponding period in 2024.\nProvision for Income Taxes\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\n \nThree Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n \n(in thousands, except percentages)\nProvision for income taxes\n$\n562,494 \n$\n339,445\n$\n223,049 \n66 \n%\nEffective tax rate\n18 \n%\n13 \n%\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\n \nNine Months Ended\nChange\n \nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n \n(in thousands, except percentages)\nProvision for income taxes\n$\n1,392,131 \n$\n988,365\n$\n403,766 \n41 \n%\nEffective tax rate\n14 \n%\n13 \n%\nThe increase in the effective tax rates for the three and nine months ended September 30, 2025, as compared to the same periods in 2024, was primarily due to a decrease in tax benefits associated with federal research and development tax credits, as well as the lower growth in the foreign-derived intangible income deduction relative to the growth in income before income taxes.\n31\nTable of Contents\nLiquidity and Capital Resources\nAs of\nChange\nSeptember 30,\n2025\nDecember 31,\n2024\nSeptember 30, 2025 vs. December 31, 2024\n(in thousands, except percentages)\nCash, cash equivalents, restricted cash and short-term investments\n$\n9,327,973 \n$\n9,586,343 \n$\n(258,370)\n(3)\n%\nShort-term and long-term debt\n14,463,020 \n15,582,804 \n(1,119,784)\n(7)\n%\nCash, cash equivalents, restricted cash and short-term investments decreased $258 million in the nine months ended September 30, 2025 primarily due to the repurchase of stock and repayment of debt, partially offset by cash provided by operations and proceeds from issuance of common stock.\nDebt, net of debt issuance costs and discounts, decreased $1,120 million primarily due to approximately $1,833 million in repayments of debt, partially offset by the remeasurement of our euro-denominated notes in the nine months ended September 30, 2025.  The amount of principal and interest on our outstanding notes due in the next twelve months is $690 million. As of September 30, 2025, no amounts had been borrowed under the $3 billion Revolving Credit Agreement or the $3 billion Commercial Paper Program.  See Note 6 \nDebt\n in the accompanying notes to our consolidated financial statements. \nWe anticipate that we may periodically raise additional debt capital.  Our ability to obtain this or any additional financing that we may choose or need, including for the refinancing of upcoming maturities or potential strategic acquisitions and investments, will depend on, among other things, our development efforts, business plans, operating performance and the condition of the capital markets at the time we seek financing.  We may not be able to obtain such financing on terms acceptable to us or at all.  If we raise additional funds through the issuance of equity or debt securities, those securities may have rights, preferences or privileges senior to the rights of our common stock, and our stockholders may experience dilution.\nIn September 2023, the Board of Directors authorized the repurchase of up to $10 billion of our common stock, with no expiration date, and in December 2024, the Board of Directors increased the share repurchase authorization by an additional $15 billion, also with no expiration date.  Stock repurchases may be effected through open market repurchases in compliance with Rule 10b-18 under the Exchange Act, including through the use of trading plans intended to qualify under Rule 10b5-1 under the Exchange Act, privately-negotiated transactions, accelerated stock repurchase plans, block purchases, or other similar purchase techniques and in such amounts as management deems appropriate.  We are not obligated to repurchase any specific number of shares, and the timing and actual number of shares repurchased will depend on a variety of factors, including our stock price, general economic, business and market conditions, and alternative investment opportunities.  We may discontinue any repurchases of our common stock at any time without prior notice.  During the nine months ended September 30, 2025, the Company repurchased 6,765,397 shares of common stock for an aggregate amount of $7.0 billion (excluding the 1% excise tax on stock repurchases as a result of the Inflation Reduction Act of 2022).  As of September 30, 2025, $10.1 billion remains available for repurchases.\nOur primary uses of cash include the acquisition, licensing and production of content, marketing programs, streaming delivery, and personnel-related costs.  Cash payment terms for non-original content have historically been in line with the amortization period.  Investments in original content, and in particular content that we produce and own, require more cash upfront relative to licensed content.  For example, production costs are paid as the content is created, well in advance of when the content is available on the service and amortized.  We expect to continue to significantly invest in global content, particularly in original content, which will impact our liquidity.  Our other uses of cash include strategic acquisitions and investments, as well as share repurchases.  We currently anticipate that cash flows from operations, available funds and access to financing sources, including our Revolving Credit Facility and Commercial Paper Program, will continue to be sufficient to meet our cash needs for the next twelve months and beyond.\nOur material cash requirements from known contractual and other obligations primarily relate to our content, debt and lease obligations. As of September 30, 2025, the expected timing of those payments are as follows:\nPayments due by Period\nContractual obligations (in thousands):\nTotal\nNext 12 Months\nBeyond 12 Months\nContent obligations \n(1)\n$\n20,940,900 \n$\n11,267,688 \n$\n9,673,212 \nDebt \n(2)\n18,394,940 \n690,341 \n17,704,599 \nOperating lease obligations \n(3)\n3,031,727 \n574,669 \n2,457,058 \nTotal\n$\n42,367,567 \n$\n12,532,698 \n$\n29,834,869 \n32\nTable of Contents\n(1)\nAs of September 30, 2025, content obligations were comprised of $4.1 billion included in “Current content liabilities” and $1.6 billion of “Non-current content liabilities” on the Consolidated Balance Sheets and $15.2 billion of obligations that are not reflected on the Consolidated Balance Sheets as they did not then meet the criteria for recognition.  \nThe material cash requirements above do not include any estimated obligation for the unknown future titles, payment for which could range from less than one year to more than five years.  However, these unknown obligations are expected to be significant and we believe could include approximately $1 billion to $4 billion over the next three years, with the payments for the vast majority of such amounts expected to occur after the next twelve months.  The foregoing range is based on considerable management judgments and the actual amounts may differ.  Once we know the title that we will receive and the license fees, we include the amount in the contractual obligations table above.\n(2)\nDebt obligations include our Notes consisting of principal and interest payments.  See Note 6 \nDebt \nto the consolidated financial statements for further details.  \n(3)\nOperating lease obligations are comprised of operating lease liabilities included in \"Accrued expenses and other liabilities\" and \"Other non-current liabilities\" on the Consolidated Balance Sheets, inclusive of imputed interest.  Operating lease obligations also include additional obligations that are not reflected on the Consolidated Balance Sheets as they did not meet the criteria for recognition.  See Note 5 \nBalance Sheet Components \nin the accompanying notes to our consolidated financial statements for further details regarding leases.\nIn addition to the material cash requirements summarized in the table above, we expect to pay deposits of $619 million related to non-income tax assessments in Brazil as described further in Note 8 \nCommitments and Contingencies\n.  During the nine months ended September 30, 2025, we also paid tax deposits of approximately $200 million related to certain direct taxes that exceeded our regularly recurring obligations.  \nCash Flows\nThe following tables summarize our cash flows:\nThree months ended September 30, 2025 as compared to the three months ended September 30, 2024\nThree Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nQ3'25 vs. Q3'24\n(in thousands, except percentages)\nNet cash provided by operating activities\n$\n2,825,174 \n$\n2,321,101 \n$\n504,073 \n22 \n%\nNet cash provided by (used in) investing activities\n43,871 \n(1,869,109)\n1,912,980 \n102 \n%\nNet cash provided by (used in) financing activities\n(1,737,029)\n226,596 \n(1,963,625)\n(867)\n%\nNet cash provided by operating activities for the three months ended September 30, 2025 increased $504 million as compared to the corresponding period in 2024, primarily driven by a $454 million increase in adjustments for non-cash expenses, $396 million in favorable changes in working capital, and a $183 million or 8% increase in net income, partially offset by a $530 million increase in payments for content assets.\nNet cash provided by (used in) investing activities for the three months ended September 30, 2025 increased $1,913 million as compared to the corresponding period in 2024, primarily due to net cash inflows of $172 million from maturities, sales and purchases of investments in the three months ended September 30, 2025 as compared to cash outflows of $1,742 million from purchases of investments in the corresponding period in 2024, partially offset by a $38 million increase in purchases of property and equipment.\nNet cash provided by (used in) financing activities for the three months ended September 30, 2025 decreased $1,964 million as compared to the corresponding period in 2024, primarily due to no proceeds from the issuance of debt in the three months ended September 30, 2025, as compared to proceeds from the issuance of debt of $1,794 million in the corresponding period in 2024, coupled with a $157 million decrease in cash flows related to higher repurchases of common stock in the three months ended September 30, 2025 as compared to the corresponding period in 2024.\n33\nTable of Contents\nNine months ended September 30, 2025 as compared to the nine months ended September 30, 2024\nNine Months Ended\nChange\nSeptember 30,\n2025\nSeptember 30,\n2024\nYTD'25 vs. YTD'24\n(in thousands, except percentages)\nNet cash provided by operating activities\n$\n8,037,631 \n$\n5,824,470 \n$\n2,213,161 \n38 \n%\nNet cash provided by (used in) investing activities\n1,298,217 \n(2,023,110)\n3,321,327 \n164 \n%\nNet cash used in financing activities\n(8,268,213)\n(3,395,729)\n4,872,484 \n143 \n%\nNet cash provided by operating activities for the nine months ended September 30, 2025 increased $2,213 million as compared to the corresponding period in 2024, primarily driven by a $1,720 million or 25% increase in net income and a $941 million increase in adjustments for non-cash expenses, partially offset by $241 million in unfavorable changes in working capital and a $207 million increase in payments for content assets.\nNet cash provided by (used in) investing activities for the nine months ended September 30, 2025 increased $3,321 million as compared to the corresponding period in 2024, primarily due to net cash inflows of $1,747 million from maturities, sales and purchases of investments in the nine months ended September 30, 2025 as compared to cash outflows of $1,742 million from purchases of investments in the corresponding period in 2024, partially offset by a $168 million increase in purchases of property and equipment.\nNet cash used in financing activities for the nine months ended September 30, 2025 increased $4,872 million as compared to the corresponding period in 2024, primarily driven by changes in cash flows related to the issuance and repayment of debt.  The increase in financing cash outflows was primarily driven by no proceeds from the issuance of debt in the nine months ended September 30, 2025, as compared to proceeds from the issuance of debt of $1,794 million, in the corresponding period in 2024, coupled with a $1,433 million increase in repayments of debt.  In addition, repurchases of common stock increased $1,748 million in the nine months ended September 30, 2025 as compared to the corresponding period in 2024.\nIndemnification\nThe information set forth under Note 8 \nCommitments and Contingencies \nto the consolidated financial statements under the caption “Indemnification” is incorporated herein by reference.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles and the Company’s discussion and analysis of its financial condition and operating results require the Company’s management to make judgments, assumptions and estimates that affect the amounts reported. Note 1, “Basis of Presentation and Summary of Significant Accounting Policies” of the Notes to consolidated Financial Statements in Part I, Item 1 of this Form 10-Q and in the Notes to Consolidated Financial Statements in Part II, Item 8 of our Annual Report on Form 10-K for the year ended December 31, 2024, describe the significant accounting policies and methods used in the preparation of the Company’s consolidated financial statements.  There have been no material changes to the Company’s critical accounting estimates included in our Annual Report on Form 10-K for the year ended December 31, 2024.\n34\nTable of Contents"
}