{
  "source_file": "nflx-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nABOUT US\nNetflix, Inc. (“Netflix”, “the Company”, “registrant”, “we”, or “us”) is one of the world’s leading entertainment services with approximately 302 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time. \nOur core strategy is to grow our business globally within the parameters of our operating margin target. We strive to continuously improve our members' experience by offering compelling content that delights them and attracts new members. We aim to offer a range of pricing plans, including our ad-supported subscription plan, to meet a variety of consumer needs. We seek to drive conversation around our content to further enhance member joy, and we are continuously enhancing our user interface to help our members more easily choose content that they will find enjoyable.\nBUSINESS SEGMENTS \nWe operate as one operating segment.  Our revenues are primarily derived from monthly membership fees for services related to streaming content to our members.  See Note 12, \nSegment and Geographic Information\n, in the accompanying notes to our consolidated financial statements for further detail. \nCOMPETITION\nThe market for entertainment video is intensely competitive and subject to rapid change.  We compete with a broad set of activities for consumers’ leisure time, including other entertainment video providers, such as linear television, streaming entertainment providers (including those that provide pirated content), video gaming providers, as well as user-generated content, some of which are by professional content creators, and more broadly against other sources of entertainment, such as social media, that our members could choose in their moments of free time.  We also compete against entertainment video providers and content producers in obtaining content for our service, both for licensed content and for original content projects.\nWhile consumers may maintain simultaneous relationships with multiple entertainment sources, we strive for consumers to choose us in their moments of free time.  We have often referred to this choice as our objective of \"winning moments of truth.\"  In attempting to win these moments of truth with our members, we seek to continually improve our service, including both our technology and our content offerings.\nSEASONALITY\nOur membership growth exhibits a seasonal pattern that reflects variations when consumers buy internet-connected screens and when they tend to increase their viewing.  Historically, the fourth quarter represents our greatest streaming membership growth.  In addition, our membership growth can be impacted by our content release schedule and changes to pricing and plans.\n1\nTable of Contents\nINTELLECTUAL PROPERTY\nWe regard our trademarks, service marks, copyrights, patents, domain names, trade dress, trade secrets, proprietary technologies and similar intellectual property as important to our success.  We use a combination of patent, trademark, copyright and trade secret laws and confidentiality agreements to protect our proprietary intellectual property.  Our intellectual property rights extend to our technology, business processes, the content we produce and distribute through our service, and the consumer products and experiences based thereon.  We use the intellectual property of third parties in creating some of our content, merchandising our products and marketing our service. Our ability to provide our members with content they can watch depends on studios, content providers and other rights holders licensing rights, including distribution rights, to such content and certain related elements thereof, such as the public performance of music contained within the content we distribute.  The license periods and the terms and conditions of such licenses vary.  Our ability to protect and enforce our intellectual property rights is subject to certain risks and from time to time we encounter disputes over rights and obligations concerning intellectual property.  We cannot provide assurance that we will prevail in any intellectual property disputes.\nREGULATION\nThe media landscape and the internet delivery of content have seen growing regulatory action.  Historically, media has been highly regulated in many countries.  We are seeing some of these legacy regulatory frameworks be updated and expanded to address services like ours.  In particular, we are seeing some countries update their cultural support legislation to include services like Netflix.  This includes content quotas, levies and investment obligations.  Some even restrict the extent of ownership rights we can have both in our service and in our content.  In certain countries, regulators are also looking at restrictions that could require formal reviews of and/or adjustments to content that appears on our service in their country. In general these regulations impact all services and may make operating in certain jurisdictions more expensive or restrictive as to the content offerings we may provide.\nHUMAN CAPITAL\nWe view our employees and our culture as key to our success.  As of December 31, 2024, we had approximately 14,000 full-time employees.  Of these, approximately 9,600 (69%) were located in the United States and Canada, 2,200 (16%) in Europe, Middle East, and Africa, 600 (4%) in Latin America and 1,600 (11%) in Asia-Pacific.  We also have a number of employees engaged in content production, some of whom are part-time or temporary, and whose numbers fluctuate throughout the year and may be covered by collective bargaining agreements. We believe an important component of our success is our company culture. This culture, which is detailed in a \"Culture Memo\" located on our website, is often described as providing a unique environment for our employees to perform the best work of their lives in pursuit of excellence.\n \nWe aim to attract and retain great people - representing a diverse array of perspectives and skills - to work together as a dream team. As our business grows and changes, we seek to improve our culture to meet the new needs of our business. We believe our dynamic culture helps us create a better experience for our members, employees, creators and partners. \nAs we have expanded our offices globally, our company culture remains an important aspect of our operations.  We are mindful of cultural differences across and within regions.  Fostering a work environment that is culturally diverse, inclusive and equitable is a major focus for us.  We work to build diversity, inclusion and equity into all aspects of our operations globally, with the goal of having diversity and inclusion function as a critical lens through which each Netflix employee carries out their role.  We want more people and cultures to see themselves reflected on screen - so it’s important that our employee base is diverse and represents the communities we serve. We look to help increase representation by educating our people leaders and recruiters on how to hire more inclusively, and to help the company and senior leaders diversify their networks. We also support numerous employee resource groups (ERGs), representing employees and allies from a broad array of historically underrepresented and/or marginalized communities.  We publish annually an update on our inclusion initiatives and progress, which further highlights our approach to diversity and inclusion, and publish our EEO-1 reports on our website.\nWe believe in fostering great leaders.  We offer various experiences and training to inform our employees about our culture and other context that we believe is important for success at Netflix. We aim to equip our people leaders (officers, VPs, directors, and manager-level employees) to lead the business and our teams in alignment with our expectations and strategic objectives.\nWe aim generally to pay our employees at their personal top of market, and they generally are able to choose the form of their compensation between cash and stock options.  This permits employee compensation to be highly personalized and reflective of each employee's individual needs and preferences.  We conduct pay equity analyses at least annually, and have adopted practices to help ensure that employees from underrepresented groups are not being underpaid based on gender identity (globally) and race or ethnicity (U.S.) relative to others doing the same or similar work under comparable circumstances.  We aim to rectify any pay gaps that we find through this analysis.\nWe care about the health and well-being of our employees and their families and provide a variety of benefit programs based on region, including health benefits.  In the U.S., employees generally receive an annual cash health benefit allowance that they may allocate to medical, dental and vision premiums in a way that makes sense for them.  Employees have access to a host of other benefits, including mental health, childcare, family planning and a company match for charitable donations.\nWe believe that our approach to human capital resources has been instrumental in our growth, and has made Netflix a desirable destination for employees.\n2\nTable of Contents\nOTHER INFORMATION\nWe maintain a website at \nwww.netflix.com.  \nThe contents of our website are not incorporated in, or otherwise to be regarded as part of, this Annual Report on Form 10-K.  We make available, free of charge on our website, access to our Annual Report on Form 10-K, our Quarterly Reports on Form 10-Q, our Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"), as soon as reasonably practicable after we file or furnish them electronically with the Securities and Exchange Commission (\"SEC\").\nInvestors and others should note that we announce material financial and other information to our investors using our investor relations website (\nir.netflix.net\n), SEC filings, press releases, public conference calls and webcasts.  We use these channels as well as social media and blogs to communicate with our members and the public about our company, our services and other issues.  It is possible that the information we post on social media and blogs could be deemed to be material information.  Therefore, we encourage investors, the media, and others interested in our company to review the information we post on the social media channels and blogs listed on our investor relations website.  \n3\nTable of Contents",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis section of this Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023.  Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nResults of Operations\nThe following represents our consolidated performance highlights:\nAs of/Year Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except revenue per membership and percentages)\nFinancial Results:\nStreaming revenues\n$\n39,000,966 \n$\n33,640,458 \n$\n31,469,852 \n16 \n%\nDVD revenues (1)\n— \n82,839 \n145,698 \n(100)\n%\nTotal revenues\n$\n39,000,966\n \n$\n33,723,297\n \n$\n31,615,550\n \n16 \n%\nOperating income\n$\n10,417,614 \n$\n6,954,003 \n$\n5,632,831 \n50 \n%\nOperating margin\n27 \n%\n21 \n%\n18 \n%\nGlobal Streaming Memberships:\nPaid net membership additions\n41,350 \n29,529 \n8,903 \n40 \n%\nPaid memberships at end of period (2)\n301,626 \n260,276 \n230,747 \n16 \n%\nAverage paying memberships\n277,730 \n240,889 \n222,924 \n15 \n%\nAverage monthly revenue per paying membership\n$\n11.70 \n$\n11.64 \n$\n11.76 \n1 \n%\nConstant currency change (3)\n4 \n%\n(1) We discontinued our DVD-by-mail service in the year ended December 31, 2023. The discontinuance of our DVD business had an immaterial impact on our operations and financial results.\n(2) A paid membership (also referred to as a paid subscription) is defined as a membership that has the right to receive Netflix service following sign-up and a method of payment being provided, and that is not part of a free trial or certain other promotions that may be offered by the Company to new or rejoining members. Certain members have the option to add extra member sub accounts. These extra member sub accounts are not included in paid memberships. A membership is canceled and ceases to be reflected in the above metrics as of the effective cancellation date. Voluntary cancellations generally become effective at the end of the prepaid membership period. Involuntary cancellations, as a result of a failed method of payment, become effective immediately. Memberships are assigned to territories based on the geographic location used at time of sign-up as determined by the Company’s internal systems, which utilize industry standard geo-location technology.\n(3) We believe the non-GAAP financial measure of constant currency revenue is useful in analyzing the underlying trends in average monthly revenue per paying membership (“ARM”) absent foreign currency fluctuations. However, this non-GAAP financial measure should be considered in addition to, not as a substitute for, or superior to other financial measures prepared in accordance with GAAP.\nIn order to exclude the effect of foreign currency rate fluctuations on ARM, we calculate current period revenue assuming foreign exchange rates had remained constant with foreign exchange rates from each of the corresponding months of the prior-year period and exclude the impact of hedging gains or losses realized as revenues. Constant currency percentage change in ARM is calculated as the percentage change between current period constant currency ARM and the prior comparative period ARM.  The impact of hedging gains or losses is excluded from both the current and prior periods.  For the year ended December 31, 2024, our revenues would have been approximately $1,424 million higher, excluding the impact of hedging and had foreign currency exchange rates remained constant with those for the year ended December 31, 2023.  The unfavorable foreign exchange rate impacts in the year ended December 31, 2024 were primarily driven by the devaluation of the Argentine peso relative to the U.S. dollar coupled with significant price increases in the local currency in this jurisdiction.\nOperating margin for the year ended December 31, 2024 increased six percentage points as compared to the prior comparative period, primarily due to revenues growing at a faster rate as compared to the growth in cost of revenues, sales and marketing, and technology and development expenses, coupled with lower general and administrative expenses.\n19\nTable of Contents\nStreaming Revenues\n    \nWe primarily derive revenues from monthly membership fees for services related to streaming content to our members.  We offer a variety of streaming membership plans, the price of which varies by country and the features of the plan.  As of December 31, 2024, pricing on our paid plans ranged from the U.S. dollar equivalent of $1 to $32 per month, and pricing on our extra member sub accounts ranged from the U.S. dollar equivalent of $2 to $8 per month.  We expect that from time to time the prices of our membership plans in each country may change and we may test other plan and price variations.\nWe also earn revenue from advertisements presented on our streaming service, consumer products, live events and various other sources.  Revenues earned from sources other than monthly membership fees were not a material component of streaming revenues for the years ended December 31, 2024, 2023, and 2022.\nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nStreaming revenues\n$\n39,000,966 \n$\n33,640,458 \n$\n31,469,852 \n$\n5,360,508 \n16 \n%\nStreaming revenues for the year ended December 31, 2024 increased 16% as compared to the year ended December 31, 2023, primarily due to the growth in average paying memberships and price increases, partially offset by unfavorable changes in foreign exchange rates.  \nThe following tables summarize streaming revenues and other streaming membership information by region for the years ended December 31, 2024, 2023 and 2022.  Hedging gains of $124 million are included in “Streaming revenues” for the year ended December 31, 2024.  No hedging gains and losses were recognized as “Streaming revenues” in the comparative prior year periods.  See Note 7 \nDerivative Financial Instruments and Hedging Activities\n to the consolidated financial statements for further information regarding the Company’s derivative and non-derivative financial instruments.\nUnited States and Canada (UCAN)\nAs of/Year Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except revenue per membership and percentages)\nStreaming revenues\n$\n17,359,369 \n$\n14,873,783 \n$\n14,084,643 \n$\n2,485,586 \n17 \n%\nPaid net membership additions (losses)\n9,497 \n5,832 \n(919)\n3,665 \n63 \n%\nPaid memberships at end of period\n89,625 \n80,128 \n74,296 \n9,497 \n12 \n%\nAverage paying memberships\n84,112 \n76,126 \n74,001 \n7,986 \n10 \n%\nAverage monthly revenue per paying membership\n$\n17.20 \n$\n16.28 \n$\n15.86 \n$\n0.92 \n6 \n%\nConstant currency change\n6 \n%\nEurope, Middle East, and Africa (EMEA)\nAs of/Year Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except revenue per membership and percentages)\nStreaming revenues\n$\n12,387,035 \n$\n10,556,487 \n$\n9,745,015 \n$\n1,830,548 \n17 \n%\nPaid net membership additions\n12,320 \n12,084 \n2,693 \n236 \n2 \n%\nPaid memberships at end of period\n101,133 \n88,813 \n76,729 \n12,320 \n14 \n%\nAverage paying memberships\n94,200 \n80,928 \n73,904 \n13,272 \n16 \n%\nAverage monthly revenue per paying membership\n$\n10.96 \n$\n10.87 \n$\n10.99 \n$\n0.09 \n1 \n%\nConstant currency change\n1 \n%\n20\nTable of Contents\nLatin America (LATAM)\nAs of/Year Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except revenue per membership and percentages)\nStreaming revenues\n$\n4,839,816 \n$\n4,446,461 \n$\n4,069,973 \n$\n393,355 \n9 \n%\nPaid net membership additions\n7,330 \n4,298 \n1,738 \n3,032 \n71 \n%\nPaid memberships at end of period\n53,327 \n45,997 \n41,699 \n7,330 \n16 \n%\nAverage paying memberships\n48,954 \n42,802 \n40,000 \n6,152 \n14 \n%\nAverage monthly revenue per paying membership\n$\n8.24 \n$\n8.66 \n$\n8.48 \n$\n(0.42)\n(5)\n%\nConstant currency change\n21 \n%\nAsia-Pacific (APAC)\nAs of/Year Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except revenue per membership and percentages)\nStreaming revenues\n$\n4,414,746 \n$\n3,763,727 \n$\n3,570,221 \n$\n651,019 \n17 \n%\nPaid net membership additions\n12,203 \n7,315 \n5,391 \n4,888 \n67 \n%\nPaid memberships at end of period\n57,541 \n45,338 \n38,023 \n12,203 \n27 \n%\nAverage paying memberships\n50,466 \n41,033 \n35,019 \n9,433 \n23 \n%\nAverage monthly revenue per paying membership\n$\n7.29 \n$\n7.64 \n$\n8.50 \n$\n(0.35)\n(5)\n%\nConstant currency change\n(3)\n%\nCost of Revenues\nCost of revenues primarily consists of the amortization of content assets.  Other costs of revenues include expenses associated with the acquisition, licensing and production of content, streaming delivery costs, and other operating costs.\nExpenses related to the acquisition, licensing and production of content not included in content amortization may include payroll, stock-based compensation, facilities, and other personnel-related expenses, costs associated with obtaining rights to music included in our content, overall deals with talent, miscellaneous production-related costs and participations and residuals.  Streaming delivery costs are primarily related to our global content delivery network (“Open Connect”).  We have built our own Open Connect network to help us efficiently stream a high volume of content to our members over the internet.  Delivery expenses, therefore, include equipment costs related to Open Connect, payroll and related personnel expenses and all third-party costs, such as cloud computing costs, associated with delivering content over the internet.  Other operating costs include customer service and payment processing fees, including those we pay to our integrated payment partners, as well as other costs directly incurred in making our content available to members.\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nCost of revenues\n$\n21,038,464 \n$\n19,715,368 \n$\n19,168,285 \n$\n1,323,096 \n7 \n%\nAs a percentage of revenues\n54 \n%\n58 \n%\n61 \n%\nThe increase in cost of revenues for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was due to a $1,104 million increase in content amortization relating to our existing and new content.\nSales and Marketing\nSales and marketing expenses consist primarily of advertising expenses and certain payments made to marketing and advertising sales partners, including consumer electronics (\"CE\") manufacturers, multichannel video programming distributors (\"MVPDs\"), mobile operators, and ISPs. Marketing expenses include promotional activities such as digital and television advertising. Sales and marketing expenses also include payroll, stock-based compensation, facilities, and other related expenses for personnel that support advertising sales and marketing activities. \n21\nTable of Contents\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nSales and marketing\n$\n2,917,554 \n$\n2,657,883 \n$\n2,530,502 \n$\n259,671 \n10 \n%\nAs a percentage of revenues\n7 \n%\n8 \n%\n8 \n%\nThe increase in sales and marketing expenses for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was primarily driven by a $131 million increase in personnel-related costs due to the growth in advertising sales headcount.  Other sales and marketing expenses increased $129 million primarily due to a $54 million increase in marketing expenses due to the timing of marketing spend on our content slate, coupled with an increase in expenses incurred in connection with our advertising offering, including increased payments to advertising sales partners and other advertising distribution expenses.\nTechnology and Development\nTechnology and development expenses consist primarily of payroll, stock-based compensation, facilities, and other related expenses for technology personnel responsible for making improvements to our service offerings, including testing, maintaining and modifying our user interface, our recommendations, merchandising and infrastructure.  Technology and development expenses also include costs associated with general use computer hardware and software.\n \n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nTechnology and development\n$\n2,925,295 \n$\n2,675,758 \n$\n2,711,041 \n$\n249,537 \n9 \n%\nAs a percentage of revenues\n8 \n%\n8 \n%\n9 \n%\nThe increase in technology and development expenses for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was primarily due to a $224 million increase in personnel-related costs.\nGeneral and Administrative\nGeneral and administrative expenses consist of payroll, stock-based compensation, facilities, and other related expenses for corporate personnel.  General and administrative expenses also include professional fees and other general corporate expenses. \n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nGeneral and administrative\n$\n1,702,039 \n$\n1,720,285 \n$\n1,572,891 \n$\n(18,246)\n(1)\n%\nAs a percentage of revenues\n4 \n%\n5 \n%\n5 \n%\nGeneral and administrative expenses for the year ended December 31, 2024 as compared to the year ended December 31, 2023 remained relatively flat.\nInterest Expense\nInterest expense consists primarily of the interest associated with our outstanding debt obligations, including the amortization of debt issuance costs. See Note 6 \nDebt\n in the accompanying notes to our consolidated financial statements for further detail on our debt obligations. \n \n22\nTable of Contents\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nInterest expense\n$\n718,733 \n$\n699,826 \n$\n706,212 \n$\n18,907 \n3 \n%\nAs a percentage of revenues\n2 \n%\n2 \n%\n2 \n%\nInterest expense primarily consists of interest on our Notes of $718 million for the year ended December 31, 2024.  The increase in interest expense for the year ended December 31, 2024 as compared to the year ended December 31, 2023 was due to the increase in debt.\nInterest and Other Income (Expense)\nInterest and other income (expense) consists primarily of foreign exchange gains and losses on foreign currency denominated balances, gains and losses on certain derivative instruments, and interest earned on cash, cash equivalents and short-term investments.\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nInterest and other income (expense)\n$\n266,776 \n$\n(48,772)\n$\n337,310 \n$\n315,548 \n647 \n%\nAs a percentage of revenues\n1 \n%\n— \n%\n1 \n%\nInterest and other income (expense) increased for the year ended December 31, 2024 primarily due to foreign exchange losses of $18 million, net of the impacts of derivatives and hedging, compared to the losses of $293 million for the corresponding period in 2023.  In the year ended December 31, 2024, the foreign exchange losses were primarily driven by the remeasurement of cash and content liability positions in currencies other than the functional currencies, partially offset by a non-cash gain of $122 million, net of hedging impacts, from the remeasurement of our €5,170 million Senior Notes.  The foreign exchange loss in the year ended December 31, 2023 was primarily driven by a non-cash loss of $176 million from the remeasurement of our Senior Notes denominated in euros, coupled with the remeasurement of cash and content liability positions in currencies other than the functional currencies.\nProvision for Income Taxes\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n \n(in thousands, except percentages)\nProvision for income taxes\n$\n1,254,026 \n$\n797,415 \n$\n772,005 \n$\n456,611 \n57 \n%\nEffective tax rate\n13 \n%\n13 \n%\n15 \n%\n \nThe effective tax rate for the year ended December 31, 2024 remained relatively flat as compared to the year ended December 31, 2023.  See Note 10 \nIncome Taxes\n to the consolidated financial statements for further information regarding income taxes.\n23\nTable of Contents\nLiquidity and Capital Resources\n \nAs of December 31,\nChange\n2024\n2023\n2024 vs. 2023\n(in thousands, except percentages)\nCash, cash equivalents, restricted cash and short-term investments\n$\n9,586,343 \n$\n7,139,488 \n$\n2,446,855 \n34 \n%\nShort-term and long-term debt\n15,582,804 \n14,543,261 \n1,039,543 \n7 \n%\nCash, cash equivalents, restricted cash and short-term investments increased $2,447 million in the year ended December 31, 2024 primarily due to cash provided by operations, issuance of debt, and proceeds from issuance of common stock, partially offset by the repurchase of stock and repayment of debt.\nDebt, net of debt issuance costs and discounts, increased $1,040 million primarily due to the issuance of $1,800 million in additional Senior Notes, partially offset by the repayment upon maturity of the $400 million aggregate principal amount of our 5.750% Senior Notes and the remeasurement of our euro-denominated notes in the year ended December 31, 2024.  The amount of principal and interest due in the next twelve months is $2,487 million.  As of December 31, 2024, no amounts had been borrowed under our $3 billion Revolving Credit Agreement.  See Note 6 \nDebt\n in the accompanying notes to our consolidated financial statements.  \nWe anticipate that we may periodically raise additional debt capital.  Our ability to obtain this or any additional financing that we may choose or need, including for the refinancing of upcoming maturities or potential strategic acquisitions and investments, will depend on, among other things, our development efforts, business plans, operating performance, and the condition of the capital markets at the time we seek financing.  We may not be able to obtain such financing on terms acceptable to us or at all.  If we raise additional funds through the issuance of equity or debt securities, those securities may have rights, preferences or privileges senior to the rights of our common stock, and our stockholders may experience dilution.  \nIn September 2023, the Board of Directors authorized the repurchase of up to $10 billion of our common stock, with no expiration date, and in December 2024, the Board of Directors increased the share repurchase authorization by an additional $15 billion, also with no expiration date. Stock repurchases may be effected through open market repurchases in compliance with Rule 10b-18 under the Exchange Act, including through the use of trading plans intended to qualify under Rule 10b5-1 under the Exchange Act, privately-negotiated transactions, accelerated stock repurchase plans, block purchases, or other similar purchase techniques and in such amounts as management deems appropriate. We are not obligated to repurchase any specific number of shares, and the timing and actual number of shares repurchased will depend on a variety of factors, including our stock price, general economic, business and market conditions, and alternative investment opportunities.  We may discontinue any repurchases of our common stock at any time without prior notice.  In the fiscal year ended December 31, 2024, the Company repurchased 9,861,935 shares of common stock for an aggregate amount of $6,211 million (excluding the 1% excise tax on stock repurchases as a result of the Inflation Reduction Act of 2022).  As of December 31, 2024, $17.1 billion remains available for repurchases.\nOur primary uses of cash include the acquisition, licensing and production of content, marketing programs, streaming delivery and personnel-related costs, as well as strategic acquisitions and investments.  Cash payment terms for non-original content have historically been in line with the amortization period.  Investments in original content, and in particular content that we produce and own, require more cash upfront relative to licensed content.  For example, production costs are paid as the content is created, well in advance of when the content is available on the service and amortized.  We expect to continue to significantly invest in global content, particularly in original content, which will impact our liquidity.  We currently anticipate that cash flows from operations, available funds and access to financing sources, including our revolving credit facility, will continue to be sufficient to meet our cash needs for the next twelve months and beyond. \nOur material cash requirements from known contractual and other obligations primarily relate to our content, debt and lease obligations.  As of December 31, 2024, the expected timing of those payments are as follows:\nContractual obligations (in thousands):\nTotal\nNext 12 Months\nBeyond 12 Months\nContent obligations (1)\n$\n23,248,931 \n$\n11,424,696 \n$\n11,824,235 \nDebt (2)\n19,841,462 \n2,486,945 \n17,354,517 \nOperating lease obligations (3)\n2,761,120 \n514,625 \n2,246,495 \nTotal\n$\n45,851,513 \n$\n14,426,266 \n$\n31,425,247 \n \n(1)\nAs of December 31, 2024, content obligations were comprised of $4.4 billion included in \"Current content liabilities\" and $1.8 billion of \"Non-current content liabilities\" on the Consolidated Balance Sheets and $17.0 billion of obligations that are not reflected on the Consolidated Balance Sheets as they did not then meet the criteria for recognition.\nContent obligations include amounts related to the acquisition, licensing and production of content. An obligation for the production of content includes non-cancelable commitments under creative talent and employment agreements and other production related \n24\nTable of Contents\ncommitments.  An obligation for the acquisition and licensing of content is incurred at the time we enter into an agreement to obtain future titles.  Once a title becomes available, a content liability is recorded on the Consolidated Balance Sheets.  Certain agreements include the obligation to license rights for unknown future titles, the ultimate quantity and/or fees for which are not yet determinable as of the reporting date.  Traditional film output deals, or certain TV series license agreements where the number of seasons to be aired is unknown, are examples of these types of agreements. The contractual obligations table above does not include any estimated obligation for the unknown future titles, payment for which could range from less than one year to more than five years.  However, these unknown obligations are expected to be significant and we believe could include approximately $1 billion to $4 billion over the next three years, with the payments for the vast majority of such amounts expected to occur after the next twelve months.  The foregoing range is based on considerable management judgments and the actual amounts may differ. Once we know the title that we will receive and the license fees, we include the amount in the contractual obligations table above.\n(2)\nDebt obligations include our Notes consisting of principal and interest payments.  See Note 6 \nDebt\n in the accompanying notes to our consolidated financial statements for further details. \n(3)\nOperating lease obligations are comprised of operating lease liabilities included in \"Accrued expenses and other liabilities\" and \"Other non-current liabilities\" on the Consolidated Balance Sheets, inclusive of imputed interest. Operating lease obligations also include additional obligations that are not reflected on the Consolidated Balance Sheets as they did not meet the criteria for recognition. As of December 31, 2024, the Company has additional operating leases for real estate that have not yet commenced of $38 million which has been included above. See Note 5 \nBalance Sheet Components \nin the accompanying notes to our consolidated financial statements for further details regarding leases. \nAs of December 31, 2024, we had gross unrecognized tax benefits of $432 million, of which $302 million was classified in “Other non-current liabilities\" in the Consolidated Balance Sheets.  At this time, an estimate of the range of reasonably possible adjustments to the balance of unrecognized tax benefits cannot be made.  In addition, we may be required to pay deposits of approximately $800 million related to certain direct and indirect taxes in the next twelve months, which are in excess of our typical annual obligations.\nCash Flows\nThe following table summarizes our cash flows:\n \nYear Ended December 31,\nChange\n \n2024\n2023\n2022\n2024 vs. 2023\n(in thousands)\nNet cash provided by operating activities\n$\n7,361,364 \n$\n7,274,301 \n$\n2,026,257 \n$\n87,063 \n1 \n%\nNet cash provided by (used in) investing activities\n(2,181,784)\n541,751 \n(2,076,392)\n(2,723,535)\n(503)\n%\nNet cash used in financing activities\n(4,074,427)\n(5,950,803)\n(664,254)\n(1,876,376)\n(32)\n%\nNet cash provided by operating activities for the year ended December 31, 2024 increased $87 million as compared to the year ended December 31, 2023, primarily driven by a $3,304 million or 61% increase in net income, an increase in adjustments for non-cash expenses, and favorable changes in working capital, partially offset by an increase in payments for content assets.  The payments for content assets increased $3,862 million, from $13,140 million to $17,003 million, or 29%.\nNet cash provided by (used in) investing activities for the year ended December 31, 2024 decreased $2,724 million as compared to the year ended December 31, 2023, primarily due to there being no maturities of investments in the year ended December 31, 2024, as compared to maturities of investments of $1,395 million in the year ended December 31, 2023, coupled with an increase in purchases of investments of $1,237 million and an increase in purchases of property and equipment of $91 million.\nNet cash used in financing activities for the year ended December 31, 2024 decreased $1,876 million as compared to the year ended December 31, 2023, primarily due to proceeds from the issuance of debt of $1,794 million in the year ended December 31, 2024 and a $663 million increase in the proceeds from the issuance of common stock. These cash inflows were partially offset by the repayment upon maturity of the $400 million aggregate principal amount of our 5.750% Senior Notes in the year ended December 31, 2024 as compared to no repayments of debt in the corresponding period in 2023, coupled with a $218 million increase in the repurchases of common stock.\nIndemnifications\nThe information set forth under Note 8 \nCommitments and Contingencies\n in the accompanying notes to our consolidated financial statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K is incorporated herein by reference.\n25\nTable of Contents\nCritical Accounting Estimates\nThe preparation of consolidated financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reported periods. The Securities and Exchange Commission (\"SEC\") has defined a company’s critical accounting policies as the ones that are most important to the portrayal of a company’s financial condition and results of operations, and which require a company to make its most difficult and subjective judgments. Based on this definition, we have identified the critical accounting policies and judgments addressed below. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances. Actual results may differ from these estimates.\nContent \nWe acquire, license and produce content, including original programming, in order to offer our members unlimited viewing of video entertainment.  The content licenses are for a fixed fee and specific windows of availability.  Payment terms for certain content licenses and the production of content require more upfront cash payments relative to the amortization expense.  Payments for content, including additions to content assets and the changes in related liabilities, are classified within \"Net cash provided by operating activities\" on the Consolidated Statements of Cash Flows.\nWe recognize content assets (licensed and produced) as \"Content assets, net\" on the Consolidated Balance Sheets.  For licensed content, we capitalize the fee per title and record a corresponding liability at the gross amount of the liability when the license period begins, the cost of the title is known and the title is accepted and available for streaming.  For produced content, we capitalize costs associated with the production, including development costs, direct costs and production overhead. \nBased on factors including historical and estimated viewing patterns, we amortize the content assets (licensed and produced) in “Cost of revenues” on the Consolidated Statements of Operations over the shorter of each title's contractual window of availability or estimated period of use or ten years, beginning with the month of first availability.  The amortization is on an accelerated basis, as we typically expect more upfront viewing, and film amortization is more accelerated than TV series amortization.  On average, over 90% of a licensed or produced content asset is expected to be amortized within four years after its month of first availability.  We review factors that impact the amortization of the content assets on a regular basis.  Our estimates related to these factors require considerable management judgment.\nIn the normal course of business, we, or a third-party producing content on our behalf, may qualify for tax incentives through eligible spend on productions. The accounting for tax incentives is dependent on the particular type of incentive, including the nature of the benefit and the location the incentive is earned. In general, tax incentives are realized as cash receipts and may be received prior to or after a title launches on our service. Upon a title’s launch, any amounts we are eligible for through qualified production spend but have not received, are recognized in “Other current assets” or “Other non-current assets” on the Consolidated Balance Sheets as receivables. Tax incentives are generally accounted for as a reduction to the cost basis of content assets (presented in “Content assets, net”) and reduce content amortization over the life of the title (as presented in “Cost of revenues”) on the Consolidated Statements of Operations.\nOur business model is subscription based as opposed to a model generating revenues at a specific title level.  Content assets (licensed and produced) are predominantly monetized as a group and therefore are reviewed at a group level when an event or change in circumstances indicates a change in the expected usefulness of the content or that the fair value may be less than unamortized cost.  To date, we have not identified any such event or changes in circumstances.  If such changes are identified in the future, these aggregated content assets will be stated at the lower of unamortized cost or fair value.  In addition, unamortized costs for assets that have been, or are expected to be, abandoned are written off. \nIncome Taxes\nWe record a provision for income taxes for the anticipated tax consequences of our reported results of operations using the asset and liability method.  Deferred income taxes are recognized by applying enacted statutory tax rates applicable to future years to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases as well as net operating loss and tax credit carryforwards.  The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date.  The measurement of deferred tax assets is reduced, if necessary, by a valuation allowance when it is more likely than not they will not be realized. \nAlthough we believe our assumptions, judgments and estimates are reasonable, changes in tax laws or our interpretation of tax laws and the resolution of any tax audits could significantly impact the amounts provided for income taxes in our consolidated financial statements.\nIn evaluating our ability to recover our deferred tax assets, in full or in part, we consider all available positive and negative evidence, including our past operating results, our forecast of future earnings and future taxable income,  and prudent and feasible tax planning strategies.  The assumptions utilized in determining future taxable income require significant judgment and are consistent with the plans and estimates we are using to manage the underlying business.  Actual operating results in future years could differ from our current assumptions, judgments and estimates.\n26\nTable of Contents\nWe do not recognize certain tax benefits from uncertain tax positions within the provision for income taxes.  We may recognize a tax benefit only if it is more likely than not the tax position will be sustained on examination by the taxing authorities, based on the technical merits of the position.  The tax benefits recognized in the financial statements from such positions are then measured based on the largest benefit that has a greater than 50% likelihood of being realized upon settlement.  Due to uncertainties in any tax audit outcome, our estimates of the ultimate settlement of our unrecognized tax positions may change and the actual tax benefits may differ significantly from the estimates.   \nSee Note 10 \nIncome Taxes \nto the consolidated financial statements for further information regarding income taxes.\nRecent Accounting Pronouncements\nThe information set forth under Note 1 to the consolidated financial statements under the caption “Basis of Presentation and Summary of Significant Accounting Policies” is incorporated herein by reference.",
  "item2": null
}