{
  "source_file": "nix-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nBusiness\nNiSource Inc. is an energy holding company under the Public Utility Holding Company Act of 2005 whose primary subsidiaries are fully regulated natural gas and electric utility companies, serving approximately 3.8 million customers in six states. NiSource is the successor to an Indiana corporation organized in 1987 under the name of NIPSCO Industries, Inc., which changed its name to NiSource Inc. on April 14, 1999.\nNiSource’s principal subsidiaries include NiSource Gas Distribution Group, Inc. (a holding company that owns Columbia of Kentucky, Columbia of Maryland, Columbia of Ohio, Columbia of Pennsylvania, and Columbia of Virginia), and NIPSCO Holdings I (a holding company that owns a controlling interest in NIPSCO, a gas and electric utility). NiSource derives substantially all of its revenues and earnings from the operating results of these rate-regulated businesses.\nBusiness Strategy\nOur business strategy focuses on providing safe and reliable service through our core, rate-regulated, asset-based utilities, with the goal of adding value to all of our stakeholders. Our utilities continue to advance our core safety, infrastructure and environmental investment programs, supported by complementary regulatory and customer initiatives across the six states in which we operate. Our goal is to develop strategies that (i) support long-term infrastructure investment and safety programs to better serve our customers, (ii) align our tariff structures with our cost structure, and (iii) drive value and enable growth in an evolving energy ecosystem. These strategies focus on improving safety and reliability, enhancing customer experience, pursuing regulatory and legislative initiatives to increase accessibility for customers currently not on our gas and electric service, ensuring customer affordability and reducing emissions while generating sustainable returns.\nWe remain committed to the advancement of our SMS for the safety of our customers, communities and employees. Our SMS is the established operating model within NiSource. NiSource continues to maintain its certification to the American Petroleum Institute Recommended Practice 1173, which serves as the guiding practice for our SMS. In 2024, NiSource was recognized with the ISO 55001 certification from LRQA, one of the world’s leading providers of professional engineering and technology services. Achieving this international certification for asset management systems recognizes NiSource’s commitment to safety for our people, systems and customers. These certifications are important milestones for our SMS and NiSource’s ongoing journey towards operational excellence. \nNiSource has two reportable segments: Columbia Operations and NIPSCO Operations. The remainder of our operations, which are not significant enough on a stand-alone basis to warrant treatment as an operating segment, consist of our centralized corporate activities and are primarily comprised of interest expense on holding company debt and unallocated corporate costs and activities. The following is a summary of the business for each reporting segment. Refer to Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 21, \"Business Segment Information,\" in the Notes to Consolidated Financial Statements for additional information related to each segment.\nColumbia Operations\nColumbia Operations provides natural gas to approximately 2.4 million residential, commercial and industrial customers in Ohio, Pennsylvania, Virginia, Kentucky, and Maryland. We operate approximately 37,200 miles of distribution main pipeline plus the associated individual customer service lines and 330 miles of transmission main pipeline located in our service areas described above. Throughout our service areas we also have gate stations and other operations support facilities. See below for information on our owned operating facilities. There were no significant disruptions to our system or facilities during 2024.\nFacility Name\nLocation\nType\nStorage Capacity (MCF)\nBlackhawk Underground Storage\n(1)\nBeaver Falls, PA\nNatural Gas\n1,700,000 \nEagle Cove Propane\nPetersburgh, VA\nPropane Gas\n863 \nSouth Wales Propane\nJeffersonton, VA\nPropane Gas\n863 \nPortsmouth Propane-Air\nPortsmouth, VA\nPropane-Air Gas\n17,300 \nTotal Capacity\n1,719,026 \n(1)\nNiSource has entered into an agreement to sell this facility, subject to approval by the Pennsylvania Public Utility Commission.\n7\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nCompetition.\n Due to open access and the deregulation of natural gas supplies, our LDC customers can purchase gas directly from producers and marketers in an open, competitive market. Certain of our subsidiaries are involved in programs that provide our residential and commercial customers the opportunity to purchase their natural gas requirements from third parties and use our subsidiaries for transportation services. As of December 31, 2024, 33.9% of our residential customers and 41.2% of our commercial customers participated in such programs.\nWe compete with (i) investor-owned, municipal, and cooperative electric utilities throughout our service areas, (ii) other regulated and unregulated natural gas intra and interstate pipelines and (iii) other alternate fuels, such as propane and fuel oil. We continue to be a well-positioned competitor in the energy markets in which we operate due to customer preference for natural gas. \nAdditionally, we are subject to seasonal fluctuations in sales. Revenues from our gas distribution operations are more significant during the heating season, which is from October through May. Please refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results and Discussion of Operations - Columbia Operations,\" for additional information.\nNIPSCO Operations\nNIPSCO Gas\nNIPSCO Gas distributes natural gas to approximately 0.9 million customers in northern Indiana. We operate approximately 17,900 miles of distribution main pipeline plus the associated individual customer service lines and 690 miles of transmission main pipeline located in our northern Indiana service areas. Throughout northern Indiana, we also have gate stations and other operations support facilities. See below for information on our owned operating facilities. There were no significant disruptions to our system or facilities during 2024.\nFacility Name\nLocation\nType\nStorage Capacity (MCF)\nRoyal Center Underground Storage\nRoyal Center, IN\nNatural Gas\n7,240,000 \nRolling Prairie LNG\nRolling Prairie, IN\nLiquified Natural Gas\n4,000,000 \nTotal Capacities\n11,240,000 \nCompetition.\n Similar to the Columbia Operations segment, NIPSCO Gas also operates in an open and competitive market which allows retail customers to purchase gas directly from producers and marketers. As of December 31, 2024, 6.7% of our residential customers and 17.6% of our commercial customers participated in such programs.\nWe compete with (i) investor-owned, municipal, and cooperative electric utilities throughout our northern Indiana service area, (ii) other regulated and unregulated natural gas intra and interstate pipelines and (iii) other alternate fuels, such as propane and fuel oil. \nAdditionally, we are subject to seasonal fluctuations in sales. Revenues from our gas distribution operations are more significant during the heating season, which is from October through May. Please refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results and Discussion of Operations - NIPSCO Operations,\" for additional information.\n8\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Electric \nWe generate, transmit and distribute electricity to approximately 0.5 million customers in 20 counties in the northern part of Indiana and also engage in wholesale electric and transmission transactions. Our transmission system, has voltages from 69,000 to 765,000 volts, and consists of approximately 3,000 circuit miles. We are interconnected with eight neighboring electric utilities. We operate 66 transmission and 250 distribution substations, and own approximately 311,300 poles. We own and operate generation assets as well as source power through PPAs. We continue to transition our generation portfolio from coal-fired generation to lower-emission sources. We currently have six owned renewable generation facilities in service: Rosewater, Indiana Crossroads Wind, Indiana Crossroads Solar, Dunns Bridge I Solar, Cavalry Solar and Storage and Dunns Bridge II Solar and Storage. Cavalry Solar and Storage went into service May 2024 and Dunns Bridge II Solar and Storage went into service in January 2025. As of December 31, 2024, we have multiple PPAs that provide 600 MW of capacity, with contracts expiring between 2038 and 2040. We also operate two hydro electric generation facilities, a CCGT, and two coal generation facilities. The R.M. Schahfer coal facility is scheduled to be retired by the end of 2025 and the Michigan City coal facility is scheduled to be retired by the end of 2028. Our generating facilities had no material unplanned interruptions during 2024. See below for information on our owned generating facilities:\nFacility Name\nLocation\nFuel Type\nGenerating Capacity (MW)\n(1)\nR.M. Schahfer\nWheatfield, IN\nSteam - Coal\n722 \nMichigan City\nMichigan City, IN\nSteam - Coal\n455 \nSugar Creek\n(2)\nWest Terre Haute, IN\nCCGT\n578 \nR.M. Schahfer\nWheatfield, IN\nNatural Gas\n155 \nOakdale\nCarroll County, IN\nHydro\n9 \nNorway\nWhite County, IN\nHydro\n7 \nRosewater\n(3)\nWhite County, IN\nWind\n102 \nIndiana Crossroads Wind\n(3)\nWhite County, IN\nWind\n302 \nDunns Bridge I\n(3)\nJasper County, IN\nSolar\n265 \nIndiana Crossroads Solar\n(3)\nWhite County, IN\nSolar\n200 \nCavalry Solar and Storage\n(4)\nWhite County, IN\nSolar and Storage\n200 \nDunns Bridge II\n(4)\nJasper County, IN\nSolar and Storage\n435 \nTotal MW Capacity\n3,430 \n(1)\nRepresents current net generating capability of each fossil fuel and hydro generating facility. Nameplate capacity is listed for wind and solar generating facilities.\n(2)\nRepresents capacity as of December 31, 2024. Sugar Creek is expected to further increase capacity pending MISO approval in 2025.\n(3)\nNIPSCO is the managing partner of these JVs. Refer to Note 4, \"Noncontrolling Interests,\" in the Notes to Consolidated Financial Statements for more information. \n(4)\nCavalry Solar and Storage has installed battery storage capacity of 45MW over a four-hour duration. Dunns Bridge has installed battery storage capacity of 56MW over a four-hour duration.\nNIPSCO's 2024 Integrated Resource Plan (\"2024 Plan\") was submitted to the IURC in December 2024. The 2024 Plan informs future generation investments required to ensure reliability for NIPSCO's customers and incorporated factors such as anticipated load growth from data centers and other economic development opportunities, new EPA emissions rules, and evolving MISO resource accreditation rules. The 2024 Plan maintains the retirement decisions and capacity additions identified in the 2018 and 2021 Integrated Resource Plans and calls for additional generation resources through 2029 to support capacity requirements. In addition, if significant new data center load is contracted, the 2024 Plan calls for additional gas-fired resources to support that additional capacity. Refer to Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations” for further discussion of these plans.\n9\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO participates in the MISO transmission service and wholesale energy market. MISO is a nonprofit organization created in compliance with FERC regulations to improve the flow of electricity in the regional marketplace and to enhance electric reliability. Additionally, MISO is responsible for managing energy markets, transmission constraints and the day-ahead, real-time, Financial Transmission Rights and ancillary markets. NIPSCO has transferred functional control of its electric transmission assets to MISO, and transmission service for NIPSCO occurs under the MISO Open Access Transmission Tariff. NIPSCO generating units are dispatched by MISO which takes into account economics, reliability of the MISO system and unit availability. During the year ended December 31, 2024, NIPSCO generating units, inclusive of its owned renewable generation facilities, were dispatched to meet 55.4% of its overall system load, and the remainder of the overall system load was procured through PPAs and the MISO market.\nCompetition.\n Our NIPSCO Electric utility generally has exclusive service areas under Indiana regulations and retail electric customers in Indiana do not have the ability to choose their electric supplier. NIPSCO faces non-utility competition from other energy sources, such as self-generation by large industrial customers and other distributed energy sources.\nOur NIPSCO Operations are subject to seasonal fluctuations in sales. Revenues from electric operations are more significant during the cooling season, which is primarily from June through September. Please refer to Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results and Discussion of Operations - NIPSCO Operations,\" for additional information.\nRegulatory\nThe regulatory landscape, at both the state and federal levels, continues to evolve, impacting the operations and financial results of our operating companies. Management continually seeks new ways to be more competitive and efficient in this environment, while keeping service and affordability for customers at the forefront. We believe we are, in all material respects, in compliance with such laws and regulations and do not expect future compliance requirements to have a material impact on our capital expenditures, earnings, or competitive position. While we continue to monitor existing and pending laws and regulations, the impact of regulatory changes cannot be predicted with certainty.\nRate Case Actions. \nThe following table describes current rate case actions as applicable in each of our jurisdictions. See \"Cost Recovery and Trackers\" below for further detail on trackers.\n(in millions)\nCompany\nApproved ROE\nRequested Incremental Revenue\nApproved Incremental Revenue\nFiling Date\nRates \nEffective\nApproved Rates Cases\nColumbia of Pennsylvania\n(1)\nNone specified\n$\n124.1 \n$\n74.0 \nMarch 15, 2024\nDecember 2024\nColumbia of Maryland\n(1)\nNone specified\n$\n6.5 \n$\n3.9 \nMay 12, 2023\nDecember 2023\nColumbia of Kentucky\n9.75 \n%\n$\n23.8 \n$\n14.3 \nMay 16, 2024\nJanuary 2025\nColumbia of Virginia\n(2)\nNone specified\n$\n40.5 \n$\n25.8 \nApril 29, 2022\nOctober 2022\nColumbia of Ohio\n9.60 \n%\n$\n221.4 \n$\n68.3 \nJune 30, 2021\nMarch 2023\nNIPSCO - Gas\n(3)\n9.75 \n%\n$\n161.9 \n$\n120.9 \nOctober 25, 2023\nAugust 2024\nNIPSCO - Electric\n(4)\n9.80 \n%\n$\n291.8 \n$\n261.9 \nSeptember 19, 2022\nAugust 2023\nPending Rate Cases\nNIPSCO - Electric\n(5)\nIn process\n$\n368.7 \nIn process\nSeptember 12, 2024\nSeptember 2025\nColumbia of Virginia\n(6)\nIn process\n$\n37.2 \nIn process\nApril 29, 2024\nOctober 2024\nColumbia of Maryland\nIn process\n$\n10.7 \nIn process\nSeptember 24, 2024\nApril 2025\n(1) \nNo approved ROE is identified for this matter since the approved revenue increase is the result of a black box settlement under which parties agree upon the amount of increase.\n(2)\nThe approved rate case resulted in a black box settlement, representing a settlement to a specific revenue increase but not a specified ROE. The settlement provides use of a 9.70% ROE for future SAVE filings.\n(3)\nNew rates were implemented in 2 steps, with implementation of Step 1 rates effective in August 2024 and Step 2 rates to be effective no later than March 2025.\n(4)\nNew rates were implemented in 2 steps, with implementation of Step 1 rates in August 2023 and Step 2 rates effective in March 2024. \n(5)\nOn February 7, 2025, NIPSCO and certain intervening parties filed a Joint Stipulation and Settlement Agreement with the IURC reflecting an annual revenue increase of $257.0 million. New rates proposed to be implemented in 2 steps, with implementation of Step 1 rates effective no later than September 2025 and Step 2 rates to be effective no later than March 2026.\n(6)\nRates are effective on an as filed basis and subject to refund. Columbia of Virginia and certain intervening parties, filed a Joint Stipulation and Proposed Recommendation for settlement on December 5, 2024, for an annual revenue increase of $28.2 million, net of SAVE.\n10\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nFERC.\n Our service company and operating companies are subject to varying degrees of regulation by the FERC. NiSource Corporate Services files a FERC Form 60 annual report with its financial information as a FERC jurisdictional centralized service company. NiSource also files an annual FERC Form 61 which contains a narrative description of the service company's functions during the prior calendar year.\nAs natural gas LDCs, Columbia of Maryland, Columbia of Ohio, Columbia of Pennsylvania, Columbia of Virginia, Columbia of Kentucky and NIPSCO have limited jurisdictional certificates to transport gas in their respective service territories and into interstate \ncommerce. \nAs an electric company, NIPSCO has Market Based Rate authority and is a Transmission Owner subject to FERC jurisdiction. NIPSCO files the following reports annually: \n•\nFERC Form 1, which is a comprehensive financial and operating report, \n•\nFERC Form 566, which is a list of its 20 largest purchases of electricity over the past three years, \n•\nFERC Form 715, which is its Annual Transmission Planning and Evaluation Report and the base case power flow data from the Eastern Interconnection Reliability Assessment Group Multiregional Modeling Working Group, which was used by NIPSCO for transmission planning and, \n•\nFERC Form 730, which is NIPSCO’s Report of Transmission Investment Activity. \nAs a Transmission Owner subject to the MISO Transmission Owners Agreement and Tariff, NIPSCO has various FERC jurisdictional obligations such as maintaining its Attachment O formula rates and corresponding protocols. NIPSCO also has FERC approvals to make affiliate transactions between itself and various JVs. NIPSCO’s officers, on the electric side, are also subject to FERC’s interlocking directorate rules and reporting requirements.\nRegulatory Framework.\n The gas distribution activities of our Columbia and NIPSCO Operations have pursued non-traditional revenue sources within the evolving natural gas marketplace. These efforts include (i) gas supply cost incentive mechanisms for service to their core markets, and (ii) the sale of on-system services in the companies’ service territories. The on-system services are offered by us to customers and include products such as the transportation and balancing of gas on the gas distribution operations utility's system. The incentive mechanisms give the gas distribution operations utilities an opportunity to share in the savings created from such situations as gas purchases made below an agreed upon benchmark price and the remarketing of unused pipeline capacity to reduce overall pipeline costs.\nWe recognize that energy efficiency reduces emissions, conserves natural resources and saves our customers money. Our gas distribution companies offer programs such as energy efficiency upgrades, home checkups and weatherization services. The increased efficiency of natural gas appliances and improvements in home building codes and standards contribute to a long-term trend of declining average use per customer. While we are looking to expand offerings so the energy efficiency programs can benefit as many customers as possible, our gas distribution operations utilities have pursued changes in rate design to more effectively match recoveries with costs incurred. Columbia of Ohio has adopted a straight fixed variable rate design for residential and small commercial customers that closely links the recovery of fixed costs with fixed charges. Columbia of Maryland and Columbia of Virginia have regulatory approval for weather and revenue normalization adjustments for certain customer classes, which adjust monthly revenues that exceed or fall short of approved levels. Columbia of Pennsylvania continues to operate its pilot residential weather normalization adjustment and also has a fixed customer charge. This weather normalization adjustment only adjusts revenues when actual weather compared to normal varies by more than 3%. Columbia of Kentucky incorporates a weather normalization adjustment for certain customer classes and also has a fixed customer charge.\n NIPSCO Gas and Electric include a fixed customer charge for residential and small commercial and industrial customer classes. NIPSCO Gas has also received approval and implemented a weather normalization adjustment for certain of its customer classes. \nWhile increased efficiency of electric appliances and improvements in home building codes and standards have similarly impacted the average use per electric customer in recent years, NIPSCO expects future growth in per customer usage as a result of increasing electric applications, such as electric vehicles. These ongoing changes in use of electricity will likely lead to development of innovative rate designs, and NIPSCO will continue efforts to design rates that increase the certainty of recovery of fixed costs.\n11\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nCost Recovery and Trackers. \nComparability of our operating results is impacted by regulatory trackers that allow for the recovery in rates of certain costs. Certain approved regulatory tracker mechanisms allow for abbreviated regulatory proceedings in order for the operating companies to quickly implement revised rates and recover associated costs.\nA portion of the NIPSCO Operations' and Columbia Operations' gas distribution revenue is related to the recovery of gas costs through GCA's, the review of which occurs through standard regulatory proceedings. All states in our operating area require periodic review of actual gas procurement activity to determine prudence and confirm the recovery of prudently incurred energy commodity costs supplied to customers.\nA portion of the NIPSCO Operations' revenue is related to the recovery of fuel costs to generate power and the fuel costs related to purchased power. These costs are recovered through a FAC, which is updated quarterly to reflect actual costs incurred to supply electricity to customers.\nPolitical Action\nThe NiSource Political Action Committee (\"NiPAC\") provides our employees a voice in the political process. NiPAC is a voluntary, employee driven and funded political action committee, and NiPAC makes bipartisan political contributions to local, state and federal candidates where permitted and in accordance with established guidelines. Consistent with our commitments and our approach to engagement, the NiPAC leadership committee members evaluate candidates for support on issues important to our business.\nEnvironmental and Safety Matters\nPHMSA Legislation and Regulations\nTo fulfill our vision of being a trusted energy provider, we follow safety practices required by regulations and we implement our Safety Management System (\"SMS\"). SMS serves as the framework to identify and reduce risks and ensure consistent safety processes, procedures and operations across the organization. \nAs directed by law in the Protecting Our Infrastructure of Pipelines and Enhancing Safety (PIPES) Act of 2020, PHMSA has revised, and continues to revise, the pipeline safety regulations focused on public safety and environmental hazard mitigation. Specific areas of focus for upcoming rulemaking include leak detection and repair criteria (the \"LDAR\" rule) and regulations that require operators to upgrade their existing low-pressure regulating stations with enhanced safeguards and update distribution integrity management plans, emergency response plans, and operation and maintenance plans (the Safety of Gas Distribution Pipelines, or \"SGDP\" rule). \nIn May 2023, PHMSA proposed regulatory revisions under the PIPES Act of 2020 to minimize methane emissions and improve public safety. Under the proposed revisions, our subsidiaries would be required to detect and repair an increased number of gas leaks, reduce the time to repair leaks, increase leak survey, and expand our existing advanced leak detection program. In January 2025, PHMSA submitted a final LDAR rule to the Federal Register and is currently suspended.\nIn September 2023, PHMSA proposed additional regulatory revisions under the PIPES Act of 2020 to enhance distribution system safety through equipment and procedural expectations in the form of the SGDP rule. Operators will be required to incorporate additional protections for low pressure distribution systems that prevent over-pressurization, amend construction procedures designed to minimize the risk of incidents caused by system over-pressurization, and update distribution integrity management programs to cover and prepare for over-pressurization incidents. PHMSA did not progress the SGDP rulemaking in 2024.\nWe continue to evaluate and monitor PHMSA legislation and regulations but cannot predict the impact of changing pipeline safety regulations on our business at this time.\nClimate Change Issues\nPhysical Climate Risks.\n Increased frequency of severe and extreme weather events associated with climate change could materially impact our facilities, energy sales, and results of operations. We are unable to predict these events. However, we perform assessments of physical risk, including physical climate risk, to our business. More extreme and volatile temperatures, increased storm intensity and flooding, and more volatile precipitation leading to changes in lake and river levels are among the weather events that are most likely to impact our business. Efforts to mitigate these physical risks continue to be implemented.\n12\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nTransition Climate Risks and Opportunities\n.\n We actively engage with and monitor the impact that proposed legislative and regulatory programs related to GHG emissions would have on our business. Refer to Item 1A. Risk Factors, \"Operational Risks,\" of this Annual Report on Form 10-K for further detail. \nRegarding federal policies, we continue to monitor the status of climate change-related legislation and regulation, including the IIJA, IRA, and EPA's Waste Emissions Charge for Petroleum and Natural Gas systems. We have identified and pursued potential opportunities associated with the IIJA and the IRA that align with our strategy. These opportunities include tax incentives for renewable generation and storage projects, tax credit transferability and grant funding for grid resiliency, hydrogen hubs and leak detection. The new federal administration has signaled through executive actions a desire to roll-back several climate-related policies including funding for IIJA and IRA programs. We continue to evaluate and monitor how these changes will impact our business. \nIn May 2024, the EPA published final greenhouse gas standards and guidelines for fossil fuel-fired power plants. The rules are not expected to impact NIPSCO’s existing electric generation, but, depending on the outcome of ongoing litigation and potential future changes to the rules, may impose certain operational limitations on other existing and new electric generation. Through the 2024 NIPSCO IRP process, we assessed that cost to electric customers would be approximately $675 million greater due to these rules.\nWe also continue to monitor evolving state policies related to GHG emissions. The Climate Solutions Now Act of 2022 requires Maryland to reduce GHG emissions by 60% by 2031 (from 2006 levels), and it requires the state to reach net zero emissions by 2045. The Maryland Department of the Environment (\"MDE\") adopted a plan to achieve its 2031 goal and is required to adopt a plan for their 2045 net zero goal by 2030. The Act also enacts a state policy to move to broader electrification of both existing buildings and new construction. In December 2024, the Maryland Department of the Environment issued updated final Building Energy Performance Standards, which would require net zero direct greenhouse gas emissions from large buildings by 2040 with interim targets, or payments of an alternative compliance fee. Columbia of Maryland is advocating for compliance pathways that use RNG, hydrogen, new technologies and emissions offsets. Under an executive order, Maryland is also developing a Clean Heat Standard and a Zero-Emission Heating Equipment Standard that are intended to transition gas appliances to electric heat pumps. Separately, the PSC has also initiated a proceeding related to Near-Term, Priority Actions and Comprehensive, Long-Term Planning for Maryland's Gas Companies. Columbia of Maryland cannot predict the final impact of these policies on our business at this time.\nNet Zero Goal. \nIn November 2022, we announced a goal of net zero greenhouse gas emissions by 2040, covering both Scope 1 and Scope 2 GHG emissions (\"Net Zero Goal\"). Our Net Zero Goal builds on greenhouse gas emission reductions achieved to-date. We plan to achieve our Net Zero Goal primarily through the continuation and enhancement of existing programs, such as retiring and replacing coal-fired electric generation with low- or zero-emission electric generation, ongoing pipe replacement and modernization programs, and deployment of advanced leak-detection technologies. In addition, we plan to advance other low- or zero-emission energy resources and technologies, which may include hydrogen, renewable natural gas, long-duration storage, and/or deployment of carbon capture and utilization technologies, if and when these become technologically and economically feasible. Carbon offsets and renewable energy credits may also be used to support achievement of our Net Zero Goal. As of the end of 2023, we had reduced Scope 1 GHG emissions by approximately 72% from 2005 levels.\nOur greenhouse gas emissions projections, including achieving a Net Zero Goal, are subject to various assumptions that involve risks and uncertainties, and did not include any assumptions related to data center development and associated load growth. We remain committed to our Net Zero Goal, however, certain of our interim goals may evolve as we assess and respond to business opportunities such as data centers. Achievement of our Net Zero Goal by 2040 will require supportive regulatory and legislative policies, favorable stakeholder environments and advancement of technologies that are not currently economically or technologically feasible to deploy at scale, as well as execution of our business plan. Otherwise, our actual results or ability to achieve our Net Zero Goal, including by 2040, may differ materially.\nAs discussed in Management's Discussion within \"Results and Discussion of Operations - NIPSCO Operations,\" NIPSCO continues to execute its electric generation transition consistent with the preferred pathways identified in its 2018, 2021 and 2024 Integrated Resource Plans. Additionally, as discussed in Management's Discussion within \"Executive Summary - Energy Transition\" and \"Liquidity and Capital Resources - Regulatory Capital Programs,\" our natural gas distribution companies are lowering methane emissions by replacing aging infrastructure, which also increases safety and reliability for customers and communities.\n13\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nHuman Capital\nHuman Capital Management Governance and Organizational Practices\n. The Compensation and Human Capital Committee (\"C&HC Committee\") of our Board of Directors (the \"Board\") is primarily responsible for assisting the Board in overseeing our human capital management practices. The C&HC Committee reviews our human capital management function and programs. The review of related procedures, programs, policies and practices allows the committee to make recommendations to management with respect to equal employment opportunity, employee engagement, organizational health, and talent management.\nHuman Capital Goals and Objectives\n.\n \nWe have aligned our human capital goals to achieve overall company strategic and operational objectives by driving an enhanced talent strategy, elevating support for front-line leaders, fostering a culture of rigor and accountability, and strengthening our human resource function. We aspire to be an employer of choice, in part, through embedding inclusion throughout the enterprise and creating an enviable employee experience. \nWorkforce Composition\n.\n \nAs of December 31, 2024, we had 7,687 full-time and 59 part-time active employees (i.e., not interns, not on leave or disability). Of our total workforce, 32% were subject to collective bargaining agreements with various labor unions. These collective bargaining agreements were renegotiated in 2021 and 2023 and expire in 2026 and 2027, respectively.\nWe foster an enviable work environment where all employees are energized. In efforts to become an employer of choice, we have developed sourcing strategies to attract and retain the most qualified talent. Our executive leadership team is characterized by a diverse composition, with 75% representation from both people of color (\"POC\") and females. We have increased our overall population of females and POC in 2024.\nIn 2024, our Diversity of Slate process supported our talent acquisition team filling 1,565 roles with 831 external candidates. These external hires included 34% being filled with POC and 40% being filled with female candidates. These sourcing efforts led our organization across all businesses to make progress toward a workforce composition that embraces different perspectives.\nOur employee resource groups (ERGs) serve to create a culture of inclusion through their engagement of all employees throughout the year. We continue to develop ERG leaders to equip employees with the necessary tools to further support our efforts for advancement and strengthen our inclusive workplace. A key area for us has been our implementation and development of programs to drive higher retention and engagement of our employees, focusing on inclusive leadership training for Directors and Managers in the organization. Our commitment is grounded in the core belief that our purpose extends far beyond our primary role as a utility company. \nWe are committed to providing equal employment opportunities in each of our companies to all employees and applicants without regard to race, color, religion, national origin or ancestry, veteran status, disability, gender, age, marital status, sexual orientation, gender identity, genetic information, or any protected group status as defined by law. The input provided by our increasingly diverse workforce will continue to strengthen our corporate culture as well as drive constructive changes within our company to improve our operational strategies, enhance the quality of the services we provide, and increase revenue.\nTalent Attraction\n.\n \nTo recruit and hire individuals with a variety of skills, talents, backgrounds and experiences, we value and cultivate relationships with community and diversity outreach partners. We also target job fairs, including those focused on people of color, veteran, and female candidates while also partnering with local colleges and universities to identify and recruit qualified applicants.\nSimilar to other companies, we have focused on creating a flexible, agile model for roles that can be performed in a more remote setting. Our hybrid model recognizes differing ways of working; onsite, hybrid and remote. Most of our workforce is onsite and our hybrid and remote roles provide different avenues of working and seeking talent across our footprint. Hybrid employees work in a NiSource facility at least twice a week. This in-office presence supports colleague connection, development, in-person mentoring, and broader team building.\nTalent Development and Retention\n.\n \nWe offer leadership development programs to enhance the behaviors and skills of our existing and future leaders. In 2024, we had participation from employees of all levels. We also offer extensive technical and non-technical employee development training programs.\n14\nTable of Contents\nITEM 1. BUSINESS\nN\nI\nS\nOURCE\n I\nNC\n.\nWe strive to provide promotion and advancement opportunities for employees. In 2024, for all leadership positions at the supervisor and above level posted externally, we filled 64% with internal employees. We also develop and implement targeted development action plans to increase succession candidate readiness for leadership roles. Additionally, we monitor the risk and potential impact of talent loss and take action to increase retention of top talent. Retention in 2024 was 93%. We calculate retention as 100 minus the total number of separations divided by the average headcount for the annual period. These separations break down into involuntary separations (2%), resignations (3%), and retirements (2%). \nSuccession Planning\n. We perform succession planning annually for officer level positions to ensure that we develop and sustain a strong bench of talent capable of performing at the highest levels. Talent is identified, and potential paths of development are discussed, to ensure that employees have an opportunity to build their skills to be well-prepared for future roles. We maintain formal succession plans for our CEO and key officers. The succession plan for our CEO is reviewed by the Environmental, Social, Nominating and Governance Committee and the succession plans for key officers (other than the CEO) and critical roles are reviewed by the Compensation and Human Capital Committee annually or more frequently as needed.\nEmployee and Workplace Health and Safety\n.\n We have several programs to support employees, and their families’ well-being. These programs include competitive medical, dental, vision, life and long-term disability programs, including employee health savings account company contributions, telemedicine services, Employee Assistance Program, Integrated Health Management navigation services, and paid time off including wellness, sick/disability, parental leave, and illness in family days.\nWe also have a robust program to support employees, contractors and public safety, which is led by our Chief Safety Officer and is under the oversight of the Safety, Operations, Regulatory and Policy Committee of our Board. \nCulture and Engagement. \nOur culture is another important aspect of our ability to advance our strategic and operational objectives. In addition to recruiting, development and retention programs described above, we also invest in internal communications programs, including in-person and virtual learning and networking opportunities, as well as regular town hall communications to employees. We measure and monitor organizational health and employee engagement through various channels including employee lifecycle, pulse, and census surveys. \nTo instill and reinforce our values and culture, we require our employees to participate in regular training on ethics and compliance topics each year, including raising concerns, treating others with respect, preventing discrimination in the workplace, anti-bribery and corruption, data protection, unconscious biases, harassment, conflicts of interest, and how to use the anonymous ethics and compliance hotline. All employees receive training on our Code of Business Conduct annually or more frequently if there is a material change in content. Because of this training and other programs, we have learned from our most recent employee survey that our employees know what ethical violations look like and how to report them. Our Code of Business Conduct is designed to ensure that our employees adhere to legal and regulatory requirements, mitigate risks, and promote ethical behavior. Our ethics program is led by leadership tone at the top, policies and procedures, regular training and communication, monitoring and auditing, and a system for reporting and addressing violations. Our business ethics program, including the employee training program, is reviewed annually by our executive leadership team and the Audit Committee of our Board of Directors. \nOur Compensation and Human Capital Committee reviews reports from our Chief Human Resources Officer on employee engagement and corporate culture. Our Board reviews results and action plans related to our enterprise-wide comprehensive employee engagement survey. Our executive leadership team, including our CEO, communicates directly and regularly with all employees on timely ethics topics through electronic messages, coffee chats, and all-employee town hall meetings. These communications emphasize the importance of our values and culture in the workplace.\n15\nTable of Contents\n INFORMATION ABOUT OUR EXECUTIVE OFFICERS\nN\nI\nS\nOURCE\n I\nNC\n.\nThe following is a list of our Executive Officers, including their names, ages, offices held and other recent business experience.\nName\nAge\nOffice(s) Held in Past 5 Years\nLloyd M. Yates\n64 \nPresident and Chief Executive Officer of NiSource since February 2022 and Director since March 2020\nExecutive Vice President, Customer and Delivery Operations, and President, Carolinas Region, of Duke Energy Corporation from 2014 to 2019\nShawn Anderson\n43 \nExecutive Vice President and Chief Financial Officer of NiSource since March 2023\nSenior Vice President and Chief Strategy and Risk Officer from June 2020 to March 2023\nVice President, Strategy and Chief Risk Officer from January 2019 to May 2020\nMelody Birmingham\n53 \nExecutive Vice President, and President, NiSource Utilities of NiSource since March 2023\nExecutive Vice President, Chief Innovation Officer of NiSource from July 2022 to March 2023\nSenior Vice President and Chief Administrator Officer of Duke Energy Corporation from May 2021 to June 2022\nSenior Vice President, Supply Chain and Chief Procurement Officer of Duke Energy Indiana from 2018 to April 2021\nWilliam Jefferson, Jr\n63 \nExecutive Vice President, Chief Operating and Safety Officer of NiSource since May 2024\nExecutive Vice President, Operations and Chief Safety Officer of NiSource from July 2022 to May 2024\nStation Director at STPNOC, Wadsworth, Texas, from 2020 to May 2022 and Vice President in 2022\nMichael S. Luhrs\n52 \nExecutive Vice President, Strategy and Risk and Chief Commercial Officer of NiSource since March 2023\nSenior Vice President at Alliant Energy from 2022 to March 2023\nVice President at Duke Energy Corporation from 2013 to 2022\nKimberly S. Cuccia\n41 \nSenior Vice President, General Counsel and Corporate Secretary of NiSource since April 2022\nVice President, Interim General Counsel and Corporate Secretary of NiSource from December 2021 to April 2022\nVice President and Deputy General Counsel, Regulatory, of NiSource Corporate Services Company, from January 2021 to December 2021\nVice President and General Counsel of Columbia Gas of Massachusetts and of NiSource Corporate Services Company, from 2019 to 2020\nMelanie B. Berman\n54 \nChief Human Resources Officer and Senior Vice President, Administration of NiSource since May 2024\nSenior Vice President and Chief Human Resources Officer of NiSource from June 2021 to May 2024\nExecutive Vice President and Chief Human Resources Officer of The Michaels Companies, Inc. from 2020 to 2021\nGunnar J. Gode\n50\nVice President, Chief Accounting Officer and Controller of NiSource since July 2020\nVice President and Controller of Washington Gas from March 2019 to 2020\n16\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nN\nI\nS\nOURCE\n I\nNC\n.\nIndex\nPage\nExecutive Summary\n35\nSummary of Consolidated Financial Results\n38\nResults and Discussion of Operations\n39\nColumbia Operations\n40\nNIPSCO Operations\n43\nLiquidity and Capital Resources\n48\nMarket Risk Disclosures\n52\nOther Information\n53\nEXECUTIVE SUMMARY\nThis Management's Discussion and Analysis of Financial Condition and Results of Operations (\"Management's Discussion\") includes management’s analysis of past financial results and certain potential factors that may affect future results, potential future risks and approaches that may be used to manage those risks. See \"Note regarding forward-looking statements\" and Item 1A, \"Risk Factors\" at the beginning of this report for a list of factors that may cause results to differ materially. Refer to the \"Business\" section under Item 1 of this Annual Report on Form 10-K and Note 21, \"Business Segment Information,\" in the Notes to Consolidated Financial Statements for further discussion of our regulated utility business segments.\nThis Management's Discussion is designed to provide an understanding of our operations and financial performance and should be read in conjunction with our Consolidated Financial Statements and related Notes to Consolidated Financial Statements in this Annual Report on Form 10-K.\nWe are an energy holding company under the Public Utility Holding Company Act of 2005 whose subsidiaries are fully regulated natural gas and electric utility companies serving customers in six states. We generate substantially all of our operating income through these rate-regulated businesses, which are summarized for financial reporting purposes into two primary reportable segments: Columbia Operations and NIPSCO Operations.\nOur vision is to be a premier, innovative and trusted energy partner. We exist to deliver safe, reliable energy that drives value to our customers. In order to achieve this goal, we seek to develop strategies that benefit all stakeholders as we (i) support long-term infrastructure investment and safety programs to better serve our customers, (ii) align our tariff structures with our cost structure, and (iii) drive value and enable growth in an evolving energy ecosystem. These strategies focus on improving safety and reliability, enhancing customer experience, pursuing regulatory and legislative initiatives to increase accessibility for customers currently not on our gas and electric service, ensuring customer affordability and reducing emissions while generating sustainable returns. The safety of our customers, communities and employees remains our focus. Serving as a guiding practice for our SMS, NiSource is certified in conformance to the American Petroleum Institute Recommended Practice 1173, which is the foundation to our journey towards operational excellence.  \n2024 Overview: \nIn 2024, we continued to make significant progress on the remaining portfolio of projects that will enable our electric generation transition, including placing one solar and battery project into service and receiving approval of a new gas peaking facility. During the year, we received orders for three rate cases: Columbia of Pennsylvania, Columbia of Kentucky, and NIPSCO Gas. In addition, the Columbia of Virginia, Columbia of Maryland and NIPSCO Electric rate cases filed in 2024 are anticipated to be resolved during 2025 with balanced outcomes supporting all stakeholders. We continued to build and advance our SMS by successfully maintaining our certification of conformance for API 1173 and achieving LRQA’s ISO 50001 certification. Between our Columbia and NIPSCO Operating Segments, we added 21,000 customers. We also invested $1.5 billion in infrastructure modernization to enhance safe, reliable service, including replacement of 288 miles of distribution main and service lines, 24 miles of underground cable and 1,240 electric poles. We achieved the first major milestone in our Transformation road map and continue to increase the efficiency of our operating companies.\nThe following describes in more detail the advancements we have made in our key strategic initiatives.\nEnergy Transition:\n We are advancing our energy transition strategy primarily through the continuation and enhancement of existing programs, such as retiring and replacing remaining coal-fired electric generation by 2028 with a balanced mix of low or zero-emission electric generation and battery storage, ongoing pipe replacement and modernization programs, and deployment of advanced leak detection and repair. Our electric generation transition, initiated through our 2018 Integrated Resource Plan \n35\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\n(\"2018 Plan\") is well underway, and we are continually adjusting to the dynamic energy landscape\n. \nAs of December 31, we have placed in service owned renewable and storage projects, developed under BTAs, with combined nameplate capacities of 1,065 MW and 45 MW respectively. Renewable PPA projects with a combined nameplate capacity of 600 MW have also been placed in service. In addition, renewable and storage BTA projects with combined nameplate capacities of 1,085 MW and 56 MW, respectively, and renewable PPA projects with a combined nameplate capacity of 600 MW were under development as of December 31, all of which have received IURC approval. The capacity figure for BTA projects in development includes the Templeton Wind project. In October 2024, NIPSCO contracted with a developer to convert the previously approved Templeton Wind PPA to a BTA and has provided a notice of intent to file a CPCN with the IURC. In 2024, the IURC approved full ownership of the Cavalry, Dunns Bridge II, Fairbanks and Gibson and the cost of the Fairbanks project as contemplated in contractual actions. Full ownership of these projects allows NIPSCO to leverage provisions of the IRA, monetize renewable tax credits more effectively, and provide enhanced benefits to customers as compared to the previous tax equity partnership structure approved by the IURC. We remain on track to retire R.M Schahfer's remaining two coal units by the end of 2025. For additional information, see \"Results and Discussion of Operations - NIPSCO Operations,\" in this Management's Discussion.\nNIPSCO's 2021 Integrated Resource Plan (\"2021 Plan\") lays out a timeline to retire the Michigan City Generating Station by the end of 2028. The 2021 Plan calls replacing the retiring coal units with a diverse portfolio of resources including demand side management resources, renewables, stand-alone energy storage and upgrades to existing facilities at the Sugar Creek Generating Station, among other steps. In 2024, Sugar Creek completed an Advanced Gas Path Tech upgrade that will enhance its overall production capabilities. Additionally, the 2021 Plan calls for a new natural gas peaking facility to replace existing vintage gas peaking facilities at the R.M. Schahfer Generating Station to support system reliability and resiliency, and upgrades to the electric transmission system. In October 2024, we received approval for the issuance of a CPCN for an approximately 400 MW natural gas peaking generation facility from the IURC. The planned retirement of the two vintage gas peaking facilities at the R.M. Schahfer Generating Station is also expected to occur by the end of 2028. Final retirement dates for these units, as well as Michigan City, will be subject to MISO approval.\nNIPSCO’s 2024 Plan was submitted to the IURC on December 9, 2024. The 2024 Plan informs future generation investments required to ensure reliability for NIPSCO’s customers and incorporates factors such as anticipated load growth from data centers and other economic development opportunities, new EPA emissions rules, and evolving MISO resource accreditation rules. We have seen an acceleration of customer interest in our northern Indiana service territory in the form of data center development. We believe data center development can enhance our local tax base, diversify the employment base across the state of Indiana, and provide greater value to existing customers and shareholders. We are evaluating the potential for data center development in our service territory, including ways to effectively manage the potential power demand, generation sources, and transmission capabilities to meet potential load growth from any data center customer, while at the same time focusing on our environmental goals. We expect the management of large load growth would require new generation resources, including gas-fired resource, and transmission capabilities.We plan to move as efficiently as possible while maintaining the integrity of our commercial, planning, regulatory, procurement and operational execution processes. \nWe continue to enhance safety and reduce methane emissions on our gas systems through modernization programs and utilization of advanced leak detection and repair. In addition, we plan to advance other low- or zero-emission energy resources and technologies, such as hydrogen and renewable natural gas. \nTransformation:\n Our enterprise-wide transformation roadmap focuses on operational excellence, safety, operation and maintenance management, and unlocking efficiencies. We are committed to identifying and implementing initiatives that will enable us to streamline work and improve processes company-wide. These efforts include investments in proven technologies backed with standardized processes that will change the way we plan, schedule, and execute work in the field and how we engage and provide service to our customers. Taken together, all of our optimization initiatives will prioritize safety and continue to optimize our long-term growth profile. We are making progress towards our transformation goals with a successful completion of the first phase of our WAM program, an enterprise resource planning system that will optimize the scheduling, dispatch, and execution of our field operations. This phase of the program implemented the solution within our electric distribution and transmission operations, while the remaining phases associated with gas distribution and generation operations are anticipated to be completed by the end of 2025. \nEconomic Environment: \nWe continue to monitor risks related to order and delivery lead times for construction and other materials, potential unavailability of materials due to global shortages in raw materials, and decreased construction labor productivity in the event of disruptions in the availability of materials. We continue to see increasing prices associated with certain materials and supplies. To the extent that work plan delays occur or our costs increase, our business operations, results \n36\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nof operations, cash flows, and financial condition could be materially adversely affected. Refer to Item 1A. Risk Factors, \"Financial, Economic and Market Risks\" of this Annual Report on Form 10-K for further detail.\nWe are faced with increased competition for employee and contractor talent in the current labor market which has resulted in increased costs to attract and retain talent. We are ensuring that we use all internal human capital programs (development, leadership enablement programs, succession, performance management) to promote retention of our current employees along with having a competitive and attractive appeal for potential recruits. With a focus on workforce planning, we are evaluating our future talent footprint by creating flexible work arrangements where possible to support a broader talent footprint for sourcing needed talent. Refer to Item 1A. Risk Factors, \"Operational Risks\" of this Annual Report on Form 10-K for further detail.\nThe market price of natural gas was stable during 2024 and was very close to levels seen in 2023. Similar to natural gas pricing, electric commodity costs have remained stable due to available supplies of natural gas and coal and the growing influence of renewable generation on power market pricing. Changes in commodity prices do not have a material impact on our results of operations, however higher commodity prices can impact our cash flows and liquidity. For more information on our commodity price impacts, see Item 1A. Risk Factors, \"Operational Risks\" of this Annual Report on Form 10-K, \"Results and Discussion of Segment Operations - Columbia Operations,\" \"Results and Discussion of Segment Operations - NIPSCO Operations,\" and \"Market Risk Disclosures.\"\nWe continue to evaluate our financing plan to manage interest expense and exposure to rates. For more information on interest rate risk, see \"Market Risk Disclosures\" and Item 1A. Risk Factors, \"Financial, Economic and Market Risks\" of this Annual Report on Form 10-K.\nNIPSCO Minority Interest Transaction:\n On December 31, 2023, contemporaneously with the closing of the NIPSCO Minority Interest Transaction, Blackstone, NIPSCO Holdings I, NIPSCO Holdings II, and NiSource entered into an Amended and Restated Limited Liability Company Agreement (the \"LLC Agreement\") of NIPSCO Holdings II. On January 31, 2024, BIP transferred a 4.5% equity interest in NIPSCO Holdings II to BIP Blue Buyer VCOC L.L.C., a Delaware limited liability company and also an affiliate of Blackstone. Effective upon the closing of this transfer, the members of NIPSCO Holdings II entered into a Second Amended and Restated Limited Liability Company Operating Agreement of NIPSCO Holdings II (the \"Amended LLC Agreement\"). The two affiliates of Blackstone must vote their equity holdings under the Amended LLC Agreement as one investor. Refer to Note 4, \"Noncontrolling Interests,\" in the Notes to the Consolidated Financial Statements for more information on this transaction.\n37\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nSummary of Consolidated Financial Results\nA summary of our consolidated financial results for the years ended December 31, 2024, 2023 and 2022, are presented below:\nFavorable (Unfavorable)\nYear Ended December 31\n, \n(in millions, except per share amounts)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nOperating Revenues\n$\n5,455.1\n \n$\n5,505.4 \n$\n5,850.6 \n$\n(50.3)\n$\n(345.2)\nOperating Expenses\nCost of energy\n1,132.2\n \n1,533.3 \n2,110.5 \n401.1 \n577.2 \nOther Operating Expenses\n2,867.4\n \n2,676.6 \n2,474.3 \n(190.8)\n(202.3)\nTotal Operating Expenses\n3,999.6\n \n4,209.9 \n4,584.8 \n210.3 \n374.9 \nOperating Income \n1,455.5\n \n1,295.5 \n1,265.8 \n160.0 \n29.7 \nTotal Other Deductions, Net\n(452.7)\n(481.6)\n(309.4)\n28.9 \n(172.2)\nIncome Taxes\n158.1\n \n139.5 \n164.6 \n(18.6)\n25.1 \nNet Income\n844.7\n \n674.4 \n791.8 \n170.3 \n(117.4)\nNet (loss) income attributable to noncontrolling interest\n84.3\n \n(39.9)\n(12.3)\n(124.2)\n27.6 \nNet Income attributable to NiSource\n760.4\n \n714.3 \n804.1 \n46.1 \n(89.8)\nPreferred dividends and redemption premium\n(20.7)\n(52.6)\n(55.1)\n31.9 \n2.5 \nNet Income Available to Common Shareholders\n739.7\n \n661.7 \n749.0 \n78.0 \n(87.3)\nBasic Earnings Per Share\n$\n1.63\n \n$\n1.59 \n$\n1.84 \n$\n0.04 \n$\n(0.25)\nDiluted Earnings Per Share\n$\n1.62\n \n$\n1.48 \n$\n1.70 \n$\n0.14 \n$\n(0.22)\nThe majority of the costs of energy in both segments are tracked costs that are passed through directly to the customer, resulting in an equal and offsetting amount reflected in operating revenues.\nThe increase in net income available to common shareholders during 2024 was primarily due to higher revenues, net of cost of energy, driven by our continued investment in safety, reliability and low- or zero-emission generation as well as increased AFUDC, reported in Other Deductions, Net, primarily related to NIPSCO's wholly owned Cavalry and Dunns Bridge II projects. The increase in net income available to common shareholders is partially offset by higher depreciation expense attributed to our planned capital expenditures, higher interest expense and higher net income attributable to noncontrolling interest following the consummation of the NIPSCO Minority Interest Transaction. See Note 6, \"Equity,\" for additional information.\nFor additional information on operating income variance drivers see \"Results and Discussion of Operations\" for Columbia Operations and NIPSCO Operations in this Management's Discussion. \nOther Deductions, Net\nThe change in Other deductions, net in 2024 compared to 2023 is primarily driven by higher long-term debt interest in 2024 offset by increases in AFUDC. See Note 7, \"Short-Term Borrowings,\"and Note 8, \"Long-Term Debt,\" in the Notes to Consolidated Financial Statements for additional information.\nIncome Taxes\nThe increase in income tax expense in 2024 compared to the same period in 2023 is primarily due to higher pre-tax income, partially offset by the tax effect of non-controlling interest. Refer to Note 15, \"Income Taxes,\" in the Notes to Consolidated Financial Statements for additional information on income taxes and the change in the effective tax rate.\n38\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nRESULTS AND DISCUSSION OF OPERATIONS\nPresentation of Segment Information\nIn response to the NIPSCO Minority Interest Transaction, our operations are now evaluated through two primary reportable segments, Columbia Operations and NIPSCO Operations. Our historical segment disclosures have been recast to be consistent with the current presentation. Columbia Operations aggregates the results of the fully regulated and wholly owned subsidiaries of NiSource Gas Distribution Group, Inc. Each Columbia distribution company is an operating segment which we aggregate to form the Columbia Operations reportable segment. NIPSCO Operations aggregates the results of NIPSCO Holdings I, and its majority-owned subsidiaries, including NIPSCO, which has both fully regulated gas and electric operations in northern Indiana. The remainder of our operations, which are not significant enough on a stand-alone basis to warrant treatment as a reportable segment, are presented as \"Corporate and Other\" within the Notes to the Consolidated Financial Statements and primarily are comprised of interest expense on holding company debt, and unallocated corporate costs and activities.\n39\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nColumbia Operations \nFinancial and operational data for the Columbia Operations segment for the years ended December 31, 2024, 2023 and 2022, are presented below:\nFavorable (Unfavorable)\nYear Ended December 31, \n(in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nOperating Revenues\n$\n2,716.0\n \n$\n2,746.1 \n$\n2,964.4 \n$\n(30.1)\n$\n(218.3)\nOperating Expenses\nCost of energy\n514.7\n \n645.0 \n978.4 \n130.3 \n333.4 \nOperation and maintenance\n837.5\n \n792.3 \n791.3 \n(45.2)\n(1.0)\nDepreciation and amortization\n409.1\n \n371.7 \n329.4 \n(37.4)\n(42.3)\nLoss on impairment of assets\n2.7\n \n— \n— \n(2.7)\n— \nLoss (gain) on sale of assets, net\n4.7\n \n— \n(103.9)\n(4.7)\n(103.9)\nOther taxes\n218.6\n \n198.8 \n184.2 \n(19.8)\n(14.6)\nTotal Operating Expenses\n1,987.3\n \n2,007.8 \n2,179.4 \n20.5 \n171.6 \nOperating Income\n$\n728.7\n \n$\n738.3 \n$\n785.0 \n$\n(9.6)\n$\n(46.7)\nRevenues\nResidential\n$\n1,891.5\n \n$\n1,882.8 \n$\n1,918.1 \n$\n8.7 \n$\n(35.3)\nCommercial\n588.4\n \n606.2 \n674.8 \n(17.8)\n(68.6)\nIndustrial\n145.2\n \n139.5 \n136.4 \n5.7 \n3.1 \nOff-System\n42.6\n \n60.7 \n192.8 \n(18.1)\n(132.1)\nOther\n48.3\n \n56.9 \n42.3 \n(8.6)\n14.6 \nTotal\n$\n2,716.0\n \n$\n2,746.1 \n$\n2,964.4 \n$\n(30.1)\n$\n(218.3)\nSales and Transportation (MMDth)\nResidential\n153.2\n \n155.2 \n180.2 \n(2.0)\n(25.0)\nCommercial\n121.8\n \n120.4 \n134.3 \n1.4 \n(13.9)\nIndustrial\n277.9\n \n255.3 \n243.2 \n22.6 \n12.1 \nOff-System\n23.8\n \n31.8 \n32.3 \n(8.0)\n(0.5)\nOther\n0.2\n \n0.3 \n0.3 \n(0.1)\n— \nTotal\n576.9\n \n563.0 \n590.3 \n13.9 \n(27.3)\nHeating Degree Days\n4,262\n \n4,373 \n5,195 \n(111)\n(822)\nNormal Heating Degree Days\n5,134\n \n5,137 \n5,137 \n(3)\n— \n% (Warmer) Colder than Normal\n(17)\n%\n(15)\n%\n1 \n%\n% (Warmer) Colder than Prior Year\n(3)\n%\n(16)\n%\n8 \n%\nGas Distribution Customers\nResidential\n2,225,564\n2,215,293\n2,201,999\n10,271 \n13,294 \nCommercial\n188,699\n188,561\n188,374\n138 \n187 \nIndustrial\n1,991\n1,986\n1,995\n5 \n(9)\nOther\n5\n4\n3\n1 \n1 \nTotal\n2,416,259\n2,405,844\n2,392,371\n10,415 \n13,473 \n40\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nColumbia Operations (continued)\nComparability of operation and maintenance expenses, depreciation and amortization, and other taxes may be impacted by regulatory, depreciation and tax trackers that allow for the recovery in rates of certain costs.\nThe underlying reasons for changes in our operating revenues and expenses from 2024 to 2023 are presented in the respective tables below. \nFavorable (Unfavorable)\nChanges in Operating Revenues \n(in millions)\n2024 vs 2023\nNew rates from base rate proceedings and regulatory capital programs\n$\n112.5 \nThe effects of customer growth\n6.2 \nThe effects of customer usage\n5.9 \nThe effects of weather in 2024 compared to 2023\n(5.2)\nOther\n(4.2)\nChange in operating revenues (before cost of energy and other tracked items)\n$\n115.2 \nOperating revenues offset in operating expense\nLower cost of energy billed to customers\n(130.3)\nLower tracker recoveries within operation and maintenance, depreciation, and tax\n(15.0)\nTotal change in operating revenues\n$\n(30.1)\nWeather\nIn general, we calculate the weather-related revenue variance based on changing customer demand driven by weather variance from normal heating degree days, net of weather normalization mechanisms. Our composite heating degree days reported do not directly correlate to the weather-related dollar impact on the results of Columbia Operations. Heating degree days experienced during different times of the year or in different operating locations may have more or less impact on volume and dollars depending on when and where they occur. When the detailed results are combined for reporting, there may be weather-related dollar impacts on operations when there is not an apparent or significant change in our aggregated composite heating degree day comparison.\nThroughput\nThe increase in total volumes sold and transported in 2024 compared to 2023 of 13.9 MMDth is primarily attributable to the increased industrial usage offset by off-system sales.\n41\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nColumbia Operations (continued)\nCommodity Price Impact\nCost of energy for the Columbia Operations segment is principally comprised of the cost of natural gas procured on behalf of and sold to customers while providing transportation and distribution services. All of our Columbia Operations companies have state-approved recovery mechanisms that provide a means for full recovery of prudently incurred gas costs. These are tracked costs that are passed through directly to the customer, and the gas costs included in revenues are matched with the gas cost expense recorded in the period. Any difference in actual costs incurred and amounts billed to customers is recorded on the Consolidated Balance Sheets as under-recovered or over-recovered gas cost to be included in future customer billings. Therefore, increases in these tracked operating expenses are offset by increases in operating revenues and have essentially no impact on net income. Certain Columbia Operations companies continue to offer choice opportunities, where customers can choose to purchase gas from a third-party supplier, through regulatory initiatives in their respective jurisdictions. \nFavorable (Unfavorable)\nChanges in Operating Expenses \n(in millions)\n2024 vs 2023\nHigher employee related expenses\n$\n(47.5)\nHigher depreciation and amortization expense\n(37.4)\nHigher property tax \n(17.2)\nLoss on sale of assets and impairments\n(7.4)\nHigher materials and supplies expense\n(7.0)\nOther\n(8.3)\nChange in operating expenses (before cost of energy and other tracked items)\n$\n(124.8)\nOperating expenses offset in operating revenue\nLower cost of energy billed to customers\n130.3 \nHigher tracker recoveries within operation and maintenance, depreciation, and tax\n15.0 \nTotal change in operating expense\n$\n20.5\n \n42\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Operations\nFinancial and operational data for the NIPSCO Operations segment, which services both gas and electric customers, for the years ended December 31, 2024, 2023 and 2022, are presented below:\nFavorable (Unfavorable)\nYear Ended December 31, \n(in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNIPSCO Operations\nOperating Revenues\n$\n2,752.0\n \n$\n2,771.6 \n$\n2,887.1 \n$\n(19.6)\n$\n(115.5)\nOperating Expenses\nCost of energy\n617.5\n \n888.3 \n1,132.1 \n270.8 \n243.8 \nOperation and maintenance\n761.4\n \n787.7 \n740.4 \n26.3 \n(47.3)\nDepreciation and amortization\n590.3\n \n493.8 \n449.4 \n(96.5)\n(44.4)\nLoss on impairment of assets\n0.4\n \n— \n— \n(0.4)\n— \nLoss (gain) on sale of assets, net\n(1.7)\n2.2 \n— \n3.9 \n(2.2)\nOther taxes\n64.3\n \n57.9 \n72.1 \n(6.4)\n14.2 \nTotal Operating Expenses\n2,032.2\n \n2,229.9 \n2,394.0 \n197.7 \n164.1 \nOperating Income\n$\n719.8\n \n$\n541.7 \n$\n493.1 \n$\n178.1 \n$\n48.6 \nFavorable (Unfavorable)\nYear Ended December 31, \n(in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNIPSCO Electric\nRevenues\nResidential\n$\n649.9\n \n$\n583.9 \n$\n592.4 \n$\n66.0 \n$\n(8.5)\nCommercial\n620.4\n \n578.1 \n571.0 \n42.3 \n7.1 \nIndustrial\n500.0\n \n475.0 \n561.4 \n25.0 \n(86.4)\nWholesale\n38.3\n \n32.0 \n13.5 \n6.3 \n18.5 \nOther\n105.0\n \n116.0 \n93.4 \n(11.0)\n22.6 \nTotal\n$\n1,913.6\n \n$\n1,785.0 \n$\n1,831.7 \n$\n128.6 \n$\n(46.7)\nSales (GWh)\nResidential\n3,404.9\n \n3,262.9 \n3,482.9 \n142.0 \n(220.0)\nCommercial\n3,697.9\n \n3,614.2 \n3,682.4 \n83.7 \n(68.2)\nIndustrial\n7,984.8\n \n7,820.3 \n7,915.3 \n164.5 \n(95.0)\nWholesale\n889.7\n \n556.4 \n50.0 \n333.3 \n506.4 \nOther\n85.2\n \n78.9 \n89.5 \n6.3 \n(10.6)\nTotal\n16,062.5\n \n15,332.7 \n15,220.1 \n729.8 \n112.6 \nCooling Degree Days\n903\n \n710 \n942 \n193 \n(232)\nNormal Cooling Degree Days\n852\n \n831 \n831 \n21 \n— \n% Warmer (Colder) than Normal\n6\n \n%\n(15)\n%\n13 \n%\n% Warmer (Colder) than prior year\n27\n \n%\n(25)\n%\n(8)\n%\nNIPSCO Electric Customers\nResidential\n430,648\n \n427,217 \n424,735 \n3,431 \n2,482 \nCommercial\n59,214\n \n58,779 \n58,374 \n435 \n405 \nIndustrial\n2,121\n \n2,126 \n2,130 \n(5)\n(4)\nWholesale\n705\n \n708 \n710 \n(3)\n(2)\nOther\n2\n \n3 \n3 \n(1)\n— \nTotal\n492,690\n \n488,833 \n485,952 \n3,857 \n2,881 \n43\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Operations\nFavorable (Unfavorable)\nYear Ended December 31, (in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNIPSCO Gas\nRevenues\nResidential\n$\n540.9\n \n$\n634.9 \n$\n691.5 \n$\n(94.0)\n$\n(56.6)\nCommercial\n202.4\n \n249.1 \n267.6 \n(46.7)\n(18.5)\nIndustrial\n79.0\n \n86.9 \n85.1 \n(7.9)\n1.8 \nOther\n16.1\n \n15.7 \n11.2 \n0.4 \n4.5 \nTotal\n$\n838.4\n \n$\n986.6 \n$\n1,055.4 \n$\n(148.2)\n$\n(68.8)\nSales and Transportation Volumes (MMDth)\nResidential\n58.2\n \n60.3 \n68.8 \n(2.1)\n(8.5)\nCommercial\n42.5\n \n43.9 \n47.0 \n(1.4)\n(3.1)\nIndustrial\n256.8\n \n261.8 \n247.5 \n(5.0)\n14.3 \nTotal\n357.5\n \n366.0 \n363.3 \n(8.5)\n2.7 \nHeating Degree Days\n4,975\n \n5,198 \n6,133 \n(223)\n(935)\nNormal Heating Degree Days\n6,001\n \n5,954 \n5,985 \n47 \n(31)\n% (Warmer) Colder than Normal\n(17)\n%\n(13)\n%\n2 \n%\n% (Warmer) Colder than prior year\n(4)\n%\n(15)\n%\n10 \n%\nNIPSCO Gas Customers\nResidential\n801,740\n \n795,656 \n789,914 \n6,084 \n5,742 \nCommercial\n66,633\n \n66,305 \n66,062 \n328 \n243 \nIndustrial\n2,734\n \n2,808 \n2,875 \n(74)\n(67)\nTotal\n871,107\n \n864,769 \n858,851 \n6,338 \n5,918 \n44\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Operations (continued)\nComparability of operation and maintenance expenses and depreciation and amortization may be impacted by regulatory and depreciation trackers that allow for the recovery in rates of certain costs.\nThe underlying reasons for changes in our operating revenues and expenses from 2024 to 2023 are presented in the respective tables below.\nFavorable (Unfavorable)\nChanges in Operating Revenues \n(in millions)\n2024 vs 2023\nNew rates from base rate proceedings, regulatory capital, and DSM programs\n$\n238.4 \nRenewable Joint Venture revenue, fully offset by Joint Venture operating expense and noncontrolling interest net income (loss)\n17.5 \nThe effects of customer usage\n11.9 \nThe effects of customer growth\n11.2 \nDecreased fuel handling costs\n9.7 \nOther\n(6.2)\nChange in operating revenues (before cost of energy and other tracked items)\n$\n282.5 \nOperating revenues offset in operating expense\nLower cost of energy billed to customers\n(270.8)\nLower tracker deferrals within operation and maintenance, depreciation and tax\n(32.4)\nReduction in gross receipts tax, offset in operating expenses\n1.1 \nTotal change in operating revenues\n$\n(19.6)\nWeather\nThe results of operations for the NIPSCO Operations segment include income from both electric and gas service lines. In general, we calculate the weather-related revenue variance based on changing customer demand driven by weather variance from normal cooling degree days and normal heating degree days, net of weather normalization mechanisms. Our composite cooling and heating degree days reported do not directly correlate to the weather-related dollar impact on the results of NIPSCO Operations. Cooling and heating degree days experienced during different times of the year or in different operating locations may have more or less impact on volume and dollars depending on when they occur. When the detailed results are combined for reporting, there may be weather-related dollar impacts on operations when there is not an apparent or significant change in our aggregated composite cooling and heating degree day comparison.\nSales\nThe increase in total volumes sold to electric customers for twelve months ended December 31, 2024 compared to the same period in 2023 was primarily attributable to increased usage by wholesale, industrial, and residential customers. NIPSCO Electric results remains closely linked to the performance of the steel industry. MWh sales to steel-related industries accounted for approximately 49.4% and 49.6% of the total industrial MWh sales for the years ended December 31, 2024 and 2023, respectively.\nThe decrease in total volumes sold to gas customers for the twelve months ended December 31, 2024 compared to the same period in 2023 was primarily attributable to decreased usage by industrial customers.\nCommodity Price Impact\nCost of energy for the NIPSCO Operations segment's electric activities is principally comprised of the cost of coal, natural gas purchased for internal generation of electricity, transportation of coal and natural gas, and the cost of power purchased from generators of electricity for its generation an    d transmission activities. For its gas distribution activities, NIPSCO Operations' cost of energy is principally comprised of the cost of natural gas procured on behalf of and sold to customers while providing transportation and distribution services. NIPSCO Operations has a state-approved recovery mechanism that provides a means for full recovery of prudently incurred costs of energy. The majority of these costs of energy are passed through directly to the customer, and the costs of energy included in operating revenues are matched with the cost of energy expense recorded in the period. Any difference in actual costs incurred and amounts billed to customers is recorded on the Consolidated Balance Sheets \n45\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Operations (continued)\nas under-recovered or over-recovered fuel and gas cost to be included in future customer billings. Therefore, increases in these tracked operating expenses are offset by increases in operating revenues and have essentially no impact on net income. \nFavorable (Unfavorable)\nChanges in Operating Expenses \n(in millions)\n2024 vs 2023\nHigher depreciation and amortization expense driven by new base rates \n$\n(91.1)\nHigher employee and administrative expenses\n(21.8)\nHigher outside services expenses\n(8.6)\nHigher environmental remediation costs\n(4.7)\nLower materials and supplies\n8.9 \nRenewable Joint Venture operating expense, partially offset by Joint Venture operating revenues\n7.6 \nOther\n5.3 \nChange in operating expenses (before cost of energy and other tracked items)\n$\n(104.4)\nOperating expenses offset in operating revenue\nLower cost of energy billed to customers\n270.8 \nHigher tracker deferrals within operation and maintenance, depreciation and tax\n32.4 \nReduction in gross receipts tax, offset in operating revenues\n(1.1)\nTotal change in operating expense\n$\n197.7\n \nElectric Supply and Generation Transition\nNIPSCO continues to execute on an electric generation transition consistent with the 2018 Plan and 2021 Plan and maintained in the 2024 Plan, which outlines the path to retire the remaining two coal units at R.M. Schahfer by the end of 2025 and the remaining coal-fired generation at Michigan City by the end of 2028, to be replaced by lower-cost, reliable and cleaner options. See \"Liquidity and Capital Resources\" in this Management's Discussion for additional information on our capital investment spend.\nNIPSCO continues to await EPA decision on an administrative approval associated with the operation of R.M. Schahfer’s remaining two coal units, which are expected to be retired by the end of 2025. In the event that the approval is not obtained, future operations could be impacted. We cannot estimate the financial impact on us if this approval is not obtained. Refer to Item 1A. Risk Factors, \"Operational Risks,\" of this Annual Report on Form 10-K for further detail.\nThe current replacement plan primarily includes renewable sources of energy, including wind, solar, battery storage, and flexible natural gas resources to be obtained through a combination of NIPSCO ownership and PPAs. NIPSCO has sold, and may in the future sell, renewable energy credits from its renewable generation to third parties to offset customer costs. NIPSCO has executed several PPAs to purchase 100% of the output from renewable generation facilities at a fixed price per MWh. Each facility supplying the energy will have an associated nameplate capacity, and payments under the PPAs will not begin until the associated generation facility is constructed by the owner/seller. NIPSCO has also executed several BTAs with developers to construct renewable generation facilities. \nSince 2020, two wind PPA projects and six owned projects (two wind, two solar and two solar plus storage) have been placed into service totaling 2,201 MW of nameplate capacity, including Dunns Bridge II which was placed into service in January 2025. NIPSCO has executed commercial agreements for each of the six remaining identified projects. Fairbanks, Gibson, Green River, Appleseed and Carpenter have received IURC approval. The Templeton Wind project previously received approval as a PPA, however, NIPSCO has contracted with a developer to convert the PPA to a BTA and has provided a notice of intent to file a CPCN with the IURC. In January 2024, the IURC approved increases to the project costs as well as the full ownership of Cavalry and Dunns Bridge II. In August 2024, the IURC approved full ownership of Gibson and Fairbanks as well as increases to the cost of the Fairbanks project. In October 2024, the IURC approved the CPCN for NIPSCO's planned gas peaking facility to be located at the R.M. Schahfer Generating Station. See \"Executive Summary - Energy Transition\" in this Management's \n46\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nNIPSCO Operations (continued)\nDiscussion for additional information. We expect our remaining contracted BTA and PPA projects to be placed in service between 2025 and 2027.\nRemaining Renewables Projects\nTransaction Type\nTechnology\nNameplate Capacity (MW)\nStorage Capacity (MW)\nFairbanks\nBTA\nSolar\n250\n—\nGibson\nBTA\nSolar \n200\n—\nTempleton\nBTA\n(1)\nWind\n200\n—\nGreen River\n20 year PPA\nSolar\n200\n—\nAppleseed\n20 year PPA\nSolar\n200\n—\nCarpenter\n20 year PPA\nWind\n200\n—\n(1) \nPending regulatory approval.\n47\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nLiquidity and Capital Resources\nWe continually evaluate the availability of adequate financing to fund our ongoing business operations, working capital and core safety and infrastructure investment programs. Our financing is sourced through cash flow from operations and the issuance of debt and/or equity. External debt financing is provided primarily through the issuance of long-term debt, accounts receivable securitization programs and our $1.85 billion commercial paper program, which is backstopped by our committed revolving credit facility with a total availability from third-party lenders of $1.85 billion. Sources of financing activities for the current year are as follows:\n•\nOn December 31, 2023, we consummated the NIPSCO Minority Interest Transaction in exchange for a capital contribution of $2.16 billion in cash. \n•\nOn January 3, 2024, we applied the proceeds from the NIPSCO Minority Interest Transaction and repaid in full our $1.0 billion term credit agreement and our $650.0 million term credit agreement. \n•\nOn February 22, 2024, we entered into an ATM equity program that provides an opportunity to issue and sell shares of our common stock up to an aggregate issuance of $900.0 million through December 31, 2025. As of December 31, 2024, the ATM program had approximately $297.7 million of equity available for issuance.  \n•\nOn March 14, 2024, we completed the issuance and sale of $650.0 million of 5.350% senior unsecured notes maturing in 2034, which resulted in approximately $642.6 million of net proceeds after discount and debt issuance costs.\n•\nOn March 15, 2024, we redeemed all 20,000 outstanding shares of Series B Preferred Stock for a redemption price of $25,000 per share and all 20,000 outstanding shares of Series B-1 Preferred Stock for a redemption price of $0.01 per share or $500.0 million in total. \n•\nOn May 16, 2024, we completed the issuance and sale of $500.0 million of 6.950% fixed-to-fixed reset rate junior subordinated notes maturing in 2054, which resulted in approximately $493.4 million of net proceeds after debt issuance costs. \n•\nOn June 24, 2024, we completed the issuance and sale of $600.0 million of 5.200% senior unsecured notes maturing in 2029, which resulted in approximately $593.7 million of net proceeds after discount and debt issuance costs. \n•\nOn September 9, 2024, we completed the issuance and sale of $500.0 million of 6.375% fixed-to-fixed reset rate junior subordinated notes maturing in 2055, which resulted in approximately $493.6 million of net proceeds after debt issuance costs. \nSee Note 4, \"Noncontrolling Interests,\", Note 6, \"Equity,\" Note 7, \"Short-Term Borrowings,\" and Note 8, \"Long-Term Debt,\" in the Notes to the Consolidated Financial Statements for more information. \nWe believe these sources provide adequate capital to fund our operating activities and capital expenditures in 2025 and beyond. \nOperating Activities\nNet cash from operating activities for the year ended December 31, 2024 was $1,781.5 million, a decrease of $153.6 million from 2023. This decrease in cash from operating activities was primarily driven by year over year change in accounts receivable collections and exchange gas receivables due to the impact of lower gas prices, offset by a year over year increase in revenue, net of cost of energy and higher accounts payables due to increased gas purchases.\nInvesting Activities\nNet cash used for investing activities for the year ended December 31, 2024 was $3,213.0 million, a decrease of $358.6 million from 2023. Lower current year investing activities were primarily driven by lower milestone payments to renewable generation asset developers for certain of our BTA projects in 2024 compared to 2023.\n48\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nCapital Expenditures. \nThe table below reflects actual capital expenditures and certain other investing activities by segment for 2024. \nActual\n(in millions)\n2024\nColumbia Operations\nSystem Growth and Tracker\n$\n923.0\n \nMaintenance\n286.0\n \nTotal Columbia Operations\n1,209.0\n \nNIPSCO Operations\nSystem Growth and Tracker\n754.0\n \nMaintenance\n492.0\n \nGeneration Transition Investments\n1,006.4\n \nTotal NIPSCO Operations\n2,252.4\n \nCorporate and Other Operations - Maintenance\n(1)\n231.1\n \nTotal Capital Expenditures\n(2)\n$\n3,692.5\n \n(1)\n Certain amounts may subsequently be allocated out of Corporate and Other Maintenance Costs to the Columbia Operations and NIPSCO Operations segments when placed in service.\n(2)\nAmounts differ from those presented on the Statements of Consolidated Cash Flows primarily due to the capitalized portion of the Corporate Incentive Plan payout, inclusion of capital expenditures included in current liabilities and AFUDC Equity. \nIn addition to these capital expenditures, we made $29.0 million of advanced deposits for project costs related to the construction of the R.M. Schahfer gas peaker as part of our generation transition and invested $65.7 million in deferred cloud computing costs in 2024. We also made $454.2 million of capital investments in the form of milestone payments to the renewable generation asset developers in 2023 that were recognized in capital expenditures in 2024. \nWe expect to make capital investments totaling approximately $19.4 billion during the 2025-2029 period related to infrastructure modernization, generation transition and customer growth. This forecast incorporates an estimated $1.6 billion of additional investment in renewable generation projects.\n(in billions)\n2024 Actual\n2025 Estimated\n2026 Estimated\n2027 Estimated\n2028 Estimated\n2029 Estimated\nCapital Investments\n$3.3\n$4.0 - 4.3\n$3.4 - 3.7\n$3.6 - 3.9\n$3.7 - 4.0\n$3.8 - 4.1\nRegulatory Capital Programs. \nWe are in the process of upgrading and modernizing our electric system to enhance safety and reliability by addressing aged infrastructure and deploying advanced grid technologies. We are also upgrading and modernizing our gas infrastructure to enhance safety and reliability by reducing leaks. An ancillary benefit of these programs is the reduction of GHG emissions. In 2024, we continued to move forward on core infrastructure and environmental investment programs supported by complementary regulatory and customer initiatives across all six states of our operating area. \n49\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nThe following table describes the most recent vintage of our regulatory programs to recover infrastructure replacement and other federally mandated compliance investments:\n(in millions)\nCompany\nProgram\nCapital Investment\nInvestment Period\nFiling Date\nCosts Covered\n(1)\nApproved\nColumbia of Pennsylvania\n(2)\nDSIC - Q4 2024\n$\n180.1 \n2/24-8/24\n9/20/2024\nEligible project costs including piping, couplings, gas service lines, excess flow valves, risers, meter bars, meters, and other related capitalized investments to improve the distribution system. \nColumbia of Ohio\nIRP - 2024\n$\n753.5 \n4/21-12/23\n2/26/2024\nReplacement of hazardous service lines, cast iron, wrought iron, uncoated steel, and bare steel pipe.\nColumbia of Ohio\nPHMSA IRP - 2024\n$\n14.6 \n1/23-12/23\n2/28/2024\nInvestments necessary to comply with the PHMSA Mega Rule. \nColumbia of Ohio\nCEP - 2024\n$\n763.3 \n4/21-12/23\n2/26/2024\nAssets not included in the IRP or PHMSA IRP.\nColumbia of Virginia\nSAVE - 2025\n$\n89.0 \n10/24-12/25\n8/15/2024\nReplacement projects that (1) enhance system safety or reliability, or (2) reduce, or potentially reduce, greenhouse gas emissions. Includes costs associated with Advanced Leak Detection and Repair.\nColumbia of Kentucky\nSMRP - 2024\n$\n81.9 \n1/23-12/24\n10/13/2023\nReplacement of mains and inclusion of system safety investments.\nNIPSCO - Electric\nTDSIC - 5\n$\n346.9 \n7/22-3/24\n5/28/2024\nNew or replacement projects undertaken for the purpose of safety, reliability, system modernization or economic development.\nNIPSCO - Gas\nTDSIC - 8\n$\n8.3 \n1/23-2/24\n4/30/2024\nNew or replacement projects undertaken for the purpose of safety, reliability, system modernization or economic development.\nNIPSCO - Gas \nFMCA - 3 \n$\n27.0 \n1/23-6/24\n8/27/2024\nProject costs to comply with federal mandates.\nPending Commission Approval \n(3)\nColumbia of Kentucky\n(4)\nSMRP - 2025\n$\n128.5 \n1/23-12/25\n10/15/2024\nReplacement of mains and inclusion of system safety investments.\nNIPSCO - Electric\nTDSIC - 6\n$\n555.0 \n7/22-9/24\n11/26/2024\nNew or replacement projects undertaken for the purpose of safety, reliability, system modernization or economic development.\nNIPSCO - Electric\n(5)\nGCT - 1\n$\n149.9 \n9/23-10/25\n12/16/2024\nNew gas peaker generation project costs forecasted through the requested billing period May – Oct. 2025.\n(1)\nPrograms do not include any costs already included in base rates.\n(2)\nRate decreased to zero on December 14, 2024 with the implementation of new base rates resulting from Columbia of Pennsylvania’s 2024 Rate Case.\n(3)\nOn July 30, 2024, CMD filed an application for approval of a new five-year STRIDE. On December 30, 2024, the filing was withdrawn.\n(4)\nRates went into effect January 2, 2025, subject to refund.\n(5)\nCapital investment is based off of a projected amount. The capital investment has not all been incurred to date and represents a forecasted average for the billing period.\nRefer to Note 12, \"Regulatory Matters,\" in the Notes to Consolidated Financial Statements for a further discussion of regulatory developments during 2024.\nFinancing Activities\nCommon Stock, Preferred Stock and Equity Unit Sale. \nRefer to Note 6, \"Equity,\" in the Notes to Consolidated Financial Statements for information on common stock, preferred stock and equity units activity.\nShort-term Debt.\n Refer to Note 7, \"Short-Term Borrowings,\" in the Notes to Consolidated Financial Statements for information on short-term debt.\nLong-term Debt.\n Refer to Note 8, \"Long-Term Debt,\" in the Notes to Consolidated Financial Statements for information on long-term debt.\nNon-controlling Interest\n. Refer to Note 4, \"Noncontrolling Interests,\" in the Notes to Consolidated Financial Statements for more information. \n50\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nSources of Liquidity\nThe following table displays our liquidity position as of December 31, 2024 and 2023:\nYear Ended December 31, \n(in millions)\n2024\n2023\nCurrent Liquidity\nRevolving Credit Facility\n$\n1,850.0\n \n$\n1,850.0 \nAccounts Receivable Programs\n(1)\n175.0\n \n383.9 \nLess:\nCommercial Paper\n604.6\n \n1,061.0 \nAccounts Receivable Programs Utilized\n—\n \n337.6 \nLetters of Credit Outstanding Under Credit Facility\n9.4\n \n9.9 \nAdd:\nCash and Cash Equivalents\n156.6\n \n2,245.4 \nNet Available Liquidity\n$\n1,567.6\n \n$\n3,070.8 \n(1)\nRepresents the lesser of the seasonal limit or maximum borrowings supportable by the underlying receivables. \nDebt Covenants\n.\n We are subject to a financial covenant under our revolving credit facility which requires us to maintain a debt to capitalization ratio that does not exceed 70%. As of December 31, 2024, the ratio was 52.6%.\nCredit Ratings\n.\n The credit rating agencies periodically review our ratings, taking into account factors such as our capital structure and earnings profile. The following table includes our and NIPSCO's credit ratings and ratings outlook as of December 31, 2024. There have been no changes to our credit ratings or outlooks since February 2020.\nA credit rating is not a recommendation to buy, sell or hold securities, and may be subject to revision or withdrawal at any time by the assigning rating organization.\nS&P\nMoody's\nFitch\nRating\nOutlook\nRating\nOutlook\nRating\nOutlook\nNiSource\nBBB+\nStable\nBaa2\nStable\nBBB\nStable\nNIPSCO\nBBB+\nStable\nBaa1\nStable\nBBB\nStable\nCommercial Paper\nA-2\nStable\nP-2\nStable\nF2\nStable\nCertain of our subsidiaries have agreements that contain “ratings triggers” that require increased collateral if our credit ratings or the credit ratings of certain of our subsidiaries are below investment grade. These agreements are primarily for insurance purposes and for the physical purchase or sale of power. As of December 31, 2024, a collateral requirement of approximately $115.5 million would be required in the event of a downgrade below investment grade. In addition to agreements with ratings triggers, there are other agreements that contain “adequate assurance” or “material adverse change” provisions that could necessitate additional credit support such as letters of credit and cash collateral to transact business. \nEquity. \nOur authorized capital stock consists of 770,000,000 shares, $0.01 par value, of which 750,000,000 are common stock and 20,000,000 are preferred stock. As of December 31, 2024, 469,822,472 shares of common stock were outstanding. For more information regarding our common and preferred stock, see Note 6, \"Equity,\" in the Notes to Consolidated Financial Statements.\nContractual Obligations, Cash Requirements and Off-Balance Sheet Arrangements\nWe have certain contractual obligations requiring payments at specified periods. Our material cash requirements are detailed below. We intend to use funds from the liquidity sources referenced above to meet these cash requirements.\nAt December 31, 2024, we had \n$13,355.7 million\n in long-term debt, of which \n$1,281.2 million\n is current and \n$604.6 million\n in short-term borrowings outstanding. \nDuring 2025 and 2026, we expect to make cash payments of $685.5 million and $631.2 million, \nrespectively, related to pipeline service obligations including demand for gas transportation, gas storage and gas purchases, and \n$140.5 million and $24.9 million\n, respectively, for long lead time items related to plant equipment purchases.\n51\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nOur expected payments include employer contributions to pension and other postretirement benefits plans expected to be made in 2025. Plan contributions beyond 2025 are dependent upon a number of factors, including actual returns on plan assets, which cannot be reliably estimated at this time. In 2025, we expect to make contributions of approximatel\ny $2.3 million to our pension plans and approximately $21.3 million to our postretirement medical and life plans. Refer to\n Note 16, \"Pension and Other Postemployment Benefits,\" in the Notes to Consolidated Financial Statements for more information.\nWe cannot reasonably estimate the settlement amounts or timing of cash flows related to certain of our long-term obligations classified as \"Total Other Liabilities\" on the Consolidated Balance Sheets.\nWe have uncertain income tax positions for which we are unable to predict when the matters will be resolved. Refer to Note 15, \"Income Taxes,\" in the Notes to Consolidated Financial Statements for more information.\nNIPSCO has executed several PPAs to purchase 100% of the output from renewable generation facilities at a fixed price per MWh. NIPSCO has also executed several BTAs with developers to construct renewable generation facilities. See Note 19, \"Other Commitments and Contingencies - A. Contractual Obligations,\" and \nNote 19, \"Other Commitments and Contingencies - E. Other Matters,\"\n in the Notes to Consolidated Financial Statements for additional information.\nIn addition, we, along with certain of our subsidiaries, enter into various agreements providing financial or performance assurance to third parties on behalf of certain subsidiaries. Such agreements include guarantees and stand-by letters of credit. \nRefer to Note 19, \"Other Commitments and Contingencies,\" in the Notes to Consolidated Financial Statements for additional information regarding our contractual obligations over the next 5 years and thereafter and our off-balance sheet arrangements.\nMarket Risk Disclosures\nRisk is an inherent part of our businesses. The extent to which we properly and effectively identify, assess, monitor and manage each of the various types of risk involved in our businesses is critical to our profitability. We seek to identify, assess, monitor and manage, in accordance with defined policies and procedures, the following principal market risks that are involved in our businesses: commodity price risk, interest rate risk and credit risk. We manage risk through a multi-faceted process with oversight by the Risk Management Committee that requires constant communication, judgment and knowledge of specialized products and markets. Our senior management takes an active role in the risk management process and has developed policies and procedures that require specific administrative and business functions to assist in the identification, assessment and control of various risks. These may include, but are not limited to market, operational, financial, compliance and strategic risk types. In recognition of the increasingly varied and complex nature of the energy business, our risk management process, policies and procedures continue to evolve and are subject to ongoing review and modification.\nCommodity Price Risk\nOur gas and electric subsidiaries have commodity price risk primarily related to the purchases of natural gas and power. To manage this market risk, our subsidiaries use derivatives, including commodity futures contracts, swaps, forwards and options. We do not participate in speculative energy trading activity.\nCommodity price risk resulting from derivative activities at our rate-regulated subsidiaries is limited and does not bear significant exposure to earnings risk, since our current regulatory mechanisms allow recovery of prudently incurred purchased power, fuel and gas costs through the rate-making process, including gains or losses on these derivative instruments. These changes are included in the GCA and FAC regulatory rate-recovery mechanisms. If these mechanisms were to be adjusted or eliminated, these subsidiaries may begin providing services without the benefit of the traditional rate-making process and may be more exposed to commodity price risk. For additional information, see \"Results and Discussion of Operations\" in this Management's Discussion.\nOur subsidiaries are required to make cash margin deposits with their brokers to cover actual and potential losses in the value of outstanding exchange traded derivative contracts. The amount of these deposits, some of which are reflected in our restricted cash balance, may fluctuate significantly during periods of high volatility in the energy commodity markets.\nRefer to Note 13, \"Risk Management Activities,\" in the Notes to Consolidated Financial Statements for further information on our commodity price risk assets and liabilities as of December 31, 2024 and 2023.\n52\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nInterest Rate Risk\nWe are exposed to interest rate risk as a result of changes in interest rates on borrowings under our revolving credit agreement, commercial paper program, and accounts receivable programs, which have interest rates that are indexed to short-term market interest rates. Based upon average borrowings and debt obligations subject to fluctuations in short-term market interest rates, an increase (or decrease) in short-term interest rates of 100 basis points (1%) would have increased (or decreased) interest expense by $7.9 million and $18.9 million for 2024 and 2023, respectively. We are also exposed to interest rate risk as a result of changes in benchmark rates that can influence the interest rates of future long-term debt issuances. From time to time, we may enter into forward interest rate instruments to lock in long term interest costs and/ or rates. \nCredit Risk\nDue to the nature of the industry, credit risk is embedded in many of our business activities. Our extension of credit is governed by a Corporate Credit Risk Management Policy which establishes guidelines for documenting management approval levels for credit limits, evaluating creditworthiness, and credit risk mitigation efforts. Exposures to credit risks are monitored by the risk management function, which is independent of commercial operations. Credit risk arises due to the possibility that a customer, supplier or counterparty will not be able or willing to fulfill its obligations on a transaction on or before the settlement date. For derivative-related contracts, credit risk arises when counterparties are obligated to deliver or purchase defined commodity units of gas or power to us at a future date per execution of contractual terms and conditions. Exposure to credit risk is measured in terms of both current obligations and the market value of forward positions net of any posted collateral such as cash and letters of credit.\nThe financial status of our banking partners is periodically assessed through traditional credit ratings provided by major credit rating agencies.\nOther Information\nCritical Accounting Estimates\nWe apply certain accounting policies in accordance with GAAP, which require that we make estimates and judgments that have had, and may continue to have, significant impacts on our operations and Consolidated Financial Statements. We evaluate our estimates on an ongoing basis. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates. We believe the following represent the more significant items requiring the use of judgment in preparing our Consolidated Financial Statements:\nBasis of Accounting for Rate-Regulated Subsidiaries.\n ASC Topic 980, \nRegulated Operations\n, provides that rate-regulated subsidiaries account for and report assets and liabilities consistent with the economic effect of the way in which regulators establish rates, if the rates established are designed to recover the costs of providing the regulated service and if the competitive environment makes it probable that such rates can be billed and collected. Accordingly, certain expenses and credits subject to utility regulation or rate determination normally reflected in income may be deferred on the Consolidated Balance Sheets and recognized in income as the related amounts are included in service rates and recovered from or refunded to customers. For additional information, refer to Note 12, \"Regulatory Matters,\" in the Notes to Consolidated Financial Statements.\nIn the event that regulation significantly changes the opportunity for us to recover our costs in the future, all or a portion of our regulated operations may no longer meet the criteria for the application of ASC Topic 980, \nRegulated Operations\n. In such event, a write-down of all or a portion of our existing regulatory assets and liabilities could result. If transition cost recovery is approved by the appropriate regulatory bodies that would meet the requirements under GAAP for continued accounting as regulatory assets and liabilities during such recovery period, the regulatory assets and liabilities would be reported at the recoverable amounts. If we were unable to continue to apply the provisions of ASC Topic 980, \nRegulated Operations\n, we would be required to apply the provisions of ASC Topic 980-20, \nDiscontinuation of Rate-Regulated Accounting\n. In management’s opinion, our regulated subsidiaries will be subject to ASC Topic 980, \nRegulated Operations\n for the foreseeable future.\nCertain of the regulatory assets reflected on our Consolidated Balance Sheets require specific regulatory action in order to be included in future service rates. Although recovery of these amounts is not guaranteed, we believe that these costs meet the requirements for deferral as regulatory assets. If we determine that the amounts included as regulatory assets are no longer probable of recovery, a charge to income would immediately be required to the extent of the unrecoverable amounts.\n53\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nOne of the more significant items recorded through the application of this accounting guidance is the regulatory overlay for JV accounting. The application of HLBV to consolidated VIEs generally results in the recognition of profit from the related JVs over a time frame that is different from when the regulatory return is earned. In accordance with the principles of ASC 980, we have recognized a regulatory deferral of certain amounts representing the timing difference between the profit earned from the JVs and the amount included in regulated rates to recover our approved investments in consolidated JVs. For additional information, refer to Note 1, \"Nature of Operations and Summary of Significant Accounting Policies - S. Noncontrolling Interest,\" in the Notes to Consolidated Financial Statements.\nPension and Postretirement Benefits.\n We have defined benefit plans for both pension and other postretirement benefits. The calculation of the net obligations and annual expense related to the plans requires a significant degree of judgment regarding the discount rates to be used in bringing the liabilities to present value, expected long-term rates of return on plan assets, health care trend rates, and mortality rates, among other assumptions. Due to the size of the plans and the long-term nature of the associated liabilities, changes in the assumptions used in the actuarial estimates could have material impacts on the measurement of the net obligations and annual expense recognition. Differences between actuarial assumptions and actual plan results are deferred into AOCI or a regulatory balance sheet account, depending on the jurisdiction of our entity. These deferred gains or losses are then amortized into the income statement when the accumulated differences exceed 10% of the greater of the projected benefit obligation or the fair value of plan assets (known in GAAP as the “corridor” method) or when settlement accounting is triggered.\nThe discount rates, expected long-term rates of return on plan assets, health care cost trend rates and mortality rates are critical assumptions. Methods used to develop these assumptions are described below. While a third party actuarial firm assists with the development of many of these assumptions, we are ultimately responsible for selecting the final assumptions.\nThe discount rate is utilized principally in calculating the actuarial present value of pension and other postretirement benefit obligations and net periodic pension and other postretirement benefit plan costs. Our discount rates for both pension and other postretirement benefits are determined using spot rates along an AA-rated above median yield curve with cash flows matching the expected duration of benefit payments to be made to plan participants.\nThe expected long-term rate of return on plan assets is a component utilized in calculating annual pension and other postretirement benefit plan costs. We estimate the expected return on plan assets by evaluating expected bond returns, equity risk premiums, target asset allocations, the effects of active plan management, the impact of periodic plan asset rebalancing and historical performance. We also consider the guidance from our investment advisors in making a final determination of our expected rate of return on assets. For measurement of 2024 net periodic benefit cost, we selected a weighted-average assumption of the expected pre-tax long-term rate of return of 7.02% and 7.06% for our pension and other postretirement benefit plan assets, respectively. For measurement of 2025 net periodic benefit cost, we selected a weighted-average assumption of the expected pre-tax long-term rate of return \no\nf 7.30% and 7.09 % respectively, \nfor\n our pension and other postretirement benefit plan assets.\nWe estimate the assumed health care cost trend rate, which is used in determining our other postretirement benefit net expense, based upon our actual health care cost experience, the effects of recently enacted legislation, third-party actuarial surveys and general economic conditions. \nWe utilize a full yield curve approach to estimate the service and interest components of net periodic benefit cost for pension and other postretirement benefits by applying the specific spot rates along the yield curve used in the determination of the benefit obligation to the relevant projected cash flows. For further discussion of our pension and other postretirement benefits, see Note 16, \"Pension and Other Postemployment Benefits,\" in the Notes to Consolidated Financial Statements. \nTypically, we use the Society of Actuaries’ most recently published mortality data in developing a best estimate of mortality as part of the calculation of the pension and other postretirement benefit obligations. We adopted Aon's U.S. Endemic Mortality Improvement scale MP-2021, accounting for both the near-term and long-term COVID-19 impacts.\n54\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nThe following tables illustrate the effects of changes in these actuarial assumptions while holding all other assumptions constant:\nImpact on December 31, 2024 Projected Benefit Obligation Increase/(Decrease)\nChange in Assumptions \n(in millions)\nPension Benefits\nOther Postretirement Benefits\n+50 basis points change in discount rate\n$\n(44.9)\n$\n(18.8)\n-50 basis points change in discount rate\n48.2 \n20.4 \nImpact on 2024 Expense Increase/(Decrease)\n(1)\nChange in Assumptions \n(in millions)\nPension Benefits\nOther Postretirement Benefits\n+50 basis points change in discount rate\n$\n(1.6)\n$\n0.3 \n-50 basis points change in discount rate\n1.6 \n0.4 \n+50 basis points change in expected long-term rate of return on plan assets\n(6.8)\n(1.2)\n-50 basis points change in expected long-term rate of return on plan assets\n6.8 \n1.2 \n(1)\nBefore labor capitalization and regulatory deferrals.\n \nGoodwill and Other Intangible Assets.\n We have six goodwill reporting units, comprised of the six state operating companies within both the Columbia Operations and NIPSCO Operations reportable segments. Our goodwill assets at December 31, 2024 were $1,485.9 million, most of which resulted from the acquisition of Columbia on November 1, 2000.\nAs required by GAAP, we test for impairment of goodwill on an annual basis and on an interim basis when events or circumstances indicate that a potential impairment may exist. Our annual goodwill test takes place in the second quarter of each year and was performed on May 1, 2024. A quantitative (\"step 1\") test was completed on May 1, 2024 for all reporting units. Consistent with our historical impairment testing of goodwill, fair value of the reporting units was determined based on a weighting of income and market approaches. These approaches require significant judgments including appropriate long-term growth rates and discount rates for the income approach and appropriate multiples of earnings for peer companies and control premiums for the market approach. The discount rates were derived using peer company data compiled with the assistance of a third party valuation services firm. The discount rates used are subject to change based on changes in tax rates at both the state and federal level, debt and equity ratios at each reporting unit, U.S. Treasury interest rates and general economic conditions. The long-term growth rate was derived by evaluating historic growth rates, new business and investment opportunities beyond the near term horizon. The long-term growth rate is subject to change depending on inflationary impacts to the U.S. economy and the individual business environments in which each reporting unit operates. The Step 1 analysis performed indicated that the fair value of each of the reporting units exceeds their carrying value. As a result, no impairment charges were recorded. See Note 10, \"Goodwill,\" in the Notes to Consolidated Financial Statements for information regarding our 2024 analyses and assumptions.\nUnbilled Revenue.\n We record utility operating revenues when energy is delivered to our customers. However, the determination of energy sales to individual customers is based upon the reading of their meters, which occurs on a systematic basis throughout the month. At the end of each month, amounts of energy delivered to customers since the date of their last meter reading are estimated and corresponding unbilled revenues are calculated. This unbilled revenue is estimated each month based upon historical usage, customer rates and weather. As of December 31, 2024, we recorded $408.1 million of customer accounts receivable for unbilled revenue. Significant fluctuations in energy demand for the unbilled period or changes in the composition of customer classes could impact the accuracy of the unbilled revenue estimate. Refer to Note 3, \"Revenue Recognition,\" in the Notes to Consolidated Financial Statements for additional information regarding our significant judgments and estimates related to unbilled revenue recognition.\nIncome Taxes. \nThe consolidated income tax provision and deferred income tax assets and liabilities, as well as any unrecognized tax benefits and valuation allowances, require use of estimates and significant management judgement. Although we believe that current estimates for deferred tax assets and liabilities are reasonable, actual results could differ from these estimates for a variety of reasons, including reasonable projections of taxable income, the ability and intent to implement tax planning strategies if necessary, and interpretations of applicable tax laws and regulations across multiple taxing jurisdictions. \n55\nTable of Contents\nITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nN\nI\nS\nOURCE\n I\nNC\n.\nUltimate resolution or clarification of income tax matters may result in favorable or unfavorable impacts to net income and cash flows, and adjustments to tax-related assets and liabilities could be material.\nWe account for uncertain income tax positions using a benefit recognition model with a two-step approach including a more-likely-than-not recognition threshold and a measurement approach based on the largest amount of tax benefit that is greater than 50% likely of being realized upon ultimate settlement. We evaluate each position based solely on the technical merits and facts and circumstances of the position, assuming the position will be examined by a taxing authority having full knowledge of all relevant information. Significant judgment is required to determine whether the recognition threshold has been met and, if so, the appropriate amount of tax benefits to be recorded in the consolidated financial statements. At December 31, 2024 and 2023, we had $21.7 million of unrecognized tax benefits. Changes in these unrecognized tax benefits may result from remeasurement of amounts expected to be realized, settlements with tax authorities and expiration of statutes of limitations.\nOn a quarterly basis, we evaluate our deferred tax assets by considering current and historical financial results, expectations for future taxable income and the availability of tax planning strategies that can be implemented, if necessary, to realize deferred tax assets. Failure to achieve forecasted taxable income or successfully implement tax planning strategies may affect the realization of deferred tax assets. We establish a valuation allowance when we conclude it is more likely than not that all, or a portion, of a deferred tax asset will not be realized in future periods. Significant judgment is required to determine the amount of tax benefits expected to be realized. At December 31, 2024 and 2023, we had established $6.4 million and $6.4 million, respectively, of valuation allowances (net of federal benefit) related to certain state net operating loss carryforwards. Refer to Note 15, \"Income Taxes,\" in the Notes to Consolidated Financial Statements for additional information.\nRecently Issued Accounting Pronouncements\nRefer to Note 2, \"Recent Accounting Pronouncements,\" in the Notes to Consolidated Financial Statements.",
  "item2": null
}