{
  "source_file": "nix-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNiSource Inc.\nIndex\nPage\nExecutive Summary\n44\nSummary of Consolidated Financial Results\n47\nResults and Discussion of Segment Operations\n48\nColumbia Operations\n49\nNIPSCO Operations\n52\nLiquidity and Capital Resources\n57\nRegulatory, Environmental and Safety Matters\n62\nMarket Risk Disclosures\n65\nOther Information\n66\n43\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nEXECUTIVE SUMMARY\nThis Management's Discussion and Analysis of Financial Condition and Results of Operations (\"Management’s Discussion\") includes management’s analysis of past financial results and certain potential factors that may affect future results, potential future risks and approaches that may be used to manage those risks. See \"Note regarding forward-looking statements\" at the beginning of this report for a list of factors that may cause results to differ materially.\nManagement's Discussion is designed to provide an understanding of our operations and financial performance and should be read in conjunction with our Condensed Consolidated Financial Statements (unaudited) included in this report and our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nWe are an energy holding company under the Public Utility Holding Company Act of 2005 whose utility subsidiaries are fully regulated natural gas and electric utility companies serving customers in six states. We generate substantially all of our operating income through these rate regulated businesses. Our businesses are summarized for financial reporting purposes into two primary reportable segments: Columbia Operations and NIPSCO Operations. Refer to ''Note 16, \"Business Segment Information,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for further discussion of our business segments.\nOur vision is to be a premier, innovative and trusted energy partner. We exist to deliver safe, reliable energy that drives value to our customers. In order to achieve this goal, we seek to develop strategies that benefit all stakeholders as we (i) support long-term infrastructure investment and safety programs to better serve our customers, (ii) align our tariff structures with our cost structure, and (iii) drive value and enable growth in an evolving energy ecosystem. These strategies focus on improving safety and reliability, enhancing customer experience, pursuing regulatory and legislative initiatives to increase accessibility for customers currently not on our gas and electric service, ensuring customer affordability and reducing emissions while generating sustainable returns. The safety of our customers, communities and employees remains our focus. Serving as a guiding practice for our SMS, NiSource is certified in conformance to the American Petroleum Institute Recommended Practice 1173, which is the foundation to our journey towards operational excellence.\nData Center Contract and Strategy:  \nData Center Contract\nOn September 18, 2025, NIPSCO entered into an agreement (the “Data Center Contract”) with a wholly-owned subsidiary of a large publicly traded company (the “Customer”), under which NIPSCO will provide electricity to Customer’s data centers. Under the Data Center Contract, which is subject to IURC approval, NIPSCO will provide electric service to the Customer pursuant to a capacity commitment beginning in 2027 and increasing annually to 2,400 MW by the end of 2032 and will construct up to 3,000 MW of dispatchable generation to provide such electric service. The Data Center Contract’s initial term ends 15 years after the initial energization of Customer’s initial data center. Starting January 1, 2027, Customer will regularly pay NIPSCO a fixed capacity charge and certain pass-through charges. The Customer’s publicly traded, investment-grade parent company has guaranteed the Customer’s payment obligations. These charges are structured to provide us with a return of our invested capital over the fifteen-year initial term. In addition, the Data Center Contract contains provisions for adjustment of the charges designed to provide us with an unlevered internal rate of return on our invested capital over the initial term within a defined range, which we expect over the life of the Data Center Contract to result in an overall realized return greater than that of NIPSCO’s current electric operations, driven by execution and financing. Our realized return may be impacted by factors such as construction costs, operating performance, financing costs and other variables. NIPSCO will also propose to the IURC a mechanism to pass savings back to retail customer for use of the existing system which is expected to begin in 2027. Refer to Part II, Item 1A, “Risk Factors” for a discussion of certain of these factors and other risks relating to the Data Center Contract.\nIn order to meet demand under the Data Center Contract, NIPSCO plans to enter into a PPA with GenCo, which is subject to IURC approval and which is expected to contain terms and provisions substantially similar to the Data Center Contract, such that economic benefits (except savings that are expected to be passed to retail customers as described above) and obligations of the Data Center Contract as they relate to the Generation Assets (as defined below) are expected to be borne by GenCo and NiSource, as GenCo’s ultimate parent company, rather than NIPSCO.  \nGenCo plans to construct 400 MW of new battery storage and a new power generation facility consisting of two 1,300 MW combined-cycle, natural gas-fired turbines, which are expected to reach commercial operation between 2028 and 2032 (such assets, collectively, the “Generation Assets”). GenCo has entered into engineering, procurement and construction contracts (the “EPC Contracts”), and certain equipment supply contracts, including a contract to acquire turbines, with respect to the \n44\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nconstruction of the Generation Assets. The aggregate cost of the Generation Assets, together with the cost to develop related transmission infrastructure (collectively, the “Contract Assets”), is currently estimated to be approximately $7 billion. The EPC Contracts provide certain protections against cost overruns, and any excess costs with respect to the EPC Contracts beyond those protections, or arising apart from the EPC Contracts are, unless otherwise agreed by the parties, shared by Customer and NIPSCO (for transmission) and GenCo (for generation). If the Contract Assets are delivered into service late or do not achieve certain performance-related milestones, Customer is entitled to liquidated damages, subject to a cap and offset against the regular charges paid by the Customer. \nEither party may terminate the Data Center Contract upon certain defaults or failure to obtain necessary related approvals from the IURC and FERC. Customer may terminate the Data Center Contract for convenience following certain notice periods and also has a one-time option (exercisable no later than March 31, 2029) to halve the committed capacity under the Data Center Contract to 1,200 MW commencing January 31, 2032. If Customer terminates for convenience, exercises its reduction option or defaults, NIPSCO or its affiliates will be reimbursed for investment costs, subject to agreed caps based on cost estimates by year as of signing. NIPSCO’s aggregate liability, including liquidated damages, is subject to a cap. \nNIPSCO’s and GenCo’s operations under the Data Center Contract will be regulated by the IURC in a different way from the regulatory mechanisms applicable to NIPSCO’s historical operations. The terms of the Data Center Contract were determined by commercial negotiation with the Customer. These terms include the charges we receive from the Customer and provisions that may result in adjustments to such charges, including those relating to certain liquidated damages that we may owe Customer in the event of construction delays or capacity shortfalls, the parties’ responsibility to share cost overruns, certain changes in law and force majeure events. The IURC will not regulate the commercial terms of the Data Center Contract; however, the IURC will maintain oversight under the Data Center Contract to ensure NIPSCO provides reliable service to the Customer at just and reasonable rates. In order to recover our investment costs and earn our return under the Data Center Contract, our subsidiaries must efficiently perform their own obligations and must look to the Customer (or its parent guarantor) to perform its obligations, rather than the IURC making use of its traditional rate-making process. In addition, under the Data Center Contract, NIPSCO has direct contractual obligations to the Customer to, among other things, construct the Contract Assets and deliver committed electric capacity in fixed amounts by certain dates. \nData Center Strategy\nWe continue to experience strong demand from potential data center customers in our northern Indiana service territory and are engaged in negotiations with potential counterparties. Through certain of our subsidiaries, we have entered into certain construction and equipment supply contracts in relation to additional generation and transmission assets that may be used to serve potential future data center customers. As we continue to evaluate our potential data center opportunities, we will continue to focus on the community, financial, operational and regulatory factors that must be managed effectively in order to succeed with our data center strategy. We believe data center development can enhance our local tax base, diversify the employment base across the state of Indiana, and provide greater value to existing customers and shareholders. We continually evaluate ways to effectively manage the potential power demand, generation sources, and transmission capabilities to meet potential further load growth from additional data center customers, while at the same time focusing on our environmental goals.\nIn order to perform under any further data center contracts, we expect that we would need to develop additional generation and transmission assets and obtain additional financing in connection with such development. For these and other reasons, our ability to successfully execute our data strategy is subject to a number of risks and uncertainties. Refer to Part II, Item 1A, “Risk Factors” for a discussion of certain risks relating to our data center strategy.\nEnergy Transition: \nWe continue to advance our energy transition strategy, primarily through the continuation and enhancement of existing programs, such as implementing our plan to retire and replace remaining coal-fired electric generation by 2028 with a balanced mix of low- or zero-emission electric generation, ongoing pipe replacement and modernization programs, and deployment of advanced leak detection and repair. Our electric generation transition, initiated through our 2018 Integrated Resource Plan (\"2018 Plan\") is well underway, and we are continually adjusting to the dynamic energy landscape. As of September 30, 2025, we have placed in service owned renewable and storage projects with combined nameplate capacities of 1,950 MW and 101 MW respectively. Renewable PPA projects with a combined nameplate capacity of 1,000 MW have also been placed in service. In addition, a renewable BTA project with a nameplate capacity of 200 MW, and a renewable PPA project with a nameplate capacity of 195 MW were under development as of September 30, 2025, all of which have received IURC approval. For additional information, see Note 14, \"Other Commitments and Contingencies - D. Other Matters\". We are continuing to evaluate the development of federal and state executive orders, or other regulatory actions, with respect to our generation transition plans.  Absent a directive to remain open, we remain on track to retire R.M. Schahfer's remaining two \n45\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\ncoal units by the end of 2025. We are taking steps to be prepared to respond to any executive order or regulatory action to the contrary.  For additional information, see \"Results and Discussion of Operations - NIPSCO Operations,\" in this Management's Discussion, and see Part I, Item 1A. \"Risk Factors\" in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nNIPSCO's 2021 Integrated Resource Plan (\"2021 Plan\") lays out a timeline to retire the Michigan City Generating Station by the end of 2028. The 2021 Plan calls for the replacement of the retiring units with a diverse portfolio of resources including demand side management resources, incremental solar, stand-alone energy storage and upgrades to existing facilities at the Sugar Creek Generating Station, among other steps. Additionally, the 2021 Plan calls for a new natural gas peaking facility to replace existing vintage gas peaking facilities at the R.M. Schahfer Generating Station to support system reliability and resiliency, and upgrades to the electric transmission system. Following approval by the IURC in October 2024, the construction of a new 400 MW natural gas peaking generation facility is underway, which is expected to support the planned retirement of the existing vintage gas peaking facilities by the end of 2028. Final retirement dates for these units, as well as Michigan City, will be subject to MISO approval.\nNIPSCO's 2024 Integrated Resource Plan (\"2024 Plan\") was submitted to the IURC on December 9, 2024. The 2024 Plan maintains the retirement decisions and capacity additions identified in the 2018 and 2021 Integrated Resource Plans and calls for additional generation resources through 2029 to support capacity requirements. The 2024 Plan informs future generation investments required to ensure reliability for NIPSCO’s customers and incorporates factors such as anticipated load growth from data centers and other economic development opportunities, EPA emissions rules, and evolving MISO resource accreditation rules. We plan to move as efficiently as possible while maintaining the integrity of our commercial, planning, regulatory, procurement and operational execution processes. \nWe continue to enhance safety and reduce methane emissions on our gas systems through modernization programs and utilization of advanced leak detection and repair. In addition, we plan to advance other low- or zero-emission energy resources and technologies, such as hydrogen and renewable natural gas.\nTransformation:\n Our enterprise-wide transformation roadmap focuses on operational excellence, safety, operation and maintenance management, and unlocking efficiencies. We are committed to identifying and implementing initiatives that will enable us to streamline work and improve logistics company-wide. These efforts include investments in proven technologies backed with standardized processes that will change the way we plan, schedule, and execute work in the field and how we engage and provide service to our customers. Taken together, all of our optimization initiatives will prioritize safety and continue to optimize our long-term growth profile. Completing the first major milestone of our enterprise-wide transformation roadmap, we concluded all three phases of a WAM ERP program. Phase one of the program implemented the solution within our electric and transmission operations, while the second phase of the program included all gas distribution operations across our operating territories. The third and final phase incorporated our generation assets. This ERP system optimizes the scheduling, dispatch, and execution of our field operations. We will now proceed as planned with our enterprise transformation roadmap by focusing on our customer technology platforms. In addition to transforming technology to enhance our employee and customer experiences, we believe these programs will also ensure we remain on modern systems that help reduce enterprise risk related to end-of-life systems. \nEconomic Environment: \nWe continue to monitor risks related to order and delivery lead times for construction and other materials, potential unavailability of materials due to global shortages in raw materials, and decreased construction labor productivity in the event of disruptions in the availability of materials. We continue to experience elevated material and supply costs in certain product sourcing categories driven by increased demand and tariffs. To the extent that work plan delays occur or our costs increase, our business operations, results of operations, cash flows, and financial condition could be materially adversely affected. \nWe are faced with increased competition for employee and contractor talent in the current labor market which has resulted in increased costs to attract and retain talent. We are ensuring that we use all internal human capital programs (development, leadership enablement programs, succession, performance management) to promote retention of our current employees along with having a competitive and attractive appeal for potential recruits. Our flexible work arrangements, where possible, support a broader talent footprint for sourcing talent needed and for remaining competitive.\n46\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nWe continue to evaluate our financing plan to manage interest expense and exposure to rates. For more information on interest rate risk, see \"Market Risk Disclosures\".\nSummary of Consolidated Financial Results \nA summary of our consolidated financial results for the three and nine months ended September 30, 2025 and 2024 are presented below:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions, except per share amounts)\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\nOperating Revenues\n$\n1,273.1\n \n$\n1,076.3 \n$\n196.8 \n$\n4,739.3\n \n$\n3,867.3 \n$\n872.0 \nOperating Expenses\nCost of energy\n193.6\n \n165.9 \n(27.7)\n1,102.9\n \n755.6 \n(347.3)\nOther Operating Expenses\n782.0\n \n692.1 \n(89.9)\n2,316.6\n \n2,073.0 \n(243.6)\nTotal Operating Expenses\n975.6\n \n858.0 \n(117.6)\n3,419.5\n \n2,828.6 \n(590.9)\nOperating Income\n297.5\n \n218.3 \n79.2 \n1,319.8\n \n1,038.7 \n281.1 \nTotal Other Deductions, Net\n(169.9)\n(105.4)\n(64.5)\n(435.5)\n(328.8)\n(106.7)\nIncome Taxes\n20.6\n \n15.9 \n(4.7)\n150.1\n \n109.5 \n(40.6)\nNet Income\n107.0\n \n97.0 \n10.0 \n734.2\n \n600.4 \n133.8 \nNet income attributable to noncontrolling interest\n12.3\n \n11.3 \n(1.0)\n62.5\n \n63.9 \n1.4 \nNet Income Attributable to NiSource\n94.7\n \n85.7 \n9.0 \n671.7\n \n536.5 \n135.2 \nPreferred dividends and redemption premium\n—\n \n— \n— \n—\n \n(20.7)\n20.7 \nNet Income Available to Common Shareholders\n94.7\n \n85.7 \n9.0 \n671.7\n \n515.8 \n155.9 \nEarnings Per Share\nBasic Earnings Per Share\n$\n0.20\n \n$\n0.19 \n$\n0.01 \n$\n1.42\n \n$\n1.15 \n$\n0.27 \nDiluted Earnings Per Share\n$\n0.20\n \n$\n0.19 \n$\n0.01 \n$\n1.42\n \n$\n1.14 \n$\n0.28 \nThe majority of the costs of energy in both segments are tracked costs that are passed through directly to the customer, resulting in an equal and offsetting amount reflected in operating revenues.\nThe increase in net income available to common shareholders for the three and nine months ended September 30, 2025 was primarily due to higher revenues driven by our capital investments, partially offset by higher operating expenses, including increased operation and maintenance expense and depreciation expense attributed to our net plant balances, as well as increased interest expense.\nFor additional information on operating income variance drivers see \"Results and Discussion of Segment Operations\" for Columbia Operations and NIPSCO Operations in this Management's Discussion.\nIncome Taxes\nRefer to Note 12, \"Income Taxes,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for information on income taxes and the change in the effective tax rates for the periods presented.\n \n47\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRESULTS AND DISCUSSION OF SEGMENT OPERATIONS\nPresentation of Segment Information\nColumbia Operations aggregates the results of the fully regulated and wholly owned subsidiaries of NiSource Gas Distribution Group, Inc. Each Columbia distribution company is an operating segment which we aggregate to form the Columbia Operations reportable segment. NIPSCO Operations aggregates the results of NIPSCO Holdings I, and its majority-owned subsidiaries, including NIPSCO, which has both regulated gas and electric operations in northern Indiana. The remainder of our operations, which are not significant enough on a stand-alone basis to warrant treatment as a reportable segment, are presented as \"Corporate and Other\" within the Notes to the Condensed Consolidated Financial Statements (unaudited) and primarily are comprised of interest expense on holding company debt, and unallocated corporate costs and activities.\n48\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nColumbia Operations\nFinancial and operational data for the Columbia Operations segment for the three and nine months ended September 30, 2025 and 2024 are presented below.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\nOperating Revenues\n$\n488.2\n \n$\n426.7 \n$\n61.5 \n$\n2,336.7\n \n$\n1,874.1 \n$\n462.6 \nOperating Expenses\nCost of energy\n58.5\n \n34.2 \n(24.3)\n548.7\n \n319.3 \n(229.4)\nOperation and maintenance\n212.8\n \n202.9 \n(9.9)\n663.5\n \n604.9 \n(58.6)\nDepreciation and amortization\n112.7\n \n103.0 \n(9.7)\n332.6\n \n300.6 \n(32.0)\nLoss on sale of assets, net\n0.1\n \n— \n(0.1)\n0.4\n \n— \n(0.4)\nOther taxes\n52.0\n \n45.4 \n(6.6)\n171.4\n \n149.5 \n(21.9)\nTotal Operating Expenses\n436.1\n \n385.5 \n(50.6)\n1,716.6\n \n1,374.3 \n(342.3)\nOperating Income\n$\n52.1\n \n$\n41.2 \n$\n10.9 \n$\n620.1\n \n$\n499.8 \n$\n120.3 \nRevenues\nResidential\n$\n329.9\n \n$\n299.2 \n$\n30.7 \n$\n1,590.0\n \n$\n1,303.4 \n$\n286.6 \nCommercial\n95.8\n \n79.2 \n16.6 \n531.6\n \n402.4 \n129.2 \nIndustrial\n36.2\n \n32.3 \n3.9 \n122.5\n \n106.0 \n16.5 \nOff-System\n13.8\n \n7.2 \n6.6 \n58.9\n \n30.5 \n28.4 \nWholesale and Other\n12.5\n \n8.8 \n3.7 \n33.7\n \n31.8 \n1.9 \nTotal\n$\n488.2\n \n$\n426.7 \n$\n61.5 \n$\n2,336.7\n \n$\n1,874.1 \n$\n462.6 \nSales and Transportation (MMDth)\nResidential\n8.3\n \n8.3 \n— \n119.1\n \n102.0 \n17.1 \nCommercial\n12.9\n \n12.2 \n0.7 \n95.6\n \n85.0 \n10.6 \nIndustrial\n72.3\n \n70.9 \n1.4 \n207.9\n \n207.9 \n— \nOff-System\n6.1\n \n4.6 \n1.5 \n20.7\n \n17.8 \n2.9 \nWholesale and Other\n—\n \n— \n— \n0.2\n \n0.2 \n— \nTotal\n99.6\n \n96.0 \n3.6 \n443.5\n \n412.9 \n30.6 \nHeating Degree Days\n(1)\n27\n \n28 \n(1)\n3,191\n \n2,659 \n532 \nNormal Heating Degree Days\n(1)\n47\n \n53 \n(6)\n3,214\n \n3,310 \n(96)\n% Warmer than Normal\n(43)\n%\n(47)\n%\n(1)\n%\n(20)\n%\n% (Warmer) Colder than prior year\n(4)\n%\n20\n \n%\nColumbia Operations Customers\nResidential\n2,215,788\n \n2,202,206 \n13,582 \nCommercial\n187,005\n \n186,087 \n918 \nIndustrial\n1,976\n \n1,975 \n1 \nOther\n6\n \n4 \n2 \nTotal\n2,404,775\n \n2,390,272 \n14,503 \n(1)\n Heating degree figures represent averages of the five jurisdictions served by Columbia Operations. \nComparability of operation and maintenance expenses, depreciation and amortization, and other taxes may be impacted by regulatory, depreciation, and tax trackers that allow for the recovery in rates of certain costs.\n49\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nColumbia Operations\nThe underlying reasons for changes in our operating revenues for the three and nine months ended September 30, 2025 compared to the same period in 2024 are presented below.\nFavorable (Unfavorable)\nChanges in Operating Revenues \n(in millions)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\nNew rates from base rate proceedings and regulatory capital programs\n$\n31.0 \n$\n139.3 \nThe effects of weather in 2025 compared to 2024\n0.2 \n37.9 \nThe effects of customer growth\n1.2 \n4.3 \nThe effects of customer usage\n0.9 \n(6.7)\nOther\n(1.1)\n(0.3)\nChange in operating revenues (before cost of energy and other tracked items)\n$\n32.2 \n$\n174.5 \nOperating revenues offset in operating expense\nHigher cost of energy billed to customers\n24.2 \n229.3 \nHigher tracker deferrals within operation and maintenance, depreciation, and tax\n5.1 \n58.8 \nTotal change in operating revenues\n$\n61.5\n \n$\n462.6\n \nWeather\nIn general, we calculate the weather-related revenue variance based on changing customer demand driven by weather variance from normal heating degree days, net of weather and revenue normalization mechanisms. Our composite heating degree days reported do not directly correlate to the weather-related dollar impact on the results of Columbia Operations. Heating degree days experienced during different times of the year or in different operating locations may have more or less impact on volume and dollars depending on when and where they occur. When the detailed results are combined for reporting, there may be weather-related dollar impacts on operations when there is not an apparent or significant change in our aggregated composite heating degree day comparison.\nSales\nThe increase in total volumes for the nine months ended September 30, 2025, compared to the same period in 2024, is primarily attributable to increased usage by residential and commercial customers as a result of colder weather.\nCommodity Price Impact\nCost of energy for the Columbia Operations segment is principally comprised of the cost of natural gas procured on behalf of and sold to customers while providing transportation services. All of our Columbia Operations companies have state-approved recovery mechanisms that provide a means for full recovery of prudently incurred gas costs. These are tracked costs that are passed through directly to the customer, and the gas costs included in revenues are matched with the gas cost expense recorded in the period. Any difference in actual costs incurred and amounts billed to customers is recorded on the Condensed Consolidated Balance Sheets (unaudited) as under-recovered or over-recovered gas cost to be included in future customer billings. Therefore, increases in these tracked operating expenses are offset by increases in operating revenues and have essentially no impact on net income. Certain Columbia Operations companies continue to offer choice opportunities, where customers can choose to purchase gas from a third-party supplier through regulatory initiatives in their respective jurisdictions.\nThe underlying reasons for changes in our operating expenses for the three and nine months ended September 30, 2025 compared to the same period in 2024 are presented below.\n50\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nColumbia Operations\nFavorable (Unfavorable)\nChanges in Operating Expenses \n(in millions)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\nHigher depreciation and amortization expense\n$\n(9.7)\n$\n(32.0)\nHigher employee and administrative related expenses\n(5.1)\n(15.7)\nHigher property tax\n(5.0)\n(9.8)\nOther\n(1.5)\n3.3 \nChange in operating expenses (before cost of energy and other tracked items)\n$\n(21.3)\n$\n(54.2)\nOperating expenses offset in operating revenue\nHigher cost of energy billed to customers\n(24.2)\n(229.3)\nHigher tracker deferrals within operation and maintenance, depreciation, and tax\n(5.1)\n(58.8)\nTotal change in operating expense\n$\n(50.6)\n$\n(342.3)\n51\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nNIPSCO Operations\nFinancial and operational data for the NIPSCO Operations segment, which services both gas and electric customers, for the three and nine months ended September 30, 2025 and 2024 are presented below.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\nNIPSCO Operations\nOperating Revenues\n$\n787.3\n \n$\n652.9 \n$\n134.4 \n$\n2,409.8\n \n$\n2,003.0 \n$\n406.8 \nOperating Expenses\nCost of energy\n135.2\n \n131.7 \n(3.5)\n554.3\n \n436.3 \n(118.0)\nOperation and maintenance\n215.1\n \n177.7 \n(37.4)\n628.1\n \n556.5 \n(71.6)\nDepreciation and amortization\n185.3\n \n156.8 \n(28.5)\n492.5\n \n432.5 \n(60.0)\nLoss on impairment of assets\n—\n \n— \n— \n0.7\n \n— \n(0.7)\nGain on sale of assets\n—\n \n— \n— \n—\n \n(0.1)\n(0.1)\nOther taxes\n19.1\n \n15.4 \n(3.7)\n55.7\n \n47.8 \n(7.9)\nTotal Operating Expenses\n554.7\n \n481.6 \n(73.1)\n1,731.3\n \n1,473.0 \n(258.3)\nOperating Income\n$\n232.6\n \n$\n171.3 \n$\n61.3 \n$\n678.5\n \n$\n530.0 \n$\n148.5 \nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\nNIPSCO Electric\nRevenues\nResidential\n$\n255.6\n \n$\n197.9 \n$\n57.7 \n$\n588.1\n \n$\n498.6 \n$\n89.5 \nCommercial\n211.5\n \n172.7 \n38.8 \n533.3\n \n470.0 \n63.3 \nIndustrial\n156.9\n \n125.1 \n31.8 \n434.1\n \n361.1 \n73.0 \nWholesale and Other\n34.3\n \n43.4 \n(9.1)\n97.7\n \n112.6 \n(14.9)\nTotal\n$\n658.3\n \n$\n539.1 \n$\n119.2 \n$\n1,653.2\n \n$\n1,442.3 \n$\n210.9 \nSales (GWh)\nResidential\n1,115.2\n \n1,079.4 \n35.8 \n2,729.9\n \n2,673.1 \n56.8 \nCommercial\n1,040.2\n \n1,044.7 \n(4.5)\n2,821.7\n \n2,850.3 \n(28.6)\nIndustrial\n2,158.2\n \n2,106.3 \n51.9 \n6,328.2\n \n5,884.1 \n444.1 \nWholesale and Other\n328.2\n \n327.7 \n0.5 \n794.9\n \n818.1 \n(23.2)\nTotal\n4,641.8\n \n4,558.1 \n83.7 \n12,674.7\n \n12,225.6 \n449.1 \nCooling Degree Days\n640\n \n556 \n84 \n941\n \n882 \n59 \nNormal Cooling Degree Days\n588\n \n590 \n(2)\n852\n \n838 \n14 \n% Warmer (Colder) than Normal\n9\n \n%\n(6)\n%\n10\n \n%\n5 \n%\n% Warmer than prior year\n15\n \n%\n7\n \n%\nNIPSCO Electric Customers\nResidential\n432,889\n \n429,382 \n3,507 \nCommercial\n59,540\n \n59,056 \n484 \nIndustrial\n2,103\n \n2,116 \n(13)\nWholesale and Other\n705\n \n709 \n(4)\nTotal\n495,237\n \n491,263 \n3,974 \n52\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nNIPSCO Operations\nThree Months Ended September 30,\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nFavorable (Unfavorable)\n2025\n2024\nFavorable (Unfavorable)\nNIPSCO Gas\nRevenues\nResidential\n$\n73.7\n \n$\n66.8 \n$\n6.9 \n$\n487.5\n \n$\n357.5 \n$\n130.0 \nCommercial\n32.6\n \n28.5 \n4.1 \n183.4\n \n134.0 \n49.4 \nIndustrial\n19.7\n \n16.4 \n3.3 \n73.7\n \n56.3 \n17.4 \nOther\n3.0\n \n2.1 \n0.9 \n12.0\n \n12.9 \n(0.9)\nTotal\n$\n129.0\n \n$\n113.8 \n$\n15.2 \n$\n756.6\n \n$\n560.7 \n$\n195.9 \nSales and Transportation Volumes (MMDth)\nResidential\n3.6\n \n3.5 \n0.1 \n44.9\n \n39.1 \n5.8 \nCommercial\n4.7\n \n4.9 \n(0.2)\n32.3\n \n29.2 \n3.1 \nIndustrial\n62.2\n \n60.5 \n1.7 \n200.5\n \n192.3 \n8.2 \nTotal\n70.5\n \n68.9 \n1.6 \n277.7\n \n260.6 \n17.1 \nHeating Degree Days\n46\n \n33 \n13 \n3,721\n \n3,127 \n594 \nNormal Heating Degree Days\n71\n \n79 \n(8)\n3,790\n \n3,860 \n(70)\n% Warmer than Normal\n(35)\n%\n(58)\n%\n(2)\n%\n(19)\n%\n% (Warmer) Colder than prior year\n39\n \n%\n(44)\n%\n19\n \n%\n(6)\n%\nNIPSCO Gas Customers\nResidential\n804,777\n \n797,711 \n7,066 \nCommercial\n66,579\n \n66,251 \n328 \nIndustrial\n2,683\n \n2,739 \n(56)\nTotal\n874,039\n \n866,701 \n7,338 \nComparability of operation and maintenance expenses and depreciation and amortization may be impacted by regulatory and depreciation trackers that allow for the recovery in rates of certain costs. \n53\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nNIPSCO Operations\nThe underlying reasons for changes in our operating revenues for the three and nine months ended September 30, 2025 compared to the same period in 2024 are presented below.\nFavorable (Unfavorable)\nChanges in Operating Revenues\n (in millions)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\nNew rates from base rate proceedings, regulatory capital and DSM programs\n$\n110.7 \n$\n217.6 \nThe effects of weather in 2025 compared to 2024\n11.9 \n42.5 \nThe effects of customer growth\n3.5 \n9.5 \nRenewable JV revenue, fully offset by JV operating expense and noncontrolling interest net income (loss)\n(4.2)\n(11.4)\nThe effects of customer usage\n(6.5)\n(2.1)\nOther\n(0.5)\n(1.6)\nChange in operating revenues (before cost of energy and other tracked items)\n$\n114.9 \n$\n254.5 \nOperating revenues offset in operating expense\nHigher cost of energy billed to customers\n3.5 \n118.0 \nHigher tracker deferrals within operation and maintenance, depreciation and tax\n16.0 \n34.3 \nTotal change in operating revenues\n$\n134.4\n \n$\n406.8\n \nWeather\nThe results of operations for the NIPSCO Operations segment include income from both electric and gas service lines. In general, we calculate the weather-related revenue variance based on changing customer demand driven by weather variance from normal cooling degree days and normal heating degree days, net of NIPSCO Gas' weather normalization mechanism. Our composite cooling and heating degree days reported do not directly correlate to the weather-related dollar impact on the results of NIPSCO Operations. Cooling and heating degree days experienced during different times of the year or in different operating locations may have more or less impact on volume and dollars depending on when they occur. When the detailed results are combined for reporting, there may be weather-related dollar impacts on operations when there is not an apparent or significant change in our aggregated composite cooling and heating degree day comparison.\nSales\nThe increase in total volumes sold to electric customers for the three months ended September 30, 2025 compared to the same period in 2024 was primarily attributable to increased residential and industrial usage, partially offset by decreased commercial usage. The increase in total volumes sold to electric customers for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily attributable to increased industrial and residential usage due to colder weather and increased customer count, partially offset by decreased commercial and wholesale and other usage\nThe increase in total volumes sold to gas customers for the three months ended September 30, 2025 compared to the same period in 2024 was primarily attributable to increased usage by industrial customers. The increase in total volumes sold to gas customers for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily attributable to increased usage by industrial and commercial customers, as well as increased residential usage due to colder weather.\nCommodity Price Impact\nCost of energy for the NIPSCO Operations segment's electric activities is principally comprised of the cost of coal, natural gas purchased for internal generation of electricity, transportation of coal and natural gas, and the cost of power purchased from generators of electricity for its generation and transmission activities. For its gas distribution activities, NIPSCO Operations' cost of energy is principally comprised of the cost of natural gas procured on behalf of and sold to customers while providing transportation and distribution services. NIPSCO Operations has state-approved recovery mechanisms that provide a means for full recovery of prudently incurred costs of energy. The majority of these costs of energy are passed through directly to the customer, and the costs of energy included in operating revenues are matched with the cost of energy expense recorded in the \n54\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nNIPSCO Operations\nperiod. Any difference in actual costs incurred and amounts billed to customers is recorded on the Condensed Consolidated Balance Sheets (unaudited) as under-recovered or over-recovered fuel and gas costs to be included in future customer billings. Therefore, increases in these tracked operating expenses are offset by increases in operating revenues and have essentially no impact on net income. \nThe underlying reasons for changes in our operating expenses for the three and nine months ended September 30, 2025 compared to the same period in 2024 are presented below.\nFavorable (Unfavorable)\nChanges in Operating Expenses\n (in millions)\nThree Months Ended September 30, 2025 vs 2024\nNine Months Ended September 30, 2025 vs 2024\nHigher depreciation and amortization expense driven by new base rates\n(28.6)\n$\n(60.8)\nHigher outside services expenses\n(4.0)\n(22.0)\nHigher employee and administrative expenses\n(10.5)\n(13.6)\nHigher property taxes\n(3.0)\n(7.5)\nHigher JV expenses\n(1.5)\n(4.9)\n(Higher) lower environmental remediation costs\n(0.3)\n3.0 \nOther\n(5.9)\n(1.5)\nChange in operating expenses (before cost of energy and other tracked items)\n$\n(53.8)\n$\n(107.3)\nOperating expenses offset in operating revenue\nHigher cost of energy billed to customers\n(3.5)\n(118.0)\nHigher tracker deferrals within operation and maintenance, depreciation and tax\n(15.8)\n(33.0)\nTotal change in operating expense\n$\n(73.1)\n$\n(258.3)\nElectric Supply and Generation Transition\nNIPSCO continues to execute on an electric generation transition consistent with the 2018 Plan and 2021 Plan and maintained in the 2024 Plan. The 2024 Plan outlines the path to retire the remaining two coal units at R.M. Schahfer by the end of 2025 and the remaining coal-fired generation at Michigan City by the end of 2028, to be replaced by lower-cost, reliable and cleaner options.  NIPSCO is continuing to evaluate the development of federal and state executive orders, or other regulatory actions, with respect to its generation transition plans.  Absent a directive to remain open, NIPSCO remain on track to retire R.M. Schahfer's remaining two coal units by the end of 2025. NIPSCO is taking steps to be prepared to respond to any executive order or regulatory action to the contrary.\nThe current replacement plan primarily includes renewable sources of energy, including wind, solar, battery storage, and flexible natural gas resources to be obtained through a combination of NIPSCO ownership and PPAs. NIPSCO has sold, and may in the future sell, renewable energy credits from its renewable generation to third parties to offset customer costs. Since 2020, five PPA projects (two wind and three solar) and eight owned projects (two wind, four solar and two solar plus storage) have been placed into service totaling 3,051 MW of nameplate capacity, including Dunns Bridge II, Fairbanks, Gibson and Appleseed, which were placed into service in January, May, and August 2025, respectively. NIPSCO has executed several PPAs to purchase 100% of the output from renewable generation facilities at a fixed price per MWh. Each facility supplying the energy has an associated nameplate capacity, and payments under the PPAs do not begin until the associated generation facility is placed into service. See \"Executive Summary - Energy Transition\" in this Management's Discussion for additional information. We expect the Templeton and Carpenter projects to be placed in service between 2025 and 2027.\n \n55\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nNIPSCO Operations\nRemaining Renewables Projects\nTransaction Type\nTechnology\nNameplate Capacity (MW)\nTempleton\nBTA\nWind\n200\nCarpenter\n20 year PPA\nWind\n195\n56\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nLiquidity and Capital Resources\nWe continually evaluate the availability of adequate financing to fund our ongoing business operations, working capital and core safety and infrastructure investment programs. Our financing is sourced through cash flow from operations and the issuance of debt and/or equity. External debt financing is provided primarily through the issuance of long-term debt, accounts receivable securitization programs and our  $1.85 billion commercial paper program, which is backstopped by our committed revolving credit facility with a total availability from third-party lenders of  $1.85 billion. We believe these sources provide adequate capital to fund our operating activities and capital expenditures in 2025 and beyond. \nAs discussed above under “Data Center Contract and Strategy,” the aggregate cost of the Contract Assets is currently estimated to be approximately $7 billion.\n \nWe expect to finance the construction and development of these assets through a combination of funds received under the Data Center Contract and debt, equity financing raised by NiSource and capital contributions from affiliates of Blackstone to NIPSCO Holdings II and Generation Holdings II in connection with such Blackstone affiliates’ minority interest investments in those entities. For additional information on these minority interest investments, refer to Part II, Item 5 (Other Information) and to our Annual Report on Form 10-K for the year ended December 31, 2024, including Note 19 to our Consolidated Financial Statements included therein. In addition, we may consider other funding sources, structures or partnerships as market conditions and strategic considerations evolve. \n \nIf we enter into additional data center contracts, we expect that we would need to develop additional generation assets and obtain additional financing in connection with such development.\nSources of financing activities for the current year are as follows:\nATM program\n•\nIn February 2025, we executed a forward sale agreement, which allowed us to issue a fixed number of shares at a price to be settled in the future. The forward purchaser under our forward sale agreement borrowed 2,000,000 shares from third parties, which the forward purchaser sold, through its affiliated agent, at a weighted average price of $40.10 per share. In September 2025 we settled the forward sale agreement in shares for $80.0 million, based on a net price of $40.02 per share.\n•\nIn March 2025, we executed a forward sale agreement, which allowed us to issue a fixed number of shares at a price to be settled in the future. The forward purchaser under our forward sale agreement borrowed 1,707,320 shares from third parties, which the forward purchaser sold, through its affiliated agent, at a weighted average price of $41.00 per share. In September 2025 we settled the forward sale agreement in shares for $69.9 million, based on a net price of $40.92 per share.\n•\nIn June 2025, we executed a forward sale agreement, which allowed us to issue a fixed number of shares at a price to be settled in the future. The forward purchaser under our forward sale agreement borrowed 2,518,393 shares from third parties, which the forward purchaser sold, through its affiliated agent, at a weighted average price of $39.71 per share. In September 2025 we settled the forward sale agreement in shares for $99.1 million, based on a net price of $39.36 per share.\n•\nAs of September 30, 2025, the ATM program had approximately $47.5 million of capacity available.  \nLong-Term Debt\n•\nOn March 27, 2025 we completed the issuance and sale of $750.0 million of 5.850% senior unsecured notes maturing in 2055, which resulted in approximately $739.6 million of net proceeds after discount and debt issuance costs.\n•\nOn June 27, 2025, we completed the issuance and sale of an additional $750.0 million of 5.850% senior unsecured notes maturing in 2055 (the \"2055 Notes\"). The terms of the 2055 Notes, other than the issue date and the price to the public, are identical to the terms of, and constitute a reopening of, our 5.850% senior unsecured notes maturing in 2055 issued on March 27, 2025. With the incremental issuance, we now have $1.5 billion of 5.850% senior unsecured notes maturing in 2055. On June 27, 2025, we also completed the issuance and sale of $900.0 million of 5.350% senior unsecured notes maturing in 2035 (the \"2035 Notes\"). These issuances of the additional 2055 Notes and the 2035 Notes resulted in approximately $1.616 billion of total net proceeds after discount and debt issuance costs. \n57\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\n•\nOn August 15, 2025, we repaid $1,250.0 million of 0.95% senior unsecured notes at maturity.\nSee Note 6, \"Equity,\" Note 7, \"Short-Term Borrowings,\" and Note 8, \"Long-Term Debt,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for more information on our financing activities.\nCash Flow Activities \nThe following table summarizes our cash flow activities:\nNine Months Ended September 30,\n(in millions)\n2025\n2024\nChange in 2025 vs 2024\nCash from (used for):\nOperating Activities\n$\n1,649.7\n \n$\n1,241.7 \n$\n408.0 \nInvesting Activities\n(3,396.6)\n(2,414.5)\n(982.1)\nFinancing Activities\n1,667.8\n \n(949.5)\n2,617.3 \nOperating Activities\nThe increase in cash from operating activities was primarily attributable to year over year changes in exchange gas receivables, higher net income before deferred income taxes and depreciation and a reduction in inventory resulting from an elevated rate of withdrawals due to warmer weather in 2025.  \nInvesting Activities\nYear over year increase in investing activities was primarily comprised of milestone payments to renewable generation asset developers for certain of our BTA projects and advanced deposits.\nWe expect to make capital investments totaling $4.0 billion to $4.3 billion during the 2025 period. In addition to ongoing capital expenditures, these capital investments include advanced deposits for project costs as well as milestone payments to the renewable generation asset developers and excludes $400 million to $500 million of capital investments relating to the Data Center Contract. We also expect to invest approximately $21.0 billion during the 2026-2030 period to support our base business (exclusive of investments relating to the Data Center Contract), including capital investments to support our generation transition strategy, and to invest approximately $6.4 billion during that period to develop the Contract Assets in connection with the Data Center Contract, as set forth in the table below. These forecasted capital investments are subject to continuing review and adjustment. Actual capital investments may vary from these estimates. \n(in billions)\n2026\nEstimated\n2027\nEstimated\n2028\nEstimated\n2029\nEstimated\n2030\nEstimated\nCapital Investments (Base Business)\n$3.9 - 4.1\n$3.7 - 3.9\n$3.7 - 3.9\n$4.9 - 5.1\n$4.3 - 4.5\nCapital Investments (Data Center Contract)\n$1.2 - 1.4\n$1.5 - 1.7\n$1.8-  2.0\n$1.0 - 1.2\n$0.4 - 0.6\nCapital Investments (Total)\n$5.1 - 5.5\n$5.2 - 5.6\n$5.5 - 5.9\n$5.9 - 6.3\n$4.7 - 5.1\n58\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRegulatory Capital Programs.\n \nWe continue to upgrade and modernize our electric system to enhance safety and reliability by addressing aged infrastructure and deploying advanced grid technologies. We are also upgrading and modernizing our gas infrastructure to enhance safety and reliability by reducing leaks. An ancillary benefit of these programs is the reduction of GHG emissions. In 2025, we continue to move forward on core infrastructure investment programs supported by complementary regulatory and customer initiatives across five states of our operating area.\nThe following table describes the most recent vintage of our regulatory programs to recover infrastructure replacement and other federally mandated compliance investments:\n(in millions)\nCompany\nProgram\nCapital Investment\nInvestment Period\nFiling Date\nCosts Covered\n(1)\nApproved\nColumbia of Ohio\nIRP - 2025\n$\n978.7 \n4/21-12/24\n2/27/2025\nReplacement of hazardous service lines, cast iron, wrought iron, uncoated steel, and bare steel pipe.\nColumbia of Ohio\nPHMSA IRP - 2025\n$\n78.2 \n1/23-12/24\n2/28/2025\nInvestments necessary to comply with the PHMSA Mega Rule.\nColumbia of Ohio\nCEP - 2025\n$\n1,027.8 \n4/21-12/24\n2/27/2025\nAssets not included in the IRP or PHMSA IRP.\nColumbia of Virginia\nSAVE - 2025\n$\n89.0 \n10/24-12/25\n8/15/2024\nReplacement projects that (1) enhance system safety or reliability, or (2) reduce, or potentially reduce, greenhouse gas emissions. Includes costs associated with Advanced Leak Detection and Repair.\nColumbia of Kentucky\nSMRP - 2025\n$\n128.5 \n1/23-12/25\n10/15/2024\nReplacement of mains and inclusion of system safety investments.\nNIPSCO - Electric\n(2)\n \nTDSIC - 7\n$\n315.6 \n7/22-3/25\n5/27/2025\nNew or replacement projects undertaken for the purpose of safety, reliability, system modernization or economic development.\nNIPSCO - Electric\n(3)\nGCT - 2\n$\n80.1 \n11/25-4/26\n6/18/2025\nNew gas peaker generation project costs forecasted through April 2026.\nNIPSCO - Gas\nTDSIC - 9\n$\n34.0 \n3/24-3/25\n5/23/2025\nNew or replacement projects undertaken for the purpose of safety, reliability, system modernization, or economic development.\nNIPSCO - Gas\nFMCA - 4\n$\n9.4 \n6/24-12/24\n2/25/2025\nProject costs to comply with federal mandates.\nPending Commission Approval\nNIPSCO - Gas\nFMCA - 5\n$\n21.9 \n6/24-6/25\n8/27/2025\nProject costs to comply with federal mandates.\nColumbia of Virginia\nSAVE - 2026\n$\n176.1 \n10/24-12/26\n8/12/2025\nReplacement projects that (1) enhance system safety or reliability, or (2) reduce, or potentially reduce, greenhouse gas emissions. Includes costs associated with Advanced Leak Detection and Repair.\nColumbia of Kentucky\nSMRP - 2026\n$\n181.4 \n1/23-12/26\n10/15/2025\nReplacement of mains and inclusion of system safety investments. \n(1)\nPrograms do not include any costs already included in base rates.\n(2)\nTDISC – 7 was originally filed on May 27, 2025 and refiled on July 2, 2025, due to the Electric Rate Case Order. The refiling adjusted the capital in the tracker to go down from $744.7 million to $315.6 million.\n(3)\nCapital investment is based on a projected amount. The capital investment has not all been incurred to date and represents a forecasted average for the billing period.\nNIPSCO Gas filed an FMCA CPCN on April 21, 2025. The petition is seeking recovery of spend incurred related to certain federally mandated Pipeline Safety IV Compliance Plan costs. The request includes $244.1 million of estimated capital, including indirect costs and AFUDC. An order was received on October 22, 2025 granting the CPCN requested.  \nFinancing Activities\nCommon Stock. \nRefer to Note 6, \"Equity,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for information on common stock.\nLong-Term Debt. \nRefer to Note 8, \"Long-Term Debt,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for information on long-term debt activity.\n59\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nShort-Term Debt. \nRefer to Note 7, \"Short-Term Borrowings,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for information on short-term debt activity.\nNoncontrolling Interest\n. \nRefer to Note 4, \"Noncontrolling Interests,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for information on contributions and distributions from noncontrolling interests.\nSources of Liquidity\nThe following table displays our liquidity position as of September 30, 2025 and December 31, 2024:\n(in millions)\nSeptember 30, 2025\nDecember 31, 2024\nCurrent Liquidity\nRevolving Credit Facility\n$\n1,850.0\n \n$\n1,850.0 \nAccounts Receivable Programs\n(1)\n245.0\n \n175.0 \nLess:\nCommercial Paper\n1,060.0\n \n604.6 \nAccounts Receivable Programs Utilized\n200.0\n \n— \nLetters of Credit Outstanding Under Credit Facility\n25.0\n \n9.4 \nAdd:\nCash and Cash Equivalents\n95.0\n \n156.6 \nNet Available Liquidity\n$\n905.0\n \n$\n1,567.6 \n(1)\nRepresents the lesser of the seasonal limit or maximum borrowings supportable by the underlying receivables.\nDebt Covenants\n. \nWe are subject to a financial covenant under our revolving credit facility, which requires us to maintain a debt to capitalization ratio that does not exceed 70.0%. As of September 30, 2025, the ratio was 54.7%. \nCredit Ratings. \nThe credit rating agencies periodically review our ratings, taking into account factors such as our capital structure and earnings profile. The following table includes our and NIPSCO's credit ratings and ratings outlook as of September 30, 2025. There were no changes to the below credit ratings or outlooks since February 2020.\nA credit rating is not a recommendation to buy, sell, or hold securities, and may be subject to revision or withdrawal at any time by the assigning rating organization. \nS&P\nMoody's\nFitch\nRating\nOutlook\nRating\nOutlook\nRating\nOutlook\nNiSource\nBBB+\nStable\nBaa2\nStable\nBBB\nStable\nNIPSCO\nBBB+\nStable\nBaa1\nStable\nBBB\nStable\nCommercial Paper\nA-2\nStable\nP-2\nStable\nF2\nStable\nCertain of our subsidiaries have agreements that contain ''ratings triggers'' that require increased collateral if our credit rating or the credit ratings of certain of our subsidiaries are below investment grade. These agreements are primarily for insurance purposes and for the physical purchase or sale of power. As of September 30, 2025, the collateral requirement that would be required in the event of a downgrade below the ratings trigger levels would amount to approximately $141.8 million. In addition to agreements with ratings triggers, there are other agreements that contain ''adequate assurance'' or ''material adverse change'' provisions that could necessitate additional credit support such as letters of credit and cash collateral to transact business.\nEquity. \nOur authorized capital stock consists of 770,000,000 shares, $0.01 par value, 750,000,000 are common stock and 20,000,000 are preferred stock. As of September 30, 2025, 477,136,079 shares of common stock were outstanding and no shares of preferred stock were outstanding. \n60\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nContractual Obligations. \nA summary of contractual obligations is included in the Company's Annual Report on Form 10-K for the year ended December 31, 2024. We will be required to make substantial cash payments under supply and other agreements, including the EPC Contracts, although we may terminate the EPC Contracts for convenience and make associated termination payments if the Data Center Contract is terminated or the underlying assets are not approved by the IURC. The expected payments under the EPC Contracts and other contracts relating to our\n \ndata center developments and potential future data center developments are included in the estimated amounts set forth in row “Capital Investments (Data Center Contract)” in the table included under “Investing Activities” above. Except for these items and our March and June 2025 debt issuances, there were no additional material changes from year-end during the nine months ended September 30, 2025. Refer to Note 8, \"Long-Term Debt,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for additional information regarding the debt issuances. Refer to “Executive Summary - NIPSCO Data Center Contract and Strategy” and Footnote 14, Commitments and Contingencies for additional information regarding the EPC Contracts and equipment supply contracts.\nGuarantees, Indemnities and Other Off Balance Sheet Arrangements. \nWe and certain of our subsidiaries enter into various agreements providing financial or performance assurance to third parties on behalf of certain subsidiaries as a part of normal business. Such agreements include guarantees and stand-by letters of credit. Refer to Note 14, \"Other Commitments and Contingencies,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for additional information about such arrangements.\n61\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRegulatory, Environmental and Safety Matters\nCost Recovery and Trackers\nComparability of our line item operating results is impacted by regulatory trackers that allow for the recovery in rates of certain costs such as those described below. Increases in the costs that are subject to approved regulatory tracker mechanisms generally lead to increased regulatory assets, which ultimately result in a corresponding increases in operating revenues and expenses and, therefore, have essentially no impact on total operating income results. Certain approved regulatory tracker mechanisms allow for abbreviated regulatory proceedings in order for the operating companies to quickly implement revised rates and recover associated costs.\nA portion of the Columbia Operations' and NIPSCO Operations' revenue is related to the recovery of gas costs, the review and recovery of which occurs through standard regulatory proceedings. All states in our operating area require periodic review of actual gas procurement activity to determine prudence and to confirm the recovery of prudently incurred energy commodity costs supplied to customers. \nWe recognize that energy efficiency reduces emissions, conserves natural resources and saves our customers money. Our gas distribution companies offer programs such as energy efficiency upgrades, home checkups and weatherization services. The increased efficiency of natural gas appliances and improvements in home building codes and standards contributes to a long-term trend of declining average use per customer. While we are looking to expand offerings so the energy efficiency programs can benefit as many customers as possible, our gas distribution operations utilities have pursued changes in rate design to more effectively match recoveries with costs incurred. Columbia of Ohio has adopted a straight fixed variable rate design for residential and small commercial customers that closely links the recovery of fixed costs with fixed charges. Columbia of Maryland and Columbia of Virginia have regulatory approval for weather and revenue normalization adjustments for certain customer classes, which adjust monthly revenues that exceed or fall short of approved levels. Columbia of Pennsylvania continues to operate its pilot residential weather normalization adjustment and also has a fixed customer charge. This weather normalization adjustment only adjusts revenues when actual weather compared to normal varies by more than 3%. Columbia of Kentucky\n charges certain customer classes a mix of fixed and weather normalized volumetric rates during the peak heating season. NIPSCO Gas and Electric include a fixed customer charge for residential and small commercial and industrial customer classes. NIPSCO Gas has implemented a weather normalization adjustment for certain of its customer classes.\nA portion of the NIPSCO Operations' revenue is related to the recovery of fuel costs to generate power and the fuel costs related to purchased power. These costs are recovered through a FAC, which is updated quarterly to reflect actual costs incurred to supply electricity to customers. \nWhile increased efficiency of electric appliances and improvements in home building codes and standards have similarly impacted the average use per electric customer in recent years, NIPSCO expects future growth in per customer usage as a result of increasing electric applications, such as electric vehicles. These ongoing changes in use of electricity will likely lead to development of innovative rate designs, and NIPSCO will continue efforts to design rates that increase the certainty of recovery of fixed costs.\n62\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRegulatory, Environmental and Safety Matters\nRate Case Actions\nThe following table describes current rate case actions as applicable in each of our jurisdictions net of tracker impacts:\n(in millions)\nCompany\nApproved ROE\nRequested Incremental Revenue\nApproved Incremental Revenue\nFiling Date\nRates \nEffective\nApproved Rate Cases\nColumbia of Pennsylvania\n(1)\nNone specified\n$\n124.1 \n$\n74.0 \nMarch 15, 2024\nDecember 2024\nColumbia of Maryland\n9.80 \n%\n$\n10.7 \n$\n7.8 \nSeptember 24, 2024\nApril 2025\nColumbia of Kentucky\n9.75 \n%\n$\n23.8 \n$\n14.3 \nMay 16, 2024\nJanuary 2025\nColumbia of Virginia\n(2)\n9.75 \n%\n$\n37.2 \n$\n28.2 \nApril 29, 2024\nOctober 2024\nColumbia of Ohio\n9.60 \n%\n$\n221.4 \n$\n68.3 \nJune 30, 2021\nMarch 2023\nNIPSCO - Gas\n(3)\n9.75 \n%\n$\n161.9 \n$\n120.9 \nOctober 25, 2023\nAugust 2024\nNIPSCO - Electric\n(4)\n9.75 \n%\n$\n368.7 \n$\n257.0 \nSeptember 12, 2024\nJuly 2025\nPending Rate Cases\nColumbia of Pennsylvania\n(5)\nIn process\n$\n110.5 \nIn process\nMarch 20, 2025\nDecember 2025\n(1)\nNo approved ROE is identified for this matter since the approved revenue increase is the result of a black box settlement under which parties agree upon the amount of increase.\n(2)\nThe approved rate case resulted in a black box settlement, representing a settlement to a specific revenue increase but not a specified ROE. The settlement provides use of a 9.75% ROE for future SAVE filings.\n(3)\nNew rates were implemented in 2 steps, with implementation of Step 1 rates effective in August 2024 and Step 2 rates effective in February 2025.\n(4)\nNew rates were implemented in multiple steps, with implementation of Step 1 rates effective in July 2025 and Step 2 rates effective no later than March 2026. \n(5)\nIn October 2025, a Recommended Decision (RD) was issued by the Administrative Law Judges (ALJs) for the PUC to deny the request of Columbia Gas to increase base rates. Alternatively, the ALJs recommended that Columbia Gas be granted a $66.4 million revenue increase, effective for service rendered on and after January 1, 2026. Columbia Gas filed Exceptions to the ALJs’ RD, proposing an increase of at least $74.2 million, effective on and after December 19, 2025. A Final Order from the PUC is expected in the fourth quarter of 2025.\nPHMSA Legislation and Regulations\nTo fulfill our vision of being a trusted energy provider, we follow safety practices required by regulations and we implement our Safety Management System (\"SMS\"). SMS serves as the framework to identify and reduce risks and ensure consistent safety processes, procedures and operations across the organization.\nAs directed by law in the Protecting Our Infrastructure of Pipelines and Enhancing Safety (PIPES) Act of 2020, PHMSA has revised, and continues to revise, the pipeline safety regulations focused on public safety and environmental hazard mitigation. The PIPES Act of 2020 specifically includes leak detection and repair criteria (the \"LDAR\" rule) and regulations that require operators to upgrade their existing low-pressure regulating stations with enhanced safeguards and update distribution integrity management plans, emergency response plans, and operation and maintenance plans (the Safety of Gas Distribution Pipelines, or \"SGDP\" rule).\nIn May 2023, PHMSA proposed regulatory revisions under the PIPES Act of 2020 to minimize methane emissions and improve public safety. Under these proposed revisions, our subsidiaries would be required to detect and repair an increased number of gas leaks, reduce the time to repair leaks, increase leak survey, and expand our existing advanced leak detection program. In January 2025, PHMSA withdrew the final LDAR rule and it has not gone into effect. \nIn September 2023, PHMSA proposed additional regulatory revisions under the PIPES Act of 2020 to enhance distribution system safety through equipment and procedural expectations in the form of the SGDP rule. Operators will be required to incorporate additional protections for low pressure distribution systems that prevent over-pressurization, amend construction procedures designed to minimize the risk of incidents caused by system over-pressurization, and update distribution integrity management programs to cover and prepare for over-pressurization incidents. PHMSA did not progress the SGDP rulemaking in 2024.\nWe continue to evaluate and monitor PHMSA-related legislation and regulations but cannot predict the impact of changing pipeline safety regulations on our business at this time.\n63\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRegulatory, Environmental and Safety Matters\nEnvironmental and Climate Change Issues\nOn March 12, 2025, the EPA announced it will undertake 31 deregulatory actions to advance the administration’s policy priorities as directed by various executive orders. These actions will address multiple existing water, waste, air and climate regulations including, but not limited to, GHG rules and the Legacy CCR Rule.  On July 22, 2025, the EPA proposed a rule that, if finalized, would extend the deadline to submit Part 1 Facility Evaluation Reports from February 2026 to February 2027. On July 29, 2025, the EPA proposed rescinding the 2009 Endangerment Finding, the scientific and legal foundation for federal GHG regulations under the Clean Air Act. NiSource will continue to monitor these matters and assess the impacts to our business as regulations are proposed and finalized, or as otherwise required by law.\nPhysical Climate Risks. \nIncreased frequency of severe and extreme weather events associated with climate change could materially impact our facilities, energy sales, and results of operations. We are unable to predict these events. However, we perform assessments of physical risk, including physical climate risk, to our business. More extreme and volatile temperatures, increased storm intensity and flooding, and more volatile precipitation leading to changes in lake and river levels are among the weather events that are most likely to impact our business. Efforts to mitigate these physical risks continue to be implemented.\nTransition Climate Risks and Opportunities\n. We actively engage with and monitor the impact that proposed legislative and regulatory programs related to GHG emissions, at both the federal and state levels, would have on our business.  \nOn June 11, 2025, the EPA proposed to repeal GHG emissions standards for fossil fuel-fired power plants that were finalized by the previous federal administration in May 2024. The proposed repeal would eliminate key requirements from the 2024 Carbon Pollution Standards, including capacity factor thresholds and carbon capture and storage (CCS) mandates. If finalized, this action would remove regulatory constraints that could significantly impact NIPSCO’s planned gas generation, allowing customers to avoid approximately $675 million in additional cost as contemplated through the 2024 NIPSCO IRP. \nWe also continue to monitor evolving state policies related to GHG emissions from our gas distribution companies. The Climate Solutions Now Act of 2022 requires Maryland to reduce GHG emissions by 60% by 2031 (from 2006 levels), and it requires the state to reach net zero emissions by 2045. The Maryland Department of the Environment (\"MDE\") adopted a plan to achieve its 2031 goal and is required to adopt a plan for their 2045 net zero goal by 2030. The Act also enacts a state policy to move to broader electrification of both existing buildings and new construction. In December 2024, the MDE issued final Building Energy Performance Standards, which would require net zero direct GHG emissions from large buildings by 2040 with interim targets, or payments of an alternative compliance fee. Under an executive order, Maryland is also developing a Clean Heat Standard and a Zero-Emission Heating Equipment Standard that are intended to transition gas appliances to electric heat pumps. In June 2025, the Public Service Commission (\"PSC\") issued an order directing its Staff to prepare proposed regulations by December 2025, eliminating Company contributions to main or service extensions to new residential and commercial customers. In August 2025, the PSC instituted formal proceedings to investigate issues pertaining to long-term natural gas company planning practices. One purpose of the proceedings is to ensure that planning is consistent with Maryland's climate goals. Columbia of Maryland cannot predict the final impact of these policies on our business at this time.\nNet Zero Goal. \nIn November 2022, we announced a goal of net zero GHG emissions by 2040 covering both Scope 1 and Scope 2 GHG emissions (\"Net Zero Goal\"). Our Net Zero Goal builds on GHG emission reductions achieved to-date. We plan to achieve our Net Zero Goal primarily through continuation and enhancement of existing programs, such as retiring and replacing coal-fired electric generation with low- or zero-emission electric generation, ongoing pipe replacement and modernization programs, and deployment of advanced leak-detection technologies. In addition, we plan to advance other low- and zero-emission energy resources and technologies, which may include hydrogen, renewable natural gas, long-duration storage, and/or deployment of carbon capture and utilization technologies, if and when these become technologically and economically feasible. Carbon offsets and renewable energy credits may also be used to support achievement of our Net Zero Goal. As of the end of 2024, we had reduced Scope 1 GHG emissions by approximately 72% from 2005 levels. \nOur GHG emissions projections, including achieving a Net Zero Goal, are subject to various assumptions that involve risks and uncertainties, and did not include any assumptions related to data center development and associated load growth. We remain committed to our Net Zero Goal, however, certain of our interim goals may evolve as we assess and respond to business opportunities such as data centers. Achievement of our Net Zero Goal by 2040 will require supportive regulatory and legislative policies, favorable stakeholder environments and advancement of technologies that are not currently economically or \n64\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nRegulatory, Environmental and Safety Matters\ntechnologically feasible to deploy at scale, as well as execution of our business plan. Otherwise, our actual results or ability to achieve our Net Zero Goal, including by 2040, may differ materially. \nMarket Risk Disclosures\nRisk is an inherent part of our businesses. The extent to which we properly and effectively identify, assess, monitor and manage each of the various types of risk involved in our businesses is critical to our profitability. We seek to identify, assess, monitor and manage, in accordance with defined policies and procedures, the following principal market risks that are involved in our businesses: commodity price risk, interest rate risk and credit risk. We manage risk through a multi-faceted process with oversight by the Risk Management Committee that requires constant communication, judgment and knowledge of specialized products and markets. Our senior management takes an active role in the risk management process and has developed policies and procedures that require specific administrative and business functions to assist in the identification, assessment and control of various risks. These may include, but are not limited to market, operational, financial, compliance and strategic risk types. In recognition of the increasingly varied and complex nature of the energy business, our risk management process, policies and procedures continue to evolve and are subject to ongoing review and modification.\nCommodity Price Risk\nOur gas and electric subsidiaries have commodity price risk primarily related to the purchases of natural gas and power. To manage this market risk, our subsidiaries use derivatives, including commodity futures contracts, swaps, forwards and options. We do not participate in speculative energy trading activity.\nCommodity price risk resulting from derivative activities at our rate-regulated subsidiaries is limited and does not bear significant exposure to earnings risk, since our current regulatory mechanisms allow recovery of prudently incurred purchased power, fuel and gas costs through the rate-making process, including gains or losses on these derivative instruments. These changes are included in the GCA and FAC regulatory rate-recovery mechanisms. If these mechanisms were to be adjusted or eliminated, these subsidiaries may begin providing services without the benefit of the traditional rate-making process and may be more exposed to commodity price risk. For additional information, see \"Results and Discussion of Segment Operations\" in this Management's Discussion.\nOur subsidiaries are required to make cash margin deposits with their brokers to cover actual and potential losses in the value of outstanding exchange traded derivative contracts. The amount of these deposits, some of which are reflected in our restricted cash balance, may fluctuate significantly during periods of high volatility in the energy commodity markets.\nRefer to Note 10, \"Risk Management Activities,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for further information on our commodity price risk assets and liabilities.\nInterest Rate Risk\nWe are exposed to interest rate risk as a result of changes in interest rates on borrowings under our revolving credit agreement, commercial paper program, and accounts receivable programs, which have interest rates that are indexed to short-term market interest rates. Based upon average borrowings and debt obligations subject to fluctuations in short-term market interest rates, an increase (or decrease) in short-term interest rates of 100 basis points (1%) would have increased (or decreased) interest expense by $1.8 million and $6.1 million for the three and nine months ended September 30, 2025 and $1.7 million and $6.9 million for the three and nine months ended September 30, 2024, respectively. We are also exposed to interest rate risk as a result of changes in benchmark rates that can influence the interest rates of future long-term debt issuances. From time to time we may enter into forward interest rate instruments to lock in long term interest costs and/ or rates. \nCredit Risk\nDue to the nature of the industry, credit risk is embedded in many of our business activities. Our extension of credit is governed by a Corporate Credit Risk Management Policy which establishes guidelines for documenting management approval levels for credit limits, evaluating creditworthiness, and credit risk mitigation efforts. Exposures to credit risks are monitored by the risk management function, which is independent of commercial operations. Credit risk arises due to the possibility that a customer, supplier or counterparty will not be able or willing to fulfill its obligations on a transaction on or before the settlement date. For derivative-related contracts, credit risk arises when counterparties are obligated to deliver or purchase defined commodity units of gas or power to us at a future date per execution of contractual terms and conditions. Exposure to credit risk is measured in \n65\nTable of Contents\nITEM 2.\n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (continued)\nNiSource Inc.\nterms of both current obligations and the market value of forward positions net of any posted collateral such as cash and letters of credit.\nThe financial status of our banking partners is periodically assessed through traditional credit ratings provided by major credit rating agencies.\nOther Information\nCritical Accounting Estimates\nA summary of our critical accounting estimates is included in the Company's Annual Report on Form 10-K for the year ended December 31, 2024. There were no material changes made as of September 30, 2025.\nRecently Issued Accounting Pronouncements\nRefer to Note 2, \"Recent Accounting Pronouncements,\" in the Notes to the Condensed Consolidated Financial Statements (unaudited) for additional information about recently issued and adopted accounting pronouncements.\n66\nTable of Contents\nNiSource Inc."
}