{
  "source_file": "noc-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nHISTORY AND ORGANIZATION\nHistory\nNorthrop Grumman Corporation (herein referred to as “Northrop Grumman,” the “company,” “we,” “us,” or “our”) is a leading global aerospace and defense technology company. We deliver a broad range of products, services and solutions to U.S. and international customers, and principally to the U.S. Department of Defense (DoD) and intelligence community. Our broad portfolio is aligned to support national security priorities and our solutions equip our customers with capabilities they need to connect, protect and advance humanity.\nThe company is a leading provider of space systems, military aircraft, missile defense, advanced weapons and long-range fires capabilities, mission systems, networking and communications, strategic deterrence systems, and breakthrough technologies, such as advanced computing, microelectronics and cyber. We are focused on competing and winning programs that enable continued growth, performing on our commitments and affordably delivering capability our customers need. With the investments we've made in advanced technologies, combined with our talented workforce and digital transformation capabilities, Northrop Grumman is well positioned to meet our customers' needs today and in the future. For a discussion of risks associated with our operations, see \n“\nRisk Factors.\n”\nThe company originally was formed in 1939 in Hawthorne, California as Northrop Aircraft Incorporated and was reincorporated in Delaware in 1985, as Northrop Corporation. Northrop Corporation was a principal developer of flying wing technology, including the B-2 Spirit stealth aircraft. We developed into one of the largest defense technology companies in the world through a series of acquisitions, as well as organic growth, including the following: \n•\n1994 - Acquired Grumman Corporation, a premier military aircraft systems integrator. The combined company was renamed Northrop Grumman Corporation;\n•\n1996 - Acquired the defense and electronics businesses of Westinghouse Electric Corporation, developer of sophisticated radar and other electronics systems;\n•\n2001 - Acquired Litton Industries, Inc., a global electronics and information technology company and full service shipbuilder; \n•\n2001 - Acquired Newport News Shipbuilding Inc., designer and builder of nuclear-powered aircraft carriers and submarines;\n•\n2002 - Acquired TRW Inc., developer of military and civil space systems and payloads, and integrator of complex, mission-enabling systems and services; \n•\n2011 - Completed the spin-off of Huntington Ingalls Industries, Inc., operator of our former shipbuilding business, comprised largely of a part of Litton Industries and Newport News Shipbuilding; \n•\n2018 - Acquired Orbital ATK, Inc. (OATK), developer and producer of satellites and other space systems, launch vehicles and missile products; and\n•\n2021 - Completed the sale of our IT and mission support services business (the “IT services divestiture”) to Veritas Capital.\nOrganization\nFrom time to time, we acquire or dispose of businesses and realign contracts, programs or businesses among and within our operating segments. Internal realignments are typically designed to leverage existing capabilities more fully and to enhance efficient development and delivery of products and services. At December 31, 2024, the company was aligned in four operating sectors, which also comprise our reportable segments: Aeronautics Systems, Defense Systems, Mission Systems and Space Systems.\nEffective July 1, 2024, the company realigned the Strategic Deterrent Systems (SDS) division, which includes the Ground-Based Strategic Deterrent (“Sentinel”) program, from Space Systems to Defense Systems. This realignment is reflected in the financial information contained in this report.\n-1-\nNORTHROP GRUMMAN CORPORATION\nSubsequent Realignment\n - Effective January 1, 2025, the company realigned the Strike and Surveillance Aircraft Solutions (SSAS) business unit from Defense Systems to Aeronautics Systems. This realignment is not reflected in the financial information contained in this report; it will be reflected in the company’s operating results beginning in the first quarter of 2025.\nAERONAUTICS SYSTEMS\nAeronautics Systems is a leader in the design, development, production, integration, sustainment and modernization of military aircraft systems for the U.S. Air Force, the U.S. Navy, other U.S. government agencies, and international customers. Major products include strategic long-range strike aircraft; tactical fighter and air dominance aircraft; airborne battle management and command and control systems; and unmanned autonomous aircraft systems, including high-altitude long-endurance (HALE) strategic intelligence, surveillance and reconnaissance (ISR) systems. Approximately 45 percent of this business is performed through restricted programs. Key programs include:\n•\nDevelopment and production of the U.S. Air Force B-21 Raider long-range strike aircraft that defines sixth-generation technologies;\n•\nModernization and sustainment services for the B-2 Spirit stealth aircraft;\n•\nFuselage production for the F-35 Lighting II Joint Strike Fighter and F/A-18 Super Hornet for use by U.S. and international forces;\n•\nE-2D Advanced Hawkeye battle management aircraft production for the U.S. Navy, Japan, and France; \n•\nMQ-4C Triton, which provides wide area strategic ISR over vast ocean and coastal regions for maritime domain awareness to the U.S. Navy and Australia;\n•\nRQ-4 Global Hawk, which provides high resolution imagery of land masses for theater awareness and strategic ISR to the U.S. Air Force, Japan, and the Republic of Korea; and \n•\nNorth Atlantic Treaty Organization (NATO) Alliance Ground Surveillance (AGS), a Global Hawk variant, for strategic ISR missions conducted in multinational theater operations.\nDEFENSE SYSTEMS\nDefense Systems is a leader in the design, engineering, development, integration and production of strategic deterrent systems, advanced tactical weapons, and missile defense solutions, and a provider of sustainment, modernization and training services for manned and unmanned aircraft and electronics systems for the U.S. military and a broad range of international customers. Major products and services include strategic missiles; integrated, all-domain command and control (C2) systems; precision strike weapons; advanced propulsion, including tactical solid rocket motors and high speed air-breathing and hypersonic systems; high-performance gun systems, ammunition, precision munitions and advanced fuzes; and aircraft and mission systems logistics support, sustainment, operations and modernization. Less than 5 percent of this business is performed through restricted programs. Key programs include:\n•\nSentinel Engineering & Manufacturing Development (EMD) program, initial phase of the modernization of the intercontinental ballistic missile (ICBM) system that will serve as the ground-based strategic deterrent for the U.S. nuclear triad;\n•\nIntegrated Battle Command System (IBCS) for the U.S. Army and Poland, which is an open architecture system that seamlessly integrates sensors and effectors to deliver among the most advanced C2 systems for joint and coalition forces;\n•\nMedium (30mm and 20mm) and Large (120mm) caliber tactical and training ammunition production;\n•\nGuided Multiple Launch Rocket System (GMLRS) propulsion and warhead subsystems for a surface-to-surface system used to defeat targets using indirect precision fires; \n•\nU.S. Navy’s Advanced Anti-Radiation Guided Missile (AARGM), a medium-range, air-to-surface missile, and its extended range variant, AARGM-ER; \n•\nU.S. Air Force’s Stand-In Attack Weapon (SiAW), an advanced capability air-to-surface tactical missile for the F-35;\n•\nHypersonic Attack Cruise Missile (HACM) air-breathing, scramjet propulsion subsystem for the hypersonic air-launched cruise missile to travel at speeds of Mach 5 or greater; \n-2-\nNORTHROP GRUMMAN CORPORATION\n•\nGlobal system sustainment and operations support for the F-35, B-2, P-3 Orion, E-6B Mercury, KC-30A multi-role tanker, C-27J transport, NATO AGS, Triton and restricted programs;\n•\nPrecision Guidance Kit (PGK), replaces conventional fuzes for artillery and mortar munitions and transforms them into Global Positioning System enabled precision guided weapons;\n•\nForward Area Air Defense Command and Control (FAAD C2), the Army’s long-standing program of record for short range air defense and Counter Rocket, Artillery and Mortar (C-RAM), as well as the interim C2 for Counter Unmanned Aircraft Systems (C-UAS);\n•\nAAQ-24 sensor sustainment and repair for U.S. military customers; and\n•\nSpecial Electronics Mission Aircraft (SEMA) ISR support.\nMISSION SYSTEMS\nMission Systems is a leader in advanced mission solutions and multifunction systems, primarily for the U.S. defense and intelligence community, and international customers. Major products and services include command, control, communications and computers, intelligence, surveillance and reconnaissance (C4ISR) systems; radar, electro-optical/infrared (EO/IR) and acoustic sensors; electronic warfare systems; advanced communications and network systems; advanced microelectronics; navigation and positioning sensors; maritime power, propulsion and payload launch systems; full spectrum cyber solutions; and intelligence processing systems. Approximately 30 percent of this business is performed through restricted programs. Key unrestricted programs include:\n•\nScalable Agile Beam Radar (SABR), an active electronically scanned array fire control radar system for F-16 aircraft; \n•\nF-35 fire control radar and Distributed Aperture System (DAS), which provides 360 degree field of view tracking, identifying, missile warning and night vision capabilities; \n•\nF-35 Communications, Navigation and Identification (CNI) integrated avionics system, which provides secure communications and interoperability capabilities;\n•\nGround/Air Task Oriented Radar (G/ATOR), a mobile multi-mode active electronically scanned array; \n•\nSurface Electronic Warfare Improvement Program (SEWIP) Block III, which protects surface ships from anti-ship missiles, provides early detection, signal analysis and threat warning;\n•\nAirborne Early Warning & Control (AEW&C). The centerpiece of the E-7 AEW&C aircraft is the Multi-role Electronically Scanned Array (MESA) radar which enables 360 degree long range advanced air moving target indicator (AMTI) capabilities for Battle Management, Command and Control, and Maritime Surveillance;\n•\nLarge Aircraft and Common Infrared Countermeasures (LAIRCM, DoN LAIRCM, CIRCM) systems, which protect large aircraft as well as rotary wing and medium fixed wing aircraft from infrared missiles using advanced laser technology; \n•\nBattlefield Airborne Communications Node (BACN), one of the first airborne gateway systems that allows platforms to communicate and securely share data; \n•\nDDG Modernization, which is comprised of several subsystems to support modernization of Arleigh Burke-class guided missile destroyers including Integrated Bridge and Navigation Systems (IBNS) and ship control systems;\n•\nLITENING Advanced Targeting Pod, an electro-optical infrared sensor system for targeting and surveillance that enables aircrews to detect, acquire, identify and track targets at long ranges; \n•\nAPR-39 DV(2) and EV(2) Radar Warning Receiver programs, which provide a digital radar warning receiver for the U.S. Army, Navy and Marines; \n•\nExploitation and cyber programs, which provide cyber and intelligence domain support through unique intelligence and cyber capabilities; \n•\nAC/MC 130J Radio Frequency Countermeasures system, which provides superior situational awareness and better enables aircraft survivability in operationally relevant environments; and \n•\nEmbedded Global Positioning System (GPS) / Inertial Navigation Systems-Modernization (EGI-M) program, which provides state-of-the-art airborne navigation capabilities with an open architecture that enables rapid responses to future threats.\n-3-\nNORTHROP GRUMMAN CORPORATION\nSPACE SYSTEMS\nSpace Systems is a leader in delivering end-to-end mission solutions through the design, development, integration, production and operation of space, missile defense, and launch systems for national security, civil government, commercial and international customers. Major products include satellites and spacecraft systems, subsystems, sensors and payloads; ground systems; missile defense systems and interceptors; and launch vehicles and related propulsion systems. Approximately 40 percent of this business is performed through restricted programs. Key unrestricted programs include: \n•\nEvolved Strategic SATCOM (ESS) satellites and payloads providing assured, no-fail, and survivable Nuclear Command and Control (NC3) communications capabilities;\n•\nNext-Generation Overhead Persistent Infrared (Next-Gen OPIR) program satellites and payloads providing resilient and enhanced missile warning over the critical northern polar region;\n•\nSpace Development Agency Tracking and Transport layers providing missile warning/tracking and resilient, low-latency, high-volume data transport communication systems;\n•\nMissile defense systems, interceptors, targets, mission processing and boosters for the Missile Defense Agency's (MDA) Ground-based Midcourse Defense Weapon Systems (GWS);\n•\nCygnus spacecraft, used in the execution of our Commercial Resupply Services (CRS) contracts with NASA to resupply and re-boost the International Space Station;\n•\nDevelopment and production of solid rocket motors for NASA’s Space Launch System (SLS) heavy lift vehicle;\n•\nHabitation and Logistics Outpost (HALO) module in support of NASA’s Lunar Gateway;\n•\n63-inch diameter Graphite Epoxy Motor (GEM 63) and the extended length variation (GEM 63XL) solid rocket boosters used to provide lift capability for the ATLAS V and Vulcan launch vehicles;\n•\nMedium-class solid rocket motors for the U.S. Navy's Trident II Fleet Ballistic Missile program;\n•\nGlide Phase Interceptor (GPI) Cooperative Development producing interceptor capability to defeat hypersonic threats;\n•\nProtected Tactical SATCOM (PTS) satellites and payloads providing resilient, protected tactical communications to U.S. forces; and\n•\nArctic Satellite Broadband Mission (ASBM) satellites and payloads expanding both commercial as well as military broadband communications for an international partner.\nCUSTOMER CONCENTRATION\nOur largest customer is the U.S. government. Sales to the U.S. government accounted for 87 percent, 86 percent and 86 percent of sales during the years ended December 31, 2024, 2023 and 2022, respectively. For further information on sales by customer type, contract type and geographic region, see Note 15 to the consolidated financial statements. See “Risk Factors” for further discussion regarding risks related to customer concentration.\nCOMPETITIVE CONDITIONS\nWe compete with many companies in the defense, intelligence and federal civil markets. The Boeing Company, General Dynamics, L3Harris Technologies, Lockheed Martin, and RTX are some of our primary competitors. Key characteristics of our industry include long operating cycles and intense competition, which is evident through the number of competitors bidding on program opportunities and the number of competitor protests of U.S. government procurement awards.\nIt is common in the defense industry for work on major programs to be shared among a number of companies. A company competing to be a prime contractor may, upon ultimate award of the contract to another competitor, serve as a subcontractor to the ultimate prime contracting company. It is not unusual to compete for a contract award with a peer company and, simultaneously, perform as a supplier to or a customer of that same competitor on other contracts, or vice versa.\nSEASONALITY\nNo material portion of our business is seasonal.\n-4-\nNORTHROP GRUMMAN CORPORATION\nBACKLOG\nAt December 31, 2024, total backlog, which is equivalent to the company’s remaining performance obligations, was $91.5 billion as compared with $84.2 billion at December 31, 2023. For further information, see “Backlog” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” (MD&A) and Note 1 to the consolidated financial statements.\nINTELLECTUAL PROPERTY\nWe protect our technological innovations using a combination of trade secrets, patents, trademarks, and copyrights. We routinely apply for patents related to the technologies we develop in the U.S. and in certain foreign jurisdictions. We license some intellectual property rights to third parties and we also license or otherwise obtain access to intellectual property from third parties. The U.S. government typically holds licenses to patents developed in the performance of U.S. government contracts and may use or authorize others to use the inventions covered by these patents for certain purposes. See “Risk Factors” for further discussion regarding risks related to intellectual property.\nRAW MATERIALS\nWe have experienced challenges with access to certain raw materials due to macroeconomic factors and several global events such as inflation, geopolitical conflicts and microelectronics shortages. In some cases, these challenges have significantly increased the cost and/or lead time required to obtain certain raw materials. Nonetheless, these challenges have not, to date, materially impacted our ability to perform on our contracts. See “Risk Factors” for further discussion regarding risks related to raw materials.\nHUMAN CAPITAL\nUnderpinned by our values and culture, we hire, promote, and pay based on merit and performance to ensure we have the best team to deliver for our customers. Our focus on technology, innovation and career growth enables us to attract qualified talent, particularly those with security clearances and requisite skills in multiple areas, including science, technology, engineering and math. Our differentiated culture and workforce was a factor in our ability to hire approximately 7,400 new employees in 2024, and as of December 31, 2024, we have approximately 97,000 employees. \nOur Values and Culture\nOur values reflect our priorities and form the bedrock of our culture: \n•\nWe do the right thing – we earn trust, act with ethics, integrity and transparency, treat everyone with respect, value diverse perspectives and foster safe and inclusive environments.\n•\nWe do what we promise – we own the delivery of results, focused on quality.\n•\nWe commit to shared success – we work together to focus on the mission and take accountability for the sustainable success of our people, customers, shareholders, suppliers and communities. \n•\nWe pioneer – with fierce curiosity, dedication and innovation, we seek to solve the world’s most challenging problems.\nAmong other programs through which the company lives its values, the company maintains a Standards of Business Conduct program through which our employees are empowered to raise concerns through multiple channels without fear of reprisal. In addition to full-time ethics professionals, we also have over 150 business conduct advisors who promote values and an ethical culture within the company. Additionally, our annual Employee Experience Survey gives employees a voice and a mechanism to provide feedback on our culture and empower our leaders to enhance the employee experience. This anonymous survey encourages employee candor on key engagement and inclusion drivers, including belonging, respect, a sense of personal work accomplishment and recommending the company to others. In 2024, 80 percent of employees responded to the survey, an indication that our employees believe their feedback matters. Our performance on the annual survey is compared to the Qualtrics Global Benchmark and our survey results exceeded many of their global norms for both engagement and inclusion. Our leaders review the survey responses and work collaboratively with their teams to take meaningful actions based on survey results.\nOur culture and values serve as an enabling force that helps us pioneer, perform and deliver on quality, which results in value for our shareholders, customers, and employees. We actively seek candidates for employment from a wide range of backgrounds and experiences to tap into the full spectrum of talent available now and in the future to create a culture of belonging for everyone. \n-5-\nNORTHROP GRUMMAN CORPORATION\nTalent Management \nNorthrop Grumman’s talent strategy is focused on four key pillars: broadening talent pools; enhancing the employee experience; building leaders of the future; and fostering employee growth. Our strategy addresses the external and internal landscape and ensures that we can attract, retain and develop the workforce necessary to support the continued success of the business.\nWe hold regular talent review discussions to ensure line of sight to talent at various levels of the organization. We refresh and review succession plans to ensure a robust pipeline of talent and business continuity with a tight linkage to development. We focus on accelerating learning and development of our leaders by providing a combination of experiences, exposure and education.\nOur employee development programs strengthen employee skills aligned to our current and future business needs through on-the-job development, knowledge sharing and tools to support career growth. Employees utilize curated, career-specific resources such as My Learning Experience, a machine learning enabled content aggregator that creates a personalized learning experience for each employee. Our Education Assistance Program subsidizes tuition and other educational institution fees to support development through job-related degrees and certificates. Our early-in-career rotation program, Pathways, develops talent pipelines with both depth of critical skills and breadth of experiences. Our technical cohort programs cultivate technical, domain expertise and collaborative thought leadership for early through advanced career levels.\nIn a rapidly changing world, we maintain focus on keeping our team and our company prepared for the evolving future of work. In addition to offering our employees flexible work arrangements, caregiver support and mental health services that help our employees make their careers work within their lives, we also help our employees build the careers that will serve them into the future. We ensure that our employees have the tools and resources to develop their knowledge base and skill sets, so they can continue to thrive at Northrop Grumman even in the midst of change. When our employees succeed and grow at work, our business succeeds and grows. Through a focus on our employees, we remain agile and innovative, adapting to the future as it unfolds before us. \nEmployee Health and Safety\nHealth and safety are foundational to our success. People are our most valuable resource and we prioritize occupational health and safety to position the company for long-term success.\nTraining and risk and hazard identification, mitigation and prevention are key components of Northrop Grumman’s safety program. Everyone has a responsibility to identify workplace hazards, and employees may raise concerns without fear of reprisal. We evaluate the effectiveness of our health and safety programs by conducting trend analyses of our past performance and externally through benchmarking with industry peers and the U.S. Bureau of Labor Statistics.\nCollective Agreements \nApproximately 4,100 employees are covered by 15 collective agreements in the U.S., of which we negotiated five renewals in 2024 and expect to negotiate seven renewals in 2025.\nSee “Risk Factors” for further discussion regarding risks related to our workforce and employee relations.\nREGULATORY MATTERS\nGovernment Contract Security Restrictions\nWe are prohibited by the U.S. government from publicly discussing the details of classified programs. These programs are generally referred to as “restricted” in this Annual Report. The consolidated financial statements and financial information in this Annual Report reflect the operating results of our entire company, including restricted programs.\nContracts\nWe generate the majority of our business from long-term contracts with the U.S. government for development, production and support activities. Unless otherwise specified in a contract, allowable and allocable costs are billed to contracts with the U.S. government pursuant to the Federal Acquisition Regulation (FAR) and U.S. government Cost Accounting Standards (CAS), which are regulations that govern cost accounting requirements for government contracts. Examples of costs incurred by us and not billed to the U.S. government in accordance with applicable FAR and CAS requirements include, but are not limited to, unallowable employee compensation, charitable donations, interest expense, advertising, and certain legal and travel costs.\nWe monitor our contracts on a regular basis for compliance with our policies and procedures and applicable government laws and regulations. In addition, costs incurred and allocated to contracts with the U.S. government are routinely audited by the Defense Contract Audit Agency (DCAA).\n-6-\nNORTHROP GRUMMAN CORPORATION\nOur long-term contracts typically fall into one of two contract types:\nCost-type contracts\n – Cost-type contracts include cost plus fixed fee, cost plus award fee and cost plus incentive fee contracts. Cost-type contracts generally provide for reimbursement of a contractor’s allowable costs incurred plus fee. As a result, cost-type contracts have less financial risk associated with unanticipated cost growth but generally provide lower profit margins than fixed-price contracts. Cost-type contracts typically require that the contractor use its best efforts to accomplish the scope of work within some specified time and stated dollar limitation. Fees on cost-type contracts can be fixed in terms of dollar value or can be variable due to award and incentive fees, which are generally based on performance criteria such as cost, schedule, quality and/or technical performance. Award fees are determined and earned based on customer evaluation of the company’s performance against contractual criteria. Incentive fees are generally based on cost or schedule and provide for an initially negotiated fee to be adjusted later, based on the relationship of total allowable costs to total target costs or as schedule milestones are met. Award and incentive fees are included in total estimated sales to the extent it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is subsequently resolved. We estimate variable consideration as the most likely amount to which we expect to be entitled.\nFixed-price contracts\n – Firm fixed-price contracts include a specified scope of work for a price that is a pre-determined, negotiated amount and not typically subject to adjustment regardless of costs incurred by the contractor, absent changes by the customer. As a result, fixed-price contracts typically have more financial risk associated with unanticipated cost growth, but provide the opportunity for higher profit margins. Certain fixed-price incentive fee contracts provide for reimbursement of the contractor’s allowable costs plus a fee up to a cost ceiling amount, typically through a cost-sharing ratio that affects profitability. These contracts effectively become firm fixed-price contracts once the cost-share ceiling is reached. Time-and-materials contracts are considered fixed-price contracts as they specify a fixed hourly rate for each labor hour charged.\nProfit margins on our contracts may vary materially depending on, among other things, the contract type, contract phase (e.g., development, low-rate production or mature production), negotiated fee arrangements, achievement of performance objectives, unexpected macroeconomic factors or other circumstances, and cost, schedule and technical performance.\nSee Note 1 to the consolidated financial statements and “Risk Factors” for further information regarding our contracts and Note 15 to the consolidated financial statements for sales by contract type.\nThe following table summarizes sales for the year ended December 31, 2024, recognized by contract type and customer category:\n$ in millions\nU.S.\nGovernment\n(1)\nInternational\n(2)\nOther Customers\nTotal\nPercentage\nof Total Sales\nCost-type contracts\n$\n20,256 \n$\n684 \n$\n24 \n$\n20,964 \n51 \n%\nFixed-price contracts\n15,180 \n4,316 \n573 \n20,069 \n49 \n%\nTotal sales\n$\n35,436 \n$\n5,000 \n$\n597 \n$\n41,033 \n100 \n%\n(1)\nSales to the U.S. government include sales from contracts for which we are the prime contractor, as well as those for which we are a subcontractor and the ultimate customer is the U.S. government. Each of the company’s segments derives a substantial percentage of its revenue from the U.S. government.\n \n(2)\n International sales include sales from contracts for which we are the prime contractor, as well as those for which we are a subcontractor and the ultimate customer is an international customer. These sales include foreign military sales contracted through the U.S. government. \nEnvironmental\nOur operations are subject to and affected by federal, state, local and foreign laws, regulations and enforcement actions relating to protection of human health and the environment. We have incurred and expect to continue to incur capital and operating costs to comply with applicable environmental laws and regulations and to achieve our environmental sustainability goals. See “Risk Factors” and Notes 1 and 11 to the consolidated financial statements for further information regarding environmental matters.\nOur environmental sustainability goals focus on Northrop Grumman’s facilities in addition to supply chain partners and customers:\n-7-\nNORTHROP GRUMMAN CORPORATION\n•\nNet zero greenhouse gas emissions (GHG) in operations (Scopes 1 and 2) by 2035. Interim target of 50% GHG emissions reduction by 2030;\n•\nSource 50 percent of total electricity from renewable sources by 2030;\n•\nReduce 10% of absolute water withdrawals, reuse 10% of water withdrawals and replenish 10% of water withdrawals, focusing in water-stressed regions — all by 2030;\n•\nReduce solid waste sent to landfill and incineration by 10% by 2030; \n•\nIn collaboration with key customers, work to develop a pioneering product stewardship program focused on material efficiency, product design and life cycle assessment;\n•\nExpand Technology for Conservation initiatives in proximity to Northrop Grumman's U.S. locations by 2030, in collaboration with external partners.\nAdditional information regarding our environmental sustainability goals is available in our Sustainability Report, which can be found on our company website.\nEXECUTIVE OFFICERS\nSee “Directors, Executive Officers and Corporate Governance” for information about our executive officers.\nAVAILABLE INFORMATION\nOur principal executive offices are located at 2980 Fairview Park Drive, Falls Church, Virginia 22042. Our telephone number is (703) 280-2900 and our home page is www.northropgrumman.com.\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and proxy statement for the annual shareholders’ meeting, as well as any amendments to those reports, are available free of charge through our website as soon as reasonably practicable after we file them with the U.S. Securities and Exchange Commission (SEC). You can learn more about us by reviewing our SEC filings on the investor relations page of our website.\nThe SEC also maintains a website at www.sec.gov that contains reports, proxy statements and other information about SEC registrants, including Northrop Grumman Corporation. \nReferences to our website and the SEC’s website in this report are provided as a convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, such websites. Such information should not be considered a part of this report, unless otherwise expressly incorporated by reference in this report.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOVERVIEW\nThe following discussion should be read along with the financial statements included in this Form 10-K, as well as Part II, “Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations” (MD&A) of our Form 10-K for the year ended December 31, 2023 (“2023 Annual Report on Form 10-K”). To the extent the July 1, 2024 SDS realignment impacted the disclosures in the 2023 Annual Report on Form 10-K, we recast those prior year MD&A disclosures herein.\nGlobal Security Environment\nThe U.S. and its allies continue to face a global security environment of heightened tensions and instability, threats from state and non-state actors, including in particular major global powers, as well as terrorist organizations, increasing nuclear tensions, diverse regional security concerns and political instability. The market for defense products, services and solutions globally is driven by these complex and evolving security challenges, considered in the broader context of political and socioeconomic circumstances and priorities. Our operations and financial performance, as well as demand for our products and services, are impacted by these events, including global unrest. The same is true for our suppliers and other business partners.\nThe conflicts in Ukraine and the Middle East and threats elsewhere, particularly in the Pacific region, have increased global tensions and instability and highlighted security requirements globally, including in Europe, the Middle East and the Pacific region, as well as the U.S. These conflicts have resulted in and may continue to result in increased demand for defense products and services from allies and partner nations, particularly in those areas. For example, we have experienced an increase in demand for certain of our products and services directly and indirectly related to the conflict in Ukraine. We continue to monitor developments in these regions, but have not experienced, and do not anticipate experiencing, significant adverse financial impacts directly from the conflicts in Ukraine or the Middle East.\nWe believe the current global security environment highlights the significant national security threats to the U.S. and its allies, and the need for strong deterrence and robust defense capabilities, and are actively evaluating both opportunities and risks associated with this environment. We believe our capabilities, particularly in space, C4ISR, missile defense, battle management, advanced weapons, strategic deterrence, and survivable aircraft and mission systems should help our customers in the U.S. and globally defend against current and future threats and, as a result, continue to allow for long-term profitable business growth.\nGlobal Economic Environment\nOver the past several years, the global economic environment has experienced extraordinary challenges, including inflationary pressures; widespread delays and disruptions in supply chains; business slowdowns or shutdowns; workforce challenges and labor shortfalls; and market volatility. These macroeconomic factors have contributed, and in the future could contribute, to increased costs, delays, disruptions and other performance challenges, as well as increased competing demands for limited resources to address such increased costs and other challenges, for our company, our suppliers and partners, and our customers. We continue to work to address challenges caused by the macroeconomic environment on our business. We have seen positive progress in the supply chain as on-time deliveries and quality have improved. In remaining areas of pressure, we are proactively working with our suppliers to ensure we meet our contract commitments. Although certain pockets of our business were adversely affected by the broader macroeconomic environment during the fourth quarter of 2024, the overall financial impact on our company has continued to subside.\nIn addition, an overall increase in interest rates in recent years has raised the cost of borrowing for governments, and if rates further increase, it could impact government spending priorities (in the U.S. and allied countries, in particular), including their demand for defense products. Economic tensions and changes in international trade policies, including higher tariffs on imported goods and materials, the imposition of retaliatory tariffs or other trade protection measures and renegotiation of free trade agreements, could also further impact the global market for defense products, services and solutions.\nU.S. Political, Budget and Regulatory Environment\nThe U.S. continues to face an uncertain and evolving political, budget and regulatory environment. In particular, it is difficult to predict the specific course of future defense budgets. Current and future requirements related to the conflicts in Ukraine and the Middle East, threats in the Pacific region and other security priorities, as well as the macroeconomic environment, the national debt, and other domestic priorities, among other things, in the U.S. and globally, will continue to impact our customers’ budgets, spending and priorities, and our industry. The U.S. political environment may also impact defense budgets and priorities, issues related to the national debt, and \n-28-\nNORTHROP GRUMMAN CORPORATION\n                        \ngovernment spending more broadly. We anticipate that issues related to budgetary priorities and defense spending levels, the debt ceiling, and the spending caps imposed by the Fiscal Responsibility Act of 2023 (FRA), particularly with respect to discretionary spending, will continue to be a subject of considerable debate, with a potentially significant impact on our programs and the company.\nAnnual appropriations to fund the federal government for FY 2025 have not yet been enacted. Congress continues to pass short-term continuing resolutions (CR) to fund the federal government. The most recent CR passed in December 2024 extends current funding levels until March 14, 2025. It remains uncertain when the government will approve FY 2025 appropriations, and the levels of funding FY 2025 appropriations will provide. Government operations under an extended CR could have potential impacts on our programs and new starts, in particular.\nThe political environment, federal budget, debt ceiling and regulatory environment, including potential tax reform, are expected to continue to be the subject of considerable debate, especially in light of the ongoing conflicts and heightened global tensions, the macroeconomic environment and political tensions. The results of those debates could have material impacts on defense spending broadly and the company’s programs in particular.\nB-21 Program\nIn 2015, the U.S. Air Force awarded Northrop Grumman the B-21 contract, which includes a base contract for engineering and manufacturing development (EMD) and five low-rate initial production (LRIP) options for a baseline total of 21 aircraft. The EMD phase of the program is largely cost type and began at contract award. The LRIP options are largely fixed price and are expected to continue to be awarded and executed through approximately the end of the decade. In addition to the five LRIP options, Northrop Grumman and the U.S. Air Force have established not to exceed (NTE) pricing for additional aircraft up to unit 40. The average NTE value for these subsequent lots is above the average unit price of the five LRIP lots, and the NTE lots include an economic price adjustment clause to help protect against certain inflationary pressures. Final terms, quantity, and pricing for these subsequent lots are not fully negotiated.\nDuring the fourth quarter of 2023, we recognized a projected loss of $1.56 billion across the five LRIP options. During the fourth quarter of 2024, we again reviewed our estimated profitability on the program and made no significant changes to the previously recognized loss. The company’s 2024 results reflect our current best estimate of our cost to complete the LRIP and NTE aircraft, as well as the outcome of ongoing discussions with our suppliers and our customer. If our estimated cost to complete the aircraft changes or our assumptions regarding contract performance, quantities, supplier negotiations, or funding to mitigate the impact of macroeconomic disruptions are resolved more or less favorably than what we have estimated, our financial position, results of operations and/or cash flows could be materially affected.\nSentinel Program\nIn 2020, the U.S. Air Force awarded Northrop Grumman a $13.3 billion contract for the EMD phase of the Sentinel program. In January 2024, the U.S. Air Force provided congressional notification that the Sentinel program was under a Nunn-McCurdy breach review, which is required when total program cost estimates exceed certain defined thresholds. This notification, which had been driven primarily by increases in cost estimates for the Production and Deployment phases, commenced the process to achieve certification for continuance of the program and update its baseline cost estimates. We are currently executing under a cost-type contract for the EMD phase, and the Production and Deployment phases are yet to be priced and negotiated.\nIn July 2024, the Sentinel program was certified for continuation by the DoD upon completion of the Nunn-McCurdy breach review. In connection with the certification, the DoD directed that the program be restructured, including plans for infrastructure related to the command and launch segment, which was the main driver of the increased cost estimates for the Production and Deployment phases. We are partnering with our customer to establish a new program baseline as part of the restructuring activities.\nDuring the fourth quarter of 2024, we reviewed our estimated profitability on the Sentinel program and made no significant changes. The Sentinel EAC incorporates our best estimate of costs to complete the restructured EMD effort; however, if the outcome is more or less favorable than what we have estimated, our financial position, results of operations and/or cash flows could be materially affected.\nOperating Performance Assessment and Reporting\nWe manage and assess our business based on our performance on contracts and programs (typically larger contracts or two or more closely-related contracts). We recognize sales from our portfolio of long-term contracts as control is transferred to the customer, primarily over time on a cost-to-cost basis (cost incurred relative to costs estimated at completion). As a result, sales tend to fluctuate in concert with costs incurred across our large portfolio of contracts. \n-29-\nNORTHROP GRUMMAN CORPORATION\n                        \nDue to the applicable FAR and CAS requirements that govern our U.S. government business, most types of costs are allocable to U.S. government contracts. As such, we do not focus on individual cost groupings (such as manufacturing, engineering and design labor, subcontractor, material, overhead and general and administrative (G&A) costs), as much as we do on total contract cost, which is the key driver of our sales and operating income.\nIn evaluating our operating performance, we primarily focus on changes in sales and operating margin rates. Where applicable, significant fluctuations in operating performance attributable to individual contracts or programs, or changes in a specific cost element across multiple contracts, are described in our analysis. Based on this approach and the nature of our operations, the discussion of results of operations below first focuses on our four segments before distinguishing between products and services. Changes in sales are generally described in terms of volume, while changes in operating margin rates are generally described in terms of performance and/or contract mix. For purposes of this discussion, volume generally refers to increases or decreases in sales or cost from production/service activity levels and performance generally refers to non-volume-related changes in profitability, which are typically described in terms of changes in net EAC adjustments. Contract mix generally refers to changes in the ratio of contract type and/or life cycle (e.g., cost-type, fixed-price, development, production, and/or sustainment).\nCONSOLIDATED OPERATING RESULTS\nFor purposes of the operating results discussion below, we assess our performance using certain financial measures that are not calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP” or “FAS”). \nMark-to-market adjusted net earnings (MTM-adjusted net earnings) and MTM-adjusted earnings per share (MTM-adjusted EPS) exclude MTM pension and OPB benefit/(expense) and related tax impacts, which are generally only recognized during the fourth quarter. These non-GAAP measures may be useful to investors and other users of our financial statements as supplemental measures in evaluating the company’s underlying financial performance by presenting the company’s operating results before the non-operational impact of pension and OPB actuarial gains and losses. These measures are also consistent with how management views the underlying performance of the business as the impact of MTM accounting is not considered in management’s assessment of the company’s operating performance or in its determination of incentive compensation awards. \nWe reconcile these non-GAAP financial measures to their most directly comparable GAAP financial measures below. These non-GAAP measures may not be defined and calculated by other companies in the same manner and should not be considered in isolation or as an alternative to operating results presented in accordance with GAAP.\nSelected financial highlights are presented in the table below:\n \nYear Ended December 31\n% Change in\n$ in millions, except per share amounts\n2024\n2023\n2022\n2024\n2023\nSales\n$\n41,033\n \n$\n39,290 \n$\n36,602 \n4\n \n%\n7 \n%\nOperating costs and expenses\n36,663\n \n36,753 \n33,001 \n—\n \n%\n11 \n%\nOperating costs and expenses as a % of sales\n89.4\n \n%\n93.5 \n%\n90.2 \n%\nOperating income\n4,370\n \n2,537 \n3,601 \n72\n \n%\n(30)\n%\nOperating margin rate\n10.6\n \n%\n6.5 \n%\n9.8 \n%\nMark-to-market pension and OPB benefit (expense)\n443\n \n(422)\n1,232 \nNM\nNM\nFederal and foreign income tax expense\n842\n \n290 \n940 \n190\n \n%\n(69)\n%\nEffective income tax rate\n16.8\n \n%\n12.4 \n%\n16.1 \n%\nNet earnings\n4,174\n \n2,056 \n4,896 \n103\n \n%\n(58)\n%\nDiluted earnings per share\n$\n28.34\n \n$\n13.53 \n$\n31.47 \n109\n \n%\n(57)\n%\nSales\n2024 sales increased $1.7 billion, or 4 percent, due to a 12 percent growth in sales at Aeronautics Systems and higher sales at Mission Systems and Defense Systems, partially offset by lower sales at Space Systems largely driven by a reduction of $595 million associated with wind-down of work on the restricted space and NGI programs, as previously disclosed. 2024 sales reflect continued strong demand for our products and services.\n-30-\nNORTHROP GRUMMAN CORPORATION\n                        \nSee “Segment Operating Results” below for further information by segment and “Product and Service Analysis” for product and service detail. See Note 15 to the consolidated financial statements for information regarding the company’s sales by customer type, contract type and geographic region for each of our segments.\nOperating Income and Margin Rate\n2024 operating income increased $1.8 billion, or 72 percent, primarily due to higher operating income at Aeronautics Systems, largely driven by the prior year $1.56 billion charge on the B-21 program, as well as higher operating income at Space Systems and Defense Systems. 2024 operating income also increased due to a $122 million increase in the FAS/CAS operating adjustment, partially offset by $73 million of higher unallocated corporate expense, largely due to a $127 million increase in deferred state taxes related to the MTM benefit (expense) and prior year B-21 charge and $25 million of lower intangible amortization and PP&E step-up depreciation. 2024 operating margin rate increased to 10.6 percent from 6.5 percent reflecting the items above.\n2024 G&A costs as a percentage of sales decreased to 9.7 percent from 10.2 percent primarily due to higher sales.\nFor further information regarding product and service operating costs and expenses, see “Product and Service Analysis” below.\nMark-to-Market Pension and OPB Benefit/Expense\nThe primary components of pre-tax MTM benefit (expense) are presented in the table below:\n \nYear Ended December 31\n$ in millions\n2024\n2023\n2022\nActuarial gains (losses) on projected benefit obligation\n$\n1,314\n \n$\n(1,489)\n$\n9,662 \nActuarial (losses) gains on plan assets \n(871)\n1,067 \n(8,430)\nMTM benefit (expense)\n$\n443\n \n$\n(422)\n$\n1,232 \nThe 2024 MTM benefit of $443 million was primarily driven by a 58 basis point increase in the discount rate from year end 2023, partially offset by actual net plan asset returns of 4.7 percent compared to our 7.5 percent asset return assumption.\nFederal and Foreign Income Taxes\nThe 2024 effective tax rate (ETR) increased to 16.8 percent from 12.4 percent in 2023 primarily due to the impact of the prior year B-21 charge and the MTM adjustment on our ETR. The 2024 MTM benefit increased the 2024 ETR by 0.4 percentage points, whereas the prior year B-21 charge and MTM expense collectively reduced the 2023 ETR by 3.8 percentage points. The 2024 ETR also reflects a net reduction in tax reserves largely due to a recent federal court decision, partially offset by higher interest expense on unrecognized tax benefits. See Note 6 to the consolidated financial statements for additional information.\nNet Earnings\nThe table below reconciles net earnings to MTM-adjusted net earnings:\n \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nNet earnings\n$\n4,174\n \n$\n2,056 \n$\n4,896 \n103\n \n%\n(58)\n%\nMTM (benefit) expense\n(443)\n422 \n(1,232)\nNM\nNM\nMTM-related deferred state tax expense (benefit)\n(1)\n23\n \n(22)\n65 \nNM\nNM\nFederal tax expense (benefit) of items above\n(2)\n88\n \n(84)\n245 \nNM\nNM\nMTM adjustment, net of tax\n(332)\n316 \n(922)\nNM\nNM\nMTM-adjusted net earnings\n$\n3,842\n \n$\n2,372 \n$\n3,974 \n62\n \n%\n(40)\n%\n(1)\nThe deferred state tax impact in each period was calculated using the company’s blended state tax rate of 5.25 percent and is included in Unallocated corporate expense within operating income.\n \n(2)\nThe federal tax impact in each period was calculated by subtracting the deferred state tax impact from MTM benefit (expense) and applying the 21 percent federal statutory rate.\n \n2024 net earnings increased $2.1 billion, or 103 percent, primarily due to $1.8 billion of higher operating income, an $865 million increase in our MTM benefit (expense), and a $126 million increase in the non-operating FAS pension benefit. These increases were partially offset by a $552 million increase in income tax expense, a $97 million gain \n-31-\nNORTHROP GRUMMAN CORPORATION\n                        \nrecognized in the prior year upon the sale of our minority investment in an Australian business, and $76 million of higher interest expense on our long-term debt.\nDiluted Earnings Per Share\nThe table below reconciles diluted earnings per share to MTM-adjusted EPS:\n \nYear Ended December 31\n% Change in\n2024\n2023\n2022\n2024\n2023\nDiluted earnings per share\n$\n28.34\n \n$\n13.53 \n$\n31.47 \n109\n \n%\n(57)\n%\nMTM (benefit) expense per share\n(3.02)\n2.78 \n(7.92)\nNM\nNM\nMTM-related deferred state tax expense (benefit) per share\n(1)\n0.16\n \n(0.14)\n0.42 \nNM\nNM\nFederal tax expense (benefit) of items above per share\n(2)\n0.60\n \n(0.56)\n1.57 \nNM\nNM\nMTM adjustment per share, net of tax\n(2.26)\n2.08 \n(5.93)\nNM\nNM\nMTM-adjusted EPS\n$\n26.08\n \n$\n15.61 \n$\n25.54 \n67\n \n%\n(39)\n%\n(1)\nThe deferred state tax impact in each period was calculated using the company’s blended state tax rate of 5.25 percent and is included in Unallocated corporate expense within operating income.\n \n(2)\nThe federal tax impact in each period was calculated by subtracting the deferred state tax impact from MTM benefit (expense) and applying the 21 percent federal statutory rate.\n \n2024 diluted earnings per share increased $14.81, or 109 percent, reflecting the 103 percent increase in net earnings described above and a 3 percent reduction in weighted-average diluted shares outstanding.\nSEGMENT OPERATING RESULTS\nBasis of Presentation\nThe company is aligned in four operating sectors, which also comprise our reportable segments: Aeronautics Systems, Defense Systems, Mission Systems and Space Systems. \nEffective July 1, 2024, the company realigned the Strategic Deterrent Systems (SDS) division, which includes the Ground-Based Strategic Deterrent (“Sentinel”) program, from Space Systems to Defense Systems. This realignment is reflected in the financial information contained in this report. \nSubsequent Realignment\n - Effective January 1, 2025, the company realigned the Strike and Surveillance Aircraft Solutions (SSAS) business unit from Defense Systems to Aeronautics Systems. This realignment is not reflected in the financial information contained in this report; it will be reflected in the company’s operating results beginning in the first quarter of 2025. \nFor a more complete description of each segment’s products and services, see “Business.” \nSegment Operating Income and Margin Rate\nSegment operating income, as reconciled in the table below, and segment operating margin rate (segment operating income divided by sales) are non-GAAP measures that reflect the combined operating income of our four segments less the operating income associated with intersegment sales. Segment operating income includes pension expense allocated to our sectors under FAR and CAS and excludes FAS pension service expense and unallocated corporate items (certain corporate-level expenses, which are not considered allowable or allocable under applicable FAR and CAS requirements, and costs not considered part of management’s evaluation of segment operating performance). These non-GAAP measures may be useful to investors and other users of our financial statements as supplemental measures in evaluating the financial performance and operational trends of our sectors. These measures may not be defined and calculated by other companies in the same manner and should not be considered in isolation or as alternatives to operating results presented in accordance with GAAP. \n-32-\nNORTHROP GRUMMAN CORPORATION\n                        \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nOperating income\n$\n4,370\n \n$\n2,537 \n$\n3,601 \n72\n \n%\n(30)\n%\nOperating margin rate\n10.6 \n%\n6.5 \n%\n9.8 \n%\nReconciliation to segment operating income:\nCAS pension expense\n(279)\n(154)\n(167)\n81\n \n%\n(8)\n%\nFAS pension service expense\n239\n \n236 \n367 \n1\n \n%\n(36)\n%\nFAS/CAS operating adjustment\n(40)\n82 \n200 \nNM\n(59)\n%\nIntangible asset amortization and PP&E step-up depreciation\n97\n \n122 \n242 \n(20)\n%\n(50)\n%\nDeferred state tax expense (benefit)\n(1)\n of MTM adjustment\n23\n \n(22)\n65 \nNM\n(134)\n%\nDeferred state tax benefit of B-21 charge\n(1)\n—\n \n(82)\n— \nNM\nNM\nOther unallocated corporate expense\n94\n \n123 \n145 \n(24)\n%\n(15)\n%\nUnallocated corporate expense\n214\n \n141 \n452 \n52\n \n%\n(69)\n%\nSegment operating income\n$\n4,544\n \n$\n2,760 \n$\n4,253 \n65\n \n%\n(35)\n%\nSegment operating margin rate\n11.1 \n%\n7.0 \n%\n11.6 \n%\n(1)\nRepresents the deferred state tax expense (benefit) associated with MTM benefit (expense) and the prior year B-21 charge, which are recorded in Unallocated corporate expense consistent with other changes in deferred state taxes.\nSegment Operating Income and Margin Rate\n2024 segment operating income increased $1.8 billion, or 65 percent, primarily due to higher operating income at Aeronautics Systems, largely driven by the prior year $1.56 billion charge on the B-21 program, as well as higher operating income at Space Systems and Defense Systems. Segment operating margin rate increased to 11.1 percent reflecting higher operating margin rates at Aeronautics Systems and Space Systems, partially offset by a lower operating margin rate at Mission Systems.\nFAS/CAS Operating Adjustment\nThe 2024 FAS/CAS operating adjustment reflects higher CAS pension expense largely driven by plan asset returns in prior years and changes in certain CAS actuarial assumptions as of December 31, 2023.\nUnallocated Corporate Expense\nThe increase in 2024 unallocated corporate expense is primarily due to a $127 million increase in deferred state taxes associated with the prior year B-21 charge and the MTM adjustment, partially offset by lower intangible asset amortization and PP&E step-up depreciation and a loss recognized in the prior year in connection with the divestiture of a small international subsidiary.\nNet Estimate-At-Completion (EAC) Adjustments - \nWe record changes in estimated contract earnings at completion (net EAC adjustments) using the cumulative catch-up method of accounting. Net EAC adjustments can have a significant effect on reported sales and operating income and the aggregate amounts are presented in the table below:\nYear Ended December 31\n$ in millions\n2024\n2023\n2022\nFavorable EAC adjustments\n$\n1,461\n \n$\n1,314 \n$\n1,337 \nUnfavorable EAC adjustments\n(1,111)\n(1,230)\n(977)\nNet EAC adjustments\n$\n350\n \n$   \n84 \n$   \n360 \n-33-\nNORTHROP GRUMMAN CORPORATION\n                        \nNet EAC adjustments by segment are presented in the table below:\nYear Ended December 31\n$ in millions\n2024\n2023\n2022\nAeronautics Systems\n$\n151\n \n$\n(44)\n$\n174 \nDefense Systems\n96\n \n91 \n104 \nMission Systems\n59\n \n149 \n138 \nSpace Systems\n42\n \n(101)\n(31)\nEliminations\n2\n \n(11)\n(25)\nNet EAC adjustments\n$\n350\n \n$\n84 \n$\n360 \nAERONAUTICS SYSTEMS\nAeronautics Systems is a leader in the design, development, production, integration, sustainment and modernization of military aircraft systems for the U.S. Air Force, the U.S. Navy, other U.S. government agencies, and international customers. Major products include strategic long-range strike aircraft; tactical fighter and air dominance aircraft; airborne battle management and command and control systems; and unmanned autonomous aircraft systems, including high-altitude long-endurance (HALE) strategic intelligence, surveillance and reconnaissance (ISR) systems.\n \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nSales\n$\n12,030\n \n$\n10,786 \n$\n10,531 \n12\n \n%\n2 \n%\nOperating income (loss)\n1,182\n \n(473)\n1,116 \nNM\nNM\nOperating margin rate\n9.8\n \n%\n(4.4)\n%\n10.6 \n%\nSales\n2024 sales increased $1.2 billion, or 12 percent, primarily due to the continuing transition to production on B-21 driving higher restricted volume, a $448 million increase in F-35 production and sustainment volume due, in part, to the timing of materials, a $134 million increase in Triton LRIP production volume, a $134 million increase in E-2 fleet sustainment and modernization work, and higher volume on Global Hawk sustainment activities.\nOperating Income\n2024 operating income increased $1.7 billion primarily due to the prior year $1.56 billion charge on the B-21 program as well as higher sales. Operating margin rate increased to 9.8 percent principally due to the prior year B-21 charge.\nDEFENSE SYSTEMS\nDefense Systems is a leader in the design, engineering, development, integration and production of strategic deterrent systems, advanced tactical weapons, and missile defense solutions, and a provider of sustainment, modernization and training services for manned and unmanned aircraft and electronics systems for the U.S. military and a broad range of international customers. Major products and services include strategic missiles; integrated, all-domain command and control (C2) systems; precision strike weapons; advanced propulsion, including tactical solid rocket motors and high speed air-breathing and hypersonic systems; high-performance gun systems, ammunition, precision munitions and advanced fuzes; and aircraft and mission systems logistics support, sustainment, operations and modernization. \n \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nSales\n$\n8,560\n \n$\n8,289 \n$\n7,629 \n3\n \n%\n9 \n%\nOperating income\n866\n \n829 \n781 \n4\n \n%\n6 \n%\nOperating margin rate\n10.1\n \n%\n10.0 \n%\n10.2 \n%\n-34-\nNORTHROP GRUMMAN CORPORATION\n                        \nSales\n2024 sales increased $271 million, or 3 percent, primarily due to a $182 million increase on Sentinel as that program continues to ramp, a $163 million increase on certain military ammunition programs, a $124 million increase on Stand-in Attack Weapon (SiAW) as the program ramps and higher volume from timing of materials and increased order quantities on the Guided Multiple Launch Rocket System (GMLRS) program. These increases were partially offset by a $262 million decrease due to the completion of an international training program and lower volume on the Special Electronic Mission Aircraft (SEMA) program as it nears completion.\n2023 sales increased $660 million, or 9 percent, primarily due to a $426 million increase driven by Sentinel ramp-up, as well as higher volume on ammunition programs, GMLRS, an international training program, Hypersonic Attack Cruise Missile (HACM), and SiAW.\nOperating Income\n2024 operating income increased $37 million, or 4 percent, primarily due to higher sales. Operating margin rate was comparable to the prior period.\n2023 operating income increased $48 million, or 6 percent, due to higher sales, partially offset by a lower operating margin rate. Operating margin rate decreased to 10.0 percent from 10.2 percent, primarily due to lower net EAC adjustments.\nMISSION SYSTEMS\nMission Systems is a leader in advanced mission solutions and multifunction systems, primarily for the U.S. defense and intelligence community, and international customers. Major products and services include command, control, communications and computers, intelligence, surveillance and reconnaissance (C4ISR) systems; radar, electro-optical/infrared (EO/IR) and acoustic sensors; electronic warfare systems; advanced communications and network systems; advanced microelectronics; navigation and positioning sensors; maritime power, propulsion and payload launch systems; full spectrum cyber solutions; and intelligence processing systems. \n \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nSales\n$\n11,399\n \n$\n10,895 \n$\n10,396 \n5\n \n%\n5 \n%\nOperating income\n1,598\n \n1,609 \n1,618 \n(1)\n%\n(1)\n%\nOperating margin rate\n14.0\n \n%\n14.8 \n%\n15.6 \n%\nSales\n2024 sales increased $504 million, or 5 percent, primarily due to higher volume on restricted advanced microelectronics and technology programs, increased marine systems sales due, in part, to the timing of materials, and higher Ground/Air Task Oriented Radar (G/ATOR) volume due to continued ramp-up on full-rate production (FRP) awards. These increases were partially offset by lower sales on restricted airborne radar programs and the Scalable Agile Beam Radar (SABR) program.\nOperating Income\n2024 operating income decreased $11 million, or 1 percent, due to a lower operating margin rate, partially offset by higher sales. Operating margin rate decreased to 14.0 percent from 14.8 percent primarily due to lower net EAC adjustments on certain airborne radar production programs due, in part, to production inefficiencies that have driven higher labor costs, as well as changes in contract mix toward more cost-type content. These decreases were partially offset by sales growth on higher margin advanced microelectronics programs.\n-35-\nNORTHROP GRUMMAN CORPORATION\n                        \nSPACE SYSTEMS\nSpace Systems is a leader in delivering end-to-end mission solutions through the design, development, integration, production and operation of space, missile defense, and launch systems for national security, civil government, commercial and international customers. Major products include satellites and spacecraft systems, subsystems, sensors and payloads; ground systems; missile defense systems and interceptors; and launch vehicles and related propulsion systems.\n \nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nSales\n$\n11,731\n \n$\n11,873 \n$\n10,570 \n(1)\n%\n12 \n%\nOperating income\n1,254\n \n1,130 \n1,078 \n11\n \n%\n5 \n%\nOperating margin rate\n10.7\n \n%\n9.5 \n%\n10.2 \n%\nSales\n2024 sales decreased $142 million, or 1 percent, primarily due to wind-down of work on the restricted space and NGI programs, which reduced sales by $595 million. This reduction was partially offset by a $302 million increase on Space Development Agency (SDA) satellite programs and a $130 million increase on the Habitation and Logistics Outpost (HALO) program.\n2023 sales increased $1.3 billion, or 12 percent, primarily due to higher volume on restricted programs and ramp-up on development programs, including $333 million on the Next-Gen Polar program, $219 million on the NGI program, $119 million on the SDA Tranche 1 Tracking Layer program and $102 million on the SDA Tranche 2 Transport Layer program. These increases were partially offset by a $172 million decrease for CRS missions and a $109 million decrease on the HALO program.\nOperating Income\n2024 operating income increased $124 million, or 11 percent, primarily due to a higher operating margin rate. Operating margin rate increased to 10.7 percent from 9.5 percent primarily due to higher net EAC adjustments largely driven by the HALO program as previously disclosed.\n2023 operating income increased $52 million, or 5 percent, due to higher sales, partially offset by a lower operating margin rate. Operating margin rate decreased to 9.5 percent from 10.2 percent primarily due to a prior year $96 million gain recognized in connection with a land exchange transaction, as well as lower net EAC adjustments driven by $100 million of unfavorable EAC adjustments on the HALO program in 2023. These decreases were partially offset by a $42 million benefit from insurance recoveries in our commercial space business during 2023.\n-36-\nNORTHROP GRUMMAN CORPORATION\n                        \nPRODUCT AND SERVICE ANALYSIS\nThe following table presents product and service sales and operating costs and expenses by segment: \n \nYear Ended December 31\n$ in millions\n2024\n2023\n2022\nSegment Information:\nSales\nOperating Costs and Expenses\nSales\nOperating Costs and Expenses\nSales\nOperating Costs and Expenses\nAeronautics Systems\nProduct\n$  \n9,064\n \n$  \n8,248\n \n$  \n8,157 \n$  \n8,942 \n$  \n7,981 \n$  \n7,161 \nService\n2,723\n \n2,382\n \n2,389 \n2,099 \n2,311 \n2,042 \nIntersegment eliminations\n243\n \n218\n \n240 \n218 \n239 \n212 \nTotal Aeronautics Systems\n12,030\n \n10,848\n \n10,786 \n11,259 \n10,531 \n9,415 \nDefense Systems\nProduct\n5,843\n \n5,304\n \n5,282 \n4,819 \n4,604 \n4,163 \nService\n1,862\n \n1,641\n \n2,231 \n1,959 \n2,231 \n1,985 \nIntersegment eliminations\n855\n \n749\n \n776 \n682 \n794 \n700 \nTotal Defense Systems\n8,560\n \n7,694\n \n8,289 \n7,460 \n7,629 \n6,848 \nMission Systems\nProduct\n8,076\n \n7,000\n \n7,749 \n6,669 \n7,376 \n6,291 \nService\n2,146\n \n1,805\n \n2,092 \n1,730 \n2,005 \n1,639 \nIntersegment eliminations\n1,177\n \n996\n \n1,054 \n887 \n1,015 \n848 \nTotal Mission Systems\n11,399\n \n9,801\n \n10,895 \n9,286 \n10,396 \n8,778 \nSpace Systems\nProduct\n9,743\n \n8,711\n \n9,709 \n8,844 \n8,561 \n7,664 \nService\n1,576\n \n1,398\n \n1,681 \n1,468 \n1,533 \n1,404 \nIntersegment eliminations\n412\n \n368\n \n483 \n431 \n476 \n424 \nTotal Space Systems\n11,731\n \n10,477\n \n11,873 \n10,743 \n10,570 \n9,492 \nTotal Product\n$\n32,726\n \n$\n29,263\n \n$\n30,897 \n$\n29,274 \n$\n28,522 \n$\n25,279 \nTotal Service\n8,307\n \n7,226\n \n8,393 \n7,256 \n8,080 \n7,070 \nTotal Segment\n(1)\n$\n41,033\n \n$\n36,489\n \n$\n39,290 \n$\n36,530 \n$\n36,602 \n$\n32,349 \n(1)\nA reconciliation of segment operating income to total operating income is included in “Segment Operating Results.”\nProduct Sales and Costs\n2024 product sales increased $1.8 billion, or 6 percent, due to an increase in product sales at all four sectors. The increase was principally driven by higher volume on restricted programs, F-35, Triton and E-2 at Aeronautics Systems, higher volume on Sentinel, certain military ammunition programs, SiAW and GMLRS at Defense Systems, higher restricted sales, partially offset by lower SABR volume, at Mission Systems and sales growth on SDA satellite programs and HALO, partially offset by wind-down of work on the restricted space and NGI programs, at Space Systems.\n2023 product sales increased $2.4 billion, or 8 percent, due to an increase in product sales at all four sectors. The increase was principally driven by higher volume on restricted programs and NGI at Space Systems, higher volume on Sentinel, ammunition programs, GMLRS, HACM, and the Integrated Battle Command System (IBCS) program at Defense Systems, and higher restricted sales at Mission Systems and Aeronautics Systems.\n2024 product costs were comparable to the prior year, reflecting a higher operating margin rate principally due to the prior year $1.56 billion charge on the B-21 program at Aeronautics Systems and higher EAC adjustments at Space Systems, largely driven by the HALO program.\n2023 product costs increased $4.0 billion, or 16 percent, consistent with the higher product sales described above and reflect a lower operating margin rate principally due to the previously described $1.56 billion charge on the B-21 program at Aeronautics Systems and lower net EAC adjustments on Space Systems production programs.\n-37-\nNORTHROP GRUMMAN CORPORATION\n                        \nService Sales and Costs\n2024 service sales decreased $86 million, or 1 percent, primarily due to a decrease in service sales at Defense Systems principally due to the completion of an international training program and lower volume on SEMA, partially offset by an increase in service sales at Aeronautics Systems driven by higher volume on restricted programs and Global Hawk.\n2023 service sales increased $313 million, or 4 percent, due to an increase in service sales at Space Systems, Mission Systems, and Aeronautics Systems. The increase was principally driven by higher restricted sales at Space Systems and Aeronautics Systems, and higher volume on restricted programs and F-35 sustainment at Mission Systems.\n2024 service costs were comparable to the prior year, consistent with the change in services sales described above.\n2023 service costs increased $186 million, or 3 percent, consistent with the higher service sales described above and reflects a higher operating margin rate on Space Systems service programs.\nBACKLOG\nBacklog represents the future sales we expect to recognize on firm orders received by the company and is equivalent to the company’s remaining performance obligations at the end of each period. It comprises both funded backlog (firm orders for which funding is authorized and appropriated) and unfunded backlog. Unexercised contract options and indefinite delivery indefinite quantity (IDIQ) contracts are not included in backlog until the time the option or IDIQ task order is exercised or awarded. Backlog is converted into sales as costs are incurred or deliveries are made.\nBacklog consisted of the following at December 31, 2024 and 2023:\n \n2024\n2023\n$ in millions\nFunded\nUnfunded\nTotal\nBacklog\nTotal\nBacklog\n% Change in 2024\nAeronautics Systems\n$\n10,689\n \n$\n13,409\n \n$\n24,098\n \n$\n19,583 \n23\n \n%\nDefense Systems\n9,873\n \n17,845\n \n27,718\n \n20,198 \n37\n \n%\nMission Systems\n11,574\n \n4,869\n \n16,443\n \n16,108 \n2\n \n%\nSpace Systems\n7,526\n \n15,683\n \n23,209\n \n28,341 \n(18)\n%\nTotal backlog\n$\n39,662\n \n$\n51,806\n \n$\n91,468\n \n$\n84,230 \n9\n \n%\n2024 net awards totaled $50.6 billion. Significant 2024 new awards include $11.8 billion for restricted programs (primarily at Aeronautics Systems, Mission Systems, and Space Systems), $3.5 billion for the Take Charge and Move Out (TACAMO) mission, $3.5 billion for F-35 (primarily at Aeronautics Systems), $2.4 billion for E-2, $1.8 billion for Next-Gen OPIR Polar, $0.9 billion for Poland IBCS, and $0.8 billion for certain military ammunition programs.\nDuring 2024, the company reduced unfunded backlog by $1.6 billion and $0.7 billion related to terminations for convenience in our restricted space business and on the NGI program at Space Systems, respectively.\nLIQUIDITY AND CAPITAL RESOURCES\nWe are focused on the efficient conversion of operating income into cash to provide for the company’s material cash requirements, including working capital needs, satisfaction of contractual commitments, funding of our pension and OPB plans, investment in our business through capital expenditures, and shareholder return through dividend payments and share repurchases. \nAs of December 31, 2024, we had cash and cash equivalents of $4.4 billion; $268 million was held outside of the U.S. by foreign subsidiaries. We expect cash and cash equivalents and cash generated from operating activities, supplemented by borrowings under credit facilities, commercial paper and/or in the capital markets through our shelf registration with the SEC, if needed, to be sufficient to provide liquidity to the company in the short-term and long-term. The company has a five-year senior unsecured credit facility in an aggregate principal amount of $2.5 billion, and in April 2024, we renewed our one-year $500 million uncommitted credit facility. At December 31, 2024, there were no borrowings outstanding under these credit facilities. In January 2024, we issued $2.5 billion of unsecured senior notes for general corporate purposes, including debt repayment, share repurchases and working capital.\nThe company’s principal contractual commitments include purchase obligations, repayments of long-term debt and related interest, and payments under operating leases. At December 31, 2024, we had $20.5 billion of purchase obligations, approximately half of which is short-term. Purchase obligations are largely comprised of open purchase \n-38-\nNORTHROP GRUMMAN CORPORATION\n                        \norder commitments to suppliers and subcontractors under U.S. government contracts. In most circumstances, our risk associated with the purchase obligations on our U.S. government contracts is limited to the termination liability provisions within those contracts. As such, we do not believe they represent a material liquidity risk to the company. At December 31, 2024, we had capital expenditure commitments of $1.5 billion, which we expect to satisfy with cash on hand. We also had provisions for uncertain tax positions of $1.4 billion, some or all of which could result in future cash payments to various taxing authorities. At this time, we are unable to estimate the timing and amount of any future cash outflows related to these uncertain tax positions. \nRefer to the respective notes to the consolidated financial statements for further information about our share repurchase programs (Note 2), commercial paper, credit facilities and long-term debt (Note 9), standby letters of credit and guarantees (Note 11), future minimum contributions for the company’s pension and OPB plans (Note 12), and lease payment obligations (Note 14). \nIncome Tax Matters\nDuring the fourth quarter of 2024, the company entered into an agreed Revenue Agent’s Report (“RAR”) for certain matters related to the company’s 2018-2020 federal income tax returns, largely related to our methods of accounting associated with the timing of revenue recognition and related costs under IRC Section 451(b). The company made a $956 million payment in December 2024, inclusive of associated interest, in connection with the agreed RAR. Refer to Note 6 to the financial statements for further information about our unrecognized tax benefits.\nBeginning in 2022, the Tax Cuts and Jobs Act of 2017 (“TCJA”) eliminated the option to deduct research and development expenditures in the current year and requires taxpayers to amortize them over five years pursuant to IRC Section 174. Our 2024 and 2023 cash from operations were reduced for federal estimated tax payments we made related to Section 174 of approximately $350 million and $500 million, respectively. In the future, Congress may consider legislation that would defer the amortization requirement to later years, possibly with retroactive effect. In the meantime, we expect to continue to make additional federal tax payments based on the current Section 174 tax law, which we estimate will reduce our 2025 cash from operations by approximately $230 million. The impact of Section 174 on our cash from operations depends on the amount of research and development expenditures incurred by the company and whether the IRS issues guidance on the provision which differs from our current interpretation, among other things.\nCash Flow Measures\nIn addition to our cash position, we consider various cash flow measures in capital deployment decision-making, including cash provided by operating activities and adjusted free cash flow, a non-GAAP measure described in more detail below.\nOperating Cash Flow\nThe table below summarizes key components of cash provided by operating activities:\n \nYear Ended December 31\n$ in millions\n2024\n2023\n2022\nNet earnings\n$\n4,174\n \n$\n2,056 \n$\n4,896 \nB-21 charge\n—\n \n1,559 \n— \nNon-cash items\n(1)\n8\n \n551 \n(1,305)\nPension and OPB contributions\n(129)\n(139)\n(136)\nChanges in trade working capital\n274\n \n(144)\n(600)\nOther, net\n61\n \n(8)\n46 \nNet cash provided by operating activities\n$\n4,388\n \n$\n3,875 \n$\n2,901 \n(1)\nIncludes depreciation and amortization, non-cash lease expense, MTM benefit (expense), stock based compensation expense, deferred income taxes and net periodic pension and OPB income.\n2024 cash provided by operating activities increased $513 million, or 13 percent, principally due to improved trade working capital, largely driven by lower net tax payments, as well as higher net earnings.\nAdjusted Free Cash Flow\nAdjusted free cash flow, as reconciled in the table below, is a non-GAAP measure defined as net cash provided by or used in operating activities, less capital expenditures, plus proceeds from the sale of equipment to a customer (not otherwise included in net cash provided by or used in operating activities) and the after-tax impact of discretionary pension contributions, if any. Adjusted free cash flow includes proceeds from the sale of equipment to a customer as \n-39-\nNORTHROP GRUMMAN CORPORATION\n                        \nsuch proceeds were generated in a customer sales transaction. It also includes the after-tax impact of discretionary pension contributions for consistency and comparability of financial performance. This measure may not be defined and calculated by other companies in the same manner. We use adjusted free cash flow as a key factor in our planning for, and consideration of, acquisitions, the payment of dividends and stock repurchases. This non-GAAP measure may be useful to investors and other users of our financial statements as a supplemental measure of our cash performance, but should not be considered in isolation, as a measure of residual cash flow available for discretionary purposes, or as an alternative to operating cash flows presented in accordance with GAAP.\nThe table below reconciles net cash provided by operating activities to adjusted free cash flow:\nYear Ended December 31\n% Change in\n$ in millions\n2024\n2023\n2022\n2024\n2023\nNet cash provided by operating activities\n$\n4,388\n \n$\n3,875 \n$\n2,901 \n13\n \n%\n34 \n%\nCapital expenditures\n(1,767)\n(1,775)\n(1,435)\n—\n \n%\n24 \n%\nProceeds from sale of equipment to a customer\n—\n \n— \n155 \nNM\n(100)\n%\nAdjusted free cash flow\n$\n2,621\n \n$\n2,100 \n$\n1,621 \n25\n \n%\n30 \n%\n2024 adjusted free cash flow increased $521 million, or 25 percent, principally due to higher net cash provided by operating activities.\nInvesting Cash Flow\n2024 net cash used in investing activities increased $167 million principally due to the receipt of proceeds from the sale of minority investments in the prior year.\nFinancing Cash Flow\n2024 net cash used in financing activities decreased $366 million primarily due to $1.05 billion of lower debt repayments and a $500 million increase in proceeds from long-term debt, partially offset by a $1.0 billion increase in share repurchases and a $70 million increase in dividends paid. Cash returned to shareholders through share repurchases and dividends totaled $3.7 billion in 2024 and $2.6 billion in 2023.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur consolidated financial statements are prepared in conformity with GAAP, which requires us to make estimates and assumptions about future events that affect the amounts reported in our consolidated financial statements. We employ judgment in making our estimates in consideration of historical experience, currently available information and various other assumptions that we believe to be reasonable under the circumstances. Actual results could differ from our estimates and assumptions, and any such differences could be material to our consolidated financial statements. We believe the following accounting policies are critical to the understanding of our consolidated financial statements and require the use of significant management judgment in their application. For a summary of our significant accounting policies, see Note 1 to the consolidated financial statements.\nRevenue Recognition\nDue to the long-term nature of our contracts, we generally recognize revenue over time using the cost-to-cost method, which requires us to make reasonably dependable estimates regarding the revenue and cost associated with the design, manufacture and delivery of our products and services.\nContract sales may include estimates of variable consideration, including cost or performance incentives (such as award and incentive fees), un-priced change orders, REAs and contract claims. Variable consideration is included in total estimated sales to the extent it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur when the uncertainty associated with the variable consideration is subsequently resolved. We estimate variable consideration as the most likely amount to which we expect to be entitled.\nOur cost estimation process is based on the professional knowledge of our engineering, program management and financial professionals, and draws on their significant experience and judgment. We prepare EACs for our contracts and calculate an estimated contract profit based on total estimated contract sales and cost. Since our contracts often span a period of several years, estimation of revenue, cost, and progress toward completion requires the use of judgment. Factors considered in these estimates include our historical performance, the availability, productivity and cost of labor, the nature and complexity of work to be performed, the effect of change orders, availability and cost of materials, components and subcontracts, the effect of any delays in performance and the level of indirect cost allocations. \n-40-\nNORTHROP GRUMMAN CORPORATION\n                        \nWe also consider the impact of macroeconomic factors on our estimates, in particular on contract EACs that span several years. For example, we have included in our EACs management’s best estimate of the impact inflation and disruptions in the supply chain have had and may continue to have on our contracts. Although the overall financial impact these macroeconomic factors have had on our company has largely subsided, volatility of the recent macroeconomic environment has added complexity to our estimation process and may result in our contract EACs having more variability in the future than they might otherwise have had if the estimates had been prepared in a more stable macroeconomic environment.\nWe generally review and reassess our sales, cost and profit estimates for each significant contract at least annually or more frequently as determined by the occurrence of events, changes in circumstances and evaluations of contract performance to reflect the latest reliable information available. These assessments require judgments and estimates that can be affected by any number of these factors over time, which may cause actual results to differ materially from those estimates as facts and circumstances change or become known to us.\nThe company performs on a broad portfolio of long-term contracts, including the development of complex and customized military platforms and systems, as well as advanced electronic equipment and software, that often include technology at the forefront of science. Cost estimates on fixed-price development contracts and early-stage/low-rate production contracts are inherently more uncertain as to future events than on mature, full-rate production contracts. As a result, there is typically more variability in those estimates and greater financial risk associated with unanticipated cost growth on fixed-price development contracts and early-stage/low-rate production contracts. Changes in estimates occur for a variety of reasons, including changes in contract scope, the resolution of risk at lower or higher cost than anticipated, unanticipated performance and other risks affecting contract costs, performance issues with subcontractors or suppliers, changes in indirect cost allocations, such as overhead and G&A costs, and changes in estimated award and incentive fees. Identified risks typically include technical, schedule and/or performance risk based on our evaluation of the contract effort. Similarly, the changes in estimates may include changes in, or resolution of, identified opportunities for operating margin improvement.\nFor the impacts of changes in estimates on our consolidated statements of earnings and comprehensive income, see “Segment Operating Results” and Note 1 to the consolidated financial statements.\nRetirement Benefits\nOverview\n – The determination of projected benefit obligations, the fair value of plan assets, and pension and OPB expense for our retirement benefit plans requires the use of estimates and actuarial assumptions. We perform an annual review of our actuarial assumptions in consultation with our actuaries. When we determine changes in the assumptions are warranted, or as a result of plan amendments, future pension and OPB expense and our projected benefit obligation could increase or decrease materially. The principal estimates and assumptions that have a significant effect on our consolidated financial position and results of operations are the discount rate, cash balance crediting rate, expected long-term rate of return on plan assets, estimated fair market value of plan assets, and the mortality rate of those covered by our pension and OPB plans. The effects of actual results differing from our assumptions and the effects of changing assumptions (i.e., actuarial gains or losses) are recognized immediately through earnings upon annual remeasurement in the fourth quarter, or on an interim basis as triggering events warrant remeasurement. \nDiscount Rate\n – The discount rate represents the interest rate used to determine the present value of future cash flows currently expected to be required to settle our pension and OPB obligations. The discount rate is generally based on the yield of high-quality corporate fixed-income investments. At the end of each year, we determine the discount rate using a theoretical bond portfolio model of bonds rated AA or better to match the notional cash outflows related to projected benefit payments for each of our significant benefit plans. Taking into consideration the factors noted above, our weighted-average composite pension discount rate was 5.73 percent at December 31, 2024 and 5.15 percent at December 31, 2023.\n-41-\nNORTHROP GRUMMAN CORPORATION\n                        \nThe effects of a hypothetical change in the discount rate may be nonlinear and asymmetrical for future years as the discount rate changes. Holding all other assumptions constant, an increase or decrease of 25 basis points in the December 31, 2024 discount rate assumption would have the following estimated effects on 2024 pension and OPB obligations, which would be reflected in the 2024 MTM expense (benefit), and 2025 expected pension and OPB expense:\n$ in millions\n25 Basis Point Decrease in Rate\n25 Basis Point Increase in Rate\n2024 pension and OPB obligation and MTM expense (benefit)\n$\n785 \n$\n(750)\n2025 pension and OPB (benefit) expense\n(20)\n19 \nCash Balance Crediting Rate\n – A portion of the company’s pension obligation and resulting pension expense is based on a cash balance formula, where participants’ hypothetical account balances are accumulated over time with pay-based credits and interest. Interest is credited monthly using the current 30-Year Treasury bond rate. The interest crediting rate is part of the cash balance formula and independent of actual pension investment returns. The cash balance crediting rate tends to move in concert with the discount rate but has an offsetting effect on pension benefit obligations and the related MTM expense (benefit). The minimum cash balance crediting rate allowed under the plan is 2.25 percent. The cash balance crediting rate assumption has been set to its current level of 4.78 percent as of December 31, 2024, increasing to 4.90 percent by 2030. Holding all other assumptions constant, an increase or decrease of 25 basis points in the December 31, 2024 cash balance crediting rate assumption would have the following estimated effects on the 2024 pension benefit obligation, which would be reflected in the 2024 MTM (benefit) expense, and 2025 expected pension expense:\n$ in millions\n25 Basis Point Decrease in Rate\n25 Basis Point Increase in Rate\n2024 pension obligation and MTM (benefit) expense\n$\n(101)\n$\n104 \n2025 pension (benefit) expense\n(9)\n9 \nExpected Long-Term Rate of Return on Plan Assets –\n The expected long-term rate of return on plan assets (EROA) assumption reflects the average rate of net earnings we expect on current and future benefit plan investments. EROA is a long-term assumption, which we review annually and adjust to reflect changes in our long-term view of expected market returns and/or significant changes in our plan asset investment policy. Due to the inherent uncertainty of this assumption, we consider multiple data points at the measurement date including the plan’s target asset allocation, historical plan asset returns and third-party projection models of expected long-term returns for each of the plans’ strategic asset classes. In addition to the data points themselves, we consider trends in the data points, including changes from the prior measurement date. The EROA assumptions we use for pension benefits are consistent with those used for OPB plans; however, we reduce the EROA for OPB plans to allow for the impact of tax on investment earnings, as certain Voluntary Employee Beneficiary Association trusts are taxable.\nDuring 2024, the Investment Committee of the company’s benefit plans reviewed the plans’ major asset class allocations and approved an update to increase the target fixed-income asset allocation from 43% to 45%. The actual asset allocation as of December 31, 2024 was approximately 41% fixed-income, 29% public equities, 23% alternatives, 6% private credit and 1% cash. At this time, the Investment Committee is not planning any significant changes to that mix. For further information on plan asset investments, see Note 12 to the consolidated financial statements.\nWhile historical market returns are not necessarily predictive of future market returns, given our long history of plan performance supported by the stability in our investment mix, investment managers, and active asset management, we believe our actual historical performance is a reasonable metric to consider when developing our EROA. Our average annual rate of return from 1976 to 2024 was approximately 10.5 percent and our 20-year and 30-year rolling average rates of return were approximately 7.5 percent and 8.9 percent, respectively, each determined on an arithmetic basis and net of expenses. Our 2024 return on plan assets, net of expenses, was approximately 4.7 percent.\nConsistent with our past practice, we obtained long-term capital market forecasting models from several third parties and, using our target asset allocation, developed an expected rate of return on plan assets from each model. We \n-42-\nNORTHROP GRUMMAN CORPORATION\n                        \nconsidered not only the specific returns projected by those third-party models, but also changes in the models year-to-year when developing our EROA.\nFor determining 2024 FAS expense, we assumed an expected long-term rate of return on pension plan assets of 7.5 percent and an expected long-term rate of return on OPB plan assets of 7.12 percent. For 2025 FAS expense, we have assumed an expected long-term rate of return on pension plan assets of 7.5 percent and 7.08 percent on OPB plans. Holding all other assumptions constant, an increase or decrease of 25 basis points in our December 31, 2024 EROA assumption would have the following estimated effects on 2025 expected pension and OPB expense:\n$ in millions\n25 Basis Point Decrease\n25 Basis Point Increase\n2025 pension and OPB expense (benefit)\n$\n75 \n$\n(75)\nIn addition, holding all other assumptions constant, an increase or decrease of 100 basis points in actual versus expected return on plan assets would have the following estimated effects on our 2025 MTM expense (benefit):\n$ in millions\n100 Basis Point Decrease\n100 Basis Point Increase \n2025 MTM expense (benefit)\n$\n300 \n$\n(300)\nEstimated Fair Market Value of Plan Assets\n – For certain plan assets where the fair market value is not readily determinable, such as real estate, private equity, hedge funds and opportunistic investments, we develop estimates of fair value using the best information available. Estimated fair values on these plan assets are based on redemption values and net asset values (NAV), as well as valuation methodologies that include third-party appraisals, comparable transactions, discounted cash flow valuation models and public market data.\nMortality Rate \n– We use mortality assumptions to estimate life expectancies of plan participants. In October 2014, the Society of Actuaries Retirement Plans Experience Committee (RPEC) issued updated mortality tables and a mortality improvement scale, which reflected longer life expectancies than previously projected. In October 2019, the RPEC issued an updated mortality base table (the Private Retirement Plans Mortality table for 2012 (Pri-2012)), which we adopted after reviewing our own historical mortality experience. In October 2021, the RPEC released a new projection scale (MP-2021) that included additional underlying data for 2019, which included an increase in life expectancies relative to the prior year.\nThe RPEC has not released a projection scale since MP-2021, citing complexities in incorporating the substantial number of “excess deaths” in 2020 and 2021 into their existing model and uncertainties about future expectations primarily related to COVID-19. As such, after considering the information released by the RPEC in October 2021 as well as the company’s recent mortality experience, we adopted the full MP-2021 projection scale while continuing to use the Pri-2012 White Collar table, supplemented with 50% of the Gradual Wear-Off illustration as outlined in the RPEC’s 2022 Mortality Improvement Update paper to reflect the future impacts of COVID-19, to develop our mortality assumptions used in calculating our pension and OPB obligations recognized at December 31, 2024, and the amounts estimated for our 2025 pension and OPB expense.\nFor further information regarding our pension and OPB plans, see “Risk Factors” and Notes 1 and 12 to the consolidated financial statements.\nLitigation, Commitments and Contingencies\nWe are subject to a range of claims, disputes, enforcement actions, investigations, lawsuits, overhead cost claims, environmental matters, income tax matters and administrative proceedings that arise in the ordinary course of business. Estimating liabilities and costs associated with these matters requires judgment based upon the professional knowledge and experience of management. We determine whether to record a reserve and, if so, what amount based on consideration of the facts and circumstances of each matter as then known to us. Determinations regarding whether to record a reserve and, if so, of what amount, reflect management’s assessment regarding what is likely to occur; they do not necessarily reflect what management believes should occur. The ultimate resolution of any such exposure to us may vary materially from earlier estimates as further facts and circumstances develop or become known to us.\nEnvironmental Matters\n – We are subject to environmental laws and regulations in the jurisdictions in which we do or have done business. Factors that could result in changes to the assessment of probability, range of reasonably estimated costs and environmental accruals include: modification of planned remedial actions; changes in the estimated time required to conduct remedial actions; discovery of more or less extensive (or different) contamination \n-43-\nNORTHROP GRUMMAN CORPORATION\n                        \nthan anticipated; information regarding the potential causes and effects of contamination; results of efforts to involve other responsible parties; financial capabilities of other responsible parties; changes in laws and regulations, their interpretation or application; contractual obligations affecting remediation or responsibilities; and improvements in remediation technology. As we expect to recover a significant portion of environmental remediation liabilities through overhead charges on government contracts, such amounts are deferred in prepaid expenses and other current assets (current portion) and other non-current assets until charged to contracts. We use judgment to evaluate the recoverability of our environmental remediation costs, assessing, among other things, U.S. government regulations, our U.S. government contract mix and past practices. Portions of the company’s environmental liabilities we do not expect to be recoverable have been expensed. As of December 31, 2024, we expect approximately 93 percent of the company’s environmental remediation costs to be recoverable; however, to the extent our judgments on the recoverability of our environmental remediation costs change or the unallowable portion of our environmental remediation costs otherwise increase, there could be a significant impact on our consolidated financial position, annual results of operations and/or cash flows.\nIncome Tax Matters \n– The evaluation of tax positions taken in a filed tax return, or planned to be taken in a future tax return or claim, requires the use of judgment. We establish reserves for uncertain tax positions when, despite the belief that our tax positions are supportable, there remains uncertainty in a tax position taken in our filed tax returns or planned to be taken in a future tax return or claim. The company follows a recognition and measurement approach, considering the facts, circumstances, and information available at the reporting date. We exercise judgment in determining the level of evidence necessary and appropriate to support our assessment using all available information. The technical merits of a given tax position are derived from sources of authority in the tax law and their applicability to the facts and circumstances of the position. In measuring the tax position, the company considers the amounts and probabilities of the outcomes that could be realized upon settlement. When it is more likely than not that a tax position will be sustained, we record the largest amount of tax benefit with a greater than 50 percent likelihood of being realized upon ultimate settlement with a taxing authority. As of December 31, 2024, we have approximately $1.4 billion in unrecognized tax benefits. To the extent we prevail in matters for which reserves have been established or are required to pay amounts in excess of reserves, there could be a significant impact on our consolidated financial position, annual results of operations and/or cash flows.\nFor further information on litigation, commitments and contingencies, see “Risk Factors” and Note 1, Note 6, Note 10 and Note 11 to the consolidated financial statements.\nGoodwill and Long-Lived Assets\nOverview\n – We allocate the purchase price of acquired businesses to the underlying tangible and intangible assets acquired and liabilities assumed based upon their respective fair values, with the excess recorded as goodwill. Such fair value assessments require judgments and estimates that can be affected by contract performance and other factors over time, which may cause final amounts to differ materially from original estimates. Adjustments to the fair value of purchased assets and liabilities after the initial measurement period are recognized in net earnings.\nWe record property, plant and equipment (PP&E) for capital assets used in operating our business. The cost of PP&E utilized in support of our government contracts is generally allowable and allocable cost in accordance with applicable FAR and CAS requirements, which limits our risk of impairment on those assets. However, the cost of PP&E utilized in support of our commercial business, including approximately $575 million of PP&E used in our commercial space business, is not allocable to government contracts and is therefore subject to greater recoverability risk.\nImpairment Testing\n – We test for impairment of goodwill annually at each of our reporting units, which comprise our operating segments. The results of our annual goodwill impairment tests as of December 31, 2024 and 2023, respectively, indicated that the estimated fair value of each reporting unit significantly exceeded its respective carrying value. There were no impairment charges recorded in the years ended December 31, 2024, 2023 and 2022.\nIn addition to performing an annual goodwill impairment test, we may perform an interim impairment test if events occur or circumstances change that suggest goodwill in any of our reporting units may be impaired. Such indicators may include, but are not limited to, the loss of significant business, significant reductions in federal government appropriations or other significant adverse changes in industry or market conditions. During 2024, we determined there were no impairment indicators requiring us to perform an interim goodwill impairment test.\nWhen testing goodwill for impairment, we compare the fair values of each of our reporting units to their respective carrying values. To determine the fair value of our reporting units, we primarily use the income approach based on the cash flows we expect the reporting units to generate in the future, consistent with our operating plans. This income valuation method requires management to project sales, operating expenses, working capital, capital \n-44-\nNORTHROP GRUMMAN CORPORATION\n                        \nspending and cash flows for the reporting units over a multi-year period, as well as to determine the weighted-average cost of capital (WACC) used as a discount rate and terminal value assumptions. The WACC takes into account the relative weights of each component of our consolidated capital structure (equity and debt) and represents the expected cost of new capital adjusted as appropriate to consider lower risk profiles associated with longer-term contracts and barriers to market entry. The terminal value assumptions are applied to the final year of the discounted cash flow model. We use industry multiples (including relevant control premiums) of operating earnings to corroborate the fair values of our reporting units determined under the market valuation method of the income approach.\nWe test for impairment of our long-lived assets when events or changes in circumstances indicate that the carrying amount of these assets may not be recoverable. Our assessment is based on our projection of the undiscounted future operating cash flows of the related asset group. If such projections indicate that future undiscounted cash flows are not sufficient to recover the carrying amount, we recognize a non-cash impairment charge to reduce the carrying amount to fair value. There were no impairment charges recorded in the years ended December 31, 2024, 2023 and 2022.\nImpairment assessment inherently involves management judgments as to assumptions about expected future cash flows and the impact of market conditions on those assumptions. Due to the many variables inherent in developing the estimates used in our impairment analyses, differences in assumptions may have a material effect on the results of those impairment analyses.\n-45-\nNORTHROP GRUMMAN CORPORATION",
  "item2": null
}