{
  "source_file": "now-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.     MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nThe following discussion and analysis of our financial condition, results of operations and cash flows should be read in conjunction with the (1) unaudited condensed consolidated financial statements and the related notes thereto included elsewhere in this Quarterly Report on Form 10-Q, and (2) the audited consolidated financial statements and notes thereto and management’s discussion and analysis of financial condition and results of operations for the year ended December 31, 2024 included in the Annual Report on Form 10-K filed with the Securities and Exchange Commission (the “SEC”), on January 30, 2025. This Quarterly Report on Form 10-Q contains “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These statements are often identified by the use of words such as “may,” “will,” “expect,” “believe,” “anticipate,” “intend,” “could,” “estimate,” or “continue,” and similar expressions or variations. Forward-looking statements are subject to risks, uncertainties and other factors that could cause actual results and the timing of certain events to differ materially from future results expressed or implied by the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to those identified herein, and those discussed in the section titled “Risk Factors” in Part I, Item 1A of our Annual Report on Form 10-K filed with the SEC on January 30, 2025 and in Part II, Item 1A of this Quarterly Report on Form 10-Q and in our other SEC filings. We disclaim any obligation to update any forward-looking statements to reflect events or circumstances after the date of such statements. \nInvestors and others should note that we announce material financial information to our investors using our investor relations website (https://www.servicenow.com/company/investor-relations.html), SEC filings, press releases, public conference calls and webcasts. We use these channels, as well as social media, to communicate with our investors and the public about our Company, our services and other issues. It is possible that the information we post on social media could be deemed to be material information. Therefore, we encourage investors, the media and others interested in our Company to review the information we post on the social media channels listed on our investor relations website.\nOur free cash flow and non-GAAP consolidated income from operations measures included in the section entitled “Key Business Metrics—Free Cash Flow,” and “Key Business Metrics—Non-GAAP Consolidated Income from Operations” are not in accordance with U.S. Generally Accepted Accounting Principles (“GAAP”). These non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. These measures may be different from non-GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. We encourage investors to carefully consider our results under GAAP, as well as our supplemental non-GAAP results, to more fully understand our business.\n \nOverview\nServiceNow was founded on a simple premise: to make work flow better. Our intelligent platform, the Now Platform, is a cloud-based solution that helps enterprises and organizations across public and private sectors digitize workflows, in line with our purpose of making the world work better for everyone. Our workflow applications built on the Now Platform are organized along four primary areas: Technology, CRM and Industry, Core Business and Creator. The Now Platform is the AI platform for digital transformation. Transformations enabled by the Now Platform rapidly automate business processes across an entire enterprise by seamlessly connecting disparate departments, systems and silos to unlock productivity and improve experiences for both employees and customers.\nWe are closely monitoring the ongoing conflicts in Russia/Ukraine and the Middle East. While these events are still evolving and the outcomes remain highly uncertain, we do not believe these conflicts will have a material impact on our business and results of operations. However, if the conflicts continue or worsen, leading to greater global economic disruptions and uncertainty, our business and results of operations could be materially impacted. Our customers in these regions represented an immaterial portion of our net assets as of September 30, 2025 and December 31, 2024, and of our total consolidated revenues for each of the three and nine months ended September 30, 2025 and 2024.\n22\nTable of Contents\nAdditionally, other macroeconomic events, including interest rates, global inflation, the U.S. government shutdown and tariffs, have led to economic uncertainty in the global economy. To mitigate risk, our cash and cash equivalents are distributed across several large financial institutions and are not concentrated in one financial institution. We have not experienced any impact to our liquidity or to our current and projected business operations and financial condition due to recent macroeconomic events. Further, we have policy restrictions on the types of securities that can be purchased as part of our available-for-sale debt securities portfolio. These restrictions take industry and company concentration limits into consideration among other things. We will continue to monitor the direct and indirect impact of macroeconomic events on our business and financial results. \nSee the “Risk Factors” section in Part I, Item 1A of our Annual Report on Form 10-K filed with the SEC on January 30, 2025 for further discussion of the possible impact of conflicts and macroeconomic events on our business and financial results.\nKey Business Metrics\nRemaining performance obligations.\n Transaction price allocated to remaining performance obligations (“RPO”) represents contracted revenue that has not yet been recognized, which includes deferred revenue and non-cancellable amounts that will be invoiced and recognized as revenue in future periods. RPO excludes contracts that are billed in arrears, such as certain time and materials contracts, as we apply the “right to invoice” practical expedient under relevant accounting guidance. Current remaining performance obligations (“cRPO”) represents RPO that will be recognized as revenue in the next 12 months. \nAs of September 30, 2025, our RPO was $24.3 billion, of which 47% represented cRPO. RPO and cRPO increased by 24% and 21%, respectively, compared to September 30, 2024. Factors that may cause our RPO to vary from period to period include the following:\n•\nForeign currency exchange rates\n. While a majority of our contracts have historically been in U.S. Dollars, an increasing percentage of our contracts in recent periods has been in foreign currencies, particularly the Euro and British Pound Sterling. Fluctuations in foreign currency exchange rates as of the balance sheet date will cause variability in our RPO.\n•\nMix of offerings\n. In a minority of cases, we allow our customers to host our software by themselves or through a third-party service provider. In self-hosted offerings, we recognize a portion of the revenue upfront upon the delivery of the software and as a result, such revenue is excluded from RPO.\n \n•\nSubscription start date\n. From time to time, we enter into contracts with a subscription start date in the future and these amounts are included in RPO if such contracts are signed by the balance sheet date. \n \n•\nTiming of contract renewals\n. While customers typically renew their contracts at the end of the contract term, from time to time, customers may do so either before or after the scheduled expiration date. For example, in cases where we are successful in selling additional products or services to an existing customer, a customer may decide to renew its existing contract early to ensure that all its contracts expire on the same date. In other cases, prolonged negotiations or other factors may result in a contract not being renewed until after it has expired.\n•\nContract duration\n. While we typically enter into multi-year subscription services, the duration of our contracts varies. Further, we continue to see an increase in the number of 12-month agreements entered into with the U.S. federal government throughout the year, with the highest number of agreements entered into in the quarter ended September 30, driven primarily by timing of their annual budget expenditures. We sometimes also enter into contracts with durations that have a 12-month or shorter term to enable the contracts to co-terminate with the existing contract. The contract duration will cause variability in our RPO. \n23\nTable of Contents\nNumber of customers with ACV greater than $5 million.\n We count the total number of customers with annual contract value (“ACV”) greater than $5 million as of the end of the period. We had 553 and 469 customers with ACV greater than $5 million as of September 30, 2025 and 2024, respectively. For purposes of customer count, a customer is defined as an entity that has a unique Dunn & Bradstreet Global Ultimate (“GULT”) Data Universal Numbering System (“DUNS”) number and an active subscription contract as of the measurement date. The DUNS number is a global standard for business identification and tracking. We make exceptions for holding companies, government entities and other organizations for which the GULT, in our judgment, does not accurately represent the ServiceNow customer. For example, while all U.S. government agencies roll up to “Government of the United States” under the GULT, we count each government agency that we contract with as a separate customer. Our customer count is subject to adjustments for acquisitions, spin-offs and other market activity; accordingly, we restate previously disclosed number of customers with ACV greater than $5 million calculations to allow for comparability. ACV is calculated based on the foreign exchange rate in effect at the time the contract was signed. Foreign exchange rate fluctuations could cause some variability in the number of customers with ACV greater than $5 million. We believe information regarding the total number of customers with ACV greater than $5 million provides useful information to investors because it is an indicator of our growing customer base and demonstrates the value customers are receiving from the Now Platform. \nFree cash flow.\n We define free cash flow, a non-GAAP financial measure, as GAAP net cash provided by operating activities plus cash outflows for legal settlements and business combination and other related costs including compensation expense, reduced by purchases of property and equipment. Purchases of property and equipment are otherwise included in cash used in investing activities under GAAP. We believe information regarding free cash flow provides useful information to investors because it is an indicator of the strength and performance of our business operations. However, our calculation of free cash flow may not be comparable to similar measures used by other companies. A calculation of free cash flow is provided below: \nNine Months Ended September 30,\n% Change\n2025\n2024\n(dollars in millions)\nGAAP net cash provided by operating activities\n$\n3,206 \n$\n2,632 \n22%\nPurchases of property and equipment\n(630)\n(599)\n5%\nBusiness combination and other related costs\n28 \n22 \n27%\nNon-GAAP free cash flow\n$\n2,604 \n$\n2,055 \n27%\nWe have historically seen higher collections in the quarter ended March 31 due to seasonality in timing of entering into customer contracts, which is significantly higher in the quarter ended December 31. Additionally, we have historically seen higher disbursements in the quarters ended March 31 and September 30 due to payouts under our annual commission plans, purchases under our employee stock purchase plan, payouts under our bonus plans and coupon payments related to our 2030 Notes.\nNon-GAAP consolidated income from operations. \nNon-GAAP consolidated income from operations is identified as an additional measure of profit or loss. This non-GAAP measure is used by the chief operating decision maker to allocate resources and assess performance. We define non-GAAP consolidated income from operations as income from operations excluding certain non-cash or non-recurring items, including stock-based compensation expense, amortization of purchased intangibles, legal settlements, business combination and other related costs including compensation expense, impairment of assets and severance costs. We believe these adjustments provide useful supplemental information to investors and facilitate the analysis of our operating results and comparison of those results across reporting periods. The following table shows the reconciliation of our reported consolidated income from operations to non-GAAP consolidated income from operations.\n24\nTable of Contents\nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n(dollars in millions)\n(dollars in millions)\nGAAP income from operations\n$\n572 \n$\n418 \n37%\n$\n1,381 \n$\n990 \n39%\nStock-based compensation\n492 \n426 \n15%\n1,461 \n1,292 \n13%\nAmortization of purchased intangibles\n33 \n23 \n43%\n79 \n71 \n11%\nBusiness combination and other related costs\n19 \n5 \n280%\n44 \n30 \n47%\nImpairment of assets\n— \n— \n—%\n30 \n— \n100%\nSeverance costs\n24 \n— \n100%\n53 \n— \n100%\nNon-GAAP income from operations \n$\n1,140 \n$\n872 \n31%\n$\n3,048 \n$\n2,383 \n28%\nRenewal rate.\n We calculate our renewal rate by subtracting our attrition rate from 100%. Our attrition rate for a period is equal to the ACV from customers lost during the period, divided by the sum of (i) the total ACV from all customers that renewed during the period, excluding changes in price or users, and (ii) the total ACV from all customers lost during the period. Accordingly, our renewal rate is calculated based on ACV and is not based on the number of customers that have renewed. Further, our renewal rate does not reflect increased or decreased purchases from our customers to the extent such customers are not lost customers or lapsed renewals. A lost customer is a customer that did not renew an expiring contract and that, in our judgment, will not be renewed. Typically, a customer that reduces its subscription upon renewal is not considered a lost customer. However, in instances where the subscription decrease represents the majority of the customer’s ACV, we may deem the renewal as a lost customer. For our renewal rate calculation, we define a customer as an entity with a separate production instance of our service and an active subscription contract as of the measurement date, instead of an entity with a unique GULT or DUNS number. We adjust our renewal rate for acquisitions, consolidations and other customer events that cause the merging of two or more accounts occurring at the time of renewal. Our renewal rate was 97% for the three months ended September 30, 2025 and 98% for the nine months ended September 30, 2025 and each of the three and nine months ended September 30, 2024. As our renewal rate is impacted by the timing of renewals, which could occur in advance of, or subsequent to the original contract end date, period-to-period comparison of renewal rates may not be meaningful.\nComponents of Results of Operations\n \nRevenues\nSubscription revenues\n. Subscription revenues are primarily comprised of fees that give customers access to the ordered subscription service for both self-hosted offerings and cloud-based subscription offerings, and related standard and enhanced support and updates, if any, to the subscription service during the subscription term. For our cloud-based offerings, we recognize revenue ratably over the subscription term. For self-hosted offerings, a substantial portion of the sales price is recognized upon delivery of the software, which may cause greater variability in our subscription revenues and subscription gross margin. Pricing includes multiple instances, hosting and support services, data backup and disaster recovery services, as well as future updates, when and if available, offered during the subscription term. We typically invoice our customers for subscription fees in annual increments upon execution of the initial contract or subsequent renewal. Our contracts are generally non-cancellable during the subscription term, though a customer can terminate for breach if we materially fail to perform. \nProfessional services and other revenues\n. Our arrangements for professional services are primarily on a time-and-materials basis, and we generally invoice our customers monthly in arrears for the professional services based on actual hours and expenses incurred. Some of our professional services arrangements are on a fixed fee basis. Professional services revenues are recognized as services are delivered. Other revenues primarily consist of fees from customer training delivered on-site or through publicly available classes. Typical payment terms require our customers to pay us within 30 days of invoice. \nWe sell our subscription services primarily through our direct sales organization. We also sell services through managed service providers and resale partners. We also generate revenues from certain professional services and from training of customers and partner personnel, through both our direct team and indirect sales channel. Revenues from our direct sales organization represented 78% of our total revenues for each of the three and nine months ended September 30, 2025 and 2024. For purposes of calculating revenues from our direct sales organization, revenues from systems integrators and managed services providers are included as part of the direct sales organization.\n25\nTable of Contents\nSeasonality\n. We have historically experienced seasonality in terms of when we enter into customer agreements. We sign a significantly higher percentage of agreements with new customers, as well as expansion with existing customers, in the fourth quarter of each year. The increase in customer agreements for the fourth quarter is primarily a result of both large enterprise account buying patterns typical in the software industry, which are driven primarily by the expiration of annual authorized budgeted expenditures, and the terms of our commission plans, which incentivize our direct sales organization to meet their annual quotas by December 31. Furthermore, we usually sign a significant portion of these agreements during the last month, and often the last two weeks, of each quarter. This seasonality of entering into customer agreements is sometimes not immediately apparent in our revenues, due to the fact that we recognize subscription revenues from our cloud offering contracts over the term of the subscription agreement, which is generally 12 to 36 months. In addition, we continue to see an increase in the number of 12-month agreements entered into with the U.S. federal government throughout the year, with the highest number of agreements entered into in the third quarter driven primarily by the timing of their annual budget expenditures. This larger mix of contracts with 12-month renewal terms in the third quarter will generally cause variability in our RPO and cRPO in subsequent quarters until they are renewed. Although these seasonal factors may be common in the technology industry, historical patterns should not be considered a reliable indicator of our future sales activity or performance. \nCost of Revenues\nCost of subscription revenues\n. Cost of subscription revenues consists primarily of expenses related to hosting our services and providing support to our customers. These expenses are comprised of data center capacity costs, which include colocation costs associated with our data centers as well as interconnectivity between data centers, depreciation related to our infrastructure hardware equipment dedicated for customer use, amortization of intangible assets, expenses associated with software, public cloud service costs, IT services and dedicated customer support, personnel-related costs directly associated with data center operations and customer support, including salaries, benefits, bonuses and stock-based compensation and allocated overhead.\nCost of professional services and other revenues\n. Cost of professional services and other revenues consists primarily of personnel-related costs directly associated with our professional services and training departments, including salaries, benefits, bonuses and stock-based compensation, the costs of contracted third-party partners, travel expenses and allocated overhead.\nProfessional services are performed directly by our services team, as well as by contracted third-party partners. Fees paid by us to third-party partners are primarily recognized as cost of revenues as the professional services are delivered. Cost of revenues associated with our professional services engagements contracted with third-party partners as a percentage of professional services and other revenues was 33% for each of the three and nine months ended September 30, 2025 and 27% and 21% for the three and nine months ended September 30, 2024, respectively.\nSales and Marketing\nSales and marketing expenses consist primarily of personnel-related expenses directly associated with our sales and marketing staff, including salaries, benefits, bonuses and stock-based compensation. Sales and marketing expenses also include the amortization of commissions paid to our sales employees, including related payroll taxes and fringe benefits. In addition, sales and marketing expenses include branding expenses, marketing program expenses, which include events such as Knowledge, and costs associated with purchasing advertising and marketing data, software and subscription services dedicated for sales and marketing use and allocated overhead.\nResearch and Development\n \nResearch and development expenses consist primarily of personnel-related expenses directly associated with our research and development staff, including salaries, benefits, bonuses, stock-based compensation and allocated overhead. Research and development expenses also include data center capacity costs, costs associated with outside services contracted for research and development purposes and depreciation of infrastructure hardware equipment that is used solely for research and development purposes. \n \nGeneral and Administrative\n \nGeneral and administrative expenses consist primarily of personnel-related expenses for our executive, finance, legal, human resources, facilities and administrative personnel, including salaries, benefits, bonuses, stock-based compensation, external legal, accounting and other professional services fees, other corporate expenses, amortization of intangible assets and allocated overhead.\n26\nTable of Contents\n \nProvision for Income Taxes\nProvision for income taxes consists of federal, state and foreign income taxes. Our income tax provision for the three and nine months ended September 30, 2025 is primarily attributable to the mix of earnings and losses in countries with differing statutory tax rates, offset by excess tax benefits of stock-based compensation. We continue to maintain a valuation allowance against our California deferred tax assets due to the uncertainty regarding realizability of these deferred tax assets as they have not met the “more likely than not” realization criteria, particularly as we expect research and development tax credit generation to exceed our ability to use the credits in future years.\nComparison of the Three and Nine Months Ended September 30, 2025 and 2024 \n \nRevenues\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nRevenues:\nSubscription\n$\n3,299 \n$\n2,715 \n22%\n$\n9,417 \n$\n7,780 \n21%\nProfessional services and other\n108 \n82 \n32%\n293 \n247 \n19%\nTotal revenues\n$\n3,407 \n$\n2,797 \n22%\n$\n9,710 \n$\n8,027 \n21%\nPercentage of revenues:\nSubscription\n97%\n97%\n97%\n97%\nProfessional services and other\n3%\n3%\n3%\n3%\nTotal\n100%\n100%\n100%\n100%\nSubscription revenues increased by $584 million and $1,637 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily driven by increased purchases by new and existing customers. Included in subscription revenues is $104 million and $81 million of revenues recognized upfront from the delivery of software associated with self-hosted offerings during the three months ended September 30, 2025 and 2024, respectively, and $370 million and $275 million during the nine months ended September 30, 2025 and 2024, respectively.\nWe expect subscription revenues for the year ending December 31, 2025 to increase in absolute dollars and remain relatively flat as a percentage of revenue as we continue to add new customers and existing customers increase their usage of our products compared to the year ended December 31, 2024.\nOur expectations for revenues, cost of revenues and operating expenses for the remainder of 2025 are based on the 30-day average of foreign exchange rates for September 30, 2025.\nProfessional services and other revenues increased by $26 million and $46 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to an increase in services and trainings provided to new and existing customers.\nWe expect professional services and other revenues for the year ending December 31, 2025 to increase in absolute dollars and to remain relatively flat as a percentage of revenue compared to the year ended December 31, 2024.\n27\nTable of Contents\nCost of Revenues and Gross Profit Percentage\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nCost of revenues:\nSubscription\n$\n666 \n$\n496 \n34%\n$\n1,852 \n$\n1,406 \n32%\nProfessional services and other\n108 \n88 \n23%\n297 \n250 \n19%\nTotal cost of revenues\n$\n774 \n$\n584 \n33%\n$\n2,149 \n$\n1,656 \n30%\nGross profit (loss) percentage:\nSubscription\n80%\n82%\n80%\n82%\nProfessional services and other\n—%\n(7%)\n(1%)\n(1%)\nTotal gross profit percentage\n77%\n79%\n78%\n79%\nGross profit\n$\n2,633 \n$\n2,213 \n$\n7,561 \n$\n6,371 \nCost of subscription revenues increased by $170 million and $446 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to increased headcount and increased costs to support the growth of our subscription offerings including costs to support customers in regulated markets. Personnel-related costs, including stock-based compensation and overhead expenses, increased by $77 million and $221 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024. Depreciation expense related to infrastructure hardware equipment and expenses associated with software, maintenance, third-party cloud services and other costs, which together support the expansion of data center capacity, increased by $75 million and $201 million, respectively, for the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024.\nWe expect our cost of subscription revenues for the year ending December 31, 2025 to increase in absolute dollars as we provide subscription services to more customers and increase usage within our customer instances and increase slightly as a percentage of revenue compared to the year ended December 31, 2024. We will continue to incur incremental costs to attract customers in regulated markets by adopting public cloud offerings as well as increased support for customers impacted by new and evolving data residency requirements. To the extent future acquisitions are consummated, our cost of subscription revenues may increase due to additional non-cash charges associated with the amortization of intangible assets acquired.\nOur subscription gross profit percentage was 80% for each of the three and nine months ended September 30, 2025 and 82% for each of the three and nine months ended September 30, 2024. We expect our subscription gross profit percentage to decrease slightly for the year ending December 31, 2025 compared to the year ended December 31, 2024.\nCost of professional services and other revenues increased by $20 million and $47 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily driven by an increase in partner ecosystem spend to further help accelerate customer value realization.\nOur professional services and other gross loss percentage improved to break-even for the three months ended September 30, 2025 compared to 7% for the three months ended September 30, 2024, primarily driven by timing of professional services engagements, resulting in increased partner and internal utilization. Our professional services and other gross loss percentage was 1% for each of the nine months ended September 30, 2025 and 2024. We expect our professional services and other gross loss percentage to increase for the year ending December 31, 2025 compared to the year ended December 31, 2024.\n28\nTable of Contents\nSales and Marketing\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nSales and marketing\n$\n1,056 \n$\n944 \n12%\n$\n3,238 \n$\n2,827 \n15%\nPercentage of revenues\n31%\n34%\n33%\n35%\nSales and marketing expenses increased by $112 million and $411 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to increased headcount resulting in an increase in personnel-related costs including stock-based compensation and overhead expenses of $71 million and $274 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024. Amortization expenses associated with deferred commissions increased by $21 million and $49 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to an increase in contracts with new customers, expansion and renewal contracts. Other sales and marketing program expenses, which include branding, costs associated with purchasing advertising, marketing events and market data, increased by $7 million and $50 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to increased program costs and travel costs for our annual Knowledge user conference.\nWe expect sales and marketing expenses for the year ending December 31, 2025 to increase in absolute dollars and to decrease as a percentage of revenue compared to the year ended December 31, 2024, as we continue to see leverage from increased sales productivity and marketing efficiencies.\nResearch and Development\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nResearch and development\n$\n750 \n$\n626 \n20%\n$\n2,187 \n$\n1,875 \n17%\nPercentage of revenues\n22%\n22%\n23%\n23%\nResearch and development (“R&D”) expenses increased by $124 million and $312 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to increased headcount, resulting in an increase in personnel-related costs including stock-based compensation and overhead expenses of $112 million and $280 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024.\nWe expect R&D expenses for the year ending December 31, 2025 to increase in absolute dollars but remain relatively flat as a percentage of revenue compared to the year ended December 31, 2024, as we continue to improve the existing functionality of our services, develop new applications to fill market needs and enhance our core platform.\nGeneral and Administrative\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nGeneral and administrative\n$\n255 \n$\n225 \n13%\n$\n755 \n$\n679 \n11%\nPercentage of revenues\n7%\n8%\n8%\n8%\n \n29\nTable of Contents\nGeneral and administrative (“G&A”) expenses increased by $30 million and $76 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to increased headcount, resulting in an increase in personnel-related costs, including stock-based compensation and an increase in outside services. The remaining increase for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 was due to impairment of assets of $30 million.\nWe expect G&A expenses for the year ending December 31, 2025 to increase in absolute dollars and to remain relatively flat as a percentage of revenue compared to the year ended December 31, 2024, as we continue to see leverage from continued G&A productivity.\nStock-based Compensation\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nCost of revenues:\nSubscription\n$\n78 \n$\n64 \n22%\n$\n222 \n$\n184 \n21%\nProfessional services and other\n11 \n11 \n—%\n33 \n35 \n(6%)\nOperating expenses:\nSales and marketing\n141 \n144 \n(2%)\n444 \n419 \n6%\nResearch and development\n203 \n150 \n35%\n584 \n479 \n22%\nGeneral and administrative\n59 \n57 \n4%\n178 \n175 \n2%\nTotal stock-based compensation\n$\n492 \n$\n426 \n15%\n$\n1,461 \n$\n1,292 \n13%\nPercentage of revenues\n14%\n15%\n15%\n16%\nStock-based compensation increased by $66 million and $169 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily due to additional grants to current and new employees.\nStock-based compensation is inherently difficult to forecast due to fluctuations in our stock price. Based upon our stock price as of September 30, 2025, we expect stock-based compensation to continue to increase in absolute dollars for the year ending December 31, 2025 as we continue to issue stock-based awards to our employees, but decrease slightly as a percentage of revenue compared to the year ended December 31, 2024. We expect stock-based compensation as a percentage of revenue to decline over time as we continue to grow.\nForeign Currency Exchange\nOur international operations have provided and will continue to provide a significant portion of our total revenues. Revenues outside North America represented 37% of total revenues for each of the three and nine months ended September 30, 2025 and 36% and 37% for the three and nine months ended September 30, 2024, respectively.\nWe primarily transact in certain foreign currencies for sales outside of the United States. The movement of the U.S. Dollar had an immaterial impact on our revenues for the three and nine months ended September 30, 2025.\nIn addition, we primarily transact in several foreign currencies for cost of revenues and operating expenses outside of the United States. The movement of the U.S. Dollar had an immaterial impact on our expenses for the three and nine months ended September 30, 2025.\n30\nTable of Contents\nInterest Income\nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n(dollars in millions)\n(dollars in millions)\nInterest income\n$\n115 \n$\n108 \n6%\n$\n346 \n$\n313 \n11%\nPercentage of revenues\n3%\n4%\n4%\n4%\nInterest income increased by $7 million and $33 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, primarily driven by an increase in investment income from our managed portfolio resulting from higher portfolio balances.\nOther Income (Expense), net\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nInterest expense\n$\n(6)\n$\n(6)\n—%\n$\n(18)\n$\n(18)\n—%\nOther\n13 \n(4)\n(425%)\n11 \n(10)\n(210%)\n Other income (expense), net\n$\n7 \n$\n(10)\n(170%)\n$\n(7)\n$\n(28)\n(75%)\nPercentage of revenues\n—%\n—%\n—%\n—%\nOther income increased by $17 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 and other expense decreased by $21 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, primarily driven by unrealized gains on strategic investments.\nTo mitigate our risks associated with fluctuations in foreign currency exchange rates, we enter into foreign currency forward contracts with maturities of 12 months or less to hedge a portion of our net outstanding monetary assets and liabilities. These hedging contracts may reduce, but cannot entirely eliminate, the impact of adverse currency exchange rate movements. The gains recognized for foreign currency forward contracts from derivatives not designated as hedging instruments in other income (expense), net of $100 million, primarily offset the remeasurement losses of the related foreign currency denominated assets and liabilities of $114 million for the nine months ended September 30, 2025. The gains (losses) recognized for foreign currency forward contracts from derivatives not designated as hedging instruments were immaterial for the three months ended September 30, 2025 and each of the three and nine months ended September 30, 2024.\nProvision for Income Taxes\n \nThree Months Ended September 30,\n% Change\nNine Months Ended September 30,\n% Change\n2025\n2024\n2025\n2024\n \n(dollars in millions)\n \n(dollars in millions)\nIncome before income taxes\n$\n694 \n$\n516 \n34%\n$\n1,720 \n$\n1,275 \n35%\nProvision for income taxes\n$\n192 \n$\n84 \n129%\n$\n373 \n$\n234 \n59%\nEffective tax rate\n28%\n16%\n22%\n18%\nOur income tax provision was $192 million and $373 million for the three and nine months ended September 30, 2025, respectively, and $84 million and $234 million for the three and nine months ended September 30, 2024, respectively. The income tax provision was primarily attributable to the mix of earnings and losses in countries with differing statutory tax rates, offset by excess tax benefits of stock-based compensation.\nOn July 4, 2025, H.R. 1, the \"One Big Beautiful Bill Act,\" was enacted into law, bringing significant amendments to the U.S. tax code. This legislation extends and modifies provisions from the 2017 Tax Cuts and Jobs Act and introduces new tax \n31\nTable of Contents\nmeasures affecting both businesses and individuals. The enacted legislation had an immaterial impact on the Company’s effective tax rate for the three months ended September 30, 2025. The Company will continue to monitor any future changes in its business or interpretations of the new tax law that could affect its tax position in subsequent periods. \nLiquidity and Capital Resources\nWe generate cash inflows from operations primarily from selling subscription services which are generally paid in advance of provisioning services, and expend cash outflows to develop new services and core technologies that further enhance the Now Platform, engage our customers and enhance their experience, and enable and transform our business operations. Subscription services arrangements typically have a three-year duration, and we have experienced an average renewal rate of 98% over the last three years. Cash outflows from operations are principally comprised of salaries, bonuses, commissions, and benefits for our workforce, licenses and services arrangements, including cloud services that are integral to our business operations and data centers and operating lease arrangements that underlie our facilities. We have generated positive operating cash flows for more than ten years as we continue to grow our business in pursuit of our business strategy, and we expect to grow our business and generate positive cash flows from operations during 2025. When assessing sources of liquidity, we also include cash and cash equivalents, marketable securities and long-term marketable securities totaling $9.7 billion as of September 30, 2025. \nOur capital requirements are principally comprised of capital expenditures to support data center capacity expansion, non-contract workforce salaries, bonuses, commissions and benefits and, to a lesser extent, cancellable and non-cancellable licenses, operating leases and services arrangements that are integral to our business operations. We also acquire technology and businesses to expand our service offerings and functionality. Operating lease obligations totaling $1,072 million are principally associated with leased facilities and have varying maturities with $672 million due over the next five years.\nOur supply chain finance (“SCF”) program provides suppliers with the opportunity to sell their receivables due from us to a global financial institution. A supplier’s election to receive early payment at a discounted amount from the financial institution does not change the amount that we must remit to the financial institution on our payment date, which is generally 90 days from the invoice date. As of September 30, 2025, our outstanding payment obligations to suppliers participating in the SCF program totaled $32 million. These obligations are included in accounts payable in our condensed consolidated balance sheets, and all activity related to these obligations is presented within operating activities in the condensed consolidated statements of cash flows.\nWe may repurchase our shares of common stock in the open market, in privately negotiated transactions or by other means, with the objective to return value to our stockholders and manage the dilution from future employee equity grants and employee stock purchase programs. In May 2023, our board of directors authorized a program to repurchase up to $1.5 billion of our common stock and authorized an additional $3.0 billion in repurchases under the program in January 2025. During the three and nine months ended September 30, 2025, the Company repurchased 0.6 million and 1.3 million shares of our common stock for $584 million and $1,243 million, respectively. All repurchases were made in open market transactions. Repurchases of common stock are recognized as treasury stock and held for future issuance. As of September 30, 2025, approximately $2.0 billion of the authorized amount under the share repurchase program remained available for future repurchases.\nWe have also issued long-term debt to finance our business. In August 2020, we issued 1.40% fixed rate ten-year notes with an aggregate principal amount of $1.5 billion due on September 1, 2030 (the “2030 Notes”). \nOur operating cash flows, together with our other sources of liquidity, are available to service our liabilities as well as our cancellable and non-cancellable arrangements. We anticipate cash flows generated from operations, cash, cash equivalents, marketable securities and long-term marketable securities will be sufficient to meet our liquidity needs for at least the next 12 months. As we look beyond the next 12 months, we seek to continue to grow cash flows necessary to fund our operations and grow our business. If we require additional capital resources, we may seek to finance our operations from the current funds available or additional equity or debt financing.\n32\nTable of Contents\n \nNine Months Ended September 30,\n2025\n2024\n \n(dollars in millions)\nNet cash provided by operating activities\n$\n3,206 \n$\n2,632 \nNet cash used in investing activities\n$\n(1,191)\n$\n(1,763)\nNet cash used in financing activities\n$\n(1,601)\n$\n(872)\nNet increase (decrease) in cash, cash equivalents and restricted cash\n$\n424 \n$\n(11)\nOperating Activities\nNet cash provided by operating activities was $3,206 million for the nine months ended September 30, 2025 compared to $2,632 million for the nine months ended September 30, 2024. The net increase in operating cash flows was primarily due to higher collections driven by revenue growth.\nInvesting Activities\n \nNet cash used in investing activities was $1,191 million for the nine months ended September 30, 2025 compared to $1,763 million for the nine months ended September 30, 2024. The net decrease in cash used in investing activities was primarily due to a $1,619 million decrease in net purchases of marketable securities, partially offset by a $871 million increase in purchases of strategic investments, a $133 million increase in business combinations and a $31 million increase in purchases of property and equipment.\nFinancing Activities\n \nNet cash used in financing activities was $1,601 million for the nine months ended September 30, 2025 compared to $872 million for the nine months ended September 30, 2024. The net increase in cash used in financing activities is due to an increase in repurchases of common stock of $843 million and a $103 million increase in taxes paid related to net share settlement of equity awards, offset by a $184 million decrease in business combination related to the second installment payment in the acquisition of G2K Group GmbH and a $33 million increase in proceeds from employee stock plans.\nCritical Accounting Policies and Significant Judgments and Estimates\nThere have been no significant changes to our critical accounting policies and estimates as described in our Annual Report on Form 10-K for the year ended December 31, 2024, which was filed with the SEC on January 30, 2025."
}