{
  "item1": "NRG Energy, Inc., NRG Company, leading energy smart home company fueled market-leading brands, proprietary technologies complementary sales channels. Across U.S. Canada, NRG delivers innovative, sustainable solutions, predominately under brand names such NRG, Reliant, Direct Energy, Green Mountain Energy Vivint, while also advocating competitive energy markets customer choice. Company customer base includes approximately 8 million residential customers (comprised 6 million retail energy customers 2 million smart home customers) addition commercial, industrial, wholesale customers, supported approximately 13 GW generation December 31, 2024.",
  "item7": "Item 7 — Management's Discussion Analysis Financial Condition Results Operations discussion analysis below been organized follows: Executive Summary, including business environment which Company operates, discussion regulation, weather, competition other factors affect business, other significant events important understanding results operations financial condition; Results operations years ended December 31, 2024 December 31, 2023, including explanation significant differences between periods specific line items NRG's Consolidated Statements Operations; Liquidity capital resources including liquidity position, financial condition addressing credit ratings, material cash requirements commitments, other obligations; Critical accounting estimates most important both portrayal Company's financial condition results operations, require management's most difficult, subjective, complex judgments. Beginning third quarter 2024, Company recording amortization capitalized contracts costs within depreciation amortization. change, along additional financial statement disclosures, meant address investor inquiries enhancing transparency easier match expenses revenues. Company previously recorded amortization capitalized contract costs related fulfillment cost operations amortization capitalized contract costs related customer acquisition primarily selling, general administrative costs consolidated statements operations.",
  "item2": "During nine months ended September 30, 2025, Company completed $971 million share repurchases average price $119.78 per share. Through October 31, 2025, additional $129 million share repurchases executed average price $167.41 per share. October 16, 2025, Board Directors authorized additional share repurchase program up $3.0 billion, executed through 2028. See Note 9, Changes Capital Structure additional discussion."
}