{
  "source_file": "nrg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2 — MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThe discussion and analysis below has been organized as follows:\n•\nExecutive summary, including introduction and overview, business strategy, and changes to the business environment during the period, including environmental and regulatory matters; \n•\nKnown trends that may affect NRG's results of operations and financial condition in the future;\n•\nResults of operations; and\n•\nLiquidity and capital resources including liquidity position, financial condition addressing credit ratings, material cash requirements and commitments, and other obligations.\nAs you read this discussion and analysis, refer to NRG's condensed consolidated statements of operations to this Form 10-Q, which present the results of operations for the three and nine months ended September 30, 2025 and 2024. Also refer to NRG's 2024 Form 10-K, which includes detailed discussions of various items impacting the Company's business, results of operations and financial condition, including: General section; Strategy section; Business Overview section, including how regulation, weather, and other factors affect NRG's business; and Critical Accounting Estimates section. \nExecutive Summary\nIntroduction and Overview \nNRG Energy, Inc., or NRG or the Company, is a leading energy and smart home company powering a brighter, smarter future. The Company provides gas, electricity, and smart home solutions to approximately 8 million residential customers (comprised of 6 million retail energy customers and 2 million smart home customers) in addition to large commercial and industrial, hyperscaler, and wholesale customers. Across the U.S. and Canada, NRG is redefining customer’s experience with energy under brand names such as NRG, Reliant, Direct Energy, Green Mountain Energy, and Vivint. As of September 30, 2025, the Company’s core power and natural gas business consists of approximately 12 GW of competitive power generation, primarily in Texas, and a natural gas portfolio that serves approximately 1,800 MMDth annually.\nStrategy\nNRG's strategy is to maximize shareholder value by being a leader in the emerging convergence of energy and smart automation in the home and business. Through a diversified supply strategy, the Company sells reliable electricity and natural gas to its customers in the markets it serves, while also providing innovative home solutions to customers. NRG's unique combination of assets and capabilities enables the Company to develop and sell highly differentiated offerings that bring together every day essential services like powering and securing the home through a seamless and integrated experience. This strategy is intended to enable the Company to optimize its unique integrated platform to delight customers, generate recurring cash flow, significantly strengthen earnings and cost competitiveness, and lower risk and volatility. Sustainability is a philosophy that underpins NRG's strategy and facilitates value creation across NRG's business.\nTo effectuate the Company’s strategy, NRG is focused on: (i) serving the energy needs of end-use residential, commercial and industrial, and wholesale counterparties in competitive markets and optimizing on additional revenue opportunities through its multiple brands and channels; (ii) offering a variety of energy products and smart home products and services that are differentiated by innovative features, premium service, integrated platforms, sustainability, and loyalty/affinity programs; (iii) excellence in operating performance of its assets; (iv) achieving the optimal mix of supply to serve its customer load requirements through a diversified supply strategy; and (v) engaging in disciplined and transparent capital allocation.\nEnergy Regulatory Matters \nThe Company’s regulatory matters are described in the Company’s 2024 Form 10-K in Item 1, Business — \nRegulatory Matters.\n These matters have been updated below and in Note 15, \nRegulatory Matters.\nAs participants in wholesale and retail energy markets and owners and operators of power plants, certain NRG entities are subject to regulation by various federal and state government agencies. These include the CFTC, FERC, NRC and the PUCT, as well as other public utility commissions in certain states where NRG's generation or distributed generation assets are located. In addition, NRG is subject to the market rules, procedures and protocols of the various ISO and RTO markets in which it participates. Likewise, certain NRG entities participating in the retail markets are subject to rules and regulations established by the states and provinces in which NRG entities are licensed to sell at retail. NRG must also comply with the mandatory reliability requirements imposed by NERC and the regional reliability entities in the regions where NRG operates.\nNRG's operations within the ERCOT footprint are not subject to rate regulation by FERC, as they are deemed to operate solely within the ERCOT market and not in interstate commerce. These operations are subject to regulation by the PUCT.\n47\n                                                        \n                                                                            \nState and Provincial Energy Regulation\nMaryland Legislation\n — On May 9, 2024, Maryland Governor Wes Moore signed Senate Bill 1 into law, which restricts the competitive retail electric and natural gas market in Maryland, affecting residential customers but not commercial and industrial customers. Key provisions of the law took effect on January 1, 2025. The legislation imposes a price cap on residential contracts tied to a trailing 12-month historical average of utility rates, with only a limited exception for renewable power products. Renewable products must now have their price pre-approved by the Maryland Public Service Commission and source their renewable electricity certificates from within the PJM region. The law also requires that any variable-price contract not contain a change in price more than once a year, except time-of-use contracts, and limits contract terms to 12 months. It requires affirmative consent for the renewal of customer contracts for renewable power products. The law also imposes licensing requirements on energy salespeople. While the law states that it does not impair existing contracts, the Maryland Public Service Commission has ruled that grandfathering of existing contracts will end as of December 31, 2025, and that suppliers must issue separate bills for their charges for all new and renewing contracts as of January 1, 2025. On October 1, 2024, Green Mountain Energy Company, NRG’s renewable electricity provider, along with a retail trade association to which NRG belongs, filed a lawsuit in federal court challenging the constitutionality of Senate Bill 1. On November 18, 2024, the trial court denied the plaintiffs' motion for a preliminary injunction. The plaintiffs, including Green Mountain, filed an appeal to this denial in the Fourth Circuit Court of Appeals and oral argument occurred on October 24, 2025.\nRegional Regulatory Developments\nNRG is affected by rule/tariff changes that occur in the ISO regions. For further discussion on regulatory developments, see Item 1 — Note 15, \nRegulatory Matters\n, to the condensed consolidated financial statements.\nERCOT/PUCT\nPublic Utility Commission of Texas’s Actions with Respect to Wholesale Pricing and Market Design — \nThe PUCT continues to analyze and implement multiple options for promoting increased reliability in the wholesale electric market, including the adoption of a reliability standard for resource adequacy and market-based mechanisms to achieve this standard. The Commission adopted a reliability standard that became effective in September 2024.\nIn 2023, the Texas Legislature authorized implementation of the Performance Credit Mechanism (\"PCM\"), which will measure real-time contribution to system reliability and provide compensation for resources to be available, subject to certain \"guardrails\" such as an absolute annual net cost cap, as part of its adoption of the PUCT Sunset Bill (House Bill 1500). In December 2024, the PUCT decided to shelve implementation of the PCM for the time being. The Texas Legislature also directed the PUCT to implement additional market design changes such as the creation of a new ancillary service called Dispatchable Reliability Reserve Service (\"DRRS\") to further increase ERCOT's capability to manage net load variability and firming requirements for new generation resources which penalize poor performance during periods of low grid reserves. The PUCT directed ERCOT to implement DRRS as a standalone product which will delay implementation until 2026 or 2027. Both DRRS and a firming requirement are currently in the design phase with final rules yet to be adopted.\nTexas Energy Fund — \nThrough Senate Bill 2627, the Texas Legislature created the TEF, which received voter approval in November 2023, and will provide grants and low-interest loans (3%) to incentivize the development of more dispatchable generation and smaller backup generation in ERCOT. The PUCT adopted a rule in March 2024, which establishes the application and participation requirements and the process by which the TEF loan proceeds for dispatchable generation in ERCOT will be distributed. The initial window for submitting loan applications was opened on June 1, 2024 and closed on July 27, 2024. NRG, through its subsidiaries, filed for loan proceeds for three separate projects, totaling more than 1,500 MWs of capacity. The PUCT also adopted a rule for the completion bonus grant program in April 2024, which provides for opportunities for grants of $120,000 per MW for dispatchable generation projects interconnected before June 1, 2026, or $80,000 per MW for dispatchable generation projects interconnected on or after June 1, 2026 but before June 1, 2029, subject to performance requirements. In January 2025, the PUCT began accepting applications for completion bonus grants, and NRG, through its subsidiaries, has filed applications for each of the three projects referenced above. The 89th Texas Legislature passed Senate Bill 2268, which separated the 10,000 MW collective cap on the ERCOT loan and grant programs resulting in a 10,000 MW cap for the loan program and a separate 10,000 MW cap for the completion bonus grant program.\nOn August 29, 2024, the PUCT approved an initial portfolio of projects to move into a due diligence process with its third-party administrator. T.H. Wharton was among the projects selected to move into due diligence. On December 12, 2024, the PUCT approved the Cedar Bayou 5 project to move into due diligence. On March 13, 2025, the PUCT approved the Greens Bayou 6 project to move into due diligence. Greens Bayou 6 is projected to become commercially operational in mid-2028.\nOn July 31, 2025, the Company entered into the First TEF loan to support the development of T.H. Wharton, which is currently under construction. Commercial operation of the 415 MW facility is expected mid-2026.\nOn September 26, 2025, the Company entered into the Second TEF loan to support the development of Cedar Bayou 5, which is currently under construction. Commercial operation of the 689 MW combined cycle facility is expected mid-2028.\n48\n                                                        \n                                                                            \nReal-time Co-optimization of Energy and Ancillary Services (“RTC”)\n — ERCOT is progressing with a multi-year project to upgrade its systems to co-optimize the dispatch of energy and ancillary services in real-time. The RTC project will also replace the Operating Reserve Demand Curve with demand curves for each ancillary service product which will act as the primary scarcity pricing mechanism when energy or ancillary services are in shortage. ERCOT has commenced market trials for testing the RTC project which began in Spring 2025 and will continue through Fall 2025 with production to go-live on December 5, 2025.\nSenate Bill 6 (“SB 6”) \n— On June 20, 2025, the Governor of Texas signed SB 6 into law, which includes various provisions that concern how both ERCOT, transmission and distribution utilities, and power generation companies plan for and serve large loads (defined as 75 MWs and above) in the ERCOT market. SB 6 requires load forecasting by requiring criteria for inclusion into the forecast and by requiring financial commitments upon a request for a large load customer seeking interconnection to begin engineering studies. In addition, SB 6 includes processes by which large loads should be required or incentivized to curtail their operations. At the same time, SB 6 establishes a PUCT regulatory procedure to minimize potential reliability and stranded-cost impacts that may be associated with new large load co-locations with power generators that were interconnected to ERCOT and operating as stand-alone generators as of September 1, 2025. Generators connected to the grid after this date are exempt from this procedure. Finally, SB 6 requires the PUCT to investigate revising the cost allocation and rate design that governs the ERCOT transmission system. PUCT rulemaking is in progress.\nPJM\nCapacity Market Litigation and Reforms \n— On September 27, 2024, various public interest organizations filed a complaint at FERC against PJM seeking changes to the treatment of RMRs in the capacity market. On November 18, 2024, various state consumer advocates filed a complaint at FERC against PJM seeking revisions to several aspects of PJM’s capacity market, including requiring resources previously subject to categorical exemptions to participate in capacity auctions, longer notice periods for deactivating generating resources, and several other changes. On December 9, 2024, PJM submitted a filing at FERC proposing various capacity market updates regarding the treatment of qualifying resources that are retained under RMR agreements as capacity, retention of a dual-fuel fired combustion turbine plant as the reference resource, and updates to the Non-Performance Charge based on the RTO Net CONE for the 2026/2027 and 2027/2028 Delivery Years. On February 14, 2025, FERC approved PJM’s filings. One party filed a request for rehearing, and on August 8, 2025, FERC issued an order on the rehearing request. \nOn December 13, 2024, PJM filed tariff changes to add provisions enabling a one-time reliability-based expansion of the eligibility criteria for PJM’s interconnection process intended to allow a limited number of additional resources to participate in an upcoming interconnection queue. On February 11, 2025, FERC approved PJM’s filing. Multiple parties filed requests for rehearing, and on July 28, 2025, FERC issued an order on the rehearing requests. \nOn December 20, 2024, PJM submitted tariff changes that propose to require all Existing Generation Capacity Resources to offer into the capacity auctions beginning with the 2026/2027 Delivery Year as well as certain enhancements to the Market Seller Offer Cap. On February 20, 2025, FERC approved PJM’s filing. \nOn December 30, 2024, Pennsylvania Governor Josh Shapiro and the Commonwealth of Pennsylvania filed a complaint at FERC alleging that PJM’s demand curve cap is unjust and unreasonable. The December 30, 2024 complaint was dismissed by FERC on April 21, 2025 in light of a joint stipulation filed by Pennsylvania Governor Shapiro and PJM on February 14, 2025. On February 20, 2025, PJM submitted proposed revisions to its tariff to establish a price cap and a price floor for the auctions for 2026/2027 and 2027/2028 delivery years. Two parties filed requests for rehearing, and on September 30, 2025, FERC issued an order on the rehearing requests.\nConsumer Advocates Complaint \n— On April 14, 2025, various state consumer advocates filed a complaint with FERC asking FERC to reprice the 2025/2026 PJM capacity auction results. If FERC were to grant the request, the capacity prices for the 2025/2026 delivery year would be expected to change. The complaint is pending at FERC.\nIndian River RMR Proceeding\n — On June 29, 2021, Indian River notified PJM that it intended to retire Unit 4. PJM identified reliability violations resulting from the proposed deactivation of Unit 4. The Company filed a cost based RMR rate schedule at FERC. The Company reached settlement with a number of the intervening parties and the settlement agreement was filed. On January 16, 2025, FERC issued an order approving the settlement agreement. Indian River Unit 4 retired on February 23, 2025. On May 19, 2025, Maryland Office of People’s Counsel filed an appeal to the Fourth Circuit Court of Appeals of FERC’s denial on its request for rehearing. On August 22, 2025, NRG filed a motion to transfer venue. The appeal is pending.\nRevisions to PJM Locational Deliverability Area (\"LDA\") Reliability Requirement\n — The Base Residual Auction (\"BRA\") for the 2024/2025 delivery year commenced on December 7, 2022 and closed on December 13, 2022. On December 19, 2022, PJM announced that it would delay the publication of the auction results. On December 23, 2022, PJM made a filing at FERC to revise the definition of LDA Reliability Requirement in the Tariff. This would allow PJM to exclude certain resources from the calculation of the LDA Reliability Requirement. On February 21, 2023, FERC accepted PJM's filing. \n49\n                                                        \n                                                                            \nMultiple parties, including NRG, filed for rehearing. Rehearing was denied by operation of law, and multiple parties, including the Company, filed appeals to the Third Circuit Court of Appeals. On March 12, 2024, the court vacated the portion of the FERC orders that allow PJM to apply the LDA Reliability Requirement to the 2024/2025 capacity auction. On March 29, 2024, PJM filed a petition seeking confirmation as to the capacity commitments rules for the 2024/2025 auction. On April 22, 2024, multiple parties filed a complaint seeking to find the revised rate unjust and unreasonable and implement rates consistent with FERC's February 2023 decision, which was denied on July 9, 2024. Those parties filed an appeal to the Court of Appeals for the D.C. Circuit on November 5, 2024. Multiple parties, including NRG, intervened in the appeal and filed an opening brief on July 21, 2025. The petitioners filed a reply brief on August 20, 2025, with oral argument expected to be scheduled by the end of 2025.\nOn May 6, 2024, FERC directed PJM to recalculate the 2024/2025 auction results under the Initial LDA Reliability Requirement rules, and further directed PJM to rerun the Third Incremental Auction. PJM published the revised BRA and Third Incremental Auction results on May 8, 2024 and May 23, 2024, respectively. On June 14, 2024, multiple parties filed appeals to the Third Circuit Court of Appeals seeking review of the May 6, 2024 FERC orders approving PJM's petition to restore the original capacity commitment rules for PJM to recalculate the 2024/2025 BRA and the rerun of the 2024/2025 BRA. As a result, the price of capacity for the 2024/2025 delivery year in the Delmarva Power and Light South zone was higher than originally published. This outcome may change depending upon the disposition of the outstanding complaint and appeals.\nPJM Base Residual Auction Revisions and Delay — \nOn October 13, 2023, PJM made two filings at FERC. In the first filing, PJM proposed revisions to the Market Seller Offer Cap, which FERC rejected on February 6, 2024. The second filing proposed to make changes to PJM’s resource adequacy risk modeling and capacity accreditation processes, which FERC approved, with condition, on January 20, 2024. The approved changes were in effect for the 2025/2026 BRA that occurred in July 2024. In November 2024, at PJM’s request, FERC approved delays to future BRAs.\nOn July 22, 2025, PJM announced the results of its BRA for the 2026/2027 planning year. The price came in at the FERC-approved cap of $329.17/MW-day for the entire PJM footprint of which NRG cleared approximately 1,008 MWs from the Company’s PJM generation fleet. NRG’s expected capacity revenues from the BRA for the 2026/2027 delivery year is approximately $121 million.\nOther Regulatory Matters \nFrom time to time, NRG entities may be subject to examinations, investigations and/or enforcement actions by federal, state and provincial licensing and regulatory agencies and may face the risk of penalties for violation of financial services, consumer protections and other applicable laws and regulations.\nEnvironmental Regulatory Matters\nNRG is subject to numerous environmental laws in the development, construction, ownership and operation of power plants. These laws generally require that governmental permits and approvals be obtained before construction and maintained during operation of power plants. In general, the electric generation industry has faced increasingly stringent requirements regarding air quality, GHG emissions, combustion byproducts, water use and discharge, and threatened and endangered species including several rules promulgated in 2024. In general, future laws are expected to require the addition of emissions controls or other environmental controls or to impose additional restrictions the operations of the Company's facilities including unit retirements or impose obligations related to historic coal ash use, storage and disposal. At the federal level, the President has issued several Executive Orders and the EPA has proposed rules that indicate that the current administration intends to relax or rescind some recently promulgated regulations, which will affect the outcome of the rulemakings and related legal challenges described below. Complying with environmental laws often involves specialized human resources and significant capital and operating expenses, as well as occasionally curtailing operations. NRG decides to invest capital for environmental controls based on the relative certainty of the requirements, an evaluation of compliance options and the expected economic returns on capital.\nSeveral regulations that affect the Company have been and continue to be revised by the EPA, including requirements regarding coal ash, GHG emissions, NAAQS revisions and implementation and effluent limitation guidelines. NRG will evaluate the impact of these regulations as they are revised but cannot fully predict the impact of each until anticipated revisions, legal challenges and reconsiderations are resolved. The Company’s environmental matters are described in the Company’s 2024 Form 10-K in Item 1, Business - \nEnvironmental Matters \nand Item 1A, \nRisk Factors\n. These matters have been updated in Note 16,\n Environmental Matters, \nto the condensed consolidated financial statements of this Form 10-Q and as follows.\nAir\n \nThe CAA and related regulations (as well as similar state and local requirements) have the potential to affect air emissions, operating practices and pollution control equipment required at power plants. Under the CAA, the EPA sets NAAQS \n50\n                                                        \n                                                                            \nfor certain pollutants including SO\n2\n, ozone, and PM2.5. Many of the Company's facilities are located in or near areas that are classified by the EPA as not achieving certain NAAQS (non-attainment areas). The relevant NAAQS may become more stringent. In March 2024, the EPA increased the stringency of the PM2.5 NAAQS. The Company maintains a comprehensive compliance strategy to address continuing and new requirements. Complying with increasingly stringent air regulations could require the installation of additional emissions control equipment at some NRG facilities or retiring of units if installing such controls is not economic. Significant changes to air regulatory programs affecting the Company are described below.\nCPP/ACE Rules \n— The attention in recent years on GHG emissions has resulted in federal and state regulations. In 2019, the EPA promulgated the ACE rule, which rescinded the CPP, which had sought to broadly regulate CO\n2\n emissions from the power sector. On January 19, 2021, the D.C. Circuit vacated the ACE rule (but on February 22, 2021, at the EPA's request, stayed the issuance of the portion of the mandate that would vacate the repeal of the CPP). On June 30, 2022, the U.S. Supreme Court held that the \"generation shifting\" approach in the CPP exceeded the powers granted to the EPA by Congress. On May 9, 2024, the EPA promulgated a rule that repealed the ACE rule and significantly revised the manner in which new combustion-turbine and existing steam EGU's GHG emissions will be regulated including capturing and storing/sequestering CO\n2\n in some instances. This rule has been challenged by numerous parties in the D.C. Circuit including 27 states with 22 states intervening in support of the rule. The D.C. Circuit held oral arguments related to this rule in December 2024. On February 5, 2025, the DOJ filed a motion asking the court to hold proceedings in abeyance while the EPA evaluates the rule. The court granted the motion on February 19, 2025. On June 17, 2025, the EPA proposed to repeal all GHG emission standards for fossil fuel-fired power plants under Section 111 of the CAA. The EPA is proposing to conclude that GHG emissions from domestic fossil fuel-fired EGUs do not contribute to dangerous air pollution at a level sufficient to invoke the EPA’s authority under CAA Section 111. In addition to its primary proposal to repeal all GHG emission standards for the power sector promulgated in both 2015 and 2024, the EPA has included an alternative proposal to repeal just specific portions.\nCSAPR \n— On March 15, 2023, the EPA signed and released a prepublication version of a FIP after earlier having disapproved numerous state plans to address the issue. Several states, including Texas, challenged the EPA's disapproval of their state plans. On May 1, 2023, the U.S. Court of Appeals for the Fifth Circuit stayed the EPA's disapproval of Texas's and Louisiana's state plans, which disapprovals are a condition precedent to the EPA imposing its plan on Texas and Louisiana. On March 25, 2025, the Fifth Circuit upheld the EPA’s disapproval of Texas’s and Louisiana’s state plans but did not address the FIP. On May 9, 2025, Texas and other parties petitioned the Fifth Circuit for a rehearing with the whole court. On June 5, 2023, the EPA promulgated the FIP. On June 27, 2024, the U.S. Supreme Court stayed the FIP in the 11 states where the rule had not already been stayed. On April 14, 2025, the D.C. Circuit granted the EPA’s request to hold the legal challenges in abeyance while the EPA revisits the rule. The Company cannot predict the outcome of the legal challenges to the various state disapprovals and the final rule promulgated on June 5, 2023.\nRegional Haze Proposal\n — In May 2023, the EPA proposed to withdraw the existing Texas Sulfur Dioxide Trading Program and replace it with unit-specific SO\n2 \nlimits for 12 units in Texas to address requirements to improve visibility at National Parks and Wilderness areas. If finalized as proposed, the rule would result in more stringent SO\n2\n limits for two of the Company's coal-fired units in Texas. The Company cannot predict the outcome of this proposal. On October 2, 2025, the EPA published an ANPRM announcing plans to revise the Regional Haze Rule and seeking public input on streamlining the requirements.\nMATS \n—\n \nOn May 7, 2024, the EPA promulgated a final rule that amends the MATS rule by, among other things, increasing the stringency of the filterable particulate matter standard at coal-burning units.\n \nThe deadline for complying with this more stringent standard had been 2027. On April 8, 2025, the President signed a Proclamation that creates a 2-year exemption for compliance beginning on July 8, 2027 and ending on July 8, 2029 for certain coal units including those owned by the Company. Twenty three states have challenged this rule in the D.C. Circuit. On June 17, 2025, the EPA proposed to repeal the majority of the 2024 final rule amending the MATS rule. The outcome of this rulemaking is uncertain. The Company anticipates that the U.S. presidential administration will substantively revise this rule.\nWater\n \nThe Company is required under the Clean Water Act to comply with intake and discharge requirements, requirements for technological controls and operating practices. As with air quality regulations, federal and state water regulations have become more stringent and imposed new requirements.\nELG \n— In 2015, the EPA revised the ELG for Steam Electric Generating Facilities, which imposed more stringent requirements (as individual permits were renewed) for wastewater streams from FGD, fly ash, bottom ash and flue gas mercury control. On October 13, 2020, the EPA amended the 2015 ELG rule by: (i) altering the stringency of certain limits for FGD wastewater; (ii) relaxing the zero-discharge requirement for bottom ash transport water; and (iii) changing several deadlines. In 2021, NRG informed its regulators that the Company intends to comply with the ELG by ceasing combustion of coal by the end of 2028 at its domestic coal units outside of Texas, and installing appropriate controls by the end of 2025 at its two plants that have coal-fired units in Texas. On May 9, 2024, the EPA promulgated a rule that again revises the ELG by, among other things, \n51\n                                                        \n                                                                            \nfurther restricting the discharge of (i) FGD wastewater, (ii) bottom ash transport water, and (iii) combustion residual leachate. The rule was challenged in numerous courts, but the cases were consolidated in the Eighth Circuit of the U.S. Court of Appeals. The outcome of the legal challenges is uncertain. On February 19, 2025, the DOJ filed a motion asking the court to hold proceedings in abeyance while the U.S. presidential administration evaluates the rule, which the court granted. On October 2, 2025, the EPA proposed to amend the ELG by extending deadlines that were part of the 2024 Rule, updating the transfer provisions to allow facilities to switch between compliance alternatives, and creating authority for alternative applicability dates. The EPA also is seeking comment on issues regarding a separate, future rulemaking on the underlying standards.\nByproducts\nIn 2015, the EPA finalized the rule regulating byproducts of coal combustion (e.g., ash and gypsum) as solid wastes under the RCRA. On August 21, 2018, the D.C. Circuit found, among other things, that the EPA had not adequately regulated unlined ponds and legacy surface impoundments. On August 28, 2020, the EPA finalized \"A Holistic Approach to Closure Part A: Deadline to Initiate Closure,\" which amended the April 2015 Rule to address the August 2018 D.C. Circuit decision and extend some of the deadlines. On November 12, 2020, the EPA finalized \"A Holistic Approach to Closure Part B: Alternative Demonstration for Unlined Surface Impoundments,\" which further amended the April 2015 Rule to, among other things, provide procedures for requesting approval to operate existing ash impoundments with an alternate liner. On May 8, 2024, the EPA promulgated a rule that establishes requirements for: (i) inactive (or legacy) surface impoundments at inactive facilities and (ii) CCR management units (regardless of how or when the CCR was placed) at regulated facilities. The rule also creates an obligation to conduct site assessments (at all active and certain inactive facilities) to determine whether CCR management units are present. The rule has been challenged in the D.C. Circuit and the outcome of the legal challenges is uncertain. The Company anticipates that the U.S. presidential administration will revisit this rule.\nDomestic Site Remediation Matters\nUnder certain federal, state and local environmental laws, a current or previous owner or operator of a facility, including an electric generating facility, may be required to investigate and remediate releases or threatened releases of hazardous or toxic substances or petroleum products. NRG may be responsible for property damage, personal injury and investigation and remediation costs incurred by a party in connection with hazardous material releases or threatened releases. These laws impose liability without regard to whether the owner knew of or caused the presence of the hazardous substances, and the courts have interpreted liability under such laws to be strict (without fault) and joint and several. Cleanup obligations can often be triggered during the closure or decommissioning of a facility, in addition to spills during its operations.\nRegional Environmental Developments\nAsh Regulation in Illinois\n — On July 30, 2019, Illinois enacted legislation that required the state to promulgate regulations regarding coal ash at surface impoundments. On April 15, 2021, the state promulgated the implementing regulation, which became effective on April 21, 2021. NRG has applied for initial operating permits and construction permits (for closure and retrofits) as required by the regulation and is waiting for most of its permits to be issued by the Illinois EPA.\nHouston Nonattainment for 2008 Ozone Standard\n — In 2022, the EPA changed the Houston area's classification from Serious to Severe nonattainment for the 2008 Ozone Standard. Accordingly, Texas is required to develop a new control strategy and submit it to the EPA.\nSignificant Events\nThe following significant events have occurred during 2025 as further described within this Management's Discussion and Analysis and the condensed consolidated financial statements:\nAnticipated Acquisition of LSP Portfolio\nOn May 12, 2025, NRG entered into a definitive agreement with LS Power to acquire a power portfolio including 13 GW of natural gas-fired generation facilities and the C&I VPP platform with 6 GW of capacity. The consideration will consist of 24.25 million shares of NRG common stock and $6.4 billion in cash, subject to working capital adjustments as set forth in the purchase agreement. The Company intends to use a portion of the net proceeds from the New Unsecured Notes and the New Secured Notes to partially fund the cash portion of the purchase price of the acquisition of the LSP Portfolio. As part of the transaction, NRG will also assume approximately $3.2 billion of debt. The acquisition is expected to close in the first quarter of 2026, and is subject to the satisfaction or waiver of specified closing conditions, consents and regulatory approvals, including HSR, FERC, DOJ, and NYSPSC. For further discussion, see Note 4, \nAcquisitions and Dispositions.\n52\n                                                        \n                                                                            \nAcquisition of Texas Generation Portfolio\nOn April 10, 2025, the Company acquired all of the ownership interests of six power generation facilities from Rockland Capital, LLC, adding 738 MW of natural gas-fired assets in Texas to its portfolio for $560 million in consideration, less $2 million in working capital adjustments. For further discussion, see Note 4, \nAcquisitions and Dispositions. \nThe Company acquired the following generation facilities:\nName of Facility\nPower Market\nPlant Type\nPrimary Fuel\nLocation\nNet Generation Capacity (MW)\n(a)\n% Owned\nVictoria\nERCOT\nFossil\nNatural Gas\nTX\n290 \n100.0 \n%\nVictoria Port II\nERCOT\nFossil\nNatural Gas\nTX\n92 \n100.0 \n%\nSJRR\nERCOT\nFossil\nNatural Gas\nTX\n89 \n100.0 \n%\nPort Comfort\nERCOT\nFossil\nNatural Gas\nTX\n88 \n100.0 \n%\nChamon\nERCOT\nFossil\nNatural Gas\nTX\n89 \n100.0 \n%\nTexas Gulf Sulphur (Wharton)\nERCOT\nFossil\nNatural Gas\nTX\n90 \n100.0 \n%\nTotal\n738 \n(a) Capacity is an estimate as of the acquisition date and can vary depending on factors including weather conditions, operational conditions, and other factors. Additionally, ERCOT requires periodic demonstration of capability, and the capacity may vary individually and in the aggregate from time to time\nCapital Allocation \nDuring the nine months ended September 30, 2025, the Company completed $971 million of share repurchases at an average price of $119.78 per share. Through October 31, 2025, an additional $129 million of share repurchases were executed at an average price of $167.41 per share. On October 16, 2025, the Board of Directors authorized an additional share repurchase program of up to $3.0 billion, to be executed through 2028. See Note 9, \nChanges in Capital Structure\n for additional discussion.\nIn the first quarter of 2025, NRG increased the annual common stock dividend to $1.76 from $1.63 per share, representing an 8% increase from 2024. Beginning in the first quarter of 2026, NRG will increase the annual dividend by 8% to $1.90 per share. The Company targets an annual dividend growth rate of 7-9% per share in subsequent years.\nIssuance of Unsecured Notes and Secured Notes\nOn October 8, 2025, the Company issued $3.65 billion and $1.25 billion in aggregate principal amount of the New Unsecured Notes and New Secured Notes, respectively. The New Unsecured Notes are senior unsecured obligations of the Company and are guaranteed by its wholly-owned U.S. subsidiaries that guarantee the term loans under the Senior Credit Facility. The New Secured Notes are senior secured obligations of the Company and are guaranteed by its wholly-owned U.S. subsidiaries that guarantee the term loans under the Senior Credit Facility. For further discussion, see Note 7, \nLong-term Debt and Finance Leases.\nOperations\nOn September 26, 2025, the Company entered into the Second TEF loan to support the development of Cedar Bayou 5, which is currently under construction. Commercial operation of the 689 MW combined cycle facility is expected mid-2028.\nOn July 31, 2025, the Company entered into the First TEF loan to support the development of T.H. Wharton, which is currently under construction. Commercial operation of the 415 MW facility is expected mid-2026.\nIn March 2025, the PUCT selected the Greens Bayou 6 project to advance to the next phase of due diligence, marking the third NRG project chosen under the TEF due diligence process. This project is expected to be operational in 2028.\nOn February 13, 2025, NRG signed a strategic Project Development Agreement with GE Vernova (“GEV”) and Kiewit’s subsidiary, TIC, to develop and construct up to 5.4 GW of new gas-fired, combined cycle generation projects. The generation facilities will be owned and operated by NRG. Additionally, NRG has entered into two slot reservation agreements with GEV for the procurement of 2.4 GW of 7HA gas turbines. The first projects under this comprehensive development agreement are expected to commence operations by the end of 2029.\nTrends Affecting Results of Operations and Future Business Performance\nThe Company’s trends are described in the Company’s 2024 Form 10-K in Item 7, M\nanagement’s Discussion and Analysis of Financial Condition and Results of Operations - Business Environment, \nexcept for the update below:\nTariffs\n \n— NRG’s business is affected by various macroeconomic factors, including tariffs. The U.S. has implemented, or is considering implementing, higher tariffs on imports into the U.S. Any potential increases in capital and operational expenditures may impact the Company’s procurement and sourcing strategies. \n53\n                                                        \n                                                                            \nAffordability \n— Rising customer bills, driven by rising regulated transmission and distribution charges along with load growth, have heightened customer and regulatory focus on energy affordability, including evolving discussions regarding market design and frameworks governing customer-sited generation. NRG is monitoring and seeking to address these developments through its customer-focused business strategy and public policy advocacy efforts. \nChanges in Accounting Standards\nSee Note 2, \nSummary of Significant Accounting Policies\n, for a discussion of recent accounting developments.\n54\n                                                        \n                                                                            \nConsolidated Results of Operations\nThe following table provides selected financial information for the Company:\n \nThree months ended September 30,\nNine months ended September 30,\n(In millions)\n2025\n2024\nChange\n2025\n2024\nChange\nRevenue\nRetail revenue \n$\n7,282 \n$\n6,954 \n$\n328 \n$\n22,017 \n$\n20,527 \n$\n1,490 \nEnergy revenue\n(a)\n148 \n128 \n20 \n492 \n390 \n102 \nCapacity revenue\n(a)\n87 \n47 \n40 \n195 \n133 \n62 \nMark-to-market for economic hedging activities\n34 \n8 \n26 \n18 \n32 \n(14)\nContract amortization \n1 \n(8)\n9 \n(4)\n(25)\n21 \nOther revenues\n(a)(b)\n83 \n94 \n(11)\n242 \n254 \n(12)\nTotal revenue\n7,635 \n7,223 \n412 \n22,960 \n21,311 \n1,649 \nOperating Costs and Expenses\nCost of fuel\n343 \n296 \n(47)\n928 \n648 \n(280)\nPurchased energy and other cost of sales\n(c)\n4,975 \n4,775 \n(200)\n15,698 \n14,723 \n(975)\nMark-to-market for economic hedging activities\n410 \n1,638 \n1,228 \n346 \n315 \n(31)\nContract and emissions credit amortization\n(c)\n15 \n(3)\n(18)\n43 \n43 \n— \nOperations and maintenance\n396 \n401 \n5 \n1,118 \n1,192 \n74 \nOther cost of operations\n102 \n132 \n30 \n298 \n308 \n10 \nCost of operations (excluding depreciation and amortization shown below)\n6,241 \n7,239 \n998 \n18,431 \n17,229 \n(1,202)\nDepreciation and amortization\n360 \n352 \n(8)\n1,030 \n1,045 \n15 \nImpairment losses\n— \n— \n— \n— \n15 \n15 \nSelling, general and administrative costs (excluding amortization of customer acquisition costs of $78, $55, $211 and $144, respectively, which are included in depreciation and amortization shown separately above)\n612 \n645 \n33 \n1,885 \n1,739 \n(146)\nAcquisition-related transaction and integration costs\n8 \n7 \n(1)\n59 \n22 \n(37)\nTotal operating costs and expenses\n7,221 \n8,243 \n1,022 \n21,405 \n20,050 \n(1,355)\nGain/(loss) on sale of assets\n— \n208 \n(208)\n(7)\n209 \n(216)\nOperating Income/(Loss)\n414 \n(812)\n1,226 \n1,548 \n1,470 \n78 \nOther Income/(Expense)\nEquity in earnings of unconsolidated affiliates\n1 \n6 \n(5)\n4 \n13 \n(9)\nOther income, net\n10 \n5 \n5 \n26 \n38 \n(12)\nLoss on debt extinguishment\n— \n— \n— \n(10)\n(260)\n250 \nInterest expense\n(187)\n(213)\n26 \n(498)\n(528)\n30 \nTotal other expense\n(176)\n(202)\n26 \n(478)\n(737)\n259 \nIncome/(Loss) Before Income Taxes\n238 \n(1,014)\n1,252 \n1,070 \n733 \n337 \nIncome tax expense/(benefit)\n86 \n(247)\n(333)\n272 \n251 \n(21)\nNet Income/(Loss)\n$\n152 \n$\n(767)\n$\n919 \n$\n798 \n$\n482 \n$\n316 \n(a)\nIncludes gains and losses from financially settled transactions\n(b)\nIncludes trading gains and losses and ancillary revenues\n(c)\nIncludes amortization of SO\n2\n and NOx\n \ncredits and excludes amortization of RGGI credits     \n55\n                                                        \n                                                                            \nManagement’s discussion of the results of operations for the three months ended September 30, 2025 and 2024 \nElectricity Prices \nThe following table summarizes average on peak power prices for each of the major markets in which NRG operates for the three months ended September 30, 2025 and 2024:\n \nAverage on Peak Power Price ($/MWh)\nThree months ended September 30,\nRegion\n2025\n2024\nChange %\nTexas\nERCOT - Houston\n(a)\n$\n38.68 \n$\n34.12 \n13 \n%\nERCOT - North\n(a)\n36.94 \n34.21 \n8 \n%\nEast\n    NY J/NYC\n(b)\n$\n66.57 \n$\n44.09 \n51 \n%\n    NEPOOL\n(b)\n62.77 \n45.87 \n37 \n%\n    COMED (PJM)\n(b)\n55.33 \n38.03 \n45 \n%\n    PJM West Hub\n(b)\n61.48 \n49.70 \n24 \n%\nWest\nMISO - Louisiana Hub\n(b)\n$\n40.93 \n$\n30.68 \n33 \n%\nCAISO - SP15\n(b)\n36.34 \n43.12 \n(16)\n%\n(a)\nAverage on peak power prices based on real time settlement prices as published by the respective ISOs\n(b)\nAverage on peak power prices based on day ahead settlement prices as published by the respective ISOs\nNatural Gas Prices\nThe following table summarizes the average Henry Hub natural gas price for the three months ended September 30, 2025 and 2024:\nThree months ended September 30,\n2025\n2024\nChange %\n($/MMBtu)\n$\n3.07 \n$\n2.16 \n42 \n%\nGross Margin\nThe Company calculates gross margin in order to evaluate operating performance as revenues less cost of fuel, purchased energy and other costs of sales, mark-to-market for economic hedging activities, contract and emissions credit amortization and depreciation and amortization. \nEconomic Gross Margin\nIn addition to gross margin, the Company evaluates its operating performance using the measure of economic gross margin, which is not a GAAP measure and may not be comparable to other companies’ presentations or deemed more useful than the GAAP information provided elsewhere in this report. Economic gross margin should be viewed as a supplement to and not a substitute for the Company's presentation of gross margin, which is the most directly comparable GAAP measure. Economic gross margin is not intended to represent gross margin. The Company believes that economic gross margin is useful to investors as it is a key operational measure reviewed by the Company's management. Economic gross margin is defined as the sum of retail revenue, energy revenue, capacity revenue and other revenue, less cost of fuel, purchased energy and other cost of sales. Economic gross margin does not include mark-to-market gains or losses on economic hedging activities, contract amortization, emissions credit amortization, depreciation and amortization, operations and maintenance, or other cost of operations.\n56\n                                                        \n                                                                            \nThe following tables present the composition and reconciliation of gross margin and economic gross margin for the three months ended September 30, 2025 and 2024:\nThree months ended September 30, 2025\n($ In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail revenue\n$\n3,300 \n$\n2,766 \n$\n703 \n$\n532 \n$\n(19)\n$\n7,282 \nEnergy revenue\n16 \n132 \n— \n— \n— \n148 \nCapacity revenue\n— \n87 \n— \n— \n— \n87 \nMark-to-market for economic hedging activities\n— \n28 \n6 \n— \n— \n34 \nContract amortization\n— \n1 \n— \n— \n— \n1 \nOther revenue\n(a)\n63 \n16 \n6 \n— \n(2)\n83 \nTotal revenue\n3,379 \n3,030 \n715 \n532 \n(21)\n7,635 \nCost of fuel\n(274)\n(60)\n(9)\n— \n— \n(343)\nPurchased energy and other cost of sales\n(b)(c)(d)\n(1,776)\n(2,551)\n(599)\n(56)\n7 \n(4,975)\nMark-to-market for economic hedging activities\n(407)\n37 \n(40)\n— \n— \n(410)\nContract and emissions credit amortization\n(7)\n(5)\n(3)\n— \n— \n(15)\nDepreciation and amortization\n(95)\n(37)\n(10)\n(207)\n(11)\n(360)\nGross margin\n$\n820\n \n$\n414\n \n$\n54\n \n$\n269\n \n$\n(25)\n$\n1,532\n \nLess: Mark-to-market for economic hedging activities, net\n(407)\n65 \n(34)\n— \n— \n(376)\nLess: Contract and emissions credit amortization, net\n(7)\n(4)\n(3)\n— \n— \n(14)\nLess: Depreciation and amortization\n(95)\n(37)\n(10)\n(207)\n(11)\n(360)\nEconomic gross margin\n$\n1,329\n \n$\n390\n \n$\n101\n \n$\n476\n \n$\n(14)\n$\n2,282\n \n(a)    Includes trading gains and losses and ancillary revenues\n(b)    Includes capacity and emissions credits\n(c)    Includes $970 million, $56 million and $198 million of TDSP expense in Texas, East and West/Services/Other, respectively\n(d)    Excludes depreciation and amortization shown separately\nBusiness Metrics\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail sales\nHome electricity sales volume (GWh)\n12,462 \n4,175 \n621 \n— \n— \n17,258 \nBusiness electricity sales volume (GWh)\n10,990 \n12,477 \n3,759 \n— \n— \n27,226 \nHome natural gas sales volume (MDth)\n— \n2,699 \n4,440 \n— \n— \n7,139 \nBusiness natural gas sales volume (MDth)\n— \n298,222 \n37,449 \n— \n— \n335,671 \nAverage retail Home customer count (in thousands)\n(a)\n2,873 \n2,125 \n713 \n— \n— \n5,711 \nEnding retail Home customer count (in thousands)\n(a)\n2,844 \n2,115 \n714 \n— \n— \n5,673 \nAverage Vivint Smart Home customer count (in thousands)\n(b)\n— \n— \n— \n2,317 \n— \n2,317 \nEnding Vivint Smart Home customer count (in thousands) \n(b)\n— \n— \n— \n2,351 \n— \n2,351 \nPower generation\nGWh sold\n9,299 \n1,941 \n1 \n— \n— \n11,241 \nGWh generated\n(c)\n   Coal\n6,287 \n1,249 \n— \n— \n— \n7,536 \n   Gas\n3,012 \n3 \n— \n— \n— \n3,015 \nOil\n— \n8 \n— \n— \n— \n8 \nRenewables\n— \n— \n1 \n— \n— \n1 \nTotal\n9,299 \n1,260 \n1 \n— \n— \n10,560 \n(a)   Home customer count includes recurring residential customers, services customers and community choice\n(b)   Vivint Smart Home includes customers that also purchase other NRG products\n(c)   Includes owned generation, excludes tolled generation and equity investments. Cottonwood was leased until May 2025\n \n57\n                                                        \n                                                                            \nThree months ended September 30, 2024\n($ In millions)\nTexas\nEast\n West/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail revenue\n$\n3,231 \n$\n2,468 \n$\n760 \n$\n499 \n$\n(4)\n$\n6,954 \nEnergy revenue\n12 \n67 \n52 \n— \n(3)\n128 \nCapacity revenue\n— \n40 \n8 \n— \n(1)\n47 \nMark-to-market for economic hedging activities\n— \n1 \n6 \n— \n1 \n8 \nContract amortization\n— \n(7)\n(1)\n— \n— \n(8)\nOther revenue\n(a)\n58 \n31 \n8 \n— \n(3)\n94 \nTotal revenue\n3,301 \n2,600 \n833 \n499 \n(10)\n7,223 \nCost of fuel\n(226)\n(44)\n(26)\n— \n— \n(296)\nPurchased energy and other cost of sales\n(b)(c)(d)\n(1,996)\n(2,122)\n(625)\n(37)\n5 \n(4,775)\nMark-to-market for economic hedging activities\n(1,537)\n(10)\n(90)\n— \n(1)\n(1,638)\nContract and emissions credit amortization\n(5)\n11 \n(3)\n— \n— \n3 \nDepreciation and amortization\n(81)\n(39)\n(23)\n$\n(198)\n(11)\n(352)\nGross margin\n$\n(544)\n$\n396\n \n$\n66\n \n$\n264\n \n$\n(17)\n$\n165\n \nLess: Mark-to-market for economic hedging activities, net\n(1,537)\n(9)\n(84)\n— \n— \n(1,630)\nLess: Contract and emissions credit amortization, net\n(5)\n4 \n(4)\n— \n— \n(5)\nLess: Depreciation and amortization\n(81)\n(39)\n(23)\n(198)\n(11)\n(352)\nEconomic gross margin\n$\n1,079\n \n$\n440\n \n$\n177\n \n$\n462\n \n$\n(6)\n$\n2,152\n \n(a)    Includes trading gains and losses and ancillary revenues\n(b)    Includes capacity and emissions credits\n(c)    Includes $960 million, $61 million and $203 million of TDSP expense in Texas, East, and West/Services/Other, respectively\n(d)    Excludes depreciation and amortization shown separately\nBusiness Metrics\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail sales\nHome electricity sales volume (GWh)\n13,126 \n4,357 \n582\n—\n—\n18,065 \nBusiness electricity sales volume (GWh)\n11,196 \n12,583 \n1,973\n—\n—\n25,752 \nHome natural gas sales volume (MDth)\n— \n3,464 \n4,985\n—\n—\n8,449 \nBusiness natural gas sales volume (MDth)\n— \n312,871 \n36,617\n—\n—\n349,488 \nAverage retail Home customer count (in thousands)\n(a)\n2,946 \n2,157 \n755\n—\n—\n5,858 \nEnding retail Home customer count (in thousands)\n(a)\n2,921 \n2,132 \n718\n—\n—\n5,771 \nAverage Vivint Smart Home customer count (in thousands)\n(b)\n—\n—\n—\n2,137\n—\n2,137 \nEnding Vivint Smart Home customer count (in thousands)\n(b)\n—\n—\n—\n2,154\n—\n2,154 \nPower generation\nGWh sold \n8,598 \n1,521 \n1,468 \n—\n—\n11,587\nGWh generated\n(c)\n   Coal\n5,417 \n1,040 \n— \n—\n—\n6,457 \n   Gas\n3,181 \n1 \n1,467 \n—\n—\n4,649 \n   Oil\n— \n1 \n— \n—\n—\n1 \n   Renewables\n— \n— \n1 \n— \n—\n1 \nTotal\n8,598 \n1,042 \n1,468 \n— \n— \n11,108 \n(a)   Home customer count includes recurring residential customers, services customers and community choice\n(b)   Vivint Smart Home includes customers that also purchase other NRG products\n(c)   Includes owned and leased generation, excludes tolled generation and equity investments \n58\n                                                        \n                                                                            \nThe following table represents the weather metrics for the three months ended September 30, 2025 and 2024:\n \nThree months ended September 30,\nWeather Metrics\nTexas\nEast\nWest/Services/Other\n(b)\n2025\nCDDs\n(a)\n1,659 \n773 \n1,123 \nHDDs\n(a)\n— \n33 \n3 \n2024\nCDDs\n1,714 \n814 \n1,194 \nHDDs\n— \n28 \n11 \n10-year average\nCDDs\n1,719 \n847 \n1,195 \nHDDs\n5 \n45 \n9 \n(a)    National Oceanic and Atmospheric Administration-Climate Prediction Center - A CDD represents the number of degrees that the mean temperature for a particular day is above 65 degrees Fahrenheit in each region. A HDD represents the number of degrees that the mean temperature for a particular day is below 65 degrees Fahrenheit in each region. The CDDs/HDDs for a period of time are calculated by adding the CDDs/HDDs for each day during the period\n(b)   The West/Services/Other weather metrics are comprised of the average of the CDD and HDD regional results for the West - California and West - South Central regions\nGross Margin and Economic Gross Margin\n \nGross margin increased $1.4 billion and economic gross margin increased $130 million during the three months ended September 30, 2025, compared to the same period in 2024.\nThe following tables describe the changes in gross margin and economic gross margin by segment: \nTexas\n(In millions)\nHigher gross margin due to the following:\n•\na 17%, or $194 million decrease in cost to serve the retail load, driven by lower realized power prices associated with the Company's diversified supply strategy\n•\nan increase in net revenue of $90 million, primarily driven by changes in customer term, product and mix\n$\n284 \nLower gross margin primarily due to a decrease in load driven by changes in customer mix and attrition\n(38)\nOther\n4 \nIncrease in economic gross margin\n$\n250\n \nIncrease in mark-to-market for economic hedging primarily due to net unrealized gains/losses on open positions related to economic hedges\n1,130 \nIncrease in contract and emissions credit amortization\n(2)\nIncrease in depreciation and amortization\n(14)\nIncrease in gross margin\n$\n1,364\n \n59\n                                                        \n                                                                            \nEast\n(In millions)\nLower gross margin due to the deactivation of Indian River Unit 4 in February 2025\n$\n(12)\nLower electric gross margin due to higher supply costs of $16.90 per MWh, or $286 million, driven primarily by increases in power prices, partially offset by higher net revenue rates of $11.70 per MWh, or $202 million as a result of changes in customer term, product, and mix \n(84)\nLower electric gross margin from a decrease in load due to a change in customer mix and weather\n(7)\nHigher natural gas gross margin, including the impact of transportation and storage contract optimization, resulting in higher net revenue rates from changes in customer term, product, and mix of $0.60 per Dth, or $188 million, partially offset by higher supply costs of $0.55 per Dth, or $172 million, driven by an increase in gas costs \n16 \nLower natural gas gross margin from a decrease in load due to a change in customer mix\n(7)\nHigher gross margin due to a 145% increase in PJM capacity prices\n27 \nHigher gross margin primarily due to an increase in average realized prices at Midwest Generation\n10 \nHigher gross margin from demand response, primarily as a result of curtailment events during the third quarter of 2025\n11 \nOther\n(4)\nDecrease in economic gross margin\n$\n(50)\nIncrease in mark-to-market for economic hedging primarily due to net unrealized gains/losses on open positions related to economic hedges\n74 \nIncrease in contract amortization\n(8)\nDecrease in depreciation and amortization\n2 \nIncrease in gross margin\n$\n18\n \nWest/Services/Other\n(In millions)\nLower gross margin due to the disposition of Services businesses\n$\n(38)\nLower natural gas gross margin due to higher supply costs of $0.20 per Dth, or $9 million, partially offset by higher net revenue rates of $0.10 per Dth, or $3 million\n(6)\nHigher electric gross margin due to lower supply costs of $12.00 per MWh, or $52 million and customer mix of $13 million, partially offset by lower net revenue rates of $11.00 per MWh, or $48 million \n17 \nHigher gross margin primarily due to an increase in home protection plan sales\n14 \nLower gross margin at Cottonwood driven by the termination of the facility lease in May 2025\n(62)\nOther\n(1)\nDecrease in economic gross margin\n$\n(76)\nIncrease in mark-to-market for economic hedging primarily due to net unrealized gains/losses on open positions related to economic hedges\n50 \nDecrease in contract amortization\n1 \nDecrease in depreciation and amortization\n13 \nDecrease in gross margin\n$\n(12)\n60\n                                                        \n                                                                            \nVivint Smart Home\n(In millions)\nHigher gross margin primarily driven by growth in customers of $33 million and higher revenue rates of $0.58 per customer, or $4 million\n$\n37 \nLower gross margin due to a decrease in non-recurring sales revenue\n(13)\nLower gross margin due to an increase in personnel and related support costs\n(6)\nOther\n(4)\nIncrease in economic gross margin\n$\n14\n \nIncrease in depreciation and amortization\n(9)\nIncrease in gross margin\n$\n5\n \nMark-to-Market for Economic Hedging Activities\nMark-to-market for economic hedging activities includes asset-backed hedges that have not been designated as cash flow hedges. Total net mark-to-market results increased by $1.3 billion during the three months ended September 30, 2025, compared to the same period in 2024.\nThe breakdown of gains and losses included in revenues and operating costs and expenses, by segment, was as follows: \nThree months ended September 30, 2025\n(In millions)\nTexas\nEast\nWest/Services/Other \nEliminations\nTotal\nMark-to-market results in revenue\n \nReversal of previously recognized unrealized losses on settled positions related to economic hedges\n$\n— \n$\n— \n$\n8 \n$\n— \n$\n8 \nNet unrealized gains/(losses) on open positions related to economic hedges\n— \n28 \n(2)\n— \n26 \nTotal mark-to-market gains in revenue\n$\n— \n$\n28 \n$\n6 \n$\n— \n$\n34 \nMark-to-market results in operating costs and expenses\n \n \nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\n(a)\n$\n(361)\n$\n(31)\n$\n30 \n$\n— \n$\n(362)\nReversal of acquired loss positions related to economic hedges\n14 \n2 \n— \n— \n16 \nNet unrealized (losses)/gains on open positions related to economic hedges\n(60)\n66 \n(70)\n— \n(64)\nTotal mark-to-market (losses)/gains in operating costs and expenses\n$\n(407)\n$\n37 \n$\n(40)\n$\n— \n$\n(410)\n(a)\nIncludes $(266) million, within the Texas segment, related to derivative contracts that were elected as NPNS on October 1, 2024 and are no longer valued at fair value on a recurring basis. For further discussion, see Note 6, \nAccounting for Derivative Instruments and Hedging Activities\n \nThree months ended September 30, 2024\n(In millions)\nTexas\nEast\nWest/Services/Other\nEliminations\nTotal\nMark-to-market results in revenue\n \n \n \n \nReversal of previously recognized unrealized losses on settled positions related to economic hedges\n$\n— \n$\n4 \n$\n9 \n$\n1 \n$\n14 \nReversal of acquired (gain) positions related to economic hedges\n— \n(1)\n— \n— \n(1)\nNet unrealized (losses) on open positions related to economic hedges\n— \n(2)\n(3)\n— \n(5)\nTotal mark-to-market gains in revenue\n$\n— \n$\n1 \n$\n6 \n$\n1 \n$\n8 \nMark-to-market results in operating costs and expenses\n \n \n \n \n \nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\n$\n(498)\n$\n96 \n$\n(25)\n$\n(1)\n$\n(428)\nReversal of acquired (gain)/loss positions related to economic hedges\n(9)\n3 \n(1)\n— \n(7)\nNet unrealized (losses) on open positions related to economic hedges\n(1,030)\n(109)\n(64)\n— \n(1,203)\nTotal mark-to-market (losses) in operating costs and expenses\n$\n(1,537)\n$\n(10)\n$\n(90)\n$\n(1)\n$\n(1,638)\n`\nMark-to-market results consist of unrealized gains and losses on contracts that are not yet settled. The settlement of these transactions is reflected in the same revenue or cost caption as the items being hedged.\n61\n                                                        \n                                                                            \nThe reversals of acquired gain or loss positions were valued based upon the forward prices on the acquisition date.\nFor the three months ended September 30, 2025, the $34 million gain in revenues from economic hedge positions was driven primarily by an increase in the value of open positions as a result of decreases in natural gas prices and the reversal of previously recognized unrealized losses on contracts that settled during the period. The $410 million loss in operating costs and expenses from economic hedge positions was driven primarily by the reversal of previously recognized unrealized gains on contracts that settled during the period and a decrease in the value of open positions in West as a result of decreases in CAISO power prices.\nFor the three months ended September 30, 2024, the $8 million gain in revenues from economic hedge positions was driven primarily by the reversal of previously recognized unrealized losses on contracts that settled during the period. The $1.6 billion loss in operating costs and expenses from economic hedge positions was driven primarily by a decrease in the value of open positions as a result of decreases in power prices, as well as the reversal of previously recognized unrealized gains on contracts that settled during the period.\nIn accordance with ASC 815, the following table represents the results of the Company's financial and physical trading of energy commodities for the three months ended September 30, 2025 and 2024. The realized and unrealized financial and physical trading results are included in revenue. The Company's trading activities are subject to limits based on the Company's Risk Management Policy. \n \nThree months ended September 30,\n(In millions)\n2025\n2024\nTrading gains/(losses)\nRealized\n$\n25 \n$\n25 \nUnrealized\n(3)\n(5)\nTotal trading gains\n$\n22 \n$\n20 \nOperations and Maintenance Expense \nOperations and maintenance expense is comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nThree months ended September 30, 2025\n$\n205 \n$\n105 \n$\n27 \n$\n64 \n$\n(5)\n$\n396 \nThree months ended September 30, 2024\n170 \n102 \n61 \n67 \n1 \n401 \nOperations and maintenance expense decreased by $5 million for the three months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nDecrease driven by the expiration of the Cottonwood facility lease in May 2025\n$\n(28)\nDecrease due to the disposition of Services businesses\n(15)\nDecrease in retail operations costs\n(7)\nIncrease in planned major maintenance expenditures associated with the scope of outages at the Texas gas facilities and Powerton\n35 \nIncrease due to the acquisition of the Texas Generation Portfolio facilities in April 2025\n7 \nOther\n3 \nDecrease in operations and maintenance expense\n$\n(5)\nOther Cost of Operations \nOther cost of operations is comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nTotal\nThree months ended September 30, 2025\n$\n67 \n$\n34 \n$\n— \n$\n1 \n$\n102 \nThree months ended September 30, 2024\n80 \n46 \n4 \n2 \n132 \n62\n                                                        \n                                                                            \nOther cost of operations for the three months ended September 30, 2025 decreased by $30 million, when compared to the same period in 2024, due to the following:\n(In millions)\nDecrease primarily due to changes in prior year ARO cost estimates at Jewett Mine and in the East\n$\n(24)\nOther\n(6)\nDecrease in other cost of operations\n$\n(30)\nDepreciation and Amortization\nDepreciation and amortization are comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate\nTotal\nThree months ended September 30, 2025\n$\n95 \n$\n37 \n$\n10 \n$\n207 \n$\n11 \n$\n360 \nThree months ended September 30, 2024\n81 \n39 \n23 \n198 \n11 \n352 \nDepreciation and amortization increased by $8 million for the three months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nIncrease in amortization of capitalized contract costs primarily in the Vivint Smart Home segment\n$\n46 \nDecrease in amortization driven by the expected roll off of the acquired Vivint Smart Home intangibles\n(31)\nDecrease in amortization due to the disposition of Services businesses\n(5)\nOther\n(2)\nIncrease in depreciation and amortization\n$\n8 \nSelling, General and Administrative Costs\nSelling, general and administrative costs are comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Elimination\nTotal\nThree months ended September 30, 2025\n$\n261 \n$\n151 \n$\n44 \n$\n148 \n$\n8 \n$\n612 \nThree months ended September 30, 2024\n260 \n157 \n66 \n151 \n11 \n645 \nSelling, general and administrative costs decreased by $33 million for the three months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nDecrease due to the disposition of Services businesses\n$\n(13)\nDecrease in equity linked compensation\n(7)\nDecrease in provision for credit losses due to improved customer payment behavior\n(7)\nDecrease in personnel costs\n(4)\nOther\n(2)\nDecrease in selling, general and administrative costs\n$\n(33)\n63\n                                                        \n                                                                            \nAcquisition-Related Transaction and Integration Costs\nAcquisition-related transaction and integration costs of $8 million and $7 million for the three months ended September 30, 2025 and 2024, respectively, include: \nThree months ended September 30,\n(In millions)\n2025\n2024\nVivint Smart Home integration costs\n$\n4 \n$\n4 \nLSP Portfolio acquisition costs\n2 \n— \nOther\n2 \n3 \nAcquisition-related transaction and integration costs\n$\n8 \n$\n7 \nGain on Sale of Assets\nThe gain on sale of assets of $208 million for the three months ended September 30, 2024, was due to the sale of the Airtron business unit.\nInterest Expense\nInterest expense decreased by $26 million for the three months ended September 30, 2025, compared to the same period in 2024, primarily due to higher unrealized losses on derivatives related to debt assumed at the Vivint acquisition in the 2024 period, partially offset by a realized loss on the treasury locks in the 2025 period.\nIncome Tax Expense/(Benefit)\nFor the three months ended September 30, 2025, income tax expense of $86 million was recorded on pre-tax income of $238 million. For the same period in 2024, an income tax benefit of $247 million was recorded on pre-tax loss of $1.0 billion. The effective tax rates were 36.1% and 24.4% for the three months ended September 30, 2025 and 2024, respectively.\nFor the three months ended September 30, 2025 and 2024, the effective tax rate was higher than the statutory rate of 21%, primarily due to the state tax expense. \n64\n                                                        \n                                                                            \nManagement’s discussion of the results of operations for the nine months ended September 30, 2025 and 2024 \nElectricity Prices\nThe following table summarizes average on peak power prices for each of the major markets in which NRG operates for the nine months ended September 30, 2025 and 2024:\n \nAverage on Peak Power Price ($/MWh)\nNine months ended September 30,\nRegion\n2025\n2024\nChange %\nTexas\nERCOT - Houston \n(a)\n$\n38.79 \n$\n34.09 \n14 \n%\nERCOT - North\n(a)\n36.73 \n32.19 \n14 \n%\nEast\n    NY J/NYC\n(b)\n$\n76.07 \n$\n42.79 \n78 \n%\n    NEPOOL\n(b)\n72.48 \n42.62 \n70 \n%\n    COMED (PJM)\n(b)\n46.17 \n32.50 \n42 \n%\n    PJM West Hub\n(b)\n58.13 \n41.07 \n42 \n%\nWest\nMISO - Louisiana Hub\n(b)\n$\n45.49 \n$\n29.78 \n53 \n%\nCAISO - SP15\n(b)\n26.55 \n28.17 \n(6)\n%\n(a) Average on peak power prices based on real time settlement prices as published by the respective ISOs\n(b) Average on peak power prices based on day ahead settlement prices as published by the respective ISOs\nNatural Gas Prices\nThe following table summarizes the average Henry Hub natural gas price for the nine months ended September 30, 2025 and 2024:\nNine months ended September 30,\n2025\n2024\nChange %\n($/MMBtu)\n$\n3.39 \n$\n2.10 \n61 \n%\nGross Margin\nThe Company calculates gross margin in order to evaluate operating performance as revenues less cost of fuel, purchased energy and other costs of sales, mark-to-market for economic hedging activities, contract and emissions credit amortization and depreciation and amortization. \nEconomic Gross Margin\nIn addition to gross margin, the Company evaluates its operating performance using the measure of economic gross margin, which is not a GAAP measure and may not be comparable to other companies’ presentations or deemed more useful than the GAAP information provided elsewhere in this report. Economic gross margin should be viewed as a supplement to and not a substitute for the Company's presentation of gross margin, which is the most directly comparable GAAP measure. Economic gross margin is not intended to represent gross margin. The Company believes that economic gross margin is useful to investors as it is a key operational measure reviewed by the Company's management. Economic gross margin is defined as the sum of energy revenue, capacity revenue, retail revenue and other revenue, less cost of fuel, purchased energy and other cost of sales. Economic gross margin does not include mark-to-market gains or losses on economic hedging activities, contract and emissions credit amortization, depreciation and amortization, operations and maintenance, or other cost of operations.\n65\n                                                        \n                                                                            \nThe following tables present the composition and reconciliation of gross margin and economic gross margin for the nine months ended September 30, 2025 and 2024:\nNine months ended September 30, 2025\n($ In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail revenue\n$\n8,466 \n$\n9,724 \n$\n2,350 \n$\n1,530 \n$\n(53)\n$\n22,017 \nEnergy revenue\n38 \n354 \n101 \n— \n(1)\n492 \nCapacity revenue\n— \n182 \n14 \n— \n(1)\n195 \nMark-to-market for economic hedging activities\n— \n12 \n6 \n— \n— \n18 \nContract amortization\n— \n(4)\n— \n— \n— \n(4)\nOther revenue\n(a)\n157 \n76 \n18 \n— \n(9)\n242 \nTotal revenue\n8,661 \n10,344 \n2,489 \n1,530 \n(64)\n22,960 \nCost of fuel\n(652)\n(203)\n(73)\n— \n— \n(928)\nPurchased energy and other cost of sales\n(b)(c)(d)\n(4,942)\n(8,635)\n(2,001)\n(143)\n23 \n(15,698)\nMark-to-market for economic hedging activities\n(375)\n(46)\n75 \n— \n— \n(346)\nContract and emissions credit amortization\n(11)\n(27)\n(5)\n— \n— \n(43)\nDepreciation and amortization\n(271)\n(110)\n(34)\n$\n(582)\n(33)\n(1,030)\nGross margin\n$\n2,410\n \n$\n1,323\n \n$\n451\n \n$\n805\n \n$\n(74)\n$\n4,915\n \nLess: Mark-to-market for economic hedging activities, net\n(375)\n(34)\n81 \n— \n— \n(328)\nLess: Contract and emissions credit amortization, net\n(11)\n(31)\n(5)\n— \n— \n(47)\nLess: Depreciation and amortization\n(271)\n(110)\n(34)\n(582)\n(33)\n(1,030)\nEconomic gross margin\n$\n3,067\n \n$\n1,498\n \n$\n409\n \n$\n1,387\n \n$\n(41)\n$\n6,320\n \n(a)    Includes trading gains and losses and ancillary revenues\n(b)    Includes capacity and emissions credits\n(c)    Includes $2.6 billion, $186 million and $817 million of TDSP expense in Texas, East, and West/Services/Other, respectively\n   (d)    Excludes depreciation and amortization shown separately \nBusiness Metrics\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail sales\nHome electricity sales volume (GWh)\n31,021 \n11,775 \n1,844 \n— \n— \n44,640 \nBusiness electricity sales volume (GWh)\n30,055 \n34,627 \n9,415 \n— \n— \n74,097 \nHome natural gas sales volume (MDth)\n— \n35,557 \n48,109 \n— \n— \n83,666 \nBusiness natural gas sales volume (MDth)\n— \n1,107,780 \n132,099 \n— \n— \n1,239,879 \nAverage retail Home customer count (in thousands)\n(a)\n2,911 \n2,172 \n717 \n— \n— \n5,800 \nEnding retail Home customer count (in thousands)\n(a)\n2,844 \n2,115 \n714 \n— \n— \n5,673 \nAverage Vivint Smart Home customer count (in thousands)\n(b)\n— \n— \n— \n2,229 \n— \n2,229 \nEnding Vivint Smart Home customer count (in thousands)\n(b)\n— \n— \n— \n2,351 \n— \n2,351 \nPower generation\nGWh sold\n21,880 \n4,804 \n2,117 \n— \n— \n28,801 \nGWh generated\n(c)\n      Coal\n16,302 \n2,945 \n— \n— \n— \n19,247 \n      Gas\n5,578 \n5 \n2,114 \n— \n— \n7,697 \n      Oil\n— \n15 \n— \n— \n— \n15 \nRenewables\n— \n— \n3 \n— \n— \n3 \n       Total\n21,880 \n2,965 \n2,117 \n— \n— \n26,962 \n(a)   Home customer count includes recurring residential customers, services customers and community choice\n(b)  Vivint Smart Home customers that also purchase other NRG products\n(c)   Includes owned and leased generation, excludes tolled generation and equity investments. Cottonwood was leased until May 2025\n66\n                                                        \n                                                                            \nNine months ended September 30, 2024\n($ In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail revenue\n$\n8,101 \n$\n8,257 \n$\n2,747 \n$\n1,434 \n$\n(12)\n$\n20,527 \nEnergy revenue\n35 \n194 \n170 \n— \n(9)\n390 \nCapacity revenue\n— \n120 \n16 \n— \n(3)\n133 \nMark-to-market for economic hedging activities\n— \n15 \n14 \n— \n3 \n32 \nContract amortization\n— \n(23)\n(2)\n— \n— \n(25)\nOther revenue\n(a) \n161 \n84 \n17 \n— \n(8)\n254 \nTotal revenue\n8,297 \n8,647 \n2,962 \n1,434 \n(29)\n21,311 \nCost of fuel\n(471)\n(98)\n(79)\n— \n— \n(648)\nPurchased energy and other cost of sales\n(b)(c)(d)\n(5,212)\n(7,078)\n(2,342)\n(108)\n17 \n(14,723)\nMark-to-market for economic hedging activities\n(707)\n595 \n(200)\n— \n(3)\n(315)\nContract and emissions credit amortization\n(7)\n(31)\n(5)\n— \n— \n(43)\nDepreciation and amortization\n(240)\n(117)\n(96)\n$\n(561)\n(31)\n(1,045)\nGross margin\n$\n1,660\n \n$\n1,918\n \n$\n240\n \n$\n765\n \n$\n(46)\n$\n4,537\n \nLess: Mark-to-market for economic hedging activities, net\n(707)\n610 \n(186)\n— \n— \n(283)\nLess: Contract and emissions credit amortization, net\n(7)\n(54)\n(7)\n— \n— \n(68)\nLess: Depreciation and amortization\n(240)\n(117)\n(96)\n(561)\n(31)\n(1,045)\nEconomic gross margin\n$\n2,614\n \n$\n1,479\n \n$\n529\n \n$\n1,326\n \n$\n(15)\n$\n5,933\n \n(a)    Includes trading gains and losses and ancillary revenues\n(b)    Includes capacity and emissions credits\n(c)    Includes $2.6 billion, $197 million and $860 million of TDSP expense in Texas, East and West/Services/Other, respectively\n(d)    Excludes depreciation and amortization shown separately\nBusiness Metrics\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nRetail sales\nHome electricity sales volume (GWh)\n31,540 \n11,803 \n1,722 \n— \n— \n45,065 \nBusiness electricity sales volume (GWh)\n30,936 \n35,792 \n7,985 \n— \n— \n74,713 \nHome natural gas sales volume (MDth)\n— \n33,577 \n50,027 \n— \n— \n83,604 \nBusiness natural gas sales volume (MDth)\n— \n1,118,695 \n134,310 \n— \n— \n1,253,005 \nAverage retail Home customer count (in thousands)\n(a)\n2,949 \n2,168 \n761 \n— \n— \n5,878 \nEnding retail Home customer count (in thousands)\n(a)\n2,921 \n2,132 \n718 \n— \n— \n5,771 \nAverage Vivint Smart Home customer count (in thousands)\n(b)\n— \n— \n— \n2,083 \n— \n2,083 \nEnding Vivint Smart Home customer count (in thousands)\n(b)\n— \n— \n— \n2,154 \n— \n2,154 \nPower generation\nGWh sold\n16,913 \n3,639 \n4,342 \n— \n— \n24,894 \nGWh generated\n(c)\n   Coal\n10,353 \n2,005 \n— \n— \n— \n12,358 \n   Gas\n6,560 \n1 \n4,338 \n— \n— \n10,899 \nOil\n— \n4 \n— \n— \n— \n4 \n   Renewables\n— \n— \n4 \n— \n— \n4 \n      Total\n16,913 \n2,010 \n4,342 \n— \n— \n23,265 \n(a)   Home customer count includes recurring residential customers, services customers and community choice\n(b)   Vivint Smart Home customers that also purchase other NRG products\n(c)   Includes owned and leased generation, excludes tolled generation and equity investments\n67\n                                                        \n                                                                            \nThe following table represents the weather metrics for the nine months ended September 30, 2025 and 2024:\n \nNine months ended September 30,\nWeather Metrics\nTexas\nEast\nWest/Services/Other\n(b)\n2025\nCDDs\n(a)\n2,913 \n1,184 \n1,780 \nHDDs\n(a)\n1,063 \n3,004 \n1,379 \n2024\nCDDs\n3,003 \n1,277 \n1,881 \nHDDs\n916 \n2,676 \n1,310 \n10-year average\nCDDs\n2,851 \n1,251 \n1,811 \nHDDs\n993 \n2,970 \n1,292 \n(a)    National Oceanic and Atmospheric Administration-Climate Prediction Center - A Cooling Degree Day, or CDD, represents the number of degrees that the mean temperature for a particular day is above 65 degrees Fahrenheit in each region. A Heating Degree Day, or HDD, represents the number of degrees that the mean temperature for a particular day is below 65 degrees Fahrenheit in each region. The CDDs/HDDs for a period of time are calculated by adding the CDDs/HDDs for each day during the period\n(b)   The West/Services/Other weather metrics are comprised of the average of the CDD and HDD regional results for the West-California and West-South Central regions\nGross Margin and Economic Gross Margin\nGross margin increased $378 million and economic gross margin increased $387 million, both of which include intercompany sales, during the nine months ended September 30, 2025, compared to the same period in 2024.\nThe following tables describe the changes in gross margin and economic gross margin by segment:\nTexas\n(In millions)\nHigher gross margin due to the following:\n•\nan increase in net revenue of $319 million, primarily driven by changes in customer term, product and mix\n•\na 6%, or $159 million decrease in cost to serve the retail load, driven by lower realized power prices associated with the Company's diversified supply strategy\n$\n478 \nLower gross margin due to a decrease in load of 1.7 TWh, or $50 million, driven by changes in customer mix and attrition, partially offset by an increase in load of 300 GWh, or $16 million attributed to weather\n(34)\nOther\n9 \nIncrease in economic gross margin\n$\n453\n \nIncrease in mark-to-market for economic hedging primarily due to net unrealized gains/losses on open positions related to economic hedges\n332 \nIncrease in contract and emissions credit amortization\n(4)\nIncrease in depreciation and amortization\n(31)\nIncrease in gross margin\n$\n750\n \n68\n                                                        \n                                                                            \nEast\n(In millions)\nLower gross margin due to the deactivation of Indian River Unit 4 in February 2025\n$\n(37)\nHigher natural gas gross margin, including the impact of transportation and storage contract optimization, resulting in higher net revenue rates from changes in customer term, product, and mix of $1.05 per Dth, or $1.19 billion, partially offset by higher supply costs of $0.90 per Dth, or $1.04 billion, driven by an increase in gas costs\n145 \nLower natural gas gross margin from a decrease in load due to a change in customer mix, partially offset by an increase in load due to weather\n(5)\nLower electric gross margin due to higher supply costs of $12.50 per MWh, or $584 million driven primarily by increases in power prices, partially offset by higher net revenue rates of $9.00 per MWh, or $408 million, as a result of changes in customer term, product and mix \n(176)\nLower electric gross margin from a decrease in load due to a change in customer mix, partially offset by an increase in load due to weather\n(7)\nHigher gross margin due to an increase in generation volumes as a result of spark spread expansion in NYISO, partially offset by a decrease in average realized prices at Midwest Generation\n31 \nHigher gross margin due to a 159% increase in PJM capacity prices and a 37% increase in NYISO capacity prices\n60 \nHigher gross margin from demand response, primarily as a result of curtailment events during the third quarter of 2025\n9 \nOther\n(1)\nIncrease in economic gross margin\n$\n19\n \nDecrease in mark-to-market for economic hedging primarily due to net unrealized gains/losses on open positions related to economic hedges\n(644)\nDecrease in contract amortization\n23 \nDecrease in depreciation and amortization\n7 \nDecrease in gross margin\n$\n(595)\nWest/Services/Other\n(In millions)\nLower gross margin due to the disposition of Services businesses\n$\n(121)\nHigher electric gross margin due to lower supply costs of $13.50 per MWh, or $154 million and customer mix of $25 million, partially offset by lower net revenue rates of $11.00 per MWh, or $123 million\n56 \nHigher natural gas gross margin due to higher net revenue rates of $0.05 per Dth, or $5 million and lower supply costs of $0.05 per Dth, or $4 million\n9 \nHigher gross margin primarily due to an increase in home protection plan sales\n34 \nLower gross margin at Cottonwood driven by the termination of the facility lease in May 2025\n(83)\nLower gross margin at Cottonwood due to spark spread contraction, partially offset by favorable capacity pricing\n(12)\nOther\n(3)\nDecrease in economic gross margin\n$\n(120)\nIncrease in mark-to-market for economic hedges primarily due to net unrealized gains/losses on open positions related to economic hedges\n267 \nDecrease in contract amortization\n2 \nDecrease in depreciation and amortization\n62 \nIncrease in gross margin\n$\n211\n \n69\n                                                        \n                                                                            \nVivint Smart Home\n(In millions)\nHigher gross margin primarily driven by growth in customers of $85 million and higher revenue rates of $0.96 per customer, or $19 million\n$\n104 \nLower gross margin due to a decrease in non-recurring sales revenue\n(25)\nLower gross margin due to an increase in personnel and related support costs\n(9)\nOther\n(9)\nIncrease in economic gross margin\n$\n61\n \nIncrease in depreciation and amortization\n(21)\nIncrease in gross margin\n$\n40\n \nMark-to-Market for Economic Hedging Activities\nMark-to-market for economic hedging activities includes asset-backed hedges that have not been designated as cash flow hedges. Total net mark-to-market results decreased by $45 million during the nine months ended September 30, 2025, compared to the same period in 2024.\nThe breakdown of gains and losses included in revenues and operating costs and expenses by segment was as follows: \nNine months ended September 30, 2025\n(In millions)\nTexas\nEast\nWest/Services/Other\nEliminations\nTotal\nMark-to-market results in revenue\n \nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\n$\n— \n$\n(7)\n$\n6 \n$\n— \n$\n(1)\nNet unrealized gains on open positions related to economic hedges\n— \n19 \n— \n— \n19 \nTotal mark-to-market gains in revenue\n$\n— \n$\n12 \n$\n6 \n$\n— \n$\n18 \nMark-to-market results in operating costs and expenses\n \n \nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\n(a)\n$\n(498)\n$\n(96)\n$\n143 \n$\n— \n$\n(451)\nReversal of acquired loss/(gain) positions related to economic hedges\n23 \n(2)\n— \n— \n21 \nNet unrealized gains/(losses) on open positions related to economic hedges\n100 \n52 \n(68)\n— \n84 \nTotal mark-to-market (losses)/gains in operating costs and expenses\n$\n(375)\n$\n(46)\n$\n75 \n$\n— \n$\n(346)\n(a)\nIncludes $(319) million, within the Texas segment, related to derivative contracts that were elected as NPNS on October 1, 2024 and are no longer valued at fair value on a recurring basis. For further discussion, see Note 6, \nAccounting for Derivative Instruments and Hedging Activities\n \nNine months ended September 30, 2024\n(In millions)\nTexas\nEast\nWest/Services/Other\nEliminations\nTotal\nMark-to-market results in revenue\n \n \n \n \nReversal of previously recognized unrealized (gains) on settled positions related to economic hedges\n$\n— \n$\n(28)\n$\n— \n$\n3 \n$\n(25)\nReversal of acquired (gain) positions related to economic hedges\n— \n(1)\n— \n— \n(1)\nNet unrealized gains on open positions related to economic hedges\n— \n44 \n14 \n— \n58 \nTotal mark-to-market gains in revenue\n$\n— \n$\n15 \n$\n14 \n$\n3 \n$\n32 \nMark-to-market results in operating costs and expenses\n \n \n \n \nReversal of previously recognized unrealized (gains)/losses on settled positions related to economic hedges\n$\n(616)\n$\n628 \n$\n55 \n$\n(3)\n$\n64 \nReversal of acquired loss/(gain) positions related to economic hedges\n2 \n(5)\n1 \n— \n(2)\nNet unrealized (losses) on open positions related to economic hedges\n(93)\n(28)\n(256)\n— \n(377)\nTotal mark-to-market (losses)/gains in operating costs and expenses\n$\n(707)\n$\n595 \n$\n(200)\n$\n(3)\n$\n(315)\nMark-to-market results consist of unrealized gains and losses on contracts that are not yet settled. The settlement of these transactions is reflected in the same revenue or cost caption as the items being hedged.\n70\n                                                        \n                                                                            \nFor the nine months ended September 30, 2025, the $18 million gain in revenues from economic hedge positions was driven primarily by an increase in the value of open positions as a result of decreases in natural gas prices. The $346 million loss in operating costs and expenses from economic hedge positions was driven primarily by the reversal of previously recognized unrealized gains on contracts that settled during the period, partially offset by an increase in the value of Texas open positions as a result of increases in ERCOT power prices.\nFor the nine months ended September 30, 2024, the $32 million gain in revenues from economic hedge positions was primarily driven by an increase in the value of open positions as a result of decreases in power prices, partially offset by the reversal of previously recognized unrealized gains on contracts that settled during the period. The $315 million loss in operating costs and expenses from economic hedge positions was driven primarily by a decrease in the value of open positions as a result of decreases in power prices, partially offset by the reversal of previously recognized unrealized losses on contracts that settled during the period.\nIn accordance with ASC 815, the following table represents the results of the Company's financial and physical trading of energy commodities for the nine months ended September 30, 2025 and 2024. The realized and unrealized financial and physical trading results are included in revenue. The Company's trading activities are subject to limits based on the Company's Risk Management Policy.\n \nNine months ended September 30,\n(In millions)\n2025\n2024\nTrading gains\nRealized\n$\n26 \n$\n30 \nUnrealized\n7 \n— \nTotal trading gains\n$\n33 \n$\n30 \nOperations and Maintenance Expense\nOperations and maintenance expense are comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nNine months ended September 30, 2025\n$\n534 \n$\n303 \n$\n118 \n$\n181 \n$\n(18)\n$\n1,118 \nNine months ended September 30, 2024\n585 \n259 \n168 \n178 \n2 \n1,192 \nOperations and maintenance expense decreased by $74 million for the nine months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nDecrease due to the final property insurance claim for the extended outage at W.A. Parish received in 2025\n$\n(100)\nDecrease due to the disposition of Services businesses\n(53)\nDecrease driven by the expiration of the Cottonwood facility lease in May 2025\n(28)\nIncrease in planned major maintenance expenditures associated with the scope of outages at the Powerton and Cottonwood, partially offset by the timing of planned outages at the Texas coal facilities\n61 \nIncrease driven by higher retail operations costs\n16 \nIncrease due to the acquisition of the Texas Generation Portfolio facilities in April 2025\n14 \nIncrease in variable operations and maintenance expenditures driven by higher generation at Powerton\n6 \nIncrease driven by higher Vivint Smart Home operations costs to support customer growth\n3 \nOther\n7 \nDecrease in operations and maintenance expense\n$\n(74)\n71\n                                                        \n                                                                            \nOther Cost of Operations \nOther Cost of operations are comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nTotal\nNine months ended September 30, 2025\n$\n192 \n$\n97 \n$\n6 \n$\n3 \n$\n298 \nNine months ended September 30, 2024\n187 \n104 \n11 \n6 \n308 \nOther cost of operations decreased by $10 million for the nine months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nDecrease primarily driven by current year changes in ARO cost estimates in the East, partially offset by an increase in current year ARO cost estimates at Jewett Mine\n$\n(7)\nOther\n(3)\nDecrease in other cost of operations\n$\n(10)\nDepreciation and Amortization\nDepreciation and amortization expenses are comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate\nTotal\nNine months ended September 30, 2025\n$\n271 \n$\n110 \n$\n34 \n$\n582 \n$\n33 \n$\n1,030 \nNine months ended September 30, 2024\n240 \n117 \n96 \n561 \n31 \n1,045 \nDepreciation and amortization decreased by $15 million for the nine months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nIncrease in amortization of capitalized contract costs primarily in the Vivint Smart Home segment\n$\n132 \nDecrease in amortization driven by the expected roll off of the acquired Vivint Smart Home intangibles\n(91)\nDecrease in amortization due to the disposition of Services businesses\n(37)\nDecrease in amortization primarily due to the roll off of intangibles in Texas, East and West\n(22)\nOther\n3 \nDecrease in depreciation and amortization\n$\n(15)\n72\n                                                        \n                                                                            \nSelling, General and Administrative Costs\nSelling, general and administrative costs comprised of the following:\n(In millions)\nTexas\nEast\nWest/Services/Other\nVivint Smart Home\nCorporate/Eliminations\nTotal\nNine months ended September 30, 2025\n$\n677 \n$\n445 \n$\n130 \n$\n618 \n$\n15 \n$\n1,885 \nNine months ended September 30, 2024\n622 \n435 \n187 \n460 \n35 \n1,739 \nSelling, general and administrative costs increased by $146 million for the nine months ended September 30, 2025, compared to the same period in 2024, due to the following:\n(In millions)\nIncrease due to reserves for legal matters in 2025\n$\n176 \nIncrease in equity linked compensation primarily driven by a higher share price in 2025\n24 \nIncrease in personnel costs\n24 \nDecrease due to the disposition of Services businesses\n(35)\nDecrease in provision for credit losses primarily due to improved customer payment behavior\n(27)\nDecrease in marketing and media expenses\n(8)\nOther\n(8)\nIncrease in selling, general and administrative costs\n$\n146 \nAcquisition-Related Transaction and Integration Costs\nAcquisition-related transaction and integration costs of $59 million and $22 million for the nine months ended September 30, 2025 and 2024, respectively, include:\nNine months ended September 30,\n(In millions)\n2025\n2024\nLSP Portfolio acquisition costs\n$\n25 \n$\n— \nVivint Smart Home integration costs\n25 \n17 \nTexas Generation Portfolio acquisition costs\n5 \n— \nOther\n4 \n5 \nAcquisition-related transaction and integration costs\n$\n59 \n$\n22 \nGain on Sale of Assets\nThe gain on sale of assets of $209 million for the nine months ended September 30, 2024, was primarily due to the sale of the Airtron business unit.\nLoss on Debt Extinguishment\nA loss on debt extinguishment of $260 million was recorded for the nine months ended September 30, 2024, driven by the repurchase of a portion of the Convertible Senior Notes.\nInterest Expense\nInterest expense decreased by $30 million for the nine months ended September 30, 2025, compared to the same period in 2024, primarily due to higher unrealized losses on derivatives and amortization of debt discount related to debt assumed at the Vivint acquisition in the 2024 period, partially offset by a realized loss on the treasury locks in the 2025 period.\nIncome Tax Expense\nFor the nine months ended September 30, 2025, an income tax expense of $272 million was recorded on a pre-tax income of $1.1 billion. For the same period in 2024, income tax expense of $251 million was recorded on pre-tax income of $733 million. The effective tax rates were 25.4% and 34.2% for the nine months ended September 30, 2025 and 2024, respectively.\nFor the nine months ended September 30, 2025, NRG's effective tax rate was higher than the statutory rate of 21%, primarily due to the state tax expense, partially offset with favorable permanent differences. For the same period in 2024, NRG's effective tax rate was higher than the statutory rate of 21%, primarily due to the state tax expense and permanent differences.\n73\n                                                        \n                                                                            \nLiquidity and Capital Resources \nLiquidity Position\nAs of September 30, 2025 and December 31, 2024, NRG's total liquidity, excluding funds deposited by counterparties, of approximately $6.5 billion and $5.4 billion, respectively, was comprised of the following:\n(In millions)\nSeptember 30, 2025\nDecember 31, 2024\nCash and cash equivalents\n$\n732 \n$\n966 \nRestricted cash - operating\n15 \n4 \nRestricted cash - reserves\n(a)\n15 \n4 \nTotal\n762 \n974 \nTotal availability under Revolving Credit Facility and collective collateral facilities\n(b)\n5,730 \n4,469 \nTotal liquidity, excluding funds deposited by counterparties\n$\n6,492 \n$\n5,443 \n(a)  Includes reserves primarily for debt service, performance obligations and capital expenditures\n(b) Total capacity of Revolving Credit Facility and collective collateral facilities was $8.0 billion and $7.3 billion as of September 30, 2025 and December 31, 2024, respectively\nFor the nine months ended September 30, 2025, total liquidity, excluding funds deposited by counterparties, increased by $1.0 billion. Changes in cash and cash equivalent balances are further discussed under the heading \nCash\n \nFlow Discussion\n. Cash and cash equivalents at September 30, 2025 were predominantly held in bank deposits.\nManagement believes that the Company's liquidity position and cash flows from operations will be adequate to finance operating and maintenance capital expenditures, to fund dividends, and to fund other liquidity commitments in the short and long-term. Management continues to regularly monitor the Company's ability to finance the needs of its operating, financing and investing activity within the dictates of prudent balance sheet management.\nLiquidity\nThe principal sources of liquidity for NRG's operating and capital expenditures are expected to be derived from cash on hand, cash flows from operations and financing arrangements. As described in Note 7, \nLong-term Debt and Finance Leases\n, to this Form 10-Q, the Company's financing arrangements consist mainly of the Senior Notes, Senior Secured First Lien Notes, Senior Credit Facility, Receivables Facility and tax-exempt bonds. The Company also issues letters of credit through bilateral letter of credit facilities and the pre-capitalized trust securities facility.\nThe Company's requirements for liquidity and capital resources, other than for operating its facilities, can generally be categorized by the following: (i) market operations activities; (ii) debt service obligations, as described in Note 7, \nLong-term Debt and Finance Leases;\n (iii) capital expenditures, including maintenance, environmental, and investments and integration; and (iv) allocations in connection with acquisition opportunities, debt repayments, share repurchases and dividend payments to stockholders, as described in Note 9, \nChanges in Capital Structure\n.\nAnticipated Acquisition of LSP Portfolio\nOn May 12, 2025, NRG entered into a definitive agreement with LS Power to acquire a power portfolio including 13 GW of natural gas-fired generation facilities and the C&I VPP platform with 6 GW of capacity. The consideration will consist of 24.25 million shares of NRG common stock, and $6.4 billion in cash, subject to working capital adjustments as set forth in the purchase agreement. As part of the transaction, NRG will also assume approximately $3.2 billion of debt. The acquisition is expected to close in the first quarter of 2026 and is subject to the satisfaction or waiver of specified closing conditions, consents and regulatory approvals, including HSR, FERC, DOJ, and NYSPSC. For further discussion, see Note 4, \nAcquisitions and Dispositions.\nIn connection with the anticipated acquisition of the LSP Portfolio, the Company entered into a commitment letter for a senior secured bridge facility with certain financial institutions in a principal amount not to exceed $4.4 billion for the purposes of paying a portion of the cash consideration for the anticipated acquisition and related fees and expenses. The Bridge Facility was terminated on October 8, 2025 following the issuance of the New Unsecured Notes and the New Secured Notes. See Note 7, \nLong-term Debt and Finance Leases\nAcquisition of Texas Generation Portfolio\nOn April 10, 2025, the Company acquired all of the ownership interests of six power generation facilities from Rockland Capital, LLC, adding 738 MW of natural gas-fired assets in Texas to its portfolio for $560 million in consideration, less $2 million in working capital adjustments. For further discussion, see Note 4, \nAcquisitions and Dispositions. \n74\n                                                        \n                                                                            \nIssuance of Unsecured Notes and Secured Notes\nOn October 8, 2025, the Company issued $3.65 billion and $1.25 billion in aggregate principal amount of the New Unsecured Notes and New Secured Notes, respectively. The New Unsecured Notes are senior unsecured obligations of the Company and are guaranteed by its wholly-owned U.S. subsidiaries that guarantee the term loans under the Senior Credit Facility. The New Secured Notes are senior secured obligations of the Company and are guaranteed by its wholly-owned U.S. subsidiaries that guarantee the term loans under the Senior Credit Facility. \nThe Company intends to use a portion of the net proceeds from the New Unsecured Notes and the New Secured Notes to partially fund the cash portion of the purchase price of the acquisition of the LSP Portfolio. In addition, the Company intends to use a portion of the net proceeds from the 2035 Notes to repay in full its $500 million aggregate principal amount of 2.000% senior secured notes on the maturity date of December 2, 2025. For further discussion, see Note 7, \nLong-term Debt and Finance Leases.\nAmendment to Term Loan\nOn July 22, 2025, the Company and APX Group LLC, as borrowers, and certain subsidiaries of the Company, as guarantors, entered into the Fifteenth Amendment with, among others, the Agent, and certain financial institutions, as lenders, which amended the Credit Agreement by adding a new incremental Term Loan B in an aggregate principal amount of $1.0 billion. For further discussion, see Note 7, \nLong-term Debt and Finance Leases\n.\nRevolving Credit Facility\nOn May 27, 2025, the Company, as borrower, and certain of its subsidiaries, as guarantors, entered into the Fourteenth Amendment to the Credit Agreement in order to (i) increase the commitments under the Revolving Credit Facility by the Incremental Commitments to an aggregate amount equal to $4.6 billion and (ii) make certain other amendments to the Credit Agreement. For further discussion, see Note 7, \nLong-term Debt and Finance Leases\n.\nConvertible Senior Notes Redemption\nOn May 15, 2025, the Company issued a notice of redemption for the Convertible Senior Notes. On the Redemption Date, the Company used cash on hand to redeem $12 million in aggregate principal amount of the Convertible Senior Notes, at a redemption price equal to 100.000%. The majority of the Convertible Senior Note holders elected to convert the notes prior to the Redemption Date and received $220 million in cash with respect to the remaining principal amount of the Convertible Senior Notes and a total of 3,986,335 shares for the conversion premium. See Note 7, \nLong-term Debt and Finance Leases.\nReceivables Securitization Facilities\nOn June 20, 2025, NRG Receivables amended its existing Receivables Facility to extend the scheduled termination date to June 18, 2026.\nTexas Development Priorities\nOn July 31, 2025, NRG THW GT LLC, a wholly-owned subsidiary of the Company, entered into the First TEF loan to support the development of T.H. Wharton, which is currently under construction. The Company signed an Equity Contribution Agreement and Guaranty with respect to the First TEF Loan. The loan bears interest at a fixed rate of 3.000% per annum and has a final maturity date of July 31, 2045. As of October 31, 2025, $178 million of disbursements for the First TEF loan have occurred.\nOn September 26, 2025, NRG Cedar Bayou 5 LLC, a wholly-owned subsidiary of the Company, entered into the Second TEF loan to support the development of Cedar Bayou 5, which is currently under construction. The Company signed an Equity Contribution Agreement and Guaranty with respect to the Second TEF Loan. The loan bears interest at a fixed rate of 3.000% per annum and has a final maturity date of September 26, 2045. As of October 31, 2025, $230 million of disbursements for the Second TEF loan have occurred.\nIR Bonds\nOn October 23, 2025, the Company remarketed $57 million aggregate principal amount of the IR 2040 Bonds and $190 million aggregate principal amount of the IR 2045 Bonds. For further discussion, see Note 7, \nLong-term Debt and Finance Leases\n.\nLiability Management\nThe Company has currently spent $269 million and intends to spend approximately $6 million from cash from operations on liability management during the remainder of 2025. The Company remains committed to maintaining a strong balance sheet and its targeted credit metrics.\n75\n                                                        \n                                                                            \nMarket Operations\nThe Company's market operations activities require a significant amount of liquidity and capital resources. These liquidity requirements are primarily driven by: (i) margin and collateral posted with counterparties; (ii) margin and collateral required to participate in physical markets and commodity exchanges; (iii) timing of disbursements and receipts (e.g., buying energy before receiving retail revenues); and (iv) initial collateral for large structured transactions. As of September 30, 2025, market operations had total cash collateral outstanding of $358 million and $2.2 billion outstanding in letters of credit to third parties primarily to support its market activities. As of September 30, 2025, total funds deposited by counterparties were $323 million in cash and $339 million of letters of credit.\nFuture liquidity requirements may change based on the Company's hedging activities and structures, fuel purchases, and future market conditions, including forward prices for energy and fuel and market volatility. In addition, liquidity requirements are dependent on the Company's credit ratings and general perception of its creditworthiness.\nFirst Lien Structure\nNRG has the capacity to grant first liens to certain counterparties on a substantial portion of the Company's assets, subject to various exclusions including NRG's assets that have project-level financing and the assets of certain non-guarantor subsidiaries, to reduce the amount of cash collateral and letters of credit that it would otherwise be required to post from time to time to support its obligations under out-of-the-money hedge agreements. The first lien program does not limit the volume that can be hedged, or the value of underlying out-of-the-money positions. The first lien program also does not require NRG to post collateral above any threshold amount of exposure. The first lien structure is not subject to unwind or termination upon a ratings downgrade of a counterparty and has no stated maturity date.\nThe Company's first lien counterparties may have a claim on its assets to the extent market prices exceed the hedged prices. As of September 30, 2025, \nall hedges under the first liens were at-the-money on a counterparty aggregate basis.\nCapital Expenditures\nThe following table summarizes the Company's capital expenditures for maintenance, environmental and investments and integration for the nine months ended September 30, 2025, and the estimated forecast for the remainder of the year.\n(In millions)\nMaintenance\nEnvironmental\nInvestments and Integration\nTotal\nTexas\n$\n175 \n$\n26 \n$\n529 \n$\n730 \nEast\n9 \n— \n— \n9 \nWest/Services/Other\n8 \n— \n1 \n9 \nVivint Smart Home\n10 \n— \n4 \n14 \nCorporate\n17 \n— \n70 \n87 \nTotal cash capital expenditures for the nine months ended September 30, 2025\n(a)\n$\n219 \n$\n26 \n$\n604 \n$\n849 \nIntegration operating expenses and cost to achieve\n— \n— \n32 \n32 \nInvestments\n— \n— \n181 \n181 \nTotal cash capital expenditures and investments for the nine months ended September 30, 2025\n$\n219 \n$\n26 \n$\n817 \n$\n1,062 \nEstimated cash capital expenditures and investments for the remainder of 2025\n171 \n19 \n126 \n316 \nEstimated full year 2025 cash capital expenditures and investments\n$\n390 \n$\n45 \n$\n943 \n$\n1,378 \n(a)\nCapital expenditures exclude W.A. Parish insurance proceeds of $100 million\nInvestments and Integration for the nine months ended September 30, 2025 include growth expenditures, integration, small book acquisitions and other investments.\nEnvironmental Capital Expenditures Estimate\nNRG estimates that environmental capital expenditures from 2025 through 2029 required to comply with environmental laws will be approximately $76 million, primarily driven by the cost of complying with ELG at the Company's coal units in Texas.\n76\n                                                        \n                                                                            \nShare Repurchases\nDuring the nine months ended September 30, 2025, the Company completed $971 million of share repurchases at an average price of $119.78 per share. Through October 31, 2025, an additional $129 million of share repurchases were executed at an average price of $167.41 per share. On October 16, 2025, the Board of Directors authorized an additional share repurchase program of up to $3.0 billion, to be executed through 2028. See Note 9, \nChanges in Capital Structure\n for additional discussion.\nCommon Stock Dividends\nDuring the first quarter of 2025, NRG increased the annual dividend to $1.76 from $1.63 per share. A quarterly dividend of $0.44 per share was paid on the Company's common stock during the three months ended September 30, 2025. On October 20, 2025, NRG declared a quarterly dividend on the Company's common stock of $0.44 per share, payable on November 17, 2025 to stockholders of record as of November 3, 2025. Beginning in the first quarter of 2026, NRG will increase the annual dividend by 8% to $1.90 per share. The Company targets an annual dividend growth rate of 7%-9% per share in subsequent years.\nSeries A Preferred Stock Dividends\nDuring the quarters ended September 30, and March 31, 2025, the Company declared and paid a semi-annual 10.25% dividend of $51.25 per share on its outstanding Series A Preferred Stock, each totaling $33 million.\nObligations \nunder\n Certain Guarantees \nNRG and its subsidiaries enter into various contracts that include indemnifications and guarantee provisions as a routine part of the Company’s business activities. For further discussion, see \nNote 26, \nGuarantees,\n to the Company's 2024 Form 10-K. \nObligations Arising Out of a Variable Interest in an Unconsolidated Entity\nVariable interest in equity investments\n — NRG’s investment in Ivanpah is a variable interest entity for which NRG is not the primary beneficiary. NRG's pro-rata share of non-recourse debt was approximately $461 million as of September 30, 2025. This indebtedness may restrict the ability of Ivanpah to issue dividends or distributions to NRG.\nContractual Obligations and Market Commitments\nNRG has a variety of contractual obligations and other market commitments that represent prospective cash requirements in addition to the Company's capital expenditure programs, as disclosed in the Company's 2024 Form 10-K. See also Note 7, \nLong-term Debt and Finance Leases\n, and Note 14, \nCommitments and Contingencies\n, to this Form 10-Q for a discussion of new commitments and contingencies that also include contractual obligations and market commitments that occurred during the three and nine months ended September 30, 2025.\nCash Flow Discussion\nThe following table reflects the changes in cash flows for the nine months ended September 30, 2025 and 2024, respectively:\nNine months ended September 30,\n(In millions)\n2025\n2024\nChange\nCash provided by operating activities\n$\n1,790 \n$\n1,354 \n$\n436 \nCash (used)/provided by investing activities\n(1,340)\n163 \n(1,503)\nCash used by financing activities\n(540)\n(1,041)\n501 \nCash provided by operating activities\nChanges to cash provided/(used) by operating activities were driven by:\n(In millions)\nIncrease in operating income adjusted for other non-cash items\n$\n349 \nIncrease in working capital primarily driven by deferred revenues and changes in ARO cost estimates\n225 \nDecrease in working capital due to the payment of the CPI legal matter\n(224)\nChanges in cash collateral in support of risk management activities due to change in commodity prices\n156 \nDecrease in working capital primarily due to timing of prepayments\n(99)\nIncrease in other working capital\n29 \n$\n436 \n77\n                                                        \n                                                                            \nCash (used)/provided by investing activities \nChanges to cash (used)/provided by investing activities were driven by:\n(In millions)\nIncrease in capital expenditures\n$\n(563)\nIncrease in cash paid for acquisitions primarily due to the acquisition of the Texas Generation Portfolio in April 2025\n(558)\nDecrease in proceeds from sale of assets primarily due to the sale of the Airtron business unit in 2024\n(489)\nIncrease in insurance proceeds for property, plant and equipment, net\n97 \nIncrease due to fewer purchases of emissions allowances, net of sales\n10 \n$\n(1,503)\nCash used by financing activities \nChanges to cash provided/(used) by financing activities were driven by:\n(In millions)\nIncrease due to fewer repayments of long-term debt and finance leases\n$\n711 \nDecrease primarily due to higher payments for share repurchase activity in 2025\n(683)\nIncrease in proceeds from issuance of long-term debt in 2025\n500 \nDecrease due to payment for settlement of capped call options in 2025\n(292)\nIncrease primarily due to debt extinguishment costs in 2024\n216 \nIncrease in net receipts from settlement of acquired derivatives \n53 \nOther\n(4)\n$\n501 \nNOLs, Deferred Tax Assets and Uncertain Tax Position Implications, under ASC 740 \nFor the nine months ended September 30, 2025, the Company had domestic pre-tax book income of $978 million and foreign pre-tax book income of $92 million. As of December 31, 2024, the Company had cumulative U.S. federal NOL carryforwards of $7 billion, of which $5.3 billion do not have an expiration date, and cumulative state NOL carryforwards of $6.1 billion for financial statement purposes. NRG also has cumulative foreign NOL carryforwards of $394 million, most of which do not have an expiration date. In addition to the above NOLs, NRG has a $274 million indefinite carryforward for interest deductions, as well as $269 million of tax credits, inclusive of $61 million CAMT credits to be utilized in future years. As a result of the Company's tax position, including the utilization of federal and state NOLs, and based on current forecasts, the Company anticipates net income tax payments due to federal, state and foreign jurisdictions of up to $125 million in 2025. NRG as an applicable corporation is subject to the CAMT, however, there is no impact on the Company's provision for income taxes from the CAMT for the nine months ended September 30, 2025.\nAs of September 30, 2025, the Company has $57 million of tax-effected uncertain federal, state, and foreign tax benefits, for which the Company has recorded a non-current tax liability of $62 million (inclusive of accrued interest) until final resolution is reached with the related taxing authority. \nOn December 31, 2021, the OECD released rules which set forth a common approach to a global minimum tax at 15% for multinational companies, which has been enacted into law by certain countries effective for 2024. The Company's preliminary analysis indicates that there is no material impact to the Company's financial statements from these rules. \nThe Company is no longer subject to U.S. federal income tax examinations for years prior to 2021. With few exceptions, state and Canadian income tax examinations are no longer open for years prior to 2015.\nOn July 4, 2025, OBBB was enacted into law. The OBBB includes changes to U.S. tax law that will be applicable to NRG beginning in 2025, such as the permanent extension of certain expiring provisions of the TCJA, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The impact of the OBBB on the Company’s consolidated financial statements has been reflected in its third quarter current and deferred taxes, however, there is no material impact to the income tax expense for the nine months ended September 30, 2025.\nDeferred tax assets and valuation allowance\nNet deferred tax balance\n — As of September 30, 2025 and December 31, 2024, NRG recorded a net deferred tax asset, excluding valuation allowance, of $2.0 billion and $2.2 billion, respectively. The Company believes certain state net operating \n78\n                                                        \n                                                                            \nlosses may not be realizable under the more-likely-than-not measurement and as such, a valuation allowance was recorded as of September 30, 2025 and December 31, 2024 as discussed below.\nNOL Carryforwards — \nAs of September 30, 2025, the Company had a tax-effected cumulative U.S. NOLs consisting of carryforwards for federal and state income tax purposes of $1.5 billion and $341 million, respectively. The Company estimates it will generate future taxable income to fully realize the net federal deferred tax asset before the expiration of certain carryforwards commences in 2030. In addition, NRG has tax-effected cumulative foreign NOL carryforwards of $111 million.\nValuation Allowance\n — As of September 30, 2025 and December 31, 2024, the Company’s tax-effected valuation allowance was $149 million and $144 million, respectively consisting of state NOL carryforwards and foreign NOL carryforwards. The valuation allowance was recorded based on the assessment of cumulative and forecasted pre-tax book earnings and the future reversal of existing taxable temporary differences.\nGuarantor Financial Information\nAs of September 30, 2025, the Company's outstanding registered senior notes consisted of $821 million of the 2028 Senior Notes as shown in Note 7, \nLong-term Debt and Finance Leases\n. These Senior Notes are guaranteed by certain of NRG's current and future 100% owned domestic subsidiaries, or guarantor subsidiaries (the “Guarantors”). See Exhibit 22.1 to this Form 10-Q for a listing of the Guarantors. These guarantees are both joint and several.\nNRG conducts much of its business through and derives much of its income from its subsidiaries. Therefore, the Company's ability to make required payments with respect to its indebtedness and other obligations depends on the financial results and condition of its subsidiaries and NRG's ability to receive funds from its subsidiaries. There are no restrictions on the ability of any of the Guarantors to transfer funds to NRG. Other subsidiaries of the Company do not guarantee the registered debt securities of either NRG Energy, Inc. or the Guarantors (such subsidiaries are referred to as the “Non-Guarantors”). The Non-Guarantors include all of NRG's foreign subsidiaries and certain domestic subsidiaries.\nThe following tables present summarized financial information of NRG Energy, Inc. and the Guarantors in accordance with Rule 3-10 under the SEC's Regulation S-X. The financial information may not necessarily be indicative of the results of operations or financial position of NRG Energy, Inc. and the Guarantors in accordance with U.S. GAAP.\nThe following table presents the summarized statement of operations:\n(In millions)\nNine months ended September 30, 2025\nRevenue\n(a)\n$\n21,035 \nOperating income\n(b)\n1,327 \nTotal other expense\n(450)\nIncome before income taxes\n877 \nNet Income\n631 \n(a)\nIntercompany transactions with Non-Guarantors of $37 million during the nine months ended September 30, 2025\n(b)\nIntercompany transactions with Non-Guarantors including cost of operations of $87 million and selling, general and administrative of $334 million during the nine months ended September 30, 2025\nThe following table presents the summarized balance sheet information:\n(In millions)\nAs of September 30, 2025\nCurrent assets\n(a)\n$\n5,499 \nProperty, plant and equipment, net\n1,444 \nNon-current assets\n15,492 \nCurrent liabilities\n(b)\n7,252 \nNon-current liabilities\n13,589 \n(a)\nIncludes intercompany receivables due from Non-Guarantors of $194 million as of September 30, 2025\n(b)\nIncludes intercompany payables due to Non-Guarantors of $74 million as of September 30, 2025\nFair Value of Derivative Instruments\nNRG may enter into power purchase and sales contracts, fuel purchase contracts and other energy-related financial instruments to mitigate variability in earnings due to fluctuations in spot market prices and to hedge fuel requirements at power plants or retail load obligations. In order to mitigate interest rate risk associated with the issuance of the Company's debt, NRG enters into interest rate derivatives. In addition, in order to mitigate foreign exchange rate risk primarily associated with the purchase of U.S. dollar denominated natural gas for the Company's Canadian business, NRG enters into foreign exchange contract agreements.\n79\n                                                        \n                                                                            \nUnder Flex Pay, offered by Vivint Smart Home, customers pay for smart home products by obtaining financing from a third-party financing provider under the Consumer Financing Program. Vivint Smart Home pays certain fees to the financing providers and shares in credit losses depending on the credit quality of the customer.\nNRG's trading activities are subject to limits in accordance with the Company's Risk Management Policy. These contracts are recognized on the balance sheet at fair value and changes in the fair value of these derivative financial instruments are recognized in earnings.\nThe following tables disclose the activities that include both exchange and non-exchange traded contracts accounted for at fair value in accordance with ASC 820, \nFair Value Measurements and Disclosures \n(\"ASC 820\"). Specifically, these tables disaggregate realized and unrealized changes in fair value; disaggregate estimated fair values as of September 30, 2025, based on their level within the fair value hierarchy defined in ASC 820; and indicate the maturities of contracts at September 30, 2025. For a full discussion of the Company's valuation methodology of its contracts, see \nDerivative Fair Value Measurements\n in Note 5, \nFair Value of Financial Instruments\n.\nDerivative Activity Gains/(Losses)\n(In millions)\nFair Value of Contracts as of December 31, 2024\n$\n992 \nContracts realized or otherwise settled during the period\n(411)\nTexas Generation Portfolio contracts acquired during the period\n(83)\nOther changes in fair value\n(89)\nFair Value of Contracts as of September 30, 2025\n(a)\n$\n409 \n(a)\nIncludes $450 million of derivative contracts that were elected as NPNS on October 1, 2024 and are no longer valued at fair value on a recurring basis. For further discussion, see Note 6, \nAccounting for Derivative Instruments and Hedging Activities\nFair Value of Contracts as of September 30, 2025\n(In millions)\nMaturity\nFair Value Hierarchy (Losses)/Gains\n(a)\n1 Year or Less\nGreater than 1 Year to 3 Years\nGreater than 3 Years to 5 Years\nGreater than 5 Years\nTotal Fair\nValue\nLevel 1\n$\n(4)\n$\n7 \n$\n1 \n$\n(1)\n$\n3 \nLevel 2\n56 \n93 \n21 \n4 \n174 \nLevel 3\n(121)\n(106)\n(7)\n16 \n(218)\nTotal\n$\n(69)\n$\n(6)\n$\n15 \n$\n19 \n$\n(41)\n(a)\nExcludes $450 million of derivative contracts that were elected as NPNS on October 1, 2024 and are no longer valued at fair value on a recurring basis. For further discussion, see Note 6, \nAccounting for Derivative Instruments and Hedging Activities\nThe Company has elected to disclose derivative assets and liabilities on a trade-by-trade basis and does not offset amounts at the counterparty master agreement level. Also, collateral received or posted on the Company's derivative assets or liabilities are recorded on a separate line item on the balance sheet. Consequently, the magnitude of the changes in individual current and non-current derivative assets or liabilities is higher than the underlying credit and market risk of the Company's portfolio. As discussed in Item 3,\n Quantitative and Qualitative Disclosures About Market Risk — Commodity Price Risk\n, to this Form 10-Q, NRG measures the sensitivity of the Company's portfolio to potential changes in market prices using VaR, a statistical model which attempts to predict risk of loss based on market price and volatility. NRG's Risk Management Policy places a limit on one-day holding period VaR, which limits the Company's net open position. As the Company's trade-by-trade derivative accounting results in a gross-up of the Company's derivative assets and liabilities, the net derivative asset and liability position is a better indicator of NRG's hedging activity. As of September 30, 2025, NRG's net derivative asset was $409 million, a decrease to total fair value of $583 million as compared to December 31, 2024. This decrease was driven by the roll-off of trades that settled during the period, losses in fair value and the Texas Generation Portfolio contracts acquired.\nBased on a sensitivity analysis using simplified assumptions, the impact of a $0.50 per MMBtu increase in natural gas prices across the term of the derivative contracts would result in an increase of approximately $957 million in the net value of derivatives as of September 30, 2025. The impact of a $0.50 per MMBtu decrease in natural gas prices across the term of the derivative contracts would result in a decrease of approximately $953 million in the net value of derivatives as of September 30, 2025. \nCritical Accounting Estimates \nNRG's discussion and analysis of the financial condition and results of operations are based upon the condensed consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these financial statements and related disclosures in compliance with GAAP requires the application of appropriate technical accounting rules \n80\n                                                        \n                                                                            \nand guidance as well as the use of estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosures of contingent assets and liabilities. The application of appropriate technical accounting rules and guidance involves judgments regarding future events, including the likelihood of success of particular projects, legal and regulatory challenges, and the fair value of certain assets and liabilities. These judgments, in and of themselves, could materially affect the financial statements and disclosures based on varying assumptions, which may be appropriate to use. In addition, the financial and operating environment may also have a significant effect, not only on the operation of the business, but on the results reported through the application of accounting measures used in preparing the financial statements and related disclosures, even if the nature of the accounting policies has not changed.\nNRG evaluates these estimates, on an ongoing basis, utilizing historic experience, consultation with experts and other methods the Company considers reasonable. In any event, actual results may differ substantially from the Company's estimates. Any effects on the Company's business, financial position or results of operations resulting from revisions to these estimates are recorded in the period in which the information that gives rise to the revision becomes known.\nThe Company identifies its most critical accounting estimates as those that are the most pervasive and important to the portrayal of the Company's financial position and results of operations, and require the most difficult, subjective and/or complex judgments by management regarding estimates about matters that are inherently uncertain. \nThe Company's critical accounting estimates are described in Part II, Item 7, \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n,\n \nin the Company's 2024 Form 10-K. There have been no material changes to the Company's critical accounting estimates since the 2024 Form 10-K."
}