{
  "item1": "There continuing strong competition among rail, water, highway carriers. Price usually only one factor importance shippers receivers choose transport mode specific hauling company. Inventory carrying costs, service reliability, ease handling, desire avoid loss damage during transit also important considerations, especially higher-valued finished goods, machinery, consumer products. Even raw materials, semi-finished goods, work-in-progress, users increasingly sensitive transport arrangements minimize problems successive production stages.",
  "item7": "($ millions, except per share amounts) Railway operating expenses Income railway operations Diluted earnings per share Railway operating ratio (percent) adjusted basis, income railway operations 2024 increased due lower adjusted railway operating expenses, lower fuel prices, decreased costs purchased services, lower other expenses contributing significantly overall decline, more than offsetting decline revenue. Lower other income-net higher interest expense debt contributed net income diluted earnings per share only up slightly compared prior year. 2023, non-GAAP basis excluding impact direct costs resulting Incident, income railway operations decreased due lower railway operating revenues higher railway operating expenses. Railway operating revenues declined due decreased fuel surcharge revenue, decreased intermodal storage revenues, lower volume, partially offset increased pricing favorable mix compared prior year.",
  "item2": "Domestic volume decreased both periods driven reduced traffic originating West Coast reduced premium shipments. International volume flat third quarter but increased first nine months primarily driven increased volume during first six months anticipation potential changes tariffs. Coal revenues declined both periods due lower average revenue per unit, driven reduced pricing, adverse mix, lower fuel surcharge revenue. Volume decreased third quarter but increased first nine months."
}