{
  "source_file": "nsc-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nThe following discussion and analysis should be read in conjunction with the Consolidated Financial Statements and Notes.  \n \nOVERVIEW\n \nSince 1827, Norfolk Southern Corporation and its predecessor companies have safely moved the goods and materials that drive the U.S. economy.  Our dedicated team members deliver a wide variety of commodities annually for our customers, from agriculture products to consumer goods, and help them reduce carbon emissions by shipping via rail.  We have the most extensive intermodal network in the eastern U.S.  Our network serves a majority of the country's population and manufacturing base, with connections to every major container port on the Atlantic coast as well as major ports across the Gulf Coast and Great Lakes.  \nOn July 28, 2025, we entered into a Merger Agreement with Union Pacific, an agreement to create America’s first transcontinental railroad.  Details are further described in Note 1 in the Notes to Consolidated Financial Statements.  \n \nOur third quarter financial results reflected continued improvements in labor productivity and fuel efficiency while also delivering revenue growth driven by increased automotive and chemicals traffic.  Significantly impacting the comparison of our financial results to the prior year is the absence of $380 million in gains on sales of railway lines that occurred in 2024.  Additionally, net benefits related to the Eastern Ohio Incident (as defined further and described in Note 15 in the Notes to Consolidated Financial Statements) were lower in the current year.  For the third quarter, we achieved an operating ratio (a measure of the amount of operating revenues consumed by operating expenses) of 64.6%, and an adjusted operating ratio of 63.3% (see our non-GAAP reconciliations beginning on page 29).  We remain committed to being a safe, productive, resilient, and efficient railroad with industry-competitive margins.  \nSUMMARIZED RESULTS OF OPERATIONS\nThird Quarter\nFirst Nine Months\n2025\n2024\n% change\n2025\n2024\n% change\n($ in millions, except per share amounts)\nRailway operating revenues\n$\n3,103 \n$\n3,051 \n2%\n$\n9,206 \n$\n9,099 \n1%\nRailway operating expenses\n$\n2,005 \n$\n1,455 \n38%\n$\n5,787 \n$\n6,159 \n(6%)\nIncome from railway operations\n$\n1,098 \n$\n1,596 \n(31%)\n$\n3,419 \n$\n2,940 \n16%\nNet income\n$\n711 \n$\n1,099 \n(35%)\n$\n2,229 \n$\n1,889 \n18%\nDiluted earnings per share\n$\n3.16 \n$\n4.85 \n(35%)\n$\n9.88 \n$\n8.34 \n18%\nRailway operating ratio (percent)\n64.6 \n47.7 \n35%\n62.9 \n67.7 \n(7%)\nIncome from railway operations, net income, and diluted earnings per share decreased in the third quarter but increased for the first nine months.  The decrease in the third quarter was the result of higher railway operating expenses as 2024 included significant gains on sales of railway lines and higher insurance recoveries related to the Eastern Ohio Incident.  For the first nine months, railway operating expenses were lower.  In 2025, insurance and other recoveries resulting from the Incident exceeded incremental Incident-related costs.  Additionally, expenses associated with restructuring activities were lower.  Partially offsetting those items were lower gains from the sales of railway lines and properties.  Both periods reflect higher railway operating revenues, driven by a combination of improved traffic mix, favorable pricing, and increased volume, which was partially offset by lower fuel surcharge revenue.\n28\nThe following tables adjust our GAAP financial results for the third quarter and first nine months of 2025 to exclude Merger-related expenses, restructuring and other charges, and the overall impact on operating expenses resulting from costs and recoveries associated with the Incident.  The following tables adjust our GAAP financial results for the third quarter and first nine months of 2024 to exclude gains on railway line sales, restructuring and other charges, and costs and recoveries associated with the Incident.  Additionally, the adjusted results for the first nine months of 2024 exclude shareholder advisory costs and a deferred income tax adjustment.  The income tax effects of these non-GAAP adjustments were calculated based on the applicable tax rates to which the non-GAAP adjustments related.  We use these non-GAAP financial measures internally and believe this information provides useful supplemental information to investors to facilitate making period-to-period comparisons by excluding these items.  While we believe that these non-GAAP financial measures are useful in evaluating our business, this information should be considered as supplemental in nature and is not meant to be considered in isolation from, or as a substitute for, the related financial information prepared in accordance with GAAP.  In addition, these non-GAAP financial measures may not be the same as similar measures presented by other companies.  \nNon-GAAP Reconciliation for Third Quarter 2025\nReported   (GAAP)\nMerger - Related Expenses\nRestructuring and Other Charges\nEastern Ohio Incident\nAdjusted (non-GAAP)\n($ in millions, except per share amounts)\nRailway operating expenses\n$\n2,005 \n$\n(15)\n$\n(12)\n$\n(13)\n$\n1,965 \nIncome from railway operations\n$\n1,098 \n$\n15 \n$\n12 \n$\n13 \n$\n1,138 \nNet income\n$\n711 \n$\n11 \n$\n9 \n$\n10 \n$\n741 \nDiluted earnings per share\n$\n3.16 \n$\n0.05 \n$\n0.04 \n$\n0.05 \n$\n3.30 \nRailway operating ratio (percent)\n64.6 \n(0.5)\n(0.4)\n(0.4)\n63.3 \nNon-GAAP Reconciliation for Third Quarter 2024\nReported  (GAAP)\nGains on Railway Line Sales\nRestructuring and Other Charges\nEastern Ohio Incident\nAdjusted\n(non-GAAP)\n($ in millions, except per share amounts)\nRailway operating expenses\n$\n1,455 \n$\n380 \n$\n(60)\n$\n159 \n$\n1,934 \nIncome from railway operations\n$\n1,596 \n$\n(380)\n$\n60 \n$\n(159)\n$\n1,117 \nNet income\n$\n1,099 \n$\n(287)\n$\n45 \n$\n(120)\n$\n737 \nDiluted earnings per share\n$\n4.85 \n$\n(1.27)\n$\n0.20 \n$\n(0.53)\n$\n3.25 \nRailway operating ratio (percent)\n47.7 \n12.5 \n(2.0)\n5.2 \n63.4 \n29\nIn the table below, references to the results for the third quarters of 2025 and 2024 and related comparisons use the adjusted, non-GAAP results from the reconciliations in the tables above.  \nThird Quarter\nAdjusted 2025\n(non-GAAP)\nAdjusted 2024\n(non-GAAP)\nAdjusted 2025 \nvs. Adjusted 2024\n(non-GAAP)\n($ in millions, except per share amounts)\n% change\nRailway operating expenses\n$\n1,965 \n$\n1,934 \n2%\nIncome from railway operations\n$\n1,138 \n$\n1,117 \n2%\nNet income\n$\n741 \n$\n737 \n1%\nDiluted earnings per share\n$\n3.30 \n$\n3.25 \n2%\nRailway operating ratio (percent)\n63.3 \n63.4 \n—%\nNon-GAAP Reconciliation for First Nine Months 2025\nReported (GAAP)\nMerger - Related Expenses\nRestructuring and Other Charges\nEastern Ohio Incident\nAdjusted \n(non-GAAP)\n($ in millions, except per share amounts)\nRailway operating expenses\n$\n5,787 \n$\n(15)\n$\n(22)\n$\n219 \n$\n5,969 \nIncome from railway operations\n$\n3,419 \n$\n15 \n$\n22 \n$\n(219)\n$\n3,237 \nNet income\n$\n2,229 \n$\n11 \n$\n17 \n$\n(166)\n$\n2,091 \nDiluted earnings per share\n$\n9.88 \n$\n0.05 \n$\n0.07 \n$\n(0.73)\n$\n9.27 \nRailway operating ratio (percent)\n62.9 \n(0.2)\n(0.3)\n2.4 \n64.8 \nNon-GAAP Reconciliation for First Nine Months 2024\nReported (GAAP)\nGains on Railway Line Sales\nRestructuring\n and Other Charges\nEastern Ohio Incident\nShareholder Advisory Costs\nDeferred Income Tax Adjustment\nAdjusted 2024\n(non-GAAP)\n($ in millions, except per share amounts)\nRailway operating   \n$\n6,159 \n$\n380 \n$\n(156)\n$\n(368)\n$\n— \n$\n— \n$\n6,015 \n    expenses\nIncome from  \n    railway\n$\n2,940 \n$\n(380)\n$\n156 \n$\n368 \n$\n— \n$\n— \n$\n3,084 \n    operations\nNet income\n$\n1,889 \n$\n(287)\n$\n104 \n$\n279 \n$\n38 \n$\n(27)\n$\n1,996 \nDiluted earnings \n$\n8.34 \n$\n(1.27)\n$\n0.46 \n$\n1.23 \n$\n0.17 \n$\n(0.12)\n$\n8.81 \n    per share\nRailway operating \n67.7 \n4.2 \n(1.7)\n(4.1)\n— \n— \n66.1 \n    ratio (percent)\n30\nIn the table below, references to the results for the first nine months of 2025 and 2024 and related comparisons use the adjusted, non-GAAP results from the reconciliation in the tables above.  \nFirst Nine Months\nAdjusted 2025\n(non-GAAP)\nAdjusted 2024\n(non-GAAP)\nAdjusted 2025 \nvs. Adjusted 2024\n(non-GAAP)\n($ in millions, except per share amounts)\n% change\nRailway operating expenses\n$\n5,969 \n$\n6,015 \n(1%)\nIncome from railway operations\n$\n3,237 \n$\n3,084 \n5%\nNet income\n$\n2,091 \n$\n1,996 \n5%\nDiluted earnings per share\n$\n9.27 \n$\n8.81 \n5%\nRailway operating ratio (percent)\n64.8 \n66.1 \n(2%)\nOn an adjusted basis, income from railway operations increased in both periods.  Railway operating revenues were higher in both periods, driven by a combination of improved traffic mix, favorable pricing, and increased volume, which was partially offset by lower fuel surcharge revenue.  Adjusted railway operating expenses increased in the third quarter but decreased for the first nine months.  Both periods reflect higher expenses in compensation and benefits, equipment rents, claims, and materials, which were partially offset by higher gains from the sales of operating property in the current year.  The first nine months includes the impact of lower fuel prices, while the third quarter reflects higher fuel prices.  \n31\nDETAILED RESULTS OF OPERATIONS\n \nRailway Operating Revenues\nThe following tables present a comparison of revenues ($ in millions), units (in thousands), and average revenue per unit ($ per unit) by commodity group.  \nThird Quarter\nFirst Nine Months\nRevenues \n2025\n2024\n% change\n2025\n2024\n% change\nMerchandise:\nAgriculture, forest and consumer products\n$\n630 \n$\n624 \n1%\n$\n1,911 \n$\n1,875 \n2%\nChemicals\n569 \n543 \n5%\n1,650 \n1,602 \n3%\nMetals and construction\n448 \n420 \n7%\n1,320 \n1,290 \n2%\nAutomotive\n322 \n274 \n18%\n923 \n861 \n7%\nMerchandise\n1,969 \n1,861 \n6%\n5,804 \n5,628 \n3%\nIntermodal\n759 \n763 \n(1%)\n2,262 \n2,250 \n1%\nCoal\n375 \n427 \n(12%)\n1,140 \n1,221 \n(7%)\nTotal\n$\n3,103 \n$\n3,051 \n2%\n$\n9,206 \n$\n9,099 \n1%\nUnits \nMerchandise:\nAgriculture, forest and consumer products\n182.5 \n186.3 \n(2%)\n552.5 \n551.6 \n—%\nChemicals\n141.3 \n128.9 \n10%\n412.4 \n389.5 \n6%\nMetals and construction\n168.0 \n160.8 \n4%\n487.4 \n489.3 \n—%\nAutomotive\n103.3 \n87.9 \n18%\n295.6 \n273.4 \n8%\nMerchandise\n595.1 \n563.9 \n6%\n1,747.9 \n1,703.8 \n3%\nIntermodal\n1,032.1 \n1,052.2 \n(2%)\n3,065.9 \n3,044.5 \n1%\nCoal\n176.7 \n185.3 \n(5%)\n523.1 \n515.3 \n2%\nTotal\n1,803.9 \n1,801.4 \n—%\n5,336.9 \n5,263.6 \n1%\nRevenue per Unit \nMerchandise:\nAgriculture, forest and consumer products\n$\n3,453 \n$\n3,351 \n3%\n$\n3,458 \n$\n3,399 \n2%\nChemicals\n4,028 \n4,210 \n(4%)\n4,001 \n4,112 \n(3%)\nMetals and construction\n2,672 \n2,611 \n2%\n2,710 \n2,636 \n3%\nAutomotive\n3,115 \n3,114 \n—%\n3,122 \n3,149 \n(1%)\nMerchandise\n3,310 \n3,299 \n—%\n3,321 \n3,303 \n1%\nIntermodal\n735 \n726 \n1%\n738 \n739 \n—%\nCoal\n2,120 \n2,306 \n(8%)\n2,179 \n2,370 \n(8%)\nTotal\n1,721 \n1,694 \n2%\n1,725 \n1,729 \n—%\n32\nRailway operating revenues increased $52 million and $107 million in the third quarter and first nine months, respectively.  The table below reflects the components of the revenue change by major commodity group ($ in millions).  \nThird Quarter\nFirst Nine Months\nMerchandise\nIntermodal\nCoal\nMerchandise\nIntermodal\nCoal\nIncrease (Decrease)\nVolume\n$\n103 \n$\n(15)\n$\n(20)\n$\n146 \n$\n16 \n$\n18 \nFuel surcharge revenue\n(14)\n(11)\n(5)\n(76)\n(51)\n(17)\nRate, mix and other\n19 \n22 \n(27)\n106 \n47 \n(82)\nTotal\n$\n108 \n$\n(4)\n$\n(52)\n$\n176 \n$\n12 \n$\n(81)\n \nApproximately 95% of our revenue base is covered by contracts that include negotiated fuel surcharges.  Revenues associated with these surcharges totaled $208 million and $238 million in the third quarters of 2025 and 2024, respectively, and $613 million and $757 million for the first nine months of 2025 and 2024, respectively.  The decrease in fuel surcharge revenues is driven by lower fuel commodity prices. \nMerchandise\nMerchandise revenues increased in both periods due to higher volume and increased average revenue per unit, driven by increased pricing and favorable mix partially offset by lower fuel surcharge revenue.\nAgriculture, forest and consumer products volume decreased in third quarter but was flat for the first nine months.  Corn shipments declined in the third quarter due to decreased demand for shipments to the southeast over the prior year. \nChemicals volume rose in both periods, primarily due to increased natural gas liquids and sand shipments, where the mix of traffic had an unfavorable impact on revenue per unit.  Natural gas liquids volume rose due to increased demand for product bound for export markets.  Sand volume increased due to strong demand to support natural gas drilling.  \nMetals and construction volume increased in the third quarter but was flat for the first nine months.  Scrap metal and iron and steel volume increased in both periods due to stronger demand.  Weather-related impacts earlier in the year negatively impacted shipments of aggregates.\nAutomotive volumes increased in both periods, driven by shippers increasing volume in anticipation of potential changes to tariffs, growth with existing customers and the absence of customer production issues seen in the prior year.\n33\nIntermodal\n \nIntermodal revenues decreased in the third quarter but increased for the first nine months.  The third quarter decline was due to lower volume, partially offset by higher average revenue per unit, driven by increased pricing, partially offset by lower fuel surcharge revenue and adverse mix.  The increase in the first nine months was the result of higher volumes and flat average revenue per unit with increased pricing being offset by lower fuel surcharge revenue and adverse mix.\nIntermodal units (in thousands) by market were as follows:  \n \nThird Quarter\nFirst Nine Months\n2025\n2024\n% change\n2025\n2024\n% change\nDomestic\n616.7 \n637.7 \n(3%)\n1,828.6 \n1,844.4 \n(1\n%)\nInternational\n415.4 \n414.5 \n—%\n1,237.3 \n1,200.1 \n3\n%\nTotal\n1,032.1 \n1,052.2 \n(2%)\n3,065.9 \n3,044.5 \n1\n%\nDomestic volume decreased in both periods driven by reduced traffic originating on the West Coast and reduced premium shipments.  International volume was flat in the third quarter but increased for the first nine months primarily driven by increased volume during the first six months in anticipation of potential changes to tariffs. \nCoal\nCoal revenues declined in both periods due to lower average revenue per unit, driven by reduced pricing, adverse mix, and lower fuel surcharge revenue.  Volume decreased in the third quarter but increased for the first nine months.\nCoal tonnage (in thousands) by market was as follows:\n \nThird Quarter\nFirst Nine Months\n \n2025\n2024\n% change\n2025\n2024\n% change\nUtility\n8,735 \n8,272 \n6%\n25,343 \n22,846 \n11%\nExport\n7,434 \n8,816 \n(16%)\n23,198 \n24,812 \n(7%)\nDomestic metallurgical\n2,661 \n2,706 \n(2%)\n7,488 \n7,472 \n—%\nIndustrial\n977 \n991 \n(1%)\n2,712 \n2,640 \n3%\nTotal\n19,807 \n20,785 \n(5%)\n58,741 \n57,770 \n2%\n \nUtility tonnage increased in both periods due to higher electricity demand and higher natural gas prices.  Export tonnage decreased in both periods due to soft global demand and unfavorable seaborne coal pricing.  Domestic metallurgical tonnage decreased in the third quarter due to customer outages.  Industrial coal tonnage increased for the first nine months as a result of increased demand. \n34\nRailway Operating Expenses\nRailway operating expenses summarized by major classifications follow ($ in millions):  \nThird Quarter\nFirst Nine Months\n2025\n2024\n% change\n2025\n2024\n% change\nCompensation and benefits\n$\n738 \n$\n690 \n7%\n$\n2,169 \n$\n2,126 \n2%\nPurchased services\n414 \n405 \n2%\n1,224 \n1,244 \n(2%)\nEquipment rents\n105 \n92 \n14%\n313 \n297 \n5%\nFuel\n237 \n216 \n10%\n700 \n757 \n(8%)\nDepreciation\n348 \n339 \n3%\n1,040 \n1,011 \n3%\nMaterials\n104 \n96 \n8%\n302 \n286 \n6%\nClaims\n75 \n66 \n14%\n200 \n164 \n22%\nOther\n(32)\n(350)\n91%\n45 \n(250)\n118%\nMerger-related expenses\n15 \n— \n15 \n— \nRestructuring and other charges\n12 \n60 \n(80%)\n22 \n156 \n(86%)\nEastern Ohio incident\n(11)\n(159)\n93%\n(243)\n368 \n(166%)\nTotal\n$\n2,005 \n$\n1,455 \n38%\n$\n5,787 \n$\n6,159 \n(6%)\nCompensation and benefits\n expense increased in both periods as follows:  \n•\nincentive and stock-based compensation (up $52 million for the quarter and $105 million for the first nine months),\n•\npay rates (up $17 million for the quarter and $60 million for the first nine months),\n•\nhealth and welfare benefits (down $9 million for the quarter and $32 million for the first nine months),\n•\nemployee activity levels (down $8 million for the quarter and $76 million for the first nine months), and\n•\nother (down $4 million for the quarter and $14 million for the first nine months).\nAverage rail headcount for the quarter was down by approximately 510 compared with the third quarter of 2024.\nPurchased services \nincludes the costs of services purchased from external vendors and contractors, including the net costs of operating joint facilities with other railroads.  These expenses increased in the third quarter but decreased in the first nine months.  The third quarter increase was due to higher derailment-related and bridge repair expenses.  The decrease in the first nine months was driven by productivity initiatives, partially offset by higher intermodal lift costs and weather-related response costs.\nEquipment rents\n, which includes our cost of using equipment (mostly freight cars) owned by other railroads or private owners less the rent paid to us for the use of our equipment, increased in both periods due to higher automotive equipment expense resulting from higher volumes.\nFuel\n expense, which includes the cost of locomotive fuel as well as other fuel used in railway operations increased in the third quarter, but decreased in the first nine months.  Locomotive fuel price increased 11% in the third quarter, but decreased 6% for the first nine months.  Locomotive fuel consumption decreased in both periods (down 1% in the third quarter and 2% for the first nine months). \nDepreciation \nexpense increased in both periods due to a higher asset base.  \n35\nMaterials\n expense increased in both periods due to higher expenses related to intermodal and engineering material consumption while the third quarter also reflected increased locomotive material consumption.\nClaims\n expense includes costs related to personal injury, property damage, and environmental matters.  Claims expense was higher in both periods as a result of increased expenses associated with environmental matters unrelated to the Incident, personal injury case development, and insurance premiums.  \nOther\n expense increased in both periods primarily due to the absence of railway line sales in the current year.  In 2024, the sale of railway lines in the states of Virginia and North Carolina generated gains of $380 million.  Gains from the sales of operating property totaled $85 million and $20 million in the third quarters of 2025 and 2024, respectively, and $142 million and $45 million in the first nine months of 2025 and 2024, respectively.  The gains for the third quarter and first nine months of 2025 were largely driven by a significant land sale that we expect to result in additional traffic volumes in the future.\nMerger-related expenses \nprimarily relate to third-party advisor fees, legal fees, and costs associated with employee retention arrangements and were $15 million in the third quarter of 2025.\nRestructuring and other charges\n in 2025 includes expenses associated with the rationalization of certain software development projects that had not been placed into service and the restructuring of certain technology functions, including severance costs for impacted employees.  Restructuring and other charges in 2024 includes expenses associated with our voluntary and involuntary separation programs that reduced our management workforce, expenses associated with the rationalization of certain software development projects that had not been placed into service, costs associated with the appointment of our new chief operating officer, and the disposition of an asset class.  We incurred expenses of $12 million and $60 million in the third quarters of 2025 and 2024, respectively, and $22 million and $156 million for the first nine months of 2025 and 2024, respectively. \nEastern Ohio incident \nactivity during the third quarters of 2025 and 2024 pertained to insurance and other recoveries that exceeded additional Incident-related expenses by $11 million and $159 million, respectively.  For the first nine months of 2025, our recoveries exceeded additional Incident-related expenses by $243 million whereas we incurred expenses of $368 million for costs associated with the Incident, net of recoveries, for the same period last year.  Recoveries collected exceeded incremental cash expenditures by $227 million for the first nine months of 2025, while cash expenditures attributable to the Incident, net of recovery proceeds, were $32 million for the first nine months of 2024, which are presented in “Net cash provided by operating activities” on the Consolidated Statements of Cash Flows.  For further details regarding the Incident, see Note 15 in the Notes to Consolidated Financial Statements.\nOther income – net \nOther income \n–\n net decreased $11 million in the third quarter, but increased $9 million for the first nine months.  Both periods were impacted by lower returns on COLI and higher pension and postretirement benefits expense, partially offset by higher interest income.  The first nine months also reflect the absence of costs associated with shareholder matters incurred in 2024 and a $20 million curtailment gain on our other postretirement benefit plan in 2024.  \nIncome taxes\n \nThe effective tax rate for both the third quarter and first nine months of 2025 was 23.1% compared with 23.0% and 21.3% for the same periods last year.  The rate for the first nine months of 2024 reflects a $13 million deferred income tax benefit due to a change in state corporate income tax rate and a $27 million deferred income tax benefit from subsidiary restructuring. \n36\nOn July 4, 2025, OBBBA was signed into law.  The OBBBA makes permanent or introduces certain changes to the Internal Revenue Code, including 100% bonus depreciation, the deductibility of business interest expense, and expensing of domestic research costs.  FASB ASC 740 “\nIncome Taxes\n” requires that the effect of changes in tax rates and laws be recognized in the period in which the legislation is enacted.  The primary effect of OBBBA was a reclassification from current to deferred taxes.\nFINANCIAL CONDITION AND LIQUIDITY\n \nCash provided by operating activities, our principal source of liquidity, was $3.3 billion for the first nine months of 2025, compared with $3.1 billion for the same period of 2024.  The increase reflects improved operating results.  We had negative working capital of $488 million and $357 million at September 30, 2025 and December 31, 2024, respectively.  Our negative working capital position improved as compared to June 30, 2025, and we expect to accumulate cash and cash equivalents throughout the period in which the Merger is subject to review and approval.  Cash and cash equivalents totaled $1.4 billion at September 30, 2025.\nCash used in investing activities was $1.9 billion for the first nine months of 2025, compared with $2.8 billion for the same period last year.  The decrease was driven by the prior year acquisition of the assets of the Cincinnati Southern Railway (CSR) and lower property additions in the current year, which was partially offset by lower proceeds from property sales and other transactions and increased COLI loan repayments. \nCash used in financing activities was $1.6 billion for the first nine months of 2025, compared with $903 million for the same period last year.  The increase reflects increased repurchases of Common Stock and lower proceeds from borrowing, partially offset by lower debt repayments.  We repurchased $534 million of Common Stock, inclusive of excise taxes paid, during the first nine months of 2025, while we did not repurchase any Common Stock during the same period last year.  As of September 30, 2025, $6.3 billion remains authorized by our Board of Directors for future repurchase activity.  With limited exceptions, the Merger Agreement prohibits the Company from repurchasing shares of its common stock without approval by Union Pacific.  As a result, the Company has suspended share repurchase activities.\n \nIn May 2025, we issued $400 million of 5.10% senior notes due 2035.\nIn May 2025, we renewed our accounts receivable securitization program with a maximum borrowing capacity of $400 million.  Amounts under our accounts receivable securitization program are borrowed and repaid from time to time in the ordinary course for general corporate and cash management purposes.  The term of our accounts receivable securitization program expires in May 2026.  We had no amounts outstanding under this program and our available borrowing capacity was $400 million at both September 30, 2025 and December 31, 2024.  \nIn June 2024, we entered into an agreement that provides us the ability to issue up to $800 million of unsecured commercial paper and is backed by our credit agreement.  The unsecured short-term commercial paper program provides for borrowing at prevailing rates and includes covenants.  At both September 30, 2025 and December 31, 2024, we had no outstanding commercial paper.  \nIn January 2024, we renewed and amended our $800 million credit agreement.  The amended agreement expires in January 2029, and provides for borrowings at prevailing rates and includes covenants.  We had no amounts outstanding under this facility at either September 30, 2025 or December 31, 2024, and we are in compliance with all of its covenants.  \nIn addition, we have investments in general purpose COLI policies and have the ability to borrow against these policies.  We had no amounts borrowed against these policies at September 30, 2025 and $605 million borrowed at December 31, 2024.  Our remaining borrowing capacity was approximately $600 million and $40 million at September 30, 2025 and December 31, 2024, respectively.\n37\nOur debt-to-total capitalization ratio was 53.0% at September 30, 2025 and 54.6% at December 31, 2024.  We expect cash on hand combined with cash provided by operating activities will be sufficient to meet our ongoing obligations.  In addition, we believe our currently-available borrowing capacity, access to additional financing, and ability to decrease shareholder distributions provide additional flexibility to meet our ongoing obligations, subject to certain restrictions on the incurrence of additional indebtedness under the Merger Agreement.  There have been no material changes to the information on future contractual obligations, including those that may have material cash requirements, contained in our Form 10-K for the year ended December 31, 2024, with the exception of additional senior notes (see Note 12) and over $600 million of additional unconditional purchase obligations, which extend through 2030.\nCRITICAL ACCOUNTING ESTIMATES\n \nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenue and expenses during the reporting period.  These estimates and assumptions may require judgment about matters that are inherently uncertain, and future events are likely to occur that may require us to make changes to these estimates and assumptions.  Accordingly, we regularly review these estimates and assumptions based on historical experience, changes in the business environment, and other factors we believe to be reasonable under the circumstances.  There have been no significant changes to the critical accounting estimates contained in our Form 10-K at December 31, 2024.\nOTHER MATTERS\n \nLabor Agreements\nApproximately 80% of our railroad employees are covered by collective bargaining agreements with various labor unions.  Pursuant to the RLA, these agreements remain in effect until new agreements are reached, or until the bargaining procedures mandated by the RLA are completed.  Moratorium provisions in the labor agreements govern when the railroads and unions may propose changes to the agreements.  We largely bargain nationally in concert with other major railroads, represented by the NCCC.\nUnder moratorium provisions from the last round of negotiations, neither party was permitted to serve notice to compel a new round of mandatory collective bargaining until November 1, 2024.  In the months prior to the opening of the current national bargaining round, we engaged in voluntary local discussions with our labor unions and, as a result, reached local tentative agreements with ten of our thirteen unions.  A majority of those tentative agreements were subsequently ratified by union membership and became effective January 1, 2025, foreclosing the parties from serving new notices to compel mandatory bargaining until November 1, 2029.\nFor those unions with whom we had not yet reached a ratified agreement, the NCCC, on behalf of Norfolk Southern, sent bargaining notices on November 1, 2024, to commence mandatory direct negotiations as prescribed under the RLA.  Since then, the NCCC has reached several additional agreements on behalf of Norfolk Southern and other members of the bargaining coalition.\nFor unions where bargaining currently remains open, even if the parties are unable to reach a voluntary ratified agreement during this first phase of RLA bargaining, self-help (e.g., a strike or other work stoppage) related to this collective-bargaining process remains prohibited by law until a lengthy series of additional procedures mandated by the RLA, including federal mediation, are exhausted.\nInflation\nIn preparing financial statements, GAAP requires the use of historical cost that disregards the effects of inflation on the replacement cost of property.  As a capital-intensive company, we have most of our capital invested in long-\n38\nlived assets.  The replacement cost of these assets, as well as the related depreciation expense, would be substantially greater than the amounts reported on the basis of historical cost.\nFORWARD-LOOKING STATEMENTS\n \nCertain statements in this report, including in Management’s Discussion and Analysis of Financial Condition and Results of Operations, are “forward-looking statements” within the meaning of the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, as amended.  These statements relate to future events or our future financial performance and involve known and unknown risks, uncertainties, and other factors that may cause our actual results, levels of activity, performance, or our achievements or those of our industry to be materially different from those expressed or implied by any forward-looking statements.  In some cases, forward-looking statements can be identified by terminology such as “may,” “will,” “could,” “would,” “should,” “expect,” “plan,” “anticipate,” “intend,” “believe,” “estimate,” “project,” “consider,” “predict,” “potential,” “feel,” or other comparable terminology.  We have based these forward-looking statements on our current expectations, assumptions, estimates, beliefs, and projections.  While we believe these expectations, assumptions, estimates, beliefs, and projections are reasonable, such forward-looking statements are only predictions and involve known and unknown risks and uncertainties, many of which involve factors or circumstances that are beyond our control.  The following important factors, including those discussed under “Risk Factors” in our latest Form 10-K as well as our subsequent filings with the Securities and Exchange Commission, may cause actual results, performance, or achievements to differ materially from those expressed or implied by these forward-looking statements:\n•\nchanges in domestic or international economic, political or business conditions, including those impacting the transportation industry;\n•\nour ability to successfully implement our operational, productivity, and strategic initiatives;\n•\na significant adverse event on our network, including but not limited to a mainline accident, discharge of hazardous material, or climate-related or other network outage;\n•\nthe outcome of claims, litigation, governmental proceedings, and investigations involving the Company, including but not limited to the Incident Proceedings;\n•\nthe nature and extent of the Company's environmental remediation obligations with respect to the Incident;\n•\nnew or additional governmental regulation and/or operational changes resulting from or related to the Incident or the Incident Proceedings;\n•\na significant cybersecurity incident or other disruption to our technology infrastructure; \n•\nour ability to complete the Mergers with Union Pacific;\n•\nthe occurrence of any event, change or other circumstance that could give rise to the right of one or both of the Company or Union Pacific to terminate the Merger Agreement; \n•\nthe possibility that the Mergers do not close when expected or at all because required Surface Transportation Board review and approval, shareholder or other approvals and other conditions to closing are not received or satisfied on a timely basis or at all (and the risk that such approvals may result in the imposition of conditions that could adversely affect the combined company or the expected benefits of the Mergers); \n•\nthe risk that the combined company will not realize expected benefits, cost savings, accretion, synergies and/or growth from the Mergers, or that such benefits may take longer to realize or be more costly to achieve than expected; \n•\ndisruption to the Company’s business as a result of the announcement and pendency of the Mergers; \n•\nthe costs associated with the anticipated length of time of the pendency of the Mergers, including the restrictions contained in the Merger Agreement on the ability of the Company to operate its business outside the ordinary course during the pendency of the Mergers; \n•\nthe diversion of the Company’s management’s attention and time from ongoing business operations and opportunities on Merger-related matters; \n•\nthe possibility that the Mergers may be more expensive to complete than anticipated, including as a result of unexpected factors or events; and \n39\n•\nthe reputational risk and adverse reactions of customers, suppliers, employees, labor unions or other business partners, including those resulting from the announcement or completion of the Mergers.\nThe forward-looking statements herein are made only as of the date they were first issued, and unless otherwise required by applicable securities laws, we disclaim any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events, or otherwise.  \nAdditional Information\nInvestors and others should note that we routinely use the Investor Relations, Performance Metrics, and Sustainability sections of our website (norfolksouthern.investorroom.com/key-investor-information, norfolksouthern.investorroom.com/weekly-performance-reports & norfolksouthern.com/sustainability) to post presentations to investors and other important information, including information that may be deemed material to investors.  Information about us, including information that may be deemed material, may also be announced by posts on our social media channels, including X (formerly known as Twitter) (x.com/nscorp) and LinkedIn (www.linkedin.com/company/norfolk-southern).  We may also use our website and social media channels for the purpose of complying with our disclosure obligations under Regulation FD.  As a result, we encourage investors, the media, and others interested in Norfolk Southern to review the information posted on our website and social media channels.  The information posted on our website and social media channels is not incorporated by reference in this Quarterly Report on Form 10-Q."
}