{
  "source_file": "nvr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\n(dollars in thousands, except per share data)\nForward-Looking Statements\nSome of the statements in this Quarterly Report on Form 10-Q, as well as statements made by us in periodic press releases or other public communications, constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended.  Certain, but not necessarily all, of such forward-looking statements can be identified by the use of forward-looking terminology, such as “believes,” “expects,” “may,” “will,” “should,” \"could,\" or “anticipates” or the negative thereof or other comparable terminology.  All statements other than of historical facts are forward-looking statements.  Forward-looking statements contained in this document may include those regarding market trends, our financial position and financial results, business strategy, the outcome of pending litigation, investigations or similar contingencies, projected plans and objectives of management for future operations.  Such forward-looking statements involve known and unknown risks, uncertainties and other factors that may cause our actual results or performance to be materially different from future results, performance or achievements expressed or implied by the forward-looking statements.  Such risk factors include, but are not limited to the following: general economic and business conditions (on both a national and regional level); interest rate changes; access to suitable financing by us and our customers; increased regulation in the mortgage banking industry; the ability of our mortgage banking subsidiary to sell loans it originates into the secondary market; competition; the availability and cost of land and other raw materials used by us in our homebuilding operations; shortages of labor; the economic impact of a major epidemic or pandemic; weather related slow-downs; building moratoriums; governmental regulation; fluctuation and volatility of stock and other financial markets; mortgage financing availability; and other factors over which we have little or no control.  We undertake no obligation to update such forward-looking statements except as required by law.  For additional information regarding risk factors and uncertainties, see Part II, Item 1A of this Quarterly Report on Form 10-Q and Part I, Item 1A of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nUnless the context otherwise requires, references to “NVR,” “we,” “us,” or “our” include NVR and its consolidated subsidiaries.\nResults of Operations for the Three and Nine Months Ended September 30, 2025 and 2024\nBusiness Environment and Current Outlook\nDuring the third quarter of 2025, demand for new homes continued to be negatively impacted by affordability issues, rising resale and new home inventory, declining consumer confidence and economic volatility. We expect that affordability issues, interest rate volatility and economic volatility may continue to weigh on demand and home prices. We also expect to continue to face margin pressure due to affordability issues and cost pressures. Although we are unable to predict the extent to which this will impact our operational and financial performance, we believe that we are well positioned to take advantage of opportunities that may arise from future economic and homebuilding market volatility due to the strength of our balance sheet and our disciplined lot acquisition strategy.\n \nBusiness\nOur primary business is the construction and sale of single-family detached homes, townhomes and condominiums, all of which are primarily constructed on a pre-sold basis. To fully serve customers of our homebuilding operations, we also operate a mortgage banking and title services business. We primarily conduct our operations in mature markets. Additionally, we generally grow our business through market share gains in our existing markets and by expanding into markets contiguous to our current active markets. Our four homebuilding reportable segments consist of the following regions:\n20\nTable of Contents\nMid Atlantic:\n \nMaryland, Virginia, West Virginia, Delaware and Washington, D.C.\nNorth East:\n \nNew Jersey and Eastern Pennsylvania\nMid East:\n \nNew York, Ohio, Western Pennsylvania, Indiana and Illinois\nSouth East:\n \nNorth Carolina, South Carolina, Tennessee, Florida, Georgia and Kentucky\nOur lot acquisition strategy is predicated upon avoiding the financial requirements and risks associated with direct land ownership and development. We generally do not engage in land development (see discussion below of our land development activities). Instead, we typically acquire finished building lots from various third party land developers pursuant to fixed price finished lot purchase agreements (“LPAs”). These LPAs require deposits, typically ranging up to 10% of the aggregate purchase price of the finished lots, in the form of cash or letters of credit that may be forfeited if we fail to perform under the LPA. This strategy has allowed us to maximize inventory turnover, which we believe enables us to minimize market risk and to operate with less capital, thereby enhancing rates of return on equity and total capital.\nIn addition to constructing homes primarily on a pre-sold basis and utilizing what we believe is a conservative lot acquisition strategy, we focus on obtaining and maintaining a leading market position in each market we serve. This strategy allows us to gain valuable efficiencies and competitive advantages in our markets, which we believe contributes to minimizing the adverse effects of regional economic cycles and provides growth opportunities within these markets. Our continued success is contingent upon our ability to control an adequate supply of finished lots on which to build.\nIn certain specific strategic circumstances, we deviate from our historical lot acquisition strategy and engage in joint venture arrangements with land developers or directly acquire raw ground already zoned for its intended use for development. Once we acquire control of raw ground, we determine whether to sell the raw parcel to a developer and enter into an LPA with the developer to purchase the finished lots or to hire a developer to develop the land on our behalf. While joint venture arrangements and direct land development activity are not our preferred method of acquiring finished building lots, we may enter into additional transactions in the future on a limited basis where there exists a compelling strategic or prudent financial reason to do so. We expect, however, to continue to acquire substantially all our finished lot inventory using LPAs with forfeitable deposits.\nAs of September 30, 2025, we controlled approximately 175,300 lots as described below.\nLot Purchase Agreements\nWe controlled approximately 166,050 lots under LPAs with third parties through deposits in cash and letters of credit totaling approximately $907,600 and $4,000, respectively. Included in the number of controlled lots are approximately 15,000 lots for which we have recorded a contract land deposit impairment allowance of approximately $85,400 as of September 30, 2025.\nJoint Venture Limited Liability Corporations (“JVs”)\nWe had an aggregate investment totaling approximately $66,500 in \nfive\n JVs, expected to produce approximately 7,300 lots. Of the lots to be produced by the JVs, approximately 6,950 lots were controlled by us and approximately 350 were either under contract with unrelated parties or currently not under contract. We had additional JV funding commitments totaling approximately $11,700 as of September 30, 2025. \nLand Under Development\nWe owned land with a carrying value of approximately $38,000 that we intend to develop into approximately 2,300 finished lots.   \nSee Notes 2, 3 and 4 to the condensed consolidated financial statements included herein for additional information regarding LPAs, JVs and land under development, respectively.\n21\nTable of Contents\nRaw Land Purchase Agreements\nIn addition, we have certain properties under contract with land owners that are expected to yield approximately 47,100 lots, which are not included in the number of total lots controlled. Some of these properties may require rezoning or other approvals to achieve the expected yield. As of September 30, 2025, these properties are controlled with deposits in cash totaling approximately $46,100, of which approximately $10,400 is refundable if certain contractual conditions are not met. We generally expect to assign the raw land contracts to a land developer and simultaneously enter into an LPA with the assignee if the project is determined to be feasible.\nKey Financial Results\nOur consolidated revenues for the third quarter of 2025 totaled $2,609,505, a 5% decrease from the third quarter of 2024. Net income for the third quarter ended September 30, 2025 was $342,688, or $112.33 per diluted share. For the third quarter ended September 30, 2025, net income decreased 20% and diluted earnings per share decreased 14% when compared to net income and diluted earnings per share for the third quarter of 2024, respectively. Our homebuilding gross profit margin percentage decreased to 21.0% in the third quarter of 2025 from 23.4% in the third quarter of 2024. New orders, net of cancellations (“New Orders”) decreased by 16% in the third quarter of 2025 compared to the third quarter of 2024. The New Order cancellation rate for the third quarter of 2025 increased to 19.4% from 14.5% in the same period in 2024. The average sales price for New Orders in the third quarter of 2025 was $464.8, an increase of 3% compared to the third quarter of 2024.\nHomebuilding Operations\nThe following table summarizes the results of operations and other data for our homebuilding operations:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nFinancial Data:\nRevenues\n$\n2,560,343 \n$\n2,677,640 \n$\n7,459,055 \n$\n7,511,708 \nCost of sales\n$\n2,021,398 \n$\n2,051,087 \n$\n5,856,756 \n$\n5,724,916 \nGross profit margin percentage\n21.0 \n%\n23.4 \n%\n21.5 \n%\n23.8 \n%\nSelling, general and administrative expenses\n$\n142,736 \n$\n149,777 \n$\n457,023 \n$\n443,493 \nOperating Data:\nNew orders (units)\n4,735 \n5,650 \n15,459 \n17,766 \nAverage new order price\n$\n464.8 \n$\n450.7 \n$\n456.8 \n$\n454.7 \nSettlements (units)\n5,639 \n5,908 \n16,247 \n16,656 \nAverage settlement price\n$\n454.0 \n$\n453.2 \n$\n459.1 \n$\n451.0 \nBacklog (units)\n9,165 \n11,339 \nAverage backlog price\n$\n479.5 \n$\n469.5 \nNew order cancellation rate\n19.4 \n%\n14.5 \n%\n17.1 \n%\n13.5 \n%\nConsolidated Homebuilding - Three Months Ended September 30, 2025 and 2024 \nHomebuilding revenues decreased 4% in the third quarter of 2025 compared to the same period in 2024, as a result of a 5% decrease in the number of units settled. The decrease in the number of units settled was primarily attributable to a 13% lower backlog balance entering the third quarter of 2025 compared to the backlog unit balance entering the third quarter of 2024, offset partially by a higher backlog turnover rate. The gross profit margin percentage in the third quarter of 2025 decreased to 21.0%, from 23.4% in the third quarter of 2024. Gross profit margin was negatively impacted by higher lot costs, pricing pressure due to continued affordability challenges and contract land deposit impairments totaling approximately $18,900 in the third quarter of 2025, compared to approximately $3,900 in impairment charges in the third quarter of 2024.\n22\nTable of Contents\nThe number of New Orders decreased 16% while the average sales price increased 3% in the third quarter of 2025 compared to the third quarter of 2024. New Orders were negatively impacted by a 21% lower sales absorption rate, due to weaker demand in each of our segments, offset partially by a 7% increase in the average number of active communities.\nSelling, general and administrative (“SG&A”) expense in the third quarter of 2025 decreased by approximately $7,000, or 5%, compared to the third quarter of 2024, and as a percentage of revenue remained flat at 5.6% quarter over quarter. The decrease in SG&A expense was primarily attributable to a decrease in incentive compensation expense based on current year company performance, offset partially by higher overhead costs associated with increased headcount quarter over quarter.\nConsolidated Homebuilding - Nine Months Ended September 30, 2025 and 2024 \nHomebuilding revenues decreased 1% in the first nine months of 2025 compared to the same period in 2024, as a result of a 2% decrease in the number of units settled. The decrease in settlements was attributable to a 3% lower backlog unit balance entering 2025 compared to the backlog unit balance entering 2024. Gross profit margin percentage in the first nine months of 2025 decreased to 21.5% from 23.8% in the first nine months of 2024. Gross profit margin was negatively impacted by higher lot costs, pricing pressure due to continued affordability challenges and contract land deposit impairments totaling approximately $40,100 in the first nine months of 2025. In the first nine months of 2024, the Company recorded an approximate $4,900 expense reversal related to previously impaired lot deposits.\nThe number of New Orders decreased 13% in the first nine months of 2025 compared to the same period in 2024. New Orders were negatively impacted by a 13% lower sales absorption, due to weaker demand. \nSG&A expense in the first nine months of 2025 increased by approximately $13,500, or 3%, compared to the same period in 2024, and as a percentage of revenue increased to 6.1% in 2025 from 5.9% in 2024. The increase in SG&A expense was primarily attributable to a $6,000 increase in sales and marketing costs driven by higher model home related expenses and increased advertising expenses.\nOur backlog represents homes sold but not yet settled with our customers. As of September 30, 2025, our backlog decreased on a unit basis by 19% to 9,165 units and on a dollar basis by 17% to $4,394,695 when compared to 11,339 units and $5,323,366, respectively, as of September 30, 2024. The decrease in the number of backlog units was primarily attributable to a 13% decrease in New Orders year over year, coupled with a 3% lower backlog unit balance entering 2025 compared to the backlog unit balance entering 2024. Backlog dollars were lower primarily due to the decrease in backlog units in 2025.\nOur backlog may be impacted by customer cancellations for various reasons that are beyond our control, such as failure to obtain mortgage financing, inability to sell an existing home, job loss, or a variety of other reasons. In any period, a portion of the cancellations that we experience are related to new sales that occurred during the same period, and a portion are related to sales that occurred in prior periods and therefore appeared in the opening backlog for the current period. Our cancellation rate was approximately 17% and 14% in the first nine months of 2025 and 2024, respectively, calculated as the total of all cancellations during the period as a percentage of gross sales during the same period.  During the most recent four quarters, approximately 6% of a reporting quarter’s opening backlog cancelled during the fiscal quarter. We can provide no assurance that our historical cancellation rates are indicative of the actual cancellation rate that may occur during the remainder of 2025 or future years. Other than units that are cancelled, we expect to settle substantially all of our September 30, 2025 backlog within the next twelve months.\nThe rate at which we turn over our backlog is impacted by various factors, including, but not limited to, changes in New Order activity, internal production capacity, external subcontractor capacity, building material availability and other external factors over which we do not exercise control.\n23\nTable of Contents\nReportable Segments\nHomebuilding segment profit includes all revenues and income generated from the sale of homes, less the cost of homes sold, SG&A expenses, and a corporate capital allocation charge determined by corporate management. The corporate capital allocation charge eliminates in consolidation and is based on the segment’s average net assets employed. The corporate capital allocation charged to the operating segment allows the Chief Operating Decision Maker to determine whether the operating segment is providing the desired rate of return after covering our cost of capital.\nWe record charges on contract land deposits when we determine that it is probable that recovery of the deposit is impaired. For segment reporting purposes, impairments on contract land deposits are generally charged to the operating segment upon the termination of an LPA with the developer, or the restructuring of an LPA resulting in the forfeiture of the deposit. We evaluate our entire net contract land deposit portfolio for impairment each quarter. For presentation purposes below, the contract land deposit reserve as of September 30, 2025 and December 31, 2024 has been allocated to the respective year’s reportable segments to show contract land deposits on a net basis. The net contract land deposit balances below also include approximately $4,000 and $8,700 as of September 30, 2025 and December 31, 2024, respectively, of letters of credit issued as deposits in lieu of cash.\nThe following tables summarize certain homebuilding operating activity by reportable segment for the three and nine months ended September 30, 2025 and 2024.\nSelected Segment Financial Data:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nRevenues:\nMid Atlantic\n$\n1,039,957 \n$\n1,147,893 \n$\n3,251,066 \n$\n3,299,047 \nNorth East\n291,753 \n300,448 \n889,508 \n843,452 \nMid East\n508,798 \n501,190 \n1,371,160 \n1,352,137 \nSouth East\n719,835 \n728,109 \n1,947,321 \n2,017,072 \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nGross profit margin:\nMid Atlantic\n$\n243,719 \n$\n288,131 \n$\n769,694 \n$\n830,097 \nNorth East\n76,690 \n78,251 \n233,842 \n221,829 \nMid East\n110,427 \n114,087 \n289,051 \n302,977 \nSouth East\n129,686 \n159,431 \n364,849 \n459,137 \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nGross profit margin percentage:\nMid Atlantic\n23.4 \n%\n25.1 \n%\n23.7 \n%\n25.2 \n%\nNorth East\n26.3 \n%\n26.0 \n%\n26.3 \n%\n26.3 \n%\nMid East\n21.7 \n%\n22.8 \n%\n21.1 \n%\n22.4 \n%\nSouth East\n18.0 \n%\n21.9 \n%\n18.7 \n%\n22.8 \n%\n24\nTable of Contents\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nSegment profit:\nMid Atlantic\n$\n168,141 \n$\n214,132 \n$\n546,364 \n$\n613,262 \nNorth East\n51,964 \n56,246 \n165,039 \n157,476 \nMid East\n76,431 \n81,385 \n191,769 \n211,374 \nSouth East\n56,872 \n95,089 \n154,120 \n280,936 \nOperating Activity:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n \nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nNew orders, net of cancellations:\n \n \n \n \n \n \n \nMid Atlantic\n1,714 \n$\n529.7 \n2,206 \n$\n514.7 \n5,510 \n$\n525.1 \n6,785 \n$\n522.2 \nNorth East\n433 \n$\n647.1 \n536 \n$\n616.4 \n1,234 \n$\n664.6 \n1,541 \n$\n617.2 \nMid East\n931 \n$\n431.9 \n1,105 \n$\n400.2 \n3,101 \n$\n425.0 \n3,630 \n$\n404.8 \nSouth East\n1,657 \n$\n368.6 \n1,803 \n$\n354.1 \n5,614 \n$\n361.8 \n5,810 \n$\n363.9 \nTotal\n4,735 \n$\n464.8 \n5,650 \n$\n450.7 \n15,459 \n$\n456.8 \n17,766 \n$\n454.7 \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n \nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nSettlements:\n \n \n \n \n \n \n \n \nMid Atlantic\n2,008 \n$\n517.9 \n2,229 \n$\n514.9 \n6,159 \n$\n527.8 \n6,394 \n$\n515.9 \nNorth East\n420 \n$\n694.6 \n495 \n$\n606.9 \n1,365 \n$\n651.7 \n1,445 \n$\n583.6 \nMid East\n1,200 \n$\n423.8 \n1,219 \n$\n411.1 \n3,295 \n$\n416.1 \n3,343 \n$\n404.5 \nSouth East\n2,011 \n$\n357.9 \n1,965 \n$\n370.5 \n5,428 \n$\n358.8 \n5,474 \n$\n368.5 \nTotal\n5,639 \n$\n454.0 \n5,908 \n$\n453.2 \n16,247 \n$\n459.1 \n16,656 \n$\n451.0 \n \nAs of September 30,\n \n2025\n2024\n \nUnits\nAverage\nPrice\nUnits\nAverage\nPrice\nBacklog:\n \n \n \n \nMid Atlantic\n3,419 \n$\n539.7 \n4,485 \n$\n531.4 \nNorth East\n924 \n$\n676.0 \n1,124 \n$\n646.5 \nMid East\n1,851 \n$\n431.3 \n2,263 \n$\n411.5 \nSouth East\n2,971 \n$\n379.1 \n3,467 \n$\n369.8 \nTotal\n9,165 \n$\n479.5 \n11,339 \n$\n469.5 \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nNew order cancellation rate:\nMid Atlantic\n19.3 \n%\n12.4 \n%\n17.4 \n%\n12.2 \n%\nNorth East\n17.4 \n%\n12.3 \n%\n14.8 \n%\n13.8 \n%\nMid East\n17.9 \n%\n16.5 \n%\n16.8 \n%\n15.1 \n%\nSouth East\n20.8 \n%\n16.5 \n%\n17.4 \n%\n13.8 \n%\n25\nTable of Contents\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nAverage active communities:\nMid Atlantic\n125 \n146 \n122 \n152 \nNorth East\n34 \n32 \n28 \n32 \nMid East\n100 \n98 \n96 \n100 \nSouth East\n191 \n146 \n180 \n143 \nTotal\n450 \n422 \n426 \n427 \nHomebuilding Inventory:\n \nSeptember 30, 2025\nDecember 31, 2024\nSold inventory:\nMid Atlantic\n$\n772,130 \n$\n845,686 \nNorth East\n233,445 \n229,152 \nMid East\n306,728 \n276,459 \nSouth East\n466,054 \n402,967 \nTotal (1)\n$\n1,778,357 \n$\n1,754,264 \n \nSeptember 30, 2025\nDecember 31, 2024\nUnsold lots and housing units inventory:\nMid Atlantic\n$\n116,211 \n$\n100,897 \nNorth East\n50,122 \n17,198 \nMid East\n31,290 \n23,091 \nSouth East\n119,620 \n99,369 \nTotal (1)\n$\n317,243 \n$\n240,555 \n(1)  The reconciling items between segment inventory and consolidated inventory include certain consolidation adjustments necessary to convert the reportable segments’ results, which are predominantly maintained on a cash basis, to a full accrual basis for external financial statement presentation purposes. These consolidation adjustments are not allocated to our operating segments.\nLots Controlled and Land Deposits:\n \nSeptember 30, 2025\nDecember 31, 2024\nTotal lots controlled:\nMid Atlantic\n58,200 \n50,900 \nNorth East\n18,700 \n17,000 \nMid East\n26,100 \n24,100 \nSouth East\n72,300 \n70,400 \nTotal\n175,300 \n162,400 \n \nSeptember 30, 2025\nDecember 31, 2024\nContract land deposits, net:\nMid Atlantic\n$\n339,679 \n$\n258,333 \nNorth East\n109,180 \n105,062 \nMid East\n79,856 \n65,147 \nSouth East\n343,608 \n306,855 \nTotal\n$\n872,323 \n$\n735,397 \n26\nTable of Contents\nMid Atlantic\nThree Months Ended September 30, 2025 and 2024 \nThe Mid Atlantic segment had an approximate $46,000, or 21%, decrease in segment profit in the third quarter of 2025 compared to the third quarter of 2024. This decrease was due primarily to a 9% decrease in segment revenues, coupled with a decrease in gross profit margins to 23.4% in the third quarter of 2025 from 25.1% in the same period of 2024. Segment revenues decreased due to a 10% decrease in the number of units settled in the third quarter of 2025 when compared to the third quarter of 2024. Gross profit margins were negatively impacted by higher lot costs and pricing pressure due primarily to continued affordability challenges. \nSegment New Orders decreased 22% while the average sales price of New Orders increased 3%, in the third quarter of 2025 compared to the third quarter of 2024. New Orders were lower primarily due to a 14% decrease in the average number of active communities, coupled with a 9% lower sales absorption rate. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment. \nNine Months Ended September 30, 2025 and 2024 \nThe Mid Atlantic segment had an approximate $66,900, or 11%, decrease in segment profit in the first nine months of 2025 compared to the first nine months of 2024. This decrease was due primarily to a decrease in gross profit margins to 23.7% in the first nine months of 2025 from 25.2% in the first nine months of 2024, coupled with an approximate $48,000, or 1% decrease in segment revenues. Gross profit margins were negatively impacted by higher lot costs and pricing pressure due primarily to continued affordability challenges. \nSegment New Orders decreased 19% while the average sales price of New Orders remained relatively flat, in the first nine months of 2025 compared to the first nine months of 2024. New Orders were lower primarily due to a 20% decrease in the average number of active communities year over year.  \nNorth East\nThree Months Ended September 30, 2025 and 2024\nThe North East segment had an approximate $4,300, or 8%, decrease in segment profit in the third quarter of 2025 compared to the third quarter of 2024, due primarily to a decrease in segment revenues of approximately $8,700, or 3%. Segment revenues decreased due to a 15% decrease in the number of units settled, offset by a 14% increase in the average settlement price quarter over quarter. The decrease in the number of settlements is attributable to a 16% lower backlog unit balance entering the third quarter of 2025 compared to the backlog unit balance entering the third quarter of 2024. The increase in the average settlement price is attributable primarily to a 9% higher average price of units in backlog entering the third quarter of 2025 compared to backlog entering the third quarter of 2024.  The segment's gross profit margin percentage remained relatively flat quarter over quarter.\nSegment New Orders decreased 19% while the average sales price of New Orders increased 5%, in the third quarter of 2025 compared to the third quarter of 2024. New Orders were lower primarily due to a 23% lower sales absorption rate, offset partially by a 5% increase in the average number of active communities. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment.\nNine Months Ended September 30, 2025 and 2024\nThe North East segment had an approximate $7,600, or 5%, increase in segment profit in the first nine months of 2025 compared to the first nine months of 2024, due primarily to an increase in segment revenue of approximately $46,100, or 5%. Segment revenues were favorably impacted by a 12% increase in the average settlement price year over year, offset by a 6% decrease in the number of units settled. The increase in the average settlement price was primarily attributable to a 9% higher average sales price of units in backlog entering 2025 compared to backlog entering 2024, coupled with a 13% increase in in the average sales price of New Orders in the first quarter of 2025 compared to the same period in 2024. The decrease in the number of units settled was driven by the 28% decrease in the number of New Orders in the first quarter of 2025 compared to the same period in 2024. The segment's gross profit margin percentage remained relatively flat year over year.\n27\nTable of Contents\nSegment New Orders decreased 20% while the average sales price of New Orders increased 8% in the first nine months of 2025 compared to the first nine months of 2024. New Orders were lower primarily due to a 14% decrease in the average number of active communities, coupled with a 7% lower sales absorption rate year over year due to weaker demand. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment.\nMid East\nThree Months Ended September 30, 2025 and 2024\nThe Mid East segment had an approximate $5,000, or 6%, decrease in segment profit in the third quarter of 2025 compared to the third quarter of 2024, due primarily to a decrease in gross profit margins, which offset an increase in segment revenues of approximately $7,600, or 2%. The segment's gross profit margin percentage decreased to 21.7% in the third quarter of 2025 from 22.8% in the third quarter of 2024. Gross profit margin was negatively impacted by higher lot and certain operating costs, as well as by pricing pressure due primarily to continued affordability challenges. \nSegment New Orders decreased 16% while the average sales price of New Orders increased 8% in the third quarter of 2025 compared to the third quarter of 2024. New Orders were negatively impacted by a 17% lower sales absorption rate quarter over quarter. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment.\n Nine Months Ended September 30, 2025 and 2024\nThe Mid East segment had an approximate $19,600, or 9%, decrease in segment profit in the first nine months of 2025 compared to the first nine months of 2024, due primarily to a decrease in gross profit margins to 21.1% in the first nine months of 2025 from 22.4% in the first nine months of 2024. Gross profit margin was negatively impacted by higher lot and certain operating costs, as well as by pricing pressure due primarily to continued affordability challenges.\nSegment New Orders decreased 15% while the average sales price of New Orders increased 5% in the first nine months of 2025 compared to the first nine months of 2024. New Orders were negatively impacted by an 11% lower sales absorption rate due to weaker demand and a 4% decrease in the average number of active communities year over year. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment year over year.\nSouth East\nThree Months Ended September 30, 2025 and 2024\nThe South East segment had an approximate $38,200, or 40%, decrease in segment profit in the third quarter of 2025 compared to the third quarter of 2024.  The decrease in segment profit was primarily due to a decrease in the segment's gross profit margin percentage, a decrease in segment revenues and an increase in SG&A expenses. The segment's gross profit margin percentage decreased to 18.0% in the third quarter of 2025 from 21.9% in the third quarter of 2024. Gross profit margins were negatively impacted by higher lot costs, an increase in certain operating costs, and pricing pressure attributable to continued affordability challenges. Additionally, gross profit margins in the third quarter of 2025 were impacted by a $9,000 increase in contract land deposit impairment charges when compared to the third quarter of 2024. SG&A expenses were 10% higher quarter over quarter, resulting primarily from higher personnel and marketing costs attributable to a 31% increase in the average number of active communities quarter over quarter. \nSegment New Orders decreased 8% while the average sales price of New Orders increased 4% in the third quarter of 2025 compared to the third quarter of 2024. New Orders were negatively impacted by a 30% lower absorption rate, offset partially by the aforementioned increase in the average number of active communities within the segment quarter over quarter. Absorption rates continue to be negatively impacted by rising resale and new home inventory in several of the markets within the segment. The average sales price of New Orders was favorably impacted by a shift to higher priced communities in certain markets within the segment. \n28\nTable of Contents\nNine Months Ended September 30, 2025 and 2024\nThe South East segment had an approximate $126,800, or 45%, decrease in segment profit in the first nine months of 2025 compared to the first nine months of 2024. The decrease in segment profit was primarily due to a decrease in the segment's gross profit margin percentage, a decrease in segment revenues and an increase in SG&A expenses. The segment's gross profit margin percentage decreased to 18.7% in the first nine months of 2025 from 22.8% in the first nine months of 2024. Gross profit margins were negatively impacted by higher lot costs, an increase in certain operating costs, and by pricing pressure attributable to continued affordability challenges. Segment revenues decreased by approximately $69,800, or 3%, due to a 3% decrease in the average settlement price. The decrease in the average settlement price is primarily attributable to a 4% decrease in the average sales price of New Orders in the first quarter of 2025 compared to the same period in 2024. SG&A expenses were 17% higher year over year, resulting primarily from higher personnel and marketing costs attributable to a 26% increase in the average number of active communities quarter over quarter. \nSegment New Orders decreased 3% while the average sales price of New Orders remained flat during the first nine months of 2025 compared to the first nine months of 2024. New Orders were negatively impacted by a 23% lower absorption rate due to weaker demand, offset partially by the aforementioned increase in the average number of active communities within the segment year over year. Absorption rates continue to be negatively impacted by rising resale and new home inventory in several of the markets within the segment. \n29\nTable of Contents\nHomebuilding Segment Reconciliations to Consolidated Homebuilding Operations\nIn addition to the corporate capital allocation and contract land deposit impairments discussed above, the other reconciling items between homebuilding segment profit and homebuilding consolidated income before tax include unallocated corporate overhead (which includes all management incentive compensation), equity-based compensation expense, consolidation adjustments and external corporate interest expense.  Our overhead functions, such as accounting, treasury and human resources, are centrally performed and the costs are not allocated to our operating segments.  Consolidation adjustments consist of such items to convert the reportable segments’ results, which are predominantly maintained on a cash basis, to a full accrual basis for external financial statement presentation purposes, and are not allocated to our operating segments.  External corporate interest expense primarily consists of interest charges on our Senior Notes, and is not charged to the operating segments because the charges are included in the corporate capital allocation discussed above.\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nHomebuilding consolidated gross profit:\nMid Atlantic\n$\n243,719 \n$\n288,131 \n$\n769,694 \n$\n830,097 \nNorth East\n76,690 \n78,251 \n233,842 \n221,829 \nMid East\n110,427 \n114,087 \n289,051 \n302,977 \nSouth East\n129,686 \n159,431 \n364,849 \n459,137 \nConsolidation adjustments and other\n(21,577)\n(13,347)\n(55,137)\n(27,248)\nHomebuilding consolidated gross profit\n$\n538,945 \n$\n626,553 \n$\n1,602,299 \n$\n1,786,792 \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nHomebuilding consolidated income before taxes:\nMid Atlantic\n$\n168,141 \n$\n214,132 \n$\n546,364 \n$\n613,262 \nNorth East\n51,964 \n56,246 \n165,039 \n157,476 \nMid East\n76,431 \n81,385 \n191,769 \n211,374 \nSouth East\n56,872 \n95,089 \n154,120 \n280,936 \nReconciling items:\nContract land deposit reserve adjustment (1)\n(18,634)\n(3,079)\n(39,904)\n5,712 \nEquity-based compensation expense\n(16,869)\n(18,012)\n(50,813)\n(51,410)\nCorporate capital allocation (2)\n96,562 \n86,489 \n276,087 \n246,044 \nUnallocated corporate overhead\n(26,359)\n(36,780)\n(116,692)\n(122,300)\nConsolidation adjustments and other \n10,433 \n2,575 \n27,903 \n6,666 \nCorporate interest income\n19,654 \n32,409 \n65,129 \n106,173 \nCorporate interest expense\n(6,841)\n(6,787)\n(20,647)\n(20,052)\nReconciling items sub-total\n57,946 \n56,815 \n141,063 \n170,833 \nHomebuilding consolidated income before taxes\n$\n411,354 \n$\n503,667 \n$\n1,198,355 \n$\n1,433,881 \n(1)\nThis item represents changes to the contract land deposit impairment reserve, which are not allocated to the reportable segments.  See further discussion of lot deposit impairment charges in Note 2 in the accompanying condensed consolidated financial statements.\n30\nTable of Contents\n(2)\nThis item represents the elimination of the corporate capital allocation charge included in the respective homebuilding reportable segments.  The corporate capital allocation charge is based on the segment’s monthly average asset balance, and is as follows for the periods presented:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nCorporate capital allocation charge:\nMid Atlantic\n$\n38,204 \n35,976 \n$\n112,350 \n104,872 \nNorth East\n12,383 \n10,578 \n34,275 \n30,456 \nMid East\n12,917 \n11,929 \n36,157 \n32,850 \nSouth East\n33,058 \n28,006 \n93,305 \n77,866 \nTotal\n$\n96,562 \n$\n86,489 \n$\n276,087 \n$\n246,044 \n \nMortgage Banking Segment\nThree and Nine Months Ended September 30, 2025 and 2024 \nWe conduct our mortgage banking activity through NVR Mortgage Finance, Inc. (“NVRM”), a wholly owned subsidiary. NVRM focuses exclusively on serving the homebuilding segment's customers. NVRM sells almost all of the mortgage loans it closes to investors in the secondary markets on a servicing-released basis, typically within 30 days from the loan closing. The following table summarizes the results of our mortgage banking operations and certain statistical data for the three and nine months ended September 30, 2025 and 2024:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nLoan closing volume:\n \n \n \n \nTotal principal\n$\n1,539,781 \n$\n1,656,507 \n$\n4,527,982 \n$\n4,564,597 \nLoan volume mix:\nAdjustable rate mortgages\n7 \n%\n2 \n%\n5 \n%\n2 \n%\nFixed-rate mortgages\n93 \n%\n98 \n%\n95 \n%\n98 \n%\nOperating profit:\nSegment profit\n$\n33,206 \n$\n36,156 \n$\n97,737 \n$\n112,046 \nEquity-based compensation expense\n(487)\n(1,211)\n(2,882)\n(3,055)\nMortgage banking income before tax\n$\n32,719 \n$\n34,945 \n$\n94,855 \n$\n108,991 \nCapture rate:\n86 \n%\n86 \n%\n86 \n%\n86 \n%\nMortgage banking fees:\nNet gain on sale of loans\n$\n38,776 \n$\n43,896 \n$\n121,295 \n$\n135,046 \nTitle services\n10,340 \n11,316 \n30,689 \n31,875 \nServicing fees\n46 \n99 \n312 \n242 \n \n$\n49,162 \n$\n55,311 \n$\n152,296 \n$\n167,163 \nLoan closing volume for the three and nine months ended September 30, 2025 decreased by approximately $116,700, or 7%, and $36,600, or 1%, respectively, from the same periods in 2024. The decrease in loan closing volume during the three and nine months ended September 30, 2025 was primarily attributable to a lower number of loans closed in the respective periods resulting from fewer homebuilder settlements.\n31\nTable of Contents\nSegment profit for the three months ended September 30, 2025 decreased by approximately $3,000, or 8%, from the same period in 2024. This decrease was primarily due to a reduction of approximately $6,100, or 11%, in mortgage banking fees, driven by lower gains on loan sales. This was partially offset by a $3,200 decline in SG&A expenses compared to the same period in the prior year.\nSegment profit for the nine months ended September 30, 2025 decreased by approximately $14,300, or 13%, from the same period in 2024. This decrease was primarily attributable to a decrease of approximately $14,900, or 9%, in mortgage banking fees due to a decrease in gains on sales of loans.\nSeasonality\nWe historically have experienced variability in our quarterly results, generally having higher New Order activity in the first half of the year and higher home settlements, revenue and net income in the second half of the year. However, in recent years our typical seasonal trends have been affected by significant changes in market conditions. As a result, our quarterly results of operations are not necessarily indicative of the results that may be expected for the full year.\nEffective Tax Rate\nOur effective tax rate for the three and nine month periods ended September 30, 2025 was 22.8% and 24.5%, respectively, compared to 20.3% and 20.6% for the three and nine months ended September 30, 2024, respectively. The increase in the effective tax rate in the three and nine month periods ended September 30, 2025 compared to the same periods in 2024 was primarily attributable to a lower income tax benefit recognized for excess tax benefits from stock option exercises, which totaled approximately $13,400 and $19,700 for the three and nine months ended September 30, 2025, respectively, and approximately $23,100 and $73,700 for the three and nine months ended September 30, 2024, respectively.\n We expect continued tax rate volatility in future periods attributable to the recognition of excess tax benefits from equity-based awards activity and distributions from the deferred compensation plans. Given the limited number of participants in our deferred compensation plan, the retirement of a participant could result in a significant distribution of the rabbi trust shares and corresponding tax deduction for the Company.\nOn July 4, 2025, the One Big Beautiful Bill Act (the \"Act\") was signed into law, implementing several changes to U.S. federal tax law. The Company has evaluated the provisions of the Act and does not expect the Act to have a material impact on its consolidated financial statements. \nLiquidity and Capital Resources\nWe fund our operations primarily from our current cash holdings and cash flows generated by operating activities. In addition, we have available a short-term unsecured working capital revolving credit facility and revolving mortgage repurchase facility, as further described below. As of September 30, 2025, we had approximately $2,000,000 in cash and cash equivalents, approximately $289,800 in unused committed capacity under our revolving credit facility and $150,000 in unused committed capacity under our revolving mortgage repurchase facility.  \nMaterial Cash Requirements\nWe believe that our current cash holdings, cash generated from operations, and cash available under our short-term unsecured credit agreement and revolving mortgage repurchase facility, as well as the public debt and equity markets, will be sufficient to satisfy both our short term and long term cash requirements for working capital to support our daily operations and meet commitments under our contractual obligations with third parties. Our material contractual obligations primarily consist of the following: \n(i) Payments due to service our debt and interest on that debt. Our Senior Notes have an outstanding aggregate principal balance of $900,000 and mature in May 2030. Future interest payments on our outstanding Senior Notes total $131,550, with $27,000 due within the next twelve months.\n32\nTable of Contents\n (ii) Payment obligations totaling approximately $640,900 under existing LPAs for deposits to be paid to land developers, assuming that contractual development milestones are met by the developers and we exercise our option to acquire finished lots under those LPAs. We expect to make the majority of these payments within the next three years. \n(iii) Obligations under operating and finance leases related primarily to office space and our production facilities.  See Note 13 of this Quarterly Report on Form 10-Q for additional discussion of our leases.\nIn addition to funding growth in our homebuilding and mortgage banking operations, we historically have used a substantial portion of our excess liquidity to repurchase outstanding shares of our common stock in open market and privately negotiated transactions. This ongoing repurchase program assists us in accomplishing our primary objective, creating increases in shareholder value. See Part II, Item 2, Unregistered Sales of Equity Securities and Use of Proceeds, of this Quarterly Report on Form 10-Q for further discussion of repurchase activity during the third quarter of 2025. For the nine months ended\n \nSeptember 30, 2025, we repurchased 178,178 shares of our common stock at an aggregate purchase price of $1,331,212. As of September 30, 2025, we had approximately $1,036,980 available under Board approved repurchase authorizations.\nCapital Resources\nSenior Notes\nAs of September 30, 2025, we had $900,000 of unsecured 3% senior notes outstanding, which mature in May 2030.  \nCredit Agreement\nWe have an unsecured revolving credit agreement (the \"Credit Agreement\") which provides for aggregate revolving loan commitments of $300,000, and a $100,000 sublimit for the issuance of letters of credit of which there was approximately $10,200 outstanding as of September 30, 2025. There were no borrowings outstanding under the Credit Agreement as of September 30, 2025. \nRepurchase Agreement\nNVRM has an unsecured revolving mortgage repurchase facility (the \"Repurchase Agreement\") which provides for aggregate borrowings up to $150,000. There were no borrowings outstanding under the Repurchase Agreement as of September 30, 2025. \nFor additional information regarding the Senior Notes, Credit Agreement and Repurchase Agreement, see Note 11 to the condensed consolidated financial statements included herein, and Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024.\nCash Flows\nFor the nine months ended September 30, 2025, cash, restricted cash, and cash equivalents decreased by $641,063.  \nNet cash provided by operating activities was $681,592 for the nine months ended September 30, 2025, due primarily to cash provided by earnings. Cash was primarily used to fund the increase of $181,771 in contract land deposits, an increase in inventory of $72,718, and a decrease in accounts payables and accrued expenses of $81,116.\nNet cash used in investing activities for the nine months ended September 30, 2025 was $57,374. Cash was used primarily for investments in unconsolidated joint ventures totaling $37,281 and purchases of property, plant and equipment of $20,808.\nNet cash used in financing activities was $1,265,281 for the nine months ended September 30, 2025.  Cash was used to repurchase 178,178 shares of our common stock at an aggregate purchase price of $1,331,212 under our ongoing common stock repurchase program, discussed above. Cash was provided from stock option exercise proceeds totaling $69,343.\n33\nTable of Contents\nCritical Accounting Estimates\nThere have been no material changes to our critical accounting estimates as previously disclosed in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024."
}