{
  "item1": "Dow Jones segment’s businesses compete wide range media information businesses, including digital media, print publications information services. Dow Jones segment’s consumer products, including its digital publications, newspapers, magazines, podcasts video, compete consumers, audience advertising other local national newspapers, web app-based media, news aggregators, customized news feeds, search engines, blogs, magazines, investment tools, social media sources, podcasts event producers, well other media such television, radio stations outdoor displays. Competition subscriptions circulation based news editorial content, data analytics content research tools, subscription pricing, usefulness popularity its digital products, cover price and, time time, various promotions. Competition advertising based upon advertisers’ judgments most effective media advertising budgets, which turn based upon various factors, including circulation volume, readership levels, audience demographics, advertising rates, advertising effectiveness brand strength reputation.",
  "item7": "—Revenues increased $200 million, 2%, fiscal year ended June 30, 2025 compared fiscal 2024. increase due higher revenues Digital Real Estate Services segment driven higher Australian residential revenues REA Group, Dow Jones segment driven higher circulation subscription revenues Book Publishing segment driven higher digital book sales improved returns U.S., partially offset lower revenues News Media segment driven transfer third-party printing revenue contracts News UK’s joint venture DMG Media fiscal 2024, lower advertising revenues lower circulation subscription revenues. impact foreign currency fluctuations U.S. dollar against local currencies resulted revenue increase $8 million fiscal year ended June 30, 2025 compared fiscal 2024.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS INTRODUCTION News Corporation (together its subsidiaries, “News Corporation,” “News Corp,” “Company,” “we” “us”) global diversified media information services company comprised businesses across range media, including: information services news, digital real estate services book publishing. unaudited consolidated financial statements referred herein “Consolidated Financial Statements.” consolidated statements operations referred herein “Statements Operations.” consolidated balance sheets referred herein “Balance Sheets.” consolidated statements cash flows referred herein “Statements Cash Flows.” Consolidated Financial Statements been prepared accordance generally accepted accounting principles United States America (“GAAP”). Management’s discussion analysis financial condition results operations intended help provide understanding Company’s financial condition, changes financial condition results operations."
}