{
  "source_file": "nws-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis document, including the following discussion and analysis, contains statements that constitute “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and Section 27A of the Securities Act of 1933, as amended. All statements that are not statements of historical fact are forward-looking statements. The words “expect,” “will,” “estimate,” “anticipate,” “predict,” “believe,” “should” and similar expressions and variations thereof are intended to identify forward-looking statements. These statements appear in a number of places in this discussion and analysis and include statements regarding the intent, belief or current expectations of the Company, its directors or its officers with respect to, among other things, trends affecting the Company’s business, financial condition or results of operations, the Company’s strategy and strategic initiatives, including potential acquisitions, investments and dispositions, the Company’s cost savings initiatives and the outcome of contingencies such as litigation and investigations. Readers are cautioned that any forward-looking statements are not guarantees of future performance and involve risks and uncertainties. More information regarding these risks and uncertainties and other important factors that could cause actual results to differ materially from those in the forward-looking statements is set forth under the heading “Risk Factors” in Part I, Item 1A. in News Corporation’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025, as filed with the Securities and Exchange Commission (the “SEC”) on August 6, 2025 (the “2025 Form 10-K”), and as may be updated in this and other subsequent Quarterly Reports on Form 10-Q. The Company does not ordinarily make projections of its future operating results and undertakes no obligation (and expressly disclaims any obligation) to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law. Readers should carefully review this document and the other documents filed by the Company with the SEC. This section should be read together with the unaudited consolidated financial statements of News Corporation and related notes set forth elsewhere herein and the audited consolidated financial statements of News Corporation and related notes set forth in the 2025 Form 10-K. \nINTRODUCTION\nNews Corporation (together with its subsidiaries, “News Corporation,” “News Corp,” the “Company,” “we” or “us”) is a global diversified media and information services company comprised of businesses across a range of media, including: information services and news, digital real estate services and book publishing.\nThe unaudited consolidated financial statements are referred to herein as the “Consolidated Financial Statements.” The consolidated statements of operations are referred to herein as the “Statements of Operations.” The consolidated balance sheets are referred to herein as the “Balance Sheets.” The consolidated statements of cash flows are referred to herein as the “Statements of Cash Flows.” The Consolidated Financial Statements have been prepared in accordance with generally accepted accounting principles in the United States of America (“GAAP”).\nManagement’s discussion and analysis of financial condition and results of operations is intended to help provide an understanding of the Company’s financial condition, changes in financial condition and results of operations. This discussion is organized as follows:\n•\nOverview of the Company’s Businesses\n—This section provides a general description of the Company’s businesses, as well as developments that occurred to date during fiscal 2026 that the Company believes are important in understanding its results of operations and financial condition or to disclose known trends.\n•\nResults of Operations\n—This section provides an analysis of the Company’s results of operations for the three months ended September 30, 2025 and 2024. This analysis is presented on both a consolidated basis and a segment basis. In addition, a brief description is provided of significant transactions and events that impact the comparability of the results being analyzed.\n•\nLiquidity and Capital Resources\n—This section provides an analysis of the Company’s cash flows for the three months ended September 30, 2025 and 2024, as well as a discussion of the Company’s financial arrangements and outstanding commitments, both firm and contingent, that existed as of September 30, 2025.\n25 \nTable of Contents\nOVERVIEW OF THE COMPANY’S BUSINESSES\nThe Company manages and reports its businesses in the following five segments:\n•\nDow Jones\n—The Dow Jones segment consists of Dow Jones, a global provider of news and business information whose products target individual consumers and enterprise customers and are distributed through a variety of media channels including websites, mobile apps, newspapers, newswires, newsletters, magazines, proprietary databases, live journalism, video and podcasts. Dow Jones’s consumer products include premier brands such as \nThe Wall Street Journal\n, \nBarron’s\n, MarketWatch and \nInvestor’s Business Daily\n. Dow Jones’s professional information products, which target enterprise customers, include Dow Jones Risk & Compliance, a leading provider of data and other solutions to help customers identify and manage regulatory, corporate, geopolitical, security and reputational risk with tools focused on financial crime, sanctions, trade and other risks and compliance requirements, Dow Jones Energy, a leading provider of \npricing data, news, insights, analysis and other information for energy commodities and key base chemicals,\n Factiva, a leading provider of global business content, and Dow Jones Newswires, which distributes real-time business news, information and analysis to financial professionals and investors.\n•\nDigital Real Estate Services\n—The Digital Real Estate Services segment consists of the Company’s 61.4% interest in REA Group and 80% interest in Move. The remaining 20% interest in Move is held by REA Group. REA Group is a market-leading digital media business specializing in property and is listed on the Australian Securities Exchange (“ASX”) (ASX: REA). REA Group advertises property and property-related services on its websites and mobile apps, including Australia’s leading residential, commercial and share property websites, realestate.com.au, realcommercial.com.au and Flatmates.com.au, property.com.au and Housing.com in India. In addition, REA Group provides property-related data to the financial sector and financial services through a digital property search and financing experience and a mortgage broking offering.\nMove is a leading provider of digital real estate services in the U.S. and primarily operates Realtor.com\n®\n, a premier real estate information, advertising and services platform. Move offers real estate advertising solutions to agents and brokers, including its RealPRO Select\nSM\n, \nConnections\nSM\n Plus and Listing Toolkit products as well as its referral-based services, ReadyConnect Concierge\nSM \nand RealChoice\nTM \nSelling. Move also offers online tools and services to do-it-yourself landlords and tenants.\n•\nBook Publishing\n—The Book Publishing segment consists of HarperCollins, the second largest consumer book publisher in the world, with operations in 15 countries and particular strengths in general fiction, nonfiction, children’s and religious publishing. HarperCollins owns more than 120 branded publishing imprints, including Harper, William Morrow, Mariner, HarperCollins Children’s Books, Avon, Harlequin and Christian publishers Zondervan and Thomas Nelson, and publishes works by well-known authors such as Harper Lee, George Orwell, Agatha Christie and Zora Neale Hurston, as well as global author brands including J.R.R. Tolkien, C.S. Lewis, Daniel Silva, Karin Slaughter and Dr. Martin Luther King, Jr. It is home to many beloved children’s books and series and a significant Christian publishing business.\n•\nNews Media\n—The News Media segment consists primarily of News Corp Australia, News UK and the\n New York Post \nand includes \nThe Australian\n, \nThe Daily Telegraph\n, \nHerald Sun\n, \nThe Courier Mail\n, \nThe Advertiser \nand the news.com.au website\n \nin Australia, \nThe Times\n, \nThe Sunday Times\n, \nThe Sun\n, \nThe Sun on Sunday \nand thesun.co.uk in the U.K. and the-sun.com\n \nin the U.S. This segment also includes News Broadcasting (formerly Wireless Group), operator of talkSPORT, the leading sports radio network in the U.K., Talk in the U.K., Australian News Channel, which operates the Sky News Australia network, Australia’s 24-hour multi-channel, multi-platform news service, and Storyful, a social media content agency.\n•\nOther\n—The Other segment consists primarily of general corporate overhead expenses, strategy costs and costs related to the U.K. Newspaper Matters (as defined in Note 10—Commitments and Contingencies to the Consolidated Financial Statements). \n26 \nTable of Contents\nRESULTS OF OPERATIONS\nResults of Operations—For the three months ended September 30, 2025 versus the three months ended September 30, 2024\nThe following table sets forth the Company’s operating results for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024:\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nRevenues:\nCirculation and subscription\n$\n782 \n$\n743 \n$\n39 \n5 \n%\nAdvertising\n317 \n321 \n(4)\n(1)\n%\nConsumer\n510 \n521 \n(11)\n(2)\n%\nReal estate\n370 \n357 \n13 \n4 \n%\nOther\n165 \n154 \n11 \n7 \n%\nTotal Revenues\n2,144 \n2,096 \n48 \n2 \n%\nOperating expenses\n(941)\n(952)\n11 \n1 \n%\nSelling, general and administrative\n(863)\n(819)\n(44)\n(5)\n%\nDepreciation and amortization\n(117)\n(112)\n(5)\n(4)\n%\nImpairment and restructuring charges\n(19)\n(22)\n3 \n14 \n%\nEquity losses of affiliates\n(2)\n(3)\n1 \n33 \n%\nInterest income, net\n6 \n— \n6 \n**\nOther, net\n4 \n22 \n(18)\n(82)\n%\nIncome before income tax expense from continuing operations\n212\n \n210\n \n2\n \n1\n \n%\nIncome tax expense from continuing operations\n(62)\n(61)\n(1)\n(2)\n%\nNet income from continuing operations\n150 \n149 \n1 \n1 \n%\nNet loss from discontinued operations, net of tax\n— \n(5)\n5 \n100 \n%\nNet income\n150 \n144 \n6 \n4 \n%\nNet income attributable to noncontrolling interests from continuing operations\n(38)\n(31)\n(7)\n(23)\n%\nNet loss attributable to noncontrolling interests from discontinued operations\n— \n6 \n(6)\n(100)\n%\nNet income attributable to News Corporation stockholders\n$\n112\n \n$\n119\n \n$\n(7)\n(6)\n%\n** not meaningful\nRevenues\n—Revenues increased $48 million, or 2%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nThe revenue increase for the three months ended September 30, 2025 was primarily due to higher revenues at the Dow Jones segment driven by higher circulation and subscription revenues and at the Digital Real Estate Services segment driven by higher revenues at Move and REA Group. These increases were partially offset by lower revenues at the Book Publishing segment driven by lower book sales. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a revenue increase of $4 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nThe Company calculates the impact of foreign currency fluctuations for businesses reporting in currencies other than the U.S. dollar by multiplying the results for each quarter in the current period by the difference between the average exchange rate for that quarter and the average exchange rate in effect during the corresponding quarter of the prior year and totaling the impact for all quarters in the current period.\nOperating expenses\n—Operating expenses decreased $11 million, or 1%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\n27 \nTable of Contents\nThe decrease in operating expenses for the three months ended September 30, 2025 was primarily due to lower expenses at the Book Publishing segment driven by lower costs related to lower sales volume and at the News Media segment driven by cost savings initiatives and lower Talk costs. The decrease was partially offset by higher expenses at the Digital Real Estate Services segment driven by higher employee costs. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in an Operating expense increase of $5 million, or 1%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nSelling, general and administrative\n—Selling, general and administrative increased $44 million, or 5%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\nThe increase in Selling, general and administrative for the three months ended September 30, 2025 was primarily due to higher employee and marketing costs at the Dow Jones segment and a $13 million write-off of a customer receivable related to the expected closure of a book distributor and higher employee costs at the Book Publishing segment. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a Selling, general and administrative increase of $1 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nDepreciation and amortization\n—Depreciation and amortization expense increased $5 million, or 4%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025.\nImpairment and restructuring charges\n— During the three months ended September 30, 2025 and \n2024\n, the Company recorded impairment and restructuring charges of $19 million and $22 million, including restructuring charges of $14 million and $22 million, respectively.\nSee Note 4—Impairment and Restructuring Charges in the accompanying Consolidated Financial Statements.\nEquity losses of affiliates\n—Equity losses of affiliates improved by $1 million, or 33%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025. See Note 5—Investments in the accompanying Consolidated Financial Statements.\nInterest income, net\n—Interest income, net improved by $6 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025, primarily driven by higher interest income on cash balances and lower borrowings at REA Group. See Note 6—Borrowings and Note 8—Financial Instruments and Fair Value Measurements in the accompanying Consolidated Financial Statements.\nOther, net\n—For the three months ended September 30, 2025 and 2024, the Company recorded Other, net of $4 million and $22 million, respectively. \nSee Note 13—Additional Financial Information in the accompanying Consolidated Financial Statements.\nIncome tax expense from continuing operations\n—For the three months ended September 30, 2025, the Company recorded income tax expense of $62 million on pre-tax income from continuing operations of $212 million, resulting in an effective tax rate that was higher than the U.S. statutory tax rate. The tax rate was impacted by foreign operations which are subject to higher tax rates and by valuation allowances recorded against tax benefits in certain businesses.\nFor the three months ended September 30, 2024, the Company recorded income tax expense of $61 million on pre-tax income from continuing operations of $210 million, resulting in an effective tax rate that was higher than the U.S. statutory tax rate. The tax rate was impacted by foreign operations which are subject to higher tax rates and by valuation allowances recorded against tax benefits in certain businesses. \nSee Note 11—Income Taxes in the accompanying Consolidated Financial Statements.\nNet income from continuing operations\n—Net income from continuing operations for the three months ended September 30, 2025 was $150 million, compared to $149 million for the corresponding period of fiscal \n2025, an increase\n of $1 million, or 1%, driven by the factors discussed above.\n28 \nTable of Contents\nNet loss from discontinued operations, net of tax\n—Net loss from discontinued operations, net of tax for the three months ended September 30, 2025 was nil, compared to $5 million for the corresponding period of fiscal 2025. The amount recognized in fiscal 2025 related to the reclassification of Foxtel to discontinued operations. See Note 2—Discontinued Operations in the accompanying Consolidated Financial Statements.\nNet income\n—Net income for the three months ended September 30, 2025 was $150 million, compared to net income of $144 million for the corresponding period of fiscal 2025, an increase of $6 million, or 4%, driven by the factors discussed above.\nNet income attributable to noncontrolling interests from continuing operations\n—Net income attributable to noncontrolling interests from continuing operations increased by $7 million, or 23%, for the three months ended September 30, 2025, as compared to the corresponding period of fiscal 2025, primarily driven by higher earnings at REA Group. \nSegment Analysis\nThe Company’s chief operating decision maker is its Chief Executive Officer. Segment EBITDA is the primary measure used by the Company’s chief operating decision maker to evaluate the performance of, and allocate resources within, the Company’s businesses. Segment EBITDA is defined as revenues less operating expenses and selling, general and administrative expenses. Segment EBITDA does not include: depreciation and amortization, impairment and restructuring charges, equity losses of affiliates, interest (expense) income, net, other, net, income tax (expense) benefit and net income (loss) from discontinued operations, net of tax. Segment EBITDA may not be comparable to similarly titled measures reported by other companies, since companies and investors may differ as to what items should be included in the calculation of Segment EBITDA. Segment EBITDA provides management, investors and equity analysts with a measure to analyze the operating performance of each of the Company’s business segments and its enterprise value against historical data and competitors’ data, although historical results may not be indicative of future results (as operating performance is highly contingent on many factors, including customer tastes and preferences).\nTotal Segment EBITDA is a non-GAAP measure and should be considered in addition to, not as a substitute for, net income (loss) from continuing operations, cash flow from continuing operations and other measures of financial performance reported in accordance with GAAP. In addition, this measure does not reflect cash available to fund requirements and excludes items, such as depreciation and amortization and impairment and restructuring charges, which are significant components in assessing the Company’s financial performance. The Company believes that the presentation of Total Segment EBITDA provides useful information regarding the Company’s operations and other factors that affect the Company’s reported results. Specifically, the Company believes that by excluding certain one-time or non-cash items such as impairment and restructuring charges and depreciation and amortization, as well as potential distortions between periods caused by factors such as financing and capital structures and changes in tax positions or regimes, the Company provides users of its consolidated financial statements with insight into both its core operations as well as the factors that affect reported results between periods but which the Company believes are not representative of its core business. As a result, users of the Company’s consolidated financial statements are better able to evaluate changes in the core operating results of the Company across different periods.\nThe following table reconciles Net income from continuing operations to Total Segment EBITDA for the three months ended September 30, 2025 and 2024:\nFor the three months ended September 30,\n2025\n2024\n(in millions)\nNet income from continuing operations\n$\n150 \n$\n149 \nReconciling items:\nIncome tax expense from continuing operations\n62 \n61 \nOther, net\n(4)\n(22)\nInterest income, net\n(6)\n— \nEquity losses of affiliates\n2 \n3 \nImpairment and restructuring charges\n19 \n22 \nDepreciation and amortization\n117 \n112 \nTotal Segment EBITDA\n$\n340 \n$\n325 \n29 \nTable of Contents\nThe following table sets forth the Company’s Revenues and Segment EBITDA by reportable segment for the three months ended September 30, 2025 and 2024:\nFor the three months ended September 30,\n2025\n2024\n(in millions)\nRevenues\nSegment\nEBITDA\nRevenues\nSegment\nEBITDA\nDow Jones\n$\n586 \n$\n144 \n$\n552 \n$\n131 \nDigital Real Estate Services\n479 \n158 \n457 \n140 \nBook Publishing\n534 \n58 \n546 \n81 \nNews Media\n545 \n30 \n541 \n18 \nOther\n— \n(50)\n— \n(45)\nTotal\n$\n2,144 \n$\n340 \n$\n2,096 \n$\n325 \nDow Jones \n(27% and 26% of the Company’s consolidated revenues in the three months ended September 30, 2025 and 2024, respectively)\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nRevenues:\nCirculation and subscription\n$\n491 \n$\n459 \n$\n32 \n7 \n%\nAdvertising\n85 \n85 \n— \n— \n%\nOther\n10 \n8 \n2 \n25 \n%\nTotal Revenues\n586\n \n552\n \n34\n \n6\n \n%\nOperating expenses\n(238)\n(239)\n1 \n— \n%\nSelling, general and administrative\n(204)\n(182)\n(22)\n(12)\n%\nSegment EBITDA\n$\n144\n \n$\n131\n \n$\n13\n \n10\n \n%\nFor the three months ended September 30, 2025, revenues at the Dow Jones segment increased $34 million, or 6%, as compared to the corresponding period of fiscal 2025, due to higher circulation and subscription revenues. Digital revenues represented 84% of total revenues at the Dow Jones segment for the three months ended September 30, 2025, as compared to 82% in the corresponding period of fiscal 2025. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a revenue increase of $3 million for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nCirculation and Subscription Revenues\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nCirculation and subscription revenues:\nCirculation and other\n$\n248 \n$\n238 \n$\n10 \n4 \n%\nRisk and Compliance\n94 \n81 \n13 \n16 \n%\nDow Jones Energy\n73 \n68 \n5 \n7 \n%\nOther information services\n76 \n72 \n4 \n6 \n%\nProfessional information business\n243 \n221 \n22 \n10 \n%\nTotal circulation and subscription revenues\n$\n491\n \n$\n459\n \n$\n32\n \n7\n \n%\n30 \nTable of Contents\nCirculation and subscription revenues increased $32 million, or 7%, during the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025. Professional information business revenues increased $22 million, or 10%, primarily due to the $13 million and $5 million increases in Risk & Compliance and Dow Jones Energy revenues, respectively, driven by price increases, new customers and new products, and also benefited from improvement at Factiva, primarily due to the resolution of a customer dispute. Circulation and other revenues increased $10 million, or 4%, driven by increased circulation revenues due to the conversion of customers from introductory promotions to higher pricing and growth in digital-only subscriptions, partially offset by print circulation declines. Digital revenues represented 75% of circulation revenue for the three months ended September 30, 2025, as compared to 72% in the corresponding period of fiscal 2025.\nThe following table summarizes average daily consumer subscriptions during the three months ended September 30, 2025 and 2024 for select publications and for all consumer subscription products:\n(a)\nFor the three months ended September 30\n(b)\n,\n2025\n2024\nChange\n% Change\n(in thousands, except %)\nBetter/(Worse)\nThe Wall Street Journal\nDigital-only subscriptions\n(c)\n4,217 \n3,811 \n406 \n11 \n%\nTotal subscriptions\n4,610 \n4,255 \n355 \n8 \n%\nBarron’s Group\n(d)\nDigital-only subscriptions\n(c)\n1,366 \n1,325 \n41 \n3 \n%\nTotal subscriptions\n1,471 \n1,446 \n25 \n2 \n%\nTotal Consumer\n(e)\nDigital-only subscriptions\n(c)\n5,878 \n5,325 \n553 \n10 \n%\nTotal subscriptions\n6,392 \n5,908 \n484 \n8 \n%\n(a)\nBased on internal data for the periods from June 30, 2025 through September 28, 2025 and July 1, 2024 through September 29, 2024, respectively. Excludes off-platform distribution, except for certain custom workflow integration products.\n(b)\nSubscriptions include individual consumer subscriptions, as well as subscriptions purchased by companies, schools, businesses and associations for use by their respective employees, students, customers or members. Subscriptions exclude single-copy sales and copies purchased by hotels, airlines and other businesses for limited distribution or access to customers.\n(c)\nFor some publications, including \nThe Wall Street Journal \nand \nBarron’s\n, Dow Jones sells bundled print and digital products. For bundles that provide access to both print and digital products every day of the week, only one unit is reported each day and is designated as a print subscription. For bundled products that provide access to the print product only on specified days and full digital access, one print subscription is reported for each day that a print copy is served and one digital subscription is reported for each remaining day of the week.\n(d)\nBarron’s Group consists of \nBarron’s\n, MarketWatch, \nFinancial News\n and\n Private Equity News\n.\n(e)\nTotal Consumer consists of\n The Wall Street Journal\n, Barron’s Group and \nInvestor’s Business Daily\n.\nAdvertising Revenues\nAdvertising revenues were flat during the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025, as higher digital advertising revenues were offset by lower print advertising revenues. Digital advertising revenues represented 68% of advertising revenue for the three months ended September 30, 2025, as compared to 67% in the corresponding period of fiscal 2025.\nSegment EBITDA\nFor the three months ended September 30, 2025, Segment EBITDA at the Dow Jones segment increased $13 million, or 10%, as compared to the corresponding period of fiscal 2025, primarily due to the increase in revenues discussed above, partially offset by higher employee and marketing costs.\n31 \nTable of Contents\nDigital Real Estate Services\n (22% of the Company’s consolidated revenues in both the three months ended September 30, 2025 and 2024)\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nRevenues:\nCirculation and subscription\n$\n2 \n$\n2 \n$\n— \n— \n%\nAdvertising\n41 \n38 \n3 \n8 \n%\nReal estate\n370 \n357 \n13 \n4 \n%\nOther\n66 \n60 \n6 \n10 \n%\nTotal Revenues\n479\n \n457\n \n22\n \n5\n \n%\nOperating expenses\n(53)\n(47)\n(6)\n(13)\n%\nSelling, general and administrative\n(268)\n(270)\n2 \n1 \n%\nSegment EBITDA\n$\n158\n \n$\n140\n \n$\n18\n \n13\n \n%\nFor the three months ended September 30, 2025, revenues at the Digital Real Estate Services segment increased $22 million, or 5%, as compared to the corresponding period of fiscal 2025. Revenues at Move increased $13 million, or 9%, to $152 million for the three months ended September 30, 2025 from $139 million in the corresponding period of fiscal 2025, driven by higher sales of RealPRO Select\nSM\n, as Move shifts its focus to more premium offerings, and revenue growth in seller, new homes and rentals. The increase was partially offset by the continued negative impact of the macroeconomic environment on the U.S. housing market, which resulted in a 1% decrease in lead volumes. Revenues at REA Group increased $9 million, or 3%, to $327 million for the three months ended September 30, 2025 from $318 million in the corresponding period of fiscal 2025. The increase was due to higher Australian residential revenues driven by price increases and growth in add-on products and higher financial services revenues from higher settlements, partially offset by the $7 million, or 2%, negative impact of foreign currency fluctuations and lower revenues at REA India. REA India revenues are expected to be impacted in the near-term by recent divestitures and discontinuations of certain businesses. \nFor the three months ended September 30, 2025, Segment EBITDA at the Digital Real Estate Services segment increased $18 million, or 13%, as compared to the corresponding period of fiscal 2025, primarily due to the higher revenues discussed above and the absence of $12 million of costs related to the withdrawn offer to acquire Rightmove in the prior year, partially offset by higher employee costs, higher broker commissions at REA Group from higher settlements and the $4 million, or 3%, negative impact of foreign currency fluctuations.\nBook Publishing\n (25% and 26% of the Company’s consolidated revenues in the three months ended September 30, 2025 and 2024, respectively)\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nRevenues:\nConsumer\n$\n510 \n$\n521 \n$\n(11)\n(2)\n%\nOther\n24 \n25 \n(1)\n(4)\n%\nTotal Revenues\n534\n \n546\n \n(12)\n(2)\n%\nOperating expenses\n(354)\n(365)\n11 \n3 \n%\nSelling, general and administrative\n(122)\n(100)\n(22)\n(22)\n%\nSegment EBITDA\n$\n58\n \n$\n81\n \n$\n(23)\n(28)\n%\n32 \nTable of Contents\nFor the three months ended September 30, 2025, revenues at the Book Publishing segment decreased $12 million, or 2%, as compared to the corresponding period of fiscal 2025, primarily due to lower digital book sales driven by the mix of titles, including the impact of \nHillbilly Elegy\n by J.D. Vance in the prior year, as well as softness in consumer spending and the timing of ordering from certain customers. Digital sales decreased by 9% as compared to the corresponding period of fiscal 2025 driven by lower audiobook and e-book sales. Digital sales represented approximately 23% of consumer revenues in the three months ended September 30, 2025 as compared to 25% in the corresponding period of fiscal 2025. Backlist sales represented approximately 65% of consumer revenues during the three months ended September 30, 2025 as compared to 64% in the corresponding period of fiscal 2025. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a revenue increase of $5 million, or 1%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nFor the three months ended September 30, 2025, Segment EBITDA at the Book Publishing segment decreased $23 million, or 28%, as compared to the corresponding period of fiscal 2025, primarily due to a $13 million write-off of a customer receivable  related to the expected closure of a book distributor, the lower revenues discussed above and higher employee costs, partially offset by lower costs related to lower sales volumes.\nNews Media\n (26% of the Company’s consolidated revenues in both the three months ended September 30, 2025 and 2024)\nFor the three months ended September 30,\n2025\n2024\nChange\n% Change\n(in millions, except %)\nBetter/(Worse)\nRevenues:\nCirculation and subscription\n$\n289 \n$\n282 \n$\n7 \n2 \n%\nAdvertising\n191 \n198 \n(7)\n(4)\n%\nOther\n65 \n61 \n4 \n7 \n%\nTotal Revenues\n545\n \n541\n \n4\n \n1\n \n%\nOperating expenses\n(296)\n(301)\n5 \n2 \n%\nSelling, general and administrative\n(219)\n(222)\n3 \n1 \n%\nSegment EBITDA\n$\n30\n \n$\n18\n \n$\n12\n \n67\n \n%\nRevenues at the News Media segment increased $4 million, or 1%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025. Circulation and subscription revenues increased $7 million, or 2%, as compared to the corresponding period of fiscal 2025, driven by price increases, digital subscriber growth and the $3 million, or 1%, positive impact of foreign currency fluctuations, partially offset by print volume declines. Advertising revenues decreased $7 million, or 4%, as compared to the corresponding period of fiscal 2025, due to lower print and digital advertising revenues at News Corp Australia, partially offset by higher digital advertising revenues at the\n New York Post \nand the $1 million positive impact of foreign currency fluctuations. The impact of foreign currency fluctuations of the U.S. dollar against local currencies resulted in a revenue increase of $3 million, or 1%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025.\nSegment EBITDA at the News Media segment increased by $12 million, or 67%, for the three months ended September 30, 2025 as compared to the corresponding period of fiscal 2025. The increase was driven by cost savings initiatives, lower Talk costs and the higher revenues discussed above.\n33 \nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nCurrent Financial Condition\nThe Company’s principal source of liquidity is internally generated funds and cash and cash equivalents on hand. As of September 30, 2025, the Company’s cash and cash equivalents were \n$2.2 billion\n. The Company also has available borrowing capacity under its revolving credit facility (the “Revolving Facility”) and certain other facilities, as described below, and expects to have access to the worldwide credit and capital markets, subject to market conditions, in order to issue additional debt if needed or desired. The Company currently expects these elements of liquidity will enable it to meet its liquidity needs for at least the next twelve months, including repayment of indebtedness. Although the Company believes that its cash on hand and future cash from operations, together with its access to the credit and capital markets, will provide adequate resources to fund its operating and financing needs for at least the next twelve months, its access to, and the availability of, financing on acceptable terms in the future will be affected by many factors, including: (i) the financial and operational performance of the Company and/or its operating subsidiaries, as applicable, (ii) the Company’s credit ratings and/or the credit rating of its operating subsidiaries, as applicable, (iii) the provisions of any relevant debt instruments, credit agreements, indentures and similar or associated documents, (iv) the liquidity of the overall credit and capital markets and (v) the state of the economy. There can be no assurances that the Company will continue to have access to the credit and capital markets on acceptable terms.\nAs of September 30, 2025, the Company’s consolidated assets included $720 million in cash and cash equivalents that were held by its foreign subsidiaries. Of this amount, $213 million is cash not readily accessible by the Company as it is held by REA Group, a majority owned but separately listed public company. RE\nA Group must declare a dividend in order for the Company to have access to its share of REA Group’s cash balance. \nThe principal uses of cash that affect the Company’s liquidity position include the following: operational expenditures including employee costs and paper purchases; capital expenditures; income tax payments; investments in associated entities; acquisitions; the repurchase of shares; dividends; and the repayment of debt and related interest. In addition to the acquisitions and dispositions disclosed elsewhere, as applicable, the Company has evaluated, and expects to continue to evaluate, possible future acquisitions and dispositions of certain businesses. Such transactions may be material and may involve cash, the issuance of the Company’s securities or the assumption of indebtedness.\nIssuer Purchases of Equity Securities\nOn September 22, 2021, the Company announced a stock repurchase program authorizing the Company to purchase up to $1 billion in the aggregate of the Company’s outstanding Class A Common Stock and Class B Common Stock (the “2021 Repurchase Program”). On July 15, 2025, the Company announced a new stock repurchase program authorizing the Company to purchase up to $1 billion in the aggregate of the Company’s outstanding Class A Common Stock and Class B Common Stock (the “2025 Repurchase Program” and, together with the 2021 Repurchase Program, the “Stock Repurchase Programs”), which is in addition to the remaining authorized amount under the 2021 Repurchase Program.\nThe manner, timing, number and share price of any repurchases will be determined by the Company at its discretion and will depend upon such factors as the market price of the stock, general market conditions, applicable securities laws, alternative investment opportunities and other factors. The Stock Repurchase Programs have no time limit and may be modified, suspended or discontinued at any time. As of September 30, 2025, the remaining authorized amount under the Stock Repurchase Programs was approximately $1,216 million.\nThe following table summarizes the shares repurchased under the Stock Repurchase Programs and subsequently retired and the related consideration paid during the three months ended September 30, 2025 and 2024:\nFor the three months ended September 30,\n2025\n2024\nShares \nAmount\nShares \nAmount\n(in millions)\nClass A Common Stock\n2.1 \n$\n62 \n0.9 \n$\n25 \nClass B Common Stock\n0.9 \n32 \n0.4 \n13 \nTotal\n3.0 \n$\n94 \n1.3 \n$\n38 \n34 \nTable of Contents\nDividends\nIn August 2025, the Company’s Board of Directors (the “Board of Directors”) declared a semi-annual cash dividend of $0.10 per share for Class A Common Stock and Class B Common Stock. The dividend was paid on October 8, 2025 to stockholders of record as of September 10, 2025. The timing, declaration, amount and payment of future dividends to stockholders, if any, is within the discretion of the Board of Directors. The Board of Directors’ decisions regarding the payment of future dividends will depend on many factors, including the Company’s financial condition, earnings, capital requirements and debt facility covenants, other contractual restrictions, as well as legal requirements, regulatory constraints, industry practice, market volatility and other factors that the Board of Directors deems relevant.\nSources and Uses of Cash—For the three months ended September 30, 2025 versus the three months ended September 30, 2024\nNet cash provided by operating activities from continuing operations\n for the three months ended September 30, 2025 and 2024 was as follows:\nFor the three months ended\nSeptember 30,\n \n2025\n2024\n(in millions)\nNet cash provided by operating activities from continuing operations\n$\n85 \n$\n26 \nNet cash provided by operating activities from continuing operations increased by $59 million for the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. The increase was primarily due to lower working capital and higher Total Segment EBITDA, partially offset by higher tax payments.\nNet cash used in investing activities from continuing operations\n for the three months ended September 30, 2025 and 2024 was as follows:\nFor the three months ended\nSeptember 30,\n \n2025\n2024\n(in millions)\nNet cash used in investing activities from continuing operations\n$\n(101)\n$\n(116)\nNet cash used in investing activities from continuing operations decreased by $15 million for the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, driven by the $34 million decrease in cash used for purchases of investments and $16 million of higher proceeds from sales of investments, partially offset by the $29 million increase in net cash used for acquisitions.\nNet cash used in financing activities from continuing operations\n for the three months ended September 30, 2025 and 2024 was as follows:\nFor the three months ended\nSeptember 30,\n2025\n2024\n(in millions)\nNet cash used in financing activities from continuing operations\n$\n(179)\n$\n(109)\nNet cash used in financing activities from continuing operations was $179 million for the three months ended September 30, 2025, as compared to $109 million for the three months ended September 30, 2024. \nDuring the three months ended September 30, 2025, the Company had $92 million of stock repurchases of outstanding Class A and Class B Common Stock under the Stock Repurchase Programs and dividend payments of $47 million primarily to REA Group minority stockholders.\n35 \nTable of Contents\nDuring the three months ended September 30, 2024, the Company had $57 million of borrowing repayments primarily at REA Group, $38 million of stock repurchases of outstanding Class A and Class B Common Stock under the 2021 Repurchase Program and dividend payments of $35 million primarily to REA Group minority stockholders. The net cash used in financing activities from continuing operations was partially offset by new borrowings of $56 million primarily at REA Group.\nReconciliation of Free Cash Flow\nFree cash flow is a non-GAAP financial measure. Free cash flow is defined as net cash provided by (used in) operating activities from continuing operations less capital expenditures. Free cash flow excludes cash flows from discontinued operations. Free cash flow may not be comparable to similarly titled measures reported by other companies, since companies and investors may differ as to what items should be included in the calculation of free cash flow.\nFree cash flow does not represent the total increase or decrease in the cash balance for the period and should be considered in addition to, not as a substitute for, the net change in cash and cash equivalents as presented in the Company’s consolidated Statements of Cash Flows prepared in accordance with GAAP, which incorporates all cash movements during the period.\nThe Company believes free cash flow provides useful information to management and investors about the Company’s liquidity and cash flow trends.\nThe following table presents a reconciliation of net cash provided by operating activities from continuing operations to free cash flow:\nFor the three months ended\nSeptember 30,\n2025\n2024\n(in millions)\nNet cash provided by operating activities from continuing operations\n$\n85 \n$\n26 \nLess: Capital expenditures\n(81)\n(75)\nFree cash flow\n$\n4 \n$\n(49)\nFree cash flow in the three months ended September 30, 2025 was $4 million compared to $(49) million in the corresponding period of fiscal 2025. Free cash flow improved primarily due to higher cash provided by operating activities from continuing operations, partially offset by higher capital expenditures.\nBorrowings\nNews Corporation Borrowings\nAs of September 30, 2025, News Corporation had (i) borrowings of $1,956 million, including the current portion, consisting of its outstanding 2021 Senior Notes, 2022 Senior Notes and Term A Loans, and (ii) $750 million of undrawn commitments available under the Revolving Facility. \nREA Group Borrowings\nAs of September 30, 2025, REA Group had A$200 million of undrawn commitments available under the 2024 REA Credit Facility. During the three months ended September 30, 2025, REA Group amended its 2024 REA Credit Facility to reduce the total amount available under the facility to A$200 million. REA Group is a consolidated but non wholly-owned subsidiary of News Corp, and its indebtedness is only guaranteed by REA Group and certain of its subsidiaries and is non-recourse to News Corp.\nHarperCollins Equipment Lease\nIn October 2025, HarperCollins entered into a finance leasing arrangement for up to $120 million of equipment for a new warehouse (the “Equipment Lease”), which is expected to increase efficiencies. Interest accrues on amounts drawn under the Equipment Lease based on the Term SOFR plus a margin of 1.475%. The Equipment Lease may be drawn on until June 30, 2028, after which lease payments commence for a term of 7 years. The lease obligations are secured by the acquired equipment, and ownership of the equipment acquired under the Equipment Lease will transfer to HarperCollins at the end of the lease term. The Equipment Lease will be classified as a finance lease on the Company’s balance sheet. \n36 \nTable of Contents\nAll of the Company’s borrowings contain customary representations, covenants and events of default. The Company was in compliance with all applicable covenants at September 30, 2025.\nSee Note 6—Borrowings in the accompanying Consolidated Financial Statements for further details regarding the Company’s outstanding debt, including additional information about interest rates, amortization (if any), maturities and covenants related to such debt arrangements.\nCommitments\nThe Company has commitments under certain firm contractual arrangements to make future payments. These firm commitments secure the current and future rights to various assets and services to be used in the normal course of operations. During the three months ended September 30, 2025, the Company entered into new leases, some of which will commence subsequent to fiscal 2026, and extended the terms of certain other leases. As a result, the Company has presented its commitments associated with its operating leases in the table below. The Company’s remaining commitments as of September 30, 2025 have not changed significantly from the disclosures included in the 2025 Form 10-K.\nAs of September 30, 2025\nPayments Due by Period\nLess than 1\nyear\n1-3 years\n3-5 years\nMore than 5\nyears\nTotal\n(in millions)\nOperating leases\n$\n106 \n$\n216 \n$\n177 \n$\n1,066 \n$\n1,565 \nContingencies\nThe Company routinely is involved in various legal proceedings, claims and governmental inspections or investigations, including those discussed in Note 10 to the Consolidated Financial Statements. The outcome of these matters and claims is subject to significant uncertainty, and the Company often cannot predict what the eventual outcome of pending matters will be or the timing of the ultimate resolution of these matters. Fees, expenses, fines, penalties, judgments or settlement costs which might be incurred by the Company in connection with the various proceedings could adversely affect its results of operations and financial condition.\nThe Company establishes an accrued liability for legal claims when it determines that a loss is probable and the amount of the loss can be reasonably estimated. Once established, accruals are adjusted from time to time, as appropriate, in light of additional information. The amount of any loss ultimately incurred in relation to matters for which an accrual has been established may be higher or lower than the amounts accrued for such matters. Legal fees associated with litigation and similar proceedings are expensed as incurred. The Company recognizes gain contingencies when the gain becomes realized or realizable. See Note 10—Commitments and Contingencies in the accompanying Consolidated Financial Statements."
}