{
  "source_file": "nxpi-20250928.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations \nManagement’s Discussion and Analysis (MD&A) should be read in conjunction with our Consolidated Financial Statements and Notes and the MD&A in our Annual Report on Form 10-K for the year ended \nDecember 31, 2024\n, and the Financial Statements and the related Notes that appear elsewhere in this document.\nOverview\nQuarterly Financial Highlights\n•\nRevenue was $3,173 million, down 2.4% year-on-year;\n•\nGAAP gross margin was 56.3%, and GAAP operating margin was 28.1%;\n•\nNon-GAAP gross margin was 57.0%, and non-GAAP operating margin was 33.8%;\n•\nCash flow from operations was $585 million, with net capital expenditures on property, plant and equipment of $76 million, resulting in non-GAAP free cash flow of $509 million;\n•\nDuring the third quarter of 2025, NXP returned capital to shareholders with the payment of $256 million in cash dividends and the repurchase of $54 million of its common shares, for a total capital return of $310 million.\nOn October 24, 2025, NXP closed the previously announced acquisition of 100% of Aviva Links for $243 million in cash, before closing adjustments. Aviva Links is a provider of Automotive SerDes Alliance (ASA) compliant in-vehicle connectivity solutions. The Aviva Links acquisition complements and expands NXP’s automotive networking solutions in the Automotive and Industrial & IoT end markets. We are currently evaluating the purchase price allocation for this transaction and expect to have our preliminary allocation completed in the fourth quarter of 2025.\nOn October 27, 2025, NXP closed the previously announced acquisition of 100% of Kinara, Inc. for $307 million in cash, before closing adjustments. Kinara is an industry leader in high performance, energy-efficient and programmable discrete neural processing units (NPUs). The Kinara acquisition complements and expands NXP’s solutions for AI-powered edge systems in the Industrial & IoT and Automotive end markets. We are currently evaluating the purchase price allocation for this transaction and expect to have our preliminary allocation completed in the fourth quarter of 2025.\nSee Note 3 to the consolidated financial statements for further information regarding NXP’s acquisition of TTTech Auto (acquired in Q2), Aviva Links, and Kinara, Inc.\nFollowing the previous announcement on April 28, 2025, Kurt Sievers has voluntarily retired as CEO and executive director of the Company effective October 28, 2025. The Company’s Board of Directors has unanimously appointed Rafael Sotomayor to succeed Mr. Sievers as President and CEO and temporary executive director of the Company effective as of October 28, 2025.\n21\nSequential Results\nQ3 2025 compared to Q2 2025\nRevenue for the three months ended September 28, 2025 was $3,173 million compared to $2,926 million for the three months ended June 29, 2025, an increase of $247 million or 8.4% quarter-on-quarter, in line with management's expectations. Within our end markets, the Automotive end market increased $108 million or 6.2%, the Mobile end market increased $99 million or 29.9%, the Industrial & IoT end market increased $33 million or 6.0%, and the Communication Infrastructure & Other end market increased $7 million or 2.2%.\nWhen aggregating all end markets together and reviewing sales channel performance, revenues through NXP's third party distribution partners was $1,866 million, an increase of $230 million or 14.1% compared to the previous period. Revenues through NXP's third party direct OEM and EMS customers was $1,269 million, an increase of $12 million or 1.0% versus the previous period.\nFrom a geographic perspective, revenue increased quarter-on-quarter in the China region by 13.0%, in the Americas region by 11.2%, in the Asia Pacific region by 7.7%, and in the EMEA region by 0.4%.\nOur gross profit percentage for the three months ended September 28, 2025 of 56.3% increased compared with 53.4% for the three months ended June 29, 2025, driven mainly by lower restructuring costs. \nOperating income for the three months ended September 28, 2025 was $893 million compared to $687 million for the three months ended June 29, 2025, an increase of $206 million or 30.0%. The sequential increase was mainly driven by higher revenue.\n22\nResults of operations\nThe following table presents operating results for each of the three- and nine-month periods ended September 28, 2025 and September 29, 2024, respectively:\n($ in millions, unless otherwise stated)\nQ3 2025\n% of Revenue\nQ3 2024\n% of Revenue\nYTD 2025\n% of Revenue\nYTD 2024\n% of Revenue\nRevenue\n3,173 \n3,250 \n8,934 \n9,503 \n% nominal growth\n(2.4)\n(5.4)\n(6.0)\n(3.6)\nGross profit\n1,787 \n1,866 \n4,909 \n5,441 \nGross margin\n56.3 \n%\n57.4 \n%\n54.9 \n%\n57.3 \n%\nResearch and development\n(575)\n18.1 \n%\n(577)\n17.8 \n%\n(1,695)\n19.0 \n%\n(1,735)\n18.3 \n%\nSelling, general and administrative\n(286)\n9.0 \n%\n(265)\n8.2 \n%\n(845)\n9.5 \n%\n(841)\n8.8 \n%\nAmortization of acquisition-related intangible assets\n(31)\n1.0 \n%\n(29)\n0.9 \n%\n(83)\n0.9 \n%\n(108)\n1.1 \n%\nOther income (expense)\n(2)\n0.1 \n%\n(5)\n0.2 \n%\n17 \n0.2 \n%\n(15)\n0.2 \n%\nOperating income (loss)\n893 \n28.1 \n%\n990 \n30.5 \n%\n2,303 \n25.8 \n%\n2,742 \n28.9 \n%\nFinancial income (expense)\n(98)\n3.1 \n%\n(82)\n2.5 \n%\n(276)\n3.1 \n%\n(227)\n2.4 \n%\nBenefit (provision) for income taxes\n(148)\n4.7 \n%\n(173)\n5.3 \n%\n(394)\n4.4 \n%\n(468)\n4.9 \n%\nResults relating to equity-accounted investees\n(1)\n— \n%\n(6)\n0.2 \n%\n(33)\n0.4 \n%\n(10)\n0.1 \n%\nNet income (loss)\n646 \n20.4 \n%\n729 \n22.4 \n%\n1,600 \n17.9 \n%\n2,037 \n21.4 \n%\nLess: Net income (loss) attributable to non-controlling interests\n15 \n0.5 \n%\n11 \n0.3 \n%\n34 \n0.4 \n%\n22 \n0.2 \n%\nNet income (loss) attributable to stockholders\n631 \n19.9 \n%\n718 \n22.1 \n%\n1,566 \n17.5 \n%\n2,015 \n21.2 \n%\nDiluted earnings per share\n2.48 \n2.79 \n6.16 \n7.80 \n23\nRevenue\nQ3 2025 Overview\nQ3 2025 compared to Q3 2024\nRevenue for the three months ended September 28, 2025 was $3,173 million compared to $3,250 million for the three months ended September 29, 2024,\n \na decrease of $77 million or 2.4%, in line with management’s expectations. \nYTD 2025 Overview\nYTD 2025 compared to YTD 2024\nRevenue for the nine months ended September 28, 2025 was $8,934 million compared to $9,503 million for the nine months ended September 29, 2024, a decrease of $569 million or 6.0%.\n24\nRevenue by end market was as follows:\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nAutomotive\n1,837 \n1,829 \n0.4 \n%\n5,240 \n5,361 \n(2.3)\n%\nIndustrial & IoT\n579 \n563 \n2.8 \n%\n1,633 \n1,753 \n(6.8)\n%\nMobile\n430 \n407 \n5.7 \n%\n1,099 \n1,101 \n(0.2)\n%\nCommunication Infrastructure & Other\n327 \n451 \n(27.5)\n%\n962 \n1,288 \n(25.3)\n%\nTotal Revenue\n3,173 \n3,250 \n(2.4)\n%\n8,934 \n9,503 \n(6.0)\n%\nRevenue by sales channel was as follows:\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nDistributors\n1,866 \n1,897 \n(1.6)\n%\n5,026 \n5,440 \n(7.6)\n%\nOEM/EMS\n1,269 \n1,321 \n(3.9)\n%\n3,810 \n3,970 \n(4.0)\n%\nOther\n38 \n32 \n18.8 \n%\n98 \n93 \n5.4 \n%\nTotal Revenue\n3,173 \n3,250 \n(2.4)\n%\n8,934 \n9,503 \n(6.0)\n%\nRevenue by geographic region, which is based on the customer’s shipped-to location was as follows:\n \n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nChina \n1)\n1,229 \n1,203 \n2.2 \n%\n3,351 \n3,315 \n1.1 \n%\nAPAC, excluding China\n851 \n845 \n0.7 \n%\n2,389 \n2,653 \n(10.0)\n%\nEMEA (Europe, the Middle East and Africa)\n677 \n719 \n(5.8)\n%\n1,994 \n2,138 \n(6.7)\n%\nAmericas\n416 \n483 \n(13.9)\n%\n1,200 \n1,397 \n(14.1)\n%\nTotal Revenue\n3,173 \n3,250 \n(2.4)\n%\n8,934 \n9,503 \n(6.0)\n%\n1)\n China includes Mainland China and Hong Kong\nQ3 2025 compared to Q3 2024\nFrom an end market perspective, NXP experienced growth in its Mobile, Industrial & IoT, and Automotive end markets, which was offset by a decline in the Communication Infrastructure & Other end market versus the year ago period.\nRevenue in the Automotive end market was $1,837 million, an increase of $8 million or 0.4% versus the year-ago period. The increase in the Automotive end market revenue was attributable to growth in our advanced analog products, which were offset by declines in our ADAS – Safety products and automotive processors.\nRevenue in the Industrial & IoT end market was $579 million, an increase of $16 million or 2.8% versus the year-ago period. The increase in the Industrial & IoT end market revenue was attributable to growth in our advanced analog, connectivity, and security products, which were offset by declines in our processors portfolio.\nRevenue in the Mobile end market was $430 million, an increase of $23 million or 5.7% versus the year ago period. The increase in the Mobile end market revenue was attributable to growth in our advanced analog products, which were offset by declines in our mobile wallet processors.\nRevenue in the Communication Infrastructure & Other end market was $327 million, a decrease of $124 million or 27.5% versus the year ago period. The decrease in the Communication Infrastructure & Other end market revenue was attributable to declines in our processors, secure cards, and RF power products.\nWhen aggregating all end markets together and reviewing sales channel performance, revenues through NXP’s third party distribution partners was $1,866 million, a decrease of 1.6% versus the year-ago period. Revenues through direct OEM and EMS customers was $1,269 million, a decrease of 3.9% versus the year ago period.\nFrom a geographic perspective, revenue increased year-on-year in the China region by 2.2% and in the Asia Pacific region by 0.7%, while revenue decreased in the Americas region by 13.9% and in the EMEA region by 5.8%.\nYTD 2025 compared to YTD 2024\nFrom an end market perspective, NXP experienced consistent revenue in its Mobile end market, which was offset by declines in the Automotive, Industrial & IoT, and Communication Infrastructure & Other end markets versus the year ago period.\n25\nRevenue in the Automotive end market was $5,240 million, a decrease of $121 million or 2.3% versus the year ago period. The decrease in the Automotive end market revenue was attributable to declines in our automotive processors and advanced analog portfolio, which were offset by growth in our ADAS – Safety products.\nRevenue in the Industrial & IoT end market was $1,633 million, a decrease of $120 million or 6.8% versus the year ago period. Within the Industrial & IoT end market, the decrease was primarily attributable to our processors portfolio.\nRevenue in the Mobile end market was $1,099 million, consistent with the year ago period.\nRevenue in the Communication Infrastructure & Other end market was $962 million, a decrease of $326 million or 25.3% versus the year ago period. The decrease in the Communication Infrastructure & Other end market was attributable to declines in our processors, secure cards, and RF power products.\nWhen aggregating all end markets together, and reviewing sales channel performance, revenues through NXP’s third party distribution partners was $5,026 million, a decrease of 7.6% versus the year-ago period. Revenues through direct OEM and EMS customers was $3,810 million, a decrease of 4.0% versus the year ago period.\nFrom a geographic perspective, revenue increased year-on-year in the China region by 1.1%, while revenue decreased in the Americas region by 14.1%, in the Asia Pacific region by 10.0%, and in the EMEA region by 6.7%.\nGross profit\nQ3 2025 compared to Q3 2024\nGross profit for the three months ended September 28, 2025 was $1,787 million, or 56.3% of revenue, compared to $1,866 million, or 57.4% of revenue for the t\nhree months ended September 29, 2024. \nThe decrease in gross margin is primarily due to price and unfavorable product mix.\nYTD 2025 compared to YTD 2024\nGross profit for the \nnine\n months ended \nSeptember 28, 2025 was $4,909 million, or 54.9% of revenue, compared to $5,441 million, or 57.3% of revenue for the nine months ended \nSeptember 29, 2024. \nThe decrease in gross margin is primarily due to price and unfavorable product mix.\nOperating expenses\nQ3 2025 compared to Q3 2024\nOperating expenses for the three months ended September 28, 2025 totaled $892 million, or 28.1% of revenue, compared to $871 million, or 26.8% of revenue for the three months ended September 29, 2024.\nYTD 2025 compared to YTD 2024\nOperating expenses for the nine months ended September 28, 2025 totaled $2,623 million, or 29.4% of revenue, compared to $2,684 million, or 28.2% of revenue for the nine months ended September 29, 2024.\n•\nResearch and development\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nResearch and development\n575 \n577 \n(0.3)\n%\n1,695 \n1,735 \n(2.3)\n%\nAs a percentage of revenue\n18.1 \n%\n17.8 \n%\n0.3 \n ppt\n19.0 \n%\n18.3 \n%\n0.7 \n ppt\nQ3 2025 compared to Q3 2024\nR&D costs for the three months ended September 28, 2025 decreased by $2 million, or 0.3%, when compared to the three months ended September 29, 2024, driven by higher subsidies from government agencies ($7 million), lower personnel related expenses ($4 million), offset by expenditures related to the integration of the TTTech Auto acquisition ($9 million).\nYTD 2025 compared to YTD 2024\nR&D costs for the nine months ended September 28, 2025 decreased by $40 million, or 2.3%, when compared to the nine months ended September 29, 2024. This reduction\n was driven by \nlower personnel-related expenses ($69 million), inclusive of lower variable compensation costs, to create capacity for future strategic investments. This decrease was partially offset by expenditures related to the integration of the TTTech Auto acquisition ($9 million) and an increase in mask-related costs ($15 million). \n26\nSelling, general and administrative\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nSelling, general and administrative\n286 \n265 \n7.9 \n%\n845 \n841 \n0.5 \n%\nAs a percentage of revenue\n9.0 \n%\n8.2 \n%\n0.8 \nppt\n9.5 \n%\n8.8 \n%\n0.7 \nppt\nQ3 2025 compared to Q3 2024\nSG&A costs for the three months ended September 28, 2025 increased by $21 million, or 7.9%, when compared to the three months ended September 29, 2024 mainly driven by personnel and integration related costs driven by the TTTech Auto acquisition ($10 million), legal fees ($4 million) and higher share-based compensation costs ($4 million).\nYTD 2025 compared to YTD 2024\nSG&A costs for the nine months ended September 28, 2025 increased by $4 million, or 0.5%, when compared to the nine months ended September 29, 2024 due to \nhigher expenses related to our closed or pending acquisitions\n ($23 million), offset by  a reduction\n in variable compensation costs \n($21 million).\n•\nAmortization of acquisition-related intangible assets\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\n% change\nYTD 2025\nYTD 2024\n% change\nAmortization of acquisition-related intangible assets\n31 \n29 \n6.9 \n%\n83 \n108 \n(23.1)\n%\nAs a percentage of revenue\n1.0 \n%\n0.9 \n%\n0.1 \n ppt\n0.9 \n%\n1.1 \n%\n(0.2)\n ppt\nQ3 2025 compared to Q3 2024\nAmortization of acquisition-related intangible assets for the three months ended September 28, 2025 increased by $2 million, or 6.9%, when compared to the three months ended September 29, 2024\n.\nYTD 2025 compared to YTD 2024\nAmortization of acquisition-related intangible assets for the nine months ended September 28, 2025 decreased by $25 million, or 23.1%, when compared to the nine months ended September 29, 2024\n primarily due to the effect of certain acquisition-related intangibles becoming fully amortized \n(with regard to the previous Marvell acquisition).\nFinancial income (expense)\nThe following table presents the details of financial income and expenses:\n($ in millions, unless otherwise stated)\nQ3 2025\nQ3 2024\nYTD 2025\nYTD 2024\nInterest income\n37 \n36 \n111 \n125 \nInterest expense\n(118)\n(96)\n(339)\n(298)\nOther financial income/ (expense)\n(17)\n(22)\n(48)\n(54)\nTotal\n(98)\n(82)\n(276)\n(227)\nQ3 2025 compared to Q3 2024\nFinancial income (expense) was an expense of $98 million for the three months ended September 28, 2025, compared to an expense of $82 million for the three months ended September 29, 2024. Interest income remained flat, whereas interest expense increased by $22 million due to the interest expenses on the issuance of new bonds, interest expenses on the EIB loans as well as the commercial paper. Within Other financial income/ (expense), fair value adjustments in equity securities resulted in no result for the three months ended September 28, 2025 versus a loss of $7 million for the three months ended September 29, 2024.\nYTD 2025 compared to YTD 2024\nFinancial income (expense) was an expense of $276 million for the nine months ended September 28, 2025, compared to an expense of $227 million for the nine months ended September 29, 2024. Interest income decreased by $14 million due to lower cash levels, whereas interest expense increased by $41 million due to the interest expenses due to issuance of new bonds, interest expenses on the EIB loans and commercial paper. Within Other financial income/ (expense), fair value adjustments in equity securities resulted in a loss of $2 million for the nine months ended September 28, 2025, versus a loss of $12 million for the nine months ended September 29, 2024.\n27\nBenefit (provision) for income taxes\nOur provision for income taxes for 2025 is based on our EAETR of 18.7%, which is lower than the Netherlands statutory tax rate of 25.8%, primarily due to tax benefits from the Netherlands and foreign tax incentives. \nQ3 2025\nQ3 2024\nYTD 2025\nYTD 2024\nTax benefit (provision) calculated at EAETR\n(149)\n(160)\n(380)\n(446)\nDiscrete tax benefit (provision) items\n1 \n(13)\n(14)\n(22)\nBenefit (provision) for income taxes\n(148)\n(173)\n(394)\n(468)\nEffective tax rate\n18.6 \n%\n19.0 \n%\n19.4 \n%\n18.6 \n%\n \nQ3 2025 compared to Q3 2024\nThe effective tax rate of 18.6% for the third quarter of 2025 was lower than the EAETR due to the income tax benefit for discrete items of $1 million. The discrete items are primarily related to the impact of foreign currency on income tax related items, changes in estimates for previous years, and changes in the litigation accrual and related insurance reimbursements relating to the Motorola Personal Injury Lawsuits regarding previous years.\nYTD 2025 compared to YTD 2024\nFor the first nine months ended 2025, the effective tax rate of 19.4% was higher than 18.6% due to a net result of unfavorable discrete items of $14 million. These discrete items are primarily related to the impact of changes in estimates for previous years, and changes in the litigation accrual and related insurance reimbursements relating to the Motorola Personal Injury Lawsuits. \nThe effective tax rate of 19.4% for the first nine months of 2025 was higher compared to the rate for the first nine months ended 2024 of 18.6% due to a different mix of the benefit (provision) for income taxes in our operating locations and lower foreign tax incentives in the current period as a result of a decrease in qualifying income.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework and the restoration of favorable tax treatment for certain business provisions. The legislation has multiple effective dates, with certain provisions effective in 2025 and others implemented as of 2026. We have assessed that there is effectively no material tax impact on our consolidated financial statements. We also note that there is still unclarity about what the G7 statement in relation to the US on global minimum taxes, as announced on June 28, 2025, could mean for the Company.\nResults Relating to Equity-accounted Investees \nQ3 2025 compared to Q3 2024\nResults relating to equity-accounted investees amounted to a loss of $1 million for the three months ended September 28, 2025, whereas the three months ended September 29, 2024 results relating to equity-accounted investees amounted to a loss of $6 million.\nYTD 2025 compared to YTD 2024\nResults relating to equity-accounted investees amounted to a loss of $33 million (which includes an impairment charge of $27 million related to our investment in SigmaSense) for the nine months ended September 28, 2025, whereas the nine months ended September 29, 2024 results relating to equity-accounted investees amounted to a loss of $10 million.\nNon-controlling Interests \nQ3 2025 compared to Q3 2024\nNon-controlling interests are related to the third-party share in the results of consolidated companies, predominantly SSMC. Their share of non-controlling interests amounted to a profit of $15 million for the three months ended September 28, 2025, compared to a profit of $11 million for the three months ended September 29, 2024.\nYTD 2025 compared to YTD 2024\nNon-controlling interests are related to the third-party share in the results of consolidated companies, predominantly SSMC. Their share of non-controlling interests amounted to a profit of $34 million for the nine months ended September 28, 2025, compared to a profit of $22 million for the nine months ended September 29, 2024.\n28\nLiquidity and Capital Resources\nWe derive our liquidity and capital resources primarily from our cash flows from operations. We continue to generate strong positive operating cash flows. At the end of the third quarter of 2025, our cash balance was $3,454 million, an increase of $162 million compared to December 31, 2024. Taking into account the available amount of the unsecured revolving credit facility of $2,500 million (\"RCF\"), we had access to $5,954\n \nmillion of liquidity as of September 28, 2025. We currently use cash to fund operations, meet working capital requirements, for capital expenditures and for potential common stock repurchases, dividends and strategic investments. Based on past performance and current expectations, we believe that our current available sources of funds (including cash and cash equivalents, short-term deposits of $500 million, RCF of $2.5 billion, plus anticipated cash generated from operations) will be adequate to finance our operations, working capital requirements, capital expenditures and potential dividends for at least the next twelve months.\n($ in millions, unless otherwise stated)\nYTD 2025\nYTD 2024\nCash from operations\n1,929 \n2,391 \nCapital expenditures\n299 \n597 \nCash to shareholders\n1,332 \n1,698 \nCash and short-term deposits\nAt September 28, 2025, our cash and short-term deposits balance was $3,954 million of which $324 million was held by SSMC, our consolidated joint venture company with TSMC. Under the terms of our joint venture agreement with TSMC, a portion of this cash can be distributed by way of a dividend to us, but 38.8% of the dividend will be paid to our joint venture partner. \nCapital expenditures\nOur cash outflows for capital expenditures were $299 million in the first nine months of 2025, compared to $597 million in the first nine months of 2024.\nCapital return\nUnder our Quarterly Dividend Program, interim dividends of $1.014 per ordinary share were paid on January 8, 2025 ($258 million), dividends of $1.014 per ordinary share were paid on April 9, 2025 ($257 million), dividends of $1.014 per ordinary share were paid on July 9, 2025 ($256 million) and dividends of $1.014 per ordinary share were paid on October 8, 2025 ($255 million).  \nIn the first nine months of 2025 we repurchased approximately $561 million of shares.\nDebt\nOur total debt, inclusive of aggregate principal, unamortized discounts, premiums, debt issuance costs and fair value adjustments, amounted to $12,235 million as of September 28, 2025, an increase of $1,381 million compared to December 31, 2024 ($10,854 million). \n \nOn May 1, 2025, we repaid the $500 million aggregate principal amount of outstanding 2.7% senior unsecured notes due 2025 at maturity using available cash. \nOn August 19, 2025, NXP issued $500 million of 4.30% senior unsecured notes due 2028, $300 million of 4.85% senior unsecured notes due 2032 and $700 million of 5.25% senior unsecured notes due 2035 (collectively, the \"Notes\"). The Company intends to use the net proceeds from the offering of the Notes to redeem the $500 million aggregate principal amount of outstanding dollar-denominated 5.35% senior unsecured notes due 2026 and the $750 million aggregate principal amount of outstanding dollar-denominated 3.875% senior unsecured notes due 2026, in accordance with the terms of the applicable indenture governing such notes, including all premiums, accrued interest and costs and expenses related to such redemptions. Pending such application, such proceeds and the excess net proceeds from the Notes will be temporarily held as cash and other short-term securities or used for general corporate purposes, which may include capital expenditures or short-term debt repayment.\nAs of September 28, 2025, we had outstanding fixed-rate notes with varying maturities for an aggregate principal amount of $11,250 million (collectively the “Notes”), of which $1.25 billion is payable within 12 months. Future interest payments associated with the Notes total $2,997 million, with $424 million payable within 12 months.\nAs of September 28, 2025, the Company had outstanding loans with the European Investment Bank (EIB) for an aggregated principal amount of $1,040 million. Future interest payments associated with the EIB loans total $252 million, with $47 million payable within 12 months.\nAs of September 28, 2025, we had $15 million commercial paper notes outstanding with a duration less than 12 months.\n29\nOur net debt position (see section Use of Certain Non-GAAP Financial Measures) at September 28, 2025 amounted to $8,281 million, compared to $7,562 million as of December 31, 2024. \nAdditional Capital Requirements\nExpected working and other capital requirements are described in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”. At September 28, 2025, other than for changes disclosed in the “Notes to Condensed Consolidated Financial Statements” and “Liquidity and Capital Resources” in this Quarterly Report, there have been no other material changes to our expected working and other capital requirements described in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\n30\nCash flows\nOur cash and cash equivalents during the first nine months of 2025 increased by $156 million (excluding the effect of changes in exchange rates on our cash position of $6 million) as follows:\n($ in millions, unless otherwise stated)\nYTD 2025\nYTD 2024\nNet cash provided by (used for) operating activities\n1,929 \n2,391 \nNet cash (used for) provided by investing activities\n(1,891)\n(884)\nNet cash provided by (used for) financing activities\n118 \n(2,621)\nIncrease (decrease) in cash and cash equivalents\n156 \n(1,114)\nCash Flow from Operating Activities\nFor the first nine months of 2025 our operating activities provided $1,929 million in cash. This was primarily the result of net income of $1,600 million, adjustments to reconcile the net income of $960 million and changes in operating assets and liabilities of $(655) million. Adjustments to net income (loss) include non-cash items, such as depreciation and amortization of $617 million, share-based compensation of $362 million and changes in deferred taxes (benefit) of $(32) million. Changes in operating assets and liabilities were primarily driven by a $81 million increase in receivables and other current assets due to the related timing of cash collection, $180 million increase in inventories in order to align inventory on hand with expected demand, and $296 million decrease in accounts payable and other liabilities as a result of lower purchase volumes and timing related to payments.\nFor the first nine months of 2024 our operating activities provided $2,391 million in cash. This was primarily the result of net income of $2,037 million, adjustments to reconcile the net income of $910 million and changes in operating assets and liabilities of $(574) million. Adjustments to net income (loss) includes non-cash items, such as depreciation and amortization of $666 million, share-based compensation of $344 million and changes in deferred taxes of ($127) million. Changes in operating assets and liabilities were primarily driven by a $204 million decrease in accounts payable and other liabilities as a result of lower purchase volumes and timing related to payments, $182 million increase in receivables and other current assets due to the linearity of revenue between the two periods, customer mix, and the related timing of cash collection, and $100 million increase in inventories in order to align inventory on hand with expected demand, partially offset by a $88 million increase in other non-current assets from the application of prepayments used to secure long-term production supply.\nCash Flow from Investing Activities\nNet cash used for investing activities amounted to $1,891 million for the first nine months of 2025 and principally consisted of the purchase of interests in business (net of cash acquired) of $690 million (mainly driven by the acquisition of TTTech Auto for $679 million), investments in short-term deposits of $500 million, capital expenditures of $299 million, $319 million for the purchase of investments (driven primarily by the capital contributions of $209 million into VSMC and approximately $47 million into ESMC) and $85 million for the purchase of identified intangible assets, including EDA (electronic design automation).\nNet cash used for investing activities amounted to $884 million for the first nine months of 2024 and principally consisted of the cash outflows for capital expenditures of $597 million, $193 million for the purchase of investments (driven primarily by the  capital contributions of approximately $31 million into ESMC and approximately $140 million into VSMC), and $113 million for the purchase of identified intangible assets, including EDA (electronic design automation).\nCash Flow from Financing Activities  \nNet cash provided from financing activities of $118 million for the first nine months of 2025 was primarily driven by the proceeds from the issuance of commercial paper notes of $2,426 million, proceeds from issuance of long-term debt of $1,868 million, and the proceeds from the issuance of common stock through stock plans of  $77 million, partially offset by the repayment of commercial paper notes of $2,411 million, dividend payments to common stockholders of $771 million, purchase of treasury shares and restricted stock unit holdings of $561 million, and repurchase of long-term debt of 500 million.\nNet cash used for financing activities of $2,621 million for the first nine months of 2024 was primarily driven by the payment of $1 billion to retire at maturity our outstanding 4.875% senior unsecured notes due March 2024, dividend payment to common stockholders of $780 million, and purchase of treasury shares and restricted stock unit holdings of $918 million; partially offset by the proceeds from the issuance of common stock through stock plans of $79 million.\n31\nInformation Regarding Guarantors of NXP (unaudited)\nSummarized Combined Financial Information for Guarantee of Securities of Subsidiaries\nAll debt instruments are guaranteed, fully and unconditionally, jointly and severally, by NXP Semiconductors N.V. and issued or guaranteed by NXP USA, Inc., NXP B.V. and NXP LLC, (together, the “Subsidiary Obligors” and together with NXP Semiconductors N.V., the “Obligor Group”). Other than the Subsidiary Obligors, none of the Company’s subsidiaries (together the “Non-Guarantor Subsidiaries”) guarantee the Notes. The Company consolidates the Subsidiary Obligors in its Consolidated Financial Statements and each of the Subsidiary Obligors are wholly owned subsidiaries of the Company.\nAll of the existing guarantees by the Company rank equally in right of payment with all of the existing and future senior indebtedness of the Obligor Group. There are no significant restrictions on the ability of the Obligor Group to obtain funds from respective subsidiaries by dividend or loan.\n \nThe following tables present summarized financial information of the Obligor Group on a combined basis, with intercompany balances and transactions between entities of the Obligor Group eliminated and investments and equity in the earnings of the Non-Guarantor Subsidiaries excluded. The Obligor Group’s amounts due from, amounts due to, and intercompany transactions with Non-Guarantor Subsidiaries have been disclosed below the table, when material.\nSummarized Statements of Income\nFor the nine months ended\n($ in millions)\nSeptember 28, 2025\nRevenue\n4,939 \nGross Profit\n2,278 \nOperating income\n571 \nNet income\n(24)\nSummarized Balance Sheets\nAs of\n($ in millions)\nSeptember 28, 2025\nDecember 31, 2024\nCurrent assets\n3,902 \n3,273 \nNon-current assets\n12,064 \n12,191 \nTotal assets\n15,966 \n15,464 \nCurrent liabilities\n2,011 \n1,244 \nNon-current liabilities\n11,426 \n10,967 \nTotal liabilities\n13,437 \n12,211 \nObligor's Group equity\n2,529 \n3,253 \nTotal liabilities and Obligor's Group equity\n15,966 \n15,464 \nNXP Semiconductors N.V. is the head of a fiscal unity for the corporate income tax and VAT that contains the most significant Dutch wholly-owned group companies. The Company is therefore jointly and severally liable for the tax liabilities of the tax entity as a whole, and as such the income tax expense of the Dutch fiscal unity has been included in the Net income of the Obligor Group.\nThe financial information of the Obligor Group includes sales executed through a Non-Guarantor Subsidiary single-billing entity as a sales agent on behalf of an entity in the Obligor Group. The Obligor Group has sales to non-guarantors (for the nine months ended September 28, 2025: $532 million). The Obligor Group has amounts due from equity financing (September 28, 2025: $5,534 million; December 31, 2024: $5,749 million) and due to debt financing (September 28, 2025: $2,060 million; December 31, 2024: $2,283 million) with non-guarantor subsidiaries.\n32\nUse of Certain Non-GAAP Financial Measures\nNon-GAAP Financial Measures\nIn addition to providing financial information on a basis consistent with U.S. generally accepted accounting principles (“US GAAP” or “GAAP”), NXP also provides selected financial measures on a non-GAAP basis which are adjusted for specified items. The adjustments made to achieve these non-GAAP financial measures or the non-GAAP financial measures as specified are described below, including the usefulness to management and investors.\nIn managing NXP’s business on a consolidated basis, management develops an annual operating plan, which is approved by our Board of Directors, using non-GAAP financial measures. In measuring performance against this plan, management considers the actual or potential impacts on these non-GAAP financial measures from actions taken to reduce costs with the goal of increasing our gross margin and operating margin and when assessing appropriate levels of research and development efforts. In addition, management relies upon these non-GAAP financial measures when making decisions about product spending, administrative budgets, and other operating expenses. We believe that these non-GAAP financial measures, when coupled with the GAAP results and the reconciliations to corresponding GAAP financial measures, provide a more complete understanding of the Company’s results of operations and the factors and trends affecting NXP’s business. We believe that they enable investors to perform additional comparisons of our operating results, to assess our liquidity and capital position and to analyze financial performance excluding the effect of expenses unrelated to core operating performance, certain non-cash expenses and share-based compensation expense, which may obscure trends in NXP’s underlying performance. This information also enables investors to compare financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management.\nThe presentation of these and other similar items in NXP’s non-GAAP financial results should not be interpreted as implying that these items are non-recurring, infrequent, or unusual. These non-GAAP financial measures are provided in addition to, and not as a substitute for, or superior to, measures of financial performance prepared in accordance with GAAP.\nNon-GAAP Adjustment or Measure\nDefinition\nUsefulness to Management and Investors\nPurchase price accounting effects\nPurchase price accounting (\"PPA\") effects reflect the fair value adjustments impacting acquisition accounting and other acquisition adjustments charged to the Consolidated Statement of Operations. This typically relates to inventory, property, plant and equipment, as well as intangible assets, such as developed technology and marketing and customer relationships acquired. The PPA effects are recorded within both cost of revenue and operating expenses in our US GAAP financial statements. These charges are recorded over the estimated useful life of the related acquired asset, and thus are generally recorded over multiple years.\nWe believe that excluding these charges related to fair value adjustments for purposes of calculating certain non-GAAP measures allows the users of our financial statements to better understand the historic and current cost of our products, our gross margin, our operating costs, our operating margin, and also facilitates comparisons to peer companies.\nRestructuring\nRestructuring charges are costs associated with a restructuring plan and are primarily related to employee severance and benefit arrangements. Charges related to restructuring are recorded within both cost of revenue and operating expenses in our US GAAP financial statements\nWe exclude restructuring charges, including any adjustments to charges recorded in prior periods, for purposes of calculating certain non-GAAP measures because these costs do not reflect our core operating performance. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends.\nShare-based compensation\nShare-based compensation consists of incentive expense granted to eligible employees in the form of equity based instruments. Charges related to share-based compensation are recorded within both cost of revenue and operating expenses in our US GAAP financial statements.\nWe exclude charges related to share-based compensation for purposes of calculating certain non-GAAP measures because we believe these charges, which are non-cash, are not representative of our core operating performance as they can fluctuate from period to period based on factors that are not within our control, such as our stock price on the dates share-based grants are issued. We believe these adjustments provide investors with a useful view, through the eyes of management, of our core business model, how management currently evaluates core operational performance, and additional means to evaluate expense trends.\nOther incidentals\nOther incidentals consist of certain items which may be non-recurring, unusual, infrequent or directly related to an event that is distinct and non-reflective of the Company’s core operating performance. These may include such items as process and product transfer costs, certain charges related to acquisitions and divestitures, litigation and legal settlements, costs associated with the exit of a product line, factory or facility, environmental or governmental settlements, and other items of similar nature.\nWe exclude these certain items which may be non-recurring, unusual, infrequent or directly related to an event that is distinct and non-reflective of the Company’s core operating performance for purposes of calculating certain non-GAAP measures. These adjustments facilitate a useful evaluation of our core operating performance and comparisons to past operating results and provide investors with additional means to evaluate expense trends.\n33\nNon-GAAP Adjustment or Measure\nDefinition\nUsefulness to Management and Investors\nNon-GAAP Provision for income taxes\nNon-GAAP provision for income taxes is NXP's GAAP provision for income taxes adjusted for the income tax effects of the adjustments to our GAAP measure, including PPA effects, restructuring costs, share-based compensation, other incidental items and certain other adjustments to financial income (expense) items. Additionally, adjustments are made for the income tax effect of any discrete items that occur in the interim period. Discrete items primarily relate to unexpected tax events that may occur as these amounts cannot be forecasted (e.g., the impact of changes in tax law and/or rates, changes in estimates or resolved tax audits relating to prior year tax provisions, the excess or deficit tax effects on share-based compensation, etc.).\nThe non-GAAP provision for income taxes is used to ascertain and present on a comparable basis NXP's provision for income tax after adjustments, the usefulness of which is described within this table. Additionally, the income tax effects of the adjustments to achieve the noted non-GAAP measures are used to determine NXP's non-GAAP net income (loss) attributable to stockholders and accordingly, our diluted non-GAAP earnings per share attributable to stockholders.\nFree Cash Flow\nFree Cash Flow represents operating cash flow adjusted for net additions to property, plant and equipment.\nWe believe that free cash flow provides insight into our cash-generating capability and our financial performance, and is an efficient means by which users of our financial statements can evaluate our cash flow after meeting our capital expenditure.\nNet debt\nNet debt represents total debt (short-term and long-term) after deduction of cash and cash equivalents and short-term deposits.\nWe believe this measure provides investors with useful supplemental information about the financial performance of our business, enables comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect of calculating our net leverage.\nThe following are reconciliations of our most comparable US GAAP measures to our non-GAAP measures presented:\n($ in millions)\nFor the three months ended\nSeptember 28, 2025\nJune 29, 2025\nSeptember 29, 2024\nGAAP gross profit\n$\n1,787\n \n$\n1,562\n \n$\n1,866\n \nPPA effects\n(6)\n(7)\n(12)\nRestructuring\n— \n(61)\n— \nShare-based compensation\n(15)\n(14)\n(14)\nOther incidentals\n(2)\n(8)\n— \nNon-GAAP gross profit\n$\n1,810\n \n$\n1,652\n \n$\n1,892\n \nGAAP Gross Margin\n56.3\n \n%\n53.4\n \n%\n57.4\n \n%\nNon-GAAP Gross Margin\n57.0\n \n%\n56.5\n \n%\n58.2\n \n%\nGAAP research and development\n$\n(575)\n$\n(573)\n$\n(577)\nRestructuring\n(1)\n(3)\n— \nShare-based compensation\n(57)\n(58)\n(58)\nOther incidentals\n(2)\n(7)\n— \nNon-GAAP research and development\n$\n(515)\n$\n(505)\n$\n(519)\nGAAP selling, general and administrative\n$\n(286)\n$\n(278)\n$\n(265)\nPPA effects\n(1)\n— \n(1)\nRestructuring\n(2)\n(3)\n— \nShare-based compensation\n(46)\n(45)\n(43)\nOther incidentals\n(14)\n(15)\n(2)\nNon-GAAP selling, general and administrative\n$\n(223)\n$\n(215)\n$\n(219)\nGAAP operating income (loss)\n$\n893\n \n$\n687\n \n$\n990\n \n34\n($ in millions)\nFor the three months ended\nSeptember 28, 2025\nJune 29, 2025\nSeptember 29, 2024\nGAAP operating income (loss)\n$\n893\n \n$\n687\n \n$\n990\n \nPPA effects\n(38)\n(32)\n(42)\nRestructuring\n(3)\n(67)\n— \nShare-based compensation\n(118)\n(117)\n(115)\nOther incidentals\n(19)\n(32)\n(6)\nNon-GAAP operating income (loss)\n$\n1,071\n \n$\n935\n \n$\n1,153\n \nGAAP Operating Margin\n28.1\n \n%\n23.5\n \n%\n30.5\n \n%\nNon-GAAP Operating Margin\n33.8\n \n%\n32.0\n \n%\n35.5\n \n%\nGAAP Income tax benefit (provision)\n$\n(148)\n$\n(116)\n$\n(173)\nIncome tax effect\n25 \n32 \n9 \nNon-GAAP Income tax benefit (provision)\n$\n(173)\n$\n(148)\n$\n(182)\n($ in millions)\nFor the three months ended\nSeptember 28, 2025\nJune 29, 2025\nSeptember 29, 2024\nNet cash provided by (used for) operating activities \n$\n585\n \n$\n779\n \n$\n779\n \nNet capital expenditures on property, plant and equipment\n(76)\n(83)\n(186)\nNon-GAAP free cash flow\n$\n509\n \n$\n696\n \n$\n593\n \n($ in millions)\nFor the three months ended\nSeptember 28, 2025\nJune 29, 2025\nSeptember 29, 2024\nLong-term debt\n$\n10,971 \n$\n9,479 \n$\n9,683 \nShort-term debt\n1,264 \n1,999 \n499 \nTotal debt\n12,235 \n11,478 \n10,182 \nLess: cash and cash equivalents\n(3,454)\n(3,170)\n(2,748)\nLess: short-term deposits\n(500)\n— \n(400)\nNet debt\n$\n8,281\n \n$\n8,308\n \n$\n7,034\n \n35"
}