{
  "item1": "NFC, Automotive Car-access, In-Vehicle Networking, Micro-controllers, ADAS (Radar), Analog, Mixed-Signal Power Automotive In-Vehicle Networking Sensors, Analog, RFID, Banking e-Passport modules, Power Management Kuala Lumpur, Malaysia Micro-processors, ADAS/Radar, Micro-controllers, Advanced Audio Processor, Sensors, Power Management, Analog Mixed Signal, RF devices Micro-processors, Micro-controllers, Power Management, Battery Management, Analog Mixed Signal Joint venture TSMC. use large number raw materials front- back-end manufacturing processes, including silicon wafers, chemicals, gases, lead frames, substrates, molding compounds various types precious other metals. most important raw materials raw, substrate, silicon wafers use make semiconductors. purchase these wafers, which must meet exacting specifications, limited number suppliers geographic region which fabrication facilities located.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations items year-to-year comparisons between items year-to-year comparisons between filed SEC February 22, 2024. MD&A provided addition accompanying consolidated financial statements notes assist readers understanding results operations, financial condition cash flows. MD&A organized follows: - Overall analysis financial other highlights provide context MD&A Results Operations - analysis financial results Financial Condition, Liquidity Capital Resources - analysis changes balance sheets cash flows discussion financial condition potential sources liquidity Critical Accounting Estimates - Accounting estimates management believes most important understanding assumptions judgments incorporated financial results forecasts Use Certain Non-GAAP Financial Measures - discussion presentation non-GAAP financial measures NXP one reportable segment representing entity whole.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations , Financial Statements related Notes appear elsewhere document. Quarterly Financial Highlights Revenue $3,173 million, down 2.4% year-on-year; GAAP gross margin 56.3%, GAAP operating margin 28.1%; Non-GAAP gross margin 57.0%, non-GAAP operating margin 33.8%; Cash flow operations $585 million, net capital expenditures property, plant equipment $76 million, resulting non-GAAP free cash flow $509 million; During third quarter 2025, NXP returned capital shareholders payment $256 million cash dividends repurchase $54 million its common shares, total capital return $310 million. October 24, 2025, NXP closed previously announced acquisition 100% Aviva Links $243 million cash, before closing adjustments."
}