{
  "item1": "below) comes properties leased investment grade clients, subsidiaries affiliated companies. December 31, 2024, top 20 clients (based percentage total portfolio annualized contractual rent) represented 36.4% annualized rent 10 these clients investment grade credit ratings subsidiaries affiliates investment grade companies. Asset Management Strategy addition pursuing new properties investment, seek increase earnings dividends through active asset management. Generally, asset management efforts seek achieve: Rent increases during expiration existing leases, when market conditions permit; Optimum exposure certain clients, industries, markets through re-leasing vacant properties selectively selling properties; Maximum asset-level returns properties renewed, re-leased sold; Additional value creation opportunities existing portfolio leveraging internal capabilities enhance individual properties, pursue alternative uses, derive ancillary revenue.",
  "item7": "Derivative gain loss primarily related mark-to-market adjustments derivatives do not qualify hedge accounting settlement designated derivatives reclassified Accumulated Other Comprehensive Income (\"AOCI\"). Foreign currency derivative gain (loss), net $3.4 million gain year ended December 31, 2024 compared $13.4 million loss same period 2023, primarily due impact foreign currency fluctuations remeasurement intercompany debt. Equity Earnings Unconsolidated Entities Equity earnings unconsolidated entities $7.8 million year ended December 31, 2024, compared $2.5 million year ended December 31, 2023. increase equity earnings unconsolidated entities due increase joint venture investments.",
  "item2": "Management’s Discussion Analysis Financial Condition Results Operations FORWARD-LOOKING STATEMENTS Additional factors may cause risks uncertainties include those risks described Annual Report Readers cautioned not place undue reliance forward-looking statements. Forward-looking statements not guarantees future plans performance speak only date quarterly report filed SEC. Past operating results performance provided informational purposes not guarantee future results. There can no assurance historical trends will continue."
}