{
  "item1": "- Natural Gas Liquids segment, NGLs extracted own third-party natural gas processing plants gathered NGL gathering pipelines. Gathered NGLs directed downstream fractionators separated into Purity NGLs. Purity NGLs stored distributed customers, such petrochemical companies, propane distributors, diluent users, ethanol producers, refineries exporters. provide midstream services producers NGLs Rocky Mountain region, Mid-Continent region, Permian Basin Gulf Coast region (including Louisiana) deliver those products market.",
  "item7": "increase $291 million due primarily interstate natural gas pipeline divestiture 2024, higher transportation services operating income EnLink; Refined Products Crude - increase $934 million due full year operating income following Magellan Acquisition 2023 operating income Medallion EnLink 2024; Consolidated Transaction Costs - decrease $85 million due primarily higher transaction costs related Magellan Acquisition 2023. Net income increased due primarily items discussed above higher equity net earnings investments, offset partially higher interest expense due higher debt balances resulting August 2023 $5.25 billion notes offering, September 2024 $7.0 billion notes offering acquired debt balances both Magellan Acquisition 2023 EnLink Controlling Interest Acquisition 2024. Diluted EPS decreased due primarily impact insurance settlement gain 2023 related Medford incident Capital expenditures increased due primarily capital projects. Please refer “Recent Developments” section Management’s Discussion Analysis Financial Condition Results Operations Annual Report additional information capital projects.",
  "item2": "(a) - three months ended September 30, 2025, included transaction costs related primarily EnLink Acquisition $7 million included within other $3 million included within noncash compensation expense other. nine months ended September 30, 2025, included transaction costs related primarily EnLink Acquisition $59 million included within other $15 million included within noncash compensation expense other. (b) - three nine months ended September 30, 2025, included corporate net gains extinguishment debt $22 million $58 million, respectively, connection open market repurchases. CONTINGENCIES See Note J Notes Consolidated Financial Statements Quarterly Report discussion regulatory legal matters."
}