{
  "source_file": "oke-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis should be read in conjunction with our unaudited Consolidated Financial Statements and the Notes to Consolidated Financial Statements in this Quarterly Report, as well as our Annual Report.\nRECENT DEVELOPMENTS\nPlease refer to the “Financial Results and Operating Information” and “Liquidity and Capital Resources” sections of Management’s Discussion and Analysis of Financial Condition and Results of Operations in this Quarterly Report for additional information.\nEiger Express Pipeline\n - In August 2025, we, WhiteWater, MPLX LP and Enbridge Inc., through the existing Matterhorn joint venture, announced the new approximately 450-mile Eiger Express Pipeline, designed to transport natural gas from the Permian Basin to Katy, Texas.  WhiteWater will construct and operate the pipeline.  Our total ownership interest in the pipeline will be 25.5%, which includes a 15% interest held directly in the Eiger joint venture with the remainder held through Matterhorn.  We expect to invest a total of approximately $350 million into this project, which is expected to be completed in mid-2028.  \nBighorn Natural Gas Processing Plant \n- In August 2025, we announced plans to construct the Bighorn natural gas processing plant in the Permian Basin, with processing capacity of 300 MMcf/d and the ability to treat natural gas containing high levels of CO\n2\n.  We expect the Bighorn plant, including the high-CO\n2 \ntreater, to cost approximately $365 million.  The Bighorn plant is supported by acreage dedications with long-term primarily fee-based contracts and is expected to be completed in mid-2027.\nBridgeTex Additional Interest Acquisition\n - On July 22, 2025, we completed the BridgeTex Additional Interest Acquisition.  Pursuant to the purchase agreement, we paid approximately $270 million in cash, which we funded with short-term borrowings.  Following the completion of the transaction, we now have a 60% ownership interest in BridgeTex. \nDelaware Basin JV Acquisition\n - On May 28, 2025, we completed the Delaware Basin JV Acquisition for $941 million.  Pursuant to the purchase agreement, we paid $550 million in cash, including post-closing adjustments, which we funded with short-term borrowings and issued approximately 4.9 million shares of ONEOK common stock to the seller with a fair value of $391 million as of the closing date.  Following the completion of the transaction, Delaware Basin JV is now a wholly owned subsidiary. \nTexas City Logistics and MBTC Pipeline\n - In February 2025, we announced definitive agreements to form joint ventures with MPLX to construct a 400 MBbl/d liquefied petroleum gas export terminal in Texas City, Texas, and a new 24-inch pipeline from our Mont Belvieu, Texas, storage facility to the new terminal.  Texas City Logistics, the export terminal joint venture, is owned 50% by us and 50% by MPLX, with MPLX constructing and operating the facility.  MBTC Pipeline, the pipeline joint venture, is owned 80% by us and 20% by MPLX, and we will construct and operate the pipeline.  We expect to invest a total of approximately $1.0 billion into these projects, which are expected to be completed in early 2028.\n25\nTable of Contents\nEnLink Acquisition\n - On January 31, 2025, we completed the EnLink Acquisition.  Pursuant to the EnLink Merger Agreement, each publicly held common unit of EnLink was exchanged for a fixed ratio of 0.1412 shares of ONEOK common stock, including EnLink Units that were exchanged for all previously outstanding Series B Preferred Units immediately prior to closing.  We issued 41 million shares of common stock with a fair value of $4.0 billion as of the closing date of the EnLink Acquisition.  EnLink is now a wholly owned subsidiary.\nBusiness Update and Market Conditions\n - Earnings increased in the third quarter of 2025, compared with the third quarter of 2024, due primarily to the positive impact of the EnLink and Medallion Acquisitions across our segments.  Our extensive and integrated assets are located in, and connected with, some of the most productive shale basins, as well as refineries and demand centers, in the United States.\nDue to changes in the commodity price environment, we are monitoring producers’ drilling and completion plans, but we do not currently anticipate material changes to our volume expectations.  Our counterparties are primarily major and independent crude oil and natural gas producers that are able to produce in a lower commodity price environment.  We are also monitoring the impact of the tariffs announced by the federal government in 2025, which could increase our costs for materials and equipment.  Due to the timing of construction of our larger projects, proactively monitoring lead times on materials and equipment used in constructing capital projects and entering into procurement agreements for long-lead items, we do not expect the announced tariffs to have a material impact on capital expenditures in 2025.  \nAlthough the energy industry has experienced many commodity cycles, we have positioned ourselves to reduce exposure to direct commodity price volatility.  Each of our four reportable segments are primarily fee-based, and we expect our consolidated earnings to be approximately 90% fee-based in 2025.  Our fee-based earnings are primarily supported by long-term contracts, including minimum volume commitments and take-or-pay agreements, with investment-grade counterparties.\nIn addition, our Natural Gas Gathering and Processing and Natural Gas Liquids segments are exposed to volumetric risk as a result of drilling and completion activity, severe weather disruptions, operational outages, global crude oil, NGL and natural gas demand and normal volumetric well declines.  Our Refined Products and Crude segment is exposed to volumetric risk due to demand for Refined Products and crude oil in the markets we serve.  Our Natural Gas Pipelines segment is not exposed to significant volumetric risk due to the majority of our capacity being subscribed under long-term, firm fee-based contracts.\nOne Big Beautiful Bill Act (OBBBA)\n - On July 4, 2025, the OBBBA was signed into law.  The OBBBA makes changes to U.S. tax law and includes provisions that, beginning in January 2025, make permanent full expensing of tangible personal property and restore EBITDA-based calculations for purposes of the business interest deduction.  We expect the OBBBA to reduce our cash taxes beginning with the 2025 tax year; however, we do not anticipate the OBBBA to materially impact net income.  We will continue to monitor the implementation of the OBBBA by the U.S. Treasury Department and Internal Revenue Service and will review applicable guidance and rulemaking as it becomes available. \n26\nTable of Contents\nCapital Projects\n - Our primary capital projects are outlined in the table below: \nProject \nScope\nApproximate\nCost (a)\nExpected Completion\nNatural Gas Gathering and Processing\n(In millions)\nBighorn plant\n300 MMcf/d processing plant with high-CO\n2\n treater in the Permian Basin \n$365\nMid-2027\n  Natural Gas Liquids\nElk Creek pipeline expansion\nIncrease capacity to 435 MBbl/d out of the Rocky Mountain region\n$355\nCompleted\nMedford fractionator\nRebuild our 210 MBbl/d NGL fractionation facility in Medford, Oklahoma\n$475\n(b)\nTexas City Logistics export terminal (c)\n400 MBbl/d liquefied petroleum gas export terminal in Texas City, Texas\n$700\nEarly 2028\nMBTC Pipeline  \n24-inch pipeline from Mont Belvieu, Texas, storage facility to the new Texas City, Texas, export terminal\n$280\nEarly 2028\nNatural Gas Pipelines\nEiger Express Pipeline (c)\n450-mile natural gas pipeline from the Permian Basin to Katy, Texas\n$350\nMid-2028\n   Refined Products and Crude\nGreater Denver pipeline expansion\nIncrease total system capacity by 35 MBbl/d and additional expansion capabilities\n$480\nMid-2026\n(a) - Excludes capitalized interest/AFUDC.  For our Texas City Logistics, MBTC Pipeline and Eiger joint venture projects, the amounts presented exclude capital contributions from the other joint venture members.\n(b) - This project is expected to be completed in two phases, with the first phase expected to be completed in the fourth quarter of 2026, and the second phase completed in the first quarter of 2027.\n(c) - Our investments in Texas City Logistics and Eiger are accounted for using the equity method.  Spending on these projects will be recorded as contributions to unconsolidated affiliates. \nIn our Natural Gas Gathering and Processing segment, we are relocating a 150 MMcf/d processing plant to the Permian Basin from North Texas, which we expect to be in service in the first quarter of 2026.\nFor a discussion of our capital expenditure financing, see “Capital Expenditures” in the “Liquidity and Capital Resources” section.\nDebt Issuances\n - In August 2025, we completed an underwritten public offering of $3.0 billion senior unsecured notes consisting of $750 million, 4.95% senior notes due 2032; $1.0 billion, 5.4% senior notes due 2035; and $1.25 billion, 6.25% senior notes due 2055.  The net proceeds, after deducting underwriting discounts, commissions and offering expenses, were $2.96 billion.  The net proceeds from this offering were partially used to repay our commercial paper outstanding and repay in full at maturity our senior notes due September 2025.  We expect to use the remaining net proceeds from the offering for general corporate purposes, including the repurchase or redemption of existing notes.\nDebt Repayments\n - In September 2025, we repaid the remaining $387 million of our $400 million, 2.2% senior notes at maturity with cash on hand from our August 2025 public offering.\nIn June 2025, we repaid the remaining $422 million of our $750 million, 4.15% senior notes at maturity with short-term borrowings.\nIn March 2025, we repaid our $250 million, 3.2% senior notes at maturity with cash on hand.\nShare Repurchase Program\n - Our Board of Directors authorized a share repurchase program to buy up to $2.0 billion of our outstanding common stock.  The program will terminate upon completion of the repurchase of the $2.0 billion of common stock or on January 1, 2029, whichever occurs first.  For the three and nine months ended September 30, 2025, we repurchased $45 million and $62 million, respectively, of our outstanding common stock with cash on hand.\nDividends\n - In February, May and August 2025, we paid a quarterly common stock dividend of $1.03 p\ner share ($4.12 per share on an annualized basis), \nan increase of 4% compared with the same quarters in the prior year.  Our dividend growth is due primarily to the increase in cash flows resulting from the growth of our operations.  We declared a quarterly common stock dividend of $1.03 per share in October 2025.  The quarterly common stock dividend will be paid on November 14, 2025, to shareholders of record at the close of business on November 3, 2025.\n27\nTable of Contents\nGoodwill Impairment Review\n - We assess our goodwill for impairment at least annually as of July 1, unless events or changes in circumstances indicate an impairment may have occurred before that time.  At July 1, 2025, we assessed qualitative factors to determine whether it was more likely than not that the fair value of each of our reporting units with goodwill was less than its carrying amount.  After assessing qualitative factors (including macroeconomic conditions, industry and market considerations, costs and overall financial performance), we determined that it was more likely than not that the fair value of each of our reporting units was not less than their respective carrying value, that no further testing was necessary, and that goodwill was not considered impaired.\nFINANCIAL RESULTS AND OPERATING INFORMATION\nHow We Evaluate Our Operations\nManagement uses a variety of financial and operating metrics to analyze our performance.  Our consolidated financial metrics include: (1) operating income; (2) net income; (3) diluted EPS; and (4) adjusted EBITDA.  We evaluate segment operating results using adjusted EBITDA and our operating metrics, which include various volume and rate statistics that are relevant for the respective segment.  These operating metrics allow investors to analyze the various components of segment financial results in terms of volumes and rate/price.  Management uses these metrics to analyze historical segment financial results and as the key inputs for forecasting and budgeting segment financial results.  For additional information on our operating metrics, see the respective segment subsections of this “Financial Results and Operating Information” section.\nNon-GAAP Financial Measures\n - Adjusted EBITDA is a non-GAAP measure of our financial performance.  Adjusted EBITDA is defined as net income adjusted for interest expense, depreciation and amortization, noncash impairment charges, income taxes, noncash compensation expense and certain other noncash items.  Our calculation includes adjusted EBITDA related to our unconsolidated affiliates using the same recognition and measurement methods used to record equity in net earnings from investments.  Adjusted EBITDA from our unconsolidated affiliates is calculated consistently with the definition above and excludes items such as interest expense, depreciation and amortization, income taxes and other noncash items.  Although the amounts related to our unconsolidated affiliates are included in the calculation of adjusted EBITDA, such inclusion should not be understood to imply that we have control over the operations and resulting revenues, expenses or cash flows of such unconsolidated affiliates.\nWe believe this non-GAAP financial measure is useful to investors because it and similar measures are used by many companies in our industry as a measurement of financial performance and is commonly employed by financial analysts and others to evaluate our financial performance and to compare financial performance among companies in our industry.  Adjusted EBITDA should not be considered an alternative to net income, EPS or any other measure of financial performance presented in accordance with GAAP.  Additionally, this calculation may not be comparable with similarly titled measures of other companies.  See reconciliation of net income to adjusted EBITDA in the “Non-GAAP Financial Measures” subsection.\n28\nTable of Contents\nConsolidated Operations\nSelected Financial Results\n - The following table sets forth certain selected financial results for the periods indicated:\nThree Months Ended\nNine Months Ended\nThree Months\nNine Months\nSeptember 30,\nSeptember 30,\n2025 vs. 2024\n2025 vs. 2024\nFinancial Results\n2025\n2024\n2025\n2024\n$ Increase (Decrease)\n$ Increase (Decrease)\n(Millions of dollars, except per share amounts)\nRevenues\nCommodity sales\n$\n7,416\n \n$\n4,083 \n$\n21,054\n \n$\n12,005 \n3,333\n \n9,049\n \nServices and other\n1,218\n \n940 \n3,510\n \n2,693 \n278\n \n817\n \nTotal revenues\n8,634\n \n5,023 \n24,564\n \n14,698 \n3,611\n \n9,866\n \nCost of sales and fuel (exclusive of items shown separately below)\n5,962\n \n3,027 \n16,977\n \n8,815 \n2,935\n \n8,162\n \nOperating costs\n738\n \n582 \n2,196\n \n1,720 \n156\n \n476\n \nDepreciation and amortization\n378\n \n274 \n1,126\n \n790 \n104\n \n336\n \nTransaction costs\n10\n \n10 \n74\n \n17 \n—\n \n57\n \nOther operating expense (income), net\n(12)\n2 \n(18)\n(65)\n14\n \n(47)\nOperating income\n$\n1,558\n \n$\n1,128 \n$\n4,209\n \n$\n3,421 \n430\n \n788\n \nEquity in net earnings from investments\n$\n92\n \n$\n92 \n$\n281\n \n$\n256 \n—\n \n25\n \nInterest expense, net of capitalized interest\n$\n(450)\n$\n(325)\n$\n(1,330)\n$\n(923)\n125\n \n407\n \nNet income\n$\n940\n \n$\n693 \n$\n2,484\n \n$\n2,112 \n247\n \n372\n \nNet income attributable to ONEOK\n$\n939\n \n$\n693 \n$\n2,416\n \n$\n2,112 \n246\n \n304\n \nDiluted EPS \n$\n1.49\n \n$\n1.18 \n$\n3.87\n \n$\n3.60 \n0.31\n \n0.27\n \nAdjusted EBITDA\n$\n2,119\n \n$\n1,545 \n$\n5,875\n \n$\n4,610 \n574\n \n1,265\n \nCapital expenditures\n$\n804\n \n$\n468 \n$\n2,182\n \n$\n1,459 \n336\n \n723\n \nChanges in commodity prices and sales volumes affect both revenues and cost of sales and fuel in our Consolidated Statements of Income and, therefore, the impact is largely offset between these line items.\nOperating income increased $430 million for the three months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following: \n•\nNatural Gas Gathering and Processing\n - an increase of $192 million due primarily to the operating income of EnLink and higher volumes in the Mid-Continent and Rocky Mountain regions, offset partially by lower realized NGL prices, net of hedging;\n•\nNatural Gas Liquids\n - an increase of $100 million due primarily to the operating income of EnLink, higher optimization and marketing and higher exchange services; \n•\nNatural Gas Pipelines \n- an\n \nincrease of $13 million due primarily to the operating income of EnLink, offset partially by the impact of the interstate natural gas pipeline divestiture in 2024;\n and\n•\nRefined Products and Crude\n - an increase of\n \n$129 million due primarily to the operating income of Medallion and EnLink and higher transportation and storage.\nOperating income increased $788 million for the nine months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following: \n•\nNatural Gas Gathering and Processing\n - an increase of $437 million due primarily to the operating income of EnLink and higher volumes in the Mid-Continent and Rocky Mountain regions, offset partially by lower realized NGL prices, net of hedging, and the impact from the divestiture of certain non-strategic assets in 2024;\n•\nNatural Gas Liquids\n - an increase of $119 million due primarily to the operating income of EnLink, higher optimization and marketing and higher exchange services, offset partially by higher operating costs; \n•\nNatural Gas Pipelines \n- an\n \nincrease of $56 million due primarily to the operating income of EnLink, offset partially by the impact of the interstate natural gas pipeline divestiture in 2024;\n and\n•\nRefined Products and Crude\n - an increase of\n \n$238 million due primarily to the operating income of Medallion and EnLink and lower operating costs, offset partially by lower liquids blending earnings; \noffset by\n•\nConsolidated Transaction Costs\n - an increase of $57 million due primarily to higher transaction costs related to the EnLink Acquisition.\n29\nTable of Contents\nNet income and diluted EPS increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to the items discussed above, offset partially by higher interest expense due to higher debt balances resulting from the September 2024 $7.0 billion notes offering, the August 2025 $3.0 billion notes offering, the acquired debt balances from the EnLink Controlling Interest Acquisition in 2024 and increased short-term borrowings.\nCapital expenditures increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to the timing of our large capital projects and routine capital projects associated with the growth of our operations.  Please refer to the “Recent Developments” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations in this Quarterly Report for additional information on our capital projects. \nAdditional information regarding our financial results and operating information is provided in the following discussion for each of our segments.\nNatural Gas Gathering and Processing\nSelected Financial Results and Operating Information\n - The following tables set forth certain selected financial results and operating information for our Natural Gas Gathering and Processing segment for the periods indicated: \nThree Months Ended\nNine Months Ended\nThree Months\nNine Months\nSeptember 30,\nSeptember 30,\n2025 vs. 2024\n2025 vs. 2024\nFinancial Results\n2025\n2024\n2025\n2024\n$ Increase (Decrease)\n$ Increase (Decrease)\n(Millions of dollars)\nNGL and condensate sales\n$\n1,066\n \n$\n648 \n$\n3,393\n \n$\n1,912 \n418\n \n1,481\n \nResidue natural gas sales\n468\n \n219 \n1,615\n \n732 \n249\n \n883\n \nGathering, compression, dehydration and processing fees and other revenue\n307\n \n38 \n878\n \n117 \n269\n \n761\n \nCost of sales and fuel (exclusive of depreciation and operating costs)\n(1,038)\n(464)\n(3,576)\n(1,479)\n574\n \n2,097\n \nOperating costs, excluding noncash compensation adjustments\n(237)\n(122)\n(716)\n(349)\n115\n \n367\n \nAdjusted EBITDA from unconsolidated affiliates\n1\n \n— \n4\n \n3 \n1\n \n1\n \nOther\n(1)\n(1)\n(1)\n59 \n—\n \n(60)\nAdjusted EBITDA\n$\n566\n \n$\n318 \n$\n1,597\n \n$\n995 \n248\n \n602\n \nCapital expenditures\n$\n302\n \n$\n102 \n$\n884\n \n$\n319 \n200\n \n565\n \nChanges in commodity prices and sales volumes affect both revenues and cost of sales and fuel and, therefore, the impact is largely offset between these line items. \nAdjusted EBITDA increased $248 million for the three months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $250 million due to adjusted EBITDA from EnLink; \nand\n•\nan increase of $28 million from higher volumes due primarily to increased production in the Mid-Continent and Rocky Mountain regions; \noffset by\n•\na decrease of $34 million due to lower realized prices, primarily NGL prices, net of hedging.\nAdjusted EBITDA increased $602 million for the nine months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $703 million due to adjusted EBITDA from EnLink; \nand\n•\nan increase of $62 million from higher volumes due primarily to increased production in the Mid-Continent and Rocky Mountain regions; \noffset by\n•\na decrease of $86 million due to lower realized prices, primarily NGL prices, net of hedging;\n•\na decrease of $65 million from the divestiture of certain non-strategic assets in 2024; \nand\n•\nan increase of $12 million in operating costs due primarily to $16 million of higher employee-related costs associated with the growth of our operations, offset partially by $6 million of lower outside services due to timing of projects. \n30\nTable of Contents\nCapital expenditures increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to our routine and large capital projects, including our project to relocate a processing plant to the Permian Basin from North Texas.\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\nOperating Information\n2025\n2024\n2025\n2024\nNatural gas processed (\nMMcf/d\n) (a)(b)\n5,852\n \n2,410 \n5,560\n \n2,308 \n(a) - Includes volumes for consolidated entities only.\n(b) - Includes volumes we processed at company-owned and third-party facilities.\nOur natural gas processed volumes increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due to incremental volumes from EnLink and increased production in the Mid-Continent and Rocky Mountain regions. \nNatural Gas Liquids\nSelected Financial Results and Operating Information\n - The following tables set forth certain selected financial results and operating information for our Natural Gas Liquids segment for the periods indicated:\nThree Months Ended\nNine Months Ended\nThree Months \nNine Months\nSeptember 30,\nSeptember 30, \n2025 vs. 2024\n2025 vs. 2024\nFinancial Results\n2025\n2024\n2025\n2024\n$ Increase (Decrease)\n$ Increase\n(Decrease)\n(Millions of dollars)\nNGL and condensate sales\n$\n3,746\n \n$\n3,496 \n$\n11,598\n \n$\n10,104 \n250\n \n1,494\n \nExchange service and other revenues\n113\n \n133 \n315\n \n400 \n(20)\n(85)\nTransportation and storage revenues\n36\n \n50 \n121\n \n141 \n(14)\n(20)\nCost of sales and fuel (exclusive of depreciation and operating costs)\n(2,977)\n(2,906)\n(9,464)\n(8,352)\n71\n \n1,112\n \nOperating costs, excluding noncash compensation adjustments\n(195)\n(172)\n(593)\n(519)\n23\n \n74\n \nAdjusted EBITDA from unconsolidated affiliates\n26\n \n26 \n76\n \n70 \n—\n \n6\n \nOther\n(1)\n(3)\n3\n \n3 \n2\n \n—\n \nAdjusted EBITDA\n$\n748\n \n$\n624 \n$\n2,056\n \n$\n1,847 \n124\n \n209\n \nCapital expenditures\n$\n218\n \n$\n247 \n$\n524\n \n$\n785 \n(29)\n(261)\nChanges in commodity prices and sales volumes affect both revenues and cost of sales and fuel and, therefore, the impact is largely offset between these line items.\nAdjusted EBITDA increased $124 million for the three months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $56 million due to adjusted EBITDA from EnLink; \n•\nan increase of $43 million in optimization and marketing due primarily to higher earnings on sales of Purity NGLs held in inventory and wider commodity price differentials; \nand\n•\nan increase of $31 million in exchange services due primarily to $44 million of higher volumes in the Rocky Mountain and Mid-Continent regions, offset partially by $18 million of lower average fee rates in the Mid-Continent region.\n31\nTable of Contents\nAdjusted EBITDA increased $209 million for the nine months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $171 million due to adjusted EBITDA from EnLink;\n•\nan increase of $26 million in optimization and marketing due primarily to higher earnings on sales of Purity NGLs held in inventory; \n•\nan increase of $21 million in exchange services due primarily to:\n◦\n$74 million of higher volumes in the Rocky Mountain region; \nand\n \n◦\n$29 million of higher average fee rates in the Rocky Mountain region; \noffset partially by\n \n◦\n$41 million of lower average fee rates in the Mid-Continent region; \n◦\n$15 million of lower volumes in the Mid-Continent region; \nand \n◦\n$16 million of higher costs, primarily transportation; \nand\n•\nan increase of $6 million in adjusted EBITDA from unconsolidated affiliates due primarily to higher volumes delivered to the Overland Pass Pipeline; \noffset by\n•\nan increase of $20 million in operating costs due primarily to higher employee-related costs associated with the growth of our operations.\nCapital expenditures decreased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to the completion of our MB-6 fractionator and pipeline expansion projects in 2024, offset partially by our Medford fractionator rebuild project.\nThree Months Ended\nNine Months Ended\nSeptember 30, \nSeptember 30,\nOperating Information\n2025\n2024\n2025\n2024\nRaw feed throughput (\nMBbl/d\n) (a)\n1,574\n \n1,324 \n1,466\n \n1,310 \nAverage Conway-to-Mont Belvieu Oil Price Information Service price differential - ethane in ethane/propane mix (\n$/gallon\n)\n$\n0.01\n \n$\n(0.01)\n$\n0.01\n \n$\n0.01 \n(a) - Represents physical raw feed volumes for which we provide transportation and/or fractionation services.\n \nWe generally expect ethane volumes to increase or decrease with corresponding increases or decreases in overall NGL production.  However, ethane volumes may experience growth or decline greater than corresponding growth or decline in overall NGL production due to ethane economics causing producers to recover or reject ethane. \nVolumes increased for the three months ended September 30, 2025, compared with the same period in 2024, due primarily to incremental volumes from EnLink and higher volumes across our system, primarily ethane in the Rocky Mountain and Mid-Continent regions.  Volumes increased for the nine months ended September 30, 2025, compared with the same period in 2024, due primarily to\n \nincremental volumes from EnLink and higher ethane volumes in the Rocky Mountain region, offset partially by lower ethane volumes in the Mid-Continent region.\n32\nTable of Contents\nNatural Gas Pipelines\nInterstate Natural Gas Pipeline Divestiture\n - On December 31, 2024, we completed the sale of three of our wholly owned interstate natural gas pipeline systems to DT Midstream, Inc.  \nSelected Financial Results\n \nand Operating Information\n - The following tables set forth certain selected financial results and operating information for our Natural Gas Pipelines segment for the periods indicated:\nThree Months Ended\nNine Months Ended\nThree Months\nNine Months\nSeptember 30,\nSeptember 30,\n2025 vs. 2024\n2025 vs. 2024\nFinancial Results\n2025\n2024\n2025\n2024\n$ Increase (Decrease)\n$ Increase (Decrease)\n(Millions of dollars)\nTransportation revenues\n$\n106\n \n$\n131 \n$\n310\n \n$\n372 \n(25)\n(62)\nStorage revenues\n48\n \n40 \n137\n \n119 \n8\n \n18\n \nResidue natural gas sales and other revenues\n296\n \n— \n872\n \n28 \n296\n \n844\n \nCost of sales and fuel (exclusive of depreciation and operating costs)\n(255)\n(1)\n(735)\n(18)\n254\n \n717\n \nOperating costs, excluding noncash compensation adjustments\n(58)\n(50)\n(162)\n(151)\n8\n \n11\n \nAdjusted EBITDA from unconsolidated affiliates \n63\n \n45 \n179\n \n133 \n18\n \n46\n \nOther\n—\n \n1 \n(1)\n— \n(1)\n(1)\nAdjusted EBITDA\n$\n200\n \n$\n166 \n$\n600\n \n$\n483 \n34\n \n117\n \nCapital expenditures\n$\n55\n \n$\n56 \n$\n169\n \n$\n187 \n(1)\n(18)\nChanges in commodity prices and sales volumes affect both revenues and cost of sales and fuel and, therefore, the impact is largely offset between these line items. \nAdjusted EBITDA increased $34 million for the three months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $70 million due to adjusted EBITDA from EnLink; \noffset by\n•\na decrease of $34 million due to the interstate natural gas pipeline divestiture.\nAdjusted EBITDA increased $117 million for the nine months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $219 million due to adjusted EBITDA from EnLink; \noffset by\n•\na decrease of $97 million due to the interstate natural gas pipeline divestiture.\nCapital expenditures decreased for the nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to the completion of capital projects in 2024.\n \nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30, \nOperating Information (a)\n2025\n2024\n2025\n2024\nNatural gas transportation capacity contracted (\nMDth/d\n)\n4,657\n \n4,514 \n4,657\n \n4,486 \nTransportation capacity contracted\n97\n \n%\n97 \n%\n97\n \n%\n97 \n%\n(a) - Includes capacity contracted for consolidated Oklahoma and Texas intrastate pipeline entities only. \n33\nTable of Contents\nRefined Products and Crude\nSelected Financial Results and Operating Information\n - The following tables set forth certain selected financial results and operating information for our Refined Products and Crude segment for the periods indicated:\nThree Months Ended\nNine Months Ended\nThree Months\nNine Months\nSeptember 30, \nSeptember 30\n2025 vs. 2024\n2025 vs. 2024\nFinancial Results\n2025\n2024\n2025\n2024\n$ Increase (Decrease)\n$ Increase (Decrease)\n(Millions of dollars)\nProduct sales\n$\n3,010\n \n$\n407 \n$\n7,227\n \n$\n1,250 \n2,603\n \n5,977\n \nTransportation revenues\n446\n \n383 \n1,280\n \n1,083 \n63\n \n197\n \nStorage, terminals and other revenues\n173\n \n173 \n498\n \n488 \n—\n \n10\n \nCost of sales and fuel (exclusive of depreciation and operating costs)\n(2,873)\n(352)\n(6,883)\n(1,017)\n2,521\n \n5,866\n \nOperating costs, excluding noncash compensation adjustments\n(225)\n(207)\n(652)\n(626)\n18\n \n26\n \nAdjusted EBITDA from unconsolidated affiliates\n40\n \n41 \n122\n \n117 \n(1)\n5\n \nOther\n11\n \n(4)\n18\n \n(6)\n15\n \n24\n \nAdjusted EBITDA\n$\n582\n \n$\n441 \n$\n1,610\n \n$\n1,289 \n141\n \n321\n \nCapital expenditures\n$\n214\n \n$\n45 \n$\n539\n \n$\n120 \n169\n \n419\n \nChanges in commodity prices and sales volumes affect both revenues and cost of sales and fuel in our Consolidated Statements of Income and, therefore, the impact is largely offset between these line items. \nAdjusted EBITDA increased $141 million for the three months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $91 million due to adjusted EBITDA from Medallion and EnLink;\n \n•\nan increase of $24 million in transportation and storage due primarily to $29 million related to the timing of operational gains and losses and $15 million of higher Refined Products transportation rates, offset partially by $12 million of lower Refined Products volumes and $10 million related to a lower rate on a capacity lease;\n \n•\nan increase of $12 million due primarily to the sale of environmental credits generated by our liquids blending business;\n•\nan increase of $9 million in optimization and marketing due primarily to higher liquids blending earnings;\n and\n•\na decrease of $6 million in operating costs due primarily to timing.\nAdjusted EBITDA increased $321 million for the nine months ended September 30, 2025, compared with the same period in 2024, primarily as a result of the following:\n•\nan increase of $273 million due to adjusted EBITDA from Medallion and EnLink;\n \n•\na decrease of $41 million in operating costs due primarily to lower outside services;\n and\n•\nan increase of $20 million due primarily to the sale of environmental credits generated by our liquids blending business;\n offset by\n•\na decrease of $25 million in optimization and marketing due primarily to lower liquids blending earnings.\n34\nTable of Contents\nCapital expenditures increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to our routine and large capital projects, including our greater Denver pipeline expansion project.\nThree Months Ended\nNine Months Ended\nSeptember 30, \nSeptember 30,\nOperating Information (a)\n2025\n2024\n2025\n2024\nRefined Products volumes shipped (\nMBbl/d\n)\n1,526\n \n1,580 \n1,477\n \n1,509 \nCrude oil volumes shipped (\nMBbl/d\n)\n1,813\n \n816 \n1,814\n \n765 \n(a) - Includes volumes for consolidated entities only.\nRefined Products volumes shipped decreased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to regional market dynamics that impact demand on our system.\nCrude oil volumes shipped increased for the three and nine months ended September 30, 2025, compared with the same periods in 2024, due primarily to incremental volumes from Medallion and EnLink. \nNon-GAAP Financial Measures\nThe following table sets forth a reconciliation of net income, the nearest comparable GAAP financial performance measure, to adjusted EBITDA for the periods indicated:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n(Unaudited)\n2025\n2024\n2025\n2024\nReconciliation of net income to adjusted EBITDA\n(\nMillions of dollars)\nNet income\n$\n940\n \n$\n693 \n$\n2,484\n \n$\n2,112 \nInterest expense, net of capitalized interest\n450\n \n325 \n1,330\n \n923 \nDepreciation and amortization\n378\n \n274 \n1,126\n \n790 \nIncome taxes\n297\n \n219 \n754\n \n670 \nAdjusted EBITDA from unconsolidated affiliates\n129\n \n112 \n381\n \n323 \nEquity in net earnings from investments\n(92)\n(92)\n(281)\n(256)\nNoncash compensation expense and other (a)\n17\n \n14 \n81\n \n48 \nAdjusted EBITDA\n$\n2,119\n \n$\n1,545 \n$\n5,875\n \n$\n4,610 \nReconciliation of segment adjusted EBITDA to adjusted EBITDA\nSegment adjusted EBITDA:\nNatural Gas Gathering and Processing\n$\n566\n \n$\n318 \n$\n1,597\n \n$\n995 \nNatural Gas Liquids\n748\n \n624 \n2,056\n \n1,847 \nNatural Gas Pipelines\n200\n \n166 \n600\n \n483 \nRefined Products and Crude\n582\n \n441 \n1,610\n \n1,289 \nOther (a)(b)\n23\n \n(4)\n12\n \n(4)\nAdjusted EBITDA\n$\n2,119\n \n$\n1,545 \n$\n5,875\n \n$\n4,610 \n(a) - The three months ended September 30, 2025, included transaction costs related primarily to the EnLink Acquisition of $7 million included within other and $3 million included within noncash compensation expense and other.  The nine months ended September 30, 2025, included transaction costs related primarily to the EnLink Acquisition of $59 million included within other and $15 million included within noncash compensation expense and other.\n(b) - The three and nine months ended September 30, 2025, included corporate net gains on extinguishment of debt of $22 million and $58 million, respectively, in connection with open market repurchases.\nCONTINGENCIES\nSee Note J of the Notes to Consolidated Financial Statements in this Quarterly Report for a discussion of regulatory and legal matters.\n35\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nGeneral\n - Our primary sources of cash inflows are operating cash flows, proceeds from our commercial paper program and our $3.5 Billion Credit Agreement, debt issuances and the issuance of common stock for our liquidity and capital resource requirements.  \nWe expect our sources of cash inflows to provide sufficient resources to finance our operations, capital expenditures, quarterly cash dividends, maturities of long-term debt, share repurchases and contributions to unconsolidated affiliates and joint ventures.  We believe we have sufficient liquidity due to our $3.5 Billion Credit Agreement, which expires in February 2030, and access to $1.0 billion available through our “at-the-market” equity program.  As of October 20, 2025, no shares have been sold through our “at-the-market” equity program.\nWe may manage interest-rate risk through the use of fixed-rate debt, floating-rate debt, Treasury locks and interest-rate swaps.\n \nFor additional information on our interest-rate derivative instruments, see Note E of the Notes to Consolidated Financial Statements in our Annual Report and Note D of the Notes to Consolidated Financial Statements in this Quarterly Report.\nCash Management\n - At September 30, 2025, we had $1.2 billion of cash and cash equivalents.  For our wholly owned subsidiaries, we use a centralized cash management program that concentrates the cash assets of our wholly owned nonguarantor operating subsidiaries in joint accounts for the purposes of providing financial flexibility and lowering the cost of borrowing, transaction costs and bank fees.  Our centralized cash management program provides that funds in excess of the daily needs of our operating subsidiaries are concentrated, consolidated or otherwise made available for use by other entities within our consolidated group.  Our operating subsidiaries participate in this program to the extent they are permitted pursuant to FERC regulations or their operating agreements.  Under the cash management program, depending on whether a participating subsidiary has short-term cash surpluses or cash requirements, we provide cash to the subsidiary or the subsidiary provides cash to us.\nFollowing the completion of the EnLink Acquisition on January 31, 2025, we terminated an agreement to provide revolving unsecured loans to EnLink through a promissory note, as EnLink operating subsidiaries are wholly owned and now participate in the cash management program described above.\nGuarantees\n - ONEOK, ONEOK Partners, the Intermediate Partnership, Magellan, EnLink and EnLink Partners have cross guarantees in place for ONEOK’s and ONEOK Partners’ indebtedness.  These guarantees in place for our and ONEOK Partners’ indebtedness are full, irrevocable, unconditional and absolute joint and several guarantees to the holders of each series of outstanding securities.  Liabilities under the guarantees rank equally in right of payment with all of the guarantors’ existing and future senior unsecured indebtedness.  The Intermediate Partnership holds all of ONEOK Partners’ interests and equity in its subsidiaries, which are nonguarantors, and substantially all the assets and operations reside with nonguarantor operating subsidiaries.  Magellan, EnLink and EnLink Partners hold interests in their subsidiaries, which are nonguarantors, and substantially all the assets and operations reside with nonguarantor operating subsidiaries.  Therefore, as allowed under Rule 13-01 of Regulation S-X, we have excluded the summarized financial information for each issuer and guarantor as the combined financial information of subsidiary issuers and parent guarantors, excluding our ownership of all interest in ONEOK Partners, Magellan and EnLink, reflect no material assets or liabilities or results of operations apart from guaranteed indebtedness.  For additional information on our indebtedness, see Note H of the Notes to Consolidated Financial Statements in our Annual Report and Note E of the Notes to Consolidated Financial Statements in this Quarterly Report.\nShort-term Liquidity\n - Our principal sources of short-term liquidity consist of cash generated from operating activities, distributions received from our unconsolidated affiliates, proceeds from our commercial paper program and our $3.5 Billion Credit Agreement.  In February 2025, we amended and restated our $2.5 Billion Credit Agreement to increase the size to $3.5 billion, extend the term to February 2030, and make other nonmaterial modifications.  All other terms and conditions remain substantially the same.  In September 2025, we increased the size of our commercial paper program to $3.5 billion from $2.5 billion.  As of September 30, 2025, we had no borrowings under our $3.5 Billion Credit Agreement, and we are in compliance with all covenants.  Upon closing of the EnLink Acquisition on January 31, 2025, the EnLink Revolving Credit Facility was terminated.  For additional information on the EnLink Revolving Credit Facility, see Note H of the Notes to Consolidated Financial Statements in our Annual Report. \nAs of September 30, 2025, we had a working capital (defined as current assets less current liabilities) deficit of $550 million, due primarily to current maturities of long-term debt.  Generally, our working capital is influenced by several factors, including, among other things: (i) the timing of (a) debt and equity issuances, (b) the funding of capital expenditures, (c) scheduled debt payments, and (d) accounts receivable and payable; and (ii) the volume and cost of inventory and commodity imbalances.  \n36\nTable of Contents\nWe may have working capital deficits in future periods as our long-term debt becomes current.  We do not expect a working capital deficit of this nature to have a material adverse impact to our cash flows or operations.\nFor additional information on our $3.5 Billion Credit Agreement, see Note E of the Notes to Consolidated Financial Statements in this Quarterly Report. \nLong-term Financing\n - In addition to our principal sources of short-term liquidity discussed above, we expect to fund our longer-term financing requirements by issuing long-term notes, as needed.  Other options to obtain financing include, but are not limited to, issuing common stock, loans from financial institutions, issuance of convertible debt securities or preferred equity securities, asset securitization and the sale and lease-back of facilities.\nWe may, at any time, seek to retire or purchase our or ONEOK Partners’ outstanding debt through cash purchases and/or exchanges for equity or debt, in open-market repurchases, privately negotiated transactions or otherwise.  Such repurchases and exchanges, if any, will be on such terms and prices as we may determine and will depend on prevailing market conditions, or liquidity requirements, contractual restrictions and other factors.  The amounts involved may be material.\nDebt Issuances\n - In August 2025, we completed an underwritten public offering of $3.0 billion senior unsecured notes consisting of $750 million, 4.95% senior notes due 2032; $1.0 billion, 5.4% senior notes due 2035; and $1.25 billion, 6.25% senior notes due 2055.  The net proceeds, after deducting underwriting discounts, commissions and offering expenses, were $2.96 billion.  The net proceeds from this offering were partially used to repay our commercial paper outstanding and repay in full at maturity our senior notes due September 2025.  We expect to use the remaining net proceeds from the offering for general corporate purposes, including the repurchase or redemption of existing notes.\nDebt Repayments\n - In the third quarter of 2025, we repurchased in the open market certain of our senior notes in the principal amount of $119 million for an aggregate repurchase price of $96 million, including accrued and unpaid interest, with cash on hand.\nIn September 2025, we repaid the remaining $387 million of our $400 million, 2.2% senior notes at maturity with cash on hand from our August 2025 public offering.\nIn June 2025, we repaid the remaining $422 million of our $750 million, 4.15% senior notes at maturity with short-term borrowings.\nIn the second quarter of 2025, we repurchased in the open market certain of our senior notes in the principal amount of $169 million for an aggregate repurchase price of $133 million, including accrued and unpaid interest, with short-term borrowings.\nIn March 2025, we repaid our $250 million, 3.2% senior notes at maturity with cash on hand.\nEquity\n \nIssuances\n - On May 28, 2025, we completed the Delaware Basin JV Acquisition.  Pursuant to the purchase agreement, we issued approximately 4.9 million shares of ONEOK common stock to the seller with a fair value of $391 million as of the closing date.\nOn January 31, 2025, we completed the EnLink Acquisition.  Pursuant to the EnLink Merger Agreement, each publicly held common unit of EnLink was exchanged for a fixed ratio of 0.1412 shares of ONEOK Common stock, including EnLink Units that were exchanged for all previously outstanding Series B Preferred Units immediately prior to closing.  We issued 41 million shares of common stock with a fair value of $4.0 billion.  There are no remaining Series B Preferred Units outstanding.\nShare Repurchase Program\n - Our Board of Directors authorized a share repurchase program to buy up to $2.0 billion of our outstanding common stock.  The program will terminate upon completion of the repurchase of the $2.0 billion of common stock or on January 1, 2029, whichever occurs first.  For the three and nine months ended September 30, 2025, we repurchased $45 million and $62 million, respectively, of our outstanding common stock with cash on hand.\nCapital Expenditures\n - We proactively monitor lead times on materials and equipment used in constructing capital projects, and we enter into procurement agreements for long-lead items for potential projects to plan for future growth.  Our capital expenditures are financed typically through operating cash flows and short- and long-term debt.  We do not expect the tariffs announced by the federal government earlier this year to have a material impact on capital expenditures in 2025.\n37\nTable of Contents\nCapital expenditures, less allowance for equity funds used during construction, were $2.2 billion and $1.5 billion for the nine months ended September 30, 2025 and 2024, respectively.\nWe expect total capital expenditures of $2.8 billion - $3.2 billion in 2025.  See discussion of our primary capital projects in the “Recent Developments” section in this Quarterly Report.\nCredit Ratings\n - Our long-term debt credit ratings as of October 20, 2025, are shown in the table below:\nRating Agency\nLong-term Rating\nShort-term Rating\nOutlook\nMoody’s\nBaa2\nPrime-2\nStable\nS&P\nBBB\nA-2\nStable\nFitch \nBBB\nF2\nStable\nOur credit ratings, which are investment grade, may be affected by our leverage, liquidity, credit profile or potential transactions.  The most common criteria for assessment of our credit ratings are the debt-to-EBITDA ratio, interest coverage, business risk profile and liquidity.  If our credit ratings were downgraded, our cost to borrow funds under our $3.5 Billion Credit Agreement could increase, and a potential loss of access to the commercial paper market could occur.  In the event that we are unable to borrow funds under our commercial paper program and there has not been a material adverse change in our business, we would continue to have access to our $3.5 Billion Credit Agreement, which expires in 2030.  An adverse credit rating change alone is not a default under our $3.5 Billion Credit Agreement.\nIn the normal course of business, our counterparties provide us with secured and unsecured credit.  In the event of a downgrade in our credit ratings or a significant change in our counterparties’ evaluation of our creditworthiness, we could be required to provide additional collateral in the form of cash, letters of credit or other negotiable instruments as a condition of continuing to conduct business with such counterparties.  We may be required to fund margin requirements with our counterparties with cash, letters of credit or other negotiable instruments.\nDividends\n - Holders of our common stock share equally in any common stock dividends declared by our Board of Directors.  In February, May and August 2025, we paid a common stock dividend of $1.03 per share ($4.12 per share on an annualized basis), an increase of 4% compared with the same quarters in the prior year.  We declared a quarterly common stock dividend of $1.03 per share in October 2025.  The quarterly common stock dividend will be paid on November 14, 2025, to shareholders of record at the close of business on November 3, 2025.\nFor the nine months ended September 30, 2025, our cash flows from operations exceeded dividends paid by $2.1 billion.  We expect our cash flows from operations to continue to sufficiently fund our cash dividends.  To the extent operating cash flows are not sufficient to fund our dividends, we may utilize cash on hand from other sources of short- and long-term liquidity to fund a portion of our dividends.\nCASH FLOW ANALYSIS\nWe use the indirect method to prepare our Consolidated Statements of Cash Flows.  Under this method, we reconcile net income to cash flows provided by operating activities by adjusting net income for those items that affect net income but do not result in actual cash receipts or payments during the period and for operating cash items that do not impact net income.  These reconciling items can include depreciation and amortization, deferred income taxes, impairment charges, allowance for equity funds used during construction, gain or loss on sale of business and assets, net undistributed earnings from unconsolidated affiliates, share-based compensation expense, other amounts and changes in our assets and liabilities not classified as investing or financing activities.\n38\nTable of Contents\nThe following table sets forth the changes in cash flows by operating, investing and financing activities for the periods indicated:\nVariances\nNine Months Ended\n2025 vs. 2024\nSeptember 30,\n$ Increase (Decrease) \nin Cash\n2025\n2024\n(Millions of dollars)\nTotal cash provided by (used in):\nOperating activities\n$\n4,053\n \n$\n3,277 \n776\n \nInvesting activities\n(2,642)\n(1,832)\n(810)\nFinancing activities\n(945)\n4,681 \n(5,626)\nChange in cash and cash equivalents\n466\n \n6,126 \n(5,660)\nCash and cash equivalents at beginning of period\n733\n \n338 \n395\n \nCash and cash equivalents at end of period\n$\n1,199\n \n$\n6,464 \n(5,265)\nOperating Cash Flows\n - Operating cash flows are affected by earnings from our business activities and changes in our operating assets and liabilities.  Changes in commodity prices and demand for our services or products, whether because of general economic conditions, changes in supply, changes in demand for the end products that are made with our products or increased competition from other service providers, could affect our earnings and operating cash flows.  Our operating cash flows can also be impacted by changes in our inventory balances, which are driven primarily by commodity prices, supply, demand and the operation of our assets.\nCash flows from operating activities, before changes in operating assets and liabilities for the nine months ended September 30, 2025, increased $890 million compared with the same period in 2024, due primarily to the impact of the EnLink and Medallion Acquisitions as discussed in “Financial Results and Operating Information.”\nThe changes in operating assets and liabilities decreased operating cash flows $347 million for the nine months ended September 30, 2025, compared with a decrease of $233 million for the same period in 2024.  This change is due primarily to changes in accounts receivable resulting from the receipt of cash from counterparties and from inventory, both of which vary from period to period, and with changes in commodity prices.  These changes were partially offset by changes in accounts payable, which vary from period to period with changes in commodity prices and from the timing of payments to vendors, suppliers and other third parties.  \nInvesting Cash Flows\n - Cash used in investing activities for the nine months ended September 30, 2025, increased $810 million, compared with the same period in 2024, due primarily to an increase in capital expenditures related to our capital projects in 2025, cash paid for the BridgeTex Additional Interest Acquisition and proceeds received from the divestiture of certain non-strategic assets in 2024, offset partially by cash paid for acquisitions in 2024.\nFinancing Cash Flows\n - Cash from financing activities for the nine months ended September 30, 2025, decreased $5.6 billion, compared with the same period in 2024, due primarily to the issuance of senior unsecured notes associated with acquisitions in 2024, increased repayments of long-term debt in 2025, cash paid for the Delaware Basin JV Acquisition and increased dividends paid in 2025, offset partially by the issuance of senior unsecured notes in August 2025. \nIMPACT OF NEW ACCOUNTING STANDARDS\nSee Note A of the Notes to Consolidated Financial Statements in this Quarterly Report for discussion of new accounting standards.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of our Consolidated Financial Statements and related disclosures in accordance with GAAP requires us to make estimates and assumptions with respect to values or conditions that cannot be known with certainty that affect the reported amounts of assets and liabilities, and the disclosure of contingent assets and liabilities at the date of the Consolidated Financial Statements.  These estimates and assumptions also affect the reported amounts of revenue and expenses during the reporting period.  Although we believe these estimates and assumptions are reasonable, actual results could differ from our estimates.\n39\nTable of Contents\nInformation about our critical accounting estimates is included under Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Critical Accounting Estimates,” in our Annual Report.\nFORWARD-LOOKING STATEMENTS\nThis Quarterly Report contains forward-looking statements in reliance on the safe harbor protections of the Securities Act of 1933, as amended (the “Securities Act”), and the Exchange Act, which involve substantial risk and uncertainties.  Such forward-looking statements include, but are not limited to, statements relating to our anticipated financial performance, liquidity, management’s plans, expectations and objectives for our future capital projects and other future operations, our business prospects, the outcome of regulatory and legal proceedings, market conditions, potential or pending strategic transactions, the timing thereof and our ability to achieve the intended and projected operational, financial and strategic benefits from any such transactions, and other matters.  The following discussion is intended to identify important factors that could cause future outcomes to differ materially from those set forth in the forward-looking statements.\nForward-looking statements and other statements in this Quarterly Report regarding our environmental, social and other sustainability targets, plans and goals are not an indication that these statements are required to be disclosed in our filings with the SEC, or that we will continue to make similar statements in the same extent or manner in future filings.  In addition, historical, current and forward-looking environmental, social and sustainability-related statements may be based on standards and processes for measuring progress that are still developing and that continue to evolve, and assumptions that are subject to change in the future.\nForward-looking statements include the items identified in the preceding paragraphs, the information concerning possible or assumed future results of our operations and other statements contained in this Quarterly Report identified by words such as “anticipates,” “believes,” “continues,” “could,” “estimates,” “expects,” “forecasts,” “goal,” “guidance,” “intends,” “may,” “might,” “outlook,” “plans,” “potential,” “projects,” “scheduled,” “should,” “target,” “will,” “would,” and other words and terms of similar meaning.\nOne should not place undue reliance on forward-looking statements.  Known and unknown risks, uncertainties and other factors may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by forward-looking statements.  Those factors may affect our operations, markets, products, services and prices.  In addition to any assumptions and other factors referred to specifically in connection with the forward-looking statements, factors that could cause our actual results to differ materially from those contemplated in any forward-looking statement include, among others, the following:\n•\nthe impact on drilling and production by factors beyond our control, including the demand for natural gas, NGLs, Refined Products and crude oil; producers’ desire and ability to drill and obtain necessary permits; regulatory compliance; reserve performance; and capacity constraints and/or shut downs on the pipelines that transport crude oil, natural gas, NGLs, and Refined Products from producing areas and our facilities;\n•\nthe impact of unfavorable economic and market conditions, inflationary pressures, which may increase our capital expenditures and operating costs, raise the cost of capital or depress economic growth;\n•\nthe impact of the volatility of natural gas, NGL, Refined Products and crude oil prices on our earnings and cash flows, which is impacted by a variety of factors beyond our control, including international terrorism and conflicts and geopolitical instability;\n•\nthe impact of reduced volatility in energy prices or new government regulations that could discourage our storage customers from holding positions in Refined Products, crude oil and natural gas;\n•\nthe economic or other impact of announced or future tariffs, including inflationary impacts;\n•\nthe economic or other impact of the current federal government shutdown;\n•\nour dependence on producers, gathering systems, refineries and pipelines owned and operated by others and the impact of any closures, interruptions or reduced activity levels at these facilities; \n•\nthe impact of increased attention to ESG issues, including climate change, and risks associated with the physical and financial impacts of climate change;\n•\nrisks associated with operational hazards and unforeseen interruptions at our operations;\n•\nthe inability of insurance proceeds to cover all liabilities or incurred costs and losses, or lost earnings, resulting from a loss;\n•\nthe risk of increased costs for insurance premiums or less favorable coverage;\n•\ndemand for our services and products in the proximity of our facilities;\n•\nrisks associated with our ability to hedge against commodity price risks or interest rate risks;\n•\na breach of information security, including a cybersecurity attack, or failure of one or more key information technology or operational systems, and terrorist attacks, including cyber sabotage;\n40\nTable of Contents\n•\nexposure to construction risk and supply risks if adequate natural gas, NGL, Refined Products and crude oil supply is unavailable upon completion of facilities;\n•\nthe accuracy of estimates of hydrocarbon reserves, which could result in lower than anticipated volumes;\n•\nour lack of ownership over all of the land on which our property is located and certain of our facilities and equipment;\n•\nthe impact of changes in estimation, type of commodity and other factors on our measurement adjustments;\n•\nexcess capacity on our pipelines, processing, fractionation, terminal and storage assets;\n•\nrisks associated with the period of time our assets have been in service;\n•\nour partial reliance on cash distributions from our unconsolidated affiliates on our operating cash flows;\n•\nour ability to cause our joint ventures to take or not take certain actions unless some or all of our joint-venture participants agree;\n•\nour reliance on others to construct and/or operate certain joint-venture assets and to provide other services;\n•\nour ability to use net operating losses and certain tax attributes;\n•\nincreased regulation of exploration and production activities, including hydraulic fracturing, well setbacks and disposal of wastewater;\n•\nimpacts of regulatory oversight and potential penalties on our business;\n•\nrisks associated with the rate regulation, challenges or changes, which may reduce the amount of cash we generate;\n•\nthe impact of our gas liquids blending activities, which subject us to federal regulations that govern renewable fuel requirements in the U.S.; \n•\nincurrence of significant costs to comply with the regulation of greenhouse gas emissions;\n•\nthe impact of federal and state laws and regulations relating to the protection of the environment, public health and safety on our operations, as well as increased litigation and activism challenging oil and gas development as well as changes to and/or increased penalties from the enforcement of laws, regulations and policies;\n•\nthe impact of unforeseen changes in interest rates, debt and equity markets and other external factors over which we have no control;\n•\nactions by rating agencies concerning our credit;\n•\nour indebtedness and guarantee obligations could cause adverse consequences, including making us vulnerable to general adverse economic and industry conditions, limiting our ability to borrow additional funds and placing us at competitive disadvantages compared with our competitors that have less debt;\n•\nan event of default may require us to offer to repurchase certain of our or ONEOK Partners’ senior notes or may impair our ability to access capital;\n•\nthe right to receive payments on our outstanding debt securities and subsidiary guarantees is unsecured and effectively subordinated to any future secured indebtedness and any existing and future indebtedness of our subsidiaries that do not guarantee the senior notes;\n•\nuse by a court of fraudulent conveyance to avoid or subordinate the cross guarantees of our or ONEOK Partners’ indebtedness;\n•\nthe risks associated with pending or possible acquisitions and dispositions, including our ability to finance or integrate any such acquisitions and any regulatory delay or conditions imposed by regulatory bodies in connection with any such acquisitions and dispositions;\n•\nthe risk that the EnLink and Medallion businesses will not be integrated successfully;\n•\nour ability to effectively manage our expanded operations following closing of recent acquisitions;\n•\nour ability to pay dividends;\n•\nour exposure to the credit risk of our customers or counterparties;\n•\na shortage of skilled labor;\n•\nmisconduct or other improper activities engaged in by our employees;\n•\nthe impact of potential impairment charges;\n•\nthe impact of the changing cost of providing pension and health care benefits, including postretirement health care benefits, to eligible employees and qualified retirees; \n•\nour ability to maintain an effective system of internal controls; and \n•\nthe risk factors listed in the reports we have filed and may file with the SEC.\nThese factors are not necessarily all of the important factors that could cause actual results to differ materially from those expressed in any of our forward-looking statements.  Other factors could also affect adversely our future results.  These and other risks are described in greater detail in Part I, Item 1A, “Risk Factors,” in our Annual Report and in our other filings that we make with the SEC, which are available via the SEC’s website at www.sec.gov and our website at www.oneok.com.  All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by these factors.  Any such forward-looking statement speaks only as of the date on which such statement is made, and other than as required under securities laws, we undertake no obligation to update publicly any forward-looking statement whether as a result of new information, subsequent events or change in circumstances, expectations or otherwise.\n41\nTable of Contents"
}