{
  "item1": "Agreement Acquire IPG December 8, 2024, Omnicom entered into Agreement Plan Merger, Merger Agreement, among Omnicom, EXT Subsidiary Inc., direct wholly owned subsidiary Omnicom, Merger Sub, IPG, pursuant which, subject terms conditions Merger Agreement, Merger Sub will merge into IPG, Merger, IPG surviving Merger wholly owned subsidiary Omnicom. Under terms Merger Agreement, IPG shareholders will receive 0.344 shares Omnicom common stock each share IPG common stock they own. Following close Merger, Omnicom shareholders expected own approximately 60.6% combined company IPG shareholders expected own approximately 39.4%, fully diluted basis. completion Merger subject customary closing conditions, including required regulatory approvals approval stockholders both Omnicom IPG.",
  "item7": "1) Reconciliation Non-GAAP Financial Measures page 2) 2024, operating expenses included $57.8 million ($42.9 million after-tax) repositioning costs, primarily related severance, recorded second quarter 2024 (see Note 13 consolidated financial statements). Included selling, general administrative expenses fourth quarter 2024 acquisition transaction costs $14.6 million ($13.1 million after-tax), related proposed merger IPG (see Note 1 consolidated financial statements). net impact these items reduced operating income 2024 $72.4 million ($56.0 million after-tax) reduced diluted net income per share - Omnicom Group Inc. $0.28.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations (Dollars tables millions, except per share amounts.) FORWARD-LOOKING STATEMENTS risks relating pending Merger (as defined below) Interpublic Group Companies, Inc., IPG, including: Merger may not completed timely manner all; delays, unanticipated costs restrictions resulting regulatory review Merger, including risk Omnicom IPG may unable obtain governmental regulatory approvals required Merger, such approvals may result imposition conditions could adversely affect combined company expected benefits Merger; uncertainties associated Merger may cause loss both companies’ management personnel other key employees, cause disruptions both companies’ business relationships; Merger Agreement (as defined below) subjects Company IPG restrictions business activities prior effective time Merger; Company IPG expected incur significant costs connection Merger integration; litigation risks relating Merger; business operations both companies may not integrated successfully expected time frame; Merger may result loss both companies’ clients, service providers, vendors, joint venture participants other business counterparties; combined company may fail realize all anticipated benefits Merger fail effectively manage its expanded operations; adverse economic conditions disruptions, including geopolitical events, international hostilities, acts terrorism, public health crises, inflation stagflation, tariffs other trade barriers, central bank interest rate policies countries comprise major markets, labor supply chain issues affecting distribution clients’ products, disruption credit markets; international, national local economic conditions could adversely affect Company its clients; losses media purchases production costs incurred behalf clients; reductions client spending, slowdown client payments deterioration disruption credit markets; ability attract new clients retain existing clients manner anticipated; changes client marketing communications services requirements; failure manage potential conflicts interest between among clients; unanticipated changes related competitive factors marketing communications services industries; unanticipated changes to, ability hire retain, key personnel; currency exchange rate fluctuations; reliance information technology systems risks related cybersecurity incidents; effective management risks, challenges efficiencies presented utilizing Artificial Intelligence (AI) technologies related partnerships business; changes legislation governmental regulations affecting Company its clients; risks associated assumptions Company makes connection its acquisitions, critical accounting estimates legal proceedings; Company’s international operations, which subject risks currency repatriation restrictions, social political conditions evolving regulatory environment high-growth markets developing countries; risks related environmental, social governance goals initiatives, including impacts regulators other stakeholders, impact factors outside control such goals initiatives. EXECUTIVE SUMMARY Agreement Acquire IPG December 8, 2024, Omnicom entered into Agreement Plan Merger, Merger Agreement, among Omnicom, EXT Subsidiary Inc., direct wholly owned subsidiary Omnicom, Merger Sub, IPG, pursuant which, subject terms conditions Merger Agreement, Merger Sub will merge into IPG, Merger, IPG surviving Merger wholly owned subsidiary Omnicom. March 18, 2025, shareholders each Omnicom IPG approved Merger."
}