{
  "source_file": "on-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nOverview\nON Semiconductor Corporation, together with its wholly and majority-owned subsidiaries, which operate under the onsemi\nTM\n brand (\"onsemi,\" \"we,\" \"us,\" \"our,\" or the \"Company\"), was incorporated under the laws of the State of Delaware in 1992. \nWe provide intelligent power and intelligent sensing solutions with a primary focus towards automotive and industrial markets to help our customers solve challenging problems and create cutting-edge products for a better future. We are utilizing our extensive range of power technologies to help address the growing power demands of AI and data centers. Our intelligent power technologies enable the electrification of the automotive industry that allows for lighter and longer-range electric vehicles, empowers efficient fast-charging systems and propels sustainable energy for the highest efficiency solar strings and industrial power. Our intelligent power solutions for the automotive industry allow our customers to exceed range targets with lower weight and reduce system cost through efficiency. Our intelligent sensing technologies support the next generation industry, allowing for smarter factories and buildings while also enhancing the automotive mobility experience with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible.\nWe believe the evolution of the automotive industry, with advancements in autonomous driving, ADAS, vehicle electrification, and the increase in electronics content for vehicle platforms, is reshaping the boundaries of transportation. Through sensing integration, we believe our intelligent power solutions achieve superior efficiencies compared to our peers. This integration allows lower temperature operation and reduced cooling requirements while saving costs and minimizing weight. In addition, our power solutions deliver power with less die per module, achieving higher range for a given battery capacity. \nAs of December 31, 2024, we were organized into three operating and reportable segments: the Power Solutions Group (\"PSG\"), the Analog and Mixed-Signal Group (\"AMG\") and the Intelligent Sensing Group (\"ISG\"). During the first quarter of 2024, we reorganized the existing divisions within certain of our operating and reportable segments and renamed the Advanced Solutions Group (\"ASG\") reportable segment to AMG. See Note 3: ''Segments and Revenue'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information regarding the segment reorganization. \nBusiness Strategy Developments\nOur primary focus continues to be on revenue growth with stable gross margin by capturing high-growth megatrends in our focused end-markets of automotive and industrial infrastructure. We design products in highly-differentiated markets focused on customer needs while optimizing and right-sizing our manufacturing footprint to support growth with new product development and maintain gross margins through efficiencies. We are focused on achieving efficiencies in our operating and capital expenditures, capital allocation on research and development investments and resources to accelerate growth in high-margin products.\n2025 Acquisition\nOn January 14, 2025, we completed the previously announced acquisition of the Silicon Carbide Junction Field-Effect Transistor (\"SiC JFET\") technology business from Qorvo US, Inc., and certain of its subsidiaries, for $118.8 million in cash, subject to working capital adjustments. We believe the acquisition complements our EliteSiC power portfolio within the PSG reportable segment and enables us to help address the need for high energy efficiency and power density in the AC-DC stage in power supply units for AI data centers. \n2024 Activities\n2024 Business Realignment\nIn an effort to streamline resources, drive organizational efficiencies, consolidate our global corporate footprint, and align with our \"Fab Right\" manufacturing strategy, we continued our business realignment efforts during 2024. Under this plan, approximately 1,200 employees were notified of their employment termination and around 300 additional employees were reassigned or asked to relocate to another site. During the year ended December 31, 2024, we recorded severance costs, asset impairments and other related charges of approximately $75.7 million, $37.8 million and $16.3 million, respectively. See Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information. We continue to evaluate employee positions and locations for \n 5\nTable of Contents\npotential operating improvements and efficiencies.\nShare Repurchases\nDuring the year ended December 31, 2024, we repurchased approximately 9.1 million shares of our common stock for an aggregate purchase price of approximately $650 million, which excludes fees, commissions and excise taxes. See Note 10: ''Earnings Per Share and Equity'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\n2023 Activities\n2023 Business Realignment\nDuring 2023, we realigned our operating models in AMG (formerly \"ASG\"), Corporate information technology (\"IT\") organization and certain manufacturing locations in order to streamline our operations, achieve organizational efficiencies and consolidate resources into fewer, common sites across the world to align with the next phase of our multi-year \"Fab Right\" manufacturing strategy. Under this plan, approximately 1,900 employees were notified of their employment termination. We incurred severance costs and related charges of approximately $59.1 million related to these actions in 2023.  See Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information. \n1.625% Notes maturity and repayment\nOn October 16, 2023, we repaid $119.6 million of the remaining outstanding principal amount of the 1.625% Notes in cash and settled the excess over the principal amount by issuing 4.5 million shares of our common stock. Under the previously executed bond hedge agreements, we also repurchased an equivalent number of shares of our common stock, for no additional consideration, to effectively offset the issuance of shares.\nCredit Agreement\nOn June 22, 2023, we entered into a new Credit Agreement to replace the Revolver due 2024, which was set to mature on June 28, 2024. We drew $375.0 million against the Revolving Credit Facility and repaid the entire outstanding balance under the Revolver due 2024. We had previously repaid $125.0 million of the outstanding balance under the Revolver due 2024 during the first quarter of 2023. \n0.50% Convertible Senior Notes due 2029\nOn February 28, 2023, we completed the offering of $1.5 billion aggregate principal amount of our 0.50% Notes and utilized the net proceeds along with cash generated from operations (i) to repay $1,086.0 million of the outstanding indebtedness under the Term Loan “B” Facility and the related transaction fees and expenses, (ii) to pay $171.5 million net cost of the related convertible note hedges after such costs were offset by the proceeds from the sale of warrants, and (iii) for general corporate purposes.\nSee Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\n2022 Acquisitions and Divestitures\nOn December 31, 2022, we completed the acquisition of EFK along with certain other assets and liabilities from GLOBALFOUNDRIES U.S. Inc. (\"GFUS\") for total consideration of $406.3 million. We paid GFUS $236.3 million, $100.0 million and $70.0 million during 2023, 2020 and 2019, respectively.\nDuring 2022, in line with our \"Fab Right\" strategy, we divested four wafer manufacturing facilities in Oudenaarde, Belgium, South Portland, Maine, Pocatello, Idaho and Niigata, Japan. We entered into wafer supply agreements with the respective buyers of these facilities to help minimize disruptions in our ability to meet customer demand for our products. \nSee Note 5: ''Acquisitions and Divestitures'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\n 6\nTable of Contents\nRevenue-Generating Activities\nonsemi generates revenue primarily from the sale of semiconductor products to distributors and direct customers. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We believe that our ability to offer a broad range of products, combined with our global manufacturing and logistics network, provides our customers with single source purchasing. In 2025, we expect to include SiC JFET in our product portfolio within the PSG segment.\nThe following table illustrates the product technologies under each of our segments based on our operating strategy:\nPSG\nAMG\nISG\n2024 Revenue (%)\n47%\n37%\n16%\nSiC products\nAnalog products\nActuator Drivers\nDiscrete products\nASIC products\nCMOS image sensors\nMOSFET products\nLogic and Isolation products\nImage Signal Processors\nPower Module products\nNon-Volatile Memory products\nSingle Photon Detectors\nFoundry products/services\nShort-Wavelength Infrared products\nGate Driver products\nIndirect Time of Flight sensors\nLSI products\nSee Note 3: ''Segments and Revenue'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for other information regarding our segments, their revenue and gross profit derived from each segment.\nProducts and Technology\nThe following provides certain information regarding the products and technologies for each of our operating segments. \nPSG\nPSG offers a wide array of discrete, module and integrated semiconductor products that perform multiple application functions, including power switching, signal conditioning, and circuit protection. The trends driving growth within our end-user markets are primarily higher power efficiency and power density in power applications, the need for greater functionality, and faster data transmission rates in all communications. Enhancement of the current electrical infrastructure driven by demand for green energy, electrification of powertrains in EVs and HEVs, and increased power demands from AI drive demand for onsemi’s highly efficient power switching products. The recent increase in the use of WBG MOSFETs and diodes, including SiC and IGBT, is further expanding the use of semiconductor products. \nAMG\nAMG designs and develops analog, mixed-signal, Power Management ICs, Sensor Interface devices, Power Conversion, Signal Chain, and Voltage Regulation devices for a broad base of end-users in the automotive, industrial, computing and mobile end-markets. We implement a platform-based design approach to rapidly proliferate product portfolios. AMG offers technology that provides our customers system-level differentiation, such as multi-phase controllers, gate drivers, DC-DC converters, AC-DC converters, ultrasonic sensors, inductive sensors, audiology digital signal processors, analog front ends, Bluetooth Low Energy, wired connectivity, Amplifiers, LDOs, Logic, EEPROMs, Isolation and more. \nISG\nISG designs and develops CMOS image sensors, image signal processors, single photon detectors, including SiPM, SPAD arrays and short-wavelength infrared products, as well as actuator drivers for autofocus and image stabilization for a broad base of end-users in the different end-markets. Our broad range of product offerings delivers excellent pixel performance, sensor functionality and camera systems capabilities in which high quality visual imagery is becoming increasingly important to our customers and their end-users, particularly in automotive and factory automation and in applications powered by AI. \n 7\nTable of Contents\nCustomers\nWe sell our products to distributors and direct customers for ultimate use in a variety of end-products in different end-markets. In general, we have maintained long-term relationships with our key customers, and our sales agreements are renewable periodically and contain certain terms and conditions with respect to payment, delivery, warranty and supply. During 2024, certain long-term supply agreements with strategic end-customers were modified upon mutual agreement. These agreements are subject to our standard terms and conditions, and generally include minimum purchase commitments and provisions allowing for renegotiation upon mutual agreement.\nWe generally warrant that products sold to our customers will, at the time of shipment, be free from defects in workmanship and materials and conform to our approved specifications. Our standard warranty extends for a period of two years from the date of delivery, except in the case of image sensor products, which are warrantied for one year from the date of delivery. Unless otherwise agreed in writing, customers may cancel orders 120 days prior to shipment for standard products without penalty and, for custom products, prior to shipment, provided they pay onsemi's actual costs incurred as of the date we receive the cancellation notice. The loss of one of our large customers would have a material adverse effect on the operations of the respective segment and may have a material adverse effect on our consolidated results of operations.\nDistributors\nSales to distributors accounted for approximately 53%, 52% and 58% of our revenue in 2024, 2023 and 2022, respectively. We had one distributor whose revenue accounted for approximately 10% of the total revenue for the year ended December 31, 2024. There were no distributors whose revenue exceeded 10% or more of total revenue for the year ended December 31, 2023. We had one distributor whose revenue accounted for approximately 12% of the total revenue for the year ended December 31, 2022. Our distributors resell our products to OEMs, contract manufacturers, and other end-customers. Sales to distributors are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns.\nDirect Customers\nSales to direct customers accounted for approximately 47%, 48% and 42% of our revenue in 2024, 2023 and 2022, respectively. Large multi-nationals and selected regional OEMs, which are significant in specific markets, form our core direct customers. Generally, these customers do not have the right to return our products following a sale other than pursuant to our warranty.\nFor additional information regarding agreements with our customers, see \"Markets,\" \"Resources,\" \"Risk Factors - Trends, Risks and Uncertainties Related to Our Business\" and Note 2: ''Significant Accounting Policies'' under the heading \"Revenue Recognition\" in the notes to our audited consolidated financial statements, included elsewhere in this Form 10-K.\nMarkets\nProduct Development\nonsemi is focused on innovation to create intelligent power and sensing technologies that solve the most challenging customer problems. Our product development efforts are directed towards the following:\n \n•\naddressing the need for solutions to manage and optimize the growing power demands and distribution within AI data centers;\n•\npowering the electrification of the automotive industry with our intelligent power technologies that allow for lighter and longer-range electric vehicles and enable efficient fast-charging systems; \n•\npropelling the sustainable energy evolution with our intelligent power technologies for the highest efficiency solar strings, industrial power and storage systems; \n•\nenhancing the automotive mobility experience with our intelligent sensing technologies with imaging and depth sensing that make advanced vehicle safety and automated driving systems possible; and \n•\nenabling automation and data exchange (Industry 4.0) with our intelligent sensing technologies for smarter factories and buildings. \n 8\nTable of Contents\nWhile our new product development efforts continue to be focused on building solutions in areas that appeal to customers in focused market segments and across multiple high-growth applications, it is our practice to regularly re-evaluate our research and development spending, to assess the deployment of resources and to review the funding of high-growth technologies. We deploy people and capital with the goal of maximizing the return for our research and development investments by targeting innovative products and solutions for high-growth applications that we believe position us to outperform the industry.\nEnd-Markets\nWe serve a broad base of end-user markets, with a primary focus towards automotive and industrial. The following table sets forth our principal end-markets, the estimated percentage (based in part on information provided by our distributors) of our revenue generated from each end-market during 2024, and sample applications for our products. Other includes the end-markets of computing, consumer, networking, communication, etc.\n \nAutomotive\nIndustrial\nOther\n2024 Revenue (%)\n55%\n25%\n20%\nSample applications\nEV\nEnergy & EV Charging Infrastructure\nAI / Data Center\nADAS\nIndustrial Automation\n5G Base Stations\nPower Management\nSecurity & Surveillance\nGraphics Cards\nPowertrain\nMachine Vision\nGaming, Home Entertainment Systems, & Set Top Boxes\nIn-Vehicle Networking\nSmart Cities & Buildings\nRouters\nBody & Interior\nHearing Health, Diagnostic, Therapy, & Monitoring\nNotebooks, Laptops, Desktop PCs & Tablets\nLighting\nPower Solutions\nUSB Type-C\nSensors\nAR/VR\nWhite Goods\nEngine Control\nMotor Control\nPower Supplies\nRobotics\nSmart Phones\nCompetition\n \nWe face significant competition from major international semiconductor companies, as well as smaller companies focused on specific market niches. Because some of our components include functionality that in some cases may be integrated into more complex ICs, we also face competition from manufacturers of ICs, ASICs and fully-customized ICs, as well as customers who develop their own IC products. See \"Risk Factors—Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K for additional information.\nSome of our competitors have greater financial and other resources to pursue development, engineering, manufacturing, marketing and distribution of their products and may generally be better situated to withstand adverse economic or market conditions. The semiconductor industry has experienced, and may continue to experience, significant consolidation among companies and vertical integration among customers. The following discusses the effects of competition on our three operating segments:\nPSG\nOur competitive strengths include core competencies such as leading-edge fabrication technologies, micro and module packaging expertise, breadth of product line and IP portfolio, high-quality, cost-effective manufacturing and supply chain management. Our commitment to continuous innovation allows us to provide a broad range of semiconductor solutions to our customers who differentiate in power density and power efficiency, the key performance characteristics driving our markets.\nNew products and package innovation that enable enhanced performance over existing portfolios drive competition. Of particular importance in the onsemi portfolio are the intelligent power technologies based on silicon and silicon carbide, wide band gap technologies, which we use to design, manufacture, and deliver to our customers as bare die, packaged discrete solutions or power module solutions. In addition to our power technologies, we believe our integrated circuit, signal and protection technologies have significant performance advantages over our competition. PSG’s primary competitors include: \n 9\nTable of Contents\nInfineon Technologies AG (\"Infineon\"), STMicroelectronics N.V. (\"STMicroelectronics\"), Wolfspeed Inc., ROHM Semiconductor and Nexperia BV.\nAMG\n \nAMG principally competes on design experience, manufacturing capability, depth and quality of IP, ability to service customer needs from the design phase to the shipping of a completed product, length of design cycle, longevity of technology support and experience of sales and technical support personnel. Our competitive position with respect to the above is enhanced by long-standing relationships with leading direct customers.\nOur ability to compete successfully depends on internal and external variables. These variables include, but are not limited to, the timeliness with which we can develop new products and technologies, product performance and quality, manufacturing yields and availability of supply, customer service, pricing, industry trends and general economic trends. Competitors for certain of AMG's products and solutions include: Texas Instruments Incorporated, Analog Devices, Inc., Infineon, STMicroelectronics, Renesas Electronics Corporation, Monolithic Power Systems Inc. and NXP Semiconductors N.V.\nISG\nISG differentiates itself from the competition through deep technical knowledge and close customer relationships to drive leading-edge sensing performance primarily in machine vision applications. ISG has significant imaging experience and was one of the earliest to commercialize CMOS active pixel sensors and introduce CMOS technology in many of our markets. ISG has leveraged this expertise into market-leading positions in automotive and industrial applications, which allow us to offer technical and end-user applications knowledge to help customers develop innovative sensing solutions across a broad range of end-user needs. \nCompetitors for certain of ISG's products and solutions include: Sony Semiconductor Manufacturing Corporation, Samsung Electronics Co., Ltd., and Omnivision Technologies Inc.\nSales, Marketing and Distribution\nWe have global distribution centers in China, the Philippines and Singapore. Global and regional distribution channels further support our customers' needs for quick response and service. We offer efficient, cost-effective global applications support from our technical information centers and solution engineering centers, allowing for applications that are developed in one region of the world to be instantaneously available throughout all other regions.\nBacklog\nOur sales are made primarily pursuant to orders that are booked as far as 52 weeks in advance of delivery. Generally, prices and quantities are fixed at the time of booking. Backlog as of a given date consists of existing orders and forecasted demand from our customers, in each case scheduled to be shipped in the current or future period. Backlog is influenced by several factors, including market demand, pricing and customer order patterns in reaction to product lead times. In the semiconductor industry, backlog quantities and shipment schedules under outstanding purchase orders are frequently revised to reflect changes in customer needs. \nResources\nRaw Materials\nOur manufacturing processes use many raw materials, including silicon wafers, SiC wafers, laminate substrates, gold, copper, lead frames, mold compound, ceramic packages and various chemicals and gases, as well as other production supplies used in our manufacturing processes. We seek to obtain our raw materials and supplies in a timely, planned manner from our suppliers to allow for our manufacturing cycle to align with the timing of our customer demands. However, suppliers may extend lead times, limit supplies or increase prices due to capacity constraints or other factors beyond our control. \n 10\nTable of Contents\nManufacturing and Design Operations\nWe currently have domestic design operations in Arizona, California, Idaho, New York, Oregon, Pennsylvania, Rhode Island and Texas. We also have foreign design operations in Belgium, Canada, China, the Czech Republic, Germany, India, Ireland, Israel, Italy, Japan, South Korea, the Philippines, Romania, Singapore, the Slovak Republic, Slovenia, Switzerland, Taiwan and the United Kingdom. We operate front-end wafer fabrication facilities in the United States, the Czech Republic, Japan, South Korea, and Malaysia and back-end assembly and test site facilities in Canada, China, Malaysia, the Philippines, Vietnam and the United States. In addition to these front-end and back-end manufacturing operations, our facility in Hudson, New Hampshire manufactures SiC crystal boules and our facilities in Rožnov pod Radhoštěm, the Czech Republic and Bucheon, South Korea manufacture silicon and SiC wafers that are used by a number of our facilities.\nThe table below sets forth information with respect to the manufacturing facilities we operate either directly or pursuant to joint ventures, the reportable segments that use such facilities, and the approximate gross square footage of each site's building, which includes, among other things, manufacturing, laboratory, warehousing, office, utility, support and unused areas.\nLocation\nReportable Segment\nSize (sq. ft.)\nFront-end Facilities:\n  \n  \nEast Fishkill, New York\nAMG, ISG and PSG\n2,724,137\nGresham, Oregon\n  \nAMG and PSG\n  \n558,457\nRožnov pod Radhoštěm, Czech Republic\nAMG and PSG\n450,755\nSeremban, Malaysia (Site 2) \n(3)\n  \nAMG, ISG and PSG\n  \n133,061\nBucheon, South Korea\nAMG and PSG\n1,113,938\nMountaintop, Pennsylvania\nAMG and PSG\n437,000\nAizuwakamatsu, Japan\nAMG and PSG\n734,482\nNampa, Idaho\n (1) (2)\nISG\n166,268\nHudson, New Hampshire \n(1)\nPSG\n272,036\nBack-end Facilities:\n  \n  \nBurlington, Canada \n(1)\nAMG\n95,440\nLeshan, China \n(3)\n  \nAMG and PSG\n  \n416,339\nSeremban, Malaysia (Site 1) \n(3)\n  \nAMG, ISG and PSG\n  \n328,275\nCarmona, Philippines\n (3)\n  \nAMG and PSG\n  \n926,367\nTarlac City, Philippines \n(3)\nAMG and PSG\n381,764\nShenzhen, China\n (1)\nPSG\n275,463\nBien Hoa, Vietnam \n(3)\n  \nAMG and PSG\n  \n294,418\nCebu, Philippines \n(3)\nAMG and PSG\n228,460\nSuzhou, China \n(3)\nAMG and PSG\n452,639\n(1)\nThese facilities are leased.\n(2)\nThis facility is used for both front-end and back-end operations.\n(3)\nThese facilities are located on leased land.\nFor additional information regarding acquisitions and divestitures, see Note 5: ''Acquisitions and Divestitures'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K. \nAll of our manufacturing facilities are fully owned and operated by us, except our assembly and test operations facility located in Leshan, China, which is owned by Leshan-Phoenix Semiconductor Company Limited, a joint venture company in which we own 80% of the outstanding equity interests (\"Leshan\"). The financial and operating results of Leshan have been consolidated in our financial statements. Our joint venture partner is Leshan Radio Company Ltd. (\"Leshan Radio\"), formerly a Chinese state-owned enterprise. Pursuant to the joint venture agreement between us and Leshan Radio, requests for production capacity are made to the board of directors of Leshan by each shareholder of the joint venture. Each request represents a purchase commitment, provided that any shareholder may elect to pay the cost associated with the unused capacity (which is generally equal to the fixed cost of the capacity) in lieu of satisfying the commitment. We purchased 80% of Leshan's production capacity in each of 2024, 2023 and 2022, and are currently committed to purchase approximately 80% of Leshan's expected production \n 11\nTable of Contents\ncapacity in 2025.\nWe use third-party contractors for some of our manufacturing activities, primarily for wafer fabrication and the assembly and testing of finished goods. Our agreements with these contract manufacturers typically require us to forecast product needs and commit to purchase services consistent with these forecasts. In some cases, longer-term commitments are required in the early stages of the relationship. These manufacturers collectively accounted for approximately 33% of our total manufacturing input costs in 2024, 36% in 2023 and 43% in 2022.\nFor information regarding risks associated with our foreign operations, see \"Risk Factors — Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nPatents, Trademarks, Copyrights and Other Intellectual Property Rights\n \nWe market our products under worldwide trademarks, including the ON Semiconductor, ON, onsemi, and various product names and logos, and, in the United States and internationally, we rely primarily on a combination of patents, trademarks, copyrights, trade secrets, employee and non-disclosure agreements and licensing agreements to protect our IP. We acquired, licensed or sublicensed a significant amount of IP, including patents and patent applications, in connection with our acquisitions, and we have numerous United States and foreign patents issued, allowed and pending. We do not consider our business substantially dependent on any single onsemi patent. Our policy is to protect our products and processes by asserting our IP rights where appropriate and prudent and by obtaining patents, copyrights and other IP rights used in connection with our business when practicable and appropriate. We believe the duration of our IP rights is adequate to protect our products and processes.\nFor information regarding risks associated with intellectual property, see \"Risk Factors — Trends, Risks and Uncertainties Related to Intellectual Property\" included elsewhere in this Form 10-K.\nSeasonality\nWe are currently experiencing fluctuations in our operating results due to general industry and macroeconomic conditions as well as within the semiconductor industry. However, we believe our business is driven more by content gains within applications and secular growth drivers and not solely by macroeconomic and industry cyclicality. For information regarding risks associated with the cyclicality and seasonality of our business, see \"Risk Factors—Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\n \nGovernment Regulation\nOur manufacturing operations are subject to various United States and foreign environmental and worker health and safety laws and regulations. These laws and regulations include those relating to emissions and discharges into the air and water, the management and disposal of hazardous substances, the release of hazardous substances into the environment at or from our facilities and at other sites and the investigation and remediation of contamination. As with other companies engaged in like businesses, the nature of our operations exposes us to the risk of liabilities and claims, regardless of fault, with respect to such matters, including personal injury claims and civil and criminal fines.\nWe believe that our operations are in material compliance with applicable environmental and health and safety laws and regulations. The costs we incurred in complying with applicable environmental regulations for the year ended December 31, 2024 were not material, and we do not currently expect the cost of complying with existing environmental and health and safety laws and regulations, together with any liabilities for currently known environmental conditions, to have a material adverse effect on our capital expenditures or earnings or on our competitive position in any one year. It is possible, however, that future developments, including changes in laws and regulations, government policies, customer specification, personnel and physical property conditions, including currently undiscovered contamination, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. See Note 13: ''Commitments and Contingencies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information on certain environmental matters.\nWe are also subject to numerous United States and foreign laws and regulations, including, without limitation, tariffs, trade sanctions, trade barriers, trade embargoes, regulations relating to import-export control, technology transfer restrictions, the International Traffic in Arms Regulation promulgated under the Arms Export Control Act (\"ITAR\"), the Foreign Corrupt Practices Act (\"FCPA\"), and the anti-boycott provisions of the U.S. Export Administration Act. Additionally, United States and foreign governmental authorities have taken, and may continue to take, administrative, legislative or regulatory action that \n 12\nTable of Contents\ncould impact our operations.\nWe believe that our operations are in material compliance with applicable trade regulations relating to import-export control, technology transfer restrictions, ITAR, FCPA, the anti-boycott provisions of the U.S. Export Administration Act, and similar applicable laws and regulations. The costs we incurred in complying with applicable trade regulations for the year ended December 31, 2024 were not material, and we do not currently expect the cost of complying with existing trade laws and regulations to have a material adverse effect on our capital expenditures or earnings or on our competitive position in any one year. It is possible, however, that future developments, including changes in laws and regulations or government policies, could lead to material costs, and such costs may have a material adverse effect on our future business or prospects. For information regarding risks associated with import-export control regulations and similar applicable laws and regulations, see \"Risk Factors—Trends, Risks and Uncertainties Related to Our Business\" included elsewhere in this Form 10-K.\nEnvironmental, Social and Governance Initiatives\nonsemi strives to be a responsible corporate citizen. We uphold ethical standards in our business practices and policies, and we believe that sustainable corporate practices and consistent attention to environmental, social and governance priorities will help enhance long-term value for our stockholders. \nonsemi strives to protect and respect its environment and energy resources for future generations throughout its operations, including wafer fabrication, assembly, test, support operations, and through its value chain. We have a goal to achieve net zero emissions by 2040, supported by our climate change policy, which highlights the focus areas for climate change-related actions. In 2024, our near-term greenhouse gas emissions targets were validated by the Science Based Targets initiative. We have formulated a strategy and are taking initial steps towards the achievement of our targets.\nWe work together with our customers, peers, partners and suppliers to promote continual improvement in human rights, labor, environment, health and safety, anti-corruption, ethics and management system standards within our operations and our supply chain. We proactively comply with the Responsible Business Alliance (“RBA”) Code of Conduct, which is aimed at eliminating forced labor, slavery and human trafficking and conflict minerals, pursuant to our involvement with the Responsible Minerals Initiative. \nOur Board of Directors (the \"Board of Directors\" or the \"Board\") and management regularly evaluate our corporate responsibility policies, including our Code of Business Conduct and other corporate social responsibility policies and programs, to help ensure an effective outcome and adherence by our employees, suppliers, vendors and partners. \nHuman Capital Resources\nCore Principles\nOur success depends on our ability to attract, train, retain and motivate our employees involved in the design, development, manufacturing and support of new and existing products and services. We value the diversity of our workforce and work consciously to create growth and development opportunities for our employees, embracing different perspectives and fostering an inclusive work environment. As we are a member of the RBA, its principles are fundamental to our corporate culture and core values and are reflected in our commitments to our employees, customers, communities and other stakeholders. These principles include providing a safe and positive work environment for our employees that emphasizes learning, professional development and respect for individuals and ethical conduct.\nHeadcount\nAs of December 31, 2024, we had approximately 26,400 regular full-time employees and approximately 90 part-time and temporary employees in facilities located in 33 countries. Approximately 15% of our regular full-time employees are located in the United States and Canada, 12% in Europe and Middle Eastern countries and 73% in Asia Pacific and Japan, with approximately 72% engaged in manufacturing, 2% in research and development, 4% in customer service or other aspects of sales and marketing, and 22% in other roles. Approximately 230 of our domestic employees (or approximately 1% of our United States-based employees) are covered by a collective bargaining agreement, and all of these employees are located at our Mountain Top, Pennsylvania manufacturing facility. Certain of our foreign employees are covered by collective bargaining arrangements (e.g., those in China, Vietnam, Japan, the Czech Republic and Belgium) or similar arrangements or are represented by workers councils. \n 13\nCompensation, Benefits, Health, Safety and Wellness\nOur compensation philosophy is focused on delivering competitive compensation with total rewards based on corporate affordability in a way that enables attraction, retention, and recognition of performance. We provide our employees and their families with access to flexible and convenient health and wellness programs, including benefits that secure them during events that may require time away from work or that impact their financial well-being. We use a combination of total rewards and other programs (which vary by region and salary grade) to attract and retain our employees, including: annual performance bonuses; stock awards, including an employee stock purchase plan; retirement support; healthcare and insurance benefits; business travel and disability insurance; health savings and flexible spending accounts; flexible work schedules, vacation and paid time off; parental leave; paid counseling assistance; education assistance; and on-site services, such as health centers and fitness centers.\nCareer Growth and Development\nWe invest resources in professional development and growth as a means of improving employee motivation, performance and retention. Our talent development programs provide employees with the resources they need to help achieve their career goals, build management skills and lead their organizations. We have established a leadership pathway model as a tool for employees to practice and apply learning as part of their development.\nTurnover\nWe monitor employee turnover rates by region and globally. The average tenure of our employees is approximately 11 years and approximately 42% of our employees have been employed by us for more than ten years. We believe our compensation philosophy, along with the career growth and development opportunities we offer, promotes longer employee tenure and reduces voluntary turnover. \nInformation about Our Executive Officers \nCertain information concerning our executive officers as of February 10, 2025 is set forth below.\nName\nAge\nPosition\nHassane El-Khoury\n45\nPresident, Chief Executive Officer and Director\nThad Trent\n57\nExecutive Vice President, Chief Financial Officer and Treasurer\nSimon Keeton\n51\nGroup President, PSG\nSudhir Gopalswamy\n55\nGroup President, ISG and AMG\nAll of our executive officers are also officers of SCI LLC. The present term of office for the officers named above will generally expire on the earliest of their retirement, resignation or removal. There are no family relationships among our executive officers.\nHassane El-Khoury.\n    Mr. El-Khoury was appointed as President, Chief Executive Officer and Director of onsemi in December 2020. Prior to joining onsemi, he spent 13 years at Cypress Semiconductor Corporation, a semiconductor design and manufacturing company (\"Cypress\"), serving as Chief Executive Officer from August 2016 to April 2020. During his time at Cypress, he held various positions spanning business unit management, product development, applications engineering and business development. Additionally, Mr. El-Khoury currently serves as Chairman of the board of directors of Leia Inc. He holds a Bachelor of Science in electrical engineering from Lawrence Technological University and a Master's of Engineering Management from Oakland University.\nThad Trent\n.    Mr. Trent was appointed Executive Vice President, Chief Financial Officer and Treasurer of onsemi in February 2021. Mr. Trent has held several leadership roles throughout his career, and he currently serves on the board of directors of Leia Inc. He previously served as Chief Financial Officer at Cypress (\"Cypress CFO\") responsible for strategic planning, accounting, investor relations, tax, corporate development and information technology. He first joined Cypress in 2005, and served as Cypress CFO from June 2014 until its sale to Infineon in April 2020. Under his leadership, Cypress’ revenue increased from $723 million to $2.5 billion, and the enterprise value increased five times during his five-year tenure as Cypress CFO. He is a seasoned finance professional with progressive leadership and management experience with both global publicly held technology companies and startups. Mr. Trent has a proven track record of driving sustainable financial performance, transformative mergers and acquisitions, operational excellence, process efficiency, financial leadership and robust compliance and regulatory control. He earned his Bachelor of Science in business administration and finance at San Diego State University. \n 14\nSimon Keeton\n.    Mr. Keeton joined onsemi in July 2007 and is currently the Group President, PSG of onsemi. During his career, Mr. Keeton has held various management positions within onsemi. Before Mr. Keeton’s promotion to his current role on February 26, 2024, he served as Executive Vice President and General Manager, PSG starting in January 2019. Prior to that role, he was a Senior Vice President and General Manager of the MOSFET Division. From 2012 to 2016, Mr. Keeton served as Vice President and General Manager of the Integrated Circuit Division under our former Standard Products Group. Prior to that time, he served as Vice President and General Manager of the Consumer Products Division from 2009 to 2012 and as Business Unit Director of our Signals and Interface Business Unit from 2007 to 2009. Before joining onsemi, Mr. Keeton served as Strategic Planning Manager of the Digital Enterprise Group of Intel Corporation (\"Intel\") and held various marketing and business management roles at Vitesse Semiconductor Corporation. He earned a Bachelor of Science degree in computer engineering and a Master of Science Degree in electrical engineering from Michigan State University, and a Master of Business Adminis\ntration from Pepperdine University – in addition to completing an executive business program from Harvard Business School.\nSudhir Gopalswamy\n.\n \n Mr. Gopalswamy joined onsemi in March 2022 and is currently the Group President, ISG and AMG of onsemi. He served as Senior Vice President and General Manager, AMG from April 2023 to February 2024. \nPrior to April 2023 when he was appointed to lead AMG, Mr. Gopalswamy was the Chief Strategy Officer driving our corporate strategy development, annual strategic planning cycle and other key initiatives. Before joining onsemi, he served as Principal at Shamago Advisors from March 2021 to March 2022. Mr. Gopalswamy worked at Cypress from 2008 until its 2020 acquisition by Infineon. Following that acquisition, Mr. Gopalswamy was appointed Executive Vice President and Board Member of the Connected Secure Systems Division of Infineon and served in that role until March 2021. Before joining Cypress in 2008, he held leadership positions with ever-increasing scope at Intel and Conexant Systems, Inc. Mr. Gopalswamy holds a Bachelor of Science in electrical engineering from Purdue University, as well as a Master in Business Administration from Duke University, and he has also attended Stanford Directors’ College at Stanford University.\n \nAvailable Information\nOur website is \nwww.onsemi.com\n. We make our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and other reports and all amendments to those reports available, free of charge, in the \"Investor Relations\" section of our website as soon as reasonably practicable after we electronically file these materials with, or furnish these materials to, the SEC. Information on or accessible through our website is neither part of, nor incorporated by reference into, this Form 10-K or any other report filed with or furnished to the SEC. You can also find these materials on the SEC website at \nwww.sec.gov\n.\n 15",
  "item7": "Item 7.\n    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion in conjunction with our audited historical consolidated financial statements, including the notes thereto, which are included elsewhere in this Form 10-K. Management's Discussion and Analysis of Financial Condition and Results of Operations contains statements that are forward-looking. These statements are based on current expectations and assumptions that are subject to risk, uncertainties, and other factors and speak only as of the filing date. Actual results could differ materially because of the factors discussed in \"Risk Factors\" and elsewhere in this Form 10-K. \n 33\nExecutive Overview\nThis executive overview presents summarized information regarding our business and operating trends only. For further details, please read \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in its entirety.\nonsemi Results\nOur revenue for the year ended December 31, 2024 was $7,082.3 million, representing a decrease of 14.2% from $8,253.0 million for the year ended December 31, 2023. During 2024, we reported net income attributable to onsemi of $1,572.8 million compared to $2,183.7 million in 2023. Our operating income totaled $1,767.7 million during 2024 compared to $2,538.7 million during 2023. Our gross margin decreased by approximately 170 basis points to 45.4% in 2024 from 47.1% in 2023. The decrease in our operating results was primarily due to decreased demand in our automotive and industrial end-markets resulting in lower sales volumes and the corresponding underutilization of our manufacturing facilities. See discussion under \"Results of Operations\" for the reasons for the fluctuations year-over-year.\nBusiness and Macroeconomic Environment\nThe semiconductor industry has traditionally been highly cyclical, has often experienced significant downturns in connection with, or in anticipation of, declines in general economic conditions. During 2024, the semiconductor industry continued to experience a softening demand and uncertainty due to macroeconomic factors and the geopolitical environment. We are monitoring the economic environment and related forecasts for indicators that would suggest the global economic slowdown could continue for an extended period. Given the current conditions, we are actively managing and have taken corrective actions in our manufacturing capacity and spending to align with the forecasted demand. We intend to continue these actions during 2025; however, we believe the current volatility in general economic conditions is not expected to have a significant impact on our long-term strategic and growth initiatives.\nWe continue to evaluate cost-saving initiatives to be able to align our overall cost structure, capital investments and other expenditures with our expected revenue, spending and capacity levels to help offset softening demand, increased manufacturing and operating costs. We have taken, and continue to take actions, including but not limited to, exiting product lines that do not enhance gross margin or satisfy strategic objectives and aligning internal manufacturing capacity and resources to external demand. \nSee Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for information relating to our most recent cost-saving initiatives. \nResults of Operations\nA discussion of our results of operations for the year ended December 31, 2024 compared to December 31, 2023 is included below. For a discussion and comparison of the results of our operations for the year ended December 31, 2023 with the year ended December 31, 2022, refer to \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\" in our Form 10-K for the year ended December 31, 2023 filed with the SEC on February 5, 2024.\n 34\nOperating Results\nThe following table summarizes certain information relating to our operating results that has been derived from our audited consolidated financial statements (in millions):\n \nYear ended December 31,\n \n2024\n2023\nChange\nRevenue\n$\n7,082.3 \n$\n8,253.0 \n$\n(1,170.7)\nCost of revenue \n3,866.2 \n4,369.5 \n(503.3)\nGross profit\n3,216.1 \n3,883.5 \n(667.4)\nOperating expenses:\nResearch and development\n612.7 \n577.3 \n35.4 \nSelling and marketing\n273.5 \n279.1 \n(5.6)\nGeneral and administrative\n376.3 \n362.4 \n13.9 \nAmortization of acquisition-related intangible assets\n52.0 \n51.1 \n0.9 \nRestructuring, asset impairments and other charges, net\n133.9 \n74.9 \n59.0 \nTotal operating expenses\n1,448.4 \n1,344.8 \n103.6 \nOperating income\n1,767.7 \n2,538.7 \n(771.0)\nOther income (expense), net:\nInterest expense\n(62.3)\n(74.8)\n12.5 \nInterest income\n111.4 \n93.1 \n18.3 \nLoss on debt refinancing and prepayment\n— \n(13.3)\n13.3 \nLoss on divestiture of businesses\n— \n(0.7)\n0.7 \nOther income (expense), net\n20.6 \n(7.2)\n27.8 \nOther income (expense), net\n69.7 \n(2.9)\n72.6 \nIncome before income taxes\n1,837.4 \n2,535.8 \n(698.4)\nIncome tax provision\n(262.8)\n(350.2)\n87.4 \nNet income\n1,574.6 \n2,185.6 \n(611.0)\nLess: Net income attributable to non-controlling interest\n(1.8)\n(1.9)\n0.1 \nNet income attributable to ON Semiconductor Corporation\n$\n1,572.8 \n$\n2,183.7 \n$\n(610.9)\n 35\nThe following table summarizes certain information relating to our segment results (in millions):\n2024\nAs a % of Total\n2023 \n(1)\nAs a % of Total\nDollar Change\nRevenue:\nPSG\n$\n3,348.2 \n47.3 \n%\n$\n3,880.4 \n47.0 \n%\n$\n(532.2)\nAMG\n2,609.1 \n36.8 \n%\n3,057.1 \n37.0 \n%\n(448.0)\nISG\n1,125.0 \n15.9 \n%\n1,315.5 \n16.0 \n%\n(190.5)\nTotal\n$\n7,082.3 \n100.0 \n%\n$\n8,253.0 \n100.0 \n%\n$\n(1,170.7)\nCost of revenue:\nPSG\n$\n1,963.8 \n50.8 \n%\n$\n2,058.5 \n47.1 \n%\n$\n(94.7)\nAMG\n1,302.8 \n33.7 \n%\n1,635.8 \n37.4 \n%\n(333.0)\nISG\n599.6 \n15.5 \n%\n675.2 \n15.5 \n%\n(75.6)\nTotal\n$\n3,866.2 \n100.0 \n%\n$\n4,369.5 \n100.0 \n%\n$\n(503.3)\nGross profit: \n(2)\nPSG\n$\n1,384.4 \n41.3 \n%\n$\n1,821.9 \n47.0 \n%\n$\n(437.5)\nAMG\n1,306.3 \n50.1 \n%\n1,421.3 \n46.5 \n%\n(115.0)\nISG\n525.4 \n46.7 \n%\n640.3 \n48.7 \n%\n(114.9)\nTotal\n$\n3,216.1 \n45.4 \n%\n$\n3,883.5 \n47.1 \n%\n$\n(667.4)\n(1)\nDuring the first quarter of 2024, the Company reorganized certain reporting units and its segment reporting structure. As a result of the reorganization of divisions within PSG and AMG, the prior-period amounts have been reclassified to conform to current-period presentation.\n(2)\nGross profit margin as a percent of respective segment revenue balances\nRevenue\nRevenue was $7,082.3 million and $8,253.0 million for 2024 and 2023, respectively. The decrease from 2023 to 2024 of $1,170.7 million, or 14.2%, \nw\nas attributable to lower sales volumes across all segments, which are further explained below. We had one customer, a distributor, whose revenue accounted for approximately 10% of our total revenue for the year ended December 31, 2024. There was no customer whose revenue exceeded 10% of total revenue for the year ended December 31, 2023.\nRevenue from PSG\nRevenue from PSG decreased by $532.2 million, or approximately 13.7%, during 2024 compared to 2023. Revenue from our Multi-Market Power Division, Industrial Power Division and Automotive Power Division decreased by $250.8 million, $162.2 million and $119.1 million, respectively, primarily driven by a decrease in demand in the automotive and industrial end-markets.\nRevenue from AMG \nRevenue from AMG decreased by $448.0 million, or approximately 14.7%, during 2024 compared to 2023. Revenue from our Power Management Division, Sensor Interface Division and Integrated Circuit Division decreased by $269.1 million, $101.5 million and $77.4 million, respectively, also due to the decrease in demand in the automotive and industrial end-markets.\nRevenue from ISG \nRevenue from ISG decreased by $190.5 million, or approximately 14.5%, during 2024 compared to 2023, which was driven by a decrease in revenue from our Industrial and Consumer Solutions Division and Automotive Sensing Division of $107.8 million and $82.7 million, respectively, primarily due to the decrease in demand in the automotive and industrial end-markets\n.\n 36\nRevenue by Geographic Location\nRevenue by geographic location, based on sales billed from the respective country or regions, was as follows (dollars in millions):\n2024\nAs a % of\nRevenue \n(1)\n2023\nAs a % of\nRevenue \n(1)\nHong Kong\n$\n1,779.3 \n25.1 \n%\n$\n2,168.6 \n26.3 \n%\nSingapore\n1,733.2 \n24.5 \n%\n1,938.8 \n23.5 \n%\nUnited Kingdom\n1,637.8 \n23.1 \n%\n1,753.4 \n21.2 \n%\nUnited States\n1,307.5 \n18.5 \n%\n1,573.7 \n19.1 \n%\nOther\n624.5 \n8.8 \n%\n818.5 \n9.9 \n%\nTotal Revenue\n$\n7,082.3 \n$\n8,253.0 \n(1)\nCertain of the amounts may not total due to rounding of individual amounts. \nGross Profit and Gross Margin\nGross profit was $3,216.1 million and $3,883.5 million for 2024 and 2023, respectively, representing a decrease of $667.4 million or approximately 17.2%. This was primarily due to the decline in sales volume in both our existing products and new products which negatively impacted gross profit by approximately $630 million and $122 million, respectively. This was partially offset by a reduction in the lower-margin manufacturing services revenue at our EFK location which favorably impacted gross profit by approximately $85 million. \nOur gross margin decreased by 1.7 percentage points from 47.1% for the year ended December 31, 2023 to 45.4% for the year ended December 31, 2024, primarily due to the impact of the factors explained in the segment gross margin sections below.\nPSG gross profit decreased by $437.4 million, primarily driven by the decline in sales volume in both existing products and new products which negatively impacted gross profit by approximately $316 million and $121 million, respectively. PSG gross margin decreased by 5.6 percentage points to 41.3% from 47.0%, primarily as a result of the decline in volume, underutilization of our manufacturing facilities, and the related impact of unfavorable product mix.\nAMG gross profit decreased by $115.1 million, primarily driven by the decline in sales volume from existing products, which negatively impacted gross profit by approximately $200 million, partially offset by improved gross profit of approximately $85 million from the lower-margin manufacturing services at our EFK location. AMG gross margin increased by 3.6 percentage points to 50.1% from 46.5%, primarily due to the reduction in the lower-margin manufacturing services revenue at our EFK location.\nISG gross profit decreased by $114.9 million, primarily driven by the decline in sales volume from existing products. ISG gross margin decreased 2.0 percentage points to 46.7% from 48.7%, primarily driven by lower sales volumes and the related impact of the underutilization of our manufacturing facilities, along with unfavorable changes in product mix.\nOperating Expenses \nResearch and Development\nResearch and development expenses were $612.7 million and $577.3 million, or approximately 9% and 7% of revenue for 2024 and 2023, respectively, representing an increase of $35.4 million, or approximately 6% year-over-year. The increase was primarily due to an increase in payroll-related expenses and production supplies, partially offset by a decrease in variable compensation.\nSelling and Marketing\nSelling and marketing expenses were $273.5 million and $279.1 million, or approximately 4% and 3% of revenue for 2024 and 2023, respectively, representing a decrease of $5.6 million, or approximately 2% year-over-year. The decrease was primarily related to a decrease in sales commissions and variable compensation.\n 37\nGeneral and Administrative\nGeneral and administrative expenses were $376.3 million and $362.4 million, or approximately 5% and 4% of revenue for 2024 and 2023, respectively, representing an increase of $13.9 million, or approximately 4% year-over-year. The increase was primarily due to increased consulting fees associated with information technology initiatives partially offset by a decrease in the bad debt provision with a strategic business partner which was recorded in the prior year.\nAmortization of Acquisition-Related Intangible Assets\nAmortization of acquisition-related intangible assets was $52.0 million and $51.1 million for 2024 and 2023, respectively, representing an increase of $0.9 million, or approximately 2%, year-over-year. Expenses were consistent between periods as there were no significant acquisitions or divestitures. \n \nRestructuring, Asset Impairments and Other Charges, net\nRestructuring, asset impairments and other charges, net was $133.9 million and $74.9 million for 2024 and 2023, respectively, representing an increase of $59.0 million. Amounts incurred during 2024 primarily represent severance and asset impairment charges associated with the 2024 business realignment efforts. Charges in 2023 related primarily to the business realignment efforts during 2023. For additional information, see Note 7: ''Restructuring, Asset Impairments and Other Charges, net'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nOther Income and Expenses\nInterest Expense \nInterest expense decreased by $12.5 million, or approximately 17%, to $62.3 million during 2024 compared to $74.8 million in 2023. The decrease was primarily due to the pay down of higher variable-rate debt and replacement by the 0.50% Notes in 2023. Our average gross amount of long-term debt balance (including current maturities) during 2024 and 2023 was $3,379.9 million and $3,304.1 million, respectively. Our weighted average interest rate on our gross amount of long-term debt (including current maturities) was 1.8% and 2.3% per annum in 2024 and 2023, respectively. \nInterest income \nInterest income increased by $18.3 million, or approximately 20%, to $111.4 million during 2024 compared to $93.1 million in 2023, primarily due to higher interest rates and increased balances in interest-bearing accounts.\nSee \"Key Financing and Capital Events\" below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities.\nLoss on Debt Refinancing and Prepayment\nThere were no debt refinancing or prepayment transactions during 2024. We recorded a loss on debt refinancing and prepayment of $13.3 million during 2023, due to the write-off relating to the repayment of the Term Loan \"B\" Facility. See \"Key Financing and Capital Events\" below and Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for a description of our indebtedness and our refinancing activities. \nOther income (expense), net\nOther income (expense), net was income of $20.6 million in 2024, compared to expense of $7.2 million in \n2023\n. We received $9.5 million of dividend income in 2024 with no corresponding amounts in 2023. Actuarial gains on pension plans were $12.2 million compared to losses of $4.0 million during 2023 and fluctuations in foreign currencies resulting in increased transaction gains.\nIncome Tax Provision\nWe recorded an income tax provision of $262.8 million and $350.2 million in 2024 and 2023, respectively, representing effective tax rates of 14.3% and 13.8%. \nFor additional information, see Note 16: ''Income Taxes'' in the notes to the audited consolidated financial statements included elsewhere in this Form 10-K.\n 38\nLiquidity and Capital Resources\nOverview\nOur principal sources of liquidity are cash on hand, cash generated from operations, available borrowings under our Revolving Credit Facility as well as new debt and/or equity issuances. In the near term, we expect to fund our cash requirements by utilizing any or a combination of these principal sources. Our cash and cash equivalents and short-term investments were approximately $2,691.3 million and $300.0 million, respectively, as of December 31, 2024 and our Revolving Credit Facility had approximately $1.1 billion available for future borrowings as of December 31, 2024. \nWe require cash to: (i) fund our operating expenses, working capital requirements, outlays for strategic acquisitions and investments; (ii) service our debt, including principal and interest; (iii) incur capital expenditures; and (iv) repurchase our common stock. During the ordinary course of business, we evaluate our cash requirements and, if necessary, adjust our expenditures to reflect the current market conditions and our projected sales and demand. Future capital expenditures may be impacted by events and transactions that are not currently forecasted.\nWe believe that the key factors that could adversely affect our internal and external sources of cash include:\n•\nchanges in demand for our products, competitive pricing pressures, supply chain constraints, effective management of our manufacturing capacity, our ability to achieve further reductions in operating expenses, our ability to make progress on the achievement of our business strategy and sustainability goals, the impact of our restructuring programs on our production and cost efficiency and our ability to make the research and development expenditures required to remain competitive in our business; and\n•\nthe debt and equity capital markets could impact our ability to obtain needed financing on acceptable terms or to respond to business opportunities and developments as they arise, including interest rate fluctuations, macroeconomic conditions, sudden reductions in the general availability of lending from banks or the related increase in cost to obtain bank financing and our ability to maintain compliance with covenants under our debt agreements in effect from time to time.\nSources and Uses of Cash\nThe following are the significant sources and uses of cash during 2024:\n•\nCash flows from operating activities of $1,906.4 million\n.\n•\nPurchase of property, plant & equipment of $694.0 million.\n•\nRepurchases of approximately 9.1 million shares of common stock for an aggregate purchase price of approximately $650 million under the Share Repurchase Program. \nOperating Activities\nOur long-term cash generation is dependent on our ability to generate cash from our operations. Our cash flows from operating activities were $1,906.4 million, $1,977.5 million and $2,633.1 million for the years ended \nDecember 31, 2024, 2023 and 2022\n, respectively. \nOur operating cash flows for the year ended December 31, 2024 decreased \nby $71.1 million, or 3.6%, compared to the year ended December 31, 2023 and was primarily attributable to a reduction in net income driven by lower end-market demand for our products partially offset by the timing of cash receipts and payments related to working capital balances.\nOur ability to maintain positive operating cash flows is dependent on, among other factors, our success in achieving our revenue goals and meeting manufacturing and operating cost targets. Management of our assets and liabilities, including both working capital and long-term assets and liabilities, also influences our operating cash flows.\n 39\nInvesting Activities\nOur cash flows used in investing activities were $1,009.8 million, $1,737.9 million and $705.4 million for the years ended \nDecember 31, 2024, 2023 and 2022\n, respectively. The decrease of $728.1 million \nfor the year ended December 31, 2024 compared to \nthe year ended December 31, 2023 was primarily attributable to a decrease in capital expenditures and payments for the acquisition of our EFK location during the year ended 2023, partially offset by the net impact of purchases and maturities of short-term investments. During the years ended \nDecember 31, 2024, 2023\n \nand 2022, \nwe paid $694.0 million, $1,539.1 million and $1,036.0 million, respectively, for capital expenditures. Our capital expenditures as a percent of revenue for the years ended  \nDecember 31, 2024, 2023\n \nand 2022 \nwas approximately 10%, 19% and 12%, respectively. In 2025, based on current plans, we expect capital expenditures to be approximately 5% of revenue.\nFinancing Activities\nOur cash flows used in financing activities were $683.8 million, $686.5 million and $370.0 million for the years ended December 31, 2024, 2023 and 2022, respectively. We used cash for share repurchases of $654.1 million for the year ended \nDecember 31, 2024 compared to \n$564.2 million in 2023. Additionally, during the year ended December 31, 2023, we had net cash outflows related to the establishment of our new Credit Agreement.\nDuring January 2025, we acquired 1.6 million shares for $100.0 million under the Share Repurchase Program, subject to a 10b5-1 trading arrangement. We expect to continue to opportunistically repurchase under our Share Repurchase Program subject to market conditions, the price of our shares and other factors (including liquidity needs). However, the Share Repurchase Program may be modified, suspended or terminated by the Board of Directors at any time without prior notice.\nSee Part I, Item 1A \"Risk Factors\" included elsewhere in this Form 10-K for additional information related to liquidity matters.\nDebt\nAs of \nDecember 31, 2024\n, we were in compliance with the indentures relating to our 0% Notes, 0.50% Notes and 3.875% Notes and with the financial covenants included in the Credit Agreement. The 0% Notes, 0.50% Notes and 3.875% Notes are senior to the existing and future subordinated indebtedness of onsemi and its guarantor subsidiaries, rank equally in right of payment to all of our existing and future senior debt and, as unsecured obligations, are subordinated to all of our existing and future secured debt to the extent of the assets securing such debt. Failure to comply with any of our covenants or any other terms of our Credit Agreement could result in higher interest rates in our borrowings or the acceleration of the maturities of our outstanding debt. In order to remain in compliance with the various financial covenants contained in our debt agreements and to fund working capital, our capital expenditures and business development efforts will depend on our ability to generate cash from operating activities, which is subject to, among other things, our future operating performance, as well as financial, competitive, legislative, regulatory and other conditions, some of which may be beyond our control.\nAs of December 31, 2024, there was outstanding $804.9 million aggregate principal amount of the 0% Notes, $1,500.0 million aggregate principal amount of the 0.50% Notes and $700.0 million aggregate principal amount of 3.875% Notes. The associated interest expense related to our indebtedness will continue to have a significant impact on our results of operations.\nSee Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nKey Financing and Capital Events\nOverview\nWe continually evaluate our debt and capital structure and, when appropriate, we have completed various measures to secure liquidity, repurchase shares of our common stock, reduce interest costs, amend or replace existing key financing arrangements and, in some cases, extend a portion of our debt maturities to continue to provide us additional operating flexibility. \n2024 Financing Events \n•\nRepurchases of approximately 9.1 million shares of common stock for an aggregate purchase price of approximately $650 million under the Share Repurchase Program.\n 40\n2023 Financing Events \n•\nIssuance of $1.5 billion of 0.50% Notes on February 28, 2023, the net proceeds of which were used to repay $1,086.0 million of the existing indebtedness under the Term Loan \"B\" Facility, the related transaction fees and expenses and to pay approximately $171.5 million net cost of the related convertible note hedges.\n•\nEntering into a new Credit Agreement consisting of a $1.5 billion Revolving Credit Facility and draw-down of $375.0 million to repay the entire outstanding balance under the Revolver due 2024 in the second quarter of 2023. \n•\nRepurchases of approximately 7.6 million shares of common stock for an aggregate purchase price of approximately $564 million under the Share Repurchase Program.\n•\nRepayment of the 1.625% Notes amounting to $119.6 million in cash upon maturity and issuance of approximately 4.5 million shares of common stock to settle the excess over the principal.\n2022 Financing Events \n•\nDraw down of $500.0 million on the Revolver due 2024 and partial repayment of the outstanding balance on the Term Loan \"B\" Facility and corresponding write off of $7.3 million of unamortized debt discount and issuance costs.\n•\nRepurchases of approximately 4.0 million shares of common stock for an aggregate purchase price of approximately $260 million under the previous share repurchase program.\n•\nSettlement with certain holders of the 1.625% Notes to repurchase or exchange, as applicable, $16.0 million in aggregate principal amount of the 1.625% Notes for a total consideration of $16.0 million in cash and 552,000 shares of common stock.\n•\nEntry into the Tenth Amendment to the Prior Credit Agreement to transition the interest rate base from LIBOR to Term SOFR.\nSee Note 9: ''Long-Term Debt'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K for additional information.\nCritical Accounting Policies and Estimates\nThe accompanying discussion and analysis of our financial condition and results of operations is based upon our audited consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We believe certain of our accounting policies are critical to understanding our financial position and results of operations. We utilize the following critical accounting policies in the preparation of our financial statements. In addition to our critical accounting policies below, see Note 2: ''Significant Accounting Policies'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.\nUse of Estimates.\n The preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect the reported amount of assets and liabilities at the date of the financial statements and the reported amount of revenue and expenses during the reporting period. We evaluate these estimates and judgments on an ongoing basis and base our estimates on experience, current and expected future conditions, third-party evaluations and various other assumptions that we believe are reasonable under the circumstances. Significant estimates have been used by management in conjunction with the following: (i) calculation of future payouts for customer incentives and amounts subject to allowances and returns; (ii) valuation and obsolescence relating to inventories; (iii) measurement of valuation allowances against deferred tax assets, and evaluations of uncertain tax positions; (iv) assumptions used in business combinations; and (v) testing for impairment of long-lived assets and goodwill. Actual results may differ from the estimates and assumptions used in the consolidated financial statements.\nRevenue Recognition\n.\n We generate revenue from sales of our semiconductor products to direct customers and distributors. We also generate revenue, to a much lesser extent, from product development agreements and manufacturing services provided to customers. We apply a five-step approach in determining the amount and timing of revenue to be recognized: (i) identifying the contract with a customer; (ii) identifying the performance obligations in the contract; (iii) determining the transaction price; (iv) allocating the transaction price to the performance obligations in the contract; and (v) recognizing revenue when the \n 41\nperformance obligation is satisfied. We allocate the transaction price to each distinct product based on its relative stand-alone selling price. In determining the transaction price, we evaluate whether the price is subject to refund or adjustment to determine the net consideration to which we expect to be entitled. \nWe recognize revenue when we satisfy a performance obligation in an amount reflecting the consideration to which we expect to be entitled. Substantially all of our revenue is recognized at the time control of the products transfers to the customer. For sales agreements, we have identified the promise to transfer products, each of which is distinct, to be the performance obligation. For product development agreements, we have identified the completion of a service defined in the agreement to be the performance obligation. We recognize revenue from manufacturing services when we satisfy the performance obligation by transferring the promised goods or services to the customer. Depending on the terms of the applicable contractual agreement with the customer, revenue is recognized at the point in time when the customer obtains control of the promised goods or service, or over time when the created asset has no alternate use to us and there is an enforceable right to payment for the performance to date. \nSales to certain distributors, primarily those with ship and credit rights, can be subject to price adjustment on certain products. We develop an estimate of their expected claims under the ship and credit program based on the historical claims data submitted by product and customer and expected future claims, which requires the use of estimates and assumptions related to the amount of each claim as well as the historical period used to develop the estimate. Although payment terms vary, most distributor agreements require payment within 30 days.\n \nOur direct customers do not have the right to return products other than pursuant to the provisions of our standard warranty. Sales to distributors, however, are typically made pursuant to agreements that provide return rights and stock rotation provisions permitting limited levels of product returns. Provisions for discounts and rebates to customers, estimated returns and allowances, ship and credit claims and other adjustments are provided for in the same period the related revenue is recognized, and are netted against revenue. For non-quality related returns, we recognize a related asset for the right to recover returned products with a corresponding reduction to cost of goods sold. Payment terms for direct customers generally require payment within 30 days but can extend up to 90 days. We record a reserve for cash discounts as a reduction to accounts receivable and a reduction to revenue, based on the experience with each customer. \nInventories\n.\n We carry our inventories at the lower of standard cost (which approximates actual cost on a first-in, first-out basis) or net realizable value and record provisions for potential excess and obsolete inventories based upon a regular analysis of inventory on hand compared to historical and projected end-user demand. The determination of projected end-user demand requires the use of estimates and assumptions related to projected unit sales for each product. These provisions can influence our results from operations. For example, when demand falls for a given part, all or a portion of the related inventory that is considered to be in excess of anticipated demand is reserved, impacting our cost of revenue and gross profit. The majority of product inventory that has been previously reserved is ultimately discarded. Although we do sell some products that have previously been written down, such sales have historically been consistently insignificant and the related impact on our margins has also been insignificant.\nIncome Taxes.\n Income taxes are accounted for using the asset and liability method. Under this method, deferred income tax assets and liabilities are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred income tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which these temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. A valuation allowance is provided for those deferred tax assets for which we cannot conclude that it is more likely than not that such deferred tax assets will be realized.\nIn determining the amount of the valuation allowance, estimated future taxable income, feasible tax planning strategies, future reversals of existing temporary differences and taxable income in prior carryback years, if a carryback is permitted, are considered. If we determine it is more likely than not that all or a portion of the remaining deferred tax assets will not be realized, the valuation allowance will be increased with a charge to income tax expense. Conversely, if we determine it is more likely than not to be able to utilize all or a portion of the deferred tax assets for which a valuation allowance has been provided, the related portion of the valuation allowance will be recorded as a reduction to income tax expense.\n \nWe recognize and measure benefits for uncertain tax positions using a two-step approach. The first step is to evaluate the tax position taken or expected to be taken in a tax return by determining if the weight of available evidence indicates that it is more likely than not that the tax positions will be sustained upon audit, including resolution of any related appeals or litigation processes. For tax positions that are more likely than not to be sustained upon audit, the second step is to measure the tax benefit as the largest amount that is more than 50% likely to be realized upon settlement. No tax benefit is recognized for tax \n 42\npositions that are not more likely than not to be sustained. Our practice is to recognize interest and/or penalties related to income tax matters in income tax expense. Significant judgment is required to evaluate uncertain tax positions. Evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law, correspondence with tax authorities during the course of tax audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in income tax expense in the period in which the change is made, which could have a material impact on our effective tax rate. \nBusiness Combinations.\n We use estimates and assumptions in allocating the purchase price of acquired business by utilizing established valuation techniques appropriate for the technology industry to record the acquired assets and liabilities at fair value. We utilize the income approach, cost approach or market approach, depending upon which approach is the most appropriate based on the nature and reliability of available data. If the income approach is used, the fair value determination is predicated upon the value of the future cash flows that an asset is expected to generate over its economic life and involves significant assumptions as to cash flows, associated expenses, long-term growth rates and discount rates. The cost approach takes into account the cost to replace (or reproduce) the asset and involves assumptions relating to the asset's value of physical, functional and/or economic obsolescence that has occurred with respect to the asset. The market approach is used to estimate value from an analysis of actual transactions or offerings for economically comparable assets available as of the valuation date. Determining the fair value of acquired technology assets is judgmental in nature and requires the use of significant estimates and assumptions, including the discount rate, revenue growth rates, projected gross margins, and estimated research and development expenses. \nImpairment of Goodwill and Long-Lived Assets. \nWe evaluate our goodwill for potential impairment annually during the fourth quarter and whenever events or changes in circumstances indicate the carrying value of goodwill may not be recoverable. Our impairment evaluation consists of a qualitative assessment, and if deemed necessary, a quantitative test is performed which compares the fair value of a reporting unit with its carrying amount, including goodwill. \nDetermining the fair value of our reporting units is subjective in nature and involves the use of significant estimates and assumptions, including projected net cash flows, discount and long-term growth rates. We determine the fair value of our reporting units based on an income approach, whereby the fair value of the reporting unit is derived from the present value of estimated future cash flows. The assumptions about estimated cash flows include factors such as future revenue, gross profit, operating expenses, and industry trends. We consider historical rates and current market conditions when determining the discount and long-term growth rates to use in its analysis. We consider other valuation methods, such as the cost approach or market approach, if it is determined that these methods provide a more representative approximation of fair value. \nWe evaluate the recoverability of the carrying amount of our property, plant and equipment and intangible assets, whenever events or changes in circumstances indicate that the carrying amount of an asset group may not be fully recoverable. Impairment is first assessed when the undiscounted expected cash flows derived for an asset group are less than its carrying amount. Impairment losses, if applicable, are measured as the amount by which the carrying value of an asset group exceeds its fair value and are recognized in operating results. We continually apply our best judgment when applying these impairment rules to determine the timing of the impairment test, the undiscounted cash flows used to assess impairments and the fair value of an impaired asset group. The dynamic economic environment in which we operate and the resulting assumptions used to estimate future cash flows impact the outcome of our impairment tests. As we continue to implement our business strategy to rationalize products and manufacturing locations to transition to a lighter internal fabrication model, there could be divestiture transactions that result in a portion of goodwill or other assets being de-recognized and result in accounting charges. \nContingencies\n.\n We are involved in a variety of legal matters that arise in the normal course of business. Based on the available information, we evaluate the relevant range and likelihood of potential outcomes and we record the appropriate liability when the amount is deemed probable and reasonably estimable.\nRecent Accounting Pronouncements\nFor a discussion of recent accounting pronouncements, see Note 4: ''Recent Accounting Pronouncements and Other Developments'' in the notes to our audited consolidated financial statements included elsewhere in this Form 10-K.",
  "item2": null
}