{
  "item1": "Despite testing prior release throughout lifecycle product service, cloud, license hardware offerings sometimes contain coding, manufacturing configuration errors can impact function, performance security, result other negative consequences. detection correction any errors released cloud, license hardware offerings can time consuming costly. Errors cloud, license hardware offerings, errors embedded third-party software products services incorporated into own products, can affect ability properly function, integrate operate other cloud, license hardware offerings; result service interruptions, delays outages cloud offerings; create security vulnerabilities products services; delay development release new products services new versions products services; adversely affect market acceptance products services. If experience any these errors, if there delays releasing cloud, license hardware offerings new versions these offerings, sales could affected revenues could decline.",
  "item7": "results operations discussion below, provide overview total consolidated revenues, total consolidated operating expenses total consolidated operating margin, all which presented GAAP basis. also present GAAP-based discussion below substantially all other expense items presented consolidated statements operations not directly attributable three businesses. addition, discuss below results each three businesses—cloud license, hardware services—which operating segments defined pursuant ASC 280, . financial reporting three businesses presented below presented manner consistent used CODMs.",
  "item2": "Item 2. Management’s Discussion Analysis o f Financial Condition Results Operations begin Management’s Discussion Analysis Financial Condition Results Operations overview businesses significant trends. overview followed summary critical accounting estimates believe important understanding significant assumptions judgments incorporated reported financial results. then provide more detailed analysis results operations financial condition."
}