{
  "source_file": "otis-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nBUSINESS OVERVIEW\nBusiness Summary\nWe are the world’s leading elevator and escalator manufacturing, installation and service company. Our Company is organized into two segments, New Equipment and Service. Through our New Equipment segment, we design, manufacture, sell and install a wide range of passenger and freight elevators, as well as escalators and moving walkways for residential and commercial buildings and infrastructure projects. Our New Equipment customers include real-estate and building developers and general contractors who develop and/or design buildings for residential, commercial, retail or mixed-use activity. We sell our New Equipment directly to customers, as well as through agents and distributors.\nThrough our Service segment, we perform maintenance and repair services for both our own products and those of other manufacturers and provide modernization services to upgrade elevators and escalators. Maintenance services include inspections to ensure code compliance, preventive maintenance offerings and other customized maintenance offerings tailored to meet customer needs, as well as repair services to address equipment and component wear and tear and breakdowns. Modernization services enhance equipment operation and improve building functionality. Modernization offerings can range from relatively simple upgrades of interior finishes and aesthetics to complex upgrades of larger components and sub-systems. Our typical Service customers include building owners, facility managers, housing associations and government agencies that operate buildings where elevators and escalators are installed.\nWe serve our customers through a global network of\n e\nmployees. These include sales personnel, field technicians with separate skills in performing installation and service, as well as engineers driving our continued product development and innovation. We function under a centralized operating model whereby we pursue a global strategy set around New Equipment and Service because we seek to grow our maintenance portfolio, in part, through the conversion of new elevator and escalator installations into service contracts. Accordingly, we benefit from an integrated global strategy, which sets priorities and establishes accountability across the full product lifecycle.\nThe current statu\ns of significant factors affecting our business environment in 2025 is discussed below. For additional discussion, refer to the \"Business Overview\" section in Management's Discussion and Analysis of Financial Condition and Results of Operations in our \n2024\n \nForm 10-K\n.\nUpLift\nAnnounced in July 2023, UpLift is a program to transform our operating model. UpLift includes the standardization of our processes and improvement of our supply chain procurement, among other aspects of the program, as well as organizational changes which result in restructuring actions. We expect UpLift to generate approximately $200 million in annual run-rate savings by the second half of 2025, with restructuring and other incremental costs to complete the transformation (\"UpLift transformation costs\") of approximately $300 million.\nUpLift costs incurred in the \nquarters and nine months ended September 30, 2025 and 2024 \nare as follows:\nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nUpLift restructuring costs\n$\n27\n$\n4\n$\n72\n$\n11\nUpLift transformation costs\n10\n18\n51\n45\nTotal UpLift costs\n$\n37\n$\n22\n$\n123\n$\n56\nTotal UpLift costs incurred to date are $260 million, including $128 million of UpLift restructuring costs and $132 million of UpLift transformation costs.\n33\nTable of Contents\nUpLift restructuring costs are primarily severance costs and are recorded primarily in Selling, general and administrative in the Condensed Consolidated Statements of Operations. UpLift transformation costs are primarily for consultants, third-party service providers and personnel focused on designing and implementing a centralized service delivery model that supports our new organizational structure, including the standardization of our supply chain and digital technology procurement. These costs are recorded in Other income (expense), net in the Condensed Consolidated Statements of Operations.\nFor further details, refer to the discussion on restructuring costs in the \"Results of Operations,\" as well as Note 12 to the Condensed Consolidated Financial Statements.\nGerman Tax Litigation\nIn August 2024, we received a favorable ruling regarding a German tax litigation. As a result, we recorded income tax benefits of approximately $185 million and related interest income of approximately $200 million, which were included in Income tax expense (benefit), net and Interest expense (income), net, respectively, in the Consolidated Statements of Operations for the year ended December 31, 2024. Additionally, pursuant to the Tax Matters Agreement (\"TMA\") with UTC, our former parent, subsequently renamed RTX Corporation, and based on the facts and contractual provisions at the time, the Company recorded indemnification expense and payable of $194 million for amounts due to RTX resulting from the outcome of the German tax litigation. This expense was included in Other income (expense), net in the Consolidated Statements of Operations for the year ended December 31, 2024.\nBased on indemnity payments made to RTX and adjustments to indemnity payable in the quarter ended September 30, 2025, the Company now estimates the amount payable to RTX to be $218 million, resulting in indemnification expense of $4 million and $62 million in the quarter and nine months ended September 30, 2025, respectively. This indemnification expense is included in Other income (expense), net in the Condensed Consolidated Statements of Operations for the quarter ended and nine months ended September 30, 2025. This estimate could further change due to the parties' continuing dispute concerning the scope of the final indemnity amount, which will be resolved pursuant to the procedures set forth in the TMA.\nFor further details, refer to Note 11 and Note 16 to the Condensed Consolidated Financial Statements, as well as \nour Consolidated Financial Statements in the \n2024\n \nForm 10-K\n.\nImpact of Global Macroeconomic Conditions on Our Company\nGlobal macroeconomic conditions have impacted, and continue to impact, aspects of the Company's operations and overall financial performance during the quarters and nine months ended September 30, 2025 and 2024. These macroeconomic conditions include, among others, inflationary pressures, high interest rates, tighter credit conditions, \nthe U.S. federal government shutdown a\nnd changes in global \ntrade policies including higher tariffs in the U.S. and other countries. These macroeconomic trends could co\nntinue to impact our business, including impacts to overall financial performance during the remainder of 2025, as a result of the following, among other things:\n•\nHigher costs of products and services due to tariffs;\n•\nCustomer demand impacting our new equipment, maintenance and repair, and modernization businesses;\n•\nCustomer liquidity constraints and related credit reserve;\n•\nCancellations or delays of customer orders; and\n•\nSupplier liquidity, as well as supplier and raw material capacity constraints, delays and related costs.\nOther than the estimated potential impact from new tariffs currently in effect of approximately $25 million to $35 million during 2025, we currently do not expect \nany significant impact to our capital and financial resources from these macroeconomic conditions, including to our overall liquidity position based on our available cash and cash equivalents and our access to credit facilities and the capital markets.\nSee the \"Liquidity and Financial Condition\" section in this Form 10-Q for further detail and Item 1A. \"Risk Factors\" in our \n2024\n \nForm 10-K\n \nfor macroeconomic risks related to our business.\n34\nTable of Contents\nRisks Associated with Ongoing Conflicts\nThe ongoing conflict between Russia and Ukraine has resulted in worldwide geopolitical and macroeconomic uncertainty, including volatile commodity markets, foreign exchange fluctuations, supply chain disruptions, increased risk of cybersecurity incidents, reputational risk, increased operating costs (including fuel and other input costs), environmental, health and safety risks related to securing and maintaining facilities, additional sanctions and other regulations (including restrictions on the transfer of funds to and from Russia). We do not have operations in Russia.\nTo the extent possible, we continue to operate our business in Ukraine, which represented less than 1% of our revenue and operating profit for the nine months ended September 30, 2025 and year ended December 31, 2024.\nAdditionally, we do not have operations or material net sales in Israel or Gaza. Although we have operations in the Middle East and transport products through the Red Sea, we currently do not expect the ongoing instability in that region to have a material impact on our business.\nWe cannot predict how the events described above will evolve. Depending on the ultimate outcomes of these conflicts, which remain uncertain, they could heighten certain risks disclosed in Item 1A. \"Risk Factors\" in our 2024 \nForm 10-K\n, including but not limited to, adverse effects on macroeconomic conditions, including increased inflation, constraints on the availability of commodities, supply chain disruption and decreased business spending; cyber-incidents; disruptions to our or our business partners’ global technology infrastructure, including through cyber-attack or cyber-intrusion; adverse changes in international trade policies and relations; claims, litigation and regulatory enforcement; our ability to implement and execute our business strategy; terrorist activities; our exposure to foreign currency fluctuations; reputational risk; and constraints, volatility, or disruption in the capital markets, any of which could have a material adverse effect on our business, results of operations, cash flows and financial condition.\nCRITICAL ACCOUNTING ESTIMATES\nPreparation of our Condensed Consolidated Financial Statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses. The accounting policies that involve the most significant estimates, assumptions and management judgments used in preparation of the Condensed Consolidated Financial Statements, or are the most sensitive to change due to outside factors, are discussed in the section entitled \"Management's Discussion and Analysis of Financial Condition and Results of Operations – Critical Accounting Estimates\" included in o\nur 2024 \nForm 10-K\n. \nExcept as disclosed in Note 18 to our Condensed Consolidated Financial Statements in this Form 10-Q, pertaining to adoption of new accounting pronouncements, there have been no material changes in these policies.\nRESULTS OF OPERATIONS\nNet Sales\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n3,690\n$\n3,548\n$\n10,635\n \n$\n10,586 \nPercentage change year-over-year\n4\n \n%\n—\n \n%\nThe factors contributing to the total percentage change year-over-year in total Net sales for the quarter and nine months ended September 30, 2025 are as follows:\nComponents of Net sales change:\nQuarter Ended September 30, 2025\nNine Months Ended September 30, 2025\nOrganic volume \n2\n \n%\n—\n \n%\nForeign currency translation\n2\n \n%\n—\n \n%\nAcquisitions and divestitures, net and other\n—\n \n%\n—\n \n%\nTotal % change\n4\n \n%\n—\n \n%\n35\nTable of Contents\nThe Organic volume increase of 2% for the quarter ended September 30, 2025 was driven by an increase of 6% in Service, partially offset by a decrease of (5)% in New Equipment. The Organic volume for the nine months ended September 30, 2025 was flat driven by an increase of 5% in Service, offset by a decrease of (8)% in New Equipment.\nSee the \"Segment Review\" section for a discussion of Net sales by segment.\nCost of Products and Services Sold\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nTotal cost of products and services sold\n$\n2,557\n$\n2,470\n$\n7,412\n$\n7,401\nPercentage change year-over-year\n4\n \n%\n—\n \n%\nThe factors contributing to the percentage change year-over-year for the quarter and nine months ended September 30, 2025 in total cost of products and services sold are as follows:\nComponents of Cost of Products and Services Sold change:\nQuarter Ended September 30, 2025\nNine Months Ended September 30, 2025\nOrganic volume \n1\n \n%\n—\n \n%\nForeign currency translation\n2\n \n%\n—\n \n%\nAcquisitions and divestitures, net and other\n1\n \n%\n—\n \n%\nTotal % change\n4\n \n%\n—\n \n%\nThe Organic volume for total cost of products and services sold increased 1% for the quarter ended September 30, 2025 and was flat for the nine months ended September 30, 2025, primarily driven by the organic sales changes noted above. Productivity was partially offset by inflationary pressures, including higher labor costs.\nGross Margin\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nGross margin\n$\n1,133\n \n$\n1,078 \n$\n3,223\n \n$\n3,185 \nGross margin percentage\n30.7\n \n%\n30.4 \n%\n30.3\n \n%\n30.1 \n%\nGross margin percentage increased 30 and 20 basis points for the quarter and nine months ended September 30, 2025, respectively, when compared to the same periods in 2024, due to the increase in Service sales and decrease in New Equipment sales and the benefits from productivity, partially offset by the inflationary pressures described above. \nSee the \"Segment Review\" section below for discussion of operating results by segment. \nResearch and Development\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nResearch and development\n$\n36\n \n$\n40 \n$\n111\n \n$\n115 \nPercentage of Net sales\n1.0\n \n%\n1.1 \n%\n1.0\n \n%\n1.1 \n%\nResearch and development was relatively flat for the quarter and nine months ended September 30, 2025, when compared to the same periods in 2024.\n36\nTable of Contents\nSelling, General and Administrative\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nSelling, general and administrative\n$\n504\n \n$\n455 \n$\n1,467\n \n$\n1,366 \nPercentage of Net sales\n13.7\n \n%\n12.8 \n%\n13.8\n \n%\n12.9 \n%\nSelling, general and administrative expenses increased $49 million and $101 million for the quarter and nine months ended September 30, 2025, respectively, when compared to the same periods in 2024, driven by higher restructuring costs, annual wage increases, other employment costs and the impacts from foreign exchange, partially offset by savings resulting from UpLift. \nSelling, general and administrative expenses as a percentage of Net sales increased 90 basis points for the quarter and nine months ended September 30, 2025, when compared to the same periods in 2024.\nRestructuring Costs\n \nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nUpLift restructuring \n$\n72\n$\n11\nOther restructuring \n41\n29\nTotal restructuring costs\n$\n113\n$\n40\nWe initiate restructuring actions to keep our cost structure competitive. Charges generally arise from severance related to workforce reductions and, to a lesser degree, facility exit and lease termination costs associated with the consolidation of office and manufacturing operations. We continue to closely monitor the economic environment and may undertake further restructuring actions to keep our cost structure aligned with the demands of the prevailing market conditions. \nUpLift restructuring costs were $72 million and $11 million in the nine months ended September 30, 2025 and 2024, respectively. We also incurred $51 million and $45 million of UpLift transformation costs in the nine months ended September 30, 2025 and 2024, respectively, which are primarily for consultants, third-party service providers and personnel focused on designing and implementing a centralized service delivery model that supports our new organizational structure, including the standardization of our supply chain and digital technology procurement. These UpLift transformation costs are recorded in Other income (expense), net in the Condensed Consolidated Statements of Operations.\nOther restructuring costs were $41 million for the nine months ended September 30, 2025 and included $25 million of costs related to 2025 actions and $16 million of costs related to 2024 actions. \nMost of the expected charges will require cash payments, which we have funded and expect to continue to fund with cash generated from operations. The table below presents approximate cash outflows related to the restructuring actions during the nine months ended September 30, 2025, and the expected cash payments to complete the actions announced:\n(dollars in millions)\nUpLift Actions\nOther Actions\nTotal Restructuring\nCash outflows during the nine months ended September 30, 2025\n$\n28\n \n$\n38\n \n$\n66\n \nExpected cash payments remaining to complete actions announced\n76\n \n56\n \n132\n \nThe approved UpLift restructuring actions are expected to generate approximately $102 million in annual recurring savings by 2025, primarily in Selling, general and administrative expenses, and of which approximately $63 million was realized during the nine months ended September 30, 2025, including $37 million of incremental savings compared to the same period in 2024.\n37\nTable of Contents\nFor other restructuring actions, we generally expect to achieve annual recurring savings within the two-year period subsequent to initiating the actions, including $24 million for the 2025 actions and $28 million for the 2024 actions, of which approximately 60% relates to Cost of products and services sold and 40% relates to Selling, general and administrative expenses. Approximately $30 million of savings was realized for the 2025 and 2024 actions during the nine months ended September 30, 2025.\nReorganization of Operations in China\nIn January 2025, we announced the reorganization of our operations in China. Among other aspects, this reorganization will result in restructuring actions of approximately $40 million. These actions primarily include severance-related costs, and we expect these actions to be mostly completed and any cash to be paid by the end of 2025. Amounts related to the reorganization of operations in China are included within Other restructuring.\nFor additional discussion of restructuring, see Note 12 to the Condensed Consolidated Financial Statements.\nOther Income (Expense), Net\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nOther income (expense), net\n$\n(7)\n$\n(220)\n$\n(101)\n$\n(227)\nThe change in Other income (expense), net of $213 million for the quarter ended September 30, 2025 compared to the same period in 2024, was primarily driven by lower Separation-related adjustments of $190 million, the absence of $18 million of impairment loss related to net assets held for sale and lower UpLift transformation costs of $8 million, partially offset by unfavorable foreign currency mark-to market adjustments.\nThe change in Other income (expense), net of $126 million for the nine months ended September 30, 2025 compared to the same period in 2024, was primarily driven by lower Separation-related adjustments of $113 million, gains on the sale of fixed assets of $15 million, lower impairment loss related to net assets held for sale of $7 million and favorable foreign currency mark-to-market adjustments, partially offset by higher UpLift transformation costs of $6 million.\nFor additional discussion of the Separation-related adjustments, litigation-related settlement costs and held for sale impairment, see Note 17 to the Condensed Consolidated Financial Statements. For additional discussion of the restructuring and UpLift transformation costs, see Note 12 to the Condensed Consolidated Financial Statements.\nInterest Expense (Income), Net\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nInterest expense (income), net\n$\n61\n$\n(150)\n$\n132\n$\n(79)\nThe changes in Interest expense (income), net of $211 million for the quarter and nine months ended September 30, 2025, compared to the same periods in 2024, were primarily driven by the absence of $200 million interest income related to a favorable ruling received in August 2024 regarding a tax litigation in Germany, higher interest expense related to the $600 million and €850 million unsecured, unsubordinated debt issued in November 2024, as well as the $500 million unsecured, unsubordinated debt issued in September 2025, partially offset by lower interest expense related to the repayment of the $1.3 billion unsecured, unsubordinated debt in April 2025. The nine months ended September 30, 2025 was also impacted by interest reserve adjustments related to non-recurring tax items and higher interest income when compared to the same period in 2024.\nThe average interest rate on our long-term debt was 2.9% and 2.8% for the quarter and nine months ended September 30, 2025, respectively and 2.5% for the same periods in 2024. For additional discussion of borrowings, see Note 7 to the Condensed Consolidated Financial Statements.\n38\nTable of Contents\nIncome Taxes\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nEffective tax rate\n24.8\n \n%\n(8.8)\n%\n23.9\n \n%\n11.2 \n%\nThe increase in the effective tax rate for the quarter and nine months ended September 30, 2025, compared to the same periods in 2024, is primarily due to the absence of estimated tax benefits arising from the resolution of the German tax litigation recorded in 2024. In addition to the German tax litigation, the increase in the effective tax rate for the nine months ended September 30, 2025, compared to the same period in 2024, is due to the tax effect of the increase in our estimated nondeductible TMA indemnity obligation payable to RTX recorded in 2025 and the absence of the reduction in a deferred tax liability related to the mitigation of future repatriation costs recorded in 2024. These impacts were partially offset by an incremental benefit related to foreign-derived intangible income and foreign valuation allowance releases recorded in 2025.\nWe anticipate some variability in the tax rate quarter to quarter from potential discrete items.\nFor additional discussion of income taxes and the effective income tax rate, see Note 11 to the Condensed Consolidated Financial Statements.\nNoncontrolling Interest in Subsidiaries' Earnings and Net Income Attributable to Otis Worldwide Corporation\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nNoncontrolling interest in subsidiaries' earnings\n$\n18\n$\n17\n$\n61\n$\n73\nNet income attributable to Otis Worldwide Corporation\n$\n374\n$\n540\n$\n1,010\n$\n1,308\nNoncontrolling interest in subsidiaries' earnings was relatively flat for the quarter ended September 30, 2025 compared to the same period in 2024. \nNoncontrolling interest in subsidiaries' earnings decreased $12 million for the nine months ended September 30, 2025, compared to the same period in 2024, primarily driven by increased ownership of our subsidiary in Japan during the second quarter of 2024 and lower net income from non-wholly owned subsidiaries. Other than our acquisition of the noncontrolling shares of our subsidiary in Japan during 2024, ownership interest in the underlying non-wholly owned subsidiaries has remained generally consistent year-over-year. \nNet income attributable to Otis Worldwide Corporation decreased for the quarter and nine months ended September 30, 2025, compared to the same periods in 2024, due to a higher effective tax rate and higher interest expense, partially offset by higher operating profit (including the impact of foreign exchange rates). The nine months ended September 30, 2025 was also impacted by lower noncontrolling interest in subsidiaries' earnings, when compared to the same period in 2024.\n \n39\nTable of Contents\nSegment Review\nSummary performance for our operating segments, reconciled to total operating profit, for the quarters ended September 30, 2025 and 2024 was as follows:\nNet Sales\nOperating Profit\nOperating Profit Margin\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025\n2024\nNew Equipment\n$\n1,257\n \n$\n1,309 \n$\n59\n \n$\n84 \n4.7%\n6.4%\nService\n2,433\n \n2,239 \n621\n \n555 \n25.5%\n24.8%\nTotal segment\n$\n3,690\n \n$\n3,548 \n680\n \n639 \n18.4%\n18.0%\nCorporate and Unallocated\nGeneral corporate expenses and other\n48\n \n40 \nUpLift restructuring\n27\n \n4 \nOther restructuring\n6\n \n5 \nUpLift transformation costs\n10\n \n18 \nSeparation-related adjustments\n4\n \n193 \nHeld for sale impairment\n—\n \n18 \nOther, net\n(1)\n(2)\nConsolidated Operating Profit\n$\n586\n \n$\n363 \n15.9%\n10.2%\nSummary performance for our operating segments, reconciled to total operating profit, for the nine months ended September 30, 2025 and 2024 was as follows:\nNet Sales\nOperating Profit\nOperating Profit Margin\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025\n2024\nNew Equipment\n$\n3,696\n \n$\n4,010 \n$\n193\n \n$\n265 \n5.2%\n6.6%\nService\n6,939\n \n6,576 \n1,736\n \n1,616 \n25.0%\n24.6%\nTotal segment\n$\n10,635\n \n$\n10,586 \n1,929\n \n1,881 \n18.1%\n17.8%\nCorporate and Unallocated\nGeneral corporate expenses and other\n125\n \n108 \nUpLift restructuring\n72\n \n11 \nOther restructuring\n41\n \n29 \nUpLift transformation costs\n51\n \n45 \nSeparation-related adjustments\n65\n \n177 \nLitigation-related settlement costs\n21\n \n18 \nHeld for sale impairment\n10\n \n18 \nOther, net\n—\n \n(2)\nConsolidated Operating Profit\n$\n1,544\n \n$\n1,477 \n14.5%\n14.0%\n40\nTable of Contents\nNew Equipment\nThe New Equipment segment designs, manufactures, sells and installs a wide range of passenger and freight elevators, as well as escalators and moving walkways in residential and commercial buildings and infrastructure projects. Our New Equipment customers include real-estate and building develop\ners an\nd general contractors who develop and/or design buildings for residential, infrastructure, commercial, retail or mixed-use activity. We sell directly to customers as well as through agents and distributors. We also sell New Equipment to government agencies to support infrastructure projects, such as airports, railways or metros.\nSummary performance for New Equipment for the quarters and nine months ended September 30, 2025 and 2024 was as follows:\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\nNet sales\n$\n1,257\n$\n1,309\n$\n(52)\n(4)%\n$\n3,696\n$\n4,010\n$\n(314)\n(8)%\nCost of sales\n1,053\n1,088\n(35)\n(3)%\n3,076\n3,317\n(241)\n(7)%\n204\n221\n(17)\n(8)%\n620\n693\n(73)\n(11)%\nOperating expenses\n145\n137\n8 \n6%\n427\n428\n(1)\n—%\nOperating profit\n$\n59\n$\n84\n$\n(25)\n(30)%\n$\n193\n$\n265\n$\n(72)\n(27)%\nOperating profit margin\n4.7\n \n%\n6.4 \n%\n5.2\n \n%\n6.6 \n%\nSummary analysis of the Net sales change for New Equipment for the quarter and nine months ended September 30, 2025 compared with the \nsame periods in 2024\n was as follows:\nComponents of Net sales change:\nQuarter Ended September 30, 2025\nNine Months Ended September 30, 2025\nOrganic volume \n(5)\n%\n(8)\n%\nForeign currency translation\n1\n \n%\n—\n \n%\nAcquisitions and divestitures, net and other\n—\n \n%\n—\n \n%\nTotal % change\n(4)\n%\n(8)\n%\nQuarter Ended September 30, 2025\nNet sales\nThe organic sales decrease of (5)% was primarily driven by an approximately (20)% decline in China and high single-digit decline in Americas, partially offset by high single-digit growth in Asia Pacific and low single-digit growth in EMEA.\nOperating profit\nNew Equipment operating profit decreased $(25) million. The impacts of lower volume, unfavorable price and tariff headwinds, and regional and product mix were partially offset by productivity, including the benefits of restructuring actions. Operating margin decreased (170) basis points.\n41\nTable of Contents\nNine Months Ended September 30, 2025\nNet sales\nThe organic sales decrease of (8)% was primarily driven by a greater than (20)% decline in China and high single-digit decline in Americas, partially offset by mid single-digit growth in EMEA and Asia Pacific.\nOperating profit\nNew Equipment operating profit decreased $(72) million. The impacts of lower volume, unfavorable price and tariff headwinds, and regional and product mix were partially offset by productivity, including the benefits of restructuring actions. Operating margin decreased (140) basis points.\nService\nThe Service segment performs maintenance and repair services for both our products, and those of other manufacturers, and provides modernization services to upgrade elevators and escalators. Maintenance services include inspections to ensure code compliance, preventive maintenance offerings and other customized maintenance offerings tailored to meet customer needs, as well as repair services that address equipment and component wear and tear, and breakdowns. Modernization services enhance equipment operation and improve building functionality. Modernization offerings can range from relatively simple upgrades of interior finishes and aesthetics, to complex upgrades of larger components and sub-systems. Our typical Service customers include building owners, facility managers, housing associations and government agencies that operate buildings where elevators and escalators are installed.\nSummary performance for Service for the \nquarters and nine months ended September 30, 2025 and 2024\n was as follows:\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nChange\nChange\n2025\n2024\nChange\nChange\nNet sales\n$\n2,433\n$\n2,239\n$\n194 \n9 \n%\n$\n6,939\n$\n6,576\n$\n363 \n6 \n%\nCost of sales\n1,494\n1,379\n115 \n8 \n%\n4,297\n4,070\n227 \n6 \n%\n939\n860\n79 \n9 \n%\n2,642\n2,506\n136 \n5 \n%\nOperating expenses\n318\n305\n13 \n4 \n%\n906\n890\n16 \n2 \n%\nOperating profit\n$\n621\n$\n555\n$\n66 \n12 \n%\n$\n1,736\n$\n1,616\n$\n120 \n7 \n%\nOperating profit margin\n25.5\n \n%\n24.8 \n%\n25.0\n \n%\n24.6 \n%\nSummary analysis of Service Net sales change for the quarter and nine months ended September 30, 2025 compared with the \nsame periods in 2024\n was as follows:\nComponents of Net sales change:\nQuarter Ended September 30, 2025\nNine Months Ended September 30, 2025\nOrganic volume \n6\n \n%\n5\n \n%\nForeign currency translation\n2\n \n%\n—\n \n%\nAcquisitions and divestitures, net and other\n1\n \n%\n1\n \n%\nTotal % change\n9\n \n%\n6\n \n%\n42\nTable of Contents\nQuarter Ended September 30, 2025\nNet sales\nThe organic sales increase of 6% is due to increases in maintenance and repair of 4% and in modernization of 14%.\nComponents of Net sales change:\nMaintenance and Repair\nModernization\nOrganic volume \n4\n \n%\n14\n \n%\nForeign currency translation\n3\n \n%\n1\n \n%\nAcquisitions and divestitures, net and other\n—\n \n%\n1\n \n%\nTotal % change\n7\n \n%\n16\n \n%\nOperating profit\nService operating profit increased $66 million including foreign exchange tailwinds of $17 million. Higher volume, improved pricing and productivity, were partially offset by inflationary pressures including higher labor costs, and mix. Operating margin increased 70 basis points.\nNine Months Ended September 30, 2025\nNet sales\nThe organic sales increase of 5% is due to increases in maintenance and repair of 4% and in modernization of 9%.\nComponents of Net sales change:\nMaintenance and Repair\nModernization\nOrganic volume \n4\n \n%\n9\n \n%\nForeign currency translation\n1\n \n%\n—\n \n%\nAcquisitions and divestitures, net and other\n—\n \n%\n1\n \n%\nTotal % change\n5\n \n%\n10\n \n%\nOperating profit\nService operating profit increased $120 million including foreign exchange tailwinds of $16 million. Higher volume, improved pricing and productivity, were partially offset by inflationary pressures including higher labor costs, and mix. Operating margin increased 40 basis points. \n43\nTable of Contents\nCorporate and Unallocated\nQuarter Ended September 30,\nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nGeneral corporate expenses and other\n$\n48\n \n$\n40 \n$\n125\n \n$\n108 \nUpLift restructuring\n27\n \n4 \n72\n \n11 \nOther restructuring\n6\n \n5 \n41\n \n29 \nUpLift transformation costs\n10\n \n18 \n51\n \n45 \nSeparation-related adjustments\n4\n \n193 \n65\n \n177 \nLitigation-related settlement costs\n—\n \n— \n21\n \n18 \nHeld for sale impairment\n—\n \n18 \n10\n \n18 \nOther, net\n(1)\n(2)\n—\n \n(2)\nTotal Corporate and Unallocated\n$\n94\n \n$\n276 \n$\n385\n \n$\n404 \nGeneral corporate expenses and other increased $8 million for the quarter ended September 30, 2025 compared to the same period in 2024, primarily due to higher corporate costs and foreign currency mark-to-market adjustments.\nGeneral corporate expenses and other increased $17 million for the nine months ended September 30, 2025 compared to the same period in 2024, primarily due to higher corporate costs, partially offset by foreign currency mark-to-market adjustments and gains on the sale of fixed assets.\nFor additional discussion of the Separation-related adjustments, litigation-related settlement costs and held for sale impairment, see Note 17 to the Condensed Consolidated Financial Statements. For additional discussion of the restructuring and UpLift transformation costs, see Note 12 to the Condensed Consolidated Financial Statements.\nLIQUIDITY AND FINANCIAL CONDITION\nWe expect to fund our ongoing operating, investing and financing requirements mainly through cash flows from operations, available liquidity through cash on hand and available bank lines of credit and access to capital markets. \nAs of September 30, 2025, we had cash and cash equivalents of $840 million, of which approximately 97% was held by the Company's foreign subsidiaries. We manage our worldwide cash requirements by reviewing available funds among the many subsidiaries through which we conduct our business and the cost-effectiveness with which those funds can be accessed. On occasion, we are required to maintain cash deposits with certain banks with respect to contractual obligations related to acquisitions and divestitures or other legal obligations. As of September 30, 2025 and December 31, 2024, the amount of such restricted cash was $13 million and $21 million, respectively.\nFrom time-to-time we may need to access the capital markets to obtain financing. We may incur indebtedness or issue equity as needed. Although we believe that the arrangements in place as of September 30, 2025 permit us to finance our operations on acceptable terms and conditions, our access to, and the availability of, financing on acceptable terms and conditions in the future could be impacted by many factors, including (1) our credit ratings or absence of a credit rating, (2) the liquidity of the overall capital markets and (3) the current state of the economy, including tighter credit conditions. There can be no assurance that we will continue to have access to the capital markets on terms acceptable to us.\n44\nTable of Contents\nThe following table contains several key measures of our financial condition and liquidity:\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nCash and cash equivalents\n$\n840\n \n$\n2,300 \nTotal debt\n8,084\n \n8,324 \nNet debt (total debt less cash and cash equivalents)\n7,244\n \n6,024 \nTotal equity\n(5,353)\n(4,785)\nTotal capitalization (total debt plus total equity)\n2,731\n \n3,539 \nNet capitalization (total debt plus total equity less cash and cash equivalents)\n1,891\n \n1,239 \nTotal debt to total capitalization\n296\n \n%\n235 \n%\nNet debt to net capitalization\n383\n \n%\n486 \n%\nThe Company does not intend to reinvest certain undistributed earnings of our international subsidiaries that have been previously taxed in the U.S. For the remainder of the Company’s undistributed international earnings, unless tax effective to repatriate, we will continue to permanently reinvest these earnings.\nBorrowings and Lines of Credit\nAs of \nSeptember 30, 2025\n, we had a revolving credit agreement with various banks providing for a \n$1.5 billion unsecured, unsubordinated five-year revolving credit facility. As of September 30, 2025, there were no borrowings under the revolving credit agreement. The undrawn portion of the revolving credit agreement serves as a backstop for the issuance of commercial paper.\nAs of September 30, 2025, there were $224 million borrowings outstanding under the Company's $1.5 billion commercial paper program, including, €135 million of Euro denominated commercial paper. For additional discussion of borrowings, see Note 7 to the Condensed Consolidated Financial Statements.\nOn April 7, 2025, the Company repaid its $1.3 billion principal amount of 2.056% notes due in 2025, upon maturity, using cash on hand and commercial paper borrowings.\nOn September 4, 2025, the Company issued $500 million principal amount of 5.131% notes due in 2035. A portion of the proceeds will be used to fund the repayment at maturity of the Company's currently outstanding $144 million 2026 Yen Notes. The remainder of the proceeds were used to fund the repayment of certain of our commercial paper borrowings.\nShare Repurchase Program\nOn January 16, 2025, our Board of Directors revoked any remaining share repurchase authority under the prior share repurchase program and approved a new share repurchase program for up to $2.0 billion of Common Stock, of which approximately $1.3 billion was remaining as of September 30, 2025. \nUnder this program, shares may be purchased on the open market, in privately negotiated transactions, under accelerated share repurchase programs or under plans complying with rules 10b5-1 and 10b-18 under the Securities Exchange Act of 1934, as amended.\n45\nTable of Contents\nDiscussion of Cash Flows\nThe following table reflects the major categories of cash flows. For additional details, see the Condensed Consolidated Statements of Cash Flows.\n \nNine Months Ended September 30,\n(dollars in millions)\n2025\n2024\nNet cash flows provided by (used in):\nOperating activities\n$\n779\n \n$\n873 \nInvesting activities\n(376)\n(210)\nFinancing activities\n(1,890)\n(1,102)\nEffect of exchange rate changes on cash and cash equivalents\n19\n \n(9)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n$\n(1,468)\n$\n(448)\nOperating activities\nCash flows from operating activities primarily represent inflows and outflows associated with our operations. Primary activities include net income from operations adjusted for non-cash transactions, working capital changes and changes in other assets and liabilities. \nThe year-over-year decrease in net cash provided by operating activities was primarily driven by working capital balances during the periods, including a larger increase in Accounts receivable, net, in the nine months ended September 30, 2025 compared to the same period in 2024, due to timing of billings and collections and a larger decrease in Accounts payable in the nine months ended September 30, 2025 compared to the same period in 2024, due to timing of payments to suppliers, partially offset by the decrease in Other current assets due to the refunds received in 2025 from the German tax litigation. Additionally, Separation-related and UpLift-related net payments were approximately $92 million and $77 million, respectively, in the nine months ended September 30, 2025, compared to approximately $49 million and $54 million, respectively, in the same period in 2024. \nDuring the nine months ended September 30, 2025, net cash provided by operating activities was $779 million. Net income of $1.1 billion includes $62 million of indemnification expense resulting from the German tax litigation and $10 million of impairment loss related to net assets held for sale, none of which resulted in cash flow activity during the nine months ended September 30, 2025. Net income and the decrease in Other current assets due to refunds received in 2025 from the German tax litigation were also partially offset by a decrease in Accounts payable due to timing of payments to suppliers and an increase in Accounts receivable, net, due to timing of billings and collections. For additional discussion of the German tax litigation, see Note 1 and Note 16 to the Condensed Consolidated Financial Statements.\nDuring the nine months ended September 30, 2024, net cash provided by operating activities was $873 million. Net income of $1.4 billion includes $185 million of income tax benefits, $200 million of interest income and $194 million of indemnification expense resulting from the outcome of the German tax litigation during the third quarter of 2024, none of which resulted in cash flow activity during the nine months ended September 30, 2024. Net income was also partially offset by a decrease in Accounts payable due to the timing of payments to suppliers, an increase in Accounts receivable, net, due to the timing of billings and collections, a decrease in Accrued liabilities and an increase in Other current assets due to the timing of payments, including employee-related benefits, income taxes and supplier payments.\nInvesting activities\nCash flows from investing activities primarily represent inflows and outflows associated with long-term assets, including capital expenditures, investments in businesses and securities, proceeds from the sale of fixed assets and the settlement of derivative contracts. \nDuring the nine months ended September 30, 2025, net cash used in investing activities was $376 million. The primary drivers of the outflow related to $211 million of net cash payments from the settlement of derivative instruments, $107 million of capital expenditures and $92 million of acquisitions of businesses and intangible assets. These were partially offset by $35 million of net proceeds from the sale of fixed assets.\n46\nTable of Contents\nDuring the nine months ended September 30, 2024, net cash used in investing activities was $210 million. The primary drivers of the outflow related to $87 million of capital expenditures, $70 million of acquisitions of businesses and intangible assets and $47 million of net cash payments from the settlement of derivative instruments.\nAs discussed in Note 13 to the Condensed Consolidated Financial Statements, we enter into derivative instruments for risk management purposes. We operate internationally and, in the normal course of business, are exposed to fluctuations in interest rates, foreign exchange rates and commodity prices. These fluctuations can increase the costs of financing, investing and operating the business. We use derivative instruments, including forward contracts and options to manage certain foreign currency and commodity price exposures.\nFinancing activities\nCash flows from financing activities primarily represent inflows and outflows associated with equity and borrowings. Primary activities include short-term and long-term borrowing activity, paying dividends to shareholders, the repurchase of our Common Stock and dividends or other payments to noncontrolling interests. \nDuring the nine months ended September 30, 2025, net cash used in financing activities was $1.9 billion. The primary drivers of the outflow were repayments of long-term debt of $1.3 billion, repurchases of our Common Stock of $809 million and dividends paid on our Common Stock of $483 million. These were partially offset by the proceeds from the long-term debt issuance of $500 million and short-term borrowings of $280 million.\nDuring the nine months ended September 30, 2024, net cash used in financing activities was $1.1 billion. The primary drivers of the outflow were repurchases of our Common Stock of $800 million, dividends paid on our Common Stock and to noncontrolling shareholders of $450 million and $81 million, respectively, and acquisitions of noncontrolling interest shares of $75 million, including approximately $70 million for our subsidiary in Japan. These were partially offset by short-term borrowings of $325 million.\n47\nTable of Contents\nGuaranteed Securities: Summarized Financial Information\nThe following information is provided in compliance with Rule 13-01 of Regulation S-X under the Securities Exchange Act of 1934, as amended, with respect to the 2026 Euro Notes, the 2027 Euro Notes and the 2031 Euro Notes (together the \"Euro Notes\"), in each case issued by Highland Holdings S.à r.l. (\"Highland\"), a private limited liability company (\nsociété à responsabilité limitée\n) incorporated and existing under the laws of the Grand Duchy of Luxembourg (\"Luxembourg\"). The Euro Notes are fully and unconditionally guaranteed by Otis Worldwide Corporation (\"OWC\") on an unsecured, unsubordinated basis. Refer to \"Note 9: Borrowings and Lines of Credit\" in Item 8 in\n our \n2024 \nForm 10-K\n,\n for additional information.\nHighland is a wholly-owned, indirect consolidated subsidiary of OWC. OWC is incorporated under the laws of Delaware. As a company incorporated and existing under the laws of Luxembourg, and with its registered office in Luxembourg, Highland is subject to Luxembourg insolvency and bankruptcy laws in the event any insolvency proceedings are initiated against it. Luxembourg bankruptcy law is significantly different from, and may be less favorable to creditors than, the bankruptcy law in effect in the United States and may make it more difficult for creditors to recover the amount they could expect to recover in liquidation under U.S. insolvency and bankruptcy rules.\nThe Euro Notes are not guaranteed by any of OWC's or Highland's subsidiaries (all OWC subsidiaries other than Highland are referred to herein as \"non-guarantor subsidiaries\"). Holders of the Euro Notes will have a direct claim only against Highland, as issuer, and OWC, as guarantor.\nThe following tables set forth the summarized financial information as of and for the nine months ended September 30, 2025 and as of December 31, 2024 of each of OWC and Highland on a standalone basis, which does not include the consolidated impact of the assets, liabilities, and financial results of their subsidiaries except as noted on the tables below, nor does it include any impact of intercompany eliminations as there were no intercompany transactions between OWC and Highland. This summarized financial information is not intended to present the financial position or results of operations of OWC or Highland in accordance with U.S. GAAP.\n(dollars in millions)\nNine Months Ended September 30, 2025\nOWC Statement of Operations - Standalone and Unconsolidated\nRevenue\n$\n—\n \nCost of revenue\n—\n \nOperating expenses\n10\n \nIncome from consolidated subsidiaries\n—\n \nIncome (loss) from operations excluding income from consolidated subsidiaries\n(80)\nNet income (loss) excluding income from consolidated subsidiaries\n(183)\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nOWC Balance Sheet - Standalone and Unconsolidated\nCurrent assets (intercompany receivables from non-guarantor subsidiaries)\n$\n—\n \n$\n— \nCurrent assets (excluding intercompany receivables from non-guarantor subsidiaries)\n96\n \n1,490 \nNoncurrent assets (investments in consolidated subsidiaries)\n1,099\n \n1,151 \nNoncurrent assets (excluding investments in consolidated subsidiaries)\n39\n \n37 \nCurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n6,878\n \n6,277 \nCurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n703\n \n1,625 \nNoncurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n—\n \n— \nNoncurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n5,407\n \n5,100 \n48\nTable of Contents\n(dollars in millions)\nNine Months Ended September 30, 2025\nHighland Statement of Operations - Standalone and Unconsolidated\nRevenue\n$\n—\n \nCost of revenue\n—\n \nOperating expenses\n—\n \nIncome from consolidated subsidiaries\n499\n \nIncome (loss) from operations excluding income from consolidated subsidiaries\n—\n \nNet income (loss) excluding income from consolidated subsidiaries\n(182)\n(dollars in millions)\nSeptember 30, 2025\nDecember 31, 2024\nHighland Balance Sheet - Standalone and Unconsolidated\nCurrent assets (intercompany receivables from non-guarantor subsidiaries)\n$\n19\n \n$\n— \nCurrent assets (excluding intercompany receivables from non-guarantor subsidiaries)\n—\n \n— \nNoncurrent assets (investments in consolidated subsidiaries)\n15,711\n \n15,711 \nNoncurrent assets (intercompany receivables from non-guarantor subsidiaries)\n468\n \n460 \nNoncurrent assets (excluding investments in consolidated subsidiaries)\n—\n \n— \nCurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n—\n \n— \nCurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n31\n \n4 \nCurrent liabilities (intercompany payables from non-guarantor subsidiaries)\n3\n \n9 \nNoncurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n4,104\n \n3,513 \nNoncurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n2,270\n \n2,017 \nOff-Balance Sheet Arrangements and Contractual Obligations\nItem 5 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our \n2024 \nForm 10-K\n discloses our off-balance sheet arrangements and contractual obligations. \nAs of September 30, 2025, there have been no material changes to these off-balance sheet arrangements and contractual obligations, outside the ordinary course of business except for those disclosed in \"Note 7, Borrowings and Lines of Credit\" within Item 1 of this Form 10-Q."
}