{
  "source_file": "otis-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOur Company\nOtis is t\nhe world’s leading elevator and escalator manufacturing, installation and service company. We serve customers in ov\ner 200 countries and territories around t\nhe world. \nOtis has global scale and local focus, with more than 1,400 branc\nhes and offices, and a direct physical presence in more than 70\n co\nuntries. \nThe following description of our busin\ness should be read in conjunction with Item 7 in this Form 10-K, including \nthe information contained therein under the heading \"Business Overview.\"\nDescription of Business by Segment\nOur Company is organized into two segments, New Equipment and Service, which, for 2024, contributed 38% and 62% of our net sales, and 13% and 87% of our segment operating profit, respectively. Our international operations represented \nappro\nximately 70% of our net sales for 2024.\nNew Equipment\nThrough our New Equipment segment, we design, manufacture, sell and install a wide range of passenger and freight elevators, as well as escalators and moving \nwalkways for residential, commercial and infrastructure projects.\nOur New Equipment customers include real estate and building developers and general contractors who develop and/or design buildings for residential, commercial, retail or mixed-use activity. We also sell New Equipment to government agencies, particularly, to support infrastructure projects, such as airports, railways or metros. We generally sell directly to our customers through our New Equipment sales personnel. Due to the nature of the customer base in China and certain other geographies, our direct sales force is augmented by agents and distributors. Given the breadth of our customer base and the large number of customers to whom we deliver new equipment on an annual basis, we are not dependent on any single customer and do not have any contracts material to Otis as a whole with any single customer. The same is true for our broad and geographically dispersed network of agents and distributors.\nNew Equipment customers typically engage with us at an early stage during the construction cycle. The timing of order placement depends on factors including project complexity and customer requirements. Elevator installation usually occurs midway through building construction.\nNew Equipment orders are generally delivered w\nithin 12 months of booking, although larger projects can take longer to deliver based on customer construction schedules, and in some regions, mostly in China, the order to delivery window is shorter. \nWhen placing New Equipment orders, customers typically make an advance payment to cover costs including design and contract engineering. These advance payments are typically followed by periodic progress payments at specified milestones, such as delivery of materials at the job site and completion of installation and equipment commissioning. Installation is carried out by our installation technicians or through subcontractors, in which case we typically complete the final inspection and commissioning to ensure that our quality standards are met. Revenues are recognized based on percentage of completion. Once commissioned, New Equipment units are typically supported by a warranty for a limited period of time. \nWe have developed a range of elevator and escalator solutions to meet the varying needs and objectives of our diverse customers, primarily centered around the following elevator platforms: \nGen2\n, \nGen3\n, \nGen360\n and \nSkyRise\n. Our primary elevator and escalator solutions are described below.\n1\nTable of Contents\nGen2\nHistorically, Gen2 is our principal low-and mid-rise elevator solution. Since its launch in 2000, we have sold over one million units, making it our best-selling elevator platform.\nGen3\nThe successor to the Gen2 family of elevators, the Gen3 platform enhances the space-saving, energy-efficient design of the Gen2 elevator with the connectivity of the Otis ONE IoT (internet of things) digital service platform, while offering additional safety features for passengers and our colleagues who maintain the elevator. \nIn 2023, we introduced the new Gen3 Core elevator in North America, which was designed specifically for low-rise buildings, bringing passengers connectivity, style, and comfort. The Gen3 Core helps minimize energy consumption, material usage and installation costs.\nGen360\nInitially launched in Europe, we expanded the Gen360 platform into China in 2023. The Gen360 elevator frees hoistway space to accommodate larger cabins and features a new electronic architecture, with many mechanical components replaced by electronic components that, when combined with our service, increase reliability and reduce the potential for entrapments. A foldable, in-ceiling platform allows maintenance operations to be performed safely from within the car rather than on top of it and, depending on local regulations, eliminates the need for a refuge space above the car and the protrusion on the roof allowing for a flat roof design. With optional 360-degree cameras in the hoistway, Otis service teams can visually confirm, fine-tune, diagnose and solve many issues remotely without stopping the elevator. The Otis ONE IoT solution adds a network of sensors for real-time status updates.\nSkyRise High-Rise\nFor taller, high-rise buildings, the SkyRise advanced elevator platform combines cutting-edge technologies and precision engineering to deliver solutions for residential, commercial and mixed-use skyscrapers.\nEscalators and Moving Walkways\nIn addition t\no elevator solutions, we also offer escalators and moving walkways. With a range of finishes and aesthetics, Otis escalators integrate easily with any building design. Our smart design and features enhance sustainability and passenger safety, such as sensor-equipped escalators and moving walkways that efficiently run only when passengers approach, or operate at reduced speeds to conserve energy when there are no riders.\nService\nThrough our Service segment, we perform maintenance and repair services, as well as modernization services to upgrade elevators and\n escalators. We have a maintenance portfolio of\n approximately 2.4 million units globally,\n which includes Otis equipment manufactured and sold by us, as well as equipment from other original equipment manufacturers. Through our network of service sales personnel, we sell our services directly to customers in all significant elevator and escalator verticals around the world.\nService customers typically comprise building owners, facility managers, housing associations and government agencies that operate buildings where elevators and escalators are installed. Customers securing services for elevators are frequently different from those who initially make purchasing decisions with respect to New Equipment solutions. As the largest service provider in the industry worldwide, we have a wide range of customers in our Service segment and do not have any single service contract that is material to Otis as a whole. Contract duration depends on several factors, including customer needs, regulatory requirements and industry/geography dynamics. We work closely with our customers to renew these contracts as appropriate. Certain types of customers, such as those owning or operating large properties or portfolios of properties, tend to execute long-term maintenance agreements.\n2\nTable of Contents\nWe provide our Service offerings to our customers through a global network of \n36,000\n Service mechanics operating ou\nt of more than 1,400 bra\nnches and offices typically located in close proximity to concentrations of customers. Our mechanics are critical to\n our ability to deliver a high level of service to our customers. Our OTISLINE operations provide personalized customer support 24/7. They receive customer service requests and assign and dispatch field technicians, as necessary, to respond to service requests. We support our customers with our network of service parts centers and repair centers.\nOur services include inspections, preventive maintenance offerings and other customized maintenance offerings tailored to meet customer needs. A basic maintenance contract provides for inspection consistent with local regulatory needs. We offer incremental, tiered maintenance and service offerings, with varying levels of coverage up to and including comprehensive component replacement coverage. We also provide customers with repair services to address equipment and component wear and tear, as well as breakdowns. \nWe seek to grow our maintenance portfolio through conversion of newly installed units into maintenance contracts, through prospecting and winning units already in service from customers using another service provider and through acquisitions. Our Service sales personnel seek to win service contracts upon the expiration or termination of existing service contracts from customers by offering a superior value proposition through service excellence, an engaged and technically sophisticated group of field service technicians, a streamlined customer experience and reliable elevator and escalator operating performance.\nSimilar to most other electro-mechanical equipment, elevators and escalators are subject to wear and tear, which over time erodes equipment functionality. As elevator equipment ages, we work with customers to help renew or refresh their elevators with modernization solutions that enhance equipment operation, improve building functionality and contribute to more sustainable building systems. Modernization offerings can range from relatively simple upgrades of interior finishes and aesthetics to complex upgrades of larger components and sub-systems. Our GEN3 MOD Plus modernization offering for residential, commercial, hospitality, medical or industrial buildings includes built-in connectivity to our Otis ONE IoT digital platform.\nDigital Technology initiatives\nOtis offers a range of technologies for improving the passenger experience and we have been using technology to monitor elevator performance remotely for decades. As of December 31, 2024, approximately 1.0 million units of our global portfolio, including units under the warranty period, are connected. In 2025, we expect to continue to innovate and expand our digital ecosystem and suite of digital solutions for both our existing service portfolio customers and for new equipment shipments from our factories.\nOtis ONE is our latest cloud-based IoT technology, designed to continuously monitor equipment health and performance in real time to provide proactive, predictive and transparent information to our technicians and customers. The technology expands predictive and remote maintenance capabilities to support improved elevator up-time and service productivity.\nWe offer additional technology and multimedia options to customers with voice, data and video digital services, leveraging our IoT technologies, as described below. These are often incorporated as an optional upgrade on maintenance contracts.\n eView In-Car Display\nOur in-car display streams live, customizable infotainment to passengers and can connect them to OTISLINE, Otis' 24-hour service call center, during an emergency.\nCompass 360 Destination Management System\nOur proprietary destination management system groups passengers by their desired destination and directs them to an assigned car that minimizes waiting and ride time. The system's algorithms anticipate traffic demand within a building and improve traffic flow.\neCall Plus Smartphone App\nOtis' smartphone app enables passengers to summon their elevator remotely for a touchless experience.\n3\nTable of Contents\nResearch and Development & Intellectual Property\nInnovation is a fundamental characteristic of our history and is central to our strategy. For \n2024\n, research and development (\"R&D\") expense wa\ns $152 million and 1.1% as a percentage \nof net sales. In addition to R&D expense, we made investments in digital and strategic initiatives of \n$53 million\n, which in combination with R&D expense was 1.4% as a percentage of net sales. \nWe coordinate our R&D efforts globally through an operating model that sets global and local priorities based on customer and segment needs. We have 11 R&D centers and 17 factories around the world, including major locations in China, India, Japan, France, Germany, Spain and the United States. The R&D centers are strategically located close to concentrations of customers and factories to enable efficient development of engineering solutions that can serve a\ns global model products and adapt quickly and efficiently to local customer needs and local demographic and construction trends. We have\n 1,300 engi\nneers globally, with increasing focus on digital initiatives, software, design of the user interface and the user experience. \nWe maintain a portfolio of patents, trademarks, copyrights, trade secrets, licenses and franchises related to the Otis business to protect our R&D investments in products and services. We currently own approximatel\ny 5,300 pa\ntents issued in various jurisdictions, and we have approximatel\ny 1,400\n patent applications pending globally. We filed approximately\n 800 patent applications in the last three years. Our patents are primarily filed in Europe, the United States and Asia. We belie\nve that our patents and trade secrets create a competitive advantage and that we have taken reasonable measures to build a portfolio of valid and enforceable intellectual property rights. However, these intellectual property rights might be challenged and could be found invalid or unenforceable. Loss of strategic patents and trade secrets could significantly affect our competitiveness. See Item 1A in this Form 10-K for further discussion of intellectual property matters.\nJoint Ventures and Non-Wholly Owned Subsidiaries\nOur international strategic relationships, joint ventures and non-wholly owned subsidiaries are an important part of our business as they support our access to international markets and customers. Results of these entities are consolidated with our financial and operational results. Our largest joint ventures are located in China with the remainder of our joint ventures and non-wholly owned subsidiaries located in various other countries.\nWe operate in China through two principal joint ventures: Otis Elevator (China) Investment Company Limited (\"Otis China\") and Otis Electric Elevator Company Limited (\"Otis Electric\"). Otis China is a joint venture established in 1998 for the purpose of manufacturing, installing and servicing elevators, escalators and related equipment. We are a majority owner of Otis China, and Tianjin Tai Kang Investment Co. Ltd. is our joint venture partner. Otis Electric, a subsidiary of Otis China, is a joint venture established in 1997 for the purpose of manufacturing, installing and servicing elevators, escalators and related equipment. Otis China owns a controlling equity stake in Otis Electric. Otis China’s partner in Otis Electric is Xizi Elevator Group Co.\nCompetition \nWe operate in a highly competitive industry. Due to the global and localized nature of the industry, there are numerous pa\nrticipants of varying size that operate in our industry. According to industry estimates, there are hundreds of participants that offer New Equipment solutions and several thousand participants that offer maintenance and service solutions. In both the Ne\nw Equipment and Service segments, major competitors globally include KONE Oyj, Schindler Group and TK Elevator, while there are a number of additional competitors in the Asia Pacific region. Competitive dynamics vary significantly by segment and geogr\naphy. In the Service segment, independent service providers and other small operators are significant competitors in most of our local geograph\nies. These independent service providers have an aggregate portfolio of\n about 50%\n of service units, but account for a smaller percentage of the service business when measured by value because of the types of units and level of maintenance covered by these providers. \nThere are several factors that determine competitiveness in the industry, including local codes and compliance requirements, customer preferences, price, reputation, delivery and execution, product quality, equipment performance, reliability and long-term service and product support.\n \nOur success in both our New Equipment and Service segments depends upon our ability to develop and market our products, services and solutions, as well as our ability to provide the people, technologies, facilities, equipment and financial capacity needed to deliver those products and services with maximum efficien\ncy. We believe our global presence, local relationships and proven track record in executing complex elevator and escalator solutions contribute to our iconic brand, reputation and competitive position in the industry. \n4\nTable of Contents\nWe believe our business strategies allow us to:\n•\nSustain New Equipment growth;\n•\nAccelerate Service portfolio growth;\n•\nDeliver modernization value;\n•\nAdvance the digitalization of Otis; and\n•\nFocus and empower the organization.\nWe believe these results of our business strategies support our ability to successfully compete across the New Equipment and Service segments, and help deliver sustainable earnings growth.\nThe Company may not be able to compete effectively on all of these fronts and with all of its competitors, and the failure to do so could have a material adverse effect on its sales and profit margins. \nFor further discussion of risks related to the competitive environment of our business, see Item 1A in this Form 10-K.\nCompliance with Government Regulations \nWe conduct our business through subsidiaries and affiliates worldwide. Any changes in legislation or government policies impacting our industry, including with respect to employee safety, labor-related regulations, industrial equipment, licensing requirements, foreign ownership limitations and building and elevator safety codes, can affect our operations. We closely monitor local legislation and government policies in the locations in which we operate.\nIn addition, our operations are subject to and affected by environmental regulations promulgated by federal, state and local authorities in the United States and regulatory authorities with jurisdiction over our foreign operations. We have incurred and will likely continue to incur liabilities under various government statutes and regulations for the cleanup of pollutants previously released into the environment. We do not anticipate that compliance with current provisions relating to the protection of the environment or that any payments we may be required to make for cleanup liabilities will have a material adverse effect upon our competitive position, cash flows, results of operations or financial condition.\nUnited States (the \"U.S.\") laws, regulations, orders, and other measures concerning the export or re-export of products, software, services and technology to, and other trade-related activities involving, non-U.S. countries and parties affect the operations of Otis and its affiliates, as do those of other countries pertaining to similar matters.\nFor further discussion of risks related to environmental matters and other government regulations, see in this Form 10-K Item 1A, Item 7 and \"Note 2: Summary of Significant Accounting Policies\" and \"Note 21: Contingent Liabilities\" in Item 8 in this Form 10-K.\nSeasonality\nOur business and operating results are generally not subject to significant fluctuations as a result of seasonality, although we have experienced lower New Equipment net sales in Asia in the first calendar quarter, coinciding with Lunar New Year celebrations. In addition, we have also experienced lower New Equipment net sales in the fourth quarter in China, due to a national holiday that occurs during the first week of October which may impact the relative mix of net sales within the quarter.\nRaw Materials and Supplies\nDue to the global and distributed nature of our operations, we partner with a diverse network of several thousand \nsuppliers globally. These include product and non-product suppliers, as well as subcontractors. We rely on approximate\nly 450 key suppliers for our manufacturing supply chain. \n5\nTable of Contents\nComponents and systems necessary to effectively complete our New Equipment projects, as well as to satisfy our maintenance and repair obligations, are often available from two or more sources within the industry. While we believe no single supplier is material to our business, some components or applications require particular specifications or qualifications. In those cases, there may be a single supplier or a limited number of suppliers that can readily provide such components, which have in the past, and could in the future, result in supply constraints or cost pressures due to an issue with such a supplier, including financial or operational difficulties or a contract dispute. We implement mitigation actions to address potential disruption in and other risks relating to our supply chain, including the use of safety stock and alternative materials, as well as risk assessments, qualification of multiple supply sources and use of long-term supplier agreements. \nAlthough at times high prices for some important raw materials have caused margin and cost pressures for our business, we do not expect near-term unavailability or pricing of materials, components or supplies that would have a material adverse effect on our business. We seek to manage commodity price risk through locking and hedging strategies, as well as passing the increases onto our customers through pricing. \nSee Item 1A in this Form 10-K for risks associated with raw material and supply chain.\nEnvironmental, Social and Governance (\"ESG\")\nOtis has an integrated approach to ESG. Our four ESG pillars of Health & Safety, Environment & Impact, People & Communities and Governance & Accountability are embedded in our business strategy and align with our Otis Absolutes of Safety, Ethics and Quality. We are committed to the health and safety of our colleagues and the riding public. We are committed to managing our impact on the environment, aligning our products and services with our stakeholders’ expectations and aspirations. We proactively engage in the communities where we live and work. We focus on attracting, developing and retaining the best talent on the market. See \"Human Capital\" below for additional information regarding certain initiatives related to our colleagues. \nIn 2021, we became a signatory to the U.N. Global Compact and published our thirteen ESG goals and aligned them with the U.N. Sustainable Development Goals. Our Environment & Impact goals are as follows:\n•\nNear-term science-based greenhouse gas (\"GHG\") reduction targets:\n▪\nReduce absolute scope 1 and 2 GHG emissions 55% by 2033 from 2021 base year (with the target boundary including biogenic land-related emissions and removals from bioenergy feedstocks)\n▪\nReduce absolute scope 3 GHG emissions from purchased goods and services, business travel, and use of sold products 33% by 2033 from 2021 base year\n•\nSource 100% of factory electricity from renewable energy by 2030\n•\nAchieve 100% factory eligibility for zero-waste-to-landfill certification by 2025\n•\nComplete ISO 14001 certification for all factories by 2025 (goal completed four years early in 2021)\nIn April 2024, the Science Based Target Initiative (\"SBTi\") validated our near-term science-based GHG reduction targets. Our new science-based targets replace our GHG target of 50% reduction in scope 1 and 2 GHG emissions by 2030 from 2019 base year. Our climate transition plan is based on the implementation of major initiatives focused on energy management and operational efficiency across our factories, real estate and fleet. \nIn June 2024, we published our third annual ESG report on our ESG activities, metrics and progress towards our goals in accordance with the Global Reporting Initiative Standards, as well as in alignment with the Sustainability Accounting Standards Board guidelines and the Task Force on Climate-related Financial Disclosures. We also engaged third parties for limited assurance covering certain Health & Safety, Environment & Impact, and People & Community metrics discussed in the ESG report. In the Fall 2024, we conducted our initial double materiality assessment in accordance with the European Corporate Sustainability Reporting Directive. Our ESG goals and ESG reports can be found in the Investor section of our corporate website (http://www.otis.com) under the heading \"ESG\", which we update from time to time. Our ESG goals, our ESG reports and our corporate website are not incorporated by reference into this Form 10-K.\nThe Company has developed an ESG governance model that supports our goals. Our Board of Directors and its committees engage in extensive review and oversight of ESG-related topics. The Company's ESG Council, composed of senior leaders representing multiple functions within the Company, monitors our performance towards our ESG goals and addresses impacts and opportunities related to climate change, as well as those related to all other ESG programs. The ESG Council reports regularly to our CEO on our ESG progress and actions. Our progress towards our ESG goals was included as a performance multiplier in determining payouts under our 2024 executive short-term incentive plan.\n6\nTable of Contents\nThere have been no, and we do not expect there to be in the near term, material impacts on our business, financial condition or results of operations as a result of compliance with legislation or regulatory rules regarding climate change, from the known physical effects of climate change or as a result of implementing our ESG initiatives. Increased regulation and other climate change concerns, however, could subject us to additional costs and restrictions, and we are not able to predict how such regulations or concerns would affect our business, operations or financial results. For a discussion of risks associated with ESG matters, see Item 1A in this Form 10-K.\nHuman Capital\nAs of December 31, 2024, our global workforce consists of 72,000 colleagues (including 44,000 field professionals), with 45% in Asia, 34% in Europe, the Middle East and Africa (\"EMEA\") and 21% in the Americas.\nApproximately 64% of our U.S. workforce is covered by a collective bargaining agreement. Out\nside of the U.S., our colleagues are represented by workers' councils or statutory labor unions \nas may be customary or required in those jurisdictions\n.\n While we strive to maintain good relationships with our employee representative bodies, our business may be adversely affected by work stoppages, union negotiations, labor disputes and other matters associated with our labor force. T\nhe collective bargaining agreement for most of our bargaining unit colleagues in the U.S. was renewed without disruption in July 2022 and is set to expire in July 2027.\n For a discussion of risks associated with employment-related matters, see Item 1A in this Form 10-K.\nCompensation and Benefits\nOur colleagues are vital to our success, and we offer pay and benefits designed to attract, retain and motivate our colleagues and align their compensation with both individual and our overall performance. We follow local labor laws that address minimum wages, insurance coverage of work-related accidents, severance pay and other employment provisions, including overtime and sick pay. While our programs vary by location and eligibility, they generally include base and overtime pay, short-term incentive bonuses, long-term incentive pay in the form of stock awards, retirement plan benefits, health care and insurance benefits, tuition assistance through our Employee Scholar program, paid sick, bereavement, vacation, parental and family leaves, and wellness and employee assistance programs.\nHealth and Safety\nSafety is one of the Otis Absolutes. For that reason, safety measures and indicators are regularly monitored by management and reported to our Board of Directors. To promote safety, we have a health and safety management system and regularly measure the effectiveness of our health and safety programs. We also provide regular health and safety training to our field professionals. We follow local labor laws that address maximum working hours. We empower all of our colleagues and subcontractors with stop work authority if they perceive an unsafe condition or behavior that may cause injury. We also seek to promote a culture where stop work authority can be freely exercised without the fear of retribution or retaliation, and a learning culture to enhance the quality and delivery of safety and technical training. Health and Safety is one of the four focus areas of our ESG goals. See the \"Environmental, Social and Governance (\"ESG\")\" section of this Form 10-K above for more information regarding our ESG goals.\nWe are focused on our colleagues' mental and physical well-being. We provide employee assistance plan benefits to all of our colleagues worldwide. We also offer flexible work arrangements to many salaried colleagues. \nHiring, Training, Development and Retention\nWe position ourselves to attract and retain the best talent in the market and interact meaningfully in the global communities where we live and work. We aim to be both an equal opportunity employer of choice and a place where our colleagues feel safe, welcomed and heard. We partner with universities and nonprofit organizations and use our Employee Resource Groups (\"ERGs\") to broaden our hiring pool to meet our hiring needs. \nWe seek others’ ideas, encourage innovation and empower our colleagues through various learning and development programs that are aligned with our business strategy and are designed to contribute to our broader success such as our \"Employee Scholar Program\", a company-sponsored education program that allows colleagues to expand their skills through degree or certification programs.\n \nOur mechanics receive extensive training to service and install equipment safely. This training consists of live, virtual, and on-the-job modules with experienced mechanics. \nWe also offer various programs to build leadership and functional capabilities and provide development initiatives through our colleague-led ERGs. Our ERGs’ missions aim at fostering an inclusive work environment through engagement that positively impacts business outcomes. \n7\nTable of Contents\nWe track our colleagues’ voluntary attrition rate to help us assess our workplace initiatives. We also track our colleagues’ satisfaction through colleague surveys to anticipate attrition, as discussed further below. Our commitment to fostering an inclusive workplace strengthens employee engagement and supports the retention of top talent.\nColleague Engagement\nWe believe that engaged colleagues deliver better service to our customers. We measure engagement by periodically conducting colleague surveys. The results, which are reported to our Board of Directors and management, help us assess how our colleagues feel about working for us. We use the survey results to develop action plans to address areas of concern. The engagement survey, which anonymizes the data, covers topics such as safety, ethics, belonging, quality, company prospects, inclusion, empowerment, accountability and managerial effectiveness. \nCorporate Information\nOtis is a Delaware corporation and was incorporated on March 1, 2019 in connection with the separation and distribution (\"Separation\") of each of Otis and C\narrier Global Corporation (\"Carrier\") from United Technologies Corporation, subsequently renamed RTX Corporation (\"UTC\" or \"RTX\", as applicable) into separate independent publicly traded companies. The Separation occurred on April 3, 2020. References to \"UTC\" relate to pre-Separation matters, and references to \"RTX\" relate to post-Separation matters.\nThe Separation was completed pursuant to a Separation and Distribution Agreement (\"Separation Agreement\") and other agreements with UTC and Carrier related to the Separation, including but not limited to a tax matters agreement (\"TMA\"), an employee matter agreement (\"EMA\") and an\n intellectual property agreement (the \"Intellectual Property Agreement\").\n \nFor further discussion of these agreements, see Item 1A, \"Note 1: Business Overview\" in Item 8 and Item 15 in this Form 10-K.\nAvailable Information\nThis Form 10-K and our quarterly reports on Form-10-Q, current reports on Form 8-K and any amendments to those reports are available free of charge through the Investors section of our Internet website (http://www.otis.com) under the heading \"Financial Information\" as soon as reasonably practicable after these reports are electronically filed with, or furnished to, the SEC. In addition, the SEC maintains a website (http://www.sec.gov) containing reports, proxy and information statements and other information regarding issuers that file electronically with the SEC.\n8\nTable of Contents\nCautionary Note Concerning Factors That May Affect Future R\nesults\nThis Form 10-K contains statements which, to the extent they are not statements of historical or present fact, constitute \"forward-looking statements\" under the securities laws. From time to time, oral or written forward-looking statements may also be included in other information released to the public. These forward-looking statements are intended to provide management’s current expectations or plans for Otis’ future operating and financial performance, based on assumptions currently believed to be valid. Forward-looking statements can be identified by the use of words such as \"believe,\" \"expect,\" \"expectations,\" \"plans,\" \"strategy,\" \"prospects,\" \"estimate,\" \"project,\" \"target,\" \"anticipate,\" \"will,\" \"should,\" \"see,\" \"guidance,\" \"outlook,\" \"medium-term,\" \"near-term,\" \"confident,\" \"goals\" and other words of similar meaning in connection with a discussion of future operating or financial performance. Forward-looking statements may include, among other things, statements relating to future sales, earnings, cash flow, results of operations, uses of cash, dividends, share repurchases, tax rates, R&D spend, restructuring or transformation actions (including UpLift and related reorganization and outsourcing activities), credit ratings, net indebtedness and other measures of financial performance or potential future plans, strategies or transactions, or statements that relate to climate change and our intent to achieve certain ESG targets or goals, including operational impacts and costs associated therewith, and other statements that are not historical facts. All forward-looking statements involve risks, uncertainties and other factors that may cause actual results to differ materially from those expressed or implied in the forward-looking statements. For those statements, Otis claims the protection of the safe harbor for forward-looking statements contained in the U.S. Private Securities Litigation Reform Act of 1995. Such risks, uncertainties and other factors include, without limitation:\n•\nthe effect of economic conditions in the industries and markets in which Otis and its businesses operate and any changes therein, including financial market conditions, fluctuations in commodity prices, and other inflationary pressures, interest rates and foreign currency exchange rates, levels of end market demand in construction, pandemic health issues, natural disasters, whether as a result of climate change or otherwise, and the financial condition of Otis’ customers and suppliers;\n•\nthe effect of changes in political conditions in the U.S., including in connection with the new administration's policies and priorities, or otherwise, and other countries in which Otis and its businesses operate, including the effects of the conflict between Russia and Ukraine, the conflicts in the Middle East, and tensions between the U.S. and China, on general market conditions, commodity costs, global trade policies and related sanctions, export controls and tariffs, and currency exchange rates in the near term and beyond;\n•\nchallenges in the development, production, delivery, support, performance and realization of the anticipated benefits of advanced technologies and new products and services;\n•\nfuture levels of indebtedness, capital spending and research and development spending;\n•\nfuture availability of credit and factors that may affect such availability or costs thereof, including credit market conditions and Otis’ capital structure;\n•\nthe timing and scope of future repurchases of Otis’ common stock (\"Common Stock\"), which may be suspended at any time due to various factors, including market conditions and the level of other investing activities and uses of cash;\n•\nfluctuations in prices and delays and disruption in delivery of materials and services from suppliers, whether as a result of changes in general economic conditions, geopolitical conflicts or otherwise;\n•\ncost reduction or containment actions, restructuring or transformation costs and related savings and other consequences thereof, including with respect to UpLift and related impacts of reorganization and outsourcing activities and change management;\n•\nnew business and investment opportunities;\n•\nthe outcome of legal proceedings, investigations and other contingencies;\n•\npension plan assumptions and future contributions;\n•\nthe impact of the negotiation of collective bargaining agreements and labor disputes, labor actions, including strikes or work stoppages, and labor inflation in the markets in which Otis and its businesses operate globally;\n•\nthe effect of changes in tax, environmental, regulatory (including among other things import/export, tariffs, and climate change or other ESG related legal and regulatory changes) and other laws and regulations in the U.S., including in connection with the new administration's policies and priorities, and other countries in which Otis and its businesses operate;\n•\nthe ability of Otis to retain and hire key personnel;\n•\nthe scope, nature, impact or timing of acquisition and divestiture activity, the integration of acquired businesses into existing businesses and realization of synergies and opportunities for growth and innovation and incurrence of related costs;\n•\nthe determination by the Internal Revenue Service (the \"IRS\") and other tax authorities that the distribution or certain related transactions in connection with the Separation should be treated as taxable transactions; and\n9\nTable of Contents\n•\nour obligations and our disputes that have or may hereafter arise under the agreements we entered into with RTX and Carrier in connection with the Separation.\nThese and other factors are more fully discussed in the \"Business\", \"Risk Factors\" and \"Management’s Discussion and Analysis of Financial Condition and Results of Operations\" sections and elsewhere in this Form 10-K and may cause actual results to differ materially from those expressed or implied in the forward-looking statements. \nThe forward-looking statements speak only as of the date of this report, or in the case of any document incorporated by reference, the date of that document. W\ne undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by applicable law. Additional information as to factors that may cause actual results to differ materially from those expressed or implied in the forward-looking statements is disclosed from time to time in our other filings with the SEC.",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\nBUSINESS OVERVIEW\nWe are the world’s leading elevator and escalator manufacturing, installation and service company. Our Company is organized into two segments, New Equipment and Service. Through our New Equipment segment, we design, manufacture, sell and install a wide range of passenger and freight elevators, as well as escalators and moving walkways for residential and commercial buildings and infrastructure projects. Our New Equipment customers include real-estate and building developers and general contractors who develop and/or design buildings for residential, commercial, retail or mixed-use activity. We sell our New Equipment directly to customers, as well as through agents and distributors.\nThrough our Service segment, we perform maintenance and repair services for both our own products and those of other manufacturers and provide modernization services to upgrade elevators and escalators. Maintenance services include inspections to ensure code compliance, preventive maintenance offerings and other customized maintenance offerings tailored to meet customer needs, as well as repair services to address equipment and component wear and tear and breakdowns. Modernization services enhance equipment operation and improve building functionality. Modernization offerings can range from relatively simple upgrades of interior finishes and aesthetics to complex upgrades of larger components and sub-systems. Our typical Service customers include building owners, facility managers, housing associations and government agencies that operate buildings where elevators and escalators are installed.\nWe serve our customers through a global network of employees. These include sales personnel, field technicians with separate skills in performing installation and service, as well as engineers driving our continued product development and innovation. We function under a centralized operating model whereby we pursue a global strategy set around New Equipment and Service because we seek to grow our maintenance portfolio, in part, through the conversion of new elevator and escalator installations into service contracts. Accordingly, we benefit from an integrated global strategy, which sets priorities and establishes accountability across the full product lifecycle.\nFor additional discussion of our business, refer to Item 1 in this Form 10-K.\nUpLift\nAnnounced in July 2023, UpLift is a program with the goal of transforming our operating model. UpLift includes the standardization of our processes and improvement of our supply chain procurement, among other aspects of the program, as well as organizational changes which result in restructuring actions. We expect UpLift to generate approximately $200 million in annual run-rate savings by the second half of 2025, with restructuring and other incremental costs to complete the transformation (\"UpLift transformation costs\") of approximately $300 million.\nThe Company generated approximately $70 million of pre-tax savings in 2024, including run-rate savings of approximately $120 million, driven by our simplified operating structure, optimized organizational spans and layers, and reduced digital technology costs. These savings are primarily reflected in Selling, general and administrative expenses.\nUpLift costs incurred are as follows:\n(dollars in millions)\n2024\n2023\nUpLift restructuring costs\n$\n31\n$\n25\nUpLift transformation costs\n65\n16\nTotal UpLift costs\n$\n96\n$\n41\nTotal UpLift costs incurred to date are $137 million, including $56 million of restructuring costs and $81 million of transformation costs.\nUpLift restructuring costs are primarily severance costs and are recorded primarily in Selling, general and administrative in the Consolidated Statements of Operations. UpLift transformation costs are primarily for consultants, third-party service providers and personnel focused on designing and implementing a centralized service delivery model that supports our new organizational structure, including the standardization of our supply chain and digital technology procurement. These costs are recorded in Other income (expense), net in the Consolidated Statements of Operations.\n26\nTable of Contents\nFor further details, refer to the discussion on restructuring costs in the \"Results of Operations,\" as well as \"\nNote 16: Restructuring and Transformation Costs\" to the Consolidated Financial Statements in Item 8 in this Form 10-K.\nGerman Tax Litigation \nIn August 2024, we received a favorable ruling regarding a German tax litigation. As a result, we recorded income tax benefits of approximately $185 million and related interest income of approximately $200 million, which are included in Income tax expense (benefit), net and Interest expense (income), net, respectively, in the Consolidated Statements of Operations for 2024. Additionally, pursuant to the Tax Matters Agreement (\"TMA\") with RTX Corporation (\"RTX\", our former parent), the Company recorded indemnification expense of $194 million for amounts due to RTX resulting from the outcome of the German tax litigation. This expense is included in Other expense (income), net in the Consolidated Statements of Operations for 2024.\nFor further details, refer to \"Note 15: Income Taxes\" and \"Note 21: Contingencies\" to the Consolidated Financial Statements in Item 8 in this Form 10-K.\nImpact of Global Macroeconomic Conditions on Our Company\nGlobal macroeconomic conditions have impacted, and continue to impact, aspects of the Company's operations and overall financial performance. These macroeconomic conditions include, among others, inflationary pressures, high interest rates and tighter credit conditions. These macroeconomic trends could continue to impact our business, including impacts to overall financial performance in 2025, as a result of the following, among other things:\n•\nCustomer demand impacting our new equipment, maintenance and repair, and modernization businesses;\n•\nCustomer liquidity constraints and related credit reserve;\n•\nCancellations or delays of customer orders; and\n•\nSupplier liquidity, as well as supplier and raw material capacity constraints, delays and related costs.\nWe currently do not expect any significant impact to our capital and financial resources from these macroeconomic conditions, including to our overall liquidity position based on our available cash and cash equivalents and our access to credit facilities and the capital markets. \nSee the \"Liquidity and Financial Condition\" section of this item of this Form 10-K for further detail and Item 1A in this Form 10-K for macroeconomic risks related to our business.\nRisks Associated with Ongoing Conflicts\nThe ongoing conflict between Russia and Ukraine has resulted in worldwide geopolitical and macroeconomic uncertainty, including volatile commodity markets, foreign exchange fluctuations, supply chain disruptions, increased risk of cybersecurity incidents, reputational risk, increased operating costs (including fuel and other input costs), environmental, health and safety risks related to securing and maintaining facilities, additional sanctions and other regulations (including restrictions on the transfer of funds to and from Russia). As discussed below, we do not have operations in Russia.\nTo the extent possible, we continue to operate our business in Ukraine, which represented less than 1% of our 2024, 2023 and 2022 revenue and operating profit. As previously disclosed, we sold our business in Russia, which represented approximately 1% of our revenue and operating profit in 2022, respectively, to a third party in July 2022. The operations were comprised mostly of New Equipment. We recorded losses from the sale and conflict-related charges totaling $28 million, primarily in Other income (expense), net in the Consolidated Statements of Operations in 2022. See \"Note 8: Business Acquisitions, Dispositions, Goodwill and Intangible Assets\" in Item 8 in this Form 10-K for further details.\nAdditionally, we do not have operations or material net sales in Israel or Gaza. Although we have operations in the Middle East and transport products through the Red Sea, we currently do not expect the recent conflicts in that region to have a material impact on our business.\n27\nTable of Contents\nWe cannot predict how the events described above will evolve. Depending on the ultimate outcomes of these conflicts, which remain uncertain, they could heighten certain risks disclosed in Item 1A in this Form 10-K, including but not limited to, adverse effects on macroeconomic conditions, including increased inflation, constraints on the availability of commodities, supply chain disruption and decreased business spending; cyber-incidents; disruptions to our or our business partners’ global technology infrastructure, including through cyberattack or cyber-intrusion; adverse changes in international trade policies and relations; claims, litigation and regulatory enforcement; our ability to implement and execute our business strategy; terrorist activities; our exposure to foreign currency fluctuations; reputational risk; and constraints, volatility, or disruption in the capital markets, any of which could have a material adverse effect on our business, results of operations, cash flows and financial condition.\nEnvironmental, Social and Governance (\"ESG\")\nThere have been no, and we do not expect there to be in the near term, material impacts on our business, financial condition or results of operations as a result of compliance with legislation or regulatory rules regarding climate change, from the known physical eff\nects of climate change or as a result of implementing our ESG initiatives. Increased regulation and other climate change concerns, however, could subject us to additional costs and restrictions, and we are not able to predict how su\nch regulations or concerns would affect our business, operations or financial results.\n For a discussion of risks associated with ESG matters, see Item 1A in this Form 10-K.\nFor a discussion of Otis’ ESG goals, see the discussion under \"Environmental, Social and Governance (\"ESG\")\" in Item 1 in this Form 10-K.\nZardoya Otis Tender Offer\nAs previously disclosed, the Company announced the Tender Offer to acquire all issued and outstanding shares of Zardoya Otis not owned by Otis, at an offer price of €7.07 per share in cash, after adjusting for dividends. The results of the Tender Offer were announced on April 7, 2022, with tenders of 45.49% of the shares outstanding accepted. The shares tendered to the Company were settled in cash on April 12, 2022 for approximately €1.5 billion from the Company's restricted cash held in escrow, resulting in the Company owning 95.51% of Zardoya Otis. The acquisition and settlement of the remaining issued and outstanding shares not owned by the Company for approximately €150 million (based on the adjusted tender price of €7.07 per share) and the automatic delisting of Zardoya Otis shares both occurred during the second quarter of 2022. Zardoya Otis was renamed Otis Mobility upon completion of the Tender Offer and delisting.\nSee \"Note 1: Business Overview\" and \"Note 9: Borrowings and Lines of Credit\" in Item 8 in this Form 10-K for further details regarding this transaction and financing arrangements entered into in connection with the Tender Offer.\n28\nTable of Contents\nRESULTS OF OPERATIONS\nNet Sales\n(dollars in millions)\n2024\n2023\n2022\nNet sales\n$\n14,261\n \n$\n14,209 \n$\n13,685 \nPercentage change year-over-year\n0.4\n \n%\n3.8 \n%\n(4.3)\n%\nThe factors contributing to the total percentage change year-over-year in total Net sales are as follows:\n2024\n2023\nOrganic volume\n1.4\n \n%\n5.6 \n%\nForeign currency translation\n(1.2)\n%\n(1.2)\n%\nAcquisitions and divestitures, net\n0.2\n \n%\n(0.6)\n%\nTotal % change\n0.4\n \n%\n3.8 \n%\nThe Organic volume increase of 1.4% for 2024 was driven by an increase in organic sales of 6.8% in Service, offset by a decrease of (6.4)% in New Equipment.\nThe Organic volume increase of 5.6% for 2023 was driven by an increase in organic sales of 7.7% in Service and 2.6% in New Equipment. \nThe decrease in Net sales due to Acquisitions and divestitures, net in 2023 is primarily the result of the sale of our Russia business in the third quarter of 2022.\nSee \"Segment Review\" below for a discussion of Net sales by segment.\nCost of Products and Services Sold\n(dollars in millions)\n2024\n2023\n2022\nCost of products and services sold\n$\n10,004\n \n$\n10,016 \n$\n9,765 \nPercentage change year-over-year\n(0.1)\n%\n2.6 \n%\n(3.4)\n%\nThe factors contributing to the percentage change year-over-year in total cost of products and services sold are as follows:\n2024\n2023\nOrganic volume\n0.9\n \n%\n4.8 \n%\nForeign currency translation\n(1.3)\n%\n(1.3)\n%\nAcquisitions and divestitures, net and Other\n0.3\n \n%\n(0.9)\n%\nTotal % change\n(0.1)\n%\n2.6 \n%\nThe organic increase in total cost of products and services sold in 2024 and 2023, were primarily driven by the organic sales changes noted above. Productivity and lower commodity prices, primarily steel, were partially offset by inflationary pressures, including annual wage increases and higher Service-related material costs.\nThe decrease in Total cost of products and services sold due to Acquisitions and divestitures, net and Other in 2023 is primarily the result of the sale of our Russia business in the third quarter of 2022.\n29\nTable of Contents\nGross Margin\n(dollars in millions)\n2024\n2023\n2022\nGross margin\n$\n4,257\n \n$\n4,193 \n$\n3,920 \nGross margin percentage\n29.9\n \n%\n29.5 \n%\n28.6 \n%\nGross margin percentage increased 40 basis points in 2024 compared to 2023, due to Service sales growing faster than New Equipment sales, the benefits from productivity and lower commodity prices, partially offset by the inflationary pressures described above.\nGross margin percentage increased 90 basis points in 2023 compared to \n2022\n, due to the benefit from favorable pricing, Service sales growing faster than New Equipment sales, lower commodity prices, and the benefits from productivity, partially offset by the inflationary pressures described above.\nResearch and Development\n(dollars in millions)\n2024\n2023\n2022\nResearch and development\n$\n152\n \n$\n144 \n$\n150 \nPercentage of Net sales\n1.1\n \n%\n1.0 \n%\n1.1 \n%\nResearch and development was relatively flat in 2024 compared to 2023 and 2022. Research and development includes product development and innovation, including for IoT and developing the next generation of connected elevators and escalators. \nSelling, General and Administrative\n(dollars in millions)\n2024\n2023\n2022\nSelling, general and administrative\n$\n1,861\n \n$\n1,884 \n$\n1,763 \nPercentage of Net sales\n13.0\n \n%\n13.3 \n%\n12.9 \n%\nSelling, general and administrative expenses decreased $23 million in 2024 compared to 2023, driven by savings resulting from UpLift, lower restructuring costs and favorable foreign exchange impacts, partially offset by annual wage increases and higher other employment-related costs.\nSelling, general and administrative expenses increased $121 million in 2023 compared to 2022, driven by annual wage increases, higher other employment-related costs, higher restructuring costs and higher credit loss reserves, partially offset by favorable foreign exchange impacts of $8 million.\nSelling, general and administrative expenses as a percentage of Net sales decreased 30 basis points in 2024 compared to 2023, and increased 40 basis points in 2023 compared to 2022.\nRestructuring Costs\n(dollars in millions)\n2024\n2023\n2022\nUpLift restructuring costs\n$\n31\n$\n25\n$\n—\nOther restructuring costs\n40\n42\n60\nTotal restructuring costs\n$\n71\n$\n67\n$\n60\nWe initiate restructuring actions to keep our cost structure competitive. Charges generally arise from severance related to workforce reductions and, to a lesser degree, facility exit and lease termination costs associated with the consolidation of office and manufacturing operations. We continue to closely monitor the economic environment and may undertake further restructuring actions to keep our cost structure aligned with the demands of the prevailing market conditions. \n30\nTable of Contents\nUpLift restructuring costs were $31 million and $25 million in 2024 and 2023, respectively. We also incurred $65 million and $16 million of UpLift transformation costs in 2024 and 2023, respectively, which are primarily for consultants, third-party service providers and personnel focused on designing and implementing a centralized service delivery model that supports our new organizational structure, including the standardization of our supply chain and digital technology procurement. These costs are recorded in Other income (expense), net in the Consolidated Statements of Operations.\nOther restructuring action costs were $40 million in 2024 and included $24 million of costs related to 2024 actions and $16 million of costs related to 2023 actions.\nMost of the expected restructuring charges will require cash payments, which we have funded and expect to continue to fund with cash generated from operations. The table below presents approximate cash outflows related to the restructuring actions during 2024, and the expected cash payments to complete the actions announced:\n(dollars in millions)\nUpLift Actions\nOther Actions\nTotal Restructuring\nCash outflows during the year ended December 31, 2024\n$\n31 \n$\n34 \n$\n65 \nExpected cash payments remaining to complete actions announced\n37 \n53 \n90 \nThe approved UpLift restructuring actions are expected to generate approximately $80 million in annual recurring savings by the end of 2025, primarily in Selling, general and administrative expenses, and of which approximately $39 million was realized during 2024.\nFor other restructuring actions, we generally expect to achieve annual recurring savings within the two-year period subsequent to initiating the actions, including $45 million for the 2024 actions and $42 million for the 2023 actions, split evenly in Cost of Products and Services Sold and in Selling, general and administrative expenses. Approximately $50 million of savings was realized for the 2024 and 2023 actions during 2024.\nFor additional discussion of restructuring and transformation costs, see \"Note 16: Restructuring and Transformation Costs\" in Item 8 in this Form 10-K.\nOther Income (Expense), Net\n(dollars in millions)\n2024\n2023\n2022\nOther income (expense), net\n$\n(236)\n$\n21\n$\n26\nOther income (expense), net primarily includes the impact of changes in the fair value and settlement of derivatives, gains or losses on sale of businesses and fixed assets, earnings from equity method investments, fair value changes on equity securities, impairments, UpLift transformation costs, non-recurring Separation-related adjustments and certain other operating items.\nThe change in Other income (expense), net of $(257) million in 2024 compared to 2023, was primarily driven by Separation-related adjustments of $177 million, UpLift transformation costs of $65 million, $18 million of impairment loss related to net assets held for sale, foreign currency mark-to market adjustments, and non-recurring litigation-related settlement costs, including $18 million in the second quarter of 2024, partially offset by other reserve adjustments.\nThe change in Other income (expense), net of $(5) million in 2023 compared to 2022 was primarily driven by UpLift transformation costs of $16 million and the absence of the settlement of certain legal matters in 2022, partially offset by the impact of foreign currency mark-to-market adjustments and the absence of the loss on the sale of our Russia business and related charges when compared to 2022.\nFor additional discussion of the Separation-related adjustments, litigation-related settlement c\nosts and held fo\nr sale impairment, see \"Note 22: Segment Financial Data\" in Item 8 in this Form 10-K. \nFor additional discussion of UpLift transformation costs, see \"Note 16: Restructuring and Transformation Costs\" in Item 8 in this Form 10-K. \n31\nTable of Contents\nInterest Expense (Income), Net\n(dollars in millions)\n2024\n2023\n2022\nInterest expense (income), net\n$\n(31)\n$\n150\n$\n143\nInterest expens\ne (income), net primarily relates to interest expense on our external debt, offset by interest income earned on cash balances and short-term investments, and also includes interest related to tax matters.\nThe change in Interest expense (income), net of $(181) million in 2024 compared to 2023, was primarily driven by approximately $200 million related to the German tax litigation, interest reserve adjustments and higher interest income, partially offset by higher interest expense related to the $600 million and €850 million unsecured, unsubordinated debt issued in November 2024 and $750 million unsecured, unsubordinated debt issued in August 2023. \nInterest expense (income), net increased $7 million in 2023 compared to 2022, primarily driven by higher interest expense related to the $750 million unsecured, unsubordinated debt issued in August 2023, partially offset by higher interest income.\nThe average interest rate on our external debt for 2024, 2023 and 2022 was 2.5%, 2.1% and 2.0%, respectively.\nFor additional discussion of borrowings, see \"Note 9: Borrowings and Lines of Credit\" \nin Item 8 in this Form 10-K. \nFor additional discussion of German tax litigation, see \"Note 21: Contingencies\" and \"Note 22: \nSegment Financial Data\"\n in Item 8 in this Form 10-K.\nIncome Taxes\n \n2024\n2023\n2022\nEffective tax rate\n15.0\n \n%\n26.2 \n%\n27.5 \n%\nThe 2024 effective tax rate is lower than the 2023 effective tax rate and the statutory U.S. rate primarily due to recognition of estimated tax benefits arising as a result of the resolution of the German tax litigation and the reduction of a deferred tax liability related to the mitigation of future repatriation costs.\nThe 2023 and 2022 effective tax rates are higher than the statutory U.S. rate primarily due to higher international tax rates as compared to the lower U.S. federal statutory rate.\nThe 2023 effective tax rate is lower than the 2022 effective tax rate primarily due to the absence of the tax impact related to the sale of our Russia business recorded in 2022, as well as the release of valuation allowances on non-U.S. losses and U.S. foreign tax credits, reduction in the deferred tax liability related to lower withholding tax on repatriation of certain foreign earnings, and reversal of tax reserves related to the U.S. foreign tax credit regulations, all recorded in 2023.\nFor additional discussion of income taxes and the effective income tax rate, see \"Note 15: Income Taxes\" in Item 8 in this Form 10-K. \nNoncontrolling Interest in Subsidiaries' Earnings and Net Income Attributable to Otis Worldwide Corporation\n(dollars in millions)\n2024\n2023\n2022\nNoncontrolling interest in subsidiaries' earnings\n$\n89\n$\n92\n$\n116\nNet income attributable to Otis Worldwide Corporation\n$\n1,645\n$\n1,406\n$\n1,253\nNoncontrolling interest in subsidiaries' earnings were relatively flat in 2024 in comparison to 2023. Other than our acquisition of the noncontrolling shares of our subsidiary in Japan during the second quarter of 2024, ownership interest in the underlying non-wholly owned subsidiaries has remained generally consistent year-over-year. See \"Note 1: Business Overview\" in Item 8 in this Form 10-K for further discussion of the noncontrolling interest acquisition.\n32\nTable of Contents\nNoncontrolling interest in subsidiaries' earnings decreased in 2023 in comparison to 2022 primarily driven by Otis' increase to full ownership in Otis Mobility (formerly Zardoya Otis) in the second quarter of 2022, as well as impacts of foreign exchange, partially offset by higher net income from non-wholly owned subsidiaries. For details on the results of the Tender Offer and purchases of shares of Otis Mobility not previously owned by the Company, see \"Note 1: Business Overview\" in Item 8 in this Form 10-K.\nNet income attributable to Otis Worldwide Corporation increased in 2024 compared to 2023, due to a lower effective tax rate and lower interest expense, partially offset by lower operating profit (including the unfavorable impact of foreign exchange rates).\nNet income attributable to Otis Worldwide Corporation increased in 2023 compared to 2022, due to higher operating profit (including the unfavorable impact of foreign exchange rates), lower noncontrolling interest in subsidiaries' earnings, and a lower effective tax rate.\n33\nTable of Contents\nSegment Review\nSummary performance for our operating segments for 2024, \n2023 and 2022\n was as follows:\nNet Sales\nOperating Profit\nOperating Profit Margin\n(dollars in millions)\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nNew Equipment\n$\n5,367\n$\n5,812\n$\n5,778\n$\n329\n$\n381\n$\n381\n6.1\n \n%\n6.6 \n%\n6.6 \n%\nService\n8,894\n8,397\n7,801\n2,185\n2,014\n1,832\n24.6\n \n%\n24.0 \n%\n23.5 \n%\nTotal segment\n14,261\n14,209\n13,579\n2,514\n2,395\n2,213\n17.6\n \n%\n16.9 \n%\n16.3 \n%\nCorporate and Unallocated\nGeneral corporate expenses and other\n—\n—\n—\n158\n126\n87\nUpLift restructuring\n—\n—\n—\n31\n25\n—\nOther restructuring \n—\n—\n—\n40\n42\n60\nUpLift transformation costs\n—\n—\n—\n65\n16\n—\nSeparation-related reserve adjustment\n—\n—\n—\n177\n—\n—\nRussia operations\n—\n—\n106\n—\n—\n5\nRussia sale and conflict-related charges\n—\n—\n—\n—\n—\n28\nLitigation-related settlement costs\n—\n—\n—\n18\n—\n—\nHeld for sale impairment\n—\n—\n—\n18\n—\n—\nOther, net\n—\n—\n—\n(1)\n—\n—\nTotal\n$\n14,261\n$\n14,209\n$\n13,685\n$\n2,008\n$\n2,186\n$\n2,033\n14.1\n \n%\n15.4 \n%\n14.9 \n%\nNew Equipment\nThe New Equipment segment designs, manufactures, sells and installs a wide range of passenger and freight elevators, as well as escalators and moving walkways in residential and commercial buildings and infrastructure projects. Our New Equipment customers include real-estate and building developers and general contracto\nrs who\n develop and/or design buildings for residential, infrastructure, commercial, retail or mixed-use activity. We sell directly to customers as well as through agents and distributors. We also sell New Equipment to government agencies to support infrastructure projects, such as airports, railways or metros.\nSummary performance for New Equipment for \n2024, \n2023 and 2022 was as follows:\n \nTotal Increase (Decrease)\nYear-Over-Year for:\n(dollars in millions)\n2024\n2023\n2022\n2024 compared with 2023\n2023 compared with 2022\nNet sales\n$\n5,367\n \n$\n5,812 \n$\n5,778 \n$\n(445)\n(7.7)\n%\n$\n34\n0.6 \n%\nCost of sales\n4,443\n \n4,837 \n4,855 \n(394)\n(8.1)\n%\n(18)\n(0.4)\n%\n924\n \n975 \n923 \n(51)\n(5.2)\n%\n52\n5.6 \n%\nOperating expenses \n595\n \n594 \n542 \n1\n0.2\n \n%\n52\n9.6 \n%\nOperating profit\n$\n329\n \n$\n381 \n$\n381 \n$\n(52)\n(13.6)\n%\n$\n—\n— \n%\nOperating profit margin\n6.1\n \n%\n6.6 \n%\n6.6 \n%\n34\nTable of Contents\nSummary analysis of the Net sales change for New Equipment for 2024 and \n2023\n compared with the prior years was as follows:\nComponents of Net sales change:\n2024\n2023\nOrganic\n(6.4)\n%\n2.6 \n%\nForeign currency translation\n(1.4)\n%\n(2.1)\n%\nAcquisitions/Divestitures, net and Other\n0.1\n \n%\n0.1 \n%\nTotal % change\n(7.7)\n%\n0.6 \n%\n2024\n Compared with 2023\nThe organic sales decrease of (6.4)% was driven by a greater than 20% decline in China, partially offset by mid single-digit organic sales growth in Americas and Asia Pacific and low single-digit organic sales growth in EMEA.\nNew Equipment operating profit decreased $(52) million including foreign exchange headwinds of $(8) million. The impacts of lower volume and unfavorable regional and product mix were partially offset by favorable price, productivity including the benefits from UpLift, and commodity tailwinds. Operating margin decreased 50 basis points.\n2023\n Compared with 2022 \nThe organic sales increase of 2.6% was driven by mid single-digit organic sales growth in EMEA and low single-digit organic sales growth in Americas and Asia.\nNew Equipment operating profit was flat, including $(26) million of foreign exchange headwinds. Higher volume, favorable price, improved productivity and commodity tailwinds were partially offset by regional and product mix headwinds and higher selling, general and administrative costs. Operating margin was flat.\n35\nTable of Contents\nService\nThe Service segment performs maintenance and repair services for both our products and those of other manufacturers and provides modernization services to upgrade elevators and escalators. Maintenance services include inspections to ensure code compliance, preventive maintenance offerings and other customized maintenance offerings tailored to meet customer needs, as well as repair services that address equipment and component wear and tear, and breakdowns. Modernization services enhance equipment operation and improve building functionality. Modernization offerings can range from relatively simple upgrades of interior finishes and aesthetics, to complex upgrades of larger components and sub-systems. Our typical Service customers include building owners, facility managers, housing associations and government agencies that operate buildings where elevators and escalators are installed.\nSummary performance for Service for \n2024, \n2023 and 2022 was as follows:\n \nTotal Increase (Decrease)\nYear-Over-Year for:\n(dollars in millions)\n2024\n2023\n2022\n2024 compared with 2023\n2023 compared with 2022\nNet sales\n$\n8,894\n \n$\n8,397 \n$\n7,801 \n$\n497\n5.9\n \n%\n$\n596\n7.6 \n%\nCost of sales\n5,533\n \n5,173 \n4,791 \n360\n7.0\n \n%\n382\n8.0 \n%\n3,361\n \n3,224 \n3,010 \n137\n4.2\n \n%\n214\n7.1 \n%\nOperating expenses \n1,176\n \n1,210 \n1,178 \n(34)\n(2.8)\n%\n32\n2.7 \n%\nOperating profit\n$\n2,185\n \n$\n2,014 \n$\n1,832 \n$\n171\n8.5\n \n%\n$\n182\n9.9 \n%\nOperating profit margin\n24.6\n \n%\n24.0 \n%\n23.5 \n%\nSummary analysis of the Net sales change for Service f\nor 2024 and 2023 compared with the prior years was as follows:\nComponents of Net sales change:\n2024\n2023\nOrganic\n6.8\n \n%\n7.7 \n%\nForeign currency translation\n(1.2)\n%\n(0.4)\n%\nAcquisitions/Divestitures, net and Other\n0.3\n \n%\n0.3 \n%\nTotal % change\n5.9\n \n%\n7.6 \n%\n2024 \nCompared with 2023\nNet Sales\nThe organic sales increase of 6.8% is due to organic sales increases in maintenance and repair of 5.7% and modernization of 11.7%. \nComponents of Net sales change:\nMaintenance and Repair\nModernization\nOrganic\n5.7\n \n%\n11.7\n \n%\nForeign currency translation\n(1.1)\n%\n(1.5)\n%\nAcquisitions/Divestitures, net and Other\n0.3\n \n%\n0.1\n \n%\nTotal % change\n4.9\n \n%\n10.3\n \n%\nOperating profit\nService operating profit increased $171 million including foreign exchange headwinds of $(21) million. Higher volume, improved pricing on maintenance contracts, and productivity including the benefits from UpLift were partially offset by inflationary pressures, including annual wage increases and higher material costs. Operating margin increased 60 basis points. \n36\nTable of Contents\n2023 Compared with 2022 \nNet Sales\nThe organic sales increase of 7.7% is due to organic sales increases \nin maintenance and repair of 7.8%, and modernization of 7.3%.\nComponents of Net sales change:\nMaintenance and Repair\nModernization\nOrganic\n7.8 \n%\n7.3 \n%\nForeign currency translation\n(0.3)\n%\n(0.8)\n%\nAcquisitions/Divestitures, net and Other\n0.3 \n%\n0.4 \n%\nTotal % change\n7.8 \n%\n6.9 \n%\nOperating Profit\nService operating profit increased $182 million including foreign exchange tailwinds of $4 million, primarily driven by higher volume, improved pricing on maintenance contracts and productivity, which were partially offset by annual wage increases and other inflationary pressures, including higher material costs. Operating margin increased 50 basis points.\nCorporate and Unallocated\n(dollars in millions)\n2024\n2023\n2022\nGeneral corporate expenses and other\n$\n158\n$\n126\n$\n87\nUpLift restructuring\n31\n25\n—\nOther restructuring\n40\n42\n60\nUpLift transformation costs\n65\n16\n—\nSeparation-related adjustments\n177\n—\n—\nRussia operations\n—\n—\n5\nRussia sale and conflict-related charges\n—\n—\n28\nLitigation-related settlement costs\n18\n—\n—\nHeld for sale impairment\n18\n—\n—\nOther, net\n(1)\n—\n—\nTotal Corporate and Unallocated\n$\n506\n$\n209\n$\n180\nGeneral corporate expenses and other increased $32 million and $39 million in 2024 compared to 2023 and 2023 compared to 2022, respectively, primarily due to higher corporate costs and the impact of foreign currency mark-to-market adjustments.\nFor additional discussion of the Separation-related adjustments, litigation-related settlement costs, held for sale impairment and Russia, see \"Note 22: Segment Financial Data\" to the Consolidated Financial Statements in Item 8 in this Form 10-K. For additional discussion of the restructuring and UpLift transformation costs, see \"Note 16: Restructuring and Transformation Costs\" to the Consolidated Financial Statements in Item 8 in this Form 10-K.\n37\nTable of Contents\nLIQUIDITY AND FINANCIAL CONDITION\nWe expect to fund our ongoing operating, investing and financing requirements mainly through cash flows from operations, available liquidity through cash on hand and available bank lines of credit and access to the capital markets. \nAs of December 31, 2024, we had cash and cash equivalents of approximately $2.3 billion, of which approximately 37% was held by the Company's foreign subsidiaries. Domestic cash and cash equivalents as of December 31, 2024 includes amounts that will be used to fund the repayment at maturity of the $1.3 billion 2.056% notes due April 5, 2025. We manage our worldwide cash requirements by reviewing available funds among the many subsidiaries through which we conduct our business and the cost-effectiveness with which those funds can be accessed. On occasion, we are required to maintain cash deposits with certain banks with respect to contractual obligations related to acquisitions and divestitures or other legal obligations. The amount of such restricted cash was $21 million and $6 million as of December 31, 2024 and 2023, respectively.\nFrom time-to-time we may need to access the capital markets to obtain financing. We may incur indebtedness or issue equity as needed. Although we believe that the arrangements in place as of December 31, 2024 permit us to finance our operations on acceptable terms and conditions, our access to, and the availability of, financing on acceptable terms and conditions in the future could be impacted by many factors, including (1) our credit ratings or absence of a credit rating, (2) the liquidity of the overall capital markets and (3) the current state of the economy, including tighter credit conditions. There can be no assurance that we will continue to have access to the capital markets on terms acceptable to us.\nThe following table contains several key measures of our financial condition and liquidity:\n(dollars in millions)\nDecember 31, 2024\nDecember 31, 2023\nCash and cash equivalents\n$\n2,300\n \n$\n1,274 \nTotal debt\n8,324\n \n6,898 \nNet debt (total debt less cash and cash equivalents)\n6,024\n \n5,624 \nTotal equity\n(4,785)\n(4,855)\nTotal capitalization (total debt plus total equity)\n3,539\n \n2,043 \nNet capitalization (total debt plus total equity less cash and cash equivalents)\n1,239\n \n769 \nTotal debt to total capitalization\n235\n \n%\n338 \n%\nNet debt to net capitalization\n486\n \n%\n731 \n%\nThe Company does not intend to reinvest certain undistributed earnings of our international subsidiaries that have been previously taxed in the U.S. For the remainder of the Company’s undistributed international earnings, unless tax effective to repatriate, we will continue to permanently reinvest these earnings.\nBorrowings and Lines of Credit\nThe following is a summary of the long-term debt issuances and repayments in 2024, 2023 and 2022:\n(dollars in millions) \nIssuance Date\nDescription of Debt\nAggregate Principal Balance\nNovember 19, 2024\n2.875% notes due 2027 (€850 million principal value)\n$\n899\nNovember 19, 2024\n5.125% notes due 2031\n600\nAugust 16, 2023\n5.25% notes due 2028\n750\nRepayment Date\nDescription of Debt\nAggregate Principal Paid\nNovember 13, 2023\n0.000% notes due 2023 (€500 million principal value)\n$\n534\nJanuary 14, 2022\nLIBOR plus 45 bps floating rate notes due 2023\n500\n38\nTable of Contents\nA portion of the proceeds from the November 2024 issuance of the Euro and USD notes listed above will be used to fund the repayment at maturity of the Company's currently outstanding $1.3 billion 2.056% notes due April 5, 2025. The remainder of the proceeds were used to fund the repayment of the Company's commercial paper and for other general corporate purposes.\nThe proceeds from the August 2023 issuance of $750 million notes listed above were used to fund the repayments of Otis' commercial paper and €500 million 0.000% notes that were due in November 2023, with the remainder used for other general corporate purposes.\nThere is no commercial paper outstanding as of December 31, 2024. For additional discussion of borrowings, see \"Note 9: Borrowings and Lines of Credit\" in Item 8 of this Form 10-K.\nShare Repurchase Program\nOn December 1, 2022, our Board of Directors approved a share repurchase program for up to $2.0 billion of Common Stock, of which approximately $200 million was remaining as of December 31, 2024. \nOn January 16, 2025, our Board of Directors revoked any remaining share repurchase authority under the prior share repurchase program and approved a new share repurchase program for up to $2.0 billion of Common Stock.\nUnder these programs, shares may be purchased on the open market, in privately negotiated transactions, under accelerated share repurchase programs or under plans complying with Rules 10b5-1 and 10b-18 under the Securities Exchange Act of 1934, as amended.\nDiscussion of Cash Flows\nThe following table reflects the major categories of cash flows. For additional details, see the Consolidated Statements of Cash Flows.\n(dollars in millions)\n2024\n2023\n2022\nNet cash flows provided by (used in):\nOperating activities\n$\n1,563\n$\n1,627\n$\n1,560\nInvesting activities\n(164)\n(183)\n(33)\nFinancing activities\n(309)\n(1,350)\n(3,652)\nEffect of exchange rate changes on cash and cash equivalents\n(49)\n(9)\n(157)\nNet increase (decrease) in cash and cash equivalents and restricted cash\n$\n1,041\n$\n85\n$\n(2,282)\nOperating activities\nCash flows from operating activities primarily represent inflows and outflows associated with our operations. Primary activities include net income from operations adjusted for non-cash transactions, working capital changes and changes in other assets and liabilities. \nThe decrease in net cash provided by operating activities in 2024 compared to 2023 was primarily driven by Separation-related and UpLift-related net payments, approximately $49 million and $86 million, respectively, in 2024, compared to net payments of approximately $25 million and $20 million, respectively, in 2023. Working capital activity includes a smaller decrease in Accounts receivable, net in 2024 compared to 2023 due to the timing of billings and collections, mostly offset by a smaller increase in Accounts payable in 2024 compared to 2023 due to the timing of payments to suppliers and other activity.\nThe increase in net cash provided by operating activities in 2023 compared to 2022 was primarily driven by changes in working capital balances during the periods, including an increase in Accrued liabilities in 2023 compared to a decrease in 2022 due to the timing of income tax payments in the periods, as well as a decrease in Inventories in 2023 compared to an increase in 2022. These were offset by a smaller increase in Accounts payable in 2023 compared to 2022 due to the timing of payments to suppliers and higher balances due as of December 31, 2022 compared to December 31, 2021 and other working capital changes.\n39\nTable of Contents\nDuring 2024, net cash provided by operating activities was $1.6 billion. Net income of $1.7 billion includes approximately $185 million of income taxes benefits and approximately $200 million of interest income, partially offset by $194 million of indemnification expense resulting from the outcome of the German tax litigation during the third quarter of 2024, none of which resulted in cash flow activity during 2024. A decrease in Accounts receivable, net, due to the timing of billings and collections is mostly offset by an increase in Accounts payable due to the timing of payments to suppliers. For additional discussion of the German tax litigation, see \"Note 1: Business Overview\" and \"Note 21: Contingent Liabilities\" in Item 8 of this Form 10-K.\nDuring 2023, net cash provided by operating activities was $1.6 billion. The primary driver of the inflow related to $1.5 billion of net income and an increase in Accounts payable. These were partially offset by an increase in Accounts receivable, net, due to the volume and timing of billings.\nInvesting activities\nCash flows from investing activities primarily represent inflows and outflows associated with long-term assets, including capital expenditures, investments in businesses and securities, proceeds from the sale of fixed assets and the settlement of derivative contracts. \nThe decrease in net cash used in investing activities in 2024 compared to 2023 was primarily driven by the net cash receipts from the settlement of derivative instruments in 2024 compared to net cash payments in 2023 partially offset by acquisitions of businesses and intangible assets. The increase in net cash used in investing activities in 2023 compared to 2022 was primarily driven by net cash payments from the settlement of derivative instruments in 2023 compared to net cash receipts in 2022, as well as the absence of net proceeds from the sale of our business in Russia in 2022.\nDuring 2024, net cash used in investing activities was $164 million. The primary drivers of the outflow related to $126 million of capital expenditures and $87 million of acquisitions of businesses and intangible assets, partially offset by $49 million of net cash receipts from the settlement of derivative instruments. \nDuring 2023, net cash used in investing activities was $183 million. The primary drivers of the outflow related to $138 million of capital expenditures, $36 million of acquisitions of businesses and intangible assets and $28 million of net cash payments from the settlement of derivative instruments.\nAs discussed in \"Note 17: Financial Instruments\" in Item 8 in this Form 10-K, we enter into derivative instruments for risk management purposes. We operate internationally and, in the normal course of business, are exposed to fluctuations in interest rates, foreign exchange rates and commodity prices. These fluctuations can increase the costs of financing, investing and operating the business. We use derivative instruments, including forward contracts and options to manage certain foreign currency and commodity price exposures.\nFinancing activities\nCash flows from financing activities primarily represent inflows and outflows associated with equity and borrowings. Primary activities include short-term and long-term borrowing activity, paying dividends to shareholders, the repurchase of our Common Stock and dividends or other payments to noncontrolling interests. \nThe decrease in net cash used in financing activities in 2024 compared to 2023 was primarily due to the net proceeds from the long-term debt issued in 2024. The decrease in net cash used in financing activities in 2023 compared to 2022 was primarily due to the absence of the settlement of the Tender Offer in 2022.\nDuring 2024, net cash used in financing activities was $309 million. The primary drivers of the outflow were the repurchases of our Common Stock of $1.0 billion, dividends paid on our Common Stock and to noncontrolling shareholders of $606 million and $94 million, respectively, and acquisitions of noncontrolling interest shares of $75 million, including approximately $70 million for our subsidiary in Japan. These were partially offset by the net proceeds from the long-term debt issuance of $1.5 billion.\n40\nTable of Contents\nDuring 2023, net cash used in financing activities was $1.4 billion. The primary drivers of the outflow were the repurchases of our Common Stock of $800 million and dividends paid on our Common Stock and to noncontrolling shareholders of $539 million and $85 million, respectively. Additionally, net repayments of short-term borrowings of $113 million and repayments of long-term debt of $534 million were funded by $741 million of net proceeds from the issuance of long-term debt.\nFor additional discussion of borrowing activity, see \"Note 9: Borrowings and Lines of Credit\" in Item 8 in this Form 10-K.\n41\nTable of Contents\nGuaranteed Securities: Summarized Financial Information\nThe following information is provided in compliance with Rule 13-01 of Regulation S-X under the Securities Exchange Act of 1934, as amended, with respect to the 2026 Euro Notes, the 2027 Euro Notes and the 2031 Euro Notes (together the \"Euro Notes\"), in each case issued by Highland Holdings S.à r.l. (\"Highland\"), a private limited liability company (\nsociété à responsabilité limitée\n) incorporated and existing under the laws of the Grand Duchy of Luxembourg (\"Luxembourg\"). The Euro Notes are fully and unconditionally guaranteed by Otis Worldwide Corporation (\"OWC\") on an unsecured, unsubordinated basis. Refer to \"Note 9: Borrowings and Lines of Credit\" in Item 8 in this Form 10-K for additional information.\nHighland is a wholly-owned, indirect consolidated subsidiary of OWC. OWC is incorporated under the laws of Delaware. As a company incorporated and existing under the laws of Luxembourg, and with its registered office in Luxembourg, Highland is subject to Luxembourg insolvency and bankruptcy laws in the event any insolvency proceedings are initiated against it. Luxembourg bankruptcy law is significantly different from, and may be less favorable to creditors than, the bankruptcy law in effect in the United States and may make it more difficult for creditors to recover the amount they could expect to recover in liquidation under U.S. insolvency and bankruptcy rules.\nThe Euro Notes are not guaranteed by any of OWC's or Highland's subsidiaries (all OWC subsidiaries other than Highland are referred to herein as \"non-guarantor subsidiaries\"). Holders of the Euro Notes will have a direct claim only against Highland, as issuer, and OWC, as guarantor.\nThe following tables set forth the summarized financial information as of and for the years ended December 31, 2024 and 2023 of each of OWC and Highland on a standalone basis, which does not include the consolidated impact of the assets, liabilities, and financial results of their subsidiaries except as noted on the tables below, nor does it include any impact of intercompany eliminations as there were no intercompany transactions between OWC and Highland. This summarized financial information is not intended to present the financial position or results of operations of OWC or Highland in accordance with U.S. GAAP.\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nOWC Statement of Operations - Standalone and Unconsolidated\nRevenue\n$\n—\n$\n—\nCost of revenue\n—\n—\nOperating expenses\n10\n9\nIncome from consolidated subsidiaries\n49\n143\nIncome (loss) from operations excluding income from consolidated subsidiaries\n(191)\n(11)\nNet income (loss) excluding income from consolidated subsidiaries\n(364)\n(119)\nAs of December 31,\n(dollars in millions)\n2024\n2023\nOWC Balance Sheet - Standalone and Unconsolidated\nCurrent assets (intercompany receivables from non-guarantor subsidiaries)\n$\n—\n$\n—\nCurrent assets (excluding intercompany receivables from non-guarantor subsidiaries)\n1,490\n63\nNoncurrent assets (investments in consolidated subsidiaries)\n1,198\n1,236\nNoncurrent assets (excluding investments in consolidated subsidiaries)\n37\n43\nCurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n6,277\n3,753\nCurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n1,625\n119\nNoncurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n—\n—\nNoncurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n5,100\n5,880\n42\nTable of Contents\nYear Ended December 31,\n(dollars in millions)\n2024\n2023\nHighland Statement of Operations - Standalone and Unconsolidated\nRevenue\n$\n—\n$\n—\nCost of revenue\n—\n—\nOperating expenses\n1\n1\nIncome from consolidated subsidiaries\n420\n477\nIncome (loss) from operations excluding income from consolidated subsidiaries\n(1)\n(1)\nNet income (loss) excluding income from consolidated subsidiaries\n(248)\n(196)\nAs of December 31,\n(dollars in millions)\n2024\n2023\nHighland Balance Sheet - Standalone and Unconsolidated\nCurrent assets (intercompany receivables from non-guarantor subsidiaries)\n$\n—\n$\n75\nCurrent assets (excluding intercompany receivables from non-guarantor subsidiaries)\n—\n—\nNoncurrent assets (investments in consolidated subsidiaries)\n15,711\n15,711\nNoncurrent assets (intercompany receivables from non-guarantor subsidiaries)\n460\n518\nNoncurrent assets (excluding investments in consolidated subsidiaries)\n—\n—\nCurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n—\n—\nCurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n4\n1\nCurrent liabilities (intercompany payables from non-guarantor subsidiaries)\n9\n—\nNoncurrent liabilities (intercompany payables to non-guarantor subsidiaries)\n3,513\n3,467\nNoncurrent liabilities (excluding intercompany payables to non-guarantor subsidiaries)\n2,017\n1,199\nCRITICAL ACCOUNTING ESTIMATES\nPreparation of the consolidated financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses. \"Note 2: Summary of Significant Accounting Policies\" in Item 8 in this Form 10-K describes the significant accounting policies used in preparation of the Consolidated Financial Statements. Management believes the most complex and sensitive judgments, because of their significance to the Consolidated Financial Statements, result primarily from the need to make estimates about the effects of matters that are inherently uncertain. The most significant areas involving management judgments and estimates are described below. Actual results in these areas could differ from management’s estimates. \nRevenue Recognition from Contracts with Customers \nWe recognize revenue in accordance with FASB ASC Topic 606: \nRevenue from Contracts with Customers\n and its related amendments,\n \n(referred to, collectively, as \"ASC 606\").\n For new equipment and modernization contracts, equipment and installation are typically procured in a single contract providing the customer with a complete installed elevator or escalator unit. The combination of equipment and installation promises are typically a single performance obligation. For these performance obligations, revenue is recognized over time using costs incurred to date relative to total estimated costs at completion to measure progress. Contract costs are usually incurred over a period of time, which can be several years, and the estimation of these costs requires management’s judgment. Contract costs included in the calculation are comprised of labor, materials, subcontractors’ costs or other direct costs and indirect costs, which include indirect labor costs.\n43\nTable of Contents\nThe long-term nature of the contracts, the complexity of the products and the scale of the projects can affect our ability to estimate costs precisely. In developing our cost estimates, we utilize a combination of our historical costs experience and expected costs considering current circumstances. We review cost estimates for modification on significant new equipment and modernization contracts on a quarterly basis and when circumstances change, and for others, no less frequently than annually or when circumstances change and warrant a modification to a previous estimate. We record changes in contract estimates using the cumulative catch-up method and we review changes in contract estimates for their impact on net sales or operating profit in the Consolidated Financial Statements. Modifications are recognized as a cumulative catch-up or treated as a separate accounting contract if the modification adds distinct goods or services and the modification is priced at its stand-alone selling price.\nSee \"Note 2: Summary of Significant Accounting Policies\" in Item 8 in this Form 10-K.\nIncome Taxes\nThe future tax benefit arising from deductible temporary differences and tax carryforwards was $576 million and $618 million as of December 31, 2024 and 2023, respectively. Management estimates that our earnings during the periods when the temporary differences become deductible will be generally sufficient to realize the related future income tax benefits, which may be realized over an extended period of time. For those jurisdictions where the expiration date of tax carryforwards or the projected operating results indicate that realization is not likely, a valuation allowance is provided. \nIn assessing the need for a valuation allowance, we estimate future taxable income, considering the feasibility of ongoing tax planning strategies and the realizability of tax loss carryforwards. Valuation allowances related to deferred tax assets can be affected by changes to tax laws, changes to statutory tax rates and future taxable income levels. In the event we were to determine that we would not be able to realize all or a portion of our deferred tax assets in the future, we would reduce such amounts through an increase to tax expense in the period in which that determination is made or when tax law changes are enacted. Conversely, if we were to determine that we would be able to realize our deferred tax assets in the future in excess of the net carrying amounts, we would decrease the recorded valuation allowance through a decrease to tax expense in the period in which that determination is made. \nIn the ordinary course of business there is inherent uncertainty in quantifying our income tax positions. We assess our income tax positions and record tax benefits for all years subject to examination based upon management’s evaluation of the facts, circumstances and information available at the reporting date. For those tax positions where it is more likely than not that a tax benefit will be sustained, we have recorded the largest amount of tax benefit with a greater than 50% likelihood of being realized upon \nultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the Consolidated Financial Statements. See \"Note 21: Contingent Liabilities\" in Item 8 in this Form 10-K for discussion of administrative review proceedings with the German Tax Office. \nGoodwill \nWe have generated goodwill as a result of our acquisitions. At the time of acquisition, we account for business acquisitions using the purchase method of accounting, in accordance with which assets acquired and liabilities assumed are recorded at their respective fair values at the acquisition date. The fair value of the consideration paid, including contingent consideration, is assigned to the assets acquired and liabilities assumed based on their respective fair values. Goodwill represents the excess of the purchase price over the estimated fair values of the assets acquired and liabilities assumed.\nWe review our goodwill for impairment on an annual basis at July 1 or more frequently if events or a change in circumstances indicate that the carrying amount may not be recoverable. We test goodwill for impairment at a level within the Company referred to as the reporting unit, which is one level below the operating segment level. We have determined there are three reporting units within each business segment.\n44\nTable of Contents\nIn accordance with Accounting Standards Codification (\"ASC\") 350, \nIntangibles – Goodwill and Other\n, we initially perform a qualitative assessment (commonly known as \"step zero\") to determine whether further impairment testing is necessary before performing the two-step test. The qualitative assessment requires judgments by management about economic conditions including the entity’s operating environment, its industry and other market considerations, entity-specific events related to financial performance or loss of key personnel and other events that could impact the reporting unit. If management concludes, based on assessment of relevant events, facts and circumstances, that it is more likely than not that a reporting unit’s fair value is greater than its carrying value, no further impairment testing is required. If we determine, based on this assessment, that it is more likely than not that the fair value of the reporting unit is less than its carrying value, we perform a quantitative goodwill impairment test by comparing the reporting unit’s fair value with its carrying value. An impairment loss is recognized for the amount by which the reporting unit’s carrying value exceeds its fair value, up to the total amount of goodwill allocated to the reporting unit. No impairment loss is recognized if the fair value of the reporting unit exceeds its carrying value.\nWe completed the annual goodwill impairment test for all of our reporting units \nas of July 1, 2024 and d\netermined that no adjustment to goodwill was necessary as the fair value of each reporting unit was in excess of the carrying value of each reporting unit. \nContingent Liabilities\nOtis is party to litigation related to a n\number of matters as described in \"Note 21: Contingent Liabilities\" in Item 8 in this Form 10-K. In \nparticular, they may include risks associated with contractual, regulatory and other matters, which may arise in the ordinary course of business. The outcome of these matters may have a material effect on the financial position, results of operations or cash flows. Management regularly analyzes current information about these matters and accrues for contingent losses that are probable and reasonably estimable. To assess the exposure to potential liability, we consult with relevant internal and external counsel. In making the decision regarding the need for loss accruals, management considers the degree of probability of an unfavorable outcome and the ability to make a sufficiently reliable estimate of the amount of loss. See Part I, \nItem 1A in this Form 10-K for further discussion.\nEmployee Benefit Plans\nWe sponsor domestic and international defined benefit pension and other postretirement plans. Major assumptions used in the accounting for these employee benefit plans include the discount rate, expected return on plan assets, rate of increase in employee compensation levels and mortality rates. Assumptions are determined based on company data and appropriate market indicators, and are evaluated each year as of December 31. A change in any of these assumptions would have an effect on net periodic pension and postretirement benefit costs reported in the Consolidated Financial Statements.\nIn the following table, we show the sensitivity of our pension plan liabilities to a 25 basis point change in the discount rates for benefit obligations, as of December 31, 2024:\n(dollars in millions)\nIncrease in Discount Rate of 25 bps\nDecrease in Discount Rate of 25 bps\nProjected benefit obligation\n$\n(22)\n$\n23\nThe impact on the net periodic pension (benefit) cost, the accumulated postretirement benefit obligation and the net periodic postretirement (benefit) cost is each less than $1 million. \nPension expense is also sensitive to changes in the expected long-term rate of asset return. An increase or decrease of 25 basis points in the expected long-term rate of asset return would have decreased or increased 2024 pension expense by approximately $2 million. \nThe weighted-average discount rates used to measure pension liabilities and costs utilize each plan’s specific cash flows and are then compared to high-quality bond indices for reasonableness. Global market interest rates decreased in 2024 as compared with 2023, and, as a result, the weighted-average discount rate used to measure pension liabilities was 3.3% in 2024 and 3.4% in 2023. \nSee \"Note 12: Employee Benefit Plans\" in Item 8 in this Form 10-K for further discussion.\n45\nTable of Contents\nOff-Balance Sheet Arrangements and Contractual Obligations\nWe extend a variety of financial guarantees to third parties in support of our business. We also have obligations arising from environmental, health and safety, tax and employment matters. Circumstances that could cause the contingent obligations and liabilities arising from these arrangements to come to fruition include changes in the underlying transaction, non-performance under a contract or deterioration in the financial condition of the guaranteed party.\nOtis' contractual obligations and commitments as of December 31, 2024 are discussed below. See also \"Note 12: Employee Benefit Plans\" in Item 8 of this Form 10-K for further discussion of our expected pension and postretirement contributions.\nLong-term Debt\nSee \"Note 9: Borrowings and Lines of Credit\" in Item 8 of this Form 10-K for further discussion of our long-term debt principal payments as of December 31, 2024. In the following table, we show the timing of payments of interest on long-term debt as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nLong-term debt - future interest\n$\n1,738\n$\n216\n$\n395\n$\n285\n$\n842\nFor long-term debt denominated in foreign currencies, the interest payments above reflect U.S. dollar amounts using foreign currency exchange rates as of \nDecember 31, 2024.\nPurchase Obligations\nPurchase obligations include amounts committed for the purchase of goods and services under legally enforceable contracts or purchase orders. Where it is not practically feasible to determine the legally enforceable portion of our obligation under certain of our long-term purchase agreements, we include additional expected purchase obligations beyond what may be legally enforceable. We enter into contractual purchase commitments with suppliers and service vendors to support our information technology that are either necessary to operate our business or result from implementing strategic initiatives. In the following table, we show the timing of payments of total purchase obligations as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nPurchase obligations\n$\n1,606\n$\n1,062\n$\n477\n$\n67\n$\n—\nOther Long-term Liabilities\nOther long-term liabilities in the table below includes obligations related to product, service and warranty policies, estimated remediation costs and contractual indemnities, and are included in Other long-term liabilities on the \"Consolidated Balance Sheets\" in Item 8 of this Form 10-K. \nThe timing of expected cash flows associated with these obligations is based upon management's estimates over the terms of these agreements and is largely based upon historical experience. \nIn the following table, we show the timing of these payments as of December 31, 2024:\nPayments Due by Period\n(dollars in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nOther long-term liabilities\n$\n192\n$\n10\n$\n105\n$\n14\n$\n63\nThe amounts above include $80 million of non-current contractual payables due to RTX for reimbursement of tax payments that RTX is responsible to pay after the Separation pursuant to the TMA. Otis will reimburse RTX for those tax payments through 2026.\n46\nTable of Contents\nUnrecognized Tax Benefits\nOtis has unrecognized tax benefits\n of $149 million as\n of December 31, \n2024.\n The timing of when such unrecognized tax benefits will become realizable is uncertain. See \"Note 15: Income Taxes\" in Item 8 in this Form 10-K for additional discussion on unrecognized tax benefits.",
  "item2": null
}