{
  "source_file": "oxy-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read together with the Consolidated Condensed Financial Statements and the notes to the Consolidated Condensed Financial Statements, which are included in this report in Part I, Item 1; the information set forth in Risk Factors under Part II, Item 1A; the Consolidated Financial Statements and the notes to the Consolidated Financial Statements, which are included in Part II, Item 8 of Occidental's 2024 Form 10-K; and the information set forth in Risk Factors under Part I, Item 1A of the 2024 Form 10-K.\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS\nPortions of this report contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical fact are “forward-looking statements” for purposes of federal and state securities laws, including, but not limited to: any projections of earnings, revenue or other financial items or future financial position or sources of financing; any statements of the plans, strategies and objectives of management for future operations or business strategy; any statements regarding future economic conditions or performance; any statements of belief; and any statements of assumptions underlying any of the foregoing. Words such as “estimate,” “project,” “predict,” “will,” “would,” “should,” “could,” “may,” “might,” “anticipate,” “plan,” “intend,” “believe,” “expect,” “aim,” “goal,” “target,” “objective,” \"commit,\" \"advance,\" “likely” or similar expressions that convey the prospective nature of events or outcomes are generally indicative of forward-looking statements. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this report unless an earlier date is specified. Unless legally required, Occidental does not undertake any obligation to update, modify or withdraw any forward-looking statements as a result of new information, future events or otherwise.\nActual outcomes or results may differ from anticipated results, sometimes materially. Forward-looking and other statements regarding Occidental's sustainability efforts and aspirations are not an indication that these statements are necessarily material to investors or require disclosure in Occidental's filings with the SEC. In addition, historical, current and forward-looking sustainability-related statements may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve and definitions, assumptions, data sources and estimates or measurements that are subject to change in the future, including through rulemaking or guidance. Factors that could cause results to differ from those projected or assumed in any forward-looking statement include, but are not limited to: Occidental’s ability to consummate the OxyChem Transaction; the possibility that any or all of the conditions to the OxyChem Transaction may not be satisfied or waived, including the failure to obtain the regulatory approvals required for the OxyChem Transaction on the terms expected or on the anticipated schedule or at all; the occurrence of any event, change or other circumstance that could give rise to the termination of the Purchase Agreement; the effect of the pendency of the OxyChem Transaction on our operating results and business generally; that the OxyChem Transaction may not achieve some or all or any of the anticipated benefits, including using a majority of the after-tax sales proceeds for accelerated deleveraging, or be completed in accordance with expected plans and timelines; general economic conditions, including slowdowns and recessions, domestically or internationally; Occidental’s indebtedness and other payment obligations, including the need to generate sufficient cash flows to fund operations; Occidental’s ability to successfully monetize select assets and repay or refinance debt and the impact of changes in Occidental’s credit ratings or future increases in interest rates; assumptions about energy markets; global and local commodity and commodity-futures pricing fluctuations and volatility, exposure to which may be heightened following the completion of the OxyChem Transaction; supply and demand considerations for, and the prices of, Occidental’s products and services; actions by OPEC and non-OPEC oil producing countries; results from operations and competitive conditions; future impairments of Occidental's proved and unproved oil and gas properties or equity investments, or write-downs of productive assets, causing charges to earnings; unexpected changes in costs; government actions (including the effects of announced or future tariff increases and other geopolitical, trade, tariff, fiscal and regulatory uncertainties), war (including the Russia-Ukraine war and conflicts in the Middle East) and political conditions and events; inflation, its impact on markets and economic activity and related monetary policy actions by governments in response to inflation; availability of capital resources, levels of capital expenditures and contractual obligations; the regulatory approval environment, including Occidental's ability to timely obtain or maintain permits or other government approvals, including those necessary for drilling and/or development projects; Occidental's ability to successfully complete, or any material delay of, field developments, expansion projects, capital expenditures, efficiency projects, acquisitions or divestitures; risks associated with acquisitions, mergers and joint ventures, such as difficulties integrating businesses, uncertainty associated with financial projections or projected synergies, restructuring, increased costs and adverse tax consequences; uncertainties and liabilities associated with acquired and divested properties and businesses; uncertainties about the estimated quantities of oil, NGL and natural gas reserves; lower-than-expected production from development projects or acquisitions; Occidental’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes and improve Occidental’s competitiveness; exploration, drilling and other operational risks; disruptions to, capacity constraints in, or other limitations on the pipeline systems that deliver Occidental’s oil and natural gas and other processing and transportation considerations; volatility in the securities, capital or credit markets, including capital market disruptions and instability of financial institutions; health, safety and environmental (HSE) risks, costs and liability under existing or future federal, regional, state, provincial, tribal, local and international HSE laws, regulations and litigation (including related to climate change or remedial actions or assessments); legislative or regulatory changes, including changes relating to hydraulic fracturing or other oil and natural gas operations, retroactive royalty or production tax regimes and deep-water and onshore drilling and permitting regulations; Occidental's ability to recognize intended benefits from its business strategies and initiatives, such as Occidental's low-carbon ventures businesses or announced greenhouse gas emissions reduction targets or net-zero goals; changes in government grant or loan programs; potential liability resulting from pending or future litigation, government investigations and other proceedings; disruption or interruption of production or manufacturing or facility damage due to accidents, chemical releases, labor unrest, weather, power outages, natural disasters, cyber-attacks, terrorist acts or insurgent activity; the scope and duration of global or regional health pandemics or epidemics, and actions taken by government authorities and other third parties in connection therewith; the creditworthiness and performance of Occidental's counterparties, including financial institutions, operating partners and other parties; failure of risk management; Occidental’s ability to retain and hire key personnel; supply, transportation and labor constraints; reorganization or restructuring of Occidental’s operations; changes in state, federal or international tax rates, deductions, incentives or credits; and actions by third parties that are beyond Occidental's control.\nAdditional information concerning these and other factors that may cause Occidental’s results of operations and financial position to differ from expectations can be found in Occidental’s other filings with the SEC, including Occidental’s 2024 Form 10-K, Quarterly Reports on Form 10-Q and Current Reports on Form 8-K.\n26\nCURRENT BUSINESS OUTLOOK\nOccidental’s financial condition, cash flows and levels of expenditures are highly dependent on oil prices and, to a lesser extent, NGL and natural gas prices, the Midland-to-Gulf-Coast oil spreads, chemical product prices and inflationary pressures in the macro-economic environment. The average WTI price per barrel for the three months ended September 30, 2025 was $64.93, compared \nto $63.74 for the three months ended June 30, 2025 and $75.09 for the three months ended September 30, 2024. \nChanges in oil prices could result in adjustments to capital investment levels and allocation, which impact production volumes. Oil prices may remain volatile due to geopolitical risks, the evolving macro-economic environment's impact on energy demand, future actions by OPEC and other oil producing countries, and recent sanction and tariff actions. \nIn April 2025, President Trump announced a sweeping tariff policy that imposes a 10% baseline tariff on the majority of imports, with significantly higher reciprocal rates for certain nations. The United States has since engaged with many countries on trade agreements. Since the announcement, many tariff rates have been paused, modified, or subsequently reinstated, and are the subject of ongoing litigation. While the ultimate outcome of the tariff policy is uncertain, the implementation of these tariffs could have several implications for Occidental's business operations and financial performance as tariffs may be levied on the Company's suppliers which in turn may increase costs and could have a macroeconomic impact on demand and prices at which our products can be sold. \nSTRATEGIC PRIORITIES\nOccidental is focused on delivering a unique shareholder value proposition with its portfolio of oil and gas assets as well as its ongoing development of carbon management and sequestration solutions and GHG emissions reduction efforts. Occidental conducts its operations with a priority on technical expertise, HSE, sustainability and social responsibility. In order to maximize shareholder returns, Occidental will\n:\n■\nMaintain production base to preserve asset base integrity and longevity;\n■\nDeliver a sustainable and growing dividend;\n■\nPrioritize excess cash flow and proceeds from divestitures, including the announced OxyChem Transaction, for deleveraging to reduce principal debt to below $15 billion;\n■\nEnhance its asset base with investments in its cash-generative oil and gas business; and\n■\nAdvance integrated technologies in CO\n2\n, power and midstream to enable differentiated resource recovery and value.\nOXYCHEM TRANSACTION \nIn October 2025, the Company entered into the Purchase Agreement, whereby Berkshire Hathaway will acquire OxyChem for $9.7 billion in an all-cash transaction. Occidental intends to utilize the majority of the after-tax sale proceeds to continue its deleveraging efforts. See \nNote \n5\n - \nA\ncquisitions and Divestitures\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q and \nPart II, Item 1A Risk Factors\n below for additional information regarding the sale of OxyChem.\nDEBT \nAs of September 30, 2025, Occidental’s debt was rated Baa3 by Moody’s Investors Service, BBB- by Fitch Ratings and BB+ by Standard and Poor’s. Any downgrade in credit ratings could impact Occidental's ability to access capital markets and increase its cost of capital. In addition, Occidental or its subsidiaries may be requested, elect to provide or in some cases be required to provide collateral in the form of cash, letters of credit, surety bonds or other acceptable support as financial assurance of their performance and payment obligations under certain contractual arrangements, such as pipeline transportation contracts, oil and gas purchase contracts and certain derivative instruments; certain permits, including with respect to carbon capture, utilization and sequestration activities; and environmental remediation matters.\nIn the nine months ended September 30, 2025, Occidental used cash on hand and proceeds from asset sales and warrant exercises to repay all of the $1.0 billion senior notes due 2025, $1.2 billion of senior notes due 2026, and $1.4 billion of the two-year term loan due 2026. For information on Occidental's debt activity, see \nNote 4 - Long-Term Debt\n \nin the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q for additional information.\n As of September 30, 2025, approximately 94% of Occidental's outstanding debt was fixed rate.\n \nWARRANT EXERCISE\nOn March 3, 2025, Occidental announced an offer to exercise its outstanding publicly traded warrants at a temporarily reduced price of $21.30 per share with an expiration date of March 31, 2025. In April 2025, Occidental issued 41.9 million shares of common stock in return for proceeds of approximately $890 million. The proceeds from the warrant exercise were used to repay near-term debt maturities. See \nNote 4 - Long\n-\nTerm Debt\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q.\n27\nCONSOLIDATED RESULTS OF OPERATIONS AND ITEMS AFFECTING COMPARABILITY\nThe following table sets forth earnings of each operating segment and corporate items:\nmillions\nThree months ended September 30, 2025\n% Change\nThree months ended June 30, 2025\nNet income\nOil and gas \n(a)\n$\n1,300\n \n39 \n%\n$\n934 \nChemical \n(a)\n197\n \n(8)\n%\n213 \nMidstream and marketing \n(a)\n93\n \n90 \n%\n49 \nTotal\n1,590\n \n33 \n%\n1,196 \nUnallocated Corporate Items \n(a)\nInterest expense, net\n(270)\n(2)\n%\n(276)\nIncome tax expense\n(324)\n20 \n%\n(270)\nCorporate and other items, net\n(154)\n(15)\n%\n(182)\nNet income\n$\n842\n \n80 \n%\n$\n468 \nLess: Net income attributable to noncontrolling interest\n(12)\n20 \n%\n(10)\nLess: Preferred stock dividends\n(169)\n(1)\n%\n(170)\nNet income attributable to common stockholders\n$\n661\n \n130 \n%\n$\n288 \nNet income per share attributable to common stockholders - diluted\n$\n0.65\n \n150 \n%\n$\n0.26 \n(a)    \nRefer to the Items Affecting Comparability table which sets forth items affecting Occidental's earnings that vary widely and unpredictably in nature, timing and amount.\nmillions\nNine months ended September 30, 2025\n% Change\nNine months ended September 30, 2024\nNet income\nOil and gas \n(a)\n$\n3,931\n \n(3)\n%\n$\n4,042 \nChemical \n(a)\n595\n \n(30)\n%\n854 \nMidstream and marketing \n(a)\n65\n \n(91)\n%\n714 \nTotal\n4,591\n \n(18)\n%\n5,610 \nUnallocated Corporate Items \n(a)\nInterest expense, net\n(864)\n2 \n%\n(848)\nIncome tax expense\n(981)\n(20)\n%\n(1,223)\nCorporate and other items, net\n(491)\n(6)\n%\n(523)\nIncome from continuing operations\n$\n2,255\n \n(25)\n%\n$\n3,016 \nDiscontinued operations, net of taxes \n—\n \n(100)\n%\n182 \nNet income \n$\n2,255\n \n(29)\n%\n$\n3,198 \nLess: Net income attributable to noncontrolling interest\n(31)\n107 \n%\n(15)\nLess: Preferred stock dividends\n(509)\n— \n%\n(509)\nNet income attributable to common stockholders\n$\n1,715\n \n(36)\n%\n$\n2,674 \nNet income per share attributable to common stockholders - diluted\n$\n1.68\n \n(39)\n%\n$\n2.77 \n(a)    \nRefer to the Items Affecting Comparability table which sets forth items affecting Occidental's earnings that vary widely and unpredictably in nature, timing and amount.\n28\nITEMS AFFECTING COMPARABILITY\nThe following table sets forth items affecting the comparability of Occidental's earnings that vary widely and unpredictably in nature, timing and amount:\nThree months ended\nNine months ended\nmillions\nSeptember 30, 2025\nJune 30, 2025\nSeptember 30, 2025\nSeptember 30, 2024\nOil and gas\nLosses on sales of assets and other, net\n$\n(22)\n$\n— \n$\n(22)\n$\n(572)\nLegal reserves and other\n—\n \n(65)\n(65)\n(54)\nTotal oil and gas\n(22)\n(65)\n(87)\n(626)\nChemical\nLegal reserves and other\n—\n \n— \n(30)\n(6)\nTotal chemical\n—\n \n— \n(30)\n(6)\nMidstream and marketing\nAsset impairments and other charges \n(a)\n—\n \n(162)\n(162)\n(21)\nDerivative gains (losses), net \n(a)\n(31)\n95 \n(20)\n56 \nGains on sales of assets and other, net \n(a)\n—\n \n— \n—\n \n647 \nEquity method investments fair value gain\n61\n \n— \n61\n \n27 \nTotal midstream and marketing\n30\n \n(67)\n(121)\n709 \nCorporate\nAcquisition-related costs and others \n(b)\n(1)\n(6)\n(13)\n(141)\nTotal corporate\n(1)\n(6)\n(13)\n(141)\nIncome tax impact on items affecting comparability\n5\n \n30 \n61\n \n2 \nIncome tax impact on Algeria contract renewal\n—\n \n— \n—\n \n(20)\nGain (loss)\n12\n \n(108)\n(190)\n(82)\nDiscontinued operations, net of taxes\n—\n \n— \n—\n \n182 \nTotal\n$\n12\n \n$\n(108)\n$\n(190)\n$\n100 \n(a)    \nIncluded amounts from income from equity investments and other in the Consolidated Condensed Statement of Operations.\n(b)    \nThe nine months ended September 30, 2024 included $66 million of financing costs related to the CrownRock Acquisition. The remaining amounts for each period are related to CrownRock transaction costs.\nQ3 2025 compared to Q2 2025\nExcluding the impact of items affecting comparability, net income for the three months ended September 30, 2025, compared to the three months ended June 30, 2025, increased due to higher crude oil sales volumes worldwide and higher domestic oil prices in the oil and gas segment, partially offset by lower Waha-to-Gulf-Coast gas spreads in the midstream and marketing segment. \nYTD 2025 compared to YTD 2024\nExcluding the impact of items affecting comparability, net income for the nine months ended September 30, 2025, compared to the same period in 2024, decreased primarily due to lower crude oil prices in the oil and gas segment and higher ethylene and energy costs in the chemical segment, partially offset by higher sales volumes in the oil and gas segment due to a full nine months of production from CrownRock assets in 2025 and higher Waha-to-Gulf-Coast gas spreads in the midstream and marketing segment.\n29\nSELECTED STATEMENTS OF OPERATIONS ITEMS\nQ3 2025 compared to Q2 2025\nNet sales of $6.6 billion increased for the three months ended September 30, 2025, compared to $6.4 billion for the three months ended June 30, 2025, primarily due to higher domestic oil prices and higher sales volumes in the oil and gas segment, partially offset by lower Waha-to-Gulf-Coast gas spreads in the midstream and marketing segment.\nYTD 2025 compared to YTD 2024\nDepreciation, depletion and amortization of $5.9 billion increased for the nine months ended September 30, 2025, compared to $5.4 billion for the same period in 2024, primarily due to a full nine months of production from the CrownRock assets.\nIncome from equity investments and other of $333 million decreased for the nine months ended September 30, 2025, compared to $709 million for the same period in 2024, primarily due to Occidental's share of losses recognized by its investee, Net Power.\nSEGMENT RESULTS OF OPERATIONS\n \nSEGMENT RESULTS OF OPERATIONS\nOccidental’s principal businesses consist of three reporting segments: oil and gas, chemical and midstream and marketing. The oil and gas segment explores for, develops and produces oil and condensate, NGL and natural gas. The chemical segment is operated by our subsidiary OxyChem, which mainly manufactures and markets basic chemicals and vinyls. The midstream and marketing segment purchases, markets, gathers, processes, transports and stores oil (which includes condensate), NGL, natural gas, CO\n2\n and power. It also optimizes its transportation and storage capacity and invests in entities that conduct similar activities such as WES. \nThe midstream and marketing segment also includes Occidental's low-carbon ventures businesses. Occidental's low-carbon ventures businesses seek to leverage Occidental’s legacy of carbon management experience to develop carbon capture, utilization and sequestration projects, including the commercialization of direct air capture technology, invest in other low-carbon technologies intended to reduce greenhouse gas emissions from Occidental's operations and strategically partner with other industries to help reduce their emissions.\nOIL AND GAS SEGMENT\nThe following table sets forth the average sales volumes per day for oil and NGL in Mbbl and for natural gas in MMcf:\nThree months ended\nNine months ended\nSeptember 30, 2025\nJune 30, 2025\nSeptember 30, 2025\nSeptember 30, 2024\nSales Volumes per Day\nOil (Mbbl)\nUnited States\n634\n \n604 \n614\n \n551 \nInternational\n114\n \n110 \n109\n \n104 \nNGL (Mbbl)\nUnited States \n298\n \n279 \n284\n \n266 \nInternational\n39\n \n37 \n38\n \n38 \nNatural Gas (MMcf)\nUnited States \n1,770\n \n1,701 \n1,736\n \n1,423 \nInternational\n528\n \n500 \n509\n \n516 \nTotal Sales Volumes (Mboe) \n(a)\n1,468\n \n1,397 \n1,419\n \n1,282 \n(a)    \nNatural gas volumes have been converted to Boe based on energy content of six Mcf of gas to one barrel of oil. Conversion to Boe does not necessarily result in price equivalency.\n30\nThe following table presents information about Occidental's average realized prices and index prices:\nThree months ended\nNine months ended\nSeptember 30, 2025\nJune 30, 2025\nSeptember 30, 2025\nSeptember 30, 2024\nAverage Realized Prices\nOil ($/Bbl)\nUnited States\n$\n64.55\n$\n62.83\n$\n66.01\n$\n76.68\nInternational\n$\n66.03\n$\n68.88\n$\n69.03\n$\n79.07\nTotal Worldwide\n$\n64.78\n$\n63.76\n$\n66.46\n$\n77.06\nNGL ($/Bbl)\nUnited States\n$\n18.98\n$\n20.05\n$\n21.46\n$\n20.22\nInternational\n$\n24.40\n$\n25.72\n$\n25.97\n$\n28.31\nTotal Worldwide\n$\n19.60\n$\n20.71\n$\n21.99\n$\n21.22\nNatural Gas ($/Mcf)\nUnited States\n$\n1.48\n$\n1.33\n$\n1.74\n$\n0.81\nInternational\n$\n1.89\n$\n1.90\n$\n1.89\n$\n1.89\nTotal Worldwide\n$\n1.57\n$\n1.46\n$\n1.78\n$\n1.10\nAverage Index Prices\nWTI oil ($/Bbl)\n$\n64.93\n$\n63.74\n$\n66.70\n$\n77.54\nBrent oil ($/Bbl)\n$\n68.14\n$\n66.59\n$\n69.87\n$\n81.73\nNYMEX gas ($/Mcf)\n$\n3.28\n$\n3.68\n$\n3.53\n$\n2.24\nAverage Realized Prices as Percentage of Average Index Prices\nWorldwide oil as a percentage of average WTI\n100\n \n%\n100 \n%\n100\n \n%\n99 \n%\nWorldwide oil as a percentage of average Brent\n95\n \n%\n96 \n%\n95\n \n%\n94 \n%\nWorldwide NGL as a percentage of average WTI\n30\n \n%\n32 \n%\n33\n \n%\n27 \n%\nDomestic natural gas as a percentage of average NYMEX\n45\n \n%\n36 \n%\n49\n \n%\n36 \n%\nQ3 2025 compared to Q2 2025\nOil and gas segment earnings were $1.3 billion for the three months ended September 30, 2025, compared with segment earnings of $0.9 billion for the three months ended June 30, 2025. Excluding the impact of items affecting comparability, oil and gas segment earnings increased due to higher crude oil sales volumes worldwide and higher domestic oil prices.\nAverage daily sales volumes increased for the three months ended September 30, 2025, compared to the three months ended June 30, 2025, mainly due to higher production from current year drilling plans in the Midland Basin.\nYTD 2025 compared to YTD 2024\nOil and gas segment earnings were $3.9 billion for the nine months ended September 30, 2025, compared to $4.0 billion for the nine months ended September 30, 2024. Excluding the impact of items affecting comparability, oil and gas segment earnings decreased primarily due to lower crude oil prices, partially offset by higher sales volumes due to a full nine months of production from CrownRock assets in 2025.\nAverage daily sales volumes increased for the nine months ended September 30, 2025, compared to the same period in 2024, mainly due to the CrownRock Acquisition.\n31\nThe following table presents an analysis of the impacts of changes in average realized prices and sales volumes with regard to Occidental's domestic and international oil and gas revenue:\nIncrease (Decrease) Related to\nmillions\nThree months ended June 30, 2025 \n(b)\nPrice Realizations\nNet Sales Volumes\nThree months ended September 30, 2025 \n(b)\nUnited States Revenue\nOil\n$\n3,456 \n$\n98 \n$\n210 \n$\n3,764\n \nNGL\n457 \n(27)\n39 \n469\n \nNatural gas\n205 \n21 \n14 \n240\n \nTotal\n$\n4,118 \n$\n92 \n$\n263 \n$\n4,473\n \nInternational Revenue\nOil \n(a)\n$\n690 \n$\n(30)\n$\n35 \n$\n695\n \nNGL\n86 \n(4)\n6 \n88\n \nNatural gas\n88 \n(1)\n4 \n91\n \nTotal\n$\n864 \n$\n(35)\n$\n45 \n$\n874\n \nIncrease (Decrease) Related to\nmillions\nNine months ended September 30, 2024 \n(b)\nPrice Realizations\nNet Sales Volumes\nNine months ended September 30, 2025 \n(b)\nUnited States Revenue\nOil\n$\n11,564 \n$\n(1,796)\n$\n1,282 \n$\n11,050\n \nNGL\n1,314 \n129 \n61 \n1,504\n \nNatural gas\n314 \n534 \n(22)\n826\n \nTotal\n$\n13,192 \n$\n(1,133)\n$\n1,321 \n$\n13,380\n \nInternational Revenue\nOil \n(a)\n$\n2,259 \n$\n(255)\n$\n56 \n$\n2,060\n \nNGL\n293 \n(23)\n— \n270\n \nNatural gas\n269 \n1 \n(7)\n263\n \nTotal\n$\n2,821 \n$\n(277)\n$\n49 \n$\n2,593\n \n(a)     \nIncludes the impact of international production sharing contracts.\n(b)    \nExcludes \"other\" oil and gas revenue. See \nNote 2 - Revenue\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q for additional information regarding other revenue.\nCHEMICAL SEGMENT\nQ3 2025 compared to Q2 2025\nChemical segment earnings for the three months ended September 30, 2025 were $197 million, compared to $213 million for the three months ended June 30, 2025. The decline in the third quarter of 2025 resulted primarily from lower realized prices and volumes across most product lines, partially offset by favorable raw material costs.\nYTD 2025 compared to YTD 2024\nChemical segment earnings for the nine months ended September 30, 2025 were $595 million, compared to $854 million for the nine months ended September 30, 2024. Excluding items affecting comparability, the decrease in pre-tax income resulted from lower realized pricing across most product lines, primarily PVC, and higher raw material and energy costs.\n32\nMIDSTREAM AND MARKETING SEGMENT\nQ3 2025 compared to Q2 2025\nMidstream and marketing segment earnings for the three months ended September 30, 2025 were $93 million, compared to segment earnings of $49 million for the three months ended June 30, 2025. Excluding the impact of items affecting comparability, midstream and marketing third quarter results decreased due to lower Waha-to-Gulf-Coast gas spreads and higher expenses due to the increase in activities in the low-carbon ventures businesses, partially offset by higher sulfur prices at Al Hosn and higher WES equity method investment income.\nYTD 2025 compared to YTD 2024\nMidstream and marketing segment earnings for the nine months ended September 30, 2025 were $65 million, compared to segment earnings of $714 million for the nine months ended September 30, 2024. Excluding the impact of items affecting comparability, midstream and marketing results increased due to higher sulfur prices at Al Hosn, higher Waha-to-Gulf-Coast gas spreads, and lower long-haul crude transportation costs, partially offset by higher losses from equity method investees and higher expenses due to the increase in activities in the low-carbon ventures businesses.\nINCOME TAXES\nThe\n following table sets forth the calculation of the worldwide effective tax rate for income:\nThree months ended\nNine months ended\nmillions, except percentages\nSeptember 30, 2025\nJune 30, 2025\nSeptember 30, 2025\nSeptember 30, 2024\nIncome before income taxes\n$\n1,166\n \n$\n738 \n$\n3,236\n \n$\n4,239 \nIncome tax expense\nDomestic - federal and state\n(163)\n(65)\n(465)\n(700)\nInternational\n(161)\n(205)\n(516)\n(523)\nTotal income tax expense\n(324)\n(270)\n(981)\n(1,223)\nIncome from continuing operations\n$\n842\n \n$\n468 \n$\n2,255\n \n$\n3,016 \nWorldwide effective tax rate\n28\n \n%\n37 \n%\n30\n \n%\n29 \n%\nOccidental estimates its annual effective income tax rate in recording its quarterly provision for income taxes in the various jurisdictions in which Occidental operates, adjusted for certain discrete items. Each quarter, Occidental updates these rates and records a cumulative adjustment to its income taxes by applying the rates to the pre-tax income excluding certain discrete items. Occidental’s quarterly estimate of its effective tax rates can vary significantly based on various forecasted items, including future commodity prices, capital expenditures, expenses for which tax benefits are not recognized and the geographic mix of pre-tax income and losses. \nThe worldwide effective tax rates for the periods presented in the table above are primarily driven by Occidental's jurisdictional mix of income. U.S. income is taxed at a U.S. federal statutory rate of 21%, while international income is subject to tax at statutory rates as high as 55%. \nRECENT TAX LEGISLATION\nFor additional information on the potential impacts to Occidental related to the OBBB, IRA, and Pillar Two initiative, see \nNote 7 - Income Taxes\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q.\nLIQUIDITY AND CAPITAL RESOURCES\nSOURCES AND USES OF CASH\nAs of September 30, 2025, Occidental's sources of liquidity included\n \n$2.2 billion of cash and cash equivalents and $4.15 billion of borrowing capacity under its RCF, which matures on June 30, 2028. Following the close of the OxyChem Transaction, which is anticipated to close in the fourth quarter of 2025, Occidental intends to use the majority of the after-tax proceeds of the sale to further reduce debt by approximately $6.5 billion. There were no borrowings outstanding on Occidental's RCF as of September 30, 2025.\n33\nOperating Cash Flows\nOperating cash flow from continuing operations was $7.9 billion for the nine months ended September 30, 2025, compared to $8.2 billion for the nine months ended September 30, 2024. The decrease in operating cash flow from continuing operations, compared to the same period in 2024, was primarily due to higher income tax payments as certain tax payments related to 2024 were deferred into 2025 and higher interest payments due to the debt issued for the CrownRock Acquisition.\nInvesting Cash Flows\nOccidental’s net cash used by investing activities was $4.0 billion for the nine months ended September 30, 2025, compared to $12.8 billion for the nine months ended September 30, 2024. Investing activities for the nine months ended September 30, 2025 included $2.2 billion in divestitures of non-core oil and gas assets, compared to $1.7 billion in divestitures of non-core oil and gas assets for the nine months ended September 30, 2024. See \nNote 5 - Acquisitions and Divestitures\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q for additional information. \nCapital expenditures, of which the majority were for the oil and gas segment, were $5.7 billion for the nine months ended September 30, 2025, compared to $5.2 billion for the nine months ended September 30, 2024. \nFinancing Cash Flows\nOccidental’s net cash used by financing activities was $3.9 billion for the nine months ended September 30, 2025, which included payments of long-term debt of $3.6 billion and payments of common and preferred cash dividends of approximately $1.2 billion, partially offset by cash received of approximately $900 million related to warrant exercises. See \nNote 4 - Long-Term Debt\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q.\nNet cash provided by financing activities for the nine months ended September 30, 2024 was $5.0 billion, which included net proceeds from debt issuance of $9.6 billion and proceeds from the issuance of common stock of $571 million primarily related to warrant exercises, offset by payments of long-term debt of $4.0 billion and payments of common and preferred cash dividends of $1.1 billion.\nOccidental’s Zero Coupons can be put to Occidental in October of each year, in whole or in part, for the then accreted value of the outstanding Zero Coupons. The Zero Coupons can next be put to Occidental in October 2026, which, if put in whole, would require a payment of  $401 million at such date. Occidental currently has the ability to meet this obligation and may use available capacity under the RCF to satisfy the put should it be exercised.\nAs of the date of this filing, Occidental was in compliance with all covenants in its financing agreements. As of the date of this filing, Occidental has no remaining debt maturities due in 2025, $1.6 billion in 2026, $1.5 billion in 2027 and $17.7 billion thereafter. Occidental terminated its receivables securitization facility effective September 26, 2025. Occidental currently expects its cash on hand, operating cash flows and funds available from the RCF to be sufficient to meet its near-term debt maturities, operating expenditures, capital expenditures and other obligations for the next 12 months from the date of this filing.\nOccidental or its subsidiaries have provided financial assurances through a combination of cash, letters of credit and surety bonds. As of September 30, 2025, Occidental had no outstanding letters of credit under the RCF. \nFor additional information, see Risk Factors in Part I, Item 1A of Occidental’s 2024 Form 10-K and \nP\nart II\n,\n Item\n \n1A R\nisk Factors\n below.\nENVIRONMENTAL LIABILITIES AND EXPENDITURES\nOccidental’s operations are subject to stringent federal, regional, state, provincial, tribal, local and international laws and regulations related to improving or maintaining environmental quality. Occidental’s environmental compliance costs have generally increased over time and are expected to rise in the future. Occidental factors environmental expenditures for its operations as an integral part of its business planning process.\nThe laws that require or address environmental remediation, including CERCLA and similar federal, regional, state, provincial, tribal, local and international laws, may apply retroactively and regardless of fault, the legality of the original activities or the current ownership or control of sites. Occidental or certain of its subsidiaries participate in or actively monitor a range of remedial activities and government or private proceedings under these laws with respect to alleged past practices at Third-Party, Currently Operated, and Closed or Non-Operated Sites, in addition to NPL Sites. Remedial activities may include one or more of the following: investigation involving sampling, modeling, risk assessment or monitoring; cleanup measures including removal, treatment or disposal; or operation and maintenance of remedial systems. The environmental proceedings seek funding or performance of remediation and, in some cases, compensation for alleged property damage, natural resource damages, punitive damages, civil penalties, injunctive relief and government oversight costs.\n34\nSee \nNote 8 - Environmental Liabilities and Expenditures\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q and the Environmental Liabilities and Expenditures section of Management’s Discussion and Analysis of Financial Condition and Results of Operations in the 2024 Form 10-K for additional information regarding Occidental’s environmental liabilities and expenditures.\nLAWSUITS, CLAIMS, COMMITMENTS AND CONTINGENCIES\nOccidental accrues reserves for outstanding lawsuits, claims and proceedings when it is probable that a liability has been incurred and the liability can be reasonably estimated. Occidental has disclosed its reserve balances for environmental remediation matters and its estimated range of reasonably possible additional losses for such matters. See \nNote 8 - Environmental Liabilities and Expenditures\n and \nNote 9 - Lawsuits, Claims, Commitments and Contingencies\n in the Notes to Consolidated Condensed Financial Statements in Part I, Item 1 of this Form 10-Q for further information."
}