{
  "source_file": "oxy-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read together with the Consolidated Financial Statements and the Notes to Consolidated Financial Statements, which are included in this Form 10-K in Item 8 and the information set forth in Risk Factors under Part 1, Item 1A. The following sections include a discussion of results for fiscal 2024 compared to fiscal 2023 as well as certain 2022 results. The comparative results for fiscal 2023 with fiscal 2022 generally have not been included in this Form 10-K, but may be found in “Part II - Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the Company’s Annual Report on Form 10-K for the year ended December 31, 2023.\nINDEX\nPAGE\nCurrent Business Outlook and \nStrategy\n28\nOil and Gas Segment\n30\nChemical Segment\n39\nMidstream and Marketing Segment\n40\nSegment Results of Operations and \nItems Affecting Comparability\n42\nIncome Taxes\n47\nConsolidated Results of Operations\n48\nLiquidity and Capital Resources\n49\nLawsuits, Claims, Commitments and Contingencies\n51\nEnvironmental \nExpenditures\n52\nGlobal\n Investments\n52\nCritical Accounting Policies and Estimates\n53\nSafe Harbor Discussion Regarding Outlook and Other Forward-Looking Data\n57\nOXY\n 2024 FORM 10-K\n27\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nCURRENT BUSINESS OUTLOOK AND STRATEGY\nGENERAL\nOccidental’s operations, financial condition, cash flows and levels of expenditures are highly dependent on oil prices and, to a lesser extent, NGL and natural gas prices, Midland-to-Gulf-Coast oil spreads, chemical product prices and inflationary pressures in the macro-economic environment. In 2024, compared to 2023, the average annual WTI price per barrel decreased to $75.72 from $77.64, and the average annual Brent price per barrel decreased to $79.79 from $82.25. It is expected that the price of oil will be volatile for the foreseeable future given the current geopolitical risks, impact of the evolving macro-economic environment on energy demand, future actions by OPEC and non-OPEC oil producing countries, geopolitical risks, and the U.S. Government's management of the U.S. Strategic Petroleum Reserve. Seasonality is not a primary driver of changes in Occidental's consolidated quarterly earnings.\nOccidental works to manage inflation impacts by capitalizing on operational efficiencies, locking in pricing on longer term contracts and working closely with vendors to secure the supply of critical materials. As of December 31, 2024, approximately 89% of Occidental's outstanding debt was fixed rate.\nSTRATEGY\nOccidental is focused on delivering a unique shareholder value proposition with its portfolio of oil and gas, chemicals and midstream and marketing assets as well as its ongoing development of carbon management and storage solutions and GHG emissions reduction efforts. Occidental conducts its operations with a priority on HSE, sustainability and social responsibility. In order to maximize shareholder returns, Occidental will:\n■    Maintain production base to preserve asset base integrity and longevity;\n■    Deliver a sustainable and growing dividend;\n■    Enhance its asset base and reserves with investments in its cash-generative oil and gas and chemical businesses;\n■    Advance technologies and decarbonization solutions to develop a sustainable low-carbon business; and\n■    Prioritize excess cash flow and the proceeds from asset divestitures for deleveraging until principal debt is below $15 billion.\nCAPITAL INVESTMENT \nIn 2024, Occidental invested $7.0 billion in high-return assets to generate long-term free cash flow throughout the commodity cycle. In addition, Occidental completed its $12.4 billion acquisition of CrownRock. In 2025, Occidental intends to complete the full integration of CrownRock assets, personnel and systems, as well as make progress towards the completion of asset divestitures announced in conjunction with the CrownRock Acquisition.\nDEBT \n As of December 31, 2024, principal debt outstanding was $24.4 billion, of which $1.0 billion is due in in 2025, $4.1 billion in 2026, $1.5 billion in 2027, $0.9 billion in 2028, and $16.9 billion due in 2029 and thereafter.\nIn connection with the CrownRock Acquisition, Occidental issued $9.7 billion in new debt in July 2024 and assumed $1.2 billion of existing CrownRock debt in August 2024. Occidental's credit ratings were reaffirmed by credit agencies concurrent with issuance of new debt. In 2024, Occidental used proceeds from divestitures and cash on hand to repay $4.5 billion of debt, which included the satisfaction and discharge of the 5.000% senior notes due 2029 that were assumed with the CrownRock Acquisition. For information on Occidental's debt activity, see \nNote \n6\n - Long-Term Debt\n in the notes to the Consolidated Condensed Financial Statements in Part II, Item 8 of this Form 10-K for additional information.\nSHAREHOLDER RETURN PRIORITIES\nCapital is returned to shareholders through Occidental’s dividend and share repurchases. In 2024, Occidental declared dividends to common shareholders of $814 million, or $0.88 per share. As of December 31, 2024, $1.2 billion remained of Occidental’s $3.0 billion share repurchase program, which the Board authorized in February 2023. Following the CrownRock Acquisition, Occidental’s shareholder return priorities are to provide a sustainable and growing dividend and reduce the principal of outstanding debt below $15 billion, before resuming share repurchases.\nSUSTAINABILITY STRATEGY\nOccidental’s sustainability strategy is organized around four pillars: principles of governance, people, planet, and prosperity. Occidental integrates these sustainability pillars into our strategic planning and investment decision-making processes.\n28\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nIn 2020, Occidental was the first U.S. oil and gas company to announce goals to achieve net-zero GHG emissions for its total emissions inventory including use of sold products. These goals include achieving net-zero GHG emissions (i) from its operations and energy use before 2040, with an ambition to do so before 2035, and (ii) from its total carbon inventory, including the use of its sold products, with an ambition to do so before 2050. In 2020, Occidental also set various interim targets, including 2025 carbon and methane intensity targets, and Occidental was the first U.S. oil and gas company to endorse the World Bank’s initiative for zero routine flaring by 2030. In 2022, the Board of Directors adopted Occidental’s updated HSE and Sustainability Principles, based on engagement with shareholders, employees and other stakeholders. The Principles reinforce the alignment among Occidental’s core values, goals and strategies, underpin its Operating Management System, and help to guide the workforce across its businesses. In 2023, Oxy was an original signatory to the Oil and Gas Decarbonization Charter, committed funding to the World Bank’s Global Flaring and Methane Reduction Partnership, and established a new, medium-term 2030 methane intensity target.\nOccidental seeks to meet its sustainability and environmental goals through its development and commercialization of technologies that lower both GHG emissions from industrial processes and existing atmospheric concentrations of CO\n2\n. Occidental believes that carbon removal technologies, including DAC and CCUS, can, with incentives necessary for their development and deployment, provide essential CO\n2\n reductions to assist the world’s transition to a less carbon-intensive economy. Through fiscal year 2023, Occidental reduced estimated methane emissions by approximately 65% from 2019 and 16% from 2022, along with a 20% reduction in CO\n2\n equivalent emissions since 2019. The following actions helped Occidental advance its low-carbon business strategy in 2024:\n■\nSTRATOS construction is progressing on schedule, with commissioning and start-up of operations expected in mid-2025;\n■\nActively progressed its sequestration hub plans, including drilling stratigraphic data wells at multiple sequestration hub site locations, submitting 21 cumulative Class VI CO\n2\n injection well permit applications across its five proposed hub sites by year-end 2024, and signing award contracts in 2024 with the DOE for two of Occidental’s sequestration hubs that were awarded grants under the DOE’s Carbon Storage Assurance Facility Enterprise Initiative in 2023; and\n■\nAchieved a global 80% reduction in routine flaring of gas in 2024 from its 2020 baseline through a rich gas injection project that recovers flared gas for injection for enhanced oil production and commissioning additional compression in Oman in 2024 while U.S. oil and gas operations sustained zero routine flaring.\nThe future costs associated with emissions reduction, carbon removal and CCUS to meet Occidental’s long-term net-zero GHG goals may be substantial and the execution of its plans and net-zero pathway depends on securing third-party capital investments. As reflected by the joint venture with BlackRock, Occidental is pursuing multiple avenues to fund these projects including project financing, long-term carbon removal or CCUS agreements, and identifying business opportunities with stakeholders in carbon-intensive industries.\nKEY PERFORMANCE INDICATORS\nOccidental seeks to meet its strategic goals by continually measuring its success against key performance indicators that drive total stockholder return. In addition to efficient capital allocation and deployment discussed below in the section titled “\nOil and Gas Segment - Business Strategy\n”\n,\n Occidental believes its most significant performance indicators are: \nOPERATIONAL\n■\nTotal spend per barrel - In 2025, Occidental will continue to focus on controlling total costs from a per-barrel perspective. Total spend per barrel is the sum of capital spending, general and administrative expenses, other operating and non-operating expenses and oil and gas lease operating costs divided by global oil, NGL and natural gas sales volumes.\n■\nDaily production - Occidental seeks to maximize field operability and minimize production down-time. \nFINANCIAL\n■\nCROCE - CROCE is calculated as (i) the cash flows from operating activities, before changes in working capital, plus distributions from WES classified as investing cash flows, divided by (ii) the average of the opening and closing balances of total equity plus total debt.\n■\nCredit rating - Improve financial leverage to a level well within investment grade credit metrics.\nSUSTAINABILITY AND ENVIRONMENTAL\n■\nSpecific interim emissions reduction and emissions intensity targets to advance the goal of net-zero operational and energy use emissions before 2040, with an ambition to achieve before 2035.\n■\nMilestones in specific carbon removal and CCUS projects that advance a net-zero total emissions inventory, including use of sold products, with an ambition to achieve before 2050.\n■\nFacilitate deployment of carbon removal, CCUS and other solutions to advance total carbon impact past 2050.\nOXY\n 2024 FORM 10-K\n29\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOIL AND GAS SEGMENT\nBUSINESS STRATEGY\nOccidental’s oil and gas segment focuses on long-term value creation in the key performance indicators noted above of total spend per barrel, field operability, daily production, and leadership through our HSE and sustainability initiatives. In each core operating area, Occidental’s operations benefit from scale, technical expertise, decades of high-margin inventory, HSE leadership and commercial and governmental collaboration. These attributes allow Occidental to bring additional production quickly to market, extend the life of older fields at lower costs and provide low-cost returns-driven growth opportunities with advanced technology. \nOccidental is one of the largest U.S. producers of liquids, which includes oil and NGL, enabling it to maximize cash margins on a per barrel basis. The advantages that Occidental’s portfolio provides, coupled with its advanced subsurface characterization expertise and the proven ability to execute, position it for full-cycle success in the years ahead. The oil and gas segment maximizes efficiencies to deliver lower breakeven costs and generate excess free cash flow and also strives to achieve low development and operating costs to maximize full-cycle value of the assets.\nThe oil and gas segment implements Occidental’s strategy primarily by:\n■\nOperating and developing areas where reserves are known to exist and optimizing capital intensity in core areas, primarily in the Permian Basin, DJ Basin, Gulf of America, Algeria, Oman, Qatar and the UAE;\n■\nMaintaining a disciplined and prudent approach to capital expenditures with a focus on high-return, short and mid-cycle, cash-flow-generating opportunities and an emphasis on creating value and further enhancing Occidental’s existing positions;\n■\nFocusing Occidental’s subsurface characterization and technical activities on both conventional and unconventional resources;\n■\nUsing secondary and tertiary recovery techniques in mature fields; and\n■\nFocusing on cost-reduction efficiencies and innovative technologies to reduce carbon emissions.\nIn 2024, oil and gas capital expenditures, including exploration, were approximately $5.3 billion and primarily focused on Occidental’s assets in the Permian Basin, DJ Basin, Gulf of America and Oman. In 2025, Occidental plans to spend $5.8 billion to $6.0 billion to develop its oil and gas assets.\nIn August 2024, Occidental acquired CrownRock for total consideration of $12.4 billion, consisting of $9.4 billion of cash consideration (inclusive of certain working capital and other customary purchase price adjustments), 29.6 million shares of common stock of Occidental, and the assumption of $1.2 billion of existing debt of CrownRock, adding to Occidental's oil and gas portfolio in the Permian Basin.\nOIL AND GAS PRICE ENVIRONMENT\nOil and gas prices are the major variables that drive the industry’s financial performance. The following table presents the average daily WTI and Brent prices for oil and NYMEX natural gas prices for 2024 and 2023:\n2024\n2023\n% Change\nWTI Oil ($/Bbl)\n$\n75.72\n \n$\n77.64 \n(2)\n%\nBrent Oil ($/Bbl)\n$\n79.79\n \n$\n82.25 \n(3)\n%\nNYMEX Natural Gas ($/Mcf)\n$\n2.34\n \n$\n2.94 \n(20)\n%\n \nThe following table presents Occidental’s average realized prices for continuing operations as a percentage of WTI, Brent and NYMEX for 2024 and 2023:\n2024\n2023\nWorldwide oil as a percentage of average WTI\n99\n \n%\n99 \n%\nWorldwide oil as a percentage of average Brent\n94\n \n%\n93 \n%\nWorldwide NGL as a percentage of average WTI\n28\n \n%\n27 \n%\nWorldwide NGL as a percentage of average Brent\n27\n \n%\n26 \n%\nDomestic natural gas as a percentage of NYMEX\n40\n \n%\n69 \n%\n \nPrices and differentials can vary significantly, even on a short-term basis, making it difficult to predict realized prices with a reliable degree of certainty.\n30\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nDOMESTIC INTERESTS\nBUSINESS REVIEW\nOccidental conducts its domestic operations through land leases, subsurface mineral rights it owns, or a combination of both. Occidental’s domestic oil and gas leases have a primary term ranging from one to 10 years, which is extended through the end of production once it commences. Occidental has leasehold and mineral interests in 9.3 million net acres, of which approximately 51% is leased, 48% is owned subsurface mineral rights and 1% is owned land with mineral rights. Approximately $5.0 billion of Occidental’s worldwide capital budget is expected to be allocated to its domestic oil and gas operations in 2025.\nDOMESTIC ASSETS \n(a)\n1. Powder River Basin\n2. DJ Basin\n3. Permian Basin\n4. Gulf of America\n(a)\nMap represents geographic outlines of the respective basins.\nThe Permian Basin \nThe Permian Basin extends throughout West Texas and Southeast New Mexico and is one of the largest and most active oil basins in the United States, accounting for more than 47% of total United States oil production in 2024. Occidental had a leading position in the Permian Basin, and produced approximately 10% of the total oil in the basin in 2024. In 2024, Occidental’s production in the Permian Basin was 664 Mboe/d. In 2024, Occidental spent approximately $2.7 billion of development capital in the Permian Basin, of which 88% was spent on Permian Resources assets.\nOccidental manages its Permian Basin operations through two businesses: Permian Resources, which includes unconventional opportunities, and Permian EOR, which utilizes secondary and tertiary recovery techniques. By exploiting the natural synergies between Permian Resources and Permian EOR, Occidental is able to deliver unique short- and long-term advantages, efficiencies and expertise across its Permian Basin operations. \nThe Permian Resources business is focused on developing and producing unconventional reservoir targets using horizontal drilling technology. The development programs are designed to create long-term value from primary development by maximizing the recovery of oil, utilizing sustainable practices and providing strong financial returns. Occidental strengthened its oil and gas portfolio through the acquisition of CrownRock’s well-positioned assets in the Permian Basin. Occidental’s unconventional oil and gas operations in Permian Resources include approximately 1.5 million net acres. In 2024, Occidental’s activities were focused in the core development areas with emphasis on maintaining the industry leading capital intensity through optimized surface infrastructure and customized well designs. In 2024, Permian Resources produced from approximately 6,100 gross wells and added 356 MMboe to Occidental’s proved reserves through infill development projects and extensions of proved areas.\n \nThe Permian Basin’s concentration of large conventional reservoirs, strong CO\n2\n flooding performance and the expansive CO\n2\n transportation and processing infrastructure has resulted in decades of high-value enhanced oil production. \n OXY\n 2024 FORM 10-K\n31\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nWith 33 active CO\n2\n floods and over 50 years of experience, Permian EOR is the industry leader in Permian Basin CO\n2 \nflooding, which can increase ultimate oil recovery by 10% to 25%. Technology improvements, such as the recent trend toward vertical expansion of the CO\n2\n flooded interval into residual oil zone targets, continue to yield more recovery from existing projects. Significant opportunities also remain to gain additional recovery by expanding Occidental’s existing CO\n2\n projects into new portions of reservoirs that have only been waterflooded. Permian EOR has 1.4 million net acres with a large inventory of future CO\n2\n projects, which could be developed over the next 20 years or accelerated, depending on market conditions. Permian EOR produced from approximately 12,600 gross wells in 2024. \nRockies and Other Domestic\nIn 2024, Occidental produced 310 Mboe/d and spent development capital of approximately $0.8 billion in the Rockies and Other Domestic locations. Production in the DJ Basin is derived from approximately 3,700 wells primarily focused in the Niobrara and Codell formations. The DJ Basin, including the North DJ Basin, comprises approximately 0.6 million total net acres and provides competitive economics, low breakeven costs and free cash flow generation through Occidental’s contiguous acreage position and royalty uplift.\nOperations in the DJ Basin are subject to regulations that impose siting requirements, or “setback,” on certain oil and gas drilling locations based on the distance of a proposed well pad to occupied structures. Occidental has dedicated stakeholder relations team that conducts regulatory and community outreach with respect to its permit applications and operations in Colorado with a focus on building trust and fostering open communication with those who live and work near its operations. \nOccidental has established a steady cadence of permit approvals from various agencies, local governments and the ECMC through robust community outreach, protective site selection, thoughtful facility design and planning, and best-in-class measures to mitigate potential impacts from operations. In 2024, Occidental submitted Oil and Gas Development Plans comprising approximately 200 wells to the ECMC. As of December 31, 2024, Occidental has permits for over 90% of the 2025 drilling schedule and over 70% of the 2026 drilling schedule with the remaining percentage of activity largely submitted and pending approval. Occidental continues to gain efficiencies in the permitting process and will continue to look for additional opportunities to do so in the future. \nOccidental has interests in approximately 0.1 million net acres in the Powder River Basin, mainly located in Converse County and Campbell County, Wyoming. The field contains the Turner, Niobrara, Mowry and Parkman formations that hold both liquids and natural gas.\nOccidental holds approximately 4.6 million net acres in other domestic locations, which consist of acreage and fee minerals outside of Occidental’s core operated areas including parts of Arkansas, Colorado, Louisiana, Texas, West Virginia and Wyoming.\nOFFSHORE DOMESTIC ASSETS\nGulf of America\nThe Gulf of America accounts for more than 14% of total United States oil production. Occidental is the fourth-largest oil and gas producer in the deepwater Gulf of America, operating 8 strategically located deepwater floating platforms and producing from 16 active fields while owning a working interest in approximately 300 blocks, covering approximately 1.1 million net acres. \nIn 2024, Occidental’s Gulf of America production was 125 Mboe/d from 82 gross wells. Occidental’s focused production management and artificial lift projects successfully reduced reservoir declines for a consecutive fifth year. Operational efficiency focus continued in 2024, with Production Operations and Asset Integrity teams continuing to achieve world class platform operating efficiencies, with major equipment uptimes of over 98%. Multiple platform seasonal shut-ins were planned and executed safely, resulting in an 80% reduction in the number of annual planned shut-in days compared to 2019. \nOccidental’s Gulf of America assets continued to be among the lowest carbon emissions operations in the industry with zero routine flaring and zero cold venting. \nOccidental invested $0.7 billion of development capital in 2024 with a continued strategy of low risk, infill drilling opportunities and accelerated project delivery at its Horn Mountain, Lucius, and Marco Polo facilities. Drilling and well service activities were ramped up using two floating drill ships and several service rigs. During 2024, all necessary regulatory permits for new wells and existing operations were obtained timely without any operational delays. Occidental was further awarded 45 new leases from the BOEM’s Lease Sale 261. \nOccidental’s Asset Development teams made significant progress in developing new plans to significantly expand the recovery from Occidental’s producing oil and gas reservoirs. Several major secondary recovery uplift projects, as well as new horizontal/extended reach well opportunities, will be ready to begin implementation in 2025 onwards.\nOccidental is also implementing several state-of-the-art artificial lift projects, including down-hole gas-lift and caisson electric submersible pumps at its Horn Mountain platform. These projects are expected to deliver some of the highest margin production in Occidental’s portfolio coming online beginning in the third quarter of 2025. Occidental plans to conduct development and exploration activities in 2025 using two floating drill ships and several other well service vessels and continue to optimize its extensive portfolio of lease working interests.\n32\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nThe following table shows key areas of ongoing development in the Gulf of America, along with the corresponding working interest in those areas.\nWorking Interest\nHorn Mountain\n100 \n%\nHolstein\n100 \n%\nMarlin\n100 \n%\nLucius\n67 \n%\nK2 Complex\n51 \n%\nCaesar Tonga\n34 \n%\nConstellation\n33 \n%\nINTERNATIONAL INTERESTS\nBUSINESS REVIEW\nOccidental primarily conducts its ongoing international operations in two sub-regions: the Middle East and North Africa. Its activities include oil, NGL and natural gas production through direct working interests and PSCs. Under the PSCs, Occidental records a share of production and reserves to recover certain development and production costs and an additional share for profit. These contracts do not transfer any right of ownership to Occidental and reserves reported from these arrangements are based on Occidental’s economic interest as defined in the contracts. Occidental’s share of production and reserves from these contracts decreases when product prices rise and increases when prices decline. Overall, Occidental’s net economic benefit from these contracts is greater when product prices are higher. Approximately $0.6 billion of Occidental’s worldwide capital budget is expected to be allocated to its international operations in 2025.\nMIDDLE EAST / NORTH AFRICA ASSETS\n1.\nAlgeria\n2.\nOman\n3.\nQatar\n4.\nUAE\nAlgeria\nOccidental’s interests in Algeria consists of production rights in 18 fields within Blocks 404a and 208 located in the Berkine Basin in Algeria’s Sahara Desert. Occidental also owns interests in 3 unitized fields with Blocks 404a and 208 (the Ourhoud Unit, the EMK Unit and the HBN Unit) as well as in 3 processing facilities (the El Merk central processing facility in Block 208 that processes produced oil, NGL, and natural gas; and the Hassi Berkine South and Ourhoud central processing facilities in Block 404a that process produced oil).\nIn 2024, net production in Algeria was 28 Mboe/d, from 205 gross wells, and annual development capital expenditures were $0.1 billion. \n OXY\n 2024 FORM 10-K\n33\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOman\nIn Oman, Occidental is the operator of Block 9, Block 27, Block 53 (Mukhaizna Field), Block 62 and Block 65 and has additional interests in Blocks 30, 51 and 72, which are under the Exploration phase. The working interest and contract expiration year for each of the respective blocks are shown in the table below. Occidental holds 6.0 million gross acres and has 10,000 potential well inventory locations. In 2024, Occidental’s share of production was 66 Mboe/d.\nWorking Interest\nBlock Expiration (Year)\nBlock 9\n50 \n%\n2030\nBlock 27\n65 \n%\n2035\nBlock 53\n47 \n%\n2035\nBlock 62\n100 \n%\n2028\nBlock 65\n51 \n%\n2037\nBlocks 30, 51 and 72\n100 \n%\nExploration Phase\nOccidental has produced over 823 million gross barrels from Block 9 since the beginning of its operation through successful exploration, continuous drilling improvements and EOR projects. The Mukhaizna Field in Block 53 is a major pattern steam flood project for EOR that utilizes some of the largest mechanical vapor compressors ever built. Since assuming operations in the Mukhaizna Field in 2005, Occidental has drilled over 3,600 new wells and has produced over 634 million gross barrels. In 2024, Occidental invested development capital of $0.4 billion across all of the Oman blocks to drill 95 wells and execute facilities projects to support development and EOR activities.\nIn 2025, Occidental will continue to enhance production by adding extended and dual laterals, stimulating wells with the OXY JETTING\nTM\n wellbore stimulation system, and expanding thermal conformance. Occidental will also continue to execute projects in Oman targeting emissions reductions. \nQatar\nIn Qatar, Occidental partners in the Dolphin Energy Project, an investment that is comprised of two separate economic interests. Occidental has a 24.5% interest in the upstream operations to develop and produce NGL, natural gas and condensate from Qatar’s North Field through mid-2032. Occidental also has a 24.5% interest in DEL, which operates a pipeline and is discussed further in the midstream and marketing segment section in this Form 10-K under Pipeline. In 2024, Occidental’s net share of production from Dolphin was 39 Mboe/d.\nUAE\nOccidental has a 40% participating interest in the Shah gas field (Al Hosn Gas), in conjunction with ADNOC, the UAE’s national oil company, which expires in 2041. In 2024, Occidental’s net share of production from Al Hosn Gas was 293 MMcf/d of natural gas and 42 Mbbl/d of NGL and condensate. Al Hosn Gas includes gas processing facilities which are discussed further in the midstream and marketing segment section in this Form 10-K under Gas Processing, Gathering and CO\n2\n.\nIn 2019 and 2020, Occidental acquired 9-year exploration concessions and, subject to a declaration of commerciality, 35-year production concessions for Onshore Block 3 and Block 5, which cover an area approximately 1.5 million acres and 0.8 million acres, respectively, and are adjacent to Al Hosn Gas. In 2023, Occidental commenced first oil production in Onshore Block 3. In 2025, Occidental will continue further exploration and appraisal activities in Onshore Block 3 and Block 5. \nPROVED RESERVES\nProved oil, NGL and natural gas reserves were estimated using the unweighted arithmetic average of the first-day-of-the-month price for each month within the year, unless prices were defined by contractual arrangements. Oil, NGL and natural gas prices used for this purpose were based on posted benchmark prices and adjusted for price differentials including gravity, quality and transportation costs. \nThe following table shows the 2024, 2023 and 2022 calculated first-day-of-the-month average prices for both WTI and Brent oil prices, as well as the Henry Hub gas prices: \n \n2024\n2023\n2022\nWTI Oil ($/Bbl)\n$\n75.48\n \n$\n78.22 \n$\n93.67 \nBrent Oil ($/Bbl)\n$\n79.65\n \n$\n82.80 \n$\n97.77 \nHenry Hub Natural Gas ($/MMbtu)\n$\n2.13\n \n$\n2.64 \n$\n6.36 \nMt. Belvieu NGL ($/Bbl)\n$\n33.04\n \n$\n29.94 \n$\n47.81 \n34\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nOccidental had proved reserves from continuing operations at year-end 2024 of 4,612 MMboe, compared to the year-end 2023 proved reserves of 3,982 MMboe. Proved developed reserves represented approximately 69% of Occidental’s total proved reserves at year-end 2024 and 2023. The following table shows Occidental’s proved reserves from continuing operations by commodity as a percentage of total proved reserves:\n2024\n2023\nOil\n46\n \n%\n49 \n%\nNGL\n27\n \n%\n24 \n%\nNatural gas\n27\n \n%\n27 \n%\nOccidental does not have any reserves from non-traditional sources. For further information regarding Occidental’s proved reserves, see the Supplemental Oil and Gas Information section in Item 8 of this Form 10-K.\nCHANGES IN PROVED RESERVES\nChanges in Occidental’s 2024 reserves were as follows:\nMMboe\n2024\nBalance — beginning of year\n3,982\n \nRevisions of previous estimates\n170\n \nImproved recovery\n47\n \nExtensions and discoveries\n326\n \nPurchases\n623\n \nSales\n(50)\nProduction\n(486)\nBalance — end of year\n4,612\n \nOccidental’s ability to add reserves, other than through purchases, depends on the success of infill development, extension, discovery and improved recovery projects, each of which depends on reservoir characteristics, technology improvements and oil and natural gas prices, as well as capital and operating costs. Many of these factors are outside management’s control and may negatively or positively affect Occidental’s reserves.\nRevisions of Previous Estimates\nRevisions can include upward or downward changes to previous proved reserve estimates for existing fields due to the evaluation or interpretation of geologic, production decline or operating performance data. In addition, product price changes affect proved reserves recorded by Occidental. For example, lower prices may decrease the economically recoverable reserves, particularly for domestic properties, because the reduced margin limits the expected life of the operations. Offsetting this effect, lower prices increase Occidental’s share of proved reserves under PSCs because more oil is required to recover costs. Conversely, when prices rise, Occidental’s share of proved reserves decreases for PSCs and economically recoverable reserves may increase for other operations. Reserve estimation rules require that estimated ultimate recoveries be much more likely to increase or remain constant than to decrease, as changes are made due to increased availability of technical data.\nIn 2024, Occidental’s revisions of previous estimates of proved reserves were positive 170 MMboe, which were composed of 112 MMboe of positive revisions related to additions associated with infill development projects and updates based on reservoir performance of 152 MMboe. The positive revisions were partially offset by negative revisions of 87 MMboe associated with management changes in development plans. Further negative revisions of 29 MMboe were associated with negative price revisions.\nThe positive revisions related to additions associated with infill development projects of 112 MMboe were mainly in the DJ Basin (55 MMboe), the Permian Basin (45 MMboe) and international assets (8 MMboe). \nPositive revisions associated with updates based on reservoir performance of 152 MMboe were primarily due to positive performance revisions in the DJ Basin (81 MMboe), GOA (41 MMboe), international assets (32 MMboe) and the Powder River Basin (11 MMboe). \nThe negative revisions of 87 MMboe associated with management changes in development plans were primarily related to the Permian Basin (53 MMboe), Oman (19 MMboe) and GOA (13 MMboe).\nNegative price revisions of 29 MMboe were mainly associated with the Permian Basin. \n OXY\n 2024 FORM 10-K\n35\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nImproved Recovery\nIn 2024, Occidental added proved reserves of 47 MMboe related to improved recovery in Permian EOR (40 MMboe) and Oman (7 MMboe). These properties comprise conventional projects, which are characterized by the deployment of EOR development methods, largely employing application of CO\n2\n flood, waterflood or steam flood. These types of conventional EOR development methods can be applied through existing wells, though additional drilling is frequently required to fully optimize the development configuration. Waterflooding is the technique of injecting water into the formation to displace the oil to the offsetting oil production wells. The use of either CO\n2\n or steam flooding depends on the geology of the formation, the evaluation of engineering data, availability and cost of either CO\n2\n or steam and other economic factors. Both techniques work similarly to lower viscosity causing the oil to move more easily to the producing wells.\nExtensions and Discoveries\nOccidental also added proved reserves from extensions and discoveries, which are dependent on successful exploration and exploitation programs. In 2024, extensions and discoveries added 326 MMboe primarily related to the recognition of proved reserves in the Permian Basin (313 MMboe).\nPurchases of Proved Reserves\nIn 2024, Occidental purchased proved reserves of 623 MMboe primarily consisting of proved reserves in the Permian Midland Basin related to the CrownRock Acquisition.\nSales of Proved Reserves\nIn 2024, Occidental sold 50 MMboe in proved reserves related to the divestitures of certain non-strategic assets primarily in the Permian Basin.\nProved Undeveloped Reserves\nOccidental had PUD reserves at year-end 2024 of 1,421 MMboe, compared to the year-end 2023 amount of 1,232 MMboe.\nChanges in PUD reserves were as follows:\nMMboe\n2024\nBalance — beginning of year\n1,232\n \nRevisions of previous estimates\n(44)\nImproved recovery\n43\n \nExtensions and discoveries\n234\n \nPurchases\n305\n \nSales\n(17)\nTransfer to proved developed reserves\n(332)\nBalance — end of year\n1,421\n \nRevisions of previous estimates were a negative 44 MMboe. Approximately 87 MMboe of the negative revisions were associated with management changes in development plans, mainly in the Permian Basin (53 MMboe), Oman (19 MMboe), and GOA (13 MMboe). Further negative revisions of 49 MMboe were primarily associated with updates based on reservoir performance, primarily due to negative performance revisions in the Permian Basin (46 MMboe) and international assets (31 MMboe) that were partially offset by positive performance revisions in GOA (33 MMboe). The negative revisions were partially offset by positive revisions of 81 MMboe primarily due to additions associated with infill development projects, mainly in the DJ Basin (49 MMboe) and the Permian Basin (29 MMboe), as well as positive revisions of 10 MMboe primarily associated with updates based on interest related revisions.\nExtensions and discoveries added 234 MMboe primarily related to the recognition of proved reserves in the Permian Basin (227 MMboe). Total improved recovery additions of 43 MMboe were the result of implementing secondary and tertiary projects in Permian EOR (40 MMboe) and Oman (3 MMboe). In 2024, Occidental purchased PUD reserves of 305 MMboe primarily consisting of development projects in the Permian Midland Basin related to the CrownRock Acquisition. The 2024 additions to PUD reserves were partially offset by transfers to proved developed reserves of 332 MMboe. The transfers were primarily associated with the DJ Basin (141 MMboe), the Permian Basin (135 MMboe), GOA (24 MMboe), and the UAE (19 MMboe). \nIn 2024, Occidental incurred approximately $2.1 billion to convert PUD reserves to proved developed reserves, and in 2024 Occidental converted approximately 27% of its PUD reserves to proved developed, when adjusted for revisions and sales. As of December 31, 2024, Occidental had 1,421 MMboe of PUD reserves of which 83% were associated with domestic onshore, 5% with GOA and 12% with international assets. Occidental’s most active development areas are located in the Permian Basin, which represented 68% of the PUD reserves as of December 31, 2024. Occidental’s total planned \n36\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\n2025 capital expenditures for oil and gas are between $5.8 billion and $6.0 billion. Overall, Occidental plans to spend approximately $8.7 billion over the next five years to develop its PUD reserves in the Permian Basin.\nPUD reserves are supported by a five-year detailed field-level development plan, which includes the timing, location and capital commitment of the wells to be drilled. Only PUD reserves which are reasonably certain to be drilled within five years of booking and are supported by a final investment decision to drill them are included in the development plan. A portion of the PUD reserves are expected to be developed beyond the five years and are tied to approved long-term development projects.\nAs of December 31, 2024, Occidental had 167 MMboe of pre-2020 PUD reserves that remained undeveloped. These PUD reserves relate to approved long-term development plans, primarily associated with international development projects (129 MMboe) with physical limitations in existing gas processing capacity and related to approved long-term development plans for Permian EOR projects (34 MMboe), also with physical limitations in existing gas processing capacity. Occidental remains committed to these projects and continues to actively progress the development of these volumes. In addition to the above, Occidental has 29 MMboe of PUD reserves that are scheduled to be developed more than five years from their initial date of booking. These PUD reserves are related to approved long-term development plans, primarily associated with international development projects. \nRESERVES EVALUATION AND REVIEW PROCESS\nOccidental’s estimates of proved reserves and associated future net cash flows as of December 31, 2024 were made by Occidental’s technical personnel and are the responsibility of management. The estimation of proved reserves is based on the requirement of reasonable certainty of economic producibility and funding commitments by Occidental to develop the reserves. This process involves reservoir engineers, geoscientists, planning engineers and financial analysts. As part of the proved reserves estimation process, all reserve volumes are estimated by a forecast of production rates, operating costs and capital expenditures. Price differentials between benchmark prices (the unweighted arithmetic average of the first-day-of-the-month price for each month within the year) and realized prices and specifics of each operating agreement are then used to estimate the net reserves. Production rate forecasts are derived by a number of methods, including estimates from decline curve analysis, type well profile analysis, computer simulation of the reservoir performance, volumetric analysis and material balance calculations that take into account the volumes of substances replacing the volumes produced and associated reservoir pressure changes supported by various technologies including seismic analysis. These reliable field-tested technologies have demonstrated reasonably certain results with consistency and repeatability in the formation being evaluated or in an analogous formation. Operating and capital costs are forecast using the current cost environment applied to expectations of future operating and development activities.\nNet proved developed reserves are those volumes that are expected to be recovered through existing wells with existing equipment and operating methods for which the incremental cost of any additional required investment is relatively minor.\nNet PUD reserves are those volumes that are expected to be recovered from new wells on undrilled acreage, or from existing wells where a relatively major expenditure is required for recompletion. PUD reserves are supported by a five-year, detailed, field-level development plan, which includes the timing, location and capital commitment of the wells to be drilled. The development plan is reviewed and approved annually by senior management and technical personnel. Annually, a detailed review is performed by Occidental’s Corporate Reserves Group and its technical personnel on a lease-by-lease basis to assess whether PUD reserves are being converted on a timely basis within five years from the initial disclosure date. Any leases not showing timely transfers from PUD reserves to proved developed reserves are reviewed by senior management to determine if the remaining reserves will be developed in a timely manner and have sufficient capital committed in the development plan. Only PUD reserves that are reasonably certain to be drilled within five years of booking and are supported by a final investment decision to drill them are included in the development plan. A portion of the PUD reserves are expected to be developed beyond the five years and are tied to approved long-term development plans.\nThe current Vice President, Reserves for Oxy Oil and Gas is responsible for overseeing the preparation of reserve estimates, in compliance with SEC rules and regulations, including the internal audit and review of Occidental's oil and gas reserves data. She has over 23 years of experience in the upstream sector of the exploration and production business and has extensive experience evaluating a variety of assets in basins around the world. She is a past President of the International Executive Committee for the SPEE and a member of the Society of Petroleum Engineers. She is a licensed Professional Engineer in the State of Texas and currently serves on the SPEE Reserves Definitions Committee. She has Bachelor of Science degree in chemical engineering from the University of Illinois Urbana-Champaign.\nOccidental has a Reserves Committee, consisting of senior corporate officers, to review and approve Occidental’s oil and gas reserves. The Reserves Committee reports to the Audit Committee of Occidental’s Board of Directors during the year. Since 2003, Occidental has retained Ryder Scott, independent petroleum engineering consultants, to review its annual oil and gas reserve estimation processes. For additional reserves information, see Supplemental Oil and Gas Information\n \nunder Item 8 of this Form 10-K.\nIn 2024, Ryder Scott conducted a process review of the methods and analytical procedures utilized by Occidental’s engineering and geological staff for estimating the proved reserves volumes, preparing the economic evaluations and determining the reserves classifications as of December 31, 2024, in accordance with SEC regulatory standards. Ryder Scott reviewed the specific application of such methods and procedures for selected oil and gas properties considered to be \n OXY\n 2024 FORM 10-K\n37\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\na valid representation of Occidental’s 2024 year-end total proved reserves portfolio. In 2024, Ryder Scott reviewed approximately 34% of Occidental’s proved oil and gas reserves. Since being engaged in 2003, Ryder Scott has reviewed the specific application of Occidental’s reserve estimation methods and procedures for approximately 86% of Occidental’s existing proved oil and gas reserves.\nManagement retained Ryder Scott to provide objective third-party input on its methods and procedures and to gather industry information applicable to Occidental’s reserve estimation and reporting process. Ryder Scott has not been engaged to render an opinion as to the reasonableness of reserves quantities reported by Occidental. Occidental has filed Ryder Scott’s independent report as an exhibit to this Form 10-K.\nBased on its reviews, including the data, technical processes and interpretations presented by Occidental, Ryder Scott has concluded that the overall procedures and methodologies Occidental utilized in estimating the proved reserves volumes, preparing the economic evaluations and determining the reserves classifications for the reviewed properties are appropriate for the purpose thereof and comply with current SEC regulations.\nOUTLOOK\nThe oil and gas exploration and production industry is highly competitive, is subject to significant volatility due to various market conditions and operations are highly dependent on oil prices and, to a lesser extent, NGL and natural gas prices. All commodity prices decreased in 2024. In 2024, compared to 2023, the average daily price per barrel of WTI crude decreased to $75.72 from $77.64, the average daily Brent price per barrel decreased to $79.79 from $82.25 and the average daily NYMEX natural gas price per MMcf decreased to $2.34 from $2.94.\nOil prices will continue to be affected by: (i) global supply and demand, which are generally a function of global economic conditions, inventory levels, production or supply chain disruptions, technological advances, regional market conditions and the actions of OPEC, other significant producers and governments; (ii) transportation capacity, infrastructure constraints, and costs in producing areas; (iii) currency exchange rates and inflation rates; and (iv) the effect of changes in these variables on market perceptions. It is expected that the price of oil will be volatile for the foreseeable future given the current geopolitical risks, the ongoing global impact of geopolitical risks, the evolving macro-economic environment and supply activity from OPEC and non-OPEC oil producing countries and U.S. Government management of the U.S. Strategic Petroleum Reserve. Occidental does not operate or own assets in either Russia or Ukraine, or in the immediate vicinity of ongoing conflicts in the Middle East.\nNGL prices are related to the supply and demand for the components of products making up these liquids. Some of them more typically correlate to the price of oil while others are affected by natural gas prices as well as the demand for certain chemical products for which they are used as feedstock. In addition, infrastructure constraints magnify the pricing volatility from region to region. \nDomestic natural gas prices and local differentials are strongly affected by local supply and demand fundamentals, as well as government regulations, global LNG demand and availability of transportation capacity from producing areas. International gas prices are generally fixed under long-term contracts.\nThese and other factors make it difficult to predict the future direction of oil, NGL and domestic gas prices reliably. For purposes of the current capital plan, Occidental will continue to focus on allocating capital to high-return assets with the flexibility to adjust based on fluctuations in commodity prices, current economic conditions, such as supply chain constraints, higher interest rates, global logistics and high inflation, which has continued to disrupt global supply and demand balances, with the goal of keeping returns well above its cost of capital. \nThe timing, process and ultimate cost to transition to a less carbon-intensive economy remains largely unknown; various industry forecasts indicate a growing demand for hydrocarbons for the remainder of the current decade. Occidental believes its operational flexibility to achieve low development and operating costs to maximize full-cycle value of its assets and its knowledge and experience in CO\n2\n separation, transportation, use, recycling and storage position its oil and gas segment to support Occidental’s transition to net zero as well as create opportunities in a low-carbon future. \n38\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\n \nCHEMICAL SEGMENT\nBUSINESS STRATEGY\nOxyChem concentrates on the chlorovinyls chain, beginning with the co-production of caustic soda and chlorine. Caustic soda and chlorine are marketed to external customers. In addition, chlorine, together with ethylene, is converted through a series of intermediate products into PVC. OxyChem seeks to be a low-cost producer in order to generate cash flow in excess of its normal capital expenditure requirements and achieve above-cost-of-capital returns. OxyChem’s focus on chlorovinyls allows it to maximize the benefits of integration and take advantage of economies of scale. Capital is employed to sustain production capacity and to focus on projects and developments designed to improve the competitiveness of segment assets. Acquisitions and plant development opportunities may be pursued when they are expected to enhance the existing core chlor-alkali and PVC businesses or take advantage of other specific opportunities. The expansion and conversion of the Battleground chlor-alkali plant to membrane technology continued in 2024 with completion expected in 2026. In 2024, capital expenditures for OxyChem totaled $685 million. \nBUSINESS ENVIRONMENT\nAlthough the United States economic growth was higher than that of 2023, depressed growth in China continues to negatively impact the global market. While domestic demand increased for most products during 2024, product prices declined due to impacts of global supply exceeding demand, especially on chlorine and chlorinated derivatives products, including PVC. With the downward pressure on chlorinated product prices and margins, caustic soda prices increased across the year. \nBUSINESS REVIEW\nBASIC CHEMICALS\nChlor-alkali operating rates increased in 2024 as global demand for most products returned to modest levels of growth. Despite the demand growth, global supply continued to exceed global demand on most products; therefore pricing and margins continued to decline across 2024. \nVINYLS\nDomestic PVC demand realized appreciable 8% growth in 2024. U.S. Gulf Coast exports also increased year over year by 3%. Industry utilization rates averaged 85% in 2024, resulting in a net production gain of 1.2 billion pounds year over year. Given the high interest rate environment, housing starts continued to decline for the third consecutive year. Construction markets have largely offset the housing market segment and resulted in year over year demand gains. PVC exports continue to be an important outlet for PVC production and represented 34% of overall demand across 2024.\nOUTLOOK\nIndustry performance will depend on the health of the global economy. Lingering inflationary impacts will continue to impact the domestic housing and construction sectors during 2025, while overall global demand will be impacted by the rate of China’s economic recovery. Product margins will depend on the resulting supply and demand balances and the regionally comparative level of energy costs. Potential tariffs could have an impact on global trade flow, particularly on PVC. Approximately $0.9 billion of Occidental’s worldwide capital budget is expected to be allocated to OxyChem in 2025.\nBASIC CHEMICALS\nDemand for basic chemicals is expected to improve modestly in 2025 following the continuing slow growth trend of the general economy. Demand for chlorine and derivatives should show moderate growth in all key market segments in 2025, while demand for alkali products should continue to demonstrate stronger growth in core segments of alumina and pulp and paper.\nVINYLS\nSingle family housing starts have held steady throughout 2024, offset by a multi-family housing market that continues to erode. Total housing starts are expected to be flat to slightly improved in 2025, which will have a modestly positive impact to domestic PVC demand in 2025. However, domestic infrastructure projects and increasing global demand will drive domestic PVC demand growth year over year in 2025. Domestic PVC expansions came online during 2024, which had a negative impact on 2024 year-end prices as the new production was targeted for a bearish PVC market.\n OXY\n 2024 FORM 10-K\n39\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nMIDSTREAM AND MARKETING SEGMENT\nBUSINESS STRATEGY\nThe midstream and marketing segment strives to maximize value by optimizing the use of its gathering, processing, transportation, storage and terminal commitments and by providing the oil and gas segment access to domestic and international markets. To generate returns, the segment evaluates opportunities across the value chain and uses its assets to provide services to Occidental’s subsidiaries, as well as third parties. The midstream and marketing segment operates or contracts for services on gathering systems, gas plants, co-generation facilities and storage facilities and invests in entities that conduct similar activities.\nThis segment also seeks to minimize the costs of gas and power used in Occidental’s various businesses. Also included in the midstream and marketing segment is OLCV. OLCV seeks to leverage Occidental’s experience with carbon management in EOR, major projects development and OxyChem plant operations to further the development of CCUS projects. OLCV invests in emerging low-carbon technologies that are expected to reduce Occidental’s carbon footprint and ensure the long-term sustainability of Occidental’s core businesses, and enable others to do the same. \nCapital is employed to sustain or expand assets to improve the competitiveness of Occidental’s businesses. In 2024, capital expenditures related to the midstream and marketing segment totaled $880 million, before contributions from noncontrolling interests, the majority of which were related to the construction of STRATOS.\nBUSINESS ENVIRONMENT\nMidstream and marketing segment earnings are affected by the performance of its various businesses, including its marketing, gathering and transportation, gas processing and power-generation assets. The marketing business aggregates, markets and stores Occidental and third-party volumes. Marketing performance is affected primarily by commodity price changes and margins in oil and gas transportation and storage programs. The marketing business results can experience significant volatility depending on commodity prices and the Midland-to-Gulf-Coast oil spreads and Waha-to-Gulf-Coast gas spreads. The Midland-to-Gulf-Coast oil spreads have increased to an average of $0.49 per barrel in 2024 from an average of $0.21 per barrel in 2023. A $0.25 change in the Midland-to-Gulf-Coast oil spreads impacts 2024 operating cash flows by approximately $65 million. The Waha-to-Gulf-Coast gas spreads have increased to an average of $1.49 per MMbtu in 2024 from an average of $0.54 per MMbtu in 2023. Gas gathering, processing and transportation results are affected by fluctuations in commodity prices and the volumes that are processed and transported through the segment’s plants, as well as the margins obtained on related services from investments in which Occidental has an equity interest.\nBUSINESS REVIEW\nMARKETING\nThe marketing group markets substantially all of Occidental’s oil, NGL and natural gas production and optimizes its transportation and storage capacity. Occidental’s third-party marketing activities focus on purchasing oil, NGL and natural gas for resale from parties whose oil and gas supply is located near its transportation and storage capacity. These purchases allow Occidental to aggregate volumes to better utilize and optimize its assets. In 2024, compared to 2023, marketing results were impacted by higher gas marketing margin from transportation capacity optimization and higher equity method investment income from WES, partially offset by higher activities in the OLCV business.\nDELIVERY AND TRANSPORTATION COMMITMENTS\nOccidental has made long-term commitments to certain refineries and other buyers to deliver oil, NGL and natural gas. The total amount contracted to be delivered is approximately 49 MMbbl of oil through 2025, 794 MMbbl of NGL through 2034 and 674 Bcf of gas through 2029. The price for these deliveries is set at the time of delivery of the product.\nOccidental has crude pipeline take-or-pay capacity of approximately 850 Mbbl/d to the Gulf Coast, leased crude storage capacity of approximately 9 MMbbl and capacity at the crude terminal of approximately 525 Mbbl/d. Certain of Occidental's crude pipeline take-or-pay agreements expire in 2025 and its Midstream business is well-positioned to benefit from potential reductions in crude oil transportation rates from the Permian to the Gulf Coast.\nPIPELINE\nOccidental’s pipeline business mainly consists of its 24.5% ownership interest in DEL. DEL owns and operates a 230-mile-long, 48-inch-diameter natural gas pipeline, known as the Dolphin Pipeline, which transports dry natural gas from Qatar to the UAE and Oman. The Dolphin Pipeline has capacity to transport up to 3.2 Bcf/d and currently transports approximately \n2.0 Bcf/d and up to 2.2 Bcf/d in the summer months.\nGAS PROCESSING, GATHERING AND CO\n2\nOccidental processes its own and third-party domestic wet gas to extract NGL and other gas byproducts, including CO\n2\n, and delivers dry gas to pipelines. Margins primarily result from the difference between inlet costs of wet gas and market prices for NGL.\n40\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nWES is a publicly traded limited partnership with its limited partner units traded on the NYSE under the ticker symbol “WES.” As of December 31, 2024, Occidental owned all of the 2.3% non-voting general partner interest, 43.5% of the WES limited partner units, and a 2% non-voting limited partner interest in WES Operating, a subsidiary of WES. As of December 31, 2024, Occidental's combined share of net income from WES and its subsidiaries was 46.0%.\n See \nNote 1 - Summary of Significant Accounting Policies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for more information regarding Occidental’s equity method investment in WES. WES owns gathering systems, plants and pipelines and earns revenue from fee-based and service-based contracts with Occidental and third parties.\nOccidental’s 40% participating interest in Al Hosn Gas also includes sour gas processing facilities that are designed to process 1.45 Bcf/d of natural gas and separate it into salable gas, condensate, NGL and sulfur. In 2024, the project produced 732 MMcf/d of natural gas, 106 Mbbl/d of NGL and condensate, and 13,800 tons/d of sulfur, of which Occidental’s net share was 293 MMcf/d of natural gas, 42 Mbbl/d of NGL and condensate and 5,520 tons/d of sulfur\n.\nPOWER GENERATION FACILITIES\nEarnings from power and steam generation facilities are derived from sales to affiliates and third parties.\nLOW-CARBON VENTURES\nOLCV was formed to capitalize on Occidental’s extensive experience in utilizing CO\n2\n in its development of CCUS projects and providing services to third parties to facilitate the implementation of their CCUS projects. Moreover, OLCV is fostering emerging technologies, including DAC and low-carbon power sources, and other business models with the potential to position Occidental as a leader in the production of low-carbon energy and products.\nIn 2024, Occidental continued the construction of STRATOS, the first commercial scale direct air capture facility in Ector County, Texas. The facility is expected to begin start-up operations in mid-2025. Occidental has a joint venture agreement with BlackRock, through a fund managed by its Diversified Infrastructure business, for the development of STRATOS. The agreement provides $550 million of committed investment from BlackRock's fund.\nOccidental helped develop standards and protocols recognized by the EPA for monitoring, reporting and verifying the amount, safety and permanence of CO\n2\n stored through secure geologic sequestration. Occidental holds four EPA-approved monitoring, reporting and verification plans for geologic sequestration through EOR production. OLCV has acquired access to over 370,000 acres of pore space to date, and has continued to pursue permits of Class VI CO\n2\n injection wells with the intention of developing six sequestration hubs. OLCV is also currently conducting front-end engineering design work and feasibility studies on a number of projects to capture and sequester CO\n2\n, either from the atmosphere or from industrial point sources. The profitability of sequestration projects is dependent upon the costs of developing, building and operating sequestration infrastructure, demand for sequestration services from emitters and the availability of certain tax attributes and credits generated from the capture and storage of CO\n2\n.\nOccidental owns a 41.6% interest in NET Power, which is developing a low-cost, natural gas electric power system that generates near-zero emissions and inherently captures all CO\n2\n. NET Power Inc. is currently traded on the NYSE under the symbol “NPWR.” NET Power expects its first utility scale plant, located in the Permian, to begin power generation in the second half of 2027 or the first half of 2028. \nOUTLOOK\nMidstream and marketing segment results can experience volatility depending on commodity price changes, demand impacting export sales, the Midland-to-Gulf-Coast oil spreads and Waha-to-Gulf-Coast gas spreads. Gas gathering, processing and transportation results are affected by fluctuations in commodity prices and the volumes that are processed and transported through the segment’s plants, as well as the margins obtained on related services from investments in which Occidental has an equity interest.\nRecently, economy-wide cost increases affected various elements of the supply chain. Further increases could increase the cost of sequestration and other low-carbon projects. In 2024, increased interest from third parties in providing sequestration services or purchasing carbon credits indicated a growing market for OLCV products and services.\nIn August 2022, Congress passed the IRA which contains, among other provisions, certain tax incentives related to climate change and clean energy. Since the enactment of the IRA, the Treasury has released a substantial amount of regulatory and sub-regulatory guidance. However, much of this guidance remains unfinalized, and significant questions persist regarding its application. On January 20, 2025, the Trump Administration issued an executive order that pauses the disbursement of funds appropriated under the IRA. The ultimate impact of the IRA on Occidental’s emerging low-carbon businesses and net-zero pathway will depend on several factors, including the Treasury's statutory interpretations in the final regulatory guidance pending issuance and potential changes to the IRA incentives in future tax legislation.\nApproximately $0.8 billion of Occidental’s worldwide capital budget, before contributions from noncontrolling interests, are expected to be allocated to its midstream and marketing operations in 2025. \n \n OXY\n 2024 FORM 10-K\n41\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nSEGMENT RESULTS OF OPERATIONS AND ITEMS AFFECTING COMPARABILITY\nSEGMENT RESULTS OF OPERATIONS\nSegment earnings exclude income taxes, interest income, interest expense, environmental remediation expenses, unallocated corporate expenses and discontinued operations, but include gains and losses from divestitures of segment assets and income from the segments’ equity investments. Seasonality is not a primary driver of changes in Occidental’s consolidated quarterly earnings during the year.\nThe following table sets forth the sales and earnings of each operating segment and corporate items for the years ended December 31:\nmillions, except per share amounts\n2024\n2023\n2022\nNET SALES\n \n(a)\nOil and gas\n$\n21,705\n \n$\n21,284 \n$\n27,165 \nChemical\n4,923\n \n5,321 \n6,757 \nMidstream and marketing\n962\n \n2,551 \n4,136 \nEliminations \n(865)\n(899)\n(1,424)\nTotal\n$\n26,725\n \n$\n28,257 \n$\n36,634 \nSEGMENT RESULTS AND EARNINGS\nDomestic\n$\n3,715\n \n$\n4,822 \n$\n10,439 \nInternational\n1,774\n \n1,859 \n2,580 \nExploration\n(275)\n(441)\n(216)\nOil and gas \n5,214\n \n6,240 \n12,803 \nChemical\n \n1,124\n \n1,531 \n2,508 \nMidstream and marketing\n580\n \n24 \n273 \nTotal\n$\n6,918\n \n$\n7,795 \n$\n15,584 \nUnallocated corporate items\nInterest expense, net\n(1,175)\n(945)\n(1,030)\nIncome tax expense\n(1,174)\n(1,733)\n(813)\nOther\n(1,673)\n(421)\n(437)\nIncome from continuing operations\n$\n2,896\n \n$\n4,696 \n$\n13,304 \nDiscontinued operations, net \n182\n \n— \n— \nNet income\n3,078\n \n4,696 \n13,304 \nLess: Net income attributable to noncontrolling interests\n(22)\n— \n— \nLess: Preferred stock dividends and redemption premiums\n(679)\n(923)\n(800)\nNet income attributable to common stockholders\n$\n2,377\n \n$\n3,773 \n$\n12,504 \nNet income attributable to common stockholders—basic\n$\n2.59\n \n$\n4.22 \n$\n13.41 \nNet income attributable to common stockholders—diluted\n$\n2.44\n \n$\n3.90 \n$\n12.40 \n(a)\nIntersegment sales eliminate upon consolidation and are generally made at prices approximating those that the selling entity would be able to obtain in third-party transactions.\n42\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nITEMS AFFECTING COMPARABILITY\nOIL AND GAS SEGMENT\nResults of Operations\nmillions\n2024\n2023\n2022\nSegment Sales\n$\n21,705\n \n$\n21,284 \n$\n27,165 \nSegment Results \n(a)\nDomestic\n$\n3,715\n \n$\n4,822 \n$\n10,439 \nInternational\n1,774\n \n1,859 \n2,580 \nExploration\n(275)\n(441)\n(216)\nTotal\n$\n5,214\n \n$\n6,240 \n$\n12,803 \nItems affecting comparability\nGains (losses) on sales of assets and other, net - domestic \n(b)\n$\n(585)\n$\n142 \n$\n148 \nGain on sales of assets and other, net - international \n(c)\n$\n—\n \n$\n25 \n$\n55 \nAsset impairments and related items - domestic \n(d)\n$\n(334)\n$\n(209)\n$\n— \nLegal settlements\n$\n(54)\n$\n26 \n$\n— \n(a)\nResults included significant items affecting comparability discussed in the footnotes below.\n(b)\nThe 2024 amount included $572 million of losses primarily related to the sale of non-core onshore U.S. assets. The 2023 and 2022 amounts included gains on sales primarily related to certain non-strategic assets in the Permian Basin of $142 million and $148 million, respectively.\n(c)\nThe 2023 and 2022 amounts of $25 million and $55 million, respectively, included post-closing consideration earned as a result of certain production and pricing targets being met as well as the closing of the sale of certain assets that were negotiated with the 2020 Colombia divestiture.\n(d)\nThe 2024 amount included a pre-tax impairment of $334 million related to certain wells in the Gulf of America whose future net cash inflows did not indicate that the asset value is recoverable. The 2023 amount included a pre-tax impairment of $180 million related to undeveloped acreage in the northern non-core area of the Powder River Basin where Occidental decided not to pursue future exploration and appraisal activities as well as a $29 million impairment related to an equity method investment in Black Butte Coal Company. \nDomestic oil and gas results, excluding significant items affecting comparability, decreased in 2024, compared to 2023, primarily due to lower realized oil and natural gas prices, partially offset by higher sales volumes across all commodities, largely driven by the CrownRock Acquisition. International oil and gas results, excluding significant items affecting comparability, decreased in 2024, compared to 2023, primarily due to lower oil and NGL prices and higher lease operating costs, partially offset by higher sales volumes. \n OXY\n 2024 FORM 10-K\n43\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nAverage Realized Prices\nThe following table sets forth the average realized prices for oil, NGL and natural gas from ongoing operations for each of the three years in the period ended December 31, 2024, and includes a year-over-year change calculation:\n2024\nYear over Year Change\n2023\nYear over Year Change\n2022\nAverage Realized Prices\n \n \n \nOil \n($/Bbl)\n \n \n \nUnited States\n$\n74.62\n \n(2)%\n$\n76.42 \n(19)%\n$\n94.12 \nInternational\n$\n77.46\n \n(2)%\n$\n79.03 \n(17)%\n$\n95.46 \nTotal worldwide\n$\n75.05\n \n(2)%\n$\n76.85 \n(19)%\n$\n94.36 \nNGL\n ($/Bbl)\nUnited States\n$\n20.48\n \n1%\n$\n20.19 \n(43)%\n$\n35.69 \nInternational\n$\n28.00\n \n(5)%\n$\n29.35 \n(14)%\n$\n34.09 \nTotal worldwide\n$\n21.38\n \n—%\n$\n21.32 \n(40)%\n$\n35.48 \nNatural Gas\n ($/Mcf)\nUnited States\n$\n0.94\n \n(54)%\n$\n2.04 \n(63)%\n$\n5.48 \nInternational\n$\n1.89\n \n1%\n$\n1.88 \n(1)%\n$\n1.89 \nTotal worldwide \n$\n1.18\n \n(41)%\n$\n2.00 \n(56)%\n$\n4.51 \n \nRealized Price and Sales Volume Variance\nThe following table presents an analysis of the impacts of changes in average realized prices and sales volumes with regard to Occidental's domestic and international oil and gas revenue:\n \nIncrease (Decrease) Related to\nmillions\nYear ended December 31, 2023\n(a)\nPrice Realizations\nNet Sales Volumes\nYear ended December 31, 2024\n(a)\nUnited States Revenue\nOil\n$\n14,893 \n$\n(384)\n$\n1,095\n \n$\n15,604\n \nNGL\n1,619 \n81\n \n165\n \n1,865\n \nNatural gas\n970 \n(572)\n116\n \n514\n \nTotal\n$\n17,482 \n$\n(875)\n$\n1,376\n \n$\n17,983\n \nInternational Revenue\nOil \n(b)\n$\n3,057 \n$\n(42)\n$\n(75)\n$\n2,940\n \nNGL\n372 \n(15)\n33\n \n390\n \nNatural gas\n335 \n(7)\n33\n \n361\n \nTotal\n$\n3,764 \n$\n(64)\n$\n(9)\n$\n3,691\n \n(a)    \nResults excluded \"other\" oil and gas revenue. See \nNote 2 - Revenue\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional information regarding other revenue.\n(b)    \nResults included the impact of international production sharing contracts, along with the net sales volume impact from the new Algeria development agreement which took effect May 3, 2023.\n44\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nProduction\nThe following table sets forth the production volumes of oil, NGL and natural gas per day for each of the three years in the period ended December 31, 2024, and includes a year-over-year change calculation:\n \nProduction per Day, Ongoing Operations (Mboe/d)\n2024\nYear over Year Change\n2023\nYear over Year Change\n2022\nUnited States\n \n \n \nPermian\n664\n \n14\n \n%\n584 \n14 \n%\n513 \nRockies & Other Domestic\n310\n \n14\n \n%\n271 \n(2)\n%\n277 \nGulf of America\n125\n \n(14)\n%\n145 \n(1)\n%\n147 \nTotal\n1,099\n \n10\n \n%\n1,000 \n7 \n%\n937 \nInternational\nAlgeria & Other International\n32\n \n(9)\n%\n35 \n(26)\n%\n47 \nAl Hosn Gas\n91\n \n10\n \n%\n83 \n14 \n%\n73 \nDolphin\n39\n \n—\n \n%\n39 \n5 \n%\n37 \nOman\n66\n \n—\n \n%\n66 \n2 \n%\n65 \nTotal\n228\n \n2\n \n%\n223 \n— \n%\n222 \nTotal Production (Mboe/d) \n(a)\n1,327\n \n9\n \n%\n1,223 \n6 \n%\n1,159 \n(a)\nNatural gas volumes have been converted to Boe based on energy content of six Mcf of gas to one barrel of oil. Boe equivalence does not necessarily result in price equivalence. Please refer to the Supplemental Oil and Gas Information (unaudited) section of this Form 10-K for additional information on oil and gas production and sales.\nAverage daily production volumes from ongoing operations increased by 9% in 2024, compared to 2023. The increase in production was primarily related to increased U.S. onshore production, including volumes from the CrownRock\nAcquisition closed on August 1, 2024, higher DJ basin production from new development activities and higher Al Hosn Gas production, as the Al Hosn Gas expansion project was completed in the second quarter of 2023.\nLease Operating Expense\nThe following table sets forth the average lease operating expense per Boe from ongoing operations for each of the three years in the period ended December 31, 2024:\n2024\n2023\n2022\nAverage lease operating expense per Boe\n$\n9.75\n \n$\n10.48 \n$\n9.52 \nAverage lease operating expense per Boe decreased in 2024, compared to 2023, primarily due to lower operational costs as a result of the CrownRock Acquisition and operational efficiencies.\nCHEMICAL SEGMENT\nmillions\n2024\n2023\n2022\nSegment Sales\n$\n4,923\n \n$\n5,321 \n$\n6,757 \nSegment Results\n$\n1,124\n \n$\n1,531 \n$\n2,508 \nItems affecting comparability\nLegal Settlements\n$\n(16)\n$\n— \n$\n— \nChemical segment results decreased in 2024, compared to 2023, driven primarily by lower realized pricing across most product lines, partially offset by improved demand across most product lines and lower energy costs.\n OXY\n 2024 FORM 10-K\n45\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nMIDSTREAM AND MARKETING SEGMENT\nmillions\n2024\n2023\n2022\nSegment Sales\n$\n962\n \n$\n2,551 \n$\n4,136 \nSegment Results \n(a)\n$\n580\n \n$\n24 \n$\n273 \nItems affecting comparability\nGains on sales of assets and other, net \n(b)\n$\n647\n \n$\n51 \n$\n98 \nTerraLithium fair value gain\n$\n27\n \n$\n— \n$\n— \nDerivative losses, net \n(c)\n$\n(32)\n$\n(14)\n$\n(259)\nAsset impairments and other charges, net \n(c)\n$\n(21)\n$\n(60)\n$\n— \nAcquisition-related costs \n(d)\n$\n—\n \n$\n(20)\n$\n— \nCarbon Engineering fair value gain \n(d)\n$\n—\n \n$\n283 \n$\n— \n(a)\nResults included significant items affecting comparability discussed in the footnotes below.\n(b)\nThe 2024, 2023 and 2022 amounts included gains on sale of $489 million, $51 million and $62 million, respectively, from the sales of 19.5 million, 5.1 million and 10.0 million limited partner units in WES, respectively. The 2024 amount also included $158 million of income from equity investments and other related to Occidental's share of WES' gains on its asset divestitures.\n(c)\nThe 2023 amount included amounts from income from equity investments and other in the Consolidated Condensed Statement of Operations.\n(d)\nThe 2023 amount included a gain of $283 million from the remeasurement of the noncontrolling interest held prior to the Carbon Engineering acquisition to fair value and acquisition-related costs of $20 million. \nMidstream and marketing segment results, excluding items affecting comparability, increased in 2024, compared to 2023, due to higher income in the gas marketing business as a result of higher gas transportation spreads from the Permian to the Gulf Coast and higher equity method investment income from WES, partially offset by higher activities in OLCV.\nCORPORATE\nSignificant corporate items include the following:\nmillions\n2024\n2023\n2022\nItems Affecting Comparability\nPassaic environmental reserve\n(a)\n$\n(925)\n$\n— \n$\n— \nEnvironmental receivable valuation allowance adjustment\n(a)\n$\n(84)\n$\n260 \n$\n(22)\nAcquisition-related costs\n(b)\n$\n(150)\n$\n(6)\n$\n(89)\nGains on sales of assets and other, net\n$\n48\n \n$\n— \n$\n— \nInterest rate swap gains, net\n \n$\n—\n \n$\n— \n$\n317 \nEarly debt extinguishment\n$\n—\n \n$\n— \n$\n149 \n(a)\nSee \nNote 13 - Lawsuits, Claims, Commitments and Contingencies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional information. \n(b)\nThe 2024 amount included $66 million of financing costs related to the CrownRock Acquisition and the remaining amounts were related to CrownRock transaction costs. The 2023 amount related to costs incurred for the CrownRock Acquisition and the 2022 amount related to the Anadarko Acquisition.\n46\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nINCOME TAXES \n \nTotal deferred tax assets, after valuation allowance, were $2.4 billion and $2.0 billion as of December 31, 2024 and 2023, respectively. Occidental expects to realize the recorded deferred tax assets, net of any allowances, through future operating income and reversal of temporary differences. The total deferred tax liabilities were $7.7 billion as of December 31, 2024 and 2023. See more discussion below.\n \nWORLDWIDE EFFECTIVE TAX RATE\nThe following table sets forth the calculation of the worldwide effective tax rate for income from continuing operations:\nmillions\n2024\n2023\n2022\nIncome from continuing operations before taxes\n$\n4,070\n \n$\n6,429 \n$\n14,117 \nIncome tax benefit (expense) \n \nFederal and state\n(589)\n(975)\n248 \nForeign\n(585)\n(758)\n(1,061)\nTotal income tax expense\n(1,174)\n(1,733)\n(813)\nIncome from continuing operations\n$\n2,896\n \n$\n4,696 \n$\n13,304 \nWorldwide effective tax rate\n29%\n27%\n6%\n \nOccidental’s worldwide effective tax rate in 2024 and 2023 was higher than the U.S. statutory rate of 21% and primarily driven by Occidental's jurisdictional mix of income, where international income is subject to tax at statutory rates as high as 55%. The 2022 worldwide effective tax rate was impacted by a legal entity reorganization, as described below. \n \nLEGAL ENTITY REORGANIZATION\nTo align Occidental’s legal entity structure with the nature of its business activities after completing the Anadarko Acquisition and subsequent large scale post-acquisition divestiture program, management undertook a legal entity reorganization that was completed in the first quarter of 2022.\nAs a result of this legal entity reorganization, management made an adjustment to the tax basis in a portion of its operating assets, thus reducing Occidental’s deferred tax liabilities. Accordingly, in 2022, Occidental recorded a tax benefit of $2.7 billion in connection with this reorganization. The timing of any reduction in Occidental’s future cash taxes as a result of this legal entity reorganization will be dependent on a number of factors, including prevailing commodity prices, capital activity level and production mix. The legal entity reorganization transaction is currently under IRS review as part of the Company’s 2022 federal tax audit.\n \nINFLATION REDUCTION ACT AND PILLAR TWO\nIn August 2022, Congress passed the IRA that contains, among other provisions, certain tax incentives related to climate change and clean energy. Since the enactment of the IRA, the Treasury has released a substantial amount of regulatory and sub-regulatory guidance. However, much of this guidance remains unfinalized, and significant questions persist regarding its application. On January 20, 2025, the Trump Administration issued an executive order that pauses the disbursement of funds appropriated under the IRA. The ultimate impact of the IRA on Occidental’s businesses depends on several factors, including the Treasury's statutory interpretations in the final regulatory guidance pending issuance and potential changes to the IRA incentives in future tax legislation.\nApproximately 140 countries have agreed to support the OECD Pillar Two initiative that proposes to apply a 15% global minimum tax on multinational entities, applied jurisdiction-by-jurisdiction. Several countries, including European Union member states, Canada, and Oman, have enacted or are in the process of enacting legislation aligned with all, or portions of, Pillar Two. Widespread implementation of Pillar Two is anticipated in 2025.   \nAs the legislation becomes effective in countries in which Occidental operates, the Company’s cash tax could increase, and its effective tax rate could be negatively impacted. In January 2025, the Trump Administration issued an executive order indicating that any commitments made by the prior U.S. administration regarding Pillar Two “have no force or effect in the United States”. The order also suggested the U.S. will consider retaliatory measures against countries that attempt to apply extraterritorial taxes on U.S. companies.   \nOccidental will continue to monitor the developments in the U.S., in addition to the status of legislation and guidance issued by both the OECD and the jurisdictions in which the Company operates, to assess the impact on the Company’s tax position. Occidental does not expect the global minimum tax provisions to have a material impact on its results of operations, financial position, or cash flows. \n OXY\n 2024 FORM 10-K\n47\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nCONSOLIDATED RESULTS OF OPERATIONS\nREVENUE AND OTHER INCOME ITEMS\nmillions\n2024\n2023\n2022\nNet sales\n$\n26,725\n \n$\n28,257 \n$\n36,634 \nInterest, dividends and other income\n$\n171\n \n$\n139 \n$\n153 \nGains (losses) on sales of assets and other, net\n$\n(16)\n$\n522 \n$\n308 \nNET SALES\nPrice and volume changes generally represent the majority of the change in the oil and gas and chemical segments sales. Midstream and marketing sales generally represent the margins earned by the marketing business as it strives to optimize the use of its transportation, storage and terminal commitments to provide access to domestic and international markets and, to a lesser extent, NGL and sulfur revenues from the gas processing business. \nThe decrease in net sales in 2024, compared to 2023, was primarily due to the expiration of crude supply contracts in the midstream and marketing segment at the end of 2023, which also decreased purchased commodities for the same periods, lower domestic natural gas and oil prices in the oil and gas segment and lower realized prices across most products in the chemical segment, partially offset by higher oil volumes, largely related to the CrownRock Acquisition in the oil and gas segment.\nGAINS (LOSSES) ON SALES OF ASSETS AND OTHER, NET\nGains (losses) on sales of assets and other, net for 2024 included the sale of non-core assets in the Powder River Basin with near to intermediate term lease expirations and certain Delaware Basin assets in Texas and New Mexico for combined net proceeds of $769 million. Occidental recognized a pre-tax loss of $479 million on the asset sales. These and other losses were partially offset by the pre-tax gain of $489 million resulting from the sale of 19.5 million of Occidental’s limited partner units in WES for proceeds of $697 million. \nEXPENSE ITEMS\nmillions\n2024\n2023\n2022\nOil and gas operating expense\n$\n4,738\n \n$\n4,677 \n$\n4,028 \nTransportation and gathering expense\n$\n1,608\n \n$\n1,481 \n$\n1,475 \nChemical and midstream cost of sales\n$\n3,121\n \n$\n3,116 \n$\n3,273 \nPurchased commodities\n$\n337\n \n$\n2,009 \n$\n3,287 \nSelling, general and administrative\n$\n1,062\n \n$\n1,083 \n$\n945 \nOther operating and non-operating expense\n$\n1,581\n \n$\n1,084 \n$\n1,271 \nTaxes other than on income\n$\n1,039\n \n$\n1,087 \n$\n1,548 \nDepreciation, depletion and amortization\n$\n7,371\n \n$\n6,865 \n$\n6,926 \nAsset impairments and other charges\n$\n1,281\n \n$\n209 \n$\n— \nAcquisition-related costs\n$\n84\n \n$\n26 \n$\n89 \nExploration expense\n$\n275\n \n$\n441 \n$\n216 \nInterest and debt expense, net\n$\n1,175\n \n$\n945 \n$\n1,030 \nPURCHASED COMMODITIES\nPurchased commodities decreased in 2024, compared to 2023, due to lower volumes on third-party crude purchases as certain crude supply contracts expired in 2023 in the midstream and marketing segment.\nOTHER OPERATING AND NON-OPERATING EXPENSE\nOther operating and non-operating expense increased in 2024, compared to 2023, primarily due to changes in the receivable valuation allowance related to environmental remediation, which was reduced by $260 million for the Maxus Liquidating Trust in 2023, as well as higher compensation costs and increased research and development activities in OLCV in 2024.\n48\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nDEPRECIATION, DEPLETION, AND AMORTIZATION\nDepreciation, depletion and amortization increased in 2024, compared to 2023, primarily related to increased sales volumes in the Permian Basin and Rockies.\nASSET IMPAIRMENTS AND OTHER CHARGES\nAsset impairments and other charges in 2024, included $925 million Passaic reserve adjustment as well as a pre-tax impairment of $334 million related to certain wells in the Gulf of America whose future net cash inflows did not indicate that the asset value is recoverable. See \nNote 13 - Lawsuits, Claims, Commitments and Contingencies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional information. Asset impairments in 2023 included a pre-tax impairment of $180 million related to undeveloped acreage in the northern non-core area of the Powder River Basin and a $29 million impairment related to an equity method investment in the Black Butte Coal Company.\nINTEREST AND DEBT EXPENSE, NET\nInterest and debt expense increased in 2024, compared to 2023, due to increased debt related to the CrownRock Acquisition. \n \nOTHER ITEMS\nIncome (expense) \nmillions\n2024\n2023\n2022\nGains on interest rate swaps, net\n$\n—\n \n$\n— \n$\n317 \nIncome from equity investments and other\n$\n862\n \n$\n534 \n$\n793 \nIncome tax expense\n$\n(1,174)\n$\n(1,733)\n$\n(813)\nDiscontinued operations, net\n$\n182\n \n$\n— \n$\n— \nINCOME FROM EQUITY INVESTMENTS AND OTHER\nIncome from equity investments and other increased in 2024, compared to 2023, primarily due to gains on sales of assets and higher operating income recognized by WES in 2024.\nINCOME TAX EXPENSE\nIncome tax expense decreased in 2024, compared to 2023, primarily as a result of lower net income. See \nNote 10\n \n- Income Taxes\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional details. \nDISCONTINUED OPERATIONS, NET\nDiscontinued operations, net in 2024 resulted from the Andes Arbitration final legal settlement. See \nNote 5 - Acquisitions, Divestitures and Other Transactions\n and \nNote 13 - Lawsuits\n, \nClaims, \nCommitments\n and \nContingen\ncies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional details. \nLIQUIDITY AND CAPITAL RESOURCES\n \nSOURCES AND USES OF CASH\nOccidental currently expects its operational cash flows and cash on hand to be sufficient to meet its current debt maturities and other obligations for the next 12 months from the date of this filing. As of December 31, 2024, Occidental’s sources of liquidity included $2.1 billion\n \nof cash and cash equivalents, $4.15 billion of borrowing capacity under its RCF, and $600 million of available borrowing capacity under its receivables securitization facility. \nIn February 2024, Occidental entered into a Third Amended and Restated Credit Agreement for the RCF extending the maturity date to June 30, 2028, and in May 2024, Occidental amended the RCF to increase its borrowing capacity by an additional $150 million to $4.15 billion. In July 2024, Occidental amended and extended the maturity date of its existing receivables securitization facility to July 30, 2027, maintaining $600 million of available borrowing capacity. There were no borrowings outstanding on Occidental’s RCF or receivables securitization facility as of December 31, 2024.\nOccidental’s planned 2025 capital expenditures are between $7.6 billion to $7.8 billion, before contributions from noncontrolling interests of $200 million. \nAs of December 31, 2024, and through the date of this filing, Occidental was in compliance with all covenants in its financing agreements. As of December 31, 2024, Occidental had $1.0 billion in current maturities of long-term debt which are due in 2025, and $4.1 billion in long-term obligations due in 2026. As of December 31, 2024, Occidental had non-cancelable lease payments of $582 million due in 2025, and $425 million due in 2026. Occidental’s final payment for the Carbon Engineering acquisition of approximately $415 million is due in November 2025.\nOccidental is party to various purchase agreements that are not accounted for as leases or otherwise accrued as liabilities as of December 31, 2024. These agreements consist primarily of obligations to secure terminal, pipeline and processing capacity, purchase services used in the normal course of business including transporting and disposing of \n OXY\n 2024 FORM 10-K\n49\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nproduced water, purchase goods used in the production of finished goods including certain chemical raw materials and power and agreements relating to equipment maintenance and service. Refer to the line item “Purchase Obligations” in the table below under Contractual Obligations for the amounts that will be paid for such outstanding off-balance sheet purchase obligations from 2025 and thereafter.\nCONTRACTUAL OBLIGATIONS\nThe following table summarizes and cross-references Occidental’s contractual obligations and indicates on- and off-balance sheet obligations as of December 31, 2024. Commitments related to held for sale assets are excluded.\nmillions\n \nPayments Due by Year\nTotal\n2025\n2026 and 2027\n2028 and 2029\n2030 and \nthereafter\nOn-Balance Sheet\n \n \n \n \n \nCurrent portion of long-term debt (Note 6) \n(a)\n$\n1,003 \n$\n1,003 \n$\n— \n$\n— \n$\n— \nLong-term debt (Note 6) \n(a)\n23,388 \n— \n5,653 \n2,761 \n14,974 \nExpected interest payments on debt\n13,179 \n1,451 \n2,459 \n2,050 \n7,219 \nLeases (Note 7) \n(b)\n2,021 \n582 \n706 \n331 \n402 \nAsset retirement obligations (Note 1)\n4,430 \n388 \n893 \n571 \n2,578 \nOther long-term liabilities \n(c)\n3,339 \n— \n896 \n209 \n2,234 \nOff-Balance Sheet\nPurchase obligations \n(d)\n12,808 \n3,414 \n4,361 \n2,598 \n2,435 \nTotal\n$\n60,168 \n$\n6,838 \n$\n14,968 \n$\n8,520 \n$\n29,842 \n(a)\nExcluded unamortized debt premium, net, debt issuance costs and interest.\n(b)\nOccidental is the lessee under various agreements for real estate, equipment, plants and facilities. \n(c)\nIncluded long-term obligations under postretirement benefits, accrued transportation commitments, ad valorem taxes and other accrued liabilities.\n(d)\nAmounts included payments which will become due under long-term agreements to purchase goods and services used in the normal course of business to secure terminal, pipeline and processing capacity, CO\n2,\n drilling rigs and services, electrical power, non-lease components, steam and certain chemical raw materials including but not limited to capital commitments. Amounts excluded certain product purchase obligations related to marketing activities for which there are no minimum purchase requirements or the amounts are not fixed or determinable. Long-term purchase contracts were discounte\nd at a \n5.51%\n \ndiscount rate. \nGUARANTEES\nOccidental has entered into various guarantees, indemnities and commitments provided by Occidental to third parties, mainly to provide assurance that Occidental or its consolidated subsidiaries or affiliates will meet their various obligations.\nAs of the date of this filing, Occidental has provided required financial assurance through a combination of cash, letters of credit and surety bonds. Occidental has not issued any letters of credit under the RCF or other committed facilities. For additional information, see Risk Factors in Part I Item 1A of this Form 10-K.\nCASH FLOW ANALYSIS\nCASH PROVIDED BY OPERATING ACTIVITIES\nmillions\n2024\n2023\n2022\nOperating cash flow from continuing operations\n$\n11,739\n \n$\n12,308 \n$\n16,810 \nOperating cash flow from discontinued operations, net of taxes\n(300)\n— \n— \nNet cash provided by operating activities\n$\n11,439\n \n$\n12,308 \n$\n16,810 \nCash flow provided by operating activities decreased in 2024, compared to 2023, primarily from lower realized pricing across most product lines in the chemical segment, lower realized oil and domestic gas prices in the oil and gas segment, and the final settlement related to the Andes Arbitration, partially offset by higher sales volumes in both the chemical and oil and gas segments.  \n50\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nCASH USED BY INVESTING ACTIVITIES\nmillions\n2024\n2023\n2022\nCapital expenditures\n \nOil and gas\n$\n(5,320)\n$\n(4,960)\n$\n(3,844)\nChemical\n(685)\n(535)\n(322)\nMidstream and marketing\n(880)\n(656)\n(268)\nCorporate\n(133)\n(119)\n(63)\nTotal\n$\n(7,018)\n$\n(6,270)\n$\n(4,497)\nChanges in capital accrual\n96\n \n25 \n147 \nPurchase of businesses, assets and equity investments, net\n(9,129)\n(713)\n(990)\nProceeds from sale of assets and equity investments, net\n1,673\n \n448 \n584 \nOther investing activities, net\n(212)\n(470)\n(116)\nNet cash used by investing activities\n$\n(14,590)\n$\n(6,980)\n$\n(4,872)\nCash flows used by investing activities increased by $7.6 billion in 2024 compared to 2023. In 2024, Occidental continued the construction of STRATOS in OLCV, increased domestic development activities in the oil and gas segment, and continued the expansion and conversion activities of OxyChem’s Battleground chlor-alkali plant, which increased capital expenditures in 2024, compared to 2023.\nIn 2024, purchase of businesses, assets and equity investments, net included the CrownRock Acquisition consisting of $8.8 billion of net cash consideration (inclusive of cash acquired, certain working capital and other customary purchase price adjustments). In 2023, purchase of businesses, assets and equity investments, net primarily included the purchase of Carbon Engineering.\nIn 2024, Occidental sold non-core assets in the Powder River Basin with near to intermediate term lease expirations and certain Delaware Basin assets in Texas and New Mexico for combined net proceeds of $769 million and 19.5 million of its limited partner units in WES for proceeds of $697 million. In 2023, Occidental sold certain non-core proved and unproved properties in the Permian Basin for proceeds of $202 million and 5.1 million of its limited partner units in WES for proceeds of $128 million. See \nNote 5 - Acquisitions, Divestitures and Other Transactions\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for a listing of assets and equity investments acquired and sold in 2024, 2023 and 2022.\nCASH PROVIDED (USED) BY FINANCING ACTIVITIES\nmillions\n2024\n2023\n2022\nNet cash provided (used) by financing activities\n$\n3,844\n \n$\n(4,890)\n$\n(13,715)\nNet cash provided by financing activities was $3.8 billion in 2024, which included net proceeds from debt issuance of $9.6 billion and proceeds from the issuance of common stock of $584 million primarily related to common stock warrant exercises, offset by debt repayment of $4.5 billion and cash dividends paid on common and preferred stock of $1.4 billion. See \nItem 5 Market for Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n in Part II of this Form 10-K and \nNote 14 - Stockholders' Equity\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional information related to Occidental’s share repurchases.\nLAWSUITS, CLAIMS, COMMITMENTS AND CONTINGENCIES\nLEGAL MATTERS\nFor information on Occidental’s Lawsuits, Claims, Commitments and Contingencies, see the information in \nNote 13 - Lawsuits, Claims, Commitments and Contingencies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K.\n OXY\n 2024 FORM 10-K\n51\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nENVIRONMENTAL EXPENDITURES\nEnvironmental expenditures relate to the prevention, monitoring, control, treatment or abatement of waste, emissions or releases to air, water or land from operations of Occidental’s subsidiaries. These activities are generally integrated with ongoing operations or development projects and therefore are estimated using definitions and guidelines established by the American Petroleum Institute. Although these expenditures may be significant to the results of operations in any single period, the Company does not presently expect them to have a material adverse effect on the Company's liquidity or financial position. Occidental estimated the environmental expenditures to be approximately $812 million in 2024 compared to $736 million in 2023. Included in these expenditures were $253 million and $206 million as of 2024 and 2023, respectively, related to longer-lived improvements in properties currently operated by Occidental. They also include $559 million of operating expenses in 2024 and $530 million in 2023, which are incurred on a continual basis. While Occidental does not expect these costs to fluctuate significantly in the near term, changes in environmental regulations may increase these costs. The environmental expenditures do not include litigation-related costs, including fines, penalties or settlements, Occidental’s investments in low-carbon ventures or costs incurred to satisfy asset retirement obligations. \nRemediation expenses of Occidental’s subsidiaries, which are not included in the expenditures above, relate to existing conditions from alleged past practices and were $76 million in 2024 and $79 million in 2023. \nFor additional information on Occidental’s Environmental Liabilities and Expenditures, see the information in \nNote 12 - Environmental Liabilities and Expenditures\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K.\nGLOBAL INVESTMENTS\nA portion of Occidental’s assets are located outside North America. The following table shows the geographic distribution of Occidental’s assets as of December 31, 2024, at both the segment and consolidated level, related to Occidental’s ongoing operations:\nmillions\nOil and gas\nChemical\nMidstream and marketing\nCorporate and other\nTotal Consolidated\nNorth America\nUnited States\n$\n59,089\n \n$\n4,921\n \n$\n9,022\n \n$\n3,086\n \n$\n76,118\n \nCanada\n—\n \n100\n \n1,550\n \n—\n \n1,650\n \nMiddle East\n3,632\n \n—\n \n2,936\n \n—\n \n6,568\n \nNorth Africa and Other\n875\n \n101\n \n133\n \n—\n \n1,109\n \nConsolidated\n$\n63,596\n \n$\n5,122\n \n$\n13,641\n \n$\n3,086\n \n$\n85,445\n \nIn 2024, net sales outside North America totaled $4.3 billion, or approximately 16% of total net sales.\n52\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe process of preparing financial statements in accordance with United States GAAP requires Occidental’s management to make informed estimates and judgments regarding certain items and transactions. Changes in facts and circumstances or discovery of new information may result in revised estimates and judgments and actual results may differ from these estimates upon settlement but generally not by material amounts. The selection and development of these policies and estimates have been discussed with the Audit Committee of the Board of Directors. Occidental considers the following to be its most critical accounting policies and estimates that involve management’s judgment.\nOIL AND GAS PROPERTIES\nThe carrying value of Occidental’s PP&E represents the cost incurred to acquire or develop the asset, including any AROs and capitalized interest, net of DD&A and any impairment charges. For assets acquired in a business combination, PP&E cost is based on fair values at the acquisition date. AROs and interest costs incurred in connection with qualifying capital expenditures are capitalized and amortized over the useful lives of the related assets.\nOccidental uses the successful efforts method to account for its oil and gas properties. Under this method, Occidental capitalizes costs of acquiring properties, costs of drilling successful exploration wells and development costs. The costs of exploratory wells are initially capitalized pending a determination of whether proved reserves have been found. If proved reserves have been found, the costs of exploratory wells remain capitalized. For exploratory wells that find reserves that cannot be classified as proved when drilling is completed, costs continue to be capitalized as suspended exploratory drilling costs if there have been sufficient reserves found to justify completion as a producing well and sufficient progress is being made in assessing the economic and operating viability of the project. At the end of each quarter, management reviews the status of all suspended exploratory drilling costs in light of ongoing exploration activities and in particular, whether Occidental is making sufficient progress in its ongoing exploration and appraisal efforts or, in the case of discoveries requiring government sanctioning, analyzing whether development negotiations are underway and proceeding as planned. If management determines that future appraisal drilling or development activities are unlikely to occur, associated suspended exploratory well costs are expensed.\nOccidental expenses annual lease rentals, the costs of injectants used in production and geological and geophysical costs as incurred for exploration activities.\nOccidental determines depreciation and depletion of oil and gas producing properties by the unit-of-production method. It amortizes leasehold acquisition costs over total proved reserves and capitalized development and successful exploration costs over proved developed reserves.\nProved oil and gas reserves are those quantities of oil and gas which, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible—from a given date forward, from known reservoirs, and under existing economic conditions, operating methods, and government regulations—prior to the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation. \nSeveral factors could change Occidental’s proved oil and gas reserves. For example, Occidental receives a share of production from PSCs to recover its costs and generally an additional share for profit. Occidental’s share of production and reserves from these contracts decreases when product prices rise and increases when prices decline. Generally, Occidental’s net economic benefit from these contracts is greater at higher product prices. In other cases, particularly with long-lived properties, lower product prices may lead to a situation where production of a portion of proved reserves becomes uneconomical. For such properties, higher product prices typically result in additional reserves becoming economical. Estimation of future production and development costs is also subject to change partially due to factors beyond Occidental’s control, such as energy costs and inflation or deflation of oil field service costs. These factors, in turn, could lead to changes in the quantity of proved reserves. Additional factors that could result in a change of proved reserves include production decline rates and operating performance differing from those estimated when the proved reserves were initially recorded. Changes in the political and regulatory climate, including new or amended laws and regulations or changes in the interpretation of those laws and regulations, could lead to decreases in proved reserves as development horizons may be extended into the future, changes to development locations are necessary or the changes result in higher development or operating costs.\nOccidental performs impairment tests with respect to its proved properties whenever events or circumstances indicate that the carrying value of property may not be recoverable. If there is an indication the carrying amount of the asset may not be recovered due to significant and prolonged declines in current and forward prices, significant changes in reserve estimates, changes in management’s plans or other significant events, management will evaluate the property for impairment. Under the successful efforts method, if the sum of the undiscounted cash flows is less than the carrying value of the proved property, the carrying value is reduced to estimated fair value and reported as an impairment charge in the period. Individual proved properties are grouped on a field-by-field basis or by logical grouping of assets if there is a significant shared infrastructure. The fair value of impaired assets is typically determined based on the present value of expected future cash flows using discount rates believed to be consistent with those used by market participants. The impairment test incorporates a number of assumptions involving expectations of future cash flows which can change \n OXY\n 2024 FORM 10-K\n53\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nsignificantly over time. These assumptions include estimates of future production, product prices, contractual prices, estimates of risk-adjusted oil and gas proved and unproved reserves and estimates of future operating and development costs. It is reasonably possible that prolonged declines in commodity prices, reduced capital spending in response to lower prices or increases in operating costs could result in impairments.\nFor impairment testing, unless prices are contractually fixed, Occidental uses observable forward strip prices for oil and natural gas prices when projecting future cash flows. Future operating and development costs are estimated using the current cost environment applied to expectations of future operating and development activities to develop and produce oil and gas reserves. Market prices for oil, NGL and natural gas have been volatile and may continue to be volatile in the future. Changes in global supply and demand, transportation capacity, currency exchange rates, applicable laws and regulations and the effect of changes in these variables on market perceptions could impact current forecasts. Future fluctuations in commodity prices could cause estimates of future cash flows to vary significantly. \nNet capitalized costs attributable to unproved properties were $10.2 billion as of December 31, 2024, and $10.2 billion as of December 31, 2023. The unproved amounts are not subject to DD&A until they are classified as proved properties. Individually insignificant unproved properties are combined and amortized on a group basis based on factors such as geographic location, lease terms, success rates and other factors to provide for full amortization upon lease expiration or abandonment. \nSignificant unproved properties are assessed individually for impairment and, when events or circumstances indicate that the carrying value of property may not be recovered, a valuation allowance is provided if an impairment is indicated. Occidental periodically reviews significant unproved properties for impairments; numerous factors are considered, including, but not limited to, availability of funds for future exploration and development activities, current exploration and development plans, favorable or unfavorable exploration activity on the property or the adjacent property, geologists’ evaluation of the property, the current and projected political and regulatory climate, contractual conditions and the remaining lease term for the properties. If an impairment is indicated, Occidental will first determine whether a comparable transaction for similar properties or implied acreage valuation derived from domestic onshore market participants is available and will adjust the carrying amount of the unproved property to its fair value using the market approach. In situations where the market approach is not observable and unproved reserves are available, undiscounted future net cash flows used in the impairment analysis are determined based on management’s risk-adjusted estimates of unproved reserves, future commodity prices and future costs to produce the reserves. If undiscounted future net cash flows are less than the carrying value of the property, the future net cash flows are discounted and compared to the carrying value for determining the amount of the impairment loss to record. Occidental utilizes the same assumptions and methodology discussed above for cash flows associated with proved properties. \nPROVED RESERVES\nOccidental estimates its proved oil and gas reserves according to the definition of proved reserves provided by the SEC’s Rule 4-10 (a) of Regulation S-X and the Financial Accounting Standards Board. Proved oil and gas reserves are those quantities of oil and gas which, by analysis of geoscience and engineering data, can be estimated with reasonable certainty to be economically producible—from a given date forward, from known reservoirs, and under existing economic conditions, operating methods, and government regulations—prior to the time at which contracts providing the right to operate expire, unless evidence indicates that renewal is reasonably certain, regardless of whether deterministic or probabilistic methods are used for the estimation. Prices include consideration of price changes provided only by contractual arrangements and do not include adjustments based on expected future conditions. For reserves information, see the \nSupplemental Information on Oil and Gas Exploration and Production Activities\n under Item 8 of this Form 10-K.\nEngineering estimates of the quantities of proved reserves are inherently imprecise and represent only approximate amounts because of the judgments involved in developing such information. Occidental’s estimates of proved reserves are made using available geological and reservoir data as well as production performance data. The reliability of these estimates at any point in time depends on both the quality and quantity of the technical and economic data and the efficiency of extracting and processing the hydrocarbons. These estimates are reviewed annually by internal reservoir engineers and revised, either upward or downward, as warranted by additional data. Revisions are necessary due to changes in, among other things, development plans, reservoir performance, prices, economic conditions and government restrictions as well as changes in the expected recovery associated with infill drilling. Decreases in prices, for example, may cause a reduction in some proved reserves due to reaching economic limits at an earlier projected date. A material adverse change in the estimated volume of proved reserves could have a negative impact on DD&A and could result in property impairments.\nThe most significant ongoing financial statement effect from a change in Occidental’s oil and gas reserves or impairment of its proved properties would be to the DD&A rate. For example, a 5% increase or decrease in the amount of oil and gas reserves would change the DD&A rate by approximately $0.65/Bbl, which would increase or decrease pre-tax income by approximately $345 million annually at current production rates. \nFAIR VALUES\nOccidental estimates fair-value of long-lived assets for impairment testing, assets and liabilities acquired in a business combination or exchanged in non-monetary transactions, pension plan assets and initial measurements of AROs.\n54\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nAccounting for the acquisition of a business requires the allocation of the purchase price to the various assets and liabilities of the acquired business and recording deferred taxes for any differences between the allocated values and tax basis of assets and liabilities. Any excess of the purchase price over the amounts assigned to assets and liabilities is recorded as goodwill. The purchase price allocation is accomplished by recording each asset and liability at its estimated fair value, which may be determined using different methods of fair value measurements, largely based on the availability and quality of market information. Occidental primarily applies the market approach for recurring fair value measurements, maximizes its use of observable inputs and minimizes its use of unobservable inputs. \nFINANCIAL ASSETS AND LIABILITIES\nOccidental utilizes published prices or counterparty statements for valuing the majority of its financial assets and liabilities measured and reported at fair value. In addition to using market data, Occidental makes assumptions in valuing its assets and liabilities, including assumptions about the risks inherent in the inputs to the valuation technique. For financial assets and liabilities carried at fair value, Occidental measures fair value using the following methods:\n■\nOccidental values exchange-cleared commodity derivatives using closing prices provided by the exchange as of the balance sheet date. These derivatives are classified as using quoted prices in active markets for the assets or liabilities (Level 1).\n■\nOTC bilateral financial commodity contracts, international exchange contracts, options and physical commodity forward purchase and sale contracts are generally classified as using observable inputs other than quoted prices for the assets or liabilities (Level 2) and are generally valued using quotations provided by brokers or industry-standard models that consider various inputs, including quoted forward prices for commodities, time value, volatility factors, credit risk and current market and contractual prices for the underlying instruments, as well as other relevant economic measures. Substantially all of these inputs are observable in the marketplace throughout the full term of the instrument and can be derived from observable data or are supported by observable prices at which transactions are executed in the marketplace.\n■\nOccidental values commodity derivatives based on a market approach that considers various assumptions, including quoted forward commodity prices and market yield curves. The assumptions used include inputs that are generally unobservable in the marketplace or are observable but have been adjusted based upon various assumptions and the fair value is designated as using unobservable inputs (Level 3) within the valuation hierarchy.\n■\nOccidental values debt using market-observable information for debt instruments that are traded on secondary markets. For debt instruments that are not traded, the fair value is determined by interpolating the value based on debt with similar terms and credit risk.\nNON-FINANCIAL ASSETS\nOccidental uses market-observable prices for assets when comparable transactions can be identified that are similar to the asset being valued. When Occidental is required to measure fair value and there is not a market-observable price for the asset or for a similar asset then the cost or income approach is used depending on the quality of information available to support management’s assumptions. The cost approach is based on management’s best estimate of the current asset replacement cost. The income approach is based on management’s best assumptions regarding expectations of future net cash flows and the expected cash flows are discounted using a commensurate risk-adjusted discount rate. Such evaluations involve significant judgment. The results are based on expected future events or conditions such as sales prices, estimates of future oil and gas production or throughput, development and operating costs and the timing thereof, economic and regulatory climates and other factors, most of which are often outside of management’s control. However, assumptions used reflect a market participant’s view of long-term prices, costs and other factors and are consistent with assumptions used in Occidental’s business plans and investment decisions.\nENVIRONMENTAL LIABILITIES AND EXPENDITURES\nCertain subsidiaries of Occidental incur environmental liabilities and expenditures that relate to current operations and are expensed or capitalized by such subsidiaries as appropriate. Certain subsidiaries also incur environmental liabilities and expenditures with respect to remediation of existing conditions from alleged past practices at Third-Party, Currently Operated, and Closed or Non-operated Sites, which categories may include NPL Sites. Those environmental liabilities and related charges and expenses for estimated remediation costs from alleged past practices are recorded when environmental remediation efforts are probable and the costs can be reasonably estimated. Occidental discloses such remediation liabilities on a consolidated basis. In determining the environmental remediation liability and the range of reasonably possible additional losses, Occidental refers to currently available information, including relevant past experience, remedial objectives, available technologies, applicable laws and regulations and cost-sharing arrangements. These environmental remediation liabilities are based on management’s estimate of the most likely cost to be incurred using the most cost-effective technology reasonably expected to achieve the remedial objective. Occidental periodically reviews these environmental remediation liabilities and adjusts them as new information becomes available. Occidental’s subsidiaries \n OXY\n 2024 FORM 10-K\n55\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\ngenerally record reimbursements or recoveries of environmental remediation costs in income when received, or when receipt of recovery is highly probable.\nMany factors could affect future remediation costs incurred by Occidental’s subsidiaries and result in adjustments to environmental remediation liabilities and the range of reasonably possible additional losses. The most significant are: (i) cost estimates for remedial activities may vary from the initial estimate; (ii) the length of time, type or amount of remediation necessary to achieve the remedial objective may change due to factors such as site conditions, the ability to identify and control contaminant sources or the discovery of additional contamination; (iii) a regulatory agency may ultimately reject or modify proposed remedial plans; (iv) improved or alternative remediation technologies may change remediation costs; (v) laws and regulations may change remediation requirements or affect cost sharing or allocation of liability; and (vi) changes in allocation or cost-sharing arrangements may occur.\nCertain sites involve multiple parties with various cost-sharing arrangements, which generally fall into the following three categories: (i) environmental proceedings that result in a negotiated or prescribed allocation of remediation costs among Occidental’s affected subsidiary and other alleged potentially responsible parties; (ii) oil and gas ventures in which each participant pays its proportionate share of remediation costs reflecting its working interest; or (iii) contractual arrangements, typically relating to purchases and sales of properties, in which the parties to the transaction agree to methods of allocating remediation costs. In these circumstances, the affected subsidiary evaluates the financial viability of other parties with whom it is alleged to be jointly liable, the degree of their commitment to participate and the consequences to such subsidiary of their failure to participate when estimating its ultimate share of liability. Occidental subsidiaries record environmental remediation liabilities at their expected net cost of remedial activities. Based on these factors, except as otherwise disclosed in \nNote 12 - Environmental Liabilities and Expenditures\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K, Occidental’s subsidiaries believe that they will not be required to assume a share of liability of such other potentially responsible parties in an amount materially above amounts reserved.\nIn addition to the costs of investigations and cleanup measures, which often take in excess of 10 years at CERCLA NPL sites, Occidental subsidiaries’ environmental remediation liabilities include estimates of the costs to operate and maintain remedial systems. If remedial systems are modified over time in response to significant changes in site-specific data, laws, regulations, technologies or engineering estimates, Occidental’s subsidiaries review and adjust their environmental remediation liabilities accordingly.\nIf Occidental or its subsidiaries were to adjust the balance of their environmental remediation liabilities based on the factors described above, the amount of the increase or decrease would be recognized in earnings. For example, if the balance were reduced by 10%, Occidental would record a pre-tax increase to income of approximately $190 million. If the balance were increased by 10%, Occidental would record an additional remediation expense of approximately $190 million.\nINCOME TAXES\nOccidental and its subsidiaries file various U.S. federal, state and foreign income tax returns. The impact of changes in tax regulations are reflected when enacted. In general, deferred federal, state and foreign income taxes are provided on temporary differences between the financial statement carrying amounts of assets and liabilities and their respective tax basis. Occidental routinely assesses the realizability of its deferred tax assets. If Occidental concludes that it is more likely than not that some of the deferred tax assets will not be realized, the tax asset is reduced by a valuation allowance. Occidental recognizes a tax benefit from an uncertain tax position when it is more likely than not that the position will be sustained upon examination, based on the technical merits of the position. The tax benefit recorded is equal to the largest amount that is greater than 50% likely to be realized through final settlement with a taxing authority. Interest and penalties related to unrecognized tax benefits are recognized in income tax expense (benefit). \nSee \nNote 10 - Income Taxes\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K.\nLOSS CONTINGENCIES\nOccidental or certain of its subsidiaries are involved, in the normal course of business, in lawsuits, claims and other legal proceedings and audits. Occidental or its affected subsidiaries, as appropriate, accrues reserves for these matters when it is probable that a liability has been incurred and the liability can be reasonably estimated. In addition, Occidental discloses, in aggregate on a consolidated basis, exposure to loss in excess of the amount recorded on the balance sheet for these matters if it is reasonably possible that an additional material loss may be incurred. Occidental reviews such loss contingencies on an ongoing basis.\nLoss contingencies are based on judgments made by management with respect to the likely outcome of these matters and are adjusted as appropriate. Management’s judgments could change based on new information, changes in, or interpretations of, laws or regulations, changes in management’s plans or intentions, opinions regarding the outcome of legal proceedings or other factors. See \nNote 13 - Lawsuits, Claims, Commitments and Contingencies\n in the Notes to Consolidated Financial Statements in Part II Item 8 of this Form 10-K for additional information.\n56\n OXY\n 2024 FORM 10-K\ntable of contents\nMANAGEMENT’S DISCUSSION AND ANALYSIS\nSAFE HARBOR DISCUSSION REGARDING OUTLOOK AND OTHER FORWARD-LOOKING DATA\nPortions of this report contain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. All statements other than statements of historical fact are “forward-looking statements” for purposes of federal and state securities laws, including, but not limited to: any projections of earnings, revenue or other financial items or future financial position or sources of financing; any statements of the plans, strategies and objectives of management for future operations or business strategy; any statements regarding future economic conditions or performance; any statements of belief; and any statements of assumptions underlying any of the foregoing. Words such as “estimate,” “project,” “predict,” “will,” “would,” “should,” “could,” “may,” “might,” “anticipate,” “plan,” “intend,” “believe,” “expect,” “aim,” “goal,” “target,” “objective,” \"commit,\" \"advance,\" “likely” or similar expressions that convey the prospective nature of events or outcomes are generally indicative of forward-looking statements. You should not place undue reliance on these forward-looking statements, which speak only as of the date of this report unless an earlier date is specified. Unless legally required, Occidental does not undertake any obligation to update, modify or withdraw any forward-looking statements as a result of new information, future events or otherwise.\nActual outcomes or results may differ from anticipated results, sometimes materially. Forward-looking and other statements regarding Occidental's sustainability efforts and aspirations are not an indication that these statements are necessarily material to investors or require disclosure in Occidental's filings with the SEC. In addition, historical, current and forward-looking sustainability-related statements may be based on standards for measuring progress that are still developing, internal controls and processes that continue to evolve and definitions, assumptions, data sources and estimates or measurements that are subject to change in the future, including through rulemaking or guidance. Factors that could cause results to differ from those projected or assumed in any forward-looking statement include, but are not limited to: general economic conditions, including slowdowns and recessions, domestically or internationally; Occidental’s indebtedness and other payment obligations, including the need to generate sufficient cash flows to fund operations; Occidental’s ability to successfully monetize select assets and repay or refinance debt and the impact of changes in Occidental’s credit ratings or future increases in interest rates; assumptions about energy markets; global and local commodity and commodity-futures pricing fluctuations and volatility; supply and demand considerations for, and the prices of, Occidental’s products and services; actions by OPEC and non-OPEC oil producing countries; results from operations and competitive conditions; future impairments of Occidental's proved and unproved oil and gas properties or equity investments, or write-downs of productive assets, causing charges to earnings; unexpected changes in costs; inflation, its impact on markets and economic activity and related monetary policy actions by governments in response to inflation; availability of capital resources, levels of capital expenditures and contractual obligations; the regulatory approval environment, including Occidental's ability to timely obtain or maintain permits or other government approvals, including those necessary for drilling and/or development projects; Occidental's ability to successfully complete, or any material delay of, field developments, expansion projects, capital expenditures, efficiency projects, acquisitions or divestitures; risks associated with acquisitions, mergers and joint ventures, such as difficulties integrating businesses, uncertainty associated with financial projections or projected synergies, restructuring, increased costs and adverse tax consequences; uncertainties and liabilities associated with acquired and divested properties and businesses; uncertainties about the estimated quantities of oil, NGL and natural gas reserves; lower-than-expected production from development projects or acquisitions; Occidental’s ability to realize the anticipated benefits from prior or future streamlining actions to reduce fixed costs, simplify or improve processes and improve Occidental’s competitiveness; exploration, drilling and other operational risks; disruptions to, capacity constraints in, or other limitations on the pipeline systems that deliver Occidental’s oil and natural gas and other processing and transportation considerations; volatility in the securities, capital or credit markets, including capital market disruptions and instability of financial institutions; government actions (including geopolitical, trade, tariff and regulatory uncertainties), war (including the Russia-Ukraine war and conflicts in the Middle East) and political conditions and events; HSE risks, costs and liability under existing or future federal, regional, state, provincial, tribal, local and international HSE laws, regulations and litigation (including related to climate change or remedial actions or assessments); legislative or regulatory changes, including changes relating to hydraulic fracturing or other oil and natural gas operations, retroactive royalty or production tax regimes and deep-water and onshore drilling and permitting regulations; Occidental's ability to recognize intended benefits from its business strategies and initiatives, such as Occidental's low-carbon ventures businesses or announced GHG emissions reduction targets or net-zero goals; potential liability resulting from pending or future litigation, government investigations and other proceedings; disruption or interruption of production or manufacturing or facility damage due to accidents, chemical releases, labor unrest, weather, power outages, natural disasters, cyber-attacks, terrorist acts or insurgent activity; the scope and duration of global or regional health pandemics or epidemics, and actions taken by government authorities and other third parties in connection therewith; the creditworthiness and performance of Occidental's counterparties, including financial institutions, operating partners and other parties; failure of risk management; Occidental’s ability to retain and hire key personnel; supply, transportation and labor constraints; reorganization or restructuring of Occidental’s operations; changes in state, federal or international tax rates; and actions by third parties that are beyond Occidental's control.\nAdditional information concerning these and other factors that may cause Occidental’s results of operations and financial position to differ from expectations can be found in Item 1A, “Risk Factors” and elsewhere in this Form 10-K, as well as in Occidental’s other filings with the SEC, including Occidental’s Quarterly Reports on Form 10-Q and Current Reports on Form 8-K.\n OXY\n 2024 FORM 10-K\n57\ntable of contents\nQUANTITATIVE AND QUALITATIVE DISCLOSURES",
  "item2": null
}