{
  "source_file": "panw-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our condensed consolidated financial statements and related notes appearing elsewhere in this Quarterly Report on Form 10-Q. This Quarterly Report on Form 10-Q, including, without limitation, the following discussion and analysis, contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements generally can be identified by words such as “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “intend,” “may,” “plan,” “potentially,” “projects,” “will,” “will be,” “will continue,” “will likely result,” “would” and similar expressions that convey uncertainty of future events or outcomes. These forward-looking statements include, but are not limited to, statements concerning the following: expectations regarding the cybersecurity landscape; expectations regarding our platformization strategy and related progress and opportunities; expectations regarding annual recurring revenue, remaining performance obligations, and product development strategy; expectations regarding artificial intelligence; expectations regarding our strategic partnerships; expectations regarding drivers of and factors affecting growth in our business; statements regarding expected profitability, trends in annual recurring revenue, trends in remaining performance obligations, our mix of product and subscription and support revenue, cost of revenue, gross margin, cash flows, operating expenses, including future share-based compensation expense, income taxes, investment plans, and liquidity; expected recurring revenues resulting from growth in our end-customers and increased adoption of our products and cloud-delivered security solutions; the performance advantages of our products and subscription and support offerings and the potential benefits to our customers; expectations regarding future investments in research and development and product development, customer support, in our employees and in our sales force, including expectations regarding growth in our sales headcount; expectations that we will continue to expand our global presence; expectations regarding our revenues, including the seasonality and cyclicality from quarter to quarter; expectations relating to our customer financing activities; the sufficiency of our cash flow from operations with existing cash, cash equivalents, and investments to meet our cash needs for the foreseeable future; our ability to successfully acquire and integrate companies and assets and expectations and intentions with respect to the assets, products and technologies that we acquire, including with respect to our proposed acquisition of CyberArk Software Ltd. and our expectations regarding the benefits and synergies of the proposed acquisition; expectations regarding contingent consideration obligations; the timing and amount of capital expenditures and share repurchases; the effects of worldwide economic and geopolitical conditions, including but not limited to hostilities in Israel and the surrounding regions, inflation, interest rate levels, public or administration policies, trade regulations, trade policy, growth rates and other conditions, on our operating and financial results and performance; the manufacture, delivery and cost of certain of our products; the effects of litigation or regulatory developments involving us or affecting our industry; and other statements regarding our future operations, financial condition and prospects, and business strategies. These forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties, which could cause our actual results to differ materially from those anticipated or implied by any forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in this Quarterly Report on Form 10-Q and, in particular, the risks discussed under the caption “Risk Factors” in Part II, Item 1A of this report and those discussed in other documents we file with the Securities and Exchange Commission (“SEC”) from time to time. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.\nOur Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is organized as follows:\n•\nOverview.\n A discussion of our business and overall analysis of financial and other highlights in order to provide context for the remainder of MD&A.\n•\nKey Financial Metrics.\n A summary of our U.S. GAAP and non-GAAP key financial metrics, which management monitors to evaluate our performance.\n•\nResults of Operations.\n A discussion of the nature and trends in our financial results and an analysis of our financial results comparing the three months ended October 31, 2025 to the three months ended October 31, 2024.\n•\nLiquidity and Capital Resources.\n An analysis of changes on our balance sheets and cash flows, and a discussion of our financial condition and our ability to meet cash needs.\n•\nCritical Accounting Estimates.\n A discussion of our accounting policies that require critical estimates, assumptions, and judgments.\n•\nRecent Accounting Pronouncements.\n A discussion of expected impacts of impending accounting changes on financial information to be reported in the future.\n- 20 -\nTable of Contents\nOverview\nOur mission is to be the cybersecurity partner of choice for enterprises, organizations, service providers, and government entities to protect our digital way of life. Our cybersecurity platforms and services help secure enterprise users, networks, clouds, and endpoints by delivering comprehensive cybersecurity backed by artificial intelligence (“AI”) and automation. A key element of our strategy is to help our customers simplify their security architectures through consolidating disparate point products. We execute on this strategy by developing our capabilities and packaging our offerings into platforms which are able to cover many of our customers’ needs in the markets in which we operate. Our platformization strategy combines various products and services into a tightly integrated architecture for more secure, faster and cost-effective outcomes.\nNetwork Security\nOur network security platform is designed to deliver complete zero trust solutions to our customers. The platform includes: \n•\nSecure Access Service Edge (“SASE”)\n. Prisma\n®\n Access, when combined with Prisma SD-WAN, provides a comprehensive SASE offering that secures users working from anywhere and pioneers the modernization of branch offices. Prisma Browser further extends zero-trust security and data protection to the browser, where the majority of work is done today, providing users with the freedom to work securely using our secure browser from any device.\n•\nNext-Generation Firewalls.\n Our hardware ML-Powered Next-Generation Firewalls (“NGFWs”) secure on-premises environments including campus locations and data centers. Our software NGFWs secure cloud networks.\n•\nCloud-Delivered Security Services (“CDSS”). \nOur network security platform integrates a suite of CDSS that complements our SASE and Firewall solutions. These include Advanced Threat Prevention, Advanced WildFire\n®\n, Advanced URL Filtering, Advanced DNS Security, Device Security, GlobalProtect\n®\n, Prisma Access Agent, Enterprise Data Loss Prevention (“Enterprise DLP”), AI for IT Operations (“AIOps”), Software as a Service (“SaaS”) Security, and AI Access Security. Through these add-on services, our customers are able to secure their content, applications, users, and devices across their entire organization. \n•\nPrisma AIRS. \nPrisma AIRS™ is a comprehensive AI security platform that has been designed to protect customers’ entire AI ecosystem by providing AI Model Security, AI Posture Management, AI Red Teaming, AI Runtime Security, and AI Agent Security. \n•\nStrata Cloud Manager (“SCM”).\n SCM, our network security management solution, centrally manages network security across all remote workers, branches, headquarters, campuses, and cloud. This comprehensive solution includes Strata Copilot, which offers a natural language interface for enhanced insights and guided remediation, and integrates Autonomous Digital Experience Monitoring (“ADEM”) to proactively maintain infrastructure health, facilitate AI-driven one-click troubleshooting, and ensure seamless end-user performance across the enterprise.\nSecurity Operations\nOur AI-powered Cortex platform transforms end-to-end security operations with unified data, AI, and automation for more secure, faster, and cost effective outcomes. We have consolidated our industry-leading Security Operations and Cloud Security capabilities on a single comprehensive platform to provide centralized visibility, proactive protection, real-time prevention, AI-driven insights, and automated remediation across enterprise and cloud.\n•\nSecurity Operations.\n We deliver the next generation of security operations capabilities that unifies standalone Security Information and Event Management (“SIEM”) tools, endpoint security, security automation, cloud detection and response (“CDR”), as well as attack surface management (“ASM”) capabilities on our Cortex\n®\n platform. These include Cortex XSIAM\n®\n, for AI-powered security operations replacing traditional SIEM tools; Cortex XDR\n®\n, for the prevention, detection, and response to complex cybersecurity attacks; Cortex XSOAR\n®\n, for security orchestration, automation, and response (“SOAR”); and Cortex Xpanse\n®\n, for ASM. \n•\nCloud Security.\n We deliver comprehensive security across the cloud application development lifecycle through Cortex Cloud, delivered as a scalable SaaS offering. As a comprehensive Cloud Native Application Protection Platform (“CNAPP”) combined with CDR, Cortex Cloud secures multi- and hybrid-cloud environments for applications, data, generative AI (“GenAI”) ecosystem, and the cloud native technology stack across the full development lifecycle, from code to cloud to security operations. As part of the Cortex Cloud platform, customers can expand from Cortex Cloud to our security operations offerings available on a single user experience and unified agent. We also offer our VM-Series and CN-Series virtual firewalls for inline network security on multi- and hybrid-cloud environments.\nThreat Intelligence and Advisory Services\n•\nUnit 42 brings together world-renowned expertise across threat research, incident response, and security consulting to deliver intelligence-driven, response-ready outcomes that help customers reduce cyber risk. Our elite consultants serve as trusted advisors to our customers by assessing and testing their security controls against sophisticated threats, transforming their security strategy with a threat-informed approach, and responding to security incidents on behalf of our clients. Additionally, Unit 42 offers managed detection and response (“MDR”) and managed threat hunting services.\n- 21 -\nTable of Contents\nFor the first quarter of fiscal 2026 and 2025, total revenue was $2.5 billion and $2.1 billion, respectively, representing year-over-year growth of 16%. Our growth reflects the increased adoption of our portfolio, which consists of product, subscriptions, and support. We believe our portfolio will enable us to benefit from recurring revenues and new revenues as we continue to grow our end-customer base. As of October 31, 2025, we had end-customers in over 180 countries. Our end-customers represent a broad range of industries, including education, energy, financial services, government entities, healthcare, Internet and media, manufacturing, public sector, and telecommunications, and include almost all of the Fortune 100 companies and a majority of the Global 2000 companies. We maintain a field sales force that works closely with our channel partners in developing sales opportunities. We primarily use a two-tiered, indirect fulfillment model whereby we sell our products, subscriptions, and support to our distributors, which, in turn, sell to our resellers, which then sell to our end-customers.\nOur product revenue grew to $434 million, or 17.5% of total revenue, for the first quarter of fiscal 2026, representing year-over-year growth of 23%. Product revenue is derived from sales of hardware products, primarily our ML-Powered Next-Generation Firewall and software licenses, including SD-WAN, VM-Series, and Panorama\n®\n. Our ML-Powered Next-Generation Firewall incorporates our PAN-OS operating system, which provides a consistent set of capabilities across our entire network security product line. Our hardware products and software licenses include a broad set of built-in networking and security features and functionalities. Our products are designed for different performance requirements throughout an organization, ranging from our PA-400, which is designed for small organizations and remote or branch offices, to our top-of-the-line PA-7500, which is designed for large-scale data centers and service provider use. The same firewall functionality that is delivered in our hardware products is also available in our VM-Series virtual firewalls, which secure virtualized and cloud-based computing environments, and in our CN-Series container firewalls, which secure container environments and traffic.\nOur subscription and support revenue grew to $2.0 billion, or 82.5% of total revenue, for the first quarter of fiscal 2026, representing year-over-year growth of 14%. Our subscriptions provide our end-customers with near real-time access to the latest intrusion prevention, web security, modern malware prevention, data loss prevention, CASB and AI security capabilities across the network, endpoints, and the cloud. Our subscriptions also include security operations, which enable customers to leverage the AI-powered Cortex platform for advanced capabilities such as security information and event management, next-generation antivirus, endpoint detection and response, extended detection and response, identity threat detection and response, cloud detection and response, SOAR, ASM, and CNAPP for comprehensive cloud security. Additionally, we offer MDR for Cortex subscriptions, powered by Unit 42’s elite expertise. When customers purchase our physical, virtual, or container firewalls, or certain cloud offerings, they typically purchase support in order to receive ongoing security updates, upgrades, bug fixes, and repairs. In addition to the subscriptions purchased with these firewalls, customers may also purchase other subscriptions on a per-user, per-endpoint, or capacity-based basis. We also offer professional services, including incident response, risk management, and digital forensic services.\nWe continue to invest in innovation as we evolve and further extend the capabilities of our portfolio, as we believe that innovation and timely development of and investment in new features and products are essential to meeting the needs of our end-customers and improving our competitive position. For example, in August 2025, we introduced innovations through a software upgrade to PAN-OS 12.1 Orion to provide enterprise wide quantum security readiness for our customers. In October 2025, we launched Prisma AIRS 2.0, a major platform upgrade that completes the native integration of the recently acquired Protect AI, Inc. to provide customers with end-to-end protection across AI application lifecycle. Additionally, in July 2025, we entered into a definitive agreement to acquire CyberArk Software Ltd. (“CyberArk”), an identity security company, which acquisition is expected to close during the third quarter of our fiscal 2026, subject to the satisfaction of customary closing conditions.\nWe believe that the growth of our business and our short-term and long-term success are dependent upon many factors, including our ability to extend our technology leadership, grow our base of end-customers, expand deployment of our portfolio and support offerings within existing end-customers, focus on end-customer satisfaction, and address any product vulnerabilities. To manage any future growth effectively, we must continue to improve and expand our information technology and financial infrastructure, our operating and administrative systems and controls, and our ability to manage headcount, capital, and processes in an efficient manner. While these areas present significant opportunities for us, they also pose challenges and risks that we must successfully address in order to sustain the growth of our business and improve our operating results. For additional information regarding the challenges and risks we face, see the “Risk Factors” section in Part II, Item 1A of this Quarterly Report on Form 10-Q.\nIMPACT OF MACROECONOMIC DEVELOPMENTS AND OTHER FACTORS ON OUR BUSINESS\nOur overall performance depends in part on worldwide economic and geopolitical conditions and their impact on customer behavior. Changes in legislation or regulations and actions by regulators, including changes in enforcement and administration policies, may have an impact on our results of operations and financial condition. Significant changes in U.S. or global trade policy, including further expansion of U.S. export/imports controls and tariffs, as well as retaliatory actions by other countries, may materially and adversely affect our business. Further, economic conditions, including inflation, high interest rates, slow growth, fluctuations in foreign exchange rates, supply chain disruptions, impacts of trade regulations or international trade disputes, and other conditions, may adversely affect our results of operations and financial performance.\n- 22 -\nTable of Contents\nThe hostilities in Israel and the surrounding region have continued to result in economic and political uncertainty. While we have business operations in Israel, and intend to continue growing our presence in Israel, we currently do not expect significant business disruption. We are actively monitoring, evaluating, and responding to the situation.\nWe are also monitoring the impact of inflationary pressures and the tensions between China and Taiwan, and between the U.S. and China, which could have an adverse impact on our business or results of operations in future periods.\nKey Financial Metrics\nWe monitor the key financial metrics set forth in the tables below to help us evaluate growth trends, establish budgets, measure the effectiveness of our sales and marketing efforts, and assess operational efficiencies. We discuss revenue, gross margin, and the components of operating income and margin below under “Results of Operations.”\nOctober 31, 2025\nJuly 31, 2025\n(in billions)\nNext-Generation Security Annualized Recurring Revenue\n$\n5.9 \n$\n5.6 \nRemaining performance obligations\n$\n15.5 \n$\n15.8 \nThree Months Ended October 31,\n2025\n2024\n(dollars in millions)\nTotal revenue\n$\n2,474 \n$\n2,139 \nTotal revenue year-over-year percentage increase\n16\n%\n14\n%\nGross margin\n74.2\n%\n74.1\n%\nOperating income\n$\n309 \n$\n286 \nOperating margin\n12.5\n%\n13.4\n%\nCash flow provided by operating activities\n$\n1,771 \n$\n1,510 \nFree cash flow (non-GAAP)\n$\n1,687 \n$\n1,466 \n•\nNext-Generation Security Annualized Recurring Revenue (“NGS ARR”). \nOur NGS ARR represents the annualized allocated revenue of all active contracts as of the final day of the reporting period related to all product, subscription and support offerings, excluding revenue from hardware products, and legacy attached subscriptions, support offerings and professional services. NGS ARR is an operating metric that we use to assess the strength and trajectory of our business. NGS ARR should be viewed independently of revenue, deferred revenue and remaining performance obligations and does not represent our revenue under U.S. GAAP on an annualized basis, as it is an operating metric that can be impacted by contract start and end dates and renewal rates. NGS ARR is not intended to be a replacement for forecasts of revenue. The scope of products, subscriptions, and support offerings that contribute to NGS ARR will generally increase over time as we introduce or acquire new next-generation products, subscriptions, and support offerings.\n•\nCash Flow Provided by Operating Activities.\n \nWe monitor cash flow provided by operating activities as a measure of our overall business performance. Our cash flow provided by operating activities is driven in large part by sales of our products and from up-front payments for subscription and support offerings. Monitoring cash flow provided by operating activities enables us to analyze our financial performance without the non-cash effects of certain items such as share-based compensation costs, depreciation, and amortization, thereby allowing us to better understand and manage the cash needs of our business.\n- 23 -\nTable of Contents\n•\nFree Cash Flow (non-GAAP).\n We define free cash flow, a non-GAAP financial measure, as cash provided by operating activities less purchases of property, equipment, and other assets. We consider free cash flow to be a profitability and liquidity measure that provides useful information to management and investors about the amount of cash generated by the business after necessary capital expenditures. A limitation of the utility of free cash flow as a measure of our financial performance and liquidity is that it does not represent the total increase or decrease in our cash balance for the period. In addition, it is important to note that other companies, including companies in our industry, may not use free cash flow, may calculate free cash flow in a different manner than we do, or may use other financial measures to evaluate their performance, all of which could reduce the usefulness of free cash flow as a comparative measure. A reconciliation of free cash flow to cash flow provided by operating activities, the most directly comparable financial measure calculated and presented in accordance with U.S. GAAP, is provided below:\nThree Months Ended October 31,\n2025\n2024\n(in millions)\nFree cash flow (non-GAAP):\nNet cash provided by operating activities\n$\n1,771 \n$\n1,510 \nLess: purchases of property, equipment, and other assets\n84 \n44 \nFree cash flow (non-GAAP)\n$\n1,687 \n$\n1,466 \nNet cash used in investing activities\n$\n(983)\n$\n(544)\nNet cash provided by (used in) financing activities\n$\n8 \n$\n(220)\n- 24 -\nTable of Contents\nResults of Operations\nThe following table summarizes our results of operations for the periods presented and as a percentage of our total revenue for those periods based on our condensed consolidated statements of operations data. The period-to-period comparison of results is not necessarily indicative of results for future periods.\nThree Months Ended October 31,\n2025\n2024\nAmount\n% of Revenue\nAmount\n% of Revenue\n(dollars in millions)\nRevenue:\nProduct\n$\n434 \n17.5 \n%\n$\n354 \n16.5 \n%\nSubscription and support\n2,040 \n82.5 \n%\n1,785 \n83.5 \n%\nTotal revenue\n2,474 \n100.0 \n%\n2,139 \n100.0 \n%\nCost of revenue:\nProduct\n89 \n3.6 \n%\n75 \n3.5 \n%\nSubscription and support\n549 \n22.2 \n%\n479 \n22.4 \n%\nTotal cost of revenue\n(1)\n638 \n25.8 \n%\n554 \n25.9 \n%\nTotal gross profit\n1,836 \n74.2 \n%\n1,585 \n74.1 \n%\nOperating expenses:\nResearch and development\n528 \n21.3 \n%\n481 \n22.5 \n%\nSales and marketing\n820 \n33.2 \n%\n720 \n33.6 \n%\nGeneral and administrative\n179 \n7.2 \n%\n98 \n4.6 \n%\nTotal operating expenses\n(1)\n1,527 \n61.7 \n%\n1,299 \n60.7 \n%\nOperating income\n309 \n12.5 \n%\n286 \n13.4 \n%\nInterest expense\n— \n— \n%\n(1)\n(0.1)\n%\nOther income, net\n103 \n4.2 \n%\n83 \n3.9 \n%\nIncome before income taxes\n412 \n16.7 \n%\n368 \n17.2 \n%\nProvision for income taxes\n78 \n3.2 \n%\n17 \n0.8 \n%\nNet income\n$\n334 \n13.5 \n%\n$\n351 \n16.4 \n%\n(1)\n \nIncludes share-based compensation as follows:\nThree Months Ended October 31,\n2025\n2024\n(in millions)\nCost of product revenue \n$\n1 \n$\n1 \nCost of subscription and support revenue\n32 \n31 \nResearch and development\n155 \n138 \nSales and marketing\n102 \n76 \nGeneral and administrative\n80 \n49 \nTotal share-based compensation\n$\n370 \n$\n295 \n- 25 -\nTable of Contents\nREVENUE\nOur revenue consists of product revenue and subscription and support revenue. Revenue is recognized upon transfer of control of the corresponding promised products and subscriptions and support to our customers in an amount that reflects the consideration we expect to be entitled to in exchange for those products and subscriptions and support. We expect our revenue to vary from quarter to quarter based on seasonal and cyclical factors.\nPRODUCT REVENUE\nProduct revenue is derived from sales of hardware products, primarily our ML-Powered Next-Generation Firewall, and  software licenses, including SD-WAN, VM-Series, and Panorama. Our hardware products and software licenses include a broad set of built-in networking and security features and functionalities. We recognize product revenue at the time of hardware shipment or delivery of software license. As a percentage of product revenue, we expect our revenue from software licenses to vary from quarter to quarter and increase over the long term as we improve features and capabilities of our on-premise software, renew our software license contracts, and expand our installed end-customer base.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nProduct\n$\n434 \n$\n354 \n$\n80 \n23 \n%\nProduct revenue increased for the three months ended October 31, 2025 compared to the same period in 2024 driven by an increased product demand and an increase in price of and allocation to on-premise software licenses due to enhanced features and capabilities beginning in the second quarter of fiscal 2025.\nSUBSCRIPTION AND SUPPORT REVENUE\nSubscription and support revenue is derived primarily from sales of our subscription and support offerings. Our subscription and support contracts are typically one to five years. We recognize revenue from subscriptions and support over time as the services are performed. As a percentage of total revenue, we expect our subscription and support revenue to vary from quarter to quarter and increase over the long term as we introduce new subscriptions, renew existing subscription and support contracts, and expand our installed end-customer base.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nSubscription\n$\n1,364 \n$\n1,192 \n$\n172 \n14 \n%\nSupport\n676 \n593 \n83 \n14 \n%\nTotal subscription and support\n$\n2,040 \n$\n1,785 \n$\n255 \n14 \n%\nSubscription and support revenue increased for the three months ended October 31, 2025 compared to the same period in 2024 due to increased demand for our subscription and support offerings from our end-customers. The mix between subscription revenue and support revenue will fluctuate over time, depending on the introduction of new subscription offerings, renewals of support services, and our ability to increase sales to new and existing end-customers.\n- 26 -\nTable of Contents\nREVENUE BY GEOGRAPHIC THEATER\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nAmericas\n$\n1,641 \n$\n1,442 \n$\n199 \n14 \n%\nEurope, the Middle East, and Africa (“EMEA”)\n521 \n442 \n79 \n18 \n%\nAsia Pacific and Japan (“APAC”)\n312 \n255 \n57 \n22 \n%\nTotal revenue\n$\n2,474 \n$\n2,139 \n$\n335 \n16 \n%\nRevenue from the Americas, EMEA, and APAC increased for the three months ended October 31, 2025 compared to the same period in 2024 as we continued to increase investment in our global sales force in order to support our growth and innovation, with the Americas contributing the highest increase in revenue due to its larger scale.\nCOST OF REVENUE\nOur cost of revenue consists of cost of product revenue and cost of subscription and support revenue.\nCOST OF PRODUCT REVENUE\nCost of product revenue primarily includes costs paid to our manufacturing partners for procuring components and manufacturing our products. Our cost of product revenue also includes personnel costs, which consist of salaries, benefits, bonuses, share-based compensation, and travel associated with our operations organization, inventory excess and obsolete charges, shipping and tariff costs, amortization of intellectual property licenses, product testing costs, and shared costs. Shared costs consist of certain facilities, depreciation, benefits, recruiting, and information technology costs that we allocate based on headcount. We expect our cost of product revenue to fluctuate with our revenue from hardware products.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nCost of product revenue\n$\n89 \n$\n75 \n$\n14 \n19 \n%\nCost of product revenue increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to increased product volume and other product costs. The remaining increase was primarily driven by higher tariff costs.\n- 27 -\nTable of Contents\nCOST OF SUBSCRIPTION AND SUPPORT REVENUE\nCost of subscription and support revenue includes personnel costs for our global customer support and technical operations organizations, data center and cloud hosting service costs, third-party professional services costs, amortization of acquired intangible assets and capitalized software development costs, customer support and repair costs, and shared costs. We expect our cost of subscription and support revenue to increase as our installed end-customer base grows and adoption of our cloud-based subscription offerings increases.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nCost of subscription and support revenue\n$\n549 \n$\n479 \n$\n70 \n15 \n%\nCost of subscription and support revenue increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to increased costs to support the growth of our subscription and support offerings. Cloud hosting service costs, which support our cloud-based subscription offerings, increased $48 million for the three months ended October 31, 2025 compared to the same period in 2024. Personnel costs grew $14 million for the three months ended October 31, 2025 compared to the same period in 2024, primarily due to headcount growth.\nGROSS MARGIN\nGross margin has been and will continue to be affected by a variety of factors, including the introduction of new products, manufacturing costs, the average sales price of our products, cloud hosting service costs, personnel costs, the mix of products sold, and the mix of revenue between product and subscription and support offerings. Our higher-end firewall products generally have higher gross margins than our lower-end firewall products within each product series. We expect our gross margins to vary over time depending on the factors described above.\nThree Months Ended October 31,\n2025\n2024\nAmount\nGross Margin\nAmount\nGross Margin\n(dollars in millions)\nProduct\n$\n345 \n79.5 \n%\n$\n279 \n78.8 \n%\nSubscription and support\n1,491 \n73.1 \n%\n1,306 \n73.2 \n%\nTotal gross profit\n$\n1,836 \n74.2 \n%\n$\n1,585 \n74.1 \n%\nProduct gross margin increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to continued shift in our product revenue mix toward software, partially offset by a decrease in gross margin on our hardware products.\nSubscription and support gross margin was flat for the three months ended October 31, 2025 compared to the same period in 2024.\nOPERATING EXPENSES\nOur operating expenses consist of research and development, sales and marketing, and general and administrative expenses. Personnel costs are the most significant component of operating expenses and consist of salaries, benefits, bonuses, share-based compensation, travel and entertainment, and with regard to sales and marketing expense, sales commissions. Our operating expenses also include shared costs, which consist of certain facilities, depreciation, benefits, recruiting, and information technology costs that we allocate based on headcount to each department. We expect operating expenses generally to increase in absolute dollars and to decrease over the long term as a percentage of revenue as we continue to scale our business. As of October 31, 2025, we expect to recognize approximately $2.2 billion of share-based compensation expense over a weighted-average period of approximately 2.4 years, excluding additional share-based compensation expense related to any future grants of share-based awards. Share-based compensation expense is generally recognized on a straight-line basis over the requisite service periods of the awards.\n- 28 -\nTable of Contents\nRESEARCH AND DEVELOPMENT\nResearch and development expense consists primarily of personnel costs. Research and development expense also includes prototype-related expenses and shared costs. We expect research and development expense to increase in absolute dollars as we continue to invest in our future products and services, although our research and development expense may fluctuate as a percentage of total revenue.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nResearch and development\n$\n528 \n$\n481 \n$\n47 \n10 \n%\nResearch and development expense increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to increased personnel costs, which grew $45 million for the three months ended October 31, 2025 compared to the same period in 2024, largely due to headcount growth.\nSALES AND MARKETING\nSales and marketing expense consists primarily of personnel costs, including commission expense. Sales and marketing expense also includes costs for market development programs, promotional and other marketing costs, professional services, and shared costs. We continue to strategically invest in headcount and have grown our sales presence. We expect sales and marketing expense to continue to increase in absolute dollars as we increase the size of our sales and marketing organizations to grow our customer base, increase touch points with end-customers, and expand our global presence, although our sales and marketing expense may fluctuate as a percentage of total revenue.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nSales and marketing\n$\n820 \n$\n720 \n$\n100 \n14 \n%\nSales and marketing expense increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to increased personnel costs, which grew $86 million for the three months ended October 31, 2025 compared to the same period in 2024, largely due to headcount growth.\nGENERAL AND ADMINISTRATIVE\nGeneral and administrative expense consists primarily of personnel costs and shared costs for our executive, finance, human resources, information technology, and legal organizations, and professional services costs, which consist primarily of legal, auditing, accounting, and other consulting costs. General and administrative expense also includes change in fair value of contingent consideration liability. We expect general and administrative expense to increase in absolute dollars over time as we increase the size of our general and administrative organizations and incur additional costs to support our business growth, although our general and administrative expense may fluctuate as a percentage of total revenue.\nThree Months Ended October 31,\n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n(dollars in millions)\nGeneral and administrative\n$\n179 \n$\n98 \n$\n81 \n83 \n%\nGeneral and administrative expense increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to a partial release of litigation-related accrual of $43 million during the three months ended October 31, 2024. The increase in general and administrative expense was further driven by increased personnel costs, which grew $37 million, largely due to increased share-based compensation and headcount growth. \n- 29 -\nTable of Contents\nINTEREST EXPENSE\nInterest expense consists of interest expense related to our 0.375% Convertible Senior Notes due 2025 (the “2025 Notes”). \n \nThree Months Ended October 31,\n \n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n \n(dollars in millions)\nInterest expense\n$\n— \n$\n1 \n$\n(1)\n(100)\n%\nInterest expense decreased for the three months ended October 31, 2025 compared to the same period in 2024 due to the maturity of our 2025 Notes in June 2025. Refer to Note 9. Debt in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on the Notes.\nOTHER INCOME, NET\nOther income, net includes interest income earned on our cash, cash equivalents, and investments, and gains and losses from foreign currency remeasurement and foreign currency transactions.\n \nThree Months Ended October 31,\n \n2025\n2024\nChange\nAmount\nAmount\nAmount\n%\n \n(dollars in millions)\nOther income, net\n$\n103 \n$\n83 \n$\n20 \n24 \n%\nOther income, net increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to higher interest income as a result of higher average cash, cash equivalents, and investment balance, partially offset by lower interest rates for the three months ended October 31, 2025 compared to the same period in 2024.\nPROVISION FOR INCOME TAXES\nProvision for income taxes consists primarily of U.S. and foreign income taxes. Our effective tax rate during the three months ended October 31, 2025 was lower than our statutory tax rate primarily due to excess tax benefits from share-based compensation. We continue to maintain a valuation allowance for our California deferred tax assets due to the uncertainty regarding realizability of these deferred tax assets as they have not met the “more likely than not” realization criterion. We expect future research and development tax credit generation in California to exceed our ability to use the existing tax credits.\nThree Months Ended October 31,\n2025\n2024\nChange \nAmount\nAmount\nAmount\n%\n(dollars in millions)\nProvision for income taxes\n$\n78 \n$\n17 \n$\n61 \n359 \n%\nEffective tax rate\n18.9 \n%\n4.9 \n%\nOur provision for income taxes for the three months ended October 31, 2025 was primarily due to U.S. and foreign income taxes. Our effective tax rate increased for the three months ended October 31, 2025 compared to the same period in 2024 primarily due to increased earnings before income taxes and decreased excess tax benefits from share-based compensation. Refer to Note 13. Income Taxes in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information.\n- 30 -\nTable of Contents\nLiquidity and Capital Resources\nOctober 31, 2025\nJuly 31, 2025\n(in millions)\nWorking capital (deficit)\n$\n(108)\n$\n(465)\nCash, cash equivalents, and investments:\nCash and cash equivalents\n$\n3,066 \n$\n2,269 \nInvestments\n7,126 \n6,190 \nTotal cash, cash equivalents, and investments\n$\n10,192 \n$\n8,459 \nAs of October 31, 2025, our total cash, cash equivalents, and investments of $10.2 billion were held for general corporate purposes. As of October 31, 2025, we had no unremitted earnings when evaluating our outside basis difference relating to our U.S. investment in foreign subsidiaries. However, there could be local withholding taxes due to various foreign countries if certain lower tier earnings are distributed. Withholding taxes that would be payable upon remittance of these lower tier earnings are not material.\nDEBT\nIn April 2023, we entered into a credit agreement (the “Credit Agreement”) that provides for a $400 million unsecured revolving credit facility (the “Credit Facility”), with an option to increase the amount of the Credit Facility by up to an additional $350 million, subject to certain conditions. The interest rates and commitment fees are also subject to upward and downward adjustments based on our progress towards the achievement of certain sustainability goals. As of October 31, 2025, there were no amounts outstanding, and we were in compliance with all covenants under the Credit Agreement. Refer to Note 9. Debt in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on the Credit Agreement.\nCAPITAL RETURN\nIn February 2019, our board of directors authorized a $1.0 billion share repurchase program. Our board of directors subsequently authorized additional increases to this share repurchase program, bringing the total authorization to $4.1 billion. Repurchases will be funded from available working capital and may be made at management’s discretion from time to time. As of October 31, 2025, $1.0 billion remained available for future share repurchases under this repurchase program. The repurchase authorization will expire on December 31, 2026, and may be suspended or discontinued at any time without prior notice. Refer to Note 11. Stockholders’ Equity in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on this repurchase program.\nCONTRACTUAL OBLIGATIONS AND OTHER MATERIAL CASH REQUIREMENTS\nWe have entered into various non-cancelable operating leases, primarily for our offices and data centers, with lease terms expiring through fiscal 2036. As of October 31, 2025, we have total operating lease obligations of $429 million recorded on our condensed consolidated balance sheet.\nAs of October 31, 2025, our commitments to purchase products, components, cloud hosting and other services totaled $6.8 billion. Refer to Note 10. Commitments and Contingencies in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on these commitments.\nOur acquisition of certain QRadar assets from International Business Machines Corporation (“IBM”) on August 31, 2024 included contingent consideration that requires potential future payments through the fiscal quarter ending October 2028. As of October 31, 2025, we have total contingent consideration obligation of $380 million recorded on our condensed consolidated balance sheet. Refer to Note 3. Fair Value Measurements and Note 7. Acquisition in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on our contingent consideration obligation.\nOn July 30, 2025, we entered into a definitive agreement to acquire CyberArk. The acquisition is expected to close during the third quarter of our fiscal 2026, subject to the satisfaction of customary closing conditions. Under the terms of the definitive agreement, CyberArk shareholders will receive $45.00 in cash and 2.2005 shares of our common stock for each CyberArk share. This represents an equity value for CyberArk of approximately $25 billion based on the unaffected 10-day average daily volume-weighted average trading prices of our common stock as of July 25, 2025. We expect to fund the cash portion of the consideration with our cash on hand. Refer to Part II, Item 1A “Risk Factors” and Note 7. Acquisitions in Part I, Item 1 of this Quarterly Report on Form 10-Q for more information on the acquisition.\n- 31 -\nTable of Contents\nCASH FLOWS\nThe following table summarizes our cash flows for the three months ended October 31, 2025 and 2024:\nThree Months Ended October 31,\n2025\n2024\n(in millions)\nNet cash provided by operating activities\n$\n1,771 \n$\n1,510 \nNet cash used in investing activities\n(983)\n(544)\nNet cash provided by (used in) financing activities\n8 \n(220)\nNet increase in cash, cash equivalents, and restricted cash\n$\n796 \n$\n746 \nCash from operations could be affected by various risks and uncertainties detailed in Part II, Item 1A “Risk Factors” in this Quarterly Report on Form 10-Q. We believe that our cash flow from operations with existing cash and cash equivalents will be sufficient to meet our anticipated cash needs for at least the next 12 months and thereafter for the foreseeable future. Our future capital requirements will depend on many factors, including our growth rate, the timing and extent of spending to support development efforts, the expansion of sales and marketing activities, the introduction of new and enhanced products and subscription and support offerings, the costs to acquire or invest in complementary businesses and technologies, the costs to ensure access to adequate manufacturing capacity, the investments in our infrastructure to support the adoption of our cloud-based subscription offerings, the continuing market acceptance of our products and subscription and support offerings and macroeconomic events. In addition, from time to time, we may incur additional tax liability in connection with certain corporate structuring decisions.\nWe may also choose to seek additional equity or debt financing. In the event that additional financing is required from outside sources, we may not be able to raise it on terms acceptable to us or at all. If we are unable to raise additional capital when desired, our business, operating results, and financial condition may be adversely affected.\nOPERATING ACTIVITIES\nOur operating activities have consisted of net income adjusted for certain non-cash items and changes in assets and liabilities. Our largest source of cash provided by our operations is receipts from our customers. Net cash provided by operating activities can be impacted by factors such as timing of payments and collections, vendor payment terms, and timing and amount of tax payments.\nCash provided by operating activities during the three months ended October 31, 2025 was $1.8 billion, an increase of $261 million compared to the same period in 2024. The increase was primarily due to growth of our business as reflected by increases in collections during the three months ended October 31, 2025, partially offset by higher cash expenditure to support our business growth.\nINVESTING ACTIVITIES\nOur investing activities have consisted of capital expenditures, net investment purchases, sales, and maturities, and business acquisitions. We expect to continue such activities as our business grows.\nCash used in investing activities during the three months ended October 31, 2025 was $1.0 billion, an increase of $439 million compared to the same period in 2024. The increase was primarily due to higher purchases of investments and lower proceeds from sales and maturities of investments, partially offset by a decrease in net cash payments for business acquisitions during the three months ended October 31, 2025.\nFINANCING ACTIVITIES\nOur financing activities have consisted of repayments of our convertible senior notes, proceeds from sales of shares through employee equity incentive plans, payments for tax withholding obligations of certain employees related to the net share settlement of equity awards, and payments of contingent consideration liability.\nCash provided by financing activities during the three months ended October 31, 2025 was $8 million, a change of $228 million compared to cash used in financing activities of $220 million during the same period in 2024. The change was primarily due to a decrease in cash used for repayments of our 2025 Notes which did not recur during the three months ended October 31, 2025 as a result of its maturity, partially offset by payments of our contingent consideration liability during the three months ended October 31, 2025.\n- 32 -\nTable of Contents\nCritical Accounting Estimates\nOur condensed consolidated financial statements have been prepared in accordance with U.S. GAAP. The preparation of these condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue, expenses, and related disclosures. We base our estimates on historical experience and on various other assumptions that we believe are reasonable under the circumstances. We evaluate our estimates and assumptions on an ongoing basis. Actual results could differ materially from those estimates due to risks and uncertainties, including uncertainty in the current economic environment. To the extent that there are material differences between these estimates and our actual results, our future consolidated financial statements will be affected.\nWe believe the critical accounting estimates discussed under Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the fiscal year ended July 31, 2025 reflect our more significant estimates, assumptions, and judgments that have the most significant impact on our condensed consolidated financial statements. There have been no significant changes to our critical accounting estimates as filed in such report.\nRecent Accounting Pronouncements\nRefer to “Recently Issued Accounting Pronouncements” in Note 1. Description of Business and Summary of Significant Accounting Policies in Part I, Item 1 of this Quarterly Report on Form 10-Q for a description of recent accounting pronouncements and our expectation of their impact, if any, on our results of operations and financial condition."
}