{
  "source_file": "payx-20250531.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n \nBusiness\n \nUnless we state otherwise or the context otherwise requires, the terms “Paychex,” “we,” “us,” “our” and the “Company” refer to Paychex, Inc., a Delaware corporation, and its consolidated subsidiaries.\n \nOverview\n \nWe are an industry-leading human capital management (“HCM”) company delivering a full suite of technology and advisory solutions in human resources (“HR”), employee benefit solutions, insurance, and payroll processing. As of May 31, 2025, we served approximately 800,000 clients and their employees across the U.S. and parts of Europe. Paychex was incorporated in Delaware in 1979, maintains a corporate headquarters in Rochester, New York, and has a fiscal year that ends on May 31st.\n \n \nFor any organization, a key function is effective human capital management, which requires resources and expertise. Organizations are faced with rapid evolution in employer-employee relations including: an increasing number and complexity of federal, state, and local regulations; changing workforce dynamics; and challenges attracting and retaining talent. Changing workplace dynamics reflect employees increasingly becoming mobile, working remotely, and expecting a user experience similar to consumer-oriented applications.\n \n \nWe specialize in helping clients adapt to the rapidly evolving environment. Paychex offers a full range of integrated HCM solutions from hire to retire for businesses and their employees that enables customization to the clients' businesses, whether it is small or large, simple or complex. We believe that we have the breadth of solutions to cover the full spectrum of the employee life cycle, while also enabling integrations with popular HR, accounting, enterprise resource planning (“ERP”), and point-of-sale applications.\n \n \nKey features of our solutions include:\n \n•\nComprehensive cloud-based HCM platforms optimized to meet clients' HR and payroll needs;\n•\nExpertise in HR and payroll backed by approximately 250 compliance experts and over 650 HR business professionals;\n•\nStreamlined workforce management that combines technology with flexible, tech-enabled support options;\n•\nModern, mobile, and intuitive user experience with self-service capabilities;\n•\nScalable and customizable platforms that provide clients the flexibility to add solutions as they grow;\n•\nSoftware as a service, or “SaaS”, delivery model that reduces total cost of ownership for our clients; and \n•\nAdvanced data analytics and artificial intelligence (“AI”) capabilities powered by large data sets.\n \nWe market our solutions through a combination of direct and virtual sales forces supported by various digital lead generation and multi-channel marketing initiatives. Over 50% of our revenues are from solutions other than payroll processing.\n \n \nOn April 14, 2025, we completed our acquisition of Paycor HCM, Inc. (\"Paycor\"), a leading provider of HCM, payroll and talent software. The transaction aims to enhance the Company’s capabilities upmarket, expand its sales force and enhance its suite of AI-driven HCM solutions.\n\n\n2\n\n\n\n\nTable of Contents\n \n\n\nCompany Strategy\n \nOur strategy is to be the digitally driven HR leader, serving as an essential partner to clients by providing them with the technology and advisory solutions they need for HR, payroll, benefits, and insurance. We believe that successfully executing this strategy will lead to strong, long-term financial performance. We intend to strengthen and extend our position as a leading provider through continued investments in both our innovative technology and HR advisory solutions. Key elements of our strategy include:\n \n•\nGrowing our client base.\n We operate in a large and growing market, with significant potential to expand within our current target markets. We continually invest in new demand generation, sales tools, go-to-market strategies along with channel partnerships, ecommerce, and digital marketing.\n•\nExpanding our share of wallet. \nWe offer a full-suite of integrated solutions incorporating a unique combination of industry-leading HR technology and HR advisory solutions that sets us apart in the industry. We intend to continue to increase penetration across our HCM software, HR outsourcing, retirement, and insurance offerings.\n•\nDriving technology innovation\n. \nWe continue to invest significantly in our proprietary, award-winning HCM platforms to maximize efficiency and functionality for our clients and their employees. We have a robust product roadmap that is focused on enhancing our ability to address the needs of our customers and prospective customers. We believe we are well positioned to capitalize on the AI opportunity with large and growing data sets, predictive analytics and AI models, and increased AI investments to improve efficiency, enhance the customer experience, and unlock new growth opportunities.\n•\nPursuing strategic acquisitions\n.\n We utilize acquisitions, when appropriate, as a means to expand our portfolio, enter new markets, or increase our scale. We will continue to evaluate and monitor potential acquisitions and target acquisitions that are aligned with our overall strategy.\n \nOur Clients\n \nWe provide HCM solutions to a diverse client base operating in a broad range of industries throughout the U.S. and parts of Europe. The flexibility and scalability of our solutions enable our clients to select the best solution that meets their needs. We utilize service agreements and arrangements with clients that generally do not contain specified contract periods and may be terminated by either party with 30-days’ notice of termination.\n \n \nWe believe client retention is a useful indicator of client satisfaction with our solutions and support. For fiscal 2025, our client retention of Paychex clients was in the range of 82% to 83% of our beginning client base.\n \n \nOur Solutions\n \nWe provide a unique blend of innovative technology solutions, backed by our extensive compliance and HR expertise, that help customers more effectively hire, develop, and retain top talent in this challenging workforce environment. Clients have the option of processing payroll online using our SaaS technology, outsourcing to our payroll specialists, or using a combination of these methods. Payroll is integrated with HCM software modules for clients who have more complex HR needs. We continue to invest in our technology, enhancing our solutions to continuously improve the customer and employee experiences from hire to retire.\n \nWe also provide comprehensive HR outsourcing through our administrative services organization (“ASO”) and professional employer organization (“PEO”) solutions. We have over 650 HR business professionals who are dedicated to our clients and have the experience and training to provide HR best practices and advice. Our HR business partners are available to provide our ASO and PEO clients with guidance on HR issues. The integration of leading-edge technology and flexible support options enables us to meet our clients’ needs, from the tactical to the strategic.\n \n \nWe closely monitor the evolving challenges and needs of our clients, and proactively aid our clients in navigating macroeconomic challenges, legislative changes, and other complexities they may face. Over the past year, top challenges for employers were macroeconomic pressures including inflation and interest rates, availability of qualified talent, providing appropriate employee development, keeping technology current, and ensuring legal and regulatory compliance. We have approximately 250 compliance professionals who are in real-time contact with tax agencies and regulators to understand upcoming or newly enacted laws and regulations. The contributions of these compliance experts are intended to ensure that our HCM solutions are updated in a timely fashion to adhere to applicable regulations and to help our clients stay in compliance.\n \n\n\n3\n\n\n\n\nTable of Contents\n \n\n\nManagement Solutions:\n \nWe offer a comprehensive portfolio of HCM technology and HR advisory solutions that enable our clients to meet their diverse HR and payroll needs.\n \n \n•\nHCM technology:\n \nWe deliver an integrated suite of HCM solutions through three technology platforms that enable seamless workforce management throughout the employee life cycle from recruiting and hiring to retirement. SurePayroll serves the digitally driven small business self-service market. Paychex Flex is our proprietary HCM Software-as-a-Service (“SaaS”) platform for small and medium-sized businesses. Paycor is our primary SaaS-based HCM platform for larger businesses with more complex needs. Clients can select the modules they need and easily customize solutions as they grow including Payroll, HR, Talent Acquisition, Talent Management, Benefits Administration and Workforce Management. \n \n•\nPayroll solutions:\n Our payroll processing solutions include the calculation, preparation, and delivery of employee payroll checks; production of internal accounting records and management reports; preparation of federal, state, and local payroll tax returns; and collection and remittance of clients’ payroll obligations. Our powerful calculation engine enables fast and accurate payroll processing. We provide employers the option of paying their employees by direct deposit, payroll debit card, a check drawn on a Paychex account, or a check drawn on the employer’s account and electronically signed by us, or by ACH. We give employees flexibility to access earned pay before the scheduled pay date. \n \n•\nHR management: \nA comprehensive suite of HCM tools spanning HR, regulatory compliance, compensation management, employee surveys, expense management, reporting and analytics. Robust workflows and approval capabilities help leaders expedite and automate their most common tasks. Digital communication and engagement solutions help strengthen connections and keep associates engaged.\n \n•\nTalent acquisition:\n Innovative set of tools designed to streamline and optimize the entire hiring process, from sourcing and attracting candidates to managing the recruiting process. This all-in-one solution empowers HR teams to efficiently manage talent acquisition, improve time-to-hire, and make data-driven decisions to build a high-performing workforce.\n \n•\nTalent management:\n Powerful tools for managing employee development and retention, spanning performance management, HR compliance, career development, and reporting. We offer businesses the flexibility to capture ongoing performance feedback, recommend and enroll employees in specific training courses, and leverage automated workflows to track progress and approve compensation changes tied to performance.\n \n•\nWorkforce management\n:\n Comprehensive workforce management solutions to optimize labor costs and enhance productivity through integrated time and attendance, scheduling, and labor management tools. Paychex integrates these capabilities within its core platform, providing features for job costing, labor distribution, and expense management for detailed control over operational spending. For upmarket and enterprise clients, the offering emphasizes automation and analytics, featuring AI-powered labor forecasting, real-time overtime insights, and robust employee self-service capabilities for tasks like mobile punch-in and shift trading.\n \n•\nBenefits administration\n:\n Software that provides comprehensive benefit administration capabilities for streamlined plan set-up, configuration, and management. It facilitates a simplified and engaging experience for employees during open enrollment and for life event-based changes through intuitive self-service tools. The platform supports a wide array of benefit types, including group health, FSA/HSA, and voluntary benefits, and includes features for compliance management, such as COBRA administration. For seamless operations, it features robust reporting and analytics for administrators and ensures data accuracy through direct carrier connectivity, which automates the transfer of enrollment information to benefit carriers.\n \n•\nPartner marketplaces\n:\n Paychex Flex Perks is a curated digital marketplace for employee benefits, including early access to earned wages, financial wellness solutions, and voluntary lifestyle benefits. Paycor’s \n\n\n4\n\n\n\n\nTable of Contents\n \n\n\nMarketplace provides businesses best-in-breed third-party applications and trusted technology partners to seamlessly connect their favorite solutions to Paycor.\n \n•\nASO solutions:\n Our HR solutions allow businesses to outsource and simplify their HR administration and compliance support. These bundled services incorporate integrated HCM technology solutions and HR advisory services through both virtual and on-site availability of a professionally trained HR representative. Clients can opt for different levels of HR outsourcing from our low-touch HR solutions to our full-service HR Pro package. We also offer HR support to non-payroll clients through our HR Partner Plus solution.\n \n•\nRetirement solutions: \nOur retirement solutions offer a variety of options to employers, including 401(k) plans, SIMPLE and SEP IRAs, and Pooled Employer Plans, among others. These solutions provide plan implementation, ongoing compliance with government regulations, employee and employer reporting, participant and employer online access, electronic funds transfer, and other administrative services. Clients may choose from a group of pre-defined fund selections or customize their investment options within their plan. We are the largest 401(k) recordkeeper for small businesses in the U.S. Our large-market retirement solutions include relationships with financial advisors.\n \n•\nFunding solutions:\n We offer various funding solutions. Our wholly owned subsidiary, Paychex Advance, LLC, provides a portfolio of solutions to the temporary staffing industry, including payroll funding (via the purchase of accounts receivable). Alterna Capital Solutions, LLC (“Alterna”) offers funding to small businesses through the purchase of outstanding accounts receivable balances under non-recourse agreements. \n \nPEO and Insurance Solutions:\n \nWe provide comprehensive employment outsourcing and insurance solutions to best meet our clients’ needs.\n \n \n•\nPEO solutions: \nOur licensed PEO subsidiaries offer businesses a combined solution that includes payroll, employer compliance, HR and employee benefits administration, risk management outsourcing, and both virtual and on-site availability of a professionally trained HR representative, among other solutions. What differentiates our PEO solutions from our ASO solutions is that we serve as a co-employer of our clients’ employees and assume the risks and rewards of certain workers’ compensation insurance and certain health insurance offerings. We are certified under the Small Business Efficiency Act to provide PEO solutions. We also provide insurance offerings which help business owners protect their bottom line from unforeseen costs, including cyberattacks and employee lawsuits.\n \n•\nInsurance solutions: \nOur licensed insurance agency, Paychex Insurance Agency, Inc., provides insurance through a variety of carriers, allowing employers to expand their employee benefit and corporate offerings at an affordable cost. Insurance offerings include property and casualty coverage such as workers’ compensation, business-owner policies, cybersecurity protection, commercial auto, and health and benefits coverage, including health, dental, vision, and life. Our insurance solutions simplify the insurance process to make it easy to find plans with the features and affordability to meet the client’s needs. With access to numerous top national and regional insurance carriers, our professional insurance agents have access to a wide selection of plans from which they can best match the insurance needs of small businesses. Additionally, clients can integrate their insurance plans with Paychex payroll processing for easy, accurate plan administration.\n \n \nSales and Marketing\n \nWe market and sell our solutions primarily through our direct sales force based in the markets we serve. Our direct sales force includes field and inside sales representatives who specialize within our portfolio of solutions. Our sales representatives are also supported by marketing, advertising, public relations, and various other demand generation programs.\n \n \nIn addition to our direct selling and marketing efforts, we utilize other indirect sales channels such as our relationships with existing clients, certified public accountants (“CPAs”), benefit brokers, and banks for new client referrals. More than 50% of our payroll clients come from these referral sources. Our dedicated business development group drives sales through banking, national associations, and franchise channels. Complementing our direct sales, our Embedded HCM Solution partnerships efficiently extend our distribution while providing a modern, holistic solution to customers. We also utilize digital marketing to promote our solutions.\n \n\n\n5\n\n\n\n\nTable of Contents\n \n\n\nWe have a long-standing partnership with the American Institute of Certified Public Accountants (“AICPA”) as the preferred payroll provider for its AICPA Business Solutions\n™ \nProgram. Our current partnership agreement with the AICPA is in place through September 2027. We also partner with numerous state CPA society organizations. We provide a free online portal, Paychex Partner Pro, designed to provide accountants quick access to critical data, reporting, and insights for their clients using Paychex Flex. This innovative portal transforms how CPAs manage their portfolios by providing a centralized hub for accessing client payroll and HR data, resolving issues, and identifying missing information, empowering them to operate with greater efficiency and proactivity in serving their clients.\n \nWe also have long-standing relationships with health insurance and retirement benefits brokers, including large national partners. We recently launched the Partner+ Program to foster broker relationships and drive mutual growth. We now have a broader suite of solutions to offer brokers, which can supplement their offerings to clients, and the Partner+ Program provides a structured framework designed to safeguard mutual clients from competing products. In addition, our Partner Portal provides brokers exclusive access to advanced HCM solutions, new revenue streams, and data-driven insights.\n \nOur corporate website is available at \nwww.paychex.com\n, and is a cost-efficient channel that serves as a source of leads and new sales, while complementing the efforts of our direct, indirect, and virtual sales forces. The website enables us to market to existing and prospective clients that want to learn more about our solutions and support, and offers information about our core business solutions: human resources, payroll, benefits, and insurance.\n \n \nPaychex also builds on its reputation as an expert in the HCM industry by providing educational resources to our clients. We provide free webinars, podcasts, white papers, and other information on our website to inform businesses on the impact of regulatory change as well as HR and business best practices. Paychex WORX and the Paycor HR Center for Excellence provide information on the latest trends, best practices, and industry benchmarks designed to drive business success.\n \nWe also track current regulatory issues that impact the business community and provide regulatory updates. We issue small business trend reports through our monthly Paychex Small Business Employment Watch.\n \nMarkets and Competition\n \nWe remain focused on servicing clients based upon the growth potential that we believe exists in the markets we serve. Census data indicates that in the U.S., there are over 6 million employer firms in our target markets.\n \nThe market for HCM solutions is highly competitive and fragmented. We have one primary national competitor and we also compete with other national, international, regional, local, and online payroll providers. In addition to traditional payroll processing and HR solution providers, we compete with in-house payroll and HR systems and departments. We believe our solutions also compete with a variety of providers of HR services, such as retirement solutions companies, insurance companies, HR and benefits consulting firms, and national and regional PEOs.\n \nCompetition in the HCM industry is primarily based on the breadth of offerings, technology, ease of use, integration with third-party applications, service model, and price. We believe we are competitive in each of these areas. Our leading-edge technology and mobile applications, combined with personalized support provided by industry professionals and our technology-enabled solution capabilities, differentiate us from our competitors.\n \nSoftware Maintenance and Development\n \nThe ever-changing mandates of federal, state, and local tax and regulatory agencies require us to regularly update our proprietary software to provide payroll and HCM solutions to our clients. We are continually engaged in developing enhancements to and maintaining our various software platforms to meet the changing requirements of our clients and the marketplace. We continue to enhance our SaaS solutions and mobile applications to offer our users an integrated and unified experience. Continued enhancement of the client and client employee experience is important to our future success.\n \nHuman Capital\n \nWe believe our ability to attract and retain qualified employees in all areas of our business is critical to our future success and growth. We strive to foster a workplace that encompasses belonging and engagement and the ability to attract, retain, and develop talented employees; and keep them safe. We have dedicated resources to ensure that our efforts in building and sustaining a safe and inclusive culture are realized.\n \n\n\n6\n\n\n\n\nTable of Contents\n \n\n\nFor detailed information regarding our human capital activities, we encourage investors to visit our Corporate Responsibility website page at https://www.paychex.com/corporate/corporate-responsibility. We have also made our Corporate Responsibility report available on our website. The information contained on our website and in our Corporate Responsibility report is not and should not be viewed as being incorporated by reference into this Form 10-K.\n \nOur Employees:\n As of May 31, 2025, we employed approximately 19,000 people, primarily in the U.S. and on a full-time basis. None of our employees were covered by collective bargaining agreements. We have not experienced a strike or similar work stoppage, and we consider our relations with our employees to be good.\n \n \nPaychex Culture\n: Our core cultural values (“Paychex Values”) are designed to guide decision making aligned to the expectations of clients, stockholders, regulators, employees, and the multiple communities in which we operate and to reflect our continuing commitment to belonging and engagement. The Paychex Values are:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntegrity\n\n\nAccountability\n\n\nInnovation\n\n\n\n\n\n\nPartnership\n\n\nRespect\n\n\nService\n\n\n\n\n \nEach of these values guide our decision-making process and are critical to our ongoing success. All employees are required to verify their understanding and observance of these values during our annual “Right Way” training, review these values with management during periodic performance discussions, and are further encouraged to attend ongoing training during the year. Volunteer “Culture Champions” throughout the Company also help promote these values daily. We encourage employee feedback through our employee engagement surveys, as described below. This approach empowers our employees and allows us to make a positive impact in the communities we work and serve. As a result of our commitment to these principles, in 2025 we were recognized by Ethisphere, a global leader in defining and advancing the standards of ethical business practices, as one of the World’s Most Ethical Companies. Paychex is one of only three companies to have achieved this recognition 17 times, doing so consecutively since 2012.\n \nTalent Acquisition and Development:\n We compete for talent along with our direct competitors and other companies in the geographic areas we serve. We invest significant resources to attract and retain top talent. Our Talent Acquisition team, in conjunction with certain third-party partners, has developed comprehensive processes to identify and recruit accomplished professionals.\n \n \nOnce hired, our world-class Training Department provides functional training for service specialists and sales associates and also offers personal training, professional development, and leadership-development programs. As a result of our efforts, we have been recognized as one of the top training organizations in the world by Training magazine. After four consecutive years ranking among the top ten, Paychex was inducted into the Training Hall of Fame in 2025.\n \nComprehensive Compensation and Benefits: \nWe are committed to providing a fair wage and a total rewards package that allows our employees to be their best in every area of their lives.\n \nWe regularly review employee salaries to ensure we are competitive in the industry and offer financial benefits such as a 401(k) plan, employee stock purchase plan, tuition assistance, scholarships for children of employees, and financial education. We are also committed to rewarding employees with a comprehensive, competitive benefits package, which includes medical, prescription, dental, and vision insurance, short- and long-term disability, employee assistance program, paid family leave, and a variety of well-being programs. For the fiscal year ended May 31, 2025 (“fiscal 2025”), compensation-related expenses accounted for approximately 55% of our total expenses.\n \n \nEmployee Well-being Initiatives: \nIn addition to providing a comprehensive compensation and benefits package, we are committed to providing a safe and healthy workplace for our employees. Healthier employees are at lower risk of injury from workplace related exposures, perform work more safely with lower rates of absenteeism, experience better job performance, and can live their lives more fully outside of work. Our well-being program is a robust program focusing on the physical, emotional, community, career, and financial health of our employees.\n \n\n\n7\n\n\n\n\nTable of Contents\n \n\n\n \nOur award-winning well-being initiatives offer a wide variety of services, tools, and resources that can help employees achieve their health goals using a holistic approach. In addition, we sponsor onsite health screenings, Red Cross blood donation events, flu vaccination clinics, vaping and tobacco cessation and weight management programs, meditation and yoga classes, and a variety of other programs. Our employees’ financial well-being is equally important, so we have developed programs for financial education and support. We maintain procedures for events such as fires, severe weather, medical emergencies, and active shooters, as well as other important information related to general workforce safety.\n \nIn recognizing the ever-growing diversity of our workplace, we annually celebrate Paychex Culture Day. This is an additional paid day off for employees to celebrate and recognize a holiday that is significant to them. This is just one of the many ways we celebrate our employees’ unique heritages, and it reflects our Company's commitment to our staff.\n \nEmployee Engagement\n: We regularly ask our employees to share their views on working at Paychex through company-wide engagement surveys. Facilitated internally by our Human Resources team, the survey methodology is periodically updated to reflect current trends and issues including company direction and strategy, inclusion, individual development, collaboration, and our Paychex Values. A third-party administers the survey to maintain confidentiality of responses. We use the survey responses to help inform management and assist in developing programs and policies that will maintain and promote Paychex Values.\n \nIntellectual Property\n \nWe own or license and use a number of trademarks, trade names, copyrights, service marks, trade secrets, computer programs and software, and other intellectual property rights. Collectively, our intellectual property rights are material to the conduct of our business. Where it is determined to be appropriate, we take measures to protect our intellectual property rights, including, but not limited to, confidentiality/non-disclosure agreements or policies with employees, vendors, and others; license agreements with licensees and licensors of intellectual property; and registration of certain trademarks. We believe that the “Paychex” name, trademark, and logo are of material importance to us.\n \nSeasonality\n \nThere is no significant seasonality to our business. However, during our third fiscal quarter, which ends in February, the number of new payroll clients, new retirement solutions clients, and new worksite employees associated with our HR Outsourcing businesses tends to be higher than during the rest of the fiscal year, primarily because many businesses prefer to start using our solutions at the beginning of a calendar year. In addition, calendar year-end transaction processing and client funds activity are traditionally higher during our third fiscal quarter due to year-end bonus payments, additional year-end services, and the preparation and delivery of end-of year reporting requirements.\n \n \nAvailable Information\n \nWe are subject to the informational and reporting requirements of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Therefore, we file periodic reports, proxy statements, and other information with the SEC. The SEC maintains a website (www.sec.gov) that includes our reports, proxy statements, and other information.\n \n \nOur corporate website, www.paychex.com, provides materials for investors and information about our solutions. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and other SEC filings, as well as any amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, are made available, free of charge, on our website as soon as reasonably practicable after such reports have been filed with or furnished to the SEC. The information on our website is not incorporated by reference into our Form 10-K. Also, copies of our Annual Report to Stockholders and Proxy Statement, to be issued in connection with our 2025 Annual Meeting of Stockholders, will be made available, free of charge, upon written request submitted to Paychex, Inc., c/o Corporate Secretary, 911 Panorama Trail South, Rochester, New York 14625-2396.\n \n\n\n8\n\n\n\n\nTable of Contents",
  "item7": null,
  "item2": null
}