{
  "source_file": "pcg-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nPG&E Corporation, incorporated in California in 1995, is a holding company whose primary operating subsidiary is Pacific Gas and Electric Company, a public utility operating in Northern and Central California.  The Utility was incorporated in California in 1905.  PG&E Corporation became the holding company of the Utility and its subsidiaries in 1997.  The Utility generates revenues mainly through the sale and delivery of electricity and natural gas to customers.  The Utility’s service area is shown in the graphic below.\nPG&E Corporation’s and the Utility’s operating revenues, income, and total assets can be found below in Item 8. Financial Statements and Supplementary Data.\nThe principal executive offices of PG&E Corporation and the Utility are located at 300 Lakeside Drive, Oakland, California 94612.  PG&E Corporation’s telephone number is (415) 973-1000 and the Utility’s telephone number is (415) 973-7000.\nThis is a combined Annual Report on Form 10-K for PG&E Corporation and the Utility.  Each of PG&E Corporation and the Utility is a separate entity.\nTriple Bottom Line\nPG&E Corporation’s and the Utility’s purpose is to deliver for their hometowns, serve the planet, and lead with love.  In support of this purpose, the companies employ a Lean operating model designed to drive more effective and responsive decision-making, reduce the difficulties many employees face in their day-to-day work, and deliver better outcomes for customers and communities.\nPG&E Corporation and the Utility measure their progress toward the purpose by considering their impact on the “triple bottom line” of people, planet, and prosperity, which is underpinned by performance; this consideration takes into account not only the economic value they create for customers and investors, but also their responsibility to social and environmental goals.  The triple bottom line is designed to balance the interests of the companies’ many stakeholders, and it reflects the broader societal impacts of the companies’ activities.\nPG&E Corporation and the Utility will continue to consider the impact on the triple bottom line of people, planet, and prosperity in their daily operations as well as in their long-term strategic decisions.  The Utility will continue to seek fair and timely regulatory treatment to support its customer-driven investment plan while pursuing cost-control measures that would allow it to maintain the affordability of its service.  The Lean operating system is an important means of realizing PG&E Corporation’s and the Utility’s objective of achieving world-class performance while delivering hometown service.\nPeople\nThe people element of the triple bottom line represents PG&E Corporation’s and the Utility’s commitment to their workforce, their customers, the residents of local communities in which the companies do business, and other stakeholders.\n12\nPG&E Corporation’s and the Utility’s goal is to continually reduce risk to keep customers, the communities they serve, and their workforce (both employees and contractors) safe.  Their focus is on continuously building an organization where every work activity is designed to facilitate safe performance, every worker knows and practices safe behaviors, and every individual is encouraged to speak up and stop work if they see unsafe or risky behavior, and has confidence that their concerns and ideas will be heard and pursued.  PG&E Corporation and the Utility are committed to significantly improving their safety performance by understanding their risks, prioritizing their work, using controls to reduce risks, and continuously measuring and improving risk reduction.\nPG&E Corporation’s and the Utility’s human capital resource objectives are to build and retain an engaged, well trained, diverse, and equitably-paid workforce.  Their focus is on making it enjoyable to work with and for PG&E Corporation and the Utility.  PG&E Corporation and the Utility place a high priority on delivering customer value and providing a hometown customer experience.  The Utility’s customer-driven investment program is aimed at improving safety, increasing electric and gas service reliability, and improving customer satisfaction.\nFor more information, see “Human Capital” below.\nPlanet\nThe planet element of the triple bottom line represents PG&E Corporation’s and the Utility’s commitment to protect and serve the environment.  This commitment extends beyond compliance with various state and federal environmental, health, and safety laws and regulations.  PG&E Corporation and the Utility believe that integrating and managing climate change and other environmental considerations in the companies’ business strategies creates long-term value for PG&E Corporation and the Utility, and for their customers, communities, employees, and other stakeholders.  \nThe Utility is committed to delivering a safe, reliable, sustainable, and climate-resilient energy system at the lowest possible cost in the face of increasingly severe and extreme climate-driven natural hazards.  To build resilience to these hazards, the Utility is working to systematically integrate forward-looking climate data and tools into its decision-making.  PG&E Corporation and the Utility also work with policymakers and regulators to advance effective climate change policy in California, and work directly with local governments and communities on adaptation solutions.\nPG&E Corporation and the Utility are also committed to helping heal the planet.  PG&E Corporation’s and the Utility’s 2022 Climate Strategy Report, which is available to the public, describes the companies’ climate goals and plans to meet those goals.  To meet their longer-term climate goals, PG&E Corporation and the Utility intend to scale their efforts to decarbonize the energy system to accommodate a shift to vehicle electrification, integrate a proliferation of distributed energy resources, and achieve increased utilization of renewable energy combined with investments in the grid and energy storage.\nPG&E Corporation and the Utility continue to pursue policies and programs that enable safe, reliable, affordable, clean, and resilient energy for their customers.  As a result of actions already taken by PG&E Corporation and the Utility, the companies have:\n•\nDelivered electricity to retail customers in 2024 that was over 90% GHG free (see “Electricity Resources” below for more information).\n•\nHelped customers avoid emissions and manage energy costs through robust energy efficiency programs.\n•\nManaged contracts for more than 4.6 GW of battery energy storage to be deployed over the next several years and operated 183 MW of Utility-owned battery storage, strengthening California’s grid efficiency and reliability.\n•\nHelped enable the total number of electric vehicles operating in the Utility’s service area to exceed 675,000; installed more than 3,800 charging ports for electric vehicles at schools, public charging locations, and in support of fleets; and deployed the first-in-the-nation 100% electric school bus fleet that is also equipped with groundbreaking vehicle-to-grid technology.\n•\nBrought the total number of interconnected private solar customers to more than 880,000 and total number of customers who have installed battery storage at their homes or businesses to more than 120,000.  These customers use their storage systems as critical backup power and for resiliency.\n13\n•\nContinued to advance decarbonization initiatives for the Utility’s natural gas delivery system, including meeting the CPUC-mandated methane emission reduction target ahead of schedule and accelerated initiatives to meet its voluntary 2030 reduction goal.  The Utility also launched an initiative to purchase California-produced renewable natural gas for its natural gas customers, toward a target to procure renewable natural gas to serve 15% of its bundled residential and small commercial demand by 2030. \nProsperity\nThe prosperity element of the triple bottom line represents PG&E Corporation’s and the Utility’s commitment to meeting their financial objectives and providing economic development opportunities and benefits in the communities they serve.  Management believes clean energy should be affordable for and inclusive of all economic backgrounds.\nUnder cost-of-service ratemaking, a utility’s earnings depend on the outcomes of its ratemaking proceedings and its ability to manage costs.\nSee “Ratemaking Mechanisms” below and “Regulatory Matters” in Item 7. MD&A for more information on specific CPUC and FERC proceedings.\nGenerally, differences between forecast costs and actual costs can occur for numerous reasons, including the volume of work required and the impact of market forces on the cost of labor and materials.  Differences in costs can also arise from changes in laws and regulations at both the state and federal level.  Costs can also decrease due to improved efficiencies or waste elimination.\nPG&E Corporation and the Utility are committed to taking steps to improve their credit ratings and metrics over time, including by reducing PG&E Corporation’s debt by $2 billion by the end of 2026.  All three credit ratings agencies have increased PG&E Corporation’s and the Utility’s issuer credit ratings since 2020.  \nIn December 2024, PG&E Corporation announced a new dividend policy entailing consistent dividend increases targeting a dividend payout ratio of approximately 20% of core earnings by 2028.  For more information, see “Liquidity and Financial Resources – Dividends” in Item 7, MD&A and Note 6 of the Notes to the Consolidated Financial Statements.\nTotal capital expenditures recorded in 2024 were $10.6 billion.  The Utility’s total capital expenditures (including accruals) are forecasted to be $12.9 billion for 2025, $12.0 billion for 2026, $13.6 billion for 2027, and $14.0 billion for 2028.  The Utility has identified additional opportunities for investment in the coming years in addition to its forecast, including investments in transportation electrification capacity, FERC-jurisdictional assets, electric distribution capacity, hydroelectric facilities, energy storage, information technology, and automation.  The Utility also plans to submit a cost recovery application for its 10-year distribution undergrounding program pursuant to SB 884. Some of these investments depend on the Utility’s ability to generate or obtain the cash to support such investments over this period of time.  The completion of projects, the timing of expenditures, and the associated cost recovery may be affected by permitting requirements and delays, construction schedules, availability of labor, equipment and materials, financing, legal and regulatory approvals and developments, community requests or protests, weather, and other unforeseen conditions.\nThe Utility expects to make additional capital expenditures, the recovery of which will be subject to future regulatory approval.  These expenditures include capital expenditures exceeding amounts authorized in the 2023 GRC final decision and expenditures to be included in a later filing or separate applications.  These expenditures are expected to be primarily for wildfire mitigation and electrification.  Additionally, $3.21 billion of fire risk mitigation capital expenditures has been excluded from the Utility’s equity base rate pursuant to AB 1054.\n14\nPG&E Corporation and the Utility are committed to building a safe, reliable, sustainable, and climate-resilient energy system at the lowest possible cost for customers.  The Utility’s capital investment plan, increasing procurement of renewable power and energy storage, increasing environmental regulations, and the cumulative impact of other public policy requirements collectively place continuing upward pressure on customer rates.  Certain CPUC proceedings could impact different types of customers differently.  The Utility has set a goal to increase customer capital investments while also limiting customer bill impacts, including by achieving operating cost savings, seeking efficient financing, and benefiting from electric load growth.  The Utility plans to meet its cost savings goal through increased efficiencies including waste elimination through the Lean operating system.  The Utility expects electric vehicle adoption, data centers, and building electrification to drive load growth.  However, the scale of this growth will depend on the Utility’s ability to construct necessary infrastructure and the extent of customer demand.  The Utility has a number of programs in place to assist low-income customers, such as the CARE program.  Under the CARE program, income-qualified customers can receive a monthly discount of 20% or more on their natural gas and electric bill.\nPG&E Corporation’s and the Utility’s Corporate Sustainability Report, which is available to the public, describes the companies’ progress toward world-class performance measured with the triple bottom line framework.\nIn 2023, the Utility spent $4.18 billion with certified diverse suppliers, representing 36.6% of its total spend.\nPerformance: Underpinning the Triple Bottom Line\nPG&E Corporation and the Utility use the Lean operating system, which includes five basic “plays”: visual management; operating reviews; problem solving; standard work; and waste elimination.  Visual management allows teams to see how they are performing against their most important metrics using real-time data.  Teams throughout PG&E Corporation and the Utility hold daily, weekly, and monthly operating reviews designed to align the performance of employees closest to the work with the goals and objectives of senior leadership.  These brief meetings help the Utility identify gaps and quickly develop plans to support the teams performing the work and give the Utility more visibility, control and predictability in its operations.  Problem solving involves a structured approach to identifying, containing, analyzing, and solving problems in order to capitalize on opportunities.  Standard work reduces costs and increases productivity by establishing a consistent company-wide method for completing a task.  For instance, the Lean operating system helped the Utility identify patterns in the conditions of ignitions and led to the implementation of EPSS, which drove a significant reduction in facility ignitions.  PG&E Corporation’s and the Utility’s performance is also driven by an increased focus on alignment of shared outcomes among its leadership and within the organization.  Waste elimination, the fifth Lean play, was deployed in 2023 and enables the companies to identify and eliminate inefficiencies in both process and workflow in a sustainable manner and drive the continued adoption of consistent processes and improvements to financial visibility and controls.\nIn 2023, the Utility implemented PG&E’s Safety Excellence Management System, which is a more systematic approach to assess risk and evaluate or implement controls for safe operation based on industry standards.\nPG&E Corporation and the Utility have implemented a regional service model to bring the Utility closer to the hometowns it serves.  Through the regional service model, the Utility has restructured its service area into five regions, with leaders assigned for each region to deliver improved public and employee safety, customer service, and operational reliability outcomes.\nCalifornia has experienced unprecedented weather conditions in recent years and the Utility’s service area remains susceptible to additional wildfire activity.  In response, the Utility has implemented operational changes and investments that reduce wildfire risk, including:\n•\nEnhanced Powerline Safety Settings:\n EPSS adjusts the sensitivity of circuit protection devices on selected power lines to de-energize them in less than one-tenth of a second in the event of a disturbance to help prevent potential ignitions.  In recent years, the Utility expanded the EPSS program to all high fire risk areas and reviewed and adjusted settings to improve coordination among devices on a circuit to reduce the number of customers impacted by an outage.  After EPSS was initiated, both the size and number of CPUC-reportable ignitions were reduced substantially on EPSS-enabled circuits, compared to the prior three-year average.\n•\nPublic Safety Power Shutoffs: \n The PSPS program proactively de-energizes power lines in response to forecasted weather conditions.  Since its inception in late 2017, the PSPS program has become more targeted through the use of more granular risk models, including incorporating more detailed data inputs.  The Utility has also installed sectionalizers for more targeted de-energizations of circuits and transmission lines.  These more targeted scoping criteria are engineered to reduce the number of customers impacted by any particular PSPS event.  In 2024, the Utility executed six PSPS events impacting a total of approximately 50,000 customers.\n15\n•\nVegetation management:\n  The Utility inspects its overhead electric distribution and transmission facilities on an annual basis to identify and clear vegetation that might grow or fall into utility equipment.  \n•\nAsset inspections:\n  Since 2018, the Utility has reoriented its asset inspections programs toward asset condition and consequence risk, particularly wildfire risk, and these programs have become more thorough, standardized, digitized, and verifiable.  The Utility uses risk-informed inspection cycles.  In 2024, the Utility continued to refine its inspection techniques, transitioning to the use of aerial drones to perform inspections on circuits located in HFTD areas.  As a result of the improved inspection program, the Utility’s inspections in 2024 have further enhanced its ability to identify equipment conditions.\n•\nSystem hardening:\n  System hardening entails repairing, replacing, or eliminating existing power lines in HFTD areas and installing stronger and more resilient equipment.  As the Utility’s asset inspections have identified less resilient equipment, the Utility has hardened its system by fixing significantly more equipment than in prior years.  Hardening methods also include replacing bare overhead conductor with covered conductor and installing stronger poles, removing lines, and serving customers through remote grids, or converting lines from overhead to underground.  The Utility has set a goal to underground 10,000 miles of electric distribution lines in high wildfire risk areas.  Undergrounding can substantially reduce ignition risk and improve reliability during storms or periods of high wildfire risk.  In 2024, the Utility undergrounded 259 miles of lines.  When feasible, remote grids can be a more cost-effective option to reduce fire risks by permanently disconnecting end-of-line customers from the grid and serving them with utility owned, locally sited resources.  The Utility brought online five additional remote grids in 2024, for a total of 11 remote grids overall. \nThe Utility’s equipment was not involved in the ignition of any major wildfires in 2024.  The Utility experienced an increased number of CPUC-reportable ignitions in 2024, compared to 2022 and 2023, due to hotter, drier weather conditions.\nIn recent years, the Utility has introduced or expanded its use of several measures including downed conductor detection, partial voltage force outs, and transmission operational controls which further decreased wildfire ignition risk and took additional steps to improve customer reliability such as vegetation management activities to reduce vegetation-caused outages, upgrading the system to improve sectionalization, and installing fault indicators to reduce restoration times.  The Utility also uses multiple weather models on a daily basis that indicate which circuits to enable with safety settings and which to put in normal protection settings, optimizing for wildfire risk reduction when needed and enhancing reliability when wildfire risk is low.\nPG&E Corporation and the Utility are continuing to invest in a safe and reliable gas system and are working toward targeted electrification, greening the gas supply, and shaping California energy policy.  The Utility has focused on continuously improving its gas operations safety record.  Since the San Bruno natural gas pipeline explosion in 2010, the Utility’s asset safety efforts have included replacing distribution mains and transmission pipelines, as well as strength testing transmission pipelines.  The Utility uses in-line inspections to assess the integrity of transmission pipelines.  The Utility also uses safety and control systems to monitor, gather, and process real-time data on its gas system. \nThe Utility has engaged in educating employees, contractors, and the public regarding safe digging programs and practices for their awareness during construction and when digging near the Utility’s underground gas and electric assets.  The Utility also installed safety devices that automatically detect increasing pressure on systems and stop the flow of gas to avoid outages and overpressure events.  Additionally, the Utility continues to streamline its efforts to respond to outages on a timely basis.  The Utility’s outage response is designed to keep the public safe while limiting customer outages and returning service safely and as quickly as possible.\nThe Utility’s non-nuclear generation operations focus on safety, compliance, environmental stewardship, and asset reliability. The Utility focuses on continuous improvement and risk informed decision-making to maximize asset value for customers, while adhering to industry standards for asset risk management and lifecycle optimization.  Work management systems enable the execution and tracking of preventative and corrective maintenance strategies for generation assets. Capital improvements are carried out to renew key asset components and are strategically aligned with interim risk reduction measures to ensure long-term safe and reliable generation.\n16\nRegulatory Environment \nThe Utility’s business is subject to the regulatory jurisdiction of various agencies at the federal, state, and local levels.  At the state level, the Utility is regulated primarily by the CPUC.  At the federal level, the Utility is regulated primarily by the FERC and the NRC.  The Utility is also subject to the requirements of other federal, state and local regulatory agencies, including with respect to safety, the environment, and health, such as the NTSB and the OEIS.\nThis section and the “Environmental Regulation” and the “Ratemaking Mechanisms” sections below summarize some of the more significant laws, regulations, and regulatory proceedings affecting the Utility.  For more information, see Item 1A. Risk Factors and “Regulatory Matters” in Item 7. MD&A. \nPG&E Corporation is subject to the Public Utility Holding Company Act as a public utility holding company.  The Public Utility Holding Company Act primarily obligates PG&E Corporation and its utility subsidiaries to provide access to their books and records to the FERC and the CPUC for ratemaking purposes.\nCalifornia Public Utilities Commission\nThe CPUC is a regulatory agency that regulates privately owned public utilities in California.  The CPUC has jurisdiction over the rates and terms and conditions of service for the Utility’s electric and natural gas distribution operations, electric generation, and natural gas transmission and storage services.  The CPUC has also exercised jurisdiction over the Utility’s issuances of securities, dispositions of utility assets and facilities, energy purchases on behalf of the Utility’s electric and natural gas retail customers, rates of return, rates of depreciation, oversight of nuclear decommissioning, and aspects of the siting of facilities used in providing electric and natural gas utility service.\nThe CPUC enforces state and federal laws and regulations that set forth safety requirements pertaining to the design, construction, testing, operation, and maintenance of utility gas and electric facilities.  The CPUC can impose penalties of up to $100,000 per day, per violation.  The CPUC has broad discretion to determine the amount of penalties based on the totality of the circumstances, including such factors as the gravity of the violations, the type of harm caused by the violations and the number of persons affected, and the good faith of the entity charged in attempting to achieve compliance, after notification of a violation.  The CPUC also is required to consider the appropriateness of the amount of the penalty to the size of the entity charged.\nThe CPUC has delegated authority to the SED to issue citations and impose penalties for violations identified through audits, investigations, or self-reports.  Under the gas and electric citation programs adopted by the CPUC, the SED has discretion whether to issue a penalty for each violation.  If it assesses a penalty for a violation, it has the authority to impose the maximum statutory penalty of $100,000 per day, with an administrative limit of $8 million per citation issued.  Similar to penalties imposed by the CPUC, penalty payments for citations issued pursuant to the gas and electric safety citation programs are the responsibility of shareholders and may not be recovered through rates or otherwise charged to customers.  The CPUC has also authorized the SED to propose for CPUC approval administrative consent orders and administrative enforcement orders when the SED deems a formal order instituting investigation unnecessary.\nThe California State Legislature also directs the CPUC to implement state laws and policies, such as the laws relating to wildfires and wildfire cost recovery, increasing renewable energy resources, the development and widespread deployment of distributed generation and self-generation resources, the reduction of GHG emissions, the establishment of energy storage procurement targets, and the development of a state-wide electric vehicle charging infrastructure.  The CPUC is responsible for approving funding and administration of state-mandated public purpose programs such as energy efficiency and other customer programs.  The CPUC also conducts audits and reviews of the Utility’s accounting, performance, and compliance with regulatory guidelines.\nThe CPUC has imposed various conditions that govern the relationship between the Utility and PG&E Corporation and other affiliates, including financial conditions that require PG&E Corporation’s Board of Directors to give first priority to the capital requirements of the Utility, as determined to be necessary and prudent to meet the Utility’s obligation to serve or to operate the Utility in a prudent and efficient manner.  For more information on specific CPUC enforcement matters and CPUC-implemented laws and policies and the related impact on PG&E Corporation and the Utility, see Item 1A. Risk Factors, “Regulatory Matters,” “Legislative and Regulatory Initiatives,” and “Liquidity and Financial Resources” in Item 7. MD&A and Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\n17\nFederal Energy Regulatory Commission and California Independent System Operator Corporation\nThe FERC has jurisdiction over the Utility’s electric transmission revenue requirements and rates, the siting, construction, operation, maintenance, and safety obligations of substantially all of the Utility’s hydroelectric generation facilities, and the interstate sale and transportation of natural gas.  The FERC regulates the interconnections of the Utility’s transmission systems with other electric systems and generation facilities, the tariffs and conditions of service of regional transmission organizations, and the terms and rates of wholesale electricity sales.  The FERC also is charged with adopting and enforcing mandatory standards governing the reliability of the nation’s electric transmission grid, including standards to protect the nation’s bulk power system against potential disruptions from cyber and physical security breaches.  The FERC’s approval is required under Federal Power Act Section 203 before undertaking certain transactions, including most mergers and consolidations, certain transactions that result in a change in control of a utility, purchases of utility securities and dispositions of utility property.  The FERC has authority to impose fines of up to $1 million per day for violations of certain federal statutes and regulations.  For more information on specific FERC requirements and their impact on PG&E Corporation and the Utility, see Item 1A. Risk Factors, and “Regulatory Matters,” “Legislative and Regulatory Initiatives,” and “Liquidity and Financial Resources” in Item 7. MD&A, and Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nThe CAISO is the FERC-approved regional transmission organization for the Utility’s service area.  The CAISO controls the operation of the electric transmission system in most of California and a small part of Nevada and provides open access transmission service on a non-discriminatory basis.  The CAISO is also responsible for planning transmission system additions, ensuring the maintenance of adequate reserves of generating capacity, ensuring that the reliability of the transmission system is maintained, and operating the wholesale power market in most of California and an interstate energy imbalance market.\nNuclear Regulatory Commission\nThe NRC oversees the licensing, construction, operation, and decommissioning of nuclear facilities, including the Utility’s two nuclear generating units at DCPP and the Utility’s independent spent fuel storage installation at Humboldt Bay.  See “Electricity Resources” below.  NRC regulations require extensive monitoring and review of the safety, radiological, seismic, environmental, and security aspects of these facilities.  In the event of non-compliance, the NRC has the authority to impose fines or to force a shutdown of a nuclear plant, or both.  NRC safety and security requirements have, in the past, necessitated that the Utility incur substantial costs at DCPP, and substantial costs could be required in the future.  For more information about DCPP, see Item 1A. Risk Factors and Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nOther Regulators \nThe CEC is a California agency with responsibility for energy policy and planning.  The CEC is responsible for licensing all thermal power plants over 50 MW within California.  The CEC establishes forecasts of future energy needs used by the CPUC in determining the adequacy of utilities’ and other load-serving entities’ electricity procurement.  The CEC also promotes energy management and conservation programs, including setting standards for building and appliance energy efficiency and load management programs. \nThe CARB is the state agency responsible for setting and monitoring GHG and other emission limits.  The CARB is also responsible for adopting and enforcing regulations to implement state law requirements to gradually reduce GHG emissions in California.  See “Environmental Regulation - Air Quality and the Clean Air Act” below.\nThe NTSB is an independent U.S. government investigative agency responsible for civil transportation accident investigations, including pipeline accidents.  The NTSB also conducts special investigations and safety studies, and issues safety recommendations to prevent future accidents.\nThe California Geologic Energy Management Division is the state agency responsible for establishing and enforcing regulations for the operation of the Utility’s underground gas storage facilities.\nThe Department of Transportation’s (“DOT”) Pipeline and Hazardous Materials Safety Administration has established regulations regarding the design, construction, operation, maintenance, integrity, safety, and security of natural gas distribution, transmission, and underground storage facilities.  The DOT has certified the CPUC to administer oversight and compliance with these regulations for the entities it regulates in California.\n18\nThe OEIS is a state agency responsible for reviewing and approving the Utility’s WMP and for evaluating the Utility’s implementation of the WMP.  The OEIS is also responsible for reviewing and issuing the Utility’s annual safety certification, annually reviewing and approving the Utility’s executive compensation plan, conducting assessments of the Utility’s safety culture, conducting field inspections of wildfire mitigation activities, and reviewing proposed undergrounding plans under SB 884.\nIn addition, the Utility obtains permits, authorizations, and licenses in connection with the construction and operation of the Utility’s generation facilities, electricity transmission lines, natural gas transportation pipelines, and gas compressor station facilities.  Delay in obtaining, or failure to obtain and maintain, any such permits, authorizations, or licenses could prevent construction of new facilities, limit or prevent continued operation of existing facilities, or result in significant additional costs or restrictions on operations.  The Utility also periodically obtains permits, authorizations, and licenses in connection with distribution of electricity and natural gas that grant the Utility rights to occupy or use public property for the operation of the Utility’s business and to conduct certain related operations.  The Utility has franchise agreements with approximately 300 cities and counties that permit the Utility to install, operate, and maintain the Utility’s electric or natural gas facilities in the public streets and highways.  In exchange for the right to use public streets and highways, the Utility pays annual fees to the cities and counties.  In most cases, the Utility’s franchise agreements are for an indeterminate term, with no expiration date.  For more information see Item 1A. Risk Factors.\nMaterial Effects of Compliance with Governmental Regulations\nAs indicated above, the Utility’s business is subject to the regulatory jurisdiction of various agencies at the federal, state, and local levels.  Compliance with such extensive government regulations requires substantial expenditures and has had in the past and may continue to have in the future a material effect on PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, cash flows and competitive position.  For more information about costs incurred to comply with government regulations and related material effects on PG&E Corporation and the Utility, see Item 1A. Risk Factors, “Liquidity and Financial Resources” and “Regulatory Matters” in Item 7. MD&A, and Notes 14 and 15 of the Notes to the Consolidated Financial Statements in Item 8.\nEnvironmental Regulation\nThe Utility’s operations are subject to extensive federal, state, and local laws and requirements relating to the protection of the environment and the safety and health of the Utility’s personnel and the public.  These laws and requirements relate to a broad range of activities, including the remediation of hazardous and radioactive substances; the discharge of pollutants into the air, water, and soil; the reporting and reduction of CO\n2\n and other GHG emissions; the transportation, handling, storage and disposal of spent nuclear fuel; and the environmental impacts of land use, including endangered species and habitat protection.\n \nThe penalties for violation of these laws and requirements can be severe and may include significant fines, damages, and criminal or civil sanctions.  These laws and requirements also may require the Utility, under certain circumstances, to interrupt or curtail operations.  See Item 1A. Risk Factors.  Generally, the Utility recovers most of the costs of complying with environmental laws and regulations through the Utility’s rates, subject to reasonableness review.  Environmental costs associated with the clean-up of most sites that contain hazardous substances are subject to a ratemaking mechanism described in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nHazardous Substance Compliance and Remediation\nThe Utility’s facilities are subject to various regulations adopted by the EPA, including the Resource Conservation and Recovery Act and the Comprehensive Environmental Response, Compensation and Liability Act of 1980, as amended.  The Utility is also subject to the regulations adopted by other federal agencies responsible for implementing federal environmental laws.  The Utility also must comply with environmental laws and regulations adopted by the State of California and various state and local agencies.  These federal and state laws impose strict liability for the release of a hazardous substance on the (1) owner or operator of the site where the release occurred, (2) on companies that disposed of, or arranged for the disposal of, the hazardous substances, and (3) in some cases, their corporate successors.  Under the Comprehensive Environmental Response, Compensation and Liability Act, these persons (known as “potentially responsible parties”) may be jointly and severally liable for the costs of cleaning up the hazardous substances, monitoring and paying for the harm caused to natural resources, and paying for the costs of health studies.\n19\nThe Utility has a comprehensive program in place to comply with these federal, state, and local laws and regulations.  Under federal and California laws, the Utility may be responsible for remediation of hazardous substances even if it did not deposit those substances on the site.  The Utility’s remediation activities are overseen by the DTSC, several California regional water quality control boards, and various other federal, state, and local agencies.  The Utility has incurred significant environmental remediation liabilities associated with former MGP sites, power plant sites, gas gathering sites, sites where natural gas compressor stations are located, and sites used by the Utility for the storage, recycling, or disposal of potentially hazardous substances.  Groundwater at the Utility’s Hinkley and Topock natural gas compressor stations contains hexavalent chromium as a result of the Utility’s past operating practices.  The Utility is responsible for remediating this groundwater contamination and for abating the effects of the contamination on the environment.\nFor more information about environmental remediation liabilities, see Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nAir Quality and the Clean Air Act\nThe Utility’s electric generation plants, natural gas pipeline operations, vehicle fleet, and fuel storage tanks are subject to numerous air pollution control laws, including the federal Clean Air Act, as well as state and local statutes.  These laws and regulations cover, among other pollutants, those contributing to the formation of ground-level ozone, carbon dioxide (CO\n2\n), sulfur dioxide (SO\n2\n), nitrogen oxides (NO\nx\n), particulate matter, and other emissions.\nAt the federal level, the EPA is charged with implementation and enforcement of the Clean Air Act, which it uses to address GHG emissions.\nFor information regarding regulation of greenhouse gas emissions, see “Sustainability and Resiliency” below.\nNuclear Fuel Disposal\nNuclear power plant operations produce gaseous, liquid, and solid radioactive wastes, which are covered by federal regulation.  High-level radioactive wastes primarily include used nuclear fuel.  Low-level waste consists primarily of demineralizer resins, paper, protective clothing, rags, tools, and equipment contaminated through use.\nUnder the Nuclear Waste Policy Act of 1982, the DOE and electric utilities with commercial nuclear power plants were authorized to enter into contracts under which the DOE would be required to dispose of the utilities’ spent nuclear fuel and high-level radioactive waste by January 1998, in exchange for fees paid by the utilities’ customers.  The DOE has been unable to meet its contractual obligation with the Utility to dispose of nuclear waste from the Utility’s two nuclear generating units at DCPP and the retired nuclear facility at Humboldt Bay.  As a result, the Utility constructed interim dry cask storage facilities to store its spent fuel onsite at DCPP and at Humboldt Bay until the DOE fulfills its contractual obligation to take possession of the spent fuel.  The Utility and other nuclear power plant owners sued the DOE to recover the costs that they incurred to construct interim storage facilities for spent nuclear fuel.\nRatemaking Mechanisms\nThe Utility operates under a “cost-of-service” ratemaking model, which means that rates for electric and natural gas utility services are generally set at levels that are intended to allow the Utility to recover its costs of providing service and to earn a return on invested capital.  To set rates, the CPUC and the FERC conduct proceedings to determine the amount that the Utility will be authorized to collect from its customers (“revenue requirements”).  In the GRC proceedings, the CPUC also generally approves the level of spending on a forecasted basis.  Revenue authorized by the CPUC through GRC proceedings is intended to provide the Utility a reasonable opportunity to recover its costs and earn a return on its investments in generation and distribution assets and general plant (also referred to as “rate base”).  The Utility’s revenue requirements consist primarily of a base amount set to enable the Utility to recover its reasonable operating expenses (e.g., maintenance, administration, and general expenses) and capital costs (e.g., depreciation, and financing expenses).\nThe Utility’s costs of equity and long-term debt are generally approved in the CPUC’s cost of capital proceedings.\nAs a result, the Utility’s CPUC-jurisdictional revenue requirement is the sum of the following:\n•\nexpenses;\n•\ndepreciation;\n20\n•\ntaxes; and\n•\nthe product of the Utility’s rate of return (i.e., the cost of capital for long-term debt and equity) and its rate base.\nIn addition to the Utility’s revenue requirement, the CPUC authorizes the Utility to collect revenues to recover costs that the Utility is allowed to “pass through” to customers, including its costs to procure electricity and natural gas for customers and to administer public purpose and customer programs.\nFERC revenue requirements are set through a FERC-approved formula rate.  The Utility’s rate of return on electric transmission assets is determined in the FERC TO proceedings.\nCustomer rates are determined by dividing the revenues that the Utility is authorized to collect from customers by the amount of power that the Utility is forecasted to sell.  Increases in load spread the Utility’s revenue requirement over a larger usage base, which reduces customer rates, but also increases fuel costs, which are passed through to customers.\nOther than certain gas transmission and storage revenues, the Utility’s base revenues are “decoupled” from its sales volume through regulatory balancing accounts, or revenue adjustment mechanisms, that are designed to allow the Utility to collect its authorized base revenue requirements regardless of sales volume.  As a result, the Utility’s base revenues are not impacted by fluctuations in sales resulting from, for example, weather or economic conditions.  The Utility’s earnings primarily depend on its ability to manage its base operating and capital costs within its authorized base revenue requirements.\nDue to the seasonal nature of the Utility’s business and rate design, customer electric bills are generally higher during summer months (May to October) because of higher demand, driven by air conditioning loads.  Customer bills related to gas service are generally higher during winter months (November to March) because of higher demand due to heating.\nFrom time to time, the CPUC may use incentive ratemaking mechanisms that provide the Utility an opportunity to earn additional revenues.  For example, the Utility has earned incentives for the successful implementation of energy efficiency programs.\nSee “Regulatory Matters” in Item 7. MD&A for more information on specific CPUC proceedings.\nBase Revenues\nGeneral Rate Cases\nThe GRC is the primary proceeding in which the CPUC determines the amount of base revenue requirements that the Utility is authorized to collect from customers to recover the Utility’s anticipated costs related to its electric distribution, natural gas distribution, and Utility-owned electric generation operations and return on rate base.  The CPUC conducts a GRC every four years that includes the Utility’s costs of its gas transmission and storage facilities.  The CPUC approves the annual revenue requirements for the first year (or “test year”) of the GRC period and typically authorizes the Utility to receive annual increases in revenue requirements for the subsequent years of the GRC period (known as “attrition years”).  Attrition year rate adjustments are generally authorized for cost increases related to invested capital and inflation.  Parties to the Utility’s GRC include the Public Advocates Office of the CPUC (formerly known as Office of Ratepayer Advocates or ORA) and TURN, which generally represent the interests of residential customers, as well as numerous intervenors that represent other business, community, customer, environmental, and union interests.  For more information about the Utility’s GRC, see “Regulatory Matters - 2023 General Rate Case” in Item 7. MD&A.\nCost of Capital Proceedings\nThe CPUC periodically conducts a cost of capital proceeding to authorize the Utility’s ratemaking capital structure (i.e., the relative weightings of common stock, preferred equity, and debt for ratemaking) and rates of return for its electric generation, electric and natural gas distribution, and natural gas transmission and storage rate base.  The rate of return, or cost of capital, is the weighted average cost of debt, preferred equity, and common stock a utility has issued to finance its utility capital investments.  The CPUC’s cost of capital proceedings generally take place in a consolidated proceeding with California’s other large investor-owned electric and gas utilities.  For more information about the cost of capital proceedings, see “Regulatory Matters - Cost of Capital Proceedings” in Item 7. MD&A.\n21\nElectricity Transmission Owner Rate Cases\nThe FERC determines the amount of authorized revenue requirements, including the rate of return on electric transmission assets, that the Utility may collect through rates in TO rate cases.  In its TO rate cases, the Utility uses a formula rate methodology, which includes an authorized revenue requirement and rate base for a given year but also provides for an annual update of the previous year’s revenue requirement and rates in accordance with the terms of the FERC-approved formula.  Under the formula rate mechanism, transmission revenue requirements are updated to the actual cost of service annually as part of the true-up process.  Differences between amounts collected and determined under the formula rate are either collected from or refunded to customers.  The FERC typically authorizes the Utility to charge new rates based on the requested revenue requirement, subject to refund, before the FERC has issued a final decision.  The Utility bills and records revenue based on the amounts requested in its rate case filing and records a reserve for its estimate of the amounts that are probable of refund.  These FERC-approved rates are included by the CPUC in the Utility’s retail electric rates and by the CAISO in its transmission access charges to wholesale customers.  For more information, see “Regulatory Matters - Transmission Owner Rate Cases” in Item 7. MD&A.  The Utility also recovers a portion of its revenue requirements for its wholesale electric transmission costs through charges collected under specific contracts with wholesale transmission customers that the Utility entered into before the CAISO began its operations.  These wholesale customers are charged individualized rates based on the terms of their contracts.\nProgram-Specific Memorandum Account and Balancing Account Costs\nPeriodically, costs arise outside of the CPUC’s GRC proceedings or that have been deliberately excluded from such proceedings.  These costs may result from catastrophic events, changes in regulation, new programs, or extraordinary changes in operating practices.  The Utility may seek authority to track incremental costs in a memorandum account, and the CPUC may authorize recovery of costs tracked in memorandum accounts if the costs are deemed reasonable.  For instance, these accounts allow the Utility to track the costs associated with work related to disaster and wildfire response, and other wildfire prevention-related costs.  Recovery of the costs tracked in these memorandum accounts through rates requires CPUC authorization in separate proceedings, the outcome of which the Utility may be unable to predict.  Alternatively, the Utility may seek authority to track incremental costs related to these non-GRC programs in balancing accounts.  The CPUC may authorize recovery of costs tracked in the balancing accounts on either a “one-way” basis, which typically only allows actual costs to be recovered up to a pre-established cap, or a “two-way” basis, which typically allows actual costs to be recovered, and in some cases subject to further CPUC review.  For more information, see “Regulatory Matters - Cost Recovery Proceedings” in Item 7. MD&A and Note 3 of the Notes to the Consolidated Financial Statements in Item 8.\nDiablo Canyon Extended Operations\nDuring the period of extended operations and in lieu of the traditional rate-based return on investment, SB 846 provides for a fixed payment of $50 million, in 2022 dollars, for each of DCPP’s Unit 1 and Unit 2 for each year of extended operations to be recovered from customers of all CPUC-jurisdictional LSEs, which is potentially subject to adjustment downward in the event of extended unplanned outages.  In addition, SB 846 authorizes a volumetric payment totaling $13 (in 2022 dollars) for each MWh generated by DCPP during the period of extended operations, with the first half recovered from all CPUC-jurisdictional LSEs and the second half from customers in the Utility’s service area.  The amount of the fixed and volumetric payments will be adjusted annually by the CPUC using CPUC-approved escalation methodologies and adjustment factors.  The volumetric payment cannot be realized as shareholder profits or paid out as dividends, to the extent it is not needed for DCPP.  The legislation includes language that limits use of the volumetric payment to accelerate, or increase spending on, public purpose priorities enumerated in SB 846.\nRevenues to Recover Energy Procurement and Other Pass-Through Costs\nElectricity Procurement Costs\nCalifornia IOUs are responsible for procuring electrical capacity required to meet bundled customer demand, plus applicable reserve margins.  The utilities are responsible for scheduling and bidding electric generation resources, including certain electricity procured from third parties, into the wholesale market to meet customer demand according to which resources are the least expensive (i.e., using the principles of “least-cost dispatch”).  In addition, the utilities are required to obtain CPUC approval of their BPPs based on long-term demand forecasts.  In October 2015, the CPUC approved the Utility’s most recent comprehensive BPP.  It has been revised since its initial approval, and the revised version will remain in effect, subject to any further revisions, until superseded by a subsequent CPUC-approved plan.\n22\nCalifornia law allows electric utilities to recover the costs incurred in compliance with their CPUC-approved BPPs without further after-the-fact reasonableness review by the CPUC.  The CPUC may disallow costs associated with electricity purchases if the costs were not incurred in compliance with the CPUC-approved plan or if the CPUC determines that the utility failed to follow the principles of least-cost dispatch.  Additionally, the CPUC may disallow the value of lost generation due to unplanned outages at utility-owned generation facilities.\nThe Utility recovers its electric procurement costs annually primarily through balancing accounts.  See Note 3 of the Notes to the Consolidated Financial Statements in Item 8.  Each year, the CPUC reviews the Utility’s forecasted procurement costs related to power purchase agreements, derivative instruments, GHG emissions costs, and generation fuel expense, and approves a forecasted revenue requirement.  The CPUC may adjust the Utility’s retail electric rates more frequently if the forecasted aggregate over-collections or under-collections in the Energy Resource Recovery Account, net of bundled service customer Portfolio Allocation Balancing Account balances, exceed five percent of its prior year electric procurement and Utility-owned generation revenues.  The CPUC performs an annual compliance review of the procurement transactions recovered in various balancing accounts, including the Energy Resource Recovery Account and the Portfolio Allocation Balancing Account.\nThe CPUC has approved various power purchase agreements into which the Utility has entered with third parties in accordance with the Utility’s CPUC-approved BPP, to meet mandatory renewable energy targets, and to comply with RA requirements.  For more information, see “Electric Utility Operations - Electricity Resources” below as well as Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nThe Utility is also responsible, as the central procurement entity (“CPE”) for its distribution service area, for seeking to procure the entire amount of required local RA on behalf of all CPUC-jurisdictional LSEs in its distribution service area.  CPUC decisions grant the Utility, acting as CPE, discretion to defer procurement of local resources to the CAISO’s backstop mechanisms if bid costs are deemed unreasonably high.  The Utility, as the CPE, will not be assessed fines or penalties for failing to procure resources to meet the local RA requirements and deferring local procurement to the CAISO backstop mechanism, so long as the CPE exercised reasonable efforts to secure capacity and certain specified requirements are met.  In addition, the Utility, as the CPE, has been ordered or authorized to seek to procure specific local capacity products pursuant to CPUC decisions.  In connection with its CPE function, the Utility is responsible for making compliance demonstrations to the CPUC and the CAISO.  The Utility recovers its administrative and procurement costs associated with its CPE function through a balancing account.  The CPUC may disallow costs associated with the CPE function that were not incurred in compliance with the CPUC’s decisions and guidance.\nThe CPUC has also approved the Power Charge Indifference Adjustment (“PCIA”).  The PCIA is a cost recovery mechanism to ensure that customers who switch from the Utility’s bundled service to a non-Utility provider, such as a DA or CCA provider, pay their share of the above-market costs associated with long-term power purchase commitments and Utility-owned generation made on their behalf.\nNatural Gas Procurement, Storage, and Transportation Costs\nThe Utility recovers the cost of gas used in generation facilities as a cost of electricity that is recovered annually through retail electric rates.\nThe Utility sets the natural gas procurement rate for small commercial and residential customers (referred to as “core” customers) monthly, based on the forecasted costs of natural gas, core pipeline capacity and storage costs.  The Utility recovers the cost of gas purchased on behalf of core customers as well as the cost of derivative instruments for its core gas portfolio, through its retail gas rates, subject to limits as set forth in its Core Procurement Incentive Mechanism (“CPIM”) described below.  The Utility reflects the difference between actual natural gas purchase costs and forecasted natural gas purchase costs in several natural gas balancing accounts, with adjustments for under-collections and over-collections made in subsequent monthly rate changes.\n23\nThe CPIM protects the Utility against after-the-fact reasonableness reviews of its gas procurement costs for its core gas portfolio.  Under the CPIM, the Utility’s natural gas purchase costs for a fixed 12-month period are compared to an aggregate market-based benchmark based on a weighted average of published monthly and daily natural gas price indices at the points where the Utility typically purchases natural gas.  Costs that fall within a tolerance band, which is 99% to 102% of the commodity benchmark, are considered reasonable and are fully recovered through rates.  One-half of the costs above 102% of the benchmark are recoverable through rates, and the Utility’s customers receive in their rates 80% of any savings resulting from the Utility’s cost of natural gas that is less than 99% of the benchmark.  The Utility retains the remaining amount of these savings as incentive revenues, subject to a cap equal to 1.5% of total natural gas commodity costs.  While this mechanism remains in place, changes in the price of natural gas, consistent with the market-based benchmark, are not expected to materially impact net income.\nThe Utility incurs transportation costs under various agreements with interstate and Canadian third-party transportation service providers.  These providers transport natural gas from the points at which the Utility takes delivery of natural gas (typically in Canada, the U.S. Rocky Mountains, and the southwestern United States) to the points at which the Utility’s natural gas transportation system begins.  These agreements are governed by FERC-approved tariffs that detail rates, rules, and terms of service for the provision of natural gas transportation services to the Utility on interstate and Canadian pipelines.  The FERC approves the United States tariffs governing payments by shippers (including the Utility) for pipeline service, and the Canada Energy Regulator, the Canadian regulatory agency, approves the applicable Canadian tariffs.  The transportation costs the Utility incurs under these agreements are recovered through CPUC-approved rates as core natural gas procurement costs or as a cost of electricity.\nCosts Associated with Public Purpose and Customer Programs\nThe CPUC authorizes the Utility to recover the costs of various public purpose and other customer programs through the collection of rates from most Utility customers.  These programs relate to energy efficiency, demand response, distributed generation, energy research and development, and other matters.  Additionally, the CPUC has authorized the Utility to provide discounted rates for specified types of customers, such as for low-income customers under the CARE program, which is paid for by the Utility’s other customers.\nNuclear Decommissioning Costs\nThe Utility’s nuclear power facilities consist of two units at DCPP and the Humboldt Bay independent spent fuel installation.  Nuclear decommissioning requires the safe removal of nuclear facilities from service and the reduction of residual radioactivity to a level that permits termination of the NRC license and release of the property for unrestricted use.  Nuclear decommissioning costs are generally collected in advance through rates and are held in nuclear decommissioning trusts to be used for the eventual decommissioning of each nuclear unit.  The Utility files an application with the CPUC, generally every three years, requesting approval of the Utility’s updated estimated decommissioning costs and any rate change necessary to fully fund the nuclear decommissioning trusts to the levels needed to decommission the Utility’s nuclear facilities.  If the nuclear decommissioning trusts are overfunded, the amount of such overfunding will be returned to customers.  Pursuant to Public Utilities Code Section 8325, to the extent the monies available for decommissioning are insufficient to pay for all reasonable and prudent decommissioning costs, the CPUC must authorize the electric utility to collect these charges from its customers.\nFor costs related to AROs, see “Asset Retirement Obligations” in Note 2 of the Notes to the Consolidated Financial Statements in Item 8.\nHuman Capital\nEmployees and Contractors\nAs of December 31, 2024, PG&E Corporation had 10 employees and the Utility had approximately 28,400 regular employees.  Of the Utility’s regular employees, approximately 17,600 are covered by collective bargaining agreements with the local chapters of three labor unions: the International Brotherhood of Electrical Workers (“IBEW”) Local 1245; the Engineers and Scientists of California (“ESC”) IFPTE 20; and the Service Employees International Union Local 24/7 (“SEIU”).  The collective bargaining agreements in effect for the IBEW Local 1245, ESC Local 20, and SEIU United Service Workers West, are set to expire on December 31, 2025.  The agreements increase wages annually by 3.75% from 2022 through 2025 and maintain current contributions to specified benefits.  The IBEW, ESC, and SEIU represent approximately 62% of the Utility’s employee workforce and support several areas of the Utility’s business, including gas and electric operations.  The Utility enjoys stable and productive relationships with its unions and did not experience any work stoppages in 2024.\n24\nPG&E Corporation’s employees are primarily at the executive management level.  The Utility generally has a stable workforce.  The Utility’s turnover rate for each of 2024 and 2023 was 4.0%.  Approximately 44% of PG&E Corporation’s and the Utility’s employees have a tenure of more than 10 years, with an average tenure of 11 years.  Approximately 18% of PG&E Corporation’s and the Utility’s employees are eligible to retire.  (PG&E Corporation and the Utility define retirement age as 55 years and older.)\nThe Utility’s contractors and subcontractors include approximately 35,000 individuals from approximately 1,200 contractor companies.\nHuman Capital Management\nPG&E Corporation’s and the Utility’s human capital resource objectives are to build and retain an engaged, well trained, diverse, and equitable workforce.  PG&E Corporation’s and the Utility’s Boards of Directors are responsible for overseeing management’s development and execution of PG&E Corporation’s and the Utility’s human capital strategy.\nTo build employee engagement, the Utility has a variety of both executive-level and employee-led initiatives and programs.  PG&E Corporation’s and the Utility’s executive teams meet regularly to discuss and evaluate the state of employee talent, determine which programs are driving engagement and performance, and clarify the specific skills, behaviors, and virtues that should be cultivated.  Each year, the Utility honors employees whose work embodies safety, diversity, equity, inclusion, belonging, environmental leadership, innovation, and community service.  The Utility conducts an annual employee survey to measure and improve employee engagement.\nEvery year, PG&E Corporation and the Utility offer or require technical, leadership, and employee training, which includes a range of technical training for employees on the knowledge and skills required to perform their jobs safely using approved tools and work procedures.  In addition, employees are required to complete annual compliance and ethics training and a Code of Conduct training, both of which are intended to promote a culture in which employees are encouraged to speak up with any concerns or ideas for continuous improvement.  In addition, the Utility offers a variety of other trainings and education opportunities.  The Utility continues its expanded training for supervisors.\nAmong other programs, the Utility provides career opportunities through its PowerPathway™ workforce development program.  Launched in 2008, PowerPathway is a workforce development model to enlarge the talent pool of local, qualified, diverse candidates for skilled craft and utility industry jobs through training program partnerships with educational, community-based and government organizations.  PowerPathway helps people throughout the Utility’s service area, including women and military veterans, prepare and compete for high demand jobs in the utility and energy industry.  Students receive approximately eight weeks of industry-informed curriculum to ensure the academic, job specific, employability skills and physical training necessary to effectively compete for entry-level employment.  Programs may also include hands-on training and on-the-job training.\nPG&E Corporation and the Utility also provide integrated solutions and programs for employee health and wellness that encompass physical, mental, and financial health.  These resources include several on-site or near-site health clinics, annual health screenings, health management tools, ergonomic support, and injury management programs, in addition to more traditional programs.\nPG&E Corporation’s and the Utility’s financial incentives offered to employees include a Short-Term Incentive Plan (“STIP”), an at-risk part of employee compensation designed to reward eligible employees for achieving specific performance goals.  The 2024 STIP was focused on company objectives of safety, customer impact, and financial health.\nAll executive officer compensation is paid by PG&E Corporation.\n25\nSafety\nThe Utility’s strategy to deliver on safety outcomes focuses on employee, contractor, and public safety.  Identifying, eliminating and mitigating high-energy hazards remains a priority.  The Utility’s safety metrics include the number of actual serious incidents or fatalities (“SIF-A”) and high-energy events that could have resulted in a serious injury or fatality (“SIF-P”) where SIF-P rate measures events that could have resulted in a SIF-A per 200,000 hours worked.  In 2024, the Utility had seven SIF-A incidents, which resulted in zero fatalities and seven serious injuries, and a SIF-P rate of 0.05.  Additionally, the Utility measures DART (days away, restricted or transferred duty per 200,000 hours worked).  In 2024, the Utility’s DART was 0.7.  In particular, the Utility improved safety through the implementation of the Utility’s safety excellence management system and a focus on essential controls for high energy hazards. \nDiversity, Equity, Inclusion, and Belonging\nPG&E Corporation’s and the Utility’s goal is to foster a diverse, equitable, and inclusive workforce culture where all employees find it enjoyable to work with and for PG&E Corporation and the Utility and feel they belong.  These efforts are led by PG&E Corporation’s and the Utility’s Executive Vice President, Chief People Officer, in partnership with the executive team.  The People and Compensation Committee of PG&E Corporation’s Board of Directors reviews the companies’ diversity, equity, inclusion, and belonging strategy, practices, and performance.\nKey elements of PG&E Corporation’s and the Utility’s approach to diversity, equity, inclusion, and belonging include integrating inclusion and belonging into the employee experience with a focus on equity and interrupting bias in hiring, promotion, retention and compensation, heightened cultural awareness programming to encourage understanding and importance of inclusion and belonging, and integrating useful content into training, development, and performance support resources.\nAdditionally, the Utility’s 12 Employee Resource Groups and three Engineering Network Groups execute enterprise-wide employee programming, nominated employees lead efforts within their departments, and across the companies.  Specialized teams facilitate awareness, education and dialogue and support the groups at the enterprise level.\nIn 2024, women, minorities, and military veterans accounted for approximately 26%, 50%, and 7%, respectively, of total PG&E Corporation and Utility employees.  The Utility’s employees represent five generations, most of whom are Millennials (49%), Generation X (37%), and Boomers (10%).  Generational data refers to “Millennials” for individuals born between 1981 and 1996, “Generation X” between 1965 and 1980, and “Boomers” between 1946 and 1964.  \nElectric Utility Operations\nThe Utility generates electricity and provides electric transmission and distribution services throughout its service area in northern and central California to residential, commercial, industrial, and agricultural customers.  The Utility provides electricity, transmission, and distribution services in its service area.  Customers also can obtain electricity from alternative providers such as municipalities or CCAs, as well as from self-generation resources, such as rooftop solar installations.  For more information, see “Competition” below.\nElectricity Resources\nThe Utility is required to maintain adequate capacity to meet its customers’ demand for electricity (“load”), including peak demand and planning and operating reserves, deliverable to the locations and at times as may be necessary to provide reliable electric service.  The Utility is responsible for scheduling and bidding electric generation resources, including certain electricity procured from third parties into the wholesale market, to meet customer demand.\nThe following table shows the percentage of the Utility’s estimated total net deliveries of electricity to retail customers in 2024 represented by each major electric resource, and further discussed below.  The Utility’s deliveries were primarily from renewable energy resources that qualify under California’s RPS and other GHG-free resources (i.e., nuclear, and large hydroelectric generation).  California’s RPS requirements and SB 100 goal is to serve 100% of retail electricity sales with GHG-free resources by 2045.  For more information about California’s RPS requirements and clean energy goals, see further below and in the “Sustainability and Resiliency” section below.\n26\nThe total estimated electricity generated, procured, and sold (net), for the year ended December 31, 2024 was 26,737 GWh\n (1) \nand comprised of the following:\nPercent of customer retail sales (estimated procurement)\nCEC reporting methodology adjustment\n(2)\n \nPercent of customer retail sales (estimated Power Content Label)\n (2)\nOwned generation facilities\nRenewable\n (3)\n1 \n%\n— \n%\n1 \n%\nNuclear \n(7)\n63 \n%\n— \n%\n63 \n%\nLarge hydroelectric\n12 \n%\n— \n%\n12 \n%\nFossil fuel-fired\n (4)\n23 \n%\n(22)\n%\n1 \n%\n  Total\n99\n \n%\n(22)\n%\n77\n \n%\nThird-party purchase agreements\nRenewable\n (3)\n22 \n%\n— \n%\n22 \n%\nFossil fuel-fired\n (4)\n11 \n%\n(10)\n%\n1 \n%\nTotal\n33\n \n%\n(10)\n%\n23\n \n%\nOthers, net\n (2)(5)\n(32)\n%\n32\n \n%\n—\n \n%\nTOTAL\n100\n \n%\n—\n \n%\n100\n \n%\nTotal renewable energy resources\n (3)\n23\n \n%\n—\n \n%\n23\n \n%\nGHG-free resources\n (6)\n98\n \n%\n—\n \n%\n98\n \n%\n(1) \nThis amount excludes electricity provided by DA providers and CCAs that procure their own supplies of electricity for their respective customers.\n(2) \nThe allocation of “Others, net” in the “CEC Reporting Methodology Adjustment” and “Power Content Label” columns is consistent with current CEC guidelines as an adjustment mechanism to apply, as specified.  Total reported generation and procurement volumes equate to actual electric retail sales.\n(3) \nAmounts include biopower (e.g., biogas, biomass), solar, wind, certain hydroelectric (i.e., 30MW or less), and geothermal facilities.  The eligible renewable percentages above do not reflect RPS compliance, which is determined using a different methodology.\n(4) \nAmounts consist primarily of natural gas facilities.\n(5) \nAmount is mainly comprised of net CAISO open market (sales)/purchases.\n(6) \nAmount is comprised of renewable, nuclear, and large hydroelectric facility resources generated, procured, and sold.\n(7) \nAmount includes adjustments due to DCPP’s extended operations, consistent with CPUC and CEC guidelines.\nRenewable Energy Resources\nCalifornia law established an RPS that requires LSEs, such as the Utility, to gradually increase the amount of renewable energy they deliver to their customers.  See “Sustainability and Resiliency” below.  The Utility may in the future incur additional costs to procure renewable energy to meet the new renewable energy targets.  The Utility expects that these costs will continue to be recoverable through rates as “pass-through” costs.  The Utility also may be subject to penalties for failure to meet the higher targets.\nRenewable generation resources, for purposes of the RPS requirements, include bioenergy such as biogas and biomass, certain hydroelectric facilities (30 MW or less), wind, solar, and geothermal energy.  RPS requirements are based on procurement, which aligns with the methodology presented in the first column of the table above.  Procurement from renewable energy sources was estimated to comprise 23% of total annual retail sales in 2024.  Per the Power Content Label methodology based on current CEC guidelines presented in the table above, an estimated 23% of the Utility’s energy deliveries were from renewable energy sources in 2024. \n27\nThe estimated total renewable deliveries for the year ended December 31, 2024, shown above was 5,920 GWh and comprised of the following:\nType\nPercent of Customer Retail Sales (estimated procurement)\n(1)\n \nBiopower\n3 \n%\nGeothermal\n— \n%\nRPS-Eligible Small Hydroelectric\n2 \n%\nSolar\n15 \n%\nWind\n3 \n%\nTotal\n23\n \n%\n(1) \nEstimated renewable procurement percentages above and renewable compliance percentages are expected to be consistent; however, final RPS compliance reporting is subject to a different methodology and may result in differences between the two percentages.\nEnergy Storage\nEnergy storage improves system reliability and supports California’s decarbonization goals by integrating increased levels of renewable energy.  The CPUC has established a multi-year energy storage procurement framework, under which the Utility met its requirements to make 580 MW of qualifying storage capacity operational by 2024. \nAs of December 31, 2024, the Utility owned 183 MW and has contracted for another 2,435 MW of operational energy storage capacity.  The Utility has also procured 2,168 MW of battery energy storage to be deployed over the next several years and is working to procure additional battery energy storage to meet its remaining reliability requirements.  Separately, the Utility is soliciting long-duration storage, which is storage with at least eight hours of discharge capacity, to have these resources online between 2028 and 2031.  In order to address both its bundled portfolio need and to help to meet state planning and policy objectives to increase long-duration storage capacity, the Utility is pursuing regulatory approval to increase the nameplate generating capacity of its Helms Pumped Storage Facility.\nOwned Generation Facilities \nAt December 31, 2024, the Utility owned the following generation facilities, all located in California, listed by energy source and further described below:\nGeneration Type\nCounty Location\nNumber of Units\nNet Operating Capacity (MW)\nNuclear \n(1)\n: \n  Diablo Canyon\nSan Luis Obispo\n2 \n2,240 \nHydroelectric \n(2)\n: \n  Conventional\n16 counties in northern and central California\n91 \n2,628 \n  Helms pumped storage\nFresno\n3 \n1,212 \nFossil fuel-fired: \n  Colusa Generating Station\nColusa\n1 \n657 \n  Gateway Generating Station \nContra Costa\n1 \n580 \n  Humboldt Bay Generating Station\nHumboldt\n10 \n163 \nElkhorn Battery Energy Storage System\nMonterey County\n1 \n183 \nPhotovoltaic \n(3)\n:\nVarious\n12 \n152 \nTotal\n121\n \n7,815\n \n(1) \nThe Utility’s DCPP consists of two nuclear power reactor units, Units 1 and 2.  The NRC operating license for Unit 1 expired in 2024.  Unit 2 will expire in 2025.  Both remain in effect pending completion of the ongoing federal relicensing review.  For more information, see “Extension of Diablo Canyon Operations” in Item 7. MD&A below.\n(2) \nThe Utility’s hydroelectric system consists of 94 generating units at 58 powerhouses.  All of the Utility’s powerhouses are licensed by the FERC (except for one small powerhouse not subject to the FERC’s licensing requirements), with license terms between 30 and 50 years.\n(3) \nThe Utility’s large photovoltaic facilities are Cantua solar station (20 MW), Five Points solar station (15 MW), Gates solar station (20 MW), Giffen solar station (10 MW), Guernsey solar station (20 MW), Huron solar station (20 MW), Stroud solar station (20 MW), West Gates solar station (10 MW), and Westside solar station (15 MW).  All of these facilities are located in Fresno County, except for Guernsey solar station, which is located in Kings County.\n28\nGeneration Resources from Third Parties\nThe Utility has entered into various agreements to purchase power and electric capacity, including agreements for renewable energy resources, in accordance with its CPUC-approved procurement plan.  See “Ratemaking Mechanisms” above.  For more information regarding the Utility’s power purchase agreements, see Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nElectricity Transmission\nTransmission lines deliver electricity at high voltages and over long distances from power sources to transmission substations closer to customers.  A strong transmission system supports reliable and affordable service, ability to meet state energy policy goals, and support for a diverse generation mix, including renewable energy.\nAs of December 31, 2024, the Utility owned approximately 18,000 circuit miles of interconnected transmission lines operating at voltages ranging from 60 kV to 500 kV.  The Utility also operated 33 electric transmission substations with a capacity of approximately 67,000 MVA.  The Utility’s electric transmission system is interconnected with electric power systems in the Western Electricity Coordinating Council, which includes many western states, the Canadian provinces of Alberta and British Columbia, and parts of Mexico.\nDecisions about expansions and maintenance of the transmission system can be influenced by decisions of the Utility’s regulators and the CAISO.\nElectricity Distribution\nDistribution lines allow electricity to travel at lower voltages from substations directly to customers.  The Utility’s electric distribution network consists of approximately 108,000 circuit miles of distribution lines (of which, as of December 31, 2024, approximately 27% are underground and approximately 73% are overhead), 59 transmission and distribution substations, and 603 distribution substations with a capacity of approximately 33,000 MVA.  The Utility’s distribution network interconnects with its transmission system, primarily at switching and distribution substations, where equipment reduces the high-voltage transmission voltages to lower voltages, suitable for distribution to the Utility’s customers.\nThese distribution substations serve as the central hubs for the Utility’s electric distribution network.  Emanating from each substation are primary and secondary distribution lines connected to local transformers and switching equipment that link distribution lines and provide delivery to customers.  In some cases, third parties, such as municipal and other utilities, who generate or procure their own power rely upon the Utility’s distribution facilities to deliver their power to them, so that they are able to resell the electricity.  The Utility operates electric distribution control center facilities in Concord, Rocklin, and Fresno, California; these control centers form a key part of the Utility’s efforts to create a smarter, more resilient grid.\n29\nElectricity Operating Statistics\nThe following table shows certain of the Utility’s operating statistics from 2022 to 2024 for electricity sold or delivered, including the classification of revenues by type of service.  No single customer of the Utility accounted for 10% or more of consolidated revenues for electricity sold in 2024, 2023, or 2022.\n2024\n2023\n2022\nCustomers (average for the year)\n5,606,873 \n5,584,185 \n5,562,223 \nDeliveries (in GWh)\n (1) \n74,111 \n72,933 \n77,769 \nRevenues (in millions): \n   Residential\n$\n7,504 \n$\n6,041 \n$\n6,130 \n   Commercial\n7,201 \n5,643 \n5,416 \n   Industrial\n2,065 \n1,784 \n1,626 \n   Agricultural\n1,815 \n1,413 \n1,830 \n   Public street and highway lighting\n103 \n83 \n77 \n   Other, net\n (2)\n(47)\n136 \n(247)\n      Subtotal\n18,641 \n15,100 \n14,832 \nRegulatory balancing accounts\n (3)\n(830)\n2,324 \n228 \nTotal operating revenues\n$\n17,811\n \n$\n17,424\n \n$\n15,060\n \nSelected Statistics:\nAverage annual residential usage (kWh)\n5,261 \n5,217 \n5,564 \nAverage billed revenues per kWh: \nResidential\n$\n0.2888 \n$\n0.2356 \n$\n0.2253 \nCommercial\n0.2528 \n0.2007 \n0.1896 \nIndustrial\n0.1475 \n0.1294 \n0.1177 \nAgricultural\n0.3597 \n0.2984 \n0.2435 \nNet plant investment per customer\n$\n11,460 \n$\n10,720 \n$\n9,967 \n(1) \nThese amounts include electricity provided by DA providers and CCAs that procure their own supplies of electricity for their respective customers.\n(2) \nThis activity is primarily related to the change in unbilled revenue and amounts subject to refund, partially offset by other miscellaneous revenue items.\n(3)\n These amounts represent revenues authorized to be billed.\nNatural Gas Utility Operations \nThe Utility provides natural gas transportation services to “core” customers (i.e., small commercial and residential customers) and to “non-core” customers (i.e., industrial, large commercial, and natural gas-fired electric generation facilities) that are connected to the Utility’s gas system in its service area.  Core customers can purchase natural gas procurement service (i.e.\n,\n natural gas supply) from either the Utility or non-utility third-party gas procurement service providers (referred to as “core transport agents”).  When core customers purchase gas supply from a core transport agent, the Utility continues to provide gas delivery, metering, and billing services to customers.  When the Utility provides both transportation and procurement services, the Utility refers to the combined service as “bundled” natural gas service.  More than 97% of core customers, representing approximately 85% of the annual core market demand, receive bundled natural gas service from the Utility.\nThe Utility generally does not provide procurement service to non-core customers, which must purchase their gas supplies from third-party suppliers, unless the customer is a natural gas-fired generation facility with which the Utility has a power purchase agreement that includes its generation fuel expense.  The Utility offers backbone gas transmission, gas delivery (local transmission and distribution), and gas storage services as separate and distinct services to its non-core customers.  Access to the Utility’s backbone gas transmission system is available for all natural gas marketers and shippers, as well as non-core customers.  The Utility also delivers gas to off-system customers (i.e., outside of the Utility’s service area) and to third-party natural gas storage customers.\n30\nNatural Gas Supplies\nThe Utility can receive natural gas from all the major natural gas basins in western North America, including basins in western Canada, the Rocky Mountains, and the southwestern United States.  The Utility can also receive natural gas from fields in California.  The Utility purchases natural gas to serve its core customers directly from producers and marketers in both Canada and the United States.  The contract lengths and natural gas sources of the Utility’s portfolio of natural gas purchase contracts have varied generally based on market conditions.  During 2024, the Utility purchased approximately 287,000 MMcf of natural gas (net of the sale of excess supply of gas).  Substantially all of this natural gas was purchased under contracts with a term of one year or less.  The Utility’s largest individual supplier represented approximately 50% of the total natural gas volume the Utility purchased during 2024.\nNatural Gas System Assets\nThe Utility owns and operates an integrated natural gas transmission, storage, and distribution system that includes most of northern and central California.  On December 31, 2024, the Utility’s natural gas system consisted of approximately 45,200 miles of distribution pipelines, approximately 5,700 miles of backbone and local transmission pipelines, and various storage facilities.  The Utility owns and operates eight natural gas compressor stations on its backbone transmission system and one compressor station on its local transmission system that are used to move gas through the Utility’s pipelines.  The Utility’s backbone transmission system is used to transport gas from the Utility’s interconnection with interstate pipelines, other local distribution companies, and California gas fields to the Utility’s local transmission and distribution systems.\nThe Utility has firm transportation agreements for the transportation of natural gas from various natural gas supply points and interconnection points to the Utility’s natural gas transportation system.  These agreements provide transportation service from western Canada to the United States-Canada border, from the United States-Canada border to an interconnection point with the Utility’s natural gas transportation system at the Oregon-California border, from the U.S. Rocky Mountains to an interconnection point with the Utility’s natural gas transportation system at the Oregon-California border, and from supply points in the southwestern United States to interconnection points with the Utility’s natural gas transportation system in the area of California near Topock, Arizona.  (For more information regarding the Utility’s natural gas transportation agreements, see Note 15 of the Notes to the Consolidated Financial Statements in Item 8.)\nThe Utility owns and operates three underground natural gas storage fields and has a 25% interest in a fourth storage field, all of which are connected to the Utility’s gas transmission system.  In 2019, the CPUC approved the discontinuation, through closure or sale, of operations at two of the Utility’s owned and operated gas storage fields, Pleasant Creek and Los Medanos.  The sale of Pleasant Creek is currently pending CPUC review and approval and the Utility anticipates to close on the sale in 2025.  The Utility continues to operate and rely on the Los Medanos storage field as filed and approved in the 2023 GRC.  The Utility owns and operates compressors and other facilities at these storage fields that are used to inject gas into the fields for storage and later for withdrawal.  In addition, four independent storage operators are interconnected to the Utility’s Northern California gas transmission system.\nIn 2024, the Utility continued upgrading transmission pipelines to allow for the use of in-line inspection tools.\n31\nNatural Gas Operating Statistics\nThe following table shows the Utility’s operating statistics from 2022 through 2024 (excluding subsidiaries) for natural gas, including the classification of revenues by type of service.  No single customer of the Utility accounted for 10% or more of consolidated revenues for bundled gas sales in 2024, 2023 or 2022.\n2024\n2023\n2022\nCustomers (average for the year)\n (1)\n4,614,080 \n4,605,628 \n4,585,126 \nGas purchased (MMcf)\n219,758 \n239,756 \n227,128 \nAverage price of natural gas purchased (price per Mcf)\n$\n1.99 \n$\n6.91 \n$\n7.42 \nBundled gas sales (MMcf): \n  Residential\n146,842 \n171,889 \n160,449 \n  Commercial\n55,174 \n60,248 \n57,066 \nTotal Bundled Gas Sales\n202,016\n \n232,137\n \n217,515\n \nRevenues (in millions): \nBundled gas sales: \n  Residential\n$\n3,089 \n$\n3,686 \n$\n3,353 \n  Commercial\n984 \n1,052 \n1,005 \n  Other\n159 \n(145)\n163 \nBundled gas revenues\n4,232 \n4,593 \n4,521 \nTransportation service only revenue\n1,815 \n1,603 \n1,534 \n      Subtotal\n6,047 \n6,196 \n6,055 \n  Regulatory balancing accounts\n (2)\n561 \n808 \n565 \nTotal operating revenues\n$\n6,608\n \n$\n7,004\n \n$\n6,620\n \nSelected Statistics: \nAverage annual residential usage (Mcf)\n37 \n37 \n37 \nAverage billed bundled gas sales revenues per Mcf: \n  Residential\n$\n20.74 \n$\n20.73 \n$\n20.22 \n  Commercial\n16.28 \n14.99 \n15.19 \nNet plant investment per customer\n$\n5,019 \n$\n4,749 \n$\n4,522 \n(1) \nThese amounts include natural gas provided by core transport agents and CCAs that procure their own supplies of natural gas for their respective customers.\n(2)\n These amounts represent revenues authorized to be billed.\nNuclear Operations\nThe Utility manages its scheduled refueling outages with the objective of minimizing their duration and maintaining high nuclear generating capacity factors, resulting in a stable generation base for the Utility’s wholesale and retail power marketing activities.  During scheduled refueling outages, the Utility performs maintenance and equipment upgrades to minimize the occurrence of unplanned outages and to maintain safe, reliable operations.  For the year ended December 31, 2024, DCPP achieved an average capacity factor of 93%.  Capacity factors, which are significantly affected by the number and duration of refueling and non-refueling outages, reflect the availability of DCPP’s generation to the California electricity market and impact the Utility’s performance-based disbursements.  For more information, see “Extension of Diablo Canyon Operations” below.  Management analyzes capacity factors by comparing DCPP’s actual generation to forecasted annual capacity factors, which reflect planned refueling outages, curtailments for condenser cleaning, allowances for minor curtailments resulting from equipment issues, and curtailments for major ocean storms.\nIn addition to the maintenance and equipment upgrades performed by the Utility during scheduled refueling outages, the Utility has extensive operating and security procedures in place to assure the safe operation of DCPP.  The Utility also has extensive safety systems in place designed to protect the plant, personnel, and surrounding area in the unlikely event of an accident or other incident.\n32\nCompetition\nTrends in Market Demand and Competitive Conditions in the Electricity Industry\nThe Utility expects customer electric load to increase in coming years primarily as a result of electric vehicle adoption, data centers, and building electrification.  The Utility is not able to predict how quickly this electrification will occur.  The Utility expects customer demand for gas to decrease in the coming years, primarily in response to policies supporting California’s climate goals.\nCalifornia law allows qualifying non-residential electric customers of IOUs to purchase electricity from energy service providers rather than from the utilities up to certain annual limits specified for each utility.  This arrangement is known as DA.  In addition, California law permits cities, counties, and certain other public agencies that have qualified to become a CCA to generate or purchase electricity for their local residents and businesses.  By law, a CCA can procure electricity for all of its residents and businesses that do not affirmatively elect to continue to receive electricity generated or procured by a utility.\nThe Utility continues to provide transmission, distribution, metering, and billing services to DA customers at the election of their energy service provider.  The CCA customers continue to obtain transmission, distribution, metering, and billing services from the Utility.  In addition to collecting charges for transmission, distribution, metering, and billing services that it provides, the Utility is able to collect charges intended to recover the generation-related costs that the Utility incurred on behalf of DA and CCA customers while they were the Utility’s customers.  The Utility remains the electricity provider of last resort for these customers.  Section 387 of the Public Utilities Code allows for a request to transfer the responsibilities of the provider of last resort obligation from IOUs to other entities.  \nThe Utility is also impacted by an increasing quantity of distributed generation and energy storage.  The levels of self-generation of electricity by customers (primarily solar installations) and customer enrollment in NEM, which allows self-generating customers employing qualifying renewable resources to receive bill credits at the full retail rate, put upward rate pressure on non-NEM customers.  The successor to the NEM tariffs, the NBT provides bill credits at a lower rate, which reduces the level of upward rate pressure on non-NEM or non-NBT customers, but does not eliminate the upward rate pressure.  NEM and NBT customers are required to pay an interconnection fee, utilize time of use rates, and pay certain non-bypassable charges to help fund some of the costs of low income, energy efficiency, and other programs that other customers pay.  Significantly higher bills for non-NEM or non-NBT customers may result in a decline of the number of such customers as they may seek alternative energy providers or adopt self-generation technologies.  See “Concerns about high rates for the Utility’s customers could negatively impact PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows” in Item 1A. Risk Factors and “Regulatory Matters - Order Instituting Rulemaking (“OIR”) to Revisit Net Energy Metering Tariffs” in Item 7. MD&A.\nFurther, in some circumstances, governmental entities such as cities and irrigation districts may have authority under the state constitution or state statute to provide retail electric service directly to consumers, in some cases bypassing the Utility’s electric infrastructure entirely.  Those entities may also rely upon FERC open access tariffs and Utility infrastructure to deliver their energy for resale at retail to existing or potential new Utility customers.  These entities may also seek to acquire the Utility’s transmission or distribution facilities through eminent domain for use in serving electricity at retail to existing or potential new Utility customers.  As a result, the Utility could lose customers (residential, commercial, and industrial) or experience limited growth in the municipality.  See “Jurisdictions attempt to acquire the Utility’s assets through eminent domain, and third parties attempt to acquire the Utility’s customers by bypassing the Utility’s electric infrastructure system” in Item 1A. Risk Factors.  It is also expected that some publicly-owned utilities will build new or duplicate transmission or distribution facilities to serve existing or potential new Utility customers, bypassing the Utility’s electric infrastructure.  In some instances, microgrid formation is a key factor in a community’s choice to engage governmental entities.  Some private companies have also called for changes in law that could allow those companies to privately serve electricity to retail customers without being regulated by the CPUC as public utilities.  To the extent such changes occur and result in large customers reducing the share of transmission, distribution, and non-bypassable charges they pay, PG&E Corporation’s and the Utility’s financial condition and results of operations could be materially impacted.\nThe effect of such types of retail competition generally is to reduce the number of utility customers, leading to decreased growth or a reduction in the Utility’s rate base.\nThe Utility also competes for the opportunity to develop and construct certain types of electric transmission facilities within, or interconnected to, its service area through a competitive bidding process managed by the CAISO.\nFor risks in connection with increasing competition, see Item 1A. Risk Factors.\n33\nCompetition in the Natural Gas Industry\nThe Utility competes with other natural gas pipeline companies for customers transporting natural gas into the southern California market on the basis of transportation rates, access to competitively priced supplies of natural gas, and the quality and reliability of transportation services.  The Utility also competes for storage services with other third-party storage providers, primarily in Northern California.\nSustainability and Resiliency\nThe impacts of climate change on the Utility’s infrastructure are already a reality.  Record-breaking extreme heat and heat waves are increasingly a regular occurrence throughout California.  In the past few years, the Utility’s electric distribution system has experienced multiple major outage-causing events associated with extreme heat events and peak loads.  Peak loads are expected to increase with increasing temperatures due to direct impacts of ambient temperatures on equipment, increased electricity demand driven by rising air conditioning installation and usage, and continued electrification of transportation and buildings.  Higher temperatures may also impact the condition and performance of electric assets, potentially causing deterioration of assets and operational constraints.\nThe Utility’s assets on the coast and in or near watersheds face potential increased exposures to coastal, riverine, and precipitation related flooding because of climate‑driven changes in precipitation and sea level rise.  The risk of damage to or interruptions of operations at facilities such as substations is predicted to increase over time due to sea level rise.  Electric and gas equipment and safe access for operations must be prepared for these changing conditions.\nChanging precipitation dynamics may impact the Utility’s hydroelectric generation.  Diminishing future water availability and altered runoff timing during extreme drought poses risks to hydropower generation, operations, and revenue.  Also, extreme rain events suggest enhanced risk of hydropower asset damage or failure associated with flooding, which in the worst cases (e.g., uncontrolled water release) may have catastrophic impacts.\nClimate change will also continue to intensify the potential for wildfires throughout California.  Models incorporating future temperature and precipitation projections suggest that landscape susceptibility to wildfire within the Utility’s service area will continue to increase over time, with an expansion of areas that may become HFTD and an intensification of risk within HFTDs.  Climate change may also result in increased potential of equipment to cause ignitions or to require PSPS events, as well as the potential for the Utility’s equipment to sustain damage from wildfires of any origin.\nThe worsening conditions across California increase the likelihood and severity of wildfires, including those in which the Utility’s equipment may be alleged to be associated with the fire’s ignition.  Reducing risk will be even more important as climate change continues to exacerbate the risks facing the Utility.  \nGreenhouse Gas Emissions Regulation\nCalifornia laws and regulations have established the following targets:\n•\nA 40% reduction in GHGs by 2030 compared to 1990 levels.\n•\n50% of retail energy sales to customers from renewable energy sources by 2026 and 60% by 2030.\n•\nEconomy-wide State carbon neutrality by 2045, with net negative emissions thereafter.\n•\nRenewable and zero-carbon resources supplying 90% of utilities’ retail sales to customers by 2035, 95% by 2040, and 100% by 2045.\nThe CARB has also approved GHG emissions reporting and a state-wide, comprehensive cap-and-trade program that sets gradually declining limits (or “caps”) on the amount of GHGs that may be emitted by major GHG emission sources within different sectors of the economy.  The cap-and-trade program has been extended through 2030.  The CARB plans to update the cap-and-trade regulation in 2025 and is considering reforms that would reduce overall allowance budgets to align with CARB’s 2022 Climate Change Scoping Plan.\n34\nDuring each year of the program, the CARB issues emission allowances (i.e., the rights to emit GHGs) equal to the amount of GHG emissions allowed for that year.  Entities with a compliance obligation can obtain allowances from the CARB at quarterly auctions or from third parties or exchanges.  Complying entities may also satisfy a portion of their compliance obligation through the purchase of offset credits (e.g., credits for GHG reductions achieved by third parties, such as landowners, livestock owners, and farmers, that occur outside of the entities’ facilities through CARB-qualified offset projects such as reforestation or methane capture projects).  The Utility expects all costs and revenues associated with the GHG cap-and-trade program to be passed through to customers.\nThe cap-and-trade program applies to the electric generation, large industrial, natural gas, and transportation sectors.  The Utility’s compliance obligation as a natural gas supplier applies to the GHG emissions attributable to the combustion of natural gas delivered to the Utility’s customers other than large natural gas delivery customers that are separately regulated as covered entities and have their own compliance obligations.\nThe federal administration of President Trump has led to uncertainty with regard to what further actions may occur regarding climate change at the federal level.\nMitigating Greenhouse Gas Emissions\nThe Utility works to mitigate the impact of its operations (including customer energy usage) on the environment, consistent with its commitment to clean and resilient energy for all.  See “Emissions Data” below.\nPG&E Corporation’s and the Utility’s 2022 Climate Strategy Report, which is available to the public, describes the companies’ climate goals and plans to meet those goals.  California laws and regulations have also established targets for GHG emissions. See “Greenhouse Gas Emissions Regulation” above. \nThe core elements of the Utility’s plan to achieve these goals are to:\n•\nreduce its operational emissions;\n•\nmaximize electrification where feasible;\n•\nintegrate clean electricity supply and load management solutions;\n•\nmodernize the gas system into an essential low-carbon resource; and\n•\noffset remaining emissions through high-quality carbon removal solutions.\nTo reduce operational emissions, the Utility plans to take steps such as reducing methane leaks from its natural gas system, reducing sulfur hexafluoride emissions from the electric system, and electrifying its vehicles, buildings, and facilities.\nTo maximize electrification, the Utility plans to enable and scale building electrification, supported by building codes and appliance standards that give preference to electric technologies, as well as customers choosing to adopt electric appliances.  The Utility can accelerate customer adoption of electric vehicles by offering customer programs, preparing the grid to accommodate new electric vehicle demand, and partnering with innovators on strategies that reduce the cost of owning an electric vehicle.\nLoad management solutions can increase utilization of the electric infrastructure system, such as by using distributed energy resources more strategically and enabling technologies for customers like bidirectional charging.\nTo integrate clean electricity supply, the Utility plans to continue to expand GHG-free energy resources and storage capacity over the long-term to meet California’s Integrated Resource Planning (“IRP”) GHG emissions reduction targets and California’s clean energy goals.  The Utility expects its GHG-free energy supply to decrease in the near future because, during DCPP’s extended operations, the Utility is required to allocate its GHG-free attributes to certain non-Utility providers.  The Utility also allocates or sells certain GHG-free energy supply to eligible non-Utility providers in its service territory pursuant to CPUC directives.\n35\nModernizing the gas system involves reducing natural gas carbon intensity through clean fuels and decarbonizing hard-to-electrify customers.  Clean renewable fuels such as renewable natural gas, which is derived from organic waste, offers a sustainable alternative to fossil fuel-based gas.  While still early in assessing its potential, the Utility may also blend a safe amount of hydrogen for customers in the future, if authorized.\nThe Utility’s ability to implement this plan depends on many factors, such as customers adopting technologies and behaviors that reduce GHG emissions and supportive federal, state, and local climate policies and programs, including regulatory innovations needed to reduce unnecessary new costs for the energy system.  New and maturing technologies will need to become effective and efficient.  Additionally, the Utility will need to construct infrastructure to serve customer demand and implement load management solutions in a way that is affordable for customers.  This affordable construction depends on PG&E Corporation’s and the Utility’s receiving sufficient funding through their ratemaking applications, dedicating adequate resources, efficiently financing operations, achieving operational cost savings, and benefiting from load growth.\nAdapting to the Physical Impacts of Climate Change\nEffectively managing physical climate risk will become increasingly critical as the physical impacts of climate change become increasingly frequent and severe over the coming years in California.  The Utility’s climate resilience efforts continue to focus on characterizing and mitigating the physical impacts of climate change to the Utility’s infrastructure, assets, and operations.  The Utility is making substantial investments to build a more resilient system that can better withstand extreme weather and related emergencies.  For more information on such investments, see “Performance: Underpinning the Triple Bottom Line” above.\nA key element of preparing the Utility for the physical risks of climate change is a system-wide CAVA of the Utility’s assets, operations, and services, filed with the CPUC in May 2024.  The CAVA improves the Utility’s understanding of its exposure to climate hazards and the sensitivity of assets and operations to these hazards, and provides the basis for necessary climate resilience investments.\nThe Utility is using the CAVA to inform changes to design and construction standards for equipment and facilities, in order to increase infrastructure resilience.  The Utility plans to continue identifying priority adaptive actions by incorporating results from the CAVA into its risk management, planning, and asset management functions.  The Utility works to incorporate into its operations scientific information by reviewing relevant scientific literature and to incorporate customer and community perspectives based on its engagement with CPUC-designated disadvantaged and vulnerable communities in the CAVA process. \nThe Utility’s commitment to increasing resilience to climate change includes aligning its resources and business strategy with California’s clean energy goals, and advocating for policies and programs that enable safe and reliable energy for the Utility’s customers in light of climate change.  For example, the Utility believes its strategies to reduce GHG emissions through a portfolio of customer programs, infrastructure improvements, and the use of renewable energy and energy storage will help it adapt to the expected increases in demand for electricity.\nPG&E Corporation and the Utility are also making progress on transitioning the gas system to cleaner fuels and supporting efforts to accelerate building electrification.  The objective is to do so in an orderly manner to achieve a positive customer and community experience, while reducing natural gas system investments in targeted electrified communities.\nEmissions Data\nPG&E Corporation and the Utility track and report their annual environmental performance results across a broad spectrum of areas.  The Utility reports its GHG emissions to the CARB and the EPA on a mandatory basis.  On a voluntary basis, the Utility reports a more comprehensive emissions inventory to The Climate Registry, a non-profit organization.\nThe following table shows the Utility’s third-party verified voluntary GHG inventory reported to The Climate Registry for 2023, which is the most recent data available.\nPG&E Corporation and the Utility also publish additional GHG emissions data in their annual Corporate Sustainability Report.\nEmissions Scope\nAmount (metric tons CO\n2 \nequivalent)\nScope 1 and 2 emissions \n(1)\n4,026,490 \nScope 3 emissions \n(2)\n39,446,426 \n(1) \nScope 1 emissions are direct emissions from the Utility’s operations and Scope 2 emissions are indirect emissions from facility electricity use and electric line losses.\n36\n(2) \nScope 3 emissions are emissions resulting from downstream value chain activities not owned or controlled by the Utility but that which can be indirectly impacted by the Utility’s actions. The majority of these emissions came from customer natural gas use.\nThe Utility utilized the CEC’s Power Source Disclosure program methodology to calculate the CO\n2\n emissions rate associated with the electricity delivered to retail customers in 2023.  This resulted in a third-party verified CO\n2\n emissions rate of 12 pounds of CO\n2\n per MWh.\nAir Emissions Data for Utility-Owned Generation \nIn addition to GHG emissions data provided above, the table below sets forth information about the air emissions from the Utility’s owned generation facilities.  PG&E Corporation and the Utility also publish air emissions data in their annual Corporate Sustainability Report.\n2023\n2022\nTotal NOx emissions (tons)\n139 \n121 \nNOx emissions rate (pounds/MWh)\n0.01 \n0.01 \nTotal SO\n2 \nemissions (tons)\n13 \n11 \nSO\n2 \nemissions rate (pounds/MWh)\n0.001 \n0.001",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nThis is a combined report of PG&E Corporation and the Utility and includes separate Consolidated Financial Statements for each of these two entities.  This combined MD&A should be read in conjunction with the Consolidated Financial Statements and the Notes to the Consolidated Financial Statements included in Item 8.  \nGenerally, PG&E Corporation’s and the Utility’s revenues vary based on the outcomes of ratemaking proceedings and the amount of pass-through costs incurred.  See “Ratemaking Mechanisms” in Item 1. Description of the Business regarding how the Utility’s revenues are determined.  Factors that cause costs to vary include the cost of purchased power and fuel; the costs of procurement storage, transportation of natural gas; weather; criminal, civil and regulatory charges for wildfires; the outcomes of ratemaking proceedings; and increases in interest expense as a result of additional debt issuances.\nThe discussion related to the results of operations and liquidity for 2023 compared to 2022 is incorporated by reference to Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in PG&E Corporation’s and the Utility’s combined Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC in February 2024.\nKey Factors Affecting Financial Results\nPG&E Corporation and the Utility believe that their financial condition, results of operations, liquidity, and cash flows may be materially affected by the following factors:\n•\nThe Uncertainties in Connection with Wildfires, Wildfire Mitigation, and Associated Cost Recovery.\n  PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows may be materially affected by the costs and effectiveness of the Utility’s wildfire mitigation initiatives; the extent of damages from wildfires that do occur; the financial impacts of wildfires; and PG&E Corporation’s and the Utility’s ability to mitigate those financial impacts with insurance, self-insurance, the Wildfire Fund, and regulatory recovery.\nIn response to the wildfire threat facing California, PG&E Corporation and the Utility have taken aggressive steps to mitigate the threat of catastrophic wildfires.  The Utility’s wildfire mitigation initiatives include EPSS, PSPS, vegetation management, asset inspections, and system hardening (such as undergrounding).  The Utility’s wildfire mitigation efforts have also benefited in recent years from improved ignition response and situational awareness tools like weather stations and risk modeling.  These initiatives have significantly reduced the number of CPUC-reportable ignitions and the number of acres burned from utility-related ignitions.  The success of the Utility’s wildfire mitigation efforts depends on many factors, including whether the Utility can retain or contract for the workforce necessary to execute its wildfire mitigation actions.\n61\nPG&E Corporation and the Utility have incurred and will continue to incur substantial expenditures in connection with these initiatives.  For more information on incurred expenditures, see Note 3 of the Notes to the Consolidated Financial Statements in Item 8.  The extent to which the Utility will be able to recover these expenditures and other potential costs through rates is uncertain.  If additional requirements are imposed that go beyond current expectations, such requirements could have a substantial impact on the costs of the Utility’s wildfire mitigation initiatives.\nThe Utility is subject to a number of legal and regulatory requirements related to its wildfire mitigation efforts, which require periodic inspections of electric assets and ongoing reporting related to this work.  Although the Utility believes that it has complied substantially with these requirements, it continually reviews and has identified instances of noncompliance.  The Utility intends to update the CPUC and the OEIS as its review progresses.  The Utility could face fines, penalties, enforcement action, or other adverse legal or regulatory consequences for noncompliance related to wildfire mitigation efforts. \nDespite these extensive measures, the potential that the Utility’s equipment will be involved in the ignition of future wildfires, including catastrophic wildfires, is significant.  This risk may be attributable to, and exacerbated by, a variety of factors, including climate (in particular, extended periods of seasonal dryness coupled with periods of high wind velocities and other storms), infrastructure, and vegetation conditions.  Once an ignition has occurred, the Utility may be unable to control the extent of damages, which is primarily determined by environmental conditions (including weather and vegetation conditions), third-party suppression efforts, and the location of the wildfire.\nThe financial impact of past wildfires is significant.  As of December 31, 2024, PG&E Corporation and the Utility had recorded aggregate liabilities of $1.225 billion, $1.925 billion, and $100 million for claims in connection with the 2019 Kincade fire, the 2021 Dixie fire, and the 2022 Mosquito fire, respectively, and in each case before available insurance, and, in the case of the 2021 Dixie fire and the 2022 Mosquito fire, other probable cost recoveries.  These liability amounts correspond to the lower end of the range of reasonably estimable probable losses.\nPG&E Corporation and the Utility may be able to mitigate the financial impact of future wildfires in excess of insurance coverage or self-insurance through the Wildfire Fund, or cost recovery through rates.  Each of these mitigations involves uncertainties, and liabilities could exceed available recoveries.  See “Loss Recoveries” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\nAs of December 31, 2024, the Utility has recorded insurance receivables of $430 million for the 2019 Kincade fire, $527 million for the 2021 Dixie fire, and $90 million for the 2022 Mosquito fire.  Recorded liabilities in connection with the 2019 Kincade fire and the 2021 Dixie fire have exceeded potential amounts recoverable under applicable insurance policies. \nIf the eligible claims for liabilities arising from wildfires were to exceed $1.0 billion in any Wildfire Fund coverage year (“Coverage Year”), the Utility may be eligible to make a claim against the Wildfire Fund under AB 1054 for such excess amount.  The Wildfire Fund is available to the Utility to pay eligible claims for liabilities arising from wildfires, provided that the Utility satisfies the conditions to the Utility’s ongoing participation in the Wildfire Fund set forth in AB 1054 and that the Wildfire Fund has sufficient remaining funds.  However, the impact of AB 1054 on PG&E Corporation and the Utility is subject to numerous uncertainties, including the Utility’s ability to demonstrate to the CPUC that wildfire-related costs paid from the Wildfire Fund were just and reasonable and therefore not subject to reimbursement, and whether the benefits of participating in the Wildfire Fund ultimately outweigh its substantial costs.  Finally, recoveries for the 2019 Kincade fire would be subject to a 40% limitation on the allowed amount of claims arising before emergence from bankruptcy.  The Utility has recorded an aggregate Wildfire Fund receivable of $925 million for the 2021 Dixie fire, of which it had received $169 million as of December 31, 2024.  See “Wildfire Fund under AB 1054” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\nThe Utility will be permitted to recover its wildfire-related claims in excess of available insurance and legal fees through rates unless the CPUC or the FERC, as applicable, determines that the Utility has not met the applicable prudency standard.  The revised prudency standard under AB 1054 has not been interpreted or applied by the CPUC, and it is possible that the CPUC could interpret the standard or apply it to the relevant facts differently from how the Utility has interpreted and applied the standard, in which case the Utility may not be able to recover all or a portion of expenses that it has recorded as receivables.  As of December 31, 2024, the Utility has recorded receivables for regulatory recovery of $602 million for the 2021 Dixie fire and $60 million for the 2022 Mosquito fire.  See “2021 Dixie Fire,” and “2022 Mosquito Fire” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8 for more information.\n62\n•\nThe Timing and Outcome of Ratemaking and Other Proceedings. \n Regulatory ratemaking proceedings are a key aspect of the Utility’s business.  The Utility’s revenue requirements consist primarily of a base amount set to enable the Utility to recover its reasonable operating expenses (e.g., maintenance, administrative and general expenses) and capital costs (e.g., depreciation and financing expenses).  The CPUC also authorizes the Utility to collect revenues to recover costs that the Utility is allowed to pass through to customers, including its costs to procure electricity and natural gas for customers and to administer public purpose and customer programs.  Although the Utility generally seeks to recover its recorded costs on a timely basis, in recent years, the amount of the costs recorded in memorandum and balancing accounts has increased.  Other proceedings that could impact the Utility’s business profile and financial results include actions by municipalities and other public entities to acquire the electric assets of the Utility within their respective jurisdictions.  The outcome of regulatory proceedings can be affected by many factors, including intervening parties’ testimonies, potential rate impacts, the regulatory and political environments, and other factors.  See Notes 3 and 15 of the Notes to the Consolidated Financial Statements in Item 8, and “Regulatory Matters” below.\n•\nPG&E Corporation’s and the Utility’s Ability to Control Operating and Financing Costs.\n  Under cost-of-service ratemaking, a utility’s earnings depend on its ability to manage costs within the amounts authorized for recovery in its ratemaking proceedings.  The Utility has set a long-term goal to increase its capital investments to meet safety and climate goals, while also achieving operating cost savings.  The Utility plans to achieve such savings by improving the planning and execution of its work through increased efficiencies, including waste elimination through the Lean operating system.  PG&E Corporation and the Utility also work to minimize financing costs by identifying and executing on opportunities to efficiently finance the business, which depends on capital market conditions.\nFor more information about the risks that could materially affect PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows, or that could cause future results to differ from historical results, see Item 1A. Risk Factors and “Forward-Looking Statements” above for a list of some of the factors that may cause actual results to differ materially.\nTax Matters\nPG&E Corporation had a U.S. federal net operating loss carryforward of approximately $33.7 billion and a California net operating loss carryforward of approximately $34.9 billion as of December 31, 2024.\nUnder Section 382 of the IRC, if a corporation (or a consolidated group) undergoes an “ownership change,” net operating loss carryforwards and other tax attributes may be subject to certain limitations.  In general, an ownership change occurs if the aggregate value of stock ownership of certain shareholders (generally five percent shareholders, applying certain look-through and aggregation rules) increases by more than 50% over such shareholders’ lowest percentage ownership during the testing period (generally three years).  PG&E Corporation’s and the Utility’s Amended and Restated Articles of Incorporation, each filed on June 22, 2020, and for PG&E Corporation, as amended by the Certificate of Amendment of Articles of Incorporation, filed on May 24, 2022 (the “Amended Articles”) contain restrictions on the direct or indirect acquisition or accumulation of PG&E Corporation’s stock.  These restrictions prevent any person or entity (including certain groups of persons) from acquiring or accumulating 4.75% or more of the combined value of PG&E Corporation’s stock, including common stock and mandatory convertible preferred stock prior to the Restriction Release Date (as defined in the Amended Articles) without approval by the Board of Directors of PG&E Corporation.  Shares of PG&E Corporation common stock held directly by the Utility are attributed to PG&E Corporation for income tax purposes and are therefore effectively excluded from the total number of outstanding equity securities when calculating a person’s Percentage Stock Ownership (as defined in the Amended Articles) for purposes of the 4.75% ownership limitation in the Amended Articles.  Accordingly, although PG&E Corporation had 2,671,320,389 common shares outstanding as of February 5, 2025, only 2,193,576,799 common shares (the number of outstanding shares of common stock less the number of shares held directly by the Utility) count as outstanding for purposes of the ownership restrictions in the Amended Articles with the result that the ownership limitation based on the unadjusted outstanding stock of PG&E Corporation is lower than 4.75% and can vary based on the relative value of the common stock and mandatory convertible preferred stock on any particular date.  For example, based on the closing prices of PG&E Corporation’s common stock and preferred stock as of February 5, 2025, a person’s effective Percentage Stock Ownership limitation for purposes of the Amended Articles as of February 5, 2025 was 3.92% of the combined value of PG&E Corporation’s outstanding common and preferred stock.  The computation of the Percentage Stock Ownership is complex, and persons considering purchasing PG&E Corporation’s stock should consult their own tax advisors regarding the application of the ownership restrictions to their particular situation.\nAs of the date of this report, it is more likely than not that PG&E Corporation has not undergone an ownership change, and consequently, its net operating loss carryforwards and other tax attributes are not limited by Section 382 of the IRC.\n63\nRESULTS OF OPERATIONS\nThe following discussion presents PG&E Corporation’s and the Utility’s operating results for 2024 and 2023.  See “Key Factors Affecting Financial Results” above for further discussion about factors that could affect future results of operations.\nPG&E Corporation\nThe consolidated results of operations consist primarily of results related to the Utility, which are discussed in the “Utility” section below.  The following table provides a summary of income (loss) attributable to common shareholders:\n(in millions)\n2024\n2023\nConsolidated Total\n$\n2,475 \n$\n2,242 \nPG&E Corporation\n(223)\n(288)\nUtility\n2,698 \n2,530 \nPG&E Corporation’s net loss primarily consists of interest expense on long-term debt.\nUtility\nThe table below shows the Utility’s Consolidated Statements of Income for 2024 and 2023.  In general, expenses the Utility is authorized to pass through directly to customers (such as costs to purchase electricity and natural gas, as well as costs to fund public purpose programs) and the corresponding amount of revenues collected to recover those pass-through costs do not impact Net income.\nYear Ended December 31,\n(in millions)\n2024\n2023\nElectric operating revenues\n$\n17,811 \n$\n17,424 \nNatural gas operating revenues\n6,608 \n7,004 \nTotal operating revenues\n24,419\n \n24,428\n \nCost of electricity\n2,261 \n2,443 \nCost of natural gas\n1,192 \n1,754 \nOperating and maintenance\n11,787 \n11,913 \nSB 901 securitization charges, net\n33 \n1,267 \nWildfire-related claims, net of recoveries\n94 \n64 \nWildfire Fund expense\n383 \n567 \nDepreciation, amortization, and decommissioning\n4,189 \n3,738 \nTotal operating expenses\n19,939\n \n21,746\n \nOperating income\n4,480\n \n2,682\n \nInterest income\n589 \n593 \nInterest expense \n(2,781)\n(2,485)\nOther income, net\n319 \n293 \nIncome before income taxes\n2,607\n \n1,083\n \nIncome tax benefit\n(105)\n(1,461)\nNet income\n2,712\n \n2,544\n \nPreferred stock dividend requirement\n14 \n14 \nIncome Attributable to Common Stock\n$\n2,698\n \n$\n2,530\n \nOperating Revenues\nThe Utility’s electric and natural gas operating revenues decreased by $9 million, or 0%, in 2024 compared to 2023.  These decreases were primarily due to:\n•\na decrease in revenues to recover the cost of electricity procurement (which decreased by $182 million) and the cost of natural gas (which decreased by $562 million) and the cost of public purpose programs (which decreased by approximately $50 million) in 2024. These costs are passed through to customers and do not impact net income. (See “Cost of Electricity”, “Cost of Natural Gas”, and “Operating and Maintenance” below);\n64\n•\napproximately $585 million in revenues authorized in the 2020 WMCE proceeding in 2023 with no similar amount in 2024;\n•\na decrease of approximately $345 million in revenues to recover insurance costs related to the Utility’s adoption of self-insurance in 2024;\n•\na decrease of approximately $310 million in revenues authorized in the 2021 WMCE proceeding (see “2021 WMCE Application” below); and\n•\na decrease of approximately $230 million in revenues to recover costs associated with a lower allowance for doubtful accounts from residential customers in 2024.  (See Note 3 of the Notes to the Consolidated Financial Statements in Item 8).\nPartially offset by:\n•\napproximately $1.0 billion in increased base revenues authorized in the 2023 GRC;\n•\napproximately $390 million in interim rate relief authorized in the WGSC proceeding (see “Wildfire and Gas Safety Costs Recovery Application” below) in 2024 with no similar amount in 2023;\n•\nan increase of approximately $310 million in revenues authorized through the FERC formula rate;\n•\napproximately $205 million in revenues authorized in the General Office Sale Memorandum Account (“GOSMA”) petition for modification final decision in 2024 with no similar amount in 2023;\n•\napproximately $170 million in interim rate relief authorized in the 2023 WMCE application (see “2023 WMCE Application” below) in 2024 with no similar amount in 2023; and\n•\napproximately $85 million related to the 2021 NDCTP final decision that ordered the Utility to issue a refund of the Non-Qualified Trust to customers in 2023 with no comparable refund in 2024.\nCost of Electricity\nThe Utility’s cost of electricity represents the cost of power and fuel used in the Utility’s generating facilities and purchased from third parties to serve customers. Cost of electricity includes fuel supplied to other third-party generating facilities, costs to comply with California’s cap-and-trade program, realized gains and losses on price risk management activities (see Note 10 of the Notes to the Consolidated Financial Statements in Item 8), and net power purchases from and sales to the CAISO electricity markets and directly from third parties.  The cost of electricity decreased by $182 million in 2024 as compared to 2023.  These decreases were primarily the result of lower natural gas market prices included as fuels costs for applicable Utility or third-party generating facilities, partially offset by lower net CAISO market sales revenues.\nCost of Natural Gas\nThe Utility’s cost of natural gas includes the costs of procurement, storage and transportation of natural gas, costs to comply with California’s cap-and-trade program, and realized gains and losses on price risk management activities.  See Note 10 of the Notes to the Consolidated Financial Statements in Item 8.  The cost of natural gas decreased by $562 million in 2024 as compared to 2023.  These decreases were primarily the result of lower natural gas procurement costs, partially offset by less favorable price risk management results, both of which were due to lower natural gas market prices for the period.\nOperating and Maintenance\nThe Utility’s operating and maintenance expenses decreased by $126 million, or 1%, in 2024 compared to 2023.  These decreases were primarily due to:\n•\nthe recognition of approximately $420 million in previously deferred expenses authorized in the 2020 WMCE proceeding in 2023 with no similar amount in 2024;\n•\na decrease of approximately $345 million in insurance costs related to the Utility’s adoption of self-insurance in 2024;\n65\n•\na decrease of approximately $230 million in costs associated with a lower allowance for doubtful accounts from residential customers in 2024.  (See Note 3 of the Notes to the Consolidated Financial Statements in Item 8);\n•\na decrease of approximately $160 million in previously deferred expenses authorized in the 2021 WMCE proceeding (see “2021 WMCE Application” below) in 2023; and\n•\na decrease of approximately $50 million in pass-through costs related to public purpose programs in 2024. These costs are passed through to customers and do not impact net income (see “Operating Revenues” above).\nPartially offset by:\n•\napproximately $390 million in interim rate relief authorized in the WGSC proceeding (see “Wildfire and Gas Safety Costs Recovery Application” below) in 2024;\n•\napproximately $210 million in costs related to a FERC order denying the capitalization of certain vegetation management costs and ordering the Utility to reclassify these costs to operating expense in 2024; \n•\napproximately $175 million in revenues authorized in the GOSMA petition for modification final decision in 2024 with no similar amount in 2023;\n•\napproximately $170 million in interim rate relief authorized in the 2023 WMCE application (see “2023 WMCE Application” below) in 2024 with no similar amount in 2023;\n•\nthe write-off of approximately $60 million of costs as a result of the CPUC’s final decision denying the Pacific Generation application in 2024; and\n•\nan increase in labor and benefit costs in 2024.\nSB 901 Securitization Charges, Net\nThe Utility’s SB 901 securitization charges, net decreased by $1.23 billion, or 97%, in 2024 compared to 2023.  These decreases were due to the recognition of $1.27 billion in net SB 901 securitization charges, primarily representing the amounts that are refundable to ratepayers as a result of tax benefits realized within income tax expense related to the Fire Victim Trust’s sale of PG&E Corporation common stock in 2023, with no comparable activity in 2024.  For more information, see Note 5 of the Notes to the Consolidated Financial Statements in Item 8 below.\nWildfire-Related Claims, Net of Recoveries\nCosts related to wildfires increased by $30 million, or 47%, in 2024 compared to 2023.  The Utility recognized pre-tax charges of $425 million related to the 2021 Dixie fire offset by probable recoveries through the Wildfire Fund and WEMA and $100 million related to the 2019 Kincade fire in 2023.  The Utility recognized pre-tax charges of $325 million related to the 2021 Dixie fire offset by probable recoveries through the Wildfire Fund and $100 million related to the 2019 Kincade fire in 2024.  Additionally, in 2024, probable WEMA recoveries increased by approximately $30 million due to a reclassification between WEMA and FERC recoveries, which are recorded as a reduction to regulatory liabilities and are not captured in Wildfire-related claims.\nWildfire Fund Expense\nThe Utility’s Wildfire Fund expense decreased by $184 million, or 32%, in 2024 compared to 2023.  These decreases were primarily due to less accelerated amortization of the Wildfire Fund asset and an increase in the estimated period of coverage of the Wildfire Fund from 15 to 20 years.  See Note 2 and Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\n66\nDepreciation, Amortization, and Decommissioning\nThe Utility’s Depreciation, amortization, and decommissioning expenses increased by $451 million, or 12%, in 2024 compared to 2023.  These increases were primarily due to the growth in plant balance from capital additions and an increase in decommissioning expense due to the reversal of approximately $175 million in accrued nuclear decommissioning expense as a result of the 2021 NDCTP final decision in 2023.\nInterest Income\nThere was no material change to Interest income in 2024 compared to 2023.\nInterest Expense\nThe Utility’s Interest expense increased by $296 million, or 12%, in 2024 compared to 2023.  These increases were primarily due to an increase in long-term debt and higher interest rates paid on regulatory balancing accounts.\nOther Income, Net\nThere was no material change to Other income, net in 2024 compared to 2023.\nIncome Tax Benefit\nThe Utility’s Income tax benefit decreased by $1.4 billion, or 93%, in 2024 compared to 2023.  These decreases were primarily due to a decrease in the tax benefit recognized related to the Fire Victim Trust’s sale of PG&E Corporation common stock as well as higher pre-tax income in 2024 compared to 2023.\nThe following table reconciles the income tax expense at the federal statutory rate to the income tax provision:\n2024\n2023\nFederal statutory income tax rate\n21.0 \n%\n21.0 \n%\nIncrease (decrease) in income tax rate resulting from:\nState income tax (net of federal benefit)\n (1)\n(0.8)\n%\n(34.4)\n%\nEffect of regulatory treatment of fixed asset differences\n (2)\n(24.7)\n%\n(40.1)\n%\nTax credits\n(0.7)\n%\n(2.2)\n%\nFire Victim Trust\n (3)\n— \n%\n(80.2)\n%\nOther, net\n1.2 \n%\n1.1 \n%\nEffective tax rate\n(4.0)\n%\n(134.8)\n%\n(1) \nIncludes the effect of state flow-through ratemaking treatment.\n(2) \nIncludes the effect of federal flow-through ratemaking treatment for certain property-related costs. For these temporary tax differences, the Utility recognizes the deferred tax impact in the current period and records offsetting regulatory assets and liabilities. Therefore, the Utility’s effective tax rate is impacted as these differences arise and reverse. The Utility recognizes such differences as regulatory assets or liabilities as it is probable that these amounts will be recovered from or returned to customers in future rates. These amounts also reflect the impact of the amortization of excess deferred tax benefits to be refunded to customers as a result of the TCJA.\n(3)\n Includes the tax effect of the Fire Victim Trust’s sale of PG&E Corporation common stock in 2023.\nLIQUIDITY AND FINANCIAL RESOURCES \nOverview\nPG&E Corporation and the Utility expect to be able to generate and obtain adequate cash to meet their cash requirements in the short term and in the long term. \n67\nPG&E Corporation and the Utility rely on access to debt and equity markets and credit facilities to finance their capital requirements and support their liquidity needs.  The CPUC authorizes the Utility’s capital structure, the aggregate amount of long-term and short-term debt that the Utility may issue, and the revenue requirements the Utility is able to collect to recover its cost of service.  The Utility generally utilizes retained earnings, equity contributions from PG&E Corporation and long-term debt issuances to maintain its CPUC-authorized long-term capital structure consisting of 52% common equity, 47.5% long-term debt, and 0.5% preferred equity and relies on short-term debt, including its revolving credit facilities, to fund temporary financing needs.  The CPUC has granted the Utility a temporary waiver from compliance with its authorized regulatory capital structure until June 2025.  The Utility is on track to comply with its authorized regulatory capital structure when the waiver terminates.\nPG&E Corporation’s ability to fund operations, make scheduled principal and interest payments, fund equity contributions to the Utility, and pay dividends depends on the level of cash on hand, cash received from the Utility, and PG&E Corporation’s access to the capital and credit markets.  Generally, PG&E Corporation and the Utility expect that capital expenditures, debt maturities, and PG&E Corporation capital stock dividends will exceed operating cash flows.  As a result, they expect to finance future cash needs in excess of operating cash flows primarily through the capital and credit markets. \nAdditionally, due to its existing tax attributes, PG&E Corporation does not expect to pay significant federal cash taxes until at least 2029.  In 2024, California enacted a new law to suspend the use of net operating losses and limit the use of business credits for tax years 2024 to 2026.  As a result, PG&E Corporation expects to pay state income taxes in 2025 and 2026.  See “Tax Matters” above and “Inflation Reduction Act” in Legislative and Regulatory Initiatives below for a discussion of events that could limit PG&E Corporation’s ability to use its net operating losses.\nPG&E Corporation and the Utility have various contractual commitments which impact cash requirements.  These commitments are discussed in “Purchase Commitments” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nAs of December 31, 2024, PG&E Corporation and the Utility had access to approximately $6.7 billion of total liquidity comprised of $705 million of the Utility’s Cash and cash equivalents, $235 million of PG&E Corporation’s Cash and cash equivalents and $5.8 billion of availability under PG&E Corporation’s and the Utility’s revolving credit facilities.\nCredit Ratings\nCredit ratings impact the cost and availability of short-term borrowings, including credit facilities, and long-term debt costs.  In addition, some of the Utility’s commodity contracts contain collateral posting provisions tied to the Utility’s credit rating from each of the major credit rating agencies.  Contracts which may require collateral postings include the Utility's power and natural gas commodity, transportation, services, and environmental products agreements.  Because the Utility’s credit rating remains below investment grade, the Utility generally does not receive unsecured credit from its energy procurement counterparties and it may be required to increase its collateral postings if its credit rating is downgraded.\nRestrictive Debt Covenants\nPG&E Corporation’s and the Utility’s credit agreements and the DOE Loan Guarantee Agreement contain various restrictive financial covenants, including a financial covenant requiring PG&E Corporation and the Utility to maintain a total consolidated debt to total consolidated capitalization ratio of no more than 70% and 65% for PG&E Corporation and the Utility, respectively, as of the end of each fiscal quarter.\nThe failure to comply with the financial covenants contained in these financing arrangements could result in an event of default and the acceleration of the loans under the financing arrangements.  PG&E Corporation’s and the Utility’s various credit agreements and the DOE Loan Guarantee Agreement contain provisions that may result in an event of default if there was a failure to meet payment terms or observe other covenants under other financing arrangements that could result in an acceleration of payments due.  Such provisions are referred to as “cross-default” provisions.  As of December 31, 2024, PG&E Corporation and the Utility remain in compliance with all financial covenants.\n68\nCash, Cash Equivalents, Restricted Cash, and Restricted Cash Equivalents\nCash and cash equivalents consist of cash and short-term, highly liquid investments with original maturities of three months or less.  PG&E Corporation and the Utility maintain separate bank accounts and primarily invest their cash in money market funds.  In addition to Cash and cash equivalents, the Utility holds Restricted cash and restricted cash equivalents that primarily consist of AB 1054 and SB 901 fixed recovery charge collections that are to be used to service the associated bonds.  As of December 31, 2024, PG&E Corporation and the Utility had Cash and cash equivalents of $235 million and $705 million, respectively.  \nAs of December 31, 2024, the Utility had contributed $911 million to Pacific Energy Risk Solutions, LLC, its wholly-owned subsidiary and captive insurance company for the administration of wildfire liability self-insurance.  As of December 31, 2024,  $8 million was classified as Restricted cash and restricted cash equivalents due to minimum capital and surplus requirements, and $905 million, measured at fair value, was classified as Wildfire self-insurance asset.  For more information about wildfire liability self-insurance, see “Self-Insurance” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\nFinancial Resources\nEquity Financings\nCommon Stock Offering\nOn December 4, 2024, PG&E Corporation issued 55,961,070 shares of its common stock, no par value, for cash proceeds of $1.13 billion.\n \nThe proceeds from this issuance are intended to be used for general corporate purposes, which may include, among other things, to fund its five-year capital investment plan.\nFor more information, see Note 6 of the Notes to the Consolidated Financial Statements in Item 8.\nSeries A Mandatory Convertible Preferred Stock\nOn December 5, 2024, PG&E Corporation issued $1.6 billion of 6.000% Series A Mandatory Convertible Preferred Stock, no par value, with a dividend rate of 6.000% per annum on the liquidation preference of $50 per share (the “Mandatory Convertible Preferred Stock”) due December 2027.  The Mandatory Convertible Preferred Stock dividend is payable on March 1, June 1, September 1, and December 1 of each year.  The Mandatory Convertible Preferred Stock ranks senior to PG&E Corporation’s common stock with respect to the payment of dividends.  The proceeds from this issuance are intended to be used for general corporate purposes which may include, among other things, to fund its five-year capital investment plan\n.\n \nFor more information, see Note 7 of the Notes to the Consolidated Financial Statements in Item 8. \nFactors that could affect PG&E Corporation’s planned equity issuances include liquidity and cash flow needs, capital expenditures, interest rates, its share price, its earnings, the timing and outcome of ratemaking proceedings, and the timing and terms of other financings.  \nDebt Financings\nUtility\nThe Utility generally issues first mortgage bonds and secured debt to meet its long-term funding requirements.\nOn February 28, 2024, the Utility completed the sale of (i) $850 million aggregate principal amount of 5.550% First Mortgage Bonds due 2029, (ii) $1.1 billion aggregate principal amount of 5.800% First Mortgage Bonds due 2034 and (iii) $300 million aggregate principal amount of 6.750% First Mortgage Bonds due 2053.  The Utility used the net proceeds for the repayment of borrowings outstanding under the Utility’s revolving credit facility pursuant to the Utility Revolving Credit Agreement. \nOn September 5, 2024, the Utility completed the sale of (i) $1.0 billion aggregate principal amount of Floating Rate First Mortgage Bonds due 2025 and (ii) $750 million aggregate principal amount of 5.900% First Mortgage Bonds due 2054.  The Utility used the net proceeds for the repayment of a portion of borrowings outstanding under its then-existing bridge term loan credit agreement.\n69\nAB 1054 Securitization\nOn August 1, 2024, PG&E Recovery Funding LLC issued approximately $1.42 billion of senior secured recovery bonds in three tranches: (1) approximately $300 million with an interest rate of 4.838% due June 1, 2035, (2) approximately $373 million with an interest rate of 5.231% due June 1, 2042, and (3) approximately $746 million with an interest rate of 5.529% due June 1, 2051.  The $1.41 billion net proceeds were used by the Utility to reimburse itself for previously incurred fire risk mitigation capital expenditures through the repayment of a portion of loans outstanding under the Utility Revolving Credit Agreement.\nFor more information, see “AB 1054 Securitization” in Note 4 of the Notes to the Consolidated Financial Statements in Item 8. \nPG&E Corporation\nOn September 11, 2024, PG&E Corporation completed the sale of $1.0 billion aggregate principal amount of 7.375% Fixed-to-Fixed Reset Rate Junior Subordinated Notes due 2055.  These notes will initially bear interest at the rate of 7.375% per annum, and beginning March 15, 2030 and every five year anniversary thereafter, the interest rate will be reset to an amount that is equal to the five-year U.S. Treasury rate plus 3.883% (but not below 7.375%).  PG&E Corporation used the net proceeds for general corporate purposes, including to prepay in full, all loans outstanding under its then-existing term loan agreement in an aggregate principal amount equal to $500 million.\nOn November 15, 2024, PG&E Corporation completed the sale of an additional $500 million aggregate principal amount of 7.375% Fixed-to-Fixed Reset Rate Junior Subordinated Notes due 2055.  These notes will initially bear interest at the rate of 7.375% per annum, and beginning March 15, 2030 and every five year anniversary thereafter, the interest rate will be reset to an amount that is equal to the five-year U.S. Treasury rate plus 3.883% (but not below 7.375%).  PG&E Corporation used the net proceeds for general corporate purposes.\nFacilities and Term Loans\nAs of December 31, 2024, PG&E Corporation and the Utility had $500 million and $3.8 billion available under their respective $500 million and $4.4 billion revolving credit facilities.  The Utility also has access to the $1.5 billion Receivables Securitization Program, under which the Utility may borrow the lesser of the facility limit and the facility availability.  Further, the facility availability may vary based on the amount of accounts receivable that the Utility owns that are eligible for sale to the SPV and the portion of those accounts receivable that are sold to the SPV that are eligible for advances by the lenders under the Receivables Securitization Program.\nUtility \nOn April 16, 2024, the Utility amended its existing term loan agreement to combine its $400 million 2-year tranche loan maturing April 19, 2024 and its $125 million 364-day tranche loan maturing April 16, 2024 into a single loan of $525 million maturing April 15, 2025.  The loan bears interest based on the Utility’s election of either (1) Term Secured Overnight Financing Rate (“SOFR”) (plus a 0.10% credit spread adjustment) plus an applicable margin of 1.375% or (2) the alternative base rate plus an applicable margin of 0.375%. \nOn June 26, 2024, the Utility amended its existing receivables securitization program to, among other things, extend the scheduled termination date from June 9, 2025 to June 26, 2026. \nOn June 28, 2024, the Utility amended its then-existing bridge term loan credit agreement to, among other things, (i) extend the maturity date from August 15, 2024 to December 16, 2024, and (ii) modify the mandatory prepayment provision to require the Utility to prepay term loans outstanding under such credit agreement, subject to certain exceptions, with 100% of the net cash proceeds received by the Utility from the issuance of debt securities or incurrence of any debt under any bank credit facilities (excluding AB 1054 securitizations and the Utility’s revolving credit agreement).  As of December 31, 2024, the bridge term loan was no longer outstanding. \nOn July 25, 2024, the Utility amended its existing revolving credit agreement to extend the maturity date for commitments representing $4.196 billion in the aggregate from June 22, 2028 to June 22, 2029 (subject to a one-year extension at the option of the Utility).  The remaining $204 million of commitments will mature on June 22, 2028. \n70\nPG&E Corporation\nOn July 25, 2024, PG&E Corporation amended its existing revolving credit agreement to, among other things, (i) extend the maturity date from June 22, 2026 to June 22, 2027 (subject to a one-year extension at the option of PG&E Corporation), and (ii) remove the cash coverage ratio covenant.\nFor more information, see “Credit Facilities and Term Loans” in Note 4 of the Notes to the Consolidated Financial Statements in Item 8.\nOther Financings\nDOE Loan Guarantee Agreement\nOn January 17, 2025, the Utility entered into the following agreements: (1) the DOE Loan Guarantee Agreement; (2) a note purchase agreement dated as of January 17, 2025 (the “Note Purchase Agreement”), among the Utility, the Federal Financing Bank (“FFB”), and the DOE; and (3) a future advance promissory note dated January 17, 2025, made by the Utility to FFB (the “Note” and together with the Note Purchase Agreement, the “FFB Note Documents”). \nThe FFB Note Documents provide for a multi-advance term loan facility (the “Facility”), under which the Utility may make quarterly term loan borrowings through FFB, subject to satisfaction of certain conditions. Proceeds of the advances under the Facility are to be used by the Utility to reimburse for “Eligible Project Costs” previously incurred and either expended or accrued by the Utility in connection with projects that DOE has determined to be “Eligible Projects” (each as defined in the DOE Loan Guarantee Agreement). The aggregate amount of advances under the Facility may not exceed $15 billion. \nIn connection with the DOE Loan Guarantee Agreement, the DOE agreed to guarantee the obligations of the Utility under the FFB Note Documents (the “Guaranteed Loan”). The Guaranteed Loan is made pursuant to the loan guarantee program established under Title XVII of the Energy Policy Act of 2005, as amended (the “Title XVII Loan Guarantee Program”). \nThe Facility permits the Utility to borrow during the “Availability Period,” which continues until the earliest of: (1) the date the Guaranteed Loan reaches $15 billion; (2) September 15, 2031; (3) the occurrence of an event that causes the guarantee issued by DOE in favor of FFB pursuant to the FFB Note Purchase Agreement to cease to be in full force and effect (“Guarantee Trigger Event”); (4) the date of termination of obligations to disburse any undisbursed amounts of the Guaranteed Loan following the occurrence of any event of default; and (5) January 17, 2030 if the initial first advance has not occurred by that date\nThe Utility may request advances under the Facility during the Availability Period not more than once per calendar quarter by submission of an advance request to DOE with respect to the Eligible Project(s) and Eligible Project Costs subject to such advance.  The aggregate amount of advances cannot exceed $10 billion in any calendar year other than calendar year 2028, during which the aggregate amount of advances cannot exceed $5 billion. \nAdvances are subject to the satisfaction of customary and non-customary conditions.  Such conditions include: (1) approval by DOE in its sole discretion of the Eligible Project(s) subject to such advance; (2) compliance with the requirements of the Title XVII Loan Guarantee Program; (3) certification of the ongoing accuracy in all material respects of all representations and warranties; (4) evidence of compliance with the Davis-Bacon Act of 1931, as amended; (5) compliance with the Cargo Preference Act of 1954, as amended; (6) confirmation that the Utility’s long-term senior secured credit ratings are at least investment grade; (7) completion of the environmental review process pursuant to the National Environmental Policy Act, as amended, with respect to the Eligible Project(s) subject to such advance; and (8) other documentary conditions required by the DOE Loan Guarantee Agreement and the FFB Note Documents.\nThe final maturity date for each advance under the Facility will be the earlier of the interest payment date following the 22nd anniversary of the date of such advance or January 17, 2055.\nAs of the date of this report, the Utility has not borrowed any advances under the Facility.  The Utility is not able to predict the timing or amount of any funds it may receive from the Facility in the future as a result of the January 20, 2025 executive order by President Trump entitled “Unleashing American Energy” regarding funds authorized by the Inflation Reduction Act.  \n71\nCitizens Energy Corporation\n \nOn January 29, 2025, the Utility entered into an amended and restated agreement with Citizens Energy Corporation (“Citizens”) pursuant to which the Utility may lease to Citizens entitlements to certain transmission assets.  A portion of the costs associated with each project that is expected to be subject to such a lease will be excluded from the Utility’s FERC transmission rates for the duration of the applicable lease.  The Utility may offer Citizens up to five lease options over the term of the agreement, for a total investment by Citizens of up to $1.0 billion.  If Citizens exercises and the parties close on a lease option, the Utility will receive an upfront payment as prepaid rent for that lease, which is expected to average approximately $200 million per lease, and the rate base associated with the leased entitlements will go into Citizens’ rate base, rather than the Utility’s, for 30 years.  The transactions contemplated by the agreement are subject to FERC and CPUC approval.\nDividends\nUtility\nOn each of February 13, May 16, and September 19, 2024, the Board of Directors of the Utility declared dividends on its outstanding series of preferred stock totaling $3.5 million, which were paid on May 15, August 15, and November 15, 2024, respectively, to holders of record as of April 30, July 31, and October 31, 2024.   On November 29, 2024, the Board of Directors of the Utility declared dividends on its outstanding series of preferred stock totaling $3.5 million, payable on February 15, 2025, to holders of record as of January 31, 2025. \nOn each of February 13, May 16, September 19, and November 29, 2024, the Board of Directors of the Utility declared common stock dividends of $450 million, $500 million, $500 million, and $575 million, which were paid to PG&E Corporation on March 25, June 3, September 20, and December 24, 2024. respectively. \nPG&E Corporation\nOn each of February 13, May 16, and September 19, 2024, the Board of Directors of PG&E Corporation declared a quarterly common stock dividend of $0.01 per share, each declaration totaling $21 million, which were paid on April 15, July 15, and October 15, 2024, to holders of record as of March 28, June 28 and September 30, 2024, respectively.  On November 29, 2024, the Board of Directors of PG&E Corporation declared a new quarterly common stock dividend of $0.025 per share, totaling $55 million, which was paid on January 15, 2025, to holders of record as of December 31, 2024.\nIn December 2024, PG&E Corporation announced a new dividend policy entailing consistent dividend increases targeting a dividend payout ratio of approximately 20% of core earnings by 2028.  No dividend is payable unless and until declared by the applicable Board of Directors.  The Board of Directors of PG&E Corporation retains authority to change the common stock dividend target and dividend payout ratio at any time.  Future dividend decisions determined by the Board may be impacted by earnings, cash flows, credit metrics and other business conditions.\nOn December 12, 2024, the Board of Directors of PG&E Corporation declared a cash dividend in the amount of $0.7167 per mandatory convertible preferred share, to be payable on March 1, 2025, to holders of record as of February 14, 2025.\nUtility Cash Flows\nPG&E Corporation’s consolidated cash flows consist primarily of cash flows related to the Utility.  The following discussion presents the Utility’s cash flows for 2024 and 2023. \nThe Utility’s cash flows were as follows:\nYear Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n8,268 \n$\n5,097 \nNet cash used in investing activities\n(11,375)\n(9,162)\nNet cash provided by financing activities\n3,348 \n3,979 \nNet change in cash, cash equivalents, restricted cash, and restricted cash equivalents\n$\n241\n \n$\n(86)\n72\nOperating Activities\nNet cash provided by operating activities increased by $3.2 billion, or 62%, in 2024 compared to 2023.  The increases were primarily due to: \n•\nan increase in collections through rates including as a result of the 2023 GRC final decision; and\n•\ndecrease in amounts paid for natural gas due to a decrease in natural gas commodity prices. \nPartially offset by: \n•\nan increase in climate credits issued to customers; and\n•\nlower cash return for collateral posted in 2024 due to a decrease in the volatility of gas prices.\nThe Utility’s cash flows from operating activities primarily consist of receipts from customers less payments of cash operating expenses.  The Utility’s receipts from customers are expected to increase primarily as a result of increases in the Utility’s rate base and from cost recovery applications (see “Cost Recovery Proceedings” below for more information). \nFuture cash flow from operating activities will be affected by various factors, including:\n•\nthe timing and amount of costs in connection with the 2019 Kincade fire, the 2021 Dixie fire, and the 2022 Mosquito fire and the timing and amount of any potential related insurance, Wildfire Fund, and regulatory recoveries;\n•\nthe timing and amount of costs in connection with future wildfires and the timing and amount of any potential related insurance, including funds available from self-insurance and the Wildfire Fund (see “Wildfire Fund under AB 1054” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8);\n•\nthe timing and amount of costs in connection with the 2023-2025 WMP and the portion of the costs previously incurred in connection with the 2020-2022 WMP that are not currently being recovered through rates (see “Regulatory Matters” below for more information);\n•\nthe timing and outcomes of the Utility’s pending and future ratemaking and regulatory proceedings, including the extent to which PG&E Corporation and the Utility are able to recover their costs through regulated rates as recorded in memorandum accounts or balancing accounts, or as otherwise requested; and\n•\nthe timing and amount of electric commodity price volatility and differences between commodity costs and revenue collections.\nPG&E Corporation and the Utility do not have any off-balance sheet arrangements that have had, or are reasonably likely to have, a current or future material effect on their financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources, other than those discussed under “Purchase Commitments” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nInvesting Activities \nThe following table summarizes changes in key components of the Utility’s investing cash flows for the year ended December 31, 2024, compared to December 31, 2023. \n (in millions)\nYear Ended December 31,\nCash used in investing activities - 2023\n$\n(9,162)\nCapital expenditures\n(655)\nNet purchases related to customer credit trust investments\n(677)\nPurchases of self-insurance investments\n(898)\nOther investing activities\n17 \nNet increase in cash used in investing activities\n(2,213)\nCash used in investing activities - 2024\n$\n(11,375)\n73\nNet cash used in investing activities increased by $2.2 billion, or 24%, in 2024 compared to 2023.  The increases were primarily due to a $898 million increase in purchases of self-insurance investments in 2024, and a $677 million increase in net purchases of customer credit trust investments, net of proceeds from sales.  In addition, capital expenditures increased by $655 million in 2024 compared to 2023 primarily due to increased customer connection energization and electric distribution pole replacement.\nThe Utility’s investing activities primarily consist of the construction of new and replacement facilities necessary to provide safe and reliable electricity and natural gas services to its customers.  Cash used in investing activities also includes the proceeds from sales of nuclear decommissioning trust, customer credit trust, and self-insurance investments which are partially offset by the amount of cash used to purchase new nuclear decommissioning trust, customer credit trust, and self-insurance investments.  The funds in the decommissioning trusts, along with accumulated earnings, are used exclusively for decommissioning and dismantling the Utility’s nuclear generation facilities.  Pursuant to SB 901, the funds in the customer credit trust, along with accumulated earnings, are used exclusively to fund a monthly credit to customers.\nFuture cash flows used in investing activities are largely dependent on the timing and amount of capital expenditures.  The Utility estimates that it will incur $12.9 billion of capital expenditures in 2025.  Additionally, future cash flows used in investing activities could be impacted by the timing and amount of contributions to the self-insurance captive (see “Self-Insurance” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8) and to the customer credit trust, including $650 million to be contributed by March 2025 (see Note 5 of the Notes to the Consolidated Financial Statements in Item 8).\nFinancing Activities\nThe following table summarizes changes in key components of the Utility’s financing cash flows for the year ended December 31, 2024, compared to December 31, 2023.\n (in millions)\nYear Ended December 31,\nCash provided by financing activities - 2023\n$\n3,979\n \nNet borrowings under credit facilities\n(3,384)\nRepayments under term loan credit facilities\n(4,200)\nIssuance of long-term debt\n(2,484)\nIssuance of short-term debt\n999 \nRepayments of long-term debt\n2,275 \nProceeds from issuance of senior secured recovery bonds in AB 1054\n1,409 \nProceeds related to DWR loans\n980 \nEquity contribution from PG&E Corporation\n4,070 \nOther financing activities\n(296)\nNet increase in cash provided by financing activities\n(631)\nCash provided by financing activities - 2024\n$\n3,348\n \nNet cash provided by financing activities decreased by $631 million, or 16%, in 2024 compared to 2023.  The decreases were primarily due to:\n•\n$4.2 billion increase in net repayments under term loan credit facilities; and\n•\n$3.4 billion decrease in net borrowings under credit facilities. \nPartially offset by:\n•\n$4.1 billion increase in equity contributions from PG&E Corporation;\n•\n$1.4 billion in proceeds related to the issuance of senior secured recovery bonds in the AB 1054 securitization, with no similar transaction in 2023;\n•\n$999 million in proceeds related to issuance of short-term debt, with no similar transaction in 2023; and\n•\n$980 million in proceeds related to the DWR loan in 2024, with no similar transaction in 2023.\n74\nCash provided by or used in financing activities is driven by the Utility’s financing needs, which depend on the level of cash provided by or used in operating activities, the level of cash provided by or used in investing activities, the conditions in the capital markets, and the maturity date or prepayment date of existing debt instruments.  Additionally, the Utility’s future cash flows from financing activities will be affected by the timing and outcome of the Utility’s financings, dividend payments, and equity contributions from PG&E Corporation.  As of December 31, 2024, PG&E Corporation has completed the planned equity financing for its $63 billion 2024 through 2028 capital expenditure plan.\nLITIGATION MATTERS\nPG&E Corporation and the Utility have significant contingencies arising from their operations, including contingencies related to the enforcement and litigation matters described in Notes 14 and 15 of the Notes to the Consolidated Financial Statements in Item 8 and in “Regulatory Matters” below that are incorporated by reference herein.  The outcome of these matters, individually or in the aggregate, could have a material effect on PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows.\nREGULATORY MATTERS\nThe Utility is subject to substantial regulation by the CPUC, the FERC, the OEIS, the NRC, and other federal and state regulatory agencies.  The resolutions of the proceedings described below and other proceedings may materially affect PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows.  Except as otherwise noted, PG&E Corporation and the Utility are unable to predict the timing and outcome of the following proceedings.\nDuring the year ended December 31, 2024 and through the date of this filing, key updates to regulatory and legislative matters were as follows:\n•\nIn December 2024, the CPUC issued a final decision in the 2021 WMCE proceeding approving a revenue requirement of $429 million associated with costs recorded to the VMBA.\n•\nIn December 2024, the CPUC issued a final decision approving $723 million out of the Utility’s request of $761 million for net recovery of the Utility’s costs to operate DCPP from 2023 through 2025. \n•\nIn November 2024, the OEIS issued a final decision approving the Utility’s 2025 WMP update, which the CPUC ratified on January 16, 2025.\n \nThe OEIS issued a safety certificate for the Utility on December 11, 2024.\n•\nIn October 2024, the CPUC issued a final decision in the Utility’s 2023 Cost of Capital proceeding that changed the cost of capital adjustment mechanism and set the Utility’s ROE at 10.28% effective January 1, 2025.\n•\nIn September 2024, the CPUC issued a final decision on interim rate recovery in the Utility’s 2023 WMCE that grants the Utility interim rate relief of $944 million, plus interest, subject to refund.\n•\nIn August 2024, the FERC issued an order approving the Utility’s TO18 transmission rate case settlement.\n•\nIn July 2024, the CPUC issued a final decision for Phase 2 of the GRC that set a cumulative expenditure cap at $2.26 billion for the period of 2024 to 2026 and permits the Utility to revisit the 2025 and 2026 cap amounts.\n•\nIn March 2024, the CPUC granted the Utility’s request to delay $650 million of contributions to the customer credit trust from 2024 to 2025. \n•\nIn March 2024, the CPUC approved a final decision in the WGSC proceeding authorizing the Utility to recover $516 million in interim rates to be recovered over 12 months starting April 1, 2024.\n•\nIn February 2024, the CPUC issued a final resolution approving an Administrative Consent Order and Agreement between the SED and the Utility regarding the 2021 Dixie fire.\n75\nCost Recovery Proceedings\nPeriodically, costs arise that could not have been anticipated by the Utility during CPUC GRC proceedings or that have been deliberately excluded from such proceedings.  For instance, these costs may result from catastrophic events, changes in regulation, or extraordinary changes in operating practices.  The Utility may seek authority to track incremental costs in a memorandum account and the CPUC may later authorize recovery of costs tracked in memorandum accounts if the costs are deemed incremental and prudently incurred.  The CPUC may also authorize balancing accounts with limitations or caps on cost recovery.  These accounts, which include the CEMA, WEMA, FHPMA, FRMMA, WMPMA, VMBA, WMBA, and MGMA among others, allow the Utility to track the costs associated with work related to disaster and wildfire response, other wildfire prevention-related costs, and certain third-party wildfire claims.  While the Utility generally expects such costs to be recoverable, the CPUC may authorize the Utility to recover less than the full amount of its costs.\nIn recent years, the amount of the costs recorded in these accounts has increased.  Because rate recovery may require CPUC authorization of the costs in these accounts, there can be a delay between when the Utility incurs costs and when it may recover those costs.  As of December 31, 2024, the Utility had recorded an aggregate amount of approximately $3.6 billion in costs for the CEMA, WEMA, FHPMA, FRMMA, WMPMA, VMBA, WMBA, and MGMA.  Of these costs, approximately $1.2 billion was authorized for recovery and accounted for as current, and $2.4 billion was accounted for as long term as of December 31, 2024.  See Note 3 of the Notes to the Consolidated Financial Statements in Item 8.\nIf the amount of the costs recorded in these accounts continues to increase, or the delay between incurring and recovering costs lengthens, PG&E Corporation and the Utility may incur additional financing costs.  If the Utility does not recover the full amount of its recorded costs, the difference between the recorded and recovered amounts would be written off as a non-cash disallowance.  Such disallowances could materially affect PG&E Corporation’s and the Utility’s financial condition, results of operations, liquidity, and cash flows.\nFor more information, see Note 3 of the Notes to the Consolidated Financial Statements in Item 8, and “Wildfire Mitigation and Catastrophic Events Cost Recovery Applications” and “Wildfire and Gas Safety Costs Recovery Application” below.\nThe Utility’s cost recovery proceedings for the costs described above that are pending, have pending appeals, or were completed during the year ended December 31, 2024 are summarized in the following table:\nProceeding\nRequest \n(1)\nStatus\n2021 WMCE\nRevenue requirement of approximately $1.47 billion\nPartial settlement agreement to recover $721 million of revenue requirement approved August 2023.  Decision authorizing $429 million of revenue requirement for the VMBA related costs adopted December 2024.   \n2022 WMCE\nRevenue requirement of approximately $1.29 billion\nFiled December 2022.  Decision authorizing $1.1 billion of interim rate relief adopted June 2023.  Partial settlement filed December 2023.\n2023 WMCE\nRevenue requirement of approximately $1.86 billion\nApplication filed December 2023.  Decision authorizing $944 million of interim rate relief adopted September 2024.  \n2024 WMCE\nRevenue requirement of approximately $435 million \nApplication filed November 2024.\n2023 WGSC\nRevenue requirement of approximately $688 million\nApplication filed June 2023. Decision authorizing $516 million of interim rate relief adopted March 2024.\n(1)\n The revenue requirement request amounts do not include interest.\nWildfire Mitigation and Catastrophic Events Cost Recovery Applications\n2021 WMCE Application \nOn September 16, 2021, the Utility filed an application with the CPUC requesting cost recovery of approximately $1.6 billion of recorded expenditures, resulting in a proposed revenue requirement of approximately $1.47 billion (the “2021 WMCE application”).  The costs addressed in this application reflect costs related to wildfire mitigation and certain catastrophic events, as well as implementation of various customer-focused initiatives.  These costs were incurred primarily in 2020.\n76\nThe recorded expenditures consist of $1.4 billion in expenses and $197 million in capital expenditures.  The Utility’s requested revenue requirement includes amounts recorded to the VMBA of $592 million, the CEMA of $535 million, the WMBA of $149 million, and other memorandum accounts.\nOn August 10, 2023, the CPUC approved a settlement agreement among the Utility and intervenors pursuant to which the Utility began collecting a revenue requirement of $721 million over 24 months beginning September 1, 2023.  The settlement agreement did not address the Utility’s revenue requirement of $592 million associated with costs recorded to the VMBA.\nOn December 27, 2024, the CPUC issued a final decision approving a revenue requirement of $429 million associated with costs recorded to the VMBA.  On January 27, 2025, the Utility filed an application for rehearing.\n2022 WMCE Application \nOn December 15, 2022, the Utility filed an application with the CPUC requesting cost recovery of approximately $1.36 billion of recorded expenditures, resulting in a proposed revenue requirement of approximately $1.29 billion (the “2022 WMCE application”).  The costs addressed in this application reflect costs related to wildfire mitigation and certain catastrophic events, as well as implementation of various customer-focused initiatives.  These costs were incurred primarily in 2021.\nThe recorded expenditures consist of $1.2 billion in expenses and $136 million in capital expenditures.  On June 8, 2023, the CPUC adopted a final decision granting the Utility interim rate relief of $1.1 billion to be recovered over 12 months, which went into effect July 1, 2023.  The remaining $224 million will be recovered to the extent it is approved after the CPUC issues a final decision.  Cost recovery requested in this application is subject to the CPUC’s reasonableness review, which could result in some or all of the interim rate relief being subject to refund.  See “2022 WMCE Interim Rate Relief Subject to Refund”\n \nin Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nOn December 22, 2023, the Utility filed an unopposed joint settlement with intervenors for an additional $70 million revenue requirement, which is incremental to the previously approved interim rate relief.  If the CPUC adopts the settlement agreement, it would resolve all costs recorded to accounts other than the VMBA and the WMBA.  The settlement agreement did not address the Utility’s revenue requirement request of $916 million associated with costs recorded to the VMBA or the WMBA, for which cost recovery will be determined separately by the CPUC.\nOn December 19, 2024, the CPUC extended the statutory deadline to resolve the remaining issues in the proceeding to September 30, 2025.\n2023 WMCE Application\nOn December 1, 2023, the Utility filed an application with the CPUC requesting cost recovery of approximately $2.18 billion of recorded expenditures, resulting in a proposed revenue requirement of approximately $1.86 billion (the “2023 WMCE application”).  The costs addressed in this application reflect costs related to wildfire mitigation and certain catastrophic events, as well as implementation of various customer-focused initiatives.  These costs were incurred primarily in 2022.\nThe recorded expenditures consist of $1.6 billion in expenses and $559 million in capital expenditures.  Of these amounts, approximately 15% of expense, or $239 million, and 30% of capital expenditures, or $167 million, relate to the Utility’s response to the 2022-2023 extreme winter storms CEMA event.\nOn September 16, 2024, the CPUC issued a final decision on interim rate recovery that grants the Utility interim rate relief of $944 million, plus interest, subject to refund, to be recovered over at least 17 months starting October 1, 2024.  The remaining $914 million, plus interest, would be recovered to the extent it is approved after the CPUC issues a final decision.  Cost recovery requested in this application is subject to the CPUC’s reasonableness review, which could result in some or all of the interim rate relief being subject to refund. \nThe CPUC’s procedural schedule indicates a final decision by the second quarter of 2025.\n77\n2024 WMCE Application\nOn November 21, 2024, the Utility filed an application with the CPUC requesting cost recovery of approximately $596 million of recorded expenditures in the CEMA and other accounts, resulting in a revenue requirement of approximately $435 million (the “2024 WMCE application”).  The costs addressed in this application include those incurred in connection with rebuild and restoration activities, certain catastrophic wildfire and weather events, and other programs supporting gas, customer, and climate initiatives.  These costs were incurred primarily in 2023.\nThe recorded expenditures consist of $80 million in expense and $516 million in capital expenditures.  Of these amounts, approximately $50 million of expense and $396 million of capital expenditures relate to community rebuild and restoration activities and other catastrophic events included in CEMA. \nWildfire and Gas Safety Costs Recovery Application\nOn June 15, 2023, the Utility filed a WGSC application with the CPUC requesting cost recovery of approximately $2.5 billion of recorded expenditures related to wildfire mitigation costs and gas safety and electric modernization costs.\nThe recorded expenditures for wildfire mitigation consist of $726 million in expenses and $1.5 billion in capital expenditures and cover activities during the years 2020 to 2022.  The recorded expenditures for gas safety and electric modernization consist of $120 million in expenses and $118 million in capital expenditures and cover activities during the years 2017 to 2022.  If approved, the requested cost recovery would result in an aggregate revenue requirement of $688 million.  The costs addressed in the WGSC application are incremental to those previously authorized in the Utility’s 2020 GRC and other proceedings.\nThe Utility recorded these costs to the memorandum and balancing accounts as set forth in the following table:\n(in millions)\nRecorded Costs\nWMPMA\n$\n2,095 \nFRMMA\n165 \nGas storage balancing account \n101 \nIn line inspection memorandum account \n92 \nOther\n45 \nTotal\n$\n2,498\n \nIn connection with the WGSC application, the Utility also requested interim rate relief of $583 million.  The remaining $105 million would be recovered after the CPUC issues a final decision.  On March 7, 2024, the CPUC approved a final decision authorizing the Utility to recover $516 million in interim rates to be recovered over at least 12 months starting April 1, 2024.\nThe administrative law judge has adopted a schedule that would result in a proposed decision on the wildfire mitigation costs in the first half of 2025 and a final decision on the gas safety and electric modernization costs by June 2025.\nForward-Looking Rate Cases\nThe Utility routinely participates in forward-looking rate case applications before the CPUC and the FERC.  Those applications include GRCs, where the revenue required for general operations (“base revenue”) of the Utility is assessed and reset.  In addition, the Utility is periodically involved in “cost of capital” proceedings to adjust its regulated return on rate base.  The Utility’s future earnings will depend on the revenue requirements authorized in such rate cases.  The Utility also expects to file its SB 884 cost application with the CPUC after the OEIS approves guidelines.  See “SB 884 10-Year Distribution Undergrounding Program” below.\nDecisions in GRC proceedings have historically been expected prior to the commencement of the period to which the rates would apply.  In recent decades, decisions in GRC proceedings have been delayed.  Delayed decisions may cause the Utility to develop its budgets based on possible outcomes, rather than authorized amounts.  When decisions are delayed, the CPUC typically provides rate relief to the Utility effective as of the commencement of the rate case period (not effective as of the date of the delayed decision).  Nonetheless, the Utility’s spending during the period of the delay may exceed the authorized amount, without an ability for the Utility to seek cost recovery of such excess.  If the Utility’s spending during the period of the delay is less than the authorized amount, the Utility could be exposed to operational and financial risks associated with the lower level of work achieved compared to that funded by the CPUC.\n78\nThe Utility’s forward-looking rate cases that are pending, have pending appeals, or were completed during the year ended December 31, 2024 are summarized in the following table:\nRate Case\nRequest\nStatus\n2023 GRC \nPhase 2: balancing account for additional energization costs\nFinal decision on Phase 2 issued July 2024 sets a cumulative expenditure cap at $2.26 billion for the period of 2024 to 2026.\n2023 Cost of Capital, Phase 2 \nMaintain cost of capital adjustment mechanism\nFinal decision issued October 2024, changing the cost of capital adjustment mechanism and setting the Utility’s ROE at 10.28% effective January 1, 2025. \nTO18, TO19, and TO20\nSee Note 15 of the Notes to the Consolidated Financial Statements in Item 8\nSettlement approved by the FERC August 2024.\nTO21\nRevenue requirement of $2.78 billion for 2024\nAccepted December 2023, except as to CAISO adder.  Settlement in principle reached December 2024.  Appeal of FERC’s order regarding CAISO adder filed June 2024 and remains pending.\n2023 General Rate Case\nPhase 1\nOn November 17, 2023, the CPUC issued a final decision on Phase 1.\nThe Utility is authorized to collect through rates the approved revenue requirement increases beginning January 1, 2024 and to amortize the incremental revenue increases related to 2023 for 24 months over the period of January 1, 2024 through December 31, 2025.\nThe final decision authorized the following:\nYear\nRevenue Requirement (in billions)\nRate Base (in billions)\n2023\n$\n13.52 \n$\n45.8 \n2024\n14.24 \n48.8 \n2025\n14.60 \n51.2 \n2026\n14.80 \n54.0 \nFor more information, see “Regulatory Matters” in the 2023 Form 10-K.\nPhase 2 and Energization Timelines Order Instituting Rulemaking\nOn September 15, 2023, the Utility served opening testimony proposing to recover energization costs incremental to the forecasts of the Utility’s Phase 1 2023 GRC.  Energization activities include new business connections and capacity-related work to allow for the connections and reduce energization timelines.  On July 16, 2024, the CPUC issued a final decision approving a memorandum account with interim rate relief, subject to annual caps and reasonableness review in the 2027 GRC application.  The overall expenditure cap was set at\n $2.26 billion for the period of 2024 to 2026.  The decision also provides the Utility the ability to request revisions to the 2025 and 2026 cap amounts under certain conditions.  On October 4, 2024, the Utility filed a motion to increase the 2025 and 2026 cap amounts by an aggregate $3.1 billion, which reflects approximately $300 million originally included in 2024, for a net increase of $2.8 billion.\nOn October 18, 2024, the assigned commissioner issued an amended scoping memo providing for a final decision in spring 2025.\n79\nCost of Capital Proceedings\n2023 Cost of Capital Application\nOn December 19, 2022, the CPUC issued a final decision adopting a new cost of capital, ROE, cost of preferred stock, and cost of debt for the Utility’s electric generation, electric distribution, natural gas distribution, and natural gas transmission and storage rate base beginning on January 1, 2023.  On October 22, 2024, the CPUC issued the decision in Phase 2 modifying the Cost of Capital mechanism and setting new returns on equity effective January 1, 2025.  \nOn November 6, 2024, the Utility submitted an advice letter with updated 2025 cost of capital rates.  On December 4, 2024, the CPUC approved the advice letter and the following cost of capital rates, which went into effect beginning January 1, 2025:\nCost\nWeight\nWeighted Cost\nReturn on Common Equity\n10.28 \n%\n52.00%\n5.35%\nReturn on Preferred Equity\n5.52 \n%\n0.50%\n0.03%\nReturn on Long-term debt\n4.80 \n%\n47.50%\n2.28%\nThe Utility will file the next cost of capital application on March 20, 2025 for test year 2026.\nTransmission Owner Rate Cases\nTransmission Owner Rate Case for 2024 (the “TO21” rate case)\nOn October 13, 2023, the Utility filed its TO21 rate case with the FERC.  In the filing, the Utility forecasted a 2024 retail electric transmission revenue requirement of $2.83 billion.  The proposed amount reflects an approximately 11% decrease over the rate year 2023 retail revenue requirement of $3.18 billion, due in part to a refund to customers (see “Transmission Owner Rate Case Revenue Subject to Refund” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8) and the transaction to lease entitlements associated with certain transmission assets (see “Liquidity and Financial Resources - Other Financings” above).  The Utility made investments of approximately $1.22 billion in 2023 and forecasts that it will make investments of approximately $1.43 billion in 2024 for various capital projects to be placed in service before the end of 2024.  The Utility requested that FERC approve a 12.37% base ROE as well as a 0.5% adder for its participation in the CAISO.  The TO21 filing also addresses the Utility’s capital structure and several new issues including wildfire self-insurance recovery from transmission customers.  \nOn December 29, 2023, the FERC issued an order accepting the TO21 filing subject to refund, establishing a January 1, 2024 effective date, and establishing a settlement and hearing process, but denying the 0.5% ROE adder for participation in the CAISO, which results in a forecast transmission revenue requirement of $2.78 billion.  On January 29, 2024, the Utility filed a request for rehearing of the FERC’s denial of the 0.5% ROE adder for participation in the CAISO.  On June 12, 2024, the FERC issued an order denying the Utility’s request for rehearing.  On June 18, 2024, the Utility and California IOUs filed an appeal of the FERC’s order denying the Utility’s request for rehearing.  The utilities’ joint opening brief was filed on September 11, 2024 and reply brief was filed on December 17, 2024.\nOn December 18, 2024, the settlement judge issued a status report to the FERC stating that the Utility and the other parties have reached a settlement in principle on all issues in the TO21 rate case.  The parties will draft an offer of settlement to be filed with the FERC for approval.\nOther Regulatory Proceedings\n2023-2025 Wildfire Mitigation Plan\nOn March 27, 2023, the Utility submitted the 2023-2025 WMP.  The 2023-2025 WMP addresses the Utility’s wildfire safety programs and initiatives focused on reducing the potential for catastrophic wildfires related to electrical equipment and reducing the customer impact of EPSS and PSPS events.  On December 29, 2023, the OEIS issued a final decision approving the Utility’s 2023-2025 WMP.  On February 15, 2024, the CPUC ratified the OEIS’s approval.  On January 8, 2024, the Utility filed a change order request to update some of the forecasted work in the WMP for 2024.  On May 31, 2024, the OEIS issued a decision approving in part and denying in part the change order request.\n80\nThe Utility submitted an updated 2025 WMP on April 2, 2024, as directed by the OEIS.  On November 19, 2024, the OEIS issued a final approval of the Utility’s 2025 WMP update.  On January 16, 2025, the CPUC ratified the OEIS’s approval.\nExtension of Diablo Canyon Operations \nOn September 2, 2022, SB 846 became law.  SB 846 supports the extension of operations at DCPP through no later than 2030, with the potential for an earlier retirement date.  Under the legislation, the Utility continues to operate DCPP on behalf of all CPUC-jurisdictional LSEs, and all customers of those LSEs are responsible for the cost of extended operations.\nThe key steps to continued operations are NRC license renewal and approvals from California state agencies, including the CPUC, CEC, California State Lands Commission, California Coastal Commission, and other state agencies.  As set forth below, many of these approvals have been received. \nOn February 28, 2023, and in consultation with the CAISO and CPUC, the CEC determined that it is prudent to extend the operation of DCPP to support electric system reliability through 2030.\nThe Utility leases land from the state for the water intake structure, breakwaters, cooling water discharge channel, and other structures on state land associated with DCPP.  On June 5, 2023, the California State Lands Commission approved an extension of the Utility’s lease at DCPP through October 31, 2030.\nOn August 15, 2023, the California State Water Resources Control Board approved the Utility’s plan for once-through cooling at DCPP.\nOn November 7, 2023, the Utility submitted an application for license renewal with the NRC.  On December 19, 2023, the NRC deemed the application sufficient, which allows continued operations at DCPP past the plant’s current licenses until the relicensing review is complete.  The NRC’s schedule indicates that it will issue a final safety evaluation report and supplemental environmental impact statement by June 2025.\nOn December 14, 2023, the CPUC approved extended operations at DCPP until October 31, 2029 for Unit 1 and October 31, 2030 for Unit 2.  The approval is subject to the following conditions: (1) the NRC continues to authorize DCPP operations; (2) the loan agreement authorized by SB 846 is not terminated; and (3) the CPUC does not make a future determination that DCPP extended operations are imprudent or unreasonable.\nOn May 3, 2024, the CEC issued a report concluding that no suitable supply-side resources can be brought online as alternatives to DCPP’s energy and capacity output prior to the planned retirement dates in 2024 and 2025.\nOn December 19, 2024, the CPUC issued a final decision.  As a result, the Utility will recover $711 million through rates (compared to its request of $761 million) for net recovery of its costs to operate DCPP from 2023 through 2025.\nSB 884 10-Year Distribution Undergrounding Program\nOn March 7, 2024, the CPUC approved a resolution that establishes an expedited utility distribution infrastructure undergrounding program pursuant to Public Utilities Code Section 8388.5.  The resolution addresses the process and requirements for the CPUC’s review of any large electrical corporation’s 10-year distribution infrastructure undergrounding plan and conditional approval of its related costs.\nThe OEIS issued draft guidelines on May 8, 2024, revised guidelines on September 10, 2024, and second revised guidelines on January 7, 2025.\nThe Utility expects to submit its undergrounding plan to the OEIS after final guidelines are issued before submitting its cost application to the CPUC, as directed in Public Utilities Code Section 8388.5.\n81\nLEGISLATIVE AND REGULATORY INITIATIVES\nInflation Reduction Act \nIn 2022, the Inflation Reduction Act became law.  The Inflation Reduction Act includes a 15% corporate alternative minimum tax on the AFSI of corporations with average AFSI exceeding $1.0 billion over a three-year period, effective January 1, 2023.  The law also extends and modifies existing tax credits and creates new tax credits for qualifying investments on renewable and clean energy sources and energy storage.  The U.S. Department of the Treasury and the IRS have broad authority to issue and have issued regulations and guidance to implement its provisions.  PG&E Corporation and the Utility expect to pay corporate alternative minimum tax beginning in 2027, the amount of which may become substantial in future years.  As of December 31, 2024, the law did not have a material impact on the PG&E Corporation’s and the Utility’s Consolidated Financial Statements.\nENVIRONMENTAL MATTERS\nThe Utility’s operations are subject to extensive federal, state, and local laws and permits relating to the protection of the environment and the safety and health of the Utility’s personnel and the public.  These laws and requirements relate to a broad range of the Utility’s activities, including the remediation of hazardous substances; the reporting and reduction of carbon dioxide and other GHG emissions; the discharge of pollutants into the air, water, and soil; the reporting of safety and reliability measures for natural gas storage facilities; and the transportation, handling, storage, and disposal of spent nuclear fuel.  See Item 1A. Risk Factors, “Environmental Regulation” in Item 1 and “Environmental Remediation Contingencies” in Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nRISK MANAGEMENT ACTIVITIES\nPG&E Corporation, mainly through its ownership of the Utility, and the Utility are exposed to risks associated with adverse changes in commodity prices, interest rates, and counterparty credit.  The Utility actively manages market risk through risk management programs designed to support business objectives, discourage unauthorized risk-taking, reduce commodity cost volatility, and manage cash flows.  The Utility uses derivative instruments only for non-trading purposes (i.e., risk mitigation) and not for speculative purposes.\nCommodity Price Risk\nThe Utility is exposed to commodity price risk as a result of its electricity and natural gas procurement activities, including the procurement of natural gas and nuclear fuel necessary for electricity generation and natural gas procurement for core customers.  The Utility’s risk management activities include the use of physical and financial instruments such as forward contracts, futures, swaps, options, and other instruments and agreements.  As long as the Utility can conclude that it is probable that its reasonably incurred wholesale electricity procurement costs and natural gas costs are recoverable, fluctuations in electricity and natural gas prices do not affect earnings.  Such fluctuations, however, may impact cash flows.  The Utility’s natural gas transportation and storage costs for core customers are also fully recoverable through a ratemaking mechanism.\nThe Utility does not have a balancing account for costs in excess of its revenue requirement for natural gas transportation and storage service to non-core customers.  The Utility recovers these costs in its GRC through fixed reservation charges and volumetric charges from long-term contracts, resulting in price and volumetric risk.  PG&E Corporation uses value-at-risk to measure its shareholders’ exposure to these risks.  The value-at-risk was approximately \n$5 million \nand $4 million at December 31, 2024 and 2023, respectively.  See Note 10 of the Notes to the Consolidated Financial Statements in Item 8 for further discussion of price risk management activities.\nInterest Rate Risk\nInterest rate risk sensitivity analysis is used to measure interest rate risk by computing estimated changes in cash flows as a result of assumed changes in market interest rates.  At December 31, 2024 and 2023, if interest rates changed by one percent for all PG&E Corporation and Utility variable rate long-term debt, short-term borrowings, and cash investments, the pre-tax impact on net income over the next 12 months would be $6 million and $57 million, respectively, based on net variable rate debt and other interest rate-sensitive instruments outstanding.  See Note 4 of the Notes to the Consolidated Financial Statements in Item 8 for further discussion of interest rates.\n82\nEnergy Procurement Credit Risk\nThe Utility conducts business with counterparties mainly in the energy industry to purchase electricity or gas and related services, including the CAISO market, other California IOUs, municipal utilities, energy trading companies, pipelines, financial institutions, electricity generation companies, and oil and natural gas production companies located in the United States and Canada.  If a counterparty fails to perform on its contractual obligation to deliver electricity or gas and related services, then the Utility may find it necessary to procure electricity or gas at current market prices or seek alternate services, which may be higher than the contract prices.\nThe Utility manages credit risk associated with its counterparties by assigning credit limits based on evaluations of their financial conditions, net worth, credit ratings, and other credit criteria as deemed appropriate.  Credit limits and credit quality are monitored periodically.  The Utility executes many energy contracts under master commodity enabling agreements that may require security.  Security may be in the form of cash or letters of credit.  The Utility may accept other forms of performance assurance in the form of corporate guarantees of acceptable credit quality or other eligible securities (as deemed appropriate by the Utility).  Security or performance assurance may be required from the Utility or counterparties when current net receivables or payables and exposure exceed contractually specified limits.\nThe following table summarizes the Utility’s energy procurement credit risk exposure to its counterparties:\nExposure\n (1) \n(in millions)\nNumber of\nWholesale\nCustomers or\nCounterparties\n>10%\nNet Credit\nExposure to\nWholesale\nCustomers or\nCounterparties\n>10% \n(in millions)\nDecember 31, 2024\n$\n1,114 \n4 \n$\n708 \nDecember 31, 2023\n$\n926 \n3 \n$\n457 \n(1) \nExposure is the positive exposure maximum that equals mark-to-market value on physically and financially settled contracts, plus net receivables (payables) where netting is contractually allowed minus collateral posted by counterparties and held by the Utility plus collateral posted by the Utility and held by the counterparties.  For purposes of this table, parental guarantees are not included as part of the calculation.  Exposure amounts reported above do not include adjustments for time value or liquidity.\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of the Consolidated Financial Statements in accordance with GAAP involves the use of estimates and assumptions that affect the recorded amounts of assets and liabilities as of the date of the financial statements and the reported amounts of revenues and expenses during the reporting period.  The accounting policies described below are considered to be critical accounting estimates due, in part, to their complexity and because their application is relevant and material to the financial position and results of operations of PG&E Corporation and the Utility, and because these policies require the use of material judgments and estimates.  Actual results may differ materially from these estimates and assumptions.  These accounting estimates and their key characteristics are outlined below.\nContributions to the Wildfire Fund\nThe Wildfire Fund is expected to be capitalized with at least $21 billion through (i) a 15-year non-bypassable charge to customers, (ii) $7.5 billion in initial contributions from California’s three large electric IOUs, and (iii) $300 million in annual contributions paid by California’s three large electric IOUs for a 10-year period.  The contributions from the IOUs will be effectively borne by their respective shareholders, as they will not be permitted to recover these costs through rates.  The costs of the initial and annual contributions are allocated among the IOUs pursuant to a “Wildfire Fund allocation metric” set forth in AB 1054 based on land area in the applicable IOU’s service area classified as HFTDs and adjusted to account for risk mitigation efforts.  The Utility’s Wildfire Fund allocation metric is 64.2% (representing an initial contribution of approximately $4.8 billion and annual contributions of approximately $193 million).\n83\nOn the Emergence Date, PG&E Corporation and the Utility contributed, in accordance with AB 1054, an initial contribution of approximately $4.8 billion and first annual contribution of approximately $193 million to the Wildfire Fund to secure participation of the Utility therein.  The other large electric IOUs made their initial contributions to the Wildfire Fund in September 2019.  In December 2023 and 2024, the Utility made its fifth and sixth annual contributions of $193 million each to the Wildfire Fund.  As of December 31, 2024, the Utility has four remaining annual contributions of $193 million (based on the Wildfire Fund allocation metric).  PG&E Corporation and the Utility account for contributions to the Wildfire Fund by capitalizing an asset, amortizing to periods ratably based on an estimated period of coverage, and incrementally adjusting for accelerated amortization as the level of coverage declines, as further described below.\nAs of December 31, 2024, PG&E Corporation and the Utility recorded $193 million in Other current liabilities, $564 million in Other noncurrent liabilities, $301 million in Current assets - Wildfire Fund asset, and $4.1 billion in Noncurrent assets - Wildfire Fund asset in the Consolidated Balance Sheets.  During the years ended December 31, 2024 and 2023, the Utility recorded amortization and accretion expense of $383 million and $567 million, respectively.  The amortization of the asset, accretion of the liability, and acceleration of the amortization of the asset is reflected in Wildfire Fund expense in the Consolidated Statements of Income.  Expected contributions recorded in Wildfire Fund asset on the Consolidated Balance Sheets are discounted to the present value using the 10-year U.S. treasury rate at the date PG&E Corporation and the Utility satisfied all the eligibility requirements to participate in the Wildfire Fund.  A useful life of 20 years is being used to amortize the Wildfire Fund asset.\nAB 1054 did not specify a period of coverage; therefore, this accounting treatment is subject to significant accounting judgments and estimates.  In estimating the period of coverage, PG&E Corporation and the Utility use a Monte Carlo simulation that began with 12 years of historical, publicly available fire-loss data from wildfires caused by electrical equipment, and subsequently plan to add an additional year of data each following year.  The period of historic fire-loss data and the effectiveness of mitigation efforts by the California electric utility companies are significant assumptions used to estimate the useful life.  These assumptions along with the other assumptions below create a high degree of uncertainty related to the estimated useful life of the Wildfire Fund.  The simulation creates annual distributions of potential losses due to fires that could be attributed to the participating electric utilities.  Initial use of five years of historical data, with average annual statewide claims or settlements of approximately $6.5 billion versus 12 years of historical data, with average annual statewide claims or settlements of approximately $2.9 billion, would have resulted in a six year amortization period.  As of December 31, 2024, a 5% change to the assumption around current and future mitigation effort effectiveness would increase the amortization period by five years assuming greater effectiveness and would decrease the amortization period by five years assuming less effectiveness.\nOther assumptions used to estimate the useful life include the disclosed cost of wildfires caused by participating electric utilities, the amount at which wildfire claims would be settled, the likely adjudication of the CPUC in cases of electric utility-caused wildfires and determination of any amounts required to be reimbursed to the Wildfire Fund, the impacts of climate change, the level of future insurance coverage held by the electric utilities, the FERC-allocable portion of loss recovery, and the future transmission and distribution equity rate base growth of participating electric utilities.  Significant changes in any of these estimates could materially impact the amortization period.\nPG&E Corporation and the Utility re-evaluate the estimated period of coverage annually and when additional information becomes available, and the expected life of the Wildfire Fund will be adjusted as required.  The Wildfire Fund is available to other participating utilities in California and the amount of claims that a participating utility incurs is not limited to its individual contribution amount.  PG&E Corporation and the Utility assess the Wildfire Fund asset for acceleration of the amortization of the asset in the event that a participating utility’s electrical equipment is found to be the substantial cause of a catastrophic wildfire.  Timing of any such acceleration of the amortization of the asset could lag as the emergence of sufficient cause and claims information can take many quarters and could be limited to public disclosure of the participating electric utility, if ignition were to occur outside the Utility’s service area.  There were fires in the Utility’s and other participating utilities’ service areas since July 12, 2019, including fires for which the cause is unknown, which may in the future be determined to be covered by the Wildfire Fund.  PG&E Corporation and the Utility recorded $72 million and $102 million of accelerated amortization, reflected in Wildfire Fund expense for the years ended December 31, 2024 and 2023, respectively.  As of December 31, 2024, PG&E Corporation and the Utility recorded $600 million and $156 million in Accounts receivable - other and Other noncurrent assets, respectively, for Wildfire Fund receivables related to the 2021 Dixie fire.\nFor more information, see “Contributions to the Wildfire Fund Established Pursuant to AB 1054” in Note 2 and “Wildfire Fund under AB 1054” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\n84\nLoss Contingencies\nAs discussed below, PG&E Corporation and the Utility have recorded material accruals for various wildfire-related, enforcement and legal matters, and environmental remediation liabilities.  PG&E Corporation and the Utility have also recorded insurance receivables for third-party claims.\nWildfire-Related Liabilities\nPG&E Corporation and the Utility are subject to potential liabilities related to wildfires.  PG&E Corporation and the Utility record a wildfire-related liability when they determine that a loss is probable, and they can reasonably estimate the loss or a range of losses.  The provision is based on the lower end of the range, unless an amount within the range is a better estimate than any other amount.\nThe process for estimating wildfire-related liabilities requires management to exercise significant judgment based on a number of assumptions and subjective factors, including the factors identified above and estimates based on currently available information and prior experience with wildfires.  See Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\nEnforcement and Litigation Matters\nPG&E Corporation and the Utility are subject to various laws and regulations and, in the normal course of business, are named as parties in a number of claims and lawsuits.  In addition, penalties may be incurred for failure to comply with federal, state, or local laws and regulations.  PG&E Corporation and the Utility record a provision for a loss contingency when it is both probable that a loss has been incurred, and the amount of the loss can be reasonably estimated.  PG&E Corporation and the Utility evaluate the range of reasonably estimated losses and record a provision based on the lower end of the range, unless an amount within the range is a better estimate than any other amount.  The assessment of whether a loss is probable or reasonably possible, and whether the loss or a range of loss is estimable, often involves a series of complex judgments about future events.  Loss contingencies are reviewed quarterly, and estimates are adjusted to reflect the impact of all known information, such as negotiations, discovery, settlements and payments, rulings, advice of legal counsel, and other information and events pertaining to a particular matter.  PG&E Corporation’s and the Utility’s provision for loss and expense excludes anticipated outside counsel costs, which are expensed as incurred.  Actual results may differ materially from these estimates and assumptions.  See Note 14 and Note 15 of the Notes to the Consolidated Financial Statements in Item 8.\nLoss Recoveries\nPG&E Corporation and the Utility have recovery mechanisms available for wildfire liabilities including from insurance, through rates, and from the Wildfire Fund.  The Utility has liability insurance from various insurers, which provides coverage for third-party claims arising before August 1, 2023.  PG&E Corporation and the Utility record a receivable for a recovery when they determine that it is probable that they will recover a recorded loss, and they can reasonably estimate the amount or its range.  The assessment of whether recovery is probable or reasonably possible, and whether the recovery or a range of recoveries is estimable, often involves a series of complex judgments about future events.  Loss recoveries are reviewed quarterly, and estimates are adjusted to reflect the impact of all known information, including contractual liability insurance policy coverage, advice of legal counsel, past experience with similar events, communications with the Wildfire Fund administrators, the CPUC and FERC, and other information and events pertaining to a particular matter.  See “Loss Recoveries” in Note 14 of the Notes to the Consolidated Financial Statements in Item 8.\nEnvironmental Remediation Liabilities\nThe Utility is subject to loss contingencies pursuant to federal and California environmental laws and regulations that in the future may require the Utility to pay for environmental remediation at sites where it has been, or may be, a potentially responsible party.  Such contingencies may exist for the remediation of hazardous substances at various potential sites, including former MGP sites, power plant sites, gas compressor stations, and sites used by the Utility for the storage, recycling, or disposal of potentially hazardous materials, even if the Utility did not deposit those substances on the site.\n85\nThe Utility generally commences the environmental remediation assessment process upon notification from federal or state agencies, or other parties, of a potential site requiring remedial action.  (In some instances, the Utility may initiate action to determine its remediation liability for sites that it no longer owns in cooperation with regulatory agencies.  For example, the Utility has a program related to certain former MGP sites.)  Based on such notification, the Utility completes an assessment of the potential site and evaluates whether it is probable that a remediation liability has been incurred.  The Utility records an environmental remediation liability when site assessments indicate remediation is probable and it can reasonably estimate the loss or a range of possible losses.  Given the complexities of the legal and regulatory environment and the inherent uncertainties involved in the early stages of a remediation project, the process for estimating remediation liabilities is subjective and requires significant judgment.  Key factors evaluated in developing cost estimates include the extent and types of hazardous substances at a potential site, the range of technologies that can be used for remediation, the determination of the Utility’s liability in proportion to other responsible parties, and the extent to which such costs are recoverable from third parties.\nWhen possible, the Utility estimates costs using site-specific information, but also considers historical experience for costs incurred at similar sites depending on the level of information available.  Estimated costs are composed of the direct costs of the remediation effort and the costs of compensation for employees who are expected to devote a significant amount of time directly to the remediation effort.  These estimated costs include remedial site investigations, remediation actions, operations and maintenance activities, post remediation monitoring, and the costs of technologies that are expected to be approved to remediate the site.  Remediation efforts for a particular site generally extend over a period of several years.  During this period, the laws governing the remediation process may change, as well as site conditions, which could affect the cost of the remediation effort.\nAs of December 31, 2024 and 2023, the Utility’s accruals for undiscounted gross environmental liabilities were $1.3 billion each.  The Utility’s undiscounted future costs could increase to as much as $2.3 billion if the extent of contamination or necessary remediation is greater than anticipated or if the other potentially responsible parties are not financially able to contribute to these costs and could increase further if the Utility chooses to remediate beyond regulatory requirements.  Although the Utility has provided for known environmental obligations that are probable and reasonably estimable, estimated costs may vary significantly from actual costs, and the amount of additional future costs may be material to results of operations in the period in which they are recognized.\nRegulatory Accounting\nAs a regulated entity, the Utility records regulatory assets and liabilities for amounts that are deemed probable of recovery from, or refund to, customers.  The Utility continues to apply ASC 980, \nRegulated Operations\n.  These amounts would otherwise be recorded to expense or income under GAAP.  Refer to “Regulation and Regulated Operations” in Note 2 as well as Note 3 of the Notes to the Consolidated Financial Statements in Item 8.  As of December 31, 2024, PG&E Corporation and the Utility reported regulatory assets (including current regulatory balancing accounts receivable) of $23.0 billion and regulatory liabilities (including current regulatory balancing accounts payable) of $23.8 billion.\nDetermining probability requires significant judgment by management and includes consideration of testimony presented in regulatory hearings, proposed regulatory decisions, final regulatory orders, and the strength or status of applications for rehearing or court appeals.  For some of the Utility’s regulatory assets, including utility-retained generation, the Utility has determined that the costs are recoverable based on specific approval from the CPUC.  The Utility also records a regulatory asset when a mechanism is in place to recover current expenditures and historical experience indicates that recovery of incurred costs is probable, such as the regulatory assets for pension benefits; deferred income tax; price risk management; and unamortized loss, net of gain, on reacquired debt.  If the Utility determined that it is no longer probable that regulatory assets would be recovered or reflected in future rates, or if the Utility ceased to be subject to rate regulation, the regulatory assets would be charged against income in the period in which that determination was made.  If regulatory accounting did not apply, the Utility’s future financial results could become more volatile as compared to historical financial results due to the differences in the timing of expense or revenue recognition.\nA portion of the Utility’s regulatory asset balances relate to items which could not be anticipated by the Utility during CPUC GRC rate requests resulting from catastrophic events, changes in regulation, or extraordinary changes in operating practices.  The Utility may seek authority to track incremental costs in a memorandum account, and the CPUC may authorize recovery of costs tracked in memorandum accounts if the costs are deemed incremental and prudently incurred.  These accounts, which include the CEMA, WEMA, FHPMA, FRMMA, WMPMA, VMBA, WMBA, and MGMA among others, allow the Utility to track the costs associated with work related to disaster and wildfire response, and other wildfire prevention-related costs.  In addition, the RUBA tracks costs associated with customer protections, including higher uncollectible costs related to a moratorium on electric and gas service disconnections for residential customers.  While the Utility generally believes such costs are recoverable, rate recovery requires CPUC authorization in separate proceedings or through a GRC.\n86\nAdditionally, SB 901 provides a mechanism for the CPUC to potentially allow recovery in future rates, through a securitization mechanism, of wildfire-related costs found to be just and reasonable by the CPUC and, only for the 2017 Northern California wildfires, any amounts in excess of the customer harm threshold (“CHT”).  SB 901 required the CPUC to establish the CHT to limit certain disallowances in the aggregate, so that they do not exceed the maximum amount that the Utility can pay without harming customers or materially impacting its ability to provide adequate and safe service.  The Utility must evaluate the likelihood of recovery in future rates each period.  In 2022, PG&E Corporation and the Utility recorded a regulatory asset associated with SB 901.  As of December 31, 2024, the SB 901 regulatory asset was approximately $5.2 billion.  See Note 5 of the Notes to the Consolidated Financial Statements in Item 8.\nIn addition, regulatory accounting standards require recognition of a loss if it becomes probable that capital expenditures will be disallowed for ratemaking purposes and if a reasonable estimate of the amount of the disallowance can be made.  Such assessments require significant judgment by management regarding probability of recovery, as described above, and the ultimate cost of construction of capital assets.  The Utility records a loss to the extent capital costs are expected to exceed the amount to be recovered.  The Utility’s capital forecasts involve a series of complex judgments regarding detailed project plans, estimates included in third-party contracts, historical cost experience for similar projects, permitting requirements, environmental compliance standards, and a variety of other factors.\nAsset Retirement Obligations\nPG&E Corporation and the Utility account for an ARO at fair value in the period during which the legal obligation is incurred if a reasonable estimate of fair value and its settlement date can be made.  At the time of recording an ARO, the associated asset retirement costs are capitalized as part of the carrying amount of the related long-lived asset.  The Utility recognizes a regulatory asset or liability for the timing differences between the recognition of expenses and costs recovered through the ratemaking process.  See Notes 2 and 3 of the Notes to the Consolidated Financial Statements in Item 8.\nTo estimate its liability, the Utility uses a discounted cash flow model based upon significant estimates and assumptions about future decommissioning costs, inflation rates, and the estimated date of decommissioning.  The estimated future cash flows are discounted using a credit-adjusted risk-free rate that reflects the risk associated with the decommissioning obligation.\nAt December 31, 2024, the Utility’s recorded ARO for the estimated cost of retiring these long-lived assets was approximately $5.4 billion.  Changes in these estimates and assumptions could materially affect the amount of the recorded ARO for these assets.\nPension and Other Postretirement Benefit Plans \nPG&E Corporation and the Utility sponsor a non-contributory defined benefit pension plan for eligible employees as well as contributory postretirement health care and medical plans for eligible retirees and their eligible dependents, and non-contributory postretirement life insurance plans for eligible employees and retirees.  Adjustments to the pension and other benefit obligation are based on the differences between actuarial assumptions and actual plan results.  These amounts are deferred in accumulated other comprehensive income (loss) and amortized into income on a gradual basis.  The differences between pension benefit expense recognized in accordance with GAAP, and amounts recognized for ratemaking purposes are recorded as regulatory assets or liabilities as amounts are probable of recovery through rates.  To the extent the other benefits are in an overfunded position, the Utility records a regulatory liability.  See Note 3 of the Notes to the Consolidated Financial Statements in Item 8.\nThe pension and other postretirement benefit obligations are calculated using actuarial models as of the December 31 measurement date.  The significant actuarial assumptions used in determining pension and other benefit obligations include the discount rate, the average rate of future compensation increases, the health care cost trend rate, and the expected return on plan assets.  PG&E Corporation and the Utility review these assumptions on an annual basis and adjust them as necessary.  While PG&E Corporation and the Utility believe that the assumptions used are appropriate, significant differences in actual experience, plan changes or amendments, or significant changes in assumptions may materially affect the recorded pension and other postretirement benefit obligations and future plan expenses.  See Note 12 of the Notes to the Consolidated Financial Statements in Item 8.\n87\nIn establishing health care cost assumptions, PG&E Corporation and the Utility consider recent cost trends and projections from industry experts.  This evaluation suggests that current rates of inflation are expected to continue in the near term.  In recognition of continued high inflation in health care costs and given the design of PG&E Corporation’s plans, the assumed health care cost trend rate for 2025 was 7.5%, gradually decreasing to the ultimate trend rate of approximately 4.5% in 2033 and beyond.\nExpected rates of return on plan assets were developed by estimating future stock and bond returns and then applying these returns to the target asset allocations of the employee benefit plan trusts, resulting in a weighted average rate of return on plan assets.  Returns on fixed-income debt investments were projected based on real maturity and credit spreads added to a long-term inflation rate.  Returns on equity investments were projected based on estimates of dividend yield and real earnings growth added to a long-term inflation rate.  For the Utility’s defined benefit pension plan, the assumed return of 6.4% compares to a ten-year actual return of 5.1%.\nThe rate used to discount pension benefits and other benefits was based on a yield curve developed from market data of approximately 858 Aa-grade non-callable bonds at December 31, 2024.  This yield curve has discount rates that vary based on the duration of the obligations.  The estimated future cash flows for the pension and other postretirement benefit obligations were matched to the corresponding rates on the yield curve to derive a weighted average discount rate.\nThe following reflects the sensitivity of pension costs and projected benefit obligation to changes in certain actuarial assumptions:\n(in millions)\nIncrease\n(Decrease) in\nAssumption\nIncrease in 2024\n \nPension\nCosts\nIncrease in Projected\nBenefit Obligation at\nDecember 31, 2024\nDiscount rate\n(0.50)\n%\n$\n(1)\n$\n1,093 \nRate of return on plan assets\n(0.50)\n%\n85 \n— \nRate of increase in compensation\n0.50 \n%\n30 \n250 \nThe following reflects the sensitivity of other postretirement benefit costs and accumulated benefit obligation to changes in certain actuarial assumptions:\n(in millions)\nIncrease\n(Decrease) in\nAssumption\nIncrease in 2024\nOther Postretirement\nBenefit Costs\nIncrease in Accumulated\nBenefit Obligation at\nDecember 31, 2024\nHealth care cost trend rate\n0.50 \n%\n$\n6 \n$\n37 \nDiscount rate\n(0.50)\n%\n6 \n78 \nRate of return on plan assets\n(0.50)\n%\n12 \n— \nACCOUNTING STANDARDS ISSUED BUT NOT YET ADOPTED\nSee Note 2 of the Notes to the Consolidated Financial Statements in Item 8.\nNEW ACCOUNTING PRONOUNCEMENTS\nSee Note 2 of the Notes to the Consolidated Financial Statements in Item 8.",
  "item2": null
}