{
  "source_file": "peg-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. \nBUSINESS\n\n\nWe were incorporated under the laws of the State of New Jersey in 1985 and our principal executive offices are located at 80 Park Plaza, Newark, New Jersey 07102. We are a public utility holding company that, acting through our wholly owned subsidiaries, is a predominantly regulated electric and gas utility and a nuclear generation business.\n \n\n\nAs a holding company, our profitability depends on our subsidiaries’ operating results. We principally conduct our business through two direct wholly owned subsidiaries, PSE&G and PSEG Power LLC (PSEG Power), described below, each of which also has its principal executive offices at 80 Park Plaza, Newark, New Jersey 07102. Over the past several years, we have simplified our business mix and focused our capital allocation towards PSE&G, resulting in the majority of earnings being contributed by PSE&G and providing us more predictability of earnings.\n \n\n\n•\nPSE&G\n—A New Jersey corporation, incorporated in 1924, which is a franchised public utility in New Jersey. It is also the provider of last resort for gas and electric commodity service for end users in its service territory. PSE&G earns revenues from its regulated rate tariffs under which it provides electric transmission and electric and natural gas distribution to residential, commercial and industrial (C&I) customers in its service territory. It also offers appliance services and repairs to customers throughout its service territory and invests in regulated solar generation projects and regulated energy efficiency (EE) and related programs in New Jersey.\n\n\n•\nPSEG Power\n—A Delaware limited liability company formed in 1999 as a result of the deregulation and restructuring of the electric power industry in New Jersey. PSEG Power earns revenues from its nuclear generation and marketing of power and natural gas to hedge business risks and the value of its portfolio of nuclear power plants, other contractual arrangements and gas storage facilities. \n\n\nIn February 2022, we completed the sale of our 6,750 megawatt (MW) fossil generation portfolio which represented an important milestone in our strategy.\n \n\n\nOur other direct wholly owned subsidiaries are: PSEG Long Island LLC (PSEG LI), which operates the Long Island Power Authority’s (LIPA) electric transmission and distribution (T&D) system under a contractual agreement; PSEG Energy Holdings L.L.C. (Energy Holdings), which primarily holds our legacy lease investments and competitively bid, FERC regulated transmission; and PSEG Services Corporation (Services), which provides us and our operating subsidiaries with certain management, administrative and general services at cost.\n\n\n1\n\n\n\n\nTable of Contents\n\n\n \n\n\nOPERATIONS\n AND STRATEGY\n\n\nPSE&G\n\n\nOur regulated T&D public utility, PSE&G, distributes electric energy and natural gas to customers within a designated service territory running diagonally across New Jersey where approximately 6.8 million people, or about 74% of New Jersey’s population resides.\n \n\n\n\n\nProducts and Services\n\n\nOur utility operations primarily earn margins through:\n\n\n•\nTransmission\n—the movement of electricity at high voltage from generating plants to substations and transformers, where it is then reduced to a lower voltage for distribution to homes, businesses and industrial customers. Our revenues for these services are based upon tariffs approved by the Federal Energy Regulatory Commission (FERC).\n\n\n•\nDistribution\n—the delivery of electricity and gas to the retail customer’s home, business or industrial facility. Our revenues for these services are based upon tariffs approved by the New Jersey Board of Public Utilities (BPU).\n\n\nThe commodity portion of our utility business’ electric and gas sales is managed by basic generation service (BGS) and basic gas supply service (BGSS) suppliers. Pricing for those services is set by the BPU as a pass-through, resulting in no margin for our utility operations.\n\n\nIn addition, we continue to invest in and pursue opportunities in regulated clean energy programs, including EE, electric vehicle (EV) make-ready charging infrastructure and other potential investments.\n\n\nWe\n also earn margins through competitive services, such as appliance repair, in our service territory.\n\n\nHow PSE&G Operates\n\n\nWe are a transmission owner in PJM Interconnection, L.L.C. (PJM) which is an Independent System Operator (ISO) and Regional Transmission Organization (RTO) that operates the electric transmission system in the Mid-Atlantic Region,\n \n\n\n2\n\n\n\n\nTable of Contents\n\n\n \n\n\nincluding New Jersey and the surrounding states. We provide distribution service to 2.4 million electric customers and 1.9 million gas customers in a service area that covers approximately 2,600 square miles running diagonally across New Jersey. We serve the most densely populated, commercialized and industrialized territory in New Jersey, including its six largest cities and approximately 300 suburban and rural communities.\n \n\n\nTransmission\n\n\nWe use formula rates for our transmission cost of service and investments. Formula rates provide a method of rate recovery where the transmission owner annually determines its revenue requirements through a fixed formula that provides for a recovery of our operating costs and a return of and on our capital investments in the system, net of accumulated depreciation and deferred tax liabilities (also known as rate base) using an approved return on equity (ROE) in developing the weighted average cost of capital. Under this formula, rates are put into effect in January of each year based upon our internal forecast of annual expenses and capital expenditures. Rates are subsequently trued up to reflect actual annual expenses and capital expenditures. Our transmission revenues are not impacted by sales volumes. Our current approved transmission rates provide for a base ROE of 9.90% and a 50 basis point adder for our membership in PJM as an RTO. See Item 7. MD&A—Executive Overview of 2024 and Future Outlook for additional information.\n\n\nDistribution\n\n\nPSE&G distributes electricity and natural gas to end users in our respective franchised service territories. Our distribution rates are subject to periodic rate cases approved by the BPU. In October 2024, the BPU issued an Order approving the settlement of PSE&G’s electric and gas distribution base rate case with new rates effective October 15, 2024. The Order provides for a $17.8 billion rate base, a 9.6% return on equity for PSE&G’s distribution business and a 55% equity component of its capitalization structure. For additional information, see Item 8. Note 6. Regulatory Assets and Liabilities.\n\n\nThe BPU has also approved a series of PSE&G infrastructure, EE, EV and renewable energy investment programs with cost recovery through various clause mechanisms. For a discussion of proposed and approved programs, see Investment Clause Programs as follows and Item 7. MD&A—Executive Overview of 2024 and Future Outlook.\n \n\n\nOur load requirements are split among commercial, residential and industrial customers, as shown in the following table for 2024:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n% of 2024 Sales\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nCustomer Type\n\n\n \n\n\nElectric\n\n\n \n\n\n \n\n\nGas\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nCommercial\n\n\n \n\n\n \n\n\n57\n\n\n%\n\n\n \n\n\n \n\n\n38\n\n\n%\n\n\n \n\n\n\n\n\n\n \n\n\nResidential\n\n\n \n\n\n \n\n\n34\n\n\n%\n\n\n \n\n\n \n\n\n58\n\n\n%\n\n\n \n\n\n\n\n\n\n \n\n\nIndustrial\n\n\n \n\n\n \n\n\n9\n\n\n%\n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n \n\n\n\n\n\n\n \n\n\nTotal\n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nOur customer base has modestly increased since 2020, with electric and gas loads changing as illustrated in the following table:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nElectric and Gas Distribution Statistics\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nNumber of\nCustomers as of December 31, 2024\n\n\n \n\n\nHistorical Annual\nCustomer Growth\n2020-2024\n\n\n \n\n\nElectric Sales and\nFirm Gas Sales for the Year Ended December 31, 2024 (A)\n\n\n \n\n\nHistorical Annual\nLoad Decline\n2020-2024\n\n\n \n\n\n\n\n\n\n \n\n\nElectric\n\n\n \n\n\n2.4 Million\n\n\n \n\n\n0.9%\n\n\n \n\n\n40,651 Gigawatt hours\n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\n \n\n\nGas\n\n\n \n\n\n1.9 Million\n\n\n \n\n\n0.7%\n\n\n \n\n\n2,371 Million Therms\n\n\n \n\n\n(1.7)%\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(A)\nExcludes sales from Gas rate classes that do not impact margin, specifically Contract, Non-Firm Transportation, Cogeneration Interruptible and Interruptible Services. \n\n\n3\n\n\n\n\nTable of Contents\n\n\n \n\n\nAs part of the BPU's approval of the Clean Energy Future-Energy Efficiency (CEF-EE) filing in 2021, we implemented the Conservation Incentive Program (CIP) that trues up PSE&G’s distribution margin to a rate case-approved baseline per customer for the majority of our customers. As a result, electric gas sales volumes and demands are no longer a driver of our margin and over 90% of our Electric and Gas Distribution margin will only vary based upon the number of customers. While load has modestly decreased in the past due to a decline in larger industrial customers, greater EE and other factors, a significant increase in load is anticipated due to the increasing adoption of EVs, the expansion of data centers and other large users in our area, ongoing growth in the number of customers, other sources of electrification and other factors, which will collectively drive the need for increased system investment.\n\n\nInvestment Clause Programs\n \n\n\nThe following table lists our major approved investment clause programs that are in progress:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nProgram\n\n\n \n\n\nInvestment\n\n\n \n\n\nApproval\nDate\n\n\n \n\n\nTerm of\nInvestment\n\n\n \n\n\n \n\n\nYear Started\n\n\n \n\n\n\n\n\n\n \n\n\nCEF-EE\n\n\n \n\n\n$1 billion\n\n\n \n\n\n2020\n\n\n \n\n\n5 years\n\n\n(A)\n\n\n \n\n\n2020\n\n\n \n\n\n\n\n\n\n \n\n\nCEF-EE Extension\n\n\n \n\n\n$280 million\n\n\n \n\n\n2023\n\n\n \n\n\n9 months\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\nCEF-EE Extension II\n\n\n \n\n\n$300 million\n\n\n \n\n\n2024\n\n\n \n\n\n6 months\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nCEF-EE II\n\n\n \n\n\n$2.9 billion\n\n\n \n\n\n2024\n\n\n \n\n\n6 years\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n\n\n\n\n \n\n\nCEF-EV\n\n\n \n\n\n$166 million\n\n\n \n\n\n2021\n\n\n \n\n\n~6 years\n\n\n \n\n\n \n\n\n2021\n\n\n \n\n\n\n\n\n\n \n\n\nEnergy Strong II Program\n\n\n \n\n\n$842 million\n\n\n \n\n\n2019\n\n\n \n\n\n4 years\n\n\n(B)\n\n\n \n\n\n2019\n\n\n \n\n\n\n\n\n\n \n\n\nGas System Modernization Program II (GSMP II) Extension\n\n\n \n\n\n$902 million\n\n\n \n\n\n2023\n\n\n \n\n\n2 years\n\n\n(C)\n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\nInfrastructure Advancement Program (IAP)\n\n\n \n\n\n$511 million\n\n\n \n\n\n2022\n\n\n \n\n\n4 years\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(A)\nRolling three-year program with over 80% of spending within 5 years, with limited spending thereafter.\n\n\n(B)\nThe program has a small amount of trailing costs expected to be spent in year 5. \n\n\n(C)\nThe program has a small amount of trailing costs expected to be spent in year 3.\n\n\nTo date, we launched three of the four components of our\n CEF\n:\n\n\n•\nEE\n—designed to achieve EE targets required under New Jersey’s Clean Energy Act through a suite of ten programs for residential, C&I programs, including low-income, multi-family, small business and local government. \n\n\n•\nEnergy Cloud (EC)\n—driven by the implementation of “smart meters,” and new software and product solutions to improve our processes and better manage the electric grid.\n\n\n•\nEV\n—primarily relating to preparatory work to deliver infrastructure to the charging point for three programs: residential smart charging; Level-2 mixed use charging; and direct current (dc) fast charging.\n\n\nOur CEF-Energy Storage (ES) program, which was filed with the BPU in October 2018, is being held in abeyance.\n \n\n\nGSMP II Extension\n—designed to replace at least 400 miles of cast iron and unprotected steel mains and services in our gas system.\n\n\nEnergy Strong II Program\n—structured to harden, modernize and improve the resiliency of our electric and gas distribution systems.\n \n\n\nIAP\n—designed to improve the reliability of the “last mile” of our electric distribution system and address aging substations and gas metering and regulation stations.\n \n\n\nSee Item 7. MD&A—Executive Overview of 2024 and Future Outlook for additional information.\n\n\nSolar Generation\n \n\n\nWe have also undertaken solar initiatives at PSE&G, which primarily invest in utility-owned solar photovoltaic (PV) grid-connected solar systems installed on PSE&G property and third-party sites with our economics driven by our net investment in solar, with a contemporaneous return on that rate base.\n \n\n\n4\n\n\n\n\nTable of Contents\n\n\n \n\n\nSupply\n\n\nWe make no margin on the default supply of electricity and gas since the actual costs are passed through to our customers.\n\n\nAll electric and gas customers in New Jersey have the ability to choose their electric energy and/or gas supplier. Pursuant to BPU requirements, we serve as the supplier of last resort for two types of electric and gas customers within our service territory that are not served by another supplier. The first type provides default supply service for smaller C&I customers and residential customers at seasonally-adjusted fixed prices for a three-year term (BGS-Residential Small Commercial Pricing (RSCP)). These rates change annually on June 1 and are based on the average price obtained at auctions in the current year and two prior years. The second type provides default supply for larger customers, with energy priced at hourly PJM real-time market prices for a contract term of 12 months (BGS-Commercial Industrial Energy Pricing).\n\n\nWe procure the supply to meet our BGS obligations through auctions authorized by the BPU for New Jersey’s total BGS requirement. These auctions take place annually in February. Once approved by the BPU, electricity prices for BGS service are set. Approximately one-third of PSE&G’s total BGS-RSCP eligible load is auctioned each year for a three-year term. For information on current prices, see Item 8. Note 13. Commitments and Contingent Liabilities.\n \n\n\nPSE&G procures the supply requirements of its default service BGSS gas customers through a full-requirements contract with PSEG Power. The BPU has approved a mechanism designed to recover all gas commodity costs related to BGSS for residential customers. BGSS filings are made annually by June 1 of each year, with a targeted effective date of provisional rates by October 1. PSE&G’s revenues are matched with its costs using deferral accounting, with the goal of achieving a zero cumulative balance by September 30 of each year. In addition, we have the ability to put in place two self-implementing BGSS increases on December 1 and February 1 of up to 5% and also may reduce the BGSS rate at any time and/or provide bill credits. Any difference between rates charged under the BGSS contract and rates charged to our residential customers is deferred and collected or refunded through adjustments in future rates. C&I customers that do not select third-party suppliers are also supplied under the BGSS arrangement. These customers are charged a market-based price largely determined by prices for commodity futures contracts.\n\n\nPSEG Power & Other\n\n\nPSEG Power & Other is predominantly comprised of its nuclear generation assets, its natural gas supply operations, the Operating Services Agreement (OSA) of PSEG LI with LIPA, and other legacy investments. PSEG Power is a public utility within the meaning of the Federal Power Act (FPA) and the payments it receives and how it operates are subject to FERC regulation.\n \n\n\nPSEG Power\n\n\nProducts and Services\n\n\nAs a nuclear generation owner and operator, our revenue has been derived primarily from energy, capacity and ancillary services sold to PJM in the spot markets. These products and services may also be transacted through exchange markets or bilaterally.\n \n\n\nIn August 2022, the Inflation Reduction Act (IRA) was signed into law expanding incentives that promote carbon-free generation. The enacted legislation established the production tax credit (PTC) for electricity generation using nuclear energy, which began January 1, 2024 and is available through 2032. PSEG Power’s nuclear plants are expected to benefit from the PTC. The expected PTC rate is up to $15 per megawatt hour (MWh) subject to adjustment based upon a facility’s gross receipts and meeting prevailing wage rules. The PTC rate and the gross receipts threshold are subject to annual inflation adjustments. Until additional guidance is issued by the U.S. Treasury, the final realized value of the PTC is subject to adjustment, which may be material.\n\n\nPSEG Power also sells wholesale natural gas, primarily through a full-requirements BGSS contract with PSE&G to meet the needs of PSE&G’s default service customers. In 2022, the BPU approved an extension of the long-term BGSS contract to March 31, 2027, and thereafter the contract remains in effect unless terminated by either party with a two-year notice.\n\n\n5\n\n\n\n\nTable of Contents\n\n\n \n\n\nPSEG Power supplies PSE&G’s peak daily gas requirements through its balanced portfolio of firm gas transportation capacity, storage contracts, contract peaking supply, and liquefied natural gas and propane. Based upon the availability of natural gas beyond PSE&G’s actual daily needs, PSEG Power sells gas to other customers and shares these proceeds with PSE&G’s customers.\n\n\nHow PSEG Power’s Nuclear Generation Operates\n\n\nAs of December 31, 2024, PSEG Power had 3,758 MW of nuclear generation capacity. All of our nuclear generation capacity is located in New Jersey and Pennsylvania.\n\n\nGeneration Dispatch\n\n\nOur nuclear generation is considered to be base load. Base load units run the most and typically are called to operate whenever they are available. Variable operating costs are low due to the combination of highly efficient operations and the use of relatively lower-cost fuels. Performance is generally measured by the unit’s “capacity factor,” or the ratio of the actual output to the theoretical maximum output.\n \n\n\nIn PJM, owners of power plants specify prices at which they are prepared to generate and sell energy based on the marginal cost of generating energy from each individual unit. Typically, the bid price of the last unit dispatched by PJM establishes the energy market-clearing price.\n \n\n\nThis method of determining supply and pricing creates a situation where natural gas prices often have a major influence on the price that generators will receive for their output, especially in periods of relatively strong or weak demand. Therefore, changes in the price of natural gas will often translate into changes in the wholesale price of electricity and will continue to have a strong influence on the price of electricity in the markets in which we operate.\n \n\n\nMarket wholesale prices may vary by location resulting from congestion or other factors and do not necessarily reflect our contract prices. Forward prices are volatile and there can be no assurance that current forward prices will remain in effect or that we will be able to contract output at these forward prices. The PTC is expected to mitigate our downside exposure to this volatility and provide support for the nuclear units.\n\n\nNuclear Fuel Supply\n\n\nWe have long-term contracts for nuclear fuel. These contracts provide for:\n\n\n•\npurchase of uranium (concentrates and uranium hexafluoride),\n\n\n•\nconversion of uranium concentrates to uranium hexafluoride,\n\n\n•\nenrichment of uranium hexafluoride, and\n\n\n•\nfabrication of nuclear fuel assemblies.\n\n\nWe expect to be able to meet the nuclear fuel supply demands of our operations. However, there are limited suppliers for certain aspects of this supply chain and the ability to maintain an adequate fuel supply could be affected by several factors not within our control, including changes in prices and demand, tariffs, curtailments by suppliers, severe weather, environmental regulations, war and hostilities, and other factors. For additional information and a discussion of risks, see Item 1A. Risk Factors, Item 7. MD&A—Executive Overview of 2024 and Future Outlook and Item 8. Note 13. Commitments and Contingent Liabilities.\n\n\nMarkets and Market Pricing\n \n\n\nAll of PSEG Power’s nuclear generation assets are located within the PJM RTO.\n \n\n\nOur nuclear generating units’ performance, market prices and the PTC, have a considerable effect on our profitability. The PTC is designed to increase with inflation, and therefore, future inflation levels will impact the financial support of the nuclear units. In addition, market revenues in excess of the PTC threshold would provide incremental benefit.\n \n\n\nPSEG Power’s Salem 1, Salem 2 and Hope Creek nuclear plants have also been awarded zero emission certificates (ZECs) by the BPU through May 2025. These nuclear plants are expected to receive ZEC revenue from the electric distribution companies (EDCs) in New Jersey, which is equivalent to approximately $10/MWh. ZEC revenue recorded is reduced by the\n \n\n\n6\n\n\n\n\nTable of Contents\n\n\n \n\n\nestimated production tax credits (PTCs) generated from PSEG Power’s Salem 1, Salem 2, and Hope Creek nuclear plants. ZEC revenue will be adjusted based upon the actual amount of the PTCs when guidance is issued on how to calculate gross receipts and that adjustment could be material.\n\n\nIn addition to energy sales, we earn revenue from capacity payments for our generating assets. These payments are compensation for committing our generating units to PJM for dispatch at its discretion. Capacity payments reflect the value to PJM of assurance that there will be sufficient generating capacity available at all times to meet system reliability and energy requirements.\n \n\n\nIn PJM the market design for capacity payments provides for a forward-looking, capacity pricing mechanism through the Reliability Pricing Model (RPM). For additional information regarding auction delays, complaints against PJM regarding RPM, PJM and FERC actions related to the capacity market construct and resulting market uncertainty, see Regulatory Issues—Federal Regulation.\n \n\n\nThe prices to be received by generating units in PJM for capacity have been set through RPM base residual and incremental auctions and depend upon the zone in which the generating unit is located. The average capacity prices that PSEG expects to receive from the base residual and incremental auctions which have been completed are disclosed in Item 8. Note 2. Revenues.\n \n\n\nIn addition, the PJM capacity market imposes performance obligations and non-performance penalties on resources during times of system stress. These rules provide an opportunity for bonus payments or require the payment of penalties depending on whether a unit is available during a performance interval.\n\n\nHedging Strategy\n\n\nThe PTC is intended to provide sufficient and stable support for nuclear units and was effective January 2024. To mitigate volatility in our results, we seek to contract in advance to hedge the price exposure for a significant portion of our anticipated electric output, capacity and fuel needs. The expected PTC rate is up to $15/MWh subject to adjustment based upon a facility’s gross receipts. While the PTC eligibility period began in January 2024, the U.S. Treasury has yet to issue guidance regarding the definition of gross receipts. We continue to analyze the impact of the IRA on our nuclear units, including potential future guidance from the U.S. Treasury, potential impacts on hedging strategies and overall financial support.\n \n\n\nWe historically have sold a portion of our anticipated generation over a multi-year forward horizon, normally over a period of two to three years. Beginning in 2024, our hedging strategy has incorporated an estimated range of risk reduction impacts from the PTCs on our nuclear generation portfolio while retaining the ability to benefit when market pricing exceeds the phase out threshold. As of December 31, 2024, we expect that our hedged position for 2025 in conjunction with the PTC and market price variability will result in the realized value of our nuclear generation output being at, or above, the PTC phase out. Our strategy will continue to evolve given PTC guidance uncertainty, and potential incremental changes upon final U.S. Treasury guidance.\n\n\nGenerally, we seek to hedge the financial risks of our generation through sales at PJM West or other nodes corresponding to our generation portfolio. Our hedge transactions in PJM generally reflect energy sales at the liquid PJM Western Hub or other basis locations when available and other transactions that seek to secure price certainty for our energy output. Our hedging practices help to manage some of the volatility of the nuclear generation business when forward prices are greater than the PTC threshold. While this limits our exposure to decreasing prices, our ability to realize benefits from rising market prices is also limited.\n \n\n\nOur fuel strategy is to maintain certain levels of uranium in inventory and to make periodic purchases to support such levels. Our nuclear fuel commitments cover approximately 100% of our estimated uranium, enrichment and fabrication requirements through 2027 and a significant portion through 2028.\n \n\n\n \n\n\n7\n\n\n\n\nTable of Contents\n\n\n \n\n\nLIPA Operations Services Agreement (OSA)\n\n\nPSEG LI has been operating LIPA’s electric T&D system in Long Island, New York since 2014 under a 12-year OSA with LIPA that expires on December 31, 2025. Under the OSA, PSEG LI acts as LIPA’s agent in performing many of its obligations and in return (a) is prefunded for pass-through operating expenditures, (b) receives a fixed management fee and (c) is eligible to receive an incentive fee contingent on meeting established performance metrics. PSEG is participating in a process to continue as operations service provider for LIPA’s electrical transmission and distribution system, with resolution expected in the first half of 2025. It is uncertain whether the OSA will be renewed.\n\n\nCompetitively Bid, FERC Regulated Transmission Projects\n\n\nPSEG continues to evaluate investment opportunities in regulated transmission beyond PSE&G.\n \nIn December 2023, PJM awarded us an approximately $424 million project to construct a 500 kV transmission line to address increasing load and reliability issues in Maryland and northern Virginia as part of its 2022 Window 3 competitive solicitation. PJM directed that the project be placed in service in 2027.\n \n\n\nPSEG will continue to evaluate opportunities to participate in transmission solicitation processes and may decide to submit bids for these opportunities, some of which could be material investments. For additional information, see Item 7. MD&A— Executive Overview of 2024 and Future Outlook.\n\n\nEnergy Holdings\n \n\n\nEnergy Holdings maintains our portfolio of legacy lease investments. See Item 8. Note 8. Long-Term Investments and Note 9. Financing Receivables for additional information.\n\n\nEnergy Holdings also owns 50% of Garden State Offshore Energy LLC (GSOE) which holds rights to an offshore wind lease area just south of New Jersey. We are evaluating our options for the potential sale of our interest in GSOE.\n \n\n\nCOMPETIT\nIVE ENVIRONMENT\n\n\nPSE&G\n\n\nOur T&D business is not affected when customers choose alternate electric or gas suppliers since we earn our return on our net investment in rate base to provide T&D service, not by supplying the commodity. Based on our transmission formula rate and the CIP program for electric and gas distribution, we are also minimally impacted by changes in customers’ usage. Our growth is driven by (i) our investment program to deliver energy more reliably by investing to meet anticipated demand growth and modernizing our electric transmission and electric and gas distribution system and (ii) investing in programs that meet State targets to help deliver cleaner energy, including our EE programs to help customers use less energy and investment programs to build EV infrastructure and solar generation. There may also be opportunities to expand into related clean energy areas, such as renewable natural gas, hydrogen, energy storage, additional solar and renewables, and broader EE investments, though utility participation in these areas is subject to regulatory approval and market design, which continues to evolve. That growth can be affected by customer cost pressures which could result from higher commodity costs, higher supply costs to support subsidized renewable generation, higher operating costs, higher tax rates, macro-economic conditions including inflation, and other factors. Further rate regulated recovery methods, such as net metered generation and/or changes in customer usage behavior could lead to a reduction in billed customer usage to recover our costs, resulting in higher rates overall. Conversely, an increase in EV adoption and other factors could lead to an increase in system usage, require incremental investments to meet higher peak demands and result in a larger customer usage base. There could also be a shift toward greater electrification and less gas usage in the coming decades. While current costs and relative emission savings would limit any substantial change in the near term, technological advances for heat pumps, actions by certain jurisdictions in our service territory and other factors could drive these potential changes, which could result in a slowing in the growth of our gas distribution and an increase in the growth of our electric T&D business. Our CIP reduces the impact on our distribution revenues from changes in sales volumes and demand for most customers. The CIP, which is calculated annually, provides for a true-up of our current period revenue as compared to revenue thresholds established in our most recent\n \n\n\n8\n\n\n\n\nTable of Contents\n\n\n \n\n\ndistribution base rate proceeding. Recovery under the CIP is subject to certain limitations, including an actual versus allowed ROE test and ceilings on customer rate increases.\n \n\n\nChanges previously ordered by FERC and implemented by PJM and other ISOs to eliminate contractual provisions that previously provided us a “right of first refusal” to construct new transmission projects in our service territory could result in third-party construction of transmission lines in our area in the future and also allow us to seek opportunities to build in other service territories. While there has been minimal impact so far, these rules continue to evolve so both the extent of the risk within our service territory and the opportunities for our transmission business elsewhere remain difficult to assess.\n \n\n\nPSEG Power\n\n\nVarious market participants compete with us and one another in transacting in the wholesale energy markets \nand\n entering into bilateral contracts. Our competitors include\n \nbut are not limited to merchant generators, utility generators, energy marketers, retailers, private equity firms, and other financial entities.\n\n\nAnticipated demand growth and the pace of that relative to retirements of existing firm generation and new additions of intermittent and firm generation capacity, as well as subsidized generation capacity, or technological advances could impact forward market prices in the future.\n \n\n\nPJM has a capacity market that has been approved by FERC. FERC regulates this market and must approve market design rule changes proposed by PJM. For information regarding recent actions by FERC relating to capacity market design, see the discussion in Regulatory Issues—Federal Regulation.\n\n\nEnvironmental issues could also impact our competitiveness, including requirements regarding capital investments at our nuclear stations, such as cooling towers, and could lead to a material adverse effect, while other actions to further regulate carbon dioxide\n \nemissions could better position our nuclear plants.\n \n\n\nHUMAN CAPI\nTAL MANAGEMENT\n\n\nOur human capital management strategy is integrated with our overall business strategy. Our Values and strong culture of inclusion support our goal to attract, develop and retain a high performing diverse workforce - one with the skill sets to succeed in a rapidly evolving environment.\n\n\nWe believe in treating people with dignity and respect, protecting each of our fundamental human rights, and striving to maintain the high standards of ethical conduct on which our business and reputation have been built.\n \n\n\nThe Organization and Compensation Committee of the PSEG Board of Directors is responsible for the oversight of PSEG’s human capital management strategy and risks. It is updated regularly on matters related to culture, executive compensation, and leadership succession and development. Safety metrics, such as Occupational Safety and Health Administration (OSHA) recordable incidence rate, OSHA days away from work rate, and serious injury incidence rate, are regularly monitored and reported to our Board.\n\n\nSixty percent of our workforce is represented by six unions under various collective bargaining agreements that cover wages, benefits and other terms and conditions of employment. Our current agreements with all six unions remain in place until 2027 and support strategic objectives and business goals.\n\n\nThe following chart presents our total employee population indicating percentages of employees that are represented by a labor organization:\n \n\n\n\n\n9\n\n\n\n\nTable of Contents\n\n\n \n\n\nAs of December 31, 2024, women constituted approximately 27% of our non-represented employees and 19% of our total workforce. People who are racially/ethnically diverse constituted approximately 34% of our non-represented employees and 30% of our total workforce.\n\n\nSafety and Security\n\n\nThe safety and security of our employees and the public are integrated into our culture and business operations. We demonstrate this by providing support to employees so that everyone is empowered and encouraged to question, stop and correct any unsafe act or condition and provide feedback on safety and security matters. We take measures to provide employees with proper knowledge, training and protective equipment to maintain their personal health and safety and to mitigate workplace risks.\n \n\n\nEmployee Experience & Engagement\n\n\nWe provide our dedicated workforce the tools, the resources and an inclusive workplace culture to deliver safe and reliable energy to our customers. Under our Inclusion for All program, we embrace a broad definition of diversity as reflected in our Values where we look to embrace each other’s differences. Our efforts are supported by our Employee Business Resource Groups and Local Inclusion Teams within our business units and field locations. We seek to offer opportunities that are relevant and accessible to all employees, including community outreach, volunteerism, mentorship, recognition and professional development.\n\n\nTo determine if we are being responsive to the needs of our employees, we routinely assess the impact of our work by soliciting employee feedback through focus groups, listening sessions, pulse surveys and a biennial employee engagement survey.\n \n\n\nTalent Management\n \n\n\nOur recruitment strategy is focused on hiring a workforce to meet our business objectives, including critical skilled trade roles. We have a comprehensive workforce planning strategy to support our hiring needs. It includes hiring ahead of attrition for skilled trade roles, community outreach, workforce development and strategic sourcing with key external partners like trade schools, colleges, county workforce development boards, and other non-profit partners.\n \n\n\nWe value the growth and development of all our employees and offer a variety of opportunities to enhance their skills and abilities. We hold talent reviews and succession discussions regularly for leadership and critical positions to support workforce planning. We use tailored development opportunities and other tools to build a strong internal pipeline that is ready to take the next step in their careers. We continue to focus on upskilling our skilled trade roles to adapt to evolving technologies and digital advancements.\n\n\nTotal Rewards Program\n\n\nWe support the well-being of our employees through a comprehensive total rewards program. We provide competitive compensation to our workforce and a benefit program that is designed to support emotional and physical health as well as financial wellness and wellbeing.\n\n\nREGULAT\nORY ISSUES\n \n\n\nIn the ordinary course of our business, we are subject to regulation by, and are party to various claims and regulatory proceedings with FERC, the BPU, the Commodity Futures Trading Commission (CFTC) and various state and federal environmental regulators, among others. For information regarding material matters, other than those discussed below, see Item 8. Note 13. Commitments and Contingent Liabilities. In addition, information regarding PSE&G’s specific filings pending before the BPU is discussed in Item 8. Note 6. Regulatory Assets and Liabilities.\n\n\nFederal Regulation\n\n\nFERC is an independent federal agency that regulates the transmission of electric energy and natural gas in interstate commerce and the sale of electric energy and natural gas at wholesale pursuant to the FPA and the Natural Gas Act. PSE&G and certain operating subsidiaries of PSEG Power are public utilities as defined by the FPA. FERC has extensive oversight\n \n\n\n10\n\n\n\n\nTable of Contents\n\n\n \n\n\nover such public utilities. FERC approval is usually required when a public utility seeks to: sell or acquire an asset that is regulated by FERC (such as a transmission line or a generating station); collect costs from customers associated with a new transmission facility; charge a rate for wholesale sales under a contract or tariff; or engage in certain mergers and internal corporate reorganizations.\n \n\n\nFERC also regulates RTOs/ISOs, such as PJM, and their regional transmission planning processes as well as their energy and capacity markets.\n\n\nTransmission Regulation\n\n\nFERC has exclusive jurisdiction to establish the rates and terms and conditions of service for interstate transmission. We currently have FERC-approved formula rates in effect to recover the costs of our transmission facilities. Under this formula, rates are put into effect in January of each year based upon our internal forecast of annual expenses and capital expenditures. Rates are subsequently trued up to reflect actual annual expenses and capital expenditures.\n \n\n\nTransmission Rate Proceedings and ROE\n—From time to time, various matters are pending before FERC relating to, among other things, transmission planning and transmission rates and returns, including incentives. Depending on their outcome, any of these matters could materially impact our results of operations and financial condition.\n\n\nIn a rulemaking proceeding issued in 2021, FERC proposed to eliminate the existing 50 basis point adder for RTO membership, which is currently available to PSE&G and other transmission owners in RTOs. Elimination of the RTO adder for RTO membership would reduce PSE&G’s annual Net Income and annual cash inflows by approximately $40 million.\n\n\nTransmission Planning Proceedings\n—Through rulemaking proceedings, FERC continues to determine whether changes are needed to current transmission and interconnection planning rules to facilitate the integration of renewable resources onto the grid. FERC is also examining whether there is sufficient oversight over transmission costs to protect customers. Among other issues, FERC is considering whether transmission competitive solicitations are working as intended, whether interconnection queue rules for new generation should dramatically change and whether some type of transmission monitor construct to oversee costs should be imposed.\n \n\n\nOn the interconnection front, in July 2023, FERC issued a Final Rule,\n \nwhich parties have challenged on rehearing, that will require RTOs to implement rules to speed up the processing of interconnection queue requests. This rule may also result in penalties being imposed on generators, RTOs and transmission owners that fail to meet certain process deadlines. In December 2024, PJM submitted proposed revisions to the PJM Tariff to provide for a reliability based expansion of the interconnection queue window so that a limited number of additional generating resources (50 projects) needed to address PJM’s reliability challenges can be added to this interconnection cycle. FERC accepted this proposal in February 2025, which will allow PJM to accelerate the interconnection of new, \"shovel-ready\" generation capacity resources and may facilitate PSEG's plan to implement power uprates for both Salem Unit 1 and Unit 2.\n \n\n\nIn May 2024, FERC issued a Final Rule on transmission planning and cost allocation. As a result of this rule, RTOs like PJM will be required to engage in 20-year transmission planning, applying certain scenarios to the planning process. FERC also reinstated the Right of First Refusal for a discrete category of transmission projects. On rehearing, FERC expanded the states' role in the process for determining how transmission costs will be allocated to various sets of customers. PJM is currently in the process of developing a plan to implement the rule.\n\n\nIn December 2024, a coalition of industrial customers and state ratepayer advocates filed a complaint at FERC against various named public utilities and RTOs/ISOs, including PJM. The complaint alleges that local planning has produced inefficient planning and projects that are not cost-effective, and therefore requests that FERC require the application of regional planning requirements, including relevant competitive solicitation processes, to all transmission facilities over 100kV. The complaint also requests that FERC require RTOs/ISOs to appoint an “Independent System Planner” to oversee transmission planning. While PSEG is not a named party in the complaint, our local planning authority and rights may be impacted by the resolution of this proceeding. We cannot predict the outcome of this proceeding.\n \n\n\nRegulation of Wholesale Sales—Generation/Market Issues/Market Power\n\n\nUnder FERC regulations, public utilities that wish to sell power at market rates must receive FERC authorization (market-based rate (MBR) authority) to sell power in interstate commerce before making power sales. They can sell power at cost-based rates or apply to FERC for authority to make MBR sales. For a requesting company to receive MBR authority, FERC\n \n\n\n11\n\n\n\n\nTable of Contents\n\n\n \n\n\nmust first determine that the requesting company lacks market power in the relevant markets and/or that market power in the relevant markets is sufficiently mitigated. Certain PSEG companies are public utilities and currently have MBR authority. These companies, which include PSEG Energy Resources & Trading LLC, PSEG Nuclear LLC and PSE&G must file at FERC every three years to update their market power analyses. At the end of 2022, PSEG filed such a market power update at FERC, which remains pending.\n\n\nIn October 2024, FERC issued a Final Rule that eliminates compensation for reactive power in circumstances when the generator is operating within the normal power factor range specified in its interconnection agreement. PSEG Power currently receives reactive power compensation, and we have sought rehearing of this Final Rule. In January 2025, PJM made a compliance filing at FERC seeking approval to delay implementation of the rule, and the resulting prospective loss of reactive power compensation for generators like PSEG Power within the PJM footprint, until June 1, 2026. The loss of reactive power compensation is not expected to have a material impact on PSEG's results of operations.\n\n\nIn addition, there are several ongoing proceedings at FERC that may impact future co-located customer arrangements, such as data centers, involving the supply of power from nuclear units, including whether certain data center customers, depending on their configuration, will pay transmission service charges. FERC is also broadly examining issues concerning whether and to what extent there are potential reliability, cost and customer impacts raised by the location of large customers at generating facilities. In February 2025, FERC issued a show cause order directing PJM and PJM transmission owners to explain within 30 days why the PJM tariff is just and reasonable or, alternatively, what revisions might be necessary, to address perceived gaps in the PJM tariff with respect to co-located load arrangements. We cannot predict the outcome of these proceedings.\n \n\n\nEnergy Clearing Prices\n \n\n\nEnergy clearing prices in the markets in which we operate are generally based on bids submitted by generating units. Under FERC-approved market rules, bids are subject to price caps and mitigation rules applicable to certain generation units. FERC rules also govern the overall design of these markets. At present, all units, including those owned by PSEG, within a delivery zone receive a clearing price based on the bid of the marginal unit (i.e., the last unit that must be dispatched to serve the needs of load) which can vary by location.\n \n\n\nCapacity Market Issues\n\n\nPJM operates a capacity market called the Reliability Pricing Model (RPM), the rules for which are approved by FERC. RPM incorporates\n \na forward auction for installed capacity. Under the RPM, generators located in constrained areas within PJM are paid more for their capacity as an incentive to ensure adequate supply where generation capacity is most needed. The mechanics of the RPM in PJM continue to evolve and be refined in stakeholder proceedings and FERC proceedings in which we are active.\n\n\nOver the past several months, there have been significant activities related to PJM’s capacity market. PJM has delayed capacity auctions for the next three delivery years (2027/28, 2028/29 and 2029/30). Three complaints were filed against PJM alleging that PJM’s capacity market rules have resulted in unjust and unreasonable capacity prices, and seeking to produce short-term increases in supply in the market and a short-term decrease in clearing prices. PJM has also made filings to change its rules to address concerns raised in the complaints, including tariff revisions filed in February 2025 with FERC proposing a collar of $175 per MW-day floor and $325 per MW-day ceiling on capacity prices for the next two delivery years. These ongoing proceedings, as well as potential future proceedings, may affect the future design of the capacity market. We cannot predict the outcome of these proceedings or their impact on our business, results of operations and cash flows.\n \n\n\nCompliance\n\n\nReliability Standards—\nPSEG is required to comply with the North American Electric Reliability Corporation (NERC) Reliability Standards, promulgated by NERC and approved by FERC, which are designed to ensure the security and reliability of the United States electric transmission and generation system (the “electric grid”). As a result, PSEG is subject to requirements governing the planning and operation of the electric grid, and requirements governing the physical and cyber security of PSEG assets that are used to protect and operate the electric grid. Due to the increasing sophistication of physical and cyber security threats to the security and reliability of the electric grid, it is anticipated that FERC and NERC will continue to promulgate new Reliability Standards, and modify existing Reliability Standards, to meet these challenges.\n \n\n\n12\n\n\n\n\nTable of Contents\n\n\n \n\n\nCFTC\n\n\nIn accordance with the Dodd-Frank Wall Street Reform and Consumer Protection Act, the SEC and the CFTC continue to implement a regulatory framework for swaps and security-based swaps. The rules are intended to reduce risk, increase transparency and promote market integrity within the financial system by providing for the registration and comprehensive regulation of swap dealers and by imposing recordkeeping, data reporting, margin and clearing requirements with respect to swaps. We are currently subject to recordkeeping and data reporting requirements applicable to commercial end users. The CFTC finalized new rules establishing federal position limits for trading in certain commodities, such as natural gas. Entities such as PSEG began complying with the rules on January 1, 2022.\n \n\n\nNuclear\n\n\nNuclear Regulatory Commission (NRC)\n \n\n\nOur operation of nuclear generating facilities is subject to comprehensive regulation by the NRC, a federal agency established to regulate nuclear activities to ensure the protection of public health and safety, as well as the environment. Such regulation involves testing, evaluation and modification of all aspects of plant operation in light of NRC safety, security, cybersecurity, and environmental requirements. Continuous demonstration to the NRC that plant operations meet requirements is necessary.\n \n\n\nThe NRC has the ultimate authority to determine whether any U.S. nuclear generating unit may operate. The NRC conducts ongoing reviews of nuclear industry operations experience and may issue or revise regulatory requirements. We are unable to predict the final outcome of these reviews or the cost of any actions we would need to take to comply with any new regulations, including possible modifications to the Salem, Hope Creek and Peach Bottom facilities, but such costs could be material.\n \n\n\nThe current operating licenses of our nuclear facilities expire in the years shown in the following table:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nUnit\n\n\n \n\n\nYear\n\n\n \n\n\n\n\n\n\n \n\n\nSalem Unit 1\n\n\n \n\n\n2036\n\n\n \n\n\n\n\n\n\n \n\n\nSalem Unit 2\n\n\n \n\n\n2040\n\n\n \n\n\n\n\n\n\n \n\n\nHope Creek\n\n\n \n\n\n2046\n\n\n \n\n\n\n\n\n\n \n\n\nPeach Bottom Unit 2 (A)\n\n\n \n\n\n2033\n\n\n \n\n\n\n\n\n\n \n\n\nPeach Bottom Unit 3 (A)\n\n\n \n\n\n2034\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(A)\nDepreciation Expense and the Asset Retirement Obligation assume these units will operate through 2053 and 2054, respectively, given our expectation that previously approved operating license expiration dates will be restored by the NRC. See Item 8. Note 11. Asset Retirement Obligations (AROs) for additional information.\n\n\n \n\n\nIn 2024, PSEG submitted a letter to the NRC regarding a potential timeline to seek a second license renewal for our Salem and Hope Creek units. This second license renewal would extend the operating licenses through 2056 and 2060 for Salem Units 1 and 2, respectively, and 2066 for Hope Creek.\n\n\nState Regulation\n\n\nOur principal state regulator is the BPU, which oversees electric and natural gas distribution companies in New Jersey. We are also subject to various other states’ regulations due to our operations in those states.\n\n\nOur New Jersey utility operations are subject to comprehensive regulation by the BPU including, among other matters, regulation of retail electric and gas distribution rates and service, the issuance and sale of certain types of securities and compliance matters.\n \n\n\nIn addition to base rates, we recover certain costs or earn on certain investments pursuant to mechanisms known as adjustment clauses. These clauses permit the flow-through of costs to, or the recovery of investments from, customers related to specific programs, outside the context of base rate proceedings. Recovery of these costs or investments is subject to BPU approval for which we make periodic filings. Delays in the pass-through of costs or recovery of investments under these\n \n\n\n13\n\n\n\n\nTable of Contents\n\n\n \n\n\nmechanisms could result in significant changes in PSE&G’s cash flow. PSE&G’s participation in solar, EV and EE programs is also regulated by the BPU, as the terms and conditions of these programs are approved by the BPU. BPU regulation can also have a direct or indirect impact on our power generation business as it relates to energy supply agreements and energy policy in New Jersey.\n\n\nNew Jersey Energy Master Plan (EMP) and Future of Gas Stakeholder Proceeding\n—In January 2020, the State of New Jersey released its EMP. While the EMP does not have the force of law and does not impose any obligations on utilities, it outlines current expectations regarding New Jersey’s role in the use, management, and development of energy. The EMP recognizes the goals of New Jersey’s Clean Energy Act of 2018 (the Clean Energy Act) to achieve, by 2026, annual reductions of electric and gas consumption of at least 2% and 0.75%, respectively, of the average of the prior three years of retail sales. The annual reductions were subsequently adjusted to 2.15% for electric and 1.10% for gas by 2027 in the BPU’s EE framework approved in June 2020. The EMP outlines several strategies, including statewide EE programs; expansion of renewable generation (solar and offshore wind), energy storage and other carbon-free technologies; preservation of existing nuclear generation; electrification of the transportation sector; and reduced reliance on natural gas. The BPU began proceedings to update the State’s EMP via public input hearings in May and June 2024.\n \n\n\nIn February 2023, the governor of New Jersey issued three Executive Orders (EOs), one of which directed the BPU to convene a stakeholder process on the future of gas to develop a plan to meet the State’s current EMP goal to reduce emissions by 50% versus 2006 levels by 2030. In March 2023, the BPU opened a stakeholder proceeding to implement such EO that commenced in August 2023 with a two-day technical conference. We cannot predict the impact on our business or results of operations from these stakeholder proceedings, or any laws, rules, or regulations promulgated as a result thereof.\n \n\n\nStakeholder Proceeding on Gas Competition, BGSS\n—In February 2023, the BPU announced that it would open a new docket to conduct a stakeholder proceeding regarding gas supply issues previously raised by competitive gas suppliers, including third-party suppliers’ participation in New Jersey gas distribution companies’ annual BGSS filings, and other aspects of the existing BGSS construct. There has been no public activity in this matter since May 2023.\n \n\n\nGas Capacity Review\n—In September 2019, the BPU formally opened a stakeholder proceeding to explore gas capacity procurement service to all New Jersey natural gas customers and in June 2022 accepted a consultant’s finding that, through 2030, New Jersey’s firm gas capacity can meet firm demand under normal design day conditions. The BPU noted that its consultant’s analysis supported the argument against the need for additional interstate pipeline capacity and also supports the BPU’s aggressive policy approach to reduce New Jersey’s overall reliance on fossil fuels and achieve the New Jersey governor’s goal of 100% clean energy by 2050.\n\n\nRegional Energy Access (REA) Expansion Project \n—\n \nIn September 2024, the United States Circuit Court for the District of Columbia Circuit vacated FERC approval of the REA Expansion Project, which involves a natural gas pipeline running through New Jersey and several other states, and in which PSEG Energy Resources & Trade, LLC, the provider of gas supplies to satisfy PSE&G’s BGSS customers, is a customer.  The court found that FERC failed to properly consider the environmental consequences of the project, and the alleged lack of market demand for additional natural gas capacity in New Jersey. In January 2025, FERC responded to the Circuit Court’s concerns and reinstated its approval of the project. PSEG is continuing to monitor this proceeding.\n\n\nEnergy Efficiency, Triennial Review\n—In May 2024, the BPU approved an approximate $300 million extension of our CEF-EE program covering a commitment period from July 2024 through December 2024. In October 2024, the BPU approved our CEF-EE II filing authorizing a total spend of approximately $2.9 billion for energy efficiency projects committed between January 1, 2025 through June 30, 2027, and completed over an expected six-year period. The Order approved a program investment budget of approximately $1.9 billion, net of administrative expenses, and approximately $1 billion to continue our customer on-bill repayment program. This EE filing is a significant increase from our prior filings, driven by an increase in the savings targets required under the BPU Energy Efficiency Framework and higher costs to achieve those targeted savings. The filing also includes demand response programs and building decarbonization programs.\n\n\nBGS Process\n—In June 2024, New Jersey’s EDCs, including PSE&G, filed their annual joint proposal for the conduct of the February 2025 BGS auction covering energy years 2026 through 2028.  PSE&G’s company-specific addendum to the joint filing includes a proposal for an optional, two-year pilot program for time-of-use rates for residential customers.\n \n\n\n14\n\n\n\n\nTable of Contents\n\n\n \n\n\nEV Activity\n—Consistent with the policy set forth in New Jersey’s EMP, the BPU has supported electrification of the transportation sector. EDCs in New Jersey, including PSE&G, are making investments, approved by the BPU for recovery in rates, initially focused on light duty vehicles, such as preparatory work to deliver infrastructure to the EV charging point. In October 2024, the BPU released an Order that provided program guidance and minimum filing requirements for electric utility operated medium- and heavy-duty charging incentive programs. The Order caps PSE&G’s program investment at $30 million and requires electric utilities to submit program filings by February 27, 2025.\n \n\n\nGrid Modernization\n—In June 2022, following a stakeholder proceeding, the BPU Staff issued a report containing findings and recommendations to update the BPU’s interconnection regulations and processes. In furtherance of the recommendations, in June 2024 the BPU amended its interconnection rules to speed up the interconnection of renewable resources to the distribution grid. Separately, in July 2024, BPU Staff convened a working group to develop recommendations for integrated distribution planning for distributed energy resources. We cannot predict the impact on our business or results of operations from this Grid Modernization plan or any laws, rules or regulations promulgated as a result thereof, particularly as they may relate to PSE&G’s electric distribution assets.\n \n\n\nCybersecurity Regulation\n\n\nFederal\n—NERC Critical Infrastructure Protection standards establish cybersecurity and physical security protections for critical systems and facilities. These standards are also designed to promote coordination, threat sharing and interaction between utilities and various government agencies regarding potential cyber and physical threats against the nation’s electric grid. The Critical Infrastructure Protection standards are designed to protect Bulk Electric System (BES) Cyber Systems that would impact the reliable operation of the BES. PSE&G is obligated to comply with the NERC Critical Infrastructure Protection standards.\n \n\n\nNERC Critical Infrastructure Protection standards do not apply to nuclear facilities which are instead governed by the NRC for purposes of physical and cyber security. NRC has a number of risk-informed, performance-based security programs in place to effectively protect U.S. commercial nuclear facilities. NRC has existing requirements, effective processes, and the expertise to regulate and inspect cybersecurity to ensure the federal requirements are met. NERC continues to examine revising criteria for low-impact cyber systems, which could result in expanding the Critical Infrastructure Protection standards to a larger set of applicable cyber assets.\n\n\nNRC requires operating nuclear power plant licensee and license applicants to ensure that digital computer and communication systems associated with a nuclear power plant’s safety, security, and emergency preparedness functions are protected from cyberattacks. As a result, computer systems at operating power plants that monitor and control safety systems and help the reactor operate are isolated from external communications. Security systems that provide safeguards of the facility are also isolated from external communications, including the Internet.\n\n\nNRC’s Office of Nuclear Security and Incident Response established the Cyber Security Branch (CSB) to strengthen internal governance of the agency’s regulatory activities. The CSB plans, coordinates, and manages agency activities related to cybersecurity for NRC applicants and licensees, such as security programs’ development and policy enhancements to prevent malevolent cyber acts against NRC-licensed facilities. The CSB’s cybersecurity-related responsibilities include developing rules and guidance, reviewing licensing actions, developing policy enhancements, and overseeing NRC-licensed facilities.\n \n\n\nNRC regularly monitors the threats associated with cybersecurity, including potential threats against NRC-licensed facilities. Within the CSB there is a cyber assessment team that assesses real-world cyber events at NRC-licensed facilities. The team evaluates whether an identified threat could impact licensed facilities and makes recommendations for NRC actions and communications to the licensees. Furthermore, the NRC has established liaison relationships with the intelligence and law enforcement communities to include the National Counterterrorism Center, the U.S. Department of Homeland Security’s (DHS) Computer Emergency Response Team, and the Federal Bureau of Investigation.\n\n\nThe Transportation Security Administration, an agency of the U.S.DHS, has issued multiple security directives since May 2021 designed to mitigate cybersecurity threats to natural gas pipelines.\n \n\n\nState\n—The BPU requires utilities, including PSE&G, to, among other things, implement a cybersecurity program that defines and implements organizational accountabilities and responsibilities for cyber risk management activities, and\n \n\n\n15\n\n\n\n\nTable of Contents\n\n\n \n\n\nestablishes policies, plans, processes and procedures for identifying and mitigating cyber risk to critical systems. Additional requirements of this order include, but are not limited to (i) annually inventorying critical utility systems; (ii) annually assessing risks to critical utility systems; (iii) implementing controls to mitigate cyber risks to critical utility systems; (iv) monitoring log files of critical utility systems; (v) reporting cyber incidents to the BPU; and (vi) establishing a cybersecurity incident response plan and conducting biennial exercises to test the plan. In addition, New York’s Stop Hacks and Improve Electronic Data Security (SHIELD) Act, which became effective in March 2020, requires businesses that own or license computerized data that includes New York State residents’ private information to implement reasonable safeguards to protect that information.\n \n\n\nENVIRONMEN\nTAL MATTERS\n \n\n\nWe are subject to federal, state and local laws and regulations with regard to environmental matters. Our associated obligations change as legislatures and regulators pass new laws and regulations and amend existing ones. Therefore, it is difficult to project future costs of compliance and their impact on competition. Capital costs of complying with known pollution control requirements are included in our estimate of construction expenditures in Item 7. MD&A—Capital Requirements. The costs of compliance associated with any new requirements that may be imposed by future regulations are not known but may be material.\n\n\nFor additional information related to environmental matters, including proceedings not discussed below, as well as anticipated expenditures for installation of compliance technology, hazardous substance liabilities and fuel and waste disposal costs, see Item 1A. Risk Factors and Item 8. Note 13. Commitments and Contingent Liabilities.\n \n\n\nAir Pollution Control\n\n\nOur facilities are subject to federal, state and local regulation that requires controls of emissions from sources of air pollution and imposes recordkeeping, reporting and permit requirements.\n \n\n\nWater Pollution Control\n\n\nThe Federal Water Pollution Control Act prohibits the discharge of pollutants from point sources to water, except pursuant to a duly issued permit. These permits must generally be renewed every five years. Applicable regulations also impose obligations on facility operators like PSEG Power to install certain technology to treat their discharges to ensure discharges meet certain water quality requirements.\n \n\n\nThe Environmental Protection Agency’s (EPA) Clean Water Act (CWA) Section 316(b) rule establishes requirements for the regulation of cooling water intakes at existing power plants, such as Salem.\n \n\n\nHazardous Substance Liability\n\n\nPSEG’s operations involve substances and byproducts classified by environmental regulations as hazardous. These regulations impose handling, storage and disposal requirements for hazardous materials. They also impose liability for damages to the environment, including cash penalties.\n\n\nSite Remediation\n—Federal and state environmental laws and regulations require the cleanup of discharged hazardous substances. They authorize the EPA, the New Jersey Department of Environmental Protection (NJDEP) and private parties to commence lawsuits to compel clean-ups or seek reimbursement for such remediation. The clean-ups can be more complicated and costly when the hazardous substances are in or under a body of water. Clean-up obligations may be imposed regardless of the absence of fault, contractual agreements between parties, or the legality of activities at the time of discharge.\n\n\nIn May 2024, the EPA finalized revisions to the coal combustion residuals rule (CCR Rule) which established new requirements for the investigation and, if necessary, the cleanup of certain types of coal ash placed at certain fossil generation station sites, including certain sites owned or formerly owned by PSEG Power. We are in the process of investigating each of the sites that we currently own that are subject to the CCR Rule, as well as sites that we formerly owned that are subject to the CCR Rule where we retained certain environmental obligations to investigate and, if necessary, remediate. PSEG is currently unable to estimate the impact of the CCR Rule, but it could have a material impact on our business, results of operations and cash flows.\n\n\n16\n\n\n\n\nTable of Contents\n\n\n \n\n\nPursuant to the 2022 “Dirty Dirt” legislation, the NJDEP is proposing new requirements for the transportation, handling and disposal of soil and other waste materials generated by utility companies, including PSE&G. NJDEP has not yet finalized the requirements and, therefore, PSE&G is unable to quantify the increased costs of complying with these potential new requirements.\n\n\nNatural Resource Damages\n—Federal and state environmental laws and regulations authorize damage assessments against persons who have caused an injury to natural resources through the discharge of a hazardous substance. The NJDEP requires persons conducting remediation to address such injuries through restoration or damage assessments.\n \n\n\nWildlife and Habitat Protection\n\n\nFederal and state environmental laws and regulations govern activities that may harm certain wildlife or habitats. These laws and regulations impose permit requirements, prohibit certain activities, and impose penalties for violations.\n \n\n\nIn December 2024, the U.S. Fish and Wildlife Service proposed to designate the monarch butterfly as a “threatened” species under the federal Endangered Species Act. PSEG is unable to determine the impact of this development.\n \n\n\n \n\n\nFuel and Waste Disposal\n\n\nNuclear Fuel Disposal\n—The federal government has entered into contracts with the operators of nuclear power plants for transportation and ultimate disposal of spent nuclear fuel. Under the Nuclear Waste Policy Act of 1982 (NWPA), nuclear plant owners are required to contribute to a Nuclear Waste Fund to pay for this service. Since May 2014, the nuclear waste fee rate has been zero. No assurances can be given that this fee will not be increased in the future. The NWPA allows spent nuclear fuel generated in any reactor to be stored in reactor facility storage pools or in Independent Spent Fuel Storage Installations located at reactors or away from reactor sites.\n \n\n\nWe have on-site storage facilities that are expected to satisfy the storage needs of Salem 1, Salem 2, Hope Creek, Peach Bottom 2 and Peach Bottom 3 through the end of their operating licenses.\n\n\nLow-Level Radioactive Waste\n—As a by-product of their operations, nuclear generation units produce low-level radioactive waste. Such waste includes paper, plastics, protective clothing, water purification materials and other materials. These waste materials are accumulated on site and disposed of at licensed permanent disposal facilities. New Jersey, Connecticut and South Carolina have reached an agreement that gives New Jersey nuclear generators continued access to a waste disposal facility which is owned by South Carolina. We believe that this agreement will provide for adequate low-level radioactive waste disposal for Salem and Hope Creek through the end of their current licenses including full decommissioning, although no assurances can be given. Additionally, there are on-site storage facilities for Salem, Hope Creek and Peach Bottom, which we believe have the capacity for at least five years of temporary storage for each facility.\n\n\n17\n\n\n\n\nTable of Contents\n\n\n \n\n\nINFORMATION ABOUT OUR\n EXECUTIVE OFFICERS (PSEG)\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nName\n\n\n \n\n\nAge as of\nDecember 31, 2024\n\n\n \n\n\nOffice\n\n\n \n\n\nEffective Date\nFirst Elected to\nPresent Position\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRalph A. LaRossa\n\n\n \n\n\n61\n\n\n \n\n\nChair of the Board (COB), President and Chief Executive Officer (CEO) - PSEG\n\n\n \n\n\nJanuary 2023 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPresident and CEO -PSEG\n \n\n\n \n\n\nSeptember 2022 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nChief Operating Officer (COO) - PSEG\n\n\n \n\n\nJanuary 2020 to August 2022\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB and CEO - PSE&G\n\n\n \n\n\nSeptember 2022 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB, President and CEO - PSEG Power\n\n\n \n\n\nMay 2023 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB and CEO - PSEG Power\n\n\n \n\n\nSeptember 2022 to May 2023\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB and CEO - Energy Holdings\n\n\n \n\n\nSeptember 2022 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB, CEO and President - Services\n\n\n \n\n\nSeptember 2022 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPresident and COO - PSEG Power\n\n\n \n\n\nOctober 2017 to August 2022\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPresident and COO - PSE&G\n\n\n \n\n\nOctober 2006 to October 2017\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nCOB - PSEG Long Island LLC\n\n\n \n\n\nDecember 2020 to August 2022\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDaniel J. Cregg\n\n\n \n\n\n61\n\n\n \n\n\nExecutive Vice President (EVP) and Chief Financial Officer (CFO) - PSEG\n\n\n \n\n\nOctober 2015 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and CFO - PSE&G\n\n\n \n\n\nOctober 2015 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and CFO - PSEG Power\n\n\n \n\n\nOctober 2015 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nKim C. Hanemann\n\n\n \n\n\n61\n\n\n \n\n\nPresident and COO - PSE&G\n\n\n \n\n\nJune 2021 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSenior Vice President (SVP) and COO - PSE&G\n\n\n \n\n\nJanuary 2020 to June 2021\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSVP - Electric Transmission and Distribution - PSE&G\n\n\n \n\n\nSeptember 2018 to January 2020\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTamara L. Linde\n\n\n \n\n\n60\n\n\n \n\n\nEVP and Chief Legal Officer - PSEG\n\n\n \n\n\nSeptember 2024 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and General Counsel - PSEG\n\n\n \n\n\nJuly 2014 to September 2024\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and General Counsel - PSE&G\n\n\n \n\n\nJuly 2014 to September 2024\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and General Counsel - PSEG Power\n\n\n \n\n\nJuly 2014 to September 2024\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCharles V. McFeaters\n\n\n \n\n\n65\n\n\n \n\n\nPresident and Chief Nuclear Officer - PSEG Nuclear LLC\n\n\n \n\n\nMay 2023 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSVP - Nuclear Operations - PSEG Nuclear LLC\n\n\n \n\n\nNovember 2020 to May 2023\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nVice President (VP) - Salem Generating Station - PSEG Nuclear LLC\n\n\n \n\n\nOctober 2016 to November 2020\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGrace Park\n\n\n \n\n\n49\n\n\n \n\n\nEVP and General Counsel - PSEG\n\n\n \n\n\nSeptember 2024 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and General Counsel - PSE&G\n\n\n \n\n\nSeptember 2024 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nEVP and General Counsel - PSEG Power\n\n\n \n\n\nSeptember 2024 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nVP - Deputy General Counsel and Chief Litigation Counsel - Services\n\n\n \n\n\nJuly 2020 to September 2024\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSheila J. Rostiac\n\n\n \n\n\n54\n\n\n \n\n\nSVP - Human Resources, Chief Human Resources and Chief Diversity Officer - Services\n \n\n\n \n\n\nJanuary 2020 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSVP - Human Resources and Chief Human Resources Officer - Services\n\n\n \n\n\nSeptember 2019 to January 2020\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRichard T. Thigpen\n\n\n \n\n\n64\n\n\n \n\n\nSVP - Corporate Citizenship - Services\n\n\n \n\n\nJuly 2018 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRose M. Chernick\n\n\n \n\n\n61\n\n\n \n\n\nVP and Controller - PSEG\n\n\n \n\n\nMarch 2019 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nVP and Controller - PSE&G\n\n\n \n\n\nMarch 2019 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nVP and Controller - PSEG Power\n\n\n \n\n\nMarch 2019 to present\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n18\n\n\n\n\nTable of Contents\n\n\n \n\n\nITEM 1A. RIS\nK FACTORS\n \n\n\nThe following factors should be considered when reviewing our business. These factors could have a material adverse impact on our business, prospects, financial position, results of operations or cash flows and could cause results to differ materially from those expressed elsewhere in this report.\n\n\nGENERAL OPERATIONAL AND FINANCIAL RISKS\n\n\nInability to successfully develop, obtain regulatory approval for, or construct T&D, and our nuclear generation projects could adversely impact our businesses.\n\n\nOur business plan calls for extensive investment in capital improvements and additions, including the construction of T&D facilities, modernizing and expanding existing infrastructure pursuant to investment programs that provide for current recovery in rates, addressing needs of new customers and increasing demand on the system, and our CEF programs, particularly our energy efficiency program which provides incentives for customers to install high-efficiency equipment at their premises and transmission capital investments outside of our utility service territory, as well as uprates and other potential investments at our nuclear facilities. Currently, we have several significant capital investments underway or being contemplated.\n \n\n\nThe successful construction and development of these projects will depend, in part, on our ability to:\n\n\n•\nobtain necessary governmental and regulatory approvals; \n\n\n•\nobtain environmental permits and approvals; \n\n\n•\nobtain governmental and community support for such projects to avoid delays in the receipt of permits and approvals from regulatory authorities;\n\n\n•\nobtain customer support for investments made at their premises;\n\n\n•\nobtain property/land rights in property-constrained areas and for greenfield locations, and at a reasonable cost;\n\n\n•\ncomplete such projects within budgets and on commercially reasonable terms and conditions; \n\n\n•\ncomplete supporting information technology (IT), cybersecurity and physical security upgrades;\n\n\n•\nobtain any necessary debt financing on acceptable terms and/or necessary governmental financial incentives; \n\n\n•\nensure that contracting parties, including suppliers, perform under their contracts in a timely and cost-effective manner; and\n\n\n•\ntimely recovery of these investments through rates.\n\n\nFailure to obtain regulatory or other approvals, delays, cost escalations or otherwise unsuccessful construction and development could materially affect our financial position, results of operations and cash flows.\n \n\n\nMacroeconomic considerations, including inflationary levels, gas and electric supply prices that are passed through to customers and other pressures could factor into our regulators’ assessment in approving the size, duration and timing of cost recovery of certain of these programs. Further, certain negative public and political views by certain stakeholders on natural gas and other types of energy infrastructure could result in diminishing support for those investments.\n\n\nIn addition, the successful operation of new facilities or transmission or distribution projects is subject to risks relating to supply interruptions; labor availability, work stoppages and labor disputes; weather interferences; unforeseen engineering and environmental problems, including those related to climate change; opposition from local communities, and the other risks described herein.\n\n\nAny of these risks could cause the amounts of our investments and/or our return on these investments to be lower than expected, which could adversely impact our financial condition and results of operations through lower investment opportunities and/or lower returns.\n\n\n19\n\n\n\n\nTable of Contents\n\n\n \n\n\nWe are subject to physical, financial and transition risks related to climate change, including potentially increased legislative and regulatory burdens and changing customer preferences, and we may be subject to lawsuits, all of which could impact our businesses and results of operations.\n \n\n\nClimate change may increasingly drive change to existing or additional legislation and regulation that may impact our business and shape our customers’ energy preference and sustainability goals. While the CIP protects PSE&G’s margin variances against changes in customer usage of gas and electricity, customer demand for natural gas could decrease as a result of changing customer preferences favoring electrification and advanced technologies that offer energy efficient options. Electric demand could also be impacted by electrification, including greater adoption of EVs, installation of distributed energy resources, such as behind the meter solar, installation of more energy efficient equipment, flexible load and/or energy storage, and other advances in technology. Further, climate change may adversely impact the economy and reduced economic and consumer activity in our service areas could lower demand for electricity and gas we deliver. Any one or all of these factors could impact the need to invest in our electric and gas T&D systems and, therefore, our company growth rate.\n \n\n\nSevere weather or acts of nature, including hurricanes, winter storms, earthquakes, floods, wildfires and other natural disasters can stress systems, disrupt operation of our facilities and cause service outages, and property damage that require incurring additional expenses. In addition, the effects of climate change will have increased the physical risks to our facilities and operations resulting from such climate hazards as more severe weather events (extreme wind, rainfall and flooding), such as experienced from Superstorm Sandy and Tropical Storms Isaias and Ida, sea level rise, and extreme heat and drought.\n \n\n\nThese and other physical changes could result in changes in customer demand, increased costs associated with repairing and maintaining generation facilities and T&D systems, resulting in increased maintenance and capital costs (and potential increased financing needs), increased regulatory oversight, and lower customer satisfaction. Where recovery of costs to restore service and repair damaged equipment and facilities is available, any determination by the regulator not to permit timely and full recovery of the costs incurred could have a material adverse effect on our businesses, financial condition, results of operations and prospects.\n\n\nTo the extent financial markets view climate change and greenhouse gas (GHG) emissions as a financial risk, our ability to access capital markets could be negatively affected or cause us to receive less than favorable terms and conditions.\n\n\nClimate change-related political action and state and federal policy goals, including but not limited to those related to energy efficient targets, solar targets, energy storage targets, encouragement of electrification through EV adoption, policies to restrict the use of natural gas in new or existing homes and businesses, or encourage electrification of end use equipment currently fueled by natural gas, and the associated legislative and regulatory responses, may create financial risk as our operations may be subject to additional regulation at either the state or federal level in the future. Increased regulation of GHG emissions could impose significant additional costs on our electric and natural gas operations, our suppliers and ultimately, our customers. Developing and implementing plans for compliance with GHG emissions reduction, clean/renewable energy requirements, or for achieving voluntary climate commitments can lead to additional capital and Operation and Maintenance (O&M) expenditures and could significantly affect the economic position of existing operations and proposed projects. If our regulators do not allow us to recover all or a part of the cost of capital investment or the O&M costs incurred to comply with increasingly rigorous regulatory mandates, it could have a material adverse effect on our results of operations, financial condition or cash flows. On the other hand, in the event that the political, policy, regulatory or legislative support for clean energy projects declines, the benefits or feasibility of certain investments we could potentially make may be reduced.\n \n\n\nWe may be subject to climate change lawsuits that may seek injunctive relief, monetary compensation, penalties, and punitive damages, including but not limited to, for liabilities for damages related to mitigate harm caused by climate change. An adverse outcome could require substantial capital expenditures and possibly require payment of substantial penalties or damages. Defense costs associated with such litigation can also be significant and could affect results of operations, financial condition or cash flows if such costs are not recovered through regulated rates\n.\n\n\nFurther, our business is subject to policy, regulatory, technology and economic uncertainties and contingencies, including regulatory approvals required for our various investments, many of which are beyond our control and may affect planned\n \n\n\n20\n\n\n\n\nTable of Contents\n\n\n \n\n\ninvestments and our ability to meet our targets of net zero GHG emissions by 2030 for Scopes 1 and 2 emissions, or other GHG emissions reduction or climate-related goals that we may set from time to time, in a cost-effective manner or at all.\n \n\n\nWe may be adversely affected by asset and equipment failures, accidents, critical operating technology or business system failures, natural disasters, severe weather events, acts of war or terrorism or other acts of violence, sabotage, physical attacks or security breaches, cyberattacks, or other incidents, including pandemics, that impact our ability to provide safe and reliable service to our customers and remain competitive and could result in substantial financial losses.\n\n\nThe success of our businesses is dependent on our ability to continue providing safe and reliable service to our customers while minimizing service disruptions. We are exposed to the risk of asset and equipment failures, gas explosions, accidents, natural disasters, severe weather events, acts of war or terrorism or other acts of violence, including active shooter situations, sabotage, physical attacks or security breaches, cyberattacks or other incidents, which could result in damage to or destruction of our substations or other facilities or infrastructure, or damage to persons or property and to electric and gas supply interruptions. Further, a major failure of availability or performance of a critical operating technology or business system, and inadequate preparation or execution of business continuity or disaster recovery plans for the loss of one or several critical systems, could result in extended disruption to operations or business processes, damage to systems and/or loss of data\n.\n We have historically benefited from access to mutual aid, a voluntary and reciprocal arrangement with other utilities that provides access to a trained and flexible labor force which has helped to reduce outage restoration times during extreme weather events. There is no guarantee that we will have continued access to mutual aid as the frequency of severe weather events rises.\n\n\nWe are also exposed to the risk of pandemics, which could result in service disruptions and delays or otherwise impair our ability to timely provide service to our customers, complete our investment projects or obtain timely recovery of our costs.\n \n\n\nThese events could result in increased political, economic, financial and insurance market instability, a lack of available insurance or the availability of insurance on commercially reasonable terms, and volatility in power and fuel markets, which could materially adversely affect our business and results of operations, including our ability to access capital on terms and conditions acceptable to us.\n\n\nAny of the issues described above, if experienced at our facilities or otherwise in our business, or by others in our industry, could adversely impact our revenues; increase costs to repair and maintain our systems; subject us to potential litigation and/or damage claims, fines or penalties; and increase the level of oversight of our utility and generation operations and infrastructure through investigations or through the imposition of additional regulatory or legislative requirements. Such actions could adversely affect our costs, competitiveness, future investments and customer rates, which could be material to our financial position, results of operations and cash flow. For our T&D business, the cost of storm restoration efforts may not be fully recoverable through the regulatory process. In addition, the inability to restore power to our customers on a timely basis could result in negative publicity and materially damage our reputation.\n \n\n\nAny inability to recover the carrying amount of our long-lived assets could result in future impairment charges which could have a material adverse impact on our financial condition and results of operations.\n\n\nLong-lived assets represent approximately 73% and 80% of the total assets of PSEG and PSE&G, respectively, as of December 31, 2024. Management evaluates long-lived assets for impairment whenever events or changes in circumstances, such as significant adverse changes in regulation, including a disallowance of certain costs, a potential sale or disposition of an asset significantly before the end of its useful life, business climate or market conditions, including prolonged periods of adverse commodity and capacity prices, could potentially indicate an asset’s or group of assets’ carrying amount may not be recoverable. Significant reductions in our expected revenues or cash flows for an extended period of time resulting from such events could result in future asset impairment charges, which could have a material adverse impact on our financial condition and results of operations.\n\n\nDisruptions or cost increases in our supply chain, including labor shortages, could materially impact our business.\n\n\nThe supply chain of goods and services could be impacted by several factors, including sanctions, tariffs, manufacturing labor shortages, domestic and international shipping constraints, increases in demand, and shortages of raw materials and\n \n\n\n21\n\n\n\n\nTable of Contents\n\n\n \n\n\nspecialty components. This could cause price increases in some areas and delivery delays of certain goods, which could increase our costs and impact our operations.\n \n \n\n\nInability to maintain sufficient liquidity in the amounts and at the times needed or access sufficient capital at reasonable rates or on commercially reasonable terms could adversely impact our business.\n\n\nFunding for our investments in capital improvement and additions, scheduled payments of principal and interest on our existing indebtedness and the extension and refinancing of such indebtedness has been provided primarily by internally-generated cash flow and external debt financings. We have significant capital requirements and depend on our ability to generate cash in the future from our operations and continued access to capital and bank markets to efficiently fund our cash flow needs. Our ability to generate cash flow is dependent upon, among other things, industry conditions and general economic, financial, competitive, legislative, regulatory and other factors. The ability to arrange financing and to refinance existing debt and the costs of such financing or refinancing depend on numerous factors including, among other things:\n \n\n\n•\ngeneral economic and capital market conditions, including but not limited to, prevailing interest rates;\n\n\n•\nthe availability of credit from banks and other financial institutions;\n\n\n•\ntax, regulatory and securities law developments; \n\n\n•\nfor PSE&G, our ability to obtain necessary regulatory approvals for the incurrence of additional indebtedness;\n\n\n•\ninvestor confidence in us, our regulatory environment and our industry;\n\n\n•\nour current level of indebtedness and compliance with covenants in our debt agreements;\n\n\n•\nthe success of current projects and the quality of new projects;\n\n\n•\nthe predictability of our cash flows;\n \n\n\n•\nour current and future capital structure; \n\n\n•\nour financial performance and the continued reliable operation of our business; and\n\n\n•\nmaintenance of our investment grade credit ratings.\n\n\nMarket disruptions, such as economic downturns experienced in the U.S. and abroad, the bankruptcy of an unrelated energy company or a systemically important financial institution, changes in market prices for electricity and gas, and actual or threatened acts of war or terrorist attacks, may increase our cost of borrowing or adversely affect our ability to access capital. As a result, no assurance can be given that we will be successful in obtaining financing for projects and investments, extending or refinancing maturing debt or meeting our other cash flow needs on acceptable terms or at all, which could materially adversely impact our financial position, results of operations and future growth.\n\n\nDuring periods of rising energy prices, hedged positions could be out-of-the-money, increasing PSEG Power’s collateral requirements. In addition, if PSEG Power were to lose its investment grade credit rating from S&P or Moody’s, it would be required under certain agreements to provide a significant amount of additional collateral in the form of letters of credit or cash, which would have a material adverse effect on our liquidity and cash flows.\n\n\nCybersecurity attacks, data breaches, or intrusions or other disruptions to our IT, operational or other systems could adversely impact our businesses.\n\n\nCybersecurity threats to the energy market infrastructure are increasing in sophistication, magnitude and frequency, particularly with the regularity of virtual operations. Because of the inherent vulnerability of infrastructure and technology and operational systems to disability or failure due to hacking, viruses, malicious or destructive code, phishing and other social engineering attacks, denial of service attacks, ransomware, acts of war or terrorism, or other cybersecurity incidents, we face increased risk of cyberattack. We rely on information and operational technology systems and network infrastructure to operate our generation and T&D systems. We also store sensitive data, intellectual property and proprietary or personally identifiable information regarding our business, infrastructure, employees, shareholders, customers and vendors on our IT systems and conduct power marketing and hedging activities. In addition, the operation of our business is dependent upon the IT systems of Nth parties (i.e., our third parties and other business relationships, including fourth parties, etc.), including our\n \n\n\n22\n\n\n\n\nTable of Contents\n\n\n \n\n\nvendors, regulators, RTOs and ISOs, among others. Our and Nth-party operational and IT systems and products may be vulnerable to cybersecurity attacks involving fraud, malice or oversight on the part of our employees, other insiders or Nth parties, whether domestic or foreign sources. Further, new types of cyberattacks, whether directed at our own infrastructure and technology and operational systems or that of third parties, may be generated or enhanced through the use of Artificial Intelligence (AI) and/or cloud-based infrastructure. A successful cybersecurity attack may result in unauthorized use of our systems to cause disruptions at an Nth party. Cybersecurity risks to our operations include:\n\n\n•\ndisruption of the operation of our assets, the fuel supply chain, the power grid and gas T&D,\n\n\n•\ntheft of confidential company, employee, shareholder, vendor or customer information, and critical energy infrastructure information, which may cause us to be in breach of certain covenants and contractual, legal or regulatory obligations and pose risk to our system and our customers, \n\n\n•\ngeneral business system and process interruption or compromise, including preventing us from servicing our customers, working remotely, collecting revenues or the ability to record, process and/or report financial information correctly, and\n\n\n•\nbreaches of vendors’ infrastructures where our confidential information is stored.\n\n\nWe and our Nth-party vendors have been and will continue to be subject to cybersecurity attacks, including but not limited to ransomware, denial of service, business email compromises, and malware attacks. To date, there has been no material impact or reasonably likely material impact on our business strategy, results of operations or financial condition from these attacks or other cybersecurity incidents, including as a result of prior cybersecurity incidents. However, we may be unable to prevent all such attacks in the future from having such a material impact as such attacks continue to increase in sophistication and frequency. If a significant cybersecurity event or breach occurs within our company or with one of our material vendors, we could be exposed to significant loss of revenue, material repair costs to intellectual and physical property, significant fines and penalties if determined that we were in non-compliance with existing laws and regulations, significant litigation costs, increased costs to finance our businesses, negative publicity, damage to our reputation and loss of confidence from our customers, regulators, investors, vendors and employees. The misappropriation, corruption or loss of personally identifiable information and other confidential data from us or one of our vendors could lead to significant breach notification expenses, mitigation expenses such as credit monitoring, and legal and regulatory fines and penalties. Moreover, new or updated security laws or regulations\n,\n including laws and regulations that respond to evolving application of AI, or unforeseen threat sources could require changes in current measures taken by us and our business operations, which could result in increased costs and adversely affect our financial statements. Similarly, a significant cybersecurity event or breach experienced by a competitor, regulatory authority, RTO, ISO, or vendor could also materially impact our business and results of operations via enhanced legal and regulatory requirements. The amount and scope of insurance we maintain against losses that result from cybersecurity incidents may not be sufficient to cover losses or adequately compensate for resulting business disruptions. To address the risks to our information and operational technology systems, we maintain a cybersecurity program that includes policies and controls, cybersecurity insurance, cybersecurity governance and compliance, awareness training, table-top exercises, logging and monitoring, and testing. These preventative actions minimize the likelihood and potential impact of cybersecurity breaches.  For a discussion of state and federal cybersecurity regulatory requirements and information regarding our cybersecurity program, see Item 1C. Cybersecurity. Further, we are subject to changing data protection laws in the U.S. and abroad.  Legal requirements and regulatory scrutiny for the collection, storage, handling, use, disclosure, transfer, and security of personal data continue to evolve and expand, which may present material obligations and risks to our business, including expanded compliance burdens, restrictions on transfer of personal data, costs, and enforcement risks.\n\n\nAn increasing demand for power and load growth, potentially compounded by a shift away from natural gas toward increased electrification could cause reliability issues and higher costs for customers, which could lead to potential pressure on fair and timely recovery of our investments and proposed programs.\n\n\nSubstantial investments in generation, transmission and distribution will be required to meet current projections of increasing customer demand.  Higher projected demand is driven by a number of factors, including data centers, reshoring manufacturing, port electrification, EV adoption, other electrification and a shift away from natural gas. Sustained distribution grid modernization will also be required to accommodate increased EE, EV infrastructure, increased penetration of distributed energy resources on the electric system, such as on-site solar generation and also potential deployment of\n \n\n\n23\n\n\n\n\nTable of Contents\n\n\n \n\n\nenergy storage, fuel cells, and DR technologies. Higher electric demand could significantly increase the prices of energy and capacity, as well as raise resource adequacy and reliability concerns within PJM, particularly if that increased demand outpaces the addition of firm generation capacity and in transmission constrained zones. This resource adequacy challenge presents reliability concerns, as well as potential for increasing energy and capacity prices that could place pressure on customer bills, could attract political and regulatory scrutiny and increase regulatory uncertainty for utility investment initiatives and programs.\n \n\n\nFailure to attract and retain a qualified workforce could have an adverse effect on our business\n.\n \n\n\nCertain events such as an aging workforce looking to retire without an opportunity to transfer knowledge to a successor, inadequate workforce plans and replacements, lack of skill set to meet current and evolving business needs, a culture that does not foster inclusion leading to turnover, acts of violence in the workplace, inadequate training and a workforce that is not engaged may lead to operating challenges, safety concerns and increased costs. The challenges include loss of knowledge and a lengthy time period associated with skill development, increased turnover, costs for contractors to replace employees, poor productivity, and a lack of innovation. Specialized knowledge and experience are required of employees across PSEG and its affiliates. There is competition for these skilled employees. Failure to hire and adequately train and retain employees, including the transfer of significant historical knowledge and expertise to new employees, may adversely affect our results of operations, financial position and cash flows.\n \n\n\nInflation, including increases in the costs of equipment and materials, fuel, services and labor could adversely affect our operating results.\n\n\nHigher costs from suppliers of equipment and materials, fuel and services and labor and health care costs to attract and retain our workforce, as well as policy matters such as tax rates, tariffs and other policies impacting costs, could lead to increased costs, which could reduce our earnings. Also, seeking recovery of higher costs in future distribution base rate cases could pressure customer rates, resulting in a potentially adverse outcome of such proceedings, or in other proceedings, including the proposal of certain investment programs or other proceedings that impact customer rates.\n\n\nCovenants in our debt instruments and credit agreements may adversely affect our business.\n\n\nPSEG’s and PSE&G’s debt instruments contain events of default customary for financings of their type, including cross accelerations to other debt of that entity. PSEG’s, PSE&G’s and PSEG Power’s bank credit agreements contain events of default customary for financings of their type, including cross defaults and accelerations and, in the case of PSEG’s and PSEG Power’s bank credit agreements, certain change of control events. PSEG’s, PSE&G’s and PSEG Power’s bank credit agreements, contain certain limitations on the incurrence of liens and PSEG Power’s bank credit agreements also contain limitations on the incurrence of certain subsidiary debt. PSEG Power's term loan agreements contain a change-of-control clause, which includes under certain circumstances, PSEG Power ceasing to be a wholly owned subsidiary of PSEG. Our ability to comply with these and future covenants may be affected by events beyond our control. If we fail to comply with the covenants and are unable to obtain a waiver or amendment, or a default exists and is continuing under such debt, the lenders or the holders or trustee of such debt, as applicable, could give notice and declare outstanding borrowings and other obligations under such debt immediately due and payable. We may not be able to obtain waivers, amendments or alternative financing, or if obtainable, it could be on terms that are not acceptable to us. Any of these events could adversely impact our financial condition, results of operations and cash flows.\n\n\nFinancial market performance directly affects the asset values of our defined benefit plan trust funds and Nuclear Decommissioning Trust (NDT) Fund. Market performance and other factors could decrease the value of trust assets and could result in the need for significant additional funding.\n\n\nThe performance of the financial markets will affect the value of the assets that are held in trust to satisfy our future obligations under our defined benefit plans and to decommission our nuclear generating plants. A decline in the market value of the defined benefit plan trust funds could increase our pension plan funding requirements and result in increased pension costs in future years. The market value of our defined benefit plan trusts could be negatively impacted by adverse financial market conditions that reduce the return on trust assets, decreased interest rates used to measure the required minimum funding levels, and future government regulation. Additional funding requirements for our defined benefit plans could be\n \n\n\n24\n\n\n\n\nTable of Contents\n\n\n \n\n\ncaused by changes in required or voluntary contributions, an increase in the number of employees becoming eligible to retire and changes in life expectancy assumptions. A decline in the market value of our NDT Fund could increase PSEG Power’s funding requirements to decommission its nuclear plants. An increase in projected costs could also lead to additional funding requirements for our decommissioning trust. Failure to manage adequately our investments in our defined benefit plan trusts and NDT Fund could result in the need for us to make significant cash contributions in the future to maintain our funding at sufficient levels, which would negatively impact our results of operations, cash flows and financial position.\n\n\nIf we are unable to enter into or extend certain significant contracts, this may negatively affect our financial condition and operating results\n \n\n\nWe are party to, and are also exploring opportunities to enter into, several contracts from which we currently or may in the future derive significant revenues.\n \n\n\nPSEG Power sells wholesale natural gas, primarily through a full-requirements BGSS contract with PSE&G to meet the needs of PSE&G’s default gas supply service customers. In 2022, the BPU approved an extension of the long-term BGSS contract to March 31, 2027, and thereafter the contract remains in effect unless terminated by either party with a two-year notice. PSEG LI has an OSA with LIPA to operate LIPA’s electric T&D system in Long Island. The OSA continues through 2025 and LIPA is currently conducting a process for provision of these services after 2025. It is uncertain whether these contracts will be extended or renewed, which may negatively affect our financial condition and operating results.\n \n\n\nIn addition, we are exploring opportunities for the potential sale of power from our nuclear facilities pursuant to long-term agreements with large power users, such as data centers. It is uncertain whether we will be successful in entering into any of such contracts, including without limitation in connection with various ongoing regulatory proceedings.\n \n\n\nArtificial Intelligence is an emerging area of technology that has the potential to impact various aspects of our business operations and customer interactions.\n \n\n\nAI, including Generative AI and Post-Quantum Cryptography, has the potential to change the way we operate by creating efficiencies and improving processes and customer experiences. The development, adoption, and use for generative AI technologies are still in their early stages and ineffective or inadequate AI development or deployment practices by PSEG or Nth-party vendors could result in unintended consequences. We contract third-party vendors that use AI in products and/or services they provide and we may not have full control or visibility over the quality, performance, security or compliance of the products and services that incorporate AI-related technology. AI algorithms that we or our Nth-party vendors use may be flawed or may be based on data sets that are biased or insufficient. These limitations or failures could result in reputational damage, unauthorized disclosure of data, and legal liabilities. Developing, testing, and deploying resource-intensive AI systems may require additional investment and increase our costs. In addition, the evolving nature of AI may cause new laws and regulations to be enacted which may require significant resources to modify and maintain business practices to comply with the new laws and regulations, the nature of which cannot be determined at this time. Further, inaccurate results generated as a result of our employees’, contractors’ or vendors’ use of generative AI technologies could lead to operational interruptions or reputational harm.\n\n\nRISKS RELATED TO OUR GENERATION BUSINESS\n\n\nFluctuations in the wholesale power and natural gas markets could negatively affect our financial condition, results of operations and cash flows.\n\n\nIn the competitive markets where we operate, participants are not guaranteed any specific rate of return on their capital investments and natural gas prices have a major impact on the price that generators receive for their output. The natural gas market and energy markets have been, and may continue to be, volatile due to higher domestic demand, increased natural gas exports and impacts from the global liquefied natural gas market, weather and other factors. Lower natural gas prices often result in lower electricity prices, which could reduce our margins where our nuclear generation costs may not have declined similarly.\n \n\n\n25\n\n\n\n\nTable of Contents\n\n\n \n\n\nChanges in prevailing market prices below the PTC threshold could have a material adverse effect on our financial condition and results of operations. Factors that may cause market price fluctuations include:\n \n\n\n•\nchanges in demand on the system, which could be impacted by new large customers, including data centers, electrification and other factors;\n\n\n•\nincreases and decreases in generation capacity, including the addition of new supplies of power as a result of the development of new power plants, expansion of existing power plants, continuing retirement of existing generation units, inability of new generating units to be placed online, the retention of power plants that were expected to be retired or recently retired units being returned to service, the extent to which those generating units are firm or intermittent, or additional transmission capacity;\n\n\n•\nsevere weather conditions;\n\n\n•\npower supply disruptions, including power plant outages and transmission disruptions;\n\n\n•\nclimate change, and weather conditions, particularly unusually mild summers or warm winters in our market areas;\n\n\n•\nseasonal fluctuations;\n\n\n•\neconomic and political conditions that could negatively impact the demand for power or PTCs on our nuclear generation units;\n\n\n•\nchanges in the supply of, and demand for, energy commodities;\n\n\n•\ndevelopment of new fuels or new technologies for the production or storage of power;\n\n\n•\nincurring penalties due to generation performance failure when called on by PJM during emergency situations;\n\n\n•\nfederal and state regulations and actions of PJM and changing PJM market rules, including capacity market auction delays and/or rule changes that could materially impact prices; and\n\n\n•\nfederal and state power, market and environmental regulation and legislation, including financial incentives for new renewable energy generation capacity that could lead to oversupply and price suppression.\n\n\nOur generation business currently involves the establishment of forward sale positions in the wholesale energy markets on long-term and short-term bases. If the realized value of our generation falls outside of the PTC thresholds, to the extent that we have contracted obligations in excess of energy we have produced, an increase in market prices could reduce profitability. If the strategy we utilize to hedge our exposure to these various risks or if our internal policies and procedures designed to monitor the exposure to these various risks are not effective, we could incur material losses. Our market positions can also be adversely affected by the level of volatility in the energy markets that, in turn, depends on various factors, including weather in various geographical areas, short-term supply and demand imbalances, and pricing differentials at various geographic locations. These risks cannot be predicted with certainty.\n\n\nIn addition, the volatility and potential for higher natural gas or energy prices may have a material impact on collateral requirements related to the forward value of our open futures contracts. Higher collateral requirements reduce available short-term liquidity and increase working capital costs and may affect our ability to hedge generation output and fuel.\n\n\nWe may be unable to obtain an adequate nuclear fuel supply in the future.\n\n\nWe obtain substantially all of our nuclear fuel supply from third parties pursuant to arrangements that vary in term, pricing structure, firmness and delivery flexibility. Our fuel supply arrangements must be coordinated with storage services and other contracts to ensure that the nuclear fuel is delivered to our power plants at the times, in the quantities and otherwise in a manner that meets the needs of our generation portfolio and our customers. We must also comply with laws and regulations governing the transportation of such fuels.\n\n\nWe are exposed to increases in the price of nuclear fuel, and significant changes in the price of nuclear fuel could affect our cash flow, future results and impact our liquidity needs. In addition, we face risks with regard to the delivery to, and the use of nuclear fuel by, our power plants including the following:\n\n\n•\ncreditworthiness of third-party suppliers, defaults by third-party suppliers on supply obligations and our ability to replace supplies currently under contract may delay or prevent timely delivery;\n\n\n26\n\n\n\n\nTable of Contents\n\n\n \n\n\n•\nmarket liquidity for physical supplies of such fuels or availability of related services (e.g., fabrication) may be insufficient or available only at prices that are not acceptable to us;\n\n\n•\nvariation in the quality of such fuels may adversely affect our power plant operations;\n\n\n•\ndomestic and foreign legislative or regulatory actions or requirements may impact the availability of and/or increase the cost of such fuels; and\n\n\n•\nthe loss of critical infrastructure, acts of war or terrorist attacks (including cybersecurity breaches) or catastrophic events such as fires, earthquakes, explosions, floods, severe storms or other similar occurrences could impede the delivery of such fuels.\n\n\nThe nuclear units we operate have a diversified portfolio of contracts and inventory that provide a substantial portion of our fuel raw material needs over the next several years. However, each of the nuclear units we operate has contracted with a single fuel fabrication services provider, and transitioning to an alternative provider could take an extended period of time. This could have a material adverse impact on our business, the financial results of specific plants and on our results of operations.\n \n\n\nAlthough our fuel contract portfolio provides a degree of hedging against these market risks, such hedging may not be effective and future increases in our fuel costs could materially and adversely affect our financial condition and results of operations.\n \n\n\nThe introduction or expansion of technologies related to energy generation, distribution and consumption and changes in customer usage patterns could adversely impact us.\n\n\nFederal and state incentives for the development and operation of renewable sources of power have facilitated the penetration of competing technologies, such as wind, solar, and commercial-sized power storage. Additionally, the development of demand side management (DSM) and EE programs can impact demand requirements for electricity and natural gas markets. The development of competing on-site power generation could also result in a reduction in anticipated growth which could negatively impact our financial condition, results of operations and cash flows.\n \n\n\nAdvances in distributed generation technologies, such as fuel cells, micro turbines, micro grids, windmills and net-metered solar installations, coupled with subsidies, may reduce the cost of alternative methods of delivering electricity to customers to a level that is competitive with that of most central station electric production. Large customers, such as universities and hospitals, continue to explore potential micro grid installation. Certain states are also considering mandating the use of power storage resources to replace uneconomic or retiring generation facilities. Such developments could (i) affect the price of energy, (ii) reduce energy deliveries as customer-owned generation becomes more cost-effective, (iii) require further improvements to our distribution systems to address changing load demands, and (iv) make portions of our transmission and/or distribution facilities obsolete prior to the end of their useful lives. These technologies could also result in further declines in commodity prices or demand for delivered energy. Further, a material shift away from natural gas due to customer preference or regulatory developments and initiatives could reduce the number of gas customers.\n \n\n\nSome or all of these factors could result in a lack of growth or decline in customer demand for electricity or natural gas or of customers, and may cause us to fail to fully realize anticipated benefits from significant capital investments and expenditures, which could have a material adverse effect on our financial position, results of operations and cash flows. These factors could also materially affect our results of operations, cash flows or financial positions through, among other things, reduced operating revenues, increased O&M expenses, and increased capital expenditures, as well as potential asset impairment charges or accelerated depreciation and decommissioning expenses over shortened remaining asset useful lives.\n\n\nWe are subject to third-party credit risk relating to our sale of nuclear generation output.\n\n\nWe sell generation output through the execution of bilateral contracts. These contracts are subject to credit risk, which relates to the ability of our counterparties to meet their contractual obligations to us. Any failure of these counterparties to perform could have a material adverse impact on our results of operations, cash flows and financial position. In the spot markets, we are exposed to the risks of the default sharing mechanisms that exist in those markets, some of which attempt to spread the risk across all participants. Therefore, a default by a third party could increase our costs, which could negatively impact our results of operations and cash flows.\n \n\n\n27\n\n\n\n\nTable of Contents\n\n\n \n\n\nThere may be periods when PSEG Power generation may not operate and/or may not be able to meet its commitments under forward sale obligations and PJM rules at a reasonable cost or at all.\n\n\nA portion of PSEG Power’s nuclear generation output has been sold forward under fixed price financial power sales contracts. Forward financial sales offset physical sales in the PJM RTO spot market. Our forward sales of energy and capacity assume sustained, acceptable levels of operating performance. Operations at any of our plants could degrade to the point where the plant has to shut down or operate at less than full capacity. Some issues that could impact the operation of our facilities are:\n\n\n•\nbreakdown or failure of equipment, IT, processes or management effectiveness;\n\n\n•\ndisruptions in the transmission of electricity;\n\n\n•\nlabor disputes or work stoppages;\n\n\n•\nfuel supply interruptions;\n\n\n•\nlimitations which may be imposed by environmental or other regulatory requirements; and\n\n\n•\noperator error, acts of war or terrorist attacks (including physical or cybersecurity breaches) or catastrophic events such as fires, earthquakes, explosions, floods, severe weather or other similar occurrences.\n\n\nIdentifying and correcting any of these issues may require significant time and expense. Depending on the materiality of the issue, we may choose to close a plant rather than incur the expense of restarting it or returning it to full capacity.\n \n\n\nBecause the obligations under most of these forward sale agreements are not contingent on a unit being available to generate power, PSEG Power’s results of operations and cash flows are at risk even in the event of a plant outage, or a reduction in the available capacity of the unit. To the extent that PSEG Power does not meet its expected nuclear generation output, PSEG Power would be required to pay the difference between the market price and the contract price on its financial contracts without receiving the physical spot energy revenue or be required to purchase energy at higher prices to cover its shortfall. In addition, as capacity performance resources in PJM, PSEG’s nuclear units have been and will in the future be required to pay penalties if a forced outage at a plant occurs during a declared emergency event within PJM and that plant’s expected performance exceeds its actual performance during such event. The amount of such payments could be substantial and could have a material adverse effect on our financial condition, results of operations and cash flows.\n \n\n\nIn addition, changing market design rules, including capacity performance rules and timing of capacity market auctions, and/or failure to follow existing rules – by PJM or market participants – creates regulatory uncertainty and reliability risk.\n\n\nREGULATORY, LEGISLATIVE AND LEGAL RISKS\n\n\nPSE&G’s revenues, earnings and results of operations are dependent upon state laws and regulations that affect distribution and related activities.\n\n\nPSE&G is subject to regulation by the BPU. Such regulation affects almost every aspect of its businesses, including its retail rates. Failure to comply with these regulations could have a material adverse impact on PSE&G’s ability to operate its business and could result in fines, penalties or sanctions. The retail rates for electric and gas distribution services are established in a distribution base rate proceeding and remain in effect until a new distribution base rate proceeding is filed and concluded. PSE&G's base rates were most recently approved in October 2024. In addition, our utility has received approval for several clause recovery mechanisms, some of which provide for recovery of costs and earn returns on authorized investments. These clause mechanisms require periodic financial reviews to update rates charged to customers which are independent of base rate proceedings and are subject to prudency reviews by the BPU. Inability to obtain fair or timely recovery of all our costs pursuant to the distribution base rate case and/or these clause recovery mechanisms, including a return of, or on, our investments in rates, could have a material adverse impact on our results of operations and cash flows. In addition, if legislative and regulatory structures were to evolve in such a way that PSE&G’s exclusive rights to serve its regulated customers were eroded, its future earnings could be negatively impacted.\n \n\n\n28\n\n\n\n\nTable of Contents\n\n\n \n\n\nPSE&G also is pursuing a number of opportunities to expand its products and services to customers. BPU approval is required for any new endeavor, and is not guaranteed. Rejection or delay of such filings could have an adverse impact on our future growth, or our standing stakeholders.\n\n\nThe BPU also conducts periodic combined management/competitive service audits of New Jersey utilities related to affiliate standard requirements, competitive services, cross-subsidization, cost allocation and other issues. A finding by the BPU of non-compliance with these requirements could potentially impact our business, results of operations and cash flows. For information regarding PSE&G’s most recent affiliate and management audit, see Item 8. Note 13. Commitments and Contingent Liabilities.\n \n\n\nIn addition, PSE&G procures the supply requirements of its default service BGSS gas customers through a full-requirements contract with PSEG Power. Government officials, legislators and advocacy groups are aware of the affiliation between PSE&G and PSEG Power. In periods of rising utility rates, those officials and advocacy groups may question or challenge costs and transactions incurred by PSE&G with PSEG Power, irrespective of any previous regulatory processes or approvals underlying those transactions. The occurrence of such challenges may subject PSEG Power to a level of scrutiny not faced by other unaffiliated competitors in those markets and could even adversely affect retail rates received by PSE&G.\n\n\nPSE&G’s proposed investment projects or programs may not be fully approved by regulators and actual capital investment by PSE&G may be lower than planned, which would cause lower than anticipated rate base.\n\n\nPSE&G is a regulated public utility that operates and invests in an electric T&D system and a gas distribution system as well as certain regulated clean energy investments, including solar and EE within New Jersey. PSE&G invests in capital projects to maintain and improve its existing T&D system and to address various public policy goals and meet customer expectations. Transmission projects are subject to the rules governing PJM's FERC-approved transmission expansion planning process as well as other FERC rules, while distribution and clean energy projects are subject to approval by the BPU. The costs of PSE&G’s transmission projects are subject to prudency challenge at FERC and PSE&G’s rates themselves may also be challenged at FERC. FERC has also proposed elimination of certain transmission rate incentives, including the incentive that PSE&G receives for being a transmission owner member of PJM and accepting the related risk of RTO membership.\n \n\n\nWe cannot be certain that any proposed project or program will be approved as requested or at all. If the projects or programs that PSE&G may file from time to time are only approved in part, or not at all, or if the approval fails to allow for the timely recovery of all of PSE&G’s costs, including a return of, or on, its investment, PSE&G will have a lower than anticipated rate base, thus causing its future earnings to be lower than anticipated. Further, the BPU could take positions to exclude or limit utility participation in certain areas, such as renewable generation, EE, EV infrastructure, or energy storage programs, renewable natural gas or hydrogen projects, which would limit our relationship with customers and narrow our future growth prospects. In addition, PSE&G’s Clean Energy Future – Energy Efficiency II Program provides nearly $1 billion of funding to continue the on-bill repayment program, which allows customers to repay their cost of equipment upgrades over time directly through their PSE&G bill. While the deployment of this capital in the form of on-bill repayment is subject to customers meeting acceptable credit standard and bad debt expense is a recoverable cost in this program, any such recovery is subject to prudency review and approval by the BPU.\n\n\nWe are subject to comprehensive federal regulation that affects, or may affect, our businesses.\n\n\nWe are subject to regulation by federal authorities. Such regulation affects almost every aspect of our businesses, including management and operations; the terms and rates of transmission services; investment strategies; the financing of our operations and the payment of dividends. Failure to comply with these regulations could have a material adverse impact on our ability to operate our business and could result in fines, penalties or sanctions.\n\n\nRecovery of wholesale transmission rates\n—PSE&G’s wholesale transmission rates are regulated by FERC and our project costs are recovered through a FERC-approved formula rate. The revenue requirements are reset each year through this formula. Our formula rate and its components can be challenged at FERC in the future.\n\n\nIn April 2021, FERC issued a supplemental notice of proposed rulemaking to eliminate the incentive for RTO membership for transmitting utilities that have already received the incentive for three or more years. PSE&G began receiving a 50 basis\n \n\n\n29\n\n\n\n\nTable of Contents\n\n\n \n\n\npoint adder for RTO membership in 2008. Elimination of the adder for RTO membership would reduce PSE&G’s annual Net Income and annual cash inflows by approximately $40 million.\n\n\nTransmission Planning\n—FERC Order 1000 generally opened transmission development to competition from independent developers, allowing such developers to compete with incumbent utilities for the construction and operation of transmission facilities in its service territory. While Order 1000 retains limited carve-outs for certain projects that will continue to default to incumbents for construction responsibility, increased competition for transmission projects could decrease the value of new investments that would be subject to recovery by PSE&G under its rate base, which could have a material adverse impact on our financial condition and results of operations. FERC has considered, and may in the future consider, whether to modify - either limit or expand - Order 1000’s competition rules. FERC is also examining whether additional oversight is needed to control transmission costs.\n\n\nA significant input into PJM’s transmission planning process is its regional load forecast, which is adjusted on an annual basis. In January 2025, PJM adjusted its load forecast in the PSEG zone and across PJM to reflect increased expectations of large customer growth. Developing an accurate load forecast that reflects customer demand of the state – and other states in PJM – is critical to ensure that transmission is planned and built where it is needed to maintain reliability and that sufficient generation is procured in the capacity market.\n \n\n\nNERC Compliance\n—NERC, at the direction of FERC, has implemented mandatory NERC Operations and Planning and Critical Infrastructure Protection standards to ensure the reliability of the North American Bulk Electric System, which includes electric transmission and generation systems, and to prevent major system blackouts. NERC Critical Infrastructure Protection standards establish cybersecurity and physical security protections for critical systems and facilities. We have been, and will continue to be, periodically audited by NERC for compliance with both Operations and Planning and Critical Infrastructure Protection standards and are subject to penalties for non-compliance with applicable NERC standards. Failure to comply with applicable NERC standards could result in penalties or increased costs to bring such facilities into compliance. Such penalties and costs could materially adversely impact our business, results of operations and cash flows. Adverse audit findings and/or penalties for non-compliance could also pose reputational risk to us.\n\n\nMBR Authority and Other Regulatory Approvals\n—Under FERC regulations, public utilities that sell power at market rates must receive MBR authority before making power sales, and the majority of our businesses operate with such authority. Failure to maintain MBR authorization, or the effects of any severe mitigation measures that would be required if market power was evaluated differently in the future, could have a material adverse effect on our business, financial condition and results of operations. In December 2022, all of PSEG’s operating companies with MBR authority filed at FERC for acceptance of the companies’ updated triennial market power analysis. This filing remains pending at FERC.\n\n\nOversight by the CFTC relating to derivative transactions\n—The CFTC has regulatory oversight of the swap and futures markets and options, including energy trading, and licensed futures professionals such as brokers, clearing members and large traders. Changes to regulations or adoption of additional regulations by the CFTC, including any regulations relating to futures and other derivatives or margin for derivatives and increased investigations by the CFTC, could negatively impact PSEG Power’s ability to hedge its portfolio in an efficient, cost-effective manner by, among other things, potentially decreasing liquidity in the forward commodity and derivatives markets or limiting PSEG Power’s ability to utilize non-cash collateral for derivatives transactions.\n\n\nWe may also be required to obtain various other regulatory approvals to, among other things, buy or sell assets, engage in transactions between our public utility and our other subsidiaries, and, in some cases, enter into financing arrangements, issue securities and allow our subsidiaries to pay dividends. Failure to obtain these approvals on a timely basis could materially adversely affect our results of operations and cash flows.\n\n\nThe markets, PTC and/or ZEC program may not provide sufficient financial support for our New Jersey nuclear plants which could result in the retirement of all of these nuclear plants.\n \n\n\nAs further described in Item 7. MD&A—Executive Overview of 2024 and Future Outlook, PSEG Power’s Salem 1, Salem 2 and Hope Creek nuclear plants have been awarded ZECs by the BPU through May 2025.\n \n\n\n30\n\n\n\n\nTable of Contents\n\n\n \n\n\nIn August 2022, the IRA was signed into law expanding incentives promoting carbon-free generation. The enacted legislation established a PTC for electricity generation using nuclear energy which begins January 1, 2024 and continues through 2032. The expected PTC rate is up to $15/MWh subject to adjustment based upon a facility’s gross receipts. The PTC rate and the gross receipts threshold are subject to annual inflation adjustments. The U.S. Treasury has not yet defined gross receipts. The ZEC payment will be adjusted by the BPU to offset environmental or fuel diversity payments that a selected nuclear plant may receive from another source. We continue to estimate the PTC while we await additional guidance from the U.S. Treasury. The U.S. Treasury may issue guidance related to the PTC and/or the Federal government could amend the IRA, either of which could have an adverse impact on our financial condition, results of operations and cash flows.\n \n\n\nIf the markets, PTC and/or the ZEC program do not provide sufficient financial support, or, in the case of the Salem nuclear plants, decisions by the EPA and state environmental regulators regarding the implementation of Section 316(b) of the CWA and related state regulations, or other factors, PSEG Power may take all necessary steps to cease to operate all of these plants and will incur associated costs and accounting charges in the event that the financial condition of the plants is materially adversely impacted in the future. Ceasing operations of these plants would result in a material adverse impact on PSEG’s results of operations.\n\n\nWe may be adversely affected by changes in energy regulatory policies, including energy and capacity market design rules and developments affecting transmission.\n\n\nThe energy industry continues to be regulated and the rules to which our businesses are subject are always at risk of being changed. Our business has been impacted by established rules that create locational capacity markets in PJM. Under these rules, generators located in constrained areas are paid more for their capacity so there is an incentive to locate in those areas where generation capacity is most needed. PJM’s capacity market design rules continue to evolve and change, including in response to projections of higher demand, efforts to integrate public policy initiatives into the wholesale markets, lack of sufficient generation capacity and extreme weather events. These changes have led to capacity market auction delays. For a discussion of recent changes in energy regulatory policies that may affect our business and results of operations, see Item 1. Business—Regulatory Issues—Federal Regulation.\n \n\n\nFurther, some of the market-based mechanisms in which we participate are at times the subject of review or discussion by some of the participants in the New Jersey and federal arenas. We can provide no assurance that these mechanisms will continue to exist in their current form, nor otherwise be modified.\n\n\nOur ownership and operation of nuclear power plants involve regulatory risks as well as financial, environmental and health and safety risks.\n\n\nWe are exposed to risks related to the continued successful operation of our nuclear facilities and issues that may adversely affect the nuclear generation industry. In addition to the risk of retirement discussed below, risks associated with the operation of nuclear facilities include:\n \n\n\nStorage and Disposal of Spent Nuclear Fuel\n—Federal law requires the United States Department of Energy (DOE) to provide for the permanent storage of spent nuclear fuel. The DOE has not yet begun accepting spent nuclear fuel. Until a federal site is available, we use on-site storage for spent nuclear fuel, which is reimbursed by the DOE. However, future capital expenditures may be required to increase spent fuel storage capacity at our nuclear facilities. Once a federal site is available, the DOE may impose fees to support a permanent repository. Further, the on-site storage for spent nuclear fuel may significantly increase our nuclear unit decommissioning costs.\n \n\n\nRegulatory and Legal Risk\n—We may be required to substantially increase capital expenditures or operating or decommissioning costs at our nuclear facilities if there is a change in the Atomic Energy Act or the applicable regulations, trade controls or the environmental rules and regulations applicable to nuclear facilities; a modification, suspension or revocation of licenses issued by the NRC; the imposition of civil penalties for failure to comply with the Atomic Energy Act, related regulations, trade controls or the terms and conditions of the licenses for nuclear generating facilities; or the shutdown of one of our nuclear facilities. Any such event could have a material adverse effect on our financial condition or results of operations.\n \n\n\n31\n\n\n\n\nTable of Contents\n\n\n \n\n\nOperational Risk\n—Operations and equipment reliability at any of our nuclear facilities, whether operated by us or our co-owner, could degrade to the point where an affected unit needs to be shut down or operated at less than full capacity. If this were to happen, identifying and correcting the causes could require significant time and expense and a significant outage could result in reduced earnings as we would have less electric output to sell and would be required to deliver on our forward sale commitments.\n\n\nIn addition, if a unit cannot be operated through the end of its current estimated useful life, our results of operations could be adversely affected by increased depreciation rates, impairment charges and accelerated future decommissioning costs.\n\n\nNuclear Incident or Accident Risk\n—Accidents and other unforeseen problems have occurred at nuclear stations, both in the U.S. and elsewhere. The consequences of an accident can be severe and may include loss of life, significant property damage and/or a change in the regulatory climate. We have nuclear units at two sites. It is possible that an accident or other incident at a nuclear generating unit could adversely affect our ability to continue to operate unaffected units located at the same site, which would further affect our financial condition, results of operations and cash flows. An accident or incident at a nuclear unit not owned by us could lead to increased regulation, which could affect our ability to continue to economically operate our units. Any resulting financial impact from a nuclear accident may exceed our resources, including insurance coverages. Further, as a licensed nuclear operator subject to the Price-Anderson Act and a member of a nuclear industry mutual insurance company, PSEG Power is subject to potential retroactive assessments as a result of an industry nuclear incident or retrospective premiums due to adverse industry loss experience and such assessments may be material.\n\n\nIn the event of non-compliance with applicable legislation, regulation and licenses, the NRC may increase oversight, impose fines, and/or shut down a unit, depending on its assessment of the severity of the non-compliance. If a serious nuclear incident were to occur, our business, reputation, financial condition and results of operations could be materially adversely affected. In each case, the amount and types of insurance available to cover losses that might arise in connection with the operation of our nuclear fleet are limited and may be insufficient to cover any costs we may incur.\n\n\nDecommissioning\n—NRC regulations require that licensees of nuclear generating facilities demonstrate reasonable assurance that funds will be available to decommission a nuclear facility at the end of its useful life. PSEG Nuclear has established an NDT Fund to satisfy these obligations. However, forecasting trust fund investment earnings and costs to decommission nuclear generating stations requires significant judgment, and actual results could differ significantly from current estimates. If we determine that it is necessary to retire one of our nuclear generating stations before the end of its useful life, there is a higher risk that it will no longer meet the NRC minimum funding requirements due to the earlier commencement of decommissioning activities and a shorter time period over which the NDT investments could appreciate in value. A shortfall could require PSEG to post parental guarantees or make additional cash contributions to ensure that the NDT Fund continues to satisfy the NRC minimum funding requirements. As a result, our financial position or cash flows could be significantly adversely affected.\n\n\nThird-Party Operation of Peach Bottom Plants\n—While we have a 50% ownership interest in the Peach Bottom nuclear generation plants, these plants are operated by a third party and, therefore, we have limited control over the operational and other risks associated with these plants.\n\n\nWe are subject to numerous federal, state and local environmental laws and regulations that may significantly limit or affect our businesses, adversely impact our business plans or expose us to significant environmental fines and liabilities.\n\n\nWe are subject to extensive federal, state and local environmental laws and regulations regarding air quality, water quality, site remediation, land use, waste disposal, climate change impact, natural resource damages and other matters. These laws and regulations affect how we conduct our operations and make capital expenditures. Over the past several years, there have been various changes to make existing environmental laws and regulations stricter and this trend may continue. Changes in these laws, or violations of laws, could result in significant increases in our compliance costs, capital expenditures to bring facilities into compliance, operating costs for remediation and clean-up actions, civil penalties or damages from actions brought by third parties for alleged health or property damages. Any such increase in our costs could have a material impact on our financial condition, results of operations and cash flows and could require further economic review to determine whether to continue operations or decommission an affected facility. We may also be unable to successfully recover certain\n \n\n\n32\n\n\n\n\nTable of Contents\n\n\n \n\n\nof these cost increases through our existing regulatory rate structures, in the case of PSE&G, or our contracts with our customers, in the case of PSEG Power.\n\n\nActions by state and federal government agencies could also result in reduced reliance on natural gas and could potentially result in stranding natural gas assets owned and operated by PSE&G, which could materially adversely affect our business, financial condition and results of operations.\n\n\nPSE&G recovers certain remediation and legal costs associated with its manufactured gas plant sites through Remediation Adjustment Charge (RAC) filings with the BPU. Continued future recoveries through the RAC are not guaranteed. Any failure to make future recoveries could materially impact our financial condition.\n \n\n\nIn addition, PSEG Power retained ownership of certain liabilities excluded from the sale of its fossil generation portfolio. These primarily relate to obligations under environmental regulations, including remediation obligations under the New Jersey Industrial Site Recovery Act and the Connecticut Transfer Act. It will require multiple years and comprehensive environmental sampling to understand the extent of and to carry out the required remediation. At this stage of the remediation process, the full remediation costs are not estimable, but given the number and operating history of the facilities in the portfolio, the full remediation costs will likely be material in the aggregate. The costs could potentially include costs for, among other things, excavating soil, implementation of institutional controls, and the construction, operation and maintenance of engineering controls.\n\n\nEnvironmental laws and regulations have generally become more stringent over time, and this trend is likely to continue. For further discussion of environmental laws and regulations impacting our business, results of operations and financial condition, including the impact of federal and state laws and regulations relating to remediation of environmental contamination, see Item 8. Note 13. Commitments and Contingent Liabilities.\n \n\n\nWe may not receive necessary licenses, permits and siting approvals in a timely manner or at all, which could adversely impact our business and results of operations.\n\n\nWe must periodically apply for licenses and permits from various regulatory authorities, including environmental regulatory authorities, and siting/permitting approvals for our transmission investments, and abide by their respective orders. Delay in obtaining, or failure to obtain and maintain, any permits or approvals, including environmental permits or approvals, or delay in or failure to satisfy any applicable regulatory requirements, could:\n\n\n•\nprevent construction of new facilities,\n\n\n•\nlimit or prevent continued operation of existing facilities,\n\n\n•\nlimit or prevent the sale of energy from these facilities, or\n\n\n•\nresult in significant additional costs,\n\n\neach of which could materially affect our business, financial condition, results of operations and cash flows. In addition, the process of obtaining licenses and permits from regulatory authorities may be delayed or defeated by concerted community opposition and such delay or defeat could have a material effect on our business.\n\n\nChanges in tax laws and regulations may adversely affect our financial condition, results of operations and cash flows.\n\n\nThe enactment, amendment or repeal of federal or state tax legislation and/or the clarification of previously enacted tax laws, including U.S. Treasury guidance relating to the 15% CAMT, the nuclear PTC and other energy tax credit provisions, could have a material impact on our effective tax rate and cash tax position.",
  "item7": null,
  "item2": null
}