{
  "source_file": "pep-20250906.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nFINANCIAL REVIEW\nOur discussion and analysis is intended to help the reader understand our results of operations and financial condition and is provided as an addition to, and should be read in connection with, our condensed consolidated financial statements and the accompanying notes. Unless otherwise noted, tabular dollars are presented in millions, except per share amounts. All per share amounts reflect common stock per share amounts, assume dilution unless otherwise noted, and are based on unrounded amounts. Percentage changes are based on unrounded amounts.\nOur Critical Accounting Policies and Estimates\nThe critical accounting policies and estimates below should be read in conjunction with those outlined in our Recast Segment Information.\nTotal Marketplace Spending\nWe offer sales incentives and discounts through various programs to customers and consumers. Total marketplace spending includes sales incentives, discounts, advertising and other marketing activities. Sales incentives and discounts are primarily accounted for as a reduction of revenue. A number of our sales incentives, such as bottler funding to independent bottlers and customer volume rebates, are based on annual targets, and accruals are established during the year, as products are delivered, for the expected payout, which may occur after year end once reconciled and settled. \nThese accruals are based on contract terms and our historical experience with similar programs and require management judgment with respect to estimating customer and consumer participation and performance levels. Differences between estimated expense and actual incentive costs are normally insignificant and are recognized in earnings in the period such differences are determined. In addition, certain advertising and marketing costs are also based on annual targets and recognized during the year as incurred.\nFor interim reporting, our policy is to allocate our forecasted full-year sales incentives for most of our programs to each of our interim reporting periods in the same year that benefits from the programs. The allocation methodology is based on our forecasted sales incentives for the full year and the proportion of each interim period’s actual gross revenue or volume, as applicable, to our forecasted annual gross revenue or volume, as applicable. Based on our review of the forecasts at each interim period, any changes in estimates and the related allocation of sales incentives are recognized beginning in the interim period that they are identified. In addition, we apply a similar allocation methodology for interim reporting purposes for certain advertising and other marketing activities.\nIncome Taxes\nIn determining our quarterly provision for income taxes, we use an estimated annual effective tax rate which is based on our expected annual income, statutory tax rates and tax structure and transactions, including transfer pricing arrangements, available to us in the various jurisdictions in which we operate. Significant judgment is required in determining our annual tax rate and in evaluating our tax positions. Subsequent recognition, derecognition and measurement of a tax position taken in a previous period are separately recognized in the quarter in which they occur.\nOur Business Risks\nThis Form 10-Q contains statements reflecting our views about our future performance that constitute “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 (Reform Act). Statements that constitute forward-looking statements within the meaning of the Reform Act \n31\n \nTable of Contents\n    \nare generally identified through the inclusion of words such as “aim,” “anticipate,” “believe,” “drive,” “estimate,” “expect,” “expressed confidence,” “forecast,” “future,” “goal,” “guidance,” “intend,” “may,” “objective,” “outlook,” “plan,” “position,” “potential,” “project,” “seek,” “should,” “strategy,” “target,” “will” or similar statements or variations of such words and other similar expressions. All statements addressing our future operating performance, and statements addressing events and developments that we expect or anticipate will occur in the future, are forward-looking statements within the meaning of the Reform Act. These forward-looking statements are based on currently available information, operating plans and projections about future events and trends. They inherently involve risks and uncertainties that could cause actual results to differ materially from those predicted in any such forward-looking statement. Such risks and uncertainties include, but are not limited to: future demand for PepsiCo’s products; damage to PepsiCo’s reputation or brand image; product recalls or other issues or concerns with respect to product quality and safety; PepsiCo’s ability to compete effectively; PepsiCo’s ability to attract, develop and maintain a highly skilled workforce or effectively manage changes in our workforce; water scarcity; changes in the retail landscape or in sales to any key customer; disruption of PepsiCo’s manufacturing operations or supply chain, including increased commodity, packaging, transportation, labor and other input costs; political, social or geopolitical conditions in the markets where PepsiCo’s products are made, manufactured, distributed or sold; PepsiCo’s ability to grow its business in developing and emerging markets; changes in economic conditions in the countries in which PepsiCo operates; changes in tariffs and global trade relations; future cyber incidents and other disruptions to our information systems; failure to successfully complete or manage strategic transactions; PepsiCo’s reliance on third-party service providers and enterprise-wide systems; climate change or measures to address climate change and other sustainability matters; strikes or work stoppages; failure to realize benefits from PepsiCo’s productivity initiatives or organizational restructurings; deterioration in estimates and underlying assumptions regarding future performance of our business or investments that can result in impairment charges; fluctuations or other changes in exchange rates; any downgrade or potential downgrade of PepsiCo’s credit ratings; imposition or proposed imposition of new or increased taxes aimed at PepsiCo’s products; imposition of limitations on the marketing or sale of PepsiCo’s products; changes in laws and regulations related to the use or disposal of plastics or other packaging materials; failure to comply with personal data protection and privacy laws; increase in income tax rates, changes in income tax laws or disagreements with tax authorities; failure to adequately protect PepsiCo’s intellectual property rights or infringement on intellectual property rights of others; failure to comply with applicable laws and regulations; potential liabilities and costs from litigation, claims, legal or regulatory proceedings, inquiries or investigations; and other risks and uncertainties including those described in “Item 1A. Risk Factors” in our 2024 Form 10-K, “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks,” included in our Recast Segment Information and in “Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks” of this Form 10-Q. Investors are cautioned not to place undue reliance on any such forward-looking statements, which speak only as of the date they are made. We undertake no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise.\nRisks Associated with Commodities and Our Supply Chain\nMany of the commodities used in the production and transportation of our products are purchased in the open market. The prices we pay for such items are subject to fluctuation, and we manage this risk through the use of fixed-price contracts and purchase orders, pricing agreements and derivative instruments, including swaps and futures. A number of external factors, including volatile geopolitical conditions, the inflationary cost environment, import/export restrictions and tariffs, adverse weather conditions and supply chain disruptions, have impacted and may continue to impact commodity, transportation and labor \n32\n \nTable of Contents\n    \ncosts. When prices increase, we may or may not pass on such increases to our customers, which may result in reduced volume, revenue, margins and operating results.\nSee Note\n \n9 to our condensed consolidated financial statements in this Form 10-Q and Note 9 to our consolidated financial statements in our Recast Segment Information for further information on how we manage our exposure to commodity prices.\nRisks Associated with Climate Change\nCertain jurisdictions in which our products are made, manufactured, distributed or sold have either imposed, or are considering imposing, new or increased legal and regulatory requirements to reduce or mitigate the potential effects of climate change, including regulation of greenhouse gas emissions and potential carbon pricing programs. These new or increased legal or regulatory requirements, along with initiatives to meet our sustainability goals, could result in significant increased costs and additional investments in facilities and equipment. However, we are unable to predict the scope, nature and timing of any new or increased environmental laws and regulations and therefore cannot predict the ultimate impact of such laws and regulations on our business or financial results. We continue to monitor existing and proposed laws and regulations in the jurisdictions in which our products are made, manufactured, distributed and sold and to consider actions we may take to potentially mitigate the unfavorable impact, if any, of such laws or regulations.\nRisks Associated with International Operations \nIn the 12 weeks ended September 6, 2025, our financial results outside of North America reflect the months of June, July and August. In the 36 weeks ended September 6, 2025, our financial results outside of North America reflect the months of January through August. In the 36 weeks ended September 6, 2025, our operations outside of the United States generated 43% of our consolidated net revenue, with Mexico, Russia, Canada, China, the United Kingdom, Brazil and South Africa comprising approximately 24% of our consolidated net revenue. As a result, we are exposed to foreign exchange risk in the international markets in whi\nch our products are made, manufactured, distributed or sold. In the \n12 weeks ended September 6, 2025, favorable foreign exchange \ncontributed to\n net revenue performance by 0.5 percentage points primarily driven by an \nappreciation\n of the Russian ruble, euro, British pound and Polish zloty, \npartially offset by declines in the Turkish lira, Mexican peso and Argentine peso\n. In the 36 weeks ended September 6, 2025, unfavorable foreign exchange \nreduced\n net revenue performance by 1 percentage point primarily driven by \ndeclines\n in the Mexican peso, Turkish lira, Egyptian pound and Brazilian real, partially offset by an appreciation of the Russian ruble.\n Currency declines against the U.S. dollar which are not offset could adversely impact our future financial results.\nIn addition, volatile economic, political, social and geopolitical conditions, civil unrest and wars and other military conflicts, acts of terrorism and natural disasters and other catastrophic events in certain markets in which our products are made, manufactured, distributed or sold, including in Argentina, Brazil, China, Mexico, the Middle East (including Egypt), Russia, Turkey and Ukraine, continue to result in challenging operating environments and have resulted in and could continue to result in changes in how we operate in certain of these markets. Debt and credit issues, currency controls or fluctuations, sanctions and export controls in certain of these international markets (including restrictions on the transfer of funds to and from certain markets) have also continued to impact our operations in certain of these international markets. We continue to closely monitor the economic, operating and political environment in the markets in which we operate, including risks of additional impairments or write-offs and currency fluctuation, and to identify actions to potentially mitigate any unfavorable impacts on our future results. Our operations in Russia accounted for 5.5% and 5% of our consolidated net revenue for the 12 and 36 weeks ended September 6, 2025, respectively. Russia accounted for 4.5% of our consolidated assets, including 15% of \n33\n \nTable of Contents\n    \nour consolidated cash and cash equivalents and 39% of our accumulated currency translation adjustment loss as of September 6, 2025.\nSee Note\n \n9 to our condensed consolidated financial statements in this Form 10-Q for the fair values of our financial instruments as of September 6, 2025 and December 28, 2024 and Note 9 to our consolidated financial statements in our Recast Segment Information for a discussion of these items. \nRisks Associated with Tariffs\nThe imposition of tariffs (including U.S. tariffs imposed or threatened to be imposed on China, the European Union, Canada and Mexico and other countries and any tariffs imposed by such countries) have impacted and could continue to impact our supply chain resulting in increased input costs, including the cost of certain raw materials and packaging. The impact of tariffs will continue to vary, including based on where inputs are sourced from and shipped to. In addition, any supply chain constraints, inflationary impacts or reduced consumer demand for our products as a result of such tariffs or ongoing macroeconomic uncertainty have impacted and could continue to impact our results. We will continue to evaluate the nature and extent of the impact of these tariffs on our business and to identify actions to potentially mitigate, where possible, any unfavorable impacts on our future results.\nImposition of Taxes and Regulations on our Products\nCertain jurisdictions in which our products are made, manufactured, distributed or sold have either imposed, or are considering imposing, new or increased taxes or regulations on the manufacture, distribution or sale of our products or their packaging, ingredients or substances contained in, or attributes of, our products or their packaging, commodities used in the production of our products or their packaging or the recyclability or recoverability of our packaging. These taxes and regulations vary in scope and form. For example, some taxes apply to all beverages, including non-caloric beverages, while others apply only to beverages with a caloric sweetener (e.g., sugar). Further, some regulations apply to all products using certain types of packaging (e.g., plastic), while others are designed to increase the sustainability of packaging, encourage waste reduction and increased recycling rates or facilitate the waste management process or restrict the sale of products in certain packaging. In addition, certain jurisdictions in which our snack products are sold have either imposed or are considering imposing, new or increased taxes on the manufacture, distribution or sale of certain of our snack products as a result of ingredients (such as sugar, sodium or saturated fat) contained in our products.\nWe sell a wide variety of beverages and convenient foods in more than 200 countries and territories and the profile of the products we sell, the amount of revenue attributable to such products and the type of packaging used vary by jurisdiction. Because of this, we cannot predict the scope or form potential taxes, regulations or other limitations on our products or their packaging may take, and therefore cannot predict the impact of such taxes, regulations or limitations on our financial results. In addition, taxes, regulations and limitations may impact us and our competitors differently. We expect continued scrutiny of certain ingredients and substances present in certain of our products and packaging. We continue to monitor existing and proposed taxes and regulations in the jurisdictions in which our products are made, manufactured, distributed and sold and to consider actions we may take to potentially mitigate the unfavorable impact, if any, of such taxes, regulations or limitations, including advocating alternative measures with respect to the imposition, form and scope of any such taxes, regulations or limitations. \nOECD Global Minimum Tax\nNumerous countries, \nincluding European Union member states, have enacted, or are expected to enact, legislation incorporating the OECD model rules for a global minimum tax rate of 15%. Widespread implementation is expected by the end of 2025, with certain countries that have not yet enacted potentially applying the legislation as of a retroactive date. As the legislation becomes effective in countries in which \n34\n \nTable of Contents\n    \nwe do business, our taxes could increase and negatively impact our provision for income taxes. We will continue to monitor pending legislation and implementation by individual countries and evaluate the potential impact on our business in future periods.\nRetail Landscape\nOur industry continues to be affected by disruption of the retail landscape, including the continued growth in sales through e-commerce websites and mobile commerce applications, including through subscription services, the integration of physical and digital operations among retailers and the international expansion of hard discounters. We have seen and expect to continue to see a further shift to e-commerce, online-to-offline and other online purchasing by consumers. We continue to monitor changes in the retail landscape and seek to identify actions we may take to build our global e-commerce and digital capabilities, such as expanding our direct-to-consumer business, and distribute our products effectively through all existing and emerging channels of trade and potentially mitigate any unfavorable impacts on our future results.\nThe retail industry also continues to be impacted by the actions and increasing power of retailers, including as a result consolidation of ownership resulting in large retailers or buying groups with increased purchasing power, particularly in North America, Europe and Latin America. We have seen and expect to continue to see retailers and buying groups impact our ability to compete in these jurisdictions. We continue to monitor our relationships with retailers and buying groups and seek to identify actions we may take to maintain mutually beneficial relationships and resolve any significant disputes and potentially mitigate any unfavorable impacts on our future results.\nCautionary statements included above and in “Item 1A. Risk Factors” in our 2024 Form 10-K and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks” in our Recast Segment Information should be considered when evaluating our trends and future results.\nResults of Operations – Consolidated Review\nConsolidated Results\nVolume\nPhysical or unit volume is one of the key metrics management uses internally to make operating and strategic decisions, including the preparation of our annual operating plan and the evaluation of our business performance. We believe volume provides additional information to facilitate the comparison of our historical operating performance and underlying trends and provides additional transparency on how we evaluate our business because it measures demand for our products at the consumer level. See “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Financial Results – Volume” included in our Recast Segment Information for further information on volume. Unit volume performance adjusts for the impacts of acquisitions and divestitures. Acquisitions and divestitures, when used in this report, reflect mergers and acquisitions activity, as well as divestitures and other structural changes, including changes in ownership or control in consolidated subsidiaries and nonconsolidated equity investees. Further, unit volume performance excludes the impact of an additional week of results every five or six years (53\nrd\n reporting week), where applicable.\nWe report all of our international operations on a monthly calendar basis. The 12 weeks ended September 6, 2025 and September 7, 2024 include volume outside of North America for the months of June, July and August. The 36 weeks ended September 6, 2025 and September 7, 2024 include volume outside of North America for the months of January through August.\n35\n \nTable of Contents\n    \nConsolidated Net Revenue and Operating Profit\n \n12 Weeks Ended\n36 Weeks Ended\n \n9/6/2025\n9/7/2024\nChange\n9/6/2025\n9/7/2024\nChange\nNet revenue\n$\n23,937\n \n$\n23,319 \n3\n \n%\n$\n64,582\n \n$\n64,070 \n1\n \n%\nOperating profit\n$\n3,569\n \n$\n3,872 \n(8)\n%\n$\n7,941\n \n$\n10,637 \n(25)\n%\nOperating margin\n14.9\n \n%\n16.6 \n%\n(1.7)\n12.3\n \n%\n16.6 \n%\n(4.3)\nSee “Results of Operations – Segment Review” for a tabular presentation and discussion of key drivers of net revenue.\n12 Weeks \nOperating profit decreased 8% and operating margin declined 1.7 percentage points. Operating profit performance was primarily driven by certain operating cost increases, a decline in organic volume, \nan 8-percentage-point impact of higher commodity costs, partly driven by a 3-percentage-point impact of tariffs, and higher acquisition and divestiture-related charges. These impacts were partially offset by productivity savings, effective net pricing and lower advertising and marketing expenses. \nThe operating margin decline primarily reflects the acquisition and divestiture-related charges related to our poppi acquisition.\n36 Weeks\nOperating profit decreased 25% and operating margin declined 4.3 percentage points. Operating profit performance was primarily driven by certain operating cost increases, impairment charges related to the Rockstar brand, a decline in organic volume and a 5.5-percentage-point impact of higher commodity costs. These impacts were partially offset by productivity savings, effective net pricing and lower advertising and marketing expenses. The operating margin decline primarily reflects the unfavorable impact of the impairment charges related to the Rockstar brand.\nOther Consolidated Results\n \n12 Weeks Ended\n36 Weeks Ended\n \n9/6/2025\n9/7/2024\nChange\n9/6/2025\n9/7/2024\nChange\nOther pension and retiree medical benefits income\n$\n26\n \n$\n41 \n$\n(15)\n$\n91\n \n$\n155 \n$\n(64)\nNet interest expense and other\n$\n264\n \n$\n219 \n$\n45\n \n$\n788\n \n$\n655 \n$\n133\n \nTax rate \n21.4\n \n%\n20.3 \n%\n20.8\n \n%\n20.2 \n%\nNet income attributable to PepsiCo \n$\n2,603\n \n$\n2,930 \n(11)\n%\n$\n5,700\n \n$\n8,055 \n(29)\n%\nNet income attributable to PepsiCo per common share – diluted \n$\n1.90\n \n$\n2.13 \n(11)\n%\n$\n4.15\n \n$\n5.84 \n(29)\n%\n12 Weeks\nOther pension and retiree medical benefits income decreased $15 million, primarily reflecting recognition of fixed income losses on plan assets and the impact of certain plan changes approved in 2020, as discussed in Note 7 to our consolidated financial statements in our Recast Segment Information, partially offset by higher prior-year recognition of special termination benefits due to restructuring actions as part of our 2019 Productivity Plan. \nNet interest expense and other \nincreased \n$45 million, due to higher average debt balances, higher interest rates on average debt balances and lower interest rates on average cash balances, partially offset by higher average cash balances and higher gains on the market value of investments used to economically hedge a portion of our deferred compensation liability.\n36\n \nTable of Contents\n    \nThe reported tax rate \nincreased\n 1.1 percentage points, \nprimarily reflecting the unfavorable impact of a tax audit settlement in our LatAm Foods segment, partially offset by the reversal of deferred tax liability on undistributed earnings as a result of a tax election.\n36 Weeks\nOther pension and retiree medical benefits income decreased $64 million, primarily reflecting recognition of fixed income losses on plan assets and the impact of certain plan changes approved in 2020, as discussed in Note 7 to our consolidated financial statements in our Recast Segment Information, partially offset by higher prior-year recognition of special termination benefits due to restructuring actions as part of our 2019 Productivity Plan. \nNet interest expense and other increased \n$133 million\n, primarily \ndue to higher average debt balances, higher interest rates on average debt balances and lower interest rates on average cash balances, partially offset by higher average cash balances.\nThe reported tax rate \nincreased\n 0.6 percentage points, primarily reflecting the impact of a prior-year release of a valuation allowance in a foreign jurisdiction.\nResults of Operations – Segment Review\nEffective beginning with our first quarter of 2025, we realigned certain of our reportable segments to conform with changes to our organizational structure and how our Chief Executive Officer regularly reviews the performance of, and allocates resources to, these segments. Our historical segment reporting has been recast to reflect our current organizational structure.\nWhile our financial results in North America are reported on a 12-week basis, all of our international operations are reported on a monthly calendar basis for which the months of June, July and August are reflected in our results for the 12 weeks ended September 6, 2025 and September 7, 2024, and the months January through August are reflected in our results for the 36 weeks ended September 6, 2025 and September 7, 2024. \nIn the discussions of net revenue and operating profit below, “effective net pricing” reflects the year-over-year impact of discrete pricing actions, sales incentive activities and mix resulting from selling varying products in different package sizes and in different countries.\nSee “Our Business Risks,” “Non-GAAP Measures” and “Items Affecting Comparability” for a discussion of items to consider when evaluating our results and related information regarding measures not in accordance with GAAP. \n37\n \nTable of Contents\n    \nNet Revenue and Organic Revenue Performance\nOrganic revenue performance is a non-GAAP financial measure. For a description of and further information regarding this measure, see “Non-GAAP Measures.”\n12 Weeks Ended 9/6/2025\nImpact of\nImpact of\nReported \n% Change, GAAP measure\nForeign exchange translation\nAcquisitions and divestitures\nOrganic \n% Change, non-GAAP measure\n(a)\nOrganic volume change\n(b)\nEffective net pricing\nPFNA\n—\n \n%\n— \n(2.5)\n(3)\n%\n(4)\n2 \nPBNA\n2\n \n%\n— \n— \n2\n \n%\n(4)\n6 \nIB Franchise\n—\n \n%\n(1)\n— \n(1)\n%\n(5)\n4 \nEMEA\n9\n \n%\n(4)\n— \n5.5\n \n%\n— \n6 \nLatAm Foods\n2\n \n%\n2 \n— \n4\n \n%\n— \n4 \nAsia Pacific Foods\n2\n \n%\n— \n(1)\n1\n \n%\n4 \n(3)\nTotal\n3\n \n%\n(0.5)\n(1)\n1\n \n%\n(3)\n4 \n36 Weeks Ended 9/6/2025\nImpact of\nImpact of\nReported \n% Change, GAAP measure\nForeign exchange translation\nAcquisitions and divestitures\nOrganic \n% Change, non-GAAP measure\n(a)\nOrganic volume change\n(b)\nEffective net pricing\nPFNA\n—\n \n%\n— \n(2)\n(2)\n%\n(3)\n1 \nPBNA \n1\n \n%\n— \n— \n1\n \n%\n(3)\n4 \nIB Franchise\n2\n \n%\n1 \n— \n3\n \n%\n— \n3 \nEMEA\n6\n \n%\n— \n— \n6\n \n%\n(3.5)\n10 \nLatAm Foods\n(5)\n%\n10 \n— \n4\n \n%\n1 \n3 \nAsia Pacific Foods\n—\n \n%\n1 \n(1)\n—\n \n%\n5 \n(4.5)\nTotal\n1\n \n%\n1 \n(0.5)\n1.5\n \n%\n(2)\n4 \n(a)\nAmounts may not sum due to rounding.\n(b)\nExcludes the impact of acquisitions and divestitures. In certain instances, the impact of organic volume change on net revenue performance differs from the unit volume change disclosed in the following segment discussions due to the impacts of product mix, nonconsolidated joint venture volume, and, for our franchise beverage businesses, temporary timing differences between bottler case sales and concentrate shipments and equivalents (CSE). We report net revenue from our franchise beverage businesses based on CSE. The volume sold by our nonconsolidated joint ventures has no direct impact on our net revenue.\n38\n \nTable of Contents\n    \nOperating Profit, Operating Profit Adjusted for Items Affecting Comparability and Operating Profit Performance Adjusted for Items Affecting Comparability on a Constant Currency Basis\nOperating profit adjusted for items affecting comparability and operating profit performance adjusted for items affecting comparability on a constant currency basis are both non-GAAP financial measures. For a description of and further information regarding these measures, see “Non-GAAP Measures” and “Items Affecting Comparability.”\n12 Weeks Ended 9/6/2025\nPFNA\nPBNA\nIB Franchise\nEMEA\nLatAm Foods\nAsia Pacific Foods\nCorporate unallocated expenses\nTotal\nReported, GAAP measure\n$\n1,536 \n$\n729 \n$\n436 \n$\n720 \n$\n424 \n$\n151 \n$\n(427)\n$\n3,569 \nItems Affecting Comparability \n(a)\nMark-to-market net impact\n— \n— \n— \n— \n— \n— \n23 \n23 \nRestructuring and impairment charges\n32 \n19 \n2 \n69 \n17 \n5 \n(2)\n142 \nAcquisition and divestiture-related charges\n2 \n219 \n— \n— \n— \n— \n— \n221 \nImpairment and other charges \n— \n8 \n73 \n19 \n— \n— \n— \n100 \nIndirect and income tax impact\n— \n— \n— \n— \n82 \n— \n— \n82 \nCore, non-GAAP measure\n1,570 \n975 \n511 \n808 \n523 \n156 \n(406)\n4,137 \nImpact of foreign exchange translation\n— \n— \n(3)\n(30)\n11 \n(1)\n— \n(23)\nCore Constant Currency, non-GAAP measure\n$\n1,570 \n$\n975 \n$\n508 \n$\n778 \n$\n534 \n$\n155 \n$\n(406)\n$\n4,114 \nReported Operating Profit % Change, GAAP measure\n(5)\n%\n(20)\n%\n(5)\n%\n1 \n%\n(12)\n%\n16 \n%\n(3.5)\n%\n(8)\n%\nCore Operating Profit % Change, non-GAAP measure\n(3.5)\n%\n(7)\n%\n8 \n%\n7 \n%\n6 \n%\n19 \n%\n16 \n%\n(1)\n%\nCore Constant Currency Operating Profit % Change, non-GAAP measure\n(3.5)\n%\n(7)\n%\n7 \n%\n3 \n%\n9 \n%\n18 \n%\n16 \n%\n(1.5)\n%\n12 Weeks Ended 9/7/2024\nPFNA\nPBNA\nIB Franchise\nEMEA\nLatAm Foods\nAsia Pacific Foods\nCorporate unallocated expenses\nTotal\nReported, GAAP measure\n$\n1,620 \n$\n914 \n$\n458 \n$\n713 \n$\n480 \n$\n129 \n$\n(442)\n$\n3,872 \nItems Affecting Comparability \n(a)\nMark-to-market net impact\n— \n— \n— \n— \n— \n— \n52 \n52 \nRestructuring and impairment charges\n8 \n128 \n15 \n35 \n11 \n2 \n39 \n238 \nAcquisition and divestiture-related charges\n— \n5 \n— \n— \n— \n— \n— \n5 \nImpairment and other charges/credits\n— \n— \n— \n10 \n— \n— \n— \n10 \nProduct recall-related impact\n(1)\n— \n— \n— \n— \n— \n— \n(1)\nCore, non-GAAP measure\n$\n1,627 \n$\n1,047 \n$\n473 \n$\n758 \n$\n491 \n$\n131 \n$\n(351)\n$\n4,176 \n39\n \nTable of Contents\n    \n36 Weeks Ended 9/6/2025\nPFNA\nPBNA\nIB Franchise\nEMEA\nLatAm Foods\nAsia Pacific Foods\nCorporate unallocated expenses\nTotal\nReported, GAAP measure\n$\n4,463 \n$\n550 \n$\n1,248 \n$\n1,310 \n$\n1,301 \n$\n321 \n$\n(1,252)\n$\n7,941 \nItems Affecting Comparability \n(a)\nMark-to-market net impact\n— \n— \n— \n— \n— \n— \n(8)\n(8)\nRestructuring and impairment charges\n147 \n192 \n7 \n118 \n36 \n9 \n45 \n554 \nAcquisition and divestiture-related charges\n23 \n285 \n— \n— \n— \n— \n— \n308 \nImpairment and other charges\n— \n1,537 \n73 \n270 \n— \n80 \n— \n1,960 \nIndirect and income tax impact\n— \n— \n— \n— \n82 \n— \n— \n82 \nCore, non-GAAP measure\n4,633 \n2,564 \n1,328 \n1,698 \n1,419 \n410 \n(1,215)\n10,837 \nImpact of foreign exchange translation\n6 \n4 \n20 \n(16)\n170 \n2 \n— \n186 \nCore Constant Currency, non-GAAP measure\n$\n4,639 \n$\n2,568 \n$\n1,348 \n$\n1,682 \n$\n1,589 \n$\n412 \n$\n(1,215)\n$\n11,023 \nReported Operating Profit % Change, GAAP measure\n(7)\n%\n(77)\n%\n2 \n%\n(13)\n%\n(9)\n%\n(21)\n%\n9 \n%\n(25)\n%\nCore Operating Profit % Change, non-GAAP measure\n(8)\n%\n— \n%\n7 \n%\n7 \n%\n(3)\n%\n(1)\n%\n14 \n%\n(4)\n%\nCore Constant Currency Operating Profit % Change, non-GAAP measure\n(8)\n%\n— \n%\n9 \n%\n5.5 \n%\n8 \n%\n— \n%\n14 \n%\n(2)\n%\n36 Weeks Ended 9/7/2024\nPFNA\nPBNA\nIB Franchise\nEMEA\nLatAm Foods\nAsia Pacific Foods\nCorporate unallocated expenses\nTotal\nReported, GAAP measure\n$\n4,802 \n$\n2,411 \n$\n1,221 \n$\n1,509 \n$\n1,436 \n$\n407 \n$\n(1,149)\n$\n10,637 \nItems Affecting Comparability \n(a)\nMark-to-market net impact\n— \n— \n— \n— \n— \n— \n8 \n8 \nRestructuring and impairment charges\n47 \n143 \n15 \n75 \n32 \n6 \n75 \n393 \nAcquisition and divestiture-related charges\n— \n7 \n— \n— \n— \n— \n— \n7 \nImpairment and other charges\n— \n— \n— \n10 \n— \n— \n— \n10 \nProduct recall-related impact\n181 \n— \n— \n— \n— \n— \n— \n181 \nCore, non-GAAP measure\n$\n5,030 \n$\n2,561 \n$\n1,236 \n$\n1,594 \n$\n1,468 \n$\n413 \n$\n(1,066)\n$\n11,236 \n(a)\nSee “Items Affecting Comparability” for further information.\nPFNA\n12 Weeks\nNet revenue decreased slightly, primarily driven by a decrease in organic volume, partially offset by the favorable impact of acquisitions and effective net pricing. \nUnit volume declined 4%, driven by a 4% decrease in savory snacks volume and a 2% decrease in other foods volume.\nOperating profit decreased 5%, primarily reflecting certain operating cost increases, including strategic initiatives, and the decrease in organic volume. These impacts were partially offset by productivity savings and \na 4-percentage-point impact of gains on asset sales.\n36 Weeks\nNet revenue decreased slightly, primarily reflecting a decrease in organic volume, partially offset by the favorable impact of acquisitions. \nUnit volume declined 2%, driven by a 3% decrease in savory snacks volume, partially offset by a 3.5% increase in other foods volume.\n40\n \nTable of Contents\n    \nOperating profit decreased 7%, primarily reflecting certain operating cost increases, including strategic initiatives, and the decrease in organic volume. These impacts were partially offset by productivity savings and \na 3-percentage-point impact of gains on asset sales.\nPBNA\n12 Weeks\nNet revenue increased 2%, primarily driven by effective net pricing, partially offset by an organic volume decline. \nUnit volume declined 3%, driven by a 6% decline in non-carbonated beverage (NCB) volume, while carbonated soft drink (CSD) volume was even with the prior year.\nOperating profit decreased 20%, \nprimarily due to acquisition and divestiture-related charges related to our poppi acquisition, certain operating cost increases, \na 13-percentage-point impact of higher commodity costs, largely driven by a 12-percentage-point impact of tariffs, and the decline in organic volume. These impacts were partially offset by productivity savings, lower restructuring charges, lower advertising and marketing expenses and the effective net pricing. \n36 Weeks\nNet revenue increased 1%, primarily driven by effective net pricing, partially offset by an organic volume decline. \nUnit volume declined 3%, driven by a 6% decline in NCB volume, while CSD volume was even with the prior year.\nOperating profit decreased 77%, \nprimarily reflecting impairment charges related to the Rockstar brand. Operating profit also decreased due to certain operating cost increases, the decline in organic volume, acquisition and divestiture-related charges related to our poppi acquisition and a 5-percentage-point impact of higher commodity costs, driven by a 5-percentage-point impact of tariffs. These impacts were partially offset by productivity savings, the effective net pricing and lower advertising and marketing expenses. \nIB Franchise\n12 Weeks\nNet revenue increased slightly, primarily reflecting effective net pricing and a 1-percentage-point impact of favorable foreign exchange translation, partially offset by an organic volume decline.\nUnit volume declined 1%, primarily reflecting declines in Mexico and India, partially offset by growth in the Middle East.\nOperating profit decreased 5%, primarily reflecting an impairment charge related to the Rockstar brand and a 4-percentage-point impact of higher commodity costs, partially offset by lower advertising and marketing costs and productivity savings.\n36 Weeks\nNet revenue increased 2%, primarily reflecting effective net pricing, partially offset by a 1-percentage-point impact of unfavorable foreign exchange translation.\nUnit volume grew 1%, primarily reflecting growth in the Middle East, China and Pakistan, partially offset by a decline in Mexico.\nOperating profit increased 2%, primarily reflecting the net revenue growth and lower advertising and marketing costs, partially offset by an impairment charge related to the Rockstar brand.\n41\n \nTable of Contents\n    \nEMEA\n12 Weeks\nNet revenue increased 9%, primarily reflecting effective net pricing, part of which is from subsidiaries operating in highly inflationary economies, and a 4-percentage-point impact of favorable foreign exchange translation.\nConvenient foods unit volume declined 1%, primarily reflecting declines in Russia, South Africa and the United Kingdom, partially offset by growth in the Middle East and Pakistan. \nBeverage unit volume grew 1.5%, primarily reflecting growth in the Middle East, partially offset by declines in Turkey and Russia.\nOperating profit increased 1%, primarily reflecting the effective net pricing, productivity savings, lower advertising and marketing costs and a 4-percentage-point impact of favorable foreign exchange translation. These impacts were partially offset by certain operating cost increases, an 18-percentage-point impact of higher commodity costs, primarily dairy, potatoes and cooking oil, and higher restructuring charges. \n36 Weeks\nNet revenue increased 6%, primarily reflecting effective net pricing, partially offset by an organic volume decline.\nConvenient foods unit volume declined 5%, primarily reflecting declines in South Africa and Russia.\nBeverage unit volume grew slightly, primarily reflecting growth in the Middle East, Germany, Poland, Turkey and France, partially offset by declines in South Africa and Russia.\nOperating profit decreased 13%, primarily reflecting certain operating cost increases, a 24-percentage-point impact of higher commodity costs, primarily dairy, potatoes and cooking oil, and an impairment charge related to the Rockstar brand. These impacts were partially offset by the effective net pricing and productivity savings.\nLatAm Foods\n12 Weeks\nNet revenue increased 2%, primarily reflecting effective net pricing, partially offset by a 2-percentage-point impact of unfavorable foreign exchange translation. \nUnit volume declined slightly, primarily reflecting a decline in Mexico, partially offset by growth in Colombia and Brazil.\nOperating profit decreased 12%, primarily reflecting certain operating cost increases, \nan unfavorable impact of an indirect tax audit settlement, and an 8-percentage-point impact of higher commodity costs, partially offset by productivity savings and the effective net pricing.\n36 Weeks\nNet revenue decreased 5%, primarily reflecting a 10-percentage-point impact of unfavorable foreign exchange translation, driven by the weakening of the Mexican peso, partially offset by effective net pricing.\nUnit volume grew 1%, primarily reflecting growth in Brazil, Peru and Argentina, partially offset by a decline in Mexico.\nOperating profit decreased 9%, primarily reflecting certain operating cost increases, a 12-percentage-point impact of unfavorable foreign exchange translation, driven primarily by the weakening of the Mexican \n42\n \nTable of Contents\n    \npeso, a 7-percentage-point impact of higher commodity costs and \nan unfavorable impact of an indirect tax audit settlement, partially offset by productivity savings, the effective net pricing and a 4-percentage-point favorable impact of certain indirect tax credits in Brazil.\nAsia Pacific Foods\n12 Weeks\nNet revenue increased 2%, primarily reflecting organic volume growth, partially offset by unfavorable net pricing. \nUnit volume grew 3%, primarily reflecting growth in India, Australia and Thailand, partially offset by a decline in China.\nOperating profit increased 16%, primarily reflecting productivity savings, lower advertising and marketing costs, the organic volume growth and a 5-percentage-point impact of lower commodity costs. These impacts were partially offset by certain operating cost increases and the unfavorable net pricing. \n36 Weeks\nNet revenue increased slightly, primarily reflecting organic volume growth, partially offset by unfavorable net pricing.\nUnit volume grew 4%, primarily reflecting growth in India, Thailand and Australia.\nOperating profit decreased 21%, primarily reflecting certain operating cost increases, the unfavorable net pricing and an impairment charge related to the Be & Cheery brand. These impacts were partially offset by productivity savings, lower advertising and marketing costs and the organic volume growth.\nNon-GAAP Measures\nCertain financial measures contained in this Form 10-Q adjust for the impact of specified items and are not in accordance with GAAP. We use non-GAAP financial measures internally to make operating and strategic decisions, including the preparation of our annual operating plan, evaluation of our overall business performance and as a factor in determining compensation for certain employees. We believe presenting non-GAAP financial measures in this Form 10-Q provides additional information to facilitate comparison of our historical operating results and trends in our underlying operating results and provides additional transparency on how we evaluate our business. We also believe presenting these measures in this Form 10-Q allows investors to view our performance using the same measures that we use in evaluating our financial and business performance and trends. \nWe consider quantitative and qualitative factors in assessing whether to adjust for the impact of items that may be significant or that could affect an understanding of our ongoing financial and business performance or trends. Examples of items for which we may make adjustments include: amounts related to mark-to-market gains or losses (non-cash); charges related to restructuring plans; charges associated with acquisitions and divestitures; gains associated with divestitures; asset impairment charges (non-cash); product recall-related impact; pension and retiree medical-related amounts, including all settlement and curtailment gains and losses; charges or adjustments related to the enactment of new laws, rules or regulations, such as tax law changes; amounts related to the resolution of tax positions; tax benefits related to reorganizations of our operations; debt redemptions, cash tender or exchange offers; and remeasurements of net monetary assets. See below and “Items Affecting Comparability” for a description of adjustments to our GAAP financial measures in this Form 10-Q. \nNon-GAAP information should be considered as supplemental in nature and is not meant to be considered in isolation or as a substitute for the related financial information prepared in accordance with GAAP. In \n43\n \nTable of Contents\n    \naddition, our non-GAAP financial measures may not be the same as or comparable to similar non-GAAP measures presented by other companies.\nThe following non-GAAP financial measures contained in this Form 10-Q are discussed below:\nOrganic revenue performance\nWe define organic revenue performance as a measure that adjusts for the impacts of foreign exchange translation (on a constant currency basis, as defined below), acquisitions and divestitures, and where applicable, the impact of the 53\nrd\n reporting week. Beginning with our first quarter of 2025, on a prospective basis, we are also applying the constant currency calculation for our subsidiaries operating in highly inflationary economies. We believe organic revenue performance provides useful information in evaluating the results of our business because it adjusts for items that we believe are not indicative of ongoing performance or that we believe impact comparability with the prior year. \nSee “Net Revenue and Organic Revenue Performance” in “Results of Operations – Segment Review” for further information.\nCost of sales, gross profit, selling, general and administrative expenses, impairment of intangible assets, other pension and retiree medical benefits income, provision for income taxes, net income attributable to noncontrolling interests and net income attributable to PepsiCo, each adjusted for items affecting comparability, operating profit and net income attributable to PepsiCo per common share – diluted, each adjusted for items affecting comparability and the corresponding constant currency growth rates\nThese measures exclude the net impact of mark-to-market gains and losses on centrally managed commodity derivatives that do not qualify for hedge accounting, restructuring and impairment charges related to our 2019 Productivity Plan, charges associated with our acquisitions and divestitures, impairment and other charges, indirect and income tax impact, product recall-related impact and the impact of settlement and curtailment gains and losses related to pension and retiree medical plans (see “Items Affecting Comparability” for a detailed description of each of these items). We also evaluate performance on operating profit and net income attributable to PepsiCo per common share – diluted, each adjusted for items affecting comparability on a constant currency basis, which measure our financial results assuming constant foreign currency exchange rates used for translation based on the rates in effect for the comparable prior-year period. In order to compute our constant currency results, we multiply or divide, as appropriate, our current-year U.S. dollar results by the current-year average foreign exchange rates and then multiply or divide, as appropriate, those amounts by the prior-year average foreign exchange rates. In addition, beginning with our first quarter of 2025, on a prospective basis, we are also applying the constant currency calculation for our subsidiaries operating in highly inflationary economies. We believe these measures provide useful information in evaluating the results of our business because they exclude items that we believe are not indicative of our ongoing performance or that we believe impact comparability with the prior year. \nFree cash flow\nWe define free cash flow as net cash from operating activities less capital spending, plus sales of property, plant and equipment. Since net capital spending is essential to our product innovation initiatives and maintaining our operational capabilities, we believe that it is a recurring and necessary use of cash. As such, we believe investors should also consider net capital spending when evaluating our cash from operating activities. Free cash flow is used by us primarily for acquisitions and financing activities, including debt repayments, dividends and share repurchases. Free cash flow is not a measure of cash available for discretionary expenditures since we have certain non-discretionary obligations such as debt service that are not deducted from the measure. \nSee “Free Cash Flow” in “Our Liquidity and Capital Resources” for further information.\n44\n \nTable of Contents\n    \nItems Affecting Comparability\nOur reported financial results in this Form 10-Q are impacted by the following items in each of the following periods:\n12 Weeks Ended 9/6/2025\nCost of sales\nGross profit\nSelling, general and administrative expenses\nImpairment of intangible assets\nOperating profit\nOther pension and retiree medical benefits income\nProvision\nfor income taxes\n(a)\nNet income attributable to PepsiCo\nReported, GAAP measure\n$\n11,113\n \n$\n12,824\n \n$\n9,122\n \n$\n133\n \n$\n3,569\n \n$\n26\n \n$\n713\n \n$\n2,603\n \nItems Affecting Comparability\nMark-to-market net impact\n(18)\n18 \n(5)\n— \n23 \n— \n6 \n17 \nRestructuring and impairment charges\n(16)\n16 \n(126)\n— \n142 \n(1)\n25 \n116 \nAcquisition and divestiture-related charges\n(46)\n46 \n(125)\n(50)\n221 \n— \n52 \n169 \nImpairment and other charges\n— \n— \n(17)\n(83)\n100 \n— \n8 \n92 \nIndirect and income tax impact \n(b)\n— \n— \n(82)\n— \n82 \n— \n(47)\n129 \nPension and retiree medical-related impact\n— \n— \n— \n— \n— \n13 \n2 \n11 \nCore, non-GAAP measure\n$\n11,033\n \n$\n12,904\n \n$\n8,767\n \n$\n—\n \n$\n4,137\n \n$\n38\n \n$\n759\n \n$\n3,137\n \n12 Weeks Ended 9/7/2024\nCost of sales\nGross profit\nSelling, general and administrative expenses\nImpairment of intangible assets\nOperating profit\nOther pension and retiree medical benefits income\nProvision for income taxes\n(a)\nNet income attributable to noncontrolling interests\nNet income attributable to PepsiCo\nReported, GAAP measure\n$\n10,396 \n$\n12,923 \n$\n9,027 \n$\n24 \n$\n3,872 \n$\n41 \n$\n749 \n$\n15 \n$\n2,930 \nItems Affecting Comparability\nMark-to-market net impact\n(19)\n19 \n(33)\n— \n52 \n— \n12 \n— \n40 \nRestructuring and impairment charges\n(10)\n10 \n(214)\n(14)\n238 \n7 \n50 \n2 \n193 \nAcquisition and divestiture-related charges\n— \n— \n(5)\n— \n5 \n— \n1 \n— \n4 \nImpairment and other charges\n— \n— \n— \n(10)\n10 \n— \n2 \n— \n8 \nProduct recall-related impact\n1 \n(1)\n— \n— \n(1)\n3 \n— \n— \n2 \nPension and retiree medical-related impact\n— \n— \n— \n— \n— \n15 \n3 \n— \n12 \nCore, non-GAAP measure\n$\n10,368 \n$\n12,951 \n$\n8,775 \n$\n— \n$\n4,176 \n$\n66 \n$\n817 \n$\n17 \n$\n3,189 \n36 Weeks Ended 9/6/2025\nCost of sales\nGross profit\nSelling, general and administrative expenses\nImpairment of intangible assets\nOperating profit\nOther pension and retiree medical benefits\nincome\nProvision\nfor income taxes\n(a)\nNet income attributable to PepsiCo\nReported, GAAP measure\n$\n29,343\n \n$\n35,239\n \n$\n25,305\n \n$\n1,993\n \n$\n7,941\n \n$\n91\n \n$\n1,504\n \n$\n5,700\n \nItems Affecting Comparability\nMark-to-market net impact\n(9)\n9 \n17 \n— \n(8)\n— \n(2)\n(6)\nRestructuring and impairment charges\n(119)\n119 \n(435)\n— \n554 \n13 \n100 \n467 \nAcquisition and divestiture-related charges\n(46)\n46 \n(212)\n(50)\n308 \n— \n72 \n236 \nImpairment and other charges\n— \n— \n(17)\n(1,943)\n1,960 \n— \n421 \n1,539 \nIndirect and income tax impact \n(b)\n— \n— \n(82)\n— \n82 \n— \n(47)\n129 \nPension and retiree medical-related impact\n— \n— \n— \n— \n— \n12 \n2 \n10 \nCore, non-GAAP measure\n$\n29,169\n \n$\n35,413\n \n$\n24,576\n \n$\n—\n \n$\n10,837\n \n$\n116\n \n$\n2,050\n \n$\n8,075\n \n45\n \nTable of Contents\n    \n36 Weeks Ended 9/7/2024\nCost of sales\nGross profit\nSelling, general and administrative expenses\nImpairment of intangible assets\nOperating profit\nOther pension and retiree medical benefits income\nProvision for income taxes\n(a)\nNet income attributable to noncontrolling interests\nNet income attributable to PepsiCo\nReported, GAAP measure\n$\n28,563 \n$\n35,507 \n$\n24,846 \n$\n24 \n$\n10,637 \n$\n155 \n$\n2,045 \n$\n37 \n$\n8,055 \nItems Affecting Comparability\nMark-to-market net impact\n13 \n(13)\n(21)\n— \n8 \n— \n2 \n— \n6 \nRestructuring and impairment charges\n(16)\n16 \n(363)\n(14)\n393 \n22 \n90 \n1 \n324 \nAcquisition and divestiture-related charges\n— \n— \n(7)\n— \n7 \n— \n2 \n— \n5 \nImpairment and other charges\n— \n— \n— \n(10)\n10 \n— \n2 \n— \n8 \nProduct recall-related impact\n(174)\n174 \n(7)\n— \n181 \n3 \n43 \n— \n141 \nPension and retiree medical-related impact\n— \n— \n— \n— \n— \n17 \n3 \n— \n14 \nCore, non-GAAP measure\n$\n28,386 \n$\n35,684 \n$\n24,448 \n$\n— \n$\n11,236 \n$\n197 \n$\n2,187 \n$\n38 \n$\n8,553 \n(a)\nProvision for income taxes is the expected tax charge/benefit on the underlying item based on the tax laws and income tax rates applicable to the underlying item in its corresponding tax jurisdiction.\n(b)\nProvision for income taxes reflects the unfavorable impact of an income tax audit settlement in our LatAm Foods segment.\n \n12 Weeks Ended\n36 Weeks Ended\n9/6/2025\n9/7/2024\nChange\n9/6/2025\n9/7/2024\nChange\nNet income attributable to PepsiCo per common share – diluted, GAAP measure\n$\n1.90\n \n$\n2.13 \n(11)\n%\n$\n4.15\n \n$\n5.84 \n(29)\n%\nMark-to-market net impact\n0.01\n \n0.03 \n—\n \n— \nRestructuring and impairment charges\n0.08\n \n0.14 \n0.34\n \n0.24 \nAcquisition and divestiture-related charges\n0.12\n \n— \n0.17\n \n— \nImpairment and other charges\n0.07\n \n0.01 \n1.12\n \n0.01 \nIndirect and income tax impact\n0.09\n \n— \n0.09\n \n— \nProduct recall-related impact\n—\n \n— \n—\n \n0.10 \nPension and retiree medical-related impact\n0.01\n \n0.01 \n0.01\n \n0.01 \nCore net income attributable to PepsiCo per common share – diluted, non-GAAP measure\n$\n2.29\n \n(a)\n$\n2.31 \n(a)\n(1)\n%\n$\n5.88\n \n$\n6.20 \n(5)\n%\nImpact of foreign exchange translation\n(1)\n2\n \nGrowth in core net income attributable to PepsiCo per common share – diluted, on a constant currency basis, non-GAAP measure\n(2)\n%\n(3.5)\n%\n(a)\n(a)\nDoes not sum due to rounding.\nMark-to-Market Net Impact\nWe centrally manage commodity derivatives on behalf of our segments. These commodity derivatives include agricultural, metals, and energy products. Commodity derivatives that do not qualify for hedge accounting treatment are marked to market each period with the resulting gains and losses recorded in corporate unallocated expenses as either cost of sales or selling, general and administrative expenses, depending on the underlying commodity. These gains and losses are subsequently reflected in segment results when the segments recognize the cost of the underlying commodity in operating profit. Therefore, the segments realize the economic effects of the derivative without experiencing any resulting mark-to-market volatility, which remains in corporate unallocated expenses.\nRestructuring and Impairment Charges\n2019 Multi-Year Productivity Plan\nThe 2019 Productivity Plan \nleverages new technology and business models to further simplify, harmonize and automate processes; re-engineers our go-to-market and information systems, \nincluding deploying the\n \n46\n \nTable of Contents\n    \nright automation for each market; and simplifies our organization and optimizes our manufacturing and supply chain footprint.\n \nTo build on the successful implementation of the 2019 Productivity Plan, in 2024, we further expanded and extended the plan through the end of 2030 to take advantage of additional opportunities within the initiatives described above. As a result, we expect to incur pre-tax charges of approximately $6.15 billion, including cash expenditures of approximately $5.1 billion. Plan-to-date through September 6, 2025, we have incurred pre-tax charges of $3.2 billion, including cash expenditures of $2.4 billion. We expect to incur the majority of the remaining pre-tax charges and cash expenditures through 2027, with the balance to be incurred through 2030. Charges include severance and other employee costs, asset impairments and other costs.\nSee Note 3 to our condensed consolidated financial statements in this Form 10-Q, as well as Note 3 to our consolidated financial statements in our Recast Segment Information, for further information related to our 2019 Productivity Plan. \nWe regularly evaluate productivity initiatives beyond the productivity plan and other initiatives discussed above and in Note 3 to our condensed consolidated financial statements.\nAcquisition and Divestiture-Related Charges\nAcquisition and divestiture-related charges primarily include transaction expenses, such as consulting, advisory and other professional fees, and merger and integration charges, as well as fair value adjustments to the acquired inventory included in the acquisition-date balance sheets. Merger and integration charges include distribution agreement termination fees, impairment of certain acquisition-related intangibles, employee-related costs, closing costs and other integration costs.\nSee Note 12 to our condensed consolidated financial statements for further information.\nImpairment and Other Charges\nWe recognized charges primarily related to the impairments of the Rockstar and Be & Cheery brands. \nSee Notes 1 and 4 to our condensed consolidated financial statements for further information.\nIndirect and Income Tax Impact\nWe recognized additional expenses related to an indirect and income tax audit settlement in our LatAm Foods segment.\nSee Note 1 to our condensed consolidated financial statements for further information.\nProduct Recall-Related Impact\nWe recognized property, plant and equipment write-offs, employee severance costs and other costs in our PFNA segment associated with a previously announced voluntary recall of certain bars and cereals.\nSee Note 1 to our condensed consolidated financial statements for further information.\nPension and Retiree Medical-Related Impact\nPension and retiree medical-related impact includes settlement charges related to lump sum distributions exceeding the total of annual service and interest costs, partially offset by curtailment gains. \nSee Note \n7\n to our condensed consolidated financial statements for further information.\nOur Liquidity and Capital Resources\nWe believe that our cash generating capability and financial condition, together with our revolving credit facilities, working capital lines and other available methods of debt financing, such as commercial paper borrowings and long-term debt financing, will be adequate to meet our operating, investing and financing \n47\n \nTable of Contents\n    \nneeds, including with respect to our net capital spending plans. Our primary sources of liquidity include cash from operations, proceeds obtained from issuances of commercial paper and long-term debt, and cash and cash equivalents. These sources of cash are available to fund cash outflows that have both a short- and long-term component, including debt repayments and related interest payments; payments for acquisitions; operating leases; purchase, marketing, and other contractual commitments, including capital expenditures and the transition tax liability under the TCJ Act. In addition, these sources of cash fund other cash outflows including anticipated dividend payments and share repurchases. We do not have guarantees or off-balance sheet financing arrangements, including variable interest entities, that we believe could have a material impact on our liquidity. See “Our Business Risks” and Note 8 to our condensed consolidated financial statements included in this Form 10-Q, “Item 1A. Risk Factors” in our 2024 Form 10-K and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks” and Note 8 to our consolidated financial statements included in our Recast Segment Information for further information.\nAs of September 6, 2025, cash, cash equivalents and short-term investments in our consolidated subsidiaries outside of Russia that are subject to currency controls or currency exchange restrictions were not material. As of September 6, 2025, Russia accounted for \n15%\n of our consolidated cash and cash equivalents. Our sources and uses of cash were not materially adversely impacted by the cash and cash equivalents held in Russia and, to date, we have not identified any material impact on our liquidity or capital resources as a result of these amounts. See “Our Business Risks” for further information on our operations in Russia.\nThe TCJ Act imposed a one-time mandatory transition tax on undistributed international earnings. As of September 6, 2025, our mandatory transition tax liability was $1.0 billion, which must be paid through 2026 under the provisions of the TCJ Act. See “Our Liquidity and Capital Resources” and Note 5 to our consolidated financial statements included in our Recast Segment Information for further discussion of the TCJ Act. \nSupply chain financing arrangements did not have a material impact on our liquidity or capital resources in the periods presented and we do not expect such arrangements to have a material impact on our liquidity or capital resources for the foreseeable future. See Note \n13\n to our condensed consolidated financial statements for further discussion of supply chain financing arrangements.\nOperating Activities\nDuring the 36 weeks ended September 6, 2025, net cash provided by operating activities was $5.5 billion, compared to net cash provided by operating activities of $6.2 billion in the prior-year period. The de\ncrease \nin operating cash flow primarily reflects unfavorable operating profit performance.\nInvesting Activities\nDuring the 36 weeks ended September 6, 2025\n, net cash used for investing activities was \n$5.2 billion\n, primarily reflecting net cash paid in connection with our acquisitions of poppi of $1.9 billion and Siete of $1.2 billion, as well as net capital spending of \n$2.2 billion.\nWe regularly review our plans with respect to ne\nt capital spending and believe that we have sufficient liquidity to meet our net capital spending needs.\nFinancing Activities\nDuring the 36 weeks ended September 6, 2025, net cash used for financing activities was $1.0 billion, primarily reflecting the return of operating cash flow to our shareholders through dividend payments and share repurchases of $6.4 billion and payments of long-term debt borrowings of $3.2 billion, partially offset by proceeds from the issuances of long-term debt of $8.2 billion.\n48\n \nTable of Contents\n    \nWe annually review our capital structure with our Board of Directors, including our dividend policy and share repurchase activity. On February 10, 2022, we announced a share repurchase program providing for the repurchase of up to $10.0 billion of PepsiCo common stock which commenced on February 11, 2022 and will expire on February 28, 2026. In addition, on February 4, 2025, we announced a 5% increase in our annualized dividend to $5.69 per share from $5.42 per share, effective with the dividend paid in June 2025. We expect to return a total of approximately $8.6 billion to shareholders in 2025, comprising dividends of approximately $7.6 billion and share repurchases of approximately $1.0 billion.\nFree Cash Flow \nThe table below reconciles net cash provided by operating activities, as reflected on our cash flow statement, to our free cash flow. Free cash flow is a non-GAAP financial measure. For further information on free cash flow, see “Non-GAAP Measures.”\n \n36 Weeks Ended\n \n9/6/2025\n9/7/2024\nNet cash provided by operating activities, GAAP measure\n$\n5,468\n \n$\n6,220 \nCapital spending\n(2,499)\n(2,850)\nSales of property, plant and equipment\n272\n \n177 \nFree cash flow, non-GAAP measure\n$\n3,241\n \n$\n3,547 \nWe use free cash flow primarily for acquisitions and financing activities, including debt repayments, dividends and share repurchases. We expect to continue to return free cash flow to our shareholders primarily through dividends while maintaining Tier 1 commercial paper access, which we believe will facilitate appropriate financial flexibility and ready access to global capital and credit markets at favorable interest rates. See “Our Business Risks” included in this Form 10-Q, “Item 1A. Risk Factors” in our 2024 Form 10-K and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks,” included in our Recast Segment Information, for certain factors that may impact our credit ratings or our operating cash flows.\nAny downgrade of our credit ratings by a credit rating agency, especially any downgrade to below investment grade, whether or not as a result of our actions or factors which are beyond our control, could increase our future borrowing costs and impair our ability to access capital and credit markets on terms commercially acceptable to us, or at all. In addition, any downgrade of our current short-term credit ratings could impair our ability to access the commercial paper market with the same flexibility that we have experienced historically, and therefore require us to rely more heavily on more expensive types of debt financing. See Note\n \n8 to our condensed consolidated financial statements and “Our Business Risks” included in this Form 10-Q, as well as “Item 1A. Risk Factors” in our 2024 Form 10-K and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks” included in our Recast Segment Information for further information.\nChanges in Line Items in Our Condensed Consolidated Financial Statements\nChanges in line items in the income statement are discussed in “Results of Operations – Consolidated Review,” “Results of Operations – Segment Review” and “Items Affecting Comparability.”\nChanges in line items in the cash flow statement are discussed in “Our Liquidity and Capital Resources.”\n49\n \nTable of Contents\n    \nChanges in line items in the balance sheet are discussed below:\nTotal Assets\nTotal assets were $106.6 billion as of September 6, 2025, compared to $99.5 billion as of December 28, 2024. Assets were impacted primarily by the following line items:\nChange \n(a) \nAccounts and notes receivable, less allowance \n(b)\n$\n2.3 \nProperty, Plant and Equipment, net \n(c)\n$\n1.0 \nGoodwill \n(d)\n$\n1.3 \nOther Assets \n(e)\n$\n1.7 \nTotal Liabilities\nAs of September 6, 2025, total liabilities were $87.0 billion, compared to $81.3 billion as of December 28, 2024. Liabilities were impacted primarily by the following line items:\nChange \n(a) \nLong-term debt obligations \n(f)\n$\n6.9 \nOther liabilities \n(g)\n$\n(1.1)\n(a)\nIncrease/(decrease) in billions.\n(b)\nPrimarily reflects improved operating performance coupled with appreciation of certain currencies.\n(c)\nPrimarily reflects the appreciation of the Russian ruble, Mexican peso and the euro.\n(d)\nSee Notes 4 and 12 to our condensed consolidated financial statements for further information.\n(e)\nSee Note 9 to our condensed consolidated financial statements for further information.\n(f)\nSee Note 8 to our condensed consolidated financial statements for further information.\n(g)\nPrimarily reflects a reclass of the transition tax liability to current.\nTotal Equity\nSee the equity statement and Notes 9 and 11 to our condensed consolidated financial statements.\n50\n \nTable of Contents\n    \nReport of Independent Registered Public Accounting Firm\nTo the Shareholders and Board of Directors \nPepsiCo, Inc.:\nResults of Review of Interim Financial Information \nWe have reviewed the Condensed Consolidated Balance Sheet of PepsiCo, Inc. and subsidiaries (the Company) as of September 6, 2025, the related Condensed Consolidated Statements of Income, Comprehensive Income, and Equity for the twelve and thirty-six weeks ended September 6, 2025 and September 7, 2024, the related Condensed Consolidated Statement of Cash Flows for the thirty-six weeks ended September 6, 2025 and September 7, 2024, and the related notes (collectively, the consolidated interim financial information). Based on our reviews, we are not aware of any material modifications that should be made to the consolidated interim financial information for it to be in conformity with U.S. generally accepted accounting principles.\nWe have previously audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States) (PCAOB), the Consolidated Balance Sheet of the Company as of December 28, 2024, and the related Consolidated Statements of Income, Comprehensive Income, Cash Flows and Equity for the fiscal year then ended (not presented herein); and in our report dated February 3, 2025, except for the change in the composition of reportable segments and the related impacts discussed in Notes 1, 3, 4, 9, and 13, as to which the date is July 16, 2025, we expressed an unqualified opinion on those consolidated financial statements. In our opinion, the information set forth in the accompanying Condensed Consolidated Balance Sheet as of December 28, 2024 is fairly stated, in all material respects, in relation to the Consolidated Balance Sheet from which it has been derived.\nBasis for Review Results\nThis consolidated interim financial information is the responsibility of the Company’s management. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.\nWe conducted our reviews in accordance with the standards of the PCAOB. A review of consolidated interim financial information consists principally of applying analytical procedures and making inquiries of persons responsible for financial and accounting matters. It is substantially less in scope than an audit conducted in accordance with the standards of the PCAOB, the objective of which is the expression of an opinion regarding the financial statements taken as a whole. Accordingly, we do not express such an opinion.\n/s/ KPMG LLP\nNew York, New York\nOctober 8, 2025\n51\n \nTable of Contents"
}