{
  "source_file": "pfg-20250930x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following analysis discusses our financial condition as of September 30, 2025, compared with December 31, 2024, and our consolidated results of operations for the three and nine months ended September 30, 2025 and 2024, prepared in conformity with U.S. GAAP. The discussion and analysis includes, where appropriate, factors that may affect our future financial performance. The discussion should be read in conjunction with our Form 10-K, for the year ended December 31, 2024, filed with the SEC and the unaudited condensed consolidated financial statements and the related notes to the financial statements and the other financial information included elsewhere in this Form 10-Q.\nForward-Looking Information\nOur narrative analysis below contains forward-looking statements intended to enhance the reader’s ability to assess our future financial performance. Forward-looking statements include, but are not limited to, statements that represent our beliefs concerning future operations, strategies, financial results or other developments, and contain words and phrases such as “anticipate,” “believe,” “plan,” “estimate,” “expect,” “intend” and similar expressions. Forward-looking statements are made based upon management’s current expectations and beliefs concerning future developments and their potential effects on us. Such forward-looking statements are not guarantees of future performance.\n126\n\n\nTable of Contents\nActual results may differ materially from those included in the forward-looking statements as a result of risks and uncertainties including, but not limited to, the following: (1) adverse capital and credit market conditions may significantly affect our ability to meet liquidity needs, as well as our access to capital and cost of capital; (2) conditions in the global capital markets, including the equity, bond or real estate markets, and the economy generally may materially and adversely affect our business and results of operations; (3) changes in interest rates or credit spreads or a prolonged low interest rate environment may adversely affect our results of operations, financial condition and liquidity, and our net income can vary from period to period; (4) our investment portfolio is subject to several risks that may diminish the value of our invested assets and the investment returns credited to customers, which could reduce our sales, revenues, AUM and net income; (5) our valuation of investments and the determinations of the amount of allowances and impairments taken on our investments may include methodologies, estimations and assumptions that are subject to differing interpretations and, if changed, could materially adversely affect our results of operations or financial condition; (6) any impairments of or valuation allowances against our deferred tax assets could adversely affect our results of operations and financial condition; (7) we may face losses on our insurance and annuity products if our actual experience differs significantly from our pricing and reserving assumptions; (8) the pattern of amortizing our DAC asset and other actuarial balances may change, impacting both the level of our DAC asset and other actuarial balances and the timing of our net income; (9) changes in laws or regulations may reduce our profitability or impact how we do business; (10) our ability to pay stockholder dividends, make share repurchases and meet our obligations may be constrained by the limitations on dividends or other distributions Iowa insurance laws impose on Principal Life; (11) changes in accounting standards may adversely affect our reported results of operations and financial condition; (12) litigation and regulatory investigations may affect our financial strength or reduce our profitability; (13) from time to time, we may become subject to tax audits, tax litigation or similar proceedings, and as a result we may owe additional taxes, interest and penalties in amounts that may be material; (14) applicable laws and our certificate of incorporation and by-laws may discourage takeovers and business combinations that some stockholders might consider in their best interests; (15) competition, including from companies that may have greater financial resources, broader arrays of products, higher ratings and stronger financial performance, may impair our ability to retain existing customers, attract new customers and maintain our profitability; (16) a downgrade in our financial strength or credit ratings may increase policy surrenders and withdrawals, reduce new sales, terminate relationships with distributors, impact existing liabilities and increase our cost of capital, any of which could adversely affect our profitability and financial condition; (17) client terminations or withdrawals or changes in investor preferences may lead to a reduction in revenues for our asset management and accumulation businesses; (18) guarantees within certain of our products that protect policyholders may decrease our net income or increase the volatility of our results of operations or financial position under U.S. GAAP if our hedging or risk management strategies prove ineffective or insufficient; (19) our international businesses face political, legal, operational and other risks that could reduce our profitability in those businesses; (20) we face risks arising from fraudulent activities; (21) we face risks arising from our participation in joint ventures; (22) we may need to fund deficiencies in our Closed Block assets; (23) our reinsurers could default on their obligations or increase their rates, which could adversely impact our net income and financial condition; (24) we face risks arising from future acquisitions of businesses; (25) we face risks in administering coinsurance with funds withheld reinsurance agreements; (26) a pandemic, terrorist attack, military action or other catastrophic event could adversely affect our operations, net income or financial condition; (27) our financial results may be adversely impacted by global climate changes; (28) technological and societal changes may disrupt our business model and impair our ability to retain existing customers, attract new customers and maintain our profitability; (29) damage to our reputation may adversely affect our revenues and profitability; (30) we may not be able to protect our intellectual property and may be subject to infringement claims; (31) if we are unable to attract, develop and retain qualified employees and sales representatives and develop new distribution sources, our results of operations, financial condition, strategic growth commitments and sales of our products may be adversely impacted; (32) interruptions in information technology, infrastructure or other internal or external systems used for our business operations, or a failure to maintain the confidentiality, integrity or availability of data residing on such systems, could disrupt our business, damage our reputation and adversely impact our profitability; (33) loss of or disruption in key vendor relationships and services or failure of a vendor to protect information of our customers or employees could adversely affect our business or result in losses and (34) our enterprise risk management framework may not be fully effective in identifying or mitigating all the risks to which we are exposed.\n​\n127\n\n\nTable of Contents\nOverview\nWe provide financial products and services through the following reportable segments:\n●\nRetirement and Income Solutions provides retirement and related financial products and services primarily to businesses, their employees, and other individuals. This segment includes workplace savings and retirement solutions, banking, trust and custodial services, individual variable annuities, pension risk transfer, investment only and our exited retail fixed annuities business. We offer a comprehensive portfolio of products and services for retirement savings and retirement income:\n●\nTo businesses of all sizes, we offer products and services for defined contribution plans, including 401(k) and 403(b) plans, defined benefit pension plans, nonqualified executive benefit plans, employee stock ownership plan services and pension closeout services. For more basic retirement services, we offer SIMPLE IRAs and payroll deduction plans;\n●\nTo large institutional clients, we also offer investment only products, including investment only GICs;\n●\nTo employees of businesses and other individuals, we offer the ability to accumulate savings for retirement and other purposes through mutual funds, individual variable annuities, RILAs and bank products, along with retirement income options; and\n●\nIn addition, we offer trust and custody services.\n●\nPrincipal Asset Management provides global investment solutions to institutional, retirement, retail and high net worth investors in the U.S. and select emerging markets. The segment is organized into Investment Management, which provides public, multi-asset and private market capabilities across all asset classes, including equity, fixed income, real estate and alternatives, to service a breadth of client investment objectives; and International Pension, which provides long-term savings and retirement solutions through pension accumulation and income annuities in Asia and Latin America.\n●\nBenefits and Protection is organized into Specialty Benefits, which provides group dental, group life insurance, group disability insurance (including short-term disability, long-term disability and paid family and medical leave), supplemental health products (including vision, critical illness, accident and hospital indemnity) and individual disability insurance; and Life Insurance, which provides life insurance focused on the business market customer, including universal life and variable universal life (including indexed universal life) and traditional life insurance (including term life insurance). All remaining customers are part of the legacy life block of business, including universal and variable universal life insurance (including indexed universal life), traditional life insurance (including participating whole life, adjustable life products and term life insurance) and our exited ULSG business.\n●\nCorporate, which manages the assets representing capital that has not been allocated to any other segment. Financial results of the Corporate segment primarily reflect our financing activities (including financing costs), income on capital not allocated to other segments, inter-segment eliminations, income tax risks and certain income, expenses and other adjustments not allocated to the segments based on the nature of such items. Results of PSI, our retail broker-dealer and RIA, and our exited group medical and long-term care insurance businesses are reported in this segment.\nTransaction Affecting Comparability of Results of Operations\nPrincipal Mandatory Provident Funds\nOn January 16, 2025, we announced the signing of an agreement with BCT to expand our investment management capabilities and exit our sponsor and trustee (pension) roles in Hong Kong for MPF Schemes. BCT will be assuming the role as sponsor and trustee for the Principal MPF Schemes. The transaction is expected to close in 2026, subject to regulatory approval; however, certain transaction impacts were recognized in first quarter 2025. We impaired our distribution agreement intangible asset and contract cost asset, resulting in a $65.4 million loss reported in operating expenses on our consolidated statements of operations. Additionally, we classified our customer relationship intangible asset as held-for-sale, resulting in a $77.0 million loss reported in net realized capital gains (losses) on our consolidated statements of operations. For segment reporting, the impairments are reflected in loss from exited business and the held-for-sale write-down is reflected in net realized capital losses. As such, they had no impact on our Principal Asset Management segment pre-tax operating earnings.\n128\n\n\nTable of Contents\nYearly Renewable Term Reinsurance Transactions\nDuring 2024, we terminated, executed and amended certain YRT reinsurance agreements with unaffiliated reinsurance companies for insurance risks associated with universal life insurance in the Benefits and Protection segment, primarily related to ULSG (“YRT Reinsurance Transactions”).\nOther\nActuarial Assumption Updates.\n We periodically review and update actuarial assumptions that are inputs to the models for the liability for future policy benefits for traditional limited-payment long-duration contracts and other actuarial balances. Assumption updates, model refinements and other updates made during the third quarter resulted in a change in cash flow assumptions that decreased consolidated net income attributable to Principal Financial Group, Inc. by $59.3 million and $85.7 million for the three and nine months ended September 30, 2025 and 2024, respectively.\nThe following table presents the increase (decrease) to pre-tax operating earnings for each segment.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three and nine months ended\n​\n​\nSeptember 30,\n​\n    \n2025\n    \n2024\n​\n \n(in millions)\nRetirement and Income Solutions\n​\n$\n 12.0\n​\n$\n (16.7)\nPrincipal Asset Management\n​\n \n —\n​\n \n 21.1\nBenefits and Protection\n​\n \n (79.1)\n​\n \n (86.4)\n​\nOther Factors Affecting Comparability of Results of Operations\nFluctuations in Foreign Currency to U.S. Dollar Exchange Rates\nFluctuations in foreign currency to U.S. dollar exchange rates for locations in which we have operations can affect reported financial results. In years when foreign currencies weaken against the U.S. dollar, translating foreign currencies into U.S. dollars results in fewer U.S. dollars to be reported. When foreign currencies strengthen, translating foreign currencies into U.S. dollars results in more U.S. dollars to be reported.\nForeign currency exchange rate fluctuations create variances in our financial statement line items. The most significant impact occurs within our Principal Asset Management segment where pre-tax operating earnings were positively impacted $0.1 million for the three months ended September 30, 2025 and negatively impacted $8.8 million for the nine months ended September 30, 2025, as a result of fluctuations in foreign currency to U.S. dollar exchange rates. This impact was calculated by comparing (a) the difference between current year results and prior year results to (b) the difference between current year results and prior year results translated using current year exchange rates for both periods. We use this approach to calculate the impact of exchange rates on all revenue and expense line items. For a discussion of our approaches to managing foreign currency exchange rate risk, see Item 3. “Quantitative and Qualitative Disclosures About Market Risk — Foreign Currency Risk.”\nVariable Investment Income\nVariable investment income includes certain types of investment returns such as prepayment fees and income (loss) from certain elements of our other alternative asset classes, including results of value-add real estate sales activity. Due to its unpredictable nature, variable investment income may or may not be material to our financial results for a given reporting period and may create variances when comparing different reporting periods. For additional information, see “Investment Results.”\nRecent Accounting Changes\nFor recent accounting changes, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 1, Nature of Operations and Significant Accounting Policies” under the caption “Recent Accounting Pronouncements.”\n​\n129\n\n\nTable of Contents\nResults of Operations\nThe following table presents summary consolidated financial information for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nRevenues:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nPremiums and other considerations\n​\n$\n 1,532.8\n​\n$\n 1,412.9\n​\n$\n 119.9\n​\n$\n 4,680.6\n​\n$\n 5,024.1\n​\n$\n (343.5)\nFees and other revenues\n​\n \n 1,128.7\n​\n \n 1,091.1\n​\n \n 37.6\n​\n \n 3,289.0\n​\n \n 3,205.4\n​\n \n 83.6\nNet investment income\n​\n \n 1,200.5\n​\n \n 1,167.6\n​\n \n 32.9\n​\n \n 3,529.0\n​\n \n 3,325.9\n​\n \n 203.1\nNet realized capital gains (losses)\n​\n \n 85.7\n​\n​\n 77.4\n​\n​\n 8.3\n​\n​\n (26.0)\n​\n​\n 61.3\n​\n​\n (87.3)\nNet realized capital gains (losses) on funds withheld assets\n​\n​\n (0.2)\n​\n​\n 39.4\n​\n​\n (39.6)\n​\n​\n 31.5\n​\n​\n 105.9\n​\n​\n (74.4)\nChange in fair value of funds withheld embedded derivative\n​\n​\n (265.9)\n​\n​\n (776.8)\n​\n​\n 510.9\n​\n​\n (455.3)\n​\n​\n (346.9)\n​\n​\n (108.4)\nTotal revenues\n​\n \n 3,681.6\n​\n​\n 3,011.6\n​\n​\n 670.0\n​\n​\n 11,048.8\n​\n​\n 11,375.7\n​\n​\n (326.9)\nExpenses:\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\nBenefits, claims and settlement expenses\n​\n \n 1,964.1\n​\n​\n 1,778.1\n​\n​\n 186.0\n​\n​\n 6,024.0\n​\n​\n 5,925.7\n​\n​\n 98.3\nLiability for future policy benefits remeasurement loss\n​\n​\n 60.9\n​\n​\n 122.5\n​\n​\n (61.6)\n​\n​\n 58.8\n​\n​\n 565.6\n​\n​\n (506.8)\nMarket risk benefit remeasurement loss\n​\n​\n 4.0\n​\n​\n 54.0\n​\n​\n (50.0)\n​\n​\n 53.0\n​\n​\n 39.1\n​\n​\n 13.9\nDividends to policyholders\n​\n \n 30.0\n​\n \n 14.9\n​\n \n 15.1\n​\n \n 72.0\n​\n \n 68.1\n​\n \n 3.9\nOperating expenses\n​\n \n 1,374.2\n​\n \n 1,335.9\n​\n \n 38.3\n​\n \n 4,060.6\n​\n \n 4,000.0\n​\n \n 60.6\nTotal expenses\n​\n \n 3,433.2\n​\n \n 3,305.4\n​\n \n 127.8\n​\n \n 10,268.4\n​\n \n 10,598.5\n​\n \n (330.1)\nIncome (loss) before income taxes\n​\n \n 248.4\n​\n \n (293.8)\n​\n \n 542.2\n​\n \n 780.4\n​\n \n 777.2\n​\n \n 3.2\nIncome taxes (benefits)\n​\n \n 14.5\n​\n \n (100.4)\n​\n \n 114.9\n​\n \n 50.1\n​\n \n 81.8\n​\n \n (31.7)\nNet income (loss)\n​\n \n 233.9\n​\n \n (193.4)\n​\n \n 427.3\n​\n \n 730.3\n​\n \n 695.4\n​\n \n 34.9\nNet income attributable to noncontrolling interest\n​\n \n 20.1\n​\n​\n 26.6\n​\n​\n (6.5)\n​\n​\n 62.2\n​\n​\n 29.8\n​\n​\n 32.4\nNet income (loss) attributable to Principal Financial Group, Inc.\n​\n$\n 213.8\n​\n$\n (220.0)\n​\n$\n 433.8\n​\n$\n 668.1\n​\n$\n 665.6\n​\n$\n 2.5\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nNet Income Attributable to Principal Financial Group, Inc.\nNet income (loss) attributable to Principal Financial Group, Inc. increased primarily due to the change in the fair value of the funds withheld embedded derivative.\nTotal Revenues\nPremiums and other considerations increased $94.8 million for the Retirement and Income Solutions segment primarily due to higher sales of single premium group annuities with life contingencies. Premiums and other considerations increased $29.4 million for the Benefits and Protection segment primarily due to growth in our Specialty Benefits business.\nFees and other revenues increased $5.5 million for the Retirement and Income Solutions segment primarily due to an increase in fee revenue stemming from an increase in average monthly account values, which largely resulted from more favorable financial markets. Fees and other revenues increased for the Principal Asset Management segment primarily due to $19.4 million higher management fee revenue as a result of increased average AUM managed by our Investment Management operations. Fees and other revenues increased for the Corporate segment primarily due to a $4.2 million increase in our broker-dealer operations.\nFor net investment income and net realized capital gains (losses) variance information, see “Investments — Investment Results” under the captions “Net Investment Income” and “Net Realized Capital Gains (Losses),” respectively.\n130\n\n\nTable of Contents\nNet realized capital gains on funds withheld assets decreased due to $19.1 million lower gains on sales of funds withheld assets as a result of reduced sales in 2025 by an external reinsurer and a $16.2 million change due to net unrealized losses on funds withheld assets in 2025 as compared to net unrealized gains in 2024.\nThe change in fair value of the funds withheld embedded derivative resulted in a lower loss in 2025 than 2024 due primarily to changes in interest rates and credit spreads.\nTotal Expenses\nBenefits, claims and settlement expenses increased $163.7 million in the Retirement and Income Solutions segment primarily due to an increase in reserves, largely stemming from higher sales of single premium group annuities with life contingencies.\nThe liability for future policy benefits remeasurement (gain) loss change was primarily due to the less unfavorable effect of changes in cash flow assumptions related to actuarial assumption updates and model refinements in 2025 compared to 2024.\nThe market risk benefit remeasurement (gain) loss change was primarily due to the $82.5 million favorable impact from the change in fair value of the MRB asset (liability), excluding impacts of nonperformance risk, primarily driven by changes in market movements. This change was offset by a $32.5 million unfavorable impact from periodic and final settlements for derivatives used to hedge MRBs. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 10, Market Risk Benefits” for further information on market effects.\nOperating expenses increased primarily due to a $17.0 million increase in nondeferrable commission expense, an $8.7 million increase in compensation costs and an $8.0 million increase in amounts credited to employee accounts in a nonqualified defined contribution pension plan.\nIncome Taxes\nThe effective income tax rate decreased to 6% for the three months ended September 30, 2025, from 34% for the three months ended September 30, 2024, primarily due to an increase in pre-tax income with no proportional changes in permanent tax differences. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 13, Income Taxes” for a reconciliation between the U.S. corporate income tax rate and the effective income tax rate.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNet Income Attributable to Principal Financial Group, Inc.\nNet income attributable to Principal Financial Group, Inc. increased $158.1 million due to the unfavorable one-time impact of the YRT Reinsurance Transactions in 2024, $32.4 million due to a one-time expense accrual release in 2025 and $26.4 million due to less unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024. These increases were partially offset by $119.7 million due to the impact from asset write-downs related to exiting our sponsor and trustee (pension) roles in Hong Kong for MPF Schemes and $85.7 million due to the change in the fair value of the funds withheld embedded derivative.\nTotal Revenues\nPremiums and other considerations decreased $412.8 million for the Retirement and Income Solutions segment primarily due to lower sales of single premium group annuities with life contingencies. Premiums and other considerations increased $81.3 million for the Benefits and Protection segment primarily due to growth in our Specialty Benefits business.\nFees and other revenues increased $56.8 million for the Principal Asset Management segment primarily due to higher management fee revenue as a result of increased average AUM managed by our Investment Management operations. Fees and other revenues increased $16.4 million for the Benefits and Protection segment primarily due to growth in our Life Insurance business.\nFor net investment income and net realized capital gains (losses) variance information, see “Investments — Investment Results” under the captions “Net Investment Income” and “Net Realized Capital Gains (Losses),” respectively.\n131\n\n\nTable of Contents\nNet realized capital gains on funds withheld assets decreased primarily due to lower net gains on sales of funds withheld assets as a result of reduced sales in 2025 by an external reinsurer.\nThe change in fair value of the funds withheld embedded derivative resulted in a larger loss in 2025 compared to 2024 due to changes in interest rates and credit spreads.\nTotal Expenses\nBenefits, claims and settlement expenses decreased $213.5 million for the Retirement and Income Solutions segment primarily due to a decrease in reserves, stemming from lower sales of single premium group annuities with life contingencies. Benefits, claims and settlement expenses decreased for the Principal Asset Management segment due to $26.0 million from the closure of our Hong Kong guaranteed constituent funds in the prior year, $11.5 million due to lower new sales of Chile annuities and $9.8 million due to lower interest credited to customers. Benefits, claims and settlement expenses increased $347.2 million for the Benefits and Protection segment primarily due to the one-time impact of the YRT Reinsurance Transactions in 2024.\nThe liability for future policy benefits remeasurement (gain) loss change was primarily due to the favorable effect of $442.1 million of prior year changes in cost of reinsurance cash flow assumptions driven by the one-time impact of the YRT Reinsurance Transactions and a $45.4 million impact driven by actuarial assumption updates and model refinements.\nThe market risk benefit remeasurement (gain) loss change was primarily due to the $78.0 million unfavorable impact from the change in fair value of the MRB asset (liability), excluding impacts of nonperformance risk, primarily driven by changes in market movements. This change was partially offset by a $64.1 million favorable impact from periodic and final settlements for derivatives used to hedge MRBs. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 10, Market Risk Benefits” for further information on market effects.\nOperating expenses increased primarily due to a $79.3 million increase in compensation costs, $65.4 million of impairments of our distribution agreement intangible asset and contract cost asset in Hong Kong and a $49.8 million increase in nondeferrable commission expense. The increases were partially offset by a $67.3 million decrease in amounts credited to employee accounts in a nonqualified defined contribution pension plan, a $41.0 million decrease resulting from a one-time expense accrual release in 2025 and a $19.3 million decrease in management fees.\nIncome Taxes\nThe effective income tax rate decreased to 6% for the nine months ended September 30, 2025 from 11% for the nine months ended September 30, 2024, primarily due to a 2% impact from our foreign valuation allowance, a 2% impact from foreign tax credits and a 1% impact from releasing unrecognized tax benefits. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 13, Income Taxes” for a reconciliation between the U.S. corporate income tax rate and the effective income tax rate.\nResults of Operations by Segment\nFor results of operations by segment see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 18, Segment Information.”\nRetirement and Income Solutions Segment\nRetirement and Income Solutions Segment Summary Financial Data\nNet revenue and average monthly account values are key metrics used to understand Retirement and Income Solutions earnings growth. Net revenue, which is used only at the segment level, is defined as operating revenues less benefits, claims and settlement expenses; liability for future policy benefits remeasurement (gain) loss; market risk benefit remeasurement (gain) loss and dividends to policyholders. Net revenue is impacted by: (1) changes in the equity markets and interest rates and (2) the difference between investment income earned on the underlying general account assets and the interest rate credited to the contracts. Average monthly account values include the net balances that customers have accumulated within their account, along with future policy benefits for retirement payout products. Average monthly account values are primarily impacted by net customer cash flows and credit market performance.\n132\n\n\nTable of Contents\nThe following table presents the Retirement and Income Solutions segment net revenue and average monthly account values for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended \n​\nFor the nine months ended \n​\n​\n September 30, \n​\n September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\nNet revenue (in millions)\n​\n$\n 751.7\n​\n$\n 679.4\n​\n$\n 72.3\n​\n$\n 2,189.8\n​\n$\n 2,071.7\n​\n$\n 118.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAverage monthly account values (in billions)\n​\n$\n 609.0\n​\n$\n 559.2\n​\n$\n 49.8\n​\n$\n 584.5\n​\n$\n 539.1\n​\n$\n 45.4\n​\nThe following table presents certain summary financial data relating to the Retirement and Income Solutions segment for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended \n​\nFor the nine months ended \n​\n​\n September 30, \n​\n September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nOperating revenues:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nPremiums and other considerations\n​\n$\n 566.5\n​\n$\n 471.7\n​\n$\n 94.8\n​\n$\n 1,824.0\n​\n$\n 2,236.8\n​\n$\n (412.8)\nFees and other revenues\n​\n \n 459.3\n​\n \n 453.2\n​\n \n 6.1\n​\n \n 1,334.7\n​\n \n 1,332.0\n​\n \n 2.7\nNet investment income\n​\n \n 860.4\n​\n \n 761.5\n​\n \n 98.9\n​\n \n 2,521.0\n​\n \n 2,244.3\n​\n \n 276.7\nTotal operating revenues\n​\n \n 1,886.2\n​\n \n 1,686.4\n​\n \n 199.8\n​\n \n 5,679.7\n​\n \n 5,813.1\n​\n \n (133.4)\nExpenses:\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\n​\n \n​\nBenefits, claims and settlement expenses, including dividends to policyholders\n​\n \n 1,144.1\n​\n​\n 984.6\n​\n​\n 159.5\n​\n​\n 3,504.2\n​\n​\n 3,718.8\n​\n​\n (214.6)\nLiability for future policy benefits remeasurement gain\n​\n​\n (10.5)\n​\n​\n (2.4)\n​\n​\n (8.1)\n​\n​\n (18.9)\n​\n​\n (5.2)\n​\n​\n (13.7)\nMarket risk benefit remeasurement loss\n​\n​\n 0.9\n​\n​\n 24.8\n​\n​\n (23.9)\n​\n​\n 4.6\n​\n​\n 27.8\n​\n​\n (23.2)\nOperating expenses\n​\n \n 441.3\n​\n \n 433.3\n​\n \n 8.0\n​\n \n 1,303.0\n​\n \n 1,295.6\n​\n \n 7.4\nTotal expenses\n​\n​\n 1,575.8\n​\n​\n 1,440.3\n​\n​\n 135.5\n​\n \n 4,792.9\n​\n \n 5,037.0\n​\n \n (244.1)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPre-tax operating earnings attributable to noncontrolling interest\n​\n​\n 0.1\n​\n​\n—\n​\n​\n 0.1\n​\n​\n 0.7\n​\n​\n—\n​\n​\n 0.7\nPre-tax operating earnings\n​\n$\n 310.3\n​\n$\n 246.1\n​\n$\n 64.2\n​\n$\n 886.1\n​\n$\n 776.1\n​\n$\n 110.0\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nPre-Tax Operating Earnings\nPre-tax operating earnings increased due to an increase in our net revenue, which was slightly offset by an increase in operating expenses as described below.\nNet Revenue\nNet revenue increased primarily due to a $28.7 million impact associated with actuarial assumption updates and model refinements, which were favorable in 2025 compared to unfavorable in 2024, a $24.2 million impact due to growth in the business and a $6.1 million increase in fee revenue primarily due to an increase in average monthly account values, which largely resulted from more favorable financial markets.\nOperating Expenses\nOperating expenses increased primarily due to a $10.6 million increase in staff-related costs.\n133\n\n\nTable of Contents\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nPre-Tax Operating Earnings\nPre-tax operating earnings increased due to an increase in our net revenue, which was slightly offset by an increase in operating expenses as described below. \nNet Revenue\nNet revenue increased primarily due to a $68.4 million impact due to growth in the business and a $28.7 million impact associated with actuarial assumption updates and model refinements, which were favorable in 2025 compared to unfavorable in 2024.\nOperating Expenses\nOperating expenses increased primarily due to a $27.7 million increase in staff-related costs, partially offset by a $19.4 million impact from a one-time expense accrual release in 2025.\nPrincipal Asset Management Segment\nAUM\nAUM forms the basis for generating our management fee revenues. However, in Chile, the Cuprum business operates differently, as most fees are collected with each deposit made by mandatory retirement customers, based on a capped salary level rather than asset levels. AUM growth is primarily driven by two factors: market performance and net cash flow. Market performance encompasses the returns from equity, fixed income, real estate and other alternative investments, while net cash flow reflects client deposits and withdrawals. Revenue growth increasingly depends on the fee levels associated with these deposits and withdrawals, which can vary significantly depending on the business or product mix. Additionally, our non-U.S. results are influenced by fluctuations in foreign currency exchange rates relative to the U.S. dollar. The AUM of our foreign subsidiaries is converted to U.S. dollars at the end of the reporting period using spot exchange rates, while revenue and expenses are translated using average exchange rates for the reporting period.\n​\nThe following table presents the AUM rollforward for assets managed by the Principal Asset Management segment for the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n​\n​\n(in billions)\nAUM, beginning of period\n​\n$\n 723.0\n​\n$\n 670.6\n​\n$\n 683.4\n​\n$\n 668.3\nNet cash flow\n​\n \n—\n​\n​\n (0.9)\n​\n​\n (7.4)\n​\n​\n (4.4)\nMarket performance\n​\n \n 27.0\n​\n​\n 36.9\n​\n​\n 59.4\n​\n​\n 59.9\nOther (1)\n​\n​\n 1.6\n​\n​\n (1.1)\n​\n​\n 1.6\n​\n​\n (1.9)\nOperations disposed (2)\n​\n​\n (0.8)\n​\n​\n—\n​\n​\n (2.5)\n​\n​\n—\nEffect of exchange rates\n​\n​\n 1.5\n​\n​\n 5.6\n​\n​\n 17.8\n​\n​\n (10.8)\nAUM, end of period\n​\n$\n 752.3\n​\n$\n 711.1\n​\n$\n 752.3\n​\n$\n 711.1\n(1)\nIncludes a $(1.3) billion from a capped-fee arrangement in 2024. This redemption has no impact on future fee revenues.\n(2)\nThird quarter 2025 includes withdrawals related to certain exited pension business in Hong Kong. Third and second quarters of 2025 include the divestment of Post Advisory Group. First quarter 2025 includes the divestment of Origin Asset Management.\n​\n134\n\n\nTable of Contents\nPrincipal Asset Management Segment Summary Financial Data\nThe following table presents certain summary financial data relating to the Principal Asset Management segment for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nOperating revenues:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nPremiums and other considerations\n​\n$\n 0.5\n​\n$\n 4.8\n​\n$\n (4.3)\n​\n$\n 6.1\n​\n$\n 18.0\n​\n$\n (11.9)\nFees and other revenues\n​\n \n 547.1\n​\n​\n 527.9\n​\n​\n 19.2\n​\n​\n 1,596.7\n​\n​\n 1,539.9\n​\n​\n 56.8\nNet investment income\n​\n \n 179.5\n​\n​\n 207.4\n​\n​\n (27.9)\n​\n​\n 514.5\n​\n​\n 522.3\n​\n​\n (7.8)\nTotal operating revenues\n​\n \n 727.1\n​\n​\n 740.1\n​\n​\n (13.0)\n​\n​\n 2,117.3\n​\n​\n 2,080.2\n​\n​\n 37.1\nExpenses:\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBenefits, claims and settlement expenses\n​\n \n 60.9\n​\n​\n 81.8\n​\n​\n (20.9)\n​\n​\n 233.7\n​\n​\n 260.1\n​\n​\n (26.4)\nLiability for future policy benefits remeasurement (gain) loss\n​\n​\n (0.8)\n​\n​\n 0.2\n​\n​\n (1.0)\n​\n​\n (0.9)\n​\n​\n 0.1\n​\n​\n (1.0)\nOperating expenses\n​\n \n 387.9\n​\n​\n 384.9\n​\n​\n 3.0\n​\n​\n 1,172.8\n​\n​\n 1,163.7\n​\n​\n 9.1\nTotal expenses\n​\n \n 448.0\n​\n​\n 466.9\n​\n​\n (18.9)\n​\n​\n 1,405.6\n​\n​\n 1,423.9\n​\n​\n (18.3)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPre-tax operating earnings attributable to noncontrolling interest\n​\n \n 4.4\n​\n​\n 4.5\n​\n​\n (0.1)\n​\n​\n 13.1\n​\n​\n 11.1\n​\n​\n 2.0\nPre-tax operating earnings\n​\n$\n 274.7\n​\n$\n 268.7\n​\n$\n 6.0\n​\n$\n 698.6\n​\n$\n 645.2\n​\n$\n 53.4\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nPre-Tax Operating Earnings \nPre-tax operating earnings increased in our Investment Management operations due to $19.4 million higher management fee revenue as a result of increased average AUM, which was partially offset by $3.4 million lower performance fee revenue primarily in our real estate business. Pre-tax operating earnings decreased in our International Pension operations due to $9.2 million lower fees primarily due to the loss of administrative fees related to the transition to a new administrative platform in conjunction with MPF system reform in Hong Kong and $4.4 million lower earnings from our equity method investments in Brazil, primarily as a result of our prior year actuarial assumption review and other updates. This decrease was partially offset by $4.7 million of lower operating expenses in Hong Kong.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nPre-Tax Operating Earnings \nPre-tax operating earnings increased in our Investment Management operations due to $51.9 million higher management fee revenue as a result of increased average AUM, which was partially offset by $15.7 million increase in variable compensation expense. Pre-tax operating earnings increased in our International Pension operations primarily due to $15.2 million of increased fees from increased business, $15.2 million of favorable relative market performance on our required regulatory investments and $14.0 million increased variable investment income. These improvements were partially offset by $15.3 million lower earnings from our equity method investments in Brazil, primarily as a result of our prior year actuarial assumption review and other updates, and $10.9 million of foreign currency headwinds.\nBenefits and Protection Segment\nBenefits and Protection Segment Summary Financial Data\nPremium and fees are a key metric for growth in the Benefits and Protection segment. We receive premiums on our specialty benefits insurance products as well as our traditional life insurance products. Fees are generated from our universal life, variable universal life and indexed universal life insurance products. We use several reinsurance programs to help manage the mortality and morbidity risk. Premium and fees are reported net of reinsurance premiums.\n135\n\n\nTable of Contents\nThe following table presents the Benefits and Protection segment premium and fees for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nPremium and fees:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nSpecialty Benefits\n​\n$\n 845.2\n​\n$\n 818.8\n​\n$\n 26.4\n​\n$\n 2,516.9\n​\n$\n 2,433.6\n​\n$\n 83.3\nLife Insurance\n​\n \n 248.9\n​\n​\n 241.1\n​\n​\n 7.8\n​\n \n 722.0\n​\n​\n 702.1\n​\n​\n 19.9\n​\nThe following table presents certain summary financial data relating to the Benefits and Protection segment for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nOperating revenues:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nPremiums and other considerations\n​\n$\n 972.8\n​\n$\n 941.9\n​\n$\n 30.9\n​\n$\n 2,875.7\n​\n$\n 2,788.8\n​\n$\n 86.9\nFees and other revenues\n​\n \n 121.1\n​\n​\n 117.8\n​\n​\n 3.3\n​\n​\n 362.7\n​\n​\n 346.3\n​\n​\n 16.4\nNet investment income\n​\n \n 166.6\n​\n​\n 153.8\n​\n​\n 12.8\n​\n​\n 482.6\n​\n​\n 451.5\n​\n​\n 31.1\nTotal operating revenues\n​\n \n 1,260.5\n​\n​\n 1,213.5\n​\n​\n 47.0\n​\n​\n 3,721.0\n​\n​\n 3,586.6\n​\n​\n 134.4\nExpenses:\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBenefits, claims and settlement expenses\n​\n \n 705.0\n​\n​\n 679.7\n​\n​\n 25.3\n​\n​\n 2,123.4\n​\n​\n 1,990.0\n​\n​\n 133.4\nDividends to policyholders\n​\n \n 29.9\n​\n​\n 14.9\n​\n​\n 15.0\n​\n​\n 71.9\n​\n​\n 68.0\n​\n​\n 3.9\nLiability for future policy benefits remeasurement loss\n​\n​\n 72.8\n​\n​\n 97.1\n​\n​\n (24.3)\n​\n​\n 68.7\n​\n​\n 151.7\n​\n​\n (83.0)\nOperating expenses\n​\n \n 366.3\n​\n​\n 357.4\n​\n​\n 8.9\n​\n​\n 1,103.4\n​\n​\n 1,068.4\n​\n​\n 35.0\nTotal expenses\n​\n \n 1,174.0\n​\n​\n 1,149.1\n​\n​\n 24.9\n​\n​\n 3,367.4\n​\n​\n 3,278.1\n​\n​\n 89.3\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPre-tax operating earnings\n​\n$\n 86.5\n​\n$\n 64.4\n​\n$\n 22.1\n​\n$\n 353.6\n​\n$\n 308.5\n​\n$\n 45.1\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nPre-Tax Operating Earnings (Losses)\nPre-tax operating earnings in our Specialty Benefits business increased $27.2 million from improved claims experience and $25.9 million due to favorable actuarial assumption updates in 2025 compared to unfavorable in 2024. Pre-tax operating earnings in our Life Insurance business decreased $18.6 million due to more unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024 and $8.6 million from negative claims experience.\nOperating Revenues\nPremiums and fees increased primarily due to growth in the business.\nNet investment income in our Life Insurance business increased $5.1 million due to growth in invested assets, $4.7 million from mark-to-market changes on options associated with our indexed universal life insurance and $1.8 million from higher yields on invested assets.\nTotal Expenses\nBenefits, claims and settlement expenses in our Specialty Benefits business increased $16.1 million from growth in the business and $16.1 million due to unfavorable actuarial assumption updates in 2025 compared to favorable in 2024, offset by $27.2 million from improved claims experience. Benefits, claims and settlement expenses in our Life Insurance business increased $8.6 million from unfavorable claims experience, $5.8 million due to mark-to-market changes on options associated with our indexed universal life insurance and $4.7 million due to growth in the business.\n136\n\n\nTable of Contents\nDividends to policyholders in our Life Insurance business increased $15.0 million primarily due to a change in the policyholder dividend obligation.\nLiability for future policy benefits remeasurement (gain) loss in our Specialty Benefits business changed $40.9 million due to favorable actuarial assumption updates in 2025 compared to unfavorable in 2024. Liability for future policy benefits remeasurement loss in our Life Insurance business increased $22.4 million due to more unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024.\nOperating expenses increased primarily due to growth in the business.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nPre-Tax Operating Earnings\nPre-tax operating earnings in our Specialty Benefits business increased $37.8 million from improved claims experience, $25.9 million due to favorable actuarial assumption updates in 2025 compared to unfavorable in 2024 and $10.7 million due to growth. Pre-tax operating earnings in our Life Insurance business decreased $41.8 million from negative claims experience and $18.6 million due to more unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024, offset by $17.0 million liability for future policy benefits remeasurement gain due to underlying claims experience, $6.0 million from higher yields on invested assets and a $3.2 million one-time expense accrual release in 2025. \nOperating Revenues\nPremiums and fees in our Specialty Benefits business increased $83.3 million due to growth in the business. Premiums and fees in our Life Insurance business increased $11.4 million due to the one-time impact of the YRT Reinsurance Transactions in 2024 and $7.0 million due to growth in the business.\nNet investment income in our Specialty Benefits business increased $13.8 million primarily from higher yields on invested assets. Net investment income in our Life Insurance business increased $15.0 million from growth in invested assets and $6.0 million from higher yields on invested assets, offset by a decrease of $3.7 million from mark-to-market changes on options associated with our indexed universal life insurance.\nTotal Expenses\nBenefits, claims and settlement expenses in our Specialty Benefits business increased $50.8 million due to growth in the business and $16.1 million due to unfavorable actuarial assumption updates in 2025 compared to favorable in 2024, offset by $37.8 million from improved claims experience. Benefits, claims and settlement expenses in our Life Insurance business increased $58.0 million due to the one-time impact of the YRT Reinsurance Transactions in 2024 and $41.8 million from unfavorable claims experience.\nDividends to policyholders in our Life Insurance business increased $6.6 million due to higher dividends on our Closed Block business, offset by $3.5 million due to less unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024.\nLiability for future policy benefits remeasurement (gain) loss in our Specialty Benefits business changed $40.9 million due to favorable actuarial assumption updates in 2025 compared to unfavorable in 2024 and $6.3 million due to changes in underlying claims experience. Liability for future policy benefits remeasurement loss in our Life Insurance business decreased $41.2 million due to the one-time impact of the YRT Reinsurance Transactions in 2024 and $17.0 million due to changes in underlying claims experience, offset by $22.4 million due to more unfavorable actuarial assumption updates, model refinements and other updates in 2025 compared to 2024.\nOperating expenses in our Specialty Benefits business increased $26.0 million due to growth in the business and $20.5 million due to higher net commissions, offset by a $7.1 million decrease due to a one-time expense accrual release in 2025. Operating expenses in our Life Insurance business decreased $3.4 million primarily due to a one-time expense accrual release in 2025.\n137\n\n\nTable of Contents\nCorporate Segment\nCorporate Segment Summary Financial Data\nThe following table presents certain summary financial data relating to the Corporate segment for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nOperating revenues:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nTotal operating revenues\n​\n$\n 24.2\n​\n$\n 31.1\n​\n$\n (6.9)\n​\n$\n 82.9\n​\n$\n 68.6\n​\n$\n 14.3\nExpenses:\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal expenses\n​\n \n 118.1\n​\n​\n 101.8\n​\n​\n 16.3\n​\n​\n 366.8\n​\n​\n 334.1\n​\n​\n 32.7\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPre-tax operating earnings (losses) attributable to noncontrolling interest\n​\n \n (2.3)\n​\n​\n 8.7\n​\n​\n (11.0)\n​\n​\n (5.5)\n​\n​\n 6.2\n​\n​\n (11.7)\nPre-tax operating losses\n​\n$\n (91.6)\n​\n$\n (79.4)\n​\n$\n (12.2)\n​\n$\n (278.4)\n​\n$\n (271.7)\n​\n$\n (6.7)\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nPre-Tax Operating Losses\nPre-tax operating losses increased primarily due to a $5.5 million increase in compensation costs and a $3.4 million decrease in interest income related to tax settlements.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nPre-Tax Operating Losses\nPre-tax operating losses increased primarily due to a $15.2 million increase in compensation costs, partially offset by an $8.0 million increase in interest income related to tax settlements.\nLiquidity and Capital Resources\nLiquidity and capital resources represent the overall strength of a company and its ability to generate strong cash flows, borrow funds at a competitive rate and raise new capital to meet operating and growth needs. We are monitoring our liquidity closely and feel confident in our ability to meet all long-term obligations to customers, policyholders and debt holders. Our sources of strength include our laddered long-term debt maturities with the next maturity occurring in November 2026, access to revolving credit facility and contingent funding arrangements, a strong risk-based capital position and our available cash and liquid assets. Our legal entity structure has an impact on our ability to meet cash flow needs as an organization. Following is a simplified organizational structure.\n138\n\n\nTable of Contents\nLiquidity\nOur liquidity requirements have been and will continue to be met by funds from consolidated operations as well as the issuance of commercial paper, common stock, debt or other capital securities and borrowings from credit facilities. We believe the cash flows from these sources are sufficient to satisfy the current liquidity requirements of our operations, including reasonably foreseeable contingencies.\nWe maintain a level of cash and securities which, combined with expected cash inflows from investments and operations, we believe to be adequate to meet anticipated short-term and long-term payment obligations. We will continue our prudent capital management practice of regularly exploring options available to us to maximize capital flexibility, including accessing the capital markets and careful attention to and management of expenses.\nWe perform rigorous liquidity stress testing to ensure our asset portfolio includes sufficient high quality liquid assets that could be utilized to bolster our liquidity position under increasingly stressed market conditions. These assets could be utilized as collateral for secured borrowing transactions with various third parties or by selling the securities in the open market if needed.\nWe also manage liquidity risk by limiting the sales of liabilities with features such as puts or other options that can be exercised at inopportune times. For example, as of September 30, 2025, approximately $14.0 billion, or 99%, of our institutional guaranteed investment contracts and funding agreements cannot be redeemed by contractholders prior to maturity. Our individual annuity liabilities also contain surrender charges and other provisions limiting early surrenders.\nThe following table summarizes the withdrawal characteristics of our domestic general account investment contracts as of September 30, 2025.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nContractholder funds,\n    \n​\n \n​\n​\nnet of reinsurance\n​\nPercentage\n​\n​\n​\n(in millions)\n​\n​\n \nNot subject to discretionary withdrawal\n​\n$\n 14,907.7\n​\n 51.2\n%\nSubject to discretionary withdrawal with adjustments:\n​\n \n​\n​\n​\n​\nSpecified surrender charges\n​\n \n 6,641.8\n​\n 22.8\n​\nMarket value adjustments\n​\n \n 7,575.8\n​\n 26.0\n​\nSubject to discretionary withdrawal without adjustments\n​\n \n 0.6\n​\n—\n​\nTotal domestic investment contracts\n​\n$\n 29,125.9\n​\n 100.0\n%\n​\nUniversal life insurance and certain traditional life insurance policies are also subject to discretionary withdrawals by policyholders. However, life insurance policies tend to be less susceptible to withdrawal than our investment contracts because policyholders may be subject to a new underwriting process in order to obtain a new life insurance policy. In addition, our life insurance liabilities include surrender charges to discourage early surrenders.\nWe had the following short-term credit financing structures available with various financial institutions as of September 30, 2025:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n    \n​\n    \n​\n​\n    \nAmount\nObligor/Applicant\n​\nFinancing structure\n​\nMaturity\n​\nCapacity\n​\noutstanding (3)\n​\n​\n​\n​\n​\n​\n(in millions)\nPrincipal Life (1)\n \nCredit facility\n \nOctober 2027\n​\n$\n 800.0\n​\n$\n —\nPrincipal Compañía de Seguros de Vida Chile S.A. (2)\n​\nUnsecured lines of credit\n​\n​\n​\n​\n 79.7\n​\n​\n 10.2\nPrincipal International de Chile S.A. (2)\n​\nUnsecured lines of credit\n​\n​\n​\n​\n 22.5\n​\n​\n 2.8\nTotal\n \n  \n \n  \n​\n$\n 902.2\n​\n$\n 13.0\n(1)\nThe credit facility is supported by sixteen banks.\n(2)\nThe unsecured lines of credit can be used for repurchase agreements or other borrowings. Each line has a maturity of \nless than one year.\n(3)\nThe amount outstanding is reported in short-term debt on the consolidated statements of financial position.\n139\n\n\nTable of Contents\nThe revolving credit facility is committed and available for general corporate purposes. The credit facility also provides 100% back-stop support for our commercial paper program, of which we had no outstanding balances as of September 30, 2025 and December 31, 2024. Most of the banks supporting the credit facility have other relationships with us. Due to the financial strength and the strong relationships we have with these providers, we are comfortable we have very low risk the financial institutions would be unable or unwilling to fund this facility.\nThe Holding Companies: PFG and PFS. \nThe principal sources of funds available to our parent holding company, PFG, are dividends from subsidiaries as well as its ability to borrow funds at competitive rates and raise capital to meet operating and growth needs. These funds are used by PFG to meet its obligations, which include the payment of dividends on common stock, debt service and the repurchase of stock. The declaration and payment of common stock dividends is subject to the discretion of our Board and will depend on our overall financial condition, results of operations, capital levels, cash requirements, future prospects, receipt of dividends or other distributions from Principal Life (as described below), risk management considerations and other factors deemed relevant by the Board. No significant restrictions limit the payment of dividends by PFG, except those generally applicable to corporations incorporated in Delaware.\nDividends or other distributions from Principal Life, our primary subsidiary, are limited by Iowa law. Under Iowa law, Principal Life may pay dividends or make other distributions only from the earned surplus arising from its business and must receive the prior approval of the Commissioner of Insurance of the State of Iowa (the “Commissioner”) to pay stockholder dividends or make any other distribution if such distribution would exceed certain statutory limitations. Iowa law gives the Commissioner discretion to disapprove requests for distributions in excess of these limitations. Extraordinary dividends include those made, together with dividends and other distributions, within the preceding twelve months that exceed the greater of (i) 10% of statutory policyholder surplus as of the previous year-end excluding admitted disallowed interest maintenance reserve or (ii) the statutory net gain from operations from the previous calendar year, not to exceed earned surplus. Based on statutory results for the year ended December 31, 2024, the ordinary stockholder dividend limitation for Principal Life is approximately $1,313.1 million in 2025. However, because the dividend test is based on dividends previously paid over rolling twelve month periods, if paid before a specified date during 2025, some or all of such dividends may be extraordinary and require regulatory approval.\nTotal stockholder dividends paid by Principal Life to its parent for the nine months ended September 30, 2025, were $955.0 million, all of which was extraordinary and approved by the Commissioner. As of September 30, 2025, we had $2,675.2 million of cash and liquid assets held in our holding companies and other subsidiaries, which is available for corporate purposes. Corporate balances held in foreign holding companies meet the indefinite reinvestment exception.\nOperations. \nOur primary consolidated cash flow sources are premiums from insurance products, pension and annuity deposits, asset management fee revenues, administrative services fee revenues, income from investments and proceeds from the sales or maturity of investments. Cash outflows consist primarily of payment of benefits to policyholders and beneficiaries, income and other taxes, current operating expenses, payment of dividends to policyholders, payments in connection with investments acquired, payments made to acquire subsidiaries, payments relating to policy and contract surrenders, withdrawals, policy loans, interest payments and repayment of short-term debt and long-term debt. Our investment strategies are generally intended to provide adequate funds to pay benefits without forced sales of investments. For a discussion of our investment objectives and strategies, see “Investments.”\nCash Flows. \nCash flow activity, as reported in our consolidated statements of cash flows, provides relevant information regarding our sources and uses of cash. The following discussion of our operating, investing and financing portions of the cash flows excludes cash flows attributable to the separate accounts.\nNet cash provided by operating activities was $2,793.0 million and $3,143.9 million for the nine months ended September 30, 2025 and 2024, respectively. Our insurance business typically generates positive cash flows from operating activities, as premiums collected from our insurance products and investment income received exceed acquisition costs, benefits paid, redemptions and operating expenses. These positive cash flows are then invested to support the obligations of our insurance and investment products and required capital supporting these products. Our cash flows from operating activities are affected by the timing of premiums, fees and investment income received and benefits and expenses paid. The decrease in cash provided by operating activities in 2025 compared to 2024 was primarily due to fluctuations in receivables and payables associated with the timing of settlements.\n140\n\n\nTable of Contents\nNet cash used in investing activities was $1,034.6 million and $1,628.6 million for the nine months ended September 30, 2025 and 2024, respectively. The decrease in cash used in investing activities was primarily due to lower net purchases of available-for-sale securities in 2025 as compared to 2024. This was partially offset by net purchases of mortgage loans in 2025 as compared to net sales in 2024.\nNet cash used in financing activities was $833.2 million and $48.5 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in cash used in financing activities was due to a $400.0 million repayment of long-term debt that matured during 2025 and a lower increase in both banking operation deposits and net investment contract deposits in 2025 as compared to 2024.\nGuarantors and Issuers of Guaranteed Securities.\n PFG has issued certain notes pursuant to transactions registered under the Securities Act of 1933. Such notes include all currently outstanding senior notes (the “registered notes”). For additional information on the senior notes, see Item 8. “Financial Statements and Supplementary Data, Notes to Consolidated Financial Statements, Note 13, Debt” in our Annual Report on Form 10-K for the year ended December 31, 2024.\nPFS, a wholly owned subsidiary of PFG, has guaranteed each of the registered notes on a full and unconditional basis. The full and unconditional guarantees require PFS to satisfy the obligations of the guaranteed security immediately, if and when PFG has failed to make a scheduled payment thereunder. If PFS does not make such payment, any holder of the guaranteed security may immediately bring suit directly against PFS for payment of amounts due and payable. No other subsidiary of PFG has guaranteed any of the registered notes. \nSummary financial information is presented below on a combined basis for PFG and PFS (the “obligor group”) and transactions between the obligor group have been eliminated. The summary financial information excludes subsidiaries that are not issuers or guarantors. Any investments by the obligor group in other subsidiaries have been excluded.\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n    \n(in millions)\nSummary Statements of Financial Position Information:\n​\n​\n  \n \n​\n  \nTotal investments\n​\n$\n 636.2\n​\n$\n 640.6\nCash and cash equivalents\n​\n​\n 506.0\n​\n​\n 357.3\nGoodwill\n​\n​\n 618.5\n​\n​\n 618.5\nOther intangibles\n​\n​\n 371.6\n​\n​\n 391.2\nOther assets\n​\n​\n 342.0\n​\n​\n 313.3\nDue from non-obligor subsidiaries\n​\n​\n 44.0\n​\n​\n 42.8\nTotal assets\n​\n​\n 2,533.4\n​\n​\n 2,367.3\nLong-term debt\n​\n​\n 3,921.7\n​\n​\n 3,930.6\nOther liabilities\n​\n​\n 370.2\n​\n​\n 351.2\nDue to non-obligor subsidiaries\n​\n​\n 803.2\n​\n​\n 732.2\nTotal liabilities\n​\n​\n 5,238.0\n​\n​\n 5,135.8\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the nine months ended\n​\nFor the year ended\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n​\n(in millions)\nSummary Statements of Operations Information:\n \n​\n  \n \n​\n  \nTotal revenues\n​\n$\n 53.0\n​\n$\n 130.6\nTotal expenses\n​\n​\n 396.3\n​\n​\n 497.1\nNet loss\n​\n​\n (272.0)\n​\n​\n (300.6)\n​\n141\n\n\nTable of Contents\nShelf Registration.\n Under our current shelf registration, we have the ability to issue, in unlimited amounts, unsecured senior debt securities or subordinated debt securities, junior subordinated debt, preferred stock, common stock, warrants, depositary shares, purchase contracts and purchase units of PFG. Our wholly owned subsidiary, PFS, may guarantee, fully and unconditionally or otherwise, our obligations with respect to any non-convertible securities, other than common stock, described in the shelf registration. \nShort-Term Debt. \nThe components of short-term debt were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n​\n(in millions)\nRevolving line of credit\n​\n$\n —\n​\n$\n 119.0\nOther recourse short-term debt\n​\n​\n 13.0\n​\n​\n 33.7\nTotal short-term debt\n​\n$\n 13.0\n​\n$\n 152.7\n​\nThe short-term credit facilities are used for general corporate purposes and borrowings outstanding can fluctuate as part of working capital management.\nLong-Term Debt. \nOn March 14, 2025, we exercised our rights in full under the 2028 P-Caps to issue senior notes in exchange for Eligible Assets. Proceeds from the sale of Eligible Assets were used to repay our senior 2025 Notes that matured on May 15, 2025. For long-term debt information, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 12, Long-Term Debt.”\nContingent Funding Agreements for Senior Debt Issuance.\n On March 6, 2025, we entered into a contingent funding agreement that gives us the right at any time over a thirty-year period to issue up to $500.0 million of senior notes.\nIn March 2018, we entered into two contingent funding agreements that give us the right at any time over a ten-year or thirty-year period to issue up to $400.0 million or $350.0 million, respectively, of senior notes. In March 2025, we exercised our right to issue $400.0 million of senior notes under the ten-year contingent funding agreement.\nFor information on the contingent funding agreements, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 12, Long-Term Debt.” under the caption “Contingent Funding Agreements for Senior Debt Issuance.”\nStockholders’ Equity. \nThe following table summarizes our return of capital to common stockholders.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nFor the nine months ended \n    \nFor the year ended\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n​\n​\n(in millions)\nDividends to stockholders\n​\n$\n 511.6\n​\n$\n 658.4\nRepurchase of common stock (1)\n​\n \n 623.3\n​\n​\n 1,042.4\nTotal cash returned to common stockholders\n​\n$\n 1,134.9\n​\n$\n 1,700.8\n(1)\nIncludes common stock utilized to execute certain stock incentive awards and shares purchased as part of publicly announced programs.\nIn February 2024, our Board authorized a share repurchase program of up to $1.5 billion of our outstanding common stock, which has no expiration date. In February 2025, our Board authorized a share repurchase program of up to $1.5 billion of our outstanding common stock, which has no expiration date. See Part II, Item 2. “Unregistered Sales of Equity Securities and Use of Proceeds,” for information about our share repurchase authorizations. For additional stockholders’ equity information, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 16, Stockholders’ Equity.”\n142\n\n\nTable of Contents\nCapitalization\nThe following table summarizes our capital structure:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n​\n​\n($ in millions)\n​\nDebt:\n \n​\n  \n \n​\n  \n​\nShort-term debt\n​\n$\n 13.0\n​\n$\n 152.7\n​\nLong-term debt\n​\n \n 3,924.6\n​\n \n 3,955.3\n​\nTotal debt\n​\n \n 3,937.6\n​\n \n 4,108.0\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal stockholders’ equity attributable to PFG\n​\n \n 11,665.5\n​\n \n 11,086.4\n​\nTotal capitalization\n​\n$\n 15,603.1\n​\n$\n 15,194.4\n​\nDebt to equity\n​\n \n 34\n%\n \n 37\n%\nDebt to capitalization\n​\n \n 25\n%\n \n 27\n%\n​\nContractual Obligations and Contractual Commitments\nAs of September 30, 2025, we had no unique material cash requirements from known contractual and other obligations.\nOff-Balance Sheet Arrangements\nVariable Interest Entities.\n We have relationships with various types of special purpose entities and other entities where we have a variable interest as described in Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 3, Variable Interest Entities.” We have made commitments to fund certain limited partnerships, some of which are classified as unconsolidated variable interest entities.\n​\n143\n\n\nTable of Contents\nGuarantees and Indemnifications. \nAs of September 30, 2025, no significant changes to guarantees and indemnifications have occurred since December 31, 2024. For guarantee and indemnification information, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 15, Contingencies, Guarantees and Indemnifications” under the caption, “Guarantees and Indemnifications.”\nFinancial Strength and Credit Ratings\nOur ratings are influenced by the relative ratings of our peers/competitors as well as many other factors including our operating and financial performance, capital levels, asset quality, liquidity, asset/liability management, overall portfolio mix, financial leverage (i.e., debt), risk exposures, operating leverage and other factors.\nWe have had no significant changes or actions in ratings and rating outlooks that have occurred from January 1, 2025, through the date of this filing.\nThe following table summarizes our significant financial strength and debt ratings from the major independent rating organizations. A rating is not a recommendation to buy, sell or hold securities. Such a rating may be subject to revision or withdrawal at any time by the assigning rating agency. Each rating should be evaluated independently of any other rating.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nA.M. Best\n    \nFitch\n    \nMoody’s\n    \nS&P\nLast review date\n​\nApril 2025\n​\nMay 2025\n​\nJune 2025\n​\nApril 2025\nCurrent outlook\n​\nStable\n​\nStable\n​\nStable\n​\nStable\nPrincipal Financial Group\n \n  \n \n  \n \n​\n \n​\nSenior Unsecured Debt\n \na\n \nA-\n \nBaa1\n \nA-\nLong-Term Issuer Default Rating\n \n  \n \nA\n \n  \n \n  \nPrincipal Life Insurance Company\n \n  \n \n  \n \n  \n \n  \nInsurer Financial Strength\n \nA+\n \nAA-\n \nA1\n \nA+\nIssuer Credit Rating\n \naa\n \n  \n \n  \n \n  \nCommercial Paper\n \nAMB‑1+\n \n  \n \nP-1\n \nA-1+\nPrincipal National Life Insurance Company\n \n  \n \n  \n \n  \n \n  \nInsurer Financial Strength\n \nA+\n \nAA-\n \nA1\n \nA+\n​\nFair Value Measurement\nFair value is defined as the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date (an exit price). The fair value hierarchy prioritizes the inputs to valuation techniques used to measure fair value into three levels. The fair value hierarchy gives the highest priority (Level 1) to unadjusted quoted prices in active markets for identical assets or liabilities and gives the lowest priority (Level 3) to unobservable inputs. The level in the fair value hierarchy within which the fair value measurement in its entirety falls is determined based on the lowest level input that is significant to the fair value measurement in its entirety considering factors specific to the asset or liability. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 17, Fair Value Measurements” for further details, including a reconciliation of changes in Level 3 fair value measurements.\nAs of September 30, 2025, 47% of our net assets (liabilities) were Level 1, 50% were Level 2 and 3% were Level 3. Excluding separate account assets as of September 30, 2025, 3% of our net assets (liabilities) were Level 1, 89% were Level 2 and 8% were Level 3.\nAs of December 31, 2024, 47% of our net assets (liabilities) were Level 1, 50% were Level 2 and 3% were Level 3. Excluding separate account assets as of December 31, 2024, 4% of our net assets (liabilities) were Level 1, 87% were Level 2 and 9% were Level 3.\n​\n144\n\n\nTable of Contents\nChanges in Level 3 Fair Value Measurements\nNet assets (liabilities) measured at fair value on a recurring basis using significant unobservable inputs (Level 3) as of September 30, 2025, were $7,051.3 million as compared to $8,046.3 million as of December 31, 2024. The decrease was primarily related to issuances of investment and universal life contracts, a decrease in the funds withheld payable embedded derivative net asset and settlements of mortgage loans.\nInvestments\nWe had total consolidated assets as of September 30, 2025, of $334,491.8 million, of which $107,608.1 million were invested assets. A portion of our invested assets represent funds withheld backing reserves as part of coinsurance with funds withheld reinsurance agreements. The funds withheld assets and associated net investment income and net realized capital gains (losses) are not included in the discussions below as the investment risk is passed to the reinsurer. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 11, Reinsurance” for more information on the funds withheld assets. The rest of our total consolidated assets are comprised primarily of separate account assets for which we do not bear investment risk; therefore, the discussion and financial information below does not include such assets.\nOverall Composition of Invested Assets\nInvested assets as of September 30, 2025, were predominantly high quality and broadly diversified across asset class, individual credit, industry and geographic location. Asset allocation is determined based on cash flow and the risk/return requirements of our products. As shown in the following table, the major categories of invested assets are fixed maturities and mortgage loans.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\n​\nInvestments\n​\n​\n​\n​\n​\n​\n​\n    \nexcluding\n    \nFunds\n    \n​\n​\n​\n​\nfunds withheld\n​\nwithheld\n​\nTotal\n​\n​\n(in millions)\nFixed maturities\n​\n$\n 58,849.3\n​\n$\n 13,830.4\n​\n$\n 72,679.7\nEquity securities\n​\n \n 1,648.7\n​\n​\n 0.3\n​\n​\n 1,649.0\nMortgage loans\n​\n \n 18,607.0\n​\n​\n 2,074.2\n​\n​\n 20,681.2\nReal estate\n​\n \n 2,387.1\n​\n​\n—\n​\n​\n 2,387.1\nPolicy loans\n​\n \n 870.7\n​\n​\n—\n​\n​\n 870.7\nOther investments\n​\n \n 7,765.2\n​\n​\n 1,575.2\n​\n​\n 9,340.4\nTotal invested assets\n​\n \n 90,128.0\n​\n​\n 17,480.1\n​\n​\n 107,608.1\nCash and cash equivalents\n​\n \n 4,478.8\n​\n​\n 658.3\n​\n​\n 5,137.1\nTotal invested assets and cash\n​\n$\n 94,606.8\n​\n$\n 18,138.4\n​\n$\n 112,745.2\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\n​\nInvestments\n​\n​\n​\n​\n​\n​\n​\n    \nexcluding\n    \nFunds\n    \n​\n​\n​\n​\nfunds withheld\n​\nwithheld\n​\nTotal\n​\n​\n(in millions)\nFixed maturities\n​\n$\n 55,455.3\n​\n$\n 13,819.0\n​\n$\n 69,274.3\nEquity securities\n​\n \n 2,294.7\n​\n​\n 0.3\n​\n​\n 2,295.0\nMortgage loans\n​\n \n 18,271.8\n​\n​\n 2,212.4\n​\n​\n 20,484.2\nReal estate\n​\n \n 2,464.5\n​\n​\n—\n​\n​\n 2,464.5\nPolicy loans\n​\n \n 867.5\n​\n​\n—\n​\n​\n 867.5\nOther investments\n​\n \n 6,847.5\n​\n​\n 1,142.8\n​\n​\n 7,990.3\nTotal invested assets\n​\n \n 86,201.3\n​\n​\n 17,174.5\n​\n​\n 103,375.8\nCash and cash equivalents\n​\n \n 3,131.8\n​\n​\n 1,080.1\n​\n​\n 4,211.9\nTotal invested assets and cash\n​\n$\n 89,333.1\n​\n$\n 18,254.6\n​\n$\n 107,587.7\n​\n145\n\n\nTable of Contents\nInvestment Results\nNet Investment Income\nThe following table presents the yield and investment income, excluding net realized capital gains and losses, for our invested assets for the periods indicated. We calculate annualized yields using a simple average of asset classes at the beginning and end of the reporting period. The yields for available-for-sale fixed maturities are calculated using amortized cost. All other yields are calculated using carrying amounts.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n​\n2025\n​\n2024\n​\nIncrease (decrease)\n​\n2025\n​\n2024\n​\nIncrease (decrease)\n​\n    \nYield\n    \nAmount\n    \nYield\n    \nAmount\n    \nYield\n    \nAmount\n    \nYield\n    \nAmount\n    \nYield\n    \nAmount\n    \nYield\n    \nAmount\n​\n​\n($ in millions)\nFixed maturities \n \n 5.0\n%  \n$\n 763.4\n \n 5.3\n%  \n$\n 747.9\n \n (0.3)\n%  \n$\n 15.5\n \n 5.1\n%  \n$\n 2,288.1\n \n 5.0\n%  \n$\n 2,079.9\n \n 0.1\n%  \n$\n 208.2\nEquity securities \n \n 8.2\n​\n \n 33.3\n \n 8.8\n​\n \n 34.1\n \n (0.6)\n​\n \n (0.8)\n \n 6.5\n​\n \n 96.8\n \n 5.6\n​\n \n 64.0\n \n 0.9\n​\n \n 32.8\nMortgage loans – commercial\n \n 4.9\n​\n \n 176.9\n \n 4.4\n​\n \n 155.9\n \n 0.5\n​\n \n 21.0\n \n 4.6\n​\n \n 499.8\n \n 4.3\n​\n \n 458.7\n \n 0.3\n​\n \n 41.1\nMortgage loans – residential\n \n 5.1\n​\n \n 53.2\n \n 5.3\n​\n \n 48.0\n \n (0.2)\n​\n \n 5.2\n \n 5.7\n​\n \n 166.5\n \n 5.3\n​\n \n 144.4\n \n 0.4\n​\n \n 22.1\nReal estate\n \n 4.9\n​\n \n 29.7\n \n 11.9\n​\n \n 71.9\n \n (7.0)\n​\n \n (42.2)\n \n 5.6\n​\n \n 101.0\n \n 8.1\n​\n \n 144.3\n \n (2.5)\n​\n \n (43.3)\nPolicy loans\n \n 5.3\n​\n \n 11.6\n \n 5.4\n​\n \n 11.2\n \n (0.1)\n​\n \n 0.4\n \n 5.3\n​\n \n 34.3\n \n 5.3\n​\n \n 32.7\n \n—\n​\n \n 1.6\nCash and cash equivalents\n \n 5.4\n​\n \n 51.5\n \n 6.7\n​\n \n 70.4\n \n (1.3)\n​\n \n (18.9)\n \n 5.1\n​\n \n 145.6\n \n 6.2\n​\n \n 202.5\n \n (1.1)\n​\n \n (56.9)\nOther investments \n \n 7.9\n​\n \n 149.5\n \n 6.3\n​\n \n 105.3\n \n 1.6\n​\n \n 44.2\n \n 7.1\n​\n \n 391.0\n \n 8.2\n​\n \n 404.4\n \n (1.1)\n​\n \n (13.4)\nTotal\n \n 5.3\n​\n \n 1,269.1\n \n 5.5\n​\n \n 1,244.7\n \n (0.2)\n​\n \n 24.4\n \n 5.2\n​\n \n 3,723.1\n \n 5.3\n​\n \n 3,530.9\n \n (0.1)\n​\n \n 192.2\nInvestment expenses\n \n (0.3)\n​\n \n (68.6)\n \n (0.3)\n​\n \n (77.1)\n \n—\n​\n \n 8.5\n \n (0.3)\n​\n \n (194.1)\n \n (0.3)\n​\n \n (205.0)\n \n—\n​\n \n 10.9\nNet investment income\n \n 5.0\n%  \n$\n 1,200.5\n \n 5.2\n%  \n$\n 1,167.6\n \n (0.2)\n%  \n$\n 32.9\n \n 4.9\n%  \n$\n 3,529.0\n \n 5.0\n%  \n$\n 3,325.9\n \n (0.1)\n%  \n$\n 203.1\n​\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nNet investment income increased primarily due to higher average invested assets in fixed maturities and higher income associated with derivatives in fair value hedges and other alternative investments for our U.S. operations. These increases were partially offset by lower yields in fixed maturities and the sale of certain value-add real estate in third quarter of 2024 for our U.S. operations.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNet investment income increased primarily due to higher average invested assets and yields in fixed maturities for our U.S. operations. These increases were partially offset by lower income associated with currency derivatives for our U.S. operations.\nNet Realized Capital Gains (Losses)\nThe following table presents the contributors to net realized capital gains and losses for the periods indicated. The amounts below do not include net realized capital gains (losses) on funds withheld assets that are not passed to the reinsurer, which are separately reported on the consolidated statements of operations.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the three months ended September 30, \n​\nFor the nine months ended September 30, \n​\n    \n​\n​\n    \n​\n​\n    \nIncrease\n    \n​\n​\n    \n​\n​\n    \nIncrease\n​\n​\n2025\n​\n2024\n​\n(decrease)\n​\n2025\n​\n2024\n​\n(decrease)\n​\n​\n(in millions)\nFixed maturities, available-for-sale – credit losses, including credit sales (1)\n​\n$\n (24.9)\n​\n$\n (2.8)\n​\n$\n (22.1)\n​\n$\n (34.9)\n​\n$\n (11.5)\n​\n$\n (23.4)\nCommercial mortgage loans – credit losses\n​\n \n (1.1)\n​\n​\n (50.4)\n​\n​\n 49.3\n​\n​\n (14.5)\n​\n​\n (93.8)\n​\n​\n 79.3\nOther – credit gains (losses)\n​\n \n (5.9)\n​\n​\n 1.3\n​\n​\n (7.2)\n​\n​\n (9.5)\n​\n​\n (2.7)\n​\n​\n (6.8)\nFixed maturities, available-for-sale and trading – noncredit\n​\n \n 4.7\n​\n​\n 13.7\n​\n​\n (9.0)\n​\n​\n (45.3)\n​\n​\n (18.6)\n​\n​\n (26.7)\nDerivatives and related hedge activities\n​\n \n 2.5\n​\n​\n 36.2\n​\n​\n (33.7)\n​\n​\n (33.8)\n​\n​\n 41.2\n​\n​\n (75.0)\nOther gains\n​\n \n 110.4\n​\n​\n 79.4\n​\n​\n 31.0\n​\n​\n 112.0\n​\n​\n 146.7\n​\n​\n (34.7)\nNet realized capital gains (losses) (2)\n​\n$\n 85.7\n​\n$\n 77.4\n​\n$\n 8.3\n​\n$\n (26.0)\n​\n$\n 61.3\n​\n$\n (87.3)\n(1)\nIncludes credit sales, adjustments to the credit loss valuation allowance, write-offs and recoveries on available-for-sale securities.\n(2)\nNet realized capital gains (losses) can be volatile due to credit losses from invested assets, mark-to-market adjustments of certain invested assets and our decision to sell invested assets.\n146\n\n\nTable of Contents\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nNet realized capital gains increased primarily due to decreased losses on non-hedged interest rate derivatives due to changes in rates, decreased losses on commercial mortgage loan reserve changes and increased gains on equity real estate sales. These changes were partially offset by increased credit losses on available-for-sale fixed maturities and increased losses on currency derivatives.\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\nNet realized capital losses increased primarily due to losses versus gains on currency derivatives, the write-down of an intangible asset in 2025, increased losses on non-hedged interest rate derivatives due to changes in rates, decreased gains on equity real estate sales and increased losses on non-credit available-for-sale fixed maturities. These changes were partially offset by gains versus losses on GMWB/RILA activities and decreased losses on commercial mortgage loan reserve changes.\nU.S. Investment Operations\nIn the following sections, we provide details about U.S. Investment Operations, excluding investments held as part of coinsurance with funds withheld agreements. We believe the details of the composition of our investment portfolio excluding the funds withheld are most relevant to an understanding of our operations that are pertinent to investors because all funds withheld assets support obligations and liabilities relating to reinsurance agreements. Guidelines are in place to ensure the investment risk associated with these fund withheld assets are appropriately managed. See Note 11, Reinsurance, for further information on the funds withheld assets.\nOf our invested assets, $83,655.5 million were held by our U.S. operations as of September 30, 2025. Our U.S. invested assets are managed primarily by Principal Asset Management–Investment Management. Our Investment Committee, appointed by our Board, is responsible for establishing investment policies and monitoring risk limits and tolerances. Our primary investment objective is to maximize after-tax returns consistent with acceptable risk parameters. We seek to protect customers’ benefits by optimizing the risk/return relationship on an ongoing basis, through asset/liability matching, reducing credit risk, avoiding high levels of investments that may be redeemed by the issuer, maintaining sufficiently liquid investments and avoiding undue asset concentrations through diversification. We are exposed to two primary sources of investment risk:\n●\ncredit risk, relating to the uncertainty associated with the continued ability of an obligor to make timely payments of principal and interest and\n●\ninterest rate risk, relating to the market price and/or cash flow variability associated with changes in market yield curves.\nOur ability to manage credit risk is essential to our business and our profitability. We devote considerable resources to the credit analysis of each new investment. We manage credit risk through industry, issuer and asset class diversification.\nA dedicated committee, comprised of senior investment professional staff members, approves the credit rating for the fixed maturities we purchase. We have teams of security analysts, organized by industry and asset class, that analyze and monitor these investments. Investments held in the portfolio are monitored on a continuous basis with a formal review annually or more frequently if material events affect the issuer. The analysis includes both fundamental and technical factors. The fundamental analysis encompasses both quantitative and qualitative analysis of the issuer. The qualitative analysis includes an assessment of both accounting and management aggressiveness of the issuer. In addition, technical indicators such as stock price volatility and credit default swap levels are monitored. We regularly review our investments to determine whether we should re-rate them, employing the following criteria:\n●\nmaterial changes in the issuer’s revenues, margins, capital structure or collateral values;\n●\nsignificant management or organizational changes;\n●\nsignificant changes regarding the issuer’s industry;\n●\ndebt service coverage or cash flow ratios that fall below industry-specific thresholds;\n●\nviolation of financial covenants and\n●\nother business factors that relate to the issuer.\n147\n\n\nTable of Contents\nWe purchase credit default swaps to hedge certain credit exposures in our investment portfolio. We economically hedged credit exposure in our portfolio by purchasing credit default swaps with a notional amount of $105.0 million and $155.0 million as of September 30, 2025 and December 31, 2024, respectively. We sell credit default swaps and total return swaps to offer credit protection to investors when entering into synthetic replicating transactions. When selling credit protection, if there is an event of default by the referenced name, we are obligated to pay the counterparty the referenced amount of the contract and receive in return the referenced security. When selling total return swaps, if there is an event of default by the referenced name, we are obligated to compensate the protection buyer for any decline in the price of the referenced security. For further information on credit derivatives sold, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 5, Derivative Financial Instruments” under the caption, “Credit Derivatives Sold.”\nOur use of derivatives exposes us to counterparty risk, or the risk that the counterparty fails to perform the terms of the derivative contract. We actively manage this risk by:\n●\nobtaining approval of all new counterparties by the Investment Committee;\n●\nestablishing exposure limits that take into account non-derivative exposure we have with the counterparty as well as derivative exposure;\n●\nperforming similar credit analysis prior to approval on each derivatives counterparty that we do when lending money on a long-term basis;\n●\ndiversifying our risk across numerous approved counterparties;\n●\nimplementing credit support annex (collateral) agreements (“CSAs”) for over-the-counter derivative transactions or similar agreements with a majority of our counterparties to further limit counterparty exposures, which provide for netting of exposures;\n●\nlimiting exposure to A credit or better for over-the-counter derivative counterparties without CSAs;\n●\nconducting stress-test analysis to determine the maximum exposure created during the life of a prospective transaction;\n●\ndaily monitoring of counterparty credit ratings, exposures and associated collateral levels and\n●\ntrading mandatorily cleared contracts through centralized clearinghouses.\nWe manage our exposure on a net basis, whereby we net positive and negative exposures for each counterparty with agreements in place. For further information on derivative exposure, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 4, Investments” under the caption, “Balance Sheet Offsetting.”\nA dedicated risk management team is responsible for centralized monitoring of the commercial mortgage loan portfolio. We apply a variety of guidelines to minimize credit risk in our commercial mortgage loan portfolio. When considering new commercial mortgage loans, we review the cash flow fundamentals of the property, make a physical assessment of the underlying commercial real estate, conduct a comprehensive market analysis and compare against industry lending practices. We use a proprietary risk rating model to evaluate all new and substantially all existing loans within the portfolio. The proprietary risk model is designed to stress projected cash flows under simulated economic and market downturns. Our lending guidelines are typically 75% or less loan-to-value ratio and a debt service coverage ratio of at least 1.2 times. We analyze investments outside of these guidelines based on cash flow quality, tenancy and other factors. The following table presents loan-to-value and debt service coverage ratios for our brick and mortar commercial mortgage loans:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average loan-to-value ratio\n​\nDebt service coverage ratio\n \n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n \nNew mortgages\n \n 50\n%  \n 53\n%  \n 1.9\nx\n 1.7\nx\nEntire mortgage portfolio\n \n 49\n%  \n 50\n%  \n 2.3\nx\n 2.3\nx\n​\nWe also seek to manage call or prepayment risk arising from changes in interest rates. We assess and price for call or prepayment risks in all of our investments and monitor these risks in accordance with asset/liability management policies.\nThe amortized cost and weighted average yield, calculated using amortized cost, of non-structured fixed maturity securities that will be callable at the option of the issuer, excluding securities with a make-whole provision, were $3,655.6 million and 4.8%, respectively, as of September 30, 2025, and $2,091.5 million and 4.0%, respectively, as of December 31, 2024. In addition, the amortized cost and weighted average yield of RMBS, residential collateralized mortgage obligations, and asset-backed securities - home equity with material prepayment risk were $8,843.0 million and 4.2%, respectively, as of September 30, 2025, and $8,401.9 million and 4.1%, respectively, as of December 31, 2024.\n148\n\n\nTable of Contents\nOur investment decisions and objectives are a function of the underlying risks and product profiles of each primary business operation. In addition, we diversify our product portfolio offerings to include products that contain features that will protect us against fluctuations in interest rates. Those features include adjustable crediting rates, policy surrender charges and market value adjustments on liquidations. For further information on our management of interest rate risk, see Item 3. “Quantitative and Qualitative Disclosures About Market Risk – Interest Rate Risk.”\nOverall Composition of U.S. Invested Assets\nAs shown in the following table, the major categories of U.S. invested assets are fixed maturities and mortgage loans. \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n \n​\n    \nCarrying amount\n    \n% of total\n    \nCarrying amount\n    \n% of total\n \n​\n​\n($ in millions)\n \nFixed maturities\n \n$\n 56,236.5\n \n 67\n%  \n$\n 52,960.3\n \n 66\n%\nEquity securities\n​\n \n 811.6\n \n 1\n​\n \n 1,547.6\n \n 2\n​\nMortgage loans\n​\n \n 17,713.4\n \n 21\n​\n \n 17,404.6\n \n 22\n​\nReal estate \n​\n \n 2,385.9\n \n 3\n​\n \n 2,463.7\n \n 3\n​\nPolicy loans\n​\n \n 855.6\n \n 1\n​\n \n 852.5\n \n 1\n​\nOther investments\n​\n \n 5,652.5\n \n 7\n​\n \n 4,844.7\n \n 6\n​\nTotal invested assets\n​\n \n 83,655.5\n \n 100\n%  \n \n 80,073.4\n \n 100\n%\nCash and cash equivalents\n​\n \n 4,181.5\n \n  \n​\n \n 2,882.9\n \n  \n​\nTotal invested assets and cash\n​\n$\n 87,837.0\n \n  \n​\n$\n 82,956.3\n \n  \n​\n​\nFixed Maturities\nFixed maturities include bonds, ABS, redeemable preferred stock and certain non-redeemable preferred securities that were diversified by category of issuer, as shown in the following table for the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n \n​\n    \nCarrying\n    \nPercent\n    \nCarrying\n    \nPercent\n \n​\n​\namount\n​\nof total\n​\namount\n​\nof total\n \n​\n​\n($ in millions)\n \nU.S. government and agencies\n​\n$\n 1,204.2\n \n 2\n%  \n$\n 1,102.6\n \n 2\n%\nNon-U.S. governments\n​\n \n 408.5\n \n 1\n​\n \n 393.0\n \n 1\n​\nStates and political subdivisions\n​\n \n 5,541.3\n \n 10\n​\n \n 4,836.3\n \n 9\n​\nCorporate - public\n​\n \n 13,192.4\n \n 23\n​\n \n 13,405.7\n \n 25\n​\nCorporate - private\n​\n \n 14,738.2\n \n 26\n​\n \n 13,193.4\n \n 25\n​\nResidential mortgage-backed pass-through securities\n​\n \n 3,715.5\n \n 7\n​\n \n 3,673.6\n \n 7\n​\nCommercial mortgage-backed securities\n​\n \n 4,463.2\n \n 8\n​\n \n 4,446.8\n \n 8\n​\nResidential collateralized mortgage obligations\n​\n \n 4,692.0\n \n 8\n​\n \n 4,043.3\n \n 8\n​\nAsset-backed securities\n​\n \n 8,281.2\n \n 15\n​\n \n 7,865.6\n \n 15\n​\nTotal fixed maturities\n​\n$\n 56,236.5\n \n 100\n%  \n$\n 52,960.3\n \n 100\n%\n​\nWe believe it is desirable to hold residential mortgage-backed pass-through securities due to their credit quality and liquidity as well as portfolio diversification characteristics. Our portfolio is comprised of Government National Mortgage Association, Federal National Mortgage Association and Federal Home Loan Mortgage Corporation pass-through securities. In addition, our residential collateralized mortgage obligation portfolio offers structural features that allow cash flows to be matched to our liabilities.\nWe purchase CMBS to diversify the overall credit risks of the fixed maturities portfolio and to provide attractive returns. The primary risks in holding CMBS are structural and credit risks. Structural risks include the security’s priority in the issuer’s capital structure, the adequacy of and ability to realize proceeds from the collateral and the potential for prepayments. Credit risks involve collateral and issuer/servicer risk where collateral and servicer performance may deteriorate. CMBS are predominantly comprised of large pool securitizations that are diverse by property type, borrower and geographic dispersion. The risks to any CMBS deal are determined by the credit quality of the underlying loans and how those loans perform over time. Another key risk is the vintage of the underlying loans and the state of the markets during a particular vintage.\n149\n\n\nTable of Contents\nSimilar to CMBS, we purchase ABS for diversification and to provide attractive returns. The primary risks in holding ABS are also structural and credit risks, which are similar to those noted above for CMBS. Our ABS portfolio is diversified by type of asset, issuer, and vintage. We actively monitor holdings of ABS to recognize adverse changes in the risk profile of each security. Prepayments in the ABS portfolio are, in general, insensitive to changes in interest rates or are insulated from such changes by call protection features. In the event we are subject to prepayment risk, we monitor the factors that impact the level of prepayment and prepayment speed for those ABS. In addition, we hold a diverse class of securities, which limits our exposure to any one security.\nThe international exposure held in our U.S. operation’s fixed maturities portfolio was 15% of total fixed maturities as of September 30, 2025, and 14% as of December 31, 2024. It is comprised of corporate and foreign government fixed maturities.\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n​\n​\n(in millions)\nEuropean Union\n​\n$\n 2,419.6\n​\n$\n 2,227.9\nUnited Kingdom\n​\n \n 1,629.3\n​\n \n 1,330.5\nAustralia/New Zealand\n​\n​\n 1,513.9\n​\n \n 1,508.6\nLatin America\n​\n \n 1,045.8\n​\n \n 1,031.4\nMiddle East and Africa\n​\n \n 527.9\n​\n \n 490.7\nAsia-Pacific\n​\n \n 475.0\n​\n \n 490.7\nEurope, non-European Union\n​\n \n 351.7\n​\n \n 320.5\nOther\n​\n \n 310.2\n​\n \n 205.4\nTotal\n​\n$\n 8,273.4\n​\n$\n 7,605.7\n​\nInternational fixed maturities exposure is determined by the country of risk of the obligor entity. All international fixed maturities held by our U.S. operations are either denominated in U.S. dollars or have been swapped into U.S. dollar equivalents. Our international investments are analyzed internally by country and industry credit investment professionals. We control concentrations using issuer and country level exposure benchmarks, which are based on the credit quality of the issuer and the country. Our investment policy limits total international fixed maturities investments and we are within those internal limits. Exposure to Canada is not included in our international exposure. As of September 30, 2025 and December 31, 2024, our investments in Canada totaled $932.8 million and $966.1 million, respectively.\nFixed Maturities Credit Concentrations. \nOne aspect of managing credit risk is through industry, issuer and asset class diversification. Our credit concentrations are managed to established limits. The top 10 exposures comprised 5.5% of single-name credit fixed maturity exposures as of September 30, 2025, and 5.4% as of December 31, 2024.\nFixed Maturities Valuation and Credit Quality.\n Valuation techniques for the fixed maturities portfolio vary by security type and the availability of market data. The use of different pricing techniques and their assumptions could produce different financial results. See Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 17, Fair Value Measurements” for further details regarding our pricing methodology. Once prices are determined, they are reviewed by pricing analysts for reasonableness based on asset class and observable market data. Investment analysts who are familiar with specific securities review prices for reasonableness through direct interaction with external sources, review of recent trade activity or use of internal models. All fixed maturities placed on the “watch list” are periodically analyzed by investment analysts. These analysts periodically meet with the Chief Investment Officer and the Portfolio Managers to determine reasonableness of the analysts’ prices. The valuation of bonds for which a credit loss exists and there is no quoted price is typically based on relative value analysis and the present value of the future cash flows expected to be received. Although we believe these values reasonably reflect the fair value of those securities, the key assumptions about risk premiums, performance of underlying collateral (if any) and other market factors involve qualitative and unobservable inputs.\nThe Securities Valuation Office (“SVO”) of the National Association of Insurance Commissioners (“NAIC”) monitors the bond investments of insurers for regulatory capital and reporting purposes and, when required, assigns securities to one of six categories referred to as NAIC designations. Although NAIC designations are not produced to aid the investment decision making process, NAIC designations may serve as a reasonable proxy for Nationally Recognized Statistical Rating Organizations’ (“NRSRO”) credit ratings for certain bonds. For most corporate bonds, NAIC designations 1 and 2 include bonds generally considered investment grade by such rating organizations. Bonds are considered investment grade when rated ‘‘Baa3’’ or higher by Moody’s, or ‘‘BBB-’’ or higher by S&P. NAIC designations 3 through 6 include bonds generally referred to as below investment grade. Bonds are considered below investment grade when rated ‘‘Ba1’’ or lower by Moody’s, or ‘‘BB+’’ or lower by S&P.\n150\n\n\nTable of Contents\nFor loan-backed and structured securities, as defined by the NAIC, the NAIC designation is not always a reasonable indication of an NRSRO rating as described below. For CMBS and non-agency RMBS, Blackrock Solutions undertakes the modeling of those NAIC designations. This may result in a final designation being higher or lower than the NRSRO credit rating.\nThe following table presents our total fixed maturities by NAIC designation as of the periods indicated as well as the percentage, based on fair value, that each designation comprises.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n \n​\n    \n   \n​\n    \n    \n​\n    \nPercent of\n    \n    \n​\n    \n    \n​\n    \nPercent of\n \n​\n​\nAmortized\n​\nCarrying\n​\ncarrying\n​\nAmortized\n​\nCarrying\n​\ncarrying\n \nNAIC designation\n​\ncost\n​\namount\n​\namount\n​\ncost\n​\namount\n​\namount\n \n​\n​\n($ in millions)\n \n1\n​\n$\n 40,138.9\n​\n$\n 38,125.2\n \n 68\n%  \n$\n 38,458.6\n​\n$\n 35,638.3\n \n 67\n%\n2\n​\n \n 15,535.1\n​\n \n 15,123.5\n \n 27\n​\n \n 15,418.8\n​\n \n 14,515.9\n \n 27\n​\n3\n​\n \n 2,635.4\n​\n \n 2,583.0\n \n 4\n​\n \n 2,459.0\n​\n \n 2,389.5\n \n 5\n​\n4\n​\n \n 339.9\n​\n \n 309.1\n \n 1\n​\n \n 369.1\n​\n \n 338.5\n \n 1\n​\n5\n​\n \n 112.4\n​\n \n 94.7\n \n—\n​\n \n 84.1\n​\n \n 68.5\n \n—\n​\n6\n​\n \n 1.9\n​\n \n 1.0\n \n—\n​\n \n 12.6\n​\n \n 9.6\n \n—\n​\nUnallocated portfolio layer method basis adjustment (1)\n​\n​\n (18.9)\n​\n​\n—\n​\n —\n​\n​\n (55.7)\n​\n​\n —\n​\n —\n​\nTotal fixed maturities\n​\n$\n 58,744.7\n​\n$\n 56,236.5\n \n 100\n%  \n$\n 56,746.5\n​\n$\n 52,960.3\n \n 100\n%\n(1)\nAmounts represent unallocated basis adjustments related to fair value hedges utilizing the portfolio layer method.\nFixed maturities included 46 securities with an amortized cost of $550.6 million, gross gains of $13.0 million, gross losses of $0.0 million, valuation allowance of $0.0 million and a carrying amount of $563.6 million as of September 30, 2025, that were still pending a review and assignment of a designation by the SVO or NRSRO ratings to be assigned. Due to the timing of when fixed maturities are purchased, legal documents are filed and the review by the SVO is completed, or NRSRO ratings that have expired or been withdrawn, we will always have securities in our portfolio that are unrated over a reporting period. In these instances, an equivalent designation is assigned based on our fixed income analyst’s assessment.\nCommercial Mortgage-Backed Securities.\n As of September 30, 2025, based on amortized cost, 96% of our CMBS portfolio had an NAIC designation of 1.\nThe following table presents our exposure by credit quality based on NAIC designations for our CMBS portfolio as of the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n​\n    \nAmortized\n    \nCarrying\n    \nAmortized\n    \nCarrying\nNAIC designation\n​\ncost\n​\namount\n​\ncost\n​\namount\n​\n​\n(in millions)\n1\n​\n$\n 4,521.8\n​\n$\n 4,293.2\n​\n$\n 4,621.8\n​\n$\n 4,288.7\n2\n​\n \n 131.4\n​\n \n 114.5\n​\n \n 129.0\n​\n \n 107.8\n3\n​\n \n 55.1\n​\n \n 47.3\n​\n \n 53.6\n​\n \n 44.2\n4\n​\n \n 6.0\n​\n \n 3.9\n​\n \n 9.5\n​\n \n 5.8\n5\n​\n \n 5.0\n​\n \n 4.1\n​\n \n—\n​\n \n—\n6\n​\n \n 0.6\n​\n \n 0.2\n​\n \n 0.6\n​\n \n 0.3\nTotal (1)\n​\n$\n 4,719.9\n​\n$\n 4,463.2\n​\n$\n 4,814.5\n​\n$\n 4,446.8\n(1)\nAmortized cost amounts of our CMBS portfolio exclude unallocated basis adjustments related to fair value hedges utilizing the portfolio layer method. The CMBS portfolio included agency CMBS with a $524.5 million amortized cost and a $509.4 million carrying amount as of September 30, 2025, and a $616.1 million amortized cost and a $589.9 million carrying amount as of December 31, 2024.\n​\n151\n\n\nTable of Contents\nFixed Maturities Watch List.\n We monitor any decline in the credit quality of fixed maturities through the designation of “problem securities,” “potential problem securities” and “restructured securities”. We define problem securities in our fixed maturity portfolio as securities: (i) with principal and/or interest payments in default or where default is perceived to be imminent in the near term, or (ii) issued by a company that went into bankruptcy subsequent to the acquisition of such securities. We define potential problem securities in our fixed maturity portfolio as securities included on an internal “watch list” for which management has concerns as to the ability of the issuer to comply with the present debt payment terms and which may result in the security becoming a problem or being restructured. The decision whether to classify a performing fixed maturity security as a potential problem involves significant subjective judgments by our management as to the likely future industry conditions and developments with respect to the issuer. We define restructured securities in our fixed maturity portfolio as securities where a concession has been granted to the borrower related to the borrower’s financial difficulties that would not have otherwise been considered. We determine that restructures should occur in those instances where greater economic value will be realized under the new terms than through liquidation or other disposition and may involve a change in contractual cash flows. If the present value of the restructured cash flows is less than the current cost of the asset being restructured, a realized capital loss is recorded in net income and a new cost basis is established.\nThe following table presents the total carrying amount of our fixed maturities portfolio, as well as its problem, potential problem and restructured fixed maturities for the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n \n​\n​\n($ in millions)\n \nTotal fixed maturities \n​\n$\n 56,236.5\n​\n$\n 52,960.3\n​\nProblem fixed maturities (1)\n​\n$\n 99.8\n​\n$\n 76.5\n​\nPotential problem fixed maturities\n​\n \n 51.3\n​\n \n 88.3\n​\nTotal problem, potential problem and restructured fixed maturities\n​\n$\n 151.1\n​\n$\n 164.8\n​\nTotal problem, potential problem and restructured fixed maturities as a percent of total fixed maturities\n​\n \n 0.27\n%  \n \n 0.31\n%\n(1)\nThe problem fixed maturities carrying amount is net of the credit loss valuation allowance.\n​\nFixed Maturities Credit Losses.\n \nEach reporting period, a group of individuals including the Chief Investment Officer, our Portfolio Managers, the assigned analysts and representatives from Investment Accounting review all securities to determine whether a credit loss exists. The analysis focuses on each issuer’s ability to service its debts in a timely fashion. Formal documentation of the analysis and our decision is prepared and approved by management. For additional details regarding our process to identify and evaluate securities with credit losses, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 4, Investments” under the caption “Allowance for Credit Loss.”\nWe would not consider a security with unrealized losses to have a decline in value due to credit when it is not our intent to sell the security, it is not more likely than not that we would be required to sell the security before recovery of the amortized cost, which may be maturity, and we expect to recover the amortized cost basis. However, we do sell securities under certain circumstances, such as when we have evidence of a change in the issuer’s creditworthiness, when we anticipate poor relative future performance of securities, when a change in regulatory requirements modifies what constitutes a permissible investment or the maximum level of investments held or when there is an increase in capital requirements or a change in risk weights of debt securities. Sales generate both gains and losses.\nA number of significant risks and uncertainties are inherent in the process of monitoring credit losses and determining the allowance for credit loss. These risks and uncertainties include: (1) the risk that our assessment of an issuer’s ability to meet all of its contractual obligations will change based on changes in the credit characteristics of that issuer, (2) the risk that the economic outlook will be worse than expected or have more of an impact on the issuer than anticipated, (3) the risk that our investment professionals are making decisions based on fraudulent or misstated information in the financial statements provided by issuers and (4) the risk that new information obtained by us or changes in other facts and circumstances lead us to change our intent to not sell the security prior to recovery of its amortized cost. Any of these situations could result in a charge to net income in a future period. \nThe net realized loss relating to the change in the allowance for credit loss and credit related sales of fixed maturities was $24.9 million and $2.8 million for the three months ended September 30, 2025 and 2024, respectively, and $34.9 million and $11.5 million for the nine months ended September 30, 2025 and 2024, respectively.\n152\n\n\nTable of Contents\nFixed Maturities Available-For-Sale\nThe following tables present our fixed maturities available-for-sale by industry category, as of the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\n    \n​\n​\n    \nGross\n    \nGross\n    \nAllowance\n    \n​\n​\n​\n​\nAmortized\n​\nunrealized\n​\nunrealized\n​\nfor credit\n​\nCarrying\n​\n​\ncost\n​\ngains\n​\nlosses\n​\nloss\n​\namount\n​\n​\n(in millions)\nFinance — Banking\n​\n$\n 1,616.0\n​\n$\n 18.0\n​\n$\n 92.5\n​\n$\n—\n​\n$\n 1,541.5\nFinance — Brokerage\n​\n \n 950.1\n​\n \n 13.6\n​\n \n 80.7\n​\n​\n—\n​\n \n 883.0\nFinance — Finance Companies\n​\n \n 343.2\n​\n \n 4.5\n​\n \n 16.6\n​\n​\n—\n​\n \n 331.1\nFinance — Financial Other\n​\n \n 1,627.6\n​\n \n 53.3\n​\n \n 74.2\n​\n​\n 3.2\n​\n \n 1,603.5\nFinance — Insurance\n​\n \n 1,954.3\n​\n \n 44.6\n​\n \n 154.2\n​\n​\n—\n​\n \n 1,844.7\nFinance — Real estate investment trusts (“REITs”)\n​\n \n 1,709.0\n​\n \n 3.8\n​\n \n 107.5\n​\n​\n—\n​\n \n 1,605.3\nIndustrial — Basic Industry\n​\n \n 1,305.1\n​\n \n 37.7\n​\n \n 71.6\n​\n​\n—\n​\n \n 1,271.2\nIndustrial — Capital Goods\n​\n \n 1,502.4\n​\n \n 32.2\n​\n \n 86.4\n​\n​\n—\n​\n \n 1,448.2\nIndustrial — Communications\n​\n \n 2,332.2\n​\n \n 62.7\n​\n \n 129.9\n​\n​\n—\n​\n \n 2,265.0\nIndustrial — Consumer Cyclical\n​\n \n 904.9\n​\n \n 12.6\n​\n \n 64.5\n​\n​\n 3.5\n​\n \n 849.5\nIndustrial — Consumer Non-Cyclical\n​\n \n 3,146.0\n​\n \n 35.5\n​\n \n 179.1\n​\n​\n 2.0\n​\n \n 3,000.4\nIndustrial — Energy \n​\n \n 2,072.0\n​\n \n 73.9\n​\n \n 91.8\n​\n​\n—\n​\n \n 2,054.1\nIndustrial — Other\n​\n \n 1,055.8\n​\n \n 37.2\n​\n \n 16.5\n​\n​\n 0.9\n​\n \n 1,075.6\nIndustrial — Technology\n​\n \n 1,471.0\n​\n \n 20.9\n​\n \n 109.1\n​\n​\n 5.3\n​\n \n 1,377.5\nIndustrial — Transportation\n​\n \n 2,328.5\n​\n \n 48.8\n​\n \n 117.9\n​\n​\n—\n​\n \n 2,259.4\nUtility — Electric\n​\n \n 3,242.9\n​\n \n 51.3\n​\n \n 255.0\n​\n​\n—\n​\n \n 3,039.2\nUtility — Natural Gas\n​\n \n 510.4\n​\n \n 8.7\n​\n \n 46.8\n​\n​\n—\n​\n \n 472.3\nUtility — Other\n​\n \n 404.7\n​\n \n 11.0\n​\n \n 30.7\n​\n​\n—\n​\n \n 385.0\nGovernment guaranteed\n​\n \n 167.6\n​\n \n 10.8\n​\n \n 12.3\n​\n​\n—\n​\n \n 166.1\nTotal corporate securities\n​\n \n 28,643.7\n​\n \n 581.1\n​\n \n 1,737.3\n​\n​\n 14.9\n​\n \n 27,472.6\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nResidential mortgage-backed pass-through securities\n​\n \n 3,795.9\n​\n \n 41.2\n​\n \n 130.1\n​\n​\n—\n​\n \n 3,707.0\nCommercial mortgage-backed securities\n​\n \n 4,645.7\n​\n \n 13.6\n​\n \n 269.2\n​\n​\n 1.1\n​\n \n 4,389.0\nResidential collateralized mortgage obligations\n​\n \n 4,889.8\n​\n \n 35.4\n​\n \n 321.5\n​\n​\n 0.3\n​\n \n 4,603.4\nAsset-backed securities — Home equity (1)\n​\n \n 52.3\n​\n \n 2.8\n​\n \n 2.9\n​\n​\n—\n​\n \n 52.2\nAsset-backed securities — All other\n​\n \n 2,914.6\n​\n \n 28.8\n​\n \n 18.2\n​\n​\n—\n​\n \n 2,925.2\nCollateralized debt obligations — Credit\n​\n \n 16.5\n​\n \n—\n​\n \n 4.4\n​\n​\n—\n​\n \n 12.1\nCollateralized debt obligations — Loans\n​\n \n 5,022.6\n​\n​\n 12.4\n​\n​\n 0.8\n​\n​\n —\n​\n​\n 5,034.2\nTotal mortgage-backed and other asset-backed securities\n​\n \n 21,337.4\n​\n​\n 134.2\n​\n​\n 747.1\n​\n​\n 1.4\n​\n​\n 20,723.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. government and agencies\n​\n \n 1,253.7\n​\n​\n 9.2\n​\n​\n 58.9\n​\n​\n—\n​\n​\n 1,204.0\nStates and political subdivisions\n​\n \n 6,212.0\n​\n​\n 39.3\n​\n​\n 711.0\n​\n​\n—\n​\n​\n 5,540.3\nNon-U.S. governments\n​\n​\n 427.8\n​\n​\n 18.1\n​\n​\n 38.4\n​\n​\n—\n​\n​\n 407.5\nTotal fixed maturities, available-for-sale excluding portfolio layer method basis adjustment\n​\n​\n 57,874.6\n​\n​\n 781.9\n​\n​\n 3,292.7\n​\n​\n 16.3\n​\n​\n 55,347.5\nUnallocated portfolio layer method basis adjustment\n​\n​\n (18.9)\n​\n​\n 18.9\n​\n​\n—\n​\n​\n—\n​\n​\n—\nTotal fixed maturities, available-for-sale\n​\n$\n 57,855.7\n​\n$\n 800.8\n​\n$\n 3,292.7\n​\n$\n 16.3\n​\n$\n 55,347.5\n(1)\nThis exposure is all related to sub-prime mortgage loans.\n​\n153\n\n\nTable of Contents\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\n    \n​\n​\n    \nGross\n    \nGross\n​\nAllowance\n    \n​\n​\n​\n​\nAmortized\n​\nunrealized\n​\nunrealized\n​\nfor credit\n​\nCarrying\n​\n​\ncost\n​\ngains\n​\nlosses\n​\nloss\n​\namount\n​\n​\n(in millions)\nFinance — Banking\n​\n$\n 1,814.7\n​\n$\n 7.2\n​\n$\n 133.8\n​\n$\n—\n​\n$\n 1,688.1\nFinance — Brokerage\n​\n \n 875.2\n​\n \n 8.7\n​\n \n 85.8\n​\n \n—\n​\n \n 798.1\nFinance — Finance Companies\n​\n \n 325.2\n​\n \n 3.0\n​\n \n 21.5\n​\n \n—\n​\n \n 306.7\nFinance — Financial Other\n​\n \n 1,542.7\n​\n \n 13.2\n​\n \n 108.6\n​\n \n—\n​\n \n 1,447.3\nFinance — Insurance\n​\n \n 1,967.1\n​\n \n 22.9\n​\n \n 172.7\n​\n \n—\n​\n \n 1,817.3\nFinance — REITs\n​\n \n 1,809.7\n​\n \n 10.7\n​\n \n 158.4\n​\n \n—\n​\n \n 1,662.0\nIndustrial — Basic Industry\n​\n \n 1,349.6\n​\n \n 16.9\n​\n \n 88.7\n​\n \n—\n​\n \n 1,277.8\nIndustrial — Capital Goods\n​\n \n 1,430.9\n​\n \n 18.4\n​\n \n 113.9\n​\n \n—\n​\n \n 1,335.4\nIndustrial — Communications\n​\n \n 2,304.4\n​\n \n 49.2\n​\n \n 169.9\n​\n \n—\n​\n \n 2,183.7\nIndustrial — Consumer Cyclical\n​\n \n 934.7\n​\n \n 4.6\n​\n \n 69.3\n​\n \n—\n​\n \n 870.0\nIndustrial — Consumer Non-Cyclical\n​\n \n 3,081.7\n​\n \n 17.9\n​\n \n 228.7\n​\n \n 11.9\n​\n \n 2,859.0\nIndustrial — Energy\n​\n \n 2,077.1\n​\n \n 51.7\n​\n \n 129.1\n​\n \n—\n​\n \n 1,999.7\nIndustrial — Other\n​\n \n 914.5\n​\n \n 22.4\n​\n \n 28.5\n​\n \n—\n​\n \n 908.4\nIndustrial — Technology\n​\n \n 1,393.0\n​\n \n 11.8\n​\n \n 135.9\n​\n \n—\n​\n \n 1,268.9\nIndustrial — Transportation\n​\n \n 2,226.8\n​\n \n 32.7\n​\n \n 143.0\n​\n \n—\n​\n \n 2,116.5\nUtility — Electric\n​\n \n 3,173.7\n​\n \n 20.5\n​\n \n 325.9\n​\n \n—\n​\n \n 2,868.3\nUtility — Natural Gas\n​\n \n 449.3\n​\n \n 3.0\n​\n \n 56.9\n​\n \n—\n​\n \n 395.4\nUtility — Other\n​\n \n 247.8\n​\n \n 2.2\n​\n \n 37.0\n​\n \n 4.2\n​\n \n 208.8\nGovernment guaranteed\n​\n \n 167.8\n​\n \n 7.9\n​\n \n 17.0\n​\n \n—\n​\n \n 158.7\nTotal corporate securities\n​\n \n 28,085.9\n​\n \n 324.9\n​\n \n 2,224.6\n​\n \n 16.1\n​\n \n 26,170.1\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nResidential mortgage-backed pass-through securities\n​\n \n 3,870.1\n​\n \n 8.7\n​\n​\n 214.2\n​\n​\n—\n​\n​\n 3,664.6\nCommercial mortgage-backed securities\n​\n \n 4,770.3\n​\n \n 2.8\n​\n​\n 370.5\n​\n​\n—\n​\n​\n 4,402.6\nResidential collateralized mortgage obligations\n​\n \n 4,432.7\n​\n \n 16.5\n​\n​\n 430.0\n​\n​\n 0.2\n​\n​\n 4,019.0\nAsset-backed securities — Home equity (1)\n​\n \n 56.7\n​\n \n 2.4\n​\n​\n 3.8\n​\n​\n—\n​\n​\n 55.3\nAsset-backed securities — All other\n​\n \n 2,696.3\n​\n \n 18.9\n​\n​\n 37.4\n​\n​\n—\n​\n​\n 2,677.8\nCollateralized debt obligations — Credit\n​\n \n 16.5\n​\n \n—\n​\n​\n 4.8\n​\n​\n—\n​\n​\n 11.7\nCollateralized debt obligations — Loans\n​\n \n 4,958.7\n​\n \n 23.3\n​\n​\n 0.6\n​\n​\n—\n​\n​\n 4,981.4\nTotal mortgage-backed and other asset-backed securities\n​\n \n 20,801.3\n​\n \n 72.6\n​\n​\n 1,061.3\n​\n​\n 0.2\n​\n​\n 19,812.4\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. government and agencies\n​\n \n 1,197.6\n​\n \n 0.2\n​\n​\n 95.2\n​\n​\n—\n​\n​\n 1,102.6\nStates and political subdivisions\n​\n \n 5,634.2\n​\n \n 10.3\n​\n​\n 809.2\n​\n​\n—\n​\n​\n 4,835.3\nNon-U.S. governments\n​\n \n 435.4\n​\n \n 12.6\n​\n​\n 55.9\n​\n​\n—\n​\n​\n 392.1\nTotal fixed maturities, available-for-sale excluding portfolio layer method basis adjustment\n​\n​\n 56,154.4\n​\n​\n 420.6\n​\n​\n 4,246.2\n​\n​\n 16.3\n​\n​\n 52,312.5\nUnallocated portfolio layer method basis adjustment\n​\n​\n (55.7)\n​\n​\n 55.7\n​\n​\n—\n​\n​\n—\n​\n​\n—\nTotal fixed maturities, available-for-sale\n​\n$\n 56,098.7\n​\n$\n 476.3\n​\n$\n 4,246.2\n​\n$\n 16.3\n​\n$\n 52,312.5\n(1)\nThis exposure is all related to sub-prime mortgage loans.\nOf the $3,292.7 million in gross unrealized losses as of September 30, 2025, $5.9 million in losses were attributed to securities scheduled to mature in one year or less, $164.1 million attributed to securities scheduled to mature between one to five years, $333.6 million attributed to securities scheduled to mature between five to ten years, $2,042.0 million attributed to securities scheduled to mature after ten years and $747.1 million related to mortgage-backed and other ABS that are not classified by maturity year. As of September 30, 2025, we were in a $2,491.9 million net unrealized loss position as compared to a $3,769.9 million net unrealized loss position as of December 31, 2024. The $1,278.0 million decrease in net unrealized losses for the nine months ended September 30, 2025, can be attributed to a decrease in interest rates, which was partially offset by a widening of credit spreads.\n154\n\n\nTable of Contents\nFixed Maturities Available-For-Sale Unrealized Losses.\n \nWe believe our long-term fixed maturities portfolio is well diversified among industry types and between publicly traded and privately placed securities. Each year, we direct the majority of our net cash inflows into investment grade fixed maturities. Our current policy is to limit the percentage of fixed maturities invested in below investment grade assets to 15%. \nWe invest in privately placed fixed maturities to enhance the overall value of the portfolio, increase diversification and obtain higher yields than are possible with comparable quality public market securities. Generally, private placements provide broader access to management information, strengthened negotiated protective covenants, call protection features and, where applicable, a higher level of collateral. They are, however, generally not freely tradable because of restrictions imposed by U.S. federal and state securities laws and illiquid trading markets.\nThe following table presents our fixed maturities available-for-sale by investment grade and below investment grade as of the periods indicated.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n​\n    \n​\n​\n    \nGross\n    \nGross\n    \nAllowance\n    \n​\n​\n    \n​\n​\n    \nGross\n    \nGross\n    \nAllowance\n    \n​\n​\n​\n​\nAmortized\n​\nunrealized\n​\nunrealized\n​\nfor credit\n​\nCarrying\n​\nAmortized\n​\nunrealized\n​\nunrealized\n​\nfor credit\n​\nCarrying\n​\n​\ncost\n​\ngains\n​\nlosses\n​\nloss\n​\namount\n​\ncost\n​\ngains\n​\nlosses\n​\nloss\n​\namount\n​\n​\n(in millions)\nInvestment grade:\n \n​\n  \n \n​\n  \n \n​\n​\n \n​\n  \n​\n​\n​\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nPublic\n​\n$\n 41,147.3\n​\n$\n 415.3\n​\n$\n 2,549.5\n​\n$\n 1.2\n​\n$\n 39,011.9\n​\n$\n 40,829.3\n​\n$\n 223.4\n​\n$\n 3,319.7\n​\n$\n 0.1\n​\n$\n 37,732.9\nPrivate\n​\n \n 13,964.9\n​\n​\n 337.8\n​\n​\n 627.7\n​\n​\n —\n​\n​\n 13,675.0\n​\n​\n 12,665.7\n​\n​\n 177.5\n​\n​\n 804.3\n​\n​\n—\n​\n​\n 12,038.9\nBelow investment grade:\n​\n \n​\n​\n \n​\n​\n \n​\n​\n​\n​\n​\n \n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPublic\n​\n \n 848.0\n​\n​\n 6.2\n​\n​\n 88.7\n​\n​\n 0.2\n​\n​\n 765.3\n​\n​\n 1,047.1\n​\n​\n 6.5\n​\n​\n 102.4\n​\n​\n 0.1\n​\n​\n 951.1\nPrivate\n​\n \n 1,914.4\n​\n​\n 22.6\n​\n​\n 26.8\n​\n​\n 14.9\n​\n​\n 1,895.3\n​\n​\n 1,612.3\n​\n​\n 13.2\n​\n​\n 19.8\n​\n​\n 16.1\n​\n​\n 1,589.6\nTotal fixed maturities, available-for-sale (1)\n​\n$\n 57,874.6\n​\n$\n 781.9\n​\n$\n 3,292.7\n​\n$\n 16.3\n​\n$\n 55,347.5\n​\n$\n 56,154.4\n​\n$\n 420.6\n​\n$\n 4,246.2\n​\n$\n 16.3\n​\n$\n 52,312.5\n(1)\nExcludes unallocated basis adjustments related to fair value hedges utilizing the portfolio layer method.\nIncluded in the public category carrying amount as of September 30, 2025 and December 31, 2024, were $15,719.4 million and $15,165.7 million, respectively, of securities subject to certain holding periods and resale restrictions pursuant to Rule 144A of the Securities Act of 1933.\n​\nThe following tables present the fair value and the gross unrealized losses on our fixed maturities available-for-sale for which an allowance for credit loss has not been recorded by investment category and length of time that individual securities have been in a continuous unrealized loss position as of September 30, 2025 and December 31, 2024, respectively.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\n​\nLess than\n​\nGreater than or\n​\n​\n​\n​\ntwelve months\n​\nequal to twelve months\n​\nTotal\n​\n    \n​\n​\n    \nGross\n    \n​\n​\n    \nGross\n    \n​\n​\n    \nGross\n​\n​\nFair\n​\nunrealized\n​\nFair\n​\nunrealized\n​\nFair\n​\nunrealized\n​\n​\nvalue\n​\nlosses\n​\nvalue\n​\nlosses\n​\nvalue\n​\nlosses\n​\n​\n(in millions)\nFixed maturities, available-for-sale (1):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. government and agencies\n​\n$\n 372.2\n​\n$\n 5.6\n​\n$\n 381.9\n​\n$\n 53.2\n​\n$\n 754.1\n​\n$\n 58.8\nNon-U.S. governments\n​\n \n 10.5\n​\n \n​\n 0.2\n​\n \n​\n 208.2\n​\n \n​\n 38.2\n​\n \n​\n 218.7\n​\n \n​\n 38.4\nStates and political subdivisions\n​\n \n 546.3\n​\n​\n 15.0\n​\n​\n 3,557.0\n​\n​\n 696.1\n​\n​\n 4,103.3\n​\n​\n 711.1\nCorporate\n​\n​\n 1,298.6\n​\n​\n 44.7\n​\n​\n 13,276.1\n​\n​\n 1,692.6\n​\n​\n 14,574.7\n​\n​\n 1,737.3\nResidential mortgage-backed pass-through securities\n​\n \n 199.4\n​\n​\n 1.2\n​\n​\n 1,212.0\n​\n​\n 128.8\n​\n​\n 1,411.4\n​\n​\n 130.0\nCommercial mortgage-backed securities\n​\n \n 341.8\n​\n​\n 3.1\n​\n​\n 2,955.0\n​\n​\n 264.2\n​\n​\n 3,296.8\n​\n​\n 267.3\nCollateralized debt obligations (2)\n​\n \n 237.4\n​\n​\n 0.8\n​\n​\n 17.4\n​\n​\n 4.3\n​\n​\n 254.8\n​\n​\n 5.1\nOther debt obligations\n​\n \n 535.1\n​\n​\n 5.9\n​\n​\n 2,604.7\n​\n​\n 336.6\n​\n​\n 3,139.8\n​\n​\n 342.5\nTotal fixed maturities, available-for-sale\n​\n$\n 3,541.3\n​\n$\n 76.5\n​\n$\n 24,212.3\n​\n$\n 3,214.0\n​\n$\n 27,753.6\n​\n$\n 3,290.5\n(1)\nFair value and gross unrealized losses are excluded for available-for-sale securities for which an allowance for credit loss has been recorded. Gross unrealized losses exclude unallocated basis adjustments related to fair value hedges utilizing the portfolio layer method.\n(2)\nPrimarily consists of collateralized loan obligations backed by secured corporate loans.\n155\n\n\nTable of Contents\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\n​\nLess than\n​\nGreater than or\n​\n​\n​\n​\ntwelve months\n​\nequal to twelve months\n​\nTotal\n​\n    \n​\n​\n    \nGross\n    \n​\n​\n    \nGross\n    \n​\n​\n    \nGross\n​\n​\nFair\n​\nunrealized\n​\nFair\n​\nunrealized\n​\nFair\n​\nunrealized\n​\n​\nvalue\n​\nlosses\n​\nvalue\n​\nlosses\n​\nvalue\n​\nlosses\n​\n​\n(in millions)\nFixed maturities, available-for-sale (1):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nU.S. government and agencies\n​\n$\n 641.2\n​\n$\n 13.7\n​\n$\n 543.2\n​\n$\n 82.2\n​\n$\n 1,184.4\n​\n$\n 95.9\nNon-U.S. governments\n​\n \n 32.9\n​\n \n​\n 1.3\n​\n \n​\n 207.0\n​\n \n​\n 54.5\n​\n \n​\n 239.9\n​\n \n​\n 55.8\nStates and political subdivisions \n​\n \n 704.7\n​\n​\n 23.8\n​\n​\n 3,552.3\n​\n​\n 785.6\n​\n​\n 4,257.0\n​\n​\n 809.4\nCorporate\n​\n \n 3,289.0\n​\n​\n 65.7\n​\n​\n 14,243.8\n​\n​\n 2,157.9\n​\n​\n 17,532.8\n​\n​\n 2,223.6\nResidential mortgage-backed pass-through securities\n​\n​\n 1,938.4\n​\n​\n 33.1\n​\n​\n 1,211.6\n​\n​\n 181.1\n​\n​\n 3,150.0\n​\n​\n 214.2\nCommercial mortgage-backed securities\n​\n \n 676.9\n​\n​\n 8.1\n​\n​\n 3,157.3\n​\n​\n 362.4\n​\n​\n 3,834.2\n​\n​\n 370.5\nCollateralized debt obligations (2)\n​\n \n 259.5\n​\n​\n 0.3\n​\n​\n 29.8\n​\n​\n 5.0\n​\n​\n 289.3\n​\n​\n 5.3\nOther debt obligations\n​\n \n 1,363.1\n​\n​\n 17.1\n​\n​\n 2,799.2\n​\n​\n 453.0\n​\n​\n 4,162.3\n​\n​\n 470.1\nTotal fixed maturities, available-for-sale\n​\n$\n 8,905.7\n​\n$\n 163.1\n​\n$\n 25,744.2\n​\n$\n 4,081.7\n​\n$\n 34,649.9\n​\n$\n 4,244.8\n(1)\nFair value and gross unrealized losses are excluded for available-for-sale securities for which an allowance for credit loss has been recorded. Gross unrealized losses exclude unallocated basis adjustments related to fair value hedges utilizing the portfolio layer method.\n(2)\nPrimarily consists of collateralized loan obligations backed by secured corporate loans.\nMortgage Loans\nMortgage loans consist of commercial mortgage loans on real estate and residential mortgage loans. For further details about residential mortgage loans, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 4, Investments” under the caption, “Financing Receivables.”\nCommercial Mortgage Loans.\n We generally report commercial mortgage loans on real estate at cost adjusted for amortization of premiums and accrual of discounts, computed using the interest method and net of valuation allowances.\nCommercial mortgage loans play an important role in our investment strategy by:\n●\nproviding strong risk-adjusted relative value in comparison to other investment alternatives;\n●\nenhancing total returns and\n●\nproviding strategic portfolio diversification.\nAs a result, we have focused on constructing a high quality portfolio of mortgages. Our portfolio is generally comprised of mortgages originated with conservative loan-to-value ratios, high debt service coverages and general purpose property types with a strong credit tenancy.\nOur commercial mortgage loan portfolio consists primarily of non-recourse, fixed rate mortgages on fully or near fully leased properties. The mortgage portfolio is comprised primarily of office properties, apartments, well-anchored retail properties and general-purpose industrial properties.\nOur commercial mortgage loan portfolio is diversified by geography and specific collateral property type. Commercial mortgage lending in the state of California accounted for 22% and 24% of our commercial mortgage loan portfolio before valuation allowance as of September 30, 2025 and December 31, 2024, respectively. We are, therefore, exposed to potential losses resulting from the risk of catastrophes, including but not limited to earthquakes, fires, drought, extreme heat, flooding, and tsunamis, that may affect the region. For the years ended September 30, 2025 and December 31, 2024, we did not experience any material losses due to the aforementioned catastrophe risks.\n156\n\n\nTable of Contents\nThe typical borrower in our commercial mortgage loan portfolio is a single purpose entity or single asset entity. As of September 30, 2025 and December 31, 2024, the total number of commercial mortgage loans outstanding were 609 and 620, of which 33% and 35% were for loans with principal balances less than $10.0 million as of September 30, 2025 and December 31, 2024, respectively. The average loan size of our commercial mortgage portfolio was $23.1 million as of both September 30, 2025 and December 31, 2024.\nCommercial Mortgage Loan Credit Monitoring.\n For further details on monitoring and management of our commercial mortgage loan portfolio, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 4, Investments” under the caption, “Financing Receivables Credit Monitoring.”\nWe categorize loans that are 60 days or more delinquent, loans in process of foreclosure and loans with borrowers or credit tenants in bankruptcy that are delinquent as “problem” loans. We categorize loans that are delinquent less than 60 days where the default is expected to be cured and loans with borrowers or credit tenants in bankruptcy that are current as “potential problem” loans. The decision whether to classify a loan delinquent less than 60 days as a potential problem involves significant subjective judgments by management as to the likely future economic conditions and developments with respect to the borrower. We categorize loans for which the original note rate has been reduced below market and loans for which the principal has been reduced as “restructured” loans. We also consider loans that are refinanced more than one year beyond the original maturity or call date at below market rates as restructured.\nWe had seven delinquent problem commercial mortgage loans with a carrying amount of $260.7 million for which we had a valuation allowance of $108.5 million as of September 30, 2025. We also had no potential problem commercial mortgage loans and one restructured problem commercial mortgage loan with a carrying amount of $13.2 million for which we had a valuation allowance of $11.5 million as of September 30, 2025. We had three delinquent problem commercial mortgage loans with a carrying amount of $20.6 million for which we had a valuation allowance of $18.9 million as of December 31, 2024. We also had two potential problem commercial mortgage loans with a carrying amount of $140.5 million for which we had a valuation allowance of $33.0 million and one restructured problem commercial mortgage loan with a carrying amount of $34.1 million for which we had a valuation allowance of $34.1 million as of December 31, 2024.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nSeptember 30, 2025\n    \nDecember 31, 2024\n \n​\n​\n($ in millions)\n \nTotal commercial mortgage loans\n​\n$\n 13,881.5\n​\n$\n 14,196.0\n​\nProblem commercial mortgage loans\n​\n$\n 152.2\n​\n$\n 1.7\n​\nPotential problem commercial mortgage loans\n​\n​\n —\n​\n​\n 107.5\n​\nRestructured problem commercial mortgage loans\n​\n​\n 1.7\n​\n​\n —\n​\nTotal problem, potential problem and restructured commercial mortgage loans\n​\n$\n 153.9\n​\n$\n 109.2\n​\nTotal problem, potential problem and restructured commercial mortgage loans as a percent of total commercial mortgage loans\n​\n \n 1.11\n%\n​\n 0.77\n%\n​\nCommercial Mortgage Loan Valuation Allowance.\n We establish the commercial mortgage loan valuation allowance at levels considered adequate to absorb estimated expected credit losses within the portfolio. For further details on the commercial mortgage loan valuation allowance, see Item 1. “Financial Statements, Notes to Unaudited Condensed Consolidated Financial Statements, Note 4, Investments” under the caption, “Financing Receivables Valuation Allowance.”\nReal Estate\nReal estate consists primarily of commercial equity real estate. As of September 30, 2025 and December 31, 2024, the carrying amount of our equity real estate investment was $2,385.9 million and $2,463.7 million, respectively. Our commercial equity real estate is held in the form of wholly owned real estate, real estate acquired upon foreclosure of commercial mortgage loans and majority owned interests in real estate joint ventures.\nEquity real estate is categorized as either “real estate held for investment” or “real estate held for sale.” The carrying value of real estate held for investment is generally adjusted for impairments whenever events or changes in circumstances indicate the carrying amount of the asset may not be recoverable. Such impairment adjustments are recorded as net realized capital losses in our consolidated results of operations. No such impairment adjustments were recorded for the nine months ended September 30, 2025 or for the year ended December 31, 2024. \n157\n\n\nTable of Contents\nOnce we identify a real estate property to be sold and it is probable that it will be sold, we classify the property as held for sale. We establish a valuation allowance subject to periodic revisions, if necessary, to adjust the carrying value of the property to reflect the lower of its current carrying value or the fair value, less associated selling costs. The valuation allowance did not change for the nine months ended September 30, 2025 or for the year ended December 31, 2024.\nWe use research, both internal and external, to recommend appropriate product and geographic allocations and changes to the equity real estate portfolio. We monitor product, geographic and industry diversification separately and together to determine the most appropriate mix.\nEquity real estate is distributed across geographic regions of the country. As of September 30, 2025, our largest equity real estate portfolio concentration was in the Pacific (45%) region of the United States. By property type, our largest concentrations were in Office (34%) and Industrial (29%) as of September 30, 2025.\nOther Investments\nOur other investments totaled $5,652.5 million as of September 30, 2025, compared to $4,844.7 million as of December 31, 2024. Other investments include interests in unconsolidated entities, which include real estate properties owned jointly with venture partners and operated by the partners; sponsored investment funds; the cash surrender value of company owned and trust owned life insurance; derivative assets and other investments.\nInternational Investment Operations\nOf our invested assets, $6,472.5 million were held by our international operations as of September 30, 2025. Due to the regulatory constraints in each location, each company maintains its own investment policies. As shown in the following table, the major category of international invested assets is fixed maturities. The following table excludes invested assets of the separate accounts.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nDecember 31, 2024\n \n​\n    \nCarrying\n    \nPercent\n    \nCarrying\n    \nPercent\n \n​\n​\namount\n​\nof total\n​\namount\n​\nof total\n \n​\n​\n($ in millions)\n \nFixed maturities\n \n$\n 2,612.8\n \n 40\n%  \n$\n 2,495.0\n \n 41\n%\nEquity securities\n​\n \n 837.1\n \n 13\n​\n \n 747.1\n \n 12\n​\nMortgage loans\n​\n \n 893.6\n​\n 14\n​\n \n 867.2\n \n 14\n​\nReal estate \n​\n \n 1.2\n \n—\n​\n \n 0.8\n \n—\n​\nPolicy loans\n​\n \n 15.1\n \n—\n​\n \n 15.0\n \n—\n​\nOther investments:\n​\n \n​\n \n​\n​\n \n​\n \n​\n​\nDirect financing leases\n​\n \n 537.1\n \n 8\n​\n \n 560.0\n \n 9\n​\nInvestment in unconsolidated operating entities\n​\n \n 1,152.5\n \n 18\n​\n \n 1,048.6\n \n 17\n​\nDerivative assets and other investments\n​\n \n 423.1\n \n 7\n​\n \n 394.2\n \n 7\n​\nTotal invested assets\n​\n \n 6,472.5\n \n 100\n%  \n \n 6,127.9\n \n 100\n%\nCash and cash equivalents\n​\n \n 297.3\n \n  \n​\n \n 248.9\n \n  \n​\nTotal invested assets and cash\n​\n$\n 6,769.8\n \n  \n​\n$\n 6,376.8\n \n  \n​\n​\nRegulations in certain locations require investment in the funds we manage. These required regulatory investments are classified as equity securities within our consolidated statements of financial position, with all mark-to-market changes reflected in net investment income. Our investment is primarily dictated by client activity and all investment performance is retained by us.\n​\n158\n\n\nTable of Contents"
}