{
  "source_file": "pg-20250630.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness.\nThe Procter & Gamble Company (the Company) is a world-leading multinational consumer goods company focused on providing trusted, branded products of superior quality, performance and value to improve the lives of consumers around the world - now and for generations to come. Our products are sold in about 180 countries and territories throughout the world. The Company was incorporated in Ohio in 1905, having first been established as a New Jersey corporation in 1890, and was built from a business founded in Cincinnati in 1837 by William Procter and James Gamble. \nAdditional information required by this item is incorporated herein by reference to Management's Discussion and Analysis (MD&A); and Notes 1 and 2 to our Consolidated Financial Statements. Unless the context indicates otherwise, the terms \"Company,\" \"P&G,\" \"we,\" \"our\" or \"us\" as used herein refer to The Procter & Gamble Company (the registrant) and its subsidiaries. Throughout this Form 10-K, we incorporate by reference information from other documents filed with the Securities and Exchange Commission (SEC).\nThe Company's Annual Report on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K, and amendments thereto, are filed electronically with the SEC. The SEC maintains an internet site that contains these reports at: www.sec.gov. Reports can also be accessed and downloaded through links from our website at: www.pginvestor.com. P&G includes the website link solely as a textual reference and the information on our website is not incorporated by reference into this report. Copies of these reports are also available, without charge, by contacting EQ Shareowner Services, 1100 Centre Pointe Curve, Suite 101, Mendota, MN 55120-4100.\nFinancial Information about Segments\nInformation about our reportable segments can be found in the MD&A and Note 2 to our Consolidated Financial Statements.\nNarrative Description of Business\nBusiness Model\n. Our business model is focused on delivering sustainable value creation by driving balanced top- and bottom-line growth. We create, manufacture, market and distribute a diversified portfolio of daily-use products to delight consumers with irresistible superiority across five key vectors - product performance, packaging, brand communication, retail execution and value. We invest in research and development and consumer insights to invent new categories or products and innovate our existing products, ensuring they meet evolving consumer needs and preferences. We leverage marketing strategies including advertising, promotions and endorsements to drive brand awareness and loyalty among consumers. The Company utilizes various distribution channels, including retail stores, e-commerce platforms and direct-to-consumer platforms to deliver our products. Our business model relies on continued productivity improvements to fuel investments in research and development and marketing and deliver value creation. Our objective is to deliver sustainable and balanced top- and bottom-line growth while serving the needs of all stakeholders — consumers, customers, employees, society and shareowners.\nKey Product Categories\n. Information on key product categories can be found in the MD&A and Note 2 to our Consolidated Financial Statements.\nKey Customers\n. Our customers include mass merchandisers, e-commerce (including social commerce) channels, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores (including airport duty-free stores), high-frequency stores, pharmacies, electronics stores and professional channels. We also sell direct to consumers. Sales to Walmart Inc. and its affiliates represent approximately 16% of our total sales in 2025 and 2024 and 15% in 2023. No other customer represents more than 10% of our total sales. Our top ten customers accounted for 43% of our total net sales in 2025, 42% in 2024 and 40% in 2023. \nSources and Availability of Materials\n. Almost all of the raw and packaging materials used by the Company are purchased from third parties, some of whom are single-source suppliers. We produce certain raw materials, primarily chemicals, for further use in the manufacturing process. In addition, fuel, natural gas and derivative products are important commodities consumed in our manufacturing processes and in the transportation of input materials and finished products. The prices we pay for materials and other commodities are subject to fluctuation including new or increased tariffs. When prices for these items change, we may or may not pass the change to our customers. The Company purchases a substantial variety of other raw and packaging materials, none of which are material to our business taken as a whole.\nTrademarks and Patents\n. We own or have rights to patents and trademarks, which are used in connection with our activity in all businesses. Our patents cover a range of product features, including significant product formulation and processes used to manufacture our products. The trademarks are important to the overall marketing and branding of our products. In part, our success can be attributed to the existence and continued protection of these trademarks and patents.\nCompetitive Condition\n. The markets in which our products are sold are highly competitive. Our products compete against similar products from a broad range of companies, both large and small, both established and new, including well-known global competitors. In many of the markets and industry segments, we compete against other branded products as well as retailers' private-label brands. In this highly competitive setting, we are well positioned in the industry segments and markets in which we operate, often holding a leadership or significant market share position. Our integrated strategy and our focus on driving superiority across product, packaging, brand communication, retail execution and value are key differentiators in the marketplace.\n2        The Procter & Gamble Company\nGovernment Regulation\n. Our Company is subject to a wide variety of laws and regulations across the countries in which we do business. In the United States, many of our products and manufacturing operations are subject to one or more federal or state regulatory agencies, including the U.S. Food and Drug Administration (FDA), the Environmental Protection Agency (EPA), the Occupational Safety and Health Administration (OSHA), the Federal Trade Commission (FTC) and the Consumer Product Safety Commission (CPSC). We are also subject to anti-corruption laws and regulations, such as the U.S. Foreign Corrupt Practices Act, and antitrust and competition laws and regulations that govern our dealings with suppliers, customers, competitors and government officials. \nIn addition, many foreign jurisdictions in which we do business have regulations and regulatory bodies that govern similar aspects of our operations and products, in some cases to an even more significant degree. We are also subject to expanding laws and regulations related to environmental protection and other sustainability-related matters, non-financial reporting and diligence, labor and employment, trade, taxation and privacy and data protection, including the European Union’s General Data Protection Regulation and similar regulations in states within the United States and in countries around the world.\nThe Company has in place compliance programs and internal and external experts to help guide our business in complying with these and other existing laws and regulations that apply to us around the globe; and we have made, and plan to continue making, necessary expenditures for compliance with these laws and regulations. We also expect that our many suppliers, consultants and other third parties working on our behalf share our commitment to compliance, and we have policies and procedures in place to manage these relationships, though they inherently involve a lesser degree of control over operations and governance. We do not expect that the Company’s expenditures for compliance with current government regulations, including current environmental regulations, will have a material effect on our total capital expenditures, earnings or competitive position in fiscal year 2026 as compared to prior periods.\nHuman Capital\n. Our employees are a key source of competitive advantage. Their actions, guided by our Purpose, Values and Principles (PVPs), are critical to the long-term success of our business. We aim to retain our talented employees by offering competitive compensation and benefits, strong career development and a respectful and inclusive culture that provides equal opportunity for all.\nOur Board of Directors, through the Compensation and Leadership Development Committee (C&LD Committee), provides oversight of the Company’s policies and strategy relating to talent, including equality and inclusion, as well as the Company’s compensation principles and practices. The C&LD Committee also evaluates and approves the Company’s compensation plans, policies and programs applicable to our senior executives.\nEmployees\nAs of June 30, 2025, the Company had approximately 109,000 employees, an increase of 2% versus the prior year due to business growth. The total number of employees is an estimate of total Company employees excluding interns, co-ops, contractors and employees of joint ventures. 49% of our employees are in manufacturing roles and 28% of our employees are located in the United States. 42% of our global employees are women and 32% of our U.S. employees identify as multicultural.\nTraining and Development\nWe focus on attracting, developing and retaining the broadest pool of talent available, both from universities and the broader market. We recruit from universities across markets in which we compete and are generally able to select from the top talent. We focus on developing our employees by providing a variety of job experiences, training programs and skill development opportunities. Given our develop-from-within model for staffing most of our senior leadership positions, it is particularly important for us to ensure holistic growth and full engagement of our employees.\nEquality and Inclusion\nAs a global consumer products company, P&G serves consumers around the world with operations in approximately 70 countries. We believe that it is good for business that our workforce is drawn from the best available talent from communities worldwide, with insights about, connectivity to and understanding of all our consumers. Further, a foundational component of P&G's strategy and success has been to foster an inclusive work environment, in which we develop and advance the very best capabilities that all our people have to offer. Globally, we aspire to reflect the diversity of the consumers we serve in the communities where we operate and are committed to creating a superior employee experience for all. Our aspiration is founded on our longstanding values and principles for equal opportunity and compliance with the law.\nCompensation and Benefits\nMarket-competitive compensation and reward programs are critical elements of our employee value equation to attract and retain the best talent. Our total rewards programs are based on the principles of paying for performance, paying competitively versus peer companies that we compete with for talent in the marketplace and focusing on long-term success through a combination of short-term and long-term incentive programs. We also offer competitive benefit programs, including retirement plans and health insurance, in line with local country practices, with flexibility to accommodate the needs of a diverse workforce.\nSustainability\n. Environmental sustainability is integrated into our business strategy. We are focused on designing and manufacturing irresistibly superior products that are more sustainable. We aim to reduce our own environmental footprint and \nThe Procter & Gamble Company        3\nenable our consumers to reduce their footprint without compromising on the performance of the products they use. We develop and license technologies that can be used across industries to improve environmental sustainability at a broader scale. \nCombined, this approach intends to positively impact the total environmental impact of the Company while driving market growth and value creation.\nIn 2021, the Company announced a 2040 net zero ambition. Our Climate Transition Action Plan outlines the Company’s ongoing efforts toward reducing greenhouse gas emissions across scopes 1 and 2 and elements of scope 3. The Company has also declared ambitions towards purchasing renewable electricity for our operations, reducing intensity of virgin petroleum-based plastic in packaging, designing more consumer packaging to be recyclable or reusable, responsible sourcing of key forest-based commodities, improving efficiency of water usage in our operations and driving a global portfolio of water restoration projects in key water basins. While we have met or exceeded some of the goals and are making significant progress against others, scalable infrastructure and cost-effective solutions are not yet available to us to fully deliver against some of our stated ambitions.\nSustainability related disclosures included in this Annual Report, our Proxy Statement and our sustainability reports are informed by standards and guidelines such as the Global Reporting Initiative (GRI) and the Task Force on Climate-related Financial Disclosures (TCFD). The “materiality” thresholds in those standards and guidelines may differ from the concept of “materiality” for purposes of the federal securities laws and disclosures required by the Commission’s rules in this Annual Report. References to our sustainability reports and website are for informational purposes only and neither the sustainability reports nor the other information on our website is incorporated by reference into this Annual Report on Form 10-K. Additional detailed information on our sustainability efforts can be found on our website at https://pginvestor.com/esg.",
  "item7": "Item 7. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nCertain statements in this report, other than purely historical information, including estimates, projections, statements relating to our business plans, objectives and expected operating results, and the assumptions upon which those statements are based, are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements may appear throughout this report, including without limitation, in the following sections: “Management's Discussion and Analysis,” “Risk Factors” and \"Notes 4, 8 and 13 to the Consolidated Financial Statements.\" These forward-looking statements generally are identified by the words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result” and similar expressions. Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause results to differ materially from those expressed or implied in the forward-looking statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether because of new information, future events or otherwise, except to the extent required by law.\n14        The Procter & Gamble Company\nRisks and uncertainties to which our forward-looking statements are subject include, without limitation: (1) the ability to successfully manage global financial risks, including foreign currency fluctuations, changes in global interest rates and rate differentials, currency exchange or pricing controls and tariffs; (2) the ability to successfully manage local, regional or global economic volatility, including reduced market growth rates, and to generate sufficient income and cash flow to allow the Company to effect the expected share repurchases and dividend payments; (3) the ability to successfully manage uncertainties related to changing political and geopolitical conditions and potential implications such as exchange rate fluctuations, market contraction, boycotts, variability and unpredictability in trade relations, sanctions, tariffs or other trade controls; (4) the ability to manage disruptions in credit markets or to our banking partners or changes to our credit rating; (5) the ability to maintain key manufacturing and supply arrangements (including execution of supply chain optimizations and sole supplier and sole manufacturing plant arrangements) and to manage disruption of business due to various factors, including ones outside of our control, such as natural disasters, acts of war or terrorism or disease outbreaks; (6) the ability to successfully manage cost fluctuations and pressures, including prices of commodities and raw materials and costs of labor, transportation, energy, pensions and healthcare; (7) the ability to compete with our local and global competitors in new and existing sales channels, including by successfully responding to competitive factors such as prices, promotional incentives and trade terms for products; (8) the ability to manage and maintain key customer relationships; (9) the ability to protect our reputation and brand equity by successfully managing real or perceived issues, including concerns about safety, quality, ingredients, efficacy, packaging content, supply chain practices, social or environmental practices or similar matters that may arise; (10) the ability to successfully manage the financial, legal, reputational and operational risk associated with third-party relationships, such as our suppliers, contract manufacturers, distributors, contractors and external business partners; (11) the ability to rely on and maintain key company and third-party information and operational technology systems, networks and services and maintain the security and functionality of such systems, networks and services and the data contained therein; (12) the ability to successfully manage the demand, supply and operational challenges, as well as governmental responses or mandates, associated with a disease outbreak, including epidemics, pandemics or similar widespread public health concerns; (13) the ability to stay on the leading edge of innovation, obtain necessary intellectual property protections and successfully respond to changing consumer habits, evolving digital marketing and selling platform requirements and technological advances attained by, and patents granted to, competitors; (14) the ability to successfully manage our ongoing acquisition, divestiture and joint venture activities, in each case to achieve the Company’s overall business strategy and financial objectives, without impacting the delivery of base business objectives; (15) the ability to successfully achieve productivity improvements and cost savings and manage ongoing organizational changes while successfully identifying, developing and retaining key employees, including in key growth markets where the availability of skilled or experienced employees may be limited; (16) the ability to successfully manage current and expanding regulatory and legal requirements and matters (including, without limitation, those laws, regulations, policies and related interpretations involving product liability, product and packaging composition, manufacturing processes, intellectual property, labor and employment, antitrust, privacy, cybersecurity, data protection and data transfers, artificial intelligence, tax, the environment, due diligence, risk oversight, accounting and financial reporting) and to resolve new and pending matters within current estimates; (17) the ability to manage changes in applicable tax laws and regulations; and (18) the ability to continue delivering progress towards our environmental sustainability ambitions. A detailed discussion of risks and uncertainties that could cause actual results and events to differ materially from those projected herein is included in the section titled \"Economic Conditions and Uncertainties\" and the section titled \"Risk Factors\" (Part I, Item 1A) of this Form 10-K.\nPurpose, Approach and Non-GAAP Measures\nThe purpose of Management's Discussion and Analysis (MD&A) is to provide an understanding of Procter & Gamble's financial condition, results of operations and cash flows by focusing on changes in certain key measures from year to year. The MD&A is provided as a supplement to, and should be read in conjunction with, our Consolidated Financial Statements and accompanying Notes. The MD&A is organized in the following sections:\n•\nOverview\n•\nSummary of 2025 Results \n•\nEconomic Conditions and Uncertainties\n•\nResults of Operations\n•\nSegment Results\n•\nCash Flow, Financial Condition and Liquidity\n•\nCritical Accounting Policies and Estimates\n•\nOther Information\nThroughout the MD&A we refer to measures used by management to evaluate performance, including unit volume growth, net sales, net earnings, diluted net earnings per common share (diluted EPS) and operating cash flow. We also refer to a number of financial measures that are not defined under U.S. GAAP, including organic sales growth, Core earnings per share (Core EPS), adjusted free cash flow and adjusted free cash flow productivity. The explanation at the end of the MD&A provides the definition of these non-GAAP measures, details on the use and the derivation of these measures, as well as reconciliations to the most directly comparable U.S. GAAP measure.\nThe Procter & Gamble Company        15\nManagement also uses certain market share and market consumption estimates to evaluate performance relative to competition despite some limitations on the availability and comparability of share and consumption information. References to market share and consumption in the MD&A are based on a combination of vendor-purchased traditional brick-and-mortar and online data in key markets as well as internal estimates. All market share references represent the percentage of sales of our products in dollar terms on a constant currency basis relative to all product sales in the category. The Company measures market shares through the most recent period for which market share data is available, which typically reflects a lag time of one or two months as compared to the end of the reporting period. Management also uses unit volume growth to evaluate drivers of changes in net sales. Organic volume growth reflects year-over-year changes in unit volume excluding the impacts of acquisitions and divestitures and certain one-time items, if applicable, and is used to explain changes in organic sales. In our presentation of data in tables or other charts, certain columns and rows may not add due to rounding.\nOVERVIEW\nP&G is a global leader in the fast-moving consumer goods industry, focused on providing branded consumer packaged goods of superior quality and value to our consumers around the world. Our products are sold in about 180 countries and territories primarily through mass merchandisers, e-commerce (including social commerce) channels, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores (including airport duty-free stores), high-frequency stores, pharmacies, electronics stores and professional channels. We also sell direct to consumers. We have on-the-ground operations in about 70 countries.\nOur market environment is highly competitive with global, regional and local competitors. In many of the markets and industry segments in which we sell our products, we compete against other branded products as well as retailers' private-label brands. Additionally, many of the product segments in which we compete are differentiated by price tiers (referred to as super-premium, premium, mid-tier and value-tier products). We believe we are well positioned in the industry segments and markets in which we operate, often holding a leadership or significant market share position.\nOrganizational Structure\nOur organizational structure is comprised of Sector Business Units (SBUs), Enterprise Markets (EMs), Corporate Functions (CF) and Global Business Services (GBS).\nSector Business Units\nThe Company's product categories are organized into five SBUs and five reportable segments (under U.S. GAAP): Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The SBUs are responsible for global brand strategy, product upgrades and innovation, marketing plans and supply chain. They have direct profit responsibility for markets (referred to as Focus Markets) representing the large majority of the Company's sales and earnings and are also responsible for innovation plans, supply plans and operating frameworks to drive growth and value creation in the remaining markets (referred to as Enterprise Markets). Throughout the MD&A, we reference business results by region, which are comprised of North America, Europe, Greater China, Latin America, Asia Pacific and India, Middle East and Africa (IMEA).\n \n16        The Procter & Gamble Company\nThe following provides additional detail on our reportable segments and the product categories and brand composition within each segment.\nReportable Segments\n% of\nNet Sales \n(1)\n% of Net\nEarnings \n(1)\nProduct Categories (Sub-Categories)\nMajor Brands\nBeauty\n18%\n16%\nHair Care (\nConditioners, Shampoos, Styling Aids, Treatments\n)\nHead & Shoulders, Herbal Essences, Pantene, Rejoice\nPersonal Care \n(2)\n \n(Antiperspirants and Deodorants, Personal Cleansing)\nNative, Old Spice, Safeguard, Secret\nSkin Care \n(2)\n (\nFacial Moisturizers, Cleaners and Treatments\n)\nOlay, SK-II\nGrooming\n8%\n10%\nGrooming (\nAppliances, Female Blades & Razors, Male Blades & Razors, Pre- and Post-Shave Products, Other Grooming\n)\nBraun, Gillette, Venus\nHealth Care\n14%\n15%\nOral Care (\nToothbrushes, Toothpastes, Other Oral Care\n)\nCrest, Oral-B\nPersonal Health Care (\nGastrointestinal, Pain Relief, Rapid Diagnostics, Respiratory, Vitamins/Minerals/Supplements, Other Personal Health Care\n)\nMetamucil, Neurobion, Pepto-Bismol, Vicks\nFabric & Home Care\n36%\n35%\nFabric Care (\nFabric Enhancers, Laundry Additives, Laundry Detergents\n)\nAriel, Downy, Gain, Tide\nHome Care (\nAir Care, Dish Care, P&G Professional, Surface Care\n)\nCascade, Dawn, Fairy, Febreze, Mr. Clean, Swiffer\nBaby, Feminine & Family Care\n24%\n24%\nBaby Care (\nBaby Wipes, Taped Diapers and Pants\n)\nLuvs, Pampers\nFeminine Care (\nAdult Incontinence, Menstrual Care\n)\nAlways, Always Discreet, Tampax\nFamily Care (\nPaper Towels, Tissues, Toilet Paper\n)\nBounty, Charmin, Puffs\n(1)\nPercent of Net sales and Net earnings for the fiscal year ended June 30, 2025 (excluding results held in Corporate).\n(2)\nEffective July 1, 2024, the Beauty reportable business segment separated Skin and Personal Care into individual operating segments, Skin Care and Personal Care. This transition included separation of the management team, strategic decision-making, innovation plans, financial targets, budgets and management reporting.\n \nOrganization Design:\nSector Business Units\nBeauty:\n The beauty categories in which we compete are hair care, personal care and skin care. We are a global market leader in the retail hair care market with about 20% global market share primarily behind our Head & Shoulders and Pantene brands. In personal care, we have the number two market share position with about 20% global market share, primarily behind our Old Spice, Safeguard and Secret brands. In skin care, the Olay brand is one of the top facial skin care brands in the world with about 5% global market share. \nGrooming:\n We are the global market leader in the grooming market, where we hold more than 45% share. Our global blades and razors market share is more than 60%, primarily behind our Gillette and Venus brands. Our appliances, such as electric shavers and intense pulse light devices, are sold primarily under the Braun brand. We hold over 25% of the male electric shavers market.\nHealth Care:\n We compete in oral care and personal health care. In oral care, we are a leader with a nearly 30% global market share behind our Crest and Oral-B brands. In personal health care, we are a global market leader among the categories in which we compete, including respiratory treatments, digestive wellness, sleep aids, vitamins and analgesics behind our Vicks, Metamucil, Pepto-Bismol and Neurobion brands.\nFabric & Home Care:\n This segment is comprised of a variety of fabric care products, including laundry detergents, additives and fabric enhancers; and home care products, including dishwashing liquids and detergents, surface cleaners and air fresheners. In fabric care, we generally have the number one or number two market share position and are the global market leader with over 35% market share in the markets in which we compete, primarily behind our Tide, Ariel and Downy brands. Our global home care market share is more than 30% across the categories in which we compete, primarily behind our Cascade, Dawn, Febreze and Swiffer brands.\nBaby, Feminine & Family Care: \nIn baby care, we are a global market leader and compete mainly in taped diapers, pants and baby wipes, with more than 30% global market share. We generally have the number one or number two market share position in the markets in which we compete, primarily behind our Pampers brand. We are the global market leader in the feminine care category with over 30% global market share. We compete in the menstrual care sub-category primarily behind our Always and \nThe Procter & Gamble Company        17\nTampax brands with over 35% global market share. We also compete in the adult incontinence sub-category behind Always Discreet, with over 15% market share in the markets in which we compete. Our family care business is predominantly a North American business comprised primarily of the Bounty paper towel and Charmin toilet paper brands. North America market shares are over 40% for Bounty and over 25% for Charmin.\nEnterprise Markets\nEnterprise Markets are responsible for sales and profit delivery in specific countries, supported by SBU-agreed innovation and supply chain plans, along with scaled services like planning, distribution and customer management.\nCorporate Functions\nCorporate Functions provides company-level strategy and portfolio analysis, corporate accounting, treasury, tax, external relations, governance, human resources, information technology and legal services.\nGlobal Business Services\nGlobal Business Services provides scaled services in technology, process and data tools to enable the SBUs, the EMs and CF to better serve consumers and customers. The GBS organization is responsible for providing world-class services and solutions that drive value for P&G.\nStrategic Focus\nProcter & Gamble aspires to serve the world’s consumers better than our best competitors in every category and in every country in which we compete and, as a result, deliver total shareholder return in the top one-third of our peer group. Delivering and sustaining leadership levels of shareholder value creation requires balanced top- and bottom-line growth and strong cash generation.\nOur strategy is to deliver and sustain value creation through five integrated choices: a portfolio of daily-use products where performance drives brand choice; superiority across product, package, brand communication, retail execution and value; productivity; constructive disruption of the entire value chain; and a highly efficient and effective organization structure.\nThe Company competes in daily-use product categories where performance plays a significant role in the consumer's choice of brands, and therefore, plays to P&G's strengths. Our focused portfolio of businesses consists of product categories where P&G has strong brands and consumer-meaningful product technologies with typically leadership market positions.\nWithin these categories, our strategic choices are focused on delighting and winning with consumers. Our consumers are at the center of everything we do. We win with consumers by delivering irresistible superiority across five key vectors - product performance, packaging, brand communication, retail execution and value. Winning with consumers around the world and against our best competitors requires superior innovation. Innovation has always been, and continues to be, P&G’s lifeblood. Superior products delivered with superior execution drive market growth, value creation for retailers and build share growth for P&G.\nOngoing productivity improvement is strategic and crucial to delivering our balanced top- and bottom-line growth, cash generation and value creation objectives. Productivity improvement enables investments to strengthen the superiority of our brands via product and packaging innovation, more efficient and effective supply chains, equity and awareness-building brand advertising and other programs and expansion of sales coverage and research and development programs. Productivity improvements also enable us to mitigate and manage through periods of challenging cost environments (including periods of increasing commodity, inflation and negative foreign exchange impacts). Our objective is to drive productivity improvements across all elements of the statement of earnings and balance sheet, including cost of goods sold, marketing and promotional spending, overhead costs and capital spending. \nWe act with agility and are constructively disrupting our highly competitive industry and the way we do business, including how we innovate, communicate and leverage new technologies, to create more value.\nWe are improving operational effectiveness and organizational culture through enhanced clarity of roles and responsibilities, accountability and incentive compensation programs.\nAdditionally, to further strengthen our integrated strategy, we have declared four focus areas. These are 1) leveraging environmental sustainability as an additional driver of superior performing products and packaging innovations, 2) increasing digital acumen to drive consumer and customer preference, reduce cost and enable rapid and efficient decision making, 3) developing next-level supply chain capabilities to enable flexibility, agility, resilience and a new level of productivity and 4) delivering a superior employee value equation for all employees inclusive of all genders, races, ethnicities, sexual orientations, ages and abilities to ensure we continue to attract, retain and develop the best talent to better serve our increasingly diverse consumer base.\nWe believe this strategy is right for the long-term health of the Company and our objective of delivering total shareholder return in the top one-third of our peer group.\nThe Company expects the delivery of the following long-term growth algorithm will result in total shareholder returns in the top third of the competitive, fast-moving consumer goods peer group:\n•\nOrganic sales growth above market growth rates in the categories and geographies in which we compete;\n18        The Procter & Gamble Company\n•\nCore EPS growth of mid-to-high single digits; and\n•\nAdjusted free cash flow productivity of 90% or greater.\nWhile periods of significant macroeconomic pressures may cause short-term results to deviate from the long-term growth algorithm, we intend to maintain a disciplined approach to investing in our business.\nRECENT DEVELOPMENTS\nLimited Market Portfolio Restructuring\nIn the fiscal year ended June 30, 2024, the Company started a limited market portfolio restructuring of its business operations, primarily in certain Enterprise Markets, including Argentina and Nigeria, to address challenging macroeconomic and fiscal conditions. During the period ended September 30, 2024, the Company completed this limited market portfolio restructuring with the substantial liquidation of its operations in Argentina and recorded incremental restructuring charges of $801 million after tax, comprised primarily of non-cash charges for accumulated foreign currency translation losses previously included in Accumulated other comprehensive income/(loss). The total incremental restructuring charges incurred under the program beginning in the three-month period ended December 31, 2023, through the three-month period ended September 30, 2024, were $1.2 billion after tax. Consistent with our historical policies for ongoing restructuring-type activities, resulting charges were funded by and included within Corporate for segment reporting. Restructuring charges above the normal ongoing level of restructuring costs were reported as non-core charges. For more details on the restructuring program, refer to Note 3 to the Consolidated Financial Statements.\nIntangible Asset Impairment\nDuring the fiscal year ended June 30, 2024, the Company recorded a $1.3 billion before tax ($1.0 billion after tax) non-cash impairment charge on an indefinite-lived intangible asset acquired as part of the Company’s 2005 acquisition of The Gillette Company. The impairment charge arose from a reduction in the estimated fair value of the Gillette indefinite-lived intangible asset due to a higher discount rate, weakening of several currencies relative to the U.S. dollar and the impact of the non-core restructuring program described above. This impairment charge adjusted the carrying value of the Gillette indefinite-lived intangible asset to fair value. For a more detailed discussion of the Gillette impairment, refer to Note 4 to the Consolidated Financial Statements.\nFocused Portfolio, Supply Chain and Productivity Plan\nIn June 2025, the Company announced a portfolio and productivity plan to streamline its portfolio and organization to improve its cost structure and competitiveness. The Company expects to incur approximately $1.5 to $2.0 billion in before-tax restructuring costs over a two-year period, including costs incurred as part of this plan and the ongoing plan. The Company expects to incur half of the costs under this plan by the end of fiscal 2026, with the remainder incurred in fiscal 2027.\nThe restructuring activities will be executed across the Sector Business Units as well as the Enterprise Markets, Corporate Functions and Global Business Services. These restructuring activities include a plan for a reduction of up to 7,000 non-manufacturing overhead personnel by the end of fiscal 2027.\nGlad Joint Venture Agreement\nThe Company and The Clorox Company (Clorox) have jointly decided not to renew the Glad joint venture agreement. Under the terms of the agreement, Clorox will purchase the Company’s minority interest in the venture at fair market value as of the agreement termination in January 2026. Subject to market conditions and the parties' negotiations with respect to fair market value, the Company expects to receive cash proceeds of approximately $500 million and record an after-tax gain in the range of $250 to $300 million in the third quarter of the fiscal year ended June 30, 2026.\nSUMMARY OF 2025 RESULTS\nAmounts in millions, except per share amounts\n2025\n2024\nChange vs. Prior Year\nNet sales\n$\n84,284\n \n$\n84,039 \n— \n%\nOperating income\n20,451\n \n18,545 \n10 \n%\nNet earnings\n16,065\n \n14,974 \n7 \n%\nNet earnings attributable to Procter & Gamble\n15,974\n \n14,879 \n7 \n%\nDiluted net earnings per common share\n6.51\n \n6.02 \n8 \n%\nCore earnings per share\n6.83\n \n6.59 \n4 \n%\nCash flow from operating activities\n17,817\n \n19,846 \n(10)\n%\n•\nNet sales increased $245 million to $84.3 billion versus the prior year. Net sales increased low single digits in Health Care and was unchanged in Grooming, Fabric & Home Care and Baby, Feminine & Family Care. Net Sales declined low single digits in Beauty. Organic sales, which exclude the impact of acquisitions and divestitures and foreign exchange, increased 2%. Organic sales increased low single digits in all Sector Business Units.\nThe Procter & Gamble Company        19\n•\nOperating income increased $1.9 billion, or 10%, to $20.5 billion due to a reduction in selling, general and administrative costs (SG&A) in the current year and the non-cash impairment charge of $1.3 billion ($1.0 billion after tax) on the Gillette intangible asset in the prior year.\n•\nNet earnings increased $1.1 billion, or 7%, to $16.1 billion due to the increase in operating income, partially offset by higher restructuring charges in the current year, which includes $801 million after tax related to the substantial liquidation of operations in Argentina.\n•\nNet earnings attributable to Procter & Gamble increased $1.1 billion, or 7%, to $16.0 billion.\n•\nDiluted EPS increased 8% to $6.51 due to the increase in net earnings. Core EPS, which excludes incremental restructuring charges and the prior year Gillette intangible asset charge, increased 4% to $6.83.\n•\nCash flow from operating activities was $17.8 billion.\n◦    Adjusted free cash flow, which is defined as operating cash flow less capital expenditures and excluding payments for the transitional tax resulting from the 2017 U.S. Tax Act, was $14.6 billion.\n◦    Adjusted free cash flow productivity, which is defined as adjusted free cash flow as a percentage of net earnings excluding the non-cash charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina, was 87%.\nECONOMIC CONDITIONS AND UNCERTAINTIES\nGlobal Economic Conditions.\n Our products are sold in numerous countries worldwide, with more than half our sales generated outside the United States. Our largest international markets are Greater China, the United Kingdom, Canada, Japan and Germany and collectively comprised approximately 21% of our net sales in fiscal 2025. As a result, we are exposed to global macroeconomic factors, geopolitical tensions and government policies. We are exposed to various risks due to economic, political and social instabilities, market volatility, natural disasters, debt and credit issues, currency controls, new or increased tariffs, foreign exchange and interest rate changes. These risks can negatively impact our net sales, net earnings and cash flows. For example, we are exposed to risks due to the ongoing war between Russia and Ukraine. Our Russia business accounted for 1% of consolidated net sales, net earnings and net assets as of June 30, 2025. \nForeign Exchange.\n We have significant exposure to exchange rate fluctuations, both due to translation and transaction exposures. Translation exposures arise from measuring income statements of foreign subsidiaries with functional currencies other than the U.S. dollar. Transaction exposures involve impacts from 1) input costs that are denominated in currencies other than the local reporting currency and 2) revaluation of working capital balances denominated in currencies other than the functional currency. We have experienced significant foreign exchange impacts in the past due to the weakening of certain foreign currencies versus the U.S. dollar, which have negatively impacted net sales, net earnings and cash flows. In response to the devaluation of foreign currencies (including those deemed highly inflationary), any lags or inability (due to government restrictions) to implement price increases or the negative impacts of such actions on product consumption may lead to a decline in our net sales, net earnings and cash flows.\nCommodities and Supply Chain. \nOur costs are subject to fluctuations due to changes in commodity and input material prices, transportation costs, inflationary impacts and productivity efforts. We have significant exposures to certain commodities and input materials, in particular certain oil-derived materials like resins and paper-based materials like pulp. Volatility in the market price of commodities and input materials directly affects our costs. Disruptions in manufacturing, supply and distribution operations can lead to increased costs. Legal or regulatory requirements and sustainability initiatives may result in increased costs. We strive to implement, achieve and sustain cost improvement plans, including supply chain optimization and general overhead and workforce optimization. Increased pricing in response to certain inflationary or cost increases may also offset portions of the cost impacts; however, such price increases may negatively impact product consumption. If we are unable to manage cost impacts through pricing actions and consistent productivity improvements, it may negatively impact our net sales, net earnings and cash flows.\nGovernment Policies.\n We are exposed to changes in U.S. and foreign government legislative, regulatory or enforcement policies that can have a negative impact on net sales, net earnings and cash flows. These include tax policy changes (both U.S. and foreign), including those resulting from the current work being led by the OECD/G20 Inclusive Framework focused on \"Addressing the Challenges of the Digitalization of the Economy”. Government controls such as currency exchanges, pricing and import authorizations as well as government policies related to environmental and climate change matters and changes to international trade agreements can also impact our financial performance. \nFor additional information on risk factors that could impact our business results, please refer to Risk Factors in Part I, Item 1A of the Company's Form 10-K for the fiscal year ended June 30, 2025.\nRESULTS OF OPERATIONS\nThe key metrics included in the discussion of our consolidated results of operations include net sales, gross margin, SG&A, operating margin, other non-operating items, income taxes and net earnings. The primary factors driving year-over-year changes in net sales include overall market growth in the categories in which we compete, product initiatives, competitive activities (the level of initiatives, pricing and other activities by competitors), marketing spending, retail executions (both in-\n20        The Procter & Gamble Company\nstore and online) and acquisition and divestiture activity, all of which drive changes in our underlying unit volume, as well as our pricing actions (which can also impact volume), changes in product and geographic mix and foreign exchange impacts on sales outside the U.S.\nOur cost of products sold and SG&A are variable in nature to some extent. Accordingly, our discussion of these operating costs focuses primarily on relative margins rather than the absolute year-over-year changes in total costs. The primary drivers of changes in gross margin are input costs (energy and other commodities), pricing impacts, geographic mix (for example, gross margins in North America are generally higher than the Company average for similar products), product mix (for example, the Beauty segment has higher gross margins than the Company average), foreign exchange rate fluctuations (in situations where certain input costs may be tied to a different functional currency than the underlying sales), the impacts of manufacturing savings projects and reinvestments (for example, product or package improvements) and, to a lesser extent, scale impacts (for costs that are fixed or less variable in nature). The primary components of SG&A are marketing-related costs and non-manufacturing overhead costs. Marketing-related costs are primarily variable in nature, although we may achieve some level of scale benefit over time due to overall growth and other marketing efficiencies. While overhead costs are variable to some extent, we generally experience more scale-related impacts for these costs due to our ability to leverage our organization and systems' infrastructures to support business growth. The main drivers of changes in SG&A as a percentage of net sales are overhead and marketing cost savings, reinvestments (for example, increased advertising), inflation, foreign exchange fluctuations and scale impacts.\nFor a detailed discussion of the fiscal 2024 year-over-year changes, please refer to the MD&A in Part II, Item 7 of the Company's \nForm 10-K for the fiscal year ended June \n30\n, 2024\n.\nNet Sales\nNet sales increased $245 million to $84.3 billion in fiscal 2025 as an increase in net sales driven by pricing of 1% was mostly offset by unfavorable foreign exchange of 1%. Volume and mix were unchanged versus the prior year.\nNet sales increased low single digits in Health Care and was unchanged in Grooming, Fabric & Home Care and Baby, Feminine & Family Care. Net sales decreased low single digits in Beauty. Organic sales, which exclude the impacts of acquisitions and divestitures and foreign exchange, increased 2%. Organic sales increased low single digits in all Sector Business Units.\nOperating Costs\nComparisons as a percentage of net sales; fiscal years ended June 30\n2025\n2024\nBasis Point Change\nGross margin\n51.2\n \n%\n51.4 \n%\n(20) bps\nSelling, general and administrative expense\n26.9\n \n%\n27.7 \n%\n(80) bps\nOperating margin\n24.3\n \n%\n22.1 \n%\n220 bps\nEarnings before income taxes\n23.9\n \n%\n22.3 \n%\n160 bps\nNet earnings\n19.1\n \n%\n17.8 \n%\n130 bps\nNet earnings attributable to Procter & Gamble\n19.0\n \n%\n17.7 \n%\n130 bps\nGross margin decreased 20 basis points to 51.2% of net sales. The decrease in gross margin was due to:\n•\n110 basis points of decline from unfavorable product mix, \n•\n50 basis points of product and packaging investments,\n•\n30 basis points of higher commodity costs,\n•\n20 basis points of unfavorable foreign exchange impacts, \n•\n10 basis points of higher transportation costs and other costs and\n•\n10 basis points of higher costs from tariffs.\nThese decreases were partially offset by: \n•\n180 basis points of manufacturing productivity savings and\n•\n30 basis points of increase due to higher pricing.\nTotal SG&A decreased 3% to $22.7 billion and SG&A as a percentage of net sales decreased 80 basis points to 26.9% due to decreased marketing spending and higher foreign exchange transactional charges in the prior year period.\n•\nMarketing spending as a percentage of net sales decreased 50 basis points due to a decrease in marketing spending and productivity savings.\n•\nOverhead costs as a percentage of net sales decreased 10 basis points as wage inflation headwinds were more than offset by productivity savings, which includes adjustments to variable compensation payouts. \n•\nOther operating expenses as a percentage of net sales decreased 30 basis points driven by favorable foreign exchange impacts.\nProductivity-driven cost savings delivered 140 basis points of benefit to SG&A as a percentage of net sales. \nThe Procter & Gamble Company        21\nOperating income increased $1.9 billion, or 10%, to $20.5 billion and operating margin increased 220 basis points to 24.3% due primarily to the decrease in SG&A and the non-cash impairment charge of $1.3 billion ($1.0 billion after tax) on the Gillette intangible asset in the prior year. For further discussion of the Gillette impairment charge, refer to Note 4 to the Consolidated Financial Statements.\nNon-Operating Items\n•\nInterest expense was $907 million, a decrease of $18 million versus the prior year.\n•\nInterest income was $469 million, a decrease of $4 million versus the prior year.\n•\nOther non-operating income, net decreased $514 million to $154 million primarily driven by the higher non-cash charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina in the current year compared to the same charge due to the substantial liquidation of operations in Nigeria in the prior year. \nIncome Taxes\nThe effective income tax rate for fiscal year ended June 30, 2025, was 20.3%, compared to 20.2% for the fiscal year ended June 30, 2024. The increase in the effective tax rate was primarily driven by the charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina, partially offset by favorable geographic mix impacts.\nNet Earnings\nEarnings before income taxes increased $1.4 billion, or 7%, to $20.2 billion as the increase in operating income, the components of which are discussed above, were partially offset by the non-cash charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina. Net earnings increased $1.1 billion, or 7%, to $16.1 billion due to the increase in earnings before income taxes, partially offset by the effective income tax rate increase discussed above. \nForeign exchange impacts reduced net earnings by approximately $45 million due to a weakening of certain currencies against the U.S. dollar. This impact includes both transactional charges and translational impacts from converting earnings from foreign subsidiaries to U.S. dollars.\nNet earnings attributable to Procter & Gamble increased $1.1 billion, or 7%, to $16.0 billion.\nDiluted EPS increased $0.49, or 8%, to $6.51 due primarily to the increase in net earnings. \nSEGMENT RESULTS\nSegment results reflect information on the same basis we use for internal management reporting and performance evaluation. The results of these reportable segments do not include certain non-business unit specific costs which are reported in Corporate and are included as part of the Corporate discussion. Additionally, we apply blended statutory tax rates in the segments. Eliminations to adjust segment results to arrive at our consolidated effective tax rate are included in Corporate. See Note 2 to the Consolidated Financial Statements for additional information on items included in Corporate.\n \nNet Sales Change Drivers 2025 vs. 2024\n (1)\nVolume with Acquisitions & Divestitures\nVolume Excluding Acquisitions & Divestitures\nForeign Exchange\nPrice\nMix\nOther \n(2)\nNet Sales Growth\nBeauty\n(1)\n%\n1 \n%\n(1)\n%\n2 \n%\n(2)\n%\n— \n%\n(2)\n%\nGrooming\n2 \n%\n2 \n%\n(2)\n%\n2 \n%\n(1)\n%\n(1)\n%\n— \n%\nHealth Care\n(1)\n%\n(1)\n%\n(1)\n%\n1 \n%\n3 \n%\n— \n%\n2 \n%\nFabric & Home Care\n— \n%\n1 \n%\n(1)\n%\n— \n%\n1 \n%\n— \n%\n— \n%\nBaby, Feminine & Family Care\n— \n%\n— \n%\n(1)\n%\n— \n%\n1 \n%\n— \n%\n— \n%\nTOTAL COMPANY\n—\n \n%\n1\n \n%\n(1)\n%\n1\n \n%\n—\n \n%\n—\n \n%\n—\n \n%\n(1)\nNet sales percentage changes are approximations based on quantitative formulas that are consistently applied.\n(2)\nOther includes the sales mix impact from acquisitions and divestitures and rounding impacts necessary to reconcile volume to net sales.\n \nBEAUTY\n($ millions)\n2025\n2024\nChange vs. 2024\nVolume\nN/A\nN/A\n(1)%\nNet sales\n$14,964\n$15,220\n(2)%\nNet earnings\n$2,715\n$2,963\n(8)%\n% of net sales\n18.1%\n19.5%\n(140) bps\n22        The Procter & Gamble Company\nBeauty net sales decreased 2% to $15.0 billion as the negative impact of unfavorable mix of 2% (due primarily to the decline of the super-premium SK-II brand, which has higher than segment-average selling prices), unfavorable foreign exchange of 1% and a unit volume decrease of 1% was partially offset by the positive impact of higher pricing of 2%. Excluding the impact of acquisitions and divestitures and foreign exchange, organic sales increased 1%. Global market share of the Beauty segment decreased 0.3 points. \n•\nHair Care net sales decreased low single digits. Positive impacts of favorable product mix and higher pricing (driven by Latin America, Europe and North America) were partially offset by negative impacts of divestitures, unfavorable foreign exchange and a unit volume decline. The unit volume decline was driven by a decline in Greater China (due to market contraction and the impact of divestitures), partially offset by increases in Latin America and Europe (both due to market growth). Organic sales increased low single digits due to double-digit growth in Latin America, mid-single-digit growth in Europe and low single-digit growth in North America, partially offset by a high single-digit decline in Greater China. Global market share of the hair care category decreased 0.9 points.\n•\nPersonal Care net sales increased high single digits due to a unit volume increase and the positive impacts of higher pricing (driven by North America), partially offset by negative impacts of unfavorable foreign exchange. The unit volume increase was driven by growth in North America (due to innovation), Europe (due to distribution expansion and innovation) and Latin America (due to market growth), partially offset by a decline in Greater China (due to market contraction). Organic sales increased high single digits due to a more than 20% increase in Europe, a high-teens increase in Latin America and a high single-digit increase in North America, partially offset by a mid-single-digit decrease in Greater China. Global market share of the personal care category increased 0.5 points.\n•\nSkin Care net sales decreased high single digits. A unit volume decrease and negative impacts of unfavorable product mix were partially offset by the positive impacts of higher pricing (driven by Greater China and Asia Pacific). The unit volume decrease was driven by a decline in North America (due to distribution losses). Organic sales also decreased high single digits due to mid-teens declines in North America and Asia Pacific and a low single-digit decline in Greater China. Global market share of the skin care category decreased 0.7 points.\nNet earnings decreased 8% to $2.7 billion due to the decrease in net sales and a 140 basis-point decline in net earnings margin. Net earnings margin decreased due to a decrease in gross margin and an increase in SG&A as a percentage of net sales, partially offset by a lower effective tax rate. The gross margin decline of 130 basis points was driven by unfavorable product mix (due to the decline of the super-premium SK-II brand) and higher commodities, partially offset by increased productivity savings. SG&A as a percentage of net sales increased due to an increase in overhead spending and a reduction in net sales. The lower effective tax rate was driven by favorable geographic mix.\nGROOMING\n($ millions)\n2025\n2024\nChange vs. 2024\nVolume\nN/A\nN/A\n2%\nNet sales\n$6,662\n$6,654\n—%\nNet earnings\n$1,577\n$1,477\n7%\n% of net sales\n23.7%\n22.2%\n150 bps\nGrooming net sales were unchanged at $6.7 billion driven by a 2% increase in unit volume and higher pricing of 2% across all regions were offset by the negative impacts of unfavorable foreign exchange of 2%, unfavorable geographic mix of 1% and divestitures of 1%. The unit volume increase was driven by growth in IMEA (due to increased distribution) and Europe (due to market growth), partially offset by a decline in North America (due to retail inventory reduction). Excluding the impact of acquisitions and divestitures and foreign exchange, organic sales increased 2% driven by double-digit growth in Asia Pacific and IMEA and low single-digit growth in Europe, partially offset by a low single-digit decline in North America. Global market share of the Grooming segment decreased 0.1 points.\nNet earnings increased 7% to $1.6 billion due to a 150 basis-point improvement in net earnings margin.\n \nNet earnings margin increased due to an increase in gross margin and a decrease in SG&A as a percentage of net sales. The gross margin increase of 50 basis points was driven by productivity savings, partially offset by unfavorable geographic mix. SG&A as a percentage of net sales decreased due to higher foreign exchange transactional charges in the prior year period. \nHEALTH CARE\n($ millions)\n2025\n2024\nChange vs. 2024\nVolume\nN/A\nN/A\n(1)%\nNet sales\n$11,998\n$11,793\n2%\nNet earnings\n$2,440\n$2,258\n8%\n% of net sales\n20.3%\n19.1%\n120 bps\nHealth Care net sales increased 2% to $12.0 billion driven by favorable geographic mix of 3% (due to growth in North America and Europe, both of which have higher than segment-average selling prices) and higher pricing of 1%, partially offset by \nThe Procter & Gamble Company        23\nunfavorable foreign exchange of 1% and a 1% decrease in unit volume. Excluding the impact of foreign exchange and acquisitions and divestitures, organic sales increased 3%. Global market share of the Health Care segment increased 0.2 points.\n•\nOral Care net sales increased low single digits due to the positive impacts of favorable product mix (due to growth of premium paste and power brushes, which have higher than category-average selling prices), partially offset by a decrease in unit volume and unfavorable foreign exchange. The unit volume decrease was due to a decline in Greater China (due to market contraction and increased competitive activity) and IMEA (due to share losses), partially offset by growth in North America (due to market growth and innovation). Organic sales increased low single digits due to a high single-digit increase in Europe and a low single-digit increase in North America, partially offset by a mid-teens decline in Greater China. Global market share of the oral care category increased 0.1 points.\n•\nPersonal Health Care net sales increased low single digits due to the positive impacts of higher pricing (driven by Latin America and Europe), favorable product mix and a unit volume increase, partially offset by unfavorable foreign exchange. The unit volume increase was due to increases in North America (due to share growth) and Latin America (due to market growth). Organic sales increased mid-single digits due to double-digit growth in Latin America, mid-single-digit growth in Europe and low single-digit growth in North America. Global market share of the personal health care category increased 0.2 points.\nNet earnings increased 8% to $2.4 billion due to the increase in net sales and a 120 basis-point increase in net earnings margin. Net earnings margin increased due to an increase in gross margin and a decrease in SG&A as a percentage of net sales. The gross margin increase of 60 basis points was driven by productivity savings, partially offset by unfavorable geographic mix. SG&A as a percentage of net sales decreased due to decreased marketing spending, partially offset by an increase in overhead spending. \nFABRIC & HOME CARE\n($ millions)\n2025\n2024\nChange vs. 2024\nVolume\nN/A\nN/A\n—%\nNet sales\n$29,617\n$29,495\n—%\nNet earnings\n$5,848\n$5,687\n3%\n% of net sales\n19.7%\n19.3%\n40 bps\nFabric & Home Care net sales were unchanged at $29.6 billion driven by favorable product mix of 1%, offset by unfavorable foreign exchange of 1%. Unit volume was unchanged. Excluding the impact of foreign exchange and acquisitions and divestitures, organic sales increased 2%. Global market share of the Fabric & Home Care segment increased 0.1 points.\n•\nFabric Care net sales were unchanged as favorable premium product mix impacts was offset by unfavorable foreign exchange. Unit volume was unchanged as growth in Europe and North America (both due to innovation) was offset by declines in Greater China and Asia Pacific (both due to market contraction). Organic sales increased low single digits driven by low single-digit increases in North America and Europe, partially offset by a high single-digit decline in IMEA. Global market share of the fabric care category decreased 0.1 points.\n•\nHome Care net sales increased low single digits. Positive impacts of favorable premium product mix and a unit volume increase were partially offset by negative impacts of unfavorable foreign exchange. The unit volume increase was due to growth in North America (due to innovation) and Europe (due to market growth). Organic sales increased low single digits driven by low single-digit growth in North America and Europe. Global market share of the home care category increased 0.4 points.\nNet earnings increased 3% to $5.8 billion due to a 40 basis-point improvement in net earnings margin. Net earnings margin increased due to a decrease in SG&A as a percentage of net sales, partially offset by a decline in gross margin. Gross margin decreased 10 basis points as positive impacts from increased productivity savings were more than offset by negative impacts from unfavorable geographic and product mix and higher commodity costs. SG&A as a percentage of net sales decreased due to a reduction in marketing spending.\nBABY, FEMININE & FAMILY CARE\n($ millions)\n2025\n2024\nChange vs. 2024\nVolume\nN/A\nN/A\n—%\nNet sales\n$20,248\n$20,277\n—%\nNet earnings\n$4,013\n$4,020\n—%\n% of net sales\n19.8%\n19.8%\n0 bps\nBaby, Feminine & Family Care net sales were unchanged at $20.2 billion as favorable product mix of 1% was offset by unfavorable foreign exchange of 1%. Unit volume was unchanged. Excluding the impact of foreign exchange and acquisitions and divestitures, organic sales increased 1%. Global market share of the Baby, Feminine & Family Care segment decreased 0.2 points. \n24        The Procter & Gamble Company\n•\nBaby Care net sales decreased mid-single digits. Negative impacts of a decrease in unit volume, unfavorable foreign exchange and divestitures were partially offset by favorable geographic and product mix (due to a higher proportion of premium-priced diapers). Unit volume decreased across all regions (due to increased competitive activity, market contraction and distribution losses) except unit volume increased in Greater China (due to share gains). Organic sales decreased low single digits driven by declines across all regions except for a double digit increase in Greater China and unchanged organic sales in Latin America. Global market share of the baby care category decreased 0.1 points.\n•\nFeminine Care net sales were unchanged. Positive impacts of favorable geographic mix and higher pricing (driven primarily by North America) were partially offset by negative impacts of a decrease in unit volume and unfavorable foreign exchange. The unit volume decrease was driven primarily by declines in Greater China (due to market contraction and competitive activity) and Latin America (due to share losses). Organic sales increased low single digits driven by a mid-single-digit increase in North America, partially offset by a mid-single-digit decline in Greater China. Market share of the feminine care category decreased 0.2 points.\n•\nNet sales in Family Care, which is predominantly a North American business, increased low single digits driven by a unit volume increase (due to market growth). Organic sales increased mid-single digits. North America's share of the family care category decreased 0.2 points.\nNet earnings was unchanged at $4.0 billion. Net earnings margin was unchanged as a decrease in gross margin was offset by a decrease in SG&A as a percentage of net sales. Gross margin decreased 60 basis points primarily due to higher commodity costs and unfavorable category mix, partially offset by productivity savings. SG&A as a percentage of net sales decreased due to a reduction in marketing spending and higher foreign exchange transactional charges in the prior year period.\nCORPORATE\n($ millions)\n2025\n2024\nChange vs. 2024\nNet sales\n$794\n$601\n32%\nNet earnings/(loss)\n$(527)\n$(1,430)\nN/A\nCorporate includes certain operating and non-operating activities not allocated to specific business segments. These include but are not limited to incidental businesses managed at the corporate level, gains and losses related to certain divested brands or businesses, impacts from various financing and investing activities, certain impacts related to employee benefits, asset impairments and restructuring activities including manufacturing and workforce optimization. Corporate also includes reconciling items to adjust the accounting policies used within the reportable segments to U.S. GAAP. The most notable ongoing reconciling item is income taxes, which adjusts the blended statutory rates that are reflected in the reportable segments to the overall Company effective tax rate.\nCorporate net sales increased 32% to $794 million due to an increase in net sales of incidental businesses managed at the corporate level. Corporate net earnings increased $903 million to a loss of $527 million due primarily to the non-cash impairment charge of $1.3 billion ($1.0 billion after tax) on the Gillette intangible asset in the prior year, partially offset by incremental restructuring charges in the current year, comprised primarily of the non-cash charge of $752 million for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina.\nRestructuring Program to Deliver Productivity and Cost Savings\nThe Company has historically had an ongoing restructuring program with annual spending in the range of $250 to $500 million before tax. In fiscal 2024, the Company announced an incremental limited market portfolio restructuring of its business operations, primarily in certain Enterprise Markets, including Argentina and Nigeria, and during the period ended September 30, 2024, the Company completed the limited market portfolio restructuring. The total incremental restructuring charges incurred under the program were $1.2 billion after tax.\nIn fiscal 2025, the Company incurred before tax restructuring costs of $1.1 billion, which include the non-cash charge of $752 million for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina. Restructuring accruals of $189 million as of June 30, 2025, are classified as current liabilities. Excluding the non-cash charges of foreign currency translation losses for Argentina, approximately 74% of the restructuring charges incurred in fiscal 2025 either have been or will be settled with cash. Consistent with our policies for restructuring-type activities, the resulting charges are funded by and included within Corporate for segment reporting.\nSavings generated from the Company's restructuring program are difficult to estimate, given the nature of the activities, the timing of the execution and the degree of reinvestment. In addition to our restructuring programs, we have additional ongoing savings efforts in our supply chain, marketing and overhead areas that yield additional benefits to our operating margins. Refer to Note 3 to the Consolidated Financial Statements for more details on the restructuring program.\nCASH FLOW, FINANCIAL CONDITION AND LIQUIDITY\nWe believe our financial condition continues to be of high quality, as evidenced by our ability to generate substantial cash from operations and to readily access capital markets at competitive rates.\nOperating cash flow provides the primary source of cash to fund operating needs and capital expenditures. Excess operating cash is used first to fund shareholder dividends. Other discretionary uses include share repurchases and acquisitions to \nThe Procter & Gamble Company        25\ncomplement our portfolio of businesses, brands and geographies. As necessary, we may supplement operating cash flow with debt to fund these activities. The overall cash position of the Company reflects our strong business results and a global cash management strategy that takes into account liquidity management, economic factors and tax considerations.\nCash Flow Analysis\n($ millions)\n2025\n2024\nNet cash provided by operating activities\n$\n17,817\n \n$\n19,846 \nNet cash used in investing activities\n(3,818)\n(3,504)\nNet cash used in financing activities\n(14,036)\n(14,855)\nAdjusted Free Cash Flow\n14,606\n \n16,946 \nAdjusted Free Cash Flow Productivity\n87\n \n%\n105 \n%\nOperating Cash Flow\nOperating cash flow was $17.8 billion in 2025, a 10% decrease versus the prior year. Net earnings, adjusted for certain non-cash items (depreciation and amortization, share-based compensation expense, deferred income taxes and loss on sale of assets) generated approximately $20.3 billion of operating cash flow. Working capital and other impacts consumed $2.5 billion of cash in the period. Accounts receivable decreased slightly resulting in $45 million of cash flow help. Days sales outstanding were flat. Total inventories increased, consuming $324 million of cash, driven primarily by increased safety stock levels and higher commodity costs. \nThese increased input costs and higher inventory levels resulted in a four-day increase in days on hand\n. Accounts payable decreased, resulting in $542 million use of cash, primarily driven by marketing and overhead activities. Other impacts reduced cash by $1.7 billion primarily driven by postretirement benefit impacts of $806, the payment of the transitional tax related to the 2017 U.S. Tax Act of $562 and a reduction in compensation and marketing accruals. \nAdjusted Free Cash Flow. \nWe view adjusted free cash flow as an important non-GAAP measure because it is a factor impacting the amount of cash available for dividends, share repurchases, acquisitions and other discretionary investments. It is defined as operating cash flow less capital expenditures and excluding payments for the transitional tax resulting from the 2017 U.S. Tax Act. Adjusted free cash flow is one of the measures used to evaluate senior management and determine their at-risk compensation. \nAdjusted free cash flow was $14.6 billion in 2025, a decrease of 14% versus the prior year. The decrease was primarily driven by the decrease in operating cash flows as discussed above. Adjusted free cash flow productivity, defined as the ratio of adjusted free cash flow to net earnings excluding the non-cash charge for accumulated foreign currency translation losses due to the divestiture of operations in Argentina, was 87% in 2025. \nInvesting Cash Flow\nNet investing activities used $3.8 billion of cash in 2025, primarily due to capital expenditures.\nFinancing Cash Flow\nNet financing activities used $14.0 billion of cash in 2025, mainly due to dividends to shareholders and treasury stock purchases, partially offset by the impact of stock options and other and a net debt increase.\nLiquidity\nAt June 30, 2025, our current liabilities exceeded current assets by $10.7 billion, largely due to accounts payable, short-term borrowings and debt due within one year. We anticipate being able to support our short-term liquidity and operating needs largely through cash generated from operations. The Company regularly assesses its cash needs and the available sources to fund these needs. As of June 30, 2025, the Company had $8.1 billion of cash and cash equivalents related to foreign subsidiaries, primarily in various European and Asian countries. We did not have material cash and cash equivalents related to any country subject to exchange controls that significantly restrict our ability to access or repatriate the funds. Under current law, we do not expect restrictions or taxes on repatriation of cash held outside of the U.S. to have a material effect on our overall liquidity, financial condition or the results of operations for the foreseeable future. \nWe utilize short- and long-term debt to fund discretionary items, such as acquisitions and share repurchases. We have strong short- and long-term debt ratings, which have enabled and should continue to enable us to refinance our debt as it becomes due in commercial paper and bond markets. In addition, we have agreements with a diverse group of financial institutions that, if needed, should provide sufficient funding to meet short-term financing requirements.\nOn June 30, 2025, our short-term credit ratings were P-1 (Moody's) and A-1+ (Standard & Poor's), while our long-term credit ratings were Aa3 (Moody's) and AA- (Standard & Poor's), all with a stable outlook.\nWe maintain bank credit facilities to support our ongoing commercial paper program. The current facility is an $8.0 billion facility split between a $3.2 billion five-year facility and a $4.8 billion 364-day facility, which expire in October 2029 and October 2025, respectively. Both facilities can be extended for certain periods of time as specified in the terms of the credit agreement. These facilities are currently undrawn and we anticipate that they will remain undrawn. These credit facilities do not have cross-default or ratings triggers, nor do they have material adverse events clauses, except at the time of signing. In addition \n26        The Procter & Gamble Company\nto these credit facilities, we have an automatically effective registration statement on Form S-3 filed with the SEC that is available for registered offerings of short- or long-term debt securities. For additional details on debt, see Note 10 to the Consolidated Financial Statements.\nGuarantees and Other Off-Balance Sheet Arrangements\nWe do not have guarantees or other off-balance sheet financing arrangements, including variable interest entities, which we believe could have a material impact on our financial condition or liquidity.\nContractual Commitments\nThe following table provides information on the amount and payable date of our contractual commitments as of June 30, 2025.\n($ millions)\nTotal\nLess Than 1 Year\n1-3 Years\n3-5 Years\nAfter 5 Years\nRECORDED LIABILITIES\nTotal debt\n$\n34,852\n \n$\n9,553 \n$\n6,801 \n$\n6,150 \n$\n12,348 \nLeases\n1,079\n \n255 \n386 \n240 \n198 \n2017 U.S. Tax Act transitional charge\n (1)\n688\n \n688 \n— \n— \n— \nOTHER\nInterest payments relating to long-term debt\n5,605\n \n878 \n1,370 \n936 \n2,421 \nMinimum pension funding \n(2)\n617\n \n200 \n417 \n— \n— \nPurchase obligations \n(3)\n2,618\n \n893 \n950 \n378 \n397 \nTOTAL CONTRACTUAL COMMITMENTS\n$\n45,459\n \n$\n12,467 \n$\n9,924 \n$\n7,704 \n$\n15,364 \n(1)\nRepresents the U.S. federal tax liability associated with the repatriation provisions of the 2017 U.S. Tax Act. \n(2)\nRepresents future pension payments to comply with local funding requirements. These future pension payments assume the Company continues to meet its future statutory funding requirements. Considering the current economic environment in which the Company operates, the Company believes its cash flows are adequate to meet the future statutory funding requirements. The projected payments beyond fiscal year 2028 are not currently determinable.\n(3)\nPrimarily reflects future contractual payments under various take-or-pay arrangements entered into as part of the normal course of business. Commitments made under take-or-pay obligations represent minimum commitments with suppliers and are in line with expected usage. This includes service contracts for information technology, human resources management and facilities management activities that have been outsourced. While the amounts listed represent contractual obligations, we do not believe it is likely that the full contractual amount would be paid if the underlying contracts were canceled prior to maturity. In such cases, we generally are able to negotiate new contracts or cancellation penalties, resulting in a reduced payment. The amounts do not include other contractual purchase obligations that are not take-or-pay arrangements. Such contractual purchase obligations are primarily purchase orders at fair value that are part of normal operations and are reflected in historical operating cash flow trends. We do not believe such purchase obligations will adversely affect our liquidity position. \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing our financial statements in accordance with U.S. GAAP, there are certain accounting policies that may require a choice between acceptable accounting methods or may require substantial judgment or estimation in their application. These include revenue recognition, income taxes, certain employee benefits and goodwill and intangible assets. We believe these accounting policies, and others set forth in Note 1 to the Consolidated Financial Statements, should be reviewed as they are integral to understanding the results of operations and financial condition of the Company.\nThe Company has discussed the selection of critical accounting policies and the effect of estimates with the Audit Committee of the Company's Board of Directors.\nRevenue Recognition\nOur revenue is primarily generated from the sale of finished product to customers. Those sales predominantly contain a single performance obligation and revenue is recognized at a single point in time when ownership, risks and rewards transfer, which can be on the date of shipment or the date of receipt by the customer. Trade promotions, consisting primarily of customer pricing allowances, in-store merchandising funds, advertising and other promotional activities and consumer coupons, are offered through various programs to customers and consumers. Sales are recorded net of trade promotion spending, which is recognized as incurred at the time of the sale. Amounts accrued for trade promotions at the end of a period require estimation, based on contractual terms, sales volumes and historical utilization and redemption rates. The actual amounts paid may be different from such estimates. These differences, which have historically not been significant, are recognized as a change in management estimate in a subsequent period.\nIncome Taxes\nOur annual tax rate is determined based on our income, statutory tax rates and the tax impacts of items treated differently for tax purposes than for financial reporting purposes. Also inherent in determining our annual tax rate are judgments and assumptions regarding the recoverability of certain deferred tax balances, primarily net operating loss and other carryforwards, and our ability to uphold certain tax positions.\nThe Procter & Gamble Company        27\nRealization of net operating losses and other carryforwards is dependent upon generating sufficient taxable income in the appropriate jurisdiction prior to the expiration of the carryforward periods, which involves business plans, planning opportunities and expectations about future outcomes. Although realization is not assured, management believes it is more likely than not that our deferred tax assets, net of valuation allowances, will be realized.\nWe operate in multiple jurisdictions with complex tax policy and regulatory environments. In certain of these jurisdictions, we may take tax positions that management believes are supportable but are potentially subject to successful challenge by the applicable taxing authority. These interpretational differences with the respective governmental taxing authorities can be impacted by the local economic and fiscal environment.\nA core operating principle is that our tax structure is based on our business operating model, such that profits are earned in line with the business substance and functions of the various legal entities in the jurisdictions where those functions are performed. However, because of the complexity of transfer pricing concepts, we may have income tax uncertainty related to the determination of intercompany transfer prices for our various cross-border transactions. We have obtained and continue to prioritize the strategy of seeking advance rulings with tax authorities to reduce this uncertainty. We estimate that our current portfolio of advance rulings reduces this uncertainty with respect to over 70% of our global earnings. We evaluate our tax positions and establish liabilities in accordance with the applicable accounting guidance on uncertainty in income taxes. We review these tax uncertainties considering changing facts and circumstances, such as the progress of tax audits, and adjust them accordingly. We have several audits in process in various jurisdictions. Although the resolution of these tax positions is uncertain, based on currently available information, we believe that the ultimate outcomes will not have a material adverse effect on our financial position, results of operations or cash flows.\nBecause there are several estimates and assumptions inherent in calculating the various components of our tax provision, certain future events such as changes in tax legislation, geographic mix of earnings, completion of tax audits or earnings repatriation plans could have an impact on those estimates and our effective tax rate. See Note 5 to the Consolidated Financial Statements for additional details on the Company's income taxes.\nEmployee Benefits\nWe sponsor various postretirement benefits throughout the world. These include pension plans, both defined contribution plans and defined benefit plans, and other postretirement benefit (OPRB) plans consisting primarily of health care and life insurance for retirees. For accounting purposes, the defined benefit pension and OPRB plans require assumptions to estimate the net projected and accumulated benefit obligations, including the following variables: discount rate; expected salary increases; certain employee-related factors, such as turnover, retirement age and mortality; expected return on assets; and health care cost trend rates. These and other assumptions affect the annual expense and net obligations recognized for the underlying plans. Our assumptions reflect our historical experiences and management's best judgment regarding future expectations. As permitted by U.S. GAAP, the net amount by which actual results differ from our assumptions is deferred. If this net deferred amount exceeds 10% of the greater of plan assets or liabilities, a portion of the deferred amount is included in expense for the following year. The cost or benefit of plan changes, such as increasing or decreasing benefits for prior employee service (prior service cost), is deferred and included in expense on a straight-line basis over the average remaining service period of the employees expected to receive benefits.\nThe expected return on plan assets assumption impacts our defined benefit expense since many of our defined benefit pension plans and our primary OPRB plan are partially funded. The process for setting the expected rates of return is described in Note 8 to the Consolidated Financial Statements. For 2025, the average return on assets assumptions for pension plan assets and OPRB assets was 6.0% and 8.5%, respectively. A change in the rate of return of 100 basis points for both pension and OPRB assets would impact annual after-tax benefit/expense by approximately $155 million.\nSince pension and OPRB liabilities are measured on a discounted basis, the discount rate impacts our plan obligations and expenses. Discount rates used for our U.S. defined benefit pension and OPRB plans are based on a yield curve constructed from a portfolio of high-quality bonds for which the timing and amount of cash outflows approximate the estimated payouts of the plan. For our international plans, the discount rates are set by benchmarking against investment grade corporate bonds rated AA or better. The average discount rate on the defined benefit pension plans of 4.2% represents a weighted average of local rates in countries where such plans exist. A 100 basis-point change in the discount rate would impact annual after-tax benefit expense by approximately $85 million. The average discount rate on the OPRB plan of 5.9% reflects the higher interest rates generally applicable in the U.S., which is where most of the plan participants receive benefits. A 100 basis-point change in the discount rate would impact annual after-tax OPRB expense by approximately $20 million. See Note 8 to the Consolidated Financial Statements for additional details on our defined benefit pension and OPRB plans.\nGoodwill and Intangible Assets\nSignificant judgment is required to estimate the fair value of our goodwill reporting units and intangible assets. Accordingly, we typically obtain the assistance of third-party valuation specialists for those goodwill reporting units and intangible assets that do not have fair values that significantly exceed their underlying carrying values. Determining the useful life of an intangible asset also requires judgment. Certain brand intangible assets are expected to have indefinite lives based on their history and our plans to continue to support and build the acquired brands. Other acquired intangible assets (e.g., certain brands, customer relationships, patents and technologies) are expected to have determinable useful lives. Our assessment as to brands that have \n28        The Procter & Gamble Company\nan indefinite life and those that have a determinable life is based on a number of factors including competitive environment, market share, brand history, underlying product life cycles, operating plans and the macroeconomic environment of the countries in which the brands are sold. Determinable-lived intangible assets are amortized to expense over their estimated lives. An impairment assessment for determinable-lived intangibles is only required when an event or change in circumstances indicates that the carrying amount of the asset may not be recoverable. \nGoodwill and indefinite-lived intangible assets are not amortized but are tested at least annually for impairment. We use the income method to estimate the fair value of these assets, which is based on forecasts of the expected future cash flows attributable to the respective assets. When appropriate, the market approach, which leverages comparable company revenue and earnings multiples, is weighted with the income approach to estimate fair value. If the resulting fair value is less than the asset's carrying value, that difference represents an impairment. Our annual impairment testing for goodwill and indefinite-lived intangible assets occurs during the three months ended December 31. Other than our Gillette indefinite-lived intangible asset, our goodwill reporting units and our indefinite-lived intangible assets have fair values that significantly exceed their underlying carrying values. \nAs previously disclosed, we recorded a non-cash impairment charge of $1.3 billion ($1.0 billion after tax) on the Gillette indefinite-lived intangible asset during the fiscal year ended June 30, 2024. The impairment charge arose due to a higher discount rate, weakening of several currencies relative to the U.S. dollar and the impact of a new restructuring program focused primarily in certain Enterprise Markets, including Argentina and Nigeria. Following the impairment charge, the carrying value of the Gillette indefinite-lived intangible asset was equivalent to the estimated fair value as of December 31, 2023.\nBased on our impairment testing performed during the three months ended December 31, 2024, the Gillette indefinite-lived intangible asset's fair value exceeds its carrying value by greater than 10%. As of June 30, 2025, the carrying value of the Gillette indefinite-lived intangible asset was $12.8 billion. Adverse changes in the business or in the macroeconomic environment including foreign currency devaluation, increasing global inflation, or market contraction from an economic recession, could reduce the underlying cash flows used to estimate the fair value of the Gillette indefinite-lived intangible asset and trigger a further impairment charge. \nThe most significant assumptions utilized in the determination of the estimated fair value of the Gillette indefinite-lived intangible asset are the net sales growth rates (including residual growth rates), discount rate and royalty rates. \nNet sales growth rates could be negatively impacted by reductions or changes in demand for our Gillette products, which may be caused by, among other things: changes in the use and frequency of grooming products, shifts in demand away from one or more of our higher priced products to lower priced products or potential supply chain constraints. In addition, relative global and country/regional macroeconomic factors could result in additional and prolonged devaluation of other countries’ currencies relative to the U.S. dollar. The residual growth rates represent the expected rate at which the Gillette brand is expected to grow beyond the shorter-term business planning period. The residual growth rates utilized in our fair value estimates are consistent with the brand operating plans and approximates expected long-term category market growth rates. The residual growth rates depend on overall market growth rates, the competitive environment, inflation, relative currency exchange rates and business activities that impact market share. As a result, the residual growth rates could be adversely impacted by a sustained deceleration in category growth, grooming habit changes, devaluation of currencies against the U.S. dollar or an increased competitive environment. \nThe discount rate is based on a weighted average cost of capital that is likely to be expected by a market participant, including consideration of both debt and equity components of the capital structure. Our discount rate may be impacted by adverse changes in the macroeconomic environment, volatility in the equity and debt markets or other country specific factors, such as further devaluation of currencies against the U.S. dollar. Spot rates as of the fair value measurement date are utilized in our fair value estimates for cash flows outside the U.S. \nThe royalty rate used to determine the estimated fair value for the Gillette indefinite-lived intangible asset is driven by historical and estimated future profitability of the underlying Gillette business. The royalty rate may be impacted by significant adverse changes in long-term operating margins. \nWe performed a sensitivity analysis for the Gillette indefinite-lived intangible asset as part of our annual impairment testing during the three months ended December 31, 2024, utilizing reasonably possible changes in the assumptions for the discount rate, the short-term and residual growth rates and the royalty rates to demonstrate the potential impacts to the estimated fair values. The table below provides, in isolation, the estimated fair value impacts related to a 25 basis-point increase in the discount rate, a 25 basis-point decrease in our shorter-term and residual growth rates, or a 50 basis-point decrease in our royalty rates.\nApproximate Percent Change in Estimated Fair Value\n+25 bps Discount Rate\n-25 bps\nGrowth Rate\n-50 bps Royalty Rate\nGillette indefinite-lived intangible asset\n(5)%\n(5)%\n(4)%\nSee Note 4 to the Consolidated Financial Statements for additional discussion on goodwill and intangible assets.\nThe Procter & Gamble Company        29\nNew Accounting Pronouncements\nRefer to Note 1 to the Consolidated Financial Statements for recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted as of June 30, 2025.\nOTHER INFORMATION\nHedging and Derivative Financial Instruments\nAs a multinational company with diverse product offerings, we are exposed to market risks, such as changes in interest rates, currency exchange rates and commodity prices. We evaluate exposures on a centralized basis to take advantage of natural exposure correlation and netting. We leverage the Company's diversified portfolio of exposures as a natural hedge and prioritize these operational hedging activities over financial market instruments. To the extent we choose to further manage volatility within our financing operations, as discussed below, we enter into various financial transactions which we account for using the applicable accounting guidance for derivative instruments and hedging activities. These financial transactions are governed by our policies covering acceptable counterparty exposure, instrument types and other hedging practices. See Note 9 to the Consolidated Financial Statements for a discussion of our accounting policies for derivative instruments.\nDerivative positions are monitored using techniques including market valuation, sensitivity analysis and value-at-risk modeling. The tests for interest rate, currency rate and commodity derivative positions discussed below are based on the RiskManager™ value-at-risk model using a one-year horizon and a 95% confidence level. The model incorporates the impact of correlation (the degree to which exposures move together over time) and diversification (from holding multiple currency, commodity and interest rate instruments) and assumes that financial returns are normally distributed. Estimates of volatility and correlations of market factors are drawn from the RiskMetrics™ dataset as of June 30, 2025. In cases where data is unavailable in RiskMetrics™, a reasonable proxy is included.\nOur market risk exposures relative to interest rates, currency rates and commodity prices, as discussed below, have not changed materially versus the previous reporting period. In addition, we are not aware of any facts or circumstances that would significantly impact such exposures in the near term.\nInterest Rate Exposure.\n We are exposed to interest rate movements due to our long and short-term borrowing program. Interest rate swaps are used to manage exposures to interest rates on underlying debt obligations. Certain interest rate swaps denominated in foreign currencies are designated to hedge exposures to currency exchange rate movements on our investments in foreign operations. These currency interest rate swaps are designated as hedges of the Company's foreign net investments.\nBased on our interest rate exposure as of and during the fiscal year ended June 30, 2025, including derivative and other instruments sensitive to interest rates, we believe a near-term change in interest rates, at a 95% confidence level based on historical interest rate movements, would not materially affect our financial statements.\nCurrency Rate Exposure. \nBecause we manufacture and sell products and finance operations in a number of countries throughout the world, we are exposed to movements in currency exchange rates. We leverage the Company’s diversified portfolio of exposures as a natural hedge. Corporate policy prescribes the range of allowable hedging activity. To manage the exchange rate risk associated with the financing of our operations, we primarily use forward contracts and currency swaps with maturities of less than 18 months. \nBased on our currency rate exposure on derivative and other instruments as of and during the fiscal year ended June 30, 2025, we believe, at a 95% confidence level based on historical currency rate movements, the impact on such instruments of a near-term change in currency rates would not materially affect our financial statements.\nCommodity Price Exposure. \nWe use raw materials that are subject to price volatility caused by weather, supply conditions, political and economic variables and other unpredictable factors. We may use futures, options and swap contracts to manage the volatility related to the above exposures. During the fiscal years ended June 30, 2025 and 2024, we did not have any financial commodity hedging activity. \nMeasures Not Defined By U.S. GAAP\nIn accordance with the SEC's Regulation S-K Item 10(e), the following provides definitions of non-GAAP measures and a reconciliation to the most closely related GAAP measure. We believe that these measures provide useful perspective on underlying business trends (i.e., trends excluding non-recurring or unusual items) and results and provide a supplemental measure of year-on-year results. The non-GAAP measures described below are used by management in making operating decisions, allocating financial resources and for business strategy purposes. These measures may be useful to investors, as they provide supplemental information about business performance and provide investors with a view of our business results through the eyes of management. These measures are also used to evaluate senior management and are a factor in determining their at-risk compensation. These non-GAAP measures are not intended to be considered by the user in place of the related GAAP measures but rather as supplemental information to our business results. These non-GAAP measures may not be the same as similar measures used by other companies due to possible differences in method and in the items or events being adjusted. \nOrganic Sales Growth. \nOrganic sales growth is a non-GAAP measure of sales growth excluding the impacts of acquisitions, divestitures and foreign exchange from year-over-year comparisons. We believe this measure provides investors with a \n30        The Procter & Gamble Company\nsupplemental understanding of underlying sales trends by providing sales growth on a consistent basis. This measure is used in assessing the achievement of management goals for at-risk compensation.\nThe following tables provide a numerical reconciliation of net sales growth to organic sales growth:\nFiscal year ended June 30, 2025\nNet Sales Growth\nForeign Exchange Impact\nAcquisition & Divestiture \nImpact/Other \n(1)\nOrganic Sales Growth\nBeauty\n(2)\n%\n1 \n%\n2 \n%\n1 \n%\nGrooming\n— \n%\n2 \n%\n— \n%\n2 \n%\nHealth Care\n2 \n%\n1 \n%\n— \n%\n3 \n%\nFabric & Home Care\n— \n%\n1 \n%\n1 \n%\n2 \n%\nBaby, Feminine & Family Care\n— \n%\n1 \n%\n— \n%\n1 \n%\nTOTAL COMPANY\n—\n \n%\n1\n \n%\n1\n \n%\n2\n \n%\n(1)\nAcquisition & Divestiture Impact/Other includes the volume and mix impact of acquisitions and divestitures and rounding impacts necessary to reconcile net sales to organic sales.\nAdjusted Free Cash Flow. \nAdjusted free cash flow is defined as operating cash flow less capital spending and excluding payments for the transitional tax resulting from the 2017 U.S. Tax Act. Adjusted free cash flow represents the cash that the Company is able to generate after taking into account planned maintenance and asset expansion. We view adjusted free cash flow as an important measure because it is one factor used in determining the amount of cash available for dividends, share repurchases, acquisitions and other discretionary investments.\nThe following table provides a numerical reconciliation of adjusted free cash flow ($ millions):\nOperating Cash Flow \nCapital Spending\n2017 U.S. Tax Act Payments\nAdjusted Free Cash Flow\n2025\n$\n17,817\n \n$\n(3,773)\n$\n562\n \n$\n14,606\n \n2024\n$\n19,846 \n$\n(3,322)\n$\n422 \n$\n16,946 \nAdjusted Free Cash Flow Productivity. \nAdjusted free cash flow productivity is defined as the ratio of adjusted free cash flow to net earnings excluding the non-cash charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in certain Enterprise Markets, including Nigeria and Argentina, and the Gillette intangible asset impairment charge. We view adjusted free cash flow productivity as a useful measure to help investors understand P&G’s ability to generate cash. Adjusted free cash flow productivity is used by management in making operating decisions, in allocating financial resources and for budget planning purposes. This measure is used in assessing the achievement of management goals for at-risk compensation. \nThe following table provides a numerical reconciliation of adjusted free cash flow productivity ($ millions):\nAdjusted Free\nCash Flow\nNet Earnings\nAdjustments to Net Earnings \n(1)\nNet Earnings as Adjusted\nAdjusted Free \nCash Flow Productivity\n2025\n$\n14,606\n \n$\n16,065\n \n$\n752\n \n$\n16,817\n \n87\n \n%\n2024\n$\n16,946 \n$\n14,974 \n$\n1,242 \n$\n16,216 \n105 \n%\n(1)\nAdjustments to Net Earnings relate to a non-cash charge for accumulated foreign currency translation losses due to the substantial liquidation of operations in Argentina in fiscal 2025 and certain Enterprise Markets, including Nigeria, in fiscal 2024, and the after-tax Gillette intangible asset impairment charge in fiscal 2024.\nCore EPS. \nCore EPS is a measure of the Company's diluted EPS excluding items that are not judged by management to be part of the Company's sustainable results or trends. Management views this non-GAAP measure as a useful supplemental measure of Company performance over time. This measure is also used in assessing the achievement of management goals for at-risk compensation. The Core earnings measures included in the following reconciliation tables refer to the equivalent GAAP measures adjusted as applicable for the following items:\n•\nIncremental restructuring:\n The Company has historically had an ongoing level of restructuring activities of approximately $250 - $500 million before tax. As discussed in Note 3 to the Consolidated Financial Statements, in the fiscal year ended June 30, 2024, the Company started a limited market portfolio restructuring of its business operations, primarily in certain Enterprise Markets, including Argentina and Nigeria, to address challenging macroeconomic and fiscal conditions. During the period ended September 30, 2024, the Company completed this limited market portfolio restructuring with the substantial liquidation of its operations in Argentina. The adjustment to Core earnings includes the restructuring charges that exceed the normal, recurring level of restructuring charges.\n•\nIntangible asset impairment:\n As discussed in Note 4 to the Consolidated Financial Statements, in the fiscal year ended June 30, 2024, the Company recognized a non-cash, after-tax impairment charge of $1.0 billion ($1.3 billion before \nThe Procter & Gamble Company        31\ntax) to adjust the carrying value of the Gillette intangible asset acquired as part of the Company's 2005 acquisition of The Gillette Company.\nWe do not view the above items to be part of our sustainable results, and their exclusion from Core earnings measures provides a more comparable measure of year-on-year results. These items are also excluded when evaluating senior management in determining their at-risk compensation.\nTHE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES\nReconciliation of Non-GAAP Measures\nFiscal Year Ended June 30, 2025\nAmounts in millions except per share amounts\nAs Reported (GAAP)\nIncremental Restructuring\nCore \n(Non-GAAP)\nCost of products sold\n$\n41,164 \n$\n20 \n$\n41,184 \nSelling, general and administrative expense\n22,669 \n(25)\n22,643 \nOperating income\n20,451 \n5 \n20,456 \nNon-operating income, net\n154 \n789 \n943 \nIncome taxes\n4,102 \n(7)\n4,094 \nNet earnings attributable to P&G\n15,974 \n801 \n16,775 \nCore EPS\nDiluted net earnings per common share \n(1)\n$\n6.51 \n$\n0.33 \n$\n6.83 \n(1)\nDiluted net earnings per common share are calculated on Net earnings attributable to Procter & Gamble.\nCHANGE VERSUS YEAR AGO\nDiluted net earnings per common share\n8 \n%\nCore EPS\n4 \n%\nTHE PROCTER & GAMBLE COMPANY AND SUBSIDIARIES\nReconciliation of Non-GAAP Measures\nFiscal Year Ended June 30, 2024\nAmounts in millions except per share amounts\nAs Reported (GAAP)\nIncremental Restructuring\nIntangible Impairment\nCore \n(Non-GAAP)\nCost of products sold\n$\n40,848 \n$\n(70)\n$\n— \n$\n40,778 \nSelling, general and administrative expense\n23,305 \n(33)\n— \n23,273 \nOperating income\n18,545 \n103 \n1,341 \n19,988 \nNon-operating income, net\n668 \n248 \n— \n916 \nIncome taxes\n3,787 \n(25)\n315 \n4,077 \nNet earnings attributable to P&G\n14,879 \n376 \n1,026 \n16,281 \nCore EPS\nDiluted net earnings per common share \n(1)\n$\n6.02 \n$\n0.15 \n$\n0.42 \n$\n6.59 \n(1)\nDiluted net earnings per common share are calculated on Net earnings attributable to Procter & Gamble.",
  "item2": null
}