{
  "item1": "Procter & Gamble Company (the Company) world-leading multinational consumer goods company focused providing trusted, branded products superior quality, performance value improve lives consumers around world - now generations come. products sold about 180 countries territories throughout world. Company incorporated Ohio 1905, having first been established New Jersey corporation 1890, built business founded Cincinnati 1837 William Procter James Gamble. Financial Information about Segments Information about reportable segments can found MD&A Note 2 Consolidated Financial Statements.",
  "item7": "Net sales increased $245 million $84.3 billion versus prior year. Net sales increased low single digits Health Care unchanged Grooming, Fabric & Home Care Baby, Feminine & Family Care. Net Sales declined low single digits Beauty. Organic sales, which exclude impact acquisitions divestitures foreign exchange, increased 2%.",
  "item2": "Management's Discussion Analysis Financial Condition Results Operations Forward-Looking Statements Certain statements report, other than purely historical information, including estimates, projections, statements relating business plans, objectives expected operating results, assumptions upon which those statements based, “forward-looking statements” within meaning Private Securities Litigation Reform Act 1995, Section 27A Securities Act 1933 Section 21E Securities Exchange Act 1934. Forward-looking statements may appear throughout report, including without limitation, following sections: “Management's Discussion Analysis,” “Risk Factors” \"Notes 4 9 Consolidated Financial Statements.\" These forward-looking statements generally identified words “believe,” “project,” “expect,” “anticipate,” “estimate,” “intend,” “strategy,” “future,” “opportunity,” “plan,” “may,” “should,” “will,” “would,” “will be,” “will continue,” “will likely result” similar expressions. Forward-looking statements based current expectations assumptions, which subject risks uncertainties may cause results differ materially those expressed implied forward-looking statements. undertake no obligation update revise publicly any forward-looking statements, whether because new information, future events otherwise, except extent required law."
}