{
  "source_file": "pgr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nI.  OVERVIEW\nThe Progressive Corporation’s insurance subsidiaries recognized strong year-over-year growth in both premiums and policies in force during the third quarter 2025, compared to the same period last year, while maintaining an underwriting profit better than our 4% companywide calendar-year underwriting profit goal. \nDuring the third quarter 2025, we wrote $21.4 billion of companywide net premiums written, which was $1.9 billion, or 10%, more than we generated during the same period last year, with a 14% increase in net premiums earned. Policies in force increased 12%, or by 4.2 million policies, compared to September 30, 2024; with policies in force increasing by 0.8 million in the third quarter 2025. While experiencing this strong growth during the third quarter 2025, we also maintained strong profitability, with an underwriting profit margin of 10.5%.\nOur Personal Lines segment experienced year-over-year growth for the third quarter 2025, with net premiums written increasing 12% and policies in force up 13%, over the significant growth of 28% in net premiums written and 15% in policies in force we experienced in the third quarter last year. This growth was primarily driven by our personal auto products and reflects renewal application growth, driven by new applications gained over the last year renewing during the quarter. \nIn Commercial Lines, we experienced a decrease in net premiums written of 6% for the third quarter 2025, compared to the same period last year, despite experiencing policies in force growth of 6%. The decline in net premiums written was primarily driven by a decrease in transportation network company (TNC) premiums, due to decreases in projected mileage, which is the basis for computing premiums, during the third quarter 2025, compared to increases in projected mileage during the third quarter 2024. To a lesser extent, the net premiums written decline was due to a shift to a greater mix of policies with 6-month terms in our contractor and business auto business market targets (BMT), which have about half the amount of net premiums written as 12-month policies, and to a mix shift to lower average written premium BMTs in our core commercial auto business (which excludes our TNC business, our Progressive Fleet & Specialty Programs (Fleet & Specialty) products, and our business owners’ policy (BOP) product). On a year-to-date basis for the period ended September 30, 2025, net premiums written in our TNC business were flat compared to the same period last year. Excluding TNC, Commercial Lines net premiums written would have decreased 2% for the third quarter 2025, compared to the same period last year. \nDuring the third quarter 2025, on a countrywide basis, we increased personal auto rates less than 1% and increased our personal property rates about 2%, in the aggregate. In our core commercial auto business, we increased rates about 2% in the aggregate during the third quarter 2025. \nWhile we currently continue to believe we are adequately priced in our personal auto products in most states, starting in the first quarter 2025, the U.S. government announced additional tariffs on goods imported into the U.S. from numerous countries, which have, in response, resulted in additional tariffs against the U.S. We regularly model the potential impact tariffs could have on vehicle loss costs, the supply chain, the availability of parts, and general inflation, among other factors, although the dynamic international trade environment currently prevents us from accurately predicting how tariffs will ultimately impact our business over time. While our focus has been on trying to maintain stable rates for customers, effective tariffs and other retaliatory actions will likely result in higher loss costs, which could result in a reduction in profitability and the possible need for higher than currently anticipated rate increases throughout 2025 and 2026. While we expect to continue increasing rates in our personal property and core commercial auto products through the remainder of 2025, we will continue to monitor the impact from tariffs and other potential changes in the regulatory environment as we evaluate the possible need for additional rate increases.\nFor the third quarter 2025, the $281 million year-over-year increase in net income primarily reflected an almost even increase in both underwriting income and total net investment income, while total comprehensive income decreased $996 million, primarily related to lower net unrealized gains on our fixed-maturity securities in the third quarter 2025. Included in underwriting income for the third quarter 2025 was a $950 million policyholder credit expense related to excess profits earned in Florida.\nSince Florida insurance reform was enacted in early 2023, we have seen lower loss costs on certain types of personal auto accident claims and favorable reserve development, and we have experienced strong profitability in our Florida personal auto business. Despite actions to lower rates in the last year, it is probable that our personal auto profit in Florida for the 2023 to 2025 period will exceed the statutory profit limit that a Florida statute imposes on the profit that any insurance group can earn on personal auto insurance over any three-calendar-year period. In such event, we would need to credit any profit above the limit to all Florida personal auto policyholders active at December 31, 2025. As a result, in September 2025, we recorded a $950 million policyholder credit expense, which represents our current estimate of the profit we will earn on the three-calendar-year period ending December 31, 2025, in excess \n27\nof the permitted profit limit. This liability will continue to be refined through the fourth quarter 2025. See \nFinancial Condition\n for further information.\nAt September 30, 2025, total capital (debt plus shareholders’ equity) was $42.3 billion, which was an increase of $9.9 billion from year-end 2024, primarily driven by the $10.0 billion of comprehensive income earned in the first nine months of 2025.\nA. Insurance Operations\nOur companywide underwriting profit margin was 10.5% during the third quarter 2025, compared to 11.0% during the third quarter 2024. For the third quarter 2025, our loss and loss adjustment expense (LAE) ratio decreased 3.7 points, and our underwriting expense ratio increased 4.2 points, compared to the same period last year. The decrease in the loss and LAE ratio was primarily driven by a decrease in catastrophe losses and by favorable prior accident years reserve development in both Personal Lines and Commercial Lines. The increase in the underwriting expense ratio was primarily driven by the Florida personal auto excess profit policyholder credit, previously discussed, adding 4.6 points to the companywide ratio. Our Personal Lines and Commercial Lines operating segments both generated strong profitability for the third quarter 2025, with margins of 10.5% and 10.8%, respectively. Excluding the Florida personal auto excess profit policyholder credit, the Personal Lines underwriting margin would have been 15.8%.\nWe closely manage our expenses, monitoring both acquisition expenses and non-acquisition expenses, which we view as an important measure of operational efficiency as we seek to deliver our most competitive rates to consumers. We will continue to advertise to maximize growth as long as the advertising spend is efficient and we remain on track to achieve our calendar-year profitability goal. During the third quarter 2025, our advertising spend was $1.3 billion, which was 10% greater than the third quarter last year, although, due to the growth in net premiums earned, advertising spend contributed 0.2 less points to the underwriting expense ratio in the third quarter 2025, compared to the same period last year.\nOur Personal Lines segment is comprised of our personal vehicle and property products. Personal Lines vehicles include both personal auto and special lines products, with the latter typically having higher losses during the warmer weather months, due to the seasonal nature of these products (e.g., recreational vehicles, such as motorcycles, RVs, and watercraft). Our Personal Lines underwriting margin for the third quarter 2025 was 10.5%, with personal vehicle and property products reporting 9.3% and 36.5%, respectively, with Florida excess profit credits reducing the personal vehicles margin by 5.5%. Profitability in our special lines products had minimal impact to our personal vehicle combined ratio during the third quarter 2025. The substantially high underwriting profit margin in our personal property products was primarily driven by \nfavorable development on prior accident year losses and the low level of incurred catastrophe losses during the period.\nOur Commercial Lines segment includes our core commercial auto products, TNC business, Fleet & Specialty products, and BOP product. Our total Commercial Lines underwriting profitability for the third quarter 2025 was 10.8%.\nFor the third quarter 2025, Personal Lines generated strong net premiums written growth of 12%, with the agency and direct personal vehicle businesses and property business growing 9%, 15%, and 5%, respectively, compared to the same period last year. Commercial Lines net premiums written decreased 6% year over year. \nChanges in net premiums written are a function of new business applications (i.e., policies sold), business mix, premium per policy, and retention.\nRelative to the significant growth we experienced in our personal vehicle products during the third quarter 2024, we experienced a small decrease in total Personal Lines new business applications during the third quarter 2025. Total Personal Lines renewal business applications increased substantially, primarily driven by the significant new business application growth experienced in our personal vehicle products in prior periods. New and renewal personal auto applications decreased 2% and increased 20%, respectively, for the third quarter 2025, compared to the same period in the prior year. \nIn our personal property business, the strong growth in new applications in our renters policies was offset by declines in our homeowners product, which we define as our total personal property business excluding renters and umbrella products. For the third quarter 2025, the new business applications in our homeowners product decreased just over 35%, compared to the same period last year, with a significant decrease in both the less volatile and more volatile (e.g., coastal and hail-prone states) weather-related states.\nDuring the third quarter 2025, in our personal property business, we continued to focus on improving profitability and reducing exposure in more volatile weather-related markets, and, where permitted, on slowing growth and non-renewing policies. We prioritized insuring lower-risk properties (e.g., new construction, existing homes with newer roofs), accepting new business for our homeowners product only when bundled with a Progressive personal auto policy, where permitted, and continued to exit the non-owner-occupied home market. In addition, we maintained our cost sharing through mandatory wind and hail deductibles and roof depreciation schedules in most markets. We believe these actions adversely impacted new business application growth. We plan to continue certain actions during the remainder of 2025. During the third quarter 2025, we began to take actions in several markets \n28\nto generate new business growth at the state level based on our concentration risks, product segmentation, rate adequacy, cost sharing execution, and regulatory and market conditions. Some of these actions include expanding agency relationships, lifting certain agency restrictions put in place in 2024, and reopening new business in our direct channel.\nThe total Commercial Lines net premiums written decreased 6% for the third quarter 2025, compared to the same period in the prior year, primarily driven by our TNC business, reflecting decreases in projected mileage, which is the basis for computing premiums, during the third quarter 2025, compared to increases in projected mileage during the third quarter 2024. In addition, our contractor and business auto BMTs experienced a shift to a greater mix of policies with 6-month terms, compared to the third quarter 2024. As 12-month policies have about twice the amount of net premiums written compared to 6-month policies, the shift negatively impacted average premiums. A mix shift to lower average written premium BMTs also contributed to the decline. Excluding the TNC business, total Commercial Lines net premiums written was down 2% for the third quarter 2025, on a year-over-year basis.\nNew and renewal business applications in our core commercial auto products decreased 1% and increased 6%, respectively, for the third quarter 2025, compared to the same period last year. The new business application decline was predominately driven by the for-hire transportation BMT, primarily attributable to rate and non-rate actions taken to address profitability challenges and, to a lesser extent, the continued decline in the number of active motor carriers in this BMT. Excluding the impact of this BMT, our core commercial auto new application growth would have been 3% for the third quarter 2025.\nFor the third quarter 2025, on a year-over-year basis, average written premium per policy decreased 1%, 5%, and 7% in the personal auto, personal property, and core commercial auto products, respectively. In aggregate, we took minimal personal auto rate increases during the third quarter 2025. The decrease in personal property average written premium per policy was due to a shift in the mix of business to more renters policies, which have lower average written premiums, and our continued focus on slowing growth in more volatile weather-related markets, which generally have higher risk and, therefore, higher average premiums per policy. These mix shifts in our personal property business were partially offset by aggregate rate increases of 11% taken over the last 12 months and higher premium coverages reflecting increased property values. \nThe decrease in average written premium per policy in our core commercial auto products was due to a shift in the mix of business, primarily driven by decreased demand in our for-hire transportation BMT, as well as a shift in policy term towards more 6-month policies in our contractor and business auto BMTs. This decrease was partially offset by \nrate increases of about 6%, in the aggregate, over the trailing 12 months. Given that our personal property and commercial auto policies are predominately written for 12-month terms, rate actions take longer to earn into premium for these products.\nWe will continue to monitor the factors that could impact our loss costs for both segments, which may include tariffs, as previously discussed, new and used car prices, miles driven, driving patterns, loss severity, weather events, building materials, construction costs, inflation, and other factors, on a state-by-state basis. \nWe believe a key element in improving the accuracy of our personal auto rating is Snapshot\n®\n, our usage-based insurance offering. For the third quarter 2025, the personal auto adoption rates for consumers enrolling in the program decreased 1% in agency and increased 6% in direct, compared to the same period last year. Snapshot is available in all states, other than California, and our latest segmentation model was available in states that represented 78% of our countrywide personal auto net premiums written (excluding California) on a trailing 12-month basis at quarter end. We continue to invest in our mobile application, with the majority of new enrollments choosing mobile devices for Snapshot monitoring.\nWe realize that to grow policies in force, it is critical that we retain our customers for longer periods. Consequently, increasing retention continues to be one of our most important priorities. Our efforts to increase our share of Progressive auto and personal property bundled households (i.e., Robinsons) remains a key initiative, and we plan to continue to make investments to improve the customer experience in order to support that goal. Policy life expectancy, which is our actuarial estimate of the average length of time that a newly written policy will remain in force before cancellation or lapse in coverage, is our primary measure of customer retention in our Personal Lines and Commercial Lines businesses.\nIn personal auto, we evaluate personal auto retention using a trailing 12-month and a trailing 3-month policy life expectancy. Although the latter can reflect more volatility and is more sensitive to seasonality, we believe this measure is more responsive to current experience and may be an indicator for the future trend of our 12-month measure. Our trailing 12-month total personal auto policy life expectancy was down 6% year over year for the third quarter 2025. On a trailing 3-month basis, our personal auto policy life expectancy was down 7% for the third quarter 2025, compared to the same period last year, which we believe is primarily due to increased shopping and competition in the marketplace, and due to a shift in our mix of business. Due, in part, to the efforts of our customer preservation team, during the period we saw an increase in existing customers who went through our new customer quote process to either modify existing coverage or to find a lower rate. As a result, some of these customers replaced their existing policies with new Progressive policies, which \n29\nnegatively impacted policy life expectancy but retained the customer.\nOur trailing 12-month policy life expectancy was down 15% for our personal property products year over year for the third quarter 2025. We believe our personal property retention decreased primarily as a result of a mix shift to more renters policies.\nFor our core commercial auto products, our trailing 12-month policy life expectancy increased 11%, compared to the prior year, which we believe is due to the moderation of our rate increases, compared to competitor rate increases, our improving competitiveness in the marketplace, and various initiatives to help with improving policy life expectancy such as payment and renewal reminders. The increase in the core commercial auto policy life expectancy was across all BMTs, except in for-hire specialty. \nB. Investments\nThe fair value of our investment portfolio was $94.5 billion at September 30, 2025, compared to $80.3 billion at December 31, 2024. The increase from year-end 2024 reflected positive cash flows from insurance operations and investment returns, partially offset by the payment of our annual variable common share dividend. \nOur asset allocation strategy is to maintain 0%-25% of our portfolio in Group I securities, with the balance (75%-100%) of our portfolio in Group II securities (the securities allocated to Group I and II are defined below under \nResults of Operations – Investments\n). At September 30, 2025 and December 31, 2024, 5% and 6%, respectively, of our portfolio was allocated to Group I securities with the remainder to Group II securities. \nOur recurring investment income generated a pretax book yield of 4.2% for the third quarter 2025, compared to 4.0% for the same period in 2024. The increase from the prior year primarily reflected investing new cash from insurance operations, and proceeds from maturing bonds, in higher coupon rate securities. Our investment portfolio produced a fully taxable equivalent (FTE) total return of 1.7% and 4.0% for the third quarter 2025 and 2024, respectively. Our fixed-income and common stock portfolios had FTE total returns of 1.5% and 8.1%, respectively, for the third quarter 2025, compared to 3.9% and 5.8%, respectively, last year. The decrease in the fixed-income portfolio FTE total return primarily reflected movements in U.S. Treasury yields year-over-year. The increase in the common stock portfolio FTE total return reflected general market conditions.\nAt September 30, 2025 and 2024, and December 31, 2024, the fixed-income portfolio had a weighted average credit quality of AA-. At September 30, 2025, the fixed-income portfolio duration was 3.4 years, compared to 3.3 years at September 30, 2024 and December 31, 2024. During 2025, we increased our duration to take advantage of higher yields in the market.\nAt September 30, 2025, we continued to maintain a relatively conservative investment portfolio with a greater allocation to cash and treasuries. We believe that this portfolio allocation positions us well to benefit from the continuing dynamic market environment. We believe the investment portfolio is in a very strong position as we move into the fourth quarter of 2025.\nII.  FINANCIAL CONDITION\nA. Liquidity and Capital Resources\nProgressive’s insurance operations create liquidity by collecting and investing premiums from new and renewal business in advance of paying claims, as well as our insurance subsidiaries producing aggregate calendar-year underwriting profits and positive cash flows. As primarily an auto insurer, our claims liabilities generally have a short-term duration. \nOperations generated positive cash flows of $14.4 billion and $12.1 billion for the nine months ended September 30, 2025 and 2024, respectively. The increase in operating cash flow for the first nine months of 2025, compared to the same period last year, was primarily driven by the growth in profit from our underwriting operations. We believe cash flows will remain positive in the foreseeable future and do not expect we will need to raise capital to support our operations in that timeframe, although changes in market or regulatory conditions affecting the insurance \nindustry, or other unforeseen events, may necessitate otherwise. \nAs of September 30, 2025, we held $52.9 billion in short-term investments and U.S. Treasury securities, which represented about 56% of our total portfolio at quarter end. Based on our portfolio allocation and investment strategies, we believe that we have sufficient readily available marketable securities to cover our claim payments and short-term obligations in the event our cash flows from operations were to be negative. See \nItem 1A, Risk Factor\ns in our Annual Report on Form 10-K filed with the U.S. Securities and Exchange Commission for the year ended December 31, 2024 (our 2024 Form 10-K), for a discussion of certain matters that may affect our portfolio and capital position. \nOur total capital (debt plus shareholders’ equity) was $42.3 billion, based on book value, at September 30, 2025, compared to $34.1 billion at September 30, 2024, and $32.5 billion at December 31, 2024. The increase from \n30\nyear-end 2024, primarily reflects the comprehensive income recognized during the first nine months of 2025. Our debt-to-total capital ratio was 16.3% at September 30, 2025, 20.2% at September 30, 2024, and 21.2% at December 31, 2024. Our debt-to-total capital ratios were consistent with our financial policy of maintaining a ratio of less than 30%.\nNone of the covenants on our existing debt securities include rating or credit triggers that would require an adjustment of interest rate or an acceleration of principal payments in the event that our debt securities are downgraded by a rating agency. During the second quarter 2025, we renewed the unsecured discretionary line of credit with PNC Bank, National Association, in the maximum principal amount of $300 million. We did not engage in short-term borrowings, including any borrowings under the line of credit, to fund our operations or for liquidity purposes during the reported periods.\nWe seek to deploy capital in a prudent manner and use multiple data sources and modeling tools to estimate the frequency, severity, and correlation of identified exposures, including, but not limited to, investment losses, catastrophic and other insured losses, natural disasters, and other significant business interruptions, to estimate our potential capital needs.\nDuring the first nine months of 2025, we returned capital to shareholders primarily through common share dividends and common share repurchases. Our Board of Directors declared a $0.10 per common share dividend in each of the first three quarters of 2025. These quarterly common share dividends, which were $59 million, $58 million, and $59 million, in the aggregate, were paid in April 2025, July 2025, and October 2025, respectively. In January 2025, we also paid a common share dividend declared in the fourth quarter 2024, in the aggregate amount of $2.7 billion, or $4.60 per share (see \nNote 9 – Dividends\n for further discussion). \nPursuant to our financial policies, we repurchase common shares to neutralize dilution from equity-based compensation granted during the year and opportunistically when we believe our shares are trading below our determination of long-term fair value. During the first nine months of 2025, we repurchased 0.4 million common shares, at a total cost of $107 million, including 0.1 million shares in the third quarter 2025, both in the open market and to satisfy tax withholding obligations in connection with the vesting of equity awards under our employee equity compensation plans. We will continue to make decisions on returning capital to shareholders based on the strength of our overall capital position, the capital strength of our subsidiaries, and the potential capital needs of our business.\nAt September 30, 2025, we had $4.9 billion in a consolidated, non-insurance subsidiary of the holding company that can be used to fund corporate obligations and \nprovide additional capital to the insurance subsidiaries to fund potential future growth and other opportunities. As of September 30, 2025, our estimated consolidated statutory surplus was $33.7 billion.\nInsurance departments establish and monitor compliance with capital and surplus requirements. One prominent ratio monitored by regulators is the amount of net premiums written as a ratio of surplus. Although the ratio of written premiums to surplus that the regulators will allow is a function of a number of factors (including applicable laws, the type of business being written, the adequacy of the insurer’s reserves, and the quality of the insurer’s assets), the annual net premiums that an insurer may write historically have been perceived to be limited to a specified multiple of the insurer’s total surplus, generally 3 to 1 for property and casualty insurance, which is generally the maximum target for our vehicle businesses; however, two states have permitted us to target a premiums-to-surplus ratio for our vehicle businesses to a maximum ratio of 3.5 to 1 based on our strong financial condition. This approval reduces the amount of capital we may need to hold at our applicable insurance subsidiaries relative to premium, subject to the other factors previously mentioned. For 2024, these subsidiaries represented 90% of our companywide total net premiums written. The pace and extent to which we move to this ratio is yet to be determined. We have previously announced our intention to pay a dividend on our common shares on a quarterly basis and to consider paying a variable dividend on at least an annual basis. The Board of Directors declares any applicable dividend and may consider, among other factors, changes in our performance or available capital, or other potential uses for our capital as part of this action.\nDuring the first nine months of 2025, our contractual obligations and critical accounting policies have not changed materially from those discussed in our 2024 Annual Report to Shareholders. There have not been any material changes in off-balance-sheet leverage, which includes purchase obligations, from those discussed in our 2024 Annual Report to Shareholders.\nOn July 4, 2025, H.R. 1, “An Act to provide for reconciliation pursuant to title II of H. Con. Res. 14” (the Act) was signed into law by the President of the United States. The Act contains numerous tax provisions applicable to corporations. These provisions will not have a material adverse effect on our financial condition or results of operations.\nSince Florida insurance reform was enacted in early 2023, we have seen lower loss costs on certain types of personal auto accident claims and favorable reserve development, and we have experienced strong profitability in our Florida personal auto business. In response to these trends, we have lowered Florida personal auto rates twice in the last year. Despite these actions, it is probable that our personal auto profit in Florida for the 2023 to 2025 period will exceed the statutory profit limit that a Florida statute \n31\nimposes on the profit that any insurance group can earn on personal auto insurance over any three-calendar-year period. In such event, we would need to credit any profit above the limit to all Florida personal auto policyholders active at December 31, 2025. As a result, in September 2025, we recorded a $950 million policyholder credit expense, which represents our current estimate of the profit we will earn on the three-calendar-year period ending December 31, 2025, in excess of the permitted profit limit. The estimated liability will continue to be refined through the end of the fourth quarter 2025, given the continuing exposure to potential significant storm activity through the Atlantic hurricane season, which continues into late November 2025, and the other factors that impact reserve development through the first quarter 2026 on losses for applicable accident years. See \nItem 1A, Risk Factors\n in our 2024 Form 10-K, for a description of other factors that may impact our ability to establish accurate loss reserves. In early 2026, we expect to provide credits to policyholders active at December 31, 2025. As of September 30, 2025, we had approximately 2.7 million personal auto policyholders active in Florida.\nBased upon our capital planning and forecasting efforts, we believe we have sufficient capital resources and cash flows from operations to support our current business, scheduled principal and interest payments on our debt, anticipated quarterly dividends on our common shares, our contractual obligations, and other expected capital requirements for the foreseeable future. \nNevertheless, we may decide to raise additional capital to take advantage of attractive terms in the market and provide additional financial flexibility. We currently have an effective shelf registration with the U.S. Securities and Exchange Commission so that we may periodically offer and sell an indeterminate aggregate amount of senior or subordinated debt securities, preferred stock, depository shares, common stock, purchase contracts, warrants, and units. The shelf registration enables us to raise funds, subject to market conditions, from the offering of any securities covered by the shelf registration as well as any combination thereof.\nIII.  RESULTS OF OPERATIONS – UNDERWRITING\nA. Segment Overview\nWe report our underwriting operations in two segments: Personal Lines and Commercial Lines. Our Personal Lines segment writes insurance for personal vehicles, which include personal auto and special lines products (e.g., recreational vehicles, such as motorcycles, RVs, and watercraft), personal residential property insurance for homeowners and renters, umbrella insurance, and flood insurance through the “Write Your Own” program for the National Flood Insurance Program. Since our personal auto products represented about 90% of our Personal Lines segment net premiums written at quarter end, much of the following discussion will focus on our personal auto products, both in total and by distribution channel. We will also discuss our personal property products as we continue to focus on improving profitability and reducing our concentration and exposure in more volatile weather-related markets.\nOur Commercial Lines segment writes auto-related liability and physical damage insurance, business-related general liability and commercial property insurance predominantly for small businesses, and workers’ compensation insurance primarily for the transportation industry and includes our core commercial auto products, TNC business, Fleet & Specialty products, and BOP product. Of our total Commercial Lines segment, our core commercial auto products represented about 80% of net premiums written and our TNC business represented about 15%, both on a trailing 12-month basis, as of the end of the third quarter 2025. Therefore, much of the following discussion focuses only on our core commercial auto products.\nThe following table shows the composition of our companywide net premiums written, by segment, for the respective periods:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nPersonal Lines\nVehicles\nAgency\n36 \n%\n37 \n%\n36 \n%\n36 \n%\nDirect\n50 \n47 \n47 \n45 \nProperty\n4 \n4 \n4 \n4 \nTotal Personal Lines\n90 \n88 \n87 \n85 \nCommercial Lines\n10 \n12 \n13 \n15 \nTotal underwriting operations\n100 \n%\n100 \n%\n100 \n%\n100 \n%\nWithin our Personal Lines segment, we often categorize our personal auto product policyholders into four consumer segments:\n•\nSam - inconsistently insured;\n•\nDiane - consistently insured and maybe a renter;\n•\nWrights - homeowners who do not bundle auto and home; and\n•\nRobinsons - homeowners who bundle auto and home.\nWhile our personal auto policies primarily have 6-month terms, to promote bundled personal auto and property growth, we write 12-month personal auto policies in our Platinum agencies. At September 30, 2025 and 2024, 11% and 13%, respectively, of our agency personal auto policies in force were 12-month policies. To the extent our agency \n32\napplication mix of annual personal auto policies changes, the shift in policy term could impact our average premiums written in the agency channel, as 12-month policies have about twice the amount of net premiums written compared to 6-month policies. \nOur special lines and personal property products are written for 12-month terms. About 55% and 70%, respectively, of our special lines products and personal property business net premiums written during the third quarter 2025 was generated through the independent agency channel, with the balance through the direct channel.\nWithin our Commercial Lines segment, our core commercial auto business operates in the following five traditional business market targets (BMT): \n•\nfor-hire specialty;\n•\nfor-hire transportation;\n•\ntow;\n•\ncontractor; and\n•\nbusiness auto.\nAt September 30, 2025, about 85% of Commercial Lines policies in force had 12-month terms. The majority of our Commercial Lines business is written through the independent agency channel, although we continue to focus on growing our direct business, with about 10% of our core commercial auto premiums written through the direct channel. \nB. Profitability\nProfitability, for our underwriting operations, is defined by pretax underwriting profit or loss, which is calculated as net premiums earned plus fees and other revenues less losses and loss adjustment expenses, policy acquisition costs, other underwriting expenses, and policyholder credit expense. We also use underwriting margin, which is underwriting profit or loss expressed as a percentage of net premiums earned, to analyze our results. For the respective periods, our underwriting profitability results were as follows:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n \nUnderwriting\nProfit (Loss)\nUnderwriting\nProfit (Loss)\nUnderwriting\nProfit (Loss)\nUnderwriting\nProfit (Loss)\n($ in millions)\n$\nMargin\n$\nMargin\n$\nMargin\n$\nMargin\nPersonal Lines\nVehicles\nAgency\n1\n$\n873 \n11.7 \n%\n$\n870 \n13.1 \n%\n$\n3,279 \n15.0 \n%\n$\n2,609 \n14.0 \n%\nDirect\n1\n737 \n7.5 \n665 \n8.1 \n2,935 \n10.4 \n2,491 \n10.9 \nProperty\n288 \n36.5 \n164 \n21.5 \n515 \n22.0 \n(277)\n(12.5)\nTotal Personal Lines\n1,898 \n10.5 \n1,699 \n10.9 \n6,729 \n12.9 \n4,823 \n11.0 \nCommercial Lines\n298 \n10.8 \n308 \n11.3 \n1,000 \n12.2 \n821 \n10.3 \nOther indemnity\n2\n(6)\nNM\n(2)\nNM\n(14)\nNM\n(3)\nNM\nTotal underwriting operations\n$\n2,190 \n10.5 \n%\n$\n2,005 \n11.0 \n%\n$\n7,715 \n12.7 \n%\n$\n5,641 \n10.9 \n%\n1 \nIncluded in the underwriting profit of the personal vehicles agency business and the personal vehicles direct business is $436 million and $514 million, respectively, of expense related to Florida personal auto policyholder credits for both the three and nine months ended September 30, 2025. \n2 \nUnderwriting margins for our other indemnity businesses are not meaningful (NM) due to the low level of premiums earned by, and the variability of loss costs in, such businesses.\nThe decrease in our underwriting profit margin on a year-over-year basis for the third quarter 2025 was due, in part, to the $950 million Florida excess profit policyholder credit expense recorded during the quarter. Excluding the effect of the policyholder credit, third quarter 2025 underwriting profit would have been 4.1 points higher than the same period last year, driven by a decrease in the loss and LAE ratio, which is attributable to lower incurred catastrophe losses and favorable development on prior accident year losses. \nThe increase in our underwriting profit margin, on a year-over-year basis, for the nine months ended September 30, 2025, was also driven by the same factors. \nSee the \nLosses and Loss Adjustment Expenses (LAE)\n section below for further discussion of our catastrophe losses, auto frequency and severity trends, and reserve development recognized during the periods and the \nUnderwriting Expenses\n section for further discussion of our advertising and non-acquisition expenses.\n33\nFurther underwriting results for our Personal Lines business, Commercial Lines business, and our underwriting operations in total, were as follows:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\nUnderwriting Performance\n1\n2025\n2024\nChange\n2025\n2024\nChange\nPersonal Lines\nVehicles\nAgency\nLoss & loss adjustment expense ratio\n63.7 \n67.9 \n(4.2)\n64.7 \n67.6 \n(2.9)\nUnderwriting expense ratio\n2\n24.6 \n19.0 \n5.6 \n20.3 \n18.4 \n1.9 \nCombined ratio\n2\n88.3 \n86.9 \n1.4 \n85.0 \n86.0 \n(1.0)\n Direct\nLoss & loss adjustment expense ratio\n66.4 \n69.9 \n(3.5)\n67.3 \n69.7 \n(2.4)\nUnderwriting expense ratio\n2\n26.1 \n22.0 \n4.1 \n22.3 \n19.4 \n2.9 \nCombined ratio\n2\n92.5 \n91.9 \n0.6 \n89.6 \n89.1 \n0.5 \nProperty\nLoss & loss adjustment expense ratio\n33.8 \n48.6 \n(14.8)\n48.8 \n83.3 \n(34.5)\nUnderwriting expense ratio\n29.7 \n29.9 \n(0.2)\n29.2 \n29.2 \n0 \nCombined ratio\n63.5 \n78.5 \n(15.0)\n78.0 \n112.5 \n(34.5)\nTotal Personal Lines\nLoss & loss adjustment expense ratio\n63.9 \n68.0 \n(4.1)\n65.3 \n69.5 \n(4.2)\nUnderwriting expense ratio\n2\n25.6 \n21.1 \n4.5 \n21.8 \n19.5 \n2.3 \nCombined ratio\n2\n89.5 \n89.1 \n0.4 \n87.1 \n89.0 \n(1.9)\nCommercial Lines\nLoss & loss adjustment expense ratio\n67.6 \n69.3 \n(1.7)\n67.3 \n70.4 \n(3.1)\nUnderwriting expense ratio\n21.6 \n19.4 \n2.2 \n20.5 \n19.3 \n1.2 \nCombined ratio\n89.2 \n88.7 \n0.5 \n87.8 \n89.7 \n(1.9)\nTotal Underwriting Operations\nLoss & loss adjustment expense ratio\n64.4 \n68.1 \n(3.7)\n65.7 \n69.7 \n(4.0)\nUnderwriting expense ratio\n25.1 \n20.9 \n4.2 \n21.6 \n19.4 \n2.2 \nCombined ratio\n89.5 \n89.0 \n0.5 \n87.3 \n89.1 \n(1.8)\nAccident year\n \n– Loss & loss adjustment expense ratio\n3\n66.6 \n68.8 \n(2.2)\n67.5 \n70.1 \n(2.6)\n1 \nRatios are expressed as a percentage of net premiums earned. Fees and other revenues are netted against either loss adjustment expenses or underwriting expenses in the ratio calculations, based on the underlying activity that generated the revenue.\n2 \nIncluded in both the underwriting expense and the combined ratios for the personal vehicles agency business are 5.8 points for the third quarter 2025, and 2.0 points for the nine months ended September 30, 2025, of expense related to the Florida personal auto policyholder credit. Included in both the underwriting expense and the combined ratios for the personal vehicles direct business are 5.2 points for the third quarter 2025, and 1.8 points for the nine months ended September 30, 2025, of policyholder credit expense. Excluding the policyholder credit, the total Personal Lines underwriting expense and combined ratios would have been 5.3 points lower for the third quarter 2025, and 1.8 points lower for the nine months ended September 30, 2025.\n3 \nThe accident year ratios include only the losses that occurred during the period noted. As a result, accident period results will change over time, either favorably or unfavorably, as we revise our estimates of loss costs when payments are made or reserves for that accident period are reviewed.\n34\nLosses and Loss Adjustment Expenses (LAE)\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n(millions)\n2025\n2024\n2025\n2024\nChange in net loss and LAE reserves\n$\n1,038 \n$\n1,425 \n$\n3,722 \n$\n3,915 \nPaid losses and LAE\n12,407 \n11,085 \n36,132 \n32,162 \nTotal incurred losses and LAE\n$\n13,445 \n$\n12,510 \n$\n39,854 \n$\n36,077 \nClaims costs, our most significant expense, represent payments made, and estimated future payments to be made, to or on behalf of our policyholders, including expenses needed to adjust or settle claims. Claims costs are a function of loss severity and frequency and, for our personal auto and core commercial auto businesses, are influenced by inflation and driving patterns, among other factors, some of which are discussed below. In our personal property business, severity is primarily a function of construction costs and the age and complexity of the structure, among other factors. Accordingly, anticipated changes in these factors are taken into account when we establish premium rates and loss reserves. Loss reserves \nare estimates of future costs and our reserves are adjusted as underlying assumptions change and information develops.\nOur total loss and LAE ratio decreased 3.7 points and 4.0 points, for the three and nine months ended September 30, 2025, respectively, compared to the prior year periods, primarily due to a decrease in catastrophe losses and to favorable prior accident years reserve development. On an accident year basis, our loss and LAE ratio was 2.2 points and 2.6 points lower for the third quarter and first nine months of 2025, respectively, compared to the same periods last year.\nThe following table shows our consolidated catastrophe losses and related combined ratio point impact, excluding loss adjustment expenses, incurred during the periods:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n($ in millions)\n$\nPoint\n1\n$\nPoint\n1\n$\nPoint\n1\n$\nPoint\n1\nPersonal Lines\nVehicles\n$\n198 \n1.1 \n$\n641 \n4.3 \n$\n1,029 \n2.1 \n$\n1,528 \n3.7 \nProperty\n9 \n1.1 \n57 \n7.5 \n320 \n13.7 \n751 \n34.0 \nTotal Personal Lines\n207 \n1.1 \n698 \n4.5 \n1,349 \n2.6 \n2,279 \n5.2 \nCommercial Lines\n12 \n0.4 \n34 \n1.2 \n36 \n0.4 \n69 \n0.9 \nTotal net catastrophe losses incurred\n$\n219 \n1.1 \n$\n732 \n4.0 \n$\n1,385 \n2.3 \n$\n2,348 \n4.5 \n1 \nRepresents catastrophe losses incurred during the period, including the impact of reinsurance, as a percent of net premiums earned for each segment.\nChanges in our estimate of our ultimate losses on catastrophes currently reserved, along with potential future catastrophes, could have a material impact on our financial condition, cash flows, or results of operations. We reinsure various risks including, but not limited to, catastrophic losses. We do not have catastrophe-specific reinsurance for our personal auto, special lines, or core commercial auto businesses. For the personal property business and certain BOP product coverages, reinsurance programs include catastrophe per occurrence excess of loss contracts and aggregate excess of loss contracts. We also purchase excess of loss reinsurance on our workers’ compensation insurance and our higher-limit commercial auto liability product offered by our Fleet & Specialty business and on certain BOP product coverages.\nWe evaluate our reinsurance programs during the renewal process, if not more frequently, to ensure our programs continue to effectively address the company’s risk tolerance. During the second quarter 2025, we entered into new reinsurance contracts under our per occurrence excess of loss program for our personal property business. This reinsurance program has a retention threshold for losses \nand allocated loss adjustment expenses (ALAE) from a single catastrophic event of $200 million for a storm outside of Florida and $75 million for a storm in Florida. In general, our program includes coverage for $2.0 billion in losses and ALAE with additional substantial coverage for a second or third hurricane. When considering coverage specific to Florida, including the Florida Hurricane Catastrophe Fund, this coverage reaches an estimated $2.2 billion. \nFor 2025, we also entered into a new catastrophe aggregate excess of loss reinsurance contract for claims occurring in 2025 that has multiple layers of coverage. The first retention layer threshold ranges from $450 million to $475 million, excluding named tropical storms and hurricanes, and the second retention layer threshold is $525 million, including named tropical storms and hurricanes. The first and second layers provide coverage up to $75 million and $100 million, respectively. As part of the 2025 aggregate excess of loss program, we also entered into a severe convective storm parametric loss aggregate coverage, which covers a type of thunderstorm characterized by strong winds, heavy rain, large hail, thunder, lightning, and \n35\nsometimes tornadoes. This parametric loss coverage provides $15 million of coverage, net of a retention of $665 million.\nWhile the total coverage limit and per-event retention will evolve to fit the growth of our business, we expect to remain a consistent purchaser of reinsurance coverage. While the availability of reinsurance is subject to many forces outside of our control, the types of reinsurance that we elected to purchase during the first nine months of 2025 were readily available and competitively priced. On a year-over-year basis, we did not incur a material change in the aggregate costs of our reinsurance programs. See \nItem 1A, Risk Factors\n in our 2024 Form 10-K for a discussion of certain risks related to catastrophe events. See \nItem 1, Business – Reinsurance\n in our 2024 Form 10-K for a discussion of our various reinsurance programs.\nThe following discussion of our severity and frequency trends in our personal auto business excludes comprehensive coverage because of its inherent volatility, as it is typically linked to catastrophic losses generally resulting from adverse weather. For our core commercial auto business, the reported frequency and severity trends include comprehensive coverage. Comprehensive coverage insures against damage to a customer’s vehicle due to various causes other than collision, such as windstorm, hail, theft, falling objects, and glass breakage.\nOn a calendar-year basis, the change in total personal auto incurred severity (i.e., average cost per claim, including both paid losses and the change in case reserves) over the prior-year period, was as follows:\nQuarter\nYear-to-date\nCoverage Type\n2025\n2025\nBodily injury\n11%\n10%\nCollision\n2\n3\nPersonal injury protection\n(1)\n(4)\nProperty damage\n7\n4\nTotal\n7\n6\nThe year-over-year increases in total severity was predominantly driven by increased bodily injury coverage reserves, compared to the same periods last year, due to higher medical costs and a higher rate of plaintiff-attorney represented injury claims.\nTo address inherent seasonality trends and lessen the effects of month-to-month variability in the commercial auto products, we use a trailing 12-month period in assessing severity. Since the loss patterns in the core commercial auto products are not indicative of our other commercial auto products (i.e., TNC and Fleet & Specialty \nbusinesses), disclosing severity and frequency trends excluding those businesses is more representative of our overall experience for the majority of our commercial products. As of the end of the third quarter 2025, our core commercial auto products’ trailing 12-month incurred severity increased 7%, compared to the same period last year, in part, due to increased medical costs.\nIt is a challenge to estimate future severity, but we continue to monitor changes in the underlying costs, such as tariffs, general inflation, used car prices, vehicle repair costs, medical costs, health care reform, court decisions, and jury verdicts, along with regulatory changes and other factors that may affect severity. \nThe change in total personal auto incurred frequency, on a calendar-year basis, over the prior-year period, was as follows:\nQuarter\nYear-to-date\nCoverage Type\n2025\n2025\nBodily injury\n(1)%\n0%\nCollision\n(5)\n(6)\nPersonal injury protection\n(3)\n(3)\nProperty damage\n0\n(1)\nTotal\n(2)\n(3)\nThe year-over-year decrease in frequency during the three and nine months ended September 30, 2025, in part, reflects a shift in the mix of business to a more preferred tier of customers (i.e., Wrights and Robinsons).\nOn a trailing 12-month basis, our core commercial auto products’ incurred frequency decreased 9% as of the end of the third quarter 2025, we believe, in part, due to a shift in the mix of business and lower vehicle miles traveled, compared to the same period last year.\nWe closely monitor changes in frequency, but the degree or direction of near-term frequency change is not something that we are able to predict with any certainty. We will continue to analyze trends to distinguish changes in our experience from other external factors, such as changes in the number of vehicles per household, miles driven, vehicle usage, gasoline prices, advances in vehicle safety, and unemployment rates, versus those resulting from shifts in the mix of our business, changes in driving patterns, and the ridesharing economy, to allow us to react quickly to price for these trends and to reserve more accurately for our loss exposures. \n36\nThe table below presents the actuarial adjustments implemented and the loss reserve development experienced on a companywide basis in the following periods:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n($ in millions)\n2025\n2024\n2025\n2024\nActuarial Adjustments\nReserve decrease (increase)\nPrior accident years\n$\n156 \n$\n(113)\n$\n254 \n$\n(232)\nCurrent accident year\n137 \n400 \n191 \n416 \nCalendar-year actuarial adjustments\n$\n293 \n$\n287 \n$\n445 \n$\n184 \nPrior Accident Years Development\nFavorable (unfavorable)\nActuarial adjustments\n$\n156 \n$\n(113)\n$\n254 \n$\n(232)\nAll other development\n305 \n249 \n814 \n431 \nTotal development\n$\n461 \n$\n136 \n$\n1,068 \n$\n199 \n(Increase) decrease to calendar-year combined ratio\n2.2 \n pts.\n0.7 \n pts.\n1.8 \n pts.\n0.4 \n pts.\nTotal development consists of both actuarial adjustments and “all other development” on prior accident years. We use “accident year” generically to represent the year in which a loss occurred. The actuarial adjustments represent the net changes made by our actuarial staff to both current and prior accident year reserves based on regularly scheduled reviews. Through these reviews, our actuaries identify and measure variances in the projected frequency and severity trends, which allow them to adjust the reserves to reflect current cost trends.\nFor the Personal Lines vehicle products and the Commercial Lines business, development for catastrophe losses would be reflected in “all other development,” discussed below, to the extent they relate to prior year reserves. For our Personal Lines property business, 100% of catastrophe losses are reviewed monthly, and any development on catastrophe reserves are included as part of the actuarial adjustments. We report these actuarial adjustments separately for the current and prior accident years to reflect these adjustments as part of the total prior accident years development.\n“All other development” represents claims settling for more or less than reserved, emergence of unrecorded claims at rates different than anticipated in our incurred but not recorded (IBNR) reserves, and changes in reserve estimates on specific claims. Although we believe the development from both the actuarial adjustments and “all other development” generally results from the same factors, we are unable to quantify the portion of the reserve development that might be applicable to any one or more of those underlying factors.\nOur objective is to establish case and IBNR reserves that are adequate to cover all loss costs, while incurring minimal variation from the date the reserves are initially established until losses are fully developed. Our ability to meet this objective is impacted by many factors, such as the factors impacting severity estimates described above and storms occurring close to quarter end.\nAs reflected in the table above, we experienced favorable prior accident years development during the first nine months of 2025 and 2024. The favorable development during the first nine months of 2025 was, in part, due to lower than anticipated severity and frequency in Florida, lower than anticipated litigation defense costs across most states, and lower than anticipated personal auto payments related to reopened property damage claims that were previously closed. \nSee \nNote 6 – Loss and Loss Adjustment Expense Reserve\ns to the consolidated financial statements for a more detailed discussion of our prior accident years reserve development and \nCritical Accounting Policies\n in our 2024 Annual Report to Shareholders for discussion of the application of estimates and assumptions in the establishment of our loss reserves.\nUnderwriting Expenses\nUnderwriting expenses include policy acquisition costs, other underwriting expenses, and policyholder credit expense. The underwriting expense ratio is our underwriting expenses, net of certain fees and other revenues, expressed as a percentage of net premiums earned. For the third quarter and first nine months of 2025, our underwriting expense ratio was up 4.2 points and 2.2 points, respectively, compared to the same periods last year. The increase for both periods was primarily attributable to the $950 million of Florida policyholder credit expense recorded in the third quarter 2025, and accounted for 4.6 and 1.6 points for the three and nine months ended September 30, 2025, respectively. \nDuring the third quarter and nine months ended September 30, 2025, our advertising spend was $1.3 billion and $3.8 billion, respectively, which was 10% and 36% greater than the same periods last year. As a result of the increase in net premiums earned during the periods, advertising spend contributed 0.2 less points to the underwriting expense ratio in the third quarter 2025, and 0.9 more points to the underwriting expense ratio for the nine months \n37\nended September 30, 2025, compared to the same periods last year.\nWe invested heavily in advertising during the first nine months of the year to capture consumer shopping, and will continue to advertise to maximize growth, as long as we remain on track to achieve our profitability goal and can acquire customers at or below our target acquisition cost.\nTo analyze underwriting expenses, we also review our non-acquisition expense ratio (NAER), which excludes costs related to policy acquisition (e.g., advertising and agency commissions) from our underwriting expense ratio. By excluding acquisition costs from our underwriting expense \nratio, we are able to understand costs other than those necessary to acquire new policies and grow the business. \nFor the third quarter 2025, our NAER increased 0.1 points, 0.6 points, and 1.7 points in our personal vehicle (excluding policyholder credit expense), personal property, and core commercial auto businesses, respectively, compared to the same period last year. On a year-to-date basis, our NAER decreased 0.1 points in our personal vehicle business (excluding policyholder expense), and increased 0.8 points in both our personal property and core commercial auto businesses. We remain committed to efficiently managing operational non-acquisition expenses. \n38\nC. Growth\nFor our underwriting operations, we analyze growth in terms of both premiums and policies. Net premiums written represent the premiums from policies written during the period, less any premiums ceded to reinsurers. Net premiums earned, which are a function of the premiums written in the current and prior periods, are earned as revenue over the life of the policy using a daily earnings convention. Policies in force, our preferred measure of growth since it removes the variability due to rate changes or mix shifts, represents all policies for which coverage was in effect as of the end of the period specified.\nThree Months Ended September 30,\nNine Months Ended September 30,\n($ in millions)\n2025\n2024\n% Growth\n2025\n2024\n% Growth\nNet Premiums Written\nPersonal Lines\nVehicles\nAgency\n$\n7,724 \n$\n7,104 \n9 \n%\n$\n22,678 \n$\n20,237 \n12 \n%\nDirect\n10,600 \n9,185 \n15 \n30,054 \n25,095 \n20 \nProperty\n824 \n788 \n5 \n2,402 \n2,352 \n2 \nTotal Personal Lines\n19,148 \n17,077 \n12 \n55,134 \n47,684 \n16 \nCommercial Lines\n2,234 \n2,378 \n(6)\n8,530 \n8,634 \n(1)\nOther indemnity\n1\n2 \n0 \nNM\n2 \n1 \nNM\nTotal underwriting operations\n$\n21,384 \n$\n19,455 \n10 \n%\n$\n63,666 \n$\n56,319 \n13 \n%\nNet Premiums Earned\nPersonal Lines\nVehicles\nAgency\n$\n7,480 \n$\n6,628 \n13 \n%\n$\n21,808 \n$\n18,699 \n17 \n%\nDirect\n9,819 \n8,180 \n20 \n28,193 \n22,796 \n24 \nProperty\n790 \n762 \n4 \n2,342 \n2,211 \n6 \nTotal Personal Lines\n18,089 \n15,570 \n16 \n52,343 \n43,706 \n20 \nCommercial Lines\n2,760 \n2,727 \n1 \n8,224 \n7,949 \n3 \nOther indemnity\n1\n0 \n0 \nNM\n1 \n0 \nNM\nTotal underwriting operations\n$\n20,849 \n$\n18,297 \n14 \n%\n$\n60,568 \n$\n51,655 \n17 \n%\nNM = Not meaningful\n1 \nIncludes other underwriting business and run-off operations.\nSeptember 30,\n(# in thousands)\n2025\n2024\n% Growth\nPolicies in Force\nPersonal Lines\nAgency - auto\n10,630 \n9,415 \n13 \n%\nDirect - auto\n15,619 \n13,388 \n17 \nSpecial lines\n6,980 \n6,475 \n8 \nProperty\n3,651 \n3,460 \n6 \nTotal Personal Lines\n36,880 \n32,738 \n13 \nCommercial Lines\n1,198 \n1,131 \n6 \nCompanywide total\n38,078 \n33,869 \n12 \n%\nTo analyze growth, we review new policies, rate levels, and the retention characteristics of our segments. Although new policies are necessary to maintain a growing book of business, we recognize the importance of retaining our current customers as a critical component of our continued growth.\n39\nD. Personal Lines\nOur Personal Lines business offers personal vehicle (personal auto and special lines) and residential property insurance products to consumers, with the operating goal of optimizing the number of insured products within our policyholders’ households. In our discussion below, we report our personal auto and personal property business results separately as components of our Personal Lines segment to provide a further understanding of our products. Our personal auto business discussions are further separated between the agency and direct distribution channels. For the three months ended September 30, 2025, 41% of our personal auto business was written through the agency channel and 59% was written through the direct channel. For the third quarter 2025, consumer segment results varied by channel, as discussed below, and our total personal auto business experienced overall growth in policies in force, while new business applications, quotes, and conversion were down, compared to the same period last year. Personal auto new business applications, quotes, and conversion increased on a year-over-year basis, for the nine months ended September 30, 2025.\nPersonal Auto - Agency\nThe year-over-year changes in our personal auto agency business were as follows:\nQuarter\nYear-to-date\n2025\n2024\n2025\n2024\nApplications\nNew\n(5)\n%\n98 \n%\n9 \n%\n22 \n%\nRenewal\n19 \n7 \n18 \n8 \nTotal\n13 \n20 \n16 \n11 \nWritten premium per policy\nNew\n(5)\n10 \n(5)\n6 \nRenewal\n(4)\n6 \n(2)\n12 \nTotal\n(4)\n5 \n(3)\n11 \nPolicy life expectancy\nTrailing 3 months\n(7)\n0 \nTrailing 12 months\n(5)\n8 \nThe personal auto agency business includes business written by more than 40,000 independent insurance agencies that represent Progressive, as well as brokerages in New York and California. During the third quarter 2025, we generated new agency personal auto application growth in 20 states and the District of Columbia, including four of our top 10 largest agency states. \nCompared to the same period in the prior year, the decrease in new applications during the third quarter 2025 was primarily driven by substantial declines for both Wrights and Robinsons, with a slight decline for Dianes, which was partially offset by a single-digit increase in Sams. For the first nine months of 2025, compared to the same period in the prior year, all consumer segments experienced an increase in new application growth, except for Robinsons who experienced a significant decline. Year-over-year policies in force growth at the end of the third quarter \n2025, was strong in all consumer segments except Robinsons, which saw a small increase due to restrictions on new homeowner applications.\nFor the third quarter and the nine months ended September 30, 2025, on a year-over-year basis, we experienced an increase in agency auto quote volume of 2% and 8%, respectively, with a rate of conversion (i.e., converting a quote to a sale) decrease of 6% for the quarter, with flat conversion on a year-to-date basis. For the third quarter 2025, Sams and Dianes experienced an increase in quote volume, compared to the same period in the prior year, while Wrights and Robinsons saw a single-digit decline. On a year-over-year basis for the first nine months of 2025, all consumer segments experienced an increase in quote volume except Robinsons, who saw a moderate decline. All consumer segments experienced a decrease in conversion for the third quarter 2025, with conversion declines in Wrights and Robinsons for the first nine months of 2025, compared to the same periods last year.\nThe decline in new applications, quotes, and conversion for Robinsons, compared to the prior year periods, was due to several initiatives implemented in our personal property business that were focused on improving profitability, as discussed in the \nPersonal Property\n section below. These initiatives, which began during the last half of 2024, focused primarily on home and condo coverages and impacted growth in bundled personal auto and homeowners policies.\nOur personal auto rates were relatively stable during the quarter. The decrease in written premium per policy for new and renewal personal auto agency business for the third quarter and first nine months of 2025, compared to the same periods last year, was, in part, attributable to rate decreases in certain markets, including Florida, and a shift in the mix of business, including a shift to a higher percentage of 6-month policies, which have about half of the amount of net premiums written as policies with 12-month terms.\nOur trailing 3- and 12-month policy life expectancy in the agency auto business experienced a decrease at the end of the third quarter 2025, on a year-over-year basis, which we believe is primarily driven by policy replacements due to increased consumer shopping and price sensitivity. As previously discussed, due, in part, to the efforts of our customer preservation team, during the period we saw an increase in existing customers who went through our new customer quote process to either modify existing coverage or to find a lower rate. As a result, some of these customers replaced their existing policies with new Progressive policies, which negatively impacted policy life expectancy, but retained the customer.\n40\nPersonal Auto - Direct\nThe year-over-year changes in our personal auto direct business were as follows:\nQuarter\nYear-to-date\n2025\n2024\n2025\n2024\nApplications\nNew\n0 \n%\n117 \n%\n13 \n%\n41 \n%\nRenewal\n21 \n10 \n22 \n10 \nTotal\n15 \n27 \n20 \n17 \nWritten premium per policy\nNew\n3 \n13 \n3 \n11 \nRenewal\n0 \n5 \n1 \n10 \nTotal\n1 \n5 \n1 \n9 \nPolicy life expectancy\nTrailing 3 months\n(7)\n(9)\nTrailing 12 months\n(6)\n(6)\nThe personal auto direct business includes business written directly by Progressive online or by phone. During the third quarter 2025, we generated new direct personal auto application growth in 27 states and the District of Columbia, including six of our top 10 largest direct states. Compared to the same periods in the prior year, all consumer segments experienced a decline in new applications, except Sams, who experienced moderate growth for the third quarter 2025, with all four consumer segments experiencing growth for the first nine months of 2025. Policies in force grew between 15% and 19% in each consumer segment, compared to the same period last year.\nFor the third quarter and first nine months of 2025, direct personal auto quote volume decreased 4% and increased 6%, respectively, with a rate of conversion increase of 4% and 6%, compared to the same periods last year, primarily driven by increased advertising spend and our competitiveness in the marketplace. For the third quarter 2025, all consumer segments experienced a decline in quote volume, except Robinsons, who experienced a slight increase, with all consumer segments experiencing quote volume growth for the first nine months of 2025, compared to the same periods last year. For the third quarter and first nine months of 2025, all consumer segments experienced an increase in conversion, except for Robinsons, who experienced a slight decline in both periods, compared to the same periods in the prior year. \nThe personal property profitability initiatives that negatively affected Robinsons new application, quote, and conversion growth in the agency channel were not as impactful to the direct channel as the majority of the property business bundles with personal auto in the direct channel is written through unaffiliated third-party carriers, which remain available even when we restrict writing our personal property products.\nOur personal auto rates were relatively stable during the quarter, resulting in relatively steady written premium per policy for the third quarter and first nine months of 2025, compared to the same periods last year.\nOur trailing 3- and 12-month policy life expectancy in the direct auto business experienced a decrease at the end of the third quarter 2025, on a year-over-year basis, which we believe is primarily due to increased shopping and price sensitivity where we saw an increase in the number of existing customers who went through our new customer quote process to either modify existing coverage or to find a lower rate. As a result, some of these customers replaced their existing policies with new Progressive policies, which negatively impacted policy life expectancy, but retained the customer.\nPersonal Property\nThe year-over-year changes in our personal property business were as follows:\nQuarter\nYear-to-date\n2025\n2024\n2025\n2024\nApplications\nNew\n(4)\n%\n42 \n%\n(5)\n%\n36 \n%\nRenewal\n13 \n3 \n13 \n5 \nTotal\n7 \n15 \n6 \n15 \nWritten premium per policy\nNew\n(16)\n(22)\n(31)\n(11)\nRenewal\n(6)\n1 \n(4)\n3 \nTotal\n(5)\n(9)\n(7)\n(4)\nPolicy life expectancy\nTrailing 12 months\n(15)\n(6)\nOur personal property business writes residential property insurance for homeowners and renters, umbrella, and flood insurance through the “Write Your Own” program for the National Flood Insurance Program. Our personal property business insurance is written in the agency and direct channels. \nIn addition to reducing our geographic footprint in more volatile weather-related markets (e.g., coastal and hail-prone states), we continued to focus on achieving profitability goals in markets that are less susceptible to catastrophes for our homeowners product, which we define as our total personal property business excluding renters and umbrella products. In the growth-oriented states, homeowners product policies in force increased 2% on a year-over-year basis as of September 30, 2025. Policies in force decreased 15% in the volatile weather states as of the end of the third quarter 2025, compared to the same period in the prior year. \nWe believe actions taken to address profitability adversely impacted new business application growth. During the first nine months of 2025, we continued several initiatives, including: (i) prioritizing insuring lower-risk properties (e.g., new construction, existing homes with newer roofs); (ii) having underwriting restrictions in place in most states, to only accept new homeowners product business when the property policy is bundled with a Progressive personal auto policy, where permitted; (iii) restricting new business and non-renewing policies that provide coverage for non-owner-occupied properties (e.g., short-term vacation rental, \n41\nsecondary residence, etc.) in the majority of states; and, (iv) expanding our cost sharing with policyholders through mandatory wind and hail deductibles and roof depreciation schedules in markets where permitted. During the third quarter 2025, we began to take actions in certain states to generate new business growth at the state level based on our concentration risks, product segmentation, rate adequacy, cost sharing execution, and regulatory and market conditions. Some of these actions include expanding agency relationships and reopening new business in certain agency and direct channel markets.\nOur written premium per policy decreased on a year-over-year basis for the third quarter and first nine months of 2025, primarily attributable to a shift in the mix of business to more renters policies, which have lower average written premiums, and a decline in homeowners policies in force in both volatile weather-related markets and non-owner-occupied properties, which both have higher average premiums. The effect of these declines were partially offset by rate increases taken during the last 12 months and higher premium coverages reflecting increased property values. During the third quarter 2025, we increased rates, in aggregate, about 2% in our personal property business, bringing the year-to-date aggregate rate increase to 8%. We intend to continue to make targeted rate increases in states where we are not achieving our profitability goals.\nThe policy life expectancy in our personal property business shortened as of the end of the third quarter 2025, compared to the same period last year, which we believe is primarily driven by a shift in the mix of business to more renters policies.\nE. Commercial Lines\nThe following table and discussion focuses on our core commercial auto products, which accounted for about 80% of our Commercial Lines segment net premiums written on a trailing 12-month basis, as of the end of the third quarter 2025. Year-over-year changes in our core commercial auto products were as follows:\nQuarter\nYear-to-date\n2025\n2024\n2025\n2024\nApplications\nNew\n(1)\n%\n11 \n%\n4 \n%\n6 \n%\nRenewal\n6 \n2 \n5 \n1 \nTotal\n4 \n5 \n5 \n3 \nWritten premium per policy\nNew\n(6)\n(3)\n(7)\n1 \nRenewal\n(7)\n5 \n(6)\n11 \nTotal\n(7)\n2 \n(6)\n7 \nPolicy life expectancy\nTrailing 12 months\n11 \n(20)\nFor the third quarter and first nine months of 2025, on a year-over-year basis, core commercial auto new application growth was positive in all BMTs, except for-hire transportation, which was impacted by rate and non-rate actions taken to address profitability challenges and, to a lesser extent, the continued decline in the number of active motor carriers in this BMT. Policies in force grew in all of our BMTs, except in the for-hire transportation and for-hire specialty BMTs, compared to the same period in the prior year. For the third quarter 2025, quote volume and the rate of conversion increased about 4% and decreased about 5%, respectively, in our core commercial auto products, compared to the same period in the prior year. On a year-over-year basis for the first nine months of 2025, quote volume increased 4%, while conversion was flat.\nThe effect the previously discussed rate increases had on written premium per policy for our core commercial auto business was offset by a shift in the mix of business, primarily driven by decreased demand for products in our for-hire transportation BMT. Written premium per policy was also impacted by a shift to a greater mix of policies with 6-month terms in our contractor and business auto BMTs, which have about half the amount of net premiums written as 12-month policies. During the third quarter 2025, we increased rates, in aggregate, about 2% in our core commercial auto products, bringing the year-to-date aggregate rate increase to 6%. We will continue to evaluate our rate need and adjust rates as we deem necessary.\nOur policy life expectancy increased in all BMTs, except in for-hire specialty, as of the end of the third quarter 2025, compared to the same period last year. As of the end of the third quarter 2025, policy life expectancy has experienced sequential month-over-month improvement since the end of the third quarter 2024. We believe this improvement is due to the moderation of our rate increases, compared to competitor rate increases, and various initiatives, such as payment and renewal reminders.\n42\nIV.  RESULTS OF OPERATIONS – INVESTMENTS\nA. Investment Results\nOur management philosophy governing the portfolio is to evaluate investment results on a total return basis. The fully taxable equivalent (FTE) total return includes recurring investment income, adjusted to a fully taxable amount for certain securities that receive preferential tax treatment (e.g., municipal securities), and total net realized, and changes in total net unrealized, gains (losses) on securities.\nThe following table summarizes investment results for the periods ended September 30:\n \nThree Months\nNine Months\n \n2025\n2024\n2025\n2024\nPretax recurring investment book yield (annualized)\n4.2 \n%\n4.0 \n%\n4.2 \n%\n3.8 \n%\nFTE total return:\nFixed-income securities\n1.5 \n3.9 \n5.8 \n5.1 \nCommon stocks\n8.1 \n5.8 \n13.8 \n20.3 \nTotal portfolio\n1.7 \n4.0 \n6.1 \n5.7 \nThe increase in the book yield, compared to last year, primarily reflected investing new cash from insurance operations, and proceeds from maturing bonds, in higher coupon rate securities. The change in the fixed-income portfolio FTE total return, compared to last year, primarily \nreflected movement in U.S. Treasury yields year-over-year. The common stock FTE total return reflected general market conditions.\nA further break-down of our FTE total returns for our fixed-income portfolio for the periods ended September 30, follows:\n \nThree Months\nNine Months\n \n2025\n2024\n2025\n2024\nFixed-income securities:\nU.S. government obligations\n1.3 \n%\n4.2 \n%\n6.1 \n%\n4.5 \n%\nState and local government obligations\n1.6 \n3.5 \n5.1 \n4.4 \nForeign government obligations\n(0.9)\n4.2 \n5.8 \n1.6 \nCorporate and other debt securities\n1.6 \n3.7 \n5.7 \n5.4 \nResidential mortgage-backed securities\n1.6 \n3.6 \n5.2 \n7.9 \nCommercial mortgage-backed securities\n2.0 \n4.1 \n6.3 \n9.2 \nOther asset-backed securities\n1.5 \n2.4 \n4.3 \n5.3 \nNonredeemable preferred stocks\n1.5 \n3.5 \n5.4 \n8.0 \nShort-term investments\n1.1 \n1.5 \n3.3 \n4.3 \n43\nB. Portfolio Allocation\nThe composition of the investment portfolio was:\n \n($ in millions)\nFair\nValue\n% of Total\nPortfolio\nDuration\n(years)\nAverage Rating\n1\nSeptember 30, 2025\nU.S. government obligations\n$\n51,339 \n54.3 \n%\n4.4\n AA+ \nState and local government obligations\n3,275 \n3.5 \n2.5\n AA+ \nForeign government obligations\n16 \n0 \n0.9\n AAA \nCorporate and other debt securities\n18,817 \n19.9 \n2.7\n BBB+ \nResidential mortgage-backed securities\n3,000 \n3.2 \n2.6\n AA+ \nCommercial mortgage-backed securities\n5,686 \n6.0 \n1.5\n AA- \nOther asset-backed securities\n6,376 \n6.7 \n1.3\n AA \nNonredeemable preferred stocks\n438 \n0.5 \n1.1\n BB+ \nShort-term investments\n1,515 \n1.6 \n0.1\n AA- \nTotal fixed-income securities\n90,462 \n95.7 \n3.4\n AA- \nCommon equities\n4,047 \n4.3 \nna\nna\nTotal portfolio\n2\n$\n94,509 \n100.0 \n%\n3.4\n AA- \nSeptember 30, 2024\nU.S. government obligations\n$\n44,429 \n56.0 \n%\n4.0\nAA+\nState and local government obligations\n2,601 \n3.3 \n2.7\nAA+\nForeign government obligations\n16 \n0 \n1.9\nAAA\nCorporate and other debt securities\n15,036 \n18.9 \n2.7\nBBB+\nResidential mortgage-backed securities\n1,424 \n1.8 \n2.9\nAA+\nCommercial mortgage-backed securities\n4,291 \n5.4 \n1.9\nA+\nOther asset-backed securities\n6,614 \n8.3 \n1.2\nAA+\nNonredeemable preferred stocks\n735 \n0.9 \n1.7\nBBB-\nShort-term investments\n757 \n1.0 \n<0.1\nAA-\nTotal fixed-income securities\n75,903 \n95.6 \n3.3\nAA-\nCommon equities\n3,497 \n4.4 \nna\nna\nTotal portfolio\n2\n$\n79,400 \n100.0 \n%\n3.3\nAA-\nDecember 31, 2024\nU.S. government obligations\n$\n45,988 \n57.3 \n%\n4.1\nAA+\nState and local government obligations\n2,778 \n3.5 \n2.5\nAA+\nForeign government obligations\n16 \n0 \n1.6\nAAA\nCorporate and other debt securities\n13,954 \n17.4 \n2.6\nBBB+\nResidential mortgage-backed securities\n1,601 \n2.0 \n2.6\nAA\nCommercial mortgage-backed securities\n4,352 \n5.4 \n1.9\nA+\nOther asset-backed securities\n6,643 \n8.3 \n1.2\nAA+\nNonredeemable preferred stocks\n728 \n0.9 \n1.4\nBBB-\nShort-term investments\n615 \n0.7 \n<0.1\nAA-\nTotal fixed-income securities\n76,675 \n95.5 \n3.3\nAA-\nCommon equities\n3,575 \n4.5 \nna\nna\nTotal portfolio\n2\n$\n80,250 \n100.0 \n%\n3.3\nAA-\nna = not applicable\n1 \nRepresents ratings at period end. Credit quality ratings are assigned by nationally recognized statistical rating organizations. To calculate the weighted average credit quality ratings, we weight individual securities based on fair value and assign a numeric score of 0-5, with non-investment-grade and non-rated securities assigned a score of 0-1. To the extent the weighted average of the ratings falls between AAA and AA+, we assign an internal rating of AAA-.\n2 \nAt September 30, 2025 and 2024 and December 31, 2024, we had $523 million, $469 million, and $125 million, respectively, of net unsettled security transactions included in accounts payable, accrued expenses, and other liabilities on our consolidated balance sheets. \n  The total fair value of the portfolio at September 30, 2025 and 2024 and December 31, 2024, included $4.9 billion, $4.1 billion, and $6.2 billion, respectively, of securities held in a consolidated, non-insurance subsidiary of the holding company, net of unsettled security transactions. A portion of the investments held at December 31, 2024 were sold and proceeds were used to pay our common share dividends in January 2025; see \nNote 9 – Dividends\n for additional information. \n44\nOur asset allocation strategy is to maintain 0%-25% of our portfolio in Group I securities, with the balance (75%-100%) of our portfolio in Group II securities.\nWe define Group I securities to include:\n•\ncommon equities,\n•\nnonredeemable preferred stocks,\n•\nredeemable preferred stocks, except for 50% of investment-grade redeemable preferred stocks with cumulative dividends, which are included in Group II, and\n•\nall other non-investment-grade fixed-maturity securities.\nGroup II securities include:\n•\nshort-term securities, and\n•\nall other fixed-maturity securities, including 50% of investment-grade redeemable preferred stocks with cumulative dividends.\nWe believe this asset allocation strategy allows us to appropriately assess the risks associated with these securities for capital purposes and is in line with the treatment by our regulators. \nThe following table shows the composition of our Group I and Group II securities:\n \nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\n($ in millions)\nFair\nValue\n% of Total\nPortfolio\nFair\nValue\n% of Total\nPortfolio\nFair\nValue\n% of Total\nPortfolio\nGroup I securities:\nNon-investment-grade fixed maturities\n$\n630 \n0.6 \n%\n$\n499 \n0.6 \n%\n$\n385 \n0.5 \n%\nNonredeemable preferred stocks\n438 \n0.5 \n735 \n0.9 \n728 \n0.9 \nCommon equities\n4,047 \n4.3 \n3,497 \n4.4 \n3,575 \n4.5 \nTotal Group I securities\n5,115 \n5.4 \n4,731 \n5.9 \n4,688 \n5.9 \nGroup II securities:\nOther fixed maturities\n87,879 \n93.0 \n73,912 \n93.1 \n74,947 \n93.4 \nShort-term investments\n1,515 \n1.6 \n757 \n1.0 \n615 \n0.7 \nTotal Group II securities\n89,394 \n94.6 \n74,669 \n94.1 \n75,562 \n94.1 \nTotal portfolio\n$\n94,509 \n100.0 \n%\n$\n79,400 \n100.0 \n%\n$\n80,250 \n100.0 \n%\nTo determine the allocation between Group I and Group II, we use the credit ratings from models provided by the National Association of Insurance Commissioners (NAIC) to classify our residential and commercial mortgage-backed securities, excluding interest-only (IO) securities, and the credit ratings from nationally recognized statistical rating organizations (NRSROs) to classify all other debt securities. NAIC ratings are based on a model that considers the book price of our securities when assessing the probability of future losses in assigning a credit rating. As a result, NAIC ratings can vary from credit ratings issued by NRSROs. Management believes NAIC ratings more accurately reflect our risk profile when determining the asset allocation between Group I and Group II securities.\nUnrealized Gains (Losses)\nAs of September 30, 2025, our fixed-maturity portfolio had a total after-tax net unrealized gain, which is recorded as part of accumulated other comprehensive income (loss) on our consolidated balance sheet, of $0.2 billion, compared to total after-tax net unrealized losses of $0.1 billion and $1.4 billion at September 30, 2024, and December 31, 2024, respectively. The improvement from total net unrealized losses at both prior periods to the September 30, 2025 total net unrealized gain balance, was due to valuation increases across all fixed-maturity sectors. Our U.S. Treasury, corporate and other debt, and commercial mortgage-backed portfolios had the most significant valuation increase. Lower interest rates and, in some cases, tighter credit spreads drove strong portfolio performance.\nSee \nNote 2 – Investments\n for a further break-out of our gross unrealized gains (losses).\n45\nHolding Period Gains (Losses)\nThe following table provides the balance and activity for both the gross and net holding period gains (losses) for the nine months ended September 30, 2025:\n(millions)\nGross Holding\nPeriod Gains\nGross Holding\nPeriod Losses\nNet Holding Period Gains (Losses)\nBalance at December 31, 2024\nHybrid fixed-maturity securities\n$\n8 \n$\n(12)\n$\n(4)\nEquity securities\n1\n2,838 \n(36)\n2,802 \nTotal holding period securities\n2,846 \n(48)\n2,798 \nCurrent year change in holding period securities\nHybrid fixed-maturity securities\n9 \n8 \n17 \nEquity securities\n1\n422 \n(1)\n421 \nTotal changes in holding period securities\n431 \n7 \n438 \nBalance at September 30, 2025\nHybrid fixed-maturity securities\n17 \n(4)\n13 \nEquity securities\n1\n3,260 \n(37)\n3,223 \nTotal holding period securities\n$\n3,277 \n$\n(41)\n$\n3,236 \n1\nEquity securities include common equities and nonredeemable preferred stocks. \nChanges in holding period gains (losses), similar to unrealized gains (losses) in our fixed-maturity portfolio, are the result of changes in market conditions as well as sales of securities based on various portfolio management decisions.\nFixed-Income Securities\nThe fixed-income portfolio is managed internally and includes fixed-maturity securities, short-term investments, and nonredeemable preferred stocks. Following are the primary exposures for our fixed-income portfolio.\nInterest Rate Risk\n  Our duration of 3.4 years at September 30, 2025 and 3.3 years at both September 30, 2024, and December 31, 2024, fell within our acceptable range of 1.5 to 5.0 years. The duration distribution of our fixed-income portfolio, excluding short-term investments, represented by the interest rate sensitivity of the comparable benchmark U.S. Treasury Notes, was: \nDuration Distribution \nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\n1 year\n10.8 \n%\n10.9 \n%\n9.6 \n%\n2 years\n8.1 \n9.9 \n8.2 \n3 years\n30.5 \n30.2 \n29.5 \n5 years\n30.2 \n38.8 \n43.6 \n7 years\n19.9 \n9.0 \n8.2 \n10 years\n0.5 \n1.2 \n0.9 \nTotal fixed-income portfolio\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCredit Risk\n  This exposure is managed by maintaining an A minimum weighted average portfolio credit quality rating, as defined by NRSROs. At September 30, 2025 and 2024, and December 31, 2024, our weighted average credit quality rating was AA-. The credit quality distribution of the fixed-income portfolio was:\nAverage Rating\n1\nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\nAAA\n12.5 \n%\n12.4 \n%\n12.6 \n%\nAA\n62.1 \n62.7 \n64.2 \nA\n8.1 \n7.3 \n6.4 \nBBB\n16.1 \n16.4 \n15.7 \nNon-investment grade/non-rated\nBB\n1.0 \n0.9 \n0.8 \nB\n0.1 \n0.2 \n0.2 \nNon-rated\n0.1 \n0.1 \n0.1 \nTotal fixed-income portfolio\n100.0 \n%\n100.0 \n%\n100.0 \n%\n1 \nThe credit quality ratings are assigned by NRSROs. \n46\nConcentration Risk\n  We did not have any investments in a single issuer, either overall or in the context of individual asset classes and sectors, that exceeded our thresholds during the third quarter 2025.\nPrepayment and Extension Risk\n  We did not experience significant adverse prepayment or extension of principal relative to our cash flow expectations in the portfolio during the third quarter 2025.\nLiquidity Risk\n  Our overall portfolio remains very liquid and we believe that it is sufficient to meet expected near-term liquidity requirements. The short-to-intermediate duration of our portfolio provides a source of liquidity. During the next 12 months, we expect approximately $9.6\n billion, or 25%,\n of principal repayment from our fixed-income portfolio, excluding U.S. Treasury Notes and short-term investments. Cash from interest and dividend \npayments provides an additional source of recurring liquidity.\nThe duration of our U.S. government obligations, which are included in the fixed-income portfolio, was comprised of the following at September 30, 2025:\n($ in millions)\nFair\nValue\nDuration\n(years)\nU.S. Treasury Notes\nLess than one year\n$\n258 \n0.5 \nOne to two years\n951 \n1.4 \nTwo to three years\n2,248 \n2.5 \nThree to five years\n27,220 \n3.7 \nFive to seven years\n20,661 \n5.7 \nSeven to ten years\n1 \n8.4 \nTotal U.S. Treasury Notes\n$\n51,339 \n4.4 \n    \nASSET-BACKED SECURITIES\nIncluded in our fixed-income portfolio are asset-backed securities, which were comprised of the following at the balance sheet dates listed:\n \n($ in millions)\nFair\nValue\nNet Unrealized\nGains (Losses)\n% of Asset-\nBacked\nSecurities\nDuration\n(years)\nAverage Rating\n(at period end)\n1\nSeptember 30, 2025\nResidential mortgage-backed securities\n$\n3,000 \n$\n20 \n19.9 \n%\n2.6 \n AA+ \nCommercial mortgage-backed securities\n5,686 \n(230)\n37.8 \n1.5 \n AA- \nOther asset-backed securities\n6,376 \n2 \n42.3 \n1.3 \n AA \nTotal asset-backed securities\n$\n15,062 \n$\n(208)\n100.0 \n%\n1.6 \n AA \nSeptember 30, 2024\nResidential mortgage-backed securities\n$\n1,424 \n$\n18 \n11.6 \n%\n2.9 \nAA+\nCommercial mortgage-backed securities\n4,291 \n(373)\n34.8 \n1.9 \nA+\nOther asset-backed securities\n6,614 \n(14)\n53.6 \n1.2 \nAA+\nTotal asset-backed securities\n$\n12,329 \n$\n(369)\n100.0 \n%\n1.6 \nAA\nDecember 31, 2024\nResidential mortgage-backed securities\n$\n1,601 \n$\n(2)\n12.7 \n%\n2.6 \nAA\nCommercial mortgage-backed securities\n4,352 \n(369)\n34.6 \n1.9 \nA+\nOther asset-backed securities\n6,643 \n(39)\n52.7 \n1.2 \nAA+\nTotal asset-backed securities\n$\n12,596 \n$\n(410)\n100.0 \n%\n1.6 \nAA\n1 \nThe credit quality ratings are assigned by NRSROs. \n47\nResidential Mortgage-Backed Securities (RMBS)\n The following table details the credit quality rating and fair value of our RMBS, along with the loan classification and a comparison of the fair value at September 30, 2025, to our original investment value (adjusted for returns of principal, amortization, and write-downs):\n($ in millions)\nAverage Rating\n1\nNon-Agency\nGovernment/GSE\n2\nTotal\n% of Total\nAAA\n$\n2,334 \n$\n0 \n$\n2,334 \n77.8 \n%\nAA\n109 \n1 \n110 \n3.7 \nA\n425 \n0 \n425 \n14.2 \nBBB\n129 \n0 \n129 \n4.3 \nNon-investment grade/non-rated:\nCCC and lower\n1 \n0 \n1 \n0 \nNon-rated\n1 \n0 \n1 \n0 \nTotal fair value\n$\n2,999 \n$\n1 \n$\n3,000 \n100.0 \n%\nIncrease (decrease) in value\n0.7 \n%\n(3.0)\n%\n0.7 \n%\n1 \nThe credit quality ratings are assigned by NRSROs; when we assigned the NAIC ratings for our RMBS, 90.9% of our non-investment-grade securities were rated investment grade and reported as Group II securities.\n2 \nThe securities in this category are insured by a Government Sponsored Entity (GSE) and/or collateralized by mortgage loans insured by the Federal Housing Administration (FHA) or the U.S. Department of Veteran Affairs (VA). \n.\nOur RMBS portfolio consists of deals that are backed by high-credit quality borrowers and/or those that have strong structural protections through underlying loan collateralization. During the third quarter of 2025,\n we continued to increase our exposure through purchases in both primary and secondary markets. Our additions were concentrated in high-quality investment-grade securities and contained both fixed-rate and adjustable-rate residential mortgages.\nCommercial Mortgage-Backed Securities (CMBS)\n The following table details the credit quality rating and fair value of our CMBS, along with a comparison of the fair value at September 30, 2025, to our original investment value (adjusted for returns of principal, amortization, and write-downs):\n($ in millions)\nAverage Rating\n1\nMulti-Borrower\nSingle-Borrower\nTotal\n% of Total\nAAA\n$\n118 \n$\n2,751 \n$\n2,869 \n50.5 \n%\nAA\n0 \n984 \n984 \n17.3 \nA\n0 \n591 \n591 \n10.4 \nBBB\n0 \n878 \n878 \n15.4 \nNon-investment grade/non-rated:\nBB\n0 \n351 \n351 \n6.2 \nB\n0 \n13 \n13 \n0.2 \nTotal fair value\n$\n118 \n$\n5,568 \n$\n5,686 \n100.0 \n%\nIncrease (decrease) in value\n(4.7)\n%\n(3.9)\n%\n(3.9)\n%\n1 \nThe credit quality ratings are assigned by NRSROs; when we assigned the NAIC ratings for our CMBS, 91% of our non-investment-grade securities were rated investment grade and reported as Group II securities, with the remainder classified as Group I.\nAt September 30, 2025, the CMBS portfolio fair value was $5.7 billion, which increased from $5.0 billion at June 30, 2025. The majority of this increase was due to purchases of investment-grade single-borrower securities in new issue markets across the apartment, logistics, life sciences, and grocery-anchored retail sectors. Overall, CMBS credit spreads remained unchanged during the quarter and there was an increase in new issuances in the market. As of September 30, 2025, we had no delinquencies in our CMBS portfolio.\n48\nThe following table shows the composition of our CMBS portfolio by maturity year and sector at September 30, 2025:\n \n($ in millions)\nMaturity\n1\nOffice\nLab Office\nMulti-family\nMulti-family IO\nIndustrial\nSelf- Storage\nCasino\nData Center\nRetail\nHotel\nTotal\nAverage Original LTV\nAverage Current DSCR\n2025\n$\n0 \n$\n0 \n$\n0 \n$\n10 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \n$\n10 \n2026\n184 \n47 \n165 \n36 \n0 \n100 \n114 \n0 \n0 \n0 \n646 \n65.6 \n%\n1.3\n2027\n390 \n0 \n62 \n32 \n0 \n186 \n0 \n0 \n0 \n0 \n670 \n62.1 \n2.0\n2028\n289 \n0 \n0 \n24 \n0 \n119 \n0 \n0 \n0 \n0 \n432 \n66.0 \n2.2\n2029\n505 \n254 \n595 \n12 \n445 \n239 \n72 \n0 \n0 \n0 \n2,122 \n63.4 \n2.1\n2030\n109 \n204 \n201 \n4 \n377 \n0 \n100 \n66 \n343 \n37 \n1,441 \n63.7 \n2.0\n2031\n249 \n96 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n345 \n66.5 \n2.2\n2032\n20 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n0 \n20 \n68.0 \n1.7\nTotal fair value\n$\n1,746 \n$\n601 \n$\n1,023 \n$\n118 \n$\n822 \n$\n644 \n$\n286 \n$\n66 \n$\n343 \n$\n37 \n$\n5,686 \nLTV= loan to value\nDSCR= \ndebt service coverage ratio\n1 \nThe floating-rate securities were extended to their full maturity and fixed-rate securities are shown to their anticipated repayment date (if applicable) or their maturity date. \nWe show the average loan to value (LTV) of each maturity year when the loans were originated. The LTV ratio that management uses, which is commonly expressed as a percentage, compares the size of the entire mortgage loan to the appraised value of the underlying property collateralizing the loan at issuance. A LTV ratio less than 100% indicates excess collateral value over the loan amount. LTV ratios greater than 100% indicate that the loan amount exceeds the collateral value. We believe this ratio provides a conservative view of our actual risk of loss, as this number displays the entire mortgage LTV, while our ownership is only a portion of the structure of the mortgage loan-backed security. For many of the mortgage loans in our portfolio, our exposure is in a more senior part of the structure, which means that the LTV on our actual exposure is even lower than the ratios presented. \nIn addition to the LTV ratio, we also examine the credit of our CMBS portfolio by reviewing the debt service coverage ratio (DSCR) of the securities. The DSCR compares the underlying property\n’\ns annual net operating income to its annual debt service payments. A DSCR less than 1.0 times indicates that property operations do not generate enough income over the debt service payments, while a DSCR greater than 1.0 times indicates that there is an excess of operating income over the debt service payments. A number above 1.0 generally indicates that there would not be an incentive for the borrower to default in light of the borrower\n’\ns excess income. The DSCR reported in the table is calculated based on the most currently available net operating income and mortgage payments for the borrower. \nOther Asset-Backed Securities (OABS)\n The following table details the credit quality rating and fair value \nof our OABS, along with a comparison of the fair value at September 30, 2025, to our original investment value (adjusted for returns of principal, amortization, and write-downs):\n($ in millions)\nAverage Rating\nAutomobile\nCollateralized Loan Obligations\nStudent Loan\nWhole Business Securitizations\nEquipment\nOther\nTotal\n% of\nTotal\nAAA\n$\n2,609 \n$\n397 \n$\n43 \n$\n0 \n$\n861 \n$\n262 \n$\n4,172 \n65.4 \n%\nAA\n3 \n36 \n2 \n0 \n42 \n0 \n83 \n1.3 \nA\n0 \n0 \n0 \n0 \n159 \n597 \n756 \n11.9 \nBBB\n0 \n0 \n0 \n1,289 \n0 \n40 \n1,329 \n20.8 \nNon-investment grade/non-rated:\nBB\n0 \n0 \n0 \n0 \n0 \n36 \n36 \n0.6 \nTotal fair value\n$\n2,612 \n$\n433 \n$\n45 \n$\n1,289 \n$\n1,062 \n$\n935 \n$\n6,376 \n100.0 \n%\nIncrease (decrease) in value\n0.5 \n%\n0 \n%\n(4.4)\n%\n(1.2)\n%\n0.5 \n%\n0 \n%\n0 \n%\nAt September 30, 2025, the OABS portfolio fair value was $6.4 billion, which decreased from $6.7 billion at June 30, 2025. The net decline was primarily due to principal paydowns on securities, which were partially offset by security purchases during the third quarter 2025. We selectively added securities to the OABS portfolio that we viewed as having attractive spreads and potential returns. The securities we acquired were predominantly in the automobile, equipment, and collateralized loan obligations categories in highly-rated senior and short-tenor debt tranches. Additions were primarily made in new issue markets with some selective secondary purchases.\n49\nSTATE AND LOCAL GOVERNMENT OBLIGATIONS\nThe following table details the credit quality rating of our state and local government obligations (municipal securities) at September 30, 2025, without the benefit of credit or bond insurance:\n(millions)\nAverage Rating\nGeneral\nObligations\nRevenue\nBonds\nTotal\nAAA\n$\n782 \n$\n576 \n$\n1,358 \nAA\n544 \n1,180 \n1,724 \nA\n0 \n193 \n193 \nTotal fair value\n$\n1,326 \n$\n1,949 \n$\n3,275 \nIncluded in the fair value of revenue bonds were $842 million of single-family housing revenue bonds issued by state housing finance agencies, of which $396 million were supported by individual mortgages held by the state housing finance agencies and $446 million were supported by mortgage-backed securities. \nOf the revenue bonds supported by individual mortgages held by the state housing finance agencies, the overall credit quality rating was AA+. Most of these mortgages were supported by the Federal Housing Administration, the U.S. Department of Veterans Affairs, or private mortgage insurance providers. Of the revenue bonds supported by mortgage-backed securities, 78% were collateralized by Ginnie Mae mortgages, which are fully guaranteed by the U.S. government; the remaining 22% were collateralized by Fannie Mae and Freddie Mac mortgages. \nThe broader risk rally in the third quarter 2025 contributed to tighter credit spreads in municipal securities. During the third quarter 2025, we continued to selectively add short duration bonds to the portfolio in higher quality issuers.\nCORPORATE AND OTHER DEBT SECURITIES\nThe following table details the credit quality rating of our corporate and other debt securities at September 30, 2025: \n(millions)\nAverage Rating\nConsumer\nIndustrial\nCommunication\nFinancial Services\nTechnology\nBasic Materials\nEnergy\nTotal\nAAA\n$\n39 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \n$\n69 \n$\n108 \nAA\n92 \n0 \n0 \n1,074 \n0 \n0 \n44 \n1,210 \nA\n794 \n497 \n120 \n3,122 \n209 \n120 \n522 \n5,384 \nBBB\n3,958 \n1,852 \n391 \n2,153 \n1,570 \n131 \n1,500 \n11,555 \nNon-investment grade/non-rated:\nBB\n196 \n126 \n60 \n0 \n3 \n20 \n46 \n451 \nB\n104 \n0 \n0 \n0 \n0 \n0 \n0 \n104 \nNon-rated\n0 \n0 \n0 \n2 \n3 \n0 \n0 \n5 \nTotal fair value\n$\n5,183 \n$\n2,475 \n$\n571 \n$\n6,351 \n$\n1,785 \n$\n271 \n$\n2,181 \n$\n18,817 \nThe fair value of our corporate and other debt portfolio increased to $18.8 billion at September 30, 2025, from $18.1 billion at \nJune 30, 2025. At both September 30, 2025 and June 30, 2025, corporate and other debt securities made up approximately 21%, of our fixed-income portfolio. We generally view shorter maturity securities as having more favorable risk/reward profiles, and the average duration of our corporate and other debt portfolio decreased slightly to 2.7 years at September 30, 2025, from 2.8 years at June 30, 2025.\nNONREDEEMABLE PREFERRED STOCKS\nThe table below shows the exposure break-down of our nonredeemable preferred stocks by sector and rating at September 30, 2025:\nFinancial Services\n(millions)\nAverage Rating\nU.S.\nBanks\nForeign\nBanks\nInsurance\nOther Financial\nIndustrials\nUtilities\nTotal\nBBB\n$\n226 \n$\n14 \n$\n0 \n$\n33 \n$\n0 \n$\n39 \n$\n312 \nNon-investment grade/non-rated:\nBB\n66 \n0 \n0 \n0 \n0 \n0 \n66 \nNon-rated\n0 \n0 \n20 \n23 \n17 \n0 \n60 \nTotal fair value\n$\n292 \n$\n14 \n$\n20 \n$\n56 \n$\n17 \n$\n39 \n$\n438 \n50\nThe majority of our nonredeemable preferred securities have fixed-rate dividends until a call date and then, if not called, generally convert to floating-rate dividends. The interest rate duration is calculated to reflect the call, floor, and floating-rate features. Although a nonredeemable preferred stock will remain outstanding if not called, its interest rate duration will reflect the variable nature of the dividend. At September 30, 2025, our non-investment-grade nonredeemable preferred stocks were with issuers that maintain investment-grade senior debt ratings.\nWe also face the risk that dividend payments could be deferred for one or more periods or skipped entirely. As of September 30, 2025, we expect all of these securities to pay their dividends in full and on time. Approximately 97% of our nonredeemable preferred stocks pay dividends that have tax preferential characteristics, while the balance pay dividends that are fully taxable.\nAt September 30, 2025, the nonredeemable preferred stock portfolio fair value was $0.4 billion, which is a slight decrease from $0.5 billion at June 30, 2025. This decline was primarily due to nonredeemable preferred stocks that were called during the quarter.\nCommon Equities\nCommon equities, as reported on our consolidated balance sheets, were comprised of the following:\n \n($ in millions)\nSeptember 30, 2025\nSeptember 30, 2024\nDecember 31, 2024\nCommon stocks\n$\n4,013 \n99.2 \n%\n$\n3,474 \n99.4 \n%\n$\n3,550 \n99.3 \n%\nOther risk investments\n1\n34 \n0.8 \n23 \n0.6 \n25 \n0.7 \nTotal common equities\n$\n4,047 \n100.0 \n%\n$\n3,497 \n100.0 \n%\n$\n3,575 \n100.0 \n%\n1 \nThe other risk investments consist of limited partnership interests.\nThe majority of our common stock portfolio consists of individual holdings selected based on their contribution to the correlation with the Russell 1000 Index. We held 651 out of 1,011, or 64%, of the common stocks comprising the index at September 30, 2025, which made up 89% of the total market capitalization of the index. At September 30, 2025, the year-to-date GAAP income total return was within our targeted tracking error of +/- 50 basis points. The year-to-date and full-year, as applicable, GAAP income total return did not meet our targeted tracking error as of September 30, 2024 and December 31, 2024, respectively. \n51\nSafe Harbor Statement Under the Private Securities Litigation Reform Act of 1995:\n \nInvestors are cautioned that certain statements in this report not based upon historical fact are forward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. These statements often use words such as “estimate,” “expect,” “intend,” “plan,” “believe,” “goal,” “target,” “anticipate,” “will,” “could,” “likely,” “may,” “should,” and other words and terms of similar meaning, or are tied to future periods, in connection with a discussion of future operating or financial performance. Forward-looking statements are not guarantees of future performance, are based on current expectations and projections about future events, and are subject to certain risks, assumptions and uncertainties that could cause actual events and results to differ materially from those discussed herein. These risks and uncertainties include, without limitation, uncertainties related to:\n•\nour ability to underwrite and price risks accurately and to charge adequate rates to policyholders;\n•\nour ability to establish accurate loss reserves;\n•\nthe impact of severe weather, other catastrophe events, and climate change;\n•\nthe effectiveness of our reinsurance programs and the continued availability of reinsurance and performance by reinsurers;\n•\nthe secure and uninterrupted operation of the systems, facilities, and business functions and the operation of various third-party systems that are critical to our business;\n•\nthe impacts of a security breach or other attack involving our technology systems or the systems of one or more of our vendors;\n•\nour ability to maintain a recognized and trusted brand and reputation;\n•\nwhether we innovate effectively and respond to our competitors’ initiatives;\n•\nwhether we effectively manage complexity as we develop and deliver products and customer experiences;\n•\nthe highly competitive nature of property-casualty insurance markets;\n•\nwhether we adjust claims accurately;\n•\ncompliance with complex and changing laws and regulations;\n•\nthe impact of misconduct or fraudulent acts by employees, agents, and third parties to our business and/or exposure to regulatory assessments;\n•\nour ability to attract, develop, and retain talent and maintain appropriate staffing levels;\n•\nlitigation challenging our business practices, and those of our competitors and other companies;\n•\nthe success of our business strategy and efforts to acquire or develop new products or enter into new areas of business and our ability to navigate the related risks;\n•\nhow intellectual property rights affect our competitiveness and our business operations;\n•\nthe success of our development and use of new technology and our ability to navigate the related risks;\n•\nthe performance of our fixed-income and equity investment portfolios;\n•\nthe impact on our investment returns and strategies from regulations and societal pressures relating to environmental, social, governance and other public policy matters;\n•\nour continued ability to access our cash accounts and/or convert investments into cash on favorable terms;\n•\nthe impact if one or more parties with which we enter into significant contracts or transact business fail to perform;\n•\nlegal restrictions on our insurance subsidiaries’ ability to pay dividends to The Progressive Corporation;\n•\nour ability to obtain capital when necessary to support our business, our financial condition, and potential growth;\n•\nevaluations and ratings by credit rating and other rating agencies;\n•\nthe variable nature of our common share dividend policy;\n•\nwhether our investments in certain tax-advantaged projects generate the anticipated returns;\n•\nthe impact from not managing to short-term earnings expectations in light of our goal to maximize the long-term value of the enterprise;\n•\nthe impacts of epidemics, pandemics, or other widespread health risks; and\n•\nother matters described from time to time in our releases and publications, and in our periodic reports and other documents filed with the United States Securities and Exchange Commission, including, without limitation, the Risk Factors section of our Annual Report on Form 10-K for the year ending December 31, 2024.\nAny forward-looking statements are made only as of the date presented. Except as required by applicable law, we undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or developments or otherwise.\nIn addition, investors should be aware that accounting principles generally accepted in the United States prescribe when a company may reserve for particular risks, including litigation exposures. Accordingly, results for a given reporting period could be significantly affected if and when we establish reserves for one or more contingencies. Also, our regular reserve reviews may result in adjustments of varying magnitude as additional information regarding claims activity becomes known. Reported results, therefore, may be volatile in certain accounting periods.\n52"
}