{
  "item1": "ITEM 1 Parker global leader motion control technologies. Leveraging unique combination interconnected technologies, design, manufacture, provide aftermarket support highly engineered solutions create value customers primarily aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, HVAC & refrigeration markets around world. Parker values having decentralized operating structure fosters deeper connections customers greater engagement among team members. align operations achieve goal top quartile performance, deploy business system, Win Strategy TM , which establishes goals strategies engaged people, customer experience, profitable growth financial performance.",
  "item7": "Long-Lived Assets - test goodwill impairment reporting unit level annual basis between annual tests whenever events circumstances indicate carrying value reporting unit may exceed its fair value. five reporting units equivalent operating segments. quoted market prices not available reporting units, determining whether impairment occurred requires valuation respective reporting unit, which estimated using both income-based market-based valuation methods. income-based valuation method utilizes discounted cash flow model which requires several assumptions, including future sales growth operating margin levels well assumptions regarding future industry-specific market conditions.",
  "item2": "change economic conditions individual markets may particularly volatile effect segment performance. Among other factors which may affect future performance are: changes business relationships orders major customers, suppliers distributors, including delays cancellations shipments; disputes regarding contract terms, changes contract costs revenue estimates new development programs; changes product mix; ability identify acceptable strategic acquisition targets; uncertainties surrounding timing, successful completion integration acquisitions similar transactions; including integration Curtis Instruments, Inc.; ability successfully divest businesses planned divestiture realize anticipated benefits such divestitures; determination ability successfully undertake business realignment activities expected costs, including cost savings, thereof; ability implement successfully business operating initiatives, including timing, price execution share repurchases other capital initiatives; availability, cost increases other limitations access raw materials, component products and/or commodities if associated costs cannot recovered product pricing; ability manage costs related insurance employee retirement health care benefits; legal regulatory developments other government actions, including related environmental protection, associated compliance costs; supply chain labor disruptions, including result tariffs labor shortages; threats associated international conflicts cybersecurity risks risks associated protecting intellectual property; uncertainties surrounding ultimate resolution outstanding legal proceedings, including outcome any appeals; effects market conditions, including sales pricing, resulting global reactions U.S. trade policies; manufacturing activity, air travel trends, currency exchange rates, difficulties entering new markets economic conditions such inflation, deflation, interest rates credit availability; inability obtain, meet conditions imposed for, required governmental regulatory approvals; changes tax laws United States foreign jurisdictions judicial regulatory interpretations thereof; large scale disasters, such floods, earthquakes, hurricanes, industrial accidents pandemics. ITEM 2."
}