{
  "source_file": "ph-20250630.htm",
  "form_type": "10-K",
  "item1": "ITEM 1\n.  \nBusiness\nParker-Hannifin Corporation was incorporated in Ohio in 1938.  As used in this Annual Report on Form 10-K, unless the context otherwise requires, the terms \"Company\", \"Parker\", \"we\" or \"us\" refer to Parker-Hannifin Corporation and its subsidiaries, and the term \"year\" and references to specific years refer to the applicable fiscal year.\nParker is a global leader in motion and control technologies. Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC & refrigeration markets around the world. \nParker values having a decentralized operating structure that fosters deeper connections with our customers and greater engagement among our team members. To align our operations and achieve our goal of top quartile performance, we deploy our business system, The Win Strategy\nTM\n, which establishes goals and strategies for engaged people, customer experience, profitable growth and financial performance. Underpinning this business system is our culture of safety, collaboration, continuous improvement, and team-based problem solving. Together our goals, strategies, and culture help us to fulfill our purpose: Enabling Engineering Breakthroughs that Lead to a Better Tomorrow. We credit the Win Strategy with leading Parker through a period of sustained operational excellence and transformation and believe it is the foundation for achieving our future goals.\nOur investor relations website address is \ninvestors.parker.com\n. We make available free of charge on or through our website our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as soon as reasonably practicable after filing or furnishing those reports electronically with the Securities and Exchange Commission. The information contained on or accessible through our website is not part of this Annual Report on Form 10-K.\nOur Board of Directors has adopted a written charter for each of its committees. These charters, as well as our Global Code of Business Conduct, Corporate Governance Guidelines and Independence Standards for Directors, are posted and available on our investor relations website under the Governance page. Shareholders may request copies of these corporate governance documents, free of charge, by writing to our principal executive offices located at Parker-Hannifin Corporation, 6035 Parkland Boulevard, Cleveland, Ohio 44124-4141, Attention: Secretary, or by calling (216) 896-3000.\nMarkets\nOur interconnected technologies and solutions provide value for customers across our market verticals including aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration.  We serve several hundred thousand OEM and distribution customer locations.\nReportable Segments\nWe have two reportable segments: Diversified Industrial and Aerospace Systems.  Of the Company's $19.9 billion in net sales for fiscal year 2025, Diversified Industrial Segment products accounted for 69 percent and Aerospace Systems Segment products accounted for 31 percent.\nDiversified Industrial Segment\n.\n  Our Diversified Industrial Segment, which is an aggregation of several business units, sells highly engineered differentiated products to both original equipment manufacturers (\"OEMs\") and distributors who serve the aftermarket replacement markets.  The major market verticals served by our Diversified Industrial Segment are listed below:\n•\nAerospace & Defense\n•\nOff-highway\n•\nIn-plant & Industrial Equipment\n•\nEnergy\n•\nTransportation\n•\nHVAC & Refrigeration\n2\nTable of Contents\nAerospace Systems Segment\n.\n  Our Aerospace Systems Segment sells highly engineered, differentiated airframe and engine components and systems to OEMs and aftermarket parts and maintenance directly to end users primarily in the commercial aerospace and defense market verticals.  The major market platforms served by our Aerospace Systems Segment are listed below:\n•\nCommercial Transport\n•\nRegional Transport\n•\nDefense Fixed Wing\n•\nHelicopters\n•\nBusiness Jets\n•\nEnergy\nPrincipal Products and Methods of Distribution\nWe offer hundreds of thousands of individual part numbers, and no single product contributed more than one percent to our total net sales for the year ended June 30, 2025.  Listed below are some of our principal products.\nDiversified Industrial Segment\n.\n  Our Diversified Industrial Segment products consist of a broad range of motion-control systems and components, which are described below: \n•\nActive & Passive Vibration Control\n•\nHigh Purity Sealing\n•\nCoatings\n•\nHigh Temperature Sealing\n•\nCryogenic Valves & Fittings\n•\nHVAC/R Controls & Monitoring\n•\nElastomeric, Fabric Reinforced, Metal, & Precision Cut Seals\n•\nHydrogen & Natural Gas Filters\n•\nElectric & Hydraulic Pumps & Motors\n•\nIndustrial Air & Gas Filtration\n•\nElectric & Hydraulic Valves\n•\nMiniature Pumps & Valves\n•\nElectromagnetic Interface Shielding\n•\nPneumatic Actuators, Regulators & Valves\n•\nElectromechanical & Hydraulic Actuators\n•\nPower Take Offs\n•\nElectronics, Drives & Controllers\n•\nProcess Filtration Solutions\n•\nEngine Filtration Solutions\n•\nRubber to Substrate Adhesives\n•\nFluid Condition Monitoring\n•\nSensors & Diagnostics\n•\nFluid Conveyance Hose & Tubing\n•\nStructural Adhesives\n•\nHigh Pressure Connectors, Fittings, Valves & Regulators\n•\nThermal Management\n•\nHigh Purity Fittings, Valves & Regulators\nDiversified Industrial Segment products include standard products, as well as custom products which are engineered and produced to OEM specifications for application to particular end products.  Standard and custom products are also used in the replacement of original products.  We market our Diversified Industrial Segment products primarily through field sales employees and independent distributors located throughout the world.\nAerospace Systems Segment\n.\n  Our Aerospace Systems Segment products are used in commercial and defense airframe and engine programs and include:\n•\nAvionics\n•\nFuel Systems & Components\n•\nElectric & Hydraulic Braking Systems\n•\nFuel Tank Inerting Systems\n•\nElectric Power\n•\nHydraulic Pumps & Motors\n•\nElectromechanical Actuators\n•\nHydraulic Valves & Actuators\n•\nEngine Exhaust Systems & Components\n•\nPneumatics\n•\nFire Detection & Suppression\n•\nSeals\n•\nFlight Control Systems\n•\nSensors\n•\nFluid Conveyance\n•\nThermal Management\nWe market our Aerospace Systems Segment products through our regional sales organizations, which sell directly to OEMs and end users throughout the world.\n3\nTable of Contents\nCompetition\nParker operates in highly competitive markets and industries.  We offer our products over numerous, varied markets through our divisions operating in 43 countries.  Our global scope means that we have hundreds of competitors across our various markets and product offerings.  Our competitors include U.S. and non-U.S. companies.  These competitors and the degree of competition vary widely by product lines, end markets, geographic scope and/or geographic locations.  Although each of our segments has numerous competitors, given our market and product breadth, no single competitor competes with the Company with respect to all the products we manufacture and sell.\nIn the Diversified Industrial Segment, Parker competes based on product quality and innovation, customer experience, manufacturing and distribution capability, aftermarket support, and price competitiveness.  We believe that we are one of the market leaders in most of the major markets for our most significant Diversified Industrial Segment products.  We have comprehensive motion and control technologies allowing us to provide the broadest systems capabilities.  While our primary global competitors include Bosch Rexroth AG, Danaher Corporation, Danfoss A/S, Donaldson Company, Inc., Emerson Climate Technologies, Inc., Emerson/ASCO, Festo AG & Co., Freudenberg-NOK, Gates Corporation, IMI/Norgren, SMC Corporation, Swagelok Company, and Trelleborg AB, none of these businesses compete with every group or product in our Diversified Industrial Segment.\nIn the Aerospace Systems Segment, we have developed relationships with key customers based on our advanced technological and engineering capabilities, performance in quality, delivery, service, and price competitiveness.  This has enabled us to obtain significant original equipment business on new aircraft programs for our systems and components, as well as the follow-on repair and replacement business for these programs.  Further, the Aerospace Systems Segment utilizes design and manufacturing techniques as well as best cost region and supply chain management strategies to reduce cost.  Although we believe that we are one of the market leaders in most of the major markets for our most significant Aerospace Systems Segment products, primary global competitors for these products include Crane Co., Eaton Corporation plc, Honeywell International, Inc., Moog Inc., RTX Corporation, Safran S.A., Senior plc, Triumph Group, Inc., and Woodward, Inc.\nAcross our two segments, we believe that our broad-based portfolio of core technologies, which consist of hydraulics, pneumatics, electromechanical, filtration, fluid & gas handling, process control, engineered materials, and climate control, is a positive factor in our ability to compete effectively with both large and small competitors.  We believe that the following factors also contribute to our ability to compete effectively:\n•\nOur business system, The Win Strategy\n•\nTechnology powerhouse of interconnected solutions\n•\nDeep partnerships with our customers to develop innovative products\n•\nApplication engineering expertise\n•\nGlobal distribution network\n•\nDecentralized operating structure\nPatents, Trademarks, Trade Names, Copyrights, Trade Secrets, Licenses\nWe own a number of patents, trademarks, trade names, copyrights, trade secrets and licenses related to our products.  We also have exclusive and non-exclusive rights to use patents, trademarks, trade names, copyrights and trade secrets owned by others.  In addition, patent and trademark applications are pending, although there can be no assurance that further patents and trademarks will be issued.  We do not depend on any single patent, trademark, copyright, trade secret or license or group of patents, trademarks, copyrights, trade secrets or licenses to any material extent.\nBacklog and Seasonal Nature of Business\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.  Our backlog by business segment for the past two years is included in Part II, Item 7 of this Annual Report on Form 10-K and is incorporated herein by reference.  Our backlog was $11.0 billion at June 30, 2025 and $10.9 billion at June 30, 2024.  Approximately 71 percent of our backlog at June 30, 2025 is scheduled for delivery in the succeeding twelve months.  Because of the breadth and global scope of our business, our overall business is generally not seasonal in nature.\nEnvironmental Regulation\nCertain of our operations require the use and handling of hazardous materials and, as a result, the Company is subject to United States federal, state, and local laws and regulations as well as non-U.S. laws and regulations designed to protect the \n4\nTable of Contents\nenvironment and regulate the discharge of materials into the environment.  These laws impose penalties, fines and other sanctions for non-compliance and liability for response costs, property damage and personal injury resulting from past and current spills, disposals or other releases of, or exposures to, hazardous materials.  Among other environmental laws, we are subject to the United States federal \"Superfund\" law, under which we have been designated as a \"potentially responsible party\" and may be liable for cleanup costs associated with various waste sites, some of which are on the United States Environmental Protection Agency’s Superfund priority list.\nAs of June 30, 2025, Parker was involved in environmental remediation and litigation at various U.S. and non-U.S. manufacturing facilities presently or formerly operated by us and as a \"potentially responsible party,\" along with other companies, at off-site waste disposal facilities and regional sites.\nWe believe that our policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage and the consequent financial liability to the Company.  Compliance with environmental laws and regulations requires continuing management efforts and expenditures by the Company.  Compliance with environmental laws and regulations has not had in the past, and, we believe, will not have in the future, a material adverse effect on our capital expenditures, earnings, or competitive position.\nOur reserve for environmental matters is discussed in Note 18 to the Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K, which is incorporated herein by reference.\nGovernment Regulation\nIn addition to the environmental regulations discussed above, we are subject to various federal, state, local, and foreign government regulations relating to the development, manufacture, marketing, sale and distribution of our products and services in the countries where we conduct business.  Compliance with these laws and regulations often requires the dedication of time and effort of our team members, as well as financial resources.  Additional information about the impact of government regulations on our business is included in “Item 1A. Risk Factors.”\nEnergy Matters and Sources and Availability of Raw Materials\nOur primary energy source for both of our business segments is electric power.  While we cannot predict future costs of electric power, we manage this cost through aggregation in deregulated markets and leveraging contracts with established pricing on portions of our energy load.  We are subject to governmental regulations in regard to energy supplies in the United States and elsewhere.  To date, we have not experienced any significant disruptions of our operations due to energy curtailments.\nWe primarily use steel, brass, copper, aluminum, nickel, rubber and thermoplastic materials and chemicals as the principal raw materials in our products.  We expect these materials to be available from numerous sources in quantities sufficient to meet our requirements.\nAcquisitions\nOn September 12, 2022, the Company completed the acquisition of Meggitt plc (\"Meggitt\").  On June 30, 2025, the Company announced that it has agreed to acquire Curtis Instruments, Inc. from Rehlko.  The pending acquisition of Curtis Instruments, Inc. and prior year acquisitions are discussed in Note 3 to the Consolidated Financial Statements included in Part II, Item 8 of this Annual Report on Form 10-K and is incorporated herein by reference.\nHuman Capital Management\nAt Parker, we align employment levels with the global needs of our business and our customers.  As of June 30, 2025, we employed approximately 57,950 persons that we refer to as “team members,” of whom approximately 29,520 were employed by foreign subsidiaries.  \nOur talented and passionate team members are the foundation of Parker’s enduring growth, bringing new ideas and perspectives to enhance our safety performance, improve productivity and inspire a diverse and inclusive culture.  We see a clear path to a brighter future, and it begins with providing our people the resources that enable them to find personal and professional satisfaction in their work, responsibly move our company forward and strengthen our communities, fulfilling our purpose of \nEnabling Engineering Breakthroughs that Lead to a Better Tomorrow\n.\n5\nTable of Contents\nThe Win Strategy™ 3.0, Purpose and Values\nThe Win Strategy 3.0 is Parker’s business system that defines the goals and initiatives that drive growth, transformation and success.  It works with our purpose, which is a foundational element of The Win Strategy, to engage team members and create responsible and sustainable growth.\nThe Win Strategy has four overarching goals: Engaged People, Customer Experience, Profitable Growth and Financial Performance, supported by our shared values of a Winning Culture, Passionate People, Valued Customers and Engaged Leadership.  Our shared values shape our culture and our interactions with stakeholders and the communities in which we operate and live. \nSafety\n \nThe safety and well-being of Parker team members is our highest priority.  Our safety goal is simple: to be the safest industrial company in the world, which we define as having the lowest annual recordable incident rate among our proxy peers. \n \nIn fiscal year 2025, the recordable incident rate per 100 team members was 0.27, compared to a recordable incident rate of 0.31 in fiscal year 2024.  We have successfully reduced our recordable incident rate by over 50% since our fiscal year 2019.   \nOur safety program is anchored on a safety management system that has globally deployed procedures and work instructions, including management of incidents and near miss events. We create a culture of safety through a variety of initiatives, leadership focus, and our commitment to safety as the first stated goal of The Win Strategy.  \nWe engage team members in improving safety performance through High Performance Teams (\"HPTs\").  All Parker manufacturing locations have an active, chartered Safety HPT and every value stream has a representative who is responsible for safety within their area of the business.  This ownership culture at the manufacturing level is an integral component of our safety program.  \nEngaged People\nEngagement directly influences business performance.  We strongly believe in empowering our team members to think like owners and take action to improve their areas of the business.  Engagement is deeply ingrained in our culture, and as an overarching goal of The Win Strategy it is key to achieving top quartile financial performance. \nParker activates engagement through our HPTs, which apply the expertise and perspective of team members who are closest to the product and customer to drive improvement throughout the company.  We closely track our progress in support of a high performing work environment through our Global Engagement Survey.  Our last completed survey, in fiscal year 2025, achieved a 92% response rate with an overall engagement score of 75%.\nTalent Development\nWe have a well-defined talent development program managed through our Talent Central system, which connects all business units globally on a common platform and provides team members with visibility to skill development, career planning and learning opportunities.  This shared platform is the catalyst for talent management at Parker.\nOur review process enables us to assess talent globally, from early-in-career roles through senior leaders.  This review facilitates the identification of key talent and allows us to build meaningful development plans and align career growth opportunities.  The talent process is also supported by our Integrated Career System program which illustrates career paths for various roles and the steps to advance through the organization.\nSupplementing the talent development process are Parker’s learning offerings, which help team members expand their professional skills and take ownership of their learning and development.  Examples of center-led programs are our annual ethics and compliance training and cyber security training that all team members are required to complete, in addition to programs for developing supervisory and leadership skills.  Functional-specific programs include HPT training, lean bootcamps and kaizen event orientations.  Local and regional training includes site safety, equipment safety and site quality requirements. \nIn addition to formal training programs, there are a host of development tools available which include mentoring relationships, coaching and feedback, job shadowing, project bubble assignments and other stretch projects.\n6\nTable of Contents\nInclusion\nAn inclusive environment is a core tenet of our values and one of our key measures of success within The Win Strategy. We have an ongoing commitment to an inclusive and welcoming workplace where everyone feels valued and adds value.  \nOne important component of Parker’s inclusive workplace is the development and deployment of Business Resource Groups (\"BRGs\"), each of which is open to all team members. In addition to our BRGs, we have processes in place to attract and retain team members with a wide range of backgrounds, perspectives and experiences, helping to support them with career plans and experienced mentors. Our goal is to promote a strong, inclusive work environment that will provide us the best talent to further strengthen our organization for success.\nCompensation and Benefits\nAs a global employer, we are committed to offering competitive compensation and benefits, tailored to geography, industry, experience and performance.  Our programs are designed to attract team members, motivate and reward performance, drive growth and support retention.  We provide benefit programs with the goal of improving physical, mental and financial wellness of our team members throughout their lifetime.  Some examples include base and variable pay, health and insurance benefits, paid time off, and retirement saving plans.  \nInformation about our Executive Officers\nOur executive officers as of August 15, 2025, were as follows:\nName\nPosition\nOfficer\nSince\n(1)\nAge as of \n8/15/25\nJennifer A. Parmentier\nChairman of the Board and Chief Executive Officer \n2015\n58 \nTodd M. Leombruno\nExecutive Vice President and Chief Financial Officer\n2017\n55 \nAndrew D. Ross\nPresident and Chief Operating Officer\n2012\n58 \nMark J. Hart\nExecutive Vice President – Human Resources and External Affairs\n2016\n60 \nRachid Bendali\nVice President and President – Engineered Materials Group\n2022\n48 \nBerend Bracht\nVice President and President – Motion Systems Group\n2021\n59 \nMark T. Czaja\nVice President – Chief Technology and Innovation Officer\n2021\n63 \nThomas C. Gentile\nVice President – Global Supply Chain\n2017\n53 \nAngela R. Ives\nVice President and Controller\n2021\n52 \nMatthew A. Jacobson \nVice President and President – Filtration Group\n2025\n46 \nJoseph R. Leonti\nVice President, General Counsel and Secretary\n2014\n53 \nDinu J. Parel\nVice President – Chief Digital and Information Officer\n2018\n44 \nJay P. Reidy\nVice President and President – Aerospace Group\n2024\n42 \nPatrick M. Scott \nVice President and President –  Fluid Connectors Group\n2024\n47 \nRobert W. Malone\nVice President\n2014\n61 \n(1) \nExecutive officers are elected by the Board of Directors to serve for a term of one year or until their respective successors are elected, except in the case of death, resignation or removal.\nMs. Parmentier has been Chairman of the Board since January 2024 and Chief Executive Officer since January 2023. Before becoming Chief Executive Officer in 2023, she was Chief Operating Officer since August 2021.  She was Vice President and President of the Motion Systems Group from February 2019 to August 2021.  She was Vice President and President of the Engineered Materials Group from September 2015 to February 2019.  She was General Manager of the Hose Products Division from May 2014 to September 2015; and General Manager of the Sporlan Division from May 2012 to May 2014.  She is also a Director of Nordson Corporation.\nMr. Leombruno has been Executive Vice President and Chief Financial Officer since January 2021.  He was Vice President and Controller from July 2017 to January 2021.  He was Vice President and Controller – Engineered Materials Group from January 2015 to June 2017; and Director of Investor Relations from June 2012 to December 2014. He is also a Director of The Timken Company. \nMr. Ross has been President since January 2024 and Chief Operating Officer since January 2023.  He was Vice President and President of the Fluid Connectors Group from September 2015 to December 2022.  He was Vice President and President of the Engineered Materials Group from July 2012 to September 2015.  \n7\nTable of Contents\nMr. Hart has been Executive Vice President - Human Resources and External Affairs since January 2016.  He was Vice President - Total Rewards from August 2013 to January 2016. \nMr. Bendali has been Vice President and President of the Engineered Materials Group since August 2022.  He was Vice President of Operations for the Engineered Materials Group from October 2021 to July 2022 and was General Manager of the Noise, Vibration and Harshness Division from October 2019 to September 2021. Prior to joining the Company as part of the acquisition of LORD Corporation (\"Lord\") in October 2019, Mr. Bendali was Vice President at LORD with responsibility for Aerospace and Defense sales, marketing and programs. \nMr. Bracht has been Vice President and President of the Motion Systems Group since August 2021.  He was Vice President of Operations for the Engineered Materials Group from July 2018 to August 2021.  He was President and Chief Executive Officer of Bendix Commercial Vehicle Systems LLC from 2015 to 2018.  Bendix designs, develops and supplies products under the Bendix brand name for medium- and heavy-duty trucks, tractors, trailers, buses, and other commercial vehicles throughout North America.  Prior to Bendix, he held several executive leadership positions during his 24-year career at Bosch Rexroth, including President and Chief Executive Officer of Bosch Rexroth Americas.\nMr. Czaja has been Vice President - Chief Technology and Innovation Officer since January 2021.  He was Vice President of Technology and Innovation for the Motion Systems Group from August 2019 to December 2020; Vice President of Technology and Innovation for the Aerospace Group from August 2004 to July 2019; and Division Engineering Director from October 2000 to July 2004.  \nMr. Gentile has been Vice President - Global Supply Chain since July 2017.  He was General Manager of the Company's  Process Filtration Division from December 2013 to July 2017 and was Vice President of Supply Chain for the Filtration Group from July 2008 to November 2013. \nMs. Ives has been Vice President and Controller since January 2021.  She was Vice President, Assistant Controller from September 2020 to December 2020; Group VP Controller for the Instrumentation Group from November 2019 to August 2020; and Division Controller for the Electromechanical and Drives Division from October 2010 to October 2019. \nMr. Jacobson has been Vice President and President of the Filtration Group since July 2025. He was Vice President of Operations for the Motion Systems Group from July 2021 to June 2025 and Vice President of Supply Chain for the Motion Systems Group from June 2020 to June 2021.  He held General Manager roles with the Hydraulic Pump and Power Systems Division and the Accumulator and Cooler Division from March 2013 to May 2020.\nMr. Leonti has been Vice President, General Counsel and Secretary since July 2014.  He was Assistant Secretary from April 2011 to July 2014 and Associate General Counsel from January 2008 to July 2014.\nMr. Parel has been Vice President - Chief Digital and Information Officer since January 2021.  He was Vice President and Chief Information Officer from October 2018 to January 2021.  He was Vice President and Chief Information Officer at Dover Corporation from May 2016 through October 2018.  Dover is a diversified global manufacturer that delivers equipment and components, consumable supplies, aftermarket parts, software and digital solutions and support services.   \nMr. Reidy has been Vice President and President of the Aerospace Group since January 2024. He was Vice President of Operations for the Aerospace Group from December 2022 to December 2023. He held General Manager roles with the Precision Fluidics Division, the Advanced Atomization Technologies joint venture, and the Gas Turbine Fuel Systems Division from May 2017 to December 2022. \nMr. Scott has been Vice President and President of the Fluid Connectors Group since January 2024. He was Vice President of Operations for the Aerospace Group from May 2021 to December 2023 and also served as Integration Leader for Parker’s acquisition of Meggitt plc. He held General Manager roles with the Gas Turbine Fuel Systems Division and the Fluid Systems Connectors Divisions from December 2015 to May 2021.\nMr. Malone has been a Vice President since December 2014 and previously also held the role of President of the Filtration Group from December 2014 to June 2025.  He was Vice President of Operations for the Filtration Group from January 2013 to December 2014.  He is also a Director of The Manitowoc Company, Inc.",
  "item7": "ITEM 7\n.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nForward-looking statements contained in this and other written and oral reports are made based on known events and circumstances at the time of release, and as such, are subject in the future to unforeseen uncertainties and risks.  Often but not always, these statements may be identified from the use of forward-looking terminology such as \"anticipates,\" \"believes,\" \"may,\" \"should,\" \"could,\" \"expects,\" \"targets,\" \"is likely,\" \"will,\" or the negative of these terms and similar expressions, and include all statements regarding future performance, orders, earnings projections, events or developments.  Neither Parker nor any of its respective associates or directors, officers or advisers provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements will actually occur.  Parker cautions readers not to place undue reliance on these statements.  It is possible that the future performance may differ materially from past performance or current expectations.  A change in the economic conditions in individual markets may have a particularly volatile effect on segment performance.\nAmong other factors which may affect future performance are: \n•\nchanges in business relationships with and orders by or from major customers, suppliers or distributors, including delays or cancellations in shipments; \n•\ndisputes regarding contract terms, changes in contract costs and revenue estimates for new development programs; \n•\nchanges in product mix; \n•\nability to identify acceptable strategic acquisition targets; \n•\nuncertainties surrounding timing, successful completion or integration of acquisitions and similar transactions, including the acquisition of Curtis Instruments, Inc.; \n•\nability to successfully divest businesses planned for divestiture and realize the anticipated benefits of such divestitures; \n•\nthe determination and ability to successfully undertake business realignment activities and the expected costs, including cost savings, thereof; \n•\nability to implement successfully business and operating initiatives, including the timing, price and execution of share repurchases and other capital initiatives; \n•\navailability, cost increases of or other limitations on our access to raw materials, component products and/or commodities if associated costs cannot be recovered in product pricing; \n•\nability to manage costs related to insurance and employee retirement and health care benefits; \n•\nlegal and regulatory developments and other government actions, including related to environmental protection, and associated compliance costs; supply chain and labor disruptions, including as a result of tariffs and labor shortages; \n•\nthreats associated with international conflicts and cybersecurity risks and risks associated with protecting our intellectual property; \n•\nuncertainties surrounding the ultimate resolution of outstanding legal proceedings, including the outcome of any appeals; \n•\neffects on market conditions, including sales and pricing, resulting from global reactions to U.S. trade policies; \n•\nmanufacturing activity, air travel trends, currency exchange rates, difficulties entering new markets and economic conditions such as inflation, deflation, interest rates and credit availability; inability to obtain, or meet conditions imposed for, required governmental and regulatory approvals; \n•\nchanges in the tax laws in the United States and foreign jurisdictions and judicial or regulatory interpretations thereof; and \n•\nlarge scale disasters, such as floods, earthquakes, hurricanes, industrial accidents and pandemics.\nThe Company makes these statements as of the date of the filing of this Annual Report on Form 10-K for the year ended June 30, 2025 and undertakes no obligation to update them unless otherwise required by law.\n18\nTable of Contents\nOverview\nThe Company is a global leader in motion and control technologies.  Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration markets around the world.\nBy aligning around our purpose, Enabling Engineering Breakthroughs that Lead to a Better Tomorrow, Parker is better positioned for the challenges and opportunities of tomorrow.\nThe Win Strategy 3.0 is Parker's business system which defines the goals and initiatives that create responsible, sustainable growth and enable Parker's long-term success.  It works with our purpose, which is a foundational element of The Win Strategy, to engage team members and create responsible and sustainable growth.  Our shared values shape our culture and our interactions with stakeholders and the communities in which we operate and live.\nWe believe many opportunities for profitable growth are available.  The Company intends to focus primarily on business opportunities in the areas of aerospace & defense, in-plant & industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration.  We believe we can meet our strategic objectives by:\n•\nserving the customer and continuously enhancing its experience with the Company;\n•\nsuccessfully executing The Win Strategy initiatives relating to engaged people, premier customer experience, profitable growth and financial performance;\n•\nmaintaining a decentralized division and sales company structure;\n•\nfostering a safety-first and entrepreneurial culture;\n•\nengineering innovative systems and products to provide superior customer value through improved service, efficiency and productivity;\n•\ndelivering products, systems and services that have demonstrable savings to customers and are priced by the value they deliver;\n•\nenabling a sustainable future by providing innovative clean technology solutions that offer a positive, global environmental impact and operating responsibly by reducing our energy use and emissions;\n•\nacquiring strategic businesses;\n•\norganizing around targeted regions, technologies and markets; \n•\ndriving efficiency by implementing lean enterprise principles; and \n•\ncreating a culture of empowerment through our values, inclusion and diversity, accountability and teamwork.\nWe manage our supply chain  through our \"local for local\" manufacturing strategy, ongoing supplier management process, and broadened supply base.  We actively monitor global trade policies and inflation, managing their impact through a variety of cost and pricing measures.  In addition, continuous improvement and lean initiatives, along with disciplined workforce and discretionary spending management, further enhance our ability to mitigate these impacts.  At the same time, we are appropriately addressing the ongoing needs of our business so that we continue to serve our customers.\nOver the long term, the extent to which our business and results of operations will be impacted by global economic and political uncertainty, geopolitical risks and public health crises depends on future developments that remain uncertain.  We will continue to monitor the global environment and manage our business with the goal to minimize unfavorable impacts on operations and financial results.\nThe discussion below is structured to separately discuss the Consolidated Statement of Income, Business Segments, and Liquidity and Capital Resources.  The term \"year\" and references to specific years refer to the applicable fiscal year.  Dollars are presented in millions, except per share amounts or as otherwise noted.  The Company has changed its presentation on the Consolidated Financial Statements from thousands to millions and, as a result, any necessary rounding adjustments have been made to prior period disclosed amounts within Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.  Discussion of the 2023 financial statements is included in Part II, Item 7 of the Company's 2024 Annual Report on Form 10-K.\n19\nTable of Contents\nCONSOLIDATED STATEMENT OF INCOME\nThe Consolidated Statement of Income summarizes the Company's operating performance.  The discussion below compares the operating performance in 2025 and 2024.\n(dollars in millions)\n2025\n2024\nNet sales\n$\n19,850\n \n$\n19,930 \nGross profit margin\n36.9\n \n%\n35.8 \n%\nSelling, general and administrative expenses\n$\n3,255\n \n$\n3,315 \nSelling, general and administrative expenses, as a percent of sales\n16.4\n \n%\n16.6 \n%\nInterest expense\n$\n409\n \n$\n506 \nOther (income) expense, net\n(183)\n(276)\nGain on sale of businesses and assets, net\n$\n(273)\n$\n(12)\nEffective tax rate\n14.0\n \n%\n20.9 \n%\nNet income attributable to common shareholders\n$\n3,531\n \n$\n2,844 \nNet sales\n \nin 2025 decreased from the 2024 amount due to lower sales in the Diversified Industrial Segment, partially offset by higher sales in the Aerospace Systems Segment resulting from strength across commercial and defense markets.  Within the Diversified Industrial Segment, the impact of divestiture activity decreased sales by approximately $295 million in 2025.  The effect of currency exchange rates decreased net sales in 2025 by approximately $41 million, which is primarily attributable to the Diversified Industrial Segment.\nGross profit margin \n(calculated as net sales less cost of sales, divided by net sales) increased in 2025 primarily due to higher margins in both segments resulting from price increases, favorable product mix, cost containment and continued execution of the Win Strategy.\nCost of sales also included business realignment and acquisition integration charges of $31 million and $34 million in 2025 and 2024, respectively.\nSelling, general and administrative expenses \ndecreased in 2025 compared to 2024 primarily due to benefits from prior-year restructuring and acquisition-integration activities, lower research and development expenses and cost containment initiatives.\nSelling, general and administrative expenses also included business realignment and acquisition integration charges of $45 million and $55 million in 2025 and 2024, respectively.\nInterest expense \nin 2025 decreased compared to 2024 primarily due to lower average debt outstanding.  \nOther (income) expense, net\n included the following:\n(dollars in millions)\n2025\n2024\nForeign currency transaction loss (gain)\n(1)\n$\n46\n \n$\n(38)\nIncome related to equity method investments\n(178)\n(152)\nNon-service components of retirement benefit cost\n(51)\n(73)\nInterest income\n(11)\n(15)\nSaegertown incident\n(2)\n8\n \n— \nOther items, net\n3\n \n2 \nTotal other (income) expense, net\n$\n(183)\n$\n(276)\n(1) \nForeign currency transaction loss (gain) primarily relates to the impact of exchange rates on cash, forward contracts and intercompany transactions.\n(2) \nOn February 9, 2025, a fire damaged a portion of our Saegertown, Pennsylvania facility, causing a pause in production.  Some production and operations were re-established within days of the event.  Global available capacity has been utilized to restore production, substantially fulfill demand and minimize customer disruption.  There was no material impact as a result of this disruption during fiscal 2025 and none is expected during future periods.  We maintain third-party insurance coverage for property damage, clean-up, replacement and business interruption, subject to an $8 million deductible and liability retention for the event, which was recorded in the third quarter of 2025.  While we expect to be reimbursed for a significant portion of our business interruption impacts by our third-party insurance coverage, we will not record any associated gain until realized.\n20\nTable of Contents\nGain on sale of businesses and assets, net \nin 2025 primarily relates to the divestiture of the composites and fuel containment (\"CFC\") business.  Refer to Note 3 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion. \nEffective tax rate\n in 2025, was lower than the U.S. Federal statutory rate of 21 percent due to tax benefits from the release of a foreign valuation allowance, share-based compensation, foreign-derived intangible income and a tax benefit from a lower taxable gain on divestitures than gain under GAAP, which were partially offset by U.S. state and local taxes and taxes related to international activities. \nThe effective tax rate in 2024, was lower than the U.S. Federal statutory rate of 21 percent due to share-based compensation and foreign-derived intangible income, which were partially offset by U.S. state and local taxes and taxes related to international activities. \nRefer to Note 5 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for a further reconciliation of the U.S. federal statutory tax rate to our effective tax rate.\nBUSINESS SEGMENT INFORMATION\nThe Business Segment information presents sales and operating income on a basis that is consistent with the manner in which the Company's various businesses are managed for internal review and decision-making.\nDiversified Industrial Segment \n(dollars in millions)\n2025\n2024\nNet sales\nNorth America businesses\n$\n8,134\n \n$\n8,801 \nInternational businesses\n5,531\n \n5,657 \nDiversified Industrial Segment\n13,665\n \n14,458 \nOperating income\nNorth America businesses\n1,891\n \n1,963 \nInternational businesses\n1,229\n \n1,213 \nDiversified Industrial Segment\n$\n3,120\n \n$\n3,176 \nOperating income as a percent of sales\nNorth America businesses\n23.2\n \n%\n22.3 \n%\nInternational businesses\n22.2\n \n%\n21.4 \n%\nDiversified Industrial Segment\n22.8\n \n%\n22.0 \n%\nBacklog\n$\n3,655\n \n$\n4,182 \n21\nTable of Contents\nThe Diversified Industrial Segment operations experienced the following percentage changes in net sales: \n2025\nNorth America businesses – as reported\n(7.6)\n%\nDivestitures\n(3.4)\n%\nCurrency\n(0.5)\n%\nNorth America businesses – without divestitures and currency\n(1)\n(3.7)\n%\nInternational businesses – as reported\n(2.2)\n%\nCurrency\n(0.3)\n%\nInternational businesses – without currency\n(1)\n(1.9)\n%\nDiversified Industrial Segment – as reported\n(5.5)\n%\nDivestitures\n(2.0)\n%\nCurrency\n(0.5)\n%\nDiversified Industrial Segment – without divestitures and currency\n(1)\n(3.0)\n%\n(1) \nThis table reconciles the percentage changes in net sales of the Diversified Industrial Segment reported in accordance with GAAP to percentage changes in net sales adjusted to remove the effects of divestitures for 12 months after their completion as well as changes in currency exchange rates (a non-GAAP measure).  The effects of divestitures and changes in currency exchange rates are removed to allow investors and the Company to meaningfully evaluate the percentage changes in net sales on a comparable basis from period to period. \nNet Sales\nDiversified Industrial Segment sales in 2025 decreased $793 million from 2024.  The effect of currency exchange rates decreased sales by approximately $63 million.  The impact of divestiture activity decreased sales by approximately $295 million.  Excluding the effects of changes in currency exchange rates and divestiture activity, sales in 2025 decreased $435 million from prior-year levels.\nNorth America businesses\n - Sales within the North America businesses of the Diversified Industrial Segment decreased $667 million in 2025.  The effect of currency exchange rates decreased sales by approximately $43 million during the year.  The impact of divestiture activity decreased sales by approximately $295 million.  Excluding the effects of changes in the currency exchange rates and divestiture activity, sales in 2025 decreased $329 million from prior-year levels reflecting lower demand within the off-highway, transportation, in-plant and industrial equipment and energy markets, partially offset by an increase in demand in the HVAC and refrigeration and aerospace and defense markets.\nInternational businesses\n - Sales within the International businesses of the Diversified Industrial Segment decreased $126 million in 2025.  The effect of currency exchange rates decreased sales by approximately $20 million, reflecting the strengthening of the U.S. dollar primarily against currencies in Mexico, Brazil and China, partially offset by the weakening of the U.S. dollar primarily against currencies in the United Kingdom and the Eurozone countries.  Excluding changes in the currency exchange rates, sales in 2025 decreased $106 million from prior-year levels primarily due to lower sales in Europe, partially offset by an increase in sales in the Asia Pacific Region and Latin America.\nWithin Europe, the decrease in sales was primarily due to lower demand from end users across the in-plant and industrial equipment, off-highway and transportation markets.\nWithin the Asia Pacific region, the increase in sales was primarily due to higher demand within the electronics and semiconductor and in-plant and industrial equipment markets, partially offset by lower demand from end users in the transportation, energy and off-highway markets.\nWithin Latin America, the increase in sales was primarily due to higher demand within the in-plant and industrial equipment,  transportation and off-highway markets, partially offset by lower demand from end users in the energy market.\nOperating Margin\nDiversified Industrial Segment operating margin increased in 2025, in both the North America and International businesses, primarily due to benefits from favorable product mix, price increases and benefits related to prior-year restructuring activities as well as cost containment initiatives, partially offset by decreased sales volume.\n22\nTable of Contents\nBusiness Realignment\nThe following business realignment and acquisition integration charges are included in the Diversified Industrial Segment operating income:\n(dollars in millions)\n2025\n2024\nNorth America businesses\n$\n17\n \n$\n22 \nInternational businesses\n39\n \n33 \nDiversified Industrial Segment\n$\n56\n \n$\n55 \nBusiness realignment charges include severance costs related to actions taken under the Company's simplification initiative aimed at reducing organizational and process complexity, as well as plant closures.  In both 2025 and 2024, acquisition integration charges relate to the acquisition of Meggitt.  Business realignment and acquisition integration charges within the International businesses were primarily incurred in Europe.\nWe anticipate that cost savings realized from the workforce reduction measures taken during 2025 will increase operating income in 2026 by approximately two percent for both the International and North America businesses.  We expect to continue to take actions necessary to integrate acquisitions and appropriately structure the operations of the Diversified Industrial Segment.  These actions are expected to result in approximately $65 million in business realignment charges in 2026.  However, continually changing business conditions could impact the ultimate costs we incur.  \nBacklog\nDiversified Industrial Segment backlog decreased in 2025 primarily due to the CFC divestiture in the North America businesses, partially offset by an increase in backlog in the International businesses.  Within the International businesses, the increase in backlog was primarily attributable to Europe, partially offset by the Asia Pacific region and Latin America.\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale. \nAerospace Systems Segment\n \n(dollars in millions)\n2025\n2024\nNet sales\n$\n6,185\n \n$\n5,472 \nOperating income\n$\n1,441\n \n$\n1,111 \nOperating income as a percent of sales\n23.3\n \n%\n20.3 \n%\nBacklog\n$\n7,389\n \n$\n6,680 \nNet Sales\nAerospace Systems Segment sales increased compared to prior-year due to higher volume across all market segments, especially the commercial and defense aftermarkets.\nOperating Margin\nAerospace Systems Segment operating margin increased in 2025 primarily due to higher sales volume and favorable aftermarket mix, as well as benefits from cost containment initiatives and prior-year acquisition integration activities.  \nBusiness Realignment\nWithin the Aerospace Systems Segment, we incurred acquisition integration and business realignment charges of $19 million and $34 million in 2025 and 2024, respectively.  We do not expect to incur significant business realignment and acquisition integration charges in 2026.  However, continually changing business conditions could impact the ultimate costs we incur.\nBacklog\nAerospace Systems Segment backlog increased in 2025 primarily due to orders exceeding shipments in the commercial and defense OEM market segments.\n23\nTable of Contents\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale. \nCorporate general and administrative expenses\n(dollars in millions)\n2025\n2024\nCorporate general and administrative expense\n$\n214\n \n$\n218 \nCorporate general and administrative expense, as a percent of sales\n1.1\n \n%\n1.1 \n%\nCorporate general and administrative expenses decreased in 2025 primarily due to lower expenses related to the Company's incentive compensation programs, net expense associated with the Company's deferred compensation plan and related investments, information technology expenses and discretionary spending, partially offset by an increase in charitable contributions and professional service fees.\nOther (income) expense, net\n(dollars in millions)\n2025\n2024\nForeign currency transaction loss (gain)\n(1)\n$\n46\n \n$\n(38)\nStock-based compensation\n97\n \n95 \nNon-service components of retirement benefit cost\n(51)\n(73)\nGain on sale of businesses and assets, net\n(2)\n(273)\n(12)\nInterest income\n(11)\n(15)\nSaegertown incident\n(3)\n8\n \n— \nOther items, net\n15\n \n11 \nTotal other (income) expense, net\n$\n(169)\n$\n(32)\n(1) \nForeign currency transaction loss (gain) primarily relates to the impact of exchange rates on cash, forward contracts and intercompany transactions.\n(2) \nGain on sale of businesses and assets, net primarily relates to the divestiture of the CFC business.  Refer to Note 3 to the Consolidated Financial Statements for further discussion.\n(3) \nThe Saegertown incident represents the deductible and retained liability expense associated with a fire at our plant in Saegertown, Pennsylvania in February 2025.\nLIQUIDITY AND CAPITAL RESOURCES\nWe believe that we are great generators and deployers of cash.  We assess our liquidity in terms of our ability to generate cash to fund our operations and meet our strategic capital deployment objectives, which include the following:\n•\nContinuing our record annual dividend increases\n•\nInvesting in organic growth and productivity\n•\nStrategic acquisitions that strengthen our portfolio\n•\nShare repurchases, including repurchases under the 10b5-1 share repurchase program\nCash Flows\nA summary of cash flows follows:\n(dollars in millions)\n2025\n2024\nCash provided by (used in):\nOperating activities\n$\n3,776\n \n$\n3,384 \nInvesting activities\n224\n \n(298)\nFinancing activities\n(3,977)\n(3,115)\nEffect of exchange rates\n22\n \n(24)\nNet increase (decrease) in cash and cash equivalents \n$\n45\n \n$\n(53)\n24\nTable of Contents\nCash flows from operating activities\n were $3,776 million in 2025 compared to $3,384 million in 2024.  The increase of $392 million in 2025 was primarily related to an increase in earnings combined with strong management of working capital items.  We continue to focus on managing inventory and other working capital requirements. \n•\nDays sales outstanding relating to trade receivables for the Company was 51 days in both 2025 and 2024.\n•\nDays supply of inventory on hand was 82 days in 2025 and 80 days in 2024.\nCash flows from investing activities\n in 2025 and 2024 were impacted by the following factors:\n•\nNet proceeds totaling $621 million from the sale of the CFC and non-core filtration businesses in fiscal 2025.\n•\nProceeds totaling $74 million from the sale of the MicroStrain sensing systems and Filter Resources businesses in fiscal 2024.\n•\nCapital expenditures of $435 million in 2025 compared to $400 million in 2024.\nCash flows from financing activities \nin 2025 and 2024 were impacted by the following factors:\n•\nRepurchases under the Company's share repurchase program amounted to 2.5 million common shares for $1.6 billion during 2025 compared to repurchases of 0.4 million common shares for $200 million during 2024.\n•\nNet commercial paper repayments of $374 million in 2025 compared to net commercial paper borrowings of $359 million in 2024.\n•\nPrincipal payments totaling $490 million related to the term loan facility (the \"Term Loan Facility\") in 2025 compared to principal payments totaling $385 million related to the Term Loan Facility in 2024.  Refer to Note 11 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\n•\nAggregate principal payment of $500 million related to the maturity of medium-term notes during fiscal 2025.\n•\nIssuance of €700 million aggregate principal amount of 2.90 percent Senior Notes due 2030 from which proceeds were used to repay the €700 million aggregate principal amount of 1.125 percent Senior Notes due 2025 in fiscal 2025.\n•\nPayments related to the maturity of $2.0 billion aggregate principal amounts of senior notes in 2024.\nCash Requirements\nWe are actively monitoring our liquidity position and remain focused on managing our inventory and other working capital requirements.  We are targeting 2.5 percent of sales for capital expenditures for 2026 and have a long-term target of two percent.  We will continue to prioritize capital expenditures related to safety, productivity and strategic investments.  We believe that cash generated from operations and our commercial paper program will satisfy our operating needs for the foreseeable future.\nWe have committed cash outflow related to long-term debt, operating and financing lease agreements, and postretirement benefit obligations.  Refer to Notes 11, 12, and 13 respectively, of Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\nDividends\nCash dividends have been paid for 300 consecutive quarters, including a yearly increase in dividends for the last 69 years.  The current annual dividend rate is $7.20 per common share.\nShare Repurchases\nOn October 22, 2014, the Board of Directors approved a share repurchase program authorizing the repurchase of up to 35.0 million of the Company's common shares.  As of June 30, 2025, we had 4.8 million shares available under this repurchase authorization.  On August 21, 2025, the Board of Directors approved an update to the number of shares available under the Company's existing share repurchase authorization so that the aggregate number of shares available for repurchase as of such date was 20.0 million.  There is no limitation on the number of shares that can be repurchased in a year and there is no expiration date for the program.  Repurchases may be funded primarily from operating cash flows and commercial paper borrowings and the shares are initially held as treasury shares.\nLiquidity\nCash, comprised of cash and cash equivalents and marketable securities and other investments, includes $344 million and $311 million held by the Company's foreign subsidiaries at June 30, 2025 and 2024, respectively.  The Company does not permanently reinvest certain foreign earnings.  The distribution of these earnings could result in non-federal U.S. or foreign taxes.  All other undistributed foreign earnings remain permanently reinvested.\n25\nTable of Contents\nAs of June 30, 2025, the Company had a line of credit totaling $3.0 billion through a multi-currency revolving credit agreement with a group of banks with $1.2 billion available for borrowing under the credit agreement.  On August 21, 2025, the multi-currency revolving credit agreement was amended to increase the total line of credit by $750 million to $3.75 billion.  Advances from the credit agreement can be used for general corporate purposes, including acquisitions, and for the refinancing of existing indebtedness.  The credit agreement supports our commercial paper program, and issuances of commercial paper reduce the amount of credit available under the agreement.  The credit agreement expires in June 2028; however, the Company has the right to request a one-year extension of the expiration date on an annual basis, which request may result in changes to the current terms and conditions of the credit agreement.  The credit agreement requires the payment of an annual facility fee, the amount of which is dependent upon the Company’s credit ratings.  Although a lowering of the Company’s credit ratings would increase the cost of future debt, it would not limit the Company’s ability to use the credit agreement nor would it accelerate the repayment of any outstanding borrowings.  Refer to Note 10 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\nWe were authorized to sell up to $3.0 billion of short-term commercial paper notes as of June 30, 2025 with $1.8 billion outstanding.  The largest amount of commercial paper notes outstanding during the fourth quarter of 2025 was $2.1 billion.  On August 21, 2025, the authorization limit for short-term commercial paper notes increased to $3.75 billion.\nWe primarily utilize unsecured medium-term notes and senior notes to meet our financing needs and we expect to continue to borrow funds at reasonable rates over the long term.  During 2025, the company issued €700 million aggregate principal amount of 2.90 percent Senior Notes due March 1, 2030.  We used the net proceeds from the issuance, together with cash on hand, to repay the €700 million aggregate principal amount of 1.125 percent Senior Notes upon maturity in March 2025.  Our debt portfolio previously included a Term Loan Facility.  During 2025, we repaid the remaining principal balance of $490 million of the Term Loan Facility.  Additionally, we repaid the $500 million aggregate principal amount of fixed rate medium-term notes bearing interest of 3.30 percent upon maturity in November 2024.  Refer to the Cash flows from financing activities section above and Note 11 of the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.  \nThe Company’s credit agreements and indentures governing certain debt securities contain various covenants, the violation of which would limit or preclude the use of the credit agreements for future borrowings, or might accelerate the maturity of the related outstanding borrowings covered by the indentures.  Based on the Company’s rating level at June 30, 2025, the most restrictive financial covenant provides that the ratio of debt to debt-shareholders' equity cannot exceed 0.65 to 1.0.  At June 30, 2025, the Company's debt to debt-shareholders' equity ratio was 0.41 to 1.0.  We are in compliance, and expect to remain in compliance, with all covenants set forth in the credit agreement and indentures.\nOur goal is to maintain an investment-grade credit profile.  The rating agencies periodically update our credit ratings as events occur.  At June 30, 2025, the long-term credit ratings assigned to the Company's senior debt securities by the credit rating agencies engaged by the Company were as follows: \nFitch Ratings\nA-\nMoody's Investor Services, Inc.\nA3\nStandard & Poor's\nBBB+\nSupply Chain Financing\nWe continue to identify opportunities to improve our liquidity and working capital efficiency, which includes the extension of payment terms with our suppliers.  We currently have supply chain financing (\"SCF\") programs with financial intermediaries, which provide certain suppliers the option to be paid by the financial intermediaries earlier than the due date on the applicable invoice.  We do not believe that changes in the availability of supply chain financing will have a significant impact on our liquidity.  Refer to Note 8 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\nStrategic Acquisitions and Divestitures\nAcquisitions will be considered from time to time to the extent there is a strong strategic fit, while at the same time maintaining the Company’s strong financial position.  In addition, we will continue to assess our existing businesses and initiate efforts to divest businesses that are not considered to be a good long-term strategic fit for the Company.  During both 2025 and 2024, we divested two businesses each year.  On June 30, 2025, the Company announced that it has agreed to acquire Curtis Instruments, Inc. from Rehlko, for approximately $1.0 billion in cash.  The transaction is subject to customary closing conditions, including receipt of applicable regulatory approvals, and is expected to close by the end of calendar year 2025.  Refer to Note 3 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K for further discussion.\n26\nTable of Contents\nCRITICAL ACCOUNTING POLICIES & ESTIMATES\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the amounts reported in the financial statements and accompanying notes.  The policies discussed below are considered by management to be more critical than other policies because their application places the most significant demands on management's judgment.\nRevenue Recognition\n - Revenues are recognized when control of performance obligations, which are distinct goods or services within the contract, is transferred to the customer.  Control is transferred when the customer has the ability to direct the use of and obtain the benefits from the goods or services.  A majority of our revenues are recognized at a point in time when control is transferred to the customer, which is generally at the time of shipment.  However, a portion of our revenues are recognized over time if the customer simultaneously receives control as we perform work under a contract, if the customer controls the asset as it is being produced or if the product has no alternative use and we have a contractual right to payment.\nFor contracts where revenue is recognized over time, we use the cost-to-cost, efforts expended or units of delivery method depending on the nature of the contract, including length of production time.  The estimation of costs and efforts expended requires management's judgment due to the duration of the contractual agreements as well as the technical nature of the products involved.  Adjustments to these estimates are made on a consistent basis and a contract reserve is established when the estimated costs to complete a contract exceed the expected contract revenues.\nWhen there are multiple performance obligations within a contract, the transaction price is allocated to each performance obligation based on its standalone selling price.  The primary method used to estimate a standalone selling price is the price observed in standalone sales to customers for the same product or service.  Revenue is recognized when control of the individual performance obligations is transferred to the customer.\nWe consider the contractual consideration payable by the customer and assess variable consideration that may affect the total transaction price.  Variable consideration is included in the estimated transaction price when there is a basis to reasonably estimate the amount, including whether the estimate should be constrained in order to avoid a significant reversal of revenue in a future period.  These estimates are based on historical experience, anticipated performance under the terms of the contract and our best judgment at the time.\nImpairment of Goodwill\n \nand Long-Lived Assets \n- We test goodwill for impairment at the reporting unit level on an annual basis and between annual tests whenever events or circumstances indicate the carrying value of a reporting unit may exceed its fair value.  Our five reporting units are equivalent to our operating segments.  As quoted market prices are not available for our reporting units, determining whether an impairment occurred requires the valuation of the respective reporting unit, which is estimated using both income-based and market-based valuation methods.  The income-based valuation method utilizes a discounted cash flow model which requires several assumptions, including future sales growth and operating margin levels as well as assumptions regarding future industry-specific market conditions.  Each reporting unit regularly prepares discrete operating forecasts and uses these forecasts as the basis for the assumptions in the discounted cash flow analysis.  Within the discounted cash flow models, the Company uses a discount rate, commensurate with its cost of capital but adjusted for inherent business risks, and an appropriate terminal growth factor.  The market-based valuation performed for each reporting unit includes an analysis consisting of market-adjusted multiples based on key data points for guideline public companies.  We also reconcile the estimated aggregate fair value of our reporting units resulting from these procedures to our overall market capitalization.\nThe Company performed its fiscal 2025 annual goodwill impairment test as of January 1 for each of its five reporting units.  The results of this test indicated the fair value substantially exceeded carrying value for all reporting units.  We continually monitor our reporting units for impairment indicators and update assumptions used in the most recent calculation of a reporting unit's fair value as appropriate.  \nLong-lived assets held for use, which primarily includes finite-lived intangible assets and property, plant and equipment, are evaluated for impairment whenever events or circumstances indicate that the undiscounted net cash flows to be generated by their use over their expected useful lives and eventual disposition are less than their carrying value.  The long-term nature of these assets requires the estimation of their cash inflows and outflows several years into the future and only takes into consideration technological advances known at the time of the impairment test.  During 2025, the Company did not record any material impairments related to long-lived assets. \nPensions\n - The annual net periodic expense and benefit obligations related to the Company's defined benefit plans are determined on an actuarial basis.  This determination requires critical assumptions regarding the discount rate, long-term rate of return on plan assets, increases in compensation levels and amortization periods for actuarial gains and losses.  Assumptions are determined based on Company data and appropriate market indicators and are evaluated each year as of the plans' measurement \n27\nTable of Contents\ndate.  Changes in the assumptions or actual experience that differs from the assumptions could result in a material change in the annual net periodic expense and benefit obligations reported in the financial statements. \nFor the Company's domestic qualified defined benefit plan, our largest plan, a 50 basis point change in the assumed long-term rate of return on plan assets is estimated to have an $17 million effect on annual pension expense and a 50 basis point decrease in the discount rate is estimated to increase annual pension expense by $3 million.  \nNet actuarial gains and losses are recorded in accumulated other comprehensive loss and are subject to amortization and will affect earnings in the future.  Further information on pensions is provided in Note 13 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K.\nBusiness Combinations\n - From time to time, we may enter into business combinations.  Business acquisitions are accounted for using the acquisition method of accounting, which allocates the fair value of the purchase consideration to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values.  In the fair value evaluation of intangible assets acquired, there are significant estimates and assumptions, including forecasts of future cash flows, revenues; and earnings before interest, taxes, depreciation and amortization; as well as the selection of the royalty rates and discount rates.  The excess of the purchase consideration over the fair values of these identifiable assets and liabilities is recorded as goodwill.  The acquisition method of accounting also requires us to refine these estimates over a measurement period not to exceed one year to reflect new information obtained about facts and circumstances that existed as of the acquisition date that, if known, would have affected the measurement of the amounts recognized as of that date.  If we are required to adjust provisional amounts that we have recorded for the fair values of assets and liabilities in connection with acquisitions, these adjustments could have a material impact on our financial condition and results of operations. \nIncome Taxes\n - Significant judgment is required in determining the Company's income tax expense and in evaluating tax positions.  Deferred income tax assets and liabilities have been recorded for the differences between the financial accounting and income tax basis of assets and liabilities.  Factors considered by the Company in determining the probability of realizing deferred income tax assets include forecasted operating earnings, available tax planning strategies and the time period over which the temporary differences will reverse.  The Company reviews its tax positions on a regular basis and adjusts the balances as new information becomes available.  For those tax positions where it is more likely than not that a tax benefit will be sustained, the largest amount of tax benefit with a greater than 50 percent likelihood of being realized upon examination by a taxing authority that has full knowledge of all relevant information will be recorded.  For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the Consolidated Financial Statements.  Further information on income taxes is provided in Note 5 to the Consolidated Financial Statements in Part II, Item 8 of this Annual Report on Form 10-K.\nLoss Contingencies\n - The Company has a number of loss exposures incurred in the ordinary course of business such as environmental claims, product liability and litigation reserves.  Establishing loss accruals for these matters requires management's estimate and judgment with regards to risk exposure and ultimate liability or realization.  We review these loss accruals periodically and make adjustments to reflect the most recent facts and circumstances.\nRECENTLY ISSUED ACCOUNTING PRONOUNCEMENTS\nRecently issued accounting pronouncements are described in Note 1 to the Consolidated Financial Statements, included in Part II, Item 8 of this Annual Report on Form 10-K.\n28\nTable of Contents",
  "item2": null
}