{
  "source_file": "ph-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF \nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFOR THE THREE MONTHS ENDED SEPTEMBER 30, 2025 \nAND COMPARABLE PERIOD ENDED SEPTEMBER 30, 2024 \nManagement's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to provide a reader of our financial statements with a narrative, from management's perspective, on our financial condition and results of operations.  The following discussion and analysis should be read in conjunction with, the consolidated financial statements and the accompanying notes in Item 1 in this Quarterly Report on Form 10-Q, as well as our Annual Report on Form 10-K for the year ended June 30, 2025.  As used in this Quarterly Report on Form 10-Q, unless the context otherwise requires, the terms \"Company\", \"Parker\", \"we\" or \"us\" refer to Parker-Hannifin Corporation and its subsidiaries.  Dollars are presented in millions, except per share amounts or as otherwise noted.  The Company has changed its presentation on the consolidated financial statements from thousands to millions and, as a result, any necessary rounding adjustments have been made to prior period disclosed amounts within MD&A.\nOVERVIEW\nThe Company is a global leader in motion and control technologies.  Leveraging a unique combination of interconnected technologies, we design, manufacture, and provide aftermarket support for highly engineered solutions that create value for customers primarily in aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy, and HVAC and refrigeration markets around the world.\nBy aligning around our purpose, Enabling Engineering Breakthroughs that Lead to a Better Tomorrow, Parker is better positioned for the challenges and opportunities of tomorrow.\nThe Win Strategy 3.0 is Parker's business system that defines the goals and initiatives that create responsible, sustainable growth and enable Parker's long-term success.  It works with our purpose, which is a foundational element of The Win Strategy, to engage team members and create responsible and sustainable growth.  Our shared values shape our culture and our interactions with stakeholders and the communities in which we operate and live.\nWe believe many opportunities for profitable growth are available.  The Company intends to focus primarily on business opportunities in the areas of aerospace and defense, in-plant and industrial equipment, transportation, off-highway, energy and HVAC and refrigeration.  We believe we can meet our strategic objectives by:\n•\nserving the customer and continuously enhancing its experience with the Company;\n•\nsuccessfully executing The Win Strategy initiatives relating to engaged people, premier customer experience, profitable growth and financial performance;\n•\nmaintaining a decentralized division and sales company structure;\n•\nfostering a safety-first and entrepreneurial culture;\n•\nengineering innovative systems and products to provide superior customer value through improved service, efficiency and productivity;\n•\ndelivering products, systems and services that have demonstrable savings to customers and are priced by the value they deliver;\n•\nenabling a sustainable future by providing innovative technology solutions that offer a positive global environmental impact and operating responsibly by reducing our energy use and emissions;\n•\nacquiring strategic businesses;\n•\norganizing around targeted regions, technologies and markets; \n•\ndriving efficiency by implementing lean enterprise principles; and \n•\ncreating a culture of empowerment through our values, inclusion and diversity, accountability and teamwork.\n- 19 -\nWe manage our supply chain through our \"local for local\" manufacturing strategy, ongoing supplier management process and broadened supply base.  We actively monitor global trade policies and inflation, managing their impact through a variety of cost and pricing measures.  In addition, continuous improvement and lean initiatives, along with disciplined workforce and discretionary spending management, further enhance our ability to mitigate these impacts.  At the same time, we are appropriately addressing the ongoing needs of our business so that we continue to serve our customers.  \nOver the long term, the extent to which our business and results of operations will be impacted by global economic and political uncertainty, geopolitical risks and public health crises depends on future developments that remain uncertain.  We will continue to monitor the global environment and manage our business with the goal to minimize unfavorable impacts on operations and financial results.\n CONSOLIDATED STATEMENTS OF INCOME\nThree Months Ended\n \nSeptember 30,\n(dollars in millions)\n2025\n2024\nNet sales\n$\n5,084\n \n$\n4,904 \nGross profit margin\n37.5\n \n%\n36.8 \n%\nSelling, general and administrative expenses\n$\n873\n \n$\n849 \nSelling, general and administrative expenses, as a percent of sales\n17.2\n \n%\n17.3 \n%\nInterest expense\n$\n101\n \n$\n113 \nOther income, net\n$\n(107)\n$\n(31)\nEffective tax rate\n22.3\n \n%\n20.2 \n%\nNet income\n$\n808\n \n$\n698 \nNet income, as a percent of sales\n15.9\n \n%\n14.2 \n%\nNet sales\n increased in the current-year quarter due to higher sales in the Aerospace Systems Segment, partially offset by lower sales in the Diversified Industrial Segment.  The effect of currency exchange rate changes increased net sales during the current-year quarter by approximately $33 million.  The impact of prior-year divestiture activity decreased net sales by approximately $108 million during the current-year quarter.  The impact of the acquisition of Curtis increased net sales by approximately $11 million during the current-year quarter.\nGross profit margin\n (calculated as net sales minus cost of sales, divided by net sales) increased in the current-year quarter due to higher margins in the Diversified Industrial Segment primarily due to favorable product mix, cost containment initiatives and benefits from prior-year business realignment activities.\nCost of sales also included business realignment charges of $9 million and $5 million for the current and prior-year quarter, respectively.\nSelling, general and administrative expenses \n(\"SG&A\") increased in the current-year quarter primarily due to higher acquisition-related expenses and stock compensation expense, partially offset by lower research and development costs. \nSG&A also included business realignment and acquisition integration charges of $12 million and $10 million for the current and prior-year quarter, respectively.\nInterest expense\n decreased during the current-year quarter primarily due to lower average interest rates and lower average debt outstanding.\n- 20 -\nOther income, net \nincluded the following: \nThree Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\nExpense (income)\nForeign currency transaction (gain) loss\n(1)\n$\n(7)\n$\n37 \nIncome related to equity method investments\n(58)\n(38)\nNon-service components of retirement benefit cost (income)\n(17)\n(12)\nLoss (gain) on disposal of assets and divestitures\n1\n \n(9)\nInterest income\n(5)\n(3)\nGain on insurance recoveries\n(2)\n(20)\n— \nOther items, net\n(1)\n(6)\nTotal other income, net\n$\n(107)\n$\n(31)\n(1)\n Foreign currency transaction (gain) loss primarily relates to the impact of exchange rates on cash, forward contracts and intercompany transactions.\n(2) \nGain on insurance recoveries for damaged property associated with a fire at one of our U.S. facilities within the Diversified Industrial segment that occurred in the third quarter of fiscal 2025.\nEffective tax rate\n for the current-year quarter of fiscal 2026 was greater than the U.S. Federal statutory rate of 21 percent due to U.S. state and local taxes and taxes related to international activities, which were partially offset by tax benefits from share-based compensation and foreign-derived intangible income.\nThe effective tax rate for the comparable prior-year period was lower than the U.S. Federal statutory rate of 21 percent due to tax benefits from share-based compensation and foreign-derived intangible income, which were partially offset by U.S. state and local taxes and taxes related to international activities.\nThe fiscal 2026 effective tax rate is expected to be approximately 22.5 percent.\nBUSINESS SEGMENT INFORMATION\nThe Company operates in two reportable business segments: Diversified Industrial and Aerospace Systems.  The business segment information presents sales and operating income on a basis that is consistent with the manner in which the Company's various businesses are managed for internal review and decision-making.\nDiversified Industrial Segment\nThree Months Ended\n \nSeptember 30,\n(dollars in millions)\n2025\n2024\nNet sales\nNorth America businesses\n$\n2,044\n \n$\n2,100 \nInternational businesses\n1,399\n \n1,356 \nDiversified Industrial Segment\n3,443\n \n3,456 \nOperating income\nNorth America businesses\n507\n \n485 \nInternational businesses\n314\n \n299 \nDiversified Industrial Segment\n$\n821\n \n$\n784 \nOperating margin\nNorth America businesses\n24.8\n \n%\n23.1 \n%\nInternational businesses\n22.4\n \n%\n22.1 \n%\nDiversified Industrial Segment\n23.8\n \n%\n22.7 \n%\nBacklog\n$\n3,622\n \n$\n4,197 \n- 21 -\nThe Diversified Industrial Segment operations experienced the following percentage changes in net sales in the current-year period versus the comparable prior-year period:\nPeriod Ending September 30, 2025\nThree Months\nNorth America businesses – as reported\n(2.7)\n%\nAcquisitions\n0.3 \n%\nDivestitures\n(5.1)\n%\nCurrency\n— \n%\nNorth America businesses – without acquisitions, divestitures and currency\n(1)\n2.1 \n%\nInternational businesses – as reported\n3.2 \n%\nAcquisitions\n0.4 \n%\nCurrency\n1.8 \n%\nInternational businesses – without acquisitions and currency\n(1)\n1.0 \n%\nDiversified Industrial Segment – as reported\n(0.4)\n%\nAcquisitions\n0.3 \n%\nDivestitures\n(3.1)\n%\nCurrency\n0.7 \n%\nDiversified Industrial Segment – without acquisitions, divestitures and currency\n(1)\n1.7 \n%\n(1) \nThis table reconciles the percentage changes in net sales of the Diversified Industrial Segment reported in accordance with GAAP to percentage changes in net sales adjusted to remove the effects of acquisitions and divestitures for 12 months after their completion as well as changes in currency exchange rates (a non-GAAP measure).  The effects of acquisitions, divestitures and changes in currency exchange rates are removed to allow investors and the Company to meaningfully evaluate the percentage changes in net sales on a comparable basis from period to period. \nNet Sales\nDiversified Industrial Segment sales decreased $13 million from the prior-year quarter.  The effect of the Curtis acquisition increased sales by approximately $11 million in the current-year quarter.  The effect of changes in currency exchange rates increased sales by approximately $25 million in the current-year quarter.  The impact of divestiture activity decreased sales by approximately $108 million in the current-year quarter.  Excluding the effects of the acquisition, changes in currency exchange rates and divestiture activity, sales increased $59 million from the prior-year quarter.\nNorth America businesses\n - Sales decreased $56 million from the prior-year quarter.  The effect of the Curtis acquisition increased sales by approximately $6 million in the current-year quarter.  The effects of divestiture activity decreased sales by approximately $108 million in the current-year quarter.  Currency exchange rates did not materially impact sales in the current-year quarter.  Excluding the effects of the acquisition, divestiture activity and changes in currency exchange rates, sales in the North America businesses increased $45 million in the current-year quarter, which was primarily due to higher demand from end users in the in-plant and industrial equipment, HVAC and refrigeration and aerospace and defense markets, partially offset by lower demand from end users in the transportation market.\nInternational businesses\n - Sales increased $43 million from the prior-year quarter.  The effect of the Curtis acquisition increased sales by approximately $5 million in the current-year quarter.  The effect of changes in currency exchange rates increased sales by approximately $24 million in the current-year quarter.  Excluding the effects of the acquisition and changes in currency exchange rates, sales in the International businesses increased $14 million in the current-year quarter primarily due to higher sales in the Asia Pacific region, partially offset by a decrease in sales in Europe. \nWithin Europe, sales in the current-year quarter decreased primarily due to lower sales in the energy market related to the timing of customer capital projects, partially offset by higher user demand in the in-plant and industrial equipment and transportation markets.\nWithin the Asia Pacific region, sales in the current-year quarter increased primarily due to higher demand within the electronics and semiconductor market, partially offset by lower demand from end users in the transportation market.\nWithin Latin America, sales in the current-year quarter remained flat primarily due to higher demand within the energy market, offset by lower demand from end users across the transportation, in-plant and industrial equipment and off-highway markets. \n- 22 -\nOperating Margin\nDiversified Industrial Segment operating margin increased during the current-year quarter, in both the North America and International businesses, primarily due to favorable product mix and benefits from prior-year business realignment activities.  Within the North America businesses operating margins also benefitted from operational efficiencies, partially offset by an increase in material costs.  Operating margins in the International businesses also increased due to price increases and cost containment initiatives.\nBusiness Realignment and Acquisition Integration Charges\nThe following business realignment and acquisition integration charges are included in the Diversified Industrial Segment operating income:\nThree Months Ended\n \nSeptember 30,\n(dollars in millions)\n2025\n2024\nNorth America businesses\n$\n2\n \n$\n4 \nInternational businesses\n14\n \n6 \nDiversified Industrial Segment\n$\n16\n \n$\n10 \nIn both periods, business realignment and acquisition integration charges primarily related to business realignment activities.  The business realignment charges primarily consist of severance costs related to actions taken under the Company's simplification initiative aimed at reducing organizational and process complexity, as well as plant closures.  Business realignment charges within the International businesses were primarily incurred in Europe.\nWe anticipate that cost savings realized from the workforce reduction measures taken in the first three months of fiscal 2026 will not materially impact operating income in fiscal 2026 and 2027.  We expect to continue to take actions necessary to appropriately structure the operations of the Diversified Industrial Segment.  We currently anticipate incurring approximately $55 million of additional business realignment charges in the remainder of fiscal 2026.  However, continually changing business conditions could impact the ultimate costs we incur.\nBacklog\nDiversified Industrial Segment backlog, as of September 30, 2025, decreased from the comparable prior-year quarter primarily due to the prior year divestiture of composites and fuel containment business within the North America businesses.  Excluding the impact of the prior year divestiture activity, backlog remained relatively flat compared to the prior-year quarter.\nDiversified Industrial Segment backlog decreased from the June 30, 2025 amount of $3.7 billion primarily due to shipments exceeding orders in the North America businesses.\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.\nAerospace Systems Segment\nThree Months Ended\n \nSeptember 30,\n(dollars in millions)\n2025\n2024\nNet sales\n$\n1,641\n \n$\n1,448 \nOperating income\n$\n411\n \n$\n323 \nOperating margin\n25.0\n \n%\n22.3 \n%\nBacklog\n$\n7,716\n \n$\n6,852 \nNet Sales\nAerospace Systems Segment sales increased in the current-year quarter primarily due to higher volume in the commercial OEM and aftermarket, as well as the defense OEM market segment. \n- 23 -\nOperating Margin\nAerospace Systems Segment operating margin increased during the current-year quarter due to higher sales volume, aftermarket profitability, as well as benefits from cost containment initiatives. \nBusiness Realignment and Acquisition Integration Charges\nWithin the Aerospace Systems Segment, we incurred business realignment and acquisition integration charges of $5 million in both the current and prior-year quarter.  In both periods, these charges primarily related to acquisition integration activities.  We do not expect to incur material business realignment or acquisition integration charges for the remainder of fiscal 2026.  However, continually changing business conditions could impact the ultimate costs we incur.\nBacklog\nAerospace Systems Segment backlog as of September 30, 2025, increased from both the comparable prior-year quarter and the June 30, 2025 balance of $7.4 billion, primarily due to orders exceeding shipments in all market segments, especially in the commercial OEM and aftermarket market segments.\nBacklog consists of written firm orders from a customer to deliver products and, in the case of blanket purchase orders, only includes the portion of the order for which a schedule or release date has been agreed to with the customer.  The dollar value of backlog is equal to the amount that is expected to be billed to the customer and reported as a sale.\nCorporate general & administrative expenses\nThree Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\nExpense\nCorporate general and administrative expense\n$\n49\n \n$\n49 \nCorporate general and administrative expense, as a percent of sales\n1.0\n \n%\n1.0 \n%\nCorporate general and administrative expenses primarily included salaries, benefits and incentive compensation expense, professional service fees, information technology, charitable contributions and other discretionary spending.\nOther expense, net\nThree Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\nExpense (income)\nForeign currency transaction (gain) loss\n(1)\n$\n(7)\n$\n37 \nStock-based compensation expense\n80\n \n58 \nNon-service components of retirement benefit cost (income)\n(17)\n(12)\nAcquisition-related expenses\n13\n \n— \nLoss (gain) on disposal of assets and divestitures\n1\n \n(9)\nInterest income\n(5)\n(3)\nGain on insurance recoveries\n(2)\n(20)\n— \nOther items, net\n(3)\n(1)\n$\n42\n \n$\n70 \n(1)\n Foreign currency transaction (gain) loss primarily relates to the impact of exchange rates on cash, forward contracts and intercompany transactions.\n(2) \nGain on insurance recoveries for damaged property associated with a fire at one of our U.S. facilities within the Diversified Industrial segment that occurred in the third quarter of fiscal 2025.\n- 24 -\nLIQUIDITY AND CAPITAL RESOURCES\nWe believe that we are great generators and deployers of cash.  We assess our liquidity in terms of our ability to generate cash to fund our operations and meet our strategic capital deployment objectives, which include the following:\n•\nInvesting in organic growth and productivity\n•\nContinuing our record annual dividend increases\n•\nStrategic acquisitions that strengthen our portfolio\n•\nShare repurchases, including repurchases under the 10b5-1 share repurchase program\nCash Flows\nA summary of cash flows follows:\nThree Months Ended\n \nSeptember 30,\n(dollars in millions)\n2025\n2024\nChange\nCash provided by (used in):\nOperating activities\n$\n782\n \n$\n744 \n$\n38 \nInvesting activities\n(1,078)\n(87)\n(991)\nFinancing activities\n306\n \n(711)\n1,017 \nEffect of exchange rates\n(4)\n3 \n(7)\nNet increase (decrease) in cash and cash equivalents\n$\n6\n \n$\n(51)\n$\n57 \nNet cash provided by operating activities\n increased $38 million for the first three months of fiscal 2026 compared to the first three months of fiscal 2025, primarily driven by higher net income adjusted for non-cash items, such as depreciation, amortization, stock-based compensation expense and deferred income taxes.  This was partially offset by changes in working capital relating to accounts receivable and inventories.  We continue to focus on managing inventory and other working capital requirements.\n•\nDays sales outstanding relating to trade accounts receivable was 52 days at September 30, 2025, 51 days at June 30, 2025 and 52 days at September 30, 2024.\n•\nDays supply of inventory on hand was 93 days at September 30, 2025, 82 days at June 30, 2025 and 91 days at September 30, 2024.\nNet cash used in investing activities \nincreased for the first three months of fiscal 2026 compared to the first three months of fiscal 2025, primarily driven by a $1.0 billion increase in cash paid for acquisitions, net of cash acquired related to the acquisition of Curtis.\nNet cash provided by (used in) financing activities\n for the first three months of fiscal 2026 and 2025 were impacted by the following factors:\n•\nNet commercial paper borrowings of $1.1 billion in the first three months of fiscal 2026 compared to net commercial paper repayments of $377 million in the first three months of fiscal 2025.\n•\nPrincipal payments totaling $40 million related to borrowings under a term loan facility in the first three months of fiscal 2025. \n•\nRepurchases under the Company's share repurchase program amounted to 0.6 million common shares for $475 million during the first three months of fiscal 2026, compared to 0.1 million common shares for $50 million during the first three months of fiscal 2025.\nCash Requirements\nWe are actively monitoring our liquidity position and remain focused on managing our inventory and other working capital requirements.  We are targeting 2.5 percent of sales for capital expenditures for 2026 and have a long-term target of two percent.  We will continue to prioritize capital expenditures related to safety, productivity and strategic investments.  We believe that cash generated from operations and our commercial paper program will satisfy our operating needs for the foreseeable future.\n- 25 -\nDividends\nWe declared a quarterly cash dividend of $1.80 per share on August 21, 2025, which was paid on September 12, 2025.  Dividends have been paid for 301 consecutive quarters, including a yearly increase in dividends for 69 consecutive fiscal years.  Additionally, we declared a quarterly cash dividend of $1.80 per share on October 22, 2025, payable on December 5, 2025.\nShare Repurchases\nOn August 21, 2025, the Board of Directors approved an update to the number of shares available under the Company's previous share repurchase authorization so that the aggregate number of shares available for repurchase as of such date was 20.0 million.  There is no limitation on the number of shares that can be repurchased in a year and there is no expiration date for the program.  As of September 30, 2025, 19.4 million shares remained available under the repurchase authorization.  Refer to Note 10\n \nto the consolidated financial statements for further discussion of share repurchases.\nLiquidity\nCash, comprised of cash and cash equivalents,  marketable securities and other investments, includes $384 million and $344 million held by the Company's foreign subsidiaries at September 30, 2025 and June 30, 2025, respectively.  The Company does not permanently reinvest certain foreign earnings.  The distribution of these earnings could result in non-federal U.S. or foreign taxes.  All other undistributed foreign earnings remain permanently reinvested.\nAs of September 30, 2025, the Company had a line of credit totaling $3.75 billion through a multi-currency revolving credit agreement with a group of banks, of which $0.9 billion was available for borrowing as of September 30, 2025.  The multi-currency revolving credit agreement was amended on August 21, 2025, to increase the total line of credit by $750 million to $3.75 billion.  Advances from the credit agreement can be used for general corporate purposes, including acquisitions, and for the refinancing of existing indebtedness.  The credit agreement supports our commercial paper program, and issuances of commercial paper reduce the amount of credit available under the credit agreement.  The credit agreement expires in June 2028; however, the Company has the right to request a one-year extension of the expiration date on an annual basis, which may result in changes to the current terms and conditions of the credit agreement.  The credit agreement requires the payment of an annual facility fee, the amount of which is dependent upon the Company’s credit ratings.  Although a lowering of the Company’s credit ratings would increase the cost of future debt, it would not limit the Company’s ability to use the credit agreement, nor would it accelerate the repayment of any outstanding borrowings.\nOn August 21, 2025, the authorization limit to sell short-term commercial paper notes was increased from $3.0 billion to $3.75 billion.  As of September 30, 2025, $2.8 billion of commercial paper notes were outstanding, and the largest amount of commercial paper notes outstanding during the current-year quarter was $3.1 billion.\nWe primarily utilize unsecured medium-term notes and senior notes to meet our financing needs and we expect to continue to borrow funds at reasonable rates over the long term.  Refer to the Cash flows from financing activities section above and Note 13\n \nto the consolidated financial statements for further discussion.\nThe Company’s credit agreement and indentures governing certain debt securities contain various covenants, the violation of which would limit or preclude the use of the credit agreements for future borrowings, or might accelerate the maturity of the related outstanding borrowings covered by the indentures.  Based on the Company’s rating level at September 30, 2025, the most restrictive financial covenant provides that the ratio of debt to debt-shareholders' equity cannot exceed 0.65 to 1.0.  At September 30, 2025, the Company's debt to debt-shareholders' equity ratio was 0.43 to 1.0.  We are in compliance and expect to remain in compliance with all covenants set forth in the credit agreement and indentures.\nOur goal is to maintain an investment-grade credit profile. The rating agencies periodically update the Company's credit ratings as events occur.  At September 30, 2025, the long-term credit ratings assigned to the Company's senior debt securities by the credit rating agencies engaged by the Company were as follows:\nFitch Ratings\nA-\nMoody's Investors Services, Inc.\nA3\nStandard & Poor's\nBBB+\n- 26 -\nSupply Chain Financing\nWe continue to identify opportunities to improve our liquidity and working capital efficiency, which include the extension of payment terms with our suppliers.  We have supply chain financing programs with financial intermediaries, which provide certain suppliers the option to be paid by the financial intermediaries earlier than the due date on the applicable invoice.  We do not believe that changes in the availability of supply chain financing will have a significant impact on our liquidity.  Refer to Note 8 to the consolidated financial statements for further discussion.\nStrategic Acquisitions and Divestitures\nAcquisitions will be considered from time to time to the extent there is a strong strategic fit, while at the same time maintaining the Company’s strong financial position.  In addition, we will continue to assess our existing businesses and initiate efforts to divest businesses that are not considered to be a good long-term strategic fit for the Company.  On September 18, 2025, we completed the acquisition of Curtis, for approximately $1.0 billion, net of cash acquired.  Refer to Note 4\n \nto the consolidated financial statements for further discussion.  \n- 27 -\nForward-Looking Statements\nForward-looking statements contained in this and other written and oral reports are made based on known events and circumstances at the time of release, and as such, are subject in the future to unforeseen uncertainties and risks.  Often but not always, these statements may be identified from the use of forward-looking terminology such as “anticipates,” “believes,” “may,” “should,” “could,” “expects,” “targets,” “is likely,” “will,” or the negative of these terms and similar expressions, and include all statements regarding future performance, orders, earnings projections, events or developments.  Neither Parker nor any of its respective associates or directors, officers or advisers, provides any representation, assurance or guarantee that the occurrence of the events expressed or implied in any forward-looking statements will actually occur.  Parker cautions readers not to place undue reliance on these statements.  It is possible that the future performance may differ materially from past performance or current expectations.\n \n A change in the economic conditions in individual markets may have a particularly volatile effect on segment performance.\nAmong other factors which may affect future performance are:\n•\nchanges in business relationships with and orders by or from major customers, suppliers or distributors, including delays or cancellations in shipments; \n•\ndisputes regarding contract terms, changes in contract costs and revenue estimates for new development programs; \n•\nchanges in product mix; \n•\nability to identify acceptable strategic acquisition targets; \n•\nuncertainties surrounding timing, successful completion or integration of acquisitions and similar transactions; including the integration of Curtis Instruments, Inc.;\n•\nability to successfully divest businesses planned for divestiture and realize the anticipated benefits of such divestitures; \n•\nthe determination and ability to successfully undertake business realignment activities and the expected costs, including cost savings, thereof; \n•\nability to implement successfully business and operating initiatives, including the timing, price and execution of share repurchases and other capital initiatives; \n•\navailability, cost increases of or other limitations on our access to raw materials, component products and/or commodities if associated costs cannot be recovered in product pricing; \n•\nability to manage costs related to insurance and employee retirement and health care benefits; \n•\nlegal and regulatory developments and other government actions, including related to environmental protection, and associated compliance costs; \n•\nsupply chain and labor disruptions, including as a result of tariffs and labor shortages; \n•\nthreats associated with international conflicts and cybersecurity risks and risks associated with protecting our intellectual property; \n•\nuncertainties surrounding the ultimate resolution of outstanding legal proceedings, including the outcome of any appeals; \n•\neffects on market conditions, including sales and pricing, resulting from global reactions to U.S. trade policies; \n•\nmanufacturing activity, air travel trends, currency exchange rates, difficulties entering new markets and economic conditions such as inflation, deflation, interest rates and credit availability;\n•\ninability to obtain, or meet conditions imposed for, required governmental and regulatory approvals; \n•\nchanges in the tax laws in the United States and foreign jurisdictions and judicial or regulatory interpretations thereof; and \n•\nlarge scale disasters, such as floods, earthquakes, hurricanes, industrial accidents and pandemics.\nReaders should consider these forward-looking statements in light of risk factors discussed in Parker’s Annual Report on Form 10-K for the fiscal year ended June 30, 2025 and other periodic filings made with the Securities and Exchange Commission. \nThe Company makes these statements as of the date of the filing of this Quarterly Report on Form 10-Q for the quarter ended September 30, 2025, and undertakes no obligation to update them unless otherwise required by law.\n- 28 -"
}