{
  "source_file": "phm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations are provided as a supplement to and should be read in conjunction with the consolidated financial statements and related notes included elsewhere in this Quarterly Report on Form 10-Q as well as our audited consolidated financial statements and related notes included in our Annual Report on Form 10-K for the year ended December 31, 2024.\nThe following is a summary of our operating results by line of business ($000's omitted, except per share data):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2024\n2025\n2024\nIncome before income taxes:\nHomebuilding\n$\n723,430 \n$\n851,270 \n$\n2,133,069 \n$\n2,663,868 \nFinancial Services\n44,358 \n54,926 \n123,013 \n159,283 \nIncome before income taxes\n767,788 \n906,196 \n2,256,082 \n2,823,151 \nIncome tax expense\n(181,954)\n(208,282)\n(538,967)\n(653,128)\nNet income\n$\n585,834 \n$\n697,914 \n$\n1,717,115 \n$\n2,170,023 \nDiluted earnings per share\n$\n2.96 \n$\n3.35 \n$\n8.55 \n$\n10.28 \nIn the third quarter of 2025, the consumer demand weakness we experienced in the first half of the year continued. This softening continued to be influenced by ongoing affordability challenges, resulting from elevated mortgage interest rates and higher housing costs, as well as volatility in other macroeconomic and geopolitical conditions, including weakened consumer confidence. We have responded to these conditions by adjusting production cadence and sales prices where necessary and focusing sales incentives on discounts on spec inventory (houses without customer orders) and closing cost incentives, especially mortgage interest rate buydowns. Despite these efforts, net new orders in units decreased 6% and 7% for the three and nine months ended September 30, 2025, respectively, versus the comparable prior year periods.\nWe expect that many homebuyers will continue to face affordability challenges, so our sales paces may remain volatile on a monthly basis. In response, we expect our sales incentives to remain elevated and for our pace of house starts to remain dynamic. Additionally, we continue to face pressure in the cost of land acquisition and development. Due to the length of our land development and construction cycle times, there is a lag between when such cost changes occur and when they impact our operating results. This is evidenced in our gross margin from home sales for the third quarter of 2025, which decreased to 26.2% from 28.8% in the comparable prior year period, and from 27.0% in the second quarter of 2025. These decreases are primarily due to higher land costs combined with the aforementioned elevated sales incentives. While we expect to continue to generate healthy gross margins, they may decline somewhat in future periods as a result of these factors.\nIn response to the significant shift in market conditions in 2025, we have slowed the pace of our housing starts, have increased sales incentives, and are taking additional pricing actions in many of our communities, which have resulted in $42.2 million of land inventory impairments during the nine months ended September 30, 2025. We continue to update the underwriting for our land option contracts prior to buying additional land and have made decisions to walk away from a number of land option agreements, which resulted in write-offs of deposits and pre-acquisition costs totaling $26.5 million in the nine months ended September 30, 2025. We will continue working with our trade partners to update the costs for materials, labor, and services to reflect changes in market conditions and plan to adjust our overhead cost structure as necessary to align with demand. \nAlthough elevated mortgage interest rates and volatile macroeconomic and geopolitical conditions may persist for some time, we believe the demographics supporting housing demand remain favorable over the long term. Inventories of new and existing homes have increased in the majority of our geographies as a result of the weakened demand experienced this year, so we are  taking a measured approach to our capital allocation strategy as we anticipate continued volatility in demand. Accordingly, we are focused on protecting liquidity and closely managing our cash flows while also continuing to emphasize shareholder returns, including the following actions:\n–\nIncreasing our lot optionality within our land pipeline for increased flexibility;\n–\nProducing sufficient levels of spec inventory to service buyers seeking to close within 30 to 90 days;\n–\nMaintaining a focus on shareholder return through share buybacks and dividends, including a 10% increase in our quarterly dividends from $0.20 to $0.22 per share effective with our January 2025 dividend payment and an additional $1.5 billion share repurchase authorization effective January 2025, bringing our total remaining share repurchase \n24\nauthorization to $1.3 billion as of September 30, 2025, after $900.0 million of share repurchases in the first nine months of 2025;\n–\nTaking an opportunistic approach to retiring debt; and\n–\nMaintaining ample liquidity.\nWe believe our strategic approach with respect to balancing sales price with sales pace, including actions taken related to sales incentives and our production cadence, will enable us to meet consumer demand at the selling prices necessary to turn our inventory, maintain market share, and generate healthy returns. We remain confident in our ability to navigate the future environment and to position the Company to take advantage of opportunities as they arise and support future growth and continued profitability and financial strength.\nHomebuilding Operations\nThe following presents selected financial information for our Homebuilding operations ($000’s omitted):\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2025 vs. 2024\n2024\n2025\n2025 vs. 2024\n2024\nHome sale revenues\n$\n4,248,375 \n(2)\n%\n$\n4,343,227 \n$\n12,265,619 \n(3)\n%\n$\n12,610,981 \nLand sale and other revenues\n53,169 \n176 \n%\n19,284 \n140,345 \n46 \n%\n96,327 \nTotal Homebuilding revenues \n4,301,544 \n(1)\n%\n4,362,511 \n12,405,964 \n(2)\n%\n12,707,308 \nHome sale cost of revenues \n(a)\n(3,133,548)\n1 \n%\n(3,091,267)\n(8,968,112)\n1 \n%\n(8,897,835)\nLand sale and other cost of revenues\n(48,062)\n90 \n%\n(25,287)\n(129,504)\n28 \n%\n(101,204)\nSelling, general, and administrative\n  expenses (\"SG&A\") \n(b)\n(400,681)\n(2)\n%\n(406,897)\n(1,184,472)\n5 \n%\n(1,125,637)\nEquity income (loss) from unconsolidated\n  entities, net \n(c)\n2,422 \n(3)\n%\n2,508 \n2,083 \n(d)\n41,527 \nOther income, net\n1,755 \n(d)\n9,702 \n7,110 \n(d)\n39,709 \nIncome before income taxes\n$\n723,430 \n(15)\n%\n$\n851,270 \n$\n2,133,069 \n(20)\n%\n$\n2,663,868 \nSupplemental data:\nGross margin from home sales \n(a)\n26.2 \n%\n(260) bps\n28.8 \n%\n26.9 \n%\n(250) bps\n29.4 \n%\nSG&A as a percentage of home\n  sale revenues \n(b)\n9.4 \n%\n— \n9.4 \n%\n9.7 \n%\n80 bps\n8.9 \n%\nClosings (units)\n7,529 \n(5)\n%\n7,924 \n21,751 \n(6)\n%\n23,116 \nAverage selling price\n$\n564 \n3 \n%\n$\n548 \n$\n564 \n3 \n%\n$\n546 \nNet new orders:\nUnits\n6,638 \n(6)\n%\n7,031 \n21,486 \n(7)\n%\n23,059 \nDollars \n(e)\n$\n3,639,690 \n(7)\n%\n$\n3,928,860 \n$\n12,005,455 \n(8)\n%\n$\n12,986,027 \nCancellation rate\n16 \n%\n15 \n%\n15 \n%\n14 \n%\nAverage active communities\n1,002 \n5 \n%\n957 \n986 \n5 \n%\n940 \nBacklog at September 30:\nUnits\n9,888 \n(18)\n%\n12,089 \nDollars\n$\n6,234,554 \n(19)\n%\n$\n7,694,761 \n(a)\nIncludes the amortization of capitalized interest.\n(b)\nSG&A includes insurance reserve reversals of  $78.7 million for the nine months ended September 30, 2024 (see \nNote 8\n).\n(c)\nEquity income from unconsolidated entities includes a gain of $37.7 million for the nine months ended September 30, 2024 related to the sale of our minority interest in a joint venture.\n(d)\nPercentage not meaningful.\n(e)\nNet new order dollars represent a composite of new order dollars combined with other movements of the dollars in backlog related to cancellations and change orders.\n25\nHome sale revenues\nHome sale revenues in the three and nine months ended September 30, 2025 were lower than the prior year periods by $94.9 million and $345.4 million, respectively. In the three months ended September 30, 2025, the 2% decrease resulted primarily from a 5% decrease in closings from the prior year period, partially offset by a 3% increase in average selling price. In the nine months ended September 30, 2025 the 3% decrease resulted primarily from a 6% decrease in closings, partially offset by a 3% increase in average selling price. The decreases in closings were primarily attributable to lower net new orders in the first half of 2025 and a weaker order backlog entering the year, partially offset by a higher community count and improved production cycle times. Average selling price during the three and nine months ended September 30, 2025 increased primarily due to product and geographic mix, including a slightly higher mix of closings toward our move-up buyers and in our Northeast segment, both of which carry a higher average selling price.\nHome sale gross margins \nHome sale gross margins were 26.2% and 26.9% in the three and nine months ended September 30, 2025, respectively, compared with 28.8% and 29.4% in the three and nine months ended September 30, 2024, respectively. The decreases in home sale gross margins were primarily attributable to the aforementioned pricing actions, including elevated sales incentives, and increased land acquisition and development costs. We expect these factors to continue to impact our gross margins over the near term. Gross margins for the first nine months of 2025 were also unfavorably impacted by our efforts to reduce completed spec inventory to more appropriate levels, which we expect will continue to be an area of focus for the remainder of 2025. While we have made significant progress in reducing the level of spec inventory during 2025, the level of completed spec inventory remains elevated for the current demand environment. \nLand sale and other revenues\nWe periodically elect to sell parcels of land to third parties in the event such assets no longer fit into our strategic operating plans or are zoned for commercial or other development. Land sale and other revenues and their related gains or losses vary between periods, depending on the timing of land sales and our strategic operating decisions. Land sales and other revenues contributed income of $5.1 million and $10.8 million for the three and nine months ended September 30, 2025, respectively, compared with losses of $6.0 million and $4.9 million for the three and nine months ended September 30, 2024, respectively.\nSG&A\nSG&A as a percentage of home sale revenues was 9.4% and 9.7% and in the three and nine months ended September 30, 2025, respectively, compared with 9.4% and 8.9% for the three and nine months ended September 30, 2024, respectively. The gross dollar amount of our SG&A decreased $6.2 million, or 2%, for the three months ended September 30, 2025 compared with the prior year period, and increased $58.8 million, or 5%, for the nine months ended September 30, 2025 compared with the prior year period. The increase in gross dollars for the nine months ended September 30, 2025 resulted primarily from insurance reserve reversals of $78.7 million recorded in the nine months ended September 30, 2024, respectively. Additionally, SG&A for the first nine months of 2025 reflects modestly higher headcount and technology costs to support ongoing production volumes. We expect to continue managing and balancing our overhead costs consistent with expected changes in the demand environment. \nOther income, net\nOther income, net includes the following ($000’s omitted):\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\nWrite-offs of deposits and pre-acquisition costs \n$\n(10,836)\n$\n(4,732)\n$\n(26,515)\n$\n(12,406)\nAmortization of intangible assets\n(2,301)\n(2,498)\n(6,968)\n(7,536)\nInterest income\n11,804 \n13,748 \n31,646 \n48,268 \nInterest expense\n(170)\n(120)\n(438)\n(352)\nMiscellaneous, net\n3,258 \n3,304 \n9,385 \n11,735 \nOther income, net\n$\n1,755 \n$\n9,702 \n$\n7,110 \n$\n39,709 \n26\nThe increase in write-offs of deposits and pre-acquisition costs for 2025 relative to 2024 resulted from strategic decisions to not move forward with certain projects based on the current environment. Interest income declined in 2025, primarily due to lower returns on invested cash balances.\nNet new orders\nNet new orders in units decreased 6% while net new orders in dollars decreased 7% in the three months ended September 30, 2025, as compared with the prior year period. Net new orders in units decreased 7% while net new orders in dollars decreased 8% in the nine months ended September 30, 2025, as compared with the prior year period. The decreased net new order volume and dollars in the three and nine months ended September 30, 2025 over the comparable prior year periods was primarily attributable to lower order volumes in our Texas and West segments. Cancellation rates (canceled orders for the period divided by gross new orders for the period) were 16% and 15% for the three and nine months ended September 30, 2025, respectively, and 15% and 14% for the three and nine months ended September 30, 2024, respectively. Ending backlog dollars, which represent orders for homes that have not yet closed, decreased 19% at September 30, 2025 compared with September 30, 2024.\nHomes in production\nWe operate our business to generate a cadence of house starts that aligns with the sales environment, and an appropriate inventory of quick move-in speculative (spec) homes as we focus on turning our assets and delivering high returns on investment, which has allowed us to achieve an effective balance of price and pace. Our production cycle times have improved significantly over the past two years and have now returned to near historical norms. The following is a summary of our homes in production:\nSeptember 30,\n2025\nSeptember 30,\n2024\nSold\n7,727 \n9,684 \nUnsold\nUnder construction\n5,342 \n6,055 \nCompleted\n2,027 \n1,357 \n7,369 \n7,412 \nModels\n1,710 \n1,537 \nTotal\n16,806 \n18,633 \nThe number of homes in production at September 30, 2025 was 10% lower than at September 30, 2024. This decrease was primarily due to a decreased number of sold homes due to lower backlog and improved production cycle times, which reduces the length of time a home sits in inventory. \n27\nControlled lots\nThe following is a summary of our lots under control at September 30, 2025 and December 31, 2024:\nSeptember 30, 2025\nDecember 31, 2024\nOwned\nOptioned\nControlled\nOwned\nOptioned\nControlled\nNortheast\n3,654 \n7,491 \n11,145 \n3,946 \n6,693 \n10,639 \nSoutheast\n19,333 \n34,904 \n54,237 \n17,843 \n32,770 \n50,613 \nFlorida\n25,029 \n42,080 \n67,109 \n27,041 \n34,499 \n61,540 \nMidwest\n11,225 \n20,660 \n31,885 \n11,271 \n20,061 \n31,332 \nTexas\n16,121 \n18,501 \n34,622 \n15,420 \n23,663 \n39,083 \nWest\n26,414 \n14,839 \n41,253 \n26,655 \n14,727 \n41,382 \nTotal\n101,776 \n138,475 \n240,251 \n102,176 \n132,413 \n234,589 \n42 \n%\n58 \n%\n100 \n%\n44 \n%\n56 \n%\n100 \n%\nDeveloped (%)\n48 \n%\n24 \n%\n34 \n%\n48 \n%\n24 \n%\n34 \n%\nWhile competition for well-positioned land is robust, we have continued to pursue land investments that we believe can achieve appropriate risk-adjusted returns on invested capital. We have also continued to seek to maintain a high percentage of our lots that are controlled via land option agreements as such contracts enable us to defer acquiring portions of properties owned by third parties or unconsolidated entities until we have determined whether and when to exercise our option, which reduces our financial risks associated with long-term land holdings. The remaining purchase price under our land option agreements totaled $9.9 billion at September 30, 2025. \nHomebuilding Segment Operations\nAs of September 30, 2025, we conducted our operations in 47 markets located throughout 26 states. For reporting purposes, our Homebuilding operations are aggregated into six reportable segments:\n \nNortheast:\nMaryland, Massachusetts, New Jersey, Pennsylvania, Rhode Island, Virginia\nSoutheast:\nGeorgia, North Carolina, South Carolina, Tennessee\nFlorida:\nFlorida\nMidwest:\nIllinois, Indiana, Kentucky, Michigan, Minnesota, Ohio\nTexas:\nTexas\nWest:\nArizona, California, Colorado, Nevada, New Mexico, Oregon, Utah, Washington\nThe following tables present selected financial information for our reportable Homebuilding segments:\n28\nOperating Data by Segment ($000's omitted)\nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2025 vs. 2024\n2024\n2025\n2025 vs. 2024\n2024\nRevenues:\nNortheast\n$\n303,181 \n14 \n%\n$\n265,395 \n$\n900,352 \n25 \n%\n$\n722,952 \nSoutheast\n770,295 \n16 \n%\n666,019 \n2,156,041 \n— \n%\n2,153,828 \nFlorida\n1,098,712 \n(6)\n%\n1,167,456 \n3,116,603 \n(14)\n%\n3,606,409 \nMidwest\n719,327 \n9 \n%\n660,096 \n1,993,116 \n8 \n%\n1,843,384 \nTexas\n409,160 \n(28)\n%\n567,871 \n1,287,491 \n(23)\n%\n1,675,586 \nWest\n946,662 \n(7)\n%\n1,016,977 \n2,815,217 \n8 \n%\n2,611,911 \nOther homebuilding \n(a)\n54,207 \n190 \n%\n18,697 \n$\n137,144 \n47 \n%\n$\n93,238 \n$\n4,301,544 \n(1)\n%\n$\n4,362,511 \n$\n12,405,964 \n(2)\n%\n$\n12,707,308 \nIncome before income taxes \n(b)\n:\nNortheast\n$\n65,531 \n19 \n%\n$\n55,059 \n$\n215,338 \n41 \n%\n$\n152,491 \nSoutheast\n153,104 \n8 \n%\n141,252 \n430,539 \n(11)\n%\n482,683 \nFlorida\n215,580 \n(20)\n%\n267,981 \n608,723 \n(31)\n%\n879,644 \nMidwest\n147,906 \n13 \n%\n131,165 \n391,658 \n14 \n%\n343,916 \nTexas\n38,219 \n(58)\n%\n91,218 \n143,154 \n(50)\n%\n287,989 \nWest\n92,718 \n(35)\n%\n143,552 \n306,789 \n(13)\n%\n351,191 \nOther homebuilding \n(c)\n10,372 \n(51)\n%\n21,043 \n36,868 \n(78)\n%\n165,954 \n$\n723,430 \n(15)\n%\n$\n851,270 \n$\n2,133,069 \n(20)\n%\n$\n2,663,868 \n(a)\nOther homebuilding includes revenues from land sales and construction services.\n(b)\nIncludes land-related charges as summarized in the table below.\n(c)     Other homebuilding includes the amortization of intangible assets and capitalized interest and other items not allocated to the other segments. Other homebuilding also includes insurance reserve reversals of $78.7 million, respectively, for the nine months ended September 30, 2024, (see \nNote 8\n), and a gain of $37.7 million for the nine months ended September 30, 2024 related to the sale of our minority interest in a joint venture.\n29\nOperating Data by Segment ($000's omitted)\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2025 vs. 2024\n2024\n2025\n2025 vs. 2024\n2024\nClosings (units):\nNortheast\n408 \n4 \n%\n391 \n1,198 \n14 \n%\n1,054 \nSoutheast\n1,444 \n8 \n%\n1,340 \n4,039 \n(6)\n%\n4,284 \nFlorida\n1,932 \n(3)\n%\n1,984 \n5,464 \n(10)\n%\n6,051 \nMidwest\n1,313 \n10 \n%\n1,194 \n3,675 \n9 \n%\n3,380 \nTexas\n1,073 \n(28)\n%\n1,485 \n3,330 \n(22)\n%\n4,285 \nWest\n1,359 \n(11)\n%\n1,530 \n4,045 \n— \n%\n4,062 \n7,529 \n(5)\n%\n7,924 \n21,751 \n(6)\n%\n23,116 \nAverage selling price:\nNortheast\n$\n743 \n9 \n%\n$\n679 \n$\n752 \n10 \n%\n$\n686 \nSoutheast\n533 \n7 \n%\n497 \n534 \n6 \n%\n503 \nFlorida\n569 \n(3)\n%\n588 \n570 \n(4)\n%\n596 \nMidwest\n548 \n(1)\n%\n553 \n542 \n(1)\n%\n545 \nTexas\n381 \n— \n%\n382 \n387 \n(1)\n%\n391 \nWest\n697 \n5 \n%\n665 \n696 \n8 \n%\n643 \n$\n564 \n3 \n%\n$\n548 \n$\n564 \n3 \n%\n$\n546 \nNet new orders - units:\nNortheast\n371 \n(4)\n%\n385 \n1,159 \n(5)\n%\n1,226 \nSoutheast\n1,354 \n1 \n%\n1,340 \n4,115 \n— \n%\n4,130 \nFlorida\n1,721 \n2 \n%\n1,681 \n5,363 \n(1)\n%\n5,399 \nMidwest\n1,144 \n(7)\n%\n1,233 \n3,804 \n1 \n%\n3,772 \nTexas\n938 \n(17)\n%\n1,134 \n3,267 \n(15)\n%\n3,863 \nWest\n1,110 \n(12)\n%\n1,258 \n3,778 \n(19)\n%\n4,669 \n6,638 \n(6)\n%\n7,031 \n21,486 \n(7)\n%\n23,059 \nNet new orders - dollars:\nNortheast\n$\n254,954 \n(10)\n%\n$\n283,978 \n$\n836,914 \n(5)\n%\n$\n883,513 \nSoutheast\n714,843 \n1 \n%\n708,071 \n2,189,595 \n2 \n%\n2,138,291 \nFlorida\n956,442 \n1 \n%\n947,233 \n3,035,876 \n(4)\n%\n3,148,935 \nMidwest\n626,244 \n(6)\n%\n669,242 \n2,062,965 \n1 \n%\n2,050,261 \nTexas\n344,946 \n(18)\n%\n419,286 \n1,233,766 \n(17)\n%\n1,495,097 \nWest\n742,261 \n(18)\n%\n901,050 \n2,646,339 \n(19)\n%\n3,269,930 \n$\n3,639,690 \n(7)\n%\n$\n3,928,860 \n$\n12,005,455 \n(8)\n%\n$\n12,986,027 \n30\nOperating Data by Segment ($000's omitted)\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2025 vs. 2024\n2024\nCancellation rates:\nNortheast\n8 \n%\n7 \n%\n9 \n%\n7 \n%\nSoutheast\n13 \n%\n11 \n%\n12 \n%\n11 \n%\nFlorida\n16 \n%\n16 \n%\n15 \n%\n15 \n%\nMidwest\n11 \n%\n10 \n%\n10 \n%\n9 \n%\nTexas\n19 \n%\n18 \n%\n16 \n%\n16 \n%\nWest\n22 \n%\n21 \n%\n20 \n%\n18 \n%\n16 \n%\n15 \n%\n15 \n%\n14 \n%\nUnit backlog:\nNortheast\n576\n(22)\n%\n739\nSoutheast\n1,988\n(5)\n%\n2,092\nFlorida\n2,694\n(14)\n%\n3,140\nMidwest\n1,931\n(7)\n%\n2,084\nTexas\n885\n(27)\n%\n1,215\nWest\n1,814\n(36)\n%\n2,819\n9,888\n(18)\n%\n12,089\nBacklog dollars:\nNortheast\n$\n442,684\n(22)\n%\n$\n568,932\nSoutheast\n1,161,072\n(4)\n%\n1,206,199\nFlorida\n1,730,836\n(15)\n%\n2,043,444\nMidwest\n1,134,011\n(7)\n%\n1,218,380\nTexas\n377,451\n(31)\n%\n549,900\nWest\n1,388,500\n(34)\n%\n2,107,906\n$\n6,234,554\n(19)\n%\n$\n7,694,761\n31\nOperating Data by Segment \n($000’s omitted)\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n2025\n2024\n2025\n2024\nLand-related charges \n(a)\n:\nNortheast\n$\n160 \n$\n5,890 \n$\n401 \n$\n7,494 \nSoutheast\n3,099 \n188 \n8,773 \n2,744 \nFlorida\n1,200 \n1,085 \n6,489 \n2,002 \nMidwest\n898 \n188 \n2,501 \n835 \nTexas\n7,840 \n1,257 \n12,190 \n1,764 \nWest\n13,710 \n3,352 \n37,134 \n4,796 \nOther homebuilding\n720 \n171 \n2,323 \n294 \n$\n27,627 \n$\n12,131 \n$\n69,811 \n$\n19,929 \n(a)    Land-related charges include land inventory impairments, net realizable value adjustments on land held for sale, and write-offs of deposits and pre-acquisition costs for land option contracts we elected not to pursue. Other homebuilding consists primarily of write-offs of capitalized interest related to such land-related charges.\nNortheast \n    \nFor the third quarter of 2025, Northeast home sale revenues increased 14% when compared with the prior year period due to a 4% increase in closings combined with a 9% increase in average selling price. The increase in closings and average selling price occurred across the majority of markets. Income before income taxes increased 19%, primarily due to higher revenues across the majority of markets. Net new orders decreased across the majority of markets.\nFor the nine months ended September 30, 2025, Northeast home sale revenues increased 25% when compared with the prior year period due to a 14% increase in closings combined with a 10% increase in average selling price. The increase in closings was primarily due to the timing of projects in our Northeast Corridor operations, while the increase in average selling price occurred across all markets. Income before income taxes increased 41% primarily due to higher revenues and gross margins across the majority of markets. Net new orders decreased across the majority of markets.\nSoutheast\nFor the third quarter of 2025, Southeast home sale revenues increased 16% when compared with the prior year period due to a 8% increase in closings combined with a 7% increase in average selling price. The increase in closings and average selling price occurred across the majority of markets. Income before income taxes increased 8%, primarily due to higher revenues across the majority of markets. The increase in net new orders occurred across the majority of among markets.\nFor the nine months ended September 30, 2025, Southeast home sale revenues increased slightly when compared with the prior year period due to a 6% increase in average selling price partially offset by a 6% decrease in closings. The increase in average selling price and decrease in closings was mixed among markets. Income before income taxes decreased 11% primarily due to lower gross margins across all markets. The decrease in net new orders was mixed among markets.\nFlorida\nFor the third quarter of 2025, Florida home sale revenues decreased 6% when compared with the prior year period primarily due to a 3% decrease in closings combined with an 3% decrease in average selling price. The decrease in closings and average selling price occurred across the majority of markets. Income before income taxes decreased 20% primarily due to lower revenues across the majority of markets and lower gross margins across all markets. Net new orders increased across the majority of markets.\n32\nFor the nine months ended September 30, 2025, Florida home sale revenues decreased 14% when compared with the prior year period due to a 10% decrease in closings combined with a 4% decrease in the average selling price. The decrease in closings and average selling price occurred across the majority of markets. Income before income taxes decreased 31% primarily due to lower revenues and gross margins across the majority of markets. The decrease in net new orders was mixed among markets.\nMidwest\nFor the third quarter of 2025, Midwest home sale revenues increased 9% when compared with the prior year period due to a 10% increase in closings partially offset by a 1% decrease in average selling price. The increase in closings occurred across the majority of markets while the decrease in average selling price was mixed among markets. Income before income taxes increased 13% primarily due to higher revenues and gross margins across the majority of markets. The decrease in net new orders occurred across the majority of markets.\nFor the nine months ended September 30, 2025, Midwest home sale revenues increased 8% when compared with the prior year period due to an 9% increase in closings partially offset by a slight 1% decrease in average selling price. The increase in closings and the decrease in average selling price occurred across the majority of markets. Income before income taxes increased 14% primarily due to higher revenues and gross margins across the majority of markets. The increase in net new orders was mixed among markets.\nTexas\nFor the third quarter of 2025, Texas home sale revenues decreased 28% when compared with the prior year period due to a 28% decrease in closings combined with a slight decrease in average selling price. The decrease in closings occurred across all markets while the decrease in average selling price was mixed among markets. Income before income taxes decreased 58% primarily due to lower revenues across all markets and lower gross margins across the majority of markets. The decrease in net new orders occurred across all markets.\nFor the nine months ended September 30, 2025, Texas home sale revenues decreased 23% when compared with the prior year period due to a 22% decrease in closings combined with a 1% decrease in average selling price. The decrease in closings occurred across all markets while the decrease in average selling price was mixed among markets. Income before income taxes decreased 50% primarily due to decreased revenues across all markets and decreased gross margins across the majority of markets. Net new orders decreased across all markets.\nWest\n    \nFor the third quarter of 2025, West home sale revenues decreased 7% when compared with the prior year period due to a 11% decrease in closings partially offset by a 5% increase in average selling price. The decrease in closings and increase in average selling price occurred across the majority of markets. Income before income taxes decreased 35%, primarily due to lower revenues and gross margins across the majority of markets. Net new orders decreased across the majority of markets.\nFor the nine months ended September 30, 2025, West home sale revenues increased 8% when compared with the prior year period due to an 8% increase in average selling price partially offset by a slight decrease in closings. The increase in average selling price and decrease in closings occurred across the majority of markets. Income before income taxes decreased 13% primarily due to lower gross margin and increased overhead costs across the majority of markets. Net new orders decreased across the majority of markets\nFinancial Services Operations\nWe conduct our Financial Services operations, which include mortgage banking, title, and insurance agency operations, through Pulte Mortgage LLC (\"Pulte Mortgage\") and other subsidiaries. In originating mortgage loans, we initially use our own funds supplemented by funds available pursuant to a credit agreement with third parties. Substantially all of the loans we originate are sold in the secondary market within a short period of time after origination, generally within 30 days. We also sell the servicing rights for the loans we originate through fixed price servicing sales contracts to reduce the risks and costs inherent in servicing loans. This strategy results in owning loans and related servicing rights for only a short period of time. Operating as a captive business model primarily targeted to support our Homebuilding operations, the business levels of our Financial Services operations are highly correlated to Homebuilding, as Homebuilding customers continue to account for substantially all of its business. We believe that our mortgage capture rate, which represents loan originations from our Homebuilding operations as a percentage of total loan opportunities from our Homebuilding operations, excluding cash closings, is an important metric in \n33\nevaluating the effectiveness of our captive mortgage business model. The following tables present selected financial information for our Financial Services operations ($000's omitted):\n \nThree Months Ended\nNine Months Ended\n \nSeptember 30,\nSeptember 30,\n \n2025\n2025 vs. 2024\n2024\n2025\n2025 vs. 2024\n2024\nMortgage revenues\n$\n73,816 \n(7)\n%\n$\n79,647 \n$\n210,910 \n(4)\n%\n$\n219,637 \nTitle services revenues\n25,086 \n(1)\n%\n25,396 \n71,844 \n(1)\n%\n72,620 \nInsurance agency commissions\n4,353 \n(50)\n%\n8,788 \n12,487 \n(51)\n%\n25,591 \nTotal Financial Services revenues\n103,255 \n(9)\n%\n113,831 \n295,241 \n(7)\n%\n317,848 \nExpenses\n(58,897)\n— \n%\n(58,905)\n(173,478)\n9 \n%\n(159,615)\nEquity income from unconsolidated entities\n— \n— \n%\n— \n1,250 \n19 \n%\n1,050 \nIncome before income taxes\n$\n44,358 \n(19)\n%\n$\n54,926 \n$\n123,013 \n(23)\n%\n$\n159,283 \nTotal originations:\nLoans\n4,782 \n(4)\n%\n5,005 \n14,037 \n(3)\n%\n14,442 \nPrincipal\n$\n2,054,441 \n(2)\n%\n$\n2,103,197 \n$\n6,085,214 \n1 \n%\n$\n5,998,347 \n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\nSupplemental data:\nCapture rate\n85.1 \n%\n85.9 \n%\nAverage FICO score\n752 \n749 \nFunded origination breakdown:\nGovernment (FHA, VA, USDA)\n27 \n%\n26 \n%\nOther agency\n69 \n%\n71 \n%\nTotal agency\n96 \n%\n97 \n%\nNon-agency\n4 \n%\n3 \n%\nTotal funded originations\n100 \n%\n100 \n%\nRevenues\nTotal Financial Services revenues for the three and nine months ended September 30, 2025 decreased 9% and 7%, respectively, compared with the comparable prior year periods, reflective of the lower homebuilding volume. Insurance agency commissions reflect lower policy retention and commission rates as a result of the evolving environment for home insurance as carriers adjust their premiums, geographic markets, and product coverages.\nIncome before income taxes\nIncome before income taxes in the three and nine months ended September 30, 2025 decreased 19% and 23%, respectively, compared with the same period in 2024 due to lower insurance agency commissions combined with higher expenses.  \n34\nIncome Taxes\nOur effective tax rate for the three and nine months ended September 30, 2025 was 23.7% and 23.9%, respectively, compared with 23.0% and 23.1% for the comparable prior year periods. Our effective tax rate for each of these periods differs from the federal statutory rate primarily due to state income tax expense and federal tax credits. Income tax expense for the nine months ended September 30, 2024 also reflected a reduction in income tax liabilities totaling $13.2 million related to the favorable resolution of uncertain state tax positions.\nLiquidity and Capital Resources\nWe finance our land acquisition, development, and construction activities and financial services operations using internally-generated funds, supplemented by credit arrangements with third parties and capital market financing. We routinely monitor current and expected operational requirements and financial market conditions to evaluate accessing available financing sources, including revolving bank credit and securities offerings.\nAt September 30, 2025, we had unrestricted cash and equivalents of $1.5 billion, restricted cash balances of $28.0 million, and \n$902.0 million\n available under our Revolving Credit Facility. Our ratio of debt-to-total capitalization, excluding our Financial Services debt, was 11.2% at September 30, 2025, compared with 11.8% at December 31, 2024. We follow a diversified investment approach for our cash and equivalents by maintaining such funds with a portfolio of banks within our group of relationship banks in high quality, highly liquid, short-term deposits and investments, which helps mitigate banking concentration risk. \nFor the next 12 months, we expect our principal demand for funds will be for the acquisition and development of land inventory, construction of house inventory, the repayment of certain of our unsecured senior notes due in March 2026, and operating expenses, including our general and administrative expenses. We plan to continue our dividend payments and repurchases of common stock. In August 2026, we need to repay or refinance Pulte Mortgage's master repurchase agreement with third-party lenders (as amended, the \"Repurchase Agreement\"). While we intend to refinance the Repurchase Agreement, there can be no assurances that the Repurchase Agreement can be renewed or replaced on commercially reasonable terms upon its expiration. However, we believe we have adequate liquidity to meet Pulte Mortgage's anticipated financing needs. Beyond the next 12 months, we will need to repay or refinance our Revolving Credit Facility, which matures in June 2027, and additional unsecured senior notes beginning in January 2027 and beyond (see \nNote 4\n). We may from time to time repurchase our unsecured senior notes through open market purchases, privately negotiated transactions, or otherwise.\nWe believe that our current cash position and other available financing resources, coupled with our ongoing operating activities, will provide sufficient liquidity to fund our business needs over the next 12 months and beyond. To the extent the sources of capital described above are insufficient to meet our needs, we may also conduct additional public offerings of our securities, refinance debt, dispose of certain assets to fund our operating activities, or draw on existing or new debt facilities.\nUnsecured senior notes\nWe had $1.6 billion of unsecured senior notes outstanding at both September 30, 2025 and December 31, 2024, with no repayments due until March 2026, when $251.9 million of unsecured senior notes are scheduled to mature.\nOther notes payable\nOther notes payable include non-recourse and limited recourse secured notes with third parties that totaled $39.7 million and $35.8 million at September 30, 2025 and December 31, 2024, respectively. These notes have maturities ranging up to five years, are secured by the applicable land positions to which they relate, and generally have no recourse to other assets. The stated interest rates on these notes range up to 9%.\nRevolving credit facility\n    \nWe maintain a revolving credit facility (the \"Revolving Credit Facility\") maturing in June 2027 that has a maximum borrowing capacity of $1.3 billion and contains an uncommitted accordion feature that could increase the capacity to $1.8 billion, subject to certain conditions and availability of additional bank commitments. The Revolving Credit Facility also provides for the issuance of letters of credit that reduce the available borrowing capacity under the Revolving Credit Facility, up to the maximum borrowing capacity. The interest rate on borrowings under the Revolving Credit Facility may be based on either the Secured Overnight Financing Rate or a base rate plus an applicable margin, as defined therein. The Revolving Credit Facility contains financial covenants that require us to maintain a minimum Tangible Net Worth and a maximum Debt-to-Capitalization \n35\nRatio (as each term is defined in the Revolving Credit Facility). We were in compliance with all covenants and requirements as of September 30, 2025. Outstanding balances under the Revolving Credit Facility are guaranteed by certain of our wholly-owned subsidiaries.\nAt September 30, 2025, we had no borrowings outstanding, $348.0 million of letters of credit issued, and $902.0 million of remaining capacity under the Revolving Credit Facility. At December 31, 2024, we had no borrowings outstanding, $321.1 million of letters of credit issued, and $928.9 million of remaining capacity under the Revolving Credit Facility.\nJoint venture debt\nAt September 30, 2025, aggregate outstanding debt of unconsolidated joint ventures was $37.2 million.\nFinancial Services debt\nPulte Mortgage maintains a master repurchase agreement with third-party lenders (as amended, the \"Repurchase Agreement\") that matures on August 12, 2026. The maximum aggregate commitment under the Repurchase Agreement was $625.0 million at September 30, 2025, which continues until maturity. The Repurchase Agreement also contains an accordion feature that could increase the commitment by $50.0 million above its active commitment level. Borrowings under the Repurchase Agreement are secured by residential mortgage loans available-for-sale. The Repurchase Agreement contains various affirmative and negative covenants applicable to Pulte Mortgage, including quantitative thresholds related to net worth, net income, and liquidity. At September 30, 2025, Pulte Mortgage had $404.2 million outstanding at a weighted-average interest rate of 5.93% and $220.8 million of remaining capacity under the Repurchase Agreement. At December 31, 2024, Pulte Mortgage had $526.9 million outstanding at a weighted-average interest rate of 6.13% and $148.1 million of remaining capacity under the Repurchase Agreement. Pulte Mortgage was in compliance with all covenants and requirements as of such dates.\nDividends and share repurchase program\nIn the nine months ended September 30, 2025, we declared cash dividends totaling $132.2 million and repurchased 8.2 million shares under our share repurchase authorization for $900.0 million. In the nine months ended September 30, 2024, we declared cash dividends totaling $126.2 million and repurchased 7.6 million shares under our share repurchase authorization for $880.0 million. On January 29, 2025, the Board of Directors increased our share repurchase authorization by $1.5 billion, which was publicly announced on January 30, 2025. At September 30, 2025, we had remaining authorization to repurchase $1.3 billion of common shares. \nContractual Obligations\nWe are a party to many contractual obligations involving commitments to make payments to third parties. These obligations impact our short-term and long-term liquidity and capital resource needs. Certain contractual obligations are reflected on the Consolidated Balance Sheet as of September 30, 2025, while others are considered future commitments. Our contractual obligations primarily consist of long-term debt and related interest payments, purchase obligations related to expected acquisitions and development of land, house construction costs, operating leases, and obligations under our various compensation and benefit plans.\nWe use letters of credit and surety bonds to guarantee our performance under various contracts, principally in connection with the development of our homebuilding projects and insurance programs. The expiration dates of the letter of credit contracts coincide with the expected completion date of the related homebuilding projects and insurance programs. If the obligations related to a project or program are ongoing, annual extensions of the letters of credit are typically granted on a year-to-year basis. At September 30, 2025, we had outstanding letters of credit totaling $348.0 million. Our surety bonds generally do not have stated expiration dates; rather, we are released from the bonds as the contractual performance is completed. These bonds, which approximated $3.1 billion at September 30, 2025, are typically outstanding over a period of approximately three to five years. Because significant construction and development work has been performed related to projects that have not yet received final acceptance by the respective counterparties, the aggregate amount of surety bonds outstanding is in excess of the projected cost of the remaining work to be performed.\nIn the ordinary course of business, we enter into land option agreements in order to procure land for the construction of houses in the future. At September 30, 2025, these agreements had an aggregate remaining purchase price of $9.9 billion. Pursuant to these land option agreements, we generally provide a deposit to the seller as consideration for the right to purchase land at \n36\ndifferent times in the future, usually at predetermined prices. At September 30, 2025, outstanding deposits totaled $681.5 million, of which $18.0 million is refundable.\nFor further information regarding our primary obligations, refer to \nNote 4\n and \nNote 8\n to the Consolidated Financial Statements included elsewhere in this Quarterly Report on 10-Q for amounts outstanding as of September 30, 2025 related to debt and commitments and contingencies, respectively.\nCash flows\nOperating activities\nNet cash provided by operating activities in the nine months ended September 30, 2025 was $1.1 billion. Generally, the primary drivers of our cash flow from operations are profitability and changes in the levels of inventory and residential mortgage loans available-for-sale, each of which experiences seasonal fluctuations. The cash inflows from our operations for the nine months ended September 30, 2025 were primarily due to net income of $1.7 billion, partially offset by a net increase in inventories of $635.9 million, which was primarily attributable to land acquisition, development, and house spend to support ongoing operations.\nNet cash provided by operating activities in the nine months ended September 30, 2024 was $1.1 billion. The cash inflows from our operations for the nine months ended September 30, 2024 were primarily due to net income of $2.2 billion, partially offset by a net increase in inventories of $805.3 million, which was primarily attributable to land acquisition, development, and house spend to support expected future growth, and a $45.2 million increase in residential mortgage loans available-for-sale due to higher loan origination volumes. \nInvesting activities\nNet cash used in investing activities in the nine months ended September 30, 2025 was $64.1 million. These cash outflows primarily resulted from capital expenditures of $91.4 million related to our ongoing investments in new communities, facilities, and information technology applications, partially offset by distributions of capital from unconsolidated entities of $45.7 million.\nNet cash used in investing activities in the nine months ended September 30, 2024 was $108.4 million. These cash outflows primarily resulted from capital expenditures of $94.1 million related to our ongoing investments in new communities, facilities, and information technology applications along with $15.1 million of investments in unconsolidated entities.\nFinancing activities\nNet cash used in financing activities in the nine months ended September 30, 2025 totaled $1.2 billion. These cash outflows resulted primarily from the repurchase of 8.2 million common shares for $900.0 million under our share repurchase authorization, payments of $133.7 million in cash dividends, payments of $33.0 million related to consolidated inventory not owned, and net repayments of $122.7 million under the Repurchase Agreement.\nNet cash used in financing activities in the nine months ended September 30, 2024 totaled $1.4 billion. These cash outflows resulted primarily from the repurchase of 7.6 million common shares for $880.0 million under our share repurchase authorization, payments of $126.6 million in cash dividends, payments of $94.1 million related to consolidated inventory not owned, and $350.5 million of repayments of notes payable, partially offset by net borrowings of $24.5 million under the Repurchase Agreement.\nSeasonality\nAlthough significant changes in market conditions have impacted our seasonal patterns in the past and could do so again, we historically experience variability in our quarterly results from operations due to the seasonal nature of the homebuilding industry. We generally experience increases in revenues and cash flow from operations in the fourth quarter based on the timing of home closings. This seasonal activity increases our working capital requirements in our third and fourth quarters to support our home production and loan origination volumes. As a result of the seasonality of our operations, our quarterly results of operations are not necessarily indicative of the results that may be expected for the full year. \n37\nSupplemental Guarantor Financial Information\nAs of September 30, 2025, PulteGroup, Inc. had outstanding $1.6 billion principal amount of unsecured senior notes due at dates from March 2026 through February 2035 and no borrowings outstanding, $348.0 million of letters of credit issued, and $902.0 million of remaining capacity under its Revolving Credit Facility.\nAll of our unsecured senior notes and the Revolving Credit Facility are fully and unconditionally guaranteed, on a joint and several basis, by certain subsidiaries of PulteGroup, Inc. (\"Guarantors\" or \"Guarantor Subsidiaries\"). Each of the Guarantor Subsidiaries is 100% owned, directly or indirectly, by PulteGroup, Inc. Our subsidiaries associated with our Financial Services operations and certain other subsidiaries do not guarantee the unsecured senior notes or the Revolving Credit Facility (collectively, \"Non-Guarantor Subsidiaries\"). The guarantees are senior unsecured obligations of each Guarantor and rank equal with all existing and future senior debt of such Guarantor and senior to all subordinated debt of such Guarantor. The guarantees are effectively subordinated to any secured debt of such Guarantor to the extent of the value of the assets securing such debt.\nA court could void or subordinate any Guarantor’s guarantee under the fraudulent conveyance laws if existing or future creditors of any such Guarantor were successful in establishing that such Guarantor:\n(a) incurred the guarantee with the intent of hindering, delaying or defrauding creditors; or\n(b) received less than reasonably equivalent value or fair consideration in return for incurring the guarantee and, in the case of any one of the following being true at the time thereof:\n•\nsuch Guarantor was insolvent or rendered insolvent by reason of the issuance of the incurrence of the guarantee;\n•\nthe incurrence of the guarantee left such Guarantor with an unreasonably small amount of capital or assets to carry on its business;\n•\nsuch Guarantor intended to, or believed that it would, incur debts beyond its ability to pay as they mature; or\n•\nsuch Guarantor was a defendant in an action for money damages, or had a judgment for money damages docketed against it, if the judgment is unsatisfied after final judgment.\nThe measures of insolvency for purposes of determining whether a fraudulent conveyance occurred would vary depending upon the laws of the relevant jurisdiction and upon the valuation assumptions and methodology applied by the court. However, in general, a court would deem a company insolvent if:\n•\nthe sum of its debts, including contingent and unliquidated liabilities, was greater than the fair saleable value of all of its assets;\n•\nthe present fair saleable value of its assets was less than the amount that would be required to pay its probable liability on its existing debts, including contingent liabilities, as they become absolute and mature; or\n•\nit could not pay its debts as they became due.\nThe guarantees of the senior notes contain a provision to limit each Guarantor’s liability to the maximum amount that it could incur without causing the incurrence of obligations under its guarantee to be a fraudulent transfer. However, under certain case law, this provision may not be effective to protect such guarantee from being voided under fraudulent transfer law or otherwise determined to be unenforceable. If a court were to find that the incurrence of a guarantee was a fraudulent transfer or conveyance, the court could void the payment obligations under that guarantee, could subordinate that guarantee to presently existing and future indebtedness of the Guarantor or could require the holders of the senior notes to repay any amounts received with respect to that guarantee. In the event of a finding that a fraudulent transfer or conveyance occurred, holders may not receive any repayment on the senior notes.\nFinally, as a court of equity, a bankruptcy court may subordinate the claims in respect of the guarantees to other claims against us under the principle of equitable subordination if the court determines that (1) the holder of senior notes engaged in some type of inequitable conduct, (2) the inequitable conduct resulted in injury to our other creditors or conferred an unfair advantage upon the holders of senior notes and (3) equitable subordination is not inconsistent with the provisions of the bankruptcy code.\nOn the basis of historical financial information, operating history and other factors, we believe that each of the Guarantors, after giving effect to the issuance of the guarantees when such guarantees were issued, was not insolvent, did not have unreasonably small capital for the business in which it engaged and did not and has not incurred debts beyond its ability to pay such debts as they mature. We cannot, however, provide assurances as to what standard a court would apply in making these determinations or whether a court would agree with our conclusions in this regard.\n38\nThe following tables present summarized financial information for PulteGroup, Inc. and the Guarantor Subsidiaries on a combined basis after intercompany transactions and balances have been eliminated among PulteGroup, Inc. and the Guarantor Subsidiaries, as well as their investment in and equity in earnings from the Non-Guarantor Subsidiaries ($000’s omitted):\nPulteGroup, Inc. and Guarantor Subsidiaries\nSummarized Balance Sheet Data\nASSETS\nSeptember 30, 2025\nDecember 31, 2024\nCash, cash equivalents, and restricted cash\n$1,294,776\n$1,218,207\nHouse and land inventory\n13,041,070 \n12,354,274 \nAmount due from Non-Guarantor Subsidiaries\n870,689 \n1,024,762 \nTotal assets\n16,455,978 \n15,589,227 \nLIABILITIES\nAccounts payable, customer deposits,\n  accrued and other liabilities\n$2,606,008\n$2,735,190\nNotes payable\n1,623,338 \n1,618,586 \nTotal liabilities\n4,721,240 \n4,801,056 \nNine Months Ended\nSeptember 30,\nSummarized Statement of Operations Data\n2025\n2024\nRevenues\n$12,149,936\n$12,515,055\nCost of revenues\n8,878,650 \n8,832,123 \nSelling, general, and administrative expenses\n1,131,118 \n1,097,533 \nIncome before income taxes\n2,086,259 \n2,612,554 \nCritical Accounting Estimates\nThere have been no significant changes to our critical accounting estimates in the nine months ended September 30, 2025 compared with those contained in Item 7, \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n included in our Annual Report on Form 10-K for the year ended December 31, 2024."
}