{
  "source_file": "pld-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. Management’s Discussion and \nAnalysis of Financial \nCondition and Results of Operations\n \nThe following should be read in conjunction with the Consolidated Financial Statements and related Notes included in Item 1 of this report and our Annual Report on Form 10-K for the year ended December 31, 2024, as filed with the United States (“U.S.”) Securities and Exchange Commission (“SEC”).\n \nThe statements in this report that are not historical facts are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on current expectations, estimates and projections about the industry and markets in which we operate as well as management’s beliefs and assumptions. Such statements involve uncertainties that could significantly impact our financial results. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “aims,” and “estimates,” including variations of such words and similar expressions, are intended to identify such forward-looking statements, which generally are not historical in nature. All statements that address operating performance, events or developments that we expect or anticipate will occur in the future — including statements relating to rent and occupancy growth, acquisition and development activity, contribution and disposition activity, general conditions in the geographic areas where we operate, expectations regarding new lines of business, our debt, capital structure and financial position, our ability to earn revenues from co-investment ventures or form new co-investment ventures and the availability of capital in existing or new co-investment ventures — are forward-looking statements. These statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions that are difficult to predict. Although we believe the expectations reflected in any forward-looking statements are based on reasonable assumptions, we can give no assurance that our expectations will be attained, and therefore actual outcomes and results may differ materially from what is expressed or forecasted in such forward-looking statements. Some of the factors that may affect outcomes and results include, but are not limited to: (i) international, national, regional and local economic and political climates and conditions; (ii) changes in global financial markets, interest rates and foreign currency exchange rates; (iii) increased or unanticipated competition for our properties; (iv) risks associated with acquisitions, dispositions and development of properties, including the integration of the operations of significant real estate portfolios; (v) maintenance of Real Estate Investment Trust (“REIT”) status, tax structuring and changes in income tax laws and rates; (vi) availability of financing and capital, the levels of debt that we maintain and our credit ratings; (vii) risks related to our investments in and management of our co-investment ventures, including our ability to establish new co-investment ventures; (viii) risks of doing business internationally, including currency risks; (ix) environmental uncertainties, including risks of natural disasters; (x) risks related to global pandemics; and (xi) those additional factors discussed under Part I, Item 1A. Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2024. We undertake no duty to update any forward-looking statements appearing in this report except as may be required by law.\n \nPrologis, Inc. is a self-administered and self-managed REIT and is the sole general partner of Prologis, L.P. through which it holds substantially all of its assets. We operate Prologis, Inc. and Prologis, L.P. as one enterprise and, therefore, our discussion and analysis refers to Prologis, Inc. and its consolidated subsidiaries, including Prologis, L.P. We invest in real estate through wholly owned subsidiaries and other entities through which we co-invest with partners and investors (\"co-investment ventures\"). We have a significant ownership interest in the co-investment ventures, which are either consolidated or unconsolidated based on our level of control of the entity.\n \nWe operate, manage and measure the operating performance of our properties on an owned and managed (“O&M”) basis. Our O&M portfolio includes our consolidated properties as well as properties owned by our unconsolidated co-investment ventures, which we manage. We make operating decisions based on our total O&M portfolio as we manage the properties without regard to their ownership. We also evaluate our results based on our proportionate economic ownership of each property included in the O&M portfolio (“our share”).\n \n \nIncluded in our discussion below are references to funds from operations (“FFO”) and net operating income (“NOI”), neither of which are U.S. generally accepted accounting principles (“GAAP”). See below for a reconciliation of \nNet Earnings Attributable to Common Stockholders/Unitholders\n in the Consolidated Statements of Income to our FFO measures and a reconciliation of NOI to \nOperating Income \nin the Consolidated Statements of Income\n, \nthe most directly comparable GAAP measures.\n \nMANAGEMENT'S OVERVIEW\n \nPrologis is the global leader in logistics real estate, operating in high-barrier, high-growth markets across 20 countries on four continents. Our portfolio is concentrated in key commercial hubs strategically located near end consumers to enable the efficient flow of goods. Beyond owning, managing and developing high-quality logistics facilities, we deliver integrated infrastructure solutions that enhance efficiency, flexibility and resilience. Our services address the evolving needs of modern supply chains, including the growing convergence of physical and digital infrastructure and the increasing demand for sustainable operations.\n \nLogistics supply chains remain vital to both our customers and the global economy. Long-term trends, including the growth of e-commerce and modernization of supply chains, continue to drive demand for additional space to enhance resiliency and distribution capabilities. This demand has led to strong rent growth and historically low vacancy rates in recent years. We believe this demand is driven by three primary factors: (i) our customers repositioning their supply chains to meet rising e-commerce and service expectations; (ii) growth in consumption; and (iii) a growing focus on supply chain efficiency. We believe these factors will sustain demand and low vacancy rates over the long term. In the near term, despite economic uncertainty stemming from trade tensions and shifting policies,\n \n\n\n31\n \n\n\n\n\nIndex\n \n\n\nour proprietary metrics, customer dialogue and strong third-quarter 2025 leasing activity demonstrate that many customers are continuing to move forward with decisions. We remain well positioned to support them as they navigate ongoing supply chain shifts and uncertainty.\n \nOur teams actively manage our portfolio by delivering comprehensive real estate services, including leasing, property management, development, acquisitions and dispositions. We invest significant capital into new logistics properties through acquisitions and development activity, including both built-to-suit and speculative development, as well as redevelopment of properties into industrial properties and data centers. Proceeds from property dispositions, typically through contributions of newly developed properties to our co-investment ventures or sales of non-strategic assets to third parties, allow us to recycle capital back into our ongoing investment activities.\n \n \nWhile the majority of our properties in the U.S. are wholly owned, we also hold significant ownership interest in properties both in the U.S. and internationally through our investment in co-investment ventures. Partnering with many of the world’s largest institutional investors through co-investment ventures allows us to expand our investment capacity, enhance and diversify our real estate returns and mitigate our exposure to foreign currency movements.\n \nOur scale and customer-focused strategy have driven us to expand the services we offer. Our 1.3 billion square foot portfolio serves as the foundation for a comprehensive platform of solutions that address the challenges our customers face in global fulfillment today. Through Prologis Essentials, we deliver solutions to support our customers’ operational, energy and sustainability needs. Our customer experience teams, proprietary technology and strategic partnerships are central to every aspect of the Prologis Essentials platform. These resources allow us to provide customers with unique and actionable insights and tools to help them advance sustainability goals and improve operational efficiency. In addition, the principles of environmental, social and governance are embedded in our business strategy through an integrated approach to global impact and sustainability, which we believe creates value for our customers, investors, employees and communities.\n \nOur Global Presence\n \nAt September 30, 2025, we owned or had investments in, on a wholly owned basis or through co-investment ventures, properties and development projects expected to total approximately 1.3 billion square feet across the following geographies:\n \n \nThroughout this discussion, amounts are presented in U.S. dollars, our reporting currency. Included in these amounts are consolidated and unconsolidated investments denominated in foreign currencies, principally the British pound sterling, Canadian dollar, euro and Japanese yen that are impacted by fluctuations in exchange rates when translated to U.S. dollars. We mitigate our exposure to foreign currency fluctuations by investing outside the U.S. through co-investment ventures, borrowing in the functional currency of our subsidiaries and utilizing derivative financial instruments.\n \n\n\n32\n \n\n\n\n\nIndex\n \n\n\nOur business comprises two reportable segments: Real Estate (Rental Operations and Development) and Strategic Capital.\n \n \nBelow is information summarizing consolidated activity within our segments (in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(1)\nNOI from the Real Estate Segment is calculated directly from the Consolidated Financial Statements as \nRental Revenues\n and \nDevelopment Management and Other Revenues \nless \nRental Expenses\n and \nOther Expenses. \nNOI from the Strategic Capital Segment is calculated directly from the Consolidated Financial Statements as \nStrategic Capital\n \nRevenues\n less \nStrategic Capital\n \nExpenses.\n‌\n \n(2)\nA developed property moves into the operating portfolio when it meets our definition of stabilization, which is the earlier of when a property that was developed has been completed for one year, is contributed to a co-investment venture following completion or is 90% occupied. Amounts represent our total expected investment (\"TEI\") upon stabilization, which includes the estimated cost of development or expansion, including land, construction and leasing costs.\n \nReal Estate Segment\n \nRental Operations.\n \nRental operations comprise the largest component of our reportable segments and generally contributes 90% to 95% of our consolidated revenues, earnings and FFO. We collect rent from our customers through operating leases, including reimbursements for the majority of our property operating costs. Through our global footprint, we have a diversified lease portfolio and our revenues from in-place leases are contractual with fixed or inflation-linked escalations. For the trailing twelve months ended September 30, 2025, the weighted average lease term for leases commenced in our consolidated operating portfolio was 68 months. We expect to generate earnings growth by increasing rents, maintaining high occupancy rates and controlling expenses. The primary driver of our revenue growth will be the rolling of in-place leases to current market rents upon lease expiration. We believe our active portfolio management, combined with the skills of our property management, maintenance, energy, sustainability and risk management teams allow us to maximize NOI across our portfolio. Substantially all of our consolidated rental revenue, NOI and cash flows from rental operations are generated in the U.S.\n \nDevelopment.\n Our development business provides the opportunity to profitably build modern logistics facilities that address the evolving requirements of our customers while deepening our presence in our target markets. We believe we have a competitive advantage due to: (i) the strategic locations of our global land sites; (ii) the development expertise of our local teams; (iii) the depth of our customer relationships; (iv) our ability to integrate sustainable design features that improve operational efficiency for our customers; and (v) our procurement capabilities that enable us to secure high-demand construction materials at a lower cost. Successful development projects contribute significantly to earnings growth as they are leased, begin generating income and increase the value of our Real Estate Segment. In general, we develop properties in the U.S. to hold for the long term or to contribute to our unconsolidated co-investment ventures, and outside the U.S. primarily to contribute to these ventures.\n \nStrategic Capital Segment\n \nWe partner with many of the world’s largest institutional investors through co-investment ventures. The business is capitalized through private and public equity, and is comprised of 95% open-ended ventures, long-term ventures and two publicly traded vehicles (Nippon Prologis REIT, Inc. in Japan and FIBRA Prologis, which controls and owns 90% of Terrafina, also a publicly traded FIBRA in Mexico). We align our interests with our partners by holding significant ownership interests in the co-investment ventures. Nine of the co-investment ventures are unconsolidated entities, and one is consolidated, with our ownership in the co-investment ventures ranging from 15% to 55%. This structure allows us to reduce our exposure to foreign currency fluctuations for non-U.S. investments. Management of the unconsolidated co-investment ventures comprises our Strategic Capital Segment.\n \n \nThis segment generates durable, long-term cash flows and generally contributes 5% to 10% of our consolidated revenues, earnings and FFO, excluding promotes. We generate strategic capital revenue from our unconsolidated co-investment ventures, principally through asset management and property management services. Revenue earned from asset management fees is primarily driven by the quarterly valuation of the real estate properties owned by the respective ventures. We earn additional revenues by providing leasing, acquisition, construction management, development and disposition services. The majority of the strategic capital revenues are generated outside the U.S. In certain ventures, we also have the ability to earn revenues through incentive fees (“promotes” or “promote revenues”) periodically during the life of a venture, upon liquidation of a venture or upon stabilization of individual venture\n \n\n\n33\n \n\n\n\n\nIndex\n \n\n\nassets, based primarily on the total return of the investments over certain financial hurdles. Promote revenue is recognized when earned, either at the end of the promote period or upon liquidation or stabilization. We plan to grow this business and increase revenues by increasing our assets under management in existing and new ventures.\n \nFUTURE GROWTH\n \nWe believe that the quality and scale of our portfolio, our ability to add value creation through development, our strategic capital business, the depth of our customer relationships and the strength of our balance sheet are differentiators that allow us to drive growth in revenues, NOI, earnings, FFO and cash flows.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(1)\nNet effective rent (\"NER\") is calculated at the beginning of the lease using estimated total cash base rent to be received over the term and annualized, and excludes fair value lease amortization from acquisitions. Amounts derived in a currency other than the U.S. dollar have been translated using the average rate from the previous twelve months. Trailing NER change is based on the twelve months immediately prior to the period ended.\n \nRent change represents the percentage change in net effective rental rates (average rate over the lease term), on new and renewed leases, commenced during the period compared with previous net effective rental rates for the same respective spaces.\n \n•\nRent Growth\n. \nWe have experienced positive rent growth every quarter since 2013.\n \nAs a result of several years of market rent increases, our in-place leases have considerable upside potential to capture higher rents and drive future organic NOI growth. We estimate that our share of the lease mark-to-market is approximately 19% (on an NER basis), which represents the amount by which current market rents exceed our in-place rents based on our share of the O&M portfolio at September 30, 2025. This lease mark-to-market has remained meaningfully positive despite recent quarters of lower or even negative market rental growth, due to accumulated rent growth in preceding years. As a result, even without further market rent increases, we expect lease renewals to drive higher rental income over the coming years, based on our remaining lease terms.\n \n•\nValue Creation from Development.\n Our global development program serves as a profitable way to expand our portfolio, build scale, serve customers and create value for investors. We create these opportunities by sourcing land for ownership and pursuing option strategies and redevelopment projects, often referred to as Covered Land Plays (\"CLPs\"). We primarily develop in our existing markets, focusing on logistics facilities while also pursuing higher-and-better-use conversions, such as data centers. A key enabler of these conversions is our energy procurement strategy. By leveraging our scale and relationships with utilities and energy providers, we are advancing on our strategy to secure reliable access to power that enhances the value of our land portfolio and enables us to convert select logistics sites into energy-ready data center developments and capture meaningful value creation consistent with our broader redevelopment strategy.\n \nBased on our current estimates, our consolidated land and other real estate investments, including options and CLPs, have the potential to support the development of $37.0 billion ($42.3 billion on an O&M basis) of TEI of newly developed buildings. We measure the estimated value creation of a development project as the stabilized value above our TEI. As properties are completed and leased, we expect to capture the value creation principally through gains realized upon contributing these properties to unconsolidated co-investment ventures and through increases in the NOI of the consolidated portfolio.\n \n•\nStrategic Capital Advantages. \nOur co-investment ventures provide third-party capital that enables us to grow our O&M portfolio, help self-fund our development activity through the sale or contribution of newly developed assets to these vehicles and generate substantial management fees. We raise capital to support the long-term growth of these ventures while maintaining significant investments of our own. At September 30, 2025, the gross book value of the operating portfolio held by our nine unconsolidated co-investment ventures was $61.1 billion across an aggregate of 554 million square feet. \n \n•\nBalance Sheet Strength.\n We have a long standing strategy to build and maintain a strong, flexible balance sheet by using conservative levels of financial leverage. At September 30, 2025, the weighted average remaining maturity of our consolidated debt was 9 years and the weighted average interest rate was 3.2%. At September 30, 2025, we had total available liquidity of $7.5 billion. We continue to maintain low leverage as a percentage of our real estate investments and our market capitalization. As a result of our low leverage, available liquidity and investment capacity in the co-investment ventures, we have significant ability to capitalize on opportunistic value-added investments as they arise.\n\n\n34\n \n\n\n\n\nIndex\n \n\n\n \n•\nOur Scale Drives Efficiency.\n We have scalable systems and infrastructure in place to grow both our consolidated and O&M portfolios with limited incremental general and administrative (\"G&A\") expenses. We believe we can continue to grow NOI and strategic capital revenues organically and through accretive development and acquisition activity while further reducing G&A as a percentage of our investments in real estate.\n \n•\nStaying “Ahead of What’s Next™”.\n We are focused on creating value beyond real estate by enhancing our customers’ experience, leveraging our scale in procurement and driving innovation through data analytics and digitization. This includes investments in early and growth-stage companies that are focused on emerging technologies for the logistics sector through Prologis Ventures, our corporate venture capital group. Our Prologis Essentials platform provides customers with services and products that support their operational, energy and sustainability needs, simplify decision making and help advance their environmental goals.\n \nSUMMARY OF THE NINE MONTHS ENDED SEPTEMBER 30, 2025\n \nOur operating results and leasing activity remained resilient during the nine months ended September 30, 2025, despite economic disruption from tariff policy proposals. Due to increases in market rents over the past several years, our existing lease mark-to-market continued to drive rent change on rollover and same-store growth in our O&M portfolio. This lease mark-to-market has remained meaningfully positive despite recent quarters of lower or even negative market rental growth, due to accumulated rent growth in preceding years. The occupancy of our operating portfolio was 95.2% at September 30, 2025 and rent change on leases that commenced during the nine months ended September 30, 2025 was 52.0% on a net effective basis, both metrics based on our ownership share.\n \nWhile tariff policy introduced economic uncertainty in April, leasing activity in our consolidated portfolio remained healthy, with 31 million square feet (62 million square feet on an O&M basis) of new leases signed in the third quarter, demonstrating that many customers are continuing to move forward with decisions. This demand was also reflected in new development activity, with consolidated development starts totaling $2.0 billion during the nine months ended September 30, 2025, of which 68.3% were build-to-suit projects. While we believe we are well-positioned to grow revenue over the long-term given the upside opportunity in our in-place leases, the potential impact of ongoing economic uncertainty on our business, future financial condition and operating results remains difficult to predict.\n \nWe completed the following significant activities in 2025, as described in the Notes to the Consolidated Financial Statements:\n \n•\nWe generated net proceeds of $362 million and realized net gains on real estate transactions of $169 million, principally from the contribution of a property we developed to an unconsolidated co-investment venture in Europe and sales to third parties in the U.S.\n \n•\nIn May 2025, we amended and restated one of our global credit facilities while maintaining its existing borrowing capacity of $3.0 billion and extending the maturity date to June 2029, with an option to extend to June 2030. At September 30, 2025, we had total available liquidity of $7.5 billion, including available capacity on our credit facilities of $6.3 billion and unrestricted cash balances of $1.2 billion.\n \n•\nIn June 2025, we established an additional commercial paper program, under which we may issue, repay and re-issue short-term unsecured commercial paper notes (“CPNs”) denominated in British pound sterling, euros or U.S. dollars in an aggregate amount of up to €1.0 billion (or its equivalent in other currencies). At any point in time, we are required to maintain available commitments under our credit facilities in an amount at least equal to the amount of the CPNs outstanding.\n \n•\nWe issued $2.9 billion of senior notes with an issuance date weighted average interest rate of 4.3% and weighted average maturity of 9 years (principal in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nAggregate Principal\n\n\n \n\n\n \n\n\nIssuance Date Weighted Average\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nIssuance Date\n\n\n \n\n\nBorrowing Currency\n\n\n \n\n\n \n\n\nUSD \n(1)\n\n\n \n\n\n \n\n\nInterest Rate\n\n\n \n\n\nYears\n\n\n \n\n\nMaturity Dates\n\n\n\n\n\n\n \n\n\nFebruary\n\n\n \n\n\nC$\n\n\n \n\n\n750\n\n\n \n\n\n \n\n\n$\n\n\n520\n\n\n \n\n\n \n\n\n4.2%\n\n\n \n\n\n \n\n\n8.0\n\n\n \n\n\n \n\n\n \n\n\nFebruary 2033\n\n\n\n\n\n\n \n\n\nMay\n\n\n \n\n\n$\n\n\n \n\n\n1,250\n\n\n \n\n\n \n\n\n$\n\n\n1,250\n\n\n \n\n\n \n\n\n5.1%\n\n\n \n\n\n \n\n\n8.3\n\n\n \n\n\n \n\n\n \n\n\nJanuary 2031 – May 2035\n\n\n\n\n\n\n \n\n\nSeptember\n\n\n \n\n\n€\n\n\n \n\n\n1,000\n\n\n \n\n\n \n\n\n$\n\n\n1,179\n\n\n \n\n\n \n\n\n3.6%\n\n\n \n\n\n \n\n\n9.5\n\n\n \n\n\n \n\n\n \n\n\nSeptember 2032 – 2037\n\n\n\n\n\n\n \n\n\nTotal\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n2,949\n\n\n \n\n\n \n\n\n4.3%\n\n\n \n\n\n \n\n\n8.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(1)    The exchange rate used to calculate into U.S. dollars was the spot rate at the settlement date of each issuance.\n\n\n\n\n \nRESULTS OF OPERATIONS – NINE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024\n \nWe evaluate our business operations based on the NOI of our two reportable segments: Real Estate (Rental Operations and Development) and Strategic Capital. NOI by segment is a non-GAAP performance measure that is calculated using revenues and\n \n\n\n35\n \n\n\n\n\nIndex\n \n\n\nexpenses directly from our financial statements. We consider NOI by segment to be an appropriate supplemental measure of our performance because it helps management and investors understand our operating results.\n \n \nBelow is our NOI by segment per the Consolidated Financial Statements and a reconciliation of NOI by segment to \nOperating Income\n per the Consolidated Financial Statements for the nine months ended September 30 (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nReal estate segment:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n     Rental revenues\n\n\n \n\n\n$\n\n\n6,067\n\n\n \n\n\n \n\n\n$\n\n\n5,577\n\n\n \n\n\n\n\n\n\n     Development management and other revenues\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\n     Rental expenses\n\n\n \n\n\n \n\n\n(1,461\n\n\n)\n\n\n \n\n\n \n\n\n(1,327\n\n\n)\n\n\n\n\n\n\n     Other expenses\n\n\n \n\n\n \n\n\n(30\n\n\n)\n\n\n \n\n\n \n\n\n(39\n\n\n)\n\n\n\n\n\n\n          Real Estate Segment – NOI\n\n\n \n\n\n \n\n\n4,608\n\n\n \n\n\n \n\n\n \n\n\n4,216\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStrategic capital segment:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n     Strategic capital revenues\n\n\n \n\n\n \n\n\n439\n\n\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n\n\n\n\n     Strategic capital expenses\n\n\n \n\n\n \n\n\n(195\n\n\n)\n\n\n \n\n\n \n\n\n(211\n\n\n)\n\n\n\n\n\n\n          Strategic Capital Segment – NOI\n\n\n \n\n\n \n\n\n244\n\n\n \n\n\n \n\n\n \n\n\n208\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGeneral and administrative expenses\n\n\n \n\n\n \n\n\n(333\n\n\n)\n\n\n \n\n\n \n\n\n(316\n\n\n)\n\n\n\n\n\n\nDepreciation and amortization expenses\n\n\n \n\n\n \n\n\n(1,957\n\n\n)\n\n\n \n\n\n \n\n\n(1,924\n\n\n)\n\n\n\n\n\n\nOperating income before gains on real estate transactions, net\n\n\n \n\n\n \n\n\n2,562\n\n\n \n\n\n \n\n\n \n\n\n2,184\n\n\n \n\n\n\n\n\n\nGains on dispositions of development properties and land, net\n\n\n \n\n\n \n\n\n53\n\n\n \n\n\n \n\n\n \n\n\n160\n\n\n \n\n\n\n\n\n\nGains on other dispositions of investments in real estate, net\n\n\n \n\n\n \n\n\n116\n\n\n \n\n\n \n\n\n \n\n\n651\n\n\n \n\n\n\n\n\n\nOperating income\n\n\n \n\n\n$\n\n\n2,731\n\n\n \n\n\n \n\n\n$\n\n\n2,995\n\n\n \n\n\n\n\n \nSee Note 10 to the Consolidated Financial Statements for more information on our segments and a reconciliation of each reportable segment’s NOI to \nOperating Income\n and\n Earnings Before Income Taxes.\n \nReal Estate Segment\n \nThis reportable segment principally includes rental revenue and rental expenses recognized from our consolidated properties. This segment also includes the operating results of our renewable energy assets. We allocate the costs of our property management and leasing functions to the Real Estate Segment through \nRental Expenses \nand the Strategic Capital Segment through \nStrategic Capital Expenses, \nboth in the Consolidated Financial Statements\n, \nbased on the square footage of the relative portfolios. In addition, this segment is impacted by our development, acquisition and disposition activities.\n \nBelow are the components of Real Estate Segment NOI for the nine months ended September 30, derived directly from line items in the Consolidated Financial Statements (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRental revenues\n\n\n \n\n\n$\n\n\n6,067\n\n\n \n\n\n \n\n\n$\n\n\n5,577\n\n\n \n\n\n\n\n\n\nDevelopment management and other revenues\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n\n\n\n\nRental expenses\n\n\n \n\n\n \n\n\n(1,461\n\n\n)\n\n\n \n\n\n \n\n\n(1,327\n\n\n)\n\n\n\n\n\n\nOther expenses\n\n\n \n\n\n \n\n\n(30\n\n\n)\n\n\n \n\n\n \n\n\n(39\n\n\n)\n\n\n\n\n\n\nReal Estate Segment – NOI\n\n\n \n\n\n$\n\n\n4,608\n\n\n \n\n\n \n\n\n$\n\n\n4,216\n\n\n \n\n\n\n\n \n\n\n36\n \n\n\n\n\nIndex\n \n\n\n \nThe $392 million change in Real Estate Segment (“RES”) NOI for the nine months ended September 30 compared to the same period in 2024, was impacted by the following activities (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n\n\n\n\n \n(1)\nSignificant rent change due to higher rental rates on the rollover of leases during both periods continues to be a key driver of increasing rental income. See below for key metrics on rent change on rollover and occupancy.\n \n(2)\nWe calculate changes in NOI from development completions period over period by comparing the change in NOI generated on the pool of developments that completed on or after January 1, 2024 through September 30, 2025.\n \nBelow are key operating metrics of our consolidated operating portfolio.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(1)\nConsolidated square feet of leases commenced and weighted average net effective rent change were calculated for leases with initial terms of one year or greater.\n \n(2)\nCalculated using the trailing twelve months immediately prior to the period ended. \n \n\n\n37\n \n\n\n\n\nIndex\n \n\n\nDevelopment Activity\n \nThe following table summarizes consolidated development activity for the nine months ended September 30 (dollars and square feet in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nStarts:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNumber of new development buildings started during the period\n\n\n \n\n\n \n\n\n26\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n \n\n\n\n\n\n\nSquare feet\n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nTEI\n\n\n \n\n\n$\n\n\n1,966\n\n\n \n\n\n \n\n\n$\n\n\n885\n\n\n \n\n\n\n\n\n\nPercentage of build-to-suits based on TEI\n\n\n \n\n\n \n\n\n68.3\n\n\n%\n\n\n \n\n\n \n\n\n27.7\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStabilizations:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNumber of development buildings stabilized during the period\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n55\n\n\n \n\n\n\n\n\n\nSquare feet\n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n19\n\n\n \n\n\n\n\n\n\nTEI\n\n\n \n\n\n$\n\n\n1,714\n\n\n \n\n\n \n\n\n$\n\n\n3,317\n\n\n \n\n\n\n\n\n\nPercentage of build-to-suits based on TEI\n\n\n \n\n\n \n\n\n45.0\n\n\n%\n\n\n \n\n\n \n\n\n27.4\n\n\n%\n\n\n\n\n\n\nWeighted average stabilized yield \n(1)\n\n\n \n\n\n \n\n\n6.8\n\n\n%\n\n\n \n\n\n \n\n\n6.0\n\n\n%\n\n\n\n\n\n\nEstimated value at completion\n\n\n \n\n\n$\n\n\n2,189\n\n\n \n\n\n \n\n\n$\n\n\n3,812\n\n\n \n\n\n\n\n\n\nEstimated weighted average margin \n(2)\n\n\n \n\n\n \n\n\n27.7\n\n\n%\n\n\n \n\n\n \n\n\n14.9\n\n\n%\n\n\n\n\n\n\nEstimated value creation\n\n\n \n\n\n$\n\n\n475\n\n\n \n\n\n \n\n\n$\n\n\n495\n\n\n \n\n\n\n\n \n(1)\nWe calculate the weighted average stabilized yield as estimated NOI assuming stabilized occupancy divided by TEI.\n \n(2)\nEstimated weighted average margin is calculated on development properties as estimated value creation, less estimated closing costs and taxes, if any, on properties expected to be sold or contributed, divided by TEI. Development margins fluctuate depending on several factors including cost of capital, changes in capitalization rates that are used to estimate value at completion and location and type of development, such as build-to-suit or speculative.\n \nAt September 30, 2025, the consolidated development portfolio, including properties under development and pre-stabilized properties, was expected to be completed before July 2027 with a TEI of $4.7 billion and was 48.1% leased. This includes data centers with an aggregate TEI of $1.0 billion, on a consolidated basis. Our investment in the development portfolio was $2.7 billion at September 30, 2025.\n \nCapital Expenditures\n \nWe capitalize costs incurred in improving and leasing our consolidated operating properties and other real estate investments as part of the investment basis or within \nOther Assets\n in the Consolidated Balance Sheets. The following graph summarizes recurring capitalized expenditures and leasing costs during each quarter and excludes development costs and spend subsequent to stabilization that is structural in nature and non-recurring:\n \n \n(1)\nCalculated using the trailing twelve months immediately prior to the period ended.\n \nStrategic Capital Segment\n \nThis reportable segment includes revenues from asset management and property management services, transactional services for acquisition, disposition and leasing activity and promote revenue earned from the unconsolidated co-investment ventures. Revenues associated with the Strategic Capital Segment fluctuate because of changes in the size of the portfolios through acquisitions and\n \n\n\n38\n \n\n\n\n\nIndex\n \n\n\ndispositions, the fair value of the properties, timing of promotes, foreign currency exchange rates and other transactional activity. These revenues are reduced by the direct costs associated with the asset and property-level management expenses for the properties owned by these ventures. We allocate the costs of our property management and leasing functions to the Strategic Capital Segment through \nStrategic Capital Expenses \nand to the Real Estate Segment through \nRental Expenses \nboth\n \nin the Consolidated Financial Statements, based on the square footage of the relative portfolios. For further details regarding the key property information and summarized financial condition and operating results of our unconsolidated co-investment ventures, refer to Note 3 to the Consolidated Financial Statements.\n \nBelow are the components of Strategic Capital Segment NOI for the nine months ended September 30, derived directly from the line items in the Consolidated Financial Statements (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nStrategic capital revenues\n\n\n \n\n\n$\n\n\n439\n\n\n \n\n\n \n\n\n$\n\n\n419\n\n\n \n\n\n\n\n\n\nStrategic capital expenses\n\n\n \n\n\n \n\n\n(195\n\n\n)\n\n\n \n\n\n \n\n\n(211\n\n\n)\n\n\n\n\n\n\nStrategic Capital Segment – NOI\n\n\n \n\n\n$\n\n\n244\n\n\n \n\n\n \n\n\n$\n\n\n208\n\n\n \n\n\n\n\n \nBelow is additional detail of our Strategic Capital Segment revenues, expenses and NOI for the nine months ended September 30 (in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nU.S. \n(1)\n\n\n \n\n\n \n\n\nOther Americas\n\n\n \n\n\n \n\n\nEurope\n\n\n \n\n\n \n\n\nAsia\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nStrategic capital revenues ($)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRecurring fees \n(2)\n\n\n \n\n\n \n\n\n133\n\n\n \n\n\n \n\n\n \n\n\n125\n\n\n \n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n45\n\n\n \n\n\n \n\n\n \n\n\n141\n\n\n \n\n\n \n\n\n \n\n\n126\n\n\n \n\n\n \n\n\n \n\n\n54\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n389\n\n\n \n\n\n \n\n\n \n\n\n352\n\n\n \n\n\n\n\n\n\nTransactional fees\n (3)\n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n49\n\n\n \n\n\n \n\n\n \n\n\n42\n\n\n \n\n\n\n\n\n\nPromote revenue \n(4)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n24\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n \n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n\n\n\n\nTotal strategic capital revenues ($)\n\n\n \n\n\n \n\n\n149\n\n\n \n\n\n \n\n\n \n\n\n138\n\n\n \n\n\n \n\n\n \n\n\n66\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n159\n\n\n \n\n\n \n\n\n \n\n\n142\n\n\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n439\n\n\n \n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n\n\n\n\nStrategic capital expenses ($) \n(4)\n\n\n \n\n\n \n\n\n(93\n\n\n)\n\n\n \n\n\n \n\n\n(107\n\n\n)\n\n\n \n\n\n \n\n\n(16\n\n\n)\n\n\n \n\n\n \n\n\n(17\n\n\n)\n\n\n \n\n\n \n\n\n(53\n\n\n)\n\n\n \n\n\n \n\n\n(60\n\n\n)\n\n\n \n\n\n \n\n\n(33\n\n\n)\n\n\n \n\n\n \n\n\n(27\n\n\n)\n\n\n \n\n\n \n\n\n(195\n\n\n)\n\n\n \n\n\n \n\n\n(211\n\n\n)\n\n\n\n\n\n\nStrategic Capital Segment – NOI ($)\n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n31\n\n\n \n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n57\n\n\n \n\n\n \n\n\n \n\n\n106\n\n\n \n\n\n \n\n\n \n\n\n82\n\n\n \n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n38\n\n\n \n\n\n \n\n\n \n\n\n244\n\n\n \n\n\n \n\n\n \n\n\n208\n\n\n \n\n\n\n\n \n(1)\nThe U.S. expenses include compensation and personnel costs for employees who are based in the U.S. but also support other geographies.\n \n(2)\nRecurring fees include asset management and property management fees.\n \n(3)\nTransactional fees include leasing commissions, acquisition, disposition, development and other fees.\n \n(4)\nWe generally earn promote revenue directly from third-party investors in the co-investment ventures based on the cumulative returns of the venture over a three-year period or the stabilization of individual development projects owned by the venture. Changes in asset valuations within the co-investment ventures during the promote period is one of the significant inputs to the calculation of promote revenues.\n \nThe Prologis Promote Plan (\"PPP\") awards up to 25% of the third-party portion of the promotes earned by us from the co-investment ventures to our employees. This award is issued as a combination of cash and equity-based awards, pursuant to the terms of the PPP and expensed through \nStrategic Capital Expenses\n in the Consolidated Statements of Income, as vested. As a result, expenses recognized in the current period may relate to promote revenues recognized in prior periods.\n \nG&A Expenses\n \nG&A expenses were $333 million and $316 million for the nine months ended September 30, 2025 and 2024, respectively. We capitalize certain internal costs that are incremental and directly related to our development and building improvement activities.\n \nThe following table summarizes capitalized G&A expenses for the nine months ended September 30 (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nBuilding and land development activities\n\n\n \n\n\n$\n\n\n85\n\n\n \n\n\n \n\n\n$\n\n\n103\n\n\n \n\n\n\n\n\n\nOperating building improvements and other\n\n\n \n\n\n \n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n42\n\n\n \n\n\n\n\n\n\nTotal capitalized G&A expenses\n\n\n \n\n\n$\n\n\n128\n\n\n \n\n\n \n\n\n$\n\n\n145\n\n\n \n\n\n\n\n\n\nCapitalized compensation and related costs as a percentage of total\n\n\n \n\n\n \n\n\n21.2\n\n\n%\n\n\n \n\n\n \n\n\n24.8\n\n\n%\n\n\n\n\n \n\n\n39\n \n\n\n\n\nIndex\n \n\n\n \nDepreciation and Amortization Expenses\n \nDepreciation and amortization expenses were $2.0 billion and $1.9 billion for the nine months ended September 30, 2025 and 2024, respectively.\n \nThe $33 million change in depreciation and amortization expenses for the nine months ended September 30, 2025 compared to the same period in 2024, was impacted by the following items (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n\n\n\n\n \nGains on Real Estate Transactions, Net\n \n \nGains on the disposition of development properties and land were $53 million and $160 million for the nine months ended September 30, 2025 and 2024, respectively, principally from the contribution of properties we developed to unconsolidated co-investment ventures in Europe in 2025 and 2024, in the U.S. in 2024 and from sales to third parties in the U.S. in 2025.\n \nGains on other dispositions of investments in real estate were $116 million and $651 million for the nine months ended September 30, 2025 and 2024, respectively, principally from sales of properties to third parties in 2025 and 2024, and the contribution of properties to our U.S. unconsolidated co-investment venture in 2024.\n \nHistorically, we have utilized the proceeds from these dispositions primarily to fund our acquisition and development activities. See Note 2 to the Consolidated Financial Statements for further information on these transactions.\n \nOur Owned and Managed (“O&M”) Operating Portfolio\n \nWe manage our business and evaluate operating performance on an O&M basis, which includes our consolidated properties and properties owned by our unconsolidated co-investment ventures. We believe reviewing the results on this basis enables management to assess performance more comprehensively as we manage the properties without regard to their ownership. We do not control the unconsolidated co-investment ventures for purposes of GAAP and the presentation of the ventures’ operating information does not represent a legal claim.\n \n \nOur O&M operating portfolio excludes our development portfolio, value-added properties, non-industrial properties and properties we consider non-strategic that we do not intend to hold for the long term, including those classified as held for sale or within other real estate investments. Value-added properties are properties we have either acquired at a discount and believe we could provide greater returns post-stabilization or properties we expect to repurpose to higher uses. See below for information on our O&M operating portfolio (square feet in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSeptember 30, 2025\n\n\n \n\n\nDecember 31, 2024\n\n\n\n\n\n\n \n\n\nNumber of Properties\n\n\n \n\n\n \n\n\nSquare\nFeet\n\n\n \n\n\n \n\n\nPercentage Occupied\n\n\n \n\n\nNumber of Properties\n\n\n \n\n\n \n\n\nSquare\nFeet\n\n\n \n\n\n \n\n\nPercentage Occupied\n\n\n\n\n\n\nConsolidated\n\n\n \n\n\n3,015\n\n\n \n\n\n \n\n\n \n\n\n655\n\n\n \n\n\n \n\n\n95.1%\n\n\n \n\n\n \n\n\n2,981\n\n\n \n\n\n \n\n\n \n\n\n644\n\n\n \n\n\n \n\n\n95.4%\n\n\n\n\n\n\nUnconsolidated\n\n\n \n\n\n2,440\n\n\n \n\n\n \n\n\n \n\n\n553\n\n\n \n\n\n \n\n\n95.4%\n\n\n \n\n\n \n\n\n2,423\n\n\n \n\n\n \n\n\n \n\n\n548\n\n\n \n\n\n \n\n\n96.6%\n\n\n\n\n\n\nTotal\n\n\n \n\n\n5,455\n\n\n \n\n\n \n\n\n \n\n\n1,208\n\n\n \n\n\n \n\n\n95.3%\n\n\n \n\n\n \n\n\n5,404\n\n\n \n\n\n \n\n\n \n\n\n1,192\n\n\n \n\n\n \n\n\n95.9%\n\n\n\n\n \n\n\n40\n \n\n\n\n\nIndex\n \n\n\nBelow are the key leasing metrics of our O&M operating portfolio.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n(1)\nSquare feet of leases commenced and weighted average net effective rent change were calculated for leases with initial terms of one year or greater. We retained approximately 70% or more of our customers, based on the total square feet of leases commenced during these periods.\n \n(2)\nCalculated using the trailing twelve months immediately prior to the period ended. \n \n(3)\nTurnover costs include external leasing commissions and tenant improvements and represent the estimated obligations incurred in connection with the lease commencement for leases greater than one year. \n \nSame Store Analysis\n \nOur same store metrics are non-GAAP financial measures, which are commonly used in the real estate industry and expected from the financial community, on both a net effective and cash basis. We evaluate the performance of the operating properties we own and manage using a “same store” analysis because the population of properties in this analysis is consistent from period to period, which allows us and investors to analyze our ongoing business operations. We determine our same store metrics on property NOI, which is calculated as rental revenue less rental expense for the applicable properties in the same store population for both consolidated and unconsolidated properties based on our ownership interest, as further defined below.\n \n \nWe define our same store population for the three months ended September 30, 2025 as the properties in our O&M operating portfolio, including the property NOI for both consolidated properties and properties owned by the unconsolidated co-investment ventures, at January 1, 2024 and owned throughout the same three-month period in both 2024 and 2025. We believe the drivers of property NOI for the consolidated portfolio are generally the same for the properties owned by the ventures in which we invest and therefore we evaluate the same store metrics of the O&M portfolio based on Prologis’ ownership in the properties (“Prologis Share”). The same store population excludes properties held for sale to third parties, along with development properties that were not stabilized at the beginning of the period (January 1, 2024) and properties acquired or disposed of to third parties during the period. To derive an appropriate measure of period-to-period operating performance, we remove the effects of foreign currency exchange rate movements by using the reported period-end exchange rate to translate from local currency into the U.S. dollar, for both periods.\n \n \n\n\n41\n \n\n\n\n\nIndex\n \n\n\nAs non-GAAP financial measures, the same store metrics have certain limitations as an analytical tool and may vary among real estate companies. As a result, we provide a reconciliation of \nRental Revenues\n less \nRental Expenses\n (“Property NOI”) (from our Consolidated Financial Statements prepared in accordance with U.S. GAAP) to our Same Store Property NOI measures, as follows for the three months ended September 30 (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nPercentage\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\n\n\n\n\nReconciliation of Consolidated Property NOI to Same Store Property NOI measures:\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRental revenues\n\n\n$\n\n\n2,054\n\n\n \n\n\n \n\n\n$\n\n\n1,897\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRental expenses\n\n\n \n\n\n(485\n\n\n)\n\n\n \n\n\n \n\n\n(427\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nConsolidated Property NOI\n\n\n$\n\n\n1,569\n\n\n \n\n\n \n\n\n$\n\n\n1,470\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdjustments to derive same store results:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty NOI from consolidated properties not included in same store portfolio and \n     other adjustments\n (1)\n\n\n \n\n\n(221\n\n\n)\n\n\n \n\n\n \n\n\n(146\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProperty NOI from unconsolidated co-investment ventures included in same store portfolio\n (1)(2)\n\n\n \n\n\n922\n\n\n \n\n\n \n\n\n \n\n\n861\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nThird parties' share of Property NOI from properties included in same store portfolio \n(1)(2)\n\n\n \n\n\n(729\n\n\n)\n\n\n \n\n\n \n\n\n(702\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrologis Share of Same Store Property NOI – Net Effective\n (2)\n\n\n$\n\n\n1,541\n\n\n \n\n\n \n\n\n$\n\n\n1,483\n\n\n \n\n\n \n\n\n \n\n\n3.9\n\n\n%\n\n\n\n\n\n\nConsolidated properties straight-line rent and fair value lease amortization \n     included in same store portfolio \n(3)\n\n\n \n\n\n(121\n\n\n)\n\n\n \n\n\n \n\n\n(132\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnconsolidated co-investment ventures straight-line rent and fair value lease \n     amortization included in same store portfolio\n (3)\n\n\n \n\n\n(31\n\n\n)\n\n\n \n\n\n \n\n\n(23\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nThird parties' share of straight-line rent and fair value lease amortization included\n     in same store portfolio\n (2)(3)\n\n\n \n\n\n27\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPrologis Share of Same Store Property NOI – Cash\n (2)(3)\n\n\n$\n\n\n1,416\n\n\n \n\n\n \n\n\n$\n\n\n1,346\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n%\n\n\n\n\n \n(1)\nWe exclude properties held for sale to third parties, along with development properties that were not stabilized at the beginning of the periods and properties acquired or disposed of to third parties during the periods. We also exclude one-time items due to early lease terminations, including termination fees received from customers and the write-off of related lease assets and liabilities, that are not indicative of the property’s recurring operating performance in order to evaluate the growth or decline in each property's rental revenues. Same Store Property NOI is adjusted to include an allocation of property management expenses for our consolidated properties based on the property management services provided to each property (generally, based on a percentage of revenues). On consolidation, these amounts are eliminated and the actual costs of providing property management and leasing services are recognized as part of our consolidated rental expense.\n \n(2)\nWe include the Property NOI for the same store portfolio for both consolidated properties and properties owned by the co-investment ventures based on our investment in the underlying properties. In order to calculate our share of Same Store Property NOI from the co-investment ventures in which we own less than 100%, we use the co-investment ventures’ underlying Property NOI for the same store portfolio and apply our ownership percentage at September 30, 2025 to the Property NOI for both periods, including the properties contributed during the periods. We adjust the total Property NOI from the same store portfolio of the co-investment ventures by subtracting the third parties’ share of both consolidated and unconsolidated co-investment ventures.\n \nDuring the periods presented, certain wholly owned properties were contributed to a co-investment venture and are included in the same store portfolio. Neither our consolidated results nor those of the co-investment ventures, when viewed individually, would be comparable on a same store basis because of the changes in composition of the respective portfolios from period to period (e.g. the results of a contributed property are included in our consolidated results through the contribution date and in the results of the venture subsequent to the contribution date based on our ownership interest at the end of the period). As a result, only line items labeled “Prologis Share of Same Store Property NOI” are comparable period over period.\n \n(3)\nWe further remove certain noncash items (straight-line rent and fair value lease amortization) included in the financial statements prepared in accordance with U.S. GAAP to reflect a Same Store Property NOI – Cash measure.\n \nWe manage our business and compensate our executives based on the same store results of our O&M portfolio at 100% as we manage our portfolio on an ownership blind basis. We calculate those results by including 100% of the properties included in our same store portfolio.\n \nOther Components of Income (Expense)\n \nEarnings from Unconsolidated Entities, Net\n \nThe earnings we recognize from unconsolidated entities can be impacted by: (i) the size, rental rates and occupancy of the portfolio of properties owned by each venture; (ii) interest expense based on the size and terms of the debt; (iii) gains or losses from dispositions of properties, impairments and extinguishments of debt; (iv) our ownership interest in each venture; (v) other variances in revenues and\n \n\n\n42\n \n\n\n\n\nIndex\n \n\n\nexpenses of each venture; and (vi) fluctuations in foreign currency exchange rates used to translate our share of net earnings to U.S. dollars.\n \nWe recognized net earnings from unconsolidated entities, which are primarily accounted for using the equity method, of $268 million and $260 million for the nine months ended September 30, 2025 and 2024, respectively.\n \nSee the discussion of our unconsolidated entities above in the Strategic Capital Segment discussion and in Note 3 to the Consolidated Financial Statements for a further breakdown of our share of net earnings recognized.\n \nInterest Expense\n \n \nThe following table details our net interest expense for the nine months ended September 30 (dollars in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nGross interest expense\n\n\n \n\n\n$\n\n\n753\n\n\n \n\n\n \n\n\n$\n\n\n656\n\n\n \n\n\n\n\n\n\nAmortization of debt discount and debt issuance costs, net\n\n\n \n\n\n \n\n\n64\n\n\n \n\n\n \n\n\n \n\n\n59\n\n\n \n\n\n\n\n\n\nCapitalized amounts\n\n\n \n\n\n \n\n\n(75\n\n\n)\n\n\n \n\n\n \n\n\n(83\n\n\n)\n\n\n\n\n\n\nNet interest expense\n\n\n \n\n\n$\n\n\n742\n\n\n \n\n\n \n\n\n$\n\n\n632\n\n\n \n\n\n\n\n\n\nWeighted average effective interest rate during the period\n\n\n \n\n\n \n\n\n3.2\n\n\n%\n\n\n \n\n\n \n\n\n3.1\n\n\n%\n\n\n\n\n \nInterest expense increased during the nine months ended September 30, 2025, as compared to the same period in 2024, principally due to the issuance of senior notes to finance our acquisition and development activities and higher interest rates on new issuances. We issued $2.9 billion of senior notes during the nine months ended September 30, 2025 and $4.2 billion during the year ended December 31, 2024, with a weighted average interest rate of 4.3% and 4.8%, respectively, at the issuance date.\n \nSee Note 5 to the Consolidated Financial Statements and the Liquidity and Capital Resources section below, for further discussion of our debt and borrowing costs.\n \nForeign Currency, Derivative and Other Gains (Losses) and Other Income (Expense), Net\n \nGiven the global nature of our operations, we are exposed to foreign currency exchange risk related to investments in and earnings from our foreign investments. We primarily hedge our foreign currency risk related to our investments by borrowing in the currencies in which we invest thereby providing a natural hedge. We have issued debt in a currency that is not the same functional currency of the borrowing entity and have designated a portion of the debt as a nonderivative net investment hedge. We recognize the remeasurement and settlement of the translation adjustment on the unhedged portion of the debt and accrued interest in unrealized gains or losses. We may use derivative financial instruments to manage foreign currency exchange rate risk related to our earnings. We recognize the change in fair value of the undesignated derivative contracts in unrealized gains and losses. Upon settlement of these transactions, we recognize realized gains or losses.\n \nWe recognized foreign currency, derivative and other gains (losses) and other income (expense), net, of $54 million in losses and $63 million in gains for the nine months ended September 30, 2025 and 2024, respectively. Included in these amounts was interest income earned on short-term investments.\n \nThe following table details our foreign currency and derivative gains (losses), net for the nine months ended September 30 included in earnings (in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRealized foreign currency and derivative gains (losses), net:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGains (losses) on the settlement of undesignated derivatives\n\n\n \n\n\n$\n\n\n16\n\n\n \n\n\n \n\n\n$\n\n\n50\n\n\n \n\n\n\n\n\n\nGains (losses) on the settlement of transactions with third parties\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(1\n\n\n)\n\n\n\n\n\n\nTotal realized foreign currency and derivative gains (losses), net\n\n\n \n\n\n \n\n\n16\n\n\n \n\n\n \n\n\n \n\n\n49\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnrealized foreign currency and derivative gains (losses), net:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGains (losses) on the change in fair value of undesignated derivatives and unhedged debt\n\n\n \n\n\n \n\n\n(166\n\n\n)\n\n\n \n\n\n \n\n\n(44\n\n\n)\n\n\n\n\n\n\nGains (losses) on remeasurement of certain assets and liabilities\n\n\n \n\n\n \n\n\n10\n\n\n \n\n\n \n\n\n \n\n\n(17\n\n\n)\n\n\n\n\n\n\nTotal unrealized foreign currency and derivative gains (losses), net\n\n\n \n\n\n \n\n\n(156\n\n\n)\n\n\n \n\n\n \n\n\n(61\n\n\n)\n\n\n\n\n\n\nTotal foreign currency and derivative gains (losses), net\n\n\n \n\n\n$\n\n\n(140\n\n\n)\n\n\n \n\n\n$\n\n\n(12\n\n\n)\n\n\n\n\n \nSee Note 9 to the Consolidated Financial Statements for more information about our derivative and nonderivative transactions.\n \n\n\n43\n \n\n\n\n\nIndex\n \n\n\nIncome Tax Expense\n \n \nWe recognize income tax expense related to our taxable REIT subsidiaries and in the local, state and foreign jurisdictions in which we operate. Our current income tax expense (benefit) fluctuates from period to period based primarily on the timing of our taxable income, including gains on the disposition of properties, fees earned from the co-investment ventures and taxable earnings from unconsolidated co-investment ventures. Deferred income tax expense (benefit) is generally a function of the period’s temporary differences and the utilization of net operating losses generated in prior years that had been previously recognized as deferred income tax assets in taxable subsidiaries.\n \nThe following table summarizes our income tax expense (benefit) for the nine months ended September 30 (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nCurrent income tax expense (benefit):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (benefit)\n\n\n \n\n\n$\n\n\n119\n\n\n \n\n\n \n\n\n$\n\n\n71\n\n\n \n\n\n\n\n\n\nIncome tax expense (benefit) on dispositions\n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n\n\n\n\nTotal current income tax expense (benefit)\n\n\n \n\n\n \n\n\n124\n\n\n \n\n\n \n\n\n \n\n\n78\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDeferred income tax expense (benefit):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome tax expense (benefit)\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal deferred income tax expense (benefit)\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nTotal income tax expense (benefit)\n\n\n \n\n\n$\n\n\n121\n\n\n \n\n\n \n\n\n$\n\n\n80\n\n\n \n\n\n\n\n \nNet Earnings Attributable to Noncontrolling Interests\n \nNet earnings attributable to noncontrolling interests represents the third-party investors’ share of the earnings generated in consolidated entities in which we do not own 100% of the equity, reduced by the third-party share of fees or promotes we earned during the period. We had net earnings attributable to noncontrolling interests of $155 million and $153 million for the nine months ended September 30, 2025 and 2024, respectively. Included in these amounts were $48 million and $61 million for the nine months ended September 30, 2025 and 2024, respectively, of net earnings attributable to the common limited partnership unitholders of Prologis, L.P.\n \nSee Note 6 to the Consolidated Financial Statements for further information on our noncontrolling interests.\n \nOther Comprehensive Income (Loss)\n \nThe key driver of changes in \nAccumulated Other Comprehensive Income (Loss) (“AOCI/L”)\n in the Consolidated Financial Statements during the nine months ended September 30, 2025 and 2024, was the currency translation adjustment derived from changes in exchange rates during both periods principally on our net investments in real estate outside the U.S. and the borrowings we issue in the functional currencies of the countries where we invest. These borrowings serve as a natural hedge of our foreign investments. In addition, we use derivative financial instruments, such as foreign currency contracts to manage foreign currency exchange rate risk related to our foreign investments and interest rate contracts to manage interest rate risk, that when designated the change in fair value is included in \nAOCI/L.\n \nSee Note 9 to the Consolidated Financial Statements for more information on changes in other comprehensive income and about our derivative and nonderivative transactions.\n \nRESULTS OF OPERATIONS – THREE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024\n \nExcept as separately discussed above, the changes in comprehensive income attributable to common stockholders and unitholders and its components for the three months ended September 30, 2025, as compared to the three months ended September 30, 2024, are similar to the changes for the nine-month periods ended on the same dates.\n \nLIQUIDITY AND CAPITAL RESOURCES\n \nOverview\n \nWe believe our ability to generate cash from operating activities, distributions from our co-investment ventures, contributions and dispositions of properties and available financing sources provides sufficient capacity to meet our anticipated future development, acquisition, operating, debt service, dividend and distribution requirements.\n \n\n\n44\n \n\n\n\n\nIndex\n \n\n\nNear-Term Principal Cash Sources and Uses\n \nIn addition to dividends and distributions, we expect our primary cash needs will consist of the following:\n \n•\ncompletion of the development and leasing of the properties in our consolidated development portfolio (at September 30, 2025, 70 properties in our development portfolio were 48.1% leased with a current investment of $2.7 billion and a TEI of $4.7 billion when completed and leased, leaving $2.0 billion of estimated additional required investment);\n \n•\ndevelopment of new industrial properties that we may hold for long-term investment or subsequently contribute to unconsolidated co-investment ventures or sell to third parties, including the acquisition of land;\n \n•\ndevelopment of data centers, including capital for the acquisition of land, site preparation and power procurement activities to secure long-term energy capacity;\n \n•\nthe acquisition of other real estate investments that we acquire with the intention of redeveloping into industrial properties and data centers;\n \n•\ncapital expenditures and leasing costs on properties in our operating portfolio;\n \n•\ninvestments in renewable energy, energy storage and mobility infrastructure to serve our customers and achieve our sustainability goals; \n \n•\nrepayment of debt and scheduled principal payments of $175 million in the remainder of 2025 and $2.3 billion in 2026;\n \n•\nadditional investments in current and future co-investment ventures and other ventures; and\n \n•\nthe acquisition of operating properties or portfolios of operating properties (depending on market and other conditions), for direct, long-term investment in our consolidated portfolio (this might include acquisitions from our unconsolidated entities). \n \nWe expect to fund our cash needs principally from the following sources (subject to market conditions):\n \n•\nnet cash flow from property operations;\n \n•\nfees earned for services performed on behalf of co-investment ventures;\n \n•\ndistributions received from co-investment ventures;\n \n•\nproceeds from the contribution of properties to current or future co-investment ventures;\n \n•\nproceeds from the disposition of properties or other investments to third parties;\n \n•\navailable unrestricted cash balances ($1.2 billion at September 30, 2025);\n \n•\navailable capacity under our current credit facility arrangements that allows us to borrow on a short-term basis, with maturities generally ranging from overnight to three months ($6.3 billion available at September 30, 2025), including our commercial paper programs; and\n \n•\nproceeds from the issuance of debt.\n \nIn the long term, we may also voluntarily repurchase our outstanding debt or equity securities (depending on prevailing market conditions, our liquidity, contractual restrictions and other factors) through cash purchases, open-market purchases, privately negotiated transactions, tender offers or otherwise. We may also fund our cash needs from the issuance of equity securities, subject to market conditions, and through the sale of a portion of our investments in co-investment ventures.\n \n \n\n\n45\n \n\n\n\n\nIndex\n \n\n\nDebt\n \nThe following table summarizes information about our consolidated debt by currency (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30, 2025\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nWeighted Average \nInterest Rate\n\n\n \n\n\n \n\n\nAmount \nOutstanding\n\n\n \n\n\n \n\n\n% of Total\n\n\n \n\n\n \n\n\nWeighted Average \nInterest Rate\n\n\n \n\n\nAmount \nOutstanding\n\n\n \n\n\n \n\n\n% of Total\n\n\n \n\n\n\n\n\n\nBritish pound sterling\n\n\n \n\n\n3.0%\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n1,841\n\n\n \n\n\n \n\n\n \n\n\n5.2\n\n\n%\n\n\n \n\n\n3.1%\n\n\n \n\n\n$\n\n\n1,715\n\n\n \n\n\n \n\n\n \n\n\n5.6\n\n\n%\n\n\n\n\n\n\nCanadian dollar\n\n\n \n\n\n4.5%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,768\n\n\n \n\n\n \n\n\n \n\n\n5.0\n\n\n%\n\n\n \n\n\n4.7%\n\n\n \n\n\n \n\n\n1,262\n\n\n \n\n\n \n\n\n \n\n\n4.1\n\n\n%\n\n\n\n\n\n\nEuro\n\n\n \n\n\n2.2%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n12,291\n\n\n \n\n\n \n\n\n \n\n\n34.8\n\n\n%\n\n\n \n\n\n2.1%\n\n\n \n\n\n \n\n\n9,900\n\n\n \n\n\n \n\n\n \n\n\n32.1\n\n\n%\n\n\n\n\n\n\nJapanese yen\n\n\n \n\n\n1.2%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,110\n\n\n \n\n\n \n\n\n \n\n\n8.8\n\n\n%\n\n\n \n\n\n1.1%\n\n\n \n\n\n \n\n\n2,911\n\n\n \n\n\n \n\n\n \n\n\n9.4\n\n\n%\n\n\n\n\n\n\nU.S. dollar\n\n\n \n\n\n4.1%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n15,734\n\n\n \n\n\n \n\n\n \n\n\n44.6\n\n\n%\n\n\n \n\n\n4.1%\n\n\n \n\n\n \n\n\n14,458\n\n\n \n\n\n \n\n\n \n\n\n46.8\n\n\n%\n\n\n\n\n\n\nOther\n\n\n \n\n\n3.8%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n559\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n%\n\n\n \n\n\n3.6%\n\n\n \n\n\n \n\n\n633\n\n\n \n\n\n \n\n\n \n\n\n2.0\n\n\n%\n\n\n\n\n\n\nTotal debt \n(1)\n\n\n \n\n\n3.2%\n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n35,303\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n3.1%\n\n\n \n\n\n$\n\n\n30,879\n\n\n \n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n \n(1)\nThe weighted average remaining maturity for total debt outstanding at both September 30, 2025 and December 31, 2024 was 9 years. \n \nAt September 30, 2025, our credit ratings were A from Standard and Poor's and A2 from Moody's, both with stable outlooks. These ratings support our ability to access capital at favorable interest rates. Adverse changes to our credit ratings could negatively affect our business and our future growth, particularly our refinancing and capital markets activities, our ability to manage debt maturities and our development and acquisition plans. A securities rating is not a recommendation to buy, sell or hold securities and may be revised or withdrawn at any time by the issuing agency.\n \nAt September 30, 2025, we were in compliance with all of our financial debt covenants. These covenants include customary financial covenants, such as maintaining debt service coverage, leverage and fixed charge coverage ratios.\n \nSee Note 5 to the Consolidated Financial Statements for further discussion on our debt.\n \nEquity Commitments Related to Certain Co-Investment Ventures\n \nCertain co-investment ventures have equity commitments from us and our venture partners. Our venture partners fulfill their equity commitment with cash. We may fulfill our equity commitment through contributions of properties or cash.\n \nThe following table summarizes the remaining equity commitments at September 30, 2025 (dollars in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nEquity Commitments \n(1)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nPrologis\n\n\n \n\n\n \n\n\nVenture \nPartners\n\n\n \n\n\n \n\n\nTotal\n\n\n \n\n\n \n\n\nExpiration Date\n\n\n\n\n\n\nPrologis Targeted U.S. Logistics Fund\n\n\n$\n\n\n-\n\n\n \n\n\n \n\n\n$\n\n\n43\n\n\n \n\n\n \n\n\n$\n\n\n43\n\n\n \n\n\n \n\n\n \n\n\n2028 \n(2)\n\n\n\n\n\n\nPrologis Brazil Logistics Venture\n\n\n \n\n\n34\n\n\n \n\n\n \n\n\n \n\n\n138\n\n\n \n\n\n \n\n\n \n\n\n172\n\n\n \n\n\n \n\n\n \n\n\n2026\n\n\n\n\n\n\nPrologis European Logistics Fund\n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n91\n\n\n \n\n\n \n\n\n \n\n\n91\n\n\n \n\n\n \n\n\n \n\n\n2028 \n(2)\n\n\n\n\n\n\nPrologis Japan Core Logistics Fund\n\n\n \n\n\n89\n\n\n \n\n\n \n\n\n \n\n\n455\n\n\n \n\n\n \n\n\n \n\n\n544\n\n\n \n\n\n \n\n\n \n\n\n2033\n\n\n\n\n\n\nPrologis China Logistics Venture\n\n\n \n\n\n71\n\n\n \n\n\n \n\n\n \n\n\n404\n\n\n \n\n\n \n\n\n \n\n\n475\n\n\n \n\n\n \n\n\n \n\n\n2025 – 2028\n\n\n\n\n\n\nTotal\n\n\n$\n\n\n194\n\n\n \n\n\n \n\n\n$\n\n\n1,131\n\n\n \n\n\n \n\n\n$\n\n\n1,325\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \n(1)\nThe equity commitments for the co-investment ventures that operate in a different functional currency than the U.S. dollar were calculated using the foreign currency exchange rate at September 30, 2025.\n \n(2)\nVenture partners generally have the option to cancel their equity commitment starting 18 months after the initial commitment date.\n \nSee the Cash Flow Summary below for more information about our investment activity in our co-investment ventures.\n \n\n\n46\n \n\n\n\n\nIndex\n \n\n\nCash Flow Summary\n \nThe following table summarizes our cash flow activity for the nine months ended September 30\n \n(in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet cash provided by (used in) operating activities\n\n\n$\n\n\n3,850\n\n\n \n\n\n \n\n\n$\n\n\n3,577\n\n\n \n\n\n\n\n\n\nNet cash provided by (used in) investing activities\n\n\n$\n\n\n(3,656\n\n\n)\n\n\n \n\n\n$\n\n\n(3,419\n\n\n)\n\n\n\n\n\n\nNet cash provided by (used in) financing activities\n\n\n$\n\n\n(345\n\n\n)\n\n\n \n\n\n$\n\n\n92\n\n\n \n\n\n\n\n\n\nNet increase (decrease) in cash and cash equivalents, including the effect of foreign currency exchange \n     rates on cash\n\n\n$\n\n\n(133\n\n\n)\n\n\n \n\n\n$\n\n\n250\n\n\n \n\n\n\n\n \nOperating Activities\n \nCash provided by and used in operating activities, exclusive of changes in receivables and payables, was impacted by the following significant activities during the nine months ended September 30, 2025 and 2024:\n \n•\nReal Estate Segment. \nWe generate the majority of our operating cash through the net revenues of our Real Estate Segment, including the recovery of our operating costs. Cash flows generated by the Real Estate Segment are impacted by our acquisition, development and disposition activities, which are drivers of NOI recognized during each period. See the Results of Operations section above for further explanation of our Real Estate Segment. The revenues from this segment include noncash adjustments for straight-lined rents and amortization of above and below market leases of $531 million and $470 million in 2025 and 2024, respectively. \n \n•\nStrategic Capital Segment. \nWe also generate operating cash through the fee revenue from our Strategic Capital Segment by providing asset management and property management and other services to our unconsolidated co-investment ventures. See the Results of Operations section above for the key drivers of the net revenues from our Strategic Capital Segment. Included in \nStrategic Capital Revenues\n in the Consolidated Statements of Income are the promotes we earn from the third-party investors in our co-investment ventures, which are recognized in operating activities in the period the cash is received, generally the quarter after the revenue is recognized.\n \n•\nG&A expenses and equity-based compensation awards. \nWe incurred $333 million and $316 million of G&A expenses in 2025 and 2024, respectively. We recognized equity-based, noncash compensation expenses of $142 million and $164 million in 2025 and 2024, respectively, which were recorded to \nRental Expenses\n in the Real Estate Segment, \nStrategic Capital Expenses\n in the Strategic Capital Segment and \nG&A Expenses \nin the Consolidated Statements of Income.\n \n•\nOperating distributions from unconsolidated entities. \nWe received $455 million and $417 million of distributions as a return on our investment from the cash flows generated from the operations of our unconsolidated entities in 2025 and 2024, respectively. \n \n•\nCash paid for interest, net of amounts capitalized. \nWe paid interest, net of amounts capitalized, of $711 million and $573 million in 2025 and 2024, respectively.\n \n•\nCash paid for income taxes, net of refunds. \nWe paid income taxes, net of refunds, of $106 million and $105 million in 2025 and 2024, respectively.\n \nInvesting Activities\n \nCash provided by investing activities is driven by proceeds from the sale of real estate assets that include the contribution of properties we developed to our unconsolidated co-investment ventures as well as the sale of non-strategic operating properties. Cash used in investing activities is principally driven by our capital deployment activities of investing in real estate development, acquisitions and capital expenditures as discussed above. This activity includes land for future development, operating properties, other real estate assets and real estate portfolios. See Note 2 to the Consolidated Financial Statements for further information on these activities. In addition, the following significant transactions also impacted our cash used in and provided by investing activities during the nine months ended September 30, 2025 and 2024:\n \n•\nInvestments in and advances to our unconsolidated entities.\n \nWe invested cash in our unconsolidated entities of $51 million and $480 million in 2025 and 2024, respectively, representing our proportionate share, for the acquisition of properties, development and repayment of debt by the ventures. See Note 3 to the Consolidated Financial Statements for more detail on our unconsolidated co-investment ventures.\n \n•\nReturn of investment from unconsolidated entities.\n \nWe received distributions from unconsolidated entities as a return of investment of $76 million and $54 million in 2025 and 2024, respectively, representing our proportionate share. Included in these \n\n\n47\n \n\n\n\n\nIndex\n \n\n\namounts were distributions from venture activities, including proceeds from property sales, debt refinancing and the redemption of our investment in certain unconsolidated entities.\n \n \n•\nNet proceeds from (payments on) the settlement of net investment hedges. \nWe made net payments of $14 million and received net proceeds of $11 million for the settlement of net investment hedges in 2025 and 2024, respectively. See Note 9 to the Consolidated Financial Statements for further information on our derivative transactions.\n \n•\nPurchase of short-term investments. \nWe invested €150 million ($177 million at September 30, 2025) of cash into a short-term money market with a maturity of four months during the nine months ended September 30, 2025.\n \nFinancing Activities\n \nCash provided by and used in financing activities is principally driven by proceeds from and payments on credit facilities, commercial paper and other debt, along with dividends paid on common and preferred stock and noncontrolling interest contributions and distributions. Our credit facilities and our commercial paper support our cash needs for general corporate purposes on a short-term basis. The maturities of the borrowings under the credit facilities and the notes under the commercial paper programs generally range from overnight to three months.\n \n \nOur repurchase of and payments on debt and proceeds from the issuance of debt consisted of the following activity for the nine months ended September 30 (in millions):\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nRepurchase of and payments on debt (including extinguishment costs)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRegularly scheduled debt principal payments and payments at maturity\n\n\n \n\n\n$\n\n\n209\n\n\n \n\n\n \n\n\n$\n\n\n329\n\n\n \n\n\n\n\n\n\nSecured mortgage debt\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n89\n\n\n \n\n\n\n\n\n\nTerm loans\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n500\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n209\n\n\n \n\n\n \n\n\n$\n\n\n918\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProceeds from the issuance of debt\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSecured mortgage debt\n\n\n \n\n\n$\n\n\n3\n\n\n \n\n\n \n\n\n$\n\n\n6\n\n\n \n\n\n\n\n\n\nSenior notes\n\n\n \n\n\n \n\n\n2,932\n\n\n \n\n\n \n\n\n \n\n\n4,149\n\n\n \n\n\n\n\n\n\nTerm loans\n\n\n \n\n\n \n\n\n20\n\n\n \n\n\n \n\n\n \n\n\n129\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n2,955\n\n\n \n\n\n \n\n\n$\n\n\n4,284\n\n\n \n\n\n\n\n \nUnconsolidated Co-Investment Venture Debt\n \nWe had investments in and advances to our unconsolidated co-investment ventures of $9.7 billion at September 30, 2025. These ventures had total third-party debt of $18.6 billion at September 30, 2025\n \nwith a weighted average remaining maturity of 6 years and weighted average interest rate of 3.4%. The weighted average loan-to-value ratio for all unconsolidated co-investment ventures was 29.1% at September 30, 2025 based on gross book value. Loan-to-value, a non-GAAP measure, was calculated as the percentage of total third-party debt to the gross book value of real estate for each venture and weighted based on the cumulative gross book value of all unconsolidated co-investment ventures.\n \nAt September 30, 2025, we did not guarantee any third-party debt of the unconsolidated co-investment ventures.\n \nDividend and Distribution Requirements\n \nOur dividend policy on our common stock is to distribute a percentage of our cash flow to ensure that we will meet the dividend requirements of the Internal Revenue Code (\"IRC\"), relative to maintaining our REIT status, while still allowing us to retain cash to fund our capital deployment and other investment activities.\n \nUnder the IRC, REITs may be subject to certain federal income and excise taxes on undistributed taxable income.\n \nOutstanding Common Shares and Units Eligible for Dividends and Distributions\n \nAt September 30, 2025 the total outstanding shares of the Parent's common stock and common limited partnership units in the OP eligible for dividends and distributions were as follows (in thousands):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nShares/Units\n\n\n \n\n\n\n\n\n\nCommon shares outstanding\n\n\n \n\n\n928,664\n\n\n \n\n\n\n\n\n\nCommon limited partnership units outstanding\n\n\n \n\n\n22,036\n\n\n \n\n\n\n\n\n\nTotal outstanding common shares and units eligible for dividends and distributions\n\n\n \n\n\n950,700\n\n\n \n\n\n\n\n \n\n\n48\n \n\n\n\n\nIndex\n \n\n\n \nWe paid quarterly cash dividends of $1.01 and $0.96 per common share in each of the first three quarters of 2025 and 2024, respectively. Our future common stock dividends, if and as declared, may vary and will be determined by the Board based upon the circumstances prevailing at the time, including our financial condition, operating results and REIT distribution requirements, and may be adjusted at the discretion of the Board during the year.\n \nWe make distributions on the common limited partnership units outstanding at the same per unit amount as our common stock dividend.\n \nClass A common limited partnerships units (\"Class A Units\") Dividends\n \nThe Class A Units in the OP are entitled to a quarterly distribution equal to $0.64665 per unit so long as the common units receive a quarterly distribution of at least $0.40 per unit. We paid a quarterly cash distribution of $0.64665 per Class A Unit in each of the first three quarters of 2025 and 2024. During the three and nine months ended September 30, 2025, the majority of the Class A Units in the OP were converted to common limited partnership units in the OP.\n \n \nPreferred Stock Dividends\n \nAt September 30, 2025, our Series Q preferred stock had an annual dividend rate of 8.54% per share and the dividends are payable quarterly in arrears.\n \nPursuant to the terms of our preferred stock, we are restricted from declaring or paying any dividend with respect to our common stock unless and until all cumulative dividends with respect to the preferred stock have been paid and sufficient funds have been set aside for dividends that have been declared for the relevant dividend period with respect to the preferred stock.\n \nOther Commitments\n \nOn an ongoing basis, we are engaged in various stages of negotiations for the acquisition or disposition of individual properties or portfolios of properties.\n \nFUNDS FROM OPERATIONS ATTRIBUTABLE TO COMMON STOCKHOLDERS/UNITHOLDERS (“FFO”)\n \nFFO is a non-GAAP financial measure that is commonly used in the real estate industry, with net earnings as the most directly comparable GAAP measure.\n \nThe National Association of Real Estate Investment Trusts (\"NAREIT\") defines FFO as earnings computed under GAAP to exclude depreciation and gains and losses from sales net of any related tax, along with impairment charges, of previously depreciated properties. This measure excludes the gains on revaluation of equity investments upon acquisition of a controlling interest and the gain recognized from a partial sale of our investment, as these are similar to gains from the sales of previously depreciated properties. This measure excludes similar adjustments from our unconsolidated entities and the third parties' share of our consolidated ventures.\n \n \nOur FFO Measures\n \nOur FFO measures begin with NAREIT’s definition, with certain adjustments to calculate FFO, as modified by Prologis, and Core FFO, both as defined below, to reflect our business and execution of our management strategy. While these adjustments are subject to significant fluctuations from period to period, with both positive and negative short-term impacts, the removal of the effects of these items enhances our understanding of the core operating performance of our properties over the long term.\n \nWe use FFO, as modified by Prologis, so that management, analysts and investors are able to evaluate our performance against other REITs that do not have similar operations or operations in jurisdictions outside the U.S. We use Core FFO to (i) assess our operating performance as compared to other real estate companies; (ii) evaluate our performance and the performance of our properties in comparison with expected results and results of previous periods; (iii) evaluate the performance of our management; (iv) budget and forecast future results to assist in the allocation of resources; and (v) evaluate how a specific potential investment will impact our future results.\n \n \nWe calculate our FFO measures based on our proportionate ownership share of both our unconsolidated entities and consolidated ventures. We reflect our share of our FFO measures for unconsolidated entities by applying our average ownership percentage for the period to the applicable adjustments on an entity-by-entity basis. We reflect our share for consolidated ventures in which we do not own 100% of the equity, by removing the noncontrolling interests share of the applicable adjustments based on our average ownership percentage for the applicable periods.\n \n \n\n\n49\n \n\n\n\n\nIndex\n \n\n\nFFO, as modified by Prologis attributable to common stockholders/unitholders (“FFO, as modified by Prologis”)\n \nTo arrive at FFO\n, as modified by Prologis\n, we adjust the NAREIT defined FFO measure to exclude:\n \n•\ndeferred income tax benefits and deferred income tax expenses recognized by our subsidiaries;\n \n•\ncurrent income tax expense related to acquired tax liabilities that were recorded as deferred tax liabilities in an acquisition, to the extent the expense is offset with a deferred income tax benefit in earnings that is excluded from our defined FFO measure; and\n \n•\nforeign currency exchange gains and losses resulting from: (i) debt transactions between us and our foreign entities; (ii) third-party debt that is used to hedge our investment in foreign entities; (iii) derivative financial instruments related to any such debt transactions; and (iv) mark-to-market adjustments associated with derivative and other financial instruments.\n \nCore FFO attributable to common stockholders/unitholders (“Core FFO”)\n \nTo arrive at Core FFO, we adjust FFO, \nas modified by Prologis\n, to exclude the following:\n \n•\ngains or losses from the disposition of land and development properties that were developed with the intent to contribute or sell;\n \n•\nincome tax expense related to the sale of investments in real estate;\n \n•\nimpairment charges recognized related to our investments in real estate generally as a result of our change in intent to contribute or sell these properties; and\n \n•\ngains or losses from the early extinguishment of debt and redemption and repurchase of preferred stock.\n \nLimitations on the use of our FFO measures\n \nWhile we believe our modified FFO measures are important supplemental measures, neither NAREIT’s nor our measures of FFO should be used alone because they exclude significant components of net earnings computed under GAAP and are, therefore, limited as an analytical tool. We do not use NAREIT’s nor our measures of FFO as alternatives to net earnings computed under GAAP or as alternatives to cash from operating activities computed under GAAP or as indicators of our ability to fund our cash needs.\n \n \n\n\n50\n \n\n\n\n\nIndex\n \n\n\nWe compensate for the limitations by using our FFO measures only in conjunction with net earnings computed under GAAP when making our decisions. This information should be read with our complete Consolidated Financial Statements prepared under GAAP. To assist investors in compensating for these limitations, we reconcile our modified FFO measures from consolidated net earnings attributable to common stockholders computed under GAAP for the nine months ended September 30 as follows (in millions):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nReconciliation of net earnings attributable to common stockholders to FFO measures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet earnings attributable to common stockholders\n\n\n \n\n\n$\n\n\n1,924\n\n\n \n\n\n \n\n\n$\n\n\n2,448\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdd (deduct) NAREIT defined adjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nReal estate related depreciation and amortization\n\n\n \n\n\n \n\n\n1,897\n\n\n \n\n\n \n\n\n \n\n\n1,870\n\n\n \n\n\n\n\n\n\nGains on other dispositions of investments in real estate, net of taxes (excluding development \n     properties and land)\n\n\n \n\n\n \n\n\n(115\n\n\n)\n\n\n \n\n\n \n\n\n(651\n\n\n)\n\n\n\n\n\n\nAdjustments related to noncontrolling interests\n\n\n \n\n\n \n\n\n(49\n\n\n)\n\n\n \n\n\n \n\n\n(31\n\n\n)\n\n\n\n\n\n\nOur proportionate share of adjustments related to unconsolidated entities\n\n\n \n\n\n \n\n\n423\n\n\n \n\n\n \n\n\n \n\n\n333\n\n\n \n\n\n\n\n\n\nNAREIT defined FFO attributable to common stockholders/unitholders\n\n\n \n\n\n$\n\n\n4,080\n\n\n \n\n\n \n\n\n$\n\n\n3,969\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdd (deduct) our modified adjustments:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnrealized foreign currency, derivative and other losses (gains), net\n\n\n \n\n\n \n\n\n155\n\n\n \n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n\n\n\n\nDeferred income tax expense (benefit)\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nOur proportionate share of adjustments related to unconsolidated entities\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n\n\n\n\nFFO, as modified by Prologis attributable to common stockholders/unitholders\n\n\n \n\n\n$\n\n\n4,229\n\n\n \n\n\n \n\n\n$\n\n\n4,029\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdjustments to arrive at Core FFO:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGains on dispositions of development properties and land, net\n\n\n \n\n\n \n\n\n(53\n\n\n)\n\n\n \n\n\n \n\n\n(160\n\n\n)\n\n\n\n\n\n\nCurrent income tax expense (benefit) on dispositions\n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n\n\n\n\nLosses (gains) on early extinguishment of debt, net\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n \n\n\n \n\n\n(1\n\n\n)\n\n\n\n\n\n\nAdjustments related to noncontrolling interests\n\n\n \n\n\n \n\n\n3\n\n\n \n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\nOur proportionate share of adjustments related to unconsolidated entities\n\n\n \n\n\n \n\n\n(5\n\n\n)\n\n\n \n\n\n \n\n\n(5\n\n\n)\n\n\n\n\n\n\nCore FFO attributable to common stockholders/unitholders\n\n\n \n\n\n$\n\n\n4,178\n\n\n \n\n\n \n\n\n$\n\n\n3,870"
}