{
  "source_file": "pm-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF \nFINANCIAL CONDITION AND RESULTS OF OPERATIONS\nDescription of Our Company\nWe are a leading international consumer goods company, actively delivering a smoke-free future. We are evolving our portfolio for the long term to include products outside of the tobacco and nicotine sector. Our current product portfolio primarily consists of cigarettes and smoke-free products, including heat-not-burn, nicotine pouch and e-vapor products. Since 2008, we have invested over $14 billion to develop, scientifically substantiate and commercialize innovative smoke-free products for adults who would otherwise continue to smoke, with the goal of completely ending the sale of cigarettes. This investment includes the building of world-class scientific assessment capabilities, notably in the areas of pre-clinical systems toxicology, clinical and behavioral research, as well as post-market studies. Following a robust science-based review, the U.S. Food and Drug Administration (the \"FDA\") has authorized the marketing of Swedish Match’s \nGeneral \nsnus and \nZYN \nnicotine pouches and versions of PMI’s \nIQOS \ndevices and consumables - the first-ever such authorizations in their respective categories. Versions of \nIQOS \ndevices and consumables\n \nand \nGeneral\n snus also obtained the first-ever Modified Risk Tobacco Product (\"MRTP\") authorizations from the FDA. We describe the MRTP orders in more detail in the \"Business Environment\" section of this Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n (\"MD&A\").  \nFollowing the sale of Vectura Group Ltd. on December 31, 2024, we updated our segment reporting in January 2025, by including the ongoing Wellness & Healthcare results in the Europe segment. In addition, we renamed our “PMI Duty Free” business to “PMI Global Travel Retail” effective in the first quarter of 2025.  As a result of this change, our segment that includes our duty free business was renamed East Asia, Australia & PMI Global Travel Retail (“EA, AU & PMI GTR”).\nOur four geographical segments are as follows: \n•\nEurope Region, including our Wellness & Healthcare business; \n•\nSouth and Southeast Asia, Commonwealth of Independent States, Middle East and Africa Region (\"SSEA, CIS & MEA\"); \n•\nEast Asia, Australia, and PMI Global Travel Retail (“EA, AU & PMI GTR”); and \n•\nAmericas Region. \nWith our smoke-free business now operating at scale across our regions, including substantial growth from our U.S. business, PMI plans to implement an evolved organizational model with two primary business units: International and U.S. The updated organizational structure is designed to enhance our agility and to support our journey to become a smoke-free company under the leadership of CEO Jacek Olczak. This change is scheduled for implementation effective January 1, 2026, and as a result we anticipate realigning our reportable segments. The current four geographic segments will be replaced with three new segments: International Smoke-Free, International Combustibles, and U.S. The company plans to report its financial results based on the new segments as of the first quarter of 2026.\nOur cigarettes are sold in approximately 170 markets, and in many of these markets they hold the number one or number two market share position. We have a wide range of premium, mid-price and low-price brands. Our portfolio is comprised of both international and local brands.  \nSmoke-Free Business (\"SFB”) is the term PMI uses to refer to all of its smoke-free products. SFB also includes wellness and healthcare products, as well as consumer accessories, such as lighters and matches.  \nSmoke-free products (also referred to herein as \"SFPs\") is the term PMI uses to refer to all of its products that provide nicotine without combusting tobacco, such as heat-not-burn, e-vapor, and oral smokeless, and that therefore generate far lower levels of harmful chemicals. As such, these products have the potential to present less risk of harm versus continued smoking. \nIQOS\n, \nZYN\n and \nVEEV\n are the leading brands in our SFPs portfolio. As of October 2025, our smoke-free products were available for sale in 100 markets.    \nOur Wellness and Healthcare business strategy focuses on developing and commercializing oral and inhaled consumer health and wellness offerings and inhaled prescription products for therapy areas that include pain management and cardiovascular emergencies.  This includes medical and pharmaceutical cannabinoids, and non-recreational cannabinoid products (including \n55\nTable of Contents\nCBD), in line with applicable regulatory requirements, though any revenue related to cannabinoids is expected to be negligible in the near to medium term.\nIn 2022, we acquired Swedish Match AB, a market leader in oral nicotine delivery with a significant presence in the United States market. The Swedish Match acquisition was a key milestone in PMI’s transformation to becoming a smoke-free company. The Swedish Match product portfolio is complementary to our portfolio, permitting us to bring together a leading oral nicotine product with the leading heat-not-burn product.  \nIn 2022, we reached an agreement with Altria Group, Inc. to end our commercial relationship in the U.S. covering \nIQOS\n as of April 30, 2024. PMI now holds the full rights to commercialize \nIQOS\n in the U.S.  \nWe use the term net revenues to refer to our operating revenues from the sale of our products, including shipping and handling charges billed to customers, net of sales and promotion incentives, and excise taxes.  Our net revenues and operating income are affected by various factors, including the volume and mix of products we sell, the price of our products and changes in currency exchange rates.  \"Mix\" is a term used to refer to the proportionate value of premium-price brands to mid-price or low-price brands in any given market (product mix).  Mix can also refer to the proportion of shipment volume in more profitable markets versus shipment volume in less profitable markets (geographic mix).  \nOur cost of sales consists primarily of: tobacco leaf, non-tobacco raw materials, labor and manufacturing costs; shipping and handling costs; and the cost of devices produced by third-party electronics manufacturing service providers.  Estimated costs associated with device warranty programs are generally provided for in cost of sales in the period the related revenues are recognized.\nOur marketing, administration and research costs include the costs of marketing and selling our products, other costs generally not related to the manufacture of our products (including general corporate expenses), and costs incurred to develop new products. The most significant components of our marketing, administration and research costs are marketing and sales expenses and general and administrative expenses.\nPhilip Morris International Inc. is a legal entity separate and distinct from its direct and indirect subsidiaries.  Accordingly, our right, and thus the right of our creditors and stockholders, to participate in any distribution of the assets or earnings of any subsidiary is subject to the prior rights of creditors of such subsidiary, except to the extent that claims of our company itself as a creditor may be recognized.  As a holding company, our principal sources of funds, including funds to make payment on our debt securities, are from the receipt of dividends and repayment of debt from our subsidiaries.  Our principal wholly owned and majority-owned subsidiaries currently are not limited by long-term debt or other agreements in their ability to pay cash dividends or to make other distributions that are otherwise compliant with law, including governmental capital and foreign currency exchange controls.\n56\nTable of Contents\nExecutive Summary \nThe following executive summary provides the business update and significant highlights from the \"\nDiscussion and Analysis\n\" that follows. \nConsolidated Operating Results for the Nine Months Ended September 30,\n \n2025\n \n•\nNet Revenues\n - Net revenues of $30.3 billion for the nine months ended September 30, 2025, increased by $2.1 billion, or 7.5%, from the comparable 2024 amount. The change in our net revenues from the comparable 2024 amount was driven by the following (variances not to scale with year-to-date results): \n \nFor the nine months ended September 30, 2025, net revenues increased by 7.5%. Net revenues, excluding currency and acquisitions/divestitures, also increased by 7.5%, mainly reflecting: a favorable pricing variance due to higher combustible tobacco pricing; and favorable volume/mix driven by higher smoke-free products volume, notwithstanding unfavorable mix and lower cigarette volumes.\nNet revenues by product category for the nine months ended September 30, 2025 and 2024 are shown below: \n \n        \n57\nTable of Contents\n•\nDiluted Earnings Per Share\n - The changes in our reported diluted earnings per share (“diluted EPS”) for the nine months ended September 30, 2025, from the comparable 2024 amounts, were as follows:   \nDiluted EPS\n% Change\nFor the nine months ended September 30, 2024\n$\n4.89 \n2024 Restructuring charges\n0.09 \n2024 Impairment of other intangibles\n0.01 \n2024 Amortization of intangibles\n0.29 \n2024 Fair value adjustment for equity security investments\n(0.39)\n2024 Loss on sale of Vectura Group\n0.13 \n2024 Egypt sales tax charge\n0.03 \n2024 Income tax impact associated with Swedish Match AB financing\n(0.01)\n2024 Tax items\n(0.03)\nSubtotal of 2024 items\n0.12 \n2025 Restructuring charges\n(0.13)\n2025 Impairment of goodwill\n(0.03)\n2025 Amortization of intangibles\n(0.37)\n2025 Fair value adjustment for equity security investments\n0.33 \n2025 Germany excise tax classification litigation charge\n(0.10)\n2025 RBH (Canada) Plan implementation, including dividend income, net\n0.10 \n2025 Impairment of Wellness & Healthcare related equity investment\n(0.09)\n2025 Income tax impact associated with Swedish Match AB financing\n0.24 \n2025 Tax items \n0.11 \nSubtotal of 2025 items\n0.06 \nCurrency\n0.02 \nInterest\n0.03 \nChange in tax rate\n— \nOperations\n0.77 \nFor the nine months ended September 30, 2025\n$\n5.89 \n20.4 \n%\nRestructuring charges –\n During the nine months ended September 30, 2024, we recorded pre-tax restructuring charges of $168 million  (representing $141 million net of income tax and a diluted EPS charge of $0.09 per share), related to the restructuring of the sourcing of \nIQOS\n products to be commercialized in the U.S., and the cessation of our operations in Venezuela. During the nine months ended September 30, 2025, we recorded pre-tax restructuring charges of $243 million, representing $200 million\n net of income tax and a diluted EPS charge of \n$0.13\n \nper share, related to the end of combustible tobacco production in two of our factories in Germany.  For further details, see Note 16. \nRestructuring Activities\n. \nImpairment of goodwill and other intangibles\n – During the first quarter of 2024, we recorded an impairment charge of $27 million (representing $20 million net of income tax or $0.01 per share decrease in diluted EPS), primarily reflecting the impairment of non-amortizable intangible assets related to an in-process research and development project in our Wellness and Healthcare business. During the second quarter of 2025, after the completion of our annual review of goodwill, it was determined that the estimated fair value of a reporting unit included within the Europe segment was lower than its carrying value. Consequently, PMI recorded a goodwill impairment charge of \n$41 million\n (representing a $0.03 per share decrease in diluted EPS). For further details on the goodwill impairment charge, see Note 5. \nGoodwill and Other Intangible Assets, net\n.  \nAmortization of intangibles\n \n– \nDuring the nine months ended September 30, 2024 and 2025, we recorded amortization of intangible expense of $588 million (representing $459 million net of income tax or $0.29 per share decrease in diluted EPS) and \n$746 million\n (representing \n$580 million\n net of income tax or $0.37 per share decrease in diluted EPS), respectively. The higher 2025 amount includes the reacquired rights recorded as other intangible assets, net following the reacquisition of \nIQOS \n58\nTable of Contents\ncommercialization rights in the U.S. from Altria Group, Inc., effective in May 2024. For further details, see Note 5. \nGoodwill and Other Intangible Assets, net\n.\nFair value adjustment for equity security investments – \nDuring the nine months ended September 30, 2024 and 2025, we recorded fair value adjustments for our equity security investments in India and Sri Lanka of $614 million after tax gain (or $0.39 per share increase in diluted EPS) and $513 million after tax gain (or $0.33 per share increase in diluted EPS), respectively.  For further details, see Note 13. \nRelated Parties - Equity Investments and Other\n.\nLoss on sale of Vectura Group – \nIn September 2024, we announced the execution of a definitive agreement to sell Vectura to Molex Asia Holdings Ltd. As a result, we recorded in the third quarter of 2024 an impairment charge of $198 million (representing a diluted EPS charge of $0.13 per share) related to Vectura's classification as held for sale. The impairment charge was recorded in marketing, administration and research costs in PMI’s condensed consolidated statements of earnings for nine months ended September 30, 2024, and was included in the Europe segment results. On December 31, 2024, we completed the sale. For further details, see Note 2. \nAcquisitions and Divestitures\n. \nEgypt sales tax charge\n \n– \nIn the third quarter of 2024, following a ruling issued by the Higher Administrative Court in Egypt and subsequent evaluation of available remedies, we concluded that an adverse outcome was probable and recorded a pre-tax charge of $45 million (representing $39 million net of income tax and a diluted EPS charge of $0.03 per share) in relation to tax assessments for general sales tax deducted on imported cutfiller for the years 2014 to 2016. This pre-tax charge was recorded in marketing, administration and research costs in the condensed consolidated statement of earnings for the nine months ended September 30, 2024, and was included in the SSEA, CIS & MEA segment results.\nGermany excise tax classification litigation charge\n \n– \nIn August 2024, the German Main Custom Office (“MCO”) notified Philip Morris (Germany) GmbH (“PM Germany”) of its decision to classify \nTEREA\n consumables as a cigarette for excise tax purposes with the associated tax assessment totaling EUR 151 million (approximately $176 million) covering the period of February 15, 2023, through August 1, 2024. In April 2025, PM Germany paid the outstanding amount, which was recorded in Other assets on the consolidated balance sheets (with no impact on the income statement at that time), while it challenged the MCO’s decision in court. On September 17, 2025, PM Germany filed a request to withdraw the proceedings. As a result, the tax assessment amount of $176 million (representing $150 million net of income tax and a diluted EPS charge of $0.10 per share) was recorded as a pre-tax charge in marketing, administration and research costs in the condensed consolidated statements of earnings in the third quarter of 2025, and was included in the Europe segment results. For further details, see Note 9. \nContingencies\n. \nRBH (Canada) Plan implementation, including dividend income, net\n \n–\n On August 29, 2025, the plan of compromise and arrangement (the “Plan”) setting forth the terms of a resolution of Canadian tobacco claims and related litigation became effective. For the nine months ended September 30, 2025, we recorded after-tax income of $156 million ($0.10 per share increase in diluted EPS) following the Plan implementation, including $303 million of dividend income net of the corresponding decrease in the carrying value of the RBH investment, $19 million of other income and the related income tax charge of ($166) million.  For further details regarding the Plan, see Note 9. \nContingencies\n, Note 10. \nIncome Taxes\n and Note 13. \nRelated Parties - Equity Investments and Other\n.  \nImpairment of Wellness & Healthcare related equity investment\n \n– \nIn the third quarter of 2025, PMI recorded a non-cash after-tax charge of $146 million (representing a diluted EPS charge of $0.09 per share), primarily representing an other-than-temporary impairment of one equity method investment within the Wellness & Healthcare business following a reassessment of its estimated fair value triggered by the amendment of existing investment agreements in the third quarter of 2025. The impairment charge was recorded in equity investments and securities (income)/loss, net in in the condensed consolidated statements of earnings for the nine months ended September 30, 2025.  For further details, see Note 13. \nRelated Parties - Equity Investments and Other\n.  \nIncome taxes –\n The Income tax impact associated with the Swedish Match acquisition financing that increased our 2024 diluted EPS by $0.01 per share and increased our 2025 diluted EPS by $0.24 per share in the table above was due to a deferred tax impact for unrealized foreign currency gains and losses on intercompany loans related to the Swedish Match acquisition financing reflected in the condensed consolidated statements of earnings, while the underlying pre-tax foreign currency movements fully offset in the condensed consolidated statements of earnings and were reflected as currency translation adjustments in the condensed consolidated statements of stockholders' (deficit) equity. \n59\nTable of Contents\nThe 2024 tax items that increased our 2024 diluted EPS by $0.03 per share in the table above were due to a U.S. tax benefit for a worthless stock deduction under section 165(g) of the Internal Revenue Code related to PMI’s investment in C.A. Tabacalera Nacional, a wholly owned foreign corporation incorporated in Venezuela. \nThe 2025 tax items that increased our 2025 diluted EPS by $0.11 per share in the table above were due to benefits related to an interest expense election primarily driven by a reduction in prior year tax costs associated with global intangible low-taxed income and refunds expected on amended tax returns filed in Germany; partially offset by valuation allowances recorded on deferred tax assets related to U.S. foreign tax credits and the recognition of current tax expense related to the potential disallowance of deductions for certain intercompany transactions in Indonesia. For further details, see Note 10. \nIncome Taxes\n.  \nCurrency \n– The favorable impact of $0.02 per share from currency over the comparable 2024 period primarily results from the fluctuations of the U.S. dollar, especially against the Euro and Egyptian pound, partly offset by the Swiss franc. This favorable currency movement has impacted our profitability across our primary revenue markets and local currency cost bases.  \nInterest\n – The favorable impact of $0.03 per share from interest in the table above was primarily due to a lower weighted average cost of debt.  \nOperations\n – The increase in diluted EPS of $0.77 from our operations in the table above was due primarily to the following segments: \n \n•\nEurope: Favorable pricing and favorable volume/mix, partly offset by higher marketing, administration and research costs; \n•\nSSEA, CIS & MEA: Favorable pricing and higher cigarette and SFP volume, partly offset by higher marketing, administration and research costs, and higher manufacturing costs; \n•\nEA, AU & PMI GTR: Favorable volume/mix and a favorable pricing variance; and \n•\nAmericas: Favorable volume/mix, partly offset by an unfavorable pricing variance, higher marketing, administration and research costs, and higher manufacturing costs.  \nConsolidated Operating Results for the Three Months Ended September 30,\n \n2025\n \n•\nNet Revenues\n - Net revenues of $10.8 billion for the three months ended September 30, 2025, increased by $0.9 billion, or 9.4%, from the comparable 2024 amount. The change in our net revenues from the comparable 2024 amount was driven by the following (variances not to scale with quarterly results):  \nDuring the quarter, net revenues increased by 9.4%. Net revenues, excluding currency and acquisitions/divestitures, increased by 5.9%, mainly reflecting: a favorable pricing variance due to higher combustible tobacco pricing; and favorable volume/mix driven by higher smoke-free products volume, notwithstanding lower volumes and unfavorable mix for cigarettes.\n60\nTable of Contents\nNet revenues by product category for the three months ended September 30, 2025 and 2024, are shown below:  \n        \n•\nDiluted Earnings Per Share\n - The changes in our reported diluted EPS for the three months ended September 30, 2025, from the comparable 2024 amounts, were as follows: \n \nDiluted EPS\n% Change\nFor the three months ended September 30, 2024\n$\n1.97 \n2024 Amortization of intangibles\n0.12 \n2024 Fair value adjustment for equity security investments\n(0.24)\n2024 Loss on sale of Vectura Group\n0.13 \n2024 Egypt sales tax charge\n0.03\n2024 Income tax impact associated with Swedish Match AB financing\n(0.10)\n2024 Tax items\n— \nSubtotal of 2024 items\n(0.06)\n2025 Amortization of intangibles\n(0.13)\n2025 Fair value adjustment for equity security investments\n0.07 \n2025 Germany excise tax classification litigation charge\n(0.10)\n2025 RBH (Canada) Plan implementation, including dividend income, net\n0.10 \n2025 Impairment of Wellness & Healthcare related equity investment\n(0.09)\n2025 Income tax impact associated with Swedish Match AB financing\n— \n2025 Tax items \n0.14 \nSubtotal of 2025 items\n(0.01)\nCurrency\n0.08 \nInterest\n(0.02)\nChange in tax rate\n0.06 \nOperations\n0.21 \nFor the three months ended September 30, 2025\n$\n2.23 \n13.2 \n%\nAmortization of intangibles\n \n– \nDuring the third quarter of 2024 and 2025, we recorded amortization of intangible expense of $256 million (representing $199 million net of income tax or $0.12 per share decrease in diluted EPS) and $250 million (representing $195 million net of income tax or $0.13 per share decrease in diluted EPS), respectively. \n61\nTable of Contents\nFair value adjustment for equity security investments – \nDuring the third quarter of 2024 and 2025, we recorded fair value adjustments for our equity security investments in India and Sri Lanka of $372 million after tax gain (or $0.24 per share increase in diluted EPS) and $103 million after tax gain (or $0.07 per share increase in diluted EPS), respectively.  For further details, see Note 13. \nRelated Parties - Equity Investments and Other\n.\nLoss on sale of Vectura Group – \nIn September 2024, we announced the execution of a definitive agreement to sell Vectura to Molex Asia Holdings Ltd. As a result, we recorded in the third quarter of 2024 an impairment charge of $198 million (representing a diluted EPS charge of $0.13 per share) related to Vectura's classification as held for sale. The impairment charge was recorded in marketing, administration and research costs in PMI’s condensed consolidated statements of earnings, and was included in the Europe segment results. On December 31, 2024, we completed the sale. For further details, see Note 2. \nAcquisitions and Divestitures\n. \nEgypt sales tax charge\n \n– \nIn the third quarter of 2024, following a ruling issued by the Higher Administrative Court in Egypt and subsequent evaluation of available remedies, we concluded that an adverse outcome was probable and recorded a pre-tax charge of $45 million (representing $39 million net of income tax and a diluted EPS charge of $0.03 per share) in relation to tax assessments for general sales tax deducted on imported cutfiller for the years 2014 to 2016. This pre-tax charge was recorded in marketing, administration and research costs in the condensed consolidated statement of earnings for the three months ended September 30, 2024, and was included in the SSEA, CIS & MEA segment results.\nGermany excise tax classification litigation charge\n \n– \nIn August 2024, the German Main Custom Office (“MCO”) notified Philip Morris (Germany) GmbH (“PM Germany”) of its decision to classify \nTEREA\n consumables as a cigarette for excise tax purposes with the associated tax assessment totaling EUR 151 million (approximately $176 million) covering the period of February 15, 2023, through August 1, 2024. In April 2025, PM Germany paid the outstanding amount, which was recorded in Other assets on the consolidated balance sheets (with no impact on the income statement at that time), while it challenged the MCO’s decision in court. On September 17, 2025, PM Germany filed a request to withdraw the proceedings. As a result, the tax assessment amount of $176 million (representing $150 million net of income tax and a diluted EPS charge of $0.10 per share) was recorded as a pre-tax charge in marketing, administration and research costs in the condensed consolidated statements of earnings in the third quarter of 2025, and was included in the Europe segment results. For further details, see Note 9. \nContingencies\n. \nRBH (Canada) Plan implementation, including dividend income, net\n \n–\n On August 29, 2025, the plan of compromise and arrangement (the “Plan”) setting forth the terms of a resolution of Canadian tobacco claims and related litigation became effective. For the three months ended September 30, 2025, we recorded after-tax income of $156 million ($0.10 per share increase in diluted EPS) following the Plan implementation, including $303 million of dividend income net of the corresponding decrease in the carrying value of the RBH investment, $19 million of other income and the related income tax charge of ($166) million.  For further details regarding the Plan, see Note 9. \nContingencies\n, Note 10. \nIncome Taxes\n and Note 13. \nRelated Parties - Equity Investments and Other\n.  \nImpairment of Wellness & Healthcare related equity investment\n \n– \nIn the third quarter of 2025, PMI recorded a non-cash after-tax charge of $146 million (representing a diluted EPS charge of $0.09 per share), primarily representing an other-than-temporary impairment of one equity method investment within the Wellness & Healthcare business following a reassessment of its estimated fair value triggered by the amendment of existing investment agreements in the third quarter of 2025. The impairment charge was recorded in equity investments and securities (income)/loss, net in in the condensed consolidated statements of earnings.  For further details, see Note 13. \nRelated Parties - Equity Investments and Other\n.  \nIncome taxes –\n The Income tax impact associated with the Swedish Match acquisition financing that increased our 2024 diluted EPS by $0.10 per share in the table above was due to a deferred tax impact for unrealized foreign currency gains and losses on intercompany loans related to the Swedish Match acquisition financing reflected in the condensed consolidated statements of earnings, while the underlying pre-tax foreign currency movements fully offset in the condensed consolidated statements of earnings and were reflected as currency translation adjustments in the condensed consolidated statements of stockholders' (deficit) equity. \nThe 2025 tax items that increased our 2025 diluted EPS by $0.14 per share in the table above were due to benefits related to an interest expense election primarily driven by a reduction in prior year tax costs associated with global intangible low-taxed income and refunds expected on amended tax returns filed in Germany; partially offset by valuation allowances recorded on deferred tax assets related to U.S. foreign tax credits. For further details, see Note 10. \nIncome Taxes\n. \n62\nTable of Contents\nThe change in the tax rate that increased our diluted EPS by $0.06 per share in the table above was primarily due to benefits related to an interest expense election primarily driven by a reduction in current year tax costs associated with global intangible low-taxed income and decreases in U.S. state income tax expense; partially offset by increases in foreign statutory tax rates and repatriation cost differences.  \nCurrency \n–  The favorable impact of $0.08 per share from currency over the comparable 2024 period primarily results from the fluctuations of the U.S. dollar, especially against the Euro and Russian ruble, partly offset by the Japanese yen and the Swiss franc. This favorable currency movement has impacted our profitability across our primary revenue markets and local currency cost bases.  \nInterest\n – The unfavorable impact of $0.02 per share from interest in the table above was primarily due to the impact of derivative financial instruments.\nOperations\n – The increase in diluted EPS of $0.21 from our operations in the table above was due primarily to the following segments:   \n \n•\nEurope: Favorable pricing and favorable volume/mix; \n•\nSSEA, CIS & MEA: Favorable pricing, partly offset by higher marketing, administration and research costs; and \n•\nEA, AU & PMI GTR: Favorable volume/mix; \npartly offset by\n•\nAmericas: Unfavorable pricing variance and higher marketing, administration and research costs, partly offset by higher SFP volumes.  \n63\nTable of Contents\nDiscussion and Analysis \nCritical Accounting Estimates\nFor information on our critical accounting estimates, see \"\nCritical Accounting Estimates\n\" in the MD&A included in Item 7 of the Annual Report on Form 10-K for the fiscal year ended December 31, 2024. \n \nConsolidated Operating Results\n \nSee pages \n102\n - \n115\n for a discussion of our \"\nCautionary Factors That May Affect Future Results\n.\" Net revenues, significant expenses, and operating income by segment were as follows:\n \n(in millions) \nEurope\nSSEA, CIS & MEA\nEA, AU & PMI GTR\nAmericas\nTotal\nFor the Nine Months Ended September 30, 2025\nNet revenues\n$\n12,513 \n$\n8,942 \n$\n5,207 \n$\n3,624 \n$\n30,286 \nLess:\nCost of sales\n3,286 \n3,800 \n1,512 \n1,208 \n9,806 \nMarketing, administration and research costs\n3,931 \n1,987 \n1,083 \n1,919 \n8,920 \nImpairment of goodwill\n41 \n— \n— \n— \n41 \nOperating income \n$\n5,255 \n$\n3,155 \n$\n2,612 \n$\n497 \n$\n11,519 \nFor the Nine Months Ended September 30, 2024\nNet revenues\n$\n11,547 \n$\n8,393 \n$\n4,959 \n$\n3,273 \n$\n28,172 \nLess:\nCost of sales\n3,318 \n3,909 \n1,573 \n1,106 \n9,906 \nMarketing, administration and research costs\n3,432 \n1,861 \n1,082 \n1,748 \n8,123 \nOperating income \n$\n4,797 \n$\n2,623 \n$\n2,304 \n$\n419 \n$\n10,143 \n(in millions) \nEurope\nSSEA, CIS & MEA\nEA, AU & PMI GTR\nAmericas\nTotal\nFor the Three Months Ended September 30, 2025\nNet revenues\n$\n4,719 \n$\n3,273 \n$\n1,768 \n$\n1,085 \n$\n10,845 \nLess:\nCost of sales\n1,175 \n1,359 \n535 \n418 \n3,487 \nMarketing, administration and research costs\n1,394 \n679 \n387 \n635 \n3,095 \nOperating income \n$\n2,150 \n$\n1,235 \n$\n846 \n$\n32 \n$\n4,263 \nFor the Three Months Ended September 30, 2024\nNet revenues\n$\n4,197 \n$\n2,964 \n$\n1,602 \n$\n1,148 \n$\n9,911 \nLess:\nCost of sales\n1,165 \n1,361 \n468 \n372 \n3,366 \nMarketing, administration and research costs\n1,263 \n643 \n346 \n639 \n2,891 \nOperating income \n$\n1,769 \n$\n960 \n$\n788 \n$\n137 \n$\n3,654 \n64\nTable of Contents\nOur net revenues by product category are shown in the table below: \n \nPMI Net Revenues by Product Category\n(in millions)\nFor the Nine Months Ended September 30,\nFor the Three Months Ended September 30,\n2025\n2024\nChange\n2025\n2024\nChange\nCombustible tobacco:\nEurope\n$\n6,713 \n$\n6,467 \n3.8 \n%\n$\n2,478 \n$\n2,322 \n6.7 \n%\nSSEA, CIS & MEA\n7,670 \n7,390 \n3.8 \n%\n2,753 \n2,612 \n5.4 \n%\nEA, AU & PMI GTR\n1,851 \n1,889 \n(2.0)\n%\n649 \n673 \n(3.6)\n%\nAmericas\n1,551 \n1,653 \n(6.1)\n%\n520 \n527 \n(1.2)\n%\nTotal Combustible tobacco\n17,786 \n17,399 \n2.2 \n%\n6,400 \n6,134 \n4.3 \n%\nSmoke-free:\nEurope\n5,800 \n5,080 \n14.2 \n%\n2,241 \n1,875 \n19.5 \n%\nof which, Wellness & Healthcare\n166 \n246 \n(32.5)\n%\n57 \n76 \n(24.3)\n%\nSSEA, CIS & MEA\n1,272 \n1,003 \n26.8 \n%\n520 \n352 \n47.9 \n%\nEA, AU & PMI GTR\n3,356 \n3,070 \n9.3 \n%\n1,119 \n929 \n20.4 \n%\nAmericas\n2,073 \n1,620 \n27.9 \n%\n565 \n621 \n(9.1)\n%\nTotal Smoke-free\n12,500 \n10,773 \n16.0 \n%\n4,445 \n3,777 \n17.7 \n%\nTotal PMI net revenues\n$\n30,286 \n$\n28,172 \n7.5 \n%\n$\n10,845 \n$\n9,911 \n9.4 \n%\nNote: Sum of product categories or Regions might not foot to total PMI due to rounding\nItems affecting the comparability of results from operations were as follows:\n•\nRestructuring charges\n \n–\n See Note 16. \nRestructuring Activities\n for a breakdown of these costs by segment for the nine months ended September 30, 2025 and 2024.  \n \n•\nImpairment of goodwill – \nSee Note 5. \nGoodwill and Other Intangible Assets, net\n for details of the $41 million of goodwill impairment charge recorded in the Europe segment for the nine months ended September 30, 2025. \n•\nGermany excise tax classification litigation charge – \nSee Note 9. \nContingencies\n for details of the $176 million pre-tax charge recorded in the Europe segment for the nine months and three months ended September 30, 2025.  \n•\nLoss on sale of Vectura Group\n \n–\n In September 2024, PMI announced the execution of a definitive agreement to sell Vectura to Molex Asia Holdings Ltd. As a result, PMI recorded in the third quarter of 2024 an impairment charge of $198 million related to Vectura's classification as held for sale. This pre-tax charge was recorded in marketing, administration and research costs in the condensed consolidated statement of earnings for the nine months and three months ended September 30, 2024, and was included in the Europe segment results. On December 31, 2024, PMI completed the sale. For further details, see Note 2. \nAcquisitions and Divestitures\n.   \n•\nEgypt sales tax charge\n \n– \nIn the third quarter of 2024, following a ruling issued by the Higher Administrative Court in Egypt and subsequent evaluation of available remedies, PMI concluded that an adverse outcome was probable and recorded a pre-tax charge of $45 million in relation to tax assessments for general sales tax deducted on imported cutfiller for the years 2014 to 2016. This pre-tax charge was recorded in marketing, administration and research costs in the condensed consolidated statement of earnings for the nine months and three months ended September 30, 2024, and was included in the SSEA, CIS & MEA segment results.\nNet revenues related to combustible tobacco refer to the operating revenues generated from the sale of these products, including shipping and handling charges billed to customers, net of sales and promotion incentives, and excise taxes.  These net revenue amounts consist of the sale of our cigarettes and other tobacco products that are combusted. Other tobacco products primarily include roll-your-own and make-your-own cigarettes, pipe tobacco, cigars and cigarillos and do not include smoke-free products.\n65\nTable of Contents\nNet revenues related to smoke-free, excluding wellness and healthcare, refer to the operating revenues generated from the sale of these products, including shipping and handling charges billed to customers, net of sales and promotion incentives, and excise taxes, if applicable.  These net revenue amounts consist of the sale of our products that are not combustible tobacco products, such as heat-not-burn,  e-vapor, and oral products, as well as consumer accessories. Net revenues related to wellness and healthcare refer to the operating revenues generated from the sale of products, primarily associated with inhaled therapeutics, and oral and intra-oral delivery systems. \nPMI's heat-not-burn products include licensed KT&G heat-not-burn products. \nReferences to \"Cost/Other\" in the Consolidated Financial Summary table of total PMI and the four segments throughout this \n\"Discussion and Analysis\"\n reflects the currency and acquisition/divestiture-neutral variances of: cost of sales (excluding the volume/mix cost component); marketing, administration and research costs (including restructuring charges); and amortization and impairment of intangibles. “Cost/Other” also includes the currency and acquisition/divestiture-neutral net revenue variance, unrelated to volume/mix and price components, attributable to: fees for certain distribution rights billed to customers in certain markets in the SSEA, CIS & MEA Region.  \nOur shipment volume for cigarettes, HTUs and Oral SFP is shown in the table below: \nShipment Volume\n \nFor the Nine Months Ended September 30,\nFor the Three Months Ended September 30,\nCigarettes and Heated Tobacco Units (million units)\n2025\n2024\nChange\n2025\n2024\nChange\nCigarettes\n457,941 \n464,047 \n(1.3)\n%\n157,940 \n163,238 \n(3.2)\n%\nHeated Tobacco Units\n116,735 \n104,025 \n12.2 \n%\n40,836 \n35,347 \n15.5 \n%\nTotal Cigarettes and Heated Tobacco Units\n574,676 \n568,072 \n1.2 \n%\n198,776 \n198,585 \n0.1 \n%\nOral SFP Volume (million cans) \n(1)\nNicotine Pouches\n662.7 \n460.2 \n44.0 \n%\n224.6 \n164.6 \n36.4 \n%\nSnus\n176.0 \n181.5 \n(3.0)\n%\n56.2 \n61.3 \n(8.2)\n%\nMoist Snuff\n98.7 \n102.6 \n(3.9)\n%\n31.6 \n34.1 \n(7.2)\n%\nOther Oral SFP \n(2)\n2.1 \n2.7 \n(23.0)\n%\n0.8 \n0.7 \n9.8 \n%\nTotal Oral Products\n939.5 \n747.0 \n25.8 \n%\n313.2 \n260.7 \n20.2 \n%\n(1)\n Excluding snuff, snuff leaf and U.S. chewing tobacco\n(2)\n Includes chew bags and tobacco bits\nNote: Sum may not foot due to rounding\nFollowing the deconsolidation of our Canadian subsidiary, we continue to report the volume and corresponding royalty revenues of brands sold by RBH for which other PMI subsidiaries are the trademark owners. These include \nNext, TEREA\n and \nVEEV\n. The volume and corresponding royalty revenues of these brands sold by RBH were not material to PMI for all periods presented.\nTotal shipment volume is defined as the combined total of cigarette, heated tobacco, oral smoke-free products (excluding snuff, snuff leaf and U.S. chew) and e-vapor shipment volume in equivalent units, unless otherwise stated.\nHeated tobacco units (\"HTUs\") is the term we use to refer to heated tobacco consumables, which include our \nBLENDS\n, \nDELIA\n, \nHEETS\n,\n HEETS Creations \n(defined collectively as \nHEETS\n), \nSENTIA\n,\n TEREA,\n \nTEREA CRAFTED \nand\n TEREA Dimensions,\n as well as the KT&G-licensed brands, \nFiit\n and \nMiix\n (outside of South Korea). HTUs also include zero tobacco heat-not-burn consumables (\nLEVIA\n). \n \nOral smoke-free product volume excludes snuff, snuff leaf and U.S. chew and is measured in cans or, for the purposes of total shipment volumes, in pouches or pouch equivalents. \n \nUnless otherwise stated, market share for HTUs is defined as the in-market sales volume for HTUs as a percentage of the total estimated industry sales volume for cigarettes and HTUs.  \n66\nTable of Contents\nReferences to total industry (or total market), our shipment volume and our market share performance reflect cigarettes and heated tobacco units, unless otherwise stated.\nConsumer offtake or offtake is the term PMI uses to refer to an approximation of purchases by consumers based on various market specific sources.\nTotal industry volume, PMI in-market sales volume and PMI market share for the following geographies include the cigarillo category in Japan: the total international market, EA, AU & PMI GTR Region, and Japanese domestic market. \nIn-market sales (\"IMS\") is defined as sales to the trade channels, which serve the end legal age nicotine users. Depending on the market and distribution model, IMS may represent an estimate. Consequently, past reported periods may be updated to ensure comparability and to incorporate the most current information. \nAdjusted market share for HTUs is defined as the total in-market sales volume for PMI HTUs as a percentage of the total estimated sales volume for cigarettes and HTUs, excluding the impact of estimated distributor and wholesaler inventory movements.  \nReferences to total international market, defined as worldwide cigarette and heated tobacco unit volume excluding the United States, total industry (or total market) and market shares throughout this \n\"Discussion and Analysis\"\n \nare our estimates for tax-paid products based on data from a number of internal and external sources and may, in defined instances, exclude China. Past reported periods may be updated to ensure comparability and to incorporate the most current information for industry and market share reporting. \nFrom time to time, PMI’s shipment volumes and IMS are subject to the impact of distributor inventory movements (or wholesaler inventory movements in certain markets where PMI does not sell to distributors), and estimated total industry/market volumes are subject to the impact of inventory movements in various trade channels that include estimated trade inventory movements of PMI’s competitors arising from market-specific factors that significantly distort reported volume disclosures. Such factors may include changes to the manufacturing supply chain, shipment methods, consumer demand, timing of excise tax increases or other influences that may affect the timing of sales to customers. In such instances, in addition to reviewing PMI shipment volumes, IMS, certain estimated total industry/market volumes and estimated market shares on a reported basis, management reviews these measures on an adjusted basis that excludes the impact of distributor and/or estimated trade inventory movements.  Management also believes that disclosing PMI's shipment volumes, IMS, and estimated total industry/market volumes and estimated market shares in such circumstances on a basis that excludes the impact of distributor and/or estimated trade inventory movements improves the comparability of performance and trends for these measures over different reporting periods.  \n67\nTable of Contents\nKey market data regarding total market size, our shipments and market share of cigarettes and heated tobacco units are shown  in the tables below:  \nFor the Nine Months Ended September 30,\nPMI Shipments (billion units)\nPMI Market Share \n(2)\n %\nMarket\nCigarettes & HTU Market (billion units)\nCigarettes & HTU\nCigarette\nHTU\nCigarettes & HTU\nHTU\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nTotal \n(1) (2)\n1,925.9\n1,939.2\n574.7\n568.1\n457.9\n464.0\n116.7\n104.0\n29.3\n28.9\n5.8\n5.2\nEurope\nFrance\n18.1\n19.8\n7.4\n8.3\n7.3\n8.2\n0.1\n0.1\n40.2\n41.0\n0.5\n0.6\nGermany \n(3)\n52.8\n53.0\n19.5\n20.1\n15.9\n17.0\n3.6\n3.1\n37.7\n38.7\n7.0\n6.0\nItaly \n(3)\n55.8\n55.7\n29.6\n29.0\n19.7\n20.9\n10.0\n8.1\n53.5\n53.7\n18.1\n17.0\nPoland \n(3)\n39.5\n44.5\n17.7\n19.4\n14.0\n15.4\n3.8\n4.0\n44.8\n43.3\n9.7\n9.0\nSpain\n32.8\n33.3\n10.1\n9.9\n9.0\n9.0\n1.0\n0.9\n29.4\n29.2\n3.3\n2.7\nSSEA, CIS & MEA\nEgypt\n64.3\n60.3\n19.5\n18.5\n18.4\n17.4\n1.0\n1.1\n30.2\n30.4\n1.9\n1.9\nIndonesia \n(4)\n192.3\n199.7\n59.4\n60.5\n58.4\n59.7\n1.1\n0.8\n30.9\n30.3\n0.5\n0.4\nPhilippines\n34.7\n33.7\n16.4\n15.8\n16.1\n15.6\n0.3\n0.2\n47.4\n46.9\n1.0\n0.6\nRussia\n164.1\n161.7\n53.1\n51.9\n38.5\n38.9\n14.6\n13.0\n31.9\n32.1\n9.2\n8.5\nTurkey\n118.2\n111.9\n55.5\n57.8\n55.5\n57.8\n—\n—\n47.1\n51.6\n—\n—\nEA, AU & PMI GTR\nAustralia\n2.3\n4.0\n0.8\n1.4\n0.8\n1.4\n—\n—\n35.0\n35.8\n—\n—\nJapan \n(2) (3)\n112.2\n112.2\n54.6\n51.1\n12.4\n12.6\n42.1\n38.5\n42.8\n41.1\n31.8\n29.5\nSouth Korea\n51.9\n52.9\n10.7\n10.6\n5.8\n6.3\n4.9\n4.3\n20.5\n20.0\n9.3\n8.0\nAmericas\nArgentina\n19.9\n19.1\n12.6\n11.8\n12.6\n11.8\n—\n—\n63.6\n61.9\n—\n—\nMexico\n20.8\n22.0\n12.0\n12.9\n11.8\n12.8\n0.2\n0.2\n57.8\n58.6\n1.0\n0.7\n(1) Market share estimates are calculated using IMS data, unless otherwise stated. Depending on the market and distribution model, IMS may represent an estimate. Consequently, past reported periods may be updated to ensure comparability and to incorporate the most current information.\n(2) Total market and market share estimates include cigarillos in Japan\n(3) PMI market share reflects estimated adjusted IMS volume share; Total Market is based on reported IMS\n(4) 2025 includes 6.4 billion units of cigarettes shipment volume under an arrangement where PMI acts as brand management and fulfillment services agent\n68\nTable of Contents\nFor the Three Months Ended September 30,\nPMI Shipments (billion units)\nPMI Market Share \n(2)\n %\nMarket\nCigarettes & HTU Market (billion units)\nCigarettes & HTU\nCigarette\nHTU\nCigarettes & HTU\nHTU\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nTotal \n(1)\n \n(2)\n668.5\n673.8\n198.8\n198.6\n157.9\n163.2\n40.8\n35.3\n29.5\n29.6\n5.8\n5.3\nEurope\nFrance\n6.2\n6.8\n2.3\n2.4\n2.3\n2.4\n—\n—\n40.1\n41.0\n0.5\n0.6\nGermany \n(3)\n18.9\n19.7\n6.6\n7.0\n5.4\n5.9\n1.2\n1.1\n36.7\n37.6\n6.5\n5.8\nItaly \n(3)\n19.9\n20.1\n10.8\n10.5\n6.7\n7.2\n4.1\n3.3\n53.9\n54.9\n18.2\n16.6\nPoland \n(3)\n13.9\n15.4\n6.4\n6.9\n5.0\n5.5\n1.4\n1.3\n45.5\n43.9\n9.5\n8.6\nSpain\n12.2\n12.3\n3.4\n3.6\n3.0\n3.2\n0.4\n0.4\n29.6\n29.6\n3.3\n2.7\nSSEA, CIS & MEA\nEgypt\n21.8\n21.6\n6.8\n6.5\n6.3\n6.0\n0.5\n0.5\n32.0\n30.2\n2.1\n1.9\nIndonesia \n(4)\n65.8\n67.6\n20.2\n20.7\n19.8\n20.3\n0.4\n0.3\n30.7\n30.6\n0.6\n0.5\nPhilippines\n11.5\n11.3\n5.4\n5.3\n5.3\n5.2\n0.1\n0.1\n46.9\n46.5\n1.1\n0.7\nRussia\n59.8\n59.8\n18.4\n19.0\n13.2\n14.5\n5.2\n4.6\n31.2\n32.3\n8.7\n7.9\nTurkey\n42.4\n41.4\n19.8\n21.4\n19.8\n21.4\n—\n—\n46.7\n51.8\n—\n—\nEA, AU & PMI GTR\nAustralia\n0.5\n1.3\n0.2\n0.5\n0.2\n0.5\n—\n—\n27.9\n37.2\n—\n—\nJapan \n(2) (3)\n38.8\n38.6\n17.7\n15.7\n4.3\n4.2\n13.4\n11.5\n42.6\n41.3\n31.7\n29.9\nSouth Korea\n18.7\n18.2\n3.8\n3.7\n2.1\n2.2\n1.7\n1.5\n20.3\n19.9\n9.1\n8.2\nAmericas\nArgentina\n6.5\n6.1\n4.1\n3.9\n4.1\n3.9\n—\n—\n64.0\n62.7\n—\n—\nMexico\n6.9\n7.8\n4.0\n4.6\n3.9\n4.5\n0.1\n0.1\n57.5\n58.6\n1.1\n0.6\n(1) Market share estimates are calculated using IMS data, unless otherwise stated. Depending on the market and distribution model, IMS may represent an estimate. Consequently, past reported periods may be updated to ensure comparability and to incorporate the most current information.\n(2) Total market and market share estimates include cigarillos in Japan\n(3) PMI market share reflects estimated adjusted IMS volume share; Total Market is based on reported IMS\n(4) 2025 includes 2.4 billion units of cigarettes shipment volume under an arrangement where PMI acts as brand management and fulfillment services agent\nConsolidated Operating Results for the Nine Months Ended September 30, 2025\n \nThe following discussion compares our consolidated operating results for the nine months ended September 30, 2025, with the nine months ended September 30, 2024.\nTotal Market  \n \nEstimated industry volume (excluding China and the U.S.) for cigarettes and HTUs decreased by 0.7%.  \nFor the full year 2025, we currently expect an estimated total international industry volume decline of around 1% for cigarettes and HTUs, excluding China and the U.S.   \n69\nTable of Contents\nTotal Shipment Volume  \nNine Months Ended September 30, 2025\n \nTotal PMI\nSFP\nHTU\nOral SFP\nE-vapor\nCigarettes\nTotal Shipment Volume \n(equivalent units in billions)\n592.7\n134.8\n116.7\n15.7\n2.4\n457.9\nvs. September YTD 2024\n1.8%\n14.3%\n12.2%\n22.5%\n+100%\n(1.3)%\nOral smoke-free products conversion: (i) nicotine pouches: 15 pouches per can in the U.S. and approximately 20 pouches per can outside the U.S.; (ii) snus products: weighted average 21 pouches equivalent per can; (iii) moist snuff products: weighted average 17 pouches equivalent per can; (iv) tobacco bits products: weighted average 30 pouches equivalent per can; (v) chew bags products: weighted average 20 pouches per can.\n \nE-vapor products conversion: one milliliter of e-vapor liquid equivalent to 10 units.  \nShipment Volume   \nOur shipment volume, including cigarettes and smoke-free products (in equivalent units), increased by 1.8% with smoke-free volumes up by 14.3%, with all SFP categories growing strongly, and cigarette volumes down by 1.3%.  \nFor the full year 2025, we currently expect total cigarette and smoke-free product shipment volume growth for PMI of around 1%. We expect smoke-free product volume growth of 12% to 14% with growth of smoke-free shipments more likely to be in the lower half of this range, partly offset by cigarette volume declines of around 2%. Smoke-free products volume growth continues to assume 10% to 12% growth in HTU adjusted IMS volumes, and U.S. nicotine pouch second-half shipment growth broadly in-line with offtake growth before trade inventory movements.\nIn the U.S., the increase in \nZYN\n nicotine pouch shipments in the third quarter was a result of underlying consumer offtake growth amplified by a wide range of commercial activities to further enhance the strength and presence of the brand, and ensure competitive price positioning following several quarters of reduced activity due to supply constraints.  In addition, we implemented select short-term promotions, which separately accounted for a single digit percentage of our third quarter shipments. On a more short-term basis, we continue to expect second half shipment volume growth broadly in line with consumer offtake growth before channel inventory movements. We anticipate a 20 to 30 million can inventory reduction in the coming months, this impact being effectively delayed from the third quarter given strong September promotional activity. \nInternational Share of Market - Cigarette and HTUs (Excluding China and the United States)  \nNine Months Year-to-Date\n2025\n2024\nChange (pp)\nTotal International Market Share \n(1)\n \n29.3\n \n%\n28.9\n \n%\n0.4\n \nCigarettes\n23.5 \n%\n23.7 \n%\n(0.2)\nHTU\n5.8 \n%\n5.2 \n%\n0.6 \nCigarette over Cigarette Market Share \n(2)\n25.4 \n%\n25.5 \n%\n(0.1)\n(1) Defined as PMI's cigarette and heated tobacco unit in-market sales volume as a percentage of total industry cigarette and heated tobacco unit sales volume, excluding China and the U.S., including cigarillos in Japan\n(2) Defined as PMI's cigarette in-market sales volume as a percentage of total industry cigarette sales volume, excluding China and the U.S., including cigarillos in Japan\nNote: Sum of share of market by product categories might not foot to total due to rounding\n70\nTable of Contents\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nNine Months Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n30,286 \n$ \n28,172 \n7.5 \n%\n7.5 \n%\n$\n2,114 \n$\n116 \n$\n(126)\n$\n1,251 \n$\n847 \n$\n26 \nCost of Sales\n(9,806)\n(9,906)\n1.0 \n%\n0.4 \n%\n100 \n(63)\n128 \n— \n162 \n(127)\nMarketing, Administration and Research Costs \n(1)\n(8,920)\n(8,123)\n(9.8)\n%\n(11.6)\n%\n(797)\n61 \n82 \n— \n— \n(940)\nImpairment of Goodwill\n(41)\n— \n— \n%\n— \n%\n(41)\n— \n— \n— \n— \n(41)\nOperating Income\n$ \n11,519 \n$ \n10,143 \n13.6 \n%\n11.6 \n%\n$\n1,376 \n$\n114 \n$\n84 \n$\n1,251 \n$\n1,009 \n$\n(1,082)\n(1)\n Cost/Other variance includes charges in 2025 of $243 million related to restructuring charges, $176 million related to Germany excise tax classification litigation and higher amortization of intangibles in 2025, partly offset by charges in 2024 of $168 million related to restructuring charges, $27 million related to impairment of other intangibles, $198 million related to the loss on sale of Vectura Group and $45 million related to the Egypt sales tax charge. For more details, see Note 2. \nAcquisitions and Divestitures\n, Note 5. \nGoodwill and Other Intangible Assets, net\n, Note 8, \nSegment Reporting, \nNote 9.\n Contingencies\n and Note 16. \nRestructuring Activities\n.\nFor the nine months ended September 30, 2025, net revenues increased by 7.5%. Net revenues, excluding currency and acquisitions/divestitures, also increased by 7.5%, mainly reflecting: a favorable pricing variance due to higher combustible tobacco pricing; and favorable volume/mix driven by higher smoke-free products volume, notwithstanding unfavorable mix and lower cigarette volumes.\nThe favorable currency impact in net revenues was due primarily to the Euro and Russian ruble, partly offset by the Mexican pesos and Indonesian rupiah. \nNet revenues include $12.5 billion in 2025 and $10.8 billion in 2024 related to smoke-free.    \nOperating income increased by 13.6%. Operating income, excluding currency and acquisitions/divestitures, increased by 11.6%, mainly reflecting: the same factors as for net revenues, as well as a favorable comparison to 2024 reflecting a charge of $198 million related to the loss on sale of Vectura Group in 2024 and $45 million related to the Egypt sales tax charge in 2024, partly offset by higher marketing, administration and research costs, higher manufacturing costs, higher restructuring charges in 2025, the impairment of goodwill charge in 2025 and higher amortization of intangibles in 2025, as well as the 2025 Germany excise tax classification litigation charge of $176 million. \nInterest expense, net, of $748 million decreased by $69 million or 8.4%, primarily due to a lower weighted average cost of debt.  \nOur effective tax rate decreased by 3.9 percentage points to 19.2%. We estimate that our 2025 effective tax rate will be approximately 22%, excluding discrete tax events.  For further details, see Note 10. \nIncome Taxes\n.  \nNet earnings attributable to PMI of $9.2 billion increased by $1.6 billion or 20.6%. This increase was due primarily to higher operating income, a lower effective tax rate and lower interest expense, net. Basic and diluted EPS of $5.90 and $5.89 both increased by 20.4%. Excluding a favorable currency impact of $0.02, diluted EPS increased by 20.0%. \nConsolidated Operating Results for the Three Months Ended September 30, 2025\n \nThe following discussion compares our consolidated operating results for the three months ended September 30, 2025, with the three months ended September 30, 2024.  \nTotal Market  \nDuring the quarter, estimated industry volume (excluding China and the U.S.) for cigarettes and HTUs decreased by 0.8%.  \n71\nTable of Contents\nTotal Shipment Volume    \nQuarters Ended September 30, 2025\nTotal PMI\nSFP\nHTU\nOral SFP\nE-vapor\nCigarettes\nTotal Shipment Volume \n(equivalent units in billions)\n204.9\n46.9\n40.8\n5.2\n0.9\n157.9\nvs. Q3 2024\n0.7%\n16.6%\n15.5%\n16.9%\n91.0%\n(3.2)%\nOral smoke-free products conversion: (i) nicotine pouches: 15 pouches per can in the U.S. and approximately 20 pouches per can outside the U.S.; (ii) snus products: weighted average 21 pouches equivalent per can; (iii) moist snuff products: weighted average 17 pouches equivalent per can; (iv) tobacco bits products: weighted average 30 pouches equivalent per can; (v) chew bags products: weighted average 20 pouches per can.\n \nE-vapor products conversion: one milliliter of e-vapor liquid equivalent to 10 units.  \nOur shipment volume, including cigarettes and smoke-free products (in equivalent units), increased by 0.7% with smoke-free volumes up by 16.6%, with all SFP categories growing strongly, and cigarette volumes down by 3.2% with declines in all regions.  \nInternational Share of Market - Cigarette and HTUs  (Excluding China and the United States)    \nThird-Quarter\n2025\n2024\nChange (pp)\nTotal International Market Share \n(1)\n \n29.5\n \n%\n29.6\n \n%\n(0.1)\nCigarettes\n23.7 \n%\n24.3 \n%\n(0.6)\nHTU\n5.8 \n%\n5.3 \n%\n0.5 \nCigarette over Cigarette Market Share \n(2)\n25.6 \n%\n26.1 \n%\n(0.5)\n(1) Defined as PMI's cigarette and heated tobacco unit in-market sales volume as a percentage of total industry cigarette and heated tobacco unit sales volume, excluding China and the U.S., including cigarillos in Japan\n(2) Defined as PMI's cigarette in-market sales volume as a percentage of total industry cigarette sales volume, excluding China and the U.S., including cigarillos in Japan\nNote: Sum of share of market by product categories might not foot to total due to rounding\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nQuarters Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n \n$ \n10,845 \n$ \n9,911 \n9.4 \n%\n5.9 \n%\n$\n934 \n$\n385 \n$\n(38)\n$\n305 \n$\n245 \n$\n37 \nCost of Sales\n(3,487)\n(3,366)\n(3.6)\n%\n(0.4)\n%\n(121)\n(143)\n36 \n— \n13 \n(27)\nMarketing, Administration and Research Costs \n(1)\n(3,095)\n(2,891)\n(7.1)\n%\n(6.2)\n%\n(204)\n(46)\n20 \n— \n— \n(178)\nOperating Income\n$ \n4,263 \n$ \n3,654 \n16.7 \n%\n10.8 \n%\n$\n609 \n$\n196 \n$\n18 \n$\n305 \n$\n258 \n$\n(168)\n(1)\n Cost/Other variance includes charges in 2025 of $176 million related to Germany excise tax classification litigation, partly offset by charges in 2024 of $198 million related to the loss on sale of Vectura Group and $45 million related to the Egypt sales tax charge. For more details, see Note 2. \nAcquisitions and Divestitures\n, Note 8, \nSegment Reporting \nand Note 9.\n Contingencies\n.\nDuring the quarter, net revenues increased by 9.4%. Net revenues, excluding currency and acquisitions/divestitures, increased by 5.9%, mainly reflecting: a favorable pricing variance due to higher combustible tobacco pricing; and favorable volume/mix driven by higher smoke-free products volume, notwithstanding lower volumes and unfavorable mix for cigarettes.\n72\nTable of Contents\nThe favorable currency impact in net revenues was due primarily to the Euro, Russian ruble, Polish zloty and Swiss franc.  \nNet revenues include $4.4 billion in 2025 and $3.8 billion in 2024 related to smoke-free. \n \nOperating income increased by 16.7%. Operating income, excluding currency and acquisitions/divestitures, increased by 10.8%, mainly reflecting: the same factors as for net revenues, as well as a favorable comparison to 2024 reflecting a charge of $198 million related to the loss on sale of Vectura Group in 2024 and $45 million related to the Egypt sales tax charge in 2024; partly offset by higher marketing, administration and research costs and the 2025 Germany excise tax classification litigation charge of $176 million. \nInterest expense, net, of $230 million increased by $41 million or 21.7%, primarily due to the impact of derivative financial instruments.\nOur effective tax rate decreased by 2.6 percentage points to 18.7%. For further details, see Note 10. \nIncome Taxes\n.  \nIncome from equity investments and securities, net, decreased by $155 million, primarily due to a lower fair value adjustment for our equity security investments in India and Sri Lanka, the impairment of our Wellness & Healthcare related equity investment in 2025 and the decrease in the carrying value of the RBH investment, partly offset by dividend income received from RBH. For further details, Note 13. \nRelated Parties - Equity Investments and Other\n.\nNet earnings attributable to PMI of $3.5 billion increased by $0.4 billion or 12.8%. This increase was due primarily to higher operating income, partly offset by lower income from equity investments and securities, net. Basic and diluted EPS of $2.23 increased by 12.6% and 13.2%, respectively. Excluding a favorable currency impact of $0.08, diluted EPS increased by 9.1%.  \nOperating Results by Business Segment\nSegment Operating Results – Three Months and Nine Months Ended September 30, 2025  \nThe following discussion compares operating results within each of our segments for the three months and nine months ended September 30, 2025, with the three months and nine months ended September 30, 2024.\nEurope:\n \n \nFinancial Summary\nQuarters Ended September 30,\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n4,719 \n$ \n4,197 \n12.4 \n%\n6.4 \n%\n$\n522 \n$\n291 \n$\n(38)\n$\n220 \n$\n49 \n$\n— \nOperating Income\n$ \n2,150 \n$ \n1,769 \n21.5 \n%\n11.4 \n%\n$\n381 \n$\n162 \n$\n18 \n$\n220 \n$\n10 \n$\n(29)\nDuring the quarter, net revenues increased by 12.4%. Net revenues, excluding currency and acquisitions/divestitures, increased by 6.4%, reflecting: a favorable pricing variance driven by higher combustible tobacco pricing, and favorable volume/mix driven by higher smoke-free products volume, notwithstanding lower volumes and unfavorable mix for cigarettes.\nOperating income increased by 21.5%. Operating income, excluding currency and acquisitions/divestitures, increased by 11.4%, mainly due to the same factors as for net revenues and a favorable comparison to 2024 reflecting a charge of $198 million related to the loss on sale of Vectura Group in 2024, partly offset by the 2025 Germany excise tax classification litigation charge of $176 million. \n73\nTable of Contents\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nNine Months Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n12,513 \n$ \n11,547 \n8.4 \n%\n7.4 \n%\n$\n966 \n$\n241 \n$\n(126)\n$\n647 \n$\n204 \n$\n— \nOperating Income\n$ \n5,255 \n$ \n4,797 \n9.5 \n%\n4.5 \n%\n$\n458 \n$\n187 \n$\n53 \n$\n647 \n$\n97 \n$\n(526)\nFor the nine months ended September 30, 2025, net revenues increased by 8.4%.  Net revenues, excluding currency and acquisitions/divestitures, increased by 7.4%, reflecting a favorable price variance, predominantly due to higher combustible tobacco pricing; and favorable volume/mix, driven by higher smoke-free products volume, notwithstanding lower volumes and unfavorable mix for cigarettes.\nThe pricing variance for 2024 and 2025 was negatively impacted by the supplemental tax surcharge on heated tobacco products (\"HTPs\") in Germany, which went into effect in 2022. On March 14, 2024, the Court of Justice of the European Union (the \"CJEU\") ruled that the German fiscal regulation imposing an additional excise tax on HTPs does not contravene EU law. On May 15, 2024, following the decision issued by CJEU, the Fiscal Court in Dusseldorf (the \"FCD\") also ruled that the German fiscal regulation imposing an additional excise tax on HTPs does not contravene EU law. The FCD admitted an appeal to the Federal Tax Court. On June 19, 2024, PMI submitted an appeal. The negative impact will continue, at least until the appeal ruling on the legality of the surcharge is concluded. PMI currently accounts for the surcharge as a reduction in net revenues, with amounts withdrawn before May 15, 2024, currently under a payment suspension. Despite this payment suspension and, in order to avoid the future addition of interest, PMI elected, on January 14, 2025, to pay the amount outstanding of EUR 721 million (approximately $751 million), excluding accrued interest. An unfavorable outcome to the appeal would negatively impact PMI’s future cash provided by operating activities for the amounts of unpaid interest. A favorable outcome to the appeal would positively impact future PMI’s operating results and future cash provided by operating activities for the amounts paid in January 2025.  \nOperating income increased by 9.5%. Operating income, excluding currency and acquisitions/divestitures, increased by 4.5%, primarily reflecting: the same factors as for net revenues and a favorable comparison to 2024 reflecting a charge of $198 million related to the loss on sale of Vectura Group in 2024; partly offset by higher marketing, administration and research costs, as well as the 2025 Germany excise tax classification litigation charge of $176 million and the 2025 restructuring charges of $243 million. \nEurope - Total Market and PMI Shipment Volume  \nIn the third quarter, the estimated market for cigarettes and HTUs decreased by 4.8% to 141.9 billion units, with a 6.3% decrease for cigarettes and continued HTU growth. Markets with notable decreases include Ukraine (down by 15.0%), Poland (down by 9.7%), and United Kingdom (down by 17.0%).\nFor the nine months year-to-date, the estimated market for cigarettes and HTUs decreased by 3.5% to 397.3 billion units, with a 5.1% decrease for cigarettes and continued HTU growth.    \n74\nTable of Contents\nIn the third quarter, our shipment volume (in equivalent units) decreased by 2.2% with cigarettes down by 6.8% and SFP up by 10.5%. \nFor the nine months year-to-date, our shipment volume (in equivalent units) decreased by 1.2% with cigarettes down by 6.0% and SFP up by 12.2%.  \nIn the third quarter, our cigarette and HTU shipment volume decreased by 2.6% to 56.4 billion units, predominantly due to decreases in Poland (down by 6.8%),  Germany (down by 5.1%), and Ukraine (down by 8.6%) driven by cigarette shipments.\nIn the third quarter, our HTUs share of the total cigarette and HTU market increased by 1.2 points on an adjusted basis.\nFor the nine months year-to-date, our cigarette and HTU shipment volume decreased by 1.8% to 159.9 billion, with decreases in Poland (down by 8.4%), France (down by 10.7%) and Germany (down by 3.0%) driven by cigarette shipments. \nFor the nine months year-to-date, our HTU share of the total cigarette and HTU market increased by 1.2 points on an adjusted basis. \n75\nTable of Contents\nOther Oral SFP includes chew bags and tobacco bits \nNote: Sum may not foot due to rounding.\nIn the third quarter, oral SFP shipments decreased by 10.0% to 65.2 million cans. \nFor the nine months year-to-date, oral SFP shipments decreased by 4.2% to 208.1 million cans.\nSSEA, CIS & MEA:\n \n \nFinancial Summary\nQuarters Ended September 30,\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n3,273 \n$ \n2,964 \n10.4 \n%\n7.8 \n%\n$\n309 \n$\n77 \n$\n— \n$\n254 \n$\n(62)\n$\n40 \nOperating Income\n$ \n1,235 \n$ \n960 \n28.6 \n%\n23.5 \n%\n$\n275 \n$\n49 \n$\n— \n$\n254 \n$\n26 \n$\n(54)\nDuring the quarter, net revenues increased by 10.4%. Net revenues, excluding currency and acquisitions/divestitures, increased by 7.8%, primarily reflecting: a favorable pricing variance, predominantly driven by higher combustible tobacco pricing; while higher SFP volume was more than offset by unfavorable cigarette mix due to the below mentioned commercial model change in Indonesia.\nA change in our commercial model for the below tier-one cigarette segment in Indonesia in the fourth quarter of 2024 resulted in lower net revenue growth, with no meaningful impact on operating income. \nOperating income increased by 28.6%. Operating income, excluding currency and acquisitions/divestitures, increased by 23.5%, mainly reflecting a favorable price variance (predominantly driven by higher combustible tobacco pricing) and a favorable comparison to 2024 reflecting a charge of $45 million related to the Egypt sales tax charge in 2024, partly offset by higher marketing, administration and research costs.\n76\nTable of Contents\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nNine Months Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n8,942 \n$ \n8,393 \n6.5 \n%\n6.4 \n%\n$\n549 \n$\n8 \n$\n— \n$\n596 \n$\n(92)\n$\n37 \nOperating Income\n$ \n3,155 \n$ \n2,623 \n20.3 \n%\n18.7 \n%\n$\n532 \n$\n11 \n$\n31 \n$\n596 \n$\n160 \n$\n(266)\nFor the nine months ended September 30, 2025, net revenues increased by 6.5%. Net revenues, excluding currency and acquisitions/divestitures, increased by 6.4%, mainly reflecting: a favorable price variance, predominantly driven by combustible tobacco pricing; while unfavorable cigarette mix due to below mentioned commercial model change in Indonesia was largely offset by higher cigarette and SFP volume.\nA change in our commercial model for the below tier-one cigarette segment in Indonesia in the fourth quarter of 2024 resulted in lower net revenue growth, with no meaningful impact on operating income.  \nOperating income increased by 20.3%. Operating income, excluding currency and acquisitions/divestitures, increased by 18.7%, primarily reflecting: a favorable price variance, as well as higher cigarette and SFP volume and a favorable comparison to 2024 reflecting a charge of $45 million related to the Egypt sales tax charge in 2024, partly offset by higher marketing, administration and research costs, as well as manufacturing costs (notably tobacco leaf).\nSSEA, CIS & MEA - Total Market and PMI Shipment Volume \nIn the third quarter, the estimated market for cigarettes and HTUs increased by 1.2% to 399.9 billion units, mainly due to Bangladesh (up by 23.5%), India (up by 9.1%), and Turkey (up by 2.5%), partly offset by Vietnam (down by 8.3%) and Indonesia (down by 2.7%).\nFor the nine months year-to-date, the estimated market for cigarettes and HTUs was broadly stable at 1,156.8 billion units.   \nIn the third quarter, our shipment volume (in equivalent units) increased by 0.7% with SFP up by 23.3%, and cigarettes down by 1.1%.   \nFor the nine months year-to-date, our shipment volume (in equivalent units) increased by 2.1% with SFP up by 15.8% and cigarettes up by 1.0%.  \n77\nTable of Contents\nIn the third quarter, our cigarette and HTU shipment volume increased by 0.6% to 99.2 billion units, with increases in India (up by 37.2%) and Saudi Arabia (up by 22.7%), partly offset by Turkey (down by 7.7%) and Indonesia (down by 2.5%).\nIn the third quarter, our HTU adjusted in-market sales volume, fueled by broad growth across the region, increased by an estimated 13.3%.  \nFor the nine months year-to-date, our cigarette and HTU shipment volume increased by 2.0% to 284.7 billion units, mainly driven by India (up by 42.0%) and Egypt (up by 5.4%), partly offset by Turkey (down by 3.9%) and Indonesia (down by 1.9%).  \nFor the nine months year-to-date, our HTU adjusted in-market sales volume increased by an estimated 14.6%.\nEA, AU & PMI GTR:\n \nFinancial Summary\nQuarters Ended September 30,\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ 1,768\n$ 1,602\n10.4 \n%\n8.9 \n%\n$\n166 \n$\n23 \n$\n— \n$\n35 \n$\n108 \n$\n— \nOperating Income\n$ 846\n$ 788\n7.4 \n%\n11.9 \n%\n$\n58 \n$\n(36)\n$\n— \n$\n35 \n$\n86 \n$\n(27)\nDuring the quarter, net revenues increased by 10.4%. Net revenues, excluding currency and acquisitions/divestitures, increased by 8.9%, predominantly reflecting a favorable volume/mix, driven by higher smoke-free products volume.\nOperating income increased by 7.4%. Operating income, excluding currency and acquisitions/divestitures, increased by 11.9%, mainly due to the same factor as for net revenues. \n78\nTable of Contents\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nNine Months Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n5,207 \n$ \n4,959 \n5.0 \n%\n5.6 \n%\n$\n248 \n$\n(30)\n$\n— \n$\n68 \n$\n210 \n$\n— \nOperating Income\n$ \n2,612 \n$ \n2,304 \n13.4 \n%\n14.7 \n%\n$\n308 \n$\n(31)\n$\n— \n$\n68 \n$\n270 \n$\n1 \nFor the nine months ended September 30, 2025, net revenues increased by 5.0%. Net revenues, excluding currency and acquisitions/divestitures, increased by 5.6%, mainly reflecting favorable volume/mix, driven by SFP volume and favorable price variance, driven by higher combustible tobacco pricing.\nOperating income increased by 13.4%. Operating income, excluding currency and acquisitions/divestitures, increased by 14.7%, reflecting the same factors as for net revenues.\nEA, AU & PMI GTR - Total Market and PMI Shipment Volume\nIn the third quarter, the estimated market for cigarettes and HTUs, excluding China, was broadly stable (82.5 billion units), with a decrease in cigarettes offset by HTU growth. Notable increases in South Korea (up by 2.6%) and Global Travel Retail (up by 4.6%) were offset by Australia (down by 59.2%) and Taiwan (down by 2.3%).\nFor the nine months year-to-date, the estimated market for cigarettes and HTUs, excluding China, decreased by 0.7%, with a decrease in cigarettes, largely offset by HTU growth.  \nIn the third quarter, our shipment volume (in equivalent units) increased by 7.1% with SFP up by 17.8%, and cigarettes down by 4.6%.  \nFor the nine months year-to-date, our shipment volume (in equivalent units) increased by 5.8% with SFP up by 12.1%, and cigarettes down by 2.1%. \nIn the third quarter, our cigarette and HTU shipment volume increased by 6.8% to 28.5 billion units with growth in Japan (up \n79\nTable of Contents\nby 12.5%) and South Korea (up by 4.5%), partly offset by Australia (down by 53.4%).\nIn the third quarter, our HTU adjusted in-market sales volume increased by an estimated 8.2%.  \nFor the nine months year-to-date, our cigarette and HTU shipment volume increased by 5.4% to 85.6 billion units, driven by Japan (up by 6.7%), partly offset by Australia (down by 43.9%). \nFor the nine months year-to-date, our HTU adjusted in-market sales volume increased by an estimated 9.6%.     \nAmericas:\n \nFinancial Summary\nQuarters Ended September 30,\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n1,085 \n$ \n1,148 \n(5.5)\n%\n(5.0)\n%\n$\n(63)\n$\n(6)\n$\n— \n$\n(204)\n$\n150 \n$\n(3)\nOperating Income\n$ \n32 \n$ \n137 \n(76.6)\n%\n(92.0)\n%\n$\n(105)\n$\n21 \n$\n— \n$\n(204)\n$\n136 \n$\n(58)\nDuring the quarter, net revenues decreased by 5.5%. Net revenues, excluding currency and acquisitions/divestitures, decreased by 5.0%, mainly reflecting an unfavorable price variance in the U.S., including the impact of special promotions to mark \nZYN\n's return to full availability, with all promotional costs including retailer incentives taken in net revenues.  This was partly offset by higher SFP volumes.\nOperating income decreased by 76.6%. Operating income, excluding currency and acquisitions/divestitures, decreased by 92.0%, primarily reflecting: the same factors as for net revenues; and higher marketing, administration and research costs.\nFinancial Summary\nChange\nFav./(Unfav.)\nVariance\nFav./(Unfav.)\nNine Months Ended September 30,\n2025\n2024\nTotal\nExcl.\nCurr. & Acquis. / Divest.\nTotal\nCur-\nrency\nAcqui-sitions / Dives-titures\nPrice\nVol/\nMix\nCost/\nOther\n(in millions)\nNet Revenues\n$ \n3,624 \n$ \n3,273 \n10.7 \n%\n13.9 \n%\n$\n351 \n$\n(103)\n$\n— \n$\n(60)\n$\n525 \n$\n(11)\nOperating Income\n$ \n497 \n$ \n419 \n18.6 \n%\n31.3 \n%\n$\n78 \n$\n(53)\n$\n— \n$\n(60)\n$\n482 \n$\n(291)\nFor the nine months ended September 30, 2025, net revenues increased by 10.7%. Net revenues, excluding currency and acquisitions/divestitures, increased by 13.9%, primarily reflecting: favorable volume/mix, driven by SFP volume and an unfavorable U.S. price variance largely offset by cigarette pricing outside of the U.S.\nOperating income increased by 18.6%. Operating income, excluding currency and acquisitions/divestitures, increased by 31.3%, mainly reflecting: the same factors as for net revenues, and a favorable comparison to 2024 reflecting the restructuring charges of $168 million in 2024; partly offset by higher marketing, administration and research costs, higher manufacturing costs and higher amortization of intangibles.  \nAmericas - Total Market and PMI Shipment Volume  \nIn the third quarter, the estimated market for cigarettes and HTUs, excluding the U.S., decreased by 6.2% to 44.1 billion units, driven by a decrease in the cigarette market. The decrease was mainly due to Brazil (down by 9.8%) and Mexico (down by 11.3%), partly offset by Argentina (up by 5.0%).\n80\nTable of Contents\nFor the nine months year-to-date, the estimated market for cigarettes and HTUs, excluding the U.S., decreased by 1.9% to 134.6 billion units driven by a decrease in the cigarette market. \nIn the third quarter, our shipment volume (in equivalent units) increased by 0.6% with SFP up by 26.9%, and cigarettes down by 4.7%.  \nFor the nine months year-to-date, our shipment volume (in equivalent units) increased by 4.2% with SFP up by 32.3% and cigarettes down by 1.2%.  \nIn the third quarter, our cigarette and HTU shipment volume decreased by 4.5% to 14.7 billion units, with decreases in Mexico (down by 12.8%) and Brazil (down by 9.6%), partly offset by increases in Argentina (up by 7.1%).\nFor the nine months year-to-date, our cigarette and HTU shipment volume decreased by 1.1% to 44.5 billion units, mainly due to Mexico (down by 6.8%), partly offset by Argentina (up by 6.7%).\n81\nTable of Contents\n(1) Excluding U.S. chew\nNote: U.S. travel retail volumes of approximately 5.2 million and 8.1 million nicotine pouch cans are recorded in the Americas segment for the third quarter and nine months year-to-date 2025, respectively, while financial impacts are recorded in the EA, AU & PMI GTR segment. There were no meaningful U.S. travel retail volumes in prior year.\nIn the third quarter, oral SFP shipments increased by 29.1% to 238 million cans, predominantly driven by \nZYN\n nicotine pouches in the U.S.  \nZYN\n growth in the U.S. was driven by underlying consumer offtake growth amplified by the impact of increased commercial activities and, separately, of special short-term promotions in select U.S. locations to mark \nZYN\n's return to full availability, which specifically accounted for a single digit percentage of our third quarter U.S. shipments.\nFor the nine months year-to-date, oral SFP shipments increased by 34.4% to 701 million cans, predominantly driven by \nZYN\n nicotine pouches in the U.S.   \nBusiness Environment       \nThe tobacco industry and our company face a number of challenges that may adversely affect our business, product sales volume, results of operations, cash flows and financial position. These challenges, which are discussed below and in \"\nCautionary Factors That May Affect Future Results\n\"\n \ninclude:\n•\nregulatory restrictions on our products, including restrictions on the packaging, marketing, registration and sale of tobacco or other nicotine-containing products or related devices that could reduce our competitiveness, eliminate our ability to communicate with adult consumers, or ban certain of our products;\n•\nfiscal challenges, such as excessive excise tax increases and discriminatory tax structures;\n•\nillicit trade in cigarettes and other tobacco and nicotine-containing products, including counterfeit, contraband and other non-compliant or otherwise illicit products; \n•\nintense competition, including unfair competition from non-tax paid volume by certain manufacturers; and\n•\nlegal challenges, including the pending and threatened litigation discussed in Part I, Item 1. \nFinancial Statements\n —  Note 9. \nContingencies \nin this report.\n82\nTable of Contents\nSmoke-Free Products (SFPs)     \nOur Approach to SFPs  \nWe recognize that smoking cigarettes causes serious diseases and that the best way to avoid the harm of smoking is to never start or to quit.  Nevertheless, according to WHO estimates, there are approximately one billion smokers globally. This number has not meaningfully changed in decades and, based on current trends, is not expected to significantly change in the near future. \nCigarettes burn tobacco, which produces smoke. As a result of the combustion process, the smoker inhales high levels of various toxic substances. In contrast, while SFPs contain nicotine, which is addictive and not risk-free, SFPs do not burn tobacco and therefore contain significantly lower levels of harmful and potentially harmful constituents (\"HPHCs\") than found in cigarette smoke. \nOur SFPs and commercial activities for these products are designed for, and directed toward, current adult smokers and adult users of nicotine-containing products. We put in significant effort to restrict access to our products from non-nicotine users and youth.  \nFor adult smokers who would otherwise continue to smoke cigarettes, we believe that SFPs, while not risk-free, offer a much better choice.  Accordingly, our key strategic priorities are to: (i) continue developing and commercializing products that have the potential to present less risk of harm to adult smokers who switch to such products versus continued cigarette smoking; and (ii) educate and encourage current adult smokers who would otherwise continue to smoke cigarettes to switch to those products. \nWe recognize that this transformation from cigarettes to SFPs will take time and that the rate of transformation will depend in part upon factors beyond our control, such as the willingness of governments, regulators, and other policy groups to embrace SFPs as a desirable alternative to continued cigarette smoking. As a leading international cigarette manufacturer, we will continue to accelerate this transformation by using our extensive commercial and distribution infrastructure as an effective platform for the commercialization of our SFPs and communication with adult smokers and trade partners about the substantiated benefits of switching to our SFPs. As long as a significant number of adult smokers continue to smoke cigarettes, responsible leadership of the category is critical. We aim to maintain our competitive position in the cigarette market through selective investment. We are judiciously reallocating resources from cigarettes to SFPs and are streamlining our cigarette portfolio. \nWe have a range of SFPs in various stages of development, scientific assessment, and commercialization.  We are committed to conducting rigorous scientific assessments of our SFPs to substantiate that they reduce exposure to HPHCs and, ultimately, that these products present, are likely to present, or have the potential to present less risk of harm to adult smokers who switch to SFPs versus continued cigarette smoking. We draw upon a team of expert scientists and engineers from a broad spectrum of scientific disciplines and our extensive learnings of adult consumer preferences to further develop and assess our SFPs. Our efforts are guided by the following key objectives:  \n•\nto develop SFPs as satisfying alternatives to smoking for adult smokers who would otherwise continue to smoke cigarettes; \n•\nfor those adult smokers, our goal is to develop and offer SFPs with a scientifically substantiated risk-reduction profile that approaches as closely as possible the risk-reduction profile associated with smoking cessation;  \n•\nto substantiate the reduction of risk for the individual adult smoker and the reduction of harm to the population as a whole, based on scientific evidence of the highest standard that is made available for scrutiny and review by external independent scientists and relevant regulatory bodies; and \n•\nto advocate for the development of science-based regulatory frameworks for the development and commercialization of SFPs, including the communication of scientifically substantiated information to enable adult smokers to make better choices. \nOur SFPs  \n \nOur product development is based on the elimination of combustion via tobacco heating and other innovative systems, as well as through oral tobacco and nicotine products, which we believe are the most promising paths to providing a better consumer choice for those who would otherwise continue to smoke cigarettes. We recognize that no single product will appeal to all adult \n83\nTable of Contents\nsmokers. Therefore, we are developing and commercializing a portfolio of products intended to appeal to a variety of distinct adult consumer preferences and achieve population harm reduction, including: \n•\nHeat-not-burn products, which use a precisely controlled heating device incorporating our \nIQOS HeatControl \ntechnology, into which a specially designed and proprietary tobacco unit is inserted in a holder and heated to generate an aerosol. We have conducted a series of clinical studies for this platform, the results of which were included in our submissions to the U.S. Food and Drug Administration (“FDA”). In addition to the original version of \nIQOS\n, which relies on a heating technology using a blade, a newer version of \nIQOS\n uses induction heating. Most of the studies referenced above were conducted with the blade version of \nIQOS\n and additional research was conducted with the induction technology. We believe that there is full comparability between the bladed versions of \nIQOS\n and the subsequent induction versions of \nIQOS\n, and that the data from the studies conducted with the blade version of \nIQOS\n remain valid and applicable to the newer and adjacent versions of \nIQOS\n. We also produce a heat-not-burn product that utilizes external resistive heating technology, which is commercialized under the \nBONDS by IQOS\n \nbrand, and has been launched in certain initial markets.\n•\nOral tobacco and nicotine products, which include snus and modern oral nicotine pouches. Snus refers to (a) dried loose tobacco, or snuff, which is consumed by sniffing the product through the nose; (b) moist loose tobacco which is put in the mouth between the lower or upper lip and gum; and (c) snus pouches which contain ground tobacco, water, salt and flavors. Modern oral nicotine pouches consist of white pre-conditioned pouches containing nicotine derived from tobacco, and they primarily contain nicotine, flavors, and cellulose substrate. Users place a pouch between the upper lip and gum and leave it there while the nicotine and flavor are being released. Like snus, nicotine pouches are inherently smoke-free as they are consumed orally, and no combustion process occurs during use. The pouches contain pharmaceutical-grade tobacco-derived nicotine like the nicotine used in medicinal products, such as nicotine-containing gums and inhalers, and flavors approved for use in food in accordance with the product quality standards for nicotine pouches developed by the Swedish Institute for Standards and the British Standards Institute. In 2022, we significantly expanded our oral smokeless products portfolio with the acquisition of Swedish Match. Swedish Match's \nZYN\n is the leading nicotine pouch brand in the U.S. market. \n•\ne-Vapor products, which are battery-powered devices that produce an aerosol by vaporizing a tobacco-free liquid solution. We have developed e-liquids for our e-Vapor products with different flavor profiles, including e-liquids designed to deliver an authentic tobacco taste. Using patented technology, flavors and nicotine are extracted directly from the tobacco leaves and captured in a tobacco-free liquid solution, without having to add flavoring ingredients.  \nData show that, in a stable regulatory environment, only a very small percentage of adult smokers who convert to \nIQOS\n switch back to cigarettes. \nWe aim to continue to develop and expand our SFP brand portfolio and market positions.  In addition, we continue to use our expertise, technology and capabilities to explore new growth opportunities beyond our current business, including products that do not contain nicotine or tobacco. \nCommercialization of SFPs  \nWe are continuing to develop a multiplatform approach and tailoring our commercialization strategy to the characteristics of each specific market. We focus our commercialization efforts on consumer retail experience, guided consumer trials and customer care, and increasingly, digital communication programs and e-commerce.  In order to accelerate switching to our SFPs, our initial market introductions typically entail one-on-one consumer engagement (in person or by digital means) and device discounts.  These initial commercialization efforts require substantial investment, which we believe will moderate over time and further benefit from the increased use of digital engagement capabilities. PMI has invested, and continues to invest, in digital consumer engagement.  \nIn 2014, we introduced \nIQOS\n in pilot city launches in Nagoya, Japan, and in Milan, Italy. Since then, we have continuously expanded our commercialization activities.  \nAs of October 2025,  PMI's smoke-free products were available for sale in 100 markets. \nWe have integrated the production of our heated tobacco units into several of our existing manufacturing facilities, are progressing with our plans to build manufacturing capacity for our other SFPs and continue to optimize our manufacturing \n84\nTable of Contents\ninfrastructure and expand our commercialization activities for new products and markets. We discuss certain risks related to the commercialization and supply of our SFP portfolio in \"\nCautionary Factors That May Affect Future Results\n\" in this report. \nWe discuss product warranties in more detail in Note 15. \nProduct Warranty \nin this report.  The significance of warranty claims depends on a number of factors, including device version mix, product failure rates, logistics and service delivery costs, and warranty policies, and may increase with the number of devices sold.   \n \nOn October 20, 2022, PMI announced that it had reached an agreement with Altria Group, Inc., (\"Altria\") to end the companies' commercial relationship as of April 30, 2024, with respect to \nIQOS\n in the U.S. (the “Altria Agreement”). Under the Altria Agreement, PMI now holds the full rights to commercialize \nIQOS\n in the United States - the world’s largest smoke-free market. The Altria Agreement provides a clear path to expanding \nIQOS\n’s international success in a market where over 30 million adults continue to smoke cigarettes. On March 27, 2025, we began selling \nIQOS\n 3.0, the blade version of \nIQOS\n, in Austin, Texas. We are pursuing a limited U.S. roll-out of the \nIQOS\n device while waiting for authorization to market \nIQOS ILUMA\n, the induction version, in the United States. \nIn January 2020, we announced an agreement with KT&G, a leading tobacco and nicotine company in South Korea, for the commercialization of KT&G’s smoke-free products outside of South Korea on an exclusive basis. On January 30, 2023, we announced a renewal and extension of this arrangement. For more information, see \nAcquisitions, Divestitures and Other Business Arrangements\n below. \nOur commercialization efforts for the other PMI-developed SFPs are as follows:  \n \n•\nSince 2022, we began commercializing \nBONDS\n devices and \nBLENDS\n consumables in 4 markets. \n•\nSince August 2020, we have launched and expanded our portfolio of vaping products (branded \nVEEV\n) in 46 markets. \n•\nFollowing our acquisition of Swedish Match, we have access to a strong portfolio of Swedish Match brands in both the snus and nicotine pouch categories. They are currently available in 47 markets. \nLegislation, Regulation, Taxation and Other Matters Regarding the Manufacture, Marketing, Sale and Use of Tobacco and Other Nicotine-Containing Products \nFiscal Challenges  \nExcessive and disruptive excise, sales and other tax increases and discriminatory tax structures are expected to continue to have an adverse impact on our profitability, due to lower consumption and consumer down-trading to non-premium, discount, other low-price or low-taxed products such as fine cut tobacco, illicit cigarettes or illicit SFPs. In addition, in certain jurisdictions, some of our products are subject to tax structures that discriminate against premium-price products and manufactured cigarettes. We believe that such tax policies undermine public health by encouraging consumers to turn to illicit trade or negatively impact the transition of adult smokers to SFPs, and ultimately undercut government revenue objectives, disrupt the competitive environment, and encourage criminal activity. Other jurisdictions have imposed, or are seeking to impose, levies or other taxes specifically on tobacco companies, such as taxes on revenues and/or profits.  \nOn March 14, 2024, the Court of Justice of the European Union (the \"CJEU\") ruled that the German fiscal regulation imposing an additional excise tax on heated tobacco products (\"HTPs\") does not contravene EU law. Fiscal Court in Dusseldorf (the \"FCD\") had previously referred that question to the CJEU. On May 21, 2024, the FCD delivered its judgment and dismissed the claim of our local affiliate, f6 Cigarettenfabrik GmbH & Co.KG, (\"PM Germany\"). PM Germany filed a notice of appeal to the Federal Fiscal Court on June 19, 2024. To avoid further accumulation of interest, in January 2025, PM Germany provisionally paid the additional HTP excise tax relating to 2022, 2023 and 2024 (pending the outcome of the FCD decision). An oral hearing is expected by the third quarter of 2026.\nIn March 2025, Japan adopted a multi-year tax plan that included changes to its excise tax structure and rates for tobacco products. Under the plan, the excise tax for HTPs will be harmonized with cigarettes in two steps; one on April 1, 2026 and the second on October 1, 2026. The first increase in the harmonized HTP and cigarette excise tax will occur in April 2027, and the plan provides predictability on future excise rate increases for all tobacco product categories until April 2029.\n85\nTable of Contents\nLegislative and Regulatory Environment\nThe tobacco industry operates in a highly regulated environment. The well-known risks of smoking have led regulators to impose significant restrictions and high excise taxes on cigarettes. The regulatory landscape for novel nicotine-containing products is inconsistent and evolving but is, in some instances, even more restrictive compared to the regulatory environment for cigarettes.  \nMuch of the regulation that shapes the business environment in which we operate is driven by the World Health Organization's (the \"WHO\") Framework Convention on Tobacco Control (the \"FCTC\"), which entered into force in 2005. The main objective of the FCTC is to establish a global agenda for tobacco regulation, with the purpose of reducing tobacco use.  To date, 182 countries and the European Union (\"EU\") are Parties to the FCTC.  The treaty requires Parties to have in place various tobacco control measures and recommends others. The FCTC governing body, the Conference of the Parties (“CoP”), has also adopted non-binding guidelines and policy recommendations related to certain articles of the FCTC that go beyond the text of the treaty.  In October 2018, the CoP recognized the need for more scientific assessment and improved reporting to define policy on HTPs.  Similar to its previous policy recommendations on e-cigarettes, the CoP invited countries to regulate, restrict or prohibit HTPs, as appropriate under their national laws.  \nThe WHO study group on tobacco product regulation published their ninth report on the scientific basis of tobacco product regulation in August 2023. The report is based on a review of scientific evidence related to novel and emerging nicotine and tobacco products, such as electronic nicotine delivery systems (\"ENDS\"), electronic non-nicotine delivery systems and HTPs. The report concludes by making a number of policy recommendations on HTPs and ENDS that, if implemented, could restrict both the availability of these products and access to accurate information about them. \nThe Tenth Session of the CoP (\"CoP10\") took place in February 2024. No new decisions or policy recommendations on novel and emerging tobacco products were adopted. The Eleventh session of the CoP is currently scheduled to take place in November 2025. The WHO’s reports and other FCTC guidelines or recommendations are not binding on the WHO Member States or on Parties to the FCTC.   \nWe believe that when better alternatives to cigarettes exist, the discussion should not be whether these alternatives should be made available to the more than one billion people who smoke cigarettes today, but how fast they can be made available, and within what regulatory framework to maximize their adoption by adult smokers while minimizing unintended use. Therefore, we advocate for regulatory frameworks that are based on a continuum of risk where non-combustible products fall below combustible cigarettes. And we believe that regulation and taxation should differentiate between cigarettes and products that present, are likely to present, or have the potential to present less risk of harm to adult smokers who switch to these products versus continued smoking. \nProduct regulation should include measures that encourage and accelerate switching to non-combustible products, for example, by allowing adult consumers who would otherwise continue smoking cigarettes to receive truthful and non-misleading information about such alternatives to enable them to make informed decisions and by applying uniform product standards to enable manufacturers to demonstrate the absence of combustion, as well as the reduction in HPHCs.  \nRegulation should also include specific rules for ingredients, labeling and consumer communication, and should ensure that the public is informed about the health risks of all combustible and non-combustible tobacco and nicotine-containing products. Importantly, regulation must include measures designed to prevent initiation by youth and non-nicotine users. We support mandated accurate and factual health warnings on packaging, minimum age laws, restrictions on advertising, and smoking restrictions in public spaces. We also support regulatory measures that help reduce illicit trade. At the same time, we oppose excessive or prohibitive regulations that may prevent adult smokers, who would otherwise continue smoking, from accessing and switching to SFPs or trigger unintended consequences such as illicit trade. \nRegulatory Restrictions \nSFP Sales Prohibitions\n: Some governments have banned, are seeking to ban, or severely restrict emerging tobacco and nicotine-containing products, such as our SFPs, and communication of truthful and non-misleading information about such products. Significant markets that have prohibited or severely restricted the sale of one or more category of SFP include Argentina, Brazil, Canada, France, India, Mexico, Turkey, Australia, Thailand, and Vietnam. In the U.S., some states and municipalities have introduced stringent restrictions on the sale of certain SFPs, including those authorized by the FDA. \n86\nTable of Contents\nThese regulations might foreclose or unreasonably restrict adult consumer access to products that might be a better consumer choice than continuing to smoke cigarettes. These regulations could also constitute, in effect, non-tariff barriers to trade. We oppose blanket bans and unreasonable restrictions of products that have the potential to present less risk of harm compared to continued cigarette smoking. By contrast, we support regulation that sets clear standards for all SFP categories and propels innovation to benefit adult smokers who would otherwise continue to smoke cigarettes.  \nEU Tobacco Products Directive (\"TPD\")\n: In April 2014, the EU adopted a significantly revised TPD, which came into force in May 2016. All EU Member States have adopted laws transposing the TPD. The TPD sets forth a comprehensive set of regulatory requirements for tobacco products, including: \n•\nhealth warnings covering 65% of the front and back panels of cigarette packs, with an option for Member States to further standardize tobacco packaging, including the introduction of plain packaging; \n•\na ban on characterizing flavors in some tobacco products;  \n•\nsecurity features and tracking and tracing measures; and \n•\na framework for the regulation of novel tobacco products and e-cigarettes, including requirements for health warnings and information leaflets, a prohibition on product packaging text related to reduced risk, and the introduction of notification requirements or authorization procedures in advance of commercialization. \n In February 2024, the European Commission published an updated implementation roadmap to Europe's Beating Cancer Plan (the \"Plan\"). Further developments concerning a revision of the TPD are expected during the mandate of the European Commission that took office in December 2024. \n In May 2024, the EU-wide systems of traceability and security features for tobacco products were extended to include tobacco products other than cigarettes and roll-your-own tobacco products. As such, all tobacco products are covered by the traceability system. \nEU Tobacco Excise Directive (\"TED\")\n: In July 2025, the EU Commission published a legislative proposal for the revision of the 2011 EU Tobacco Excise Directive. The proposal intends to review minimum excise tax rates for combustible tobacco products and expands the scope of the directive to include smoke-free products, such as heated tobacco, e-cigarettes, and nicotine pouches, providing differentiated tax treatment for novel tobacco and nicotine containing products. This proposal marks the beginning of the formal legislative process which requires unanimous approval by all EU Member States and subsequent transposition of TED into national legislation in the EU 27 Member States. The proposal contemplates an implementation date for this directive of January 1, 2028, and provides for an additional transitional period of four years for several categories, including heated tobacco and nicotine pouches.\nPlain Packaging and Other Packaging Restrictions\n: Plain packaging legislation bans the use of branding, logos and colors on packaging other than the brand name and variant that may be printed only in specified locations and in a uniform font. To date, plain packaging laws have been adopted in certain markets in all of our operating segments, including the key markets of Australia, France, Saudi Arabia and Turkey. Some countries, such as Canada, Denmark and Israel, adopted plain packaging regulations that apply to all tobacco products, including SFPs.  Other countries are also considering plain packaging legislation. \nSome countries have adopted, or are considering adopting, packaging restrictions that could have an impact similar to plain packaging.  Examples of such restrictions include standardizing the shape and size of packages, prohibiting certain colors or the use of certain descriptive phrases on packaging, and requiring very large graphic health warnings that leave little space for branding.   \nRestrictions and Bans on the Use of Ingredients\n: The WHO and others in the public health community have recommended restrictions or total bans on the use of some or all ingredients in both combustible and SFPs, including menthol. Broad restrictions and ingredient bans would require us to reformulate our American blend tobacco products, which could reduce our ability to differentiate these products in the market in the long term.  In many countries, menthol or flavor bans would eliminate entire product categories.  \nThe EU banned cigarettes and roll-your-own tobacco products with characterizing flavors, while exempting other tobacco products under EU TPD from this characterizing flavor ban. This was also the case for heated tobacco products until November 23, 2022, when the EU Commission published a delegated directive that eliminated this exemption. All EU Member States were required to apply the delegated directive as of October 23, 2023, which bans the use of characterizing flavors in heated \n87\nTable of Contents\ntobacco products, impacting a significant proportion of our SFP products currently sold in the EU. Currently, all but one EU Member State has transposed this directive into national law, withdrawing the heated tobacco product exemption from the characterizing flavor ban. Based on high consumer switching to non-flavored products in reaction to past bans on flavors in other categories and markets, we anticipated that, while short-term volatility would be possible, the ban’s impact on our shipment volumes in the EU would be relatively limited in the near term. To date, our experience is generally consistent with this expectation. There has been some short-term disruption in countries that have implemented the ban, most notably in Italy, but the impact has generally been limited in time and magnitude. But our fundamental view remains that we do not expect a meaningful long-term change in the structural growth of the category. We will continue to actively monitor relevant developments in the EU market, including from an illicit trade standpoint.  \nOther countries may follow the EU’s approach toward tobacco product ingredients. Turkey banned menthol as of May 2020.  Broader ingredient bans have been adopted by, among others, Brazil (pending a court decision), Thailand, Hong Kong, and Canada. In the U.S., certain states and localities have adopted, or are considering adopting, flavor bans that apply to SFPs. \nBans on Display of Tobacco Products at Retail\n: In a number of our markets, including, but not limited to, Australia, Canada and Russia, governments have banned the display of tobacco products at the point of sale.  Other countries are considering similar bans.  \nBans and Restrictions on Advertising, Marketing, Promotions and Sponsorships\n: For many years, the FCTC has called for, and countries have imposed, partial or total bans on tobacco advertising, marketing, promotions and sponsorships, including bans and restrictions on advertising on radio and television, in print and on the Internet. The FCTC's non-binding guidelines recommend that governments prohibit all forms of communication with adult smokers. In CoP10, Specific Guidelines were adopted to address cross-border Tobacco Advertising, Promotion, and Sponsorship (“TAPS”) and the depiction of tobacco in entertainment media. These Specific Guidelines are non-binding on WHO Member States nor FCTC Parties.\nProduct Standards and Restrictions on Product Design\n: In some countries, including in the EU, cigarettes are subject to testing, disclosure and mandatory emissions limits for tar, nicotine, carbon monoxide and other smoke constituents.  \nSome members of the public health community are calling for further standardization of tobacco products by requiring, for example, that cigarettes have a certain minimum diameter, which would result in a ban on slim cigarettes, or requiring the use of standardized filter and cigarette paper designs. In the Netherlands, an anti-smoking organization has brought a lawsuit to force the government to require a different test method for measuring cigarette emissions than what is currently required under EU law, which, if allowed, could lead to a de facto ban on manufactured cigarettes in the Netherlands and, potentially, in other EU countries. In addition, at its meeting in November 2016, the CoP adopted non-binding guidelines recommending that countries regulate product design features that increase the attractiveness of tobacco products, such as the diameter of cigarettes and the use of flavor capsules.  \nCurrently, national standards in certain countries set minimum quality and safety requirements for heat-not-burn products with technical heat-not-burn specifications and/or methods for demonstrating the absence of combustion. These standards are mandatory in Armenia, Bahrain, Egypt, Jordan, Lebanon, the Philippines, Saudi Arabia, Tajikistan, Tunisia, the United Arab Emirates (\"UAE\") and Uzbekistan, and voluntary in Algeria, Angola, Colombia, Costa Rica, Dominican Republic, Indonesia, Kazakhstan, Kyrgyzstan, Morocco, Russia, South Africa, Vietnam, the U.K. and Ukraine. In Japan, a voluntary standard sets minimum safety requirements for tobacco heating devices.  \nFor e-Vapor products, national standards setting minimum quality and safety requirements have been adopted in several markets.  These standards are mandatory in Armenia, Australia, Bahrain, China, Egypt, Jordan, Morocco, New Zealand, the Philippines, Russia, the UAE, and Saudi Arabia and Tajikistan, and voluntary in Azerbaijan, Costa Rica, France, Indonesia, the Philippines, Russia, the U.K., and Ukraine. \nCurrently, national standards setting minimum quality and safety requirements for modern oral nicotine pouches have been adopted in several countries. These standards are mandatory in Bahrain, Morocco, Pakistan, and the UAE, and are voluntary in Angola, Armenia, Costa Rica, France, Malawi, Mexico, Moldova, the Philippines, Sweden, the U.K., Ukraine and Zimbabwe.   \nWe expect other governments to consider similar product standards for all novel tobacco and nicotine-containing products and encourage making them mandatory. \nRestrictions on Public Smoking and Use of Nicotine-Containing Products in Public\n: The pace and scope of restrictions on the use of our products have increased significantly in most of our markets.  Many countries around the world have adopted, or are \n88\nTable of Contents\nlikely to adopt, regulations that restrict or ban smoking and use of certain nicotine-containing products in public and/or workplaces, restaurants, bars and nightclubs. Some public health groups have called for, and some countries, regional governments and municipalities have adopted or proposed, bans on smoking in outdoor places, as well as bans on smoking in cars (typically, when minors are present) and private homes. On December 3, 2024, the EU Council adopted its legally non-binding recommendation on smoke- and aerosol-free environments. While the recommendations recognize scientifically proven differences between smoke-free and combustible products, they nevertheless encourage EU member states to restrict usage of both conventional tobacco products and inhalable smoke-free products in indoor public spaces and some outdoor areas. Each member state is to decide whether or not to implement these recommendations. \nGeneration Bans\n: Certain regulators are considering generation sales bans, which prohibit the sale of certain tobacco or nicotine products to people born after a certain year. In December 2022, New Zealand adopted regulatory measures restricting the sale and supply of smoked tobacco products, including prohibiting the sale of smoked tobacco products to anyone born on or after January 1, 2009. These measures were limited to smoked tobacco products and did not apply to heated tobacco products and e-cigarettes. The New Zealand parliament repealed the measures in February 2024, before they were implemented. On November 5, 2024, the UK government introduced a bill to its Parliament, which if adopted, would ban the sale of tobacco products, including HTPs, herbal smoking products and cigarette papers to those born on or after January 1, 2009. \nOther Regulatory Issues\n: Some regulators are considering, or in some cases have adopted, regulatory measures designed to reduce the supply of tobacco products. These include regulations intended to reduce the number of retailers selling tobacco products by, for example, reducing the overall number of tobacco retail licenses available or banning the sale of tobacco products within specified distances of certain public facilities. In a limited number of markets, most notably Japan, we are dependent on governmental approvals that may limit our pricing flexibility. \nThe EU Single-Use Plastics Directive, which requires tobacco manufacturers and importers to cover the costs of public collection systems for tobacco product filters, under Extended Producer Responsibility (\"EPR\") schemes, came into force on July 2, 2019. As of December 31, 2024, the majority of EU Member States transposed the directive into national legislation and brought into force mandatory EPR schemes and related EPR costs for tobacco manufacturers and importers. We currently expect further adoption of similar laws in other jurisdictions, and we are monitoring developments in this area. We do not estimate a material impact to our business in the EU as a result of compliance with these mandatory EPR schemes.  \n \nSFP Commercialization and Risk Statement Authorizations \nCertain markets have instituted regulatory authorization processes that govern the commercialization of SFPs or the use of statements addressing SFP harm-reduction.       \nFDA Authorization Process and Status of PMI SFPs\n: In the United States, an established regulatory framework for assessing “New Tobacco Products” and “Modified Risk Tobacco Products” (\"MRTP\") exists under the jurisdiction of the FDA. FDA actions may influence the regulatory approach of other governments and international regulatory agencies.  \nFDA Review of IQOS\n: We submitted to the FDA a Modified Risk Tobacco Product Application (“MRTPA”) for the \nIQOS\n Tobacco Heating System, which includes both the corresponding device and consumables, (\"THS\") in December 2016, and a Premarket Tobacco Product Application (“PMTA”) for \nIQOS\n in March 2017.  \nOn April 30, 2019, following its comprehensive assessment of our PMTA, the FDA determined that marketing a version of \nIQOS\n, namely, \nIQOS\n 2.4 and three related consumables, is appropriate for the protection of public health and authorized those products for sale in the United States. On December 7, 2020, the FDA reached the same determination for \nIQOS\n 3.0, authorizing that version of the device for sale in the United States. \nOn July 7, 2020, the FDA determined that the available scientific evidence demonstrates that the issuance of an exposure modification order would be appropriate for the promotion of public health and authorized the marketing of a version of \nIQOS\n, namely \nIQOS\n 2.4 and three related consumables, as MRTP products with reduced exposure claims. On March 11, 2022, the FDA reached the same determination for the \nIQOS\n 3.0 device. The FDA authorized the marketing of these products in the U.S. with the following claims: \n\"AVAILABLE EVIDENCE TO DATE: \n•\nthe \nIQOS\n system heats tobacco but does not burn it.  \n89\nTable of Contents\n•\nthis significantly reduces the production of harmful and potentially harmful chemicals.  \n•\nscientific studies have shown that switching completely from conventional cigarettes to the \nIQOS\n system significantly reduces your body’s exposure to harmful or potentially harmful chemicals.\" \nThe FDA may issue two types of MRTP orders: a risk modification order or an exposure modification order. We had requested both types of orders for \nIQOS\n 2.4 and an initial selection of three related consumables' variants. After review, the FDA determined that the evidence did not support issuing a risk modification order at that time, but that it did support issuing an exposure modification order for the product. This determination included a finding that issuance of the exposure modification order is expected to benefit the health of the population as a whole. We also received an exposure modification order for \nIQOS\n 3.0 in March 2022. \nThe FDA’s PMTA and MRTP orders do not mean that the agency has “approved” \nIQOS \nproducts.  These authorizations are subject to strict marketing, reporting, and other requirements, and are not a guarantee that the product will remain authorized, particularly if there is a significant uptake in youth or non-smoker initiation. The FDA monitors the marketing of the products. \nOn January 26, 2023, the FDA authorized the marketing of two new tobacco-flavored consumables (\nMarlboro\n \nSienna\n \nHeatSticks\n and \nMarlboro\n \nBronze\n \nHeatSticks\n) and a modified version of the authorized \nMarlboro\n \nAmber\n \nHeatSticks\n. These products are line extensions and/or modified versions of the three consumables for which the FDA had previously issued a marketing granted order. In its assessment, the FDA determined that these three variants of \nHeatSticks\n were comparable to the previously authorized tobacco-flavored consumables. \nOn July 5, 2023, we submitted applications to the FDA requesting renewal of the MRTP authorizations previously granted to \nIQOS\n products in the United States. These renewal requests were received by the FDA 360 days prior to the stated July 2024 expiration date of the original exposure modification orders, as requested by the FDA in the original orders. On May 9, 2024, the FDA filed for scientific review of our MRTP renewal applications for \nIQOS\n products and posted materials from these applications. The FDA referred our MRTP renewal to the Tobacco Product Scientific Advisory Committee (“TPSAC”). TPSAC held a meeting on our renewal application on October 7, 2025. The recommendations of TPSAC are not binding on the FDA. By regulation, the FDA’s decision on our renewal application will take into account, in addition to the views of TPSAC, scientific evidence as well as comments, data and information submitted by interested persons. The FDA did not issue a decision on our MRTP renewal applications prior to the stated July 7, 2024, expiration date of the original exposure modification orders. The MRTP renewal applications were timely filed in accordance with FDA direction, and we believe that we are permitted to continue to use the modified exposure claim with respect to those products that received exposure modification orders until the FDA decides on our MRTP renewal applications. \nOn October 20, 2023, we submitted bundled PMTAs for our \nIQOS ILUMA\n THS products together with MRTPAs requesting authorization of the modified exposure order previously granted for \nIQOS\n blade versions. We submitted these applications at the same time for the FDA to evaluate the PMTAs and MRTPAs concurrently. In March 2024, the FDA formally accepted our bundled PMTAs and MRTPAs. As our applications proceed through the review process, the FDA may request additional information or conduct subsequent inspections to verify the information we submitted. \nOn January 19, 2024, the FDA completed its review of our Requests for Exemption from Substantial Equivalence (the “EX REQs”) for the five submitted \nIQOS\n consumables and determined that these tobacco products were exempt from the requirements outlined for substantial equivalence (a regulatory pathway that can be used to introduce new tobacco products which have the same characteristics as a product previously authorized by the FDA). These submissions were made in November 2022 (for the three initial \nIQOS\n consumables) and February 2023 (for the two new \nIQOS\n consumables) to enable domestic manufacturing of \nIQOS\n consumables utilizing materials purchased from vendors operating in the United States.   \nOn April 30, 2025, we submitted the Annual Report for the \nIQOS\n THS to the FDA. The report included a systematic review of the literature covering publications related to the \nIQOS\n THS between March 1, 2024, and February 28, 2025. The report included publications in various scientific fields including aerosol chemistry and physics, standard and systems toxicology, clinical studies on exposure reduction to HPHCs, and observational studies. Overall, the review continues to support the finding that \nIQOS\n THS is \"appropriate for the promotion of public health.\"  \nFDA Review of Swedish Match Products\n: Premarket tobacco applications for 20 varieties of \nZYN\n nicotine pouches were submitted in March 2020. On January 16, 2025, the FDA determined that all 20 \nZYN\n nicotine pouch varieties currently marketed in the U.S. met the applicable public health standard and were appropriate for the protection of public health and, therefore, authorized them for sale in the United States. In its assessment, the FDA concluded that “among several key \n90\nTable of Contents\nconsiderations, the agency’s evaluation showed that, due to substantially lower amounts of harmful constituents than cigarettes and most smokeless tobacco products, such as moist snuff and snus, the authorized products pose lower risk of cancer and other serious health conditions than such products.” \nIn April 2024, we submitted MRTPAs for \nZYN\n products currently marketed in the United States and requested authorization of a modified risk claim. In February 2025, the FDA formally accepted our MRTPAs and in June 2025, issued a filing letter for 20 \nZYN\n nicotine pouch products. This action initiated a scientific review of our MRTPAs which requested the following modified risk claim: “Using \nZYN\n instead of cigarettes puts you at a lower risk of mouth cancer, heart disease, lung cancer, stroke, emphysema, and chronic bronchitis.” During the review, the FDA will determine whether our applications provide the necessary evidence for \nZYN\n products to be marketed with the requested claim. Starting June 18, 2025, the public may submit public comments on our MRTPAs to a public docket on regulations.gov. There is currently no deadline for public comments. The FDA referred our MRTPAs to TPSAC, which is expected to meet in the first quarter of 2026. \nWe also submitted additional applications for authorization to market other \nZYN\n products. The FDA has not issued a decision on these applications, and these \nZYN\n products are not presently marketed in the United States. In September 2025, the FDA launched a pilot program that aims to increase efficiency and streamline the review process for PMTAs for nicotine pouches.  The pilot will involve increased real-time communication between the FDA and applicants with the goal of providing more frequent feedback and shorter review timeframes. We are aware that certain of our competitors have recently marketed, or stated their intention to market, tobacco products that have pending PMTAs and have not been previously marketed in the United States. We continue to evaluate the FDA’s and other regulators’ practices regarding products that have pending applications for marketing authorization and assess all potential pathways to market that might be available in connection with products for which we have a PMTA pending.\nOn July 17, 2023, Swedish Match USA, Inc. submitted an application to the FDA requesting re-authorization to continue to market its eight snus smokeless tobacco products (sold under the \nGeneral\n snus brand name) with a modified risk claim. \nGeneral\n snus products received modified risk orders on October 22, 2019. Swedish Match USA, Inc. was authorized to market these products with the claim, “Using \nGeneral\n snus instead of cigarettes puts you at a lower risk of mouth cancer, heart disease, lung cancer, stroke, emphysema, and chronic bronchitis.” On November 7, 2024, the FDA renewed the \nGeneral\n snus modified risk orders, with a stated expiration date in November 2032. \nOther Commercialization and Risk Statement Authorization Frameworks\n: On March 22, 2023, a bill amending the Tobacco Hazards Prevention and Control Act in Taiwan went into effect. It regulates heated tobacco products and bans e-cigarettes. The amendment particularly specifies that designated tobacco products (including heated tobacco products) that are not cigarettes, cut tobacco, cigars, snuff nor chewing tobacco, must undergo a health risk assessment as part of an authorization system. In July 2023, we filed an authorization request to commercialize \nIQOS\n in Taiwan pursuant to this Act. We have since received this authorization, which took effect on October 11, 2025.  \nOn March 23, 2023, the Greek Ministry of Health authorized a claim for \nIQOS\n with \nHEETS AMBER\n to inform Greek \nIQOS\n users about reduction in emissions of toxicants when using such product compared to cigarette smoking. The decision authorized the following claim: “The concentration of chemical substances with recognized toxicity produced when using \nIQOS\n with \nHEETS\n \nAMBER\n tobacco sticks is lower compared to conventional smoking. A reduction in the concentration of chemical substances with recognized toxicity does not mean a corresponding reduction in risk for health. The aerosol of this tobacco product contains nicotine and other hazardous chemicals. This tobacco product harms your health and is addictive. The best choice is to quit tobacco and nicotine use altogether.” With this authorization, Greece is the second country officially recognizing the reduction in level of toxicants in the \nIQOS\n aerosol compared to cigarette smoke. In February of 2025, the Greek Ministry of Health authorized a substantially similar claim and disclaimer for \nIQOS ILUMA \ndevices with seven \nTEREA\n variants (Amber, Bronze, Russet, Sienna, Silver, Teak and Yellow).\n91\nTable of Contents\nSFP Scientific Findings  \nWe make our scientific findings publicly available for scrutiny and peer review through several channels, including our websites. From time to time, adult consumers, competitors, members of the scientific community, and others inquire into our scientific methodologies, challenge our scientific conclusions or request further study of certain aspects of our SFPs and their health effects. We are committed to a robust and open scientific debate and believe that such debate should be based on accurate and reliable scientific information. We seek to provide accurate and reliable scientific information about our SFPs; nonetheless, we may not be able to prevent third-party dissemination of false, misleading or unsubstantiated information about these products.  The dissemination of scientifically unsubstantiated information or studies with a strong confirmation bias by third parties may cause confusion among adult smokers and affect their decision to switch from continued smoking to better alternatives, such as our SFPs. \nTo date, we have been largely successful in demonstrating to regulators that our heated tobacco units are not cigarettes due to the absence of combustion, and as such, they are generally taxed either as a separate category or as other tobacco products, which typically yields more favorable tax rates than cigarettes. Although we believe that this is sensible from the public health perspective, there is no guarantee regulators will continue this approach. Further, there can be no assurance that we will succeed in our efforts to replace cigarettes with SFPs or that regulation will allow us to commercialize SFPs in all markets, to communicate about our SFPs, including making scientifically substantiated risk-reduction claims, or to treat SFPs differently from cigarettes.  \nTo date, several governmental agencies have published their scientific findings that analyze the harm-reduction potential of certain SFPs versus continuing to smoke cigarettes, including: \nIn December 2017, at the request of the U.K. Department of Health and Public Health England, the U.K. Committee on Toxicity published its assessment of the risk of heat-not-burn products relative to cigarette smoking.  This assessment included analysis of scientific data for two heat-not-burn products, one of which was \nIQOS\n.  The assessment concluded that, while still harmful to health, compared with the known risks from cigarettes, heat-not-burn products are probably less harmful. Subsequently, in February 2018, Public Health England published a report stating that the available evidence suggests that heat-not-burn products may be considerably less harmful than cigarettes but more harmful than e-cigarettes.  \nIn May 2018, the German Federal Institute for Risk Assessment (“BfR”) published a study on \nIQOS\n aerosol relative to cigarette smoke using the Health Canada Intense Smoking Regimen. BfR found reductions in selected HPHCs in a range of 80-99%.  This publication indicates that significant reductions in the levels of selected toxicants are likely to reduce toxicant exposure, which BfR stated might be regarded as a discrete benefit compared to combustible cigarettes. \nIn May 2018, the Dutch National Institute for Public Health and Environment (“RIVM”) published a factsheet on novel tobacco products that heat rather than burn tobacco, focusing on \nIQOS\n.  RIVM analyzed the aerosol generated by our \nIQOS\n product and concluded that the use of this product, while still harmful to health, is probably less harmful than continuing to smoke cigarettes.   \nIn June 2018, the Korean Food and Drug Administration (“KFDA”) issued a statement on products that heat rather than burn tobacco.  The KFDA tested three heat-not-burn products, one of which was \nIQOS\n. The KFDA confirmed that the levels of the nine HPHCs tested in the aerosol of these products were on average approximately 90% lower compared to those measured in the cigarette smoke of the top five cigarette brands in South Korea. However, the KFDA stated that it could not establish that the tested heat-not-burn products are less harmful than cigarettes. In October 2018, our Korean subsidiary filed a request with a local court seeking information underlying KFDA’s analysis, conclusions and public statements. In May 2020, the court ordered KFDA to produce certain records. Subsequent to that decision, and after exchanges between the parties, the case was closed. \nIn August 2018, the Science & Technology Committee of the U.K. House of Commons published a report of its inquiry into e-cigarettes and heat-not-burn products. The report concluded that e-cigarettes are significantly less harmful to health than smoking tobacco. The report also observed that for those smokers who do not accept e-cigarettes, heat-not-burn products may offer a public health benefit despite their relative risk. The report called for a risk-proportionate regulatory environment for both e-cigarettes and heat-not-burn products and noted that e-cigarettes should remain the least taxed, cigarettes the most taxed, with heat-not-burn products falling between the two. The U.K. Committee on Advertising Practice announced the removal of a prohibition of health claims in the advertising of e-cigarettes in the U.K., effective November 2018. \n92\nTable of Contents\nIn November 2018, the Eurasian Economic Commission (regulatory body of the Eurasian Union consisting of Armenia, Belarus, Kazakhstan, Kyrgyzstan and Russia) published the results of its commissioned study on novel nicotine-containing products, including \nIQOS\n. The study confirms significantly lower levels of HPHCs in the aerosol generated by this product compared to cigarette smoke. \nIn January 2019, scientific media published the results of the study of the China National Tobacco Quality Supervision and Test Centre (“CNTQST”) comparing the aerosol generated by \nIQOS\n with cigarette smoke. The CNTQST found that the former contained fewer, and lower levels of, harmful constituents than the latter and concluded that the lower temperature of heating tobacco in \nIQOS\n contributed to the difference. The CNTQST stated that the reduction in emissions of harmful constituents cannot be interpreted as a harm/risk reduction for cigarette smokers in the same proportion. \nIn April 2020, the Superior Health Council of Belgium (“SHC”) published results of its inquiry into heat-not-burn products. The SHC concluded that heat-not-burn products, while not safe, have a more favorable toxicity profile than cigarettes.  However, in light of the uncertainty of such products’ short and long-term impacts, the toxic effects of the dual use with cigarettes, and the existence of approved smoking cessation tools, the SHC recommended that current regulations for cigarettes should apply to heat-not-burn products. \nIn June 2022, the SHC published new advice on e-cigarettes in which they confirm that e-cigarettes are substantially less harmful than smoking cigarettes and, therefore, a better alternative for smokers. The SHC underlines that the vast majority of the risks of tobacco smoking are not caused by nicotine, but by the harmful substances that are released by the combustion of tobacco. Based on the cited science, the SHC calls for legislation that makes a clear distinction between cigarettes and e-cigarettes by focusing on better informing smokers about the benefits of the lower-risk (but not risk-free) alternative, as well as on protecting non-smokers and young people. \nThe foregoing scientific findings of government agencies may not be indicative of the measures that the relevant government authorities could take in regulating our products. \nLegal Challenges to SFPs  \nWe face various administrative and legal challenges related to certain SFP activities, including allegations concerning product classification; advertising, distribution and sales restrictions; corporate communications; product coach activities; scientific substantiation; product liability; and unfair competition.  While we design our programs to comply with relevant regulations, we expect these or similar challenges to continue as we expand our efforts to commercialize SFPs and to communicate with the public. The outcomes of these matters may affect our SFP commercialization and public communication activities and performance in one or more markets. \nAs part of a previously announced sales and supply chain review, SMNA discontinued sales through the e-commerce shop associated with ZYN.com in the United States.     \nIllicit Trade  \nIllicit trade creates a cheap and unregulated supply of tobacco and nicotine-containing products, undermines efforts to reduce smoking prevalence, especially among youth, damages legitimate businesses and intellectual property rights, stimulates organized crime, increases corruption and reduces government tax revenue. We generally estimate that, excluding China and the U.S., illicit trade may account for as much as 15% of global cigarette consumption; this includes counterfeit, contraband and the persistent problem of “illicit whites,” which are cigarettes legally purchased in one jurisdiction for the sole purpose of being exported and illegally sold in another jurisdiction where they have no legitimate market. Currently, we estimate that illicit trade in the EU accounted for approximately 9% of total cigarette consumption in 2024. Illicit trade also increasingly targets SFPs. \nWe devote substantial resources to help prevent illicit trade in combustible tobacco products and SFPs. We engage with governments, our business partners, and other stakeholders to implement effective measures to combat illicit trade. Where effective and appropriate, we pursue legal remedies to protect our intellectual property rights from counterfeiting or to counter the illicit diversion of our products. We also cooperate with governmental authorities to combat fraudulent imports of non-compliant or unauthorized tobacco and nicotine-containing products.    \nAs an example, the recent commercial success of the nicotine pouch category makes it more prone to be affected by illicit trade. Our ongoing anti-illicit initiatives for nicotine pouches include PMI’s ‘know-your-customer’ and ‘anti-diversion’ governance and other measures, such as volume monitoring, tracking and tracing, product security, as well as internal and external \n93\nTable of Contents\nawareness training and communications. We are also expanding our market monitoring (both online and offline) and illicit trade research program to nicotine pouches. PMI affiliates and Swedish Match affiliates are taking appropriate actions to address the illicit resale of certain of our oral products including nicotine pouches outside their initial intended market of retail, such as Scandinavia, the U.S. and other markets. Such actions include awareness communications to trade partners, cease-and-desist letters to those involved in illicit trade of products bearing our brands and limiting and/or terminating sales to certain customers in both the online and traditional trade.  \nA number of jurisdictions are considering actions to prevent illicit trade. In November 2012, the FCTC adopted the Protocol to Eliminate Illicit Trade in Tobacco Products (the “Protocol”), which includes supply chain control measures, such as licensing of manufacturers and distributors, enforcement of these control measures in free trade zones, controls on duty free and Internet channels and the implementation of tracking and tracing technologies. To date, 71 Parties, including the EU, have ratified the Protocol.  The Protocol came into force in September 2018. Since then, implementation in national legislations has been ongoing. In February 2024, the third Meeting of the Parties to the Protocol took place. No additional restrictive measures were adopted, and a mandate to conduct further work will be considered at the next session, currently scheduled to take place in November 2025. According to publicly available reports, the fourth Meeting of the Parties will look into future restrictions on duty-free tobacco sales, regulation of key inputs used in tobacco product manufacturing, and whether Protocol’s provisions cover electronic nicotine and non-nicotine delivery systems. The tracking and tracing regulations for cigarettes and roll-your-own products manufactured or destined for the EU were extended to include tobacco products other than cigarettes, including some of our SFPs, as of May 20, 2024. \nGovernmental Investigations\nFrom time to time, we are subject to governmental investigations on a range of matters, including tax, customs, antitrust, advertising, and labor practices. We describe certain pending matters in  Note 9. \nContingencies\n. \nTrade Policy    \n \nPMI complies with all applicable trade restrictions and requirements, including sanctions, in the markets in which it operates. We have taken appropriate actions in response to the latest sanctions to ensure full compliance with the relevant restrictions.\nWe are subject to various trade restrictions imposed by the U.S., the EU, Switzerland, the U.K., and other jurisdictions in which we do business (“Trade Sanctions”), including the trade and economic sanctions administered by the U.S. Department of the Treasury's Office of Foreign Assets Control (“OFAC”) and the U.S. Department of State.  It is our policy to comply fully with these Trade Sanctions.\nPursuant to specific exemptions or licenses, or where sanctions do not apply to our business, PMI may make sales in countries subject to Trade Sanctions. \nWe do not do business or sell products in Belarus, Iran, North Korea, Cuba and Syria. We are exploring opportunities to sell our products in Cuba, as permitted by law.\nCertain states within the U.S. have enacted legislation permitting or requiring state pension funds to divest or abstain from future investment in stocks of companies that do business with certain countries that are sanctioned by the U.S.  Because we do business in certain of these countries, consistent with our policy to fully comply with Trade Sanctions and as described above, these state pension funds may have divested of our stock or may not invest in our stock. We do not believe such legislation has had a material effect on the price of our shares.\nFollowing the start of the conflict in Ukraine on February 24, 2022, the U.S., the EU, the U.K., Switzerland, Canada, Australia, New Zealand, Singapore, South Korea, Japan and other countries introduced extensive economic sanctions and export controls in relation to Russia. While the introduced sanctions vary from jurisdiction to jurisdiction, they are largely aligned. The restrictions target, among others, the Russian financial, banking, oil, military, aviation and marine sectors. The U.S. has also introduced a prohibition on new investment in the Russian Federation by a U.S. person, wherever located, and authorized the imposition of blocking sanctions on anyone operating in the Russian manufacturing sector. Among sanctions targets are Russian political figures and military personnel, certain oligarchs and journalists, and companies operating in the above-mentioned sectors. Export to Russia of certain luxury goods and goods and technology which might contribute to Russia’s technological enhancement was banned. Seven non-EU countries (Norway, Iceland, Liechtenstein, North Macedonia, Bosnia and Herzegovina, Montenegro, and Albania) announced that they “aligned themselves” with the majority of the EU sanctions. \n94\nTable of Contents\nThe U.S., the EU, Switzerland and Japan introduced additional trade restrictions banning, among many other goods, the export of certain non-tobacco materials used to produce cigarettes and heated tobacco consumables in Russia. The EU, Switzerland and the U.K. also prohibited technical assistance and other services related to restricted goods. The EU, Switzerland and the U.K. prohibited import into their territories of certain goods, including cigarettes, among others, which might generate significant revenues for Russia if they originate in Russia or are exported from Russia. The EU and Switzerland prohibited transfer and licensing of intellectual property rights in relation to restricted goods. Additionally, the EU, the U.S., the U.K., Switzerland, Canada, Australia, New Zealand and Ukraine imposed sanctions on Mr. Igor Kesaev, a non-majority shareholder of Megapolis Distribution B.V.\nThe U.S., the U.K., Switzerland and the EU banned the export of electric accumulators, static converters and electronic cigarettes and similar personal electric vaporizing devices, including \nIQOS \ndevices, to Russia. Certain countries have also banned the delivery of services to Russia, such as information technology consultancy services, accounting and business and management consulting services, or require licenses to continue delivering these services to Russian persons or entities. We are working to mitigate any potential impacts from these restrictions.  \nRussia introduced certain countermeasures aimed at reducing the effect of Western sanctions. Countermeasures include restrictions on export of certain goods from Russia, including tobacco-related production equipment, restrictions on lending to foreign borrowers, repatriation of dividends and transactions with securities and real estate involving companies from “hostile” countries (i.e., those which introduced sanctions in relation to Russia).\nThe U.S. has adopted new and increased tariffs on countries and specific goods, subject to evolving exemptions, with additional tariff increases proposed. Those changes, along with retaliatory actions by some trading partners, non-tariff restrictions or requirements being considered in connection with trade dispute negotiations, and the likelihood of additional developments, have created a volatile environment for global trade. We expect the global tariff environment to remain volatile throughout 2025. PMI is actively monitoring developments, evaluating all changes, and adapting operations and compliance practices accordingly.  For further details, see the \"\nImpact of Tariffs on Our Business\n\" section of this MD&A.\nPMI continues to monitor the development of new sanctions and other trade laws in order to ensure full compliance. \nAcquisitions, Divestitures and Other Business Arrangements \nWe discuss our acquisitions and divestitures in Note 2. \nAcquisitions and Divestitures \nto our condensed consolidated financial statements.\nKT&G    \nOn January 30, 2023, PMI announced a long-term collaboration with KT&G, South Korea’s leading tobacco and nicotine manufacturer, to continue to commercialize KT&G’s innovative smoke-free devices and consumables on an exclusive, worldwide basis (excluding South Korea).  \nThe agreement covers fifteen years, to January 29, 2038, with performance-review cycles and associated commitments, based on volume, to be confirmed for each three-year period, to allow flexibility for evolving market conditions.\nThe agreement gives PMI continued exclusive access to KT&G’s smoke-free brands and product-innovation pipeline, including offerings for low- and middle-income markets, that will enhance PMI’s existing portfolio of smoke-free products.\nProducts sold under the agreement will be subject to assessment to ensure they meet the regulatory requirements in the markets where they are launched, as well as PMI’s high standards of quality and scientific substantiation. PMI and KT&G will seek any necessary regulatory approvals that may be required on a market-by-market basis.\nOn July 30, 2024, PMI announced a memorandum of understanding with KT&G. This non-binding memorandum establishes the parties’ intent to collaborate on regulatory submissions for those new KT&G heat-not-burn products that PMI selects to commercialize in the U.S. KT&G’s new platform products are expected to be launched first outside the U.S. Thereafter, the partners plan to work on a PMTA submission for review by the U.S. FDA, in accordance with the memorandum.  \n95\nTable of Contents\nEquity Investments\nWe discuss our equity investments in Note 13. \nRelated Parties - Equity Investments and Other \nto our condensed consolidated financial statements.\nClimate Change Laws and Regulations  \n \nWhile, to date, the effect of climate-related laws and regulations on PMI has not been material to our business, results of operations or financial condition, consideration of environmental and climate-related laws and regulations is an integral aspect of PMI’s climate-related risk assessment process. To this end, we actively monitor the existing and potential impact on PMI of significant pending or existing climate change-related legislation, regulations, international accords, reporting frameworks, standards, principles, and other forms of guidance. Examples include, but are not limited to, the EU Emissions Trading System, the 2015 Paris Climate Agreement, the work of the International Financial Reporting Standards Foundation, including the International Sustainability Standards Board proposed climate standard, the Transition Planning Task Force disclosure framework, and the recommendations of the Task Force on Climate-related Financial Disclosures, the California Climate Corporate Accountability Act, the California Greenhouse Gases: Climate-Related Financial Risk Act, the Task Force on Nature-related Financial Disclosures, the EU Corporate Sustainability Reporting Directive, the EU Taxonomy Regulation, the EU Deforestation Regulation, the EU Corporate Sustainability Due Diligence Directive, CDP, the GHG Protocol, and  the EU's Carbon Border Adjustment Mechanism (CBAM) as well as other carbon tax programs in Canada and other jurisdictions.\nU.S. GAAP Treatment of Highly Inflationary Economies    \nWe apply highly inflationary accounting to the results of operations of our subsidiaries in Argentina, Egypt, Turkey and Lebanon as the cumulative inflation rate in these economies for a three-year period meets or exceeds 100%, in accordance with U.S. GAAP. As a result, monetary assets and liabilities denominated in local currencies are remeasured to the U.S. Dollar at each balance sheet date, with remeasurement gains and losses recognized in consolidated statement of earnings.\nThis impact of currency fluctuations could negatively impact our financial condition and results of operations. For the nine months ended September 30, 2025 and 2024, exchange gains (losses) recognized resulting from remeasurement adjustments related to highly inflationary accounting were not material.\nRestructuring Activities\nWe discuss restructuring activities in Note 16. \nRestructuring Activities \nto our condensed consolidated financial statements.\nImpact of Inflation on Our Business \nLike many other global companies, we have experienced inflationary pressures in 2022, 2023, 2024, including: growing pressures on the cost of certain direct materials, wages, energy, transportation, and logistics as well as an increased cost of capital due to interest rate increases driven by the response to increased inflation. In 2025, we expect certain inflationary elements such as direct materials and utilities to stabilize, with a moderate overall increase in inflationary pressures driven by tobacco leaf costs.  The impact of inflation on cost of sales during the first nine months of 2025 was not material to our condensed consolidated financial statements.\nImpact of Tariffs on Our Business   \nThe current U.S. and international political environment, including existing and potential changes to U.S. policies related to global trade and tariffs, have resulted in uncertainty surrounding the future state of the global economy.  \nWhile the global tariff environment is volatile, as a global company with a broadly diversified production, a worldwide supplier network, including an established U.S. manufacturing base for nicotine pouches, and existing supply chains that are largely self-contained within their respective trade regions, we currently believe we are well-positioned to mitigate potential supply chain challenges and that the changing tariff environment will not have a material impact on our business.  During the first nine months of 2025, the impact of new tariffs on our business was not material to our condensed consolidated financial statements. We expect the global tariff environment to remain volatile throughout 2025 and 2026.  \n96\nTable of Contents\nWe are actively monitoring developments in the global tariff environment and will continue to evaluate the potential impact of the announced tariffs and related developments on our business and financial condition, as well as on our suppliers, and the actions we may take to mitigate any impact.  For our risk factors related to the impact of tariffs, see our \"\nCautionary Factors That May Affect Future Results\n” section of this Form 10-Q.\nWar in Ukraine   \nIn Ukraine, our main priority remains the safety and security of our employees and their families in the country. We continue commercial activities in select locations where safety allows, in order to provide product availability and service to adult consumers, and supplies the market from production centers outside Ukraine, as well as through a contract manufacturing arrangement.  Production at our factory in Kharkiv remains suspended. On June 20, 2023, we announced the investment of $30 million in a new production facility in the Lviv region, in Western Ukraine. Preparatory work for the facility began in July 2023. The new production facility was completed at the end of the first quarter of 2024 and local production commenced in April 2024. As of September 30, 2025, our Ukrainian operations had approximately $0.7 billion in total assets, excluding intercompany balances. \nIn Russia, we are continuously assessing the evolving situation in the country. This includes regulatory constraints in the market entailing very complex terms and conditions that must be met for any divestment transaction to be granted approval by the authorities, and restrictions resulting from international regulations. In the event of a divestment, our ability to fully realize the value of the business would likely be subject to material impairment.  As of September 30, 2025, our Russian operations had approximately $4.5 billion in total assets, excluding intercompany balances, of which approximately $2.0 billion consisted of cash and cash equivalents held mostly in local currency (Russian rubles).\nAdditionally, PMI holds a 23% equity interest in JSC TK Megapolis, PMI's distributor in Russia (SSEA, CIS & MEA segment), which as of September 30, 2025 had a carrying value of $305 million.  For further details, see Note 13. \nRelated Parties – Equity Investments and Other.\nThese developments above have or may have a material adverse impact on our business, results of operations, cash flows and financial position, and may result in impairment charges.\nFor further details, see \"\nTrade Policy\n\" and  \"\nCautionary Factors That May Affect Future Results\n\" sections of this MD&A.  \n97\nTable of Contents\nFinancial Review\n \n \nCash Flow Highlights\n \nFor the Nine Months Ended September 30,\n(in millions)\n2025\n2024\nNet cash provided by (used in) operating activities\n$\n7,524 \n$\n8,215 \nNet cash provided by (used in) investing activities\n(3,539)\n(1,533)\nNet cash provided by (used in) financing activities\n(4,551)\n(5,378)\nNet Cash Provided by (Used in) Operating Activities\n \n \nDuring the first nine months of 2025, net cash provided by operating activities was $7.5 billion as compared to $8.2 billion in the first nine months of 2024. Excluding favorable currency movements, the unfavorable variance of $1.0 billion was due primarily to higher working capital requirements of $2.9 billion. This was partly offset by higher currency-neutral net earnings, excluding non-cash depreciation and amortization expense, non-cash movements in deferred income tax benefit and other non-cash movements primarily reflected in Other. Our net cash provided by operating activities also includes dividend income from our deconsolidated Canadian affiliate of $0.5 billion received in the third quarter (for further details, see Note 13. \nRelated Parties – Equity Investments and Other\n to our condensed consolidated financial statements).\nThe higher working capital requirements in 2025 as compared with 2024 were primarily due to more cash used in inventories, coupled with more cash used in accrued liabilities and other current assets, mainly reflecting the timing of excise tax-paid inventory movements primarily related to excise tax increases and the timing of the corresponding excise tax payments. Excise tax payments included the disputed supplemental tax surcharge on heated tobacco products in Germany of approximately $0.8 billion as PMI elected to pay the supplemental tax surcharge in January 2025 to avoid the future addition of interest (for further details refer to the MD&A Europe segment section where we describe the case). In addition, more cash used in income taxes primarily reflected the higher final 2017 U.S. Tax Cuts and Jobs Act transition tax installment payment.  \nFor the full year 2025, we currently expect net cash provided by operating activities of more than $11.5 billion at prevailing exchange rates, subject to year-end working capital requirements. This now includes dividend income from our deconsolidated Canadian affiliate.\nNet Cash Provided by (Used in) Investing Activities     \n \n \nDuring the first nine months of 2025, net cash used in investing activities was $3.5 billion as compared to $1.5 billion in the first nine months of 2024. This increase in net cash used was primarily due to changes in the cash collateral posted for derivative instruments, reflecting the appreciation of the Euro and Swiss franc versus U.S. dollar. \n98\nTable of Contents\nCapital expenditures of $1,125 million during the first nine months of 2025 decreased by $41 million as compared with the first nine months of 2024. The 2025 capital expenditures were primarily related to our ongoing investments in smoke-free product manufacturing capacity. We expect total capital expenditures in 2025 to be around $1.6 billion, the vast majority due to investments supporting the smoke-free business.    \n \nNet Cash Provided by (Used in) Financing Activities   \nDuring the first nine months of 2025, net cash used in financing activities was $4.6 billion as compared to $5.4 billion in the first nine months of 2024. The decrease in net cash used was primarily due to higher net borrowings in 2025 (primarily higher commercial paper outstanding in 2025, partly offset by lower long-term debt proceeds in 2025), partially offset by higher dividend payments and changes in the cash collateral received for derivative instruments, reflecting the appreciation of the Euro and Swiss franc versus U.S. dollar. \nDebt and Liquidity\nWe define cash and cash equivalents as short-term, highly liquid investments, readily convertible to known amounts of cash that mature within a maximum of three months and have an insignificant risk of change in value due to interest rate or credit risk changes. As a policy, we do not hold any investments in structured or equity-linked products. Our cash and cash equivalents are mostly held with institutions that have investment-grade long-term credit rating.  \nIn a number of jurisdictions, including Argentina and Russia, we are impacted by various capital controls and/or foreign currency exchange constraints that affect the ability of our subsidiaries in these jurisdictions to settle foreign currency denominated imports of goods and services and/or to pay dividends. These factors increase foreign currency devaluation risks, which may have a negative impact on our financial condition, net assets and results of operations in these jurisdictions.\nWe utilize long-term and short-term debt financing, including a commercial paper program that is regularly used to finance ongoing liquidity requirements, as part of our overall cash management strategy.  Our ability to access the capital and credit markets as well as overall dynamics of these markets may impact borrowing costs.  We expect that the combination of our long-term and short-term debt financing, the commercial paper program and the committed credit facilities, coupled with our operating cash flows, will enable us to meet our liquidity requirements.  \nCredit Ratings\n – The cost and terms of our financing arrangements as well as our access to commercial paper markets may be affected by applicable credit ratings. \nAt September 30, 2025, our credit ratings and outlook by major credit rating agencies were as follows: \n \n  \nShort-term\n  \nLong-term\n  \nOutlook\nMoody’s\n  \nP-1\n  \nA2\n  \nStable\nStandard & Poor’s\n  \nA-2\n  \nA-\n  \nPositive\nFitch\n  \nF1\n  \nA\n  \nStable\n99\nTable of Contents\nRevolving Credit Facilities\n \nAt September 30, 2025, our committed revolving credit facilities were as follows:\nType (in billions)\nCommitted\nRevolving Credit\nFacilities\nMulti-year $2.0 billion revolving credit, expiring February 10, 2026 \n(1)\n$\n2.0 \nMulti-year $2.5 billion revolving credit, expiring September 29, 2026 \n(2)  (3)\n2.5 \nMulti-year €1.5 billion revolving credit, expiring January 29, 2028 \n1.8 \n \nTotal facilities\n \n$\n6.3 \n(1) \nOn January 28, 2022, we entered into an agreement, effective February 10, 2022, to amend and extend the term of our $2.0 billion multi-year revolving credit facility, for an additional year covering the period February 11, 2026 to February 10, 2027, in the amount of $1.9 billion.\n(2) \nIncludes business transformation-linked pricing adjustments that may result in the reduction or increase in both the interest rate and commitment fee under the credit agreement if PMI achieves, or fails to achieve, certain specified targets based on its business transformation goals.\n(3)\n On September 20, 2022, we entered into an agreement, effective September 29, 2022, to amend and extend the term of our $2.5 billion multi-year revolving credit facility, for an additional year covering the period September 30, 2026 to September 29, 2027, in the amount of $2.3 billion. On September 20, 2023, PMI entered into an agreement, effective September 29, 2023, to amend and further extend the term to September 29, 2028. \nAt September 30, 2025, there were no borrowings under the committed revolving credit facilities, and the entire committed amounts were available for borrowing. \nAll banks participating in our committed revolving credit facilities have an investment-grade long-term credit rating from the credit rating agencies.  We continuously monitor the credit quality of our banking group, and at this time we are not aware of any potential non-performing credit provider.\nThese committed revolving credit facilities do not include any credit rating triggers, material adverse change clauses or any provisions that could require us to post collateral.  We expect to continue to meet our covenants.\nIn addition to the committed revolving credit facilities discussed above, PMI maintains certain short-term credit arrangements, including uncommitted credit lines, to primarily meet working capital needs. These credit arrangements amounted to approximately $3.8 billion at September 30, 2025, and approximately $2.1 billion at December 31, 2024.  Borrowings under these arrangements and other bank loans amounted to $195 million at September 30, 2025, and $137 million at December 31, 2024.\nTerm Loan Facility related to the Financing of the Swedish Match Acquisition  \nOn June 23, 2022, PMI entered into a €5.5 billion (approximately $5.8 billion at the date of signing) senior unsecured term loan credit agreement consisting of a €3.0 billion (approximately $3.2 billion at the date of signing) tranche expiring three years after the occurrence of certain events and a €2.5 billion (approximately $2.6 billion at the date of signing) tranche expiring on June 23, 2027.\nOn November 7, 2022, PMI delivered notices of borrowing for advances totaling €5.5 billion under the term loan facility, of which €3.0 billion would become due on November 9, 2025, and €2.5 billion would become due on June 23, 2027, unless prepaid pursuant to the terms of the credit agreement.\nOn November 21, 2024, PMI prepaid approximately €3 billion (approximately $3.2 billion), including outstanding principal and accrued interest, representing all borrowings outstanding under the 3-year tranche of the senior unsecured term loan facility. As of September 30, 2025, borrowings in the amount of €2.5 billion (approximately $2.9 billion) under the 5-year tranche of the term loan facility remained outstanding.\nCommercial Paper Program\n – We continue to have access to liquidity in the commercial paper market through programs in place in the U.S. and in Europe having an aggregate issuance capacity of $8.0 billion. At September 30, 2025, we had $1.7 \n100\nTable of Contents\nbillion of commercial paper outstanding. At December 31, 2024, we had no commercial paper outstanding. The average commercial paper balance outstanding during the first nine months of 2025 was $3.6 billion. The average commercial paper balance outstanding during 2024 was $1.3 billion.\nSale of Accounts Receivable\n \n– \nTo mitigate credit risk and enhance cash and liquidity management, we sell trade receivables to unaffiliated financial institutions.  For further details, see Note 14. \nSale of Accounts Receivable \nto our condensed consolidated financial statements.\nSupply Chain Financing \n–\n We engage with unaffiliated global financial institutions that offer a voluntary supply chain financing program to some of our suppliers. For further details, see Note 18. \nSupply Chain Financing\n to our condensed consolidated financial statements. \nDebt\n – Our total debt was $50.1 billion at September 30, 2025 and $45.7 billion at December 31, 2024. \nOn February 10, 2023, we filed a shelf registration statement with the U.S. Securities and Exchange Commission, under which we may from time to time sell debt securities and/or warrants to purchase debt securities over a three-year period. \nPMI's debt issuances in the first nine months of 2025 were as follows:   \n(in millions)\nType\nFace Value \nInterest Rate\nIssuance\nMaturity\nU.S. dollar notes\n(a)\n$400\nFloating\nApril 2025\nApril 2028\nU.S. dollar notes\n(b)\n$750\n4.125%\nApril 2025\nApril 2028\nU.S. dollar notes\n(b)\n$750\n4.375%\nApril 2025\nApril 2030\nU.S. dollar notes\n(b)\n$600\n4.875%\nApril 2025\nApril 2035\nEuro notes\n(c) (d)\n€500 (approximately $569)\n2.750%\nJune 2025\nJune 2029\nEuro notes\n(c) (d)\n€500 (approximately $569)\n3.250%\nJune 2025\nJune 2032\n(a) Interest is payable quarterly, commencing in July 2025\n(b) Interest is payable semi-annually, commencing in October 2025\n(c) Interest is payable annually, commencing in June 2026\n(d) USD equivalents for foreign currency notes were calculated based on exchange rates on the date of issuance\nThe net proceeds from the sale of the securities listed in the table above have been or will be used for general corporate purposes, including working capital requirements, repayment of commercial paper and to refinance certain of our outstanding notes due in 2025.\nGuarantees\n – At September 30, 2025, we have guarantees of our own performance, which are primarily related to excise taxes on the shipment of our products. There is no liability in the condensed consolidated financial statements associated with these guarantees. These guarantees have not had, and are not expected to have, a significant impact on PMI’s liquidity.  \nIn August 2024, PMI entered into a guarantee agreement for an equity investee. For further details, see Note 13. \nRelated Parties – Equity Investments and Other\n.   \nSwedish Match Notes Consent Solicitation and PMI Guarantee  \n \nOn June 15, 2023, our wholly owned subsidiary, Swedish Match AB (\"Swedish Match\"), initiated a public consent solicitation of eligible holders of certain outstanding series of its notes to amend certain terms and conditions of these respective notes. The eligible noteholders provided the requisite irrevocable consent instructions voting in favor of the amendments, which were subsequently passed by way of extraordinary resolution at the noteholders’ meeting held on July 28, 2023. As a result of the passage of the extraordinary resolution, Philip Morris International Inc. entered into a guarantee, which guarantees unconditionally and irrevocably to the noteholders the punctual payment when due, whether at stated maturity, by acceleration or otherwise, of the principal, premium, if any, and interest on the notes.\n101\nTable of Contents\nEquity and Dividends\nWe discuss our stock awards as of September 30, 2025 in Note 3. \nStock Plans\n to our condensed consolidated financial statements.  \nDividends paid in the first nine months of 2025 were $6.3 billion. During the third quarter of 2025, our Board of Directors approved an 8.9% increase in the quarterly dividend to $1.47 per common share. As a result, the present annualized dividend rate is $5.88 per common share. \nMarket Risk\nCounterparty Risk\n - We predominantly work with financial institutions with strong short- and long-term credit ratings as assigned by Standard & Poor’s and Moody’s. These banks are also part of a defined group of relationship banks. Non-investment grade institutions are only used in certain emerging markets to the extent required by local business needs. We have a conservative approach when it comes to choosing financial counterparties and financial instruments. As such, we do not invest or hold investments in any structured or equity-linked products. The majority of our cash and cash equivalents is currently invested with maturities of less than 30 days.\nWe continuously monitor and assess the credit worthiness of all our counterparties.\nDerivative Financial Instruments\n - We operate globally with manufacturing and sales facilities in various locations around the world. Consequently, we use certain financial instruments to manage our foreign currency and interest rate exposure. We use derivative financial instruments principally to reduce our exposure to market risks resulting from fluctuations in foreign exchange and interest rates by creating offsetting exposures. We are not a party to leveraged derivatives and, by policy, do not use derivative financial instruments for speculative purposes.\nSee Note 6. \nFinancial Instruments \nto our condensed consolidated financial statements for further details on our derivative financial instruments and the related collateral arrangements.\nContingencies\nSee Note 9. \nContingencies\n to our condensed consolidated financial statements for a discussion of contingencies.\nCautionary Factors That May Affect Future Results\n \nForward-Looking and Cautionary Statements\nWe may from time to time make written or oral forward-looking statements, including statements contained in this Quarterly Report on Form 10-Q and other filings with the SEC, in reports to investors and in press releases and investor webcasts. You can identify these forward-looking statements by use of words such as \"strategy,\" \"expects,\" \"continues,\" \"plans,\" \"anticipates,\" \"believes,\" \"will,\" \"aspires,\" \"estimates,\" \"intends,\" \"projects,\" \"aims,\" \"goals,\" \"targets,\" \"forecasts\" and other words of similar meaning. You can also identify them by the fact that they do not relate strictly to historical or current facts.\nWe cannot guarantee that any forward-looking statement will be realized, although we believe we have been prudent in our plans and assumptions. Our SFPs constitute a relatively new product category that is less predictable than our mature cigarette business. Achievement of future results is subject to risks, uncertainties and inaccurate assumptions. Should known or unknown risks or uncertainties materialize, or should underlying assumptions prove inaccurate, actual results could vary materially from those anticipated, estimated or projected. Investors should bear this in mind as they consider forward-looking statements and whether to invest in or remain invested in our securities. In connection with the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995, we are identifying important factors that, individually or in the aggregate, could cause actual results and outcomes to differ materially from those contained in any forward-looking statements made by us; any such statement is qualified by reference to the following cautionary statements. We elaborate on these and other risks we face throughout this document, particularly in the Part I, Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations — Business Environment \nsection in this report. You should understand that it is not possible to predict or identify all risk factors. Consequently, you should not consider the following to be a complete discussion of all potential risks or uncertainties. We do not undertake to update any forward-looking statement that we may make from time to time, except in the normal course of our public disclosure obligations.\n102\nTable of Contents\nOverall\n \nBusiness Risks\nWe may be unsuccessful in our attempts to introduce, commercialize, and grow smoke-free products in existing and new markets, and regulators may prohibit or significantly restrict the commercialization of these products or the communication of scientifically substantiated information and claims.\nOur key strategic priorities are to: (i) continue developing and commercializing products that present less risk of harm to adult smokers who switch to smoke-free products versus continued cigarette smoking; and (ii) encourage and educate current adult smokers who would otherwise continue to smoke cigarettes to switch to those products. For our efforts to be successful, we must: \n•\ndevelop SFPs that adult smokers who would otherwise continue to smoke cigarettes find to be satisfying alternatives to smoking;\n•\nfor those adult smokers, our goal is to develop and offer SFPs with a scientifically substantiated risk-reduction profile that approaches as closely as possible the risk-reduction profile associated with smoking cessation; \n•\nsubstantiate the reduction of risk for the individual adult smoker and the reduction of harm to the population as a whole, based on scientific evidence of the highest standard that is made available for scrutiny and review by external independent scientists and relevant regulatory bodies; and\n•\nadvocate for the development of science-based regulatory frameworks for the development and commercialization of SFPs, including the communication of scientifically substantiated information to enable adult smokers to make better choices.\nWe might not succeed in our effort to introduce, commercialize, and grow our SFPs in existing and new markets. If we do not succeed, but others do, or if heat-not-burn products are inequitably regulated compared to other SFP categories without regard to the totality of the scientific evidence available for such products, we may be at a competitive disadvantage. In addition, actions of some market participants, such as the inappropriate marketing of e-vapor products to youth, as well as alleged health consequences associated with the use of certain e-vapor products, may unfavorably impact public opinion and/or mischaracterize the health consequences of all e-vapor products or other SFPs to consumers, regulators and policy makers without regard to the totality of scientific evidence available for specific products. This may impede our efforts to advocate for the development of science-based regulatory frameworks for the development and commercialization of SFPs. We cannot predict the extent to which regulators will permit the sale and/or marketing of SFPs. Regulatory restrictions could limit the success of our SFPs. \nThe World Health Organization (the \"WHO\") study group on tobacco product regulation published their ninth report on the scientific basis of tobacco product regulation in August 2023. The report is based on a review of scientific evidence related to novel and emerging nicotine and tobacco products, such as electronic nicotine delivery systems (\"ENDS\"), electronic non-nicotine delivery systems and HTPs. The report concludes by making a number of policy recommendations on HTPs and ENDS that, if implemented, could restrict both the availability of these products and the access to accurate information about them. In August 2021, the Framework Convention on Tobacco Control (the \"FCTC\") Secretariat published two reports on novel and emerging tobacco products to the Ninth Session of the CoP of the FCTC, which are not materially different from the WHO study group report. The Eleventh Session of the CoP (\"CoP 11\") is currently scheduled to take place in November 2025. In preparation for CoP 11, the FCTC Secretariat has released a number of reports. They include proposals to curb tobacco use, address nicotine addiction, introduce generation sales bans and safeguard public health policies from industry interference\nReports issued by the WHO and other FCTC guidelines or recommendations are not binding on the WHO Member States or on parties to the FCTC, and so it is not possible to predict the extent to which any proposals it adopts will be implemented. However, the WHO proposals could lead to restrictions on the availability of certain of our SFPs and access to accurate information about them in one or more of our markets, which could have a material adverse effect on our results of operations.\nAdditionally, any claims, regardless of merit, challenging our research and clinical data available to date, may impact the development of science-based regulatory frameworks for the commercialization of the SFP category and the commercialization of the SFP category in general.\nOur SFPs and commercial activities for these products are designed for, and directed toward, current adult smokers and adult users of nicotine-containing products. We put significant effort to restrict access of our products from non-nicotine users and youth. Despite our efforts, technological, operational, regulatory and/or commercial developments might impact the implementation or effectiveness of youth access prevention mechanisms and surrounding infrastructure. If there is significant usage, whether actual or perceived, of our products or competitive products among youth or non-nicotine users, even in \n103\nTable of Contents\nsituations over which we have no control, our reputation and credibility may suffer, the regulatory approach to our products may become more restrictive, and our efforts to advocate for the development of science-based regulatory frameworks for the development and commercialization of SFPs may be significantly impacted.\nIn the U.S., any federal, state or local government action, including regulatory actions and inaction by the FDA, may have a material adverse impact on our commercialization of SFPs and business. The FDA’s premarket tobacco product and modified risk tobacco product authorizations of two versions of our \nIQOS \nproduct as well as the premarket tobacco authorizations of 20 varieties of \nZYN\n nicotine pouches are subject to strict marketing, reporting and other requirements. Although we have received these authorizations from the FDA, there is no guarantee that the products will remain authorized for sale in the United States, or that new versions of \nIQOS \nor other \nZYN \nproducts will receive necessary authorizations, particularly if there is a significant uptake in youth or non-nicotine user initiation. \nThe commercialization of our products in the United States is dependent on successfully managing compliance with federal, state, and local laws, regulations, legal agreements, and related interpretations. Failure to successfully manage compliance and to resolve any disputes that may arise regarding the application of legal and administrative requirements to our products could negatively impact the timing, manner, or success of our SFP commercialization in the United States, which could in turn have a material adverse effect on our results of operations, revenues, cash flows, or profitability. \nThe financial and business performance of our smoke-free products is less predictable than our cigarette business.\nOur SFPs are novel products in a relatively new category, and the pace at which adult smokers adopt them may vary, depending on the competitive, regulatory, fiscal and cultural environment, and other factors in a specific market. There may be periods of accelerated growth and periods of slower growth for these products, the timing and drivers of which may be more difficult for us to predict versus our mature cigarette business. The impact of this lower predictability on our projected results for a specific period may be significant, due to geopolitical or macroeconomic events that negatively impact SFP availability or adoption, which in turn may have a material adverse effect on our results of operations.\nWe may be unsuccessful in our efforts to differentiate smoke-free products and cigarettes with respect to taxation.\nTo date, we have been largely successful in demonstrating to regulators that our SFPs are not cigarettes due to the absence of combustion, and accordingly they are generally taxed either as a separate category or as other tobacco products, which typically yields more favorable tax rates than cigarettes. Nevertheless, we are unable to predict whether new regulations, or reinterpretations of existing regulations, will result in SFPs being taxed in line with other tobacco products such as conventional cigarettes, on a prospective or retroactive basis. If we cease to be successful in these efforts, SFP unit margins may be materially adversely affected, which in turn may have a material adverse effect on our results of operations, revenues, cash flows, and profitability. \nConsumption of tax-paid cigarettes continues to decline in many of our markets.\nThis decline is due to multiple factors, including increased taxes and pricing, governmental actions, the diminishing social acceptance of smoking, health concerns, competition, continuing economic and geopolitical uncertainty, and the continuing prevalence of illicit products. These factors and their potential consequences are discussed more fully below and in Part I, Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations — Business Environment section of this report. A continuous decline in the consumption of cigarettes could have a material adverse effect on our revenues, cash flows and profitability, which in turn may have a material adverse effect on our ability to fund our smoke-free transformation. \nCigarettes are subject to substantial taxes. Significant increases in cigarette-related taxes have been proposed or enacted and are likely to continue to be proposed or enacted in numerous jurisdictions. These tax increases may disproportionately affect our profitability and make us less competitive versus certain of our competitors.\nTax regimes, including excise taxes, sales taxes and import duties, can disproportionately affect the retail price of cigarettes versus other combustible tobacco products, or disproportionately affect the relative retail price of our cigarette brands versus cigarette brands manufactured by certain of our competitors. Because our portfolio is weighted toward the premium-price cigarette category, tax regimes based on sales price can place us at a competitive disadvantage in certain markets. Furthermore, our volume and profitability may be adversely affected in these markets.\nIn addition, increases in cigarette taxes are expected to continue to have an adverse impact on our sales of cigarettes, due to resulting lower consumption levels, a shift in sales from manufactured cigarettes to other combustible tobacco products and from the premium-price to the mid-price or low-price cigarette categories, where we may be under-represented, from local sales \n104\nTable of Contents\nto cross-border purchases of lower price products, or to illicit products such as contraband, counterfeit and other non-compliant or otherwise illicit products.\nEach of these risks could have a material adverse effect on our business, operations, results of operations, revenues, cash flows and profitability. \nOur business faces significant governmental action aimed at increasing regulatory requirements with the goal of reducing or preventing the use of tobacco or nicotine-containing products.\nGovernmental actions, combined with the diminishing social acceptance of smoking and private actions to restrict smoking, have resulted in reduced industry volumes for our products in many of our markets, and we expect that such factors will continue to reduce consumption levels and will increase down-trading and the risk of counterfeiting, contraband, illicit trade and cross-border purchases. Significant regulatory developments will continue to take place over the next few years in most of our markets, driven principally by the Framework Convention on Tobacco Control (the \"FCTC\"). Since it came into force in 2005, the FCTC has led to increased efforts by tobacco control advocates and public health organizations to promote increasingly restrictive regulatory measures on the marketing and sale of tobacco and nicotine-containing products to adult nicotine users. Regulatory initiatives that have been contemplated, proposed, introduced or enacted by governmental authorities in various jurisdictions include:\n•\nrestrictions on or licensing of outlets permitted to sell tobacco or nicotine-containing products;\n•\nthe levying of substantial and increasing tax and duty charges;\n•\nrestrictions or bans on advertising, marketing and sponsorship;\n•\nthe display of larger health warnings, graphic health warnings and other labeling requirements;\n•\nrestrictions on packaging design, including the use of colors, and mandating plain packaging;\n•\nrestrictions on packaging and cigarette formats and dimensions;\n•\nrestrictions or bans on the display of product packaging at the point of sale and restrictions or bans on vending machines;\n•\ngeneration sales bans, under which the sale of certain tobacco or nicotine-containing products to people born after a certain year would be prohibited;\n•\nrequirements regarding testing, disclosure and performance standards for tar, nicotine, carbon monoxide and/or other smoke or product constituents;\n•\ndisclosure, restrictions, or bans of tobacco and nicotine-containing product ingredients or components, including bans on the flavors of certain tobacco and nicotine-containing products;\n•\nincreased restrictions on smoking and use of tobacco and nicotine-containing products in public and work places and, in some instances, in private places and outdoors;\n•\nrestrictions or prohibitions of novel tobacco or nicotine-containing products or related devices;\n•\nelimination of duty free sales and duty free allowances for travelers;\n•\nrestrictions in terms of importing or exporting our products impacting our logistics activities and ability to ship our products;\n•\nencouraging litigation against tobacco companies; and\n•\nexcluding tobacco companies from transparent public dialogue regarding public health and other policy matters.\nOur financial results could be materially affected by regulatory initiatives resulting in a significant decrease in demand for our brands.  More specifically, requirements that lead to a commoditization of tobacco products or impede adult consumers' ability to convert to our SFPs, as well as any significant increase in the cost of complying with new regulatory requirements could have a material adverse effect on our financial results.\n105\nTable of Contents\nChanges in the earnings mix and changes in tax laws may result in significant variability in our effective tax rates. Our ability to receive payments from foreign subsidiaries or to repatriate royalties and dividends could be restricted by local country currency exchange controls and other regulations.\nWe are subject to income tax laws in the United States and numerous foreign jurisdictions. Changes in the tax laws of foreign jurisdictions could arise as a result of the base erosion and profit shifting project undertaken by the Organisation for Economic Co-operation and Development (the \"OECD\"), which recommended changes to numerous long-standing tax principles, and could have a material adverse impact on our effective tax rate thereby reducing our net earnings. Such changes, as well as changes in taxing jurisdictions’ administrative interpretations, decisions, policies, or positions, could also have a material adverse impact on our effective tax rate thereby reducing our net earnings. Currently, many countries have enacted or taken actions to align with the OECD’s framework on a global minimum tax (referred to as “Pillar Two”), effective for taxable years beginning after December 31, 2023. We will continue to evaluate and monitor as additional guidance and clarification becomes available. In future periods, our ability to recover deferred tax assets could be subject to additional uncertainty as a result of such developments. Furthermore, changes in the earnings mix or applicable foreign tax laws may result in significant variability in our effective tax rates.\nAs a result of Russia’s invasion of Ukraine, certain taxing jurisdictions, including the U.S., have proposed punitive tax legislation applicable to companies doing business in Russia, which could also have a material adverse impact on our effective tax rate if enacted thereby reducing our net earnings. \nBecause we are a U.S. holding company, our most significant source of funds is distributions from our non-U.S. subsidiaries. Certain countries in which we operate have adopted or could institute currency exchange controls and other regulations or policies that limit or prohibit our local subsidiaries' ability to convert local currency into U.S. dollars or to make payments outside the country. This could subject us to the risks of local currency devaluation and business disruption.\nDisruptions in the credit markets or changes to our credit ratings may adversely affect our business.\nWe currently generate significant cash flows from ongoing operations and have access to global credit markets through our various short- and long- term financing activities. Our financial performance, credit ratings, interest rates, the stability of financial institutions with which we partner, geopolitical or national developments, the stability and liquidity of the credit markets and the state of the global economy could affect the availability and cost of financing. \nDisruption in the credit markets, limitations on our ability to borrow, slower than anticipated debt deleveraging, or a downgrade of our current credit rating could increase our future borrowing costs which could materially and adversely affect our financial condition and results of operations. In addition, tighter or more volatile credit markets may lead to business disruptions for certain of our suppliers, contract manufacturers or trade customers which could, in turn, adversely impact our business, results of operations, cash flows and financial condition.\nWe could decide, or be required to, recall products, which could have a material adverse effect on our business, reputation, results of operations, cash flows or financial position.\n \nWe could decide - or laws, regulations, or administrative action could require us - to recall products due to the failure, or alleged failure, to meet quality or safety standards or specifications, suspected or confirmed and deliberate or unintentional product contamination, manufacturing defects, or other product safety concerns, adulteration, misbranding or tampering. A product recall or a product liability or other claim (even if unsuccessful or without merit) could generate negative publicity about us and our products, and our reputation or that of our brands may be adversely affected. In addition, if another company recalls or experiences negative publicity related to a product in a category in which we compete, adult nicotine consumers might reduce their overall consumption of products in that product category. Any of these events could have a material adverse effect on our business, reputation, results of operations, cash flows or financial position. \nWe may be required to write down assets due to impairment, which could have a material adverse effect on our results of operations or financial position.\n \nWe continuously monitor the values of our long-lived assets, reporting units, intangible assets, as well as investments in equity securities, to determine whether events or changes in circumstances indicate that an impairment exists. Additionally, we test goodwill and non-amortizable intangible assets for impairment annually. The values of these assets may be affected by several factors, including general macroeconomic and geopolitical conditions; regulatory and legal developments; changes in product volume growth rates; changes in pricing strategies and cost bases; discount rates; success of planned new product expansions; competitive activity; and income and excise taxes. If an impairment is determined to exist, we will incur impairment losses, which could have a material adverse effect on our results of operations or financial position. See Item 7. \nManagement’s \n106\nTable of Contents\nDiscussion and Analysis of Financial Condition and Results of Operations—Critical Accounting Estimates\n of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 for additional information concerning impairment determination and calculation. \nOur management uses certain key business metrics to evaluate our business, measure our performance, identify trends affecting our business, formulate financial projections and make strategic decisions and such metrics may not accurately reflect all of the aspects of our business needed to make such evaluations and decisions, in particular as our business continues to evolve.\nIn addition to our consolidated financial results, our management regularly reviews a number of operating and financial metrics, including various revenue, user and sales metrics (such as market shares, in-market sales, adjusted in-market sales, and SFP users) to evaluate our business, measure our performance, identify trends affecting our business, formulate financial projections and make strategic decisions. We believe that these metrics are representative of our current business; however, these metrics may not accurately reflect all aspects of our business and we anticipate that these metrics may change or may be substituted for additional or different metrics as our business evolves. Furthermore, in some instances the metrics are based upon a number of assumptions and estimates that, while presented with numerical specificity, are inherently subject to significant uncertainties and contingencies. If our management fails to account for other relevant information or to substitute the key business metrics they review as our business changes or if the assumptions or estimates underlying the metrics are inaccurate, their ability to accurately formulate financial projections and make strategic decisions may be compromised and our business, financial results and future growth prospects may be adversely impacted.\nRisks Related to the Impact of the War in Ukraine on our Business  \nOur business, results of operations, cash flows and financial position may be adversely impacted by the continuation and consequences of the war in Ukraine.\nIn 2024, Russia accounted for around 9% of our total cigarette and heated tobacco unit shipment volume, and around 6% of our total net revenues. Ukraine accounted for around 2% of our total cigarette and heated tobacco unit shipment volume, and around 1% of our total net revenues. Historically, we also produced finished goods in Ukraine for export and manufactured products in Russia. In 2022, as a result of Russia’s invasion of Ukraine, we suspended planned investments and scaled down our manufacturing operations in Russia. \nThe full implications of the Russian invasion of Ukraine for our operations in those countries are impossible to predict at this time. The likelihood of retaliatory action by the Russian government against companies, including PMI, as a result of actions and statements made in response to the Russian invasion or otherwise, including the possibility of legal action against us or our employees; the deprivation of rights in, or access to, our Russian or Russia-related assets; or nationalization of foreign businesses or assets (including cash reserves held in Russia and intangible assets such as trademarks), is impossible to predict. We are continuously assessing the evolving situation in Russia, including regulatory constraints in the market entailing very complex terms and conditions that must be met for any divestment transaction to be granted approval by the authorities, and restrictions resulting from international regulations. In the event of a divestment, our ability to fully realize the value of the business would likely be subject to material impairment. The deprivation of rights in, or access to, our Russian or Russia-related assets could also result in a material impairment and could cause the deconsolidation of our Russian business. In Ukraine, there is no way to know when and to what extent we will be able to fully normalize our operations or to what extent our workforce, facilities, inventory, and other assets will remain intact. These developments have and will continue to have a material adverse impact on our business, results of operations, cash flows and financial position, and may result in further impairment charges. \nThe conflict also continues to elevate the likelihood of supply chain disruptions, both in the region and globally, and may inhibit our ability to timely source materials and services needed to make and sell our products. For example, historically we sourced certain finished goods, production materials and components from both Russia and Ukraine, including printed materials and filters, and the invasion has, and may continue to, disrupt the availability of and impact our supply chain for these materials. These disruptions, to the extent we are unable to find alternative sources or otherwise address these supply constraints, may impact the availability and cost of our products in other markets, which would adversely impact our business, results of operations, cash flows and financial position, and may result in impairment charges. Furthermore, the imposition of various restrictions on transactions with parties from certain jurisdictions, the ban on exports of various products, and other economic and financial restrictions may adversely affect us or certain third parties with which we do business in Russia, such as customers, suppliers, intermediaries, service providers and banks.\nThe broader consequences of the invasion are also impossible to predict, but could include reputational consequences; further sanctions, financial or currency restrictions, punitive tax law changes, embargoes, regional instability, or geopolitical shifts; and adverse effects on macroeconomic conditions, security conditions, currency exchange rates, and financial markets. Given the nature of our business and global operations, such geo-political instability and uncertainty could increase the costs of our materials and operations; reduce demand for our products; have a negative impact on our supply chains, manufacturing \n107\nTable of Contents\ncapabilities, or distribution capabilities; increase our exposure to currency fluctuations; constrain our liquidity or our ability to access capital markets; create staffing or operations difficulties; or subject us to increased cyber-attacks. While we will continue to monitor this fluid situation and develop contingency plans as necessary to address any disruptions to our business operations as they develop, the extent of the conflict’s effect on our business and results of operations as well as the global economy, cannot be predicted.\nThe conflict may also heighten many other risks disclosed in this report, any of which could adversely affect our business, results of operations, cash flows or financial position. Such risks could affect, without limitation, the achievement of our strategic priorities, including achievement of our smoke-free business growth targets; the availability of third-party manufacturing resources; the availability of attractive acquisition and strategic business opportunities and our ability to fully realize the benefits of these transactions; our ability to attract, motivate, and retain the best global talent; and our loss of revenue from counterfeiting and similar illicit activities.\nRisks Related to Sourcing and Distribution of Products, Services and Materials\nUse of third-parties may negatively impact the distribution, quality, and availability of our products and services, and we may be required to replace third-party contract distributors, manufacturers or service providers.\nWe increasingly rely on third-parties and their subcontractors/suppliers, sometimes concentrated in a specific geographic area, for product distribution and to manufacture some of our products and product parts (particularly, electronic devices and accessories), as well as to provide services, including to support our finance, commercialization and information technology processes. While many of these arrangements improve efficiency and decrease our operating costs, they also diminish our direct control.  Such diminished control may lead to disruption in the distribution of our products and may have a material adverse effect on the quality and availability of products or services, our supply chain, and the speed and flexibility in our response to changing market conditions and adult consumer preferences, all of which may place us at a competitive disadvantage or negatively impact our reputation. In addition, we may be unable to renew these agreements on satisfactory terms for numerous reasons, including government regulations, and the distribution of our products may be disrupted in certain markets or our costs may increase significantly if we must replace such third parties with other partners or our own resources.\nThe effects of climate change, other environmental issues, and related legal or regulatory responses may have a negative impact on our business and results of operations.\nWhile we seek to mitigate our business risks associated with environmental issues, such as climate change, by enhancing our resilience to potential impacts on our business, establishing environmental goals and standards and seeking business partners, including within our supply chain, that are committed to operating in ways that protect the environment or mitigate environmental impacts, we recognize that there are inherent environmental-related risks, including climate change-related risks, wherever business is conducted. Among other potential impacts, climate change could influence the quality and volume of the agricultural products we rely on, including tobacco, due to several factors beyond our control, including more frequent variations in weather patterns, extreme weather events causing unexpected downtime and inventory losses, other adverse weather conditions, and governmental restrictions on trade, all of which may lead to disruption of operations at factories, warehouses and other premises. \nFurthermore, nature-related risks, including those related to natural ecosystems degradation, decreased agricultural productivity in certain regions of the world, biodiversity loss, water resource depletion and deforestation, which are partially driven or exacerbated by climate change, may negatively impact the resilience of, or otherwise disrupt, our business operations or those of our suppliers and business partners.\nThere is a continued and, in some cases, increased focus by certain regulatory and legislative bodies on environmental policies, including by the governmental authorities in certain international jurisdictions where we operate. New environmental-related legal or regulatory requirements may lead to additional carbon taxation, raw or other materials taxation, energy price increases, new compliance costs, increased distribution and supply chain costs, and other expenses impacting our cost of operations. Moreover, given that the regulatory framework in this regard is highly dynamic, additional uncertainties may be driven by further upcoming regulatory changes on which we might have limited visibility or limited time to implement, which could have an impact on several elements of our business, including elevating the cost or complexity of our operations. Even if we make changes to align ourselves with legal or regulatory requirements, we may still be subject to significant penalties if such laws or regulations are interpreted and applied in a manner inconsistent with our practices. Additionally, government authorities, non-governmental organizations and external stakeholders are increasingly filing lawsuits or initiating regulatory actions, alleging that public statements regarding sustainability-related matters and practices are misleading or false.\n108\nTable of Contents\nGovernment mandated prices, production control programs, and shifts in crops driven by economic conditions may increase the cost or reduce the quality of tobacco and other agricultural products used to manufacture our products.\nAs with other agricultural commodities, the price of tobacco leaf and cloves can be influenced by imbalances in supply and demand and the impacts of natural disasters and pandemics such as COVID-19. Tobacco production in certain countries is subject to a variety of controls, including government mandated prices and production control programs. Changes in the patterns of demand for agricultural products could cause farmers to produce less tobacco or cloves. Any significant change in tobacco leaf and clove prices, quality and quantity could affect our profitability and our business.\nA prolonged disruption of our production facilities could have a material adverse effect on our business, financial condition and results of operations.\nA prolonged disruption at or shut-down of one or more of the facilities where our products are produced, especially our \nZYN\n production facility in Kentucky, U.S., which currently supplies substantially all of our capacity for \nZYN\n sales in the U.S., due to natural- or man-made disasters or other events outside of our control, such as equipment malfunction or widespread outbreaks of acute illness, including COVID-19, supply chain constraints, or for any other reason, could limit our capacity to meet customer demands. Such an event could disrupt our operations; delay production, shipments and revenue; and result in significant expense to repair or replace our affected facilities. As a result, we could forgo revenue opportunities and potentially lose market share, which could materially and adversely affect our business, financial condition and results of operations.\nRisks Related to our International Operations\nBecause we have operations in numerous countries, our results may be adversely impacted by economic, regulatory and political developments, natural disasters, pandemics or conflicts.\nSome of the countries in which we operate face the threat of civil unrest and can be subject to regime changes. In others, nationalization, terrorism, conflict and the threats of war or acts of war may have a significant impact on the business environment. Factors beyond our control, such as, without limitation, natural disasters, extreme weather events, pandemics (including COVID-19), economic, political, regulatory, acts of war or threats of war, or other developments could disrupt or increase the expenses related to our supply chain, manufacturing capabilities, distribution capabilities, or the energy and other utility services required to operate our factories, warehouses, and other premises. Our business continuity plans and other safeguards might not always be effective to fully mitigate their impact. Additionally, while we do not now expect that the recent and currently anticipated trade tariffs imposed by the U.S. and other countries will materially impact our business, the global tariff environment is volatile and further tariff or trade related developments could result in risks to PMI’s business, including increased production costs; limited market access; supplier financial condition degradation resulting in reduced or interrupted supplies; and price increases or other economic impacts that could reduce consumer demand. Any of these developments could cause significant volume declines in our Global Travel Retail business and certain other key markets; disrupt or delay our distribution, manufacturing or supply chain; increase currency volatility; increase costs of our materials and operations and lead to loss of property or equipment that are critical to our business in certain markets and difficulty in staffing and managing our operations, all of which could have a material adverse effect on our business, operations, volumes, revenues, cash flows, financial position, net earnings and profitability. We discuss additional risks associated with Russia's invasion of Ukraine and climate change, above.\nIn certain markets, we are dependent on governmental approvals of various actions such as price changes, and failure to obtain such approvals could impair growth of our profitability.\nIn addition, despite our high ethical standards and rigorous controls and compliance policies aimed at preventing and detecting unlawful conduct, given the breadth and scope of our international operations, we may not be able to detect all potential improper or unlawful conduct by our employees and partners. Such improper or unlawful conduct (actual or alleged) could lead to litigation and regulatory action, cause damage to our reputation and that of our brands, and result in substantial costs.  \nOur reported results could be adversely affected by unfavorable currency exchange rates and currency fluctuations could impair our competitiveness. Our results could also be adversely affected by capital controls or by foreign currency exchange constraints or devaluations.\nWe conduct our business primarily in local currency and, for purposes of financial reporting, the local currency results are translated into U.S. dollars based on average exchange rates prevailing during a reporting period. Foreign currencies may fluctuate significantly against the U.S. dollar, reducing our net revenues, operating income and EPS.  Our primary local currency cost bases may be different from our primary currency revenue markets, and U.S. dollar fluctuations against various \n109\nTable of Contents\ncurrencies may have disproportionate negative impact on cash flows and on net revenues as compared to our gross profit and operating income margins. \nCapital controls and/or foreign currency exchange constraints may affect the ability of our subsidiaries in impacted jurisdictions to settle foreign currency denominated imports of goods and services and/or to pay dividends and royalties. These factors may also increase foreign currency devaluation risks, which may have a negative impact on our net assets and results of operations in these jurisdictions. All of which could have a material adverse effect on our financial condition, including our leverage ratios, cash flows, net earnings, and profitability.\nA sustained period of elevated inflation across the markets in which we operate could result in higher operating and financing costs and lead to reduced demand for our products.\nIncreasing inflationary pressures have and may continue to result in significant increases to our expenses, including direct materials, wages, energy, and transportation costs. While we take actions, wherever possible, to reduce the impact of the effects of inflation, in cases of sustained and elevated inflation across several of our major markets, it may be difficult to effectively control the increases to our costs. In recent periods, increased inflation has and may continue to lead to growing pressures on the cost of certain direct materials, wages, energy, transportation, and logistics as well as an increased cost of capital due to interest rate increases driven by the response to increased inflation. Inflationary pressures may also negatively impact consumer purchasing power, which could result in reduced demand for our products. We expect a moderate inflationary increase in the remainder of 2025. If we are unable to increase our prices sufficiently or take other actions to mitigate the effect of inflationary pressures, our profitability and financial position could be negatively impacted.\nRisks Related to Legal Challenges and Investigations\nLitigation related to tobacco products and nicotine products could substantially reduce our profitability and could severely impair our liquidity.\nThere is litigation related to tobacco products and/or nicotine products pending in certain jurisdictions in which we operate. Damages claimed in some tobacco-related litigation are significant and, in certain cases, range into the billions of U.S. dollars. The FCTC encourages litigation against tobacco product manufacturers. It is possible that our consolidated results of operations, cash flows or financial position could be materially adversely affected in a particular fiscal quarter or fiscal year by an unfavorable outcome or settlement of certain pending litigation. We face various administrative and legal challenges related to certain SFP activities, including allegations concerning product classification, advertising and distribution restrictions, corporate communications, product coach activities, scientific substantiation, product liability, antitrust, and unfair competition. As of March 2024, we began facing litigation related to our oral nicotine products before certain courts in the United States. We anticipate that new cases will continue to be filed. While we design our programs to comply with relevant regulations, we expect these or similar challenges to continue as we expand our efforts to commercialize SFPs and to communicate with the public. The outcomes of these matters may affect our SFP commercialization and public communication activities and performance in one or more markets. Also, see Note 9. \nContingencies\n to our consolidated financial statements for a discussion of pending litigation.  \nFrom time to time, we are subject to governmental investigations on a range of matters.\nInvestigations include allegations of contraband shipments of cigarettes, allegations of unlawful pricing activities within certain markets, allegations of underpayment of income taxes, customs duties and/or excise taxes, allegations of false and misleading usage of descriptors, allegations of unlawful advertising or distribution, product safety or specification allegations, and allegations of unlawful labor practices. We cannot predict the outcome of those investigations or whether additional investigations may be commenced, and it is possible that our business could be materially adversely affected by an unfavorable outcome of pending or future investigations. See Note 9. \nContingencies—Other Litigation\n to our condensed consolidated financial statements and Part I, Item 2. \nManagement's Discussion and Analysis of Financial Condition and Results of Operations—Operating Results by Business Segment—Business Environment—Governmental Investigations\n in this report for a description of certain governmental investigations to which we are subject.\nWe may be unable to adequately protect our intellectual property rights, and disputes relating to intellectual property rights could harm our business.\nOur intellectual property rights are valuable assets, their protection is important to our business, and that protection may not be equally available in every country in which we operate or in which our products are sold.  If the steps we take to protect our intellectual property rights globally, including through applying for, prosecuting, maintaining and enforcing, where relevant, a combination of trademark, design, copyright, patent, trade secrets and other intellectual property rights, are inadequate, or if \n110\nTable of Contents\nothers infringe or misappropriate our intellectual property rights, notwithstanding legal protection, our business, financial condition, and results of operations could be adversely impacted. Moreover, failing to manage our existing and/or future intellectual property may place us at a competitive disadvantage. Intellectual property rights of third parties may limit our ability to develop, manufacture and/or commercialize our products in one or more markets. Competitors or other third parties may claim that we infringe their intellectual property rights. Any such claims, regardless of merit, could divert management’s attention, be costly, disruptive, time-consuming and unpredictable and expose us to significant litigation costs and damages, and may impede our ability to develop, manufacture and/or commercialize new or existing SFPs and improve our products, and thus have a material adverse effect on our revenues and our profitability.  In addition, if, as a result, we are unable to manufacture or sell our SFPs or improve their quality in one or more markets, our ability to convert adult smokers to our SFPs in such markets would be adversely affected. See Note 9. \nContingencies— Other Litigation\n to our condensed consolidated financial statements for a description of certain intellectual property proceedings.\nThe research, development, and commercialization of non-recreational cannabinoid products subjects the Company to legal, regulatory, reputational and other risks.\nOur Wellness and Healthcare business is researching, developing, and exploring the commercialization of medical and pharmaceutical cannabinoids and non-recreational cannabinoid products (including CBD). Our Wellness and Healthcare business currently anticipates pursuing these activities in select non-U.S. markets. While we will undertake the activities in a manner consistent with all applicable requirements, successful commercialization is dependent on compliance with a constantly evolving legal and regulatory environment, and subjects us to various legal, reputational and regulatory risks, which could have a material, adverse effect on our business and results of operations. A failure by our Wellness and Healthcare business to comply with applicable laws could result in criminal, civil, or tax liability.  \nRisks Related to our Competitive Environment\nWe face intense competition, and our failure to compete effectively could have a material adverse effect on our profitability and results of operations.\nWe are subject to highly competitive conditions in all aspects of our business.  We compete primarily on the basis of product quality, brand recognition, brand loyalty, taste, R&D, innovation, packaging, customer service, marketing, advertising and retail price. The competitive environment and our competitive position can be significantly influenced by weak economic conditions; erosion of consumer confidence; competitors' introduction of lower-price products or innovative products; adult smoker willingness to convert to our SFPs; higher product taxes; higher absolute prices and larger gaps between retail price categories; unfair competition; and product regulation that diminishes the ability to differentiate tobacco products, restricts adult consumer access to truthful and non-misleading information about our SFPs, or disproportionately impacts the commercialization of our products in relation to our competitors. \nCompetitors in our industry include Altria Group, Inc., British American Tobacco plc, Japan Tobacco Inc., Imperial Brands plc, new market entrants, particularly with respect to innovative products, several regional and local tobacco companies and, in some instances, state-owned tobacco enterprises, principally in Algeria, Egypt, China, Taiwan, Thailand and Vietnam. Some competitors have different profit, volume and regulatory objectives, some international competitors may be less susceptible than PMI to changes in currency exchange rates, and some competitors may sell products in circumvention of applicable regulations that compete directly with our products.  Certain new market entrants in the non-combustible product category may alienate consumers from innovative products through inappropriate marketing campaigns, messaging and inferior product satisfaction, and without scientific substantiation based on appropriate R&D protocols and standards.  The growing use of digital media could increase the speed and extent of the dissemination of inaccurate and misleading information about our SFPs, all of which could have a material adverse effect on our profitability and results of operations. See Item 1. \nBusiness—Competition \nof our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 for a description of the competitive environment in which we operate.\n111\nTable of Contents\nWe may be unable to anticipate changes in adult consumer preferences.\nOur business is subject to changes in adult consumer preferences, which may be influenced by local economic conditions, accessibility to our products and availability of accurate information related to our products.   \nTo be successful, we must: \n•\npromote brand equity successfully;\n•\nanticipate and respond to new adult consumer trends;\n•\nensure that our products meet our quality standards;\n•\ndevelop new products and markets and broaden brand portfolios;\n•\nimprove productivity;\n•\neducate and encourage adult smokers to convert to our SFPs;\n•\nensure effective adult consumer engagement, including communication about product characteristics and usage of SFPs;\n•\nmitigate the impact of developments that cause damage to our reputation and that of our brands;\n•\nprovide excellent customer care;\n•\nensure adequate production capacity to meet demand for our products; and\n•\nbe able to protect or enhance margins through price increases.\nIn periods of economic uncertainty, adult consumers may tend to purchase low-price brands, and the volume of our premium-price and mid-price brands and our profitability could be materially adversely impacted as a result. Such down-trading trends may be reinforced by regulation that limits branding, communication and product differentiation. In addition to economic uncertainty (including recessions and inflation) unusual weather events and global or local epidemics, endemics or pandemics (such as COVID-19) has and may change the preferences of our adult consumers and lower demand for our products, particularly for our mid-price or premium-price brands. \nOur ability to grow profitability may be limited by our inability to introduce new products, enter new markets, maintain sufficient production capacity, or improve our margins through higher pricing and improvements in our brand and geographic mix.\nOur profit growth may be materially adversely impacted if we are unable to introduce new products or enter new markets successfully, to meet the demand for our products with increased production capacity, to raise prices, or to improve the proportion of our sales of higher margin products and in higher margin geographies.\nWe may be unable to expand our brand portfolio through acquisitions or the development of strategic business relationships, and the intended benefits from our investments may not materialize.\nOne element of our growth strategy is to expand our brand portfolio and market positions through selective acquisitions and the development of strategic business relationships. Acquisition and strategic business development opportunities are limited and present risks of failing to achieve efficient and effective integration, strategic objectives and/or anticipated revenue improvements and cost savings. There is no assurance that we will be able to acquire attractive businesses or enter into strategic business relationships on favorable terms ahead of our competitors, or that such acquisitions or strategic business development relationships will be accretive to earnings or improve our competitive position. In addition, we may not have a controlling position in certain strategic investments or relationships, which could impact the extent to which the intended financial growth and other benefits from these investments or relationships may ultimately materialize.\nOur ability to achieve our strategic goals may be impaired if we fail to attract, motivate and retain the best global talent and effectively align our organizational design with the goals of our transformation.\nTo be successful, we must continue transforming our culture and ways of working, align our talent and organizational design with our increasingly complex business needs, and innovate and transform to a consumer-centric business.  We compete for talent, including in areas that are relatively new to us such as digital, information technology, and life sciences, with companies in the consumer products, technology, pharmaceutical and other sectors that enjoy greater societal acceptance. As a result, we may be unable to attract, motivate and retain the best global talent with the right degree of diversity, experience and skills to achieve our strategic goals.\n112\nTable of Contents\nRisks Related to Illicit Trade\nOur revenues may be materially adversely affected as a result of counterfeiting, contraband, cross-border purchases, illicit products, non-tax-paid volume produced by local manufacturers, and other non-compliant or illicit cigarettes or smoke-free products.\nLarge quantities of counterfeit cigarettes are sold in the international market. We believe that \nMarlboro\n is the most heavily counterfeited international cigarette brand, although we cannot quantify the revenues we lose as a result of this activity. Counterfeits of our smoke-free products are not subject to our scientific validation procedures, are unlikely to meet our product quality standards, and may materially adversely affect the reputation of our smoke-free products with consumers, regulators, and other stakeholders. In addition, our revenues may be materially adversely affected by counterfeiting, contraband, cross-border purchases, non-tax-paid volume produced by local manufacturers and other non-compliant or illicit cigarettes or smoke-free products.\nRisks Related to Cybersecurity, Data Governance and Artificial Intelligence\nWe are significantly dependent on our and third-party information technology networks and systems, and a cybersecurity incident or attack against those networks or systems may adversely impact our business and operations.\nWe and our business partners heavily rely on information technology networks and systems, including those connected to the Internet, to help manage business processes and operations, including the collection, storage, interpretation, and processing of confidential, sensitive, personal and other data; internal and external communications; marketing and e-commerce activities; the manufacture, sale, and distribution of our products; management of third-party business relationships; engagement with governmental authorities; innovation through research and development; and other activities necessary for  business operations. Some of these information systems and networks are developed, supplied, or managed by third-party service providers that may make us vulnerable to “supply chain” style cyberattacks. Additionally, some information technology systems may be supported by artificial intelligence capabilities that may not function as intended, posing cybersecurity, data governance and data protection risks. The failure or disruption of our information technology networks and systems, or those managed by third-party service providers or owned by our business partners and used in furtherance of PMI’s business, due to cybersecurity attacks; unauthorized attempts to corrupt or extract data; security vulnerabilities; misconfigurations; human error; or failure or inability by us, third-parties, or our business partners to adhere to cybersecurity industry best practices, could place us at a competitive disadvantage, cause reputational damage, impact our operations, result in data breaches, significant business disruption, litigation, regulatory action including significant fines or penalties, financial impact, loss of revenue or assets including our intellectual property, personal, confidential, or sensitive data.\nCyberattacks, security incidents and vulnerabilities impacting PMI, acquired companies, our business partners, or our third-party providers, continue to dynamically evolve in sophistication and volume, making it difficult for us to predict probability, frequency, and impact severity of security incidents. Further, it may be inherently difficult to detect vulnerabilities during due diligence, for long periods of time, or soon enough to mitigate exploitation. There can be no assurance that such security incidents or vulnerabilities will not have a material adverse effect on us in the future. While PMI works to mitigate these risks by implementing a cybersecurity risk program and a third-party cybersecurity risk management program, there can be no assurance that these programs are comprehensive or accurately identify and sufficiently mitigate all cybersecurity risks.    \nWe continue to make investments in administrative, technical, and physical safeguards to maintain information security protections in line with industry standards and best practices. We evaluate the adequacy of preventative actions to reduce security incidents on an ongoing basis.  \nCyberattacks, security incidents and vulnerabilities have impacted, and we expect will continue to impact, PMI, our business partners, and our third-party providers. Cyberattacks continue to dynamically evolve in sophistication and volume, making it difficult for us to predict probability, frequency, and impact severity of security incidents on the Company. We also have, and continue to face, immaterial third-party information security breaches. While these types of incidents have occurred frequently within the last three years, none have been material to our business, financial condition, or results. \nOur safeguards may not, however, be effective in mitigating the impact of service disruptions or other failures of these information technology networks and systems. Failure to timely respond and mitigate security incidents could result in wide-ranging business interruptions. Such security incidents could place us at a competitive disadvantage; result in financial impacts, a loss of revenue, assets, including our intellectual property, personal or other sensitive data; result in litigation and regulatory action including significant fines or penalties; impact our operations; cause damage to our reputation and that of our brands; and \n113\nTable of Contents\nresult in significant remediation and other costs.  See Item 1C. \nCybersecurity\n of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 for a description of our cybersecurity risk management and strategy and governance.\nOur or our business partners’ failure or inability to adhere to privacy, data, artificial intelligence and information security laws could result in business disruption, loss of reputation and consumer trust, litigation, regulatory action including significant fines or penalties, financial impact, and loss of revenue, assets or personal, confidential, or sensitive data.\nAn actual or alleged failure to comply with complex and changing privacy, data, artificial intelligence and information security laws and regulations such as under the EU General Data Protection Regulation, various U.S. state and federal laws, and other similar privacy, data, and information security laws, regulations, or voluntary guidelines that could establish legal duties across the various jurisdictions in which PMI operates, such as the failure or inability to protect or safeguard personal or company data, or information systems and networks, including connected products; implement or execute appropriate technological and reasonable security and organizational measures; implement and maintain appropriate safeguards for personal or company data being transferred internationally or between third parties; respect the privacy, digital, or other rights of data subjects; provide sufficient detailed notices, information, or transparency obligations related to personal or other data processing; obtain appropriate consent and opt-outs; respond to data subject or other data requests in a timely fashion; meet stringent timeframe requirements for incident reporting to regulatory authorities or data subjects; notify all relevant regulatory authorities or data subjects; comply with artificial intelligence regulations, and others, could have a material adverse effect on us, subject us to substantial fines and/or legal challenges, and/or harm our business, reputation, financial condition, or operating results. Such laws and regulations across the jurisdictions in which PMI operates may vary, resulting in inconsistent or conflicting legal obligations. Although we maintain a cyber liability insurance policy to address many of these risks, such policy may not be sufficient to prevent a cybersecurity incident or attack from resulting in a material adverse effect on our business, reputation, financial condition, or operating results.\nWe increasingly use artificial intelligence-based solutions in our business, which could result in reputational harm, legal liability, and adversely affect our operating results.\nWe and our business partners are increasingly incorporating artificial intelligence (\"AI\")-based solutions in our ways of working and operations, but this process involves uncertainty and risks, which may or may not yield corresponding benefits. Artificial intelligence technologies are complex, and there are technical and organizational challenges associated with achieving optimal levels of accuracy, efficiency, safety, explicability, reliability, and use for their intended purposes. Flaws, biases, data sourcing issues, limitations, errors, misconfiguration, or malfunctions in these systems could result in operational disruptions, including data loss and corruption. There is a risk of artificial intelligence system failures, disruptions, or vulnerabilities that could compromise PMI’s information technology networks and systems and the integrity, availability, security, or privacy of PMI data processed by or through such systems. The emergence of AI and other technologies may also exacerbate other risks, including those related to regulation, litigation, compliance issues, ethical concerns, confidentiality, intellectual property ownership and infringement, and data privacy or security. Separately, AI presents a new attack surface that cybercriminals will attempt to exploit as well as providing means to scale and automate targeted attacks. Ineffective or inadequate artificial intelligence development, adoption, or deployment practices, including any use, reliance, or dependence on AI generated outputs, could result in unintended, unexpected, or otherwise unforeseen adverse consequences. These risks could have a material adverse effect on our business, reputation, financial condition, or operating results. \nRisks Related to Acquisitions and Divestitures\nWe may not successfully identify, complete, or realize the benefits from strategic acquisitions, divestitures, joint ventures, or investments. \nFrom time to time, we evaluate acquisition candidates, joint ventures, or investments that may strategically fit our business objectives. As a result of some of these evaluations, we have acquired and may acquire in the future certain businesses (or parts of businesses) or assets. We have also divested and may divest businesses from time to time. These activities may present financial, managerial, and operational risks including, but not limited to, diversion of management’s attention from existing core businesses; difficulties in integrating, or inability to successfully integrate, acquired businesses, including integrating or separating personnel, information technology, financial and other systems; inability to effectively and immediately implement control environment processes across a diverse employee population; adverse effects on existing or acquired customer and supplier business relationships; potential disputes with buyers, sellers, or partners, as well as other unanticipated problems or liabilities, such as contingent liabilities and litigation. Activities in such areas are regulated by numerous antitrust and competition laws in the United States, the European Union, the United Kingdom, and elsewhere. We have in the past and may in the future be required to obtain approval of these transactions by competition or other regulatory authorities or to satisfy \n114\nTable of Contents\ncertain legal requirements, and we may be unable to obtain such approvals or satisfy such requirements, each of which may result in additional costs, delays, or our inability to complete such transactions. Any of these factors could prevent us from realizing the anticipated benefits of any such transaction and/or could materially and adversely affect our financial condition and operating results. \nWe may face additional risks related to divestitures. For example, risks related to our ability to find appropriate buyers, execute transactions on favorable terms, separate divested business operations with minimal impact to our remaining operations, and effectively manage any transitional or long-term service arrangements. Further, our divestiture activities may require us to recognize impairment charges. Any of these factors could materially and adversely affect our financial condition and operating results. \nAccounting adjustments related to acquisitions could adversely affect our financial results.\nGiven the nature of assets acquired through acquisitions, we may not be able to avoid future impairments of those assets, which may also have a material adverse impact on our future operating results and financial position.\n115\nTable of Contents"
}