{
  "source_file": "pnr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-looking statements\nThis report contains statements that we believe to be “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. All statements, other than statements of historical fact, are forward-looking statements. Without limitation, any statements preceded or followed by or that include the words “targets,” “plans,” “believes,” “expects,” “intends,” “will,” “likely,” “may,” “anticipates,” “estimates,” “projects,” “should,” “would,” “could,” “positioned,” “strategy,” or “future” or words, phrases, or terms of similar substance or the negative thereof are forward-looking statements. These forward-looking statements are not guarantees of future performance and are subject to risks, uncertainties, assumptions and other factors, some of which are beyond our control, which could cause actual results to differ materially from those expressed or implied by such forward-looking statements. These factors include the overall global economic and business conditions impacting our business, including the strength of housing and related markets and conditions relating to international hostilities; supply, demand, logistics, competition and pricing pressures related to and in the markets we serve; the ability to achieve the benefits of our restructuring plans, cost reduction initiatives and Transformation Program; the impact of raw material, logistics and labor costs and other inflation; volatility in currency exchange rates and interest rates; failure of markets to accept new product introductions and enhancements; the ability to successfully identify, finance, complete and integrate acquisitions; risks associated with operating foreign businesses; the impact of seasonality of sales and weather conditions; our ability to comply with laws and regulations; the impact of changes in laws, regulations and administrative policy, including those that limit U.S. tax benefits or impact trade agreements and tariffs; the outcome of litigation and governmental proceedings; and the ability to achieve our long-term strategic operating and sustainability goals and targets. Additional information concerning these and other factors is contained in our filings with the U.S. Securities and Exchange Commission, including this Form 10-Q and our Annual Report on Form 10-K for the year ended December 31, 2024. All forward-looking statements speak only as of the date of this report. Pentair assumes no obligation, and disclaims any obligation, to update the information contained in this report.\nOverview\nThe terms “us,” “we,” “our” or “Pentair” refer to Pentair plc and its consolidated subsidiaries. At Pentair, we believe the health of our world depends on reliable access to clean water. We deliver a comprehensive range of smart, sustainable water solutions to homes, businesses and industries around the world. Our industry-leading and proven portfolio of solutions enables our customers to access clean, safe water; reduce water consumption; and recover and reuse water. Whether it’s moving, improving or helping people enjoy water, we help manage life’s most essential resource. We are comprised of three reportable segments: Flow, Water Solutions and Pool. For the first nine months of 2025, the Flow, Water Solutions and Pool reportable segments represented approximately 37%, 26% and 37% of total consolidated net sales, respectively. We classify our operations into reportable segments based primarily on types of products offered and markets served:\n•\nFlow \n— The focus of this segment is to deliver water where it is needed, when it is needed, more efficiently and to transform waste into value. This segment designs, manufactures and sells a variety of fluid treatment and pump products and systems, including pressure vessels, gas recovery solutions, membrane bioreactors, wastewater reuse systems and advanced membrane filtration, separation systems, specialty insertion valves, line stop fittings and installation equipment, water disposal pumps, water supply pumps, fluid transfer pumps, turbine pumps, solid handling pumps and agricultural spray nozzles, while serving the global residential, commercial and industrial markets. These products and systems are used in a range of applications, including fluid delivery, ion exchange, desalination, food and beverage, separation technologies for the oil and gas industry, residential and municipal wells, water treatment, wastewater solids handling, pressure boosting, circulation and transfer, fire suppression, flood control, agricultural irrigation and crop spray.\n•\nWater Solutions \n— The focus of this segment is to provide great-tasting, higher-quality water and ice while helping people use water more productively. This segment designs, manufactures and sells commercial and residential water treatment products and systems including pressure tanks, control valves, activated carbon products, commercial ice machines, conventional filtration products, and point-of-entry and point-of-use water treatment systems. These water treatment products and systems are used in residential whole home water filtration, drinking water filtration and water softening solutions in addition to commercial total water management and filtration in foodservice operations.\n23\nTable of Contents\n•\nPool \n— The focus of this segment is to provide innovative, energy-efficient pool solutions to help people more sustainably enjoy water. This segment designs, manufactures and sells a complete line of energy-efficient residential and commercial pool equipment and accessories including pumps, filters, heaters, lights, automatic controls, automatic cleaners, maintenance equipment and pool accessories. Applications for our pool products include residential and commercial pool maintenance, pool repair, renovation, service, construction and aquaculture solutions.\nOn September 17, 2025, as part of our Flow reportable segment, we completed the acquisition of Hydra-Stop, LLC (“Hydra-Stop”) for $292.2 million in cash, net of cash acquired, and subject to customary adjustments. Hydra-Stop manufactures specialty insertion valves, line stop fittings and installation equipment.\nOn December 2, 2024, as part of our Pool reportable segment, we completed the acquisition of G & F Manufacturing, LLC   (“G & F Manufacturing”) for $116.0 million in cash, net of cash acquired and subject to customary adjustments. The net purchase price is comprised of an upfront cash payment of $108.0 million, subject to customary adjustments, and the estimated fair value at the acquisition date of a contingent earn-out liability based upon the achievement of certain defined operating results in the two years following the acquisition. G & F Manufacturing manufactures and services pool heat pumps.\nKey trends and uncertainties regarding our existing business\nThe following trends and uncertainties affected our financial performance in the first nine months of 2025 and are reasonably likely to impact our results in the future:\n•\nWe have a Transformation Program designed to accelerate growth and drive margin expansion by driving operational excellence, reducing complexity and streamlining our processes. During 2024 and the first nine months of 2025, we made strategic progress on our Transformation Program initiatives with a focus on our four key themes of pricing excellence, sourcing excellence, operations excellence and organizational effectiveness. We expect to continue to execute on our key Transformation Program initiatives to drive margin expansion and to continue to incur transformation costs throughout the remainder of 2025 and beyond.\n•\nDuring 2024 and the first nine months of 2025, we implemented 80/20 guiding principles to enable our Transformation Program. This 80/20 analysis is expected to create value by focusing on key customers and products through quadrant-based strategies. We expect the analysis to result in actions to improve operating performance by driving growth with our highest value customers, reducing lower margin sales and removing complexity in the future.\n•\nDuring 2024 and the first nine months of 2025, we executed certain business restructuring initiatives aimed at reducing our fixed cost structure and realigning our business. We expect these actions to continue throughout the remainder of 2025 and to drive margin growth.\n•\nDuring 2024 and the first nine months of 2025, we experienced inflationary cost increases for certain raw materials as well as logistics and transportation costs. The ongoing volatile market for commodities has the potential to continue to drive price increases in our supply chain. In addition, the current U.S. administration has implemented tariffs and has announced the possibility of implementing additional, or increasing current, tariffs. We expect these actions and reactionary tariff adjustments by other countries to continue to impact our business and contribute to inflationary cost increases. As a result, we have taken actions to mitigate the impact of tariffs such as pricing increases, inventory pre-buys and supply chain optimization actions, which may continue going forward. In addition, our Transformation Program initiatives are intended to improve productivity and offset cost increases. We anticipate supply chain pressures as well as inflationary cost increases due to these tariffs and any resulting impact on macroeconomic conditions and our business to continue throughout the remainder of 2025.\n•\nThe Organization for Economic Co-operation and Development Pillar Two Model Rules (“Pillar Two”) for a global 15.0% minimum tax have been adopted by a number of jurisdictions in which we operate. Pillar Two has negatively impacted our effective tax rate in 2025 and is likely to continue to impact our effective tax rate in the future. We continue to evaluate the enacted legislative changes and new guidance as it becomes available.\n•\nWe have identified specific product and geographic market opportunities that we find attractive and continue to pursue, both within and outside the U.S. We expect to continue investing in our businesses to drive these opportunities through research and development and additional sales and marketing resources. Unless we successfully penetrate these markets, our core sales growth will likely be limited or may decline.\n24\nTable of Contents\nIn 2025, our operating objectives focus on delivering our core and building our future. We expect to execute these objectives by:\n•\nDelivering profitable revenue growth and productivity for customers and shareholders; \n•\nContinuing to focus on capital allocation through:\n◦\nCommitting to maintain our investment grade rating; \n◦\nFocusing on reducing our long-term debt;\n◦\nReturning cash to shareholders through dividends and share repurchases; and\n◦\nAccelerating our performance with strategically aligned mergers and acquisitions;\n•\nFocusing growth initiatives that accelerate our investments in digital, innovation, technology and sustainability;\n•\nContinuing to implement our Transformation Program initiatives that will drive operational excellence, reduce complexity and improve our organizational structure, which includes the focus on 80/20 actions to drive profitable growth; and\n•\nBuilding a high-performance growth culture and delivering on our commitments while living our Win Right values.\nCONSOLIDATED RESULTS OF OPERATIONS\nThe consolidated results of operations for the three months ended September 30, 2025 and 2024 were as follows:\n \nThree months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\n$ \nChange\n% / Point \nChange\nNet sales\n$\n1,022.0 \n$\n993.4 \n$\n28.6 \n2.9 \n%\nCost of goods sold\n603.4 \n600.2 \n3.2 \n0.5 \n%\nGross profit\n418.6 \n393.2 \n25.4 \n6.5 \n%\n      \n% of net sales\n41.0 \n%\n39.6 \n%\n1.4 \n pts\n \nSelling, general and administrative\n162.2 \n190.4 \n(28.2)\n(14.8)\n%\n      \n% of net sales\n15.9 \n%\n19.2 \n%\n(3.3)\n pts\nResearch and development\n24.7 \n22.9 \n1.8 \n7.9 \n%\n      % of net sales\n2.4 \n%\n2.3 \n%\n0.1 \n pts\nOperating income \n231.7 \n179.9 \n51.8 \n28.8 \n%\n      % of net sales\n22.7 \n%\n18.1 \n%\n4.6 \n pts\nOther expense (income)\n0.6 \n(0.1)\n0.7 \nN.M.\nNet interest expense\n14.4 \n19.8 \n(5.4)\n(27.3)\n%\nIncome from continuing operations before income taxes\n216.7 \n160.2 \n56.5 \n35.3 \n%\nProvision for income taxes\n32.4 \n20.6 \n11.8 \n57.3 \n%\n      Effective tax rate\n15.0 \n%\n12.9 \n%\n2.1 \n pts\nN.M. = Not Meaningful\n25\nTable of Contents\nThe consolidated results of operations for the nine months ended September 30, 2025 and 2024 were as follows: \nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\n$ \nChange\n% / Point \nChange\nNet sales\n$\n3,155.5 \n$\n3,109.9 \n$\n45.6 \n1.5 \n%\nCost of goods sold\n1,877.0 \n1,888.7 \n(11.7)\n(0.6)\n%\nGross profit\n1,278.5 \n1,221.2 \n57.3 \n4.7 \n%\n      \n% of net sales\n40.5 \n%\n39.3 \n%\n1.2 \n pts\nSelling, general and administrative expenses\n552.6 \n540.7 \n11.9 \n2.2 \n%\n      \n% of net sales\n17.5 \n%\n17.4 \n%\n0.1 \n pts\nResearch and development expenses\n73.4 \n71.8 \n1.6 \n2.2 \n%\n      % of net sales\n2.3 \n%\n2.3 \n%\n— \n pts\nOperating income \n652.5 \n608.7 \n43.8 \n7.2 \n%\n      % of net sales\n20.7 \n%\n19.6 \n%\n1.1 \n pts\nLoss on sale of business\n26.3 \n— \n26.3 \nN.M.\nOther expense\n2.1 \n0.8 \n1.3 \nN.M.\nNet interest expense\n52.0 \n73.4 \n(21.4)\n(29.2)\n%\nIncome from continuing operations before income taxes\n572.1 \n534.5 \n37.6 \n7.0 \n%\nProvision for income taxes\n84.4 \n75.3 \n9.1 \n12.1 \n%\n      Effective tax rate\n14.8 \n%\n14.1 \n%\n0.7 \n pts\nN.M. = Not Meaningful\nNet sales\nThe components of the consolidated net sales change from the prior period were as follows:\nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period \nVolume\n(0.5)\n%\n(2.1)\n%\nPrice\n3.8 \n3.4 \nCore growth\n3.3 \n1.3 \nAcquisition/Divestitures\n(1.4)\n(0.1)\nCurrency\n1.0 \n0.3 \nTotal\n2.9 \n%\n1.5 \n%\nThe 2.9 and 1.5\n \npercent increases in net sales in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nincreased selling prices across all of our segments to mitigate inflationary cost increases;\n•\nfavorable foreign currency effects compared to the same periods of the prior year; \n•\nincreased sales volume in our commercial and industrial businesses in our Flow segment compared to the third quarter of the prior year; and\n•\nincreased sales volume within our Pool segment due to higher demand compared to the same periods of the prior year.\n26\nTable of Contents\nThese increases were partially offset by:\n•\ndecreased sales volume within our Water Solutions segment compared to the same periods of the prior year; \n•\ndecreased sales volume within our Flow segment compared to the first nine months of the prior year; and\n•\nbusiness exits during the fourth quarter of 2024 and second quarter of 2025 in our residential and commercial businesses of our Water Solutions segment.\nGross profit\nThe 1.4 and 1.2 percentage point increases in gross profit as a percentage of net sales in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nincreased selling prices across all our segments to mitigate inflationary cost increases;\n•\nincreased productivity in our Flow and Water Solutions segments mainly driven by transformation initiatives; and\n•\nasset impairment and write-offs of $1.1 million in the third quarter of 2025, compared to $2.8 million in the third quarter of 2024.\nThese increases were partially offset by:\n•\ninflationary cost increases, including higher tariffs, certain raw materials and labor costs; and\n•\nasset impairment and write-offs of $16.6 million in the first nine months of 2025, compared to $3.5 million in the first nine months of 2024.\nSelling, general and administrative expenses (“SG&A”)\nThe 3.3 percentage point decrease in SG&A as a percentage of net sales in the third quarter of 2025 from 2024 was primarily driven by:\n•\nrestructuring and other costs of $4.3 million in the third quarter of 2025, compared to $23.4 million in the third quarter of 2024;\n•\ntransformation costs of $10.8 million in the third quarter of 2025, compared to $12.6 million in the third quarter of 2024; and\n•\nasset impairment charges of $0.4 million in the third quarter of 2025, compared to $5.7 million in the third quarter of 2024.\nThe\n \n0.1 percentage point increase in SG&A as a percentage of net sales in the first nine months of 2025 from 2024 was primarily driven by:\n•\nan impairment charge of $30.9 million related to the write-off of a definite-lived customer relationship intangible asset as a result of a business exit within our Water Solutions segment during the second quarter of 2025.\nThis increase was partially offset by:\n•\nrestructuring and other costs of $29.8 million in the first nine months of 2025, compared to $33.9 million in the first nine months of 2024; and\n•\ntransformation costs of $32.6 million in the first nine months of 2025, compared to $41.4 million in the first nine months of 2024.\nNet interest expense\nThe 27.3 and 29.2 percent decreases in net interest expense in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by: \n•\nlower debt levels compared to the same periods of the prior year; and\n•\nlower interest rates in the third quarter of 2025 compared to the third quarter of 2024.\n27\nTable of Contents\nProvision for income taxes\nThe 2.1\n \nand 0.7\n \npercentage point\n \nincreases\n \nin the effective tax rate in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nthe unfavorable mix of global earnings; and\n•\na decrease in the amount of favorable discrete items in 2025 compared to 2024.\nSEGMENT RESULTS OF OPERATIONS\nThe summary that follows provides a discussion of the results of operations of our three reportable segments (Flow, Water Solutions and Pool). Each of these segments comprises various product offerings that serve multiple end users.\nWe evaluate performance based on net sales and reportable segment income (“segment income”) and use certain ratios, particularly return on sales, to measure performance of our reportable segments. Segment income represents operating income of each reportable segment inclusive of equity income of unconsolidated subsidiaries and exclusive of intangible amortization, costs of restructuring and transformation activities, impairments, legal accrual adjustments and settlements and other unusual non-operating items.\nFlow \nThe net sales and segment income for Flow were as follows:\nThree months ended\nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nNet sales\n$\n394.0 \n$\n372.2 \n5.9%\n$\n1,159.2 \n$\n1,153.3 \n0.5%\nSegment income\n95.3 \n82.8 \n15.1%\n272.0 \n244.5 \n11.2%\n      % of net sales\n24.2 \n%\n22.2 \n%\n2.0 \n pts\n23.5 \n%\n21.2 \n%\n2.3 \n pts\nNet sales\nThe components of the change in \nFlow\n net sales from the prior period were as follows:\nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume\n0.4 \n%\n(3.1)\n%\nPrice\n3.2 \n2.8 \nCore growth\n3.6 \n(0.3)\nAcquisition/Divestiture\n0.4 \n0.1 \nCurrency\n1.9 \n0.7 \nTotal\n5.9 \n%\n0.5 \n%\nThe 5.9 and 0.5 percent increases in net sales for Flow in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nincreased selling prices to mitigate inflationary cost increases;\n•\nfavorable foreign currency effects compared to the same periods of the prior year;\n•\nincreased sales volume in our commercial and industrial businesses compared to the third quarter of the prior year; and\n•\nincreased sales due to the acquisition of Hydra-Stop completed in the third quarter of 2025.\nThese increases were partially offset by:\n•\ndecreased sales volume compared to the first nine months of the prior year.\n28\nTable of Contents\nSegment income\nThe components of the change in Flow segment income as\n a percentage of net sales from the prior period were as follows:\n \nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume/Price/Acquisition/Divestiture\n3.7 \n pts\n3.0 \n pts\nCurrency\n— \n0.1 \nInflation\n(3.8)\n(3.0)\nProductivity\n2.1 \n2.2 \nTotal\n2.0 \n pts\n2.3 \n pts\nThe 2.0 and\n \n2.3 percentage point increases in segment income for Flow as a percentage of net sales in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n \n•\nincreased selling prices to mitigate impacts of inflation; and\n•\nincreased productivity mainly driven by transformation initiatives.\nThese increases were partially offset by:\n•\ninflationary cost increases, including higher tariffs and certain raw materials.\nWater Solutions\nThe net sales and segment income for Water Solutions were as follows:\nThree months ended\nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nNet sales\n$\n273.3 \n$\n289.5 \n(5.6)%\n$\n829.8 \n$\n873.1 \n(5.0)%\nSegment income\n68.4 \n64.4 \n6.2%\n199.3 \n192.9 \n3.3%\n      % of net sales\n25.0 \n%\n22.2 \n%\n2.8 \n pts\n24.0 \n%\n22.1 \n%\n1.9 \n pts\nNet sales\nThe components of the change in Water Solutions net sales from the prior period were as follows:\nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume\n(4.6)\n%\n(5.6)\n%\nPrice\n5.1 \n3.3 \nCore growth\n0.5 \n(2.3)\nAcquisition/Divestiture\n(6.8)\n(3.0)\nCurrency\n0.7 \n0.3 \nTotal\n(5.6)\n%\n(5.0)\n%\nThe 5.6\n \nand\n \n5.0 percent decreases in net sales for Water Solutions in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\ndecreased sales volume compared to the same periods of the prior year; and\n•\nbusiness exits during the fourth quarter of 2024 and second quarter of 2025 in our residential and commercial businesses.\nThese decreases were partially offset by:\n•\nincreased selling prices to mitigate inflationary cost increases; and\n29\nTable of Contents\n•\nfavorable foreign currency effects compared to the same periods of the prior year.\nSegment income\nThe components of the change in Water Solutions segment income as a percentage of net sales from the prior period were as follows:\n \nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume/Price/Acquisition/Divestiture\n4.3 \n pts\n2.4 \n pts\nCurrency\n0.2 \n0.1 \nInflation\n(4.2)\n(3.4)\nProductivity\n2.5 \n2.8 \nTotal\n2.8 \n  pts\n1.9 \n  pts\nThe 2.8 and\n \n1.9 percentage point increases\n \nin segment income for Water Solutions as a percentage of net sales in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nincreased selling prices to mitigate impacts of inflation; and\n•\nincreased productivity mainly driven by transformation initiatives.\nThis increases were partially offset by:\n•\ninflationary cost increases, including higher tariffs and certain raw materials.\nPool\nThe net sales and segment income for Pool were as follows:\nThree months ended\nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nSeptember 30,\n2025\nSeptember 30,\n2024\n% / Point Change\nNet sales\n$\n354.3 \n$\n331.4 \n6.9%\n$\n1,165.4 \n$\n1,082.4 \n7.7%\nSegment income\n116.2 \n112.7 \n3.1%\n394.9 \n357.1 \n10.6%\n      % of net sales\n32.8 \n%\n34.0 \n%\n(1.2)\n pts\n33.9 \n%\n33.0 \n%\n0.9 \n pts\nNet sales\nThe components of the change in \nPool\n net sales from the prior period were as follows:\nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume\n2.4 \n%\n1.7 \n%\nPrice\n3.2 \n4.0 \nCore growth\n5.6 \n5.7 \nAcquisition/Divestiture\n1.3 \n1.9 \nCurrency\n— \n0.1 \nTotal\n6.9 \n%\n7.7 \n%\nThe 6.9\n \nand\n \n7.7 percent increases in net sales for Pool in the third quarter and first nine months, respectively, of 2025 from 2024 were primarily driven by:\n•\nincreased selling prices to mitigate inflationary cost increases;\n•\nincreased sales volume due to higher demand compared to the same periods of the prior year; and\n•\nincreased sales due to the acquisition of G & F Manufacturing completed in the fourth quarter of 2024. \n30\nTable of Contents\nSegment income\nThe components of the change in Pool segment income as a percentage of net sales from the prior period were as follows:\n \nThree months ended September 30, 2025\nNine months ended September 30, 2025\nover the prior year period\nover the prior year period\nVolume/Price/Acquisition/Divestiture\n4.2 \n pts\n3.4 \n pts\nCurrency\n(0.1)\n0.1 \nInflation\n(3.1)\n(2.6)\nProductivity\n(2.2)\n— \nTotal\n(1.2)\n  pts\n0.9 \n  pts\nThe 1.2 percentage point decrease in segment income for Pool as a percentage of net sales in the third quarter of 2025 from 2024 was primarily driven by:\n•\ninflationary cost increases, including higher tariffs, certain raw materials and labor costs; and\n•\ndecreased productivity due to investments in growth initiatives.\nThis decrease was partially offset by:\n•\nincreased selling prices to mitigate impacts of inflation.\nThe 0.9 percentage point increase in segment income for Pool as a percentage of net sales in the first nine months of 2025 from 2024 was primarily driven by:\n•\nincreased selling prices to mitigate impacts of inflation.\nThis increase was partially offset by:\n•\ninflationary cost increases, including higher tariffs, certain raw materials and labor costs.\nLIQUIDITY AND CAPITAL RESOURCES \nWe generally fund cash requirements for working capital, capital expenditures, equity investments, acquisitions, debt repayments, dividend payments and share repurchases from cash generated from operations, availability under existing committed revolving credit facilities and in certain instances, public and private debt and equity offerings. Our primary revolving credit facility has generally been adequate for these purposes, although we have negotiated additional credit facilities or completed debt and equity offerings as needed to allow us to complete acquisitions. \nWe experience seasonal cash flows primarily due to seasonal demand in a number of markets. Consistent with historical trends, we experienced seasonal cash usage in the first quarter of 2025 and drew on our revolving credit facility to fund our operations. This cash usage reversed in the second quarter as the seasonality of our businesses peaked and generated significant cash to fund our operations. We continued to generate significant cash to fund our operations in the third quarter of 2025.\nEnd-user demand for pool equipment in the Pool segment, water solution products in the Water Solutions segment, and residential water supply and agricultural products within the Flow segment follows warm weather trends, with seasonal highs ranging from April to September. The magnitude of the sales spike has historically been partially mitigated by employing some advance sale “early buy” programs (generally including extended payment terms and/or additional discounts). Demand for residential and agricultural water systems is also impacted by weather patterns, particularly by temperature, heavy flooding and droughts.\nWe expect to continue to have sufficient cash and borrowing capacity to support working capital needs and capital expenditures, to pay interest and service debt and to pay dividends to shareholders quarterly. We believe our existing liquidity position, coupled with our currently anticipated operating cash flows, will be sufficient to meet our cash needs arising in the ordinary course of business for the next twelve months. \n31\nTable of Contents\nSummary of cash flows\nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\nNet cash provided by (used for):\n   Operating activities of continuing operations\n$\n764.0 \n$\n680.4 \n   Investing activities\n(354.3)\n(68.2)\n   Financing activities\n(370.8)\n(560.0)\nOperating activities\nNet cash provided by operating activities of continuing operations in the first nine months of 2025 primarily reflects net income from continuing operations, net of non-cash depreciation, definite-lived intangible amortization, share-based compensation, loss on sale of business, deferred income taxes and asset impairment, of $697.7 million. Additionally, we had a cash inflow of $57.8 million as a result of changes in net working capital, primarily due to decreased accounts receivable and increased accounts payable balances. The decrease in accounts receivable was attributed to an increase in cash collections during the period. The increased accounts payable balance was primarily due to the general timing of vendor payments during the first nine months of 2025.\nNet cash provided by operating activities of continuing operations in the first nine months of 2024 primarily reflects net income from continuing operations, net of non-cash depreciation, definite-lived intangible amortization, share-based compensation and asset impairment, of $580.5 million. Additionally, we had a cash inflow of $80.9 million as a result of changes in net working capital, primarily due to lower inventory and accounts receivable balances. These decreases were primarily related to supply chain efficiencies and improved lead times.\nInvesting activities\nNet cash used for investing activities in the first nine months of 2025 primarily reflects net cash paid of $292.2 million for the Hydra-Stop acquisition, capital expenditures of $45.1 million and the purchase of investments of $18.0 million.\nNet cash used for investing activities in the first nine months of 2024 primarily reflects capital expenditures of $51.7 million and cash paid upon the settlement of net investment hedges of $16.4 million.\nFinancing activities\nNet cash used for financing activities in the first nine months of 2025 primarily relates to the repayment of $250.0 million of the remaining principal under the Term Loan Facility, a $19.3 million repayment of senior notes, share repurchases of $175.0 million and dividend payments of $123.3 million, partially offset by net borrowings of revolving long-term debt of $210.5 million.\nNet cash used for financing activities in the first nine months of 2024 primarily relates to the repayment of $200.0 million term loans under the Senior Credit Facility, $162.5 million Term Loan Facility principal payments, dividend payments of $114.3 million and share repurchases of $100.0 million.\n32\nTable of Contents\nFree cash flow\nIn addition to measuring our cash flow generation or usage based upon operating, investing and financing classifications included in the Condensed Consolidated Statements of Cash Flows, we also measure our free cash flow. We have a long-term goal to consistently generate free cash flow that is equal to 100 percent conversion of net income. Free cash flow is a non-U.S. GAAP financial measure that we use to assess our cash flow performance. We believe free cash flow is an important measure of liquidity because it provides us and our investors a measurement of cash generated from operations that is available to pay dividends, repurchase shares and repay debt. In addition, free cash flow is used as a criterion to measure and pay compensation-based incentives. Our measure of free cash flow may not be comparable to similarly titled measures reported by other companies. \nThe following table is a reconciliation of free cash flow:\n \nNine months ended\nIn millions\nSeptember 30,\n2025\nSeptember 30,\n2024\nNet cash provided by operating activities of continuing operations\n$\n764.0 \n$\n680.4 \nCapital expenditures of continuing operations\n(45.1)\n(51.7)\nProceeds from sale of property and equipment of continuing operations\n0.1 \n0.4 \nFree cash flow from continuing operations\n719.0 \n629.1 \nNet cash used for operating activities of discontinued operations\n— \n(0.2)\nFree cash flow\n$\n719.0 \n$\n628.9 \nDebt and capital\nPentair, Pentair Finance S.à r.l (“PFSA”) and Pentair, Inc. are parties to a credit agreement (the “Senior Credit Facility”), with Pentair as guarantor and PFSA and Pentair, Inc. as borrowers, which was amended and restated in May 2025, providing for a $900.0 million senior unsecured revolving credit facility. The Senior Credit Facility has a maturity date of May 5, 2030. Borrowings under the Senior Credit Facility bear interest at a rate equal to an alternate base rate, adjusted term secured overnight financing rate, adjusted euro interbank offered rate, adjusted daily simple secured overnight financing rate or central bank rate, plus, in each case, an applicable margin. The applicable margin is based on, at PFSA’s election, Pentair’s leverage level or PFSA’s public credit rating.\nAs of September 30, 2025, total availability under the Senior Credit Facility was $680.0 million. In addition, PFSA has the option to request to increase the revolving credit facility and/or to enter into one or more tranches of term loans in an aggregate amount of up to $450.0 million, subject to customary conditions, including the commitment of the participating lenders.\nIn addition, Pentair and PFSA are parties to a senior unsecured term loan facility (the “Term Loan Facility”), with PFSA, as borrower, Pentair, as guarantor, providing for an aggregate principal amount of $1.0 billion. The Term Loan Facility has a maturity date of July 28, 2027, with required quarterly installment payments of $6.3 million which began on the last day of the third quarter of 2023 and increased to $12.5 million on the last day of the third quarter of 2024. During 2024, PFSA repaid the remaining $162.5 million of quarterly installments on the Term Loan Facility, such that PFSA is not required to make any further quarterly installment payments. As of September 30, 2025, the remaining obligation of $575.0 million matures on July 28, 2027. \nThe Term Loan Facility bears interest at a rate equal to an alternate base rate, adjusted term secured overnight financing rate, or adjusted daily simple secured overnight financing rate, plus, in each case, an applicable margin. \nThe applicable margin is based on, at PFSA’s election, Pentair’s leverage level or PFSA’s public credit rating.\nOur debt agreements contain various financial covenants, but the most restrictive covenants are contained in the Senior Credit Facility and the Term Loan Facility. The Senior Credit Facility and the Term Loan Facility contain covenants requiring us not to permit (i) the ratio of our consolidated debt (net of our consolidated unrestricted cash and cash equivalents in excess of $5.0 million but not to exceed $250.0 million) to our consolidated net income (excluding, among other things, non-cash gains and losses) before interest, taxes, depreciation, amortization and non-cash share-based compensation expense (“EBITDA”) on the last day of any period of four consecutive fiscal quarters (each, a “testing period”) to exceed 3.75 to 1.00 (or, at PFSA’s election and subject to certain conditions, 4.25 to 1.00 for four testing periods in connection with certain material acquisitions) (the “Leverage Ratio”) and (ii) the ratio of our EBITDA to our consolidated interest expense, for the same period to be less than 3.00 to 1.00 as of the end of each fiscal quarter. For purposes of the Leverage Ratio, the Senior Credit Facility and the Term \n33\nTable of Contents\nLoan Facility provide for the calculation of EBITDA giving pro forma effect to certain acquisitions, divestitures and liquidations during the period to which such calculation relates.\nIn addition to the Senior Credit Facility and the Term Loan Facility, we have various other credit facilities with an aggregate availability of $20.9 million, of which there were no outstanding borrowings at September 30, 2025. Borrowings under these credit facilities bear interest at variable rates.\nWe have no senior notes maturing in the next twelve months.\nAs of September 30, 2025, we had $78.3 million of cash held in certain countries in which the ability to repatriate is limited due to local regulations or significant potential tax consequences.\nShare repurchases\nIn December 2020, the Board of Directors authorized the repurchase of our ordinary shares up to a maximum dollar limit of $750.0 million. This authorization expires on December 31, 2025. During the nine months ended September 30, 2025, we repurchased 1.8 million of our ordinary shares for $175.0 million. As of September 30, 2025, we had $275.0 million available for share repurchases under this authorization.\nDividends payable\nOn September 22, 2025, the Board of Directors declared a quarterly cash dividend of $0.25 per share, payable on November 7, 2025 to shareholders of record at the close of business on October 24, 2025. As a result, the balance of dividends payable included in \nOther current liabilities \non our Condensed Consolidated Balance Sheets was $41.0 million at September 30, 2025, compared to $41.2 million at December 31, 2024.\nWe paid dividends in the first nine months of 2025 of $123.3 million, or $0.75 per ordinary share compared with $114.3 million, or $0.69 per ordinary share, in the prior year period. \nUnder Irish law, the payment of future cash dividends and repurchases of shares may be paid only out of Pentair plc’s “distributable reserves” on its statutory balance sheet. Pentair plc is not permitted to pay dividends out of share capital, which includes share premiums. Distributable reserves may be created through the earnings of the Irish parent company and through a reduction in share capital approved by the Irish High Court. Distributable reserves are not linked to a U.S. generally accepted accounting principles (“GAAP”) reported amount (e.g., retained earnings). Our distributable reserve balance was $6.8 billion as of December 31, 2024.\nSupplemental guarantor information\nPentair plc (the “Parent Company Guarantor”), fully and unconditionally, guarantees the senior notes of PFSA (the “Subsidiary Issuer”). The Subsidiary Issuer is a Luxembourg private limited liability company and 100 percent-owned subsidiary of the Parent Company Guarantor. \nThe Parent Company Guarantor is a holding company established to own directly and indirectly substantially all of its operating and other subsidiaries. The Subsidiary Issuer is a holding company formed to own directly and indirectly substantially all of its operating and other subsidiaries and to issue debt securities, including the senior notes. The Parent Company Guarantor’s principal source of cash flow, including cash flow to make payments on the senior notes pursuant to the guarantees, is dividends from its subsidiaries. The Subsidiary Issuer’s principal source of cash flow is interest income from its subsidiaries. None of the subsidiaries of the Parent Company Guarantor or the Subsidiary Issuer is under any direct obligation to pay or otherwise fund amounts due on the senior notes or the guarantees, whether in the form of dividends, distributions, loans or other payments. In addition, there may be statutory and regulatory limitations on the payment of dividends from certain subsidiaries of the Parent Company Guarantor or the Subsidiary Issuer. If such subsidiaries are unable to transfer funds to the Parent Company Guarantor or the Subsidiary Issuer and sufficient cash or liquidity is not otherwise available, the Parent Company Guarantor or the Subsidiary Issuer may not be able to make principal and interest payments on their outstanding debt, including the senior notes or the guarantees.\n34\nTable of Contents\nThe following table presents summarized financial information as of September 30, 2025 and December 31, 2024 for the Parent Company Guarantor and Subsidiary Issuer on a combined basis after elimination of (i) intercompany transactions and balances among the Parent Company Guarantor and the Subsidiary Issuer and (ii) equity in earnings from and investments in any subsidiary that is a non-guarantor or issuer.\nIn millions\nSeptember 30,\n2025\nDecember 31,\n2024\nCurrent assets \n(1)\n$\n25.7 \n$\n1.3 \nNoncurrent assets \n(2)\n2,843.0 \n2,551.7 \nCurrent liabilities \n(3)\n2,563.4 \n1,893.1 \nNoncurrent liabilities \n(4)\n1,866.5 \n1,828.6 \n(1) \nNo assets due from non-guarantor subsidiaries were included as of September 30, 2025 and December 31, 2024, respectively.\n(2) \nIncludes assets due from non-guarantor subsidiaries of $2,843.0 million and $2,547.3 million as of September 30, 2025 and December 31, 2024, respectively. \n(3) \nIncludes liabilities due to non-guarantor subsidiaries of $2,505.3 million and $1,843.0 million as of September 30, 2025 and December 31, 2024, respectively.\n(4) \nIncludes liabilities due to non-guarantor subsidiaries of $169.9 million and $151.5 million as of September 30, 2025 and December 31, 2024, respectively.\nThe Parent Company Guarantor and Subsidiary Issuer do not have material results of operations on a combined basis.\nCRITICAL ACCOUNTING POLICIES\nWe have adopted various accounting policies to prepare the consolidated financial statements in accordance with GAAP. Certain of our accounting policies require the application of significant judgment by management in selecting the appropriate assumptions for calculating financial estimates. In our Annual Report on Form 10-K for the year ended December 31, 2024, we identified the critical accounting policies that affect our more significant estimates and assumptions used in preparing our consolidated financial statements. There have been no material changes to our critical accounting policies and estimates from those disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024."
}