{
  "source_file": "pnw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\n         \n \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\n \nCONDITION AND RESULTS OF OPERATIONS\nINTRODUCTION\n \nThe following discussion should be read in conjunction with Pinnacle West’s Condensed Consolidated Financial Statements and APS’s Condensed Consolidated Financial Statements and the related Combined Notes to the Condensed Consolidated Financial Statements (“Notes”) that appear in Item 1 of this report.  For information on factors that may cause our actual future results to differ from those we currently seek or anticipate, see “Forward-Looking Statements” at the front of this report and “Risk Factors” in Part 1, Item 1A of the 2024 Form 10-K and Part II, Item 1A of this report.\nOVERVIEW\n \nBusiness Overview \nPinnacle West is an investor-owned electric utility holding company based in Phoenix, Arizona with consolidated assets of approximately $30 billion.\n \nSince 1886, Pinnacle West and our affiliates have provided energy and energy-related products to people and businesses throughout Arizona. \nPinnacle West derives essentially all of our revenues and earnings from our principal subsidiary, APS.  APS is Arizona’s largest and longest-serving electric company and generates safe, affordable and reliable electricity for approximately 1.4 million retail customers in 11 of Arizona’s 15 counties.  APS is also the operator and co-owner of Palo Verde Generating Station (“Palo Verde”) — a primary source of electricity for the southwestern United States.\n \nStrategic Overview \nOur vision is to create a sustainable energy future for Arizona.  Our mission is to serve customers with safe, reliable, and affordable energy.  We are committed to delivering operational excellence at the lowest cost possible while aspiring to lower carbon emissions over time.\nReliable\nAs energy demand in Arizona continues to grow, we remain committed to delivering reliable service to our customers.  We have a goal of achieving top quartile reliability as compared to peers.  Key elements to delivering reliable service include resource and transmission planning to secure resource adequacy, planning and procuring resources to ensure sufficient reserve margins, distribution automation and resiliency investments, predictive and preventative maintenance programs, seasonal readiness programs, emergency preparedness, and securing a reliable supply chain.  Securing a reliable grid requires ongoing infrastructure investments in addition to investments to support new customer growth.  \nBalanced Energy Mix\n.  APS strives to procure a balanced energy mix, and we believe this provides the greatest reliability at the lowest cost possible while increasing resiliency.  We achieve reliability, in part, through a blend of dispatchable resources, such as natural gas and battery storage, that can provide energy when intermittent resources, such as wind and solar, are unavailable.  In its all-source request for proposal (“ASRFP”) issued in 2023, APS contracted for 3,606 megawatts (“MW”) of battery storage, 517 MW of natural gas, 2,649 MW of solar, and 500 MW of wind resources.  APS regularly \n80\nTable of Contents\nevaluates the best mix of resources based on a changing operating environment, including changes in generation technology, economics, and policy impacts.\nThere is a need for additional natural gas to support reliability for customers and meet increasing energy needs and existing natural gas pipelines into Arizona are currently 100% committed.  As a result, in July 2025, APS executed a gas transportation precedent agreement to secure a long-term supply of natural gas.  The new pipeline is expected to be operational by late 2029 and will be owned and operated by a third-party.  APS also plans to develop a site near Gila Bend, Arizona that is capable of adding up to 2,000 MW of generation to the state’s energy portfolio.  The Desert Sun Power Plant will be a natural gas facility designed to meet Arizona’s rapidly growing needs and support unprecedented demand from large load energy users.  This project is planned in two phases, with the first phase expected to serve existing customers and business-as-usual growth through our competitive ASRFP process, and the second phase to enable a new subscription model for large load customers, like data centers and large manufacturers.  This subscription model is a commercial construct designed to ensure growth pays for growth while protecting affordability for other customers.\nPalo Verde, one of the nation’s largest carbon-free energy resources, serves as a foundational part of APS’s resource portfolio.  The plant is a critical asset to the Southwest, generating more than 32 million megawatt-hours annually – enough power for roughly 3.4 million households, or approximately 8.5 million people.  Its continued operation is important to a carbon-neutral future for Arizona and the region, as a reliable, continuous, affordable resource and as a large contributor to the local economy.  APS owns or leases 29.1% of Units 1, 2, and 3 Palo Verde.  In June 2025, APS entered into agreements to purchase two of the three leased interests in Unit 2.  The two subject leased interests represented approximately 7% or 94 MW of Unit 2.  The transaction closed in September 2025, leaving one remaining lease for approximately 5.2% of Unit 2 that expires in 2033.  See Note 8 for more information.  The 2025 Rate Case (as defined below) includes pro forma adjustments to account for these acquisitions.  APS continues to evaluate and pursue options for reliably serving growing customer energy needs and demand.\nWildfire Efforts\n.  Wildfire safety remains a critical focus for APS and other utilities.  APS has increased investment in fire mitigation efforts to clear defensible space around its infrastructure, continue ongoing system upgrades, build partnerships with government entities and first responders, and educate customers and communities.  APS also increased spend on mitigating the risk associated with trees that could cause hazards, resulting in more of these trees being removed before they could cause outages or wildfires.  These programs contribute to customer reliability, responsible forest management and safe communities.  With wildfire events in Hawaii, California, and across North America over the last few years, APS has been devoting and intends to continue to devote substantial efforts to analyzing and developing enhancements to its systems and processes to mitigate fire risk within its service territory and communities, including by hardening our infrastructure, deploying new technologies where appropriate, increasing our awareness, implementing operational changes, and enhancing our wildfire response capabilities.  \nAPS uses fire modeling software to identify and calculate risk and target future system improvement investments such as fire-resistant pole wrapping, wood to steel pole conversions, and additional remote-controllable field devices like reclosers and switches.  In 2024, APS began installing a system of artificial intelligence-based fire sensing cameras with the ability to detect and alert on fire ignitions.  These alerts are sent both to APS and fire response dispatch centers to speed fire response in APS’s service territory regardless of the cause of the fire.  APS also implemented a public safety power shutoff (“PSPS”) program on certain feeders that began in the 2024 fire season, leveraging the additional \n81\nTable of Contents\nreal-time analysis provided by the modeling software.  APS has educated and will continue education outreach to customers and communities that may potentially be impacted by the PSPS program.   \nAPS was selected by the U.S. Department of Energy’s (“DOE”) Grid Deployment Office (“GDO”) to receive up to $70 million in federal money for fire mitigation and grid infrastructure projects.  This funding is part of the GDO’s Grid Resilience and Innovation Partnership Program and is contingent on APS negotiating and executing final grant agreements with GDO.  Additionally, on May 12, 2025, Arizona Governor Hobbs signed into law a bill that requires Arizona electric utilities to develop and seek approval for wildfire mitigation plans and defines the standard of care with respect to wildfire-related claims by reference to such plans.  APS continues to evaluate policy and regulatory options, as well as insurance programs, to mitigate the impact of wildfire events.\nAffordable\n \nWe are committed to keeping bills as low as possible for our customers while maintaining high levels of reliability.  Inflation has dramatically impacted the cost of goods and services in recent years as shown by the Consumer Price Index for All Urban Consumers (“CPI-U”), which from 2018 through 2024 rose nationally 24.9% and 32.1% in Phoenix.  Despite this, APS’s average residential rates remained well-below those inflation figures, rising 16.2% for the same period according to the U.S. Energy Information Administration.  In recent months, inflationary impacts have eased, with the CPI-U growing 2.9% nationally and 1.4% in Phoenix over the 12 months ended August 2025.  As a result of increased tariffs and supply chain constraints, APS amended several of its agreements from its ASRFP issued in 2023 to mitigate these cost impacts.  However, APS remains cautious of potential price increases as a result of current and proposed tariffs, which could lead to higher costs and supply chain constraints.\nAPS’s customer affordability initiative includes internal opportunities, such as training and mentoring employees on identifying efficiency opportunities; maintaining inventory to take advantage of lower pricing and avoid expediting fees; entering into long-term contracts to hedge against price volatility, which has allowed APS to mitigate against procurement spend on critical items such as transformers; and implementing automation technologies to enhance efficiencies and increase data-oriented decision making.  APS is also seeking to reduce cross-subsidization of customer classes and ensure that growth pays for growth by requesting modifications to its cost allocation methodologies in the 2025 Rate Case.  APS continues to seek opportunities to streamline its business processes, mitigate cost increases, increase employee retention, and improve customer satisfaction.\nAPS’s Integrated Resource Plan (“IRP”) and competitive ASRFP processes serve important roles in providing reliable and affordable energy to APS’s customers.  The IRP process helps identify the amount and type of resources required to reliably meet customer needs, while the ASRFP process seeks to meet those needs in a competitive manner based on cost, ability to meet system requirements, and commercial viability.  See “Resource Planning\n—\nPrioritizing Reliability and Affordability” below for more information.\nAPS has seen increasing demand from large load customers in recent years.  In the 2025 Rate Case, APS requested adjustments to rate designs and modification of cost allocation methodologies to ensure growth pays for growth.  See “Regulatory Overview” below for more information.  In line with the 2025 Rate Case, APS has developed a subscription model it believes will allow for these large load customers to fund the incremental infrastructure needed to serve them through long-term contracts where they cover capital costs and assume development risks, accelerating their path to service and ensuring those infrastructure costs are borne by those customers rather than residential or small business customers.  \n82\nTable of Contents\nThere are also external opportunities that allow APS to deliver more affordable energy to customers, such as APS’s participation in western energy markets and programs.  APS participated in market design and tariff development of Markets+, a day-ahead and real-time market offering from Southwest Power Pool (“SPP”).  The Markets+ tariff was filed with the U.S. Federal Energy Regulatory Commission (“FERC”) on March 29, 2024 and was approved on January 16, 2025.  APS is a funding party to the implementation phase of Markets+ and expects to go live in the market in October 2027.  In addition, APS is participating in the Western Resource Adequacy Program administered by Western Power Pool and plans to transition to full-binding participation as early as summer 2027.  These regional efforts are driven by the objectives of reducing customer cost and improving reliability.  Until the transition to Markets+, APS will continue to participate in Western Energy Imbalance Market (“WEIM”) as a tool for creating savings for APS’s customers from the real-time only, voluntary market.  APS expects that its participation in WEIM and future participation in Markets+ will lower its fuel and purchased-power costs, improve situational awareness for systems operations in the Western Interconnection, and improve integration of APS’s resources.\nResource Planning\n—\nPrioritizing Reliability and Affordability\nAPS has an aspirational goal to be carbon-neutral by 2050.  This means that for any greenhouse gas emissions still produced by our generation resources as of 2050, we will aim to offset these emissions elsewhere.  This goal reflects APS’s interest in new innovation and market transformations that address carbon emissions, while relying on the IRP process to help determine the most responsible path forward.  APS remains focused on providing reliable energy at the lowest cost possible while striving to lower emissions over time and continues to look for opportunities to support reliability through dispatchable resources, such as gas and the potential extension of coal beyond 2031.\nAPS has a diverse portfolio of existing and planned resources, including biomass, biogas, coal, energy storage, geothermal, natural gas, nuclear, solar, and wind.  Maintaining a balanced and diverse portfolio of resources will ensure continued reliable service to our customers in the most affordable manner possible.  Every three years, APS performs an IRP, a comprehensive study to identify what resources will be necessary to safely, reliably, and affordably meet the demand and energy needs of its customers over the next 15 years.  In November 2023, APS released its latest IRP, which identified forecasted customer demand and energy needs growing at an unprecedented rate.  In developing the IRP, APS considered how factors such as forecasted economic growth, impacts from weather, and new resource technology availability impact the amount and type of resources required to reliably and affordably meet customer needs.  These factors, among others, were used to develop a plan that identified a balanced mix of diverse energy-generating resources to reliably serve customers’ future energy needs.  To help ensure competitive costs for resources procured by APS, APS regularly issues competitive bid solicitations through the ASRFP process, with the most recent ASRFP being issued in 2024.  These ASRFPs are open to bids for all resource types, including customer-scale (behind the meter) and utility-scale (in front of the meter) resources.\nAPS selects projects out of ASRFPs based on cost, ability to meet system requirements, and commercial viability, taking into consideration timing and likelihood of successful contracting and development.  Under current market conditions, APS must aggressively contract for resources that can withstand supply chain and other geopolitical pressures.  Guided by IRP-established timelines and quantities, APS maintains a flexible approach that allows it to optimize system reliability and customer affordability through the ASRFP process.  Agreements for the development and completion of future \n83\nTable of Contents\nresources are subject to various conditions, including successful siting, permitting and interconnection to the electric grid.\nOn June 30, 2023, APS issued an ASRFP pursuant to which APS procured 3,606 MW of battery storage, 517 MW of natural gas, 2,649 MW of solar, and 500 MW of wind resources expected to be in service from 2026 to 2028.\nOn November 20, 2024, APS issued an ASRFP (the “2024 ASRFP”) seeking 2,000 MW of resources.  APS is seeking projects that can reach commercial operation beginning June 1, 2028 through June 1, 2030 but will consider projects that may achieve commercial operation as early as 2026.  Additionally, APS is interested in projects that require longer planning, permitting, and construction and can be commercially operational after June 1, 2030.  Bids for the 2024 ASRFP were due on February 5, 2025.\nCustomer-Focused\nServing customers with excellence is foundational to APS’s business and remains our core focus as we adapt to evolving customer needs and emerging technology.  Recognizing that every employee impacts our customer experience, we continue to provide information, tools, and resources enabling our teams to design, develop, and implement enhancements to improve our customer experience.\nAPS’s 24/7 call center answers more than 75% of customer calls within 30 seconds, and our mobile platforms enable our more than one million customers to quickly and easily find the information they need when they need it.  We seek to provide relevant and valuable options for customers to manage their bill, including through rate plan options, programs that help them save energy and money, and alerts and notifications that help keep them aware of outages, payments, and usage.  APS recently introduced a high-bill analyzer tool enabling phone advisors to provide customers with specific, customized guidance based on their actual usage and habits.\nAdditionally, APS offers a customer assistance program, including up to a 60% bill discount for vulnerable customers, flexible payment arrangements, and emergency utility bill assistance.  To ensure customers in need are connected to these programs, we partner with more than one hundred community action agencies across our service territory to train representatives who serve our shared customers.\nDeveloping Technologies\nNew Nuclear Generation\n.\n \nAlong with other Arizona electric utilities, APS is exploring additional nuclear generation to provide around-the-clock carbon-free energy to meet rising energy demands in Arizona.  APS has been monitoring emerging nuclear technologies, such as small modular nuclear reactors (“SMRs”).  SMRs are typically designed to generate 300 MW or less of energy per unit compared to, for example, the 1,400 MW per unit generated at Palo Verde.  The utilities have applied for a grant from DOE to begin preliminary exploration of a potential site for additional nuclear energy for Arizona.  The grant could support a three-year site selection process and possible preparation of an early site permit application to U.S. Nuclear Regulatory Commission (“NRC”). \nCarbon Capture\n.\n \nCarbon Capture Utilization and Storage (“CCUS”) technologies can isolate CO\n2\n and either sequester it permanently in geologic formations or convert it for use in products.\n \nCurrently, almost all existing fossil fuel generators do not control carbon emissions the way they control emissions of other air pollutants such as sulfur dioxide or oxides of nitrogen.\n \nCCUS technologies are still in the \n84\nTable of Contents\ndemonstration phase and while they show promise, they are still being tested in real-world conditions.\n \nThese technologies could potentially reduce carbon emissions from fossil fuel-fired generation.\nArtificial Intelligence\n.\n \nTo address the rapid advancement of artificial intelligence (“AI”) technology risks and opportunities, APS has developed an AI strategy to responsibly utilize AI to advance our business strategy, enhance customer and employee experiences, and optimize operational reliability.  At the core of our AI strategy is a robust governance model that develops guidance, policies, and relevant sub-strategies for the execution of AI projects at the Company.  To ensure compliance with data security, reliability requirements, and our Code of Ethical Conduct, governance and oversight are provided by leadership and experts from our information technology, cybersecurity, human resources, ethics, supply chain, legal, and nuclear generation teams.\nRegulatory Overview\n2025 Rate Case\nOn June 13, 2025, APS filed an application with the ACC (the “2025 Rate Case”) seeking a net base rate increase of $579.5 million, which represents a 13.99% net increase.\n \nThe requested net increase addresses a total base revenue deficiency of $662.4 million, offset by proposed adjustor transfers of cost recovery to base rates.\nThe 2025 Rate Case application includes the following proposals: \n•\na test year comprised of the 12-month period ended on December 31, 2024, including certain pro forma adjustments; \n•\n12 months of post-test year plant placed into service from January 1, 2025 through     December 31, 2025;\n•\nan original cost rate base of $12.5 billion, which approximates the ACC-jurisdictional portion of the book value of utility assets, net of accumulated depreciation and other credits; \n•\nthe following proposed capital structure and costs of capital: \nCapital Structure\nCost of Capital\nLong-term debt\n47.65 \n%\n4.26 \n%\nCommon stock equity\n52.35 \n%\n10.70 \n%\nWeighted-average cost of capital\n7.63 \n%\n•\na 1% return on the increment of fair value rate base above APS’s original cost rate base, as provided for by Arizona law;\n•\na rate of $0.043881 per kilowatt-hour (“kWh”) for the portion of APS’s base rates attributable to fuel and purchased power costs;\n•\nadjustments to rate designs to reduce cross-subsidization by certain customer classes;\n•\nmodification of cost allocation methodologies based on customer growth to ensure customers causing new production costs are covering those costs through rates, along with corresponding changes to adjustor mechanisms, such as for fuel and purchased power;\n•\nimplementation of a “Formula Rate Adjustment Mechanism” (“FRAM”) to assist with reducing regulatory lag and allow for rate gradualism;\n•\nelimination of the Lost Fixed Cost Recovery Adjustment Mechanism (“LFCR”) following the first annual adjustment pursuant to the FRAM; and\n85\nTable of Contents\n•\nmodification to the System Reliability Benefit Mechanism (“SRB”) due to the Formula Rate Adjustment Mechanism proposal.\nAPS requested that the increase become effective in the second half of 2026.  The hearing for this rate case is currently scheduled to begin in May 2026.  APS cannot predict the outcome of its request nor when the 2025 Rate Case will be decided by the ACC. \n2022 Rate Case\nOn October 28, 2022, APS filed an application with the ACC (the “2022 Rate Case”) for an increase in retail base rates, and on January 25, 2024, an Administrative Law Judge issued a Recommended Opinion and Order (“ROO”), as corrected on February 6, 2024 (the “2022 Rate Case ROO”).  \nOn February 22, 2024, the ACC approved the 2022 Rate Case ROO with certain amendments that resulted in, among other things, (i) an approximately $491.7 million increase in the annual base revenue requirement, (ii) a 9.55% return on equity, (iii) a 0.25% return on the increment of fair value rate base greater than original cost, (iv) an effective fair value rate of return of 4.39%, (v) a return set at the Company’s weighted average cost of capital on the net prepaid pension asset and net other post-employment benefit liability in rate base, (vi) an adjustment to generation maintenance and outage expense  to reflect a more reasonable level of test year costs, (vii) approval of the SRB mechanism with modifications to customer notifications, procedural timelines and the inclusion of any qualifying technology and fuel source bid received through an ASRFP, and (viii) recovery of all Demand Side Management (“DSM”) costs through the DSM Adjustment Charge (“DSMAC”) rather than through base rates.\nThe ACC issued the final order for the 2022 Rate Case on March 5, 2024, with the new rates becoming effective for all service rendered on or after March 8, 2024.\nSix intervenors and the Attorney General of Arizona requested rehearing on various issues included in the ACC’s decision, such as the grid access charge (“GAC”) for solar customers, the SRB, and Coal Community Transition funding.  On April 15, 2024, the ACC granted, in part, the rehearing applications of the Attorney General, Arizona Solar Energy Industries Association (“AriSEIA”), Solar Energy Industries Association (“SEIA”), and Vote Solar specifically to review whether the GAC rate is just and reasonable, including whether it should be higher or lower, whether the GAC rate constitutes a discriminatory fee to solar customers, and whether omission of a GAC charge is discriminatory to non-solar customers.  All other applications for rehearing were denied.  A limited rehearing was held October 28 through   November 1, 2024.  Following the limited rehearing, an Administrative Law Judge issued a ROO (the “Limited Rehearing ROO”) on December 3, 2024.  The Limited Rehearing ROO recommended affirming the GAC as just and reasonable and that the GAC is not discriminatory to solar customers and the absence of a GAC is not discriminatory to non-solar customers.  On December 17, 2024, the ACC approved the Limited Rehearing ROO with an amendment that requires APS in its next rate case to propose a revenue allocation based on a site-load cost of service study in order to bring further parity in revenue collection between solar and non-solar customers.  SEIA, AriSEIA, Vote Solar, the Arizona Attorney General, and two individual customers have filed requests for rehearing of the ACC’s December 17, 2024 decision on the rehearing.  The ACC has taken no action on these requests.  In addition, each of these parties has subsequently filed an appeal to the Arizona Court of Appeals seeking review of the ACC’s decisions regarding the GAC and on rehearing.  APS cannot predict the outcome of these proceedings.\n86\nTable of Contents\nRegulatory Lag Docket\nOn January 5, 2023, the ACC opened a new docket to explore the possibility of modifications to the ACC’s historical test year rules.  The ACC requested comments and held two workshops exploring ways to reduce regulatory lag, including alternative ratemaking structures such as future test years, hybrid test years, and formula rates.  On December 3, 2024, the ACC approved a policy statement regarding formula rate plans.  The policy statement provides regulated utilities with the opportunity to propose formula rate plans in future rate cases.  On March 28, 2025, the Residential Utility Consumer Office (“RUCO”), the Arizona Large Customer Group (“ALCG”), and an individual customer filed a lawsuit challenging the ACC’s authority to issue the formula rate policy statement outside of Arizona’s formula rulemaking process.  On June 13, 2025, the lawsuit challenging the ACC’s formula rate policy was dismissed by the Superior Court of Maricopa County.  Following the dismissal, the plaintiffs filed an appeal with the Arizona Court of Appeals as well as a Petition for Special Action with the Arizona Supreme Court.  The Supreme Court declined to exercise jurisdiction on the Petition for Special Action.  The plaintiffs have also filed a Petition for Special Action with the Arizona Court of Appeals, which has accepted jurisdiction to determine whether the case should be remanded back to the Superior Court for expedited consideration of the merits.  Further special action proceedings remain pending at this time. APS cannot predict the outcome of this matter.\nCholla ACC Deferral Request\nOn August 14, 2024, APS filed a request with the ACC for a deferral order associated with unrecovered book value and closure costs of Cholla Units 1 and 3.  This order would authorize APS to defer, for future recovery in rates, both the expenses necessary to close and decommission coal-fired power plant infrastructure at Cholla, including legally required site environmental remediation, coal combustion residuals (“CCR”) corrective actions, the closure of CCR management facilities, and any unrecovered plant investment and operating costs incurred through and after April 2025.  On July 8, 2025, APS withdrew its deferral application, requesting that the costs that would have been covered in the deferral order request instead be addressed in the 2025 Rate Case.\nFire Mitigation ACC Deferral Request\nOn August 14, 2024, APS filed a request with the ACC for a deferral order that would authorize APS to defer, for future recovery in rates, operations and maintenance expenses associated with wildfire management, including increased insurance costs.  On June 18, 2025, the ACC denied APS’s request and recommended that wildfire related expenses be recovered in APS’s 2025 Rate Case.\nSee Note 6 for more information regarding these and additional regulatory matters.\nCaptive Insurance Cell \nPinnacle West is the primary beneficiary of\n \na protected cell captive insurance cell (the “Captive”).  The Captive provides insurance coverage to Pinnacle West and our subsidiaries that supplements commercial and mutual insurance coverage. \n \nThe Captive insures Pinnacle West and its subsidiaries for terrorism coverage, excess liability including certain wildfire coverage, excess property insurance, and excess employment practice liability.  The Captive policies exclude nuclear liability at Palo Verde.  See Note 8. \n \nThe Captive may hold investment assets in cash, cash equivalents, and equity and fixed income instruments. \n87\nTable of Contents\nTax Incentives\nThe Inflation Reduction Act of 2022 (“IRA”) significantly expanded the availability of tax credits for investments in clean energy generation technologies and energy storage.  Key provisions included (i) an extension of tax credits for solar and wind generation, including a new option for solar investments to claim a Production Tax Credit (“PTC”) in lieu of the Investment Tax Credit (“ITC”) beginning in 2022; (ii) expansion of the ITC to cover stand-alone energy storage technology beginning in 2023; (iii) introduction of technology neutral clean energy ITCs and PTCs beginning in 2025; and (iv) introduction of a new PTC for nuclear energy produced by existing nuclear energy plants, available from 2024 through 2032.  \nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”), was signed into law.  The OBBBA curtailed several clean energy tax credits initially passed in the IRA, including a new phase out deadline for wind and solar ITCs and PTCs that requires projects to either begin construction within one year of enactment or be placed in service by December 31, 2027.  Additionally, the OBBBA contained provisions restricting clean energy projects, including energy storage, which begin construction after December 31, 2025, and receive “material assistance from a prohibited foreign entity,” from being eligible for clean energy ITCs or PTCs. \nThe Company believes that its projects which are currently under construction will continue to qualify for IRA tax credits.  The Company is continuing to analyze the OBBBA and is awaiting regulations and other guidance as to the application of these new rules to projects not currently under construction. \nFinancial Strength and Flexibility\nWe believe that Pinnacle West and APS currently have ample borrowing capacity under their respective credit facilities and may readily access these facilities ensuring adequate liquidity for each company.  Capital expenditures are anticipated to be funded with internally generated cash and external financings, which may include issuances of long-term debt and Pinnacle West common stock.\nOther Subsidiaries\nPNW Power\n \n \nOn August 4, 2023, Pinnacle West entered into an agreement pursuant to which we agreed to sell all of our equity interest in our wholly-owned subsidiary Bright Canyon Energy Corporation (“BCE”) to Ameresco (the “BCE Sale”).\n \nThe transaction was accounted for as the sale of a business and closed in multiple stages.\n  T\nhe final closing of the BCE Sale was completed on January 12, 2024.  Certain investments and assets that BCE previously held, including the TransCanyon joint venture and holdings in the two Tenaska wind farm investments, were not included in the BCE Sale and were instead transferred to Pinnacle West Power, LLC (“PNW Power”), a wholly-owned subsidiary of Pinnacle West.\nPNW Power’s investments include TransCanyon, a 50/50 joint venture that was formed in 2014 with BHE U.S. Transmission LLC, a subsidiary of Berkshire Hathaway Energy Company.  TransCanyon is pursuing independent electric transmission opportunities within the 11 U.S. states that comprise the Western Interconnection, excluding opportunities related to transmission service that would otherwise be provided under the tariffs of the retail service territories of the TransCanyon partners’ utility affiliates.  The  DOE’s GDO selected TransCanyon to enter into capacity contract negotiations for up to 25% of the Cross-Tie 500-kilovolt transmission line (“Cross-Tie”) as part of the Transmission Facilitation Program.  The agreement was executed on June 12, 2024; however, on September 5, 2025, TransCanyon sent a notice to \n88\nTable of Contents\nterminate the agreement that will be effective November 4, 2025.  The proposed Cross-Tie project includes a 214-mile transmission line connecting Utah and Nevada that is intended to help improve grid reliability and relieve congestion on other transmission lines.\nPNW Power’s investments also include minority ownership positions in two wind farms operated by Tenaska Energy, Inc. and Tenaska Energy Holdings, LLC, the 242 MW Clear Creek and the 250 MW Nobles 2 wind farms.\n \nClear Creek achieved commercial operation in May 2020; however, in the fourth quarter of 2022, PNW Power’s equity method investment was fully impaired.\n \nNobles 2 achieved commercial operation in December 2020.\n \nBoth wind farms deliver power under long-term power purchase agreements.\n \nPNW Power indirectly owns 9.9% of Clear Creek and 5.1% of Nobles 2.\nEl Dorado Investment Company (“El Dorado”)\nEl Dorado is a wholly-owned subsidiary of Pinnacle West.  El Dorado owns debt investments and minority interests in several energy-related investments and Arizona community-based ventures.  In particular, El Dorado has committed to and/or holds the following:\n•\n$25 million investment in the Energy Impact Partners fund, of which approximately $20 million has been funded as of September 30, 2025.  Energy Impact Partners is an organization that focuses on fostering innovation and supporting the transformation of the utility industry.  \n•\n$25 million investment in AZ-VC Fund I, LLC (formerly invisionAZ Fund) (“AZ-VC”), of which approximately $14.3 million has been funded as of September 30, 2025.  AZ-VC is a fund focused on analyzing, investing, managing, and otherwise dealing with investments in privately-held early stage and emerging growth technology companies and businesses primarily based in Arizona, or based in other jurisdictions and having existing or potential strategic or economic ties to companies or other interests in Arizona.  \n•\n$7.5 million investment in Westly Seed Fund, of which approximately $1.5 million has been funded as of September 30, 2025.  Westly Seed Fund is focused on supporting entrepreneurs involved in the energy, mobility, building, and industrial sectors.\n•\nEquity investment in SAI Advanced Power Solutions, Inc. (“SAI”), a private corporation that manufactures electrical switchgear equipment used by data centers.  El Dorado accounts for this investment under the equity method and has an investment carrying value of $16.7 million as of September 30, 2025.\nThe remainder of these investment commitments will be contributed by El Dorado as each investment fund selects and makes investments.\nKey Financial Drivers\n \nIn addition to the continuing impact of the matters described above, many factors influence our financial results and our future financial outlook, including those listed below.  We closely monitor these factors to plan for the Company’s current needs, and to adjust our expectations, financial budgets and forecasts appropriately.\n \nElectric Operating Revenues.\n \nFor the years 2022 through 2024, retail electric revenues averaged approximately 92% of our total operating revenues.\n \nOur electric operating revenues are affected by \n89\nTable of Contents\ncustomer growth or decline, variations in weather from period to period, customer mix, average usage per customer and the impacts of energy efficiency programs, distributed energy additions, electricity rates and tariffs, the recovery of Power Supply Adjustor (“PSA”) deferrals and the operation of other recovery mechanisms.\n \nOur revenues are affected by the availability of excess generation or other energy resources and wholesale market conditions, including competition, demand, and prices.\n \nActual and Projected Customer and Sales Growth.  \nRetail customers in APS’s service territory increased 2.4% for the period ended September 30, 2025 compared with the prior-year period.  For the three years through 2024, APS’s customer growth averaged 2.1% per year.  We currently project annual customer growth to be 2.0% to 2.5% for 2025 and the average annual growth to be in the range of 1.5% to 2.5% through 2030 based on anticipated steady population growth in Arizona during that period.\nRetail electricity sales in kWh, adjusted to exclude the effects of weather variations, increased 4.5% for the period ended September 30, 2025 compared with the prior-year period.  While steady customer growth was somewhat offset by lower usage among residential customers, energy savings driven by customer conservation, energy efficiency, and distributed renewable generation initiatives, the main drivers of increased revenues for this period were continued strong sales to commercial and industrial customers and the continued ramp-up of new data center and large manufacturing customers.  As large load customers, such as data centers and large manufacturers, have continued to grow as a proportion of our business, we have updated our procedures with respect to estimates of unbilled revenues for our customer classes.  As a result, we made an adjustment in the first quarter of 2025 to recalibrate accrued unbilled revenues, offsetting year-to-date sales growth by 0.5%.  Even with this offset to sales growth in the first quarter, we do not anticipate any change to our expected range of sales growth for the full year 2025.  \nFor the three years through 2024, annual retail electricity sales growth averaged 3.2%, adjusted to exclude the effects of weather variations.  Due to the expected growth of several data centers and large manufacturing facilities, we currently project that annual retail electricity sales in kWh will increase in the range of 4.0% to 6.0% for 2025 and that average annual growth will be in the range of 5.0% to 7.0% through 2030, including the effects of customer conservation, energy efficiency, and distributed renewable generation initiatives, but excluding the effects of weather variations.  These projected sales growth ranges include the impacts of several data centers and large manufacturing facilities, which are expected to contribute to 2025 growth in the range of 3.0% to 5.0% and to average annual growth in the range of 4.0% to 6.0% through 2030. \nLonger term, APS has been preparing for and can serve significant load growth from residential and business customers.  On top of these existing growth trends, APS is also now receiving unprecedented incremental requests for service from large load customers with very high energy demands that persist virtually around-the-clock.  These incremental requests for service by large load customers far exceed available generation and transmission resource capacity in the Southwest region for the foreseeable future.  Because of the high growth in demand for such projects, APS has developed a queue that identifies and prioritizes projects while maintaining system reliability and affordability for existing APS customers.  APS is also exploring available options for securing sufficient electric generation and transmission to meet these projections of future customer needs, including a new subscription model for large load customers.  The subscription model is part of the company’s “growth pays for growth” strategy where large load customers would enter into a long-term special contract to pay for the costs associated with the incremental infrastructure needed to provide service without compromising reliability and affordability for existing customers.\n90\nTable of Contents\nActual sales growth, excluding weather-related variations, may differ from our projections as a result of numerous factors, such as economic conditions, customer growth, usage patterns and energy conservation, slower ramp-up of and/or fewer large data centers and manufacturing facilities, slower than expected commercial and industrial expansions, impacts of energy efficiency programs and growth in distributed generation, responses to retail price changes, changes in regulatory standards, and impacts of new and existing laws and regulations, including environmental laws and regulations.  Based on past experience, a 1% variation in our annual residential and small commercial and industrial kWh sales projections under normal business conditions can result in increases or decreases in annual net income of approximately $24 million, and a 1% variation in our annual large commercial and industrial kWh sales projections under normal business conditions can result in increases or decreases in annual net income of approximately $6 million.\nWeather.\n \nIn forecasting the retail sales growth numbers provided above, we assume normal weather patterns based on historical data.\n \nOur experience indicates that typical variations from normal weather can result in increases and decreases in annual net income of up to $20 million.  However, since 2020, extreme weather events, such as record-setting summer heat and decreased annual precipitation in our service territory, have resulted in increases in annual net income that are more than historically typical, on average.\n \nFuel and Purchased Power Expenses.\n \nFuel and purchased power expenses included on our Condensed Consolidated Statements of Income are impacted by our electricity sales volumes, existing contracts for purchased power and generation fuel, our power plant performance, transmission availability or constraints, prevailing market prices, new generating plants being placed in service in our market areas, changes in our generation resource allocation, our hedging program for managing such costs and PSA deferrals and the related amortization.\nOperations and Maintenance Expenses\n. \n \nOperations and maintenance expenses are impacted by customer and sales growth, power plant operations, maintenance of utility plant (including generation, transmission, and distribution facilities), inflation, unplanned outages, planned outages (typically scheduled in the spring and fall), renewable energy and DSM related expenses (which are mostly offset by the same amount of operating revenues) and other factors. \nDepreciation and Amortization Expenses.\n \nDepreciation and amortization expenses are impacted by net additions to utility plant and other property (such as new generation, transmission, and distribution facilities), and increases in intangible assets and changes in depreciation and amortization rates.\n \nSee “Liquidity and Capital Resources” below for information regarding the planned additions to our facilities.\n \n \nPension and Other Postretirement Non-Service Credits, Net\n.\n \nPension and other postretirement non-service credits can be impacted by changes in our actuarial assumptions.\n \nThe most relevant actuarial assumptions are the discount rate used to measure our net periodic costs/credit, the expected long-term rate of return on plan assets used to estimate earnings on invested funds over the long-term, the mortality assumptions and the assumed healthcare cost trend rates.\n \nWe review these assumptions on an annual basis and adjust them, as necessary.  See Note 7.\nProperty Taxes.\n  Taxes other than income taxes consist primarily of property taxes, which are affected by changes in plant balances related to new investments and improvements to existing facilities, the value of property in service and under construction, assessment ratios, and tax rates. \n \nThe average property tax rate in Arizona for APS, which owns essentially all of our property, was 9.7% of the assessed value for 2024, 10.0% for 2023, and 10.2% for 2022.\n91\nTable of Contents\n \nIncome Taxes\n.\n  Income taxes are affected by the amount of pretax book income, income tax rates, certain deductions, certain credits and non-taxable items, such as allowance for borrowed funds used during construction (“AFUDC”).  In addition, income taxes may also be affected by the settlement of issues with taxing authorities. \n \nInterest Expense.\n  Interest expense is affected by the amount of debt outstanding and the interest rates on that debt.  See Note 5 for further details.  The primary factors affecting borrowing levels are expected to be our capital expenditures, long-term debt maturities, equity issuances and internally generated cash flow.\n \nAFUDC offsets a portion of interest expense while capital projects are under construction.\n \nWe stop accruing AFUDC on a project when it is placed into service.\nRESULTS OF OPERATIONS\n \nPinnacle West’s reportable business segment is our regulated electricity segment, which consists of retail and wholesale sales supplied under traditional cost-based regulation and related activities and includes electricity generation, transmission, and distribution.  Our reportable segment activities are conducted through our wholly-owned subsidiary, APS.  All other operating segment activities are insignificant to Pinnacle West.  \n \nOperating Results – Three-month period ended September 30, 2025, compared with three-month period ended September 30, 2024. \nOur consolidated net income attributable to common shareholders for the three months ended \nSeptember 30, 2025 was $413 million, compared with consolidated net income attributable to common shareholders of $395 million for the prior-year period.  The results reflect an increase of approximately $18 million, primarily as a result of increased customer usage, customer growth and related pricing, higher transmission service revenues, lower operations and maintenance expenses, higher AFUDC, lower depreciation and amortization expenses mostly due to operations ceasing at the Cholla plant, partially offset by increased plant additions and intangible assets.  These positive factors were partially offset by the unfavorable impacts of the effects of weather, higher interest charges, lower pension and other postretirement non-service credits, net, higher other taxes and higher income taxes due to higher pre-tax income and lower tax credits, offset by higher favorable book-tax permanent benefits. \n92\nTable of Contents\nThe following table presents net income attributable to common shareholders compared with the prior year for Pinnacle West consolidated and for APS consolidated (dollars in millions):\n \nPinnacle West Consolidated\nAPS Consolidated\nThree Months Ended September 30,\nThree Months Ended September 30,\n2025\n2024\nNet \nChange\n2025\n2024\nNet \nChange\nOperating revenues\n$\n1,821 \n$\n1,769 \n$\n52 \n$\n1,821 \n$\n1,769 \n$\n52 \nFuel and purchased power\n(656)\n(631)\n(25)\n(656)\n(631)\n(25)\nOperating revenues less fuel and purchased power (a)\n1,165 \n1,138 \n27 \n1,165 \n1,138 \n27 \nOperations and maintenance\n(300)\n(308)\n8 \n(298)\n(306)\n8 \nDepreciation and amortization\n(225)\n(229)\n4 \n(225)\n(229)\n4 \nTaxes other than income taxes\n(58)\n(53)\n(5)\n(58)\n(53)\n(5)\nAllowance for equity funds used during construction\n18 \n10 \n8 \n18 \n10 \n8 \nPension and other postretirement non-service credits, net\n3 \n12 \n(9)\n3 \n12 \n(9)\nOther income and (expense), net\n3 \n1 \n2 \n(3)\n— \n(3)\nInterest charges, net of allowance for borrowed funds used during construction\n(111)\n(98)\n(13)\n(85)\n(79)\n(6)\nIncome taxes\n(78)\n(74)\n(4)\n(86)\n(81)\n(5)\nLess: Net income related to noncontrolling interests\n(4)\n(4)\n— \n(4)\n(4)\n— \nNet Income Attributable to Common Shareholders\n$\n413 \n$\n395 \n$\n18 \n$\n427 \n$\n408 \n$\n19 \n(a)    Operating revenues less fuel and purchased power is a non-GAAP financial measure.  As reconciled in the table above, this amount is derived by the difference between the GAAP financial statement line item Operating revenues less the GAAP financial statement line item Fuel and purchased power as presented on the Condensed Consolidated Statements of Income.\n \nOperating revenues, less fuel and purchased power is used by Pinnacle West to assess whether customer revenues adequately cover fuel and purchased power costs.  This metric is not defined by GAAP and may differ from similar measures used by other companies.  This measure is not a substitute for operating income under GAAP.\n93\nTable of Contents\nOperating revenues less fuel and purchased power.  \nOperating revenues less fuel and purchased power expenses were $27 million higher for the three months ended September 30, 2025 compared with the prior-year period.  The following table summarizes the major components of this change (dollars in millions):\n \nIncrease (Decrease)\n \nOperating\nrevenues\nFuel and\npurchased\npower\nNet change\nHigher retail revenues due to changes in usage patterns, customer growth, and related pricing partially offset by the impacts of energy efficiency \n$\n76 \n$\n22 \n$\n54 \nHigher transmission revenues (Note 6)\n28 \n— \n28 \nChanges in net fuel and purchased power costs, including off-system sales margins and related deferrals\n28 \n24 \n4 \nLFCR revenue (Note 6)\n2 \n— \n2 \nHigher renewable energy regulatory surcharges, partially offset by operations and maintenance costs\n— \n2 \n(2)\nEffects of weather\n(82)\n(23)\n(59)\nTotal\n$\n52 \n$\n25 \n$\n27 \nOperations and maintenance\n.  Operations and maintenance expenses decreased $8 million for the three months ended September 30, 2025 compared with the prior-year period primarily due to: \n•\na decrease of $12 million related to employee benefit costs;\n•\na decrease of $2 million related to transmission, distribution, and customer service costs;\n•\nan increase of $2 million related to nuclear generation costs; \n•\nan increase of $2 million related to corporate resource costs;\n•\nan increase of $5 million related to information technology costs; and\n•\na decrease of $3 million for other miscellaneous factors.\nDepreciation and amortization.\n  Depreciation and amortization expenses were $4 million lower for the three months ended September 30, 2025 compared to the prior-year period, primarily due to lower depreciation expense due to operations ceasing at the Cholla plant, partially offset by increased plant in service and intangible assets.\nPension and other postretirement non-service credits, net.\n  Pension and other postretirement non-service credits, net were $9 million lower for the three months ended September 30, 2025 compared to the prior-year period, primarily due to prior-service credits becoming fully amortized as of January 31, 2025.  \nOther income and expense, net.\n  Other income and expense, net were $2 million higher for the three months ended September 30, 2025 compared to the prior-year period, primarily due to investment gains in El Dorado, partially offset by lower PSA interest income and higher other expenses.  The difference between APS’s and Pinnacle West’s other income and expense, net is primarily related to Pinnacle West’s gain in investment in El Dorado.\n94\nTable of Contents\nInterest charges, net of allowance for borrowed funds and equity funds used during construction.  \nInterest charges, net of allowance for funds used during construction, were $5 million higher for the three months ended September 30, 2025 compared to the prior-year period, primarily due to higher debt balances, partially offset by higher allowance for equity funds. \nTaxes other than income taxes.\n  Taxes other than income taxes were $5 million higher for the three months ended September 30, 2025, compared to the prior-year period, primarily due to a favorable true-up recognized during the third quarter of 2024.\nIncome taxes.\n  Income taxes were $4 million higher for the three months ended September 30, 2025 compared with the prior-year period, primarily due to higher pre-tax income and lower tax credits, offset by higher favorable book-tax permanent benefits.\n \nOperating Results – Nine-month period ended September 30, 2025, compared with nine-month period ended September 30, 2024. \nOur consolidated net income attributable to common shareholders for the nine months ended \nSeptember 30, 2025 was $601 million, compared with consolidated net income attributable to common shareholders of $616 million for the prior-year period.  The results reflect a decrease of approximately $15 million, primarily as a result of the effects of weather, higher operations and maintenance expenses, lower pension and other postretirement non-service credits, net, higher interest charges, and higher depreciation and amortization expenses mostly due to increased plant additions and intangible assets, partially offset by operations ceasing at the Cholla plant.  These negative factors were partially offset by increased usage and customer growth, higher transmission service revenues, the impacts of new customer rates, higher AFUDC, and the gain on the sale of BCE recognized during the first quarter of 2024, partially offset by investment gains in El Dorado.  \n95\nTable of Contents\nThe following table presents net income attributable to common shareholders compared with the prior year for Pinnacle West consolidated and for APS consolidated (dollars in millions):\n \nPinnacle West Consolidated\nAPS Consolidated\nNine Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nNet \nChange\n2025\n2024\nNet \nChange\nOperating revenues\n$\n4,212 \n$\n4,030 \n$\n182 \n$\n4,212 \n$\n4,030 \n$\n182 \nFuel and purchased power\n(1,513)\n(1,426)\n(87)\n(1,513)\n(1,426)\n(87)\nOperating revenues less fuel and purchased power (a)\n2,699 \n2,604 \n95 \n2,699 \n2,604 \n95 \nOperations and maintenance\n(886)\n(838)\n(48)\n(879)\n(832)\n(47)\nDepreciation and amortization\n(688)\n(665)\n(23)\n(688)\n(665)\n(23)\nTaxes other than income taxes\n(175)\n(171)\n(4)\n(175)\n(171)\n(4)\nAllowance for equity funds used during construction\n46 \n29 \n17 \n46 \n29 \n17 \nPension and other postretirement non-service credits, net\n9 \n37 \n(28)\n10 \n37 \n(27)\nOther income and (expense), net\n24 \n27 \n(3)\n(2)\n5 \n(7)\nInterest charges, net of allowance for borrowed funds used during construction\n(308)\n(283)\n(25)\n(244)\n(235)\n(9)\nIncome taxes\n(107)\n(111)\n4 \n(122)\n(124)\n2 \nLess: Net income related to noncontrolling interests\n(13)\n(13)\n— \n(13)\n(13)\n— \nNet Income Attributable to Common Shareholders\n$\n601 \n$\n616 \n$\n(15)\n$\n632 \n$\n635 \n$\n(3)\n(a)    Operating revenues less fuel and purchased power is a non-GAAP financial measure.  As reconciled in the table above, this amount is derived by the difference between the GAAP financial statement line item Operating revenues less the GAAP financial statement line item Fuel and purchased power as presented on the Condensed Consolidated Statements of Income.\n \nOperating revenues, less fuel and purchased power is used by Pinnacle West to assess whether customer revenues adequately cover fuel and purchased power costs.  This metric is not defined by GAAP and may differ from similar measures used by other companies.  This measure is not a substitute for operating income under GAAP.\n96\nTable of Contents\nOperating revenues less fuel and purchased power.  \nOperating revenues less fuel and purchased power expenses were $95 million higher for the nine months ended September 30, 2025 compared with the prior-year period.  The following table summarizes the major components of this change (dollars in millions):\n \nIncrease (Decrease)\n \nOperating\nrevenues\nFuel and\npurchased\npower\nNet change\nHigher retail revenues due to changes in usage patterns, customer growth and related pricing, partially offset by the impacts of energy efficiency \n$\n109 \n$\n41 \n$\n68 \nHigher transmission revenues (Note 6)\n49 \n— \n49 \nImpact of new rates from the 2022 Rate Case, effective March 8, 2024 (Note 6)\n46 \n— \n46 \nLFCR revenue (Note 6)\n8 \n— \n8 \nChanges in net fuel and purchased power costs, including off-system sales margins and related deferrals\n77 \n73 \n4 \nHigher renewable energy regulatory surcharges, partially offset by operations and maintenance costs\n5 \n6 \n(1)\nEffects of weather\n(115)\n(32)\n(83)\nMiscellaneous items, net\n3 \n(1)\n4 \nTotal\n$\n182 \n$\n87 \n$\n95 \nOperations and maintenance\n.  Operations and maintenance expenses increased $48 million for the nine months ended September 30, 2025 compared with the prior-year period, primarily due to: \n•\nan increase of $24 million related to information technology costs;\n•\nan increase of $18 million related to corporate resource costs;\n•\nan increase of $18 million related to non-nuclear generation costs, primarily due to increased planned outages;\n•\nan increase of $2 million related to nuclear generation costs;\n•\nan increase of $2 million related to transmission, distribution, and customer service costs;\n•\na decrease of $15 million related to employee benefit costs; and\n•\na decrease of $1 million for other miscellaneous factors.\nDepreciation and amortization.\n  Depreciation and amortization expenses were $23 million higher for the nine months ended September 30, 2025 compared to the prior-year period, primarily due to increased plant in service and intangible assets, partially offset by lower depreciation expense due to operations ceasing at the Cholla plant.\nPension and other postretirement non-service credits, net.\n  Pension and other postretirement non-service credits, net were $28 million lower for the nine months ended September 30, 2025 compared to the prior-year period primarily, due to prior-service credits becoming fully amortized as of January 31, 2025.\nOther income and expense, net.\n  Other income and expense, net were $3 million lower for the nine months ended September 30, 2025 compared to the prior-year period, primarily due to the gain on the sale \n97\nTable of Contents\nof BCE recognized during the first quarter of 2024 and lower PSA interest income, partially offset by investment gains in El Dorado.  The difference between APS’s and Pinnacle West’s other income and expense, net is primarily related to Pinnacle West’s gain on the sale of BCE and the gain in investment in El Dorado.\nInterest charges, net of allowance for borrowed funds and equity funds used during construction.  \nInterest charges, net of allowance for funds used during construction, were $8 million higher for the nine months ended September 30, 2025 compared to the prior-year period, primarily due to higher debt balances and lower allowance for borrowed funds, partially offset by higher allowance for equity funds.\nIncome taxes.\n  Income taxes were $4 million lower for the nine months ended September 30, 2025 compared with the prior-year period, primarily due to lower pre-tax income and higher tax benefits related to employee benefits, offset by lower tax credits.\nLIQUIDITY AND CAPITAL RESOURCES\n \nOverview\n \nPinnacle West’s primary cash needs are for dividends to our shareholders and principal and interest payments on our indebtedness.  The level of our common stock dividends and future dividend growth will be dependent on declaration by our Board of Directors and based on a number of factors, including our financial condition, payout ratio, free cash flow and other factors.\n \nOur primary sources of cash are dividends from APS and external debt and equity issuances.  An ACC order does not allow APS to pay common dividends if the payment would reduce its common equity ratio below 40%.  Per the related ACC order, the common equity ratio is defined as total shareholder equity divided by the sum of total shareholder equity and long-term debt, including current maturities of long-term debt.  As of September 30, 2025, APS’s common equity ratio, as defined, was 52%.  APS’s total shareholder equity was approximately $9.0 billion, and total capitalization, as calculated pursuant to the ACC order, was approximately $17.2 billion.  Under this order, APS would be prohibited from paying dividends if such payment would reduce its total shareholder equity below approximately $6.9 billion, assuming APS’s total capitalization remains the same.  This restriction does not materially affect Pinnacle West’s ability to meet its ongoing cash needs or ability to pay dividends to shareholders.\n \nDividends to Pinnacle West from APS are also dependent on a number of factors including, among others, APS’s financial condition and free cash flow, the sources of which vary from quarter-to-quarter due in part to the seasonal nature of electricity demand.  APS’s sources of cash include cash from operations and external sources of liquidity, including long- and short-term external debt financing such as commercial paper, term loans and its revolving credit facility.  Cash from operations is dependent upon, among other things, the rates APS may charge and the timeliness of recovering costs incurred through its rates and adjustor recovery mechanisms.  APS’s capital requirements consist primarily of capital expenditures and maturities of long-term debt.  APS funds its capital requirements with cash from operations and, to the extent necessary, external debt financings and equity infusions from Pinnacle West.  On December 17, 2024, the ACC issued a financing order approving a limit on yearly equity infusions equal to 2.5% of \nAPS’s total ass\nets each calendar year on a three-year rolling average basis, subject to APS’s equity ratio remaining below the most recently approved rate case capital structure plus 50 basis points.\n98\nTable of Contents\nPinnacle West and APS maintain committed revolving credit facilities that enhance liquidity and provide credit support for accessing commercial paper markets.  These credit facilities mature in 2029.  \nPinnacle West has an at-the-market equity distribution program (the “ATM Program”) under which Pinnacle West may offer and sell Pinnacle West common stock and enter into forward sale agreements from time to time, subject to market conditions and other factors.  Approximately $700 million of common stock is available to be issued under the ATM Program, which takes into account the forward sale agreements in effect as of September 30, 2025.  Pinnacle West also has forward sale agreements from an equity offering in February 2024 in effect as of September 30, 2025. \n \nSee “Financing Cash Flows and Liquidity—Equity Offerings” below and Note 12 for more information.\nSummary of Cash Flows\n \nThe following tables present net cash provided by (used for) operating, investing and financing activities (dollars in millions):\nPinnacle West Consolidated\nNine Months Ended September 30,\n \n2025\n2024\nNet Change\nNet cash flow provided by operating activities\n$\n1,328 \n$\n1,170 \n$\n158 \nNet cash flow used for investing activities\n(1,833)\n(1,469)\n(364)\nNet cash flow provided by financing activities\n532 \n343 \n189 \nNet increase in cash and cash equivalents\n$\n27 \n$\n44 \n$\n(17)\n \nAPS\nNine Months Ended September 30,\n \n2025\n2024\nNet Change\nNet cash flow provided by operating activities\n$\n1,356 \n$\n1,170 \n$\n186 \nNet cash flow used for investing activities\n(1,827)\n(1,529)\n(298)\nNet cash flow provided by financing activities\n496 \n403 \n93 \nNet increase in cash and cash equivalents\n$\n25 \n$\n44 \n$\n(19)\n \nOperating Cash Flows\n \nNine-month period ended September 30, 2025, compared with nine-month period ended September 30, 2024.  \nPinnacle West’s consolidated net cash provided by operating activities was $1,328 million in 2025 compared to $1,170 million in 2024, an increase of $158 million in net cash provided, primarily due to $291 million higher cash receipts from electric revenues and $42 million lower income taxes; partially offset by $74 million higher payments for fuel and purchased power costs, $46 million higher payments for operations and maintenance costs, $31 million of changes in working capital, $18 million in higher interest paid on debt, and $6 million higher other taxes paid.\n \nRetirement plans and other postretirement benefits.  \nPinnacle West sponsors a qualified defined benefit pension plan and a non-qualified supplemental excess benefit retirement plan for the employees of Pinnacle West and our subsidiaries.  Pinnacle West also sponsors other postretirement benefit plans for the \n99\nTable of Contents\nemployees of Pinnacle West and its subsidiaries.  The requirements of the Employee Retirement Income Security Act of 1974 (“ERISA”) require us to contribute a minimum amount to the qualified plan.  We contribute at least the minimum amount required under ERISA regulations, but no more than the maximum tax-deductible amount.  Under ERISA, the qualified pension plan was 101% funded as of January 1, 2025, and was 113% funded as of January 1, 2024.  Future year contribution amounts are dependent on plan asset performance and plan actuarial assumptions.  The expected minimum required cash contributions for the pension plan are zero for the next three years and we do not expect to make any voluntary cash contributions in 2025, 2026 or 2027.  Regarding contributions to our other postretirement benefit plan, we have not made a contribution year-to-date in 2025 and do not expect to make any contributions in 2025, 2026 or 2027.  We continually monitor financial market volatility and its impact on our retirement plans and other postretirement benefits, but we believe our liability driven investment strategy helps to minimize the impact of market volatility on our plan’s funded status.  For instance, our pension plan’s funded status was 99% funded as of December 31, 2024, and our postretirement benefit plans were 195% funded, as measured for accounting principles generally accepted in the United States of America (“GAAP”) at December 31, 2024.  \nInvesting Cash Flows\nNine-month period ended September 30, 2025, compared with nine-month period ended September 30, 2024.  \nPinnacle West’s consolidated net cash used for investing activities was $1,833 million in 2025 compared to $1,469 million in 2024, an increase of $364 million primarily related to $307 million of increased capital expenditures, net of contributions in aid of construction, and $64 million of proceeds from the BCE Sale received in 2024.  See “Capital Expenditures” below for additional details.  The difference between APS’s and Pinnacle West’s net cash used for investing activities primarily relates to the proceeds received from the BCE Sale. \nCapital Expenditures.\n  The following table summarizes the estimated capital expenditures for the next four years (dollars in millions): \n \nCapital Expenditures\nEstimated for the Year Ending\nDecember 31,\n \n2025\n2026\n2027\n2028\nAPS\nGeneration:\nGas and Other Generation\n$\n420 \n$\n635 \n$\n550 \n$\n490 \nNuclear Generation\n150 \n170 \n185 \n215 \nRenewables and Energy Storage\n335 \n20 \n5 \n5 \nDistribution\n665 \n765 \n795 \n750 \nTransmission\n450 \n550 \n695 \n860 \nOther\n380 \n460 \n420 \n380 \nTotal APS\n$\n2,400 \n$\n2,600 \n$\n2,650 \n$\n2,700 \n \nThe table above does not include capital expenditures related to PNW Power projects or to the purchase of certain leased interests relating to Palo Verde.  See Note 8.\n100\nTable of Contents\nGeneration capital expenditures are comprised of various additions and improvements to APS’s resources, including nuclear plants, renewables and energy storage, additions and improvements to existing fossil fuel plants, as well as planned investments in new natural gas facilities.  We are monitoring the status of environmental matters, which, depending on their final outcome, could require modification to our planned environmental expenditures.\nDistribution and transmission capital expenditures are comprised of infrastructure additions and upgrades, capital replacements, and new customer construction.  Examples of the types of projects included in the forecast include power lines, substations, and line extensions to new residential and commercial developments.\nCapital expenditures are expected to be funded with internally generated cash and external financings, which may include issuances of long-term debt and Pinnacle West common stock.\n \nFinancing Cash Flows and Liquidity\n \nNine-month period ended September 30, 2025, compared with nine-month period ended September 30, 2024. \n Pinnacle West’s consolidated net cash provided by financing activities was $532 million in 2025 compared to $343 million in 2024, an increase of $189 million in net cash provided primarily due to an increase of  $430 million higher issuances of long-term debt, a $93 million increase in short-term borrowings; partially offset by the $199 million payment for the Palo Verde sale leaseback noncontrolling interest acquisition and $125 million higher long-term debt repayments.\n APS’s consolidated net cash provided by financing activities was $496 million in 2025 compared to $403 million in 2024, an increase of $93 million in net cash provided primarily due to an increase of $502 million higher issuances of long-term debt; partially offset by the $199 million payment for the Palo Verde sale leaseback noncontrolling interest acquisition, $150 million in lower equity infusions from Pinnacle West and $50 million higher long-term debt repayments.\nSignificant Financing Activities.\n  On October 22, 2025, the Pinnacle West Board of Directors declared a dividend of $0.910 per share of common stock, payable on December 1, 2025, to shareholders of record on November 3, 2025.  This represents an increase in the indicated annual dividend from $3.58 per share to $3.64 per share.\nOn May 15, 2025, Pinnacle West contributed $300 million into APS in the form of an equity infusion.  APS used this contribution to repay the $300 million of its 3.15% senior notes that matured on the same date.\nAvailable Credit Facilities\n.  \nPinnacle West and APS maintain committed revolving credit facilities in order to enhance liquidity and provide credit support for their commercial paper.  See Note 5 for more information on available credit facilities.\n101\nTable of Contents\nEquity Offerings\n.\n   Pinnacle West entered into certain equity forward sale agreements in February 2024 and has an ATM Program under which Pinnacle West may offer and sell Pinnacle West common stock and enter into equity forward sale agreements from time to time, subject to market conditions and other factors.  See Note 12.  The following table summarizes the activity relating to these forward sale agreements and the ATM Program as of September 30, 2025 (dollars in thousands, except price per share):\nAs of September 30, 2025\nFebruary 2024 Forward Sale Agreements\nTotal ATM Program\nInitial Price\nNumber of Shares\n11,240,601 \n2,199,415 \nForward Sales Price Per Share (a)\n$\n64.51 \n$\n90.10 \n(d)\nAggregate Value\n$\n725,131 \n$\n198,176 \nSettlements\nDate\n12/23/2024\nNumber of Shares Settled (b)\n5,377,115 \n— \nForward Sales Price Upon Settlement\n$\n64.17 \n$\n— \nNet Proceeds (c)\n$\n345,049 \n$\n— \nDate\n9/4/2025\nNumber of Shares Settled (b)\n243,186 \n— \nForward Sales Price Upon Settlement\n$\n63.12 \n$\n— \nNet Proceeds (c)\n$\n15,350 \n$\n— \n(a)    Subject to certain adjustments.\n(b)    Physical delivery.\n(c)    Proceeds recorded in common equity on the Condensed Consolidated Balance Sheets.\n(d)   Weighted-average price for the total ATM Program.\nOther Financing Matters.\n  See Note 9 for information related to the change in our margin and collateral accounts.\n \nDebt Provisions\n \nPinnacle West’s and APS’s debt covenants related to their respective bank financing arrangements include maximum debt to capitalization ratios.  Pinnacle West and APS comply with these covenants.  For both Pinnacle West and APS, these covenants require that the ratio of consolidated debt to total consolidated capitalization not exceed 65%.  As of September 30, 2025, the ratio was approximately 60% for Pinnacle West and 49% for APS.  Failure to comply with such covenant levels would result in an event of default which, generally speaking, would require the immediate repayment of the debt subject to the covenants and could “cross-default” other debt.  See further discussion of “cross-default” provisions below.\n \nNeither Pinnacle West’s nor APS’s financing agreements contain “rating triggers” that would result in an acceleration of payment in the event of a rating downgrade.  However, our bank credit agreements contain a pricing grid in which the interest rates we pay for borrowings thereunder are determined by our current credit ratings.\n \n102\nTable of Contents\nAll of Pinnacle West’s and APS’s credit agreements contain “cross-default” provisions that would result in defaults and the potential acceleration of payment if Pinnacle West or APS were to default under certain other material agreements.  Pinnacle West and APS do not have a material adverse change covenant for credit facility borrowings.\nCredit Ratings\nThe ratings of securities of Pinnacle West and APS as of October 30, 2025, are shown below.  We are disclosing these credit ratings to enhance understanding of our cost of short-term and long-term capital and our ability to access the markets for liquidity and long-term debt.  The ratings reflect the respective views of the rating agencies, from which an explanation of the significance of their ratings may be obtained.  There is no assurance that these ratings will continue for any given period.  The ratings may be revised or withdrawn entirely by the rating agencies if, in their respective judgments, circumstances so warrant.  Any downward revision or withdrawal may adversely affect the market price of Pinnacle West’s or APS’s securities and/or result in an increase in the cost of, or limit access to, capital.  Such revisions may also result in substantial additional cash or other collateral requirements related to certain derivative instruments, insurance policies, natural gas transportation, fuel supply, and other energy-related contracts.  At this time, we believe we have sufficient available liquidity resources to respond to a potential downward revision to our credit ratings. \n \nMoody’s\n \nStandard & Poor’s\n \nFitch\nPinnacle West\n \n \n \n \n \nCorporate credit rating\nBaa2\nBBB+\nBBB\nSenior unsecured\nBaa2\nBBB\nBBB\nCommercial paper\nP-2\nA-2\nF3\nOutlook\nStable\nStable\nStable\nAPS\n \n \n \n \n \nCorporate credit rating\nBaa1\nBBB+\nBBB+\nSenior unsecured\nBaa1\nBBB+\nA-\nCommercial paper\nP-2\nA-2\nF2\nOutlook\nStable\nStable\nStable\n \nContractual Obligations\nPinnacle West’s contractual cash obligations have not materially changed during the nine months ended September 30, 2025 as compared to the 2024 Form 10-K, except as disclosed in Note 5 - “Debt and Liquidity Matters”, and Note 10 - “Commitments and Contingencies” to the Combined Notes to condensed consolidated financial statements included in this report.\n103\nTable of Contents\n \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing the financial statements in accordance with GAAP, management must often make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses and related disclosures at the date of the financial statements and during the reporting period.  Some of those judgments can be subjective and complex, and actual results could differ from those estimates.  There have been no changes to our critical accounting policies and estimates since our 2024 Form 10-K.  See “Critical Accounting Policies and Estimates” in Item 7 of the 2024 Form 10-K for further details about our critical accounting policies and estimates.\nOTHER ACCOUNTING MATTERS\nSee Note 3 for information on the following new accounting standards that are pending adoption:\n•\nASU 2023-09, Income Taxes: Improvements to Income Tax Disclosures, effective for us on December 31, 2025.  \n•\nASU 2024-03, Income Statement Reporting: Expense Disaggregation Disclosures, effective for us on December 31, 2027.\n•\nASU 2025-03, Business Combinations and Consolidation: Determining the Accounting Acquirer in the Acquisition of a Variable Interest Entity, effective for us on January 1, 2027.\n•\nASU 2025-06, Intangibles—Goodwill and Other—Internal-Use Software: Targeted Improvements to the Accounting for Internal-Use Software, effective for us on January 1, 2028.\nMARKET AND CREDIT RISKS\n \nMarket Risks\n \nOur operations include managing market risks related to changes in interest rates, commodity prices, investments held by our nuclear decommissioning trusts, other special use funds and benefit plan assets.\n \nInterest Rate and Equity Risk\n \nWe have exposure to changing interest rates.  Changing interest rates will affect interest paid on variable-rate debt and the market value of fixed income securities held by our nuclear decommissioning trust, other special use funds (see Notes 13 and 14), and benefit plan assets.  The nuclear decommissioning trust, other special use funds and benefit plan assets also have risks associated with the changing market value of their equity and other non-fixed income investments.  Nuclear decommissioning, coal reclamation, and benefit plan costs are recovered in regulated electricity prices.\n104\nTable of Contents\nCommodity Price Risk\n \nWe are exposed to the impact of market fluctuations in the commodity price and transportation costs of electricity and natural gas.  Our risk management committee, consisting of officers and key management personnel, oversees company-wide energy risk management activities to ensure compliance with our stated energy risk management policies.  We manage risks associated with these market fluctuations by utilizing various commodity instruments that may qualify as derivatives, including futures, forwards, options, and swaps.  As part of our risk management program, we use such instruments to hedge purchases and sales of electricity and natural gas.  The changes in market value of such contracts have a high correlation to price changes in the hedged commodities.\nThe following table shows the net pretax changes in mark-to-market of our energy derivative positions (dollars in millions):\n \nNine Months Ended September 30,\n2025\n2024\nBalance at beginning of period\n$\n(42)\n$\n(120)\nDecrease in regulatory asset\n31 \n21 \nBalance at end of period\n$\n(11)\n$\n(99)\nThe table below shows the fair value of maturities of our energy derivative contracts (dollars in millions) as of September 30, 2025, by maturities and by the type of valuation that is performed to calculate the fair values, classified in their entirety based on the lowest level of input that is significant to the fair value measurement.  See Note 1, “Derivative Accounting” and “Fair Value Measurements” in Item 8 of our 2024 Form 10-K for more discussion of our valuation methods.\nSource of Fair Value\n2025\n2026\n2027\n2028\n2029\nTotal \nFair \nValue\nObservable prices provided by other external sources\n$\n(10)\n$\n6 \n$\n9 \n$\n2 \n$\n— \n$\n7 \nPrices based on unobservable inputs\n— \n(18)\n— \n— \n— \n(18)\nTotal by maturity\n$\n(10)\n$\n(12)\n$\n9 \n$\n2 \n$\n— \n$\n(11)\n105\nTable of Contents\nThe table below shows the impact that hypothetical price movements of 10% would have on the market value of our risk management assets and liabilities included on Pinnacle West’s Condensed Consolidated Balance Sheets (dollars in millions):\n \nSeptember 30, 2025\nGain (Loss)\nDecember 31, 2024\nGain (Loss)\n \nPrice Up  10%\nPrice Down 10%\nPrice Up  10%\nPrice Down 10%\nMark-to-market changes reported in:\n \n \n \n \nRegulatory asset (liability) (a)\n \n \n \n \nElectricity\n$\n3 \n$\n(3)\n$\n3 \n$\n(3)\nNatural gas\n64 \n(64)\n75 \n(75)\nTotal\n$\n67 \n$\n(67)\n$\n78 \n$\n(78)\n(a)\nThese contracts are economic hedges of our forecasted purchases of natural gas and electricity.  The impact of these hypothetical price movements would substantially offset the impact that these same price movements would have on the physical exposures being hedged.  To the extent the amounts are eligible for inclusion in the PSA, the amounts are recorded as either a regulatory asset or liability.\n \nCredit Risk\n \nWe are exposed to losses in the event of non-performance or non-payment by counterparties.  See Note 9 for a discussion of our credit valuation adjustment policy."
}