{
  "item1": "FERC regulates rates wholesale power sales transmission services. See Note 3 information regarding APS’s transmission rates. During 2024, approximately 4.2% APS’s electric operating revenues resulted such sales services. APS’s wholesale activity primarily consists managing fuel purchased power supplies serve retail customer energy requirements.",
  "item7": "(dollars millions) Fuel purchased power expense Operating revenues less fuel purchased power expenses Operations maintenance Depreciation amortization Taxes other than income taxes Allowance equity funds used during construction Pension other postretirement non-service credits, net Other income expenses, net Interest charges, net allowance borrowed funds used during construction Less income related noncontrolling interests Net Income Attributable Common Shareholders Operating revenues less fuel purchased power expenses. Operating revenues less fuel purchased power expenses $399 million higher year ended December 31, 2024, compared prior-year period. following table summarizes major components change: (dollars millions) Impact new rates 2022 Rate Case, effective March 8, 2024 (Note 3) Higher retail revenue due changes usage patterns customer growth partially offset impacts energy efficiency related pricing CRS revenue (Note 3) Higher renewable energy regulatory surcharges, partially offset operations maintenance costs LFCR revenue (Note 3) Changes net fuel purchased power costs, including off-system sales margins related deferrals Lower transmission revenues (Note 3) Operations maintenance . Operations maintenance expenses increased $106 million year ended December 31, 2024, compared prior-year period primarily due to: increase $27 million related information technology costs; increase $25 million related transmission, distribution, customer service costs; increase $20 million related non-nuclear generation costs, primarily due increased planned outages; increase $16 million related employee benefit costs; increase $14 million related costs renewable energy programs similar regulatory programs, which partially offset operating revenues purchased power; increase $7 million related corporate resource costs; decrease $3 million other miscellaneous factors.",
  "item2": "Actual Projected Customer Sales Growth. Retail customers APS’s service territory increased 2.4% period ended September 30, 2025 compared prior-year period. three years through 2024, APS’s customer growth averaged 2.1% per year. currently project annual customer growth 2.0% 2.5% 2025 average annual growth range 1.5% 2.5% through 2030 based anticipated steady population growth Arizona during period."
}