{
  "source_file": "podd-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nOverview \nInsulet Corporation (“we” or the “Company”) is primarily engaged in the development, manufacture, and sale of its proprietary continuous insulin delivery systems for people with insulin-dependent diabetes. The Omnipod platform includes: the Omnipod\n®\n 5 Automated Insulin Delivery System (“Omnipod 5”), the Omnipod DASH\n®\n Insulin Management System (“Omnipod DASH”), and the Omnipod Insulin Management System (“Classic Omnipod”).\nWe also produce pods for Amgen for use in the Neulasta\n®\n Onpro\n®\n kit, a delivery system for Amgen’s Neulasta to help reduce the risk of infection after intense chemotherapy.\nMarket Opportunity: Management of Diabetes\nDiabetes is a chronic, life-threatening disease for which there is no known cure. It is caused by the body’s inability to produce or effectively utilize the hormone insulin, which prevents the body from adequately regulating blood glucose levels. Glucose, the primary source of energy for cells, must be maintained at certain concentrations in the blood in order to permit optimal cell function and health. In people with diabetes, blood glucose levels fluctuate between very high levels, a condition known as hyperglycemia, and very low levels, a condition called hypoglycemia. Hyperglycemia can lead to serious short-term complications, such as confusion, vomiting, dehydration, and loss of consciousness and long-term complications, such as blindness, kidney disease, nervous system disease, occlusive vascular diseases, stroke, cardiovascular disease, or death. Hypoglycemia can lead to confusion, loss of consciousness, or death.\nDiabetes is typically classified as either type 1 or type 2:\n•\nType 1 diabetes is characterized by the body’s nearly complete inability to produce insulin. It is diagnosed throughout the age spectrum, with over half of newly diagnosed cases occurring in adulthood. Individuals with type 1 diabetes require daily insulin therapy to survive. We estimate that approximately 5 million people have type 1 diabetes in the countries we currently serve.\n•\nType 2 diabetes, the more common form, is characterized by the body’s inability to either properly utilize insulin or produce enough insulin. Historically, type 2 diabetes has occurred in later adulthood, but its incidence is increasing among the younger population, due primarily to increasing obesity. Initially, many people with type 2 diabetes attempt to manage their diabetes with improvements in diet, exercise, and/or medications, both oral and injectable, including SGLT2 inhibitors and GLP-1 drugs. As their diabetes advances, some individuals progress to multiple drug therapies, which often include insulin therapy. People with type 2 diabetes who take insulin either require intensive insulin therapy (typically multiple injections of insulin per day) or basal (long-acting) insulin (typically a single injection daily or weekly). We estimate that approximately 6 million people have insulin-intensive type 2 diabetes in the countries we currently serve and another 3 million people with type 2 diabetes in the United States require only long-acting insulin.\nWe estimate that approximately 40% of the type 1 diabetes population in the United States and 20% of the international type 1 diabetes population use insulin pump therapy. An even smaller portion of the U.S. and international insulin-intensive type 2 diabetes population and the U.S. basal only insulin type 2 population use insulin pump therapy. We believe these factors present a significant available market for our Omnipod platform globally.\nThroughout this Annual Report on Form 10-K, we refer to both type 1 diabetes and insulin-intensive type 2 diabetes as insulin-dependent diabetes.\nDiabetes Management Challenges\nDiabetes is often frustrating and difficult for people to manage. Blood glucose levels can be affected by the carbohydrate and fat content of meals, exercise, stress, illness, impending illness, hormonal releases, variability in insulin absorption, and changes in the effects of insulin on the body. For people with insulin-dependent diabetes, many corrections, consisting of the administration of additional insulin or ingestion of additional carbohydrates, are needed throughout the day in order to maintain blood glucose levels within normal ranges. Achieving this result can be very difficult with multiple daily injections of insulin. Individuals with diabetes attempting to control their blood glucose levels tightly to prevent the long-term complications associated with fluctuations in blood glucose levels are at greater risk for overcorrection and hypoglycemia. Additionally, the time spent managing fluctuations in blood glucose levels and the fear associated with hypoglycemia can be incredibly stressful for individuals with diabetes and their families.\n3\nTable of Contents\nCurrent Insulin Therapy\nPeople with insulin-dependent diabetes need a continuous supply of insulin, known as basal insulin, for background metabolic needs. In addition to basal insulin, people with insulin-dependent diabetes require supplemental insulin, known as bolus insulin, to compensate for carbohydrates ingested during meals or snacks or for a high blood glucose level caused by other physiological reasons. There are two primary types of insulin therapy practiced today: multiple daily injection (“MDI”) therapy using syringes or insulin pens and pump therapy using insulin pumps.\nMDI therapy involves injecting fast-acting insulin before meals (bolus) to lower blood glucose levels to a healthy range. MDI therapy may also require a separate injection of a long-acting (basal) insulin, to control glucose levels between meals; typically, once or twice per day. By comparison, insulin pump therapy uses only fast-acting insulin to fulfill both mealtime (bolus) and background (basal) requirements. Insulin pump therapy allows individuals to customize their bolus and basal insulin doses to meet their insulin needs throughout the day and is intended to more closely resemble the physiologic function of a healthy pancreas.\nInsulin pumps perform continuous subcutaneous insulin infusion and typically use a programmable device and an infusion set to administer insulin into the body. Insulin pump therapy has been shown to provide numerous advantages relative to MDI therapy. For example, insulin pump therapy eliminates individual insulin injections, delivers insulin more accurately and precisely than injections, often improves HbA1c (a common measure of blood glucose levels) over time, provides greater flexibility with meals, exercise, and daily schedules, and can reduce severe low blood glucose levels. We believe that these advantages, along with technological advancements, including the use of continuous glucose monitoring technology and automated insulin device (“AID”) algorithms, and increased awareness of insulin pump therapy, will continue to generate demand for insulin pump devices. \nOur Solution: The Omnipod Platform\nThe Omnipod platform offers continuous insulin delivery that provides all the benefits of insulin pump therapy in a unique way without the need for external tubing required with conventional pumps. The small, lightweight, self-adhesive disposable tubeless Omnipod device (“Pod”), can be worn in multiple locations, including the abdomen, hip, back of upper arm, upper thigh, or lower back, and delivers insulin into the body through a small flexible tube (called a cannula). We refer to this as “Pod therapy.” We believe the Omnipod platform’s innovative proprietary design and differentiated features allow people with insulin-dependent diabetes to live their lives and manage their diabetes, with unprecedented freedom, comfort, convenience, and ease.\nOmnipod 5\nOmnipod DASH\nOmnipod 5\nIn 2022, we received U.S. Food and Drug Administration (“FDA”) clearance and CE Mark approval under the European Union Medical Device Regulation (“MDR”) for Omnipod 5, which builds on our Omnipod DASH platform. Omnipod 5 is now available in 10 countries. Additionally, in August 2024, we received FDA clearance for an expanded indication of Omnipod 5 for people with type 2 diabetes (ages 18 years and older) in the United States.\nOmnipod 5 includes a proprietary AID algorithm embedded in the Pod. The Pod integrates with a third-party continuous glucose monitor (“CGM”) to obtain glucose values through wireless Bluetooth communication. The embedded algorithm utilizes these glucose values to predict glucose levels into the future and automatically adjusts insulin dosing intended to improve time-in-range and reduce the occurrence of blood glucose highs and lows. The user can also deliver insulin doses for snacks or meals or to correct high blood glucose through the system. The Pod can be controlled by an Insulet-provided \n4\nTable of Contents\nhandheld device or a user-downloaded Android app or, in the US, the iOS app, with full smartphone compatibility. The Omnipod 5 Controller and the Android and iOS apps use cloud-based technology to upload data wirelessly via a built-in SIM card or secure Wi-Fi. The Pod currently integrates with Dexcom, Inc.’s G6 and G7 CGMs and with Abbott Diabetes Care, Inc.’s (“Abbott”) FreeStyle Libre 2 Plus sensor (“Libre 2 Plus”) in various markets as depicted under \nMarkets and Distribution Methods\n. \nOmnipod DASH\nOmnipod DASH features a secure Bluetooth enabled Pod that is controlled by a smartphone-like Personal Diabetes Manager (“PDM”) with a color touch screen user interface. In the U.S., the PDM has Wi-Fi capabilities to enable automatic data uploads providing users and their clinicians with cloud access to data and enhancements for pushing software updates wirelessly to users. Omnipod DASH provides continuous insulin delivery at preset rates, eliminating the need for individual insulin injections. In addition, insulin delivery can be changed with the press of a button to adapt to snacks or unexpected changes in daily routine. Omnipod DASH delivers insulin in two ways:\n•\nA small, constant background supply of insulin is delivered automatically at a programmed rate, all day and night.\n•\nAn extra dose of insulin can be delivered when needed to match the carbohydrates in a snack or meal to correct high blood glucose.\nWe have designed Omnipod DASH to fit within the normal daily routines of users. Omnipod DASH communicates wirelessly, provides for virtually pain-free automated cannula insertion, and eliminates the need for MDI therapy or the use of pump and tubing. The Pod can be worn for up to three days at a time and, because it is waterproof (with an IP28 rating for up to 25 feet for 60 minutes), there is no need to remove it when showering, swimming, or performing other activities. \nOmnipod Classic\nFollowing the launch of Omnipod 5, the vast majority of our customer base is no longer using our Classic Omnipod product. Accordingly, we are phasing out our Classic Omnipod product.\nData Management\nWe have partnered with Glooko Inc. (“Glooko”) to connect user data with Glooko’s comprehensive diabetes data management system (including Glooko and Diasend in selected regions). Glooko provides a cloud-based application for clinicians and users accessible through a kiosk, home computer, or a mobile application on the user’s smartphone that provides users and their healthcare providers access to insulin delivery trends, blood glucose levels, and other integrated data. \nSecurity\nParamount to our ability to deliver full compatible smartphone control is our commitment to cybersecurity and information security. With certifications from the Diabetes Technology Society’s “Standard for Wireless Diabetes Device Security” cybersecurity and assurance standard and program as well as from the International Organization for Standardization (“ISO”), Insulet is globally recognized for incorporating the highest standards for cybersecurity, information security, and safety, including secure data transfer between the Pod and PDM, as well as secure cloud storage. See Item 1C. “Cybersecurity” for additional information. \nThird-Party Reimbursement\nIn the United States, we sell our products primarily through wholesalers and, to a lesser extent to healthcare organizations, pharmacies, and consumers. In some cases, we seek reimbursement from government administrative payors and/or health insurance companies. In the United States, consumers generally have commercial insurance, Medicare or Medicaid coverage that pays for the product. Our Omnipod platform’s unique patented design allows us to provide Pod therapy at a relatively low or no up-front investment, which reduces the risk to third-party payors in the United States. \nIn our international locations, we sell either directly to consumers or through a distributor/intermediary. In all countries where we operate, either Insulet or our partners establish appropriate reimbursement contracts with healthcare systems in those countries and provinces. Reimbursement structures vary by country and our unique offering allows us to provide Pod therapy in attractive pricing structures that reduce the risk to payors while expanding access. \n5\nTable of Contents\nMarkets and Distribution Methods\nOmnipod products are currently available in the following 25 countries: \nAustralia\nCyprus\nGreece\nNetherlands*\nSwitzerland\nAustria\nDenmark*\nIceland\nNorway*\nTurkey\nBelgium\nFinland*\nIsrael\nQatar\nUnited Arab Emirates\nCanada\nFrance*\nItaly*\nSaudi Arabia\nUnited Kingdom*\nCroatia\nGermany*\nKuwait\nSweden*\nUnited States*\n* Represents country in which Omnipod 5 is available\nWe sell Omnipod products to wholesalers that supply the pharmacy channel in the United States. In addition, we sell Omnipod products through distribution partners and directly to consumers. For the year ended December 31, 2024, 88% of Omnipod product sales globally were through intermediaries.\nThe percentages of total revenue for customers that represent 10% or more of total revenue was as follows: \nYears Ended December 31,\n2024\n2023\n2022\nDistributor A\n28%\n28%\n19%\nDistributor B\n26%\n24%\n16%\nDistributor C\n21%\n19%\n17%\nOur sales and marketing efforts are focused on customer acquisition and retention to meet the user, clinician, and payor demands for our Omnipod products. We have a comprehensive sales and marketing approach, which communicates the benefits of the Omnipod platform to users, physicians, and providers. This includes three areas of focus:\n•\nBuilding consumer awareness about the features and benefits that Omnipod products provide to simplify diabetes management.\n•\nStrengthening physician support by demonstrating clinical evidence of how Omnipod products improve outcomes and quality of life and providing data and insights to physicians offering diabetes care. \n•\nProviding payors with the clinical and economic justifications for why Omnipod products offer unique value to the people they insure.\n \nTraining\nWe believe that training consumers on how to use Omnipod products is an important factor to promote successful outcomes and customer retention. We have streamlined and standardized our training by developing online resources and increased our field clinician team to directly train new users. We created an online training program for Omnipod customers transitioning to Omnipod 5 or Omnipod DASH. In addition, our virtual training allows us to onboard new Omnipod customers transitioning from MDI in a cost-effective manner. Our distributors have also implemented virtual training programs. \nCustomer Support\nWe seek to provide our customers with high quality customer support, from product ordering to insurance investigation, order fulfillment, and ongoing support. Our customer support systems are integrated with our sales, reimbursement, and billing processes, allowing us to provide customers with reliable support by telephone and through our website.\nCompetition\nThe diabetes medical device market is highly competitive, subject to rapid change, and significantly affected by new product introductions. Our Omnipod platform competes for consumers in the insulin delivery market. Because most new Omnipod users come from MDI therapy, which currently is the most prevalent method of insulin delivery, we believe that we primarily compete with companies that provide products and supplies for MDI therapy. We also compete with companies in the insulin pump market, which today consists of tubed pump companies, primarily Medtronic MiniMed, a division of Medtronic public limited company (“Medtronic”) and Tandem Diabetes Care Inc. (“Tandem”). The competitive landscape in our industry continues to undergo significant change. In addition to the established insulin pump competitors, several companies are \n6\nTable of Contents\nworking to develop and market new insulin pumps and smart pens. These companies are at various stages of development and the number of such companies often changes as they enter or exit the market. \nResearch and Development\nOur innovation programs are designed to drive:\n•\nsimplicity of user interaction with our systems to minimize the burden of diabetes;\n•\nimproved outcomes, primarily through algorithm advancements;\n•\ninsights and value from our growing datasets and analytics; and\n•\nuser choice of sensor and smartphone integrations.\nMany of our research and development efforts are focused on making improvements to Omnipod 5, including adding features and functionality that will deliver increased economic value and convenience to users. Advances in innovation in 2024 include the following:\n•\nreceived FDA clearance for an expanded indication of Omnipod 5 for type 2 diabetes for people aged 18 years and older in the United States; \n•\nlaunched iOS app with Dexcom’s G6 CGM in the United States; \n•\nlaunched Omnipod 5 integration with Dexcom’s G7 CGM in the United States;\n•\nlaunched Omnipod 5 integration with Dexcom’s G6 CGM in France;\n•\nreceived CE mark approval under the MDR for the added compatibility of both Dexcom’s G7 CGM and Libre 2 Plus with Omnipod 5 for individuals aged two years and older with type 1 diabetes; and \n•\nlaunched Omnipod 5 integration with Libre 2 Plus in the United States, United Kingdom. and Netherlands. \nWe also continue to advance work to improve the Omnipod 5 algorithm and develop next-generation AID products. In 2024, we completed the first round of our EVOLUTION feasibility trial in New Zealand to test potential enhancements to the Omnipod 5 algorithm in order to further drive simplicity of use. The study included testing the system with both type 1 and type 2 users. We are in the process of analyzing the data and making modifications for the next round of study. \nManufacturing and Quality Assurance \nIn order to manufacture sufficient volumes of our Pods at high quality while still achieving a cost-effective per unit production price, we have designed our Pods to be manufactured through automation. We produce our products at our highly automated manufacturing facility in Acton, Massachusetts and, beginning in June 2024, also at our new highly automated manufacturing plant in Malaysia, which we constructed to support our international expansion strategy and further ensure product supply.\nWe also produce our devices on manufacturing lines at a facility in China operated by a contract manufacturer. This contract manufacturing agreement expires in October 2025 and is subject to automatic renewal, unless canceled by either party under the terms of the contract. \nWe also continue to invest in supply chain efficiencies, including automation improvements at our suppliers and contract manufacturer. \nRaw Materials\nWe use a broad range of raw materials in the assembly and manufacturing of our products. We purchase our raw materials and select components used in the manufacturing of our products from external suppliers. We purchase some supplies from a single or limited number of sources for reasons of proprietary know-how, quality assurance, cost-effectiveness, or constraints resulting from regulatory requirements. We rely on a limited number of suppliers for a certain number of the components and sub-assemblies used in the manufacture of our products, including application-specific integrated circuit chips, Bluetooth low-energy chips, and other specialized parts. The design of certain components and sub-assemblies (including, in some instances, the raw materials used to manufacture them) is proprietary and the intellectual property rights may be owned exclusively by one party. In such cases, we are sole-sourced, with the supplier controlling the intellectual property rights. These sole-sourced components are critical to the design and functionality of our products. In the case of sole-sourced parts, we manage risk through holding inventory in-house and at the supplier to ensure continuity of supply and lower risk of disruption. We purchase many of our components and sub-assemblies from manufacturers with whom we are at least dual-sourced. We work closely with all suppliers to ensure continuity of supply while maintaining high quality and reliability.\n7\nTable of Contents\nQuality Assurance\nWe utilize outside vendors for the supply of components, sub-assemblies, and various services used in the manufacture of our products. Our outside vendors produce the components to our specifications, and they are audited periodically by our Quality team to confirm conformity with the specifications, policies, and procedures for our products. Our Quality team also inspects and tests our products at various steps in the manufacturing cycle to facilitate compliance with our specifications. We have received our ISO, European Union MDR, and Medical Device Single Audit Program certifications for our Quality Management System from BSI Group, an accredited Notified Body for CE Marking. Processes utilized in the manufacture, test, and release of our products have been verified and validated as required by the FDA and other regulatory bodies. As a medical device manufacturer and distributor, our manufacturing facilities and the facilities of our suppliers are subject to periodic inspection by the FDA, certain corresponding state agencies, and other regulatory bodies.\nIntellectual Property\nTo maintain a competitive advantage, we believe we must develop and preserve the proprietary aspect of our technologies. We rely on a combination of copyright, patent, trademark, trade secret, and other intellectual property laws, non-disclosure agreements, and other measures to protect our proprietary rights. We require our employees, consultants, and advisers to execute non-disclosure agreements in connection with their employment, consulting, or advisory relationships with us, where appropriate. We also require employees, consultants, and advisers who work on our products to agree to disclose and assign to us all inventions conceived during their work with us that are developed using our property or relate to our business. Despite measures taken to protect our intellectual property, unauthorized parties may attempt to copy aspects of our products or obtain and use information that we regard as proprietary.\nPatents\nAs of December 31, 2024, we had over 750 patents in the United States and certain other countries, with expiration dates ranging from 2025 through 2047 and had over 550 patent applications pending. The issued patents and pending patent applications cover, among other things:\n•\nthe basic architecture of our Omnipod products, including the pump and the Controller/PDM;\n•\nthe Omnipod drive system;\n•\nthe Omnipod cannula insertion system; \n•\nsoftware, such as algorithms and apps, for controlling our current and next generation Omnipod products; and\n•\nvarious novel aspects of our current and potential future generations of Omnipod products, and other mechanisms for the delivery of pharmaceuticals.\nTrademarks\n \nWe have registered various trademarks associated with our business with the United States Patent and Trademark Office on the Principal Register and in other appropriate jurisdictions. Our trademarks include INSULET\n®\n, OMNIPOD\n®\n, SIMPLIFY LIFE\n®\n, Omnipod DASH\n®\n, Omnipod DISPLAY\n®\n, OmnipodPromise\n®\n, Omnipod VIEW\n®\n, SmartAdjust\nTM\n, PodPals\n®\n, Podder\n®\n, and PodderCentral\n®\n.\nGovernment Regulation\nUnited States FDA Regulation\nOur products are medical devices that are subject to extensive and ongoing regulation by the FDA and other federal, state, and local regulatory bodies. FDA regulations govern, among other things, product design and development, preclinical and clinical testing, pre-market clearance or approval, manufacturing, labeling, product storage, advertising and promotion, sales and distribution, post-market adverse event reporting, post-market surveillance, complaint handling, repair or recall of products, and record keeping.\nUnless an exemption applies, each medical device we seek to commercially distribute in the United States will require either prior 510(k) clearance or pre-market approval (“PMA”) from the FDA. A 510(k) pre-market notification filing must contain information establishing that the device to be sold is substantially equivalent to a device commercially distributed prior to May 28, 1976 or to a device that has been determined by the FDA to be substantially equivalent. Both the 510(k) clearance and PMA processes can be expensive and lengthy and entail significant user fees. We have obtained 510(k) clearance for Classic Omnipod, Omnipod DASH, and Omnipod 5 and expect that regulatory clearances or approvals will be needed for some of our future products. In addition, we may be required to obtain a new 510(k) clearance or pre-market approval for significant post-market modifications to our products. \n8\nTable of Contents\nClinical Trials. \nClinical trials are almost always required to support a PMA application and may also be required to support 510(k) submissions. If the device presents a “significant risk” to human health as defined by the FDA, the FDA requires the device sponsor to submit an investigational device exemption (“IDE”) and obtain IDE approval prior to commencing human clinical trials. The IDE must be supported by appropriate data, such as animal and laboratory testing results, showing that it is safe to test the device in humans and that the testing protocol is scientifically sound. Clinical trials for a significant risk device may begin once an IDE is approved by the FDA and the appropriate Institutional Review Board (“IRB”) at each clinical trial site. If the product is deemed a “non-significant risk” device, IDE approval from the FDA would not be required, but the clinical trial would need to meet other requirements including IRB approval. \nOur clinical trials must be conducted in accordance with FDA regulations and federal and state regulations concerning human subject protection, including informed consent and privacy. A clinical trial may be suspended by the FDA or at a specific site by the relevant IRB at any time for various reasons, including a belief that the risks to the trial participants outweigh the benefits of participation in the clinical trial. Even if a clinical trial is completed, the results of our clinical testing may not demonstrate the safety and efficacy of the device or may be equivocal or otherwise insufficient for us to obtain approval of our product.\nOngoing Regulation.\n After a device is placed on the market, numerous regulatory requirements apply, including:\n•\nestablishment registration and device listing;\n•\nthe FDA’s Quality System Regulation (“QSR”), which requires manufacturers, including third-party manufacturers, to follow stringent design, testing, control, documentation, and other quality assurance procedures during the development and manufacturing process;\n•\nlabeling regulations and prohibitions against the promotion of products for uncleared, unapproved or “off-label” uses, and other requirements related to promotional activities;\n•\nmedical device reporting regulations, which require that manufacturers report to the FDA if their device may have caused or contributed to a death or serious injury, or malfunctioned in a way that would likely cause or contribute to a death or serious injury if the malfunction were to recur;\n•\ncorrections and product recall reporting regulations, which require that manufacturers report to the FDA field corrections and product recalls or removals if undertaken to reduce the risk to health posed by the device or to remedy a violation of the federal Food, Drug, and Cosmetic Act that may present a risk to health. In addition, the FDA may order a mandatory recall if there is a reasonable probability that the device would cause serious adverse health consequences or death; and\n•\npost-market surveillance regulations, which apply when necessary to protect the public health or to provide additional safety and efficacy data for the device.\nFailure to comply with applicable regulatory requirements can result in enforcement actions by the FDA and other regulatory agencies, which may include any of the following sanctions: untitled letters or warning letters, fines, injunctions, consent decrees, civil or criminal penalties, recall or seizure of our current or future products, operating restrictions, partial suspension or total shutdown of production, refusal of or delay in granting 510(k) clearance or PMA of new products or modified products, rescinding previously granted 510(k) clearances or withdrawing previously granted PMAs, or refusal to grant import or export approval of our products.\nWe are subject to announced and unannounced inspections by the FDA, and these inspections may include the manufacturing facilities of our subcontractors. If, as a result of these inspections, the FDA determines that our equipment, facilities, laboratories, or processes do not comply with applicable FDA regulations and conditions of product approval, the FDA may seek civil, criminal, or administrative sanctions and/or remedies against us, including the suspension of our manufacturing operations. Since clearance of the first generation of our Omnipod product, we have been subject to FDA inspections of our facilities on multiple occasions.\nOther Regulations\nLicensure.\n In order to sell our product through the pharmacy channel in the United States, we are required to work with intermediaries who have the appropriate pharmacy license for the applicable market. We are also subject to certain state laws regarding professional licensure. We believe that our certified diabetes educators are in compliance with all such state laws. However, if our educators or we were to be found non-compliant, we may need to modify our approach to providing education, clinical support, and customer service.\n9\nTable of Contents\nFederal Anti-Kickback and Self-Referral Laws.\n The federal healthcare Anti-Kickback Statute prohibits the knowing and willful offer, payment, solicitation, or receipt of any form of remuneration (anything of value) in return for, or to induce:\n•\nthe referral of an individual;\n•\nfurnishing or arranging for the furnishing of items or services reimbursable under Medicare, Medicaid, or other federal healthcare programs; or\n•\nthe purchase, lease, or order of, or the arrangement or recommendation of the purchasing, leasing, or ordering of, any item or service reimbursable under Medicare, Medicaid, or other federal healthcare programs.\nThe federal Anti-Kickback Statute has been interpreted to apply to arrangements between drug and medical device manufacturers and suppliers on one hand and prescribers, patients, purchasers, and formulary managers on the other. Liability under the statute may be established without a person or entity having actual knowledge of the statute or specific intent to violate it. In addition, claims resulting from a violation of the federal Anti-Kickback Statute constitute false or fraudulent claims for purposes of the federal civil False Claims Act discussed below. Although there are a number of statutory exemptions and regulatory safe harbors protecting certain common business practices from prosecution and administrative sanctions, the exemptions and safe harbors are drawn narrowly, and practices that involve remuneration that may be perceived as inducing the prescription, purchase, or recommendation of Omnipod products may be subject to scrutiny under the law. For example, we may provide the initial training to users necessary for appropriate use of our product either through our own diabetes educators or by contracting with outside diabetes educators that have completed a Certified Pod Trainer course. We compensate outside diabetes educators for their services at contracted rates deemed to be consistent with the market. We have structured our arrangements with diabetes educators and other business practices to comply with statutory exemptions and regulatory safe harbors whenever possible, but our practices may be subject to scrutiny if they fail to strictly comply with the criteria in the exemption or regulatory safe harbor. Moreover, there are no safe harbors for many common practices such as providing reimbursement assistance, coding and billing information, or other customer assistance and product support programs. If any of our practices, arrangements, or programs are found to violate the federal Anti-Kickback Statute, we could be subject to significant criminal, civil, and administrative penalties, including imprisonment, fines, damages, and exclusion from Medicare, Medicaid, or other governmental programs.\nFederal law also includes a provision commonly known as the “Stark Law,” which prohibits a physician from referring Medicare or Medicaid patients to an entity for the furnishing of certain “designated health services,” in which the physician has an ownership or investment interest or with which the physician has entered into a compensation arrangement. Violation of the Stark Law could result in denial of payment, disgorgement of reimbursements received for items and services referred by a physician with a noncompliant arrangement, civil damages and penalties, and exclusion from Medicare, Medicaid, or other governmental programs. Although there are statutory and regulatory exceptions protecting certain common business practices, and we have structured our arrangements with physicians and other providers to comply with these exceptions, these arrangements may not expressly meet the requirements for applicable exceptions from the Stark Law. \nFederal Civil False Claims Act.\n The federal civil False Claims Act imposes penalties against any person or entity who, among other things, knowingly presents, or causes to be presented, a false or fraudulent claim for payment of government funds, or knowingly making, using, or causing to be made or used a false record or statement material to a false or fraudulent claim. Actions under the False Claims Act may be brought by the Attorney General or as a qui tam action by a private individual in the name of the government. Violations of the False Claims Act are subject to the imposition of significant per claim penalties, three times the amount of damages that the federal government sustained and possible exclusion from participation in federal healthcare programs like Medicare and Medicaid. We believe that we are in compliance with the federal government’s laws and regulations concerning the filing of claims for reimbursement. However, many drug and medical device manufacturers have been investigated or subject to lawsuits by whistleblowers and have reached substantial financial settlements with the federal government under the False Claims Act for a variety of alleged improper marketing activities, including providing free product to customers with the expectation that the customers would bill federal programs for the product; or causing submission of false claims by providing inaccurate coding or billing information to actual or prospective purchasers. Our business practices could be subject to scrutiny and enforcement under the federal False Claims Act. We also may be subject to other federal false claim laws, including federal criminal statutes that prohibit making a false statement to the federal government.\nCivil Monetary Penalties Law.\n We are subject to the federal Civil Monetary Penalties Law, which prohibits, among other things, the offering or transferring of remuneration to a Medicare or Medicaid beneficiary that the person knows or should know is likely to influence the beneficiary’s selection of a particular supplier of Medicare or Medicaid payable items or services. Noncompliance can result in significant civil monetary penalties for each wrongful act, assessment of three times the amount claimed for each item or service, and exclusion from the federal healthcare programs. \n10\nTable of Contents\nFederal Healthcare Fraud Statutes. \nWe are also subject to federal healthcare fraud statutes that, among other things, impose criminal and civil liability for executing a scheme to defraud any healthcare benefit program including non-governmental programs, and prohibit knowingly and willfully falsifying, concealing, or covering up a material fact or making any materially false or fraudulent statement or representation, or making or using any false writing or document with knowledge that it contains a materially false or fraudulent statement in connection with the delivery of or payment for healthcare benefits, items, or services. Violations of these statutes can result in significant civil, criminal, and administrative penalties, fines, damages, and exclusion from federal healthcare programs.\nState Fraud and Abuse Laws and Marketing Restrictions.\n Many states have adopted anti-kickback, anti-referral laws, and false claims laws and regulations analogous to the federal civil Anti-Kickback Statute and federal False Claims Act. In some cases, these state laws apply regardless of the payor, including private payors. We believe that we are in compliance with such laws. Moreover, several states have imposed requirements to disclose payments to healthcare providers, restrictions on marketing and other expenditures, and requirements to adopt a code of conduct or compliance program with specific elements. Liability under such laws could result in fines and penalties and restrictions on our ability to operate in these jurisdictions.\nAdministrative Simplification of the Health Insurance Portability and Accountability Act of 1996.\n The Health Insurance Portability and Accountability Act of 1996 (“HIPAA”) mandated the adoption of standards for the exchange of electronic health information to encourage overall administrative simplification and enhance the effectiveness and efficiency of the healthcare industry. Ensuring privacy and security of patient information is one of the key factors driving the legislation. HIPAA regulations have been amended under the Health Information Technology for Economic and Clinical Health Act of 2009. If we are found to be in violation of HIPAA, we could be subject to civil or criminal penalties.\nPrivacy Laws. \nAt least 15 states have enacted various privacy laws of general applicability over the past several years. For example,\n \nthe California Consumer Privacy Act (“CCPA”) and California Privacy Rights Act (“CPRA”) are consumer privacy laws that provide certain privacy rights and consumer protection for residents of the state of California. These consumer rights include the right to know what personal information is collected, the right to know whether the data is sold or disclosed and to whom, the right to request a company to the delete personal information collected, the right to opt-out of the sale of personal information and the right to non-discrimination in terms of price or service when a consumer exercises a privacy right. If we fail to comply with these regulations, we could be subject to civil sanctions, including fines and penalties for noncompliance. The California laws have served as a model for similar laws in other states like the Consumer Data Protection Act in Virginia and the Colorado Privacy Act. In addition, general privacy legislation has been filed in Congress in recent sessions, but the final form of the legislation and when it might be enacted is difficult to predict.\nPatient Protection and Affordable Care Act\n. The Patient Protection and Affordable Care Act as amended by the Health Care and Education Reconciliation Act of 2010 (“ACA”) enacted significant changes to the provision of and payment for healthcare in the United States. Under the ACA and related laws and regulations, federal and state government initiatives are focused on limiting the growth of healthcare costs and implementing changes to healthcare delivery structures. These reforms are intended in part to put increased emphasis on the delivery to patients of more cost-effective therapies and could adversely affect our business. Additional legislative changes, regulatory changes, and judicial challenges related to the ACA remain possible. We expect that the ACA will continue to have a significant impact on the delivery of healthcare in the United States and on our business in the near term.\nPhysician Payments Sunshine Act\n. The Physician Payments Sunshine Act, implemented as the Open Payments program, requires manufacturers of drugs and devices for which payment is available under Medicare, Medicaid, or the Children’s Health Insurance Program (with certain exceptions) to report annually to the Centers for Medicare & Medicaid Services (“CMS”) information related to direct or indirect payments and other transfers of value provided to physicians and teaching hospitals, as well as ownership and investment interests held by physician and their immediate family members. Applicable manufacturers are also required to report information regarding payments and transfers of value provided to physician assistants, nurse practitioners, clinical nurse specialists, certified nurse anesthetists and certified nurse-midwives. Failure to disclose reportable payments could subject us to penalties and materially adversely impact our business and financial results. Certain states’ laws require additional reporting of payments and transfers of value to healthcare providers.\nSince these laws and regulations continue to evolve, we lack definitive guidance as to the application of certain key aspects of these laws and regulations as they relate to certain of our arrangements and programs, including those with providers with respect to user training. We cannot predict the final form of these regulations or the effect their application will have on us. As a result, our provider and training arrangements may ultimately be found not to be in compliance with applicable laws. \nEnsuring that our business arrangements and interactions with healthcare professionals, third‑party payors, customers, and others comply with applicable healthcare laws and regulations requires substantial resources. Because of the breadth of these \n11\nTable of Contents\nlaws and the narrowness of the exceptions or safe harbors, it is possible that some of our business activities could be subject to challenge under one or more of these laws.  \nU.S. Foreign Corrupt Practices Act (\n“\nFCPA\n”\n). \nWe are subject to FCPA in the United States. and to similar anti-bribery laws in other jurisdictions, which generally prohibit companies and their intermediaries from making improper payments to foreign officials for the purpose of obtaining or retaining business. Because of the predominance of government-sponsored healthcare systems around the world, our customer relationships outside of the United States may be with governmental entities and therefore subject to such anti-bribery laws. Our policies mandate compliance with these anti-bribery laws. We operate in parts of the world that have experienced governmental corruption to some degree, and in certain circumstances strict compliance with anti-bribery laws may conflict with local customs and practices. Despite our training and compliance programs, our internal control policies and procedures may not protect us from reckless or criminal acts committed by our employees or agents.\nArtificial Intelligence (\n“\nAI\n”\n). \nGovernments around the world have begun to regulate AI, including Generative AI. The EU AI Act was enacted in August 2024, with provisions taking effect over time, through August 2026. U.S. states are also starting to legislate in this area, as are other countries. Federal regulation in the United States is in flux at this time, given the recent change in administrations. To the extent we develop or deploy AI systems in our business operations or in our products, we will be subject to AI regulations governing AI systems. We are engaged in regular reviews of development and licensing of software used in the business for compliance with relevant AI regulations. Guidance from EU regulators is starting to be published and we will continue to track developments in this area and adjust operations accordingly. \nIn addition, we are subject to numerous federal, state, foreign, and local laws relating to safe working conditions, manufacturing practices, and environmental protection. We may be required to incur significant costs to comply with these laws and regulations in the future and complying with these laws may result in a material adverse effect on our business, financial condition, and results of operations. \nIncreasingly, regulators, customers, investors, employees, and other stakeholders are focusing on environmental, social and governance  matters and related disclosures. These changing rules, regulations, and stakeholder expectations have resulted in, and are likely to continue to result in, increased general and administrative expenses and increased management time and attention spent meeting such regulations and expectations and complying with disclosure requirements. For example, collecting, measuring, and reporting environmental data is subject to evolving reporting standards, including California’s climate disclosure requirements, and similar regulations established by other international regulatory bodies, such as the Corporate Sustainability Reporting Directive in the European Union. In addition, a number of our customers who are payors or distributors have adopted, or may adopt, procurement policies that include environmental provisions that their suppliers or manufacturers must comply with. If we do not adapt to or comply with new regulations, or fail to meet evolving investor, industry, or stakeholder expectations and concerns regarding environmental issues, investors may reconsider their investment in us, and customers and suppliers may choose to limit their business with us, which could have a material adverse effect on our business, operations, or reputation.\nInternational Regulations\nInternational sales of medical devices are subject to foreign government regulations, which may vary substantially from country to country. The time required to obtain approval by a foreign country may be longer or shorter than that required for FDA clearance or approval, and the requirements may differ. There is a trend towards harmonization of quality system standards among the European Union, United States, Canada, and various other industrialized countries. \nThe primary regulatory body in Europe is that of the European Union, which includes most of the major countries in Europe. Other countries, such as Switzerland, have voluntarily adopted laws and regulations that mirror those of the European Union with respect to medical devices. The European Union has adopted numerous directives and standards regulating the design, clinical trials, manufacture, labeling, and adverse event reporting for medical devices, including the Medical Device Directive (“MDD”) and the MDR, which replaced MDD in 2021. Certain devices that comply with the requirements of the MDD can be commercially distributed until December 2027 if certain requirements are met. The method of assessing conformity with the applicable directive varies depending on the class of the product, but normally involves a combination of self-assessment by the manufacturer and a third-party assessment by a “Notified Body”. The latter is required in order for a manufacturer to commercially distribute the product throughout the European Union. This third-party assessment may consist of an audit of the manufacturer’s quality system and specific testing of the manufacturer’s product. Outside of the European Union, regulatory approval needs to be sought on a country-by-country basis for us to market our products.\nWe have obtained the right to affix the CE Mark to Omnipod 5 and Omnipod DASH under MDR, which allows us to distribute it throughout the European Union and in the United Kingdom. We have obtained the right to affix the CE Mark to Classic Omnipod under the MDD and can continue to sell Classic Omnipod through 2027 in the European Union and in other countries that recognize the CE Mark. \n12\nTable of Contents\nA range of anti-bribery and anti-corruption laws, as well as industry specific laws and codes of conduct, apply to the medical device industry and interactions with government officials and entities and healthcare professionals. These laws include the U.K. Bribery Act and similar antibribery laws in other jurisdictions in which we operate. Such laws generally prohibit U.S.-based companies and their intermediaries from making improper payments for the purpose of obtaining or retaining business to foreign officials, or in the case of the U.K. Bribery Act, to any person. In addition, the European Union Whistleblower Directive and other applicable law around the world impose specific requirements on companies regarding speak up policies and non-retaliation policies.\nGeneral Data Protection Regulation.  \nThe General Data Protection Regulation (“GDPR”) is a comprehensive update to the data protection regime in the European Economic Area that imposes requirements relating to, among other things, consent to process personal data of individuals, the information provided to individuals regarding the processing of their personal data, the security and confidentiality of personal data, notifications in the event of data breaches, and use of third-party processors. If we fail to comply with these standards, we could be subject to criminal penalties and civil sanctions, including fines and penalties for noncompliance.\nThe European Union has laid out a multi-year plan for additional privacy and data regulation, building upon the GDPR, and has begun to execute on that plan. For example, the Cybersecurity Directive and the Artificial Intelligence Act have been finalized and will impose additional obligations on businesses generally, including those in the medical device industry.\nHuman Capital Resources\nEmployees\nOur people are our most valuable asset and are the source of our innovation and our success. We strive to attract and retain the best talent with competitive compensation and benefits, opportunities for growth and development, and a culture that emphasizes fair and equitable treatment. As of December 31, 2024, we had approximately 3,900 full-time employees, representing a 29% increase over the prior year. Approximately 70% of our employees are located in the United States and the remainder are located in 15 other countries. \nIn 2024, we defined and shared our Ways of Working, the key behaviors that we believe are most important to our success and to creating an exceptional employee experience. Additionally, in 2024, we launched our Insulet for Good program, which enables employees globally to engage in volunteerism and corporate philanthropy in ways aligned with our corporate strategic priorities. \nTo assess employee retention and engagement and identify potential opportunities for improvement, we conduct periodic ‘Your Voice’ employee pulse surveys and take timely action to address key areas of employee concern. Our executive leadership team also conducts regular Town Hall meetings to ensure our global employees are highly engaged and receive timely business updates. To help our remote employees feel socially connected to their colleagues, we created our “Stay Connected” initiative, which includes virtual meetings with our executive team members. These virtual meetings are designed as casual conversations with our executives so employees can talk about what is on their minds, get to know the executive leaders, and connect with colleagues from across the organization. We also publish a monthly global employee newsletter, which includes a timely collection of high-level developments and local highlights from across our organization and utilize a social networking tool to ensure our global employees are engaged, motivated, and collaborating with one another. \nOur success thrives on the diversity of perspective, thought, experience, and background within our workforce. We are committed to creating a global culture that reflects the diversity of the customers we serve and creates an environment where all employees feel welcomed, respected, and valued. Accordingly, we are committed to providing equal opportunity in all aspects of our Company culture and workplace. \nOur voluntary employee-led Employee Resource Groups (“ERGs”) are a thriving part of Insulet’s community, driving inclusion across the following categories: African Descent, Asian and Pacific Islander, Hispanic/Latin, LGBTQ+, Sustainability, Veterans and First Responders, Women, Young Professionals, Jewish Heritage, and our newly created People with Diabetes. These ERGs support the attraction, engagement, development, and retention of our people.\nTraining and Development\nOur people are core to our success and the achievement of our business strategy. We are therefore committed to fostering an environment in which our employees continuously learn and develop the skills and capabilities needed for their success by offering both leadership and professional skills development programs. All employees who join Insulet undergo a robust onboarding program called RITE Start that introduces our core values and educates new employees about diabetes, Omnipod products, our business strategy, Insulet's culture and Ways of Working, and our mission, which is to improve the lives of people with diabetes and enable them to enjoy simplicity, freedom, and healthier lives through innovative technology. All employees participate in our flagship ‘Ignite Your Growth’ career development program and as a result, establish an Individual \n13\nTable of Contents\nDevelopment Plan, which is reviewed and updated regularly with their manager. We also offer LinkedIn Learning to all employees, providing access to virtual and online learning programs on demand to enable them to continuously build their skills and capabilities to support our current and future business needs. Additionally, we offer professional certification course reimbursement of up to $3,000 annually and tuition reimbursement of up to $5,250 annually for courses taken in pursuit of an undergraduate degree and up to $10,000 annually for courses taken in pursuit of a graduate degree. Further, managers participate in our ‘Ignite Your Leadership’ development program to support the growth and development of our future leaders and build their capabilities. We also offer new manager assimilation and team effectiveness programs and quick tip resources for our experienced leaders. In addition, we offer intensive Customer Care and Sales New Hire Training. \nCompetitive Pay and Benefits\nOur compensation program is designed to align employee compensation with our performance and to provide the proper incentives to attract, retain, and motivate employees to achieve superior results. The structure of our compensation program balances incentive earnings for both short-term and long-term performance. Specifically,\n•\nWe provide employee wages that are competitive and consistent with employee positions, skill levels, experience, knowledge, and geographic location.\n•\nWe engage internationally recognized outside compensation and benefits consulting firms to independently evaluate the effectiveness of our executive compensation and benefit programs and to provide benchmarking.\n•\nWe align our executives’ long-term equity compensation with our shareholders’ interests.\n•\nAnnual increases and incentive compensation are based on our performance as well as each individual’s contribution to the results achieved and are documented through our talent management process as part of our annual review process.\nWe are committed to providing comprehensive benefit options that allow our employees and their families to live healthier and more secure lives. Our wide-ranging benefits include health insurance, telehealth, prescription drug benefits, dental insurance, vision insurance, paid time off, sick time, bereavement leave, life insurance, disability insurance, accident insurance, critical illness insurance, hospital indemnity insurance, health savings accounts, flexible savings accounts, retirement plans, employee stock purchase plan, legal services, identity theft protection, paid parental and postpartum recovery leave, tuition and professional certification course reimbursement, business travel accident insurance, pet insurance and employee assistance program. In addition, we offer Pod perks, which provides a free Omnipod 5 or Omnipod DASH product, including Controller/PDM and Pods to benefit eligible employees or dependents. We also offer summer hours and flexible work arrangements, including the opportunity to work remotely, which allows us to access a broader, more diverse, and more exceptional talent pool.\nHealth and Safety\nWe maintain an occupational health and safety management system that covers all our employees, contractors, and temporary employees because we are committed to the safety and well-being of our workforce. By minimizing risks at our factories and implementing training to enhance awareness of hazards, we are able to promote safe practices and preserve the health of our employees.\nModern manufacturing enables efficiency and automation, which reduces exposure to health and safety risks throughout the production process. At our facilities, the majority of our equipment is fully automated to minimize human involvement in the operations of machines and therefore reduce the risk of injury. We maintain high standards for workplace safety, and our orientation for technicians includes training about safe procedures, such as lockout/tagout. \nWe have a Health and Safety Compliance Manual to provide employees with the tools needed to identify and report hazards and reduce work-related injuries. Our programs and policies are in compliance with applicable local, regional, and federal laws, including U.S. Occupational Safety and Health Administration requirements. We continuously monitor and adapt to regional regulations as we expand our facilities into new geographies. In addition to hazard recognition, our workplace health and safety programs cover ergonomics, hearing conservation, fall protection, and accident and injury prevention. \nWe also have formal plans in place to protect our employees' safety in the event of an emergency. In addition, our facilities maintain Emergency Action/Preparedness Plans that describe procedures that employees should follow when faced with a variety of unexpected health and safety events. As part of this initiative, we have trained certain employees to use automated external defibrillators, provide first aid, and perform cardiopulmonary resuscitation (CPR) in the event someone is injured or becomes ill while at work. We also have internal emergency response teams, comprised of people who are trained to respond to emergencies such as a fire, natural disaster, chemical spill, and/or workplace accident. Further, we maintain an emergency evacuation map for each location in our plants and conduct mock drills to familiarize staff with our emergency routes, emergency exits, and assembly points. Additionally, we have a text emergency system for our employee base located in our \n14\nTable of Contents\nActon headquarters and Acton manufacturing facility, which advises employees on building closures and emergencies with clear instructions. We also conduct periodic health and safety audits of our facilities to monitor the effectiveness of our programs and drive continuous improvement in our overall safety performance as Insulet expands in size and impact. \nCompany Information\nInsulet Corporation is a Delaware corporation formed in 2000. Our principal office is located at 100 Nagog Park, Acton, Massachusetts, 01720 and our website address is\n \nhttp://www.insulet.com\n. We make available free of charge on our website our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements and amendments to those reports as soon as reasonably practicable after we electronically file or furnish such materials to the U.S. Securities and Exchange Commission (“SEC”). We have also posted the charters for our Audit Committee, Talent and Compensation Committee and Nominating, Governance and Risk Committee, as well as our Code of Business Conduct and Ethics, under the heading “Corporate Governance” in the Investors section of our website. The information on our website is not incorporated in this report by reference. In addition, the SEC maintains a website (\nhttp//www.sec.gov\n) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the accompanying notes included in this annual report. The following discussion may contain forward-looking statements that reflect our plans, estimates, and beliefs, which are subject to risks, uncertainties, and assumptions. Our actual results could differ materially from those discussed in these forward-looking statements. Factors that could cause or contribute to these differences include those discussed under the headings “Risk Factors” and “Forward-Looking Statements.”\nOverview\nOur mission is to improve the lives of people with diabetes. We are primarily engaged in the development, manufacture, and sale of our proprietary Omnipod product platform, a continuous insulin delivery system for people with insulin-dependent diabetes. The Omnipod platform includes: the most recent generation Omnipod 5, and its predecessors Omnipod DASH and Classic Omnipod, all of which eliminate the need for multiple daily injections using syringes or insulin pens or the use of pump and tubing. Omnipod 5, which builds on our Omnipod DASH mobile platform, is a tubeless automated insulin delivery system that integrates with a CGM to manage blood sugar and is fully controlled by a compatible personal smartphone or Omnipod 5 Controller. The CGM is sold separately by third parties. Omnipod DASH features a secure Bluetooth enabled Pod that is controlled by a smartphone-like PDM with color touch screen user interface. We have been phasing-out Classic Omnipod as we launch Omnipod 5.\nOur financial objective is to sustain profitable growth. To achieve this, we launched Omnipod 5 in the United States in 2022 and in the United Kingdom and Germany in June and August 2023, respectively. In June 2024, we launched our full market releases of Omnipod 5 in the Netherlands and France, and most recently, in January 2025, we announced that Omnipod 5 is now available in Italy, Denmark, Finland, Norway, and Sweden. Additionally, we are working on further building our international teams and advancing our regulatory, reimbursement, and market development efforts so we can bring Omnipod 5 to additional international markets. \nIn August 2024, we received FDA clearance for an expanded indication of Omnipod 5 for people with type 2 diabetes. Due to the positive results of our Omnipod 5 type 2 pivotal trial and the learnings from our Omnipod GO commercial pilot, we made a strategic decision to drive growth in the type 2 diabetes market with Omnipod 5 and, accordingly, decided not to move forward with the commercialization of Omnipod GO.\nDuring 2024, we completed participant enrollment in our RADIANT study in France, the United Kingdom, and Belgium, which is our Omnipod 5 with Libre 2 randomized controlled trial. Similar to the randomized control trial that we completed in the United States and France for Omnipod 5 with DexCom’s G6 CGM, the objective is to provide data to support our pricing and market access initiatives as we roll out Omnipod 5 with multiple sensors across our international markets. We also continue to expand market access and awareness of Omnipod products through our direct to consumer advertising programs and through growing our presence in the U.S. pharmacy channel, where access to Omnipod 5 and Omnipod DASH is simpler and affordable, as no up-front investment is required. \nWe also continue to focus on our product development efforts, including AID offerings, such as choice of smartphone integration and CGM, and enhancing the customer experience through digital product and data capabilities. Omnipod 5 integration with Dexcom’s G6 CGM is available in every country where Omnipod 5 is available. In June 2024, we began our full market release of Omnipod 5 with Dexcom’s G7 CGM in the United States. Similarly, in June 2024 we launched our full market release of Omnipod 5 with Libre 2 Plus for individuals aged two years and older with type 1 diabetes in both the United Kingdom and Netherlands, where we offer sensor of choice (integration with either Abbott’s Libre 2 Plus or Dexcom’s G6 CGM). We also now offer sensor of choice in the United States, Italy, Denmark, Finland, Norway, and Sweden. Additionally, in October 2024, our Omnipod 5 app for iPhone compatible with Dexcom’s G6 CGM became fully available in the United States. \nFinally, we continue to take steps to strengthen our global manufacturing capabilities. In 2024, we began producing product at our newly constructed manufacturing plant in Malaysia. This plant provides us with increased capacity to satisfy our growing demand, supports our international expansion strategy, and is expected to drive higher gross margins over time.\nResults of Operations\nThe discussion of our results of operations for 2022 has been omitted from this Form 10-K but can be found in Item 7. Management’s Discussion and Analysis and Results of Operations in our Form 10-K for the fiscal year ended December 31, 2023 filed with the Securities and Exchange Commission on February 22, 2024.\n32\nTable of Contents\nFactors Affecting Operating Results\nOur Pods are intended to be used continuously for up to three days, after which it may be replaced with a new disposable Pod. We recently achieved a milestone of 500,000 estimated active global customers using Omnipod products, including 365,000 global customers using Omnipod 5. The unique patented design of the Omnipod allows us to provide Pod therapy at a relatively low or no up-front investment in regions where reimbursement allows for it and our pay-as-you-go pricing model reduces the risk to third-party payors. As we grow our customer base, we expect to generate an increasing portion of our revenues through recurring sales of our disposable Pods, which provide recurring revenue. \nFollowing our strategic decision to not move forward with the commercialization of Omnipod GO discussed above, we recorded a charge of $13.5 million related to certain inventory components that we no longer expect to utilize, which is included in our consolidated statement of income for 2024. \nIn 2022, we issued two voluntary Medical Device Correction (“MDC”) notices, one for our Omnipod DASH PDM related to its battery and the other for our Omnipod 5 Controller related to its charging port and cable. During 2022, we initially recorded a net charge of $57.9 million related to these MDCs and, in 2023, we recorded $11.5 million of income associated with a change in our estimated liability for the MDCs, primarily due to lower distribution costs.\nComparison of the Years Ended December 31, 2024 and December 31, 2023 \nRevenue\nYears Ended December 31,\n(in millions)\n2024\n2023\n% Change\nCurrency Impact\nConstant Currency\n(1)\nU.S.\n$\n1,509.3 \n$\n1,251.0 \n20.6 \n%\n— \n%\n20.6 \n%\nInternational\n523.4 \n410.1 \n27.6 \n%\n0.7 \n%\n26.9 \n%\nTotal Omnipod Products\n2,032.7 \n1,661.1 \n22.4 \n%\n0.2 \n%\n22.2 \n%\nDrug Delivery\n38.9 \n36.0 \n8.1 \n%\n— \n%\n8.1 \n%\nTotal\n$\n2,071.6 \n$\n1,697.1 \n22.1 \n%\n0.2 \n%\n21.9 \n%\n(1) \nConstant currency revenue growth is a non-GAAP financial measure which should be considered supplemental to, and not a substitute for, our reported financial results prepared in accordance with GAAP. See “Management’s Use of Non-GAAP Measures.”\nTotal revenue increased $374.5 million, or 22.1%, to $2,071.6 million in 2024, compared with $1,697.1 million in 2023. Constant currency revenue growth of 21.9% was primarily driven by higher volume largely attributable to our growing customer base and, to a lesser extent, higher price. \nU.S.\nRevenue from the sale of Omnipod products in the U.S. increased $258.3 million, or 20.6%, in 2024 to $1,509.3 million, compared with $1,251.0 million in 2023. This increase primarily \nresulted from\n higher volume through the pharmacy channel driven by growing our customer base, partially offset by a decrease in estimated inventory days-on-hand at distributors and lower conversions to Omnipod 5. Inventory days-on-hand declined to more normal levels following an acceleration of orders by U.S. pharmacy wholesales in advance of the implementation of our new ERP system on January 1, 2024. We experienced a benefit from conversions to Omnipod 5 in the prior year following the launch of the product in the latter half of 2022 since users generally fill both their Omnipod 5 starter kit and their first month of refills simultaneously. Conversions to Omnipod 5 declined since the vast majority of U.S. conversions to Omnipod 5 occurred in 2023. To a lesser extent, the revenue increase was driven by a higher average selling price resulting from our annual wholesale acquisition cost increase implemented during the second quarter of 2024 and growth in the pharmacy channel.\nRevenue from the sale of Omnipod products in the U.S. includes $587.8 million of related party revenue in 2024, compared with $473.7 million in 2023. The $114.1 million increase primarily resulted from growth through the pharmacy channel. Additional information regarding our related party transactions is provided in Note 5 to our consolidated financial statements. \nIn 2025, we expect strong U.S. revenue growth primarily driven by the benefits of our recurring revenue model and continued volume growth of Omnipod 5. Our recent type 2 indication for Omnipod 5, the launch of Omnipod 5 integrations with both Dexcom’s G7 CGM and Libre 2 Plus, and the launch our Omnipod 5 app for iPhone, are expected to contribute to an increase in our customer base.\nInternational\nRevenue from the sale of Omnipod products in our international markets increased $113.3 million, or 27.6%, in 2024 to $523.4 million, compared with $410.1 million in 2023. Excluding the 0.7% favorable impact of currency exchange, the remaining 26.9% increase in revenue \nwas \nprimarily due to higher volumes from the launches of Omnipod 5 in the United Kingdom and Germany in the prior year, driven by our growing customer base and the favorable impact of conversions to \n33\nTable of Contents\nOmnipod 5. A higher average selling price for Omnipod 5 compared with Omnipod DASH and Classic Omnipod also contributed to the revenue increase, although to a lesser extent.\nIn 2025, we expect higher International Omnipod revenue due to continued volume growth driven by new customers and conversions to Omnipod 5 primarily due to the launch of Omnipod 5 in France and the Netherlands, growth from the earlier launches in Germany and the United Kingdom, and the continued roll out of Omnipod 5 in additional markets.\nDrug Delivery\nSubstantially all of our Drug Delivery revenue consists of sales of pods to Amgen for use in the Neulasta\n®\n Onpro\n®\n kit, a delivery system for Amgen’s Neulasta to help reduce the risk of infection after intense chemotherapy. Drug Delivery revenue increased $2.9 million, or 8.1%, to $38.9 million in 2024, compared with $36.0 million in 2023. This increase \nprimarily resulted from an increase in orders from our partner, partially offset by a reimbursement from our partner to cover a portion of our increased production costs in the prior year, which did not repeat in the current year. \nCosts and Expenses\nYears Ended December 31,\n2024\n2023\n(in millions)\nAmount\nPercent of Revenue\nAmount\nPercent of Revenue\nCost of revenue\n$\n625.9 \n30.2 \n%\n$\n537.2 \n31.7 \n%\nResearch and development expenses\n$\n219.6 \n10.6 \n%\n$\n205.0 \n12.1 \n%\nSelling, general and administrative expenses\n$\n917.2 \n44.3 \n%\n$\n734.9 \n43.3 \n%\nCost of Revenue\nCost of revenue for 2024 increased $88.7 million, or 16.5%, to $625.9 million, compared with $537.2 million in 2023. Gross margin was 69.8% in 2024, compared with 68.3% in 2023. The 1.5 point increase in gross margin was primarily driven \nby pricing benefits in both the U.S. pharmacy channel and in our international markets, improved manufacturing efficiencies, and procurement savings. These increases were partially offset by a \n$13.5 million\n charge related to certain components utilized in Omnipod GO, which we decided not to commercialize, an \n$11.5 million \naccrual reversal during the prior year associated with the voluntary MDC notices we issued in 2022, which did not recur in the current year, and higher costs due to inflation. \nWe expect gross margin to further increase to approximately 70.5% in 2025 primarily due to improved manufacturing efficiencies.\nResearch and Development\nResearch and development expenses increased $14.6 million, or 7.1%, to $219.6 million for 2024, compared with $205.0 million for 2023. Research and development expenses as a percent of revenue decreased to 10.6% in 2024, compared with 12.1% in 2023 primarily due to an increase in sustaining costs following the launch of Omnipod 5 in the United States, which are included in selling, general and administrative expenses. We expect research and development spending in 2025 to increase compared with 2024 as we continue to invest in advancing our innovation and clinical pipeline.\nSelling, General and Administrative\nSelling, general and administrative expenses increased $182.3 million, or 24.8%, to $917.2 million in 2024, compared with $734.9 million in 2023. This increase was primarily attributable to year-over-year headcount additions to support our growth, international expansion and sustain Omnipod 5, and as a result of our new organizational structure. To a lesser extent, the increase was due to higher legal fees to defend our intellectual property and support our business growth; an increase in advertising expense; higher costs associated with the continued commercial rollout of Omnipod 5 in international markets; and increases in travel and expenses resulting from headcount additions.\nWe expect selling, general and administrative expenses to increase in 2025 compared with 2024 due to investments in our operating structure, primarily headcount additions, particularly in the areas of customer support, sales and information technology support, to facilitate continued growth globally. We also plan to make additional investments to support the Omnipod platform and to continue support the phased launch of Omnipod 5 in our existing international markets and prepare for expansion into new countries.\nNon-Operating Items\nInterest Expense and Income\nInterest expense increased $6.5 million to $42.7 million in 2024, compared with $36.2 million in 2023 primarily due to fees paid to amend our Term Loan. Interest income increased $10.9 million to $39.5 million in 2024, compared with $28.6 million in 2023 primarily driven by increased average cash balances and higher interest rates.\n34\nTable of Contents\nOther (Expense) Income, net\nOther expense, net of $5.5 million for 2024 consists primarily of $3.8 million of loss related to fair value adjustments associated with a strategic debt investment.\n \nOther income, net of $2.2 million for 2023 consists primarily of\n \n$2.6 million of gains related to fair value adjustments associated with our strategic debt and equity investments.\nIncome Tax Expense\nIncome tax benefit was $118.1 million on pre-tax income of $300.2 million for 2024, compared with income tax expense of $8.3 million on pre-tax income of $214.6 million for 2023. Our effective tax rate was a benefit of 39.3% for 2024, compared with a provision of 3.9% for 2023. The decrease in our effective tax rate was primarily due to a $182.5 million non-cash tax benefit from the release of the majority of our valuation allowance against deferred tax assets discussed in Note 22 to our consolidated financial statements and a $8.3 million tax benefit from a research and development tax credit recovery project for the years 2017 through 2022. These tax benefits were partially offset by a $8.2 million decrease in tax benefits from employee stock-based compensation. \nIn 2021, the Organization for Economic Co-operation and Development (“OECD”) and G20 international forum released the Model Global Anti-Base Erosion (GloBE) rules (“Model Rules”) under Pillar Two. These Model Rules set forth the common approach for a Global Minimum Tax at 15% for multinational enterprises with revenue greater than €750 million and is expected to be applicable to Insulet. Pillar Two has been adopted by the Council of the European Union for implementation by European Union member states by December 31, 2023, with effect for tax years beginning 2024. Similar directives under Pillar Two are already adopted or expected to be adopted by taxing authorities in other countries where Insulet has business operations, with widespread implementation of the Global Minimum Tax in 2024 and 2025. There was no impact on the consolidated financial statements for 2024. While we do not expect the Pillar Two Model Rules and related legislation to have a material impact on our consolidated financial statements for 2025, we continue to evaluate their potential impact on future years.\nAdjusted EBITDA\nThe table below presents reconciliations of Adjusted EBITDA, a non-GAAP financial measure, to net income, the most directly comparable financial measure prepared in accordance with accounting principles generally accepted in the United States of America (“GAAP”):\nYears Ended December 31,\n(in millions)\n2024\n2023\nNet income\n$\n418.3 \n$\n206.3 \nInterest expense, net\n3.2 \n7.6 \nIncome tax expense\n(118.1)\n8.3 \nDepreciation and amortization\n80.8 \n72.8 \nStock-based compensation expense\n69.3 \n48.3 \nVoluntary medical device corrections\n(1)\n— \n(11.5)\nUnrealized loss (gain) on investments\n(2)\n3.8 \n(2.6)\nAdjusted EBITDA\n$\n457.3 \n$\n329.2 \n(1)  \nRepresents net (income) expense resulting from estimated costs associated with the voluntary MDC notices issued in the fourth quarter of 2022 and adjustments to those costs, which is included in cost of revenue. Refer to Note 13 to our consolidated financial statements for additional information.\n(2)\n Represents non-operating gain or loss related to fair value adjustments of strategic debt and other investments.\nNon-GAAP Financial Measures\nManagement uses the non-GAAP financial measures described below.\nConstant currency revenue growth represents the change in revenue between current and prior year periods using the exchange rate in effect during the applicable prior year period. We present constant currency revenue growth because we believe it provides meaningful information regarding our results on a consistent and comparable basis. Management uses this non-GAAP financial measure, in addition to financial measures in accordance with GAAP, to evaluate our operating results. It is also one of the performance metrics that determines management incentive compensation.\nAdjusted EBITDA represents net income plus net interest expense, income tax expense (benefit), depreciation and amortization, stock-based compensation expense and other significant transactions or events, such as legal settlements, medical device corrections, gains (losses) on investments, and loss on extinguishment of debt, which affect the period-to-period comparability of our performances, as applicable. We present Adjusted EBITDA because management uses it as a supplemental measure in assessing our performance, and we believe that it is helpful to investors and other interested parties as a measure of our \n35\nTable of Contents\ncomparative performance from period to period. Adjusted EBITDA is a commonly used measure in determining business value and we use it internally to report results. \nFree cash flow, a non-GAAP measure, represents the cash that we have available to pursue opportunities that we believe enhance shareholder value and is calculated as net cash provided by operating activities less capital expenditures. Management uses this non-GAAP measure, in addition to U.S. GAAP financial measures, to evaluate our operating results. \nThese non-GAAP financial measures should be considered supplemental to, and not a substitute for, our reported financial results prepared in accordance with GAAP. In addition, the above definitions may differ from similarly titled measures used by others. Non-GAAP financial measures exclude the effect of items that increase or decrease our reported results of operations; accordingly, we strongly encourage investors to review our consolidated financial statements in their entirety.\nLiquidity and Capital Resources\nWe believe that our current liquidity as further described below will be sufficient to meet our projected operating, investing and debt service requirements for at least the next twelve months.\nCapitalization\nThe following table contains several key measures to gauge our financial condition and liquidity at the end of each year:\nAs of December 31,\n(in millions)\n2024\n2023\nCash and cash equivalents\n$\n953.4 \n$\n704.2 \nCurrent portion of long-term debt\n$\n83.8 \n$\n49.4 \nLong-term debt, net\n$\n1,296.1 \n$\n1,366.4 \nTotal debt, net\n$\n1,379.9 \n$\n1,415.8 \nTotal stockholders’ equity\n$\n1,211.6 \n$\n732.7 \nDebt-to-total capital ratio\n53 \n%\n66 \n%\nNet debt-to-total capital ratio\n16 \n%\n33 \n%\nConvertible Debt\nTo finance our operations and global expansion, we have periodically issued convertible senior notes, which are convertible into our common stock. As of December 31, 2024, the following Convertible Senior Notes were outstanding:\nIssuance Date\nCoupon\nPrincipal Outstanding   \n(in millions)\nDue Date\nConversion Rate\n(1)\nConversion Price \nper Share of Common Stock\nSeptember 2019\n0.375%\n$\n800.0 \nSeptember 2026\n4.4105\n$226.73\n(1)\n Per $1,000 face value of notes.\nIn connection with the issuance of the Convertible Senior Notes, we purchased capped call options (“Capped Calls”) on our common stock. By entering into the Capped Calls, we expect to reduce the potential dilution to our common stock (or, in the event the conversion is settled in cash, to provide a source of cash to settle a portion of our cash payment obligation) if at the time of conversion our stock price exceeds the conversion price under the Convertible Senior Notes. The Capped Calls have an initial strike price of $335.90 per share and cover 3.5 million shares of our common stock. \nCredit Agreement\nWe have a $300 million senior secured revolving credit facility (the “Revolving Credit Facility”), which expires in 2028. At December 31, 2024, no amount was outstanding under the Revolving Credit Facility. The Revolving Credit Facility contains a covenant to maintain a specified leverage ratio when there are amounts of at least 35% of the aggregate Revolving Credit Facility outstanding. It also contains other customary covenants, none of which we consider restrictive to our operations. Additionally, we have a Term Loan B (“Term Loan”), which matures in 2031, which contains covenants restricting or limiting our ability to incur additional indebtedness, make asset dispositions, create or permit liens, sell, transfer or exchange assets, guarantee certain indebtedness, and make acquisitions and other investments. \nAdditional information regarding our debt is provided in Notes 15 to the consolidated financial statements. \n36\nTable of Contents\nSummary of Cash Flows\nYears Ended December 31,\n(in millions)\n2024\n2023\nCash provided by (used in):\nOperating activities\n$\n430.3 \n$\n145.7 \nInvesting activities\n(146.2)\n(119.4)\nFinancing activities\n(28.1)\n(13.6)\nEffect of exchange rate changes on cash and cash equivalents\n(6.8)\n1.8 \nNet increase in cash, cash equivalents, and restricted cash\n$\n249.2 \n$\n14.5 \nOperating Activities\nNet cash provided by operating activities of $430.3 million in 2024 was primarily attributable to net income, as adjusted for deferred income taxes, depreciation and amortization, stock-based compensation expense, and a $17.0 million working capital  outflow. The working capital outflow was driven by a $32.4 million increase in inventories, a $21.9 million increase in prepaid expenses and other assets, and a $10.4 million increase in accounts receivable, partially offset by a $45.5 million increase in accrued expenses and other liabilities. The increase in inventories was primarily due to a planned inventory build to satisfy our growing demand and, to a lesser extent, to mitigate supply chain risk. The increase in prepaid expenses and other assets was primarily driven by an increase in prepaid software fees, cloud computing upgrade and implementation costs, prepaid income taxes, and capitalized commissions. The increase in accounts receivable was primarily due to an increase in sales driven by our growing customer base. Finally, the increase in accrued expenses and other liabilities was primarily driven by an increase in compensation costs due to headcount additions and an increase in professional consulting fees primarily driven by higher legal costs and direct-to-consumer spending.\nInvesting Activities\nNet cash used in investing activities was $146.2 million in 2024, compared with $119.4 million in 2023.\nCapital Spending\n—Capital expenditures were $124.9 million and $75.6 million in 2024 and 2023, respectively. The $49.3 million increase primarily related to the purchase of machinery, equipment and tooling to increase our manufacturing capacity for our new Malaysia manufacturing facility and continuous improvements at our other owned manufacturing facility. We expect capital expenditures for 2025 to increase compared with 2024 as we continue to expand and optimize our manufacturing and supply chain operations as well as support our global expansion. We expect to fund our capital expenditures using existing cash.\nInvestments in Developed Software—\nInvestments in developed software were $9.1 million and $8.5 million in 2024 and 2023, respectively, and primarily related to investments in projects to support our cloud-based capabilities.\nInvestments\n—In 2024 and 2023, we made strategic investments in private companies in the amount of $12.2 million and $7.2 million, respectively.\nAcquisitions\n—In 2023, we paid Bigfoot Biomedical, Inc. $25.1 million, including transaction costs, to acquire patent assets related to pump-based AID technologies. We also paid a purchase price holdback of $3.0 million associated with our 2022 acquisition of substantially all the assets related to the manufacture and production of shape-memory alloy wire assemblies used in the production of our product from Dynalloy, Inc. \nFinancing Activities\nNet cash used in financing activities was $28.1 million in 2024, compared with $13.6 million in 2023.\nDebt Issuance and Repayments\n—In 2024, we refinanced our Term Loan, which resulted in net cash proceeds of $130.0 million, net of issuance costs, and the simultaneous repayment of $132.2 million of the Term Loan. Refer to Note 15 for more information regarding this refinancing. Additionally, we made $26.4 million and $27.0 million of aggregate principal payments on our equipment financings, Term Loan, and mortgage in 2024 and 2023, respectively.\nFinance Lease Payments\n—During 2024, we made $22.7 million in finance lease repayments associated with our Malaysia manufacturing facility, including the amount associated with exercising our option to purchase the property.\nProceeds and Repayments from Secured Borrowing\n—During 2024, we received $45.5 million of cash advances from a third-party to whom we outsource our insurance claim submissions process in a certain country. Additionally, we repaid $34.8 million of cash advances during 2024.\n37\nTable of Contents\nProceeds from Exercise of Stock Options\n—Proceeds from option exercises were $8.2 million and $16.3 million in 2024 and 2023, respectively. The $8.1 million decrease was primarily driven by option exercises by former executives in the prior year.\nProceeds from Shares Issued Under Employee Stock Purchase Plan (“ESPP”)\n—Proceeds from the issuance of shares under the ESPP were $11.9 million and $10.6 million in 2024 and 2023, respectively. \nPayment of Taxes for Restricted Stock Net Settlements\n—Payments for taxes related to net restricted and performance stock unit settlements were $7.6 million and $13.2 million in 2024 and 2023, respectively. The $5.6 million decrease was primarily driven by a lower fair market value of the restricted and performance stock units (“PSUs”) that vested in 2024 compared to the prior year, partially offset by higher achievement of the PSUs that vested in 2024 (111% achievement), compared to in the prior year (84% achievement).\nFree Cash Flow\nFree cash flow was $305.4 million in 2024, compared with $70.1 million in 2023. The $235.3 million increase in free cash flow primarily resulted from the $285.8 million increase in gross profit, partially offset by the $49.3 million increase in capital expenditures. \nFree cash flow is a non-GAAP measure, which should be considered supplemental to and not a substitute for our reported financial results prepared in accordance with U.S. GAAP. See \n“Non-GAAP Financial Measures\n.” A reconciliation between net cash provided by operating activities (the most comparable U.S. GAAP measure) and free cash flow is as follows:\nYears Ended December 31,\n(in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n430.3 \n$\n145.7 \nCapital expenditures\n(124.9)\n(75.6)\nFree cash flow\n$\n305.4 \n$\n70.1 \nCommitments and Contingencies \nContractual Obligations\n—The following table summarizes our contractual obligations as of December 31, 2024:\n(in millions)\nShort Term\nLong Term\nTotal\nDebt obligations\n$\n83.8 \n$\n1,309.2 \n$\n1,393.0 \nInterest payments\n(1)(2)\n46.9 \n211.3 \n258.2 \nPurchase obligations\n(3) \n282.4 \n49.2 \n331.6 \nLease obligations\n(1) \n5.4 \n62.2 \n67.6 \nTotal contractual obligations\n$\n418.5 \n$\n1,631.9 \n$\n2,050.4 \n(1)\nInterest on debt and lease obligations are projected for future periods using the interest rates in effect as of December 31, 2024. Certain of these projected interest payments may differ in the future based on changes in market interest rates. Additional information regarding our leases is provided in Note 14 to the consolidated financial statements.\n(2)\nExcludes the impact of the interest rate swaps discussed in Note 17 to our consolidated financial statements.\n(3)\nPurchase obligations include commitments for the purchase of components for our products, commitments related to establishing additional manufacturing capabilities, and other commitments for purchases of goods or services in the normal course of business. These commitments are derived from purchase orders, supplier contracts and open orders based on projected demand information. \nLegal Proceedings\n—\nIn December 2024, a jury found that EOFlow Co., Ltd. (“EOFlow”) and several other defendants misappropriated certain of our trade secrets and awarded us $452 million in damages. EOFlow subsequently moved for a directed verdict and for a new trial, as well as for a reduction of the jury award, and we moved for a permanent worldwide injunction on the sale of EOFlow’s EOPatch 2 product and any other products that embody our trade secrets. EOFlow and other defendants may seek to appeal the verdict. Further, EOFlow may not be able to satisfy this damage award; accordingly, it has not been recorded in our consolidated statement of income. Refer to Note 18 to our consolidated financial statements for additional information regarding this matter.\nOff-Balance Sheet Arrangements\nInformation regarding our letters of credit is provided in Note 18 to the consolidated financial statements.\n38\nTable of Contents\nCritical Accounting Policies and Estimates\nThe preparation of our consolidated financial statements in conformity with U.S. GAAP requires management to use judgment in making estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosure of contingent assets and liabilities. The following accounting policies are based on, among other things, judgments and assumptions made by management that include inherent risks and uncertainties. Management’s estimates are based on the relevant information available at the end of each period.\nPharmacy Rebates\nWe exercise significant judgment when we determine variable consideration adjustments. As discussed in Note 2 to our consolidated financial statements, we are subject to rebates on pricing programs with managed care organizations, such as pharmacy benefit managers, governmental and third-party commercial payors, primarily in the United States. Reductions to our revenues for rebates on products sold through our distributors under pharmacy benefits are the most significant component of variable consideration. In addition, pharmacy rebates are most at risk for significant adjustment because of the time delay between the recording of the provision when revenue is recognized and its ultimate settlement, an interval that generally ranges from 30 to 90 days, but can last up to one year. Our estimates for pharmacy rebates are based on historical experience, revenue growth, distribution channel lag, contract amendments and trends. Pharmacy rebates charged against gross sales amounted to $452.7 million, $367.3 million, and $175.2 million in 2024, 2023, and 2022, respectively. When actual pharmacy rebate settlements differ from our estimates, we adjust our estimates, which affects reported revenue in the period that such variances become known. \nIncome Taxes\nWe estimate our income taxes based on the various jurisdictions where we conduct business. Significant judgment is required in determining our income tax provision. The calculation of our tax liabilities involves uncertainties in the application of complex tax laws and regulations and the potential for future adjustments by tax authorities. While we believe we have appropriate support for the positions taken on our tax returns, we regularly assess the potential outcomes of examinations in determining the adequacy of our provision for income taxes and adjust the income tax provision, income taxes payable, and deferred taxes in the period in which the facts that give rise to a revision become known.\nSignificant judgement is required in determining whether it is probable that sufficient future taxable income will be available against which a deferred tax asset can be utilized. In evaluating our ability to recover our deferred tax assets, we consider all available positive and negative evidence, including cumulative income in recent fiscal years, our forecast of future taxable income exclusive of certain reversing temporary differences and significant risks and uncertainties related to our business. In determining future taxable income, we are responsible for assumptions utilized including the amount of state, federal and international pre-tax operating income, the reversal of certain temporary differences and the implementation of feasible and prudent tax planning strategies. These assumptions require significant judgment about the forecasts of future taxable income in applicable tax jurisdictions, which are based on our commercial experience to date and are consistent with the plans and estimates that we are using to manage our underlying business.\nDuring 2024, we determined that it is more likely than not that we will realize substantially all of our net deferred tax assets after weighing positive and negative evidence to assess recoverability, including cumulative income (loss) position, revenue growth, current profitability, and expectations regarding future forecasted income. Accordingly, in 2024, we recorded a tax benefit of $182.5 million from the release of our valuation allowance. As of December 31, 2024, we have a valuation allowance of $23.9 million on certain U.S. state tax credits and state net operating loss carryforwards because it is more likely than not that those deferred tax assets will not be realized. \nSignificant judgment is also required to evaluate uncertain tax positions and is based on a number of factors, including changes in facts or circumstances, changes in tax laws, correspondence with tax authorities during the course of audits and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in a material increase or decrease in our income tax expense in the period in which we make the change, which could have a material impact on our effective rate and results of operations. \n Accounting Standards Issued and Not Yet Adopted as of December 31, 2024\nIn December 2023, the Financial Accounting Standards Board (“FASB”) issued Accounting Standards Update (“ASU”) 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n, which requires incremental annual income tax disclosures. The new guidance standardizes categories for the effective tax rate reconciliation and requires disaggregation of income taxes and additional income tax-related disclosures. We are required to comply with these new disclosure requirements beginning with our annual filing for 2025. \nIn November 2024, the FASB issued ASU 2024-03, \nIncome Statement—Reporting Comprehensive Income—Expenses Disaggregation Disclosures\n (Subtopic 220-40). The new guidance requires disaggregated disclosure of expenses included in \n39\nTable of Contents\ncertain expense captions presented in the statements of incomes as well as additional disclosures about selling expenses. We are required to comply with these new disclosure requirements beginning with our annual filing for 2027. \nIn November 2024, the FASB issued ASU 2024-04, \nDebt—Debt with Conversion and Other Options (Subtopic 470-20)\n, which clarifies the requirements for determining whether certain settlements of convertible debt instruments should be accounted for as an induced conversion. We are required to comply with the updates beginning with our interim and annual filings for 2026. The adoption of ASU 2024-04 is not expected to impact our consolidated financial statements.\nForward-Looking Statements\nThis Form 10-K contains forward-looking statements relating to future events or future financial performance that are based on management’s current expectations, estimates, and projections. Words such as “may,” “will,” “should,” “expects,” “plans,” “anticipates,” “could,” “intends,” “targets,” “projects,” “contemplates,” “believes,” “estimates,” “predicts,” “potential” or “continue” or the negative of these terms or other similar words or expressions are intended to identify these forward-looking statements. Forward-looking statements are only predictions and involve risks, uncertainties, and assumptions. Certain factors, including but not limited to those identified under “Item 1A. Risk Factors” of this Form 10-K, may cause actual results to differ materially from current expectations, estimates, projections, and forecasts, and from past results. You should not place undue reliance on any forward-looking statements. We expressly disclaim any obligation to update these forward-looking statements other than as required by law.",
  "item2": null
}