{
  "source_file": "pool-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of F\ninancial Condition and Results of Operations\nYou should read the following discussion in conjunction with the accompanying interim Consolidated Financial Statements and notes, the Consolidated Financial Statements and accompanying notes in our 2024 Annual Report on Form 10-K and Management’s Discussion and Analysis in our 2024 Annual Report on Form 10-K.\n \nForward-Looking Statements\nThis report contains forward-looking information that involves risks and uncertainties.  Our forward-looking statements express our current expectations or forecasts of possible future results or events, including projections of earnings and other financial performance measures, statements of management’s expectations regarding our strategic, operational and capital allocation plans and objectives, management’s views on industry, economic, competitive, technological and regulatory conditions and other forecasts of trends and other matters.  Forward-looking statements speak only as of the date of this filing, and we undertake no obligation to publicly update or revise such statements to reflect new circumstances or unanticipated events as they occur.  You can identify these statements by the fact that they do not relate strictly to historic or current facts and often use words such as “anticipate,” “estimate,” “expect,” “intend,” “believe,” “will,” “outlook,” “project,” “may,” “can,” “plan,” “target,” “potential,” “should” and other words and expressions of similar meaning.\nNo assurance can be given that the expected results in any forward-looking statement will be achieved, and actual results may differ materially due to one or more factors, including the sensitivity of our business to weather conditions; changes in economic conditions, consumer discretionary spending, the housing market, inflation or interest rates; our ability to maintain favorable relationships with suppliers and manufacturers; competition from other leisure product alternatives or mass merchants; our ability to continue to execute our growth strategies; changes in the regulatory environment; new or additional taxes, duties or tariffs; excess tax benefits or deficiencies recognized under ASU 2016-09 and other risks detailed in our 2024 Annual Report on Form 10-K, as updated by our subsequent filings with the U.S. Securities and Exchange Commission.  For these statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995.\nOVERVIEW\nFinancial Results\nThird quarter ended September 30, 2025 compared to the third quarter\n \nended September 30, 2024\nNet sales increased 1% in the third quarter of 2025.  We continued to support sustained customer demand for maintenance products and were pleased to see continuous improvement in sales for our building materials products.\nGross profit grew by $12.8 million and gross margin increased 50 basis points to 29.6% compared to 29.1% in the same period of 2024.  Gross margin benefited from mid-season price increases, continued progress on our pricing optimization initiatives and our continued focus on supply chain management.\nSelling and administrative expenses (operating expenses) increased 5% compared to the third quarter of 2024, reflecting higher employee-related and facility costs due to sales center network expansion and inflationary pressures, as well as ongoing investments in our customer-facing technology initiatives.\nOperating income increased $1.6 million compared to the third quarter of 2024.  Operating margin was 12.3% in both the third quarter of 2025 and the third quarter of 2024.\nNet income increased to $127.0 million compared to $125.7 million in the third quarter of 2024.\n \nEarnings per diluted share increased 4% to $3.40 in the third quarter of 2025 compared to $3.27 in the same period of 2024.  We recorded a $0.3 million, or $0.01 per diluted share, tax benefit from Accounting Standards Update (ASU) 2016-09, \nImprovements to Employee Share-Based Payment Accounting\n, in the third quarter of 2025 compared to a tax benefit of $0.5 million, or $0.01 per diluted share, realized in the same period of 2024.  Adjusting for the impact from ASU 2016-09 in both periods, earnings per diluted share increased 4% to $3.39 compared to $3.26 in the third quarter of  2024.\n \nSee RESULTS OF OPERATIONS below for definitions of our non-GAAP measures and reconciliations of our non-GAAP measures to GAAP measures.\nReferences to product line and product category data throughout this report generally reflect data related to the North American swimming pool market, as this data is more readily available for analysis and represents the largest component of our operations.\n\n\n15\n\n\n\n\n \n\n\nIn this Form 10-Q and other of our public disclosures, we estimate the impact that favorable or unfavorable weather had on our operating results.  In connection with these estimates, we make several assumptions and rely on various third-party sources.  It is possible that others assessing the same data could reach conclusions that differ from ours.\nFinancial Position and Liquidity\nAs of September 30, 2025, total net receivables, including pledged receivables, increased 4% compared to September 30, 2024, primarily due to higher sales in September 2025.  Our days sales outstanding (DSO), as calculated on a trailing four quarters basis, was 25.9 days at September 30, 2025 and 26.7 days at September 30, 2024.  Our allowance for doubtful accounts balance was $8.3 million at September 30, 2025 and $10.0 million at September 30, 2024.\n \nOur inventory balance was $1.2 billion at September 30, 2025, an increase of $43.3 million, or 4%, from September 30, 2024, reflecting increases from inflation (including mid-season vendor price increases), new and acquired sales centers and strategic inventory purchases. \n \nOur inventory reserve was $29.0 million at September 30, 2025 and $28.6 million at September 30, 2024.  Our inventory turns, as calculated on a trailing four quarters basis, were 2.8 times at both September 30, 2025 and September 30, 2024.\n \nTotal debt outstanding increased $138.2 million to $1.1 billion at September 30, 2025, primarily to fund open market share repurchases of $159.1 million in the first nine months of 2025.\nFor additional information, see “Liquidity and Capital Resources” below.\n \nCurrent Trends and Outlook\n \nFor a detailed discussion of trends impacting us through 2024, see the Current Trends and Outlook section of Management’s Discussion and Analysis included in Part II, Item 7 of our 2024 Annual Report on Form 10-K.\n \nWe expect sales for the full year of 2025 to be relatively flat compared to 2024.  We primarily source our products domestically and expect that U.S. tariffs announced so far in 2025 and their resulting price increases will positively impact net sales by approximately 1%, contributing to an estimated benefit of 2% from price for the full year of 2025.\n \nWe expect gross margin for the full year of 2025 to be in line with our 2024 gross margin of 29.7%.  Our efforts in pricing optimization and supply chain initiatives are expected to mitigate headwinds from less favorable product and customer mix that are currently pressuring our ability to attain our long-term gross margin target of 30.0%.\nWe expect to leverage our existing infrastructure and strategically manage discretionary spending while continuing to invest in our sales center network and consumer-facing technology initiatives.  We project that our operating expenses for 2025 will increase around 3% compared to 2024.\n \nIn 2025, we expect our effective tax rate will be around 25.0% without the impact of ASU 2016-09.  Due to ASU 2016-09, we expect our effective tax rate will fluctuate from quarter to quarter, particularly in periods when employees elect to exercise their vested stock options or when restrictions on share-based awards lapse.  We recorded a $4.2 million, or $0.11 per diluted share, tax benefit from ASU 2016-09 for the nine months ended September 30, 2025.  We may recognize additional tax benefits related to stock option exercises during the fourth quarter of 2025.  We have not included any expected tax benefits in our full year guidance beyond what we have recognized as of September 30, 2025.\n \nWe expect 2025 diluted EPS in the range of $10.81 to $11.31, including the impact of year-to-date tax benefits of $0.11.  We expect to continue to use cash for the payment of cash dividends as and when declared by our Board of Directors (Board) and to fund opportunistic share repurchases under our Board-authorized share repurchase program.\nThe forward-looking statements in the foregoing section and elsewhere in this report are based on current market conditions and our current business plans, speak only as of the filing date of this report, are based on several assumptions and are subject to significant risks and uncertainties, including the risks detailed in Part I, Item 1A of our Annual Report on Form 10-K for the year ended December 31, 2024.  See “Cautionary Statement for Forward-Looking Statements.”\n\n\n16\n\n\n\n\n \n\n\nRESULTS OF OPERATIONS\nAs of September 30, 2025, we conducted operations through 454 sales centers in North America, Europe and Australia.  For the nine months ended September 30, 2025, approximately 95% of our net sales were from our operations in North America.\nThe following table presents information derived from the Consolidated Statements of Income expressed as a percentage of net sales:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n \n\n\n \n\n\n100.0\n\n\n%\n\n\n\n\n\n\nCost of sales\n\n\n \n\n\n \n\n\n70.4\n\n\n \n\n\n \n\n\n \n\n\n70.9\n\n\n \n\n\n \n\n\n \n\n\n70.4\n\n\n \n\n\n \n\n\n \n\n\n70.3\n\n\n \n\n\n\n\n\n\nGross profit\n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n \n\n\n \n\n\n29.1\n\n\n \n\n\n \n\n\n \n\n\n29.6\n\n\n \n\n\n \n\n\n \n\n\n29.7\n\n\n \n\n\n\n\n\n\nSelling and administrative expenses\n\n\n \n\n\n \n\n\n17.3\n\n\n \n\n\n \n\n\n \n\n\n16.8\n\n\n \n\n\n \n\n\n \n\n\n17.4\n\n\n \n\n\n \n\n\n \n\n\n16.9\n\n\n \n\n\n\n\n\n\nOperating income\n\n\n \n\n\n \n\n\n12.3\n\n\n \n\n\n \n\n\n \n\n\n12.3\n\n\n \n\n\n \n\n\n \n\n\n12.3\n\n\n \n\n\n \n\n\n \n\n\n12.9\n\n\n \n\n\n\n\n\n\nInterest and other non-operating expenses, net\n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n0.9\n\n\n \n\n\n\n\n\n\nIncome before income taxes and equity in earnings\n\n\n \n\n\n \n\n\n11.4\n\n\n%\n\n\n \n\n\n \n\n\n11.4\n\n\n%\n\n\n \n\n\n \n\n\n11.4\n\n\n%\n\n\n \n\n\n \n\n\n12.0\n\n\n%\n\n\n\n\n \nNote: Due to rounding, percentages presented in the table above may not add to Operating income or Income before income taxes and equity in earnings.\nWe have included the results of operations from acquisitions in 2025 and 2024 in our consolidated results since the acquisition dates.\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\n \nBase Business\nWhen calculating our base business results, we exclude for a period of 15 months sales centers that are acquired, opened in new markets or closed.  We also exclude consolidated sales centers when we do not expect to maintain the majority of the existing business and existing sales centers that we consolidate with acquired sales centers.\n \nWe generally allocate corporate overhead expenses to excluded sales centers on the basis of their net sales as a percentage of total net sales.  After 15 months, we include acquired, consolidated and new market sales centers in the base business calculation including the comparative prior year period.\nWe have not provided separate base business income statements within this Form 10-Q as our base business results for the three and nine-month periods ended September 30, 2025\n \nclosely\n \napproximated consolidated results for the same period.  Acquired and new market sales centers excluded from base business contributed less than 1% to the change in our reported net sales.\n \nThe table below summarizes the changes in our sales center count during the first nine months of 2025:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n448\n\n\n \n\n\n\n\n\n\nAcquired locations\n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\nNew locations\n\n\n \n\n\n6\n\n\n \n\n\n\n\n\n\nClosed/Consolidated locations\n\n\n \n\n\n(2\n\n\n)\n\n\n\n\n\n\nSeptember 30, 2025\n\n\n \n\n\n454\n\n\n \n\n\n\n\n \n\n\n17\n\n\n\n\n \n\n\nNet Sales\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n1,451.1\n\n\n \n\n\n \n\n\n$\n\n\n1,432.9\n\n\n \n\n\n \n\n\n$\n\n\n18.2\n\n\n \n\n\n \n\n\n1%\n\n\n\n\n \nNet sales of $1.5 billion in the third quarter of 2025 increased 1% compared to $1.4 billion in the third quarter of 2024.  Recurring maintenance product sales were stable, and we saw growth in sales of building materials products.\nThe following factors impacted our sales during the quarter and are listed in order of estimated magnitude:\n•\nsteady maintenance product sales; \n•\nimproved demand for building materials products (see discussion below); and\n•\na benefit of 2% from inflationary product cost increases, net of price deflation on some items, compared to a 1% benefit in the third quarter of 2024.\n \nIn the third quarter of 2025, sales of equipment for maintenance, renovation and new construction activities, including swimming pool heaters, pumps, lights, filters and automation devices, increased 4% versus the same period last year, and collectively represented approximately 29% of net sales for the period.  The increase in sales of equipment reflects benefits from price and some increase from volumes sold of maintenance-related products.  Sales of building materials, which are primarily used in new pool construction and remodeling, increased 4% compared to the same period in 2024 and represented approximately 11% of net sales in the third quarter of 2025.\nGross Profit\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nGross profit\n\n\n \n\n\n$\n\n\n429.2\n\n\n \n\n\n \n\n\n$\n\n\n416.4\n\n\n \n\n\n \n\n\n$\n\n\n12.8\n\n\n \n\n\n \n\n\n3%\n\n\n\n\n\n\nGross margin\n\n\n \n\n\n \n\n\n29.6\n\n\n%\n\n\n \n\n\n \n\n\n29.1\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nGross margin improved by 50 basis points to 29.6% in the third quarter of 2025 compared to 29.1% in the third quarter of 2024, while gross profit increased 3% over the same period.  The expansion of our gross margin was driven by mid-season price increases, ongoing pricing optimization efforts and disciplined supply chain management, amid continued headwinds from customer mix.\n \nOperating Expenses\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nSelling and administrative expenses\n\n\n \n\n\n$\n\n\n251.2\n\n\n \n\n\n \n\n\n$\n\n\n240.1\n\n\n \n\n\n \n\n\n$\n\n\n11.1\n\n\n \n\n\n \n\n\n5%\n\n\n\n\n\n\nOperating expenses as a % of net sales\n\n\n \n\n\n \n\n\n17.3\n\n\n%\n\n\n \n\n\n \n\n\n16.8\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nSelling and administrative expenses in the third quarter of 2025 increased 5% compared to the third quarter of 2024, primarily driven by higher employee-related and facility costs due to sales center network expansion and inflationary pressures, as well as ongoing investments in our customer-facing technology initiatives.  These increases were partially offset by reductions in variable costs.\n \n\n\n18\n\n\n\n\n \n\n\nInterest and Other Non-Operating Expenses, Net\nInterest and other non-operating expenses, net for the third quarter of 2025 decreased $0.4 million compared to the third quarter of 2024.  Our weighted average effective interest rate decreased to 4.5% in the third quarter of 2025 compared to 5.2% in the third quarter of 2024 on average outstanding debt of $1.1 billion and $946.1 million for the respective periods.\nIncome Taxes\nOur effective income tax rate was 23.5% for the three months ended September 30, 2025 compared to 23.4% for the three months ended September 30, 2024.  We recorded a $0.3 million, or $0.01 per diluted share, tax benefit from ASU 2016-09 in the quarter ended September 30, 2025 compared to a benefit of $0.5 million, or $0.01 per diluted share, in the same period last year.   Without the benefit from ASU 2016-09 in both periods, our effective tax rate was 23.7% in both the third quarter of 2025 and the third quarter of 2024.  Our third quarter effective income tax rate is historically lower compared to other quarters due to the annual expiration of statutes of limitations in the various jurisdictions where we have recorded uncertain tax positions.\n \nNet Income and Earnings Per Share\nNet income increased to $127.0 million in the third quarter of 2025 compared to $125.7 million in the third quarter of 2024.  Earnings per diluted share increased 4% to $3.40 in the third quarter of 2025 compared to $3.27 in the same period of 2024.  Adjusting for the impact from ASU 2016-09 in both periods, earnings per diluted share increased 4% to $3.39 compared to $3.26 in the third quarter of 2024.\nSee the reconciliation of GAAP to non-GAAP measures below.\n \n\n\n19\n\n\n\n\n \n\n\nNine Months Ended September 30, 2025 Compared to Nine Months Ended September 30, 2024\n \nNet Sales\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n4,307.2\n\n\n \n\n\n \n\n\n$\n\n\n4,323.5\n\n\n \n\n\n \n\n\n$\n\n\n(16.3\n\n\n)\n\n\n \n\n\n(0)%\n\n\n\n\n \nNet sales for the first nine months of 2025 remained consistent with net sales for the same period last year.  Despite ongoing macroeconomic constraints in the first nine months of 2025, non-discretionary spending remained steady, while discretionary activities improved sequentially.  In the first quarter of the year, discretionary projects remained pressured from macroeconomic conditions and unfavorable weather.  In the second quarter of 2025, we saw sales expansion compared to the second quarter of 2024 and discretionary activities were less of a drag on overall sales.  Net sales also increased in the third quarter of 2025 from the third quarter of 2024, supported by price, sustained demand for maintenance products and growth in sales of building materials products from the same period of the prior year.\nThe following factors impacted our sales in the first nine months of 2025 and are listed in order of estimated magnitude:\n•\nstable maintenance product sales;\n•\nlower sales volume of products used in pool construction and discretionary activities (see discussion below); and \n•\na benefit of approximately 2% from inflationary product cost increases, net of price deflation on some items, compared to a 1% benefit in the first nine months of 2024.\n \nIn the first nine months of 2025, sales of equipment for maintenance, renovation and new construction activities, including swimming pool heaters, pumps, lights, filters and automation devices, increased approximately 1% compared to the same period last year and collectively represented 30% of net sales in the first nine months of 2025.  The increase in sales of equipment reflects benefits from price and some increase from volumes sold of maintenance-related products.  Sales of building materials, which are primarily used in new pool construction and remodeling, decreased 1% compared to the first nine months of 2024 and represented approximately 12% of net sales in the first nine months of 2025.\nGross Profit\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nGross profit\n\n\n \n\n\n$\n\n\n1,276.7\n\n\n \n\n\n \n\n\n$\n\n\n1,285.1\n\n\n \n\n\n \n\n\n$\n\n\n(8.4\n\n\n)\n\n\n \n\n\n(1)%\n\n\n\n\n\n\nGross margin\n\n\n \n\n\n \n\n\n29.6\n\n\n%\n\n\n \n\n\n \n\n\n29.7\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nGross margin declined 10 basis points to 29.6% in the nine months ended September 30, 2025 compared to 29.7% in the first nine months of 2024.  Gross margin in the first nine months of 2024 benefited 30 basis points from the non-recurring reversal of $12.6 million for estimated import taxes.  In the first nine months of 2025, our gross margin reflected positive impacts from our strategic pricing and supply chain initiatives, partially offset by a less advantageous customer and product mix and the absence of the non-recurring import tax reversal recognized in the prior year.\n \nOperating Expenses\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n(in millions)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n\n\n\n\nSelling and administrative expenses\n\n\n \n\n\n$\n\n\n748.5\n\n\n \n\n\n \n\n\n$\n\n\n728.6\n\n\n \n\n\n \n\n\n$\n\n\n19.9\n\n\n \n\n\n \n\n\n3%\n\n\n\n\n\n\nOperating expenses as a % of net sales\n\n\n \n\n\n \n\n\n17.4\n\n\n%\n\n\n \n\n\n \n\n\n16.9\n\n\n%\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nOperating expenses for the nine months ended September 30, 2025 were up 3% compared to the prior year period.  Expense growth was primarily driven by inflationary impacts, particularly on base wages and facility costs, and continued investments in our technology initiatives and sales center network expansion.\n \n\n\n20\n\n\n\n\n \n\n\nInterest and Other Non-Operating Expenses, Net\nInterest and other non-operating expenses, net for the first nine months of 2025 decreased $4.4 million compared to the same period last year.  Our weighted average effective interest rate decreased to 4.5% from 5.2% for the respective periods on average outstanding debt of $1.0 billion for both the nine months ended September 30, 2025 and nine months ended September 30, 2024.\nIncome Taxes\nOur effective income tax rate was 24.0% for the nine months ended September 30, 2025 compared to 23.2% for the nine months ended September 30, 2024.  We recorded a $4.2 million, or $0.11 per diluted share, tax benefit from ASU 2016-09 in the nine months ended September 30, 2025 compared to an $8.3 million, or $0.21 per diluted share, tax benefit in the same period of 2024.  Without the benefits from ASU 2016-09, our effective tax rate was 24.8% for both the nine months ended September 30, 2025 and the nine months ended September 30, 2024.\nNet Income and Earnings Per Share\nNet income decreased 6% to $374.8 million for the nine months ended September 30, 2025 compared to $397.0 million for the nine months ended September 30, 2024.  Earnings per diluted share decreased 3% to $9.97 for the nine months ended September 30, 2025 versus $10.30 per diluted share for the nine months ended September 30, 2024.  Adjusting for the impact from ASU 2016-09 in both periods, earnings per diluted share decreased 2% to $9.86 for the nine months ended September 30, 2025 compared to $10.09 for the nine months ended September 30, 2024.  See the reconciliation of GAAP to non-GAAP measures below.\nReconciliation of Non-GAAP Financial Measures\nThe non-GAAP measure described below should be considered in the context of all of our other disclosures in this Form 10-Q.\n \nAdjusted Diluted EPS\nWe have included adjusted diluted EPS, a non-GAAP financial measure, as a supplemental disclosure, because we believe this measure is useful to management, investors and others in assessing our period-to-period operating performance.\n \nAdjusted diluted EPS is a key measure used by management to demonstrate the impact of tax benefits from ASU 2016-09 on our diluted EPS and to provide investors and others with additional information about our potential future operating performance to supplement GAAP measures.\n \nWe believe this measure should be considered in addition to, not as a substitute for, diluted EPS presented in accordance with GAAP, and in the context of our other disclosures in this Form 10-Q.  Other companies may calculate this non-GAAP financial measure differently than we do, which may limit its usefulness as a comparative measure.\n \nThe table below presents a reconciliation of diluted EPS to adjusted diluted EPS.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(Unaudited)\n\n\n \n\n\nThree Months Ended\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nDiluted EPS\n\n\n \n\n\n$\n\n\n3.40\n\n\n \n\n\n \n\n\n$\n\n\n3.27\n\n\n \n\n\n \n\n\n$\n\n\n9.97\n\n\n \n\n\n \n\n\n$\n\n\n10.30\n\n\n \n\n\n\n\n\n\nASU 2016-09 tax benefit\n\n\n \n\n\n \n\n\n(0.01\n\n\n)\n\n\n \n\n\n \n\n\n(0.01\n\n\n)\n\n\n \n\n\n \n\n\n(0.11\n\n\n)\n\n\n \n\n\n \n\n\n(0.21\n\n\n)\n\n\n\n\n\n\nAdjusted diluted EPS\n\n\n \n\n\n$\n\n\n3.39\n\n\n \n\n\n \n\n\n$\n\n\n3.26\n\n\n \n\n\n \n\n\n$\n\n\n9.86\n\n\n \n\n\n \n\n\n$\n\n\n10.09\n\n\n \n\n\n\n\n \n\n\n21\n\n\n\n\n \n\n\nSeasonality and Quarterly Fluctuations\nOur business is seasonal.  In general, sales and operating income are highest during the second and third quarters, which represent the peak months of both swimming pool use and installation and irrigation and landscape installations and maintenance.  Sales are lower during the first and fourth quarters.  In 2024, we generated approximately 60% of our net sales and 73% of our operating income in the second and third quarters of the year.\nWe typically experience a build-up of product inventories and accounts payable during the winter months in anticipation of the peak selling season.  Excluding borrowings to finance acquisitions and share repurchases, our peak borrowing usually occurs during the second quarter, primarily because extended payment terms offered by our suppliers typically are payable in April, May and June, while our peak accounts receivable collections typically occur in June, July and August.\nThe following table presents certain unaudited quarterly income statement and balance sheet data for the most recent eight quarters to illustrate seasonal fluctuations in these amounts.  We believe this information reflects all normal and recurring adjustments considered necessary for a fair presentation of this data.  The results of any one or more quarters are not necessarily a good indication of results for an entire fiscal year or of continuing future trends for a variety of reasons, including the seasonal nature of our business and the impact of new and acquired sales centers.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(Unaudited)\n\n\n \n\n\nQUARTER\n\n\n \n\n\n\n\n\n\n(in thousands)\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThird\n\n\n \n\n\n \n\n\nSecond\n\n\n \n\n\n \n\n\nFirst\n\n\n \n\n\n \n\n\nFourth\n\n\n \n\n\n \n\n\nThird\n\n\n \n\n\n \n\n\nSecond\n\n\n \n\n\n \n\n\nFirst\n\n\n \n\n\n \n\n\nFourth\n\n\n \n\n\n\n\n\n\nStatement of Income Data\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet sales\n\n\n \n\n\n$\n\n\n1,451,131\n\n\n \n\n\n \n\n\n$\n\n\n1,784,530\n\n\n \n\n\n \n\n\n$\n\n\n1,071,526\n\n\n \n\n\n \n\n\n$\n\n\n987,480\n\n\n \n\n\n \n\n\n$\n\n\n1,432,879\n\n\n \n\n\n \n\n\n$\n\n\n1,769,784\n\n\n \n\n\n \n\n\n$\n\n\n1,120,810\n\n\n \n\n\n \n\n\n$\n\n\n1,003,050\n\n\n \n\n\n\n\n\n\nGross profit\n\n\n \n\n\n \n\n\n429,183\n\n\n \n\n\n \n\n\n \n\n\n535,161\n\n\n \n\n\n \n\n\n \n\n\n312,369\n\n\n \n\n\n \n\n\n \n\n\n290,244\n\n\n \n\n\n \n\n\n \n\n\n416,403\n\n\n \n\n\n \n\n\n \n\n\n530,141\n\n\n \n\n\n \n\n\n \n\n\n338,560\n\n\n \n\n\n \n\n\n \n\n\n293,775\n\n\n \n\n\n\n\n\n\nOperating income\n\n\n \n\n\n \n\n\n177,987\n\n\n \n\n\n \n\n\n \n\n\n272,670\n\n\n \n\n\n \n\n\n \n\n\n77,538\n\n\n \n\n\n \n\n\n \n\n\n60,651\n\n\n \n\n\n \n\n\n \n\n\n176,353\n\n\n \n\n\n \n\n\n \n\n\n271,481\n\n\n \n\n\n \n\n\n \n\n\n108,720\n\n\n \n\n\n \n\n\n \n\n\n79,344\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n127,013\n\n\n \n\n\n \n\n\n \n\n\n194,258\n\n\n \n\n\n \n\n\n \n\n\n53,545\n\n\n \n\n\n \n\n\n \n\n\n37,300\n\n\n \n\n\n \n\n\n \n\n\n125,701\n\n\n \n\n\n \n\n\n \n\n\n192,439\n\n\n \n\n\n \n\n\n \n\n\n78,885\n\n\n \n\n\n \n\n\n \n\n\n51,437\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBalance Sheet Data\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal receivables, net\n\n\n \n\n\n$\n\n\n443,609\n\n\n \n\n\n \n\n\n$\n\n\n576,804\n\n\n \n\n\n \n\n\n$\n\n\n497,076\n\n\n \n\n\n \n\n\n$\n\n\n314,861\n\n\n \n\n\n \n\n\n$\n\n\n425,693\n\n\n \n\n\n \n\n\n$\n\n\n577,529\n\n\n \n\n\n \n\n\n$\n\n\n527,175\n\n\n \n\n\n \n\n\n$\n\n\n342,910\n\n\n \n\n\n\n\n\n\nProduct inventories, net\n\n\n \n\n\n \n\n\n1,223,809\n\n\n \n\n\n \n\n\n \n\n\n1,330,221\n\n\n \n\n\n \n\n\n \n\n\n1,460,680\n\n\n \n\n\n \n\n\n \n\n\n1,289,300\n\n\n \n\n\n \n\n\n \n\n\n1,180,491\n\n\n \n\n\n \n\n\n \n\n\n1,295,600\n\n\n \n\n\n \n\n\n \n\n\n1,496,947\n\n\n \n\n\n \n\n\n \n\n\n1,365,466\n\n\n \n\n\n\n\n\n\nAccounts payable\n\n\n \n\n\n \n\n\n457,319\n\n\n \n\n\n \n\n\n \n\n\n529,316\n\n\n \n\n\n \n\n\n \n\n\n890,167\n\n\n \n\n\n \n\n\n \n\n\n525,235\n\n\n \n\n\n \n\n\n \n\n\n401,702\n\n\n \n\n\n \n\n\n \n\n\n515,645\n\n\n \n\n\n \n\n\n \n\n\n907,806\n\n\n \n\n\n \n\n\n \n\n\n508,672\n\n\n \n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n \n\n\n1,062,002\n\n\n \n\n\n \n\n\n \n\n\n1,229,919\n\n\n \n\n\n \n\n\n \n\n\n1,025,090\n\n\n \n\n\n \n\n\n \n\n\n950,356\n\n\n \n\n\n \n\n\n \n\n\n923,829\n\n\n \n\n\n \n\n\n \n\n\n1,116,553\n\n\n \n\n\n \n\n\n \n\n\n979,177\n\n\n \n\n\n \n\n\n \n\n\n1,053,320\n\n\n \n\n\n\n\n \nWe expect that our quarterly results of operations will continue to fluctuate depending on the timing and amount of revenue contributed by new and acquired sales centers.  Based on our peak summer selling season, we generally open new sales centers and close or consolidate sales centers, when warranted, either in the first quarter before the peak selling season begins or in the fourth quarter after the peak selling season ends.\n\n\n22\n\n\n\n\n \n\n\nWeather is one of the principal external factors affecting our business.  The table below presents some of the possible effects resulting from various weather conditions.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWeather\n\n\n \n\n\nPossible Effects\n\n\n\n\n\n\nHot and dry\n\n\n•\n\n\nIncreased purchases of chemicals and supplies\n\n\n\n\n\n\n \n\n\n \n\n\nfor existing swimming pools\n\n\n\n\n\n\n \n\n\n•\n\n\nIncreased purchases of above-ground pools and\n\n\n\n\n\n\n \n\n\n \n\n\nirrigation and lawn care products\n\n\n\n\n\n\nUnseasonably cool weather or extraordinary amounts\n\n\n•\n\n\nFewer pool and irrigation and landscape\n\n\n\n\n\n\nof rain\n\n\n \n\n\ninstallations\n\n\n\n\n\n\n \n\n\n•\n\n\nDecreased purchases of chemicals and supplies\n\n\n\n\n\n\n \n\n\n•\n\n\nDecreased purchases of impulse items such as\n\n\n\n\n\n\n \n\n\n \n\n\nabove-ground pools and accessories\n\n\n\n\n\n\nUnseasonably early warming trends in spring/late cooling\n\n\n•\n\n\nA longer pool and landscape season, thus positively\n\n\n\n\n\n\ntrends in fall\n\n\n \n\n\nimpacting our sales\n\n\n\n\n\n\n(primarily in the northern half of the U.S. and Canada)\n\n\n \n\n\n \n\n\n\n\n\n\nUnseasonably late warming trends in spring/early cooling\n\n\n•\n\n\nA shorter pool and landscape season, thus negatively\n\n\n\n\n\n\ntrends in fall\n\n\n \n\n\nimpacting our sales\n\n\n\n\n\n\n(primarily in the northern half of the U.S. and Canada)\n\n\n \n\n\n \n\n\n\n\nWeather Impacts on 2025 and 2024 Results\n \nTemperatures in the third quarter of 2025 were above average in several regions, including the Northwest, Midwest, South and Western regions.  Localized flooding occurred early in the quarter, followed by drought conditions across the Central and Western regions.  In the third quarter of 2024, temperatures were slightly warmer than the third quarter of 2025, and there were more variable weather conditions in the third quarter of 2024 with several notable weather events.  Overall, weather conditions did not significantly impact our sales results for the third quarter of 2025.\nWeather conditions in the second quarter of 2025 were generally marked by above-average temperatures and higher-than-normal precipitation.  Warm conditions generally supported seasonal trends, though localized disruptions occurred due to severe storms, flash flooding and tornado outbreaks, particularly in April and May.  Around mid-June, we observed intense heat across many regions, further supporting demand in key markets.  Overall, while weather patterns were variable, we believe that the net impact on our results was broadly neutral.  In the second quarter of 2024, weather across the U.S. was mixed, with wetter conditions in the central regions and Texas, drier conditions in the West, and warmer-than-average temperatures, especially in June, supporting maintenance activities and leading to varied impacts across our markets.\nWeather conditions in the first quarter of 2025 were mixed across our key markets.  Early January snowstorms and overall cooler temperatures through much of February negatively impacted early season sales activity.  While March brought warmer and drier weather, these improvements provided only partial relief to our sales trends and were insufficient to offset the slower start to the quarter.  During the first quarter of 2024, above-average temperatures in some regions, including California, contributed positively to economic activities.  However, the adverse effects of cooler and wetter weather in Florida and the Southeast, and excessive precipitation in Texas and the Northeast, outweighed the positives, resulting in an overall unfavorable impact on net sales.\n \n\n\n23\n\n\n\n\n \n\n\n \nCRITICAL ACCOUNTING ESTIMATES\nWe prepare our Consolidated Financial Statements in accordance with U.S. generally accepted accounting principles (GAAP), which require management to make estimates and assumptions that affect reported amounts and related disclosures.  Management identifies critical accounting estimates as:\n•\nthose that require the use of assumptions about matters that are inherently and highly uncertain at the time the estimates are made; and\n•\nthose for which changes in the estimates or assumptions, or the use of different estimates and assumptions, could have a material impact on our consolidated results of operations or financial condition.\nManagement has discussed the development, selection and disclosure of our critical accounting estimates with the Audit Committee of our Board.  For a description of our critical accounting estimates that require us to make the most difficult, subjective or complex judgments, please see our 2024 Annual Report on Form 10-K.  We have not changed any of these policies from those previously disclosed in that report.\nRecent Accounting Pronouncements\nSee Note 1 of “Notes to Consolidated Financial Statements,” included in Part I, Item 1 of this Form 10-Q for discussion of recent accounting pronouncements.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity is defined as the ability to generate adequate amounts of cash to meet short-term and long-term cash needs.  We assess our liquidity in terms of our ability to generate cash to fund our operating activities, taking into consideration the seasonal nature of our business.  Significant factors which could affect our liquidity include the following:\n•\ncash flows generated from operating activities;\n•\nthe adequacy of available bank lines of credit;\n•\nthe quality of our receivables;\n•\nacquisitions;\n•\ndividend payments;\n•\ncapital expenditures;\n•\nchanges in income tax laws and regulations;\n•\nthe timing and extent of share repurchases; and\n•\nthe ability to attract long-term capital with satisfactory terms.\nOur primary capital needs are seasonal working capital obligations, debt repayment obligations and other general corporate initiatives, including acquisitions, opening new sales centers, customer-facing technology-related investments, dividend payments and discretionary share repurchases.  Our primary working capital obligations are for the purchase of inventory, payroll, rent, other facility costs and selling and administrative expenses.  Our working capital obligations fluctuate during the year, driven primarily by seasonality and the timing of inventory purchases.  Our primary sources of working capital are cash from operations supplemented by bank borrowings, which have historically been sufficient to support our growth and finance acquisitions.  We have funded our capital expenditures and share repurchases in substantially the same manner.\nWe prioritize our use of cash based on investing in our business, maintaining a prudent capital structure, including a modest amount of debt, and returning cash to our shareholders through dividends and share repurchases.  Our specific priorities for the use of cash are as follows:\n•\ncapital expenditures primarily for maintenance and growth of our sales center network, technology-related investments and vehicle fleet;\n•\ninventory and other operating expenses;\n•\nstrategic acquisitions executed opportunistically;\n•\npayment of cash dividends as and when declared by our Board;\n•\nrepayment of debt to maintain an average total target leverage ratio (as defined below) between 1.5 and 2.0; and\n•\ndiscretionary repurchases of our common stock under our Board-authorized share repurchase program.\n\n\n24\n\n\n\n\n \n\n\nWe focus our capital expenditure plans based on the needs of our existing sales centers and the opening of new sales centers.  Our capital spending primarily relates to leasehold improvements, delivery and service vehicles and information technology.  In recent years, we have increased our investment in technology and automation enabling us to operate more efficiently and better serve our customers.\n \nHistorically, our capital expenditures have averaged roughly 1.0% of net sales.  Capital expenditures were 1.1% of net sales in 2024 and 2023.  Based on management’s current plans, we project capital expenditures for 2025 will be approximately 1.0% to 1.5% of net sales.\n \nSources and Uses of Cash\nThe following table summarizes our cash flows (in thousands):\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\nProvided by operating activities\n\n\n \n\n\n$\n\n\n285,743\n\n\n \n\n\n \n\n\n$\n\n\n488,619\n\n\n \n\n\n\n\n\n\nUsed in investing activities\n\n\n \n\n\n \n\n\n(55,747\n\n\n)\n\n\n \n\n\n \n\n\n(49,442\n\n\n)\n\n\n\n\n\n\nUsed in financing activities\n\n\n \n\n\n \n\n\n(182,372\n\n\n)\n\n\n \n\n\n \n\n\n(411,785\n\n\n)\n\n\n\n\n \nNet cash provided by operations was $285.7 million in the first nine months of 2025 compared to net cash provided by operations of $488.6 million in the first nine months of 2024.  The difference in cash flow primarily relates to working capital investments, including increases in inventory in the first nine months of 2025, and $68.5 million in federal tax payments from 2024 that were deferred into 2025 due to relief granted by the IRS.\nNet cash used in investing activities for the first nine months of 2025 increased $6.3 million compared to the first nine months of 2024, primarily due to a $2.7 million increase in acquisition costs and a $2.2 million increase in net capital expenditures.\nNet cash used in financing activities was $182.4 million for the first nine months of 2025 compared to $411.8 million for the first nine months of 2024, primarily reflecting $112.4 million of net debt proceeds in the first nine months of 2025 versus $128.4 million of net debt payments in the first nine months of 2024, partially offset by a $4.5 million increase in both share repurchases and dividend payments in the first nine months of 2025 versus the same period in 2024.\nFuture Sources and Uses of Cash\nTo supplement cash from operations as our primary source of working capital, we plan to continue to utilize our three major credit facilities, which are the Fourth Amended and Restated Credit Facility (the Credit Facility), the term facility provided under the below-defined Term Agreement (the Term Facility) and the Receivables Securitization Facility (the Receivables Facility).  For additional details regarding these facilities, see the summary descriptions below and more complete descriptions in Note 5 of our “Notes to Consolidated Financial Statements,” included in Part II, Item 8 in our 2024 Annual Report on Form 10-K and Note 5 of “Notes to Consolidated Financial Statements” included in Part I, Item 1 of this Form 10-Q.\nCredit Facility\n \nOur Credit Facility, as recently amended, provides for $1.3 billion in borrowing capacity consisting of an $800.0 million revolving credit facility and a $500.0 million term loan facility.  The Credit Facility also includes an accordion feature permitting us to request one or more incremental term loans or revolving credit facility commitment increases up to $250.0 million and sublimits for the issuance of swingline loans and standby letters of credit.  We pay interest on revolving and term loan borrowings under the Credit Facility at a variable rate based on the one-month Term SOFR, plus an applicable margin.  The term loan requires quarterly amortization payments commencing on September 30, 2027, with all remaining principal due on September 30, 2029.  We intend to continue to use the Credit Facility for general corporate purposes, for future share repurchases and to fund future growth initiatives.\nAt September 30, 2025, there was $221.3 million of revolving borrowings outstanding, a $500.0 million term loan outstanding, $14.4 million of standby letters of credit outstanding and $564.3 million available for borrowing.  The weighted average effective interest rate for the Credit Facility as of September 30, 2025 was approximately 3.8%, excluding commitment fees and including the impact of our interest rates swaps.\n \n\n\n25\n\n\n\n\n \n\n\nTerm Facility\nOur Term Facility, as recently amended, provides for $90.0 million in borrowing capacity.  Proceeds from the Term Facility were used to pay down the Credit Facility in December 2019, adding borrowing capacity for future share repurchases, acquisitions and growth-oriented working capital expansion.  We pay interest on borrowings under the Term Facility at a variable rate based on one-month Term SOFR, plus an applicable margin.  The Term Facility is repaid in quarterly installments of 1.250% of the Term Facility beginning in the third quarter of 2027, with the final principal repayment due on September 30, 2029.  We may prepay amounts outstanding under the Term Facility without penalty other than interest breakage costs.\n \nAt September 30, 2025, there was $90.0 million outstanding under the Term Facility with a weighted average effective interest rate of 5.3%.\nReceivables Securitization Facility\nOur two-year accounts receivable securitization facility (the Receivables Facility) offers us a low-cost form of financing.  Under this facility, we can borrow up to $375.0 million between April through May and from $210.0 million to $350.0 million during the remaining months of the year.  We pay interest on borrowings under the Receivables Facility at a variable rate based on one-month Term SOFR, plus an applicable margin.  The Receivables Facility matures on October 30, 2026.\n \nThe Receivables Facility provides for the sale of certain of our receivables to a wholly-owned subsidiary (the Securitization Subsidiary).  The Securitization Subsidiary transfers variable undivided percentage interests in the receivables and related rights to certain third-party financial institutions in exchange for cash proceeds, limited to the applicable funding capacities.  Upon payment of the receivables by customers, rather than remitting to the financial institutions the amounts collected, we retain such collections as proceeds for the sale of new receivables until payments become due.\nAt September 30, 2025, there was $241.3 million outstanding under the Receivables Facility at a weighted average effective interest rate of 5.1%, excluding commitment fees.\n \nFinancial Covenants\nFinancial covenants of the Credit Facility, Term Facility and Receivables Facility include maintenance of a maximum average total leverage ratio and a minimum fixed charge coverage ratio, which are our most restrictive financial covenants.  As of September 30, 2025, the calculations of these two covenants are detailed below:\n•\nMaximum Average Total Leverage Ratio\n. On the last day of each fiscal quarter, our average total leverage ratio must be less than 3.25 to 1.00.  Average Total Leverage Ratio is the ratio of the sum of (i) Total Non-Revolving Funded Indebtedness as of such date, (ii) the trailing twelve months (TTM) Average Total Revolving Funded Indebtedness and (iii) the TTM Average Accounts Securitization Proceeds divided by TTM EBITDA (as those terms are defined in the Credit Facility).  As of September 30, 2025, our average total leverage ratio equaled 1.58 (compared to 1.47 as of June 30, 2025) and the TTM average total indebtedness amount used in this calculation was $1.0 billion.\n•\nMinimum Fixed Charge Coverage Ratio\n. On the last day of each fiscal quarter, our fixed charge ratio must be greater than or equal to 2.25 to 1.00.  Fixed Charge Ratio is the ratio of the TTM EBITDAR divided by TTM Interest Expense paid or payable in cash plus TTM Rental Expense (as those terms are defined in the Credit Facility).  As of September 30, 2025, our fixed charge ratio equaled 4.88 (compared to 4.90 as of June 30, 2025) and TTM Rental Expense was $110.9 million.\nThe Credit Facility and Term Facility limit the declaration and payment of dividends on our common stock to a manner consistent with past practice, provided no default or event of default has occurred and is continuing, or would result from the payment of dividends.  We may declare and pay quarterly dividends so long as (i) the amount per share of such dividends is not greater than the most recently publicly announced amount of dividends per share and (ii) our Average Total Leverage Ratio is less than 3.25 to 1.00 both immediately before and after giving pro forma effect to such dividends.  Under the Credit Facility and Term Facility, we may repurchase shares of our common stock provided no default or event of default has occurred and is continuing, or would result from the repurchase of shares, and our maximum average total leverage ratio (determined on a pro forma basis) is less than 3.25 to 1.00.\n \nOther covenants in each of our credit facilities include restrictions on our ability to grant liens, incur indebtedness, make investments, merge or consolidate, and sell or transfer assets.  Failure to comply with any of our financial covenants or any other terms of our credit facilities could result in, among other things, higher interest rates on our borrowings or the acceleration of the maturities of our outstanding debt.\n\n\n26\n\n\n\n\n \n\n\nInterest Rate Swaps\nWe utilize interest rate swap contracts to reduce our exposure to fluctuations in variable interest rates for future interest payments on our variable rate borrowings.  Interest expense related to the notional amounts under all swap contracts is based on the fixed rates plus the applicable margin on the respective borrowings.\nAs of September 30, 2025, we had two interest rate swap contracts in place, each of which has the effect of converting our exposure to variable interest rates on a portion of our variable rate borrowings to fixed interest rates.  For more information, see Note 4 of “Notes to Consolidated Financial Statements” included in Part I, Item 1 of this Form 10-Q.\nCompliance and Future Availability\nAs of September 30, 2025, we were in compliance with all material covenants and financial ratio requirements under our Credit Facility, our Term Facility and our Receivables Facility.  We believe we will remain in compliance with all material covenants and financial ratio requirements throughout the next twelve months.  For additional information regarding our debt arrangements, see Note 5 of “Notes to Consolidated Financial Statements,” included in Part II, Item 8 of our 2024 Annual Report on Form 10-K, as updated by Note 5 of “Notes to Consolidated Financial Statements,” included in Part I, Item 1 of this Form 10-Q.\nWe believe we have adequate availability of capital to fund present operations and the current capacity to finance any working capital needs that may arise.  We continually evaluate potential acquisitions and hold discussions with acquisition candidates.  If suitable acquisition opportunities arise that would require financing, we believe that we would have the ability to finance any such transactions.\nAs of October 24, 2025, we were authorized to purchase up to $493.2 million of our common stock under our current Board-approved share repurchase program.  We expect to continue to repurchase shares on the open market from time to time subject to market conditions.  We plan to fund these repurchases with cash provided by operations and borrowings under the above-described credit facilities.\n\n\n27"
}