{
  "source_file": "ppg-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business \nPPG Industries, Inc. manufactures and distributes a broad range of paints, coatings and specialty products. PPG was incorporated in Pennsylvania in 1883. PPG’s vision is to be the first-choice partner to meet our customers’ evolving needs for innovative paints, coatings and surface solutions to protect and beautify the world.\nPPG has a proud heritage with a demonstrated commitment to innovation, sustainability, community engagement and development of leading-edge paint, coatings and specialty products. Through dedication and industry-leading expertise, we solve our customers’ biggest challenges, collaborating closely to find the right path forward. PPG is a global leader with manufacturing facilities and equity affiliates in more than 70 countries.\nPPG supplies paints, coatings and specialty products to customers serving a wide array of end-uses, including industrial equipment and components; packaging material; aircraft and marine equipment; automotive original equipment; automotive refinish and aftermarket; pavement marking products; as well as coatings for other industrial and consumer products. PPG also serves commercial and residential new build and maintenance customers by supplying coatings to painting and maintenance contractors and directly to consumers for decoration and maintenance. \nThe coatings industry is highly competitive and consists of several large firms with global presence and many firms supplying local or regional markets. PPG competes in its primary markets with the world’s largest coatings companies, most of which have global operations, and with many regional coatings companies.\nIn December 2024, PPG completed the sale of 100% of its architectural coatings business in the U.S. and Canada. Accordingly, the Company’s consolidated results of operations and cash flows have been recast to present the results of the architectural coatings business in the U.S. and Canada as discontinued operations for all periods presented, and the Company’s December 31, 2023 balance sheet has been recast to present the assets and liabilities of the U.S. and Canada architectural coatings business as held for sale. Refer to Note 2, “Divestitures” under Item 8 of this Form 10-K for further information relating to this transaction.\nPPG’s business is comprised of three reportable business segments: Global Architectural Coatings, Performance Coatings and Industrial Coatings as described below:\n2024 PPG ANNUAL REPORT AND FORM 10-K      3\nGLOBAL ARCHITECTURAL COATINGS\nStrategic Business Unit\nProducts\nPrimary Customers / End-uses\nMain Distribution Methods\n Primary Brands\nArchitectural Coatings Latin America and Asia Pacific\nPaints, wood stains, adhesives, sealants and purchased sundries\nPainting and maintenance contractors and consumers for decoration and maintenance of residential and commercial building structures\nCompany-owned stores, home centers and other regional or national consumer retail outlets, paint dealers, concessionaires, independent distributors and direct to consumers\nCOMEX®, PPG®, GLIDDEN®, MERIDIAN®, POLYFORM®, RENNER®, TAUBMANS® and WHITE KNIGHT®\nArchitectural Coatings Europe, Middle East and Africa (EMEA)\nSIGMA®, HISTOR®, SEIGNEURIE®, GUITTET®, PEINTURES GAUTHIER®, RIPOLIN®, JOHNSTONE’S®, LEYLAND®, PRIMALEX®, DEKORAL®, TRILAK®, GORI®, BONDEX®, DANKE!® and TIKKURILA®\nSegment Overview\nThis reportable business segment primarily supplies a variety of decorative coatings, adhesives, sealants and finishes along with paint strippers, stains and related chemicals.\nMajor Competitive Factors\nProduct performance, technology, quality, technical and customer service, price, customer productivity, distribution and brand recognition\nGlobal Competitors\nAkzo Nobel N.V., BASF Corporation, Hempel A/S, Nippon Paint, the Jotun Group, The Sherwin-Williams Company\nPrincipal Manufacturing and Distribution Facilities\nAmsterdam, Netherlands; Birstall, United Kingdom; Debica, Poland; Mexico City, Mexico; Moreuil, France; Nykvarn, Sweden; Ruitz, France; San Juan del Rio, Mexico; Tepexpan, Mexico; Vantaa, Finland; and Wroclaw, Poland. \n2024 PPG ANNUAL REPORT AND FORM 10-K      4\nPERFORMANCE COATINGS\nStrategic Business Unit\nProducts\nPrimary Customers / End-uses\nMain Distribution Methods\n Primary Brands\nAerospace Coatings\nCoatings, sealants, transparencies, adhesives, engineered materials, packaging and chemical management services for the aerospace industry\nCommercial, military, regional jet and general aviation aircraft\nDirect to customers and company-owned distribution network\nPPG®\nAutomotive Refinish Coatings\nCoatings, solvents, adhesives, sealants, purchased sundries, digital solutions and paint films\nAutomotive and commercial transport/fleet repair and refurbishing, light industrial coatings and specialty coatings for signs\nIndependent distributors and direct to customers\nPPG®, SEM®, SPRINT®\nProtective and Marine Coatings\nCoatings and finishes for the protection of metals and structures\nMetal fabricators, heavy duty maintenance contractors and manufacturers of ships, bridges and rail cars\nDirect to customers, company-owned architectural coatings stores, independent distributors and concessionaires\nPPG®, SIGMA®\nTraffic Solutions\nPaints, thermoplastics, raised pavement markers and other advanced technologies for pavement marking\nGovernment, commercial infrastructure, painting and maintenance contractors\nDirect to customers, government agencies and independent distributors\nEnnis-Flint®\nSegment Overview\nThis reportable business segment primarily supplies a variety of protective coatings, adhesives, sealants and finishes along with pavement marking products and related chemicals, transparencies and paint films. \nAlliances\nPPG has an established alliance with Asian Paints Ltd. to serve certain automotive refinish customers in India.\nMajor Competitive Factors\nProduct performance, technology, quality, technical and customer service, price, customer productivity, distribution and brand recognition\nGlobal Competitors\nAkzo Nobel N.V., Axalta Coating Systems Ltd., BASF Corporation, Hempel A/S, Kansai Paints, the Jotun Group, Nippon Paint, RPM International Inc., The Sherwin-Williams Company and 3M Company\nPrincipal Manufacturing and Distribution Facilities\nAmsterdam, Netherlands; Birstall, United Kingdom; Busan, South Korea; Clayton, Australia; Delaware, Ohio; Deurne, Belgium; Ennis, Texas; Gonfreville, France; Greensboro, North Carolina; Huntsville, Alabama; Kunshan, China; Little Rock, Arkansas; Milan, Italy; Mojave, California; Nykvarn, Sweden; Ontario, Canada; Ostrow Wielkopolski, Poland; Ruitz, France; Shildon, United Kingdom; Sylmar, California; Stowmarket, United Kingdom; Tepexpan, Mexico; Vantaa, Finland; and Wroclaw, Poland.\n2024 PPG ANNUAL REPORT AND FORM 10-K      5\nINDUSTRIAL COATINGS\nStrategic Business Unit\nProducts\nPrimary Customers / End-uses\nMain Distribution Methods\nPrimary Brands\nAutomotive OEM\n(a)\n Coatings\nSpecifically formulated coatings, adhesives and sealants, metal pretreatments and paint films; technical services and coatings applications\nAutomotive original equipment manufacturers and tier supplier network, including combustion engine, commercial, and electric vehicles, and automotive parts and accessories, including battery-related components; On-site coatings services within several customer manufacturing locations as well as at regional service centers. \nDirect to manufacturing companies and various coatings applicators\nPPG®\nIndustrial Coatings\nSpecifically formulated coatings, adhesives and sealants and metal pretreatments\nAppliances, agricultural and construction equipment, consumer electronics, building products (including residential and commercial construction), kitchenware, transportation vehicles and numerous other finished products. \nPackaging Coatings\nSpecifically formulated coatings\nMetal cans, closures, and plastic and aluminum tubes for food, beverage and personal care, and promotional and specialty packaging\nSpecialty Products\nTESLIN® substrate, Organic Light Emitting Diode (OLED) materials, optical lens materials and photochromic dyes\nTESLIN® - Labels, including blood bag labels, e-passports, drivers’ licenses, breathable membranes, loyalty cards and identification cards\nOLED - displays and lighting \nLens materials - optical lenses, coatings and color-change products\n(a) Original equipment manufacturer (OEM)\nSegment Overview\nThis reportable business segment primarily supplies a variety of protective and decorative coatings and finishes along with adhesives, sealants, metal pretreatment products, optical monomers and coatings, low-friction coatings and other specialty products.\nAlliances\nPPG has established alliances with Kansai Paints to serve Japanese-based automotive OEM customers in North America and Europe and Asian Paints Ltd. to serve certain aftermarket customers and automotive OEM customers in India. \nMajor Competitive Factors\nProduct performance, technology, quality, technical and customer service, price, customer productivity and distribution.\nGlobal Competitors\nAkzo Nobel N.V., Axalta Coating Systems Ltd., BASF Corporation, Kansai Paints, Nippon Paint and The Sherwin-Williams Company\nPrincipal Manufacturing and Distribution Facilities\nBarberton, Ohio; Cheonan, South Korea; Cieszyn, Poland; Circleville, Ohio; Cleveland, Ohio; Monroeville, Pennsylvania; Oak Creek, Wisconsin; Quattordio, Italy; San Juan del Rio, Mexico; Springdale, Pennsylvania; Sumaré, Brazil; Weingarten, Germany; and Tianjin and Zhangjiagang, China.\n2024 PPG ANNUAL REPORT AND FORM 10-K      6\nResearch and Development\n($ in millions, except percentages)\n2024\n2023\n2022\nResearch and development costs, including depreciation of research facilities\n$447 \n$446 \n$457 \n% of annual net sales\n2.8 \n%\n2.7 \n%\n2.9 \n%\nTechnology innovation has been a hallmark of PPG’s success throughout its history. The Company seeks to optimize its investment in research and development to create new products to drive profitable growth. We align our product development with the macro trends in the markets we serve, including a focus on sustainability and productivity, and leverage core technology platforms to develop products to address unmet market needs. Additionally, we operate laboratories in close geographic proximity to our customers, and we customize our products for our customers' end-use applications. Our history of successful technology introductions is based on a commitment to an efficient and effective innovation process and disciplined portfolio management. We have obtained government funding for a small portion of the Company’s research efforts, and we will continue to pursue government funding, where appropriate.\nWe own and operate several facilities to conduct research and development for new and improved products and processes. In addition to the Company’s centralized principal research and development centers (see Item 2. “Properties” of this Form 10-K), operating segments manage their development through centers of excellence. As part of our ongoing efforts to manage our formulations and raw material costs effectively, we operate global competitive sourcing laboratories. Because of our broad array of products and customers, we are not materially dependent upon any single technology platform.\nRaw Materials, Energy and Logistics\nPPG uses a wide variety of complex raw materials that serve as the building blocks of our manufactured products. The Company’s most significant raw materials include resins, solvents, reactants, titanium dioxide, additives and epoxy. Raw materials include both organic, primarily petroleum-derived, materials and inorganic materials, including titanium dioxide. Raw materials represent PPG’s single largest production cost component.\nMost of the raw materials and energy used in production are purchased from outside sources, and the Company has made, and continues to make, supply arrangements to meet our planned operating requirements for the future. Supply of critical raw materials and energy is managed by establishing contracts with multiple sources and identifying alternative materials or technology whenever possible. In support of our decarbonization efforts, we continue to increase the amount of renewable energy secured for our operating facilities, and we are increasingly evaluating alternative raw materials that offer sustainable benefits and support the circular economy, including recycled and renewable feedstocks. Prices for certain of our raw materials typically fluctuate with energy prices and global supply and demand changes; however, pricing may be impacted by the fact that the manufacture of our raw materials is several steps downstream from crude oil, natural gas, and other key feedstocks.\nThrough effective management of raw materials, energy and logistics, the Company aims to maintain a competitive cost position and ensure ongoing security of supply. Security of a sufficient supply of high-quality raw materials is important to PPG’s continued success as it allows the Company to increase production as necessary to keep pace with customer demand. While PPG faced certain raw material shortages and logistical challenges during 2021 and 2022, raw material and logistics availability improved in 2023 and 2024 and is now comparable to pre-pandemic conditions. We continue to focus on improving our competitive cost position and expanding our supply of high-quality raw materials, including strategic initiatives to qualify multiple sources of supply.\nWe typically experience fluctuating prices for energy and raw materials driven by various factors, including changes in supplier feedstock costs and inventories, global industry activity levels, foreign currency exchange rates, government regulation, tariffs, and global supply and demand factors. In 2024, raw material costs remained high compared to historic levels, but moderated compared to 2022 levels, resulting in a low single-digit percentage decrease to cost of goods sold compared to 2023. The Company expects raw material costs to increase by a low single-digit percentage during 2025, primarily due to already enacted tariffs.\nWe are subject to existing and evolving standards relating to the regulation and registration of chemicals which could potentially impact the availability and viability of some of the raw materials we use in our production processes. Our ongoing, global product stewardship efforts are directed at maintaining our compliance with these standards. We anticipate that the number of chemical registration regulations will continue to increase globally, and we have implemented programs to track and comply with these regulations.\nOur commitment to sustainability extends to our suppliers as an extension of our internal focus on sustainability. The PPG Global Supplier Code of Conduct clarifies our global expectations in the areas of business integrity, labor practices, associate health and safety, and environmental management. Our Supplier Sustainability Policy builds upon our Global Supplier Code of Conduct by establishing expectations for sustainability within our supply chain. These policies reinforce \n2024 PPG ANNUAL REPORT AND FORM 10-K      7\nour expectations that our suppliers, as well as their subcontractors, will comply fully with applicable laws and adhere to internationally recognized environmental, social and corporate-governance standards.\nGlobal Operations\nPPG has significant non-U.S. operations. This broad geographic footprint serves to lessen the significance to us of economic impacts occurring in any one region of the world. As a result of our global footprint, we are subject to certain inherent risks, including economic and political conditions in international markets, trade protection measures and fluctuations in foreign currency exchange rates. During 2024, unfavorable foreign currency translation decreased Net sales by approximately $70 million and Income before income taxes by approximately $20 million.\nRefer to Note 20, “Revenue Recognition” in Item 8 of this Form 10-K for additional geographic information pertaining to sales and Note 21, “Reportable Business Segment Information” in Item 8 of this Form 10-K for geographic information related to PPG’s property, plant and equipment.\nSeasonality \nPPG’s Income before income taxes has typically been greater in the second and third quarters and Cash from operating activities has been greatest in the fourth quarter due to end-use market seasonality, primarily in our architectural coatings and traffic solutions businesses. Demand for our architectural coatings in Europe and traffic solutions products in the U.S and Canada is typically the strongest in the second and third quarters due to higher home improvement, maintenance and construction activity during the spring and summer months. The Latin American paint season is the strongest in the fourth quarter. These cyclical activity levels result in the collection of outstanding receivables and lower inventory on hand in the fourth quarter generating higher Cash from operating activities.\nHuman Capital\nAs of December 31, 2024, PPG employed approximately 46,000 people, of which approximately 11,700 were in the United States and approximately 34,300 were elsewhere in the world. The Company has numerous collective bargaining agreements throughout the world. We observe local customs, laws and practices in labor relations when negotiating collective bargaining agreements. There were no significant work stoppages in 2024. While we have experienced occasional work stoppages and may experience some work stoppages in the future, we believe that we will be able to negotiate all labor agreements on satisfactory terms. To date, these work stoppages have not had a significant impact on our results of operations. Overall, we believe we have good relationships with our employees.\nThe PPG Way is a set of behaviors that enables, empowers and engages each employee to fully live our values and realize our full potential as an organization. It guides our employees and leaders as we strive to achieve our purpose of protecting and beautifying the world. Employee engagement is a measure of the extent to which our employees are involved in, enthusiastic about, and committed to our work and workplace. We conduct employee surveys to increase dialogue among teams and implement meaningful action to improve results. \nOur human capital management strategies provide the foundation for our teams to thrive and deliver exceptional performance. These strategies in the areas of culture and purpose, employee engagement, development and pay equity are overseen by the Human Capital Management and Compensation Committee of our Board of Directors. We are committed to ensuring our employees are safe, healthy, enabled, engaged and valued for the unique talents they bring to PPG. We believe that having quality dialogue with our people, recognizing the value they bring and championing an authentic culture generates engaged employees and a company that is more innovative, productive and competitive. Our focus on and investment in learning and development are crucial to ensuring we keep our people engaged, productive and successful at every stage of their careers. We are committed to promoting from within wherever possible while also bringing in new ideas, thoughts and insights. \nOne of PPG’s greatest strengths is our people. Their talents and unique perspectives enable us to meet challenges quickly, creatively and effectively, providing a significant competitive advantage in today’s global economy. To ensure our people feel valued and respected, we are committed to providing a workplace that embraces a culture of collaboration and is free from harassment and bullying.\nOur environmental, health and safety policy and standards define our expectations, and we implement programs and initiatives to reduce health and safety risk in our operations. We measure progress against our health and safety goals using the injury and illness rate, which is calculated as the number of illness and injury incidents per 200,000 work hours. For 2024, our injury and illness rate was 0.31.\nMore information about PPG’s human capital management strategies and our workforce can be found in the Proxy Statement for our 2025 Annual Meeting of Shareholders and in our Sustainability Report located at http://sustainability.ppg.com.\n2024 PPG ANNUAL REPORT AND FORM 10-K      8\nEnvironmental Matters\nPPG is committed to operating in a sustainable and productive manner and to helping our customers meet their sustainability goals. Our sustainability efforts are overseen by the Sustainability and Innovation Committee of our Board of Directors. At the management level, day-to-day implementation of our sustainability initiatives is led by our Vice President, Global Sustainability who coordinates PPG’s sustainability programs, integrates these programs into our business and communicates the benefits of our sustainably advantaged products to our customers, shareholders and other stakeholders. The Vice President, Global Sustainability works with PPG’s Sustainability Committee, a committee of management consisting of senior corporate executives, to establish and monitor our sustainability goals, policies, programs and procedures that incorporate sustainability into our business practices, including resource management, innovation, community engagement, communications, procurement, manufacturing and employee wellness. \nOur dedication to innovation is intertwined with sustainability. In 2024, PPG continued to innovate and deliver sustainably-advantaged solutions based on our customers’ desire to improve their productivity and to reduce overall value chain environmental impacts. Our products contribute to lighter, more fuel-efficient vehicles, airplanes and ships, and they help our customers reduce their energy consumption, conserve water and reduce waste. These products include compact automotive paint processes and low temperature cure capabilities that save energy and reduce water usage at customer manufacturing sites; sustainably-advantaged waterborne coatings formulations; sustainably-advantaged powder coatings; lightweight sealants and coatings for aircraft; coatings that cool surfaces; coatings for recyclable metal packaging; antimicrobial products; coatings that contain reduced materials of concern; architectural coatings that contain lower carbon content raw materials; and solutions for autonomous and battery-powered vehicles. For the year ended December 31, 2024, 41% of sales were from sustainably-advantaged products and processes that we have defined as addressing multiple sustainability benefits, including lower emissions, lower toxicity, energy efficiency, use of renewable raw materials or extending durability.\nPPG is committed to using resources efficiently and driving sustainability throughout our entire value chain, including continued focus on reducing greenhouse gas emissions, water withdrawal and total energy use. In 2023, PPG announced its near-term 2030 sustainability goals, including greenhouse gas (“GHG”) emissions targets that have been validated by the Science Based Targets initiative. PPG’s 2030 sustainability goals include a commitment to reduce absolute emissions from its own operations (scope 1 and 2) by 50% by 2030 from a 2019 base year and to reduce absolute scope 3 GHG emissions from purchased goods and services, processing of sold products, and end-of-life treatment of sold products by 30% within the same timeframe. \nWe are subject to existing and evolving standards relating to the protection of the environment. In management’s opinion, the Company operates in an environmentally sound manner and is well positioned, relative to environmental matters, within the industries in which it operates. PPG is negotiating with various government agencies concerning current and former manufacturing sites and offsite waste disposal locations, including certain sites on the National Priority List. While PPG is not generally a major contributor of wastes to these offsite waste disposal locations, each potentially responsible party may face governmental agency assertions of joint and several liability. Generally, however, a final allocation of costs is made based on relative contributions of wastes to the site. There is a wide range of cost estimates for cleanup of these sites, due largely to uncertainties as to the nature and extent of their condition and the methods that may have to be employed for their remediation. The Company has established reserves for onsite and offsite remediation of those sites where it is probable that a liability has been incurred and the amount of loss can be reasonably estimated.\nOur experience to date regarding environmental matters leads us to believe that we will have continuing expenditures for compliance with provisions regulating the protection of the environment and for present and future remediation efforts at waste and plant sites. Management anticipates that such expenditures will occur over an extended period of time.\nIn addition to the $222 million currently reserved for environmental remediation efforts, we may be subject to loss contingencies related to environmental matters estimated to be approximately $100 million to $200 million. These reasonably possible unreserved losses relate to environmental matters at a number of sites, none of which are individually significant. The loss contingencies related to these sites include significant unresolved issues such as the nature and extent of contamination at these sites and the methods that may have to be employed to remediate them.\nManagement believes that the outcome of these environmental contingencies will not have a material adverse effect on PPG’s financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized. Refer to Note 15, “Commitments and Contingent Liabilities” in Item 8 of this Form 10-K for additional information related to environmental matters and our accrued liability for estimated environmental remediation costs.\n2024 PPG ANNUAL REPORT AND FORM 10-K      9\n($ in millions)\n2024\n2023\n2022\nCapital expenditures for environmental control projects\n$24 \n$26 \n$21 \nWe believe that the amount spent on capital expenditures for environmental control projects in 2025 will be similar to 2024. Actual future capital expenditures may differ from expectations due to the inherent uncertainties involved in estimating future environmental remediation compliance costs, including possible technological, regulatory and enforcement developments, the results of environmental studies and other factors. \nAvailable Information\nThe Company’s website address is \nwww.ppg.com\n. The Company posts, and shareholders may access without charge, the Company’s recent filings and any amendments of its annual reports on Form 10-K, quarterly reports on Form 10-Q and its proxy statements as soon as reasonably practicable after such reports are filed with the Securities and Exchange Commission (“SEC”). The Company also posts all financial press releases, including earnings releases, and all other reports filed or furnished to the SEC, including current reports on Form 8-K to its website. Reference to the Company’s, the SEC’s or other websites herein does not incorporate by reference any information contained on those websites, and such information should not be considered part of this Form 10-K.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion includes a comparison of our results of operations and liquidity and capital resources for the years ended December 31, 2024, 2023 and 2022. The Company’s financial results have been recast to present the results of the architectural coatings business in the U.S. and Canada as discontinued operations for all periods presented.\nHighlights\nNet sales were approximately $15.8 billion in 2024, a decrease of 2% compared to the prior year, due to sales volumes declining and the combination of unfavorable foreign currency translation and divestitures reducing net sales. Despite decreased  sales due to lower industry demand in automotive OEM coatings, industrial coatings and architectural coatings in Europe, results were supported by record sales in aerospace coatings and growth in several other key technology-driven businesses.\nIncome before income taxes was $1,852 million in 2024, an increase of $162 million compared to the prior year. This increase was primarily due lower raw material costs, lower performance-based compensation costs and restructuring savings, partially offset by overhead inflation and the impact of lower sales volumes.\nPerformance Overview \nNet Sales by Region\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nUnited States and Canada\n$5,352 \n$5,485 \n$5,346 \n(2.4)%\n2.6%\nEurope, Middle East and Africa (EMEA)\n5,386 \n5,617 \n5,458 \n(4.1)%\n2.9%\nAsia Pacific\n2,912 \n2,873 \n2,824 \n1.4%\n1.7%\nLatin America\n2,195 \n2,267 \n1,986 \n(3.2)%\n14.1%\nTotal\n$15,845 \n$16,242 \n$15,614 \n(2.4)%\n4.0%\n2024 vs. 2023\nNet sales decreased $397 million due to the following:\n● Lower sales volumes (-1%)\n● Unfavorable foreign currency translation and divestitures (-1%)\n2024 PPG ANNUAL REPORT AND FORM 10-K      19\nFor specific business results, see the Performance of Reportable Business Segments section within Item 7 of this Form 10-K.  \n2023 vs. 2022\nNet sales increased $628 million due to the following:\n● Higher selling prices (+5%)\n● Favorable foreign currency translation (+1%)\nPartially offset by:\n● Lower sales volumes (-2%)\nFor specific business results, see the Performance of Reportable Business Segments section within Item 7 of this Form 10-K.  \nCost of sales, exclusive of depreciation and amortization\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCost of sales, exclusive of depreciation and amortization\n$9,252 \n$9,678 \n$9,975 \n(4.4)%\n(3.0)%\nCost of sales as a % of net sales\n58.4 \n%\n59.6 \n%\n63.9 \n%\n(1.2)%\n(4.3)%\n2024 vs. 2023\nCost of sales, exclusive of depreciation and amortization, decreased $426 million due to the following:\n● Moderating raw material costs\n● Lower sales volume\n2023 vs. 2022\nCost of sales, exclusive of depreciation and amortization, decreased $297 million due to the following:\n● Moderating raw material costs\n● Lower sales volume\nPartially offset by:\n● Wage and other cost inflation\nSelling, general and administrative expenses\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nSelling, general and administrative expenses\n$3,391 \n$3,401 \n$3,037 \n(0.3)%\n12.0%\nSelling, general and administrative expenses as a % of net sales\n21.4 \n%\n20.9 \n%\n19.5 \n%\n0.5%\n1.4%\n2024 vs. 2023\nSelling, general and administrative expenses decreased $10 million primarily due to:\n● Restructuring cost savings\n● Lower performance-based compensation\nPartially offset by:\n● Wage and other cost inflation\n2023 vs. 2022\nSelling, general and administrative expenses increased $364 million primarily due to:\n● Wage and other cost inflation\n● Unfavorable foreign currency translation\n● Higher performance-based compensation expense\n2024 PPG ANNUAL REPORT AND FORM 10-K      20\n● Selling, general and administrative expenses from acquired businesses\nPartially offset by:\n● Restructuring cost savings\nOther charges and other income\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nInterest expense\n$241 \n$247 \n$167 \n(2.4)%\n47.9%\nInterest income\n($177)\n($140)\n($54)\n26.4%\n159.3%\nBusiness restructuring, net\n$233 \n($2)\n$33 \nN/A\nN/A\nImpairment and other related charges, net\n$146 \n$160 \n$231 \n(8.8)%\n(30.7)%\nPension settlement charge\n$— \n$190 \n$— \nN/A\nN/A\nOther charges/(income), net\n($8)\n$80 \n($66)\nN/A\nN/A\nInterest expense\nInterest expense decreased $6 million in 2024 versus 2023 primarily due to lower debt balances. \nInterest expense increased $80 million in 2023 versus 2022 primarily due to the unfavorable impact of higher interest rates on PPG’s variable debt obligations.\nInterest income\nInterest income increased $37 million  in 2024 versus 2023 primarily due to the favorable impact of higher interest rates.\nInterest income increased $86 million in 2023 versus 2022 primarily due to strong cash generation, resulting in higher levels of cash and cash equivalents, as well as the favorable impact of higher interest rates.\nBusiness restructuring, net\nIn October 2024, the Company approved a comprehensive cost reduction program focused on reducing structural costs primarily in Europe and in certain other global businesses, along with other corporate costs following the divestitures of  PPG’s silicas products business and the architectural coatings business in the U.S. and Canada. In connection with approval of this restructuring program, the Company recorded a pretax restructuring charge of $239 million, representing employee severance and other cash costs. Refer to Note 8, “Business Restructuring” in Item 8 of this Form 10-K for additional information.\nIn 2022, the Company approved a business restructuring plan which included actions to reduce its global cost structure in response to economic conditions, including softening demand in Europe and lower than expected demand recovery in China. In connection with approval of this restructuring program, the Company recorded a pretax restructuring charge of $33 million.\nImpairment and other related charges, net\nDuring 2024, the Company received written approval from Russian regulatory authorities of a definitive agreement to sell the Company’s remaining Russian business. As a result, the Company classified the business as held for sale as of December 31, 2024 and recognized an impairment charge of $146 million, primarily related to accumulated foreign currency translation losses.\nDuring 2023, as a result of its annual impairment testing performed in the fourth quarter, the Company recorded Impairment and other related charges, net of $158 million due to the goodwill impairment recognized for the traffic solutions reporting unit and $2 million to reduce the carrying value of certain indefinite-lived trademarks.\nDuring 2022, the Company recorded Impairment and other related charges, net of $231 million primarily related to the wind down of the Company’s operations in Russia. \nRefer to Note 6, “Goodwill and Other Identifiable Intangible Assets” and Note 7 ”Impairment and Other Related Charges, Net” in Item 8 of this Form 10-K for additional information.\nPension settlement charge\nIn March 2023, the Company purchased group annuity contracts that transferred to third-party insurance companies pension benefit obligations for certain of the Company’s retirees in the U.S. who were receiving their monthly retirement benefit payments from the U.S. pension plan. This transaction resulted in a pension settlement charge of $190 million. Refer to Note 14, “Employee Benefit Plans\" in Item 8 of this Form 10-K for additional information.\n2024 PPG ANNUAL REPORT AND FORM 10-K      21\nOther (income)/charges, net\nOther (income)/charges, net was higher in 2024 compared to 2023 primarily due to a gain recognized on the divestiture of the silicas products business, partially offset by the recognition of accumulated foreign currency translation losses related to the Company’s exit of its Argentina operations. Refer to Note 18, “Other (Income)/Charges, Net” in Item 8 of this Form 10-K for additional information. \nOther (income)/charges, net was lower in 2023 compared to 2022 due to an increase in the non-service cost components of pension and other postretirement benefit expense, an increase in environmental remediation costs and foreign currency losses recognized in Argentina related to a central bank adjustment to official foreign currency rates.\nEffective tax rate and earnings per diluted share, continuing operations\n% Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nIncome tax expense\n$475 \n$428 \n$320 \n11.0%\n33.8%\nEffective tax rate\n25.6 \n%\n25.3 \n%\n23.6 \n%\n0.3%\n1.7%\nAdjusted effective tax rate, continuing operations*\n22.9 \n%\n22.2 \n%\n22.1 \n%\n0.7%\n0.1%\nEarnings per diluted share, continuing operations\n$5.72 \n$5.16 \n$4.24 \n10.9%\n21.7%\nAdjusted earnings per diluted share, continuing operations*\n$7.87 \n$7.42 \n$5.84 \n6.1%\n27.1%\n*See the Regulation G reconciliations - results of operations\nThe effective tax rate on continuing operations for the year ended December 31, 2024 was 25.6%, an increase of 0.3% compared to the prior year. The adjusted effective tax rate was 22.9%, which was higher than the prior year adjusted effective tax rate in part due to the adverse impact of the Pillar 2 global minimum tax.\nThe effective tax rate on continuing operations for the year ended December 31, 2023 was 25.3%, an increase of 1.7% compared to the prior year due in part to the goodwill impairment charge, for which there was no tax benefit. The adjusted effective tax rate for the year ended December 31, 2023 was 22.2%, an increase of 0.1% compared to the prior year.\nEarnings per diluted share from continuing operations for the year ended December 31, 2024 increased year over year primarily due to lower overhead costs, restructuring cost savings and moderating raw material costs, partially offset by lower sales volumes. Earnings per diluted share from continuing operations for the year ended December 31, 2023 increased year over year primarily due to increased selling prices, moderating raw material cost inflation and favorable foreign currency translation impact, partially offset by lower sales volumes. Refer to the Regulation G Reconciliations - Results from Operations for additional information.\nReview and Outlook\nDuring 2024, PPG demonstrated resilience in a challenging industrial macroeconomic environment by growing adjusted EPS, improving aggregate segment margins and generating $1.4 billion in operating cash flow. Net sales were $15.8 billion, a decrease of 2% over the prior year. Results were supported by the breadth and diversity of the business portfolio, as the Company benefited from higher prices in several businesses which was more than offset by unfavorable foreign currency translation, divestitures and lower sales volumes. Net sales, excluding the impact of currency, acquisitions and divestitures (\"organic sales\") decreased 1% during the year with continued strong growth in our aerospace coatings business, which was more than offset by declines in the industrial coatings and automotive OEM coatings businesses. On a regional basis, sales volumes were modestly higher in the Asia Pacific and Latin America regions. Earnings per diluted share from continuing operations was $5.72, compared to $5.16 in the prior year. Adjusted earnings per diluted share was $7.87, up 6% compared to $7.42 in 2023. Combined, segment income increased by 2%. Aggregate segment margins were 70 basis points higher than the prior year, driven by sales of our technology-advantaged products and strong brands.\nDemand for PPG products was mixed by end-use market and geographic region during 2024. Demand for aerospace coatings, which was impacted by mobility restrictions in 2020 and 2021, continues to recover. Global automotive OEM manufacturers’ production decreased by about 1% versus 2023 due to lower demand and extended maintenance periods in the U.S. and Europe. Despite the lower demand, PPG outperformed the market in both Latin America and Asia Pacific. In the U.S. and Canada, demand was strong for aerospace coatings, packaging coatings and traffic solutions but declined for most other businesses. In Latin America, demand was solid throughout the year with steady demand for architectural products and growth in automotive OEM products and packaging coatings. The PPG Comex business made strong contributions, supported by a focus on its omnichannel sales approach. Demand was soft in Europe with the largest impact on the automotive OEM coatings business and the architectural coatings business. In Asia, demand was strong \n2024 PPG ANNUAL REPORT AND FORM 10-K      22\nwith sales volume growth in aerospace coatings, protective and marine coatings, automotive OEM coatings, industrial coatings and packaging coatings.\nWe anticipate a slow start to 2025 as demand in Europe and in global industrial end-use markets remains challenged. Despite the macroeconomic environment, we expect to deliver organic sales growth of a low single-digit percentage for the year. We anticipate demand growth in China, India and Mexico, continued strength in aerospace coatings as well as protective and marine coatings and expect growth in automotive refinish coatings above industry rates. Gaining momentum in infrastructure spending should aid the traffic solutions business in 2025. Global industrial production is expected to be a headwind and remain at a low level in the first quarter with improvement in the Asia Pacific and Latin America regions offset by sluggishness in Europe and in the U.S. In general, most end-use markets do not have significant excess inventories, and any demand improvement should lead to a faster ramp-up of sales volumes.\nSignificant other factors\nDuring the year, PPG successfully executed various strategic initiatives to strengthen the company. In December, the Company completed the divestitures of both the silicas products business and the architectural coatings U.S. and Canada business. These divestitures improve our financial profile, including higher operating margins, and result in a more focused organization which positions the Company to deliver sustainable organic growth. In conjunction with the divestiture of U.S. and Canada architectural coatings business, PPG entered into a supply agreement with the divested business to sell certain products, which will be recognized as Net sales in the refinish coatings, industrial coatings and protective and marine coatings businesses going forward. However, PPG has entered into transition services agreements to provide administrative services subsequent to the sale. The fees for services rendered under the transition services agreements are expected to offset the cost of providing the services.\nPPG made significant progress to reduce costs and improve the profitability of the overall business portfolio through the global restructuring programs that were announced in 2022 and 2023.  Total restructuring savings were approximately $40 million in 2024. In October 2024, the Company approved a comprehensive cost reduction program with anticipated annualized pre-tax savings of approximately $175 million once fully implemented, including savings of $60 million in 2025. The multi-year program is focused on reducing structural costs primarily in Europe and in certain other global businesses, along with other corporate costs following the divestitures of PPG’s silicas products business and the architectural coatings business in the U.S. and Canada. The Company will continue to monitor and manage its cost structure to ensure alignment with the overall demand environment.\nRaw materials are the Company’s most significant input cost. PPG experiences fluctuating energy and raw material costs driven by various factors, including changes in supplier feedstock costs and inventories, global industry activity levels, foreign currency exchange rates, and global supply and demand factors. \nIn 2024, the company incurred wage inflation, which adversely impacted operating costs compared to 2023. There was an ample supply of  commodity-related raw materials in all regions, and raw material costs were a favorable impact to our operating costs for 2024 versus 2023. In 2025, we anticipate that increased raw material costs and enacted tariffs will result in low single-digit percentage inflation.  Additionally, we expect manufacturing efficiencies to improve as the year progresses. \nWe achieved selling price improvement across several businesses in 2024 stemming from our advantaged products and solutions. The Company will carefully monitor all costs during 2025 and assess the need for additional selling price increases.\nIn 2024, foreign currency exchange rates were volatile, with the U.S. dollar strengthening in the second half of the year against certain currencies in the countries within the regions where PPG operates, resulting in a net unfavorable impact to net income from continuing operations of approximately $20 million. We expect that foreign currency exchange rates will have a net unfavorable impact on net income from continuing operations in 2025; however, the Company generally purchases raw materials, incurs manufacturing costs and sells finished goods in the same currency, which reduces foreign currency transaction-related impacts to net income.\nThe 2025 effective tax rate from continuing operations is expected to be in the range of 23% to 25%, varying by quarter. This range is the Company’s best estimate and represents an increase compared to the 2024 adjusted effective tax rate driven by higher rates in certain countries, including the impact of recent global minimum tax standards, and the geographic mix of earnings.\nOver the past four years, the Company used nearly $1.3 billion of cash to repurchase approximately nine million shares of PPG stock, including using $752 million to repurchase shares of PPG stock during 2024. The Company ended the year with approximately $2.8 billion remaining under its current share repurchase authorization. During 2024, the Company deployed $721 million for capital expenditures, $622 million for dividends and $31 million for acquisitions. In 2024, PPG marked the 53rd annual per share dividend increase and the 125th successive year of annual dividend payments.\n2024 PPG ANNUAL REPORT AND FORM 10-K      23\nPPG ended 2024 with approximately $1.4 billion in cash and short-term investments. The Company expects strong cash generation in 2025.\nRegulation G Reconciliations - Results from Operations\nPPG believes investors’ understanding of the Company’s performance is enhanced by the disclosure of net income from continuing operations, earnings per diluted share from continuing operations, PPG’s effective tax rate and segment income adjusted for certain items. PPG’s management considers this information useful in providing insight into the Company’s ongoing performance because it excludes the impact of items that cannot reasonably be expected to recur on a quarterly basis or that are not attributable to our primary operations. Net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate and segment income adjusted for these items are not recognized financial measures determined in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”) and should not be considered a substitute for net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate, segment income or other financial measures as computed in accordance with U.S. GAAP. In addition, adjusted net income, adjusted earnings per diluted share and the adjusted effective tax rate may not be comparable to similarly titled measures as reported by other companies.\nIncome before income taxes from continuing operations is reconciled to adjusted income before income taxes from continuing operations, the effective tax rate from continuing operations is reconciled to the adjusted effective tax rate from continuing operations and net income from continuing operations (attributable to PPG) and earnings per share – assuming dilution (attributable to PPG) are reconciled to adjusted net income from continuing operations (attributable to PPG) and adjusted earnings per share – assuming dilution below.\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2024\nAs reported, continuing operations\n$1,852 \n$475 \n25.6 \n%\n$1,344 \n$5.72 \nIncludes:\nAcquisition-related amortization expense\n132 \n32 \n24.2 \n%\n100 \n0.42 \nBusiness restructuring-related costs, net\n(2)\n377 \n53 \n14.1 \n%\n324 \n1.39 \nPortfolio optimization\n(3)\n59 \n(6)\n(10.2 \n%)\n65 \n0.28 \nLegacy environmental remediation charges\n(4)\n24 \n6 \n25.0 \n%\n18 \n0.07 \nInsurance recoveries\n(7)\n(4)\n(1)\n25.0 \n%\n(3)\n(0.01)\nAdjusted, continuing operations, excluding certain items\n$2,440 \n$559 \n22.9 \n%\n$1,848 \n$7.87 \n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2023\nAs reported, continuing operations\n$1,690 \n$428 \n25.3 \n%\n$1,223 \n$5.16 \nIncludes:\nAcquisition-related amortization expense\n154 \n39 \n25.3 \n%\n115 \n0.48 \nBusiness restructuring-related costs, net\n(2)\n41 \n8 \n19.5 \n%\n33 \n0.14 \nPortfolio optimization\n(3)\n53 \n(7)\n(13.2 \n%)\n58 \n0.24 \nLegacy environmental remediation charges\n(4)\n24 \n7 \n29.2 \n%\n17 \n0.07 \nImpairment and other related charges, net\n(5)\n160 \n— \n— \n%\n160 \n0.67 \nArgentina currency devaluation losses\n(6)\n20 \n(4)\n(20.0 \n%)\n24 \n0.10 \nInsurance recoveries\n(7)\n(16)\n(4)\n25.0 \n%\n(12)\n(0.05)\nPension settlement charge\n(8)\n190 \n46 \n24.2 \n%\n144 \n0.61 \nAdjusted, continuing operations, excluding certain items\n$2,316 \n$513 \n22.2 \n%\n$1,762 \n$7.42 \n2024 PPG ANNUAL REPORT AND FORM 10-K      24\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income \n(attributable to PPG)\nEarnings per Diluted Share\n(1)\nYear-ended December 31, 2022\nAs reported, continuing operations\n$1,355 \n$320 \n23.6 \n%\n$1,007 \n$4.24 \nIncludes:\nAcquisition-related amortization expense\n145 \n35 \n24.1 \n%\n110 \n0.46 \nBusiness restructuring-related costs, net\n(2)\n72 \n18 \n25.3 \n%\n54 \n0.23 \nPortfolio optimization\n(3)\n10 \n(2)\n(20.0 \n%)\n12 \n0.05 \nImpairment and other related charges, net\n(5)\n231 \n29 \n12.7 \n%\n202 \n0.86 \nAdjusted, continuing operations, excluding certain items\n$1,813 \n$400 \n22.1 \n%\n$1,385 \n$5.84 \n(1)\nEarnings per diluted share is calculated based on unrounded numbers. Figures in the table may not recalculate due to rounding.\n(2)\nBusiness restructuring-related costs, net include business restructuring charges, offset by releases related to previously approved programs, which are included in Business restructuring, net on the consolidated statement of income, accelerated depreciation of certain assets, which is included in Depreciation on the consolidated statement of income, and other restructuring-related costs, which are included in Cost of sales, exclusive of depreciation and amortization and Selling, general and administrative on the consolidated statement of income. Business restructuring-related costs, net also includes the fourth quarter 2024 recognition of accumulated foreign currency translation losses of $110 million related to the Company's exit of its Argentina operations in connection with a restructuring program, which are included in Other (income)/charges, net in the consolidated statement of income.  No tax benefit was recorded on the fourth quarter 2024 recognition of the accumulated foreign currency translation losses.  \n(3)\nPortfolio optimization includes gains and losses related to the sale of certain assets, which are included in Other (income)/charges, net on the consolidated statement of income, including the gain of $129 million on the sale of the Company's silicas products business in the fourth quarter 2024, and the losses on the sales of the Company's traffic solutions business in Argentina in the second quarter 2024, the Company's European and Australian Traffic Solutions businesses in the fourth quarter 2023 and the Company's legacy industrial Russian operations in the third quarter 2023. Portfolio optimization includes advisory, legal, accounting, valuation, other professional or consulting fees and certain internal costs directly incurred to effect acquisitions, as well as similar fees and other costs to effect divestitures and other portfolio optimization exit actions. These costs are included in Selling, general and administrative expense on the consolidated statement of income. Portfolio optimization also includes an impairment charge of $146 million recognized during the fourth quarter 2024 when the Company's remaining operations in Russia were classified as held for sale, which is included in Impairment and other related charges, net on the consolidated statement of income.  No tax benefit was recorded on the fourth quarter 2024 impairment charge.\n(4)\nLegacy environmental remediation charges represent environmental remediation costs at certain non-operating PPG manufacturing sites. These charges are included in Other (income)/charges, net in the consolidated statement of income.\n(5)\nIn the fourth quarter 2023, the Company recorded impairment and other related charges due to a non-cash goodwill impairment recognized for the Traffic Solutions reporting unit as a result of its annual goodwill impairment test. The fair value of the Traffic Solutions reporting unit decreased primarily due to increases in the cost of capital (discount rate assumption) and declines in the reporting unit’s long-term forecast driven by challenges at its operations in Argentina due to the highly inflationary environment and changes to the reporting unit’s global footprint, including the fourth quarter 2023 divestiture of its European and Australian businesses. In 2022, the Company recorded impairment and other related charges due to the wind down of the Company’s operations in Russia.\n(6)\nIn December 2023, the central bank of Argentina adjusted the official foreign currency exchange rate for the Argentine peso, significantly devaluing the currency relative to the United States dollar. Argentina currency devaluation losses represent foreign currency translation losses recognized during December 2023 related to the devaluation of the Argentine peso, which is included in Other charges/(income), net on the consolidated statement of income.\n(7)\nIn the fourth quarter 2024 and the fourth quarter 2023, the Company received reimbursement for previously approved insurance claims under policies covering legacy asbestos-related matters. In the first quarter 2023, the Company received reimbursement under its insurance policies for damages incurred at a southern U.S. factory from a winter storm in 2020. These insurance recoveries are included in Other charges/(income), net on the consolidated statement of income.\n(8)\nIn the first quarter 2023, PPG purchased group annuity contracts that transferred pension benefit obligations for certain of the Company’s retirees in the U.S. to third-party insurance companies, resulting in a non-cash pension settlement charge.\nPerformance of Reportable Business Segments\nGlobal Architectural Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$\n3,921\n \n$\n4,021\n \n$\n3,852\n \n($100)\n$169\n(2.5)%\n4.4%\nSegment income\n$\n678\n \n$\n673\n \n$\n558\n \n$5\n$115\n0.7%\n20.6%\nDepreciation and amortization expense\n$\n104\n \n$\n101\n \n$\n102\n \n$3\n($1)\n3.0%\n(1.0)%\nSegment income before interest, taxes, depreciation and amortization (EBITDA)\n$782 \n$774 \n$660 \n$8\n$114\n1.0%\n17.3%\n2024 PPG ANNUAL REPORT AND FORM 10-K      25\n2024 vs. 2023\nGlobal Architectural Coatings net sales decreased due to the following: \n● Lower sales volumes (-2%)\n● Foreign currency translation (-1%)\nPartially offset by:\n● Higher selling prices (+1%)\nThe Global Architectural Coatings segment, which was previously reported as part of the Performance Coatings segment, is comprised of architectural coatings Europe, Middle East and Africa (EMEA) and architectural coatings Latin America and Asia Pacific. Net sales decreased during 2024, primarily driven by lower sales volumes.\nArchitectural coatings EMEA organic sales decreased by a low single-digit percentage year over year due to lower sales volumes partially offset by higher selling prices. Consumer confidence remained weak, and regional demand was uneven by country. Demand declined in all sub-regions in the fourth quarter; however, sales were higher for the full year in eastern and central Europe.\nArchitectural coatings Latin America and Asia Pacific organic sales were flat during the year primarily due to lower sales volumes offset by higher selling prices. In Mexico, architectural coatings organic sales increased compared to the prior year, as concessionaire network demand continued to be strong throughout 2024.\nSegment income increased $5 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\n2023 vs. 2022\nGlobal Architectural Coatings net sales increased due to the following: \n● Higher selling prices (+6%)\n● Foreign currency translation (+4%)\nPartially offset by:\n● Lower sales volumes (-5%)\n● Divestitures (-1%)\nIn 2023, the Global Architectural Coatings business achieved organic sales growth of 1% as higher prices in all regions offset lower sales volumes.\nArchitectural coatings EMEA organic sales were flat year over year, with higher selling prices offset by lower sales volumes. Regional demand remained uneven by country, and positive sales trends occurred in some countries, including the United Kingdom, Poland and the Netherlands. \nArchitectural coatings Latin America and Asia Pacific organic sales increased during the year due to selling price increases. In Mexico, the concessionaire network demand was strong throughout 2023.\nSegment income increased $115 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\nLooking Ahead\nIn the first quarter 2025, demand in Mexico is expected to continue to be robust, and consumer sentiment in Europe is expected to be tepid. Aggregate organic sales for the segment are expected to be in the range of flat to an increase of a low single-digit percentage compared to the first quarter 2024.\nPerformance Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$5,237 \n$5,132 \n$4,792 \n$105\n$340\n2.0%\n7.1%\nSegment income\n$1,142 \n$1,019 \n$847 \n$123\n$172\n12.1%\n20.3%\nDepreciation and amortization expense\n$132 \n$139 \n$142 \n($7)\n($3)\n(5.0)%\n(2.1)%\nSegment EBITDA\n$1,274 \n$1,158 \n$989 \n$116\n$169\n10.0%\n17.1%\n2024 PPG ANNUAL REPORT AND FORM 10-K      26\n2024 vs. 2023\nPerformance Coatings net sales increased due to the following: \n● Higher selling prices (+3%)\n● Higher sales volumes (+1%)\nPartially offset by:\n● Divestiture-related sales and other (-2%)\nNet sales for the Performance Coatings segment, which is now comprised of aerospace coatings, automotive refinish coatings, protective and marine coatings, and traffic solutions, increased 2% during 2024. This increase was driven by higher selling prices and sales volumes, partially offset by the divestitures of the non-North American portion of the traffic solutions business.\nOrganic sales in automotive refinish coatings were flat year-over-year with sales volume declines offset by higher selling prices. In the U.S., sales volumes declined with benefits from share gains more than offset by lower industry collision claims. In Europe, organic sales increased modestly year over year driven by price. In China, demand for refinish products is recovering and is expected to improve.\nAerospace coatings organic sales increased by a double-digit percentage driven by increases in both price and sales volume in all regions. Demand remained strong and customer order backlogs are at similar levels to the prior year. Global air travel has improved year over year, but domestic flights remain about 3% below pre-pandemic levels. The Company remains focused on debottlenecking and expanding manufacturing capabilities to drive volume and earnings growth.\nProtective and marine coatings organic sales increased by a low single-digit percentage compared to the prior year driven by higher sales volumes in Europe and Asia.\nTraffic solutions organic sales increased by a low single-digit percentage year over year due to higher sales volumes, which benefited from market share gains across North America.\nSegment income increased $123 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation.\n2023 vs. 2022\nPerformance Coatings net sales increased due to the following: \n● Higher selling prices (+7%)\nIn 2023, all businesses within the Performance Coatings reportable business segment achieved higher selling prices. \nAutomotive refinish coatings organic sales increased a low single-digit percentage year over year. Price gains in all regions and sales volume growth in the Latin America and Asia Pacific regions were partially offset by lower sales volumes in all other regions. \nAerospace coatings organic sales were higher by 20% driven by increases in both price and volume. This strong organic sales growth was achieved despite global air travel remaining below pre-pandemic levels. \nProtective and marine coatings organic sales increased by a mid-single-digit percentage driven by solid selling price realization and higher sales volumes. \nTraffic solutions organic sales decreased by a mid-single-digit percentage year over year, with sales volume declines in all regions. \nSegment income increased $172 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost inflation and lower sales volumes.\nLooking Ahead\nIn the first quarter 2025, continued strength in aerospace coatings and protective and marine coatings is expected, as well as growth in automotive refinish coatings above industry rates. Traffic solutions is expected to follow typical seasonal trends and is well positioned to continue to benefit in the coming years from increased U.S. infrastructure spending. First quarter aggregate organic sales for the Performance Coatings segment are anticipated to increase by a low single-digit percentage to a mid-single-digit percentage compared to the first quarter 2024.\n2024 PPG ANNUAL REPORT AND FORM 10-K      27\nIndustrial Coatings\n$ Change\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\n2024 vs. 2023\n2023 vs. 2022\nNet sales\n$6,687 \n$7,089 \n$6,970 \n($402)\n$119\n(5.7)%\n1.7%\nSegment income\n$893 \n$968 \n$646 \n($75)\n$322\n(7.7)%\n49.8%\nDepreciation and amortization expense\n$206 \n$213 \n$207 \n($7)\n$6\n(3.3)%\n2.9%\nSegment EBITDA\n$1,099 \n$1,181 \n$853 \n($82)\n$328\n(6.9)%\n38.5%\n2024 vs. 2023\nIndustrial Coatings segment net sales decreased due to the following:\n● Lower selling prices (-3%)\n● Lower sales volumes (-2%)\n● Unfavorable foreign currency translation and the silicas products business divestiture (-1%)\nIn 2024, Industrial Coatings segment Net sales decreased due to lower selling prices and lower sales volume driven by lower industry demand.\nAutomotive OEM coatings organic sales decreased by a high single-digit percentage year over year driven by lower sales volumes and lower indexed-based selling prices for certain customer contracts. Sales volume increases in the Latin America and Asia Pacific regions were more than offset by declines in the U.S. and Europe. \nFor the industrial coatings business, organic sales decreased by a mid-single-digit percentage due to lower selling prices and lower sales volumes driven by softening global industrial demand.\nPackaging coatings organic sales increased by a low single-digit percentage year over year due to higher sales volumes in all regions, partially offset by lower selling prices in all regions.\nSpecialty products organic sales increased by a mid-single-digit percentage primarily due to higher sales volumes, partially offset by lower selling prices.\nSegment income decreased $75 million year over year primarily due to lower selling prices, lower sales volumes and wage and other cost inflation, partially offset by moderating raw material costs and lower overhead costs, including restructuring savings.\n2023 vs. 2022\nIndustrial Coatings net sales increased due to the following: \n● Higher selling prices (+4%)\nPartially offset by:\n● Lower sales volumes (-2%)\nIn 2023, all businesses within the Industrial Coatings reportable business segment achieved higher selling prices, which helped to offset a decrease in sales volumes driven by lower global industrial production. \nAutomotive OEM coatings organic sales increased by a high single-digit percentage year over year driven by higher selling prices and strong sales volume growth in most regions. Sales volume growth was led by the EMEA and Asia Pacific regions. \nFor the industrial coatings business, organic sales decreased by a mid-single-digit percentage year over year as higher selling prices were more than offset by lower sales volumes in all regions due to softening global industrial demand. \nPackaging coatings organic sales decreased by a mid-single-digit percentage year over year due to lower sales volumes in all regions due to broad demand weakness. These sales volume decreases were partially offset by higher selling prices in most regions. \nSpecialty coatings and materials organic sales decreased by a mid-single-digit percentage primarily due to lower sales volumes, partially offset by higher selling prices. \nSegment income increased $322 million year over year primarily due to higher selling prices and moderating raw material costs, partially offset by wage and other cost of sales inflation and lower sales volumes.\n2024 PPG ANNUAL REPORT AND FORM 10-K      28\nLooking Ahead\nIn the first quarter 2025, global industrial production is expected to remain at a relatively low level with improvement in the Asia Pacific and Latin America regions offset by sluggishness in Europe and in the U.S. Demand growth for PPG's industrial coatings in China is expected to continue for the next several quarters. Automotive OEM industry build rates are expected to decline in the first quarter, but are expected to outpace market growth in Latin America and the Asia Pacific region. Aggregate organic sales for the segment are anticipated to decrease by a mid-single-digit percentage to a low single-digit percentage compared to the first quarter 2024.\nCommitments and Contingent Liabilities, including Environmental Matters\nPPG is involved in a number of lawsuits and claims, both actual and potential, including some that it has asserted against others, in which substantial monetary damages are sought. Refer to Item 3. “Legal Proceedings” and Note 15, “Commitments and Contingent Liabilities” in Item 8 of this Form 10-K for a description of certain of these lawsuits.\nAs discussed in Item 3 and Note 15, although the result of any future litigation of such lawsuits and claims is inherently unpredictable, management believes that, in the aggregate, the outcome of all lawsuits and claims involving PPG, including asbestos-related claims, will not have a material effect on PPG’s consolidated financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized.\nAs also discussed in Note 15, PPG has significant reserves for environmental contingencies. Refer to the Environmental Matters section of Note 15 for details of these reserves. It is PPG’s policy to accrue expenses for contingencies when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. Reserves for environmental contingencies are exclusive of claims against third parties and are generally not discounted. In management’s opinion, the Company operates in an environmentally sound manner and the outcome of the Company’s environmental contingencies will not have a material effect on PPG’s financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized. Management anticipates that the resolution of the Company’s environmental contingencies will occur over an extended period of time. \nAccounting Standards Adopted in 2024 \nNote 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K describes the Company’s recently adopted accounting pronouncements.\nAccounting Standards to be Adopted in Future Years\nNote 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K describes accounting pronouncements that have been promulgated prior to December 31, 2024 but are not effective until a future date.\nLiquidity and Capital Resources\nDuring the past two years, PPG had sufficient financial resources to meet its operating requirements, to fund capital spending, including acquisitions, share repurchases and pension plans, and to pay increasing dividends to shareholders.\nCash and cash equivalents and short-term investments\n($ in millions)\n2024\n2023\nCash and cash equivalents\n$1,270 \n$1,493 \nShort-term investments\n88 \n75 \nTotal\n$1,358 \n$1,568 \nCash from operating activities - continuing operations\n($ in millions, except percentages)\n% Change\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash from operating activities - continuing operations\n$1,391 \n$2,294 \n$1,000 \n(39.4)%\n129.4%\n2024 vs. 2023\nThe $903 million decrease in Cash from operating activities - continuing operations was primarily due to unfavorable changes in working capital compared to the prior year. Accrued incentive compensation was lower at December 31, 2024 versus December 31, 2023, driving operating cash outflows during 2024 compared to 2023. The Company paid an additional $80 million in cash taxes during 2024 related to divestitures, primarily due to the taxable gain recognized on the sale of the silicas products business. The Company also recorded operating cash outflows of $55 million related to net \n2024 PPG ANNUAL REPORT AND FORM 10-K      29\npayables paid on behalf of the divested United States and Canada architectural coatings business during 2024 that were reimbursed in 2025. \n2023 vs. 2022\nThe $1,294 million increase in Cash from operating activities - continuing operations was primarily due to higher net income driven by higher selling prices and moderating raw material costs and favorable changes in working capital compared to the prior year.\nOperating working capital\nOperating working capital is a subset of total working capital and represents (1) receivables from customers, net of allowance for doubtful accounts, (2) inventories, and (3) trade liabilities. Refer to Note 3, “Working Capital Detail” in Item 8 of this Form 10-K for further information related to the components of the Company’s operating working capital. We believe operating working capital represents the key components of working capital under the operating control of our businesses.\nA key metric we use to measure our working capital management is operating working capital as a percentage of sales (fourth quarter sales annualized). \n($ in millions, except percentages)\n2024\n2023\nTrade receivables, net\n$2,477 \n$2,622 \nInventories, FIFO\n2,015 \n2,117 \nTrade creditors’ liabilities\n2,161 \n2,438 \nOperating working capital\n$2,331 \n$2,301 \nOperating working capital as a % of fourth quarter sales, annualized\n15.6 \n%\n14.7 \n%\nTrade receivables, net as a % of fourth quarter sales, annualized\n16.6 \n%\n16.8 \n%\nDays sales outstanding\n51 \n55 \nInventories, FIFO as a % of fourth quarter sales, annualized\n13.5 \n%\n13.5 \n%\nInventory turnover\n4.5 \n4.2 \nEnvironmental expenditures\n($ in millions)\n2024\n2023\n2022\nCash outlays related to environmental remediation activities\n$28 \n$31 \n$73 \nWe expect cash outlays for environmental remediation activities to be between $20 million to $60 million annually from 2025 through 2029.\nCash used for investing activities - continuing operations\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash used for investing activities - continuing operations\n$399 \n$525 \n$430 \n(24.0)%\n22.1%\n2024 vs. 2023\nThe $126 million decrease in cash used for investing activities - continuing operations was primarily due to proceeds from the sale of our silicas products business, partially offset by higher capital expenditures. \n2023 vs. 2022\nThe $95 million increase in cash used for investing activities was primarily due to higher capital expenditures and lower proceeds from asset sales. \n2024 PPG ANNUAL REPORT AND FORM 10-K      30\nCapital expenditures, including business acquisitions\n \n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCapital expenditures \n(1)\n$721 \n$516 \n$486 \n39.7%\n6.2%\nBusiness acquisitions, net of cash balances acquired\n$31 \n$109 \n$114 \n(71.6)%\n(4.4)%\nTotal capital expenditures, including acquisitions\n$752 \n$625 \n$600 \n20.3%\n4.2%\nCapital expenditures, excluding acquisitions, as a % of sales\n4.6 \n%\n3.2 \n%\n3.1 \n%\n43.8%\n3.2%\n(1)\nIncludes modernization and productivity improvements, expansion of existing businesses and environmental control projects.\nDuring 2025, capital expenditures, which are expected to be approximately $725 million to $775 million, will support future organic growth opportunities. The Company will continue to deploy cash focused on shareholder value creation.\nCash used for financing activities\n% Change\n($ in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash used for financing activities\n$1,425 \n$1,550 \n$409 \n(8.1)%\n279.0%\n2024 vs. 2023\nThe $125 million decrease in cash used for financing activities was primarily due to lower repayments of long-term debt, partially offset by higher share repurchases.\n2023 vs. 2022\nThe $1,141 million increase in cash used for financing activities was primarily due to repayment of long-term debt and lower proceeds from the issuance of debt, partially offset by the absence of net payments on commercial paper.\nShare repurchase activity\n($ in millions, except number of shares)\n2024\n2023\n2022\nNumber of shares repurchased (millions)\n5.8\n0.6 \n1.5 \nCash paid for shares repurchased\n$752 \n$86 \n$190 \nThe Company has approximately $2.8 billion remaining under the current authorization from the Board of Directors. The Board of Directors authorized $2.5 billion of share repurchases in December 2017 and authorized an additional $2.5 billion of share repurchases in April 2024. The repurchase programs do not have an expiration date.\nDividends paid to shareholders\n($ in millions)\n2024\n2023\n2022\nDividends paid to shareholders\n$622 \n$598 \n$570 \nPPG has paid uninterrupted annual dividends since 1899, and 2024 marked the 53rd successive year of increased annual per-share dividend payments to shareholders. The Company raised its per-share quarterly dividend by approximately 5% to $0.68 per share in July 2024.\nDebt issued and repaid\nDebt Issued (net of premium/discount and issuance costs)\nYear\n$ in millions\nTerm Loan Credit Agreement, due 2026\n2024\n$274 \nTerm Loan Credit Agreement, due 2026\n2023\n$550 \n1.875% notes (€300) due 2025\n2022\n$319 \n2.750% notes (€700) due 2029\n2022\n$742 \n1.95% note (€50) due 2037\n2022\n$55 \nDebt Repaid\nYear\n$ in millions\n2.4% notes ($300)\n2024\n$300 \n3.2% notes ($300)\n2023\n$300 \nTerm Loan Credit Agreement, due 2024\n2023\n$1,100 \nTerm Loan Credit Agreement, due 2024\n2022\n$300 \nAcquired debt\n2022\n$2 \n2024 PPG ANNUAL REPORT AND FORM 10-K      31\nThe Company’s commercial paper borrowings are classified as long-term debt based on PPG’s intent and ability to refinance these borrowings on a long-term basis. Net payments on commercial paper were zero for both the years ended December 31, 2024 and December 31, 2023 and $440 million for the year ended December 31, 2022. \nCredit agreements and lines of credit\nIn April 2023, PPG entered into a €500 million term loan credit agreement (the \"Term Loan\"). The Term Loan contains covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan terminates and all amounts outstanding are payable in April 2026. In April 2023, PPG borrowed €500 million under the Term Loan. In December 2023, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €250 million. In January 2024, PPG borrowed the additional €250 million. In December 2024, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €300 million. In January 2025, PPG borrowed the additional €300 million. \nIn February 2021, PPG entered into a $2.0 billion term loan credit agreement (the \"Term Loan Credit Agreement\") to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. The Term Loan Credit Agreement provided the Company with the ability to borrow up to an aggregate principal amount of $2.0 billion on an unsecured basis. The Term Loan Credit Agreement contained covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which included, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. The Term Loan Credit Agreement was scheduled to mature and all outstanding borrowings were due and payable on the third anniversary of the date of the initial borrowing under the Agreement. In June 2021, PPG borrowed $700 million under the Term Loan Credit Agreement to finance the Company’s acquisition of Tikkurila, and to pay fees, costs and expenses related thereto. In December 2021, PPG borrowed an additional $700 million under the Term Loan Credit Agreement to be used for working capital and general corporate purposes.  In 2022 and 2023, PPG repaid $300 million and $1.1 billion, respectively, of the Term Loan Credit Agreement using cash on hand. The Term Loan Credit Agreement was fully repaid as of December 31, 2023. \nIn March 2023, PPG amended its five-year credit agreement (the “Credit Agreement”) dated as of August 30, 2019. The amendments to the Credit Agreement replaced the LIBOR-based reference interest rate option with a reference interest rate option based upon Term SOFR. The other terms of the Credit Agreement remained unchanged. In July 2023, PPG amended and restated the Credit Agreement, extending the term through July 27, 2028. The amended and restated Credit Agreement provides for a $2.3 billion unsecured revolving credit facility. The Company has the ability to increase the size of the Credit Agreement by up to an additional $750 million, subject to the receipt of lender commitments and other conditions precedent. The Company has the right, subject to certain conditions set forth in the Credit Agreement, to designate certain subsidiaries of the Company as borrowers under the Credit Agreement. In connection with any such designation, the Company is required to guarantee the obligations of any such subsidiaries under the Credit Agreement. There were no amounts outstanding under the Credit Agreement as of December 31, 2024, December 31, 2023 and December 31, 2022.\nThe Term Loan and the Credit Agreement require the Company to maintain a ratio of Total Indebtedness to Total Capitalization, as defined in the Term Loan and the Credit Agreement, of 60% or less; provided, that for any fiscal quarter in which the Company has made an acquisition for consideration in excess of $1 billion and for the next five fiscal quarters thereafter, the ratio of Total Indebtedness to Total Capitalization may not exceed 65% at any time. As of December 31, 2024, Total Indebtedness to Total Capitalization as defined under the Credit Agreement and the Term Loan was 45%. \nIn addition to the amounts available under lines of credit, the Company maintains access to the capital markets and may issue debt or equity securities from time to time, which may provide an additional source of liquidity. \nRefer to Note 10, “Borrowings and Lines of Credit” in Item 8 of this Form 10-K for information regarding notes entered into and repaid as well as details regarding the use and availability of committed and uncommitted lines of credit, letters of credit and debt covenants.\n2024 PPG ANNUAL REPORT AND FORM 10-K      32\nCash requirements\nWe continue to believe that our cash on hand and short-term investments, cash from operations and the Company’s access to capital markets will continue to be sufficient to fund our operating activities, capital spending, acquisitions, dividend payments, debt service, share repurchases, contributions to pension plans, and PPG’s significant cash requirements. The Company’s significant cash requirements include the following contractual obligations and commitments.\n \nObligations Due In:\n($ in millions)\nTotal\n2025\n2026-2027\n2028-2029\nThereafter\nLong-term debt\n$5,808 \n$933 \n$2,095 \n$1,888 \n$892 \nInterest payments\n(1)\n$832 \n$127 \n$220 \n$153 \n$332 \nOperating leases\n(2)\n$653 \n$144 \n$208 \n$127 \n$174 \nUnconditional purchase commitments\n(3)\n$218 \n$108 \n$82 \n$23 \n$5 \n(1)\nInterest on all outstanding debt.\n(2)\nIncludes interest payments.\n(3)\nThe unconditional purchase commitments are principally take-or-pay obligations related to the purchase of certain materials, utilities and services consistent with customary industry practice.\nThe Company’s off-balance sheet arrangements include unconditional purchase commitments disclosed in the “Liquidity and Capital Resources” section in the cash requirements table as well as letters of credit as discussed in Note 10, “Borrowings and Lines of Credit” in Item 8 of this Form 10-K.\nOther liquidity matters\nAt December 31, 2024, the total amount of unrecognized tax benefits for uncertain tax positions, including an accrual of related interest and penalties along with positions only impacting the timing of ta\nx benefits, was $152 million. The timing of payments will depend on the progress of examinations by tax authorities. PPG does not expect a significant tax p\nayment related to these obligations within the next year. The Company is unable to make a reasonably reliable estimate as to if, or when, any significant cash settlements with tax authorities may occur.\nCritical Accounting Estimates\nManagement has evaluated the accounting policies used in the preparation of the financial statements and related notes presented in Item 8 of this Form 10-K and believes those policies to be reasonable and appropriate. We believe that the most critical accounting estimates made in the preparation of our financial statements are those related to accounting for contingencies, under which we accrue a loss when it is probable that a liability has been incurred and the amount can be reasonably estimated, and to accounting for pensions, other postretirement benefits, business combinations, goodwill and other identifiable intangible assets with indefinite lives because of the importance of management judgment in making the estimates necessary to apply these policies.\nContingencies\nContingencies, by their nature, relate to uncertainties that require management to exercise judgment both in assessing the likelihood that a liability has been incurred as well as in estimating the amount of potential loss. The most important contingencies impacting our financial statements are those related to environmental remediation, to pending, impending or overtly threatened litigation against the Company and to the resolution of matters related to open tax years. For more information on these matters, see Note 15, “Commitments and Contingent Liabilities” and Note 13, “Income Taxes” in Item 8 of this Form 10-K.\nDefined Benefit Pension and Other Postretirement Benefit Plans\nAccounting for pensions and other postretirement benefits involves estimating the cost of benefits to be provided well into the future and attributing that cost over the time period each employee works. To accomplish this, we make extensive use of assumptions about inflation, investment returns, mortality, turnover, medical costs and discount rates. The Company has established a process by which management reviews and selects these assumptions annually. Refer to Note 14, “Employee Benefit Plans” in Item 8 of this Form 10-K for information on these plans and the assumptions used.\nBusiness Combinations\nThe Company uses the acquisition method of accounting to allocate costs of acquired businesses to the assets acquired and liabilities assumed based on their estimated fair values at the dates of acquisition. The excess costs of acquired businesses over the fair values of the assets acquired and liabilities assumed is recognized as goodwill. The valuations of the acquired assets and liabilities impacts the determination of future operating results. In addition to using management estimates and negotiated amounts, the Company uses a variety of information sources to determine the estimated fair values of acquired assets and liabilities including: third-party appraisals for the estimated value and lives of identifiable \n2024 PPG ANNUAL REPORT AND FORM 10-K      33\nintangible assets and property, plant and equipment; third-party actuaries for the estimated obligations of defined benefit pension plans and similar benefit obligations; and legal counsel or other experts to assess the obligations associated with legal, environmental and other contingent liabilities. \nThe business and technical judgment of management is used in determining wh\nich acquired intangible assets have indefinite lives and in determining the useful lives of acquired finite-lived intangible assets in accordance with the accounting guidance for goodwill and other intangible assets.\nGoodwill and Intangible Assets\nThe Company tests indefinite-lived intangible assets and goodwill for impairment by either performing a qualitative evaluation or a quantitative test at least annually, or more frequently if an indication of impairment arises. The qualitative evaluation is an assessment of factors to determine whether it is more likely than not that the fair value of a reporting unit or asset is less than its carrying amount. In the quantitative test, fair values are estimated using a discounted cash flow model. Key assumptions and estimates used in the discounted cash flow model include projected future revenues, discount rates, operating cash flows, capital expenditures and tax rates. For more information on these matters, see Note 1, “Summary of Significant Accounting Policies” in Item 8 of this Form 10-K. \nWe believe that the amounts recorded in the financial statements in Item 8 of this Form 10-K related to these contingencies, pensions, other postretirement benefits, business combinations, goodwill and other identifiable intangible assets with indefinite lives are based on the best estimates and judgments of the appropriate members of PPG’s management, although actual outcomes could differ from our estimates.\nCurrency\nComparing spot exchange rates at December 31, 2024 and at December 31, 2023, the U.S. dollar strengthened against the currencies of many countries within the regions PPG operates, most notably the Mexican peso. As a result, consolidated net assets at December 31, 2024 decreased by $905 million from December 31, 2023. Comparing spot exchange rates at December 31, 2023 and at December 31, 2022, the U.S. dollar weakened against the currencies of many countries within the regions PPG operates, most notably the Mexican peso. As a result, consolidated net assets at December 31, 2023 increased by $508 million from December 31, 2022.\nComparing average exchange rates during 2024 to those of 2023, the U.S. dollar strengthened against the currencies of certain countries where PPG operates, including the Mexican peso and the Chinese yuan. This had an unfavorable impact of approximately $20 million on full year 2024 Income before income taxes from the translation of this foreign income into U.S. dollars. Comparing average exchange rates during 2023 to those of 2022, the U.S. dollar weakened against the currencies of certain countries where PPG operates, including the Mexican peso and the euro, partially offset by strengthening against the Chinese yuan and Argentine peso. This had a favorable impact of approximately $25 million on full year 2023 Income before income taxes from the translation of this foreign income into U.S. dollars.\nForward-Looking Statements\nThe Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements made by or on behalf of the Company. Management’s Discussion and Analysis and other sections of this Annual Report contain forward-looking statements that reflect the Company’s current views with respect to future events and financial performance. You can identify forward-looking statements by the fact that they do not relate strictly to current or historic facts. Forward-looking statements are identified by the use of the words “aim,” “believe,” “expect,” “anticipate,” “intend,” “estimate,” “project,” “outlook,” “forecast” and other expressions that indicate future events and trends. Any forward-looking statement speaks only as of the date on which such statement is made, and the Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. You are advised, however, to consult any further disclosures we make on related subjects in our reports to the SEC. Also, note the following cautionary statements.\nMany factors could cause actual results to differ materially from the Company’s forward-looking statements. Such factors include statements related to global economic conditions, geopolitical issues, increasing price and product competition by our competitors, fluctuations in cost and availability of raw materials, energy, labor and logistics, the ability to achieve selling price increases, the ability to recover margins, customer inventory levels, PPG inventory levels, our ability to maintain favorable supplier relationships and arrangements, the timing of and the realization of anticipated cost savings from restructuring initiatives, the ability to identify additional cost savings opportunities, the timing and expected benefits of our acquisitions, difficulties in integrating acquired businesses and achieving expected synergies therefrom, the amount of future share repurchases, economic and political conditions in the markets we serve, the imposition of tariffs, the ability to penetrate existing, developing and emerging foreign and domestic markets, foreign exchange rates and fluctuations in such rates, fluctuations in tax rates, the impact of future legislation, the impact of environmental regulations, unexpected business disruptions, cybersecurity events, global human health issues, the unpredictability of existing and possible future \n2024 PPG ANNUAL REPORT AND FORM 10-K      34\nlitigation, including asbestos litigation, and government investigations. However, it is not possible to predict or identify all such factors.\nConsequently, while the list of factors presented here and in Item 1A is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements.\nConsequences of material differences in the results compared with those anticipated in the forward-looking statements could include, among other things, lower sales or income, business disruption, operational problems, financial loss, legal liability to third parties, other factors set forth in Item 1A of this Form 10-K and similar risks, any of which could have a material adverse effect on the Company’s consolidated financial condition, results of operations or liquidity. PPG undertakes no obligation to update any forward-looking statement, except as otherwise required by applicable law.",
  "item2": null
}