{
  "source_file": "ppg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our unaudited financial statements and the notes thereto included in the condensed consolidated financial statements in Part I, Item 1, “Financial Statements,” of this report and in conjunction with the 2024 Form 10-K. \nHighlights\nNet sales were approximately $4.1 billion for the three months ended September 30, 2025, an increase of 1% compared to the prior year primarily due to higher selling prices, higher sales volumes and the favorable impact of foreign currency translation, partially offset by the divestiture of the silicas products business and the architectural coatings business in Russia.\nIncome before income taxes was $556 million for the three months ended September 30, 2025, a decrease of $22 million compared to the prior year, primarily due to the unfavorable impact of wage and other cost inflation, divestitures and higher other charges/(income), partially offset by increased manufacturing productivity and cost-control measures.\n27 \nTable of Contents\nResults of Operations\nThree Months Ended \nSeptember 30\nPercent Change\nNine Months Ended \nSeptember 30\nPercent Change\n($ in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nNet sales\n$4,082 \n$4,032 \n1.2 \n%\n$11,961 \n$12,116 \n(1.3)\n%\nCost of sales, exclusive of depreciation and amortization\n$2,426 \n$2,381 \n1.9 \n%\n$7,000 \n$7,036 \n(0.5)\n%\nSelling, general and administrative\n$824 \n$848 \n(2.8)\n%\n$2,534 \n$2,556 \n(0.9)\n%\nDepreciation\n$106 \n$89 \n19.1 \n%\n$297 \n$273 \n8.8 \n%\nAmortization\n$32 \n$30 \n6.7 \n%\n$97 \n$100 \n(3.0)\n%\nResearch and development, net\n$106 \n$102 \n3.9 \n%\n$314 \n$317 \n(0.9)\n%\nInterest expense\n$65 \n$67 \n(3.0)\n%\n$183 \n$184 \n(0.5)\n%\nInterest income\n($42)\n($48)\n(12.5)\n%\n($129)\n($135)\n(4.4)\n%\nOther charges/(income), net\n$9 \n($15)\nN/A\n$9 \n$14 \n(35.7)\n%\nNet Sales by Region\nThree Months Ended \nSeptember 30\nPercent Change\nNine Months Ended \nSeptember 30\nPercent Change\n($ in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nUnited States and Canada\n$1,374 \n$1,387 \n(0.9)\n%\n$4,153 \n$4,147 \n0.1 \n%\nEMEA\n1,375 \n1,366 \n0.7 \n%\n4,081 \n4,179 \n(2.3)\n%\nAsia Pacific\n768 \n750 \n2.4 \n%\n2,142 \n2,140 \n0.1 \n%\nLatin America\n565 \n529 \n6.8 \n%\n1,585 \n1,650 \n(3.9)\n%\nTotal\n$4,082 \n$4,032 \n1.2 \n%\n$11,961 \n$12,116 \n(1.3)\n%\nThree Months Ended September 30, 2025\nNet sales increased $50 million due to the following:\n● Favorable foreign currency translation\n (+\n2%\n)\n● Higher selling prices (+1%)\n● Higher sales volumes (+1%)\nPartially offset by:\n● Divestiture-related sales (-3%)\nFor specific business results, see the Performance of Reportable Business Segments section within Item 2 of this Form 10-Q.\nCost of sales, exclusive of depreciation and amortization, increased $45 million primarily due to higher sales volumes and the unfavorable impact of foreign currency translation, partially offset by divestitures.\nSelling, general and administrative expense decreased $24 million primarily due to cost-control measures and the impact of divestitures, partially offset by overhead cost inflation, the unfavorable impact of foreign currency translation, and the cost of providing transition services related to the recently divested U.S. and Canada architectural coatings business, which are fully reimbursed by the buyer under transition services agreements.\nDepreciation expense increased $17 million primarily due to higher accelerated depreciation related to approved restructuring actions.\nOther charges/(income), net increased by $24 million primarily due to net impairment and other related charges related to a consolidated joint venture in the Performance Coatings segment and higher net foreign currency translation expense, partially offset by gains recognized on the sale of non-core assets, a sales and use tax refund received during the third quarter 2025, and income recognized in connection with transition services agreements with the buyer of PPG's recently divested U.S. and Canada architectural coatings business.\n28 \nTable of Contents\nNine Months Ended September 30, 2025\nNet sales decreased $155 million due to the following:\n● Divestiture-related sales (-3%)\nPartially offset by:\n● Higher selling prices (+1%)\n● Higher sales volumes (+1%)\nFor specific business results, see the Performance of Reportable Business Segments section within Item 2 of this Form 10-Q.\nCost of sales, exclusive of depreciation and amortization, decreased by $36 million primarily due to divestitures and increased manufacturing productivity, partially offset by increases in sales volumes.\nSelling, general and administrative expense decreased by $22 million primarily due to cost-control measures and divestitures, partially offset by overhead cost inflation and the cost of providing transition services related to the recently divested U.S. and Canada architectural coatings business, which are fully reimbursed by the buyer under transition services agreements.\nDepreciation expense increased by $24 million primarily due to higher accelerated depreciation related to approved restructuring actions.\nOther charges/(income), net decreased by $5 million primarily due to income recognized in connection with transition services agreements with the buyer of PPG's recently divested U.S. and Canada architectural coatings business, gains recognized on the sale of non-core assets, the absence of a second quarter 2024 non-cash loss on the sale of the traffic solutions business in Argentina and a sales and use tax refund received in the third quarter 2025, partially offset by impairment and other related charges related to a consolidated joint venture in the Performance Coatings segment and higher net foreign currency translation expense.\nEffective Tax Rate and Earnings Per Diluted Share\nThree Months Ended \nSeptember 30\nPercent Change\nNine Months Ended \nSeptember 30\nPercent Change\n($ in millions, except percentages and amounts per share)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nIncome tax expense\n$118 \n$128 \n(7.8)\n%\n$380 \n$405 \n(6.2)\n%\nEffective tax rate\n21.2\n%\n22.1\n%\n(0.9)\n%\n22.9\n%\n22.9\n%\n— \n%\nAdjusted effective tax rate, continuing operations*\n22.1\n%\n22.2\n%\n(0.1)\n%\n23.3\n%\n23.2\n%\n0.1 \n%\nEarnings per diluted share, continuing operations\n$1.96 \n$1.90 \n3.2 \n%\n$5.57 \n$5.70 \n(2.3)\n%\nAdjusted earnings per diluted share*\n$2.13 \n$2.03 \n4.9 \n%\n$6.06 \n$6.25 \n(3.0)\n%\n*See Regulation G Reconciliation below\nBoth Earnings per diluted share, continuing operations and Adjusted earnings per diluted share for the three months ended September 30, 2025 increased year over year due to higher selling prices, cost-control actions, increased manufacturing productivity and lower adjusted weighted average common shares outstanding due to share repurchases, partially offset by wage and other cost inflation and divestitures.\nBoth Earnings per diluted share, continuing operations and Adjusted earnings per diluted share for the nine months ended September 30, 2025 decreased year-over-year primarily due to raw material, wage and other cost inflation, divestitures and the unfavorable impact of foreign currency translation, partially offset by higher selling prices, cost-control actions, increased manufacturing productivity and lower adjusted weighted average common shares outstanding due to share repurchases.\nRegulation G Reconciliations - Results from Operations\nPPG believes investors’ understanding of the Company’s performance is enhanced by the disclosure of net income from continuing operations, earnings per diluted share from continuing operations, PPG’s effective tax rate and segment income adjusted for certain items. PPG’s management considers this information useful in providing insight into the Company’s ongoing performance because it excludes the impact of items that cannot reasonably be expected to recur on a quarterly basis or that are not attributable to our primary operations. Net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate and segment \n29 \nTable of Contents\nincome adjusted for these items are not recognized financial measures determined in accordance with U.S. generally accepted accounting principles (“U.S. GAAP”) and should not be considered a substitute for net income from continuing operations, earnings per diluted share from continuing operations, the effective tax rate, segment income or other financial measures as computed in accordance with U.S. GAAP. In addition, adjusted net income, adjusted earnings per diluted share and the adjusted effective tax rate may not be comparable to similarly titled measures as reported by other companies.\nIncome before income taxes from continuing operations is reconciled to adjusted income before income taxes from continuing operations, the effective tax rate from continuing operations is reconciled to the adjusted effective tax rate from continuing operations and net income from continuing operations (attributable to PPG) and earnings per share – assuming dilution (attributable to PPG) are reconciled to adjusted net income from continuing operations (attributable to PPG) and adjusted earnings per share – assuming dilution below.\nThree Months Ended September 30, 2025\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\n(a)\nAs reported, continuing operations\n$556 \n$118 \n21.2\n%\n$444 \n$1.96 \nAdjusted for:\nAcquisition-related amortization expense\n32 \n8 \n24.4\n%\n24 \n0.11 \nBusiness restructuring-related costs, net\n(b)\n11 \n4 \n38.5\n%\n7 \n0.03 \nPortfolio optimization\n(c)\n2 \n2 \n94.5\n%\n— \n— \nImpairment and other related charges, net \n(d)\n24 \n6 \n24.3\n%\n6 \n0.03 \nAdjusted, continuing operations, excluding certain items\n$625 \n$138 \n22.1\n%\n$481 \n$2.13 \nThree Months Ended September 30, 2024\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\n(a)\nAs reported, continuing operations\n$578 \n$128 \n22.1\n%\n$444 \n$1.90 \nAdjusted for:\nAcquisition-related amortization expense\n30 \n7 \n24.4\n%\n23 \n0.10 \nPortfolio optimization\n(c)\n10 \n2 \n24.3\n%\n8 \n0.03 \nAdjusted, continuing operations, excluding certain items\n$618 \n$137 \n22.2\n%\n$475 \n$2.03 \nNine Months Ended September 30, 2025\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\n(a)\nAs reported, continuing operations\n$1,656 \n$380 \n22.9\n%\n$1,269 \n$5.57 \nAdjusted for:\nAcquisition-related amortization expense\n97 \n24 \n24.4\n%\n73 \n0.32 \nBusiness restructuring-related costs, net\n(b)\n40 \n11 \n27.5\n%\n29 \n0.13 \nPortfolio optimization\n(c)\n(2)\n2 \nN/A\n(4)\n(0.02)\nImpairment and other related charges, net \n(d)\n24 \n6 \n24.3\n%\n6 \n0.03 \nLegacy environmental remediation charges \n(e)\n16 \n4 \n24.3\n%\n12 \n0.05 \nInsurance recovery\n(f)\n(6)\n(2)\n24.3\n%\n(4)\n(0.02)\nAdjusted, continuing operations, excluding certain items\n$1,825 \n$425 \n23.3\n%\n$1,381 \n$6.06 \n30 \nTable of Contents\nNine Months Ended September 30, 2024\n($ in millions, except percentages and per share amounts)\nIncome Before Income Taxes\nIncome Tax Expense\nEffective Tax Rate\nNet Income (attributable to PPG)\nEarnings Per Diluted Share\n(a)\nAs reported, continuing operations\n$1,771 \n$405 \n22.9\n%\n$1,342 \n$5.70 \nAdjusted for:\nAcquisition-related amortization expense\n100 \n24 \n24.0\n%\n76 \n0.32 \nBusiness restructuring-related costs, net\n(b)\n15 \n5 \n33.3\n%\n10 \n0.04 \nPortfolio optimization\n(c)\n42 \n12 \n28.6\n%\n30 \n0.13 \nLegacy environmental remediation charges \n(e)\n20 \n5 \n24.3\n%\n15 \n0.06 \nAdjusted, continuing operations, excluding certain items\n$1,948 \n$451 \n23.2\n%\n$1,473 \n$6.25 \n(a)\nEarnings per diluted share is calculated based on unrounded numbers. Figures in the table may not recalculate due to rounding.\n(b)\nBusiness restructuring-related costs, net include business restructuring charges, offset by releases related to previously approved programs, which are included in Other charges/(income), net on the condensed consolidated statement of income, accelerated depreciation of certain assets, which is included in Depreciation on the condensed consolidated statement of income and other restructuring-related costs, which are included in Cost of sales, exclusive of depreciation and amortization and Selling, general and administrative on the condensed consolidated statement of income.\n(c)\nPortfolio optimization includes gains and losses on the sale of non-core assets, including net gains in the first and third quarter 2025 and a loss recognized on the sale of the Company’s traffic solutions business in Argentina in the second quarter 2024, which are included in Other charges/(income), net in the condensed consolidated statement of income. Portfolio optimization also includes advisory, legal, accounting, valuation, other professional or consulting fees, and certain internal costs directly incurred to effect acquisitions, as well as similar fees and other costs to effect divestitures and other portfolio optimization exit actions. These costs are included in Selling, general and administrative expense on the condensed consolidated statement of income. There was no tax expense associated with the gains recognized on the sales of non-core assets in the first and third quarter 2025.\n(d)\nIn the third quarter 2025, the Company recorded net impairment and other related charges related to a consolidated joint venture in the Performance Coatings segment, which are included in Other charges/(income), net on the condensed consolidated statement of income. Net loss of $12 million related to the impairment charge was attributable to noncontrolling interests.\n(e)\nLegacy environmental remediation charges represent environmental remediation costs at certain non-operating PPG manufacturing sites. These charges are included in Other charges/(income), net in the condensed consolidated statement of income.\n(f)\nIn the first quarter 2025, the Company received reimbursement under its insurance policies for damages incurred at a southern U.S. factory from a winter storm in 2021.\n31 \nTable of Contents\nPerformance of Reportable Business Segments \nGlobal Architectural Coatings\nThree Months Ended \nSeptember 30\n$ Change\n% Change\nNine Months Ended \nSeptember 30\n$ Change\n% Change\n($ in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\nNet sales\n$1,012 \n$1,004 \n$8 \n0.8 \n%\n$2,887 \n$3,040 \n($153)\n(5.0)\n%\nSegment income\n$184 \n$183 \n$1 \n0.5 \n%\n$462 \n$560 \n($98)\n(17.5)\n%\nDepreciation and amortization expense\n$29 \n$26 \n$3 \n11.5 \n%\n$82 \n$78 \n$4 \n5.1 \n%\nSegment income before interest, taxes, depreciation and amortization (EBITDA)\n$213 \n$209 \n$4 \n1.9 \n%\n$544 \n$638 \n($94)\n(14.7)\n%\nThree Months Ended September 30, 2025\nGlobal Architectural Coatings net sales increased due to the following:\n● Favorable foreign currency translation (+4%)\n● Higher selling prices (+2%)\nPartially offset by:\n● Divestiture-related sales (-3%)\n● Lower sales volumes (-2%)\nArchitectural coatings – EMEA net sales, excluding the impact of currency, acquisitions and divestitures (\"organic sales\") decreased by a low single-digit percentage compared to the prior year quarter with higher selling prices more than offset by lower sales volumes. Overall demand for architectural coatings in Europe was lackluster, with declines primarily in western Europe partially balanced by organic sales growth in eastern Europe.\nArchitectural coatings - Latin America and Asia Pacific organic sales increased by a low single-digit percentage compared to the prior-year quarter driven by organic sales growth in the Latin America region. In Mexico, retail sales volumes were solid during the quarter, reflecting improving consumer demand, while project-related spending remained lower than the prior year stemming from economic uncertainty which has tempered government and business investment. \nSegment income of $184 million was relatively unchanged from the prior year, with higher selling prices, cost-control actions and favorable foreign currency translation offset by the business divestiture and lower sales volumes.\nNine Months Ended September 30, 2025\nGlobal Architectural Coatings net sales decreased due to the following:\n● Divestiture-related sales (-3%)\n● Lower sales volumes (-2%)\n● Unfavorable foreign currency translation (-1%)\nPartially offset by:\n● Higher selling prices (+1%)\nArchitectural coatings – EMEA organic sales decreased by a low single-digit percentage year over year with lower sales volumes, partially offset by higher selling prices. Overall demand for architectural coatings in Europe was lackluster.\nArchitectural coatings - Latin America and Asia Pacific organic sales decreased by a low single-digit percentage year over year with lower sales volumes, partially offset by higher selling prices. \nSegment income was $462 million, a decrease of 18% versus the prior year, driven by lower sales volumes, raw material and other cost inflation, divestitures and the unfavorable impact of foreign currency translation, partially offset by higher selling prices and cost-control actions.\n32 \nTable of Contents\nLooking Ahead\nIn the fourth quarter of 2025, strong retail sales and modest recovery of project-related spending in Mexico is expected while consumer sentiment in Europe is anticipated to remain soft. Quarterly aggregate organic sales for the segment are expected to be in the range of flat to a positive low single-digit percentage compared to the fourth quarter 2024.\nPerformance Coatings\nThree Months Ended \nSeptember 30\n$ Change\n% Change\nNine Months Ended \nSeptember 30\n$ Change\n% Change\n($ in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\nNet sales\n$1,414 \n$1,373 \n$41 \n3.0 \n%\n$4,191 \n$3,975 \n$216 \n5.4 \n%\nSegment income\n$272 \n$306 \n($34)\n(11.1)\n%\n$902 \n$883 \n$19 \n2.2 \n%\nDepreciation and amortization expense\n$35 \n$31 \n$4 \n12.9 \n%\n$101 \n$99 \n$2 \n2.0 \n%\nSegment EBITDA\n$307 \n$337 \n($30)\n(8.9)\n%\n$1,003 \n$982 \n$21 \n2.1 \n%\nThree Months Ended September 30, 2025\nPerformance Coatings net sales increased due to the following:\n● Higher selling prices (+4%)\n● Favorable foreign currency translation (+1%)\nPartially offset by:\n● Lower sales volume (-2%)\nAutomotive refinish coatings organic sales decreased by a double-digit percentage versus the prior year quarter. Results were impacted by lower organic sales in the U.S. as distributors managed their order patterns toward the first half of 2025 to optimize their pricing, with the business delivering flat organic sales in the first half of 2025 in a negative market demand environment. Business demand is being suppressed by lower U.S. collision claims including the effect from significant increases in automotive insurance premiums. However, organic business sales year to date are outperforming the double-digit percentage declines in U.S. collision claims. Increases in insurance premiums were high over the past two years, but the rate of decline in claims is moderating.  \nAerospace coatings organic sales increased by a double-digit percentage compared to the prior-year quarter, led by higher selling prices and sales volumes. Demand remained strong, and customer order backlogs increased, even with improved manufacturing output stemming from growth-related investments. Global international and domestic air travel levels increased year over year, and combined are now above pre-pandemic levels. As demand for PPG's technology-advantaged products grows, the Company remains focused on debottlenecking and further expanding manufacturing capabilities to drive additional sales volume and earnings growth.\nProtective and marine coatings organic sales increased by a double-digit percentage compared to the prior-year quarter driven by higher sales volumes. Increased sales volumes were driven by share gains in both protective and marine, reflecting demand for PPG's sustainably-advantaged products. \nTraffic solutions organic sales increased by a mid-single-digit percentage compared to the prior year quarter driven by strong demand and share gains.\nSegment income was $272 million, a decrease of 11% versus the prior year, primarily due to lower automotive refinish sales volumes, partially offset by higher selling prices.\n33 \nTable of Contents\nNine Months Ended September 30, 2025\nPerformance Coatings net sales increased due to the following:\n● Higher selling prices (+3%)\n● Higher sales volumes (+2%)\nAutomotive refinish coatings organic sales decreased by a mid-single-digit percentage year over year due to lower sales volumes, partially offset by higher selling prices. On a year-to-date basis, the automotive refinish coatings business outperformed lower U.S. industry collision claims.\nAerospace coatings organic sales increased by a double-digit percentage year over year, led by higher selling prices and sales volumes. Demand remained strong, and customer order backlogs increased to approximately $310 million.\nProtective and marine coatings organic sales increased by a double-digit percentage year over year, including higher sales volumes in the United States and the Asia Pacific region. Increased sales volumes were driven by share gains, reflecting demand for PPG's sustainably advantaged products.\nTraffic solutions organic sales increased by a mid-single-digit percentage year over year driven by higher sales volumes, partially offset by lower selling prices. Traffic solutions benefited from strong demand and increased sales volumes across the U.S. and Canada.\nSegment income was $902 million, an increase of 2% versus the prior year, primarily due to higher selling prices, partially offset by lower automotive refinish sales volumes and raw material, wage and other cost inflation.\nLooking Ahead\nContinued strength is anticipated in aerospace coatings as well as protective and marine coatings. While automotive refinish coatings continues to gain share through demand for the Company's bundled coatings and services business model, lower organic sales are anticipated due to lower industry demand and lighter sales volumes stemming from customer order patterns. Traffic solutions is expected to follow typical seasonal trends and is well positioned to continue to benefit in the near term from increased U.S. infrastructure spending.  Fourth quarter organic sales for the segment are anticipated to within the range of down by a low single-digit percentage to flat compared to the fourth quarter 2024.\nIndustrial Coatings\nThree Months Ended \nSeptember 30\n$ Change\n% Change\nNine Months Ended \nSeptember 30\n$ Change\n% Change\n($ in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\n2025 vs. 2024\nNet sales\n$1,656 \n$1,655 \n$1 \n0.1 \n%\n$4,883 \n$5,101 \n($218)\n(4.3)\n%\nSegment income\n$233 \n$200 \n$33 \n16.5 \n%\n$675 \n$708 \n($33)\n(4.7)\n%\nDepreciation and amortization expense\n$48 \n$52 \n($4)\n(7.7)\n%\n$144 \n$157 \n($13)\n(8.3)\n%\nSegment EBITDA\n$281 \n$252 \n$29 \n11.5 \n%\n$819 \n$865 \n($46)\n(5.3)\n%\nThree Months Ended September 30, 2025\nIndustrial Coatings segment net sales were essentially flat due to the following:\n● Higher sales volumes (+4%)\n● Favorable foreign currency translation (\n+\n1%)\nOffset by:\n● Divestiture-related sales (-4%)\n● Lower selling prices (-1%)\nAutomotive OEM coatings organic sales increased by a mid-single-digit percentage due to higher sales volumes, partially offset by lower selling prices. Sales volumes increased in all regions, including share gains in Brazil, and outpaced higher automotive industry production. In China, automotive industry retail sales increased during the third quarter and exports have grown year to date compared to the prior year.\n34 \nTable of Contents\nIn the industrial coatings business, organic sales decreased by a low single-digit percentage compared to the prior- year quarter due to lower sales volumes and lower indexed-based prices. In a challenging macro industrial environment, sales volumes were slightly lower as the business realized the benefit of share gains. Sales volumes were lower mostly in the U.S. and Europe partially offset by improvement in the Asia-Pacific region. Sales in several product categories were above prior-year levels, including solid growth in heavy duty equipment and transportation. The most pronounced weakness was in kitchen and bakeware, consumer electronics, and extrusion. \nPackaging coatings organic sales increased by a double-digit percentage compared to the prior-year quarter with higher sales volumes partially offset by lower index-based prices. Results reflect the positive momentum from share gains in the U.S. and Canada, the Asia Pacific region and Europe, including those in aided by expanding regional regulations. Globally, beverage and food packaging demand is solid, and PPG sales volume growth is outpacing the market. \nSpecialty products organic sales were flat compared to the prior-year quarter with higher sales volumes in Europe offset by lower sales volumes in the United States.\nSegment income was $233 million, an increase of 17% versus the prior year, driven by higher sales volumes, cost-control actions and manufacturing efficiencies, partially offset by lower index-based selling prices and the unfavorable impact of the divestiture of the silicas products business.\nNine Months Ended September 30, 2025\nIndustrial Coatings segment net sales decreased due to the following:\n● Divestiture-related sales (-4%)\n● Lower index-based selling prices (-1%)\nPartially offset by:\n● Higher sales volumes (+1%)\nAutomotive OEM coatings organic sales decreased slightly year over year. Sales volumes decreased in the U.S. and Europe, partially offset by sales volume growth in China and Latin America.\nIn the industrial coatings business, organic sales decreased by a low single-digit percentage year over year, driven by lower index-based prices. Sales volumes increased slightly due to higher sales volumes in Latin America.\nPackaging coatings organic sales increased by a mid-single-digit percentage year over year due to higher sales volumes in all regions, partially offset by lower index-based prices.\nSpecialty products organic sales increased by a low single-digit percentage year over year primarily due to higher sales volumes.\nSegment income was $675 million, a decrease of 5% versus the prior year, primarily due to lower index-based selling prices and the unfavorable impact of the divestiture of the silicas products business, partially offset by higher sales volumes, cost-control actions and manufacturing efficiencies. \nLooking Ahead\nThe Industrial Coatings segment is expected to outperform the market in the fourth quarter, with share gains in automotive OEM, packaging and industrial coatings yielding benefits. As a result, fourth quarter aggregate organic sales for the segment are anticipated to be in the range of flat to a positive low single-digit percentage compared to the fourth quarter 2024.\nTariff Impact and Mitigation\nPPG is impacted by the economic and political conditions in the markets we serve, which includes effects related to the imposition and magnitude of tariffs. The current global macroeconomic environment is highly dynamic, and we continue to monitor changes to tariffs and the corresponding impacts on our business. PPG did not experience a significant decrease in customer demand, significant increase in raw material costs, or other significant adverse impacts related to tariffs during the first nine months of 2025. The Company continues to monitor overall economic demand and customer order patterns and is prepared to take actions intended to mitigate adverse impacts, as necessary, through supply chain contingency plans, pricing actions, and/or cost reduction actions.\n35 \nTable of Contents\nLiquidity and Capital Resources\nPPG had cash and short-term investments totaling $1.9 billion and $1.4 billion at September 30, 2025 and December 31, 2024, respectively.\nThe Company continues to believe that cash on hand and short-term investments, cash from operations and the Company's ability to access the capital markets will be sufficient to fund our operating activities, capital spending, acquisitions, dividend payments, debt service, share repurchases, contributions to pension plans and contractual obligations.\nCash from operating activities - continuing operations\nCash from operating activities - continuing operations for the nine months ended September 30, 2025 and 2024 was $1,047 million and $1,056 million, respectively. The $9 million decrease was primarily due to lower income from continuing operations offset by lower cash tax payments compared to the prior year.\nOperating Working Capital\nOperating working capital is a subset of total working capital and represents (1) trade receivables – net of the allowance for doubtful accounts (2) FIFO inventories and (3) trade liabilities. We believe operating working capital represents the key components of working capital under the operating control of our businesses. A key metric we use to measure our working capital management is operating working capital as a percentage of sales (current quarter sales annualized).\n($ in millions, except percentages)\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nTrade receivables, net\n$3,137 \n$2,477 \n$2,895 \nInventories, FIFO\n2,363 \n2,015 \n2,221 \nTrade creditors’ liabilities\n2,298 \n2,161 \n2,336 \nOperating working capital\n$3,202 \n$2,331 \n$2,780 \nOperating working capital as a % of sales\n19.6\n%\n15.6\n%\n17.2\n%\nDays sales outstanding\n63 \n51 \n59 \nEnvironmental\nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n($ in millions)\n2025\n2024\n2025\n2024\nCash outlays for environmental remediation activities\n$8 \n$6 \n$18 \n$19 \n($ in millions)\nRemainder of \n2025\nAnnually \n2026 - 2029\nProjected future cash outlays for environmental remediation activities\n$10 - $25\n$20 - $60\nCash used for investing activities - continuing operations\nCash used for investing activities - continuing operations for the nine months ended September 30, 2025 and 2024 was $417 million and $501 million, respectively. The $84 million decrease in cash used for investing activities was primarily due to lower capital expenditures compared to the prior year.\nTotal capital spending is expected to be approximately $725 million to $775 million in 2025 in support of future organic growth opportunities.\nCash used for financing activities - continuing operations\nCash used for financing activities - continuing operations for the nine months ended September 30, 2025 and 2024 was $269 million and $617 million, respectively. The $348 million decrease in cash used for financing activities was \n36 \nTable of Contents\nprimarily due to the proceeds from the issuance of long-term debt, partially offset by higher purchases of treasury stock.\nCredit Agreements\nIn April 2023, PPG entered into a €500 million term loan credit agreement (the \"Term Loan\"). The Term Loan contains covenants that are consistent with those in the Credit Agreement discussed below and that are usual and customary restrictive covenants for facilities of its type, which include, with specified exceptions, limitations on the Company’s ability to create liens or other encumbrances, to enter into sale and leaseback transactions and to enter into consolidations, mergers or transfers of all or substantially all of its assets. In April 2023, PPG borrowed €500 million under the Term Loan. In December 2023, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €250 million. In January 2024, PPG borrowed the additional €250 million. In December 2024, PPG obtained lender commitments sufficient to increase the size of the Term Loan by €300 million. In January 2025, PPG borrowed the additional  €300 million. \nIn July 2023, PPG amended and restated its five-year credit agreement (the \"Credit Agreement\") dated as of August 30, 2019, extending the term through July 2028. In October 2025, PPG amended the Credit Agreement to extend its maturity as to certain commitments. The amended Credit Agreement provides for a $2.3 billion unsecured revolving credit facility, of which $2,148 million of the total commitment has a term through July 2029 and $152 million of the total commitment has a term through July 2028. The Company has the ability to increase the size of the Credit Agreement by up to an additional $750 million, subject to the receipt of lender commitments and other conditions precedent. The Company has the right, subject to certain conditions set forth in the Credit Agreement, to designate certain subsidiaries of the Company as borrowers under the Credit Agreement. In connection with any such designation, the Company is required to guarantee the obligations of any such subsidiaries under the Credit Agreement. There were no amounts outstanding under the Credit Agreement as of September 30, 2025 and December 31, 2024.\nThe Term Loan and the Credit Agreement require the Company to maintain a ratio of Total Indebtedness to Total Capitalization, as defined in the Term Loan and the Credit Agreement, of 60% or less; provided, that for any fiscal quarter in which the Company has made an acquisition for consideration in excess of $1 billion and for the next five fiscal quarters thereafter, the ratio of Total Indebtedness to Total Capitalization may not exceed 65% at any time. As of September 30, 2025, Total Indebtedness to Total Capitalization as defined under the Credit Agreement was 47%.\nThe Credit Agreement also supports the Company’s commercial paper borrowings which are classified as long-term based on PPG’s intent and ability to refinance these borrowings on a long-term basis. There were no commercial paper borrowings outstanding as of  September 30, 2025 and December 31, 2024.\nOther Debt Issued and Repaid\nIn March 2025, PPG completed a public offering of €900 million 3.250% Notes due 2032. Refer to Note 7, “Borrowings” in Part I, Item 1 of this Form 10-Q for additional information.\nIn June 2025, PPG's €300 million 1.875% notes matured, and the Company repaid this obligation using cash on hand.\nOther Liquidity Information\nRestructuring\nAggregate restructuring savings were approximately $20 million in the third quarter 2025. Total restructuring savings are expected to be approximately $75 million in 2025. In addition, the Company continues to review its cost structure to identify additional cost savings opportunities. Refer to Note 6, “Business Restructuring” in Part I, Item 1 of this Form 10-Q for further details on the Company's business restructuring programs. We expect cash outlays related to restructuring actions of approximately $80 million to $100 million in 2025.\nCurrency\nComparing spot exchange rates at September 30, 2025 and at December 31, 2024, the U.S. dollar weakened against the currencies of many countries within the regions PPG operates, most notably the Mexican peso and the euro. As a result, consolidated net assets at September 30, 2025 increased by $849 million compared to December 31, 2024.\nComparing average exchange rates during the first nine months of 2025 to those of the first nine months of 2024, the U.S. dollar strengthened against the currencies of many countries where PPG operates, including the Mexican peso. This had an unfavorable impact on Income before income taxes for the nine months ended September 30, 2025 of $19 million from the translation of these foreign earnings into U.S. dollars.\n37 \nTable of Contents\nNew Accounting Standards\nRefer to Note 2, “New Accounting Standards” in Part I, Item 1 of this Form 10-Q for further details on recently issued accounting guidance.\nCommitments and Contingent Liabilities, including Environmental Matters\nPPG is involved in a number of lawsuits and claims, both actual and potential, including some that it has asserted against others, in which substantial monetary damages are sought. See Part II, Item 1, “Legal Proceedings” of this Form 10-Q and Note 14, “Commitments and Contingent Liabilities” in Part I, Item 1 of this Form 10-Q for a description of certain of these lawsuits.\nAs discussed in Part II, Item 1 and Note 14, although the result of any future litigation of such lawsuits and claims is inherently unpredictable, management believes that, in the aggregate, the outcome of all lawsuits and claims involving PPG, including asbestos-related claims, will not have a material effect on PPG’s consolidated financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized.\nAs also discussed in Note 14, PPG has significant reserves for environmental contingencies. Refer to the Environmental Matters section of Note 14 for details of these reserves. It is PPG’s policy to accrue expenses for contingencies when it is probable that a liability has been incurred and the amount of loss can be reasonably estimated. Reserves for environmental contingencies are exclusive of claims against third parties and are generally not discounted. In management’s opinion, the Company operates in an environmentally sound manner and the outcome of the Company’s environmental contingencies will not have a material effect on PPG’s financial position or liquidity; however, any such outcome may be material to the results of operations of any particular period in which costs, if any, are recognized. Management anticipates that the resolution of the Company’s environmental contingencies will occur over an extended period of time.\nCritical Accounting Estimates\nManagement has evaluated the accounting policies used in the preparation of the financial statements and related notes presented in this Form 10-Q and believes those policies to be reasonable and appropriate. We believe that the most critical accounting estimates made in the preparation of our financial statements are those related to accounting for contingencies, under which we accrue a loss when it is probable that a liability has been incurred and the amount can be reasonably estimated, and to accounting for pensions, other postretirement benefits, business combinations, goodwill and other identifiable intangible assets with indefinite lives because of the importance of management judgment in making the estimates necessary to apply these policies.\nFor a comprehensive discussion of the Company’s critical accounting estimates, see Item 7, \"Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K. There were no material changes in the Company’s critical accounting estimates from the 2024 Form 10-K.\nForward-Looking Statements\nManagement’s Discussion and Analysis and other sections of this Quarterly Report contain forward-looking statements that reflect the Company’s current views with respect to future events and financial performance. You can identify forward-looking statements by the fact that they do not relate strictly to current or historic facts. Forward-looking statements are identified by the use of the words “aim,” “believe,” “expect,” “anticipate,” “intend,” “estimate,” “project,” “outlook,” “forecast” and other expressions that indicate future events and trends. Any forward-looking statement speaks only as of the date on which such statement is made, and the Company undertakes no obligation to update any forward-looking statement, whether as a result of new information, future events or otherwise. You are advised, however, to consult any further disclosures we make on related subjects in our reports to the SEC. Also, note the following cautionary statements.\nMany factors could cause actual results to differ materially from the Company’s forward-looking statements. Such factors include statements related to earnings guidance, global economic conditions, geopolitical issues, increasing price and product competition by our competitors, fluctuations in cost and availability of raw materials, energy, labor and logistics, the ability to achieve selling price increases, margins, share gains, customer inventory levels, PPG inventory levels, our ability to maintain favorable supplier relationships and arrangements, the timing of and the realization of anticipated cost savings from restructuring initiatives, the ability to identify additional cost savings opportunities, the timing and expected benefits of our acquisitions, difficulties in integrating acquired businesses and achieving expected synergies therefrom, the amount of future share repurchases, economic and political conditions in the markets we serve, the imposition and magnitude of tariffs, the ability to penetrate existing, developing and emerging foreign and domestic markets, foreign exchange rates and fluctuations in such rates, fluctuations in tax \n38 \nTable of Contents\nrates, the impact of future legislation, the impact of environmental regulations, unexpected business disruptions, cybersecurity events, global human health issues, the unpredictability of existing and possible future litigation, including asbestos litigation, and government investigations. However, it is not possible to predict or identify all such factors.\nConsequently, while the list of factors presented here and in the 2024 Form 10-K under Item 1A is considered representative, no such list should be considered to be a complete statement of all potential risks and uncertainties. Unlisted factors may present significant additional obstacles to the realization of forward-looking statements.\nConsequences of material differences in the results compared with those anticipated in the forward-looking statements could include, among other things, lower sales or income, business disruption, operational problems, financial loss, legal liability to third parties, other factors set forth in Item 1A of the 2024 Form 10-K and similar risks, any of which could have a material adverse effect on the Company’s consolidated financial condition, results of operations or liquidity."
}