{
  "item1": "PPG Industries, Inc. manufactures distributes broad range paints, coatings specialty products. PPG incorporated Pennsylvania 1883. PPG’s vision first-choice partner meet customers’ evolving needs innovative paints, coatings surface solutions protect beautify world.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations following discussion includes comparison results operations liquidity capital resources years ended December 31, 2024, 2023 2022. Company’s financial results been recast present results architectural coatings business U.S. Canada discontinued operations all periods presented.",
  "item2": "Item 2. Management’s Discussion Analysis Financial Condition Results Operations Net sales approximately $4.1 billion three months ended September 30, 2025, increase 1% compared prior year primarily due higher selling prices, higher sales volumes favorable impact foreign currency translation, partially offset divestiture silicas products business architectural coatings business Russia. Income before income taxes $556 million three months ended September 30, 2025, decrease $22 million compared prior year, primarily due unfavorable impact wage other cost inflation, divestitures higher other charges/(income), partially offset increased manufacturing productivity cost-control measures. Results Operations ($ millions, except percentages) Cost sales, exclusive depreciation amortization Selling, general administrative Research development, net Other charges/(income), net N/A ($ millions, except percentages) United States Canada EMEA Three Months Ended September 30, 2025 Net sales increased $50 million due following: ● Favorable foreign currency translation ● Higher selling prices (+1%) ● Higher sales volumes (+1%) Partially offset by: ● Divestiture-related sales (-3%) Cost sales, exclusive depreciation amortization, increased $45 million primarily due higher sales volumes unfavorable impact foreign currency translation, partially offset divestitures."
}