{
  "source_file": "ppl-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\n \nGeneral\n \n(All Registrants)\n \nPPL, headquartered in Allentown, Pennsylvania, is a utility holding company, incorporated in 1994. PPL, through its regulated utility subsidiaries, delivers electricity to customers in Pennsylvania, Kentucky, Virginia, and Rhode Island; delivers natural gas to customers in Kentucky and Rhode Island; and generates electricity from power plants in Kentucky.\n \nPPL's principal subsidiaries at December 31, 2024 are shown below (* denotes a Registrant).\n \n \n \n \n \n \nPPL Corporation*\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPPL Capital Funding\nProvides financing for the operations of PPL and certain subsidiaries\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPPL Electric*\nEngages in the regulated transmission and distribution of electricity in Pennsylvania\n \n \nLKE\nA holding company that owns regulated utility operations through its subsidiaries, LG&E and KU\n \n \nRIE\nEngages in the regulated transmission, distribution and sale of electricity and regulated distribution and sale of natural gas in Rhode Island\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nLG&E*\nEngages in the regulated generation, transmission, distribution and sale of electricity and regulated distribution and sale of natural gas in Kentucky\nKU*\nEngages in the regulated generation, transmission, distribution and sale of electricity, primarily in Kentucky\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPennsylvania\nRegulated Segment\n \nKentucky\nRegulated Segment\n \nRhode Island\nRegulated Segment\n \nIn addition to PPL, the other Registrants included in this filing are as follows.\n \nPPL Electric\n, headquartered in Allentown, Pennsylvania, is a wholly-owned subsidiary of PPL and a regulated public utility that is an electricity transmission and distribution service provider in eastern and central Pennsylvania. PPL Electric is subject to regulation as a public utility by the PAPUC, and certain of its transmission activities are subject to the jurisdiction of the FERC under the Federal Power Act. PPL Electric delivers electricity in its Pennsylvania service area and provides electricity supply to retail customers in that area as a PLR under the Customer Choice Act. PPL Electric was organized in 1920 as Pennsylvania Power & Light Company.\n \nLG&E,\n headquartered in Louisville, Kentucky, is a wholly-owned subsidiary of LKE and a regulated utility engaged in the generation, transmission, distribution and sale of electricity and distribution and sale of natural gas in Kentucky. LG&E is subject to regulation as a public utility by the KPSC, and certain of its transmission activities are subject to the jurisdiction of the FERC under the Federal Power Act. LG&E was incorporated in 1913.\nKU,\n headquartered in Lexington, Kentucky, is a wholly-owned subsidiary of LKE and a regulated utility engaged in the generation, transmission, distribution and sale of electricity in Kentucky and Virginia. KU is subject to regulation as a public utility by the KPSC and the VSCC, and certain of its transmission and wholesale power activities are subject to the jurisdiction \n3\n \nTable of Contents\nof the FERC under the Federal Power Act. KU serves its Kentucky customers under the KU name and its Virginia customers under the Old Dominion Power name. KU was incorporated in Kentucky in 1912 and in Virginia in 1991.\n \nSegment Information\n \n(PPL)\n \nPPL is organized into three reportable segments as depicted in the chart above: Kentucky Regulated, which primarily represents the results of LG&E and KU, Pennsylvania Regulated, which primarily represents the results of PPL Electric, and Rhode Island Regulated, which primarily represents the results of RIE. \"Corporate and Other\" primarily includes corporate level financing costs, certain unallocated corporate costs, and certain non-recoverable costs incurred in conjunction with the acquisition of Rhode Island Energy and the financial results of Safari Energy, prior to its sale on November 1, 2022.\nA comparison of PPL's Regulated segments is shown below.\nKentucky\nPennsylvania\nRhode Island\nRegulated\nRegulated\nRegulated\nFor the year ended December 31, 2024:\n \n \nOperating Revenues (in billions)\n$\n3.6 \n$\n2.9 \n$\n2.0 \nNet Income (in millions) \n$\n620 \n$\n574 \n$\n109 \nElectricity delivered (GWh) \n30,109 \n36,611 \n7,371 \nNatural gas delivered (Bcf) \n42 \n— \n37 \nAt December 31, 2024:\n \n \nRegulatory Asset Base (in billions) (a) \n$\n12.4 \n$\n10.2 \n$\n3.8 \nService area (in square miles)\n8,000 \n10,000 \n1,200 \nCustomers (in millions) \n1.4 \n1.5 \n0.8 \n(a)\nRepresents capitalization for Kentucky Regulated and rate base for Pennsylvania Regulated and Rhode Island Regulated. The amount for Rhode Island Regulated excludes acquisition-related adjustments for non-earning assets.\n \nSee Note 2 to the Financial Statements for additional financial information by segment. See Note 3 to the Financial Statements for additional revenue information. \n(PPL Electric, LG&E and KU)\nPPL Electric has two operating segments, distribution and transmission, which are aggregated into a single reportable segment. Each of LG&E and KU operates as a single operating and reportable segment.\nKentucky Regulated Segment\n \n(PPL)\nThe Kentucky Regulated segment consists primarily of the regulated electricity generation, transmission and distribution operations conducted by LG&E and KU, as well as LG&E's regulated distribution and sale of natural gas. \n(PPL, LG&E and KU)\n \nLG&E and KU are engaged in the regulated generation, transmission, distribution and sale of electricity in Kentucky and, in KU's case, also Virginia. LG&E also engages in the distribution and sale of natural gas in Kentucky. LG&E provides electric service to approximately 440,000 customers in Louisville and adjacent areas in Kentucky, covering approximately 700 square miles in nine counties and provides natural gas service to approximately 336,000 customers in its electric service area and eight additional counties in Kentucky. KU provides electric service to approximately 549,000 customers in 77 counties in central, southeastern and western Kentucky and approximately 28,000 customers in five counties in southwestern Virginia, covering approximately 4,800 non-contiguous square miles. KU also sells wholesale electricity to two municipalities in Kentucky under load following contracts.\nFranchises and Licenses\n \nLG&E and KU provide electricity delivery service, and LG&E provides natural gas distribution service, in their respective service territories pursuant to certain franchises, licenses, statutory service areas, easements and other rights or permissions granted by state legislatures, cities or municipalities or other entities. \n \n4\n \nTable of Contents\nCompetition\nThere are currently no other electric public utilities operating within the electric service areas of LG&E and KU. From time to time, bills are introduced into the Kentucky General Assembly which seek to authorize, promote or mandate increased distributed generation, customer choice or other developments. Neither the Kentucky General Assembly nor the KPSC has adopted or approved a plan or timetable for retail electric industry competition in Kentucky. The nature or timing of legislative or regulatory actions, if any, regarding industry restructuring and their impact on LG&E and KU, which may be significant, cannot currently be predicted. Virginia, formerly a deregulated jurisdiction, has enacted legislation that implemented a hybrid model of cost-based regulation. KU's operations in Virginia have been and remain regulated. \n \nAlternative energy sources such as electricity, oil, propane and other fuels indirectly impact LG&E's natural gas revenues. Marketers may also compete to sell natural gas to certain large end-users. LG&E's natural gas tariffs include gas price pass-through mechanisms relating to its sale of natural gas as a commodity. Therefore, customer natural gas purchases from alternative suppliers do not generally impact LG&E's profitability. Some large industrial and commercial customers, however, may physically bypass LG&E's facilities and seek delivery service directly from interstate pipelines or other natural gas distribution systems.\nPower Supply\n \nAt December 31, 2024, LG&E owned generating capacity of 2,466 MW and KU owned generating capacity of 4,798 MW. See \"Item 2. Properties - Kentucky Regulated Segment\" for a complete list of generating facilities.\n \nThe system capacity of LG&E's and KU's owned generation is based upon several factors, including the operating experience and physical condition of the units, and may be revised periodically to reflect changes in circumstances.\n \nDuring 2024, LG&E's and KU's power plants generated the following amounts of electricity:\nGWh\nFuel Source\nLG&E\nKU\nCoal\n10,046 \n14,276 \nGas\n1,586 \n4,483 \nHydro\n235 \n54 \nSolar\n8 \n12 \nTotal (a)\n11,875 \n18,825 \n(a)\nThis generation represents a decrease for LG&E of 1% and an increase for KU of 8% from 2023 output.\nThe majority of LG&E's and KU's generated electricity was used to supply their retail customer bases.\n \nLG&E and KU jointly dispatch their generation units with the lowest cost generation used to serve their customers. When LG&E has excess generation capacity after serving its own customers and its generation cost is lower than that of KU, KU purchases electricity from LG&E and vice versa.\n \nDue to environmental requirements and energy efficiency measures, as of December 31, 2024, LG&E and KU have retired approximately 1,500 MW of coal-fired generation plants since 2010, including the retirement of a 300 MW coal-fired unit in December 2024 at the Mill Creek plant.\n \nLG&E and KU received approval from the KPSC to develop a 4 MW Solar Share facility to service a Solar Share program. The Solar Share program is a voluntary program that allows customers to subscribe capacity in the Solar Share facility. Construction commences, in 500-kilowatt phases, when subscription is complete. Construction of five 500-kilowatt phases was completed as of December 31, 2022. LG&E and KU continue to market the program and are accepting subscriptions for the sixth 500-kilowatt phase.\nOn November 6, 2023, the KPSC issued an order approving LG&E’s and KU’s December 15, 2022 CPCN requests (i) to construct a 640 MW net summer rating NGCC combustion turbine at LG&E's Mill Creek Generating Station in Jefferson County, Kentucky, (ii) to construct a 120 MWac solar photovoltaic electric generating facility in Mercer County, Kentucky, (iii) to acquire a 120 MWac solar facility to be built by a third-party solar developer in Marion County, Kentucky and (iv) to construct a 125 MW, 4-hour battery energy storage system facility at KU's E.W. Brown Generating Station. The order also authorized LG&E's and KU's entry into four potential solar PPAs, subject to certain conditions, but deferred for future proceedings specific decisions on cost recovery treatment or mechanisms. Agreements related to two of the four potential solar \n5\n \nTable of Contents\nPPAs have been terminated. One PPA agreement was terminated by the developer due to land control issues. The second agreement terminated contractually due to a PPA price increase that was not acceptable to LG&E and KU. Further, the order approved the new, adjusted or expanded energy efficiency programs contained in the requested 2024-2030 DSM plan.\nThe KPSC order included approval of the requested retirements of two existing coal-fired generation units at LG&E's Mill Creek Unit 1 (300 MW) in 2024\n,\n which occurred on December 31, 2024, and Mill Creek Unit 2 (297 MW) in \n2027, subject to certain conditions, and three small gas-fired units. The order denied approval of the retirement of \nKU's E.W. Brown 3 Unit (412 MW) and Ghent Unit 2 (486 MW) in \n2028 at this time, citing the need for additional clarity regarding environmental compliance regulations.\nThe new NGCC facility will be jointly owned by LG&E (31%) and KU (69%) and the solar units will be jointly owned by LG&E (37%) and KU (63%), the battery storage unit will be owned by LG&E, and the proposed PPA transactions and DSM programs will be entered into or conducted jointly by LG&E and KU, consistent with LG&E and KU's shared dispatch, cost allocation, tariff or other frameworks.\nIn February 2024, LG&E and KU entered into agreements to begin construction of Mill Creek Unit 5. Total project costs are estimated at approximately $1.0 billion, including AFUDC. Commercial operation of the facility is anticipated to begin in mid-2027.\nFuel Supply\n \nCoal and natural gas are expected to be the predominant fuels used by LG&E and KU for generation for the foreseeable future. Natural gas used for generation is purchased using contractual arrangements separate from LG&E's natural gas distribution operations. Natural gas and oil are also used for intermediate and peaking capacity and flame stabilization in coal-fired boilers.\n \nFuel inventory is maintained at levels estimated to be necessary to avoid operational disruptions at coal-fired generating units. Reliability of coal deliveries can be affected from time to time by several factors including fluctuations in demand, coal mine production issues, high or low river level events, lock outages and other supplier or transporter operating or financial difficulties.\n \nLG&E and KU have entered into coal supply agreements with various suppliers for coal deliveries through 2030 and augment their coal supply agreements with spot market purchases, as needed.\n \nFor their existing units, LG&E and KU expect, for the foreseeable future, to purchase most of their coal from western Kentucky, southern Indiana, southern Illinois, northern West Virginia and western Pennsylvania. LG&E and KU continue to purchase certain quantities of ultra-low sulfur content coal from Wyoming for blending at Trimble County Unit 2. Coal is delivered to the generating plants primarily by barge and rail.\n \nTo enhance the reliability of natural gas supply, LG&E and KU have secured firm long-term pipeline transport capacity services with contracts of various durations through 2056 on the interstate pipeline serving Cane Run Unit 7, six simple cycle combustion turbines at the Trimble County site, and the future Mill Creek Unit 5. This pipeline also serves the two simple cycle units at the Paddy's Run site. For the seven simple cycle combustion turbines at the E.W. Brown facility, no firm long-term pipeline transport capacity has been purchased due to the facility's connection to two interstate pipelines and some of the units having dual fuel capability.\n \nLG&E and KU have firm contracts for a portion of the natural gas fuel for Cane Run Unit 7 through 2026. The bulk of the natural gas fuel is expected to be purchased on the spot market. \n(PPL and LG&E)\nNatural Gas Distribution Supply\n \nFour underground natural gas storage fields in service, with a current working natural gas capacity of approximately 11 Bcf, are used to provide natural gas service to LG&E's firm sales customers. Natural gas is stored during the summer season for withdrawal during the following winter heating season. Without this storage capacity, LG&E would need to purchase additional natural gas and pipeline transportation services during winter months when customer demand increases, and the cost of natural gas supply and pipeline transportation services are expected to be higher. At December 31, 2024, LG&E had 9 Bcf of natural \n6\n \nTable of Contents\ngas stored underground with a carrying value of $29 million.\n \nIn 2024, LG&E completed the multi-year project to retire a fifth underground natural gas storage field, which was no longer in service. \nLG&E has a portfolio of supply arrangements of varying terms that provide competitively priced natural gas designed to meet its firm sales obligations. These natural gas supply arrangements include pricing provisions that are market-responsive. In tandem with pipeline transportation services, these natural gas supplies provide the reliability and flexibility necessary to serve LG&E's natural gas customers.\n \nLG&E purchases natural gas supply transportation services from two pipelines. LG&E has a set of contracts with one pipeline that are subject to termination by LG&E between 2026 and 2030. Total winter season capacity under these contracts is 184,900 MMBtu/day and summer season capacity is 60,000 MMBtu/day. LG&E has two additional contracts with this same pipeline. One contract is for pipeline capacity through 2026 for 60,000 MMBtu/day during both the winter and summer seasons. The other contract is for pipeline capacity through 2028 for 30,000 MMBtu/day during the winter season. LG&E has a single contract with a second pipeline with a total capacity of 20,000 MMBtu/day during both the winter and summer seasons that expires in 2030. \n \nLG&E expects to purchase natural gas supplies for its gas distribution operations from onshore producing regions in South Texas, East Texas, North Louisiana and Arkansas, as well as gas originating in the Marcellus and Utica production areas.\n \n(PPL, LG&E and KU)\nTransmission\nLG&E and KU contract with the Tennessee Valley Authority to act as their transmission reliability coordinator and contract with TranServ International, Inc. to act as their independent transmission organization.\n \nRates\n \nLG&E is subject to the jurisdiction of the KPSC and the FERC, and KU is subject to the jurisdiction of the KPSC, the VSCC and the FERC. LG&E and KU operate under a FERC-approved open access transmission tariff.\n \nLG&E's and KU's Kentucky base rates are calculated based on a return on capitalization (common equity, long-term debt and short-term debt) including adjustments for certain net investments and costs recovered separately through other means. As such, LG&E and KU generally earn a return on regulatory assets in Kentucky.\nKU's Virginia base rates are calculated based on a return on rate base (net utility plant plus certain regulatory assets and working capital less accumulated deferred income taxes, certain regulatory liabilities and miscellaneous deductions) and include recovery of applicable operations and maintenance expenses. \n \nKU's rates to two municipal customers for wholesale power requirements are calculated based on annual updates to a formula rate that utilizes a return on rate base (net utility plant plus certain regulatory assets and working capital less accumulated deferred income taxes, certain regulatory liabilities and miscellaneous deductions) and include recovery of applicable operations and maintenance expenses.\nSee \"Financial and Operational Developments\" in \"Item 7. Combined Management's Discussion and Analysis of Financial Condition and Results of Operations\" and Note 7 to the Financial Statements for additional information on current rate proceedings and rate mechanisms.\nPennsylvania Regulated Segment\n \n(PPL)\nThe Pennsylvania Regulated segment consists of PPL Electric, a regulated public utility engaged in the distribution and transmission of electricity.\n(PPL and PPL Electric)\nPPL Electric delivers electricity to approximately 1.5 million customers in a 10,000-square mile territory in 29 counties within eastern and central Pennsylvania. PPL Electric also provides electricity to retail customers in this territory as a PLR under the Customer Choice Act. \n7\n \nTable of Contents\nFranchises and Licenses\nPPL Electric provides electricity delivery service in its service territory pursuant to certain franchises, licenses, statutory service areas, easements and other rights or permissions granted by the Pennsylvania state legislature, cities or municipalities or other entities. \nCompetition\nPursuant to authorizations from the Commonwealth of Pennsylvania and the PAPUC, PPL Electric operates a regulated distribution monopoly in its service area. Accordingly, PPL Electric does not face competition in its electricity distribution business. Pursuant to the Customer Choice Act, generation of electricity is a competitive business in Pennsylvania, and PPL Electric does not own or operate any generation facilities.\nThe PPL Electric transmission business, operating under a FERC-approved PJM Open Access Transmission Tariff, is subject to competition pursuant to FERC Order 1000 from entities that are not incumbent PJM transmission owners with respect to the construction and ownership of transmission facilities within PJM.\nRates and Regulation\nTransmission\nPPL Electric's transmission facilities are within PJM, which operates the electricity transmission network and electric energy market in the Mid-Atlantic and Midwest regions of the U.S.\nPJM serves as a FERC-approved Regional Transmission Operator (RTO) to promote greater participation and competition in the region it serves. In addition to operating the electricity transmission network, PJM also administers regional markets for energy, capacity and ancillary services. A primary objective of any RTO is to separate the operation of, and access to, the transmission grid from market participants that buy or sell electricity in the same markets. Electric utilities continue to own the transmission assets and to receive their share of transmission revenues, but the RTO directs the control and operation of the transmission facilities. Certain types of transmission investments are subject to competitive processes outlined in the PJM tariff.\nPPL Electric's transmission revenues are billed in accordance with a FERC-approved Open Access Transmission Tariff that utilizes a formula-based rate recovery mechanism. Under this formula, beginning in 2023, rates are put into effect on January 1st of each year based upon actual expenditures from the most recently filed FERC Form 1, forecasted capital additions, and other data based on PPL Electric’s books and records. 2023 was considered a transitional period as the calendar year rate approved by FERC became effective April 1, 2023. Rates are compared during the year to the estimated annual expenses and capital additions that will be filed in PPL Electric’s annual FERC Form 1, filed under the FERC's Uniform System of Accounts. Under the mechanism, any difference between the revenue requirement in effect and actual expenditures incurred for that year is recorded as a regulatory asset or regulatory liability, and the regulatory asset or regulatory liability is to be recovered from or returned to customers starting one year after the conclusion of the rate year.\nAs a PLR, PPL Electric also purchases transmission services from PJM. See \"PLR\" below.\nSee Note 7 to the Financial Statements for additional information on rate mechanisms and regulatory matters.\nDistribution\nPPL Electric's distribution base rates are calculated based on a return on rate base (net utility plant plus a cash working capital allowance less plant-related deferred taxes and other miscellaneous additions and deductions). All regulatory assets and liabilities, except accumulated deferred income taxes, are excluded from the return on rate base. Therefore, no return is earned on the related assets unless specifically provided for by the PAPUC. Currently, PPL Electric's Smart Meter rider and the DSIC are the only riders authorized to earn a return. Certain operating expenses are also included in PPL Electric's distribution base rates including wages and benefits, other operation and maintenance expenses, depreciation and taxes.\nPennsylvania's Alternative Energy Portfolio Standard (AEPS) requires electric distribution companies and electricity generation suppliers to obtain from alternative energy resources a portion of the electricity sold to retail customers in Pennsylvania. Under the default service procurement plans approved by the PAPUC, PPL Electric purchases all of the alternative energy generation supply it needs to comply with the AEPS.\n8\n \nTable of Contents\nAct 129 created an energy efficiency and conservation program, a demand side management program, smart metering technology requirements, new PLR generation supply procurement rules, remedies for market misconduct and changes to the existing AEPS.\nAct 11 authorizes the PAPUC to approve two specific ratemaking mechanisms: the use of a fully projected future test year in base rate proceedings and, subject to certain conditions, the use of a DSIC. Such alternative ratemaking procedures and mechanisms provide opportunity for accelerated cost-recovery and, therefore, are important to PPL Electric as it is in a period of significant capital investment to maintain and enhance the reliability of its delivery system, including the replacement of aging assets. PPL Electric utilized the fully projected future test year mechanism in its 2015 base rate proceeding. PPL has had the ability to utilize the DSIC recovery mechanism since July 2013.\nSee Note 7 to the Financial Statements for additional information on rate mechanisms and legislative and regulatory matters.\nPLR \nThe Customer Choice Act requires electric distribution companies, including PPL Electric, or an alternative supplier approved by the PAPUC, to act as a PLR of electricity supply for customers who do not choose to shop for supply with a competitive supplier and provides that electricity supply costs will be recovered by the PLR pursuant to PAPUC regulations. In 2024, the following average percentages of PPL Electric's customer load were provided by competitive suppliers: 43% of residential, 82% of small commercial and industrial and 98% of large commercial and industrial customers.\n \nPPL Electric’s electricity generation costs are established based upon the results of a competitive solicitation process. In December 2020, the PAPUC approved PPL Electric’s default service plan for the period June 1, 2021 through May 31, 2025, which included a total of eight solicitations for electricity supply held semiannually in April and October. Through December 31, 2024, all auctions of the plan were completed. This plan also included eight solicitations for alternative energy credits held semiannually in January and July. Through January 2025, all alternative energy credit solicitations have been completed.\nOn November 7, 2024, the PAPUC approved PPL Electric's default service plan for the period of June 1, 2025 through May 31, 2029, which includes a total of eight solicitations for electricity supply held semiannually in February and July. The new plan also includes solicitations for alternative energy credits held annually in July with the first solicitation in July 2025 and the final solicitation in July 2029. \nPursuant to the plans, PPL Electric contracts for all electricity supply for residential, commercial and industrial customers who elect to take default service from PPL Electric. These solicitations contain a mix of products including 10-year block energy contracts for residential customers, 12- and 24-month fixed-price load-following contracts for residential and small commercial and industrial customers, 12-month real-time pricing contracts for large commercial and industrial customers, and alternative energy credit contracts for residential, commercial and industrial customers. These contracts fulfill PPL Electric's obligation to provide customer electricity supply as a PLR.\nNumerous alternative suppliers have offered to provide generation supply in PPL Electric's service area. As the cost of generation supply is a pass-through cost for PPL Electric, its financial results are not impacted if its customers purchase electricity supply from these alternative suppliers.\nRhode Island Regulated Segment \n(PPL)\nThe Rhode Island Regulated segment consists primarily of the regulated electricity transmission and distribution operations and regulated distribution and sale of natural gas conducted by RIE.\nRIE is engaged in the regulated transmission, distribution and sale of electricity and regulated distribution and sale of natural gas in Rhode Island. RIE provides electric service to approximately 515,000 customers and natural gas service to approximately 280,000 customers. RIE's service area covers substantially all of Rhode Island. \nFranchises and Licenses\nRIE provides electricity delivery service and natural gas distribution service in its service territory pursuant to certain franchises, licenses, statutory service areas, easements and other rights or permissions granted by the Rhode Island state legislature, cities or municipalities or other entities. \n9\n \nTable of Contents\nCompetition\n \nThere are currently no other electric or gas public utilities operating within the service area of RIE. \nAlternative energy sources such as electricity, oil, propane and other fuels indirectly impact RIE's natural gas revenues. Marketers may also compete to sell natural gas to certain large end-users. RIE's natural gas tariffs include gas price pass-through mechanisms relating to its sale of natural gas as a commodity. Therefore, customer natural gas purchases from alternative suppliers do not generally impact RIE's profitability. Some large industrial and commercial customers, however, may physically bypass RIE's facilities and seek delivery service directly from interstate pipelines or other natural gas distribution systems.\nRates and Regulation\nIn general, RIE operates subject to the jurisdiction of the FERC, the RIPUC and the Rhode Island Division of Public Utilities and Carriers. \nDistribution\nRIE owns and maintains electric and natural gas distribution networks in Rhode Island. Distribution revenues are primarily from the sale of electricity, natural gas, and related services to retail customers. Distribution sales are regulated by the RIPUC, which is responsible for approving the rates and other terms of services as part of the rate making process. Natural gas and electric distribution revenues are derived from the regulated sale and distribution of electricity and natural gas to residential, commercial, and industrial customers within RIE’s service territory under the tariff rates. The tariff rates approved by the RIPUC are designed to recover the costs incurred by RIE for products and services provided, along with a return on investment.\nRIE’s distribution base rates are calculated based on a return on rate base (net utility plant plus a cash working capital allowance less plant-related deferred taxes and other miscellaneous additions and deductions). All regulatory assets and liabilities, except accumulated deferred income taxes, are excluded from the return on rate base. Therefore, no return is earned on the related assets unless specifically provided for by the RIPUC. Currently, RIE's ISR and Renewable Energy Growth Program adjustment mechanisms are the only mechanisms authorized to earn a return. Certain operating expenses are also included in RIE’s distribution base rates including wages and benefits, other operation and maintenance expenses, depreciation, and taxes.\nTransmission\nRIE owns an electric transmission system in Rhode Island. RIE’s transmission services are regulated by the FERC and coordinated with ISO – New England. \nDeferral Mechanisms\nRIE records revenues in accordance with accounting principles for rate-regulated operations for arrangements between RIE and the applicable regulator. These include various deferral mechanisms such as capital trackers, energy efficiency programs, and other programs that qualify as Alternative Revenue Programs (ARPs). ARPs enable RIE to adjust rates in the future, in response to past activities or completed events. RIE’s electric and gas distribution rates both have a revenue decoupling mechanism, which allows for annual adjustments to the RIE’s delivery rates, as a result of the reconciliation between allowed revenue and billed revenue. RIE also has other ARPs related to the achievement of certain objectives, demand side management initiatives, and certain other rate making mechanisms. RIE recognizes ARPs with a corresponding offset to a regulatory asset or liability account when the regulatory specified events or conditions have been met, when the amounts are determinable, and are probable of recovery (or payment) through future rate adjustments.\n \nLast Resort Service (LRS)\nRIE is required by the RIPUC and by statute to provide LRS to all customers who have not elected to receive their electric supply from a non-regulated power producer or any customer who, for any reason, has stopped receiving generation service from a non-regulated power producer.\n10\n \nTable of Contents\nThe charge for LRS is the sum of the applicable LRS charges in addition to all appropriate Retail Delivery charges as stated in the applicable tariff. The monthly charge for LRS also includes the costs incurred by RIE to comply with the Renewable Energy Standard, established in Rhode Island General Laws Section 39-26-1 and the costs to comply with the RIPUC’s Rules Governing Energy Source Disclosure. The charge for LRS includes the administrative costs associated with the procurement of LRS, including an adjustment for uncollectible accounts as approved by the RIPUC.\nNumerous alternative suppliers have offered to provide generation supply in RIE's service area. As the cost of generation supply is a pass-through cost for RIE, its financial results are not impacted if its customers purchase electricity supply from these alternative suppliers.\nSee Note 7 to the Financial Statements for additional information on rate mechanisms and regulatory matters.\nNatural Gas Distribution Supply\nTo meet the projected annual gas supply requirements of approximately 37 Bcf, RIE has a portfolio of gas supply arrangements of varying contractual terms and durations to provide service to its customers. These natural gas supply arrangements include contracts with natural gas producers and marketers that reflect market price signals. RIE also has firm pipeline and underground storage capacity contracts to support the delivery of natural gas supplies to its customers. To manage the winter peak requirements for RIE customers, RIE contracts for liquified natural gas (LNG) service and owns and operates certain LNG storage facilities. \nThe RIE gas supply portfolio includes contracts for firm transportation service with eleven interstate pipeline companies and natural gas storage operators. These contracts have various termination dates with certain contracts being subject to evergreen renewal provisions providing RIE with flexibility in managing its upstream resource portfolio. \nRIE has purchased and expects to continue to purchase natural gas supplies for its gas distribution operations from onshore producing regions accessed by its pipeline capacity portfolio in South Texas, East Texas, and Louisiana, as well as gas originating in the Marcellus and Utica production areas. RIE expects to purchase certain natural gas supplies that originate in Canada and from regional LNG import terminals. \nCorporate and Other\n \n(PPL)\nPPL Services provides PPL subsidiaries with administrative, management and support services. The costs of these services are charged directly to the respective recipients for the services provided or indirectly charged to applicable recipients based on an average of the recipients' relative invested capital, operation and maintenance expenses and number of employees or a ratio of overall direct and indirect costs.\nPPL Capital Funding provides financing for the operations of PPL and certain subsidiaries. PPL's growth in rate-regulated businesses provides the organization with an enhanced corporate level financing alternative, through PPL Capital Funding, that enables PPL to cost effectively support targeted credit profiles across all of PPL's rated companies. As a result, PPL utilizes PPL Capital Funding as a source of capital in financings, in addition to continued direct financing by certain operating subsidiaries. Unlike those of PPL Services, PPL Capital Funding's costs are not generally charged to PPL subsidiaries. Costs are charged directly to PPL.\nENVIRONMENTAL MATTERS\n(All Registrants)\nThe Registrants are subject to certain existing and developing federal, regional, state and local laws and regulations with respect to air and water quality, land use and other environmental matters, and may be subject to different and more stringent laws and regulations enacted in the future. The EPA and other federal agencies with jurisdiction over environmental matters have issued numerous environmental regulations relating to air, water and waste that directly affect the electric power industry. Due to these environmental issues, it may be necessary for the Registrants to modify or cease certain operations or operation of certain facilities to comply with statutes, regulations and other requirements of regulatory bodies or courts. In addition, legal challenges to environmental permits or rules add uncertainty to estimating future costs of complying with such permits and rules. The Registrants are monitoring executive orders and other ongoing actions by the new Presidential administration, but are unable to predict changes in regulations, regulatory guidance, legal interpretations, policy positions, and implementation actions that may result. \n11\n \nTable of Contents\nSee “Legal Matters” in Note 12 to the Financial Statements for a discussion of environmental commitments and contingencies. See \"Financial Condition - Liquidity and Capital Resources - Forecasted Uses of Cash - Capital Expenditures\" in \"Item 7. Combined Management's Discussion and Analysis of Financial Condition and Results of Operations\" for information on projected environmental capital expenditures for 2025 through 2027. See Note 18 to the Financial Statements for information related to the impacts of CCRs on AROs.\nLG&E and KU are entitled to recover, through the ECR mechanism, certain costs of complying with the Clean Air Act, as amended, and other federal, state and local environmental requirements applicable to coal combustion wastes and by-products from coal-fired generating facilities upon KPSC review. Costs not covered by the ECR mechanism for LG&E and KU and all such costs for PPL Electric and RIE are subject to rate recovery at the discretion of the companies' respective state regulatory authorities, or the FERC, if applicable. Because PPL Electric and RIE do not own any generating plants, they have less exposure to related environmental compliance costs. The Registrants can provide no assurances as to the ultimate outcome of future proceedings before regulatory authorities.\nAir\n(PPL, LG&E and KU)\nNAAQS\nApplicable regulations require each state to identify areas within its boundaries that fail to meet the NAAQS, (known as nonattainment areas), and develop a state implementation plan to achieve and maintain compliance. States that are found to contribute significantly to another state's nonattainment with ozone standards are required to establish \"good neighbor\" state implementation plans. In addition, for attainment of ozone and fine particulates standards, certain states, including Kentucky, are subject to a regional EPA program known as the Cross-State Air Pollution Rule (CSAPR).\nThe Clean Air Act has a significant impact on the operation of fossil fuel generation plants. The Clean Air Act requires the EPA periodically to establish and review NAAQS for six pollutants including ozone (contributed to by nitrogen oxide emissions) and particulate matter, which are particularly relevant for fossil fuel generation plants. On February 2, 2024, the D.C. Circuit Court granted the EPA’s motion for voluntary remand, without vacatur, of the ozone rule, which was under legal challenge. The EPA will complete a new review to incorporate new studies and updated analyses to determine the adequacy of the existing ozone standard. On March 6, 2024, the EPA finalized revisions to the particulate matter standard that lowers the primary standard for fine particulates. Several states and trade groups challenged the EPA’s finalized revisions to the particulate matter standard in the D.C. Circuit Court. \nN\nonattainment designations for counties in which LG&E and KU generation is located, including Jefferson County, Kentucky, could potentially require additional particulate matter and nitrogen oxide reductions from sources including LG&E’s Mill Creek Station, and more stringent requirements for new generation. PPL, LG&E, and KU are unable to predict future implementation actions or the outcome of future evaluations by the EPA and the states with respect to the NAAQS standards.\nIn March 2021, the EPA released final revisions to the Cross-State Air Pollution Rule (CSAPR), aimed at ensuring compliance with the 2008 ozone NAAQS and providing for reductions in ozone season nitrogen oxide emissions for 2021 and subsequent years. In March 2023, the EPA released a final Federal Implementation Plan under the Good Neighbor provisions of the Clean Air Act providing for significant additional nitrogen oxide emission reductions for compliance with the revised 2015 ozone NAAQS. The reductions in Kentucky state-wide nitrogen oxide budgets were scheduled to commence in 2023, with the largest reductions planned for 2026. The rules provide for reduced availability of nitrogen oxide allowances that have historically permitted operational flexibility for fossil units and could potentially result in constraints that may require implementation of additional emission controls or accelerate implementation of lower emission generation technologies. In June 2024, the U.S. Supreme Court issued a stay of the Good Neighbor Plan while the D.C. Circuit Court considers legal challenges to the rule. On December 10, 2024, EPA published in the Federal Register a supplement to the record. On December 6, 2024, the U.S. Court of Appeals for the Sixth Circuit vacated and remanded the EPA’s disapproval of Kentucky’s state implementation plan for the ozone NAAQS. PPL, LG&E, and KU are monitoring ongoing legal and regulatory developments.\nPPL, LG&E, and KU are unable to predict the ultimate outcome of pending litigation or future emission reductions that may be required by future federal rules or state implementation actions. Compliance with the NAAQS, CSAPR, Good Neighbor Plan, and related requirements may require installation of additional pollution controls or other compliance actions, inclusive of retirements, the costs of which PPL, LG&E and KU believe would be subject to rate recovery.\n12\n \nTable of Contents\nModification of Mercury and Air Toxics Standards\nIn 2012, the EPA issued the Mercury and Air Toxics Standards (MATS) rule requiring reductions in mercury and other hazardous air pollutants from fossil fuel-fired power plants. LG&E and KU installed significant controls to achieve compliance with MATS and other rules. On May 7, 2024, the EPA issued a final rule increasing the stringency of MATS and further reducing emissions of certain hazardous air pollutants to reflect perceived developments in control technologies. Legal challenges to the rule have been filed in the D.C. Circuit Court. PPL, LG&E, and KU have reviewed the final rule and do not expect significant operational changes or additional controls to be required. \nGreenhouse Gas Standards\nOn May 9, 2024, the EPA issued a final rule under Section 111 of the Clean Air Act which establishes performance standards and emissions limits aimed at reducing GHG emissions from certain new, existing, and modified fossil fuel-fired electric generating units (EGUs). In the final rule, the EPA announced it would set performance standards for existing natural gas-fired turbines in a future rule. The standards require phased implementation of carbon mitigation technologies including state-of-the-art efficiency requirements, carbon capture and sequestration, and natural gas co-firing. New natural gas EGUs would be immediately subject to the stricter efficiency standard. Legal challenges to the rule have been filed in the D.C. Circuit Court. PPL, LG&E, and KU are unable to predict the impact of new GHG reduction requirements until completion of a comprehensive review and resolution of related legal and regulatory proceedings. While the impact of new GHG reduction requirements on operations and financial results of operations could potentially be substantial, the cost of complying with such requirements is expected to be subject to rate recovery. \nClimate Change \n(All Registrants) \nIn recent years the federal government has undertaken various efforts aimed at addressing climate change, which could have far-reaching impacts on PPL’s business operations, products, and services. In 2022, the U.S. Supreme Court ruled that provisions of the EPA's Clean Power Plan, premised on generation shifting from coal-fired plants to lower emitting natural gas-fired plants and renewables, exceeded the authority granted to the EPA under the Clean Air Act. While the EPA contends that the new GHG emissions rule discussed above is consistent with the provisions of the Clean Air Act, it is uncertain how a ruling from the D.C. Circuit Court or, if appealed, the U.S. Supreme Court may affect the new GHG emissions rule and any future EPA rulemaking on GHG emissions. The new Presidential administration has issued various executive orders regarding climate change initiatives and is expected to consider changes in regulations, regulatory guidance, legal interpretations, policy positions and implementation actions, but the Registrants are unable to predict any changes that may ultimately be adopted. All of these developments are preliminary or ongoing in nature and the Registrants cannot predict the final outcome or ultimate impact on operations.\nPPL has adopted a goal of net-zero carbon emissions by 2050, which PPL expects will include continuing to retire coal-fired generation and investing in research and innovation that will help to achieve this goal, while maintaining reliable and affordable energy in our service territories. The net-zero goal relates to \ndirect and indirect carbon emissions consistent with Greenhouse Gas Protocol guidance and referenced by the EPA Center for Corporate Climate Leadership. \nThrough 2023, PPL reduced carbon emissions nearly 60% from 2010 levels and is targeting a 70% reduction from 2010 levels by 2035 and an 80% reduction by 2040. \nPPL is also aware of the various risks associated with climate change, including increased frequency and severity of severe weather. To address these risks, PPL continues to work to advance grid modernization and improve the company's equipment to help mitigate the impacts of extreme weather events and improve reliability.\nWater/Waste\n \n(PPL, LG&E and KU)\nClean Water Act\nRegulations under the federal Clean Water Act dictate permitting and mitigation requirements for facilities and construction projects that impact \"Waters of the United States\". Many other requirements relate to power plant operations, including the treatment of pollutants in effluents prior to discharge, the temperature of effluent discharges and the location, design and construction of cooling water intake structures at generating facilities, and standards intended to protect aquatic organisms that become trapped at or pulled through cooling water intake structures at generating facilities. These requirements could impose significant costs for LG&E and KU, which are expected to be subject to rate recovery.\n13\n \nTable of Contents\nClean Water Act Jurisdiction\nEnvironmental groups and others have claimed that discharges to groundwater from leaking CCR impoundments at power plants are subject to Clean Water Act permitting. On April 12, 2019, the EPA released regulatory clarification finding that Clean Water Act jurisdiction does not cover such discharges to groundwater. On January 23, 2020, the EPA announced a final rule modifying the jurisdictional scope of the Clean Water Act. The announced rule revises the definition of the \"Waters of the United States,\" including a revision to exclude groundwater from the definition. In April 2020, the U.S. Supreme Court issued a ruling that Clean Water Act jurisdiction may apply to certain discharges to groundwater that result in the functional equivalent of a direct discharge to navigable waters. PPL, LG&E, and KU are unaware of any unpermitted releases from their facilities that are subject to Clean Water Act jurisdiction, but future regulatory developments and judicial rulings could potentially subject certain releases from CCR impoundments and landfills to additional permitting and remediation requirements, which could impose substantial costs. Any associated costs are expected to be subject to rate recovery. PPL, LG&E and KU are unable to predict the outcome or financial impact of future regulatory proceedings and litigation.\nWaters of the U.S.\nPPL, LG&E, and KU are subject to permitting and mitigation requirements for certain construction activities that impact \"Waters of the United States.\" On April 21, 2020, the EPA and U.S. Army Corps of Engineers published a final rule revising the definition of \"Waters of the United States\" to exclude jurisdiction over certain surface waters. On August 30, 2021, a U.S. District Court in Arizona vacated and remanded the rule. On December 7, 2021, the EPA and U.S. Army Corps of Engineers proposed to repeal the rule and restore the definition of \"Waters of the United States\" that was in place prior to 2015. On January 18, 2023, the EPA and U.S. Army Corps of Engineers published a final revision to the rule broadening the definition of Waters of the United States and reverting to the pre-2015 regulatory framework. Although the broader definition incorporates additional water bodies, any resulting permitting, construction, and operational expenses are expected to be immaterial and subject to rate recovery. \nOn May 25, 2023, the U.S. Supreme Court issued an opinion in Sackett v. EPA holding that the government’s jurisdiction to regulate wetlands under the Clean Water Act extends to wetlands with a continuous surface connection to bodies that are \"Waters of the United States.\" On September 8, 2023, the EPA issued a conforming rule that incorporated the holding of \nSackett\n into federal definitions of waters of the United States; some states and industry groups have challenged the conforming rule as well. By limiting water bodies that fall within the jurisdiction of the Clean Water Act, the U.S. Supreme Court's decision could reduce the number of projects or the scope of project activities subject to federal permitting for wetlands. PPL, LG&E and KU are unable to predict the outcome of current or future litigation or regulatory proceedings, but do not expect a material impact on operations.\nSuperfund and Other Remediation\n \n(All Registrants)\nFrom time to time, PPL's subsidiaries undertake testing, monitoring or remedial action in response to spills or other releases at various on-site and off-site locations, negotiate with the EPA and state and local agencies regarding actions necessary to comply with applicable requirements, negotiate with property owners and other third parties alleging impacts from PPL's operations and undertake similar actions necessary to resolve environmental matters that arise in the course of normal operations. Based on analyses to date, resolution of these environmental matters is not expected to have a significant adverse impact on the operations of PPL, PPL Electric, LG&E, KU and RIE.\nFuture cleanup or remediation work at sites not yet identified may result in significant additional costs for the Registrants. Insurance policies maintained by LKE may be available to cover certain of the costs or other obligations related to these matters for LG&E or KU, but the amount of insurance coverage or reimbursement cannot be estimated or assured. \nSee “Legal Matters” in Note 12 to the Financial Statements for additional information.\n(All Registrants)\nSEASONALITY\nThe demand for and market prices of electricity and natural gas are affected by weather. As a result, the Registrants' operating results in the future may fluctuate substantially on a seasonal basis, especially when unpredictable weather conditions make such fluctuations more pronounced. The pattern of this fluctuation may change depending on the type and location of the facilities owned. \n14\n \nTable of Contents\nFINANCIAL CONDITION\nSee \"Financial Condition\" in \"Item 7. Combined Management's Discussion and Analysis of Financial Condition and Results of Operations\" for this information.\nCAPITAL EXPENDITURE REQUIREMENTS\nSee \"Financial Condition - Liquidity and Capital Resources - Forecasted Uses of Cash - Capital Expenditures\" in \"Item 7. Combined Management's Discussion and Analysis of Financial Condition and Results of Operations\" for information concerning projected capital expenditure requirements for 2025 through 2027. See \"Item 1. Business - Environmental Matters\" for additional information concerning the potential impact on capital expenditures from environmental matters.\nHUMAN CAPITAL \nPPL, together with its subsidiaries, is committed to fostering an exceptional workplace for employees. PPL pledges to enable the success of its current and future workforce by cultivating a supportive, empowering and collaborative culture, fostering professional development, encouraging employee engagement, and ensuring a safe and healthy work environment. Matters related to these priorities and corporate culture are overseen by PPL's senior management, which provides updates to the PPL Board of Directors (the Board). Pursuant to its charter, the People and Compensation Committee of the Board of Directors also periodically reviews and assesses the company's strategy for human capital management. PPL's investment in the success of its workforce is embodied in the following areas with dedicated leadership and Board oversight: \n•\nCorporate culture - Foster a supportive, empowering and collaborative workplace culture in which employees with various backgrounds can thrive. Senior management reviews workforce metrics, culture related objectives and associated programs semi-annually. The Board also receives periodic updates from senior management on PPL's strategy and initiatives that drive corporate culture.\n•\nEmployee engagement - Create a workplace that fosters an engaged, high-quality workforce. PPL's operating companies regularly conduct assessments related to employee engagement, safety and culture. Senior management reviews employee engagement efforts with the Board at least annually.\n•\nProfessional development - Invest in the current and future workforce through training and development, succession planning and creation of a pipeline for internal advancement. Senior management reviews succession planning with the People and Compensation Committee of the Board on an annual basis.\n•\nComprehensive benefits - In addition to challenging careers and competitive salaries, PPL offers competitive benefits programs to attract and retain talent and support employees' well-being. PPL offers competitive vacation time, expanded leave for new parents, retirement programs, and internal and external development opportunities, including tuition reimbursement offerings for undergraduate and certain graduate degrees. Senior management conducts annual benchmarking of employee compensation and benefits.\n•\nSafety and Compliance - PPL is committed to maintaining an ethical and safe workplace culture. Additional steps to ensure Board oversight in these areas include: \n•\nSafety – PPL implements programs focused on health and safety, including emergency preparedness, vehicle safety and accident prevention. Employees receive safety training and are encouraged to share, implement, and follow best practices. Senior management receives monthly safety data updates to determine whether additional safety measures should be implemented. The Board reviews the company's safety programs and results at least annually. The Board is also immediately engaged in the event of a fatality.\n•\nCompliance – The Corporate Compliance Committee, including senior executives, meets quarterly to discuss metrics and other matters related to the compliance and ethics culture. Among the items discussed are statistics regarding Ethics Helpline reports and employee concerns. This information is also reviewed with the Audit Committee of the Board quarterly\n \nand with the Board annually. \nPPL will continue to engage with employees and to assess these priorities as we work to best position individuals and the company for future success. PPL had a turnover rate of 8.25% for the year ended December 31, 2024.\n \nLooking forward, PPL will maintain our strong focus on workforce planning to address future talent needs.\nAt December 31, 2024, the Registrants had the following full-time employees and employees represented by labor unions: \n15\n \nTable of Contents\nTotal Full-Time\nEmployees\nNumber of Union\nEmployees\nPercentage of Total\nWorkforce\nPPL\n6,653 \n2,431 \n37 \n%\nPPL Electric\n1,393 \n916 \n66 \n%\nLG&E\n906 \n581 \n64 \n%\nKU\n723 \n109 \n15 \n%\n(PPL and KU) \nIn July 2024, KU and the IBEW local reached, and local members ratified, a new three-year labor agreement through July 2027. The agreement covers approximately 60 employees. The terms of the new labor agreement are not expected to have a significant impact on the financial results of KU or PPL.\n(PPL)\nIn May 2024, PPL and the Rhode Island UWUA locals ratified a five-year labor agreement through May 2029. The agreement covers over 530 employees. The terms of the new labor agreement are not expected to have a significant impact on the financial results of PPL.\nContract negotiations with RIE USW Local 12431 are expected to commence in April 2025. The current contract covers over 300 employees and is scheduled to expire June 1, 2025.\nAVAILABLE INFORMATION \nPPL's Internet website is www.pplweb.com. Under the Investors heading of that website, PPL provides access to SEC filings of the Registrants (including annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to these reports filed or furnished pursuant to Section 13(d) or 15(d)) free of charge, as soon as reasonably practicable after filing with the SEC. The information contained on, or available through, PPL's Internet website is not, and shall not be deemed to be, incorporated by reference into this report. Additionally, the Registrants' filings are available at the SEC's website (www.sec.gov).\n16\n \nTable of Contents",
  "item7": null,
  "item2": null
}