{
  "source_file": "pru-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \nTABLE OF CONTENTS\n \n \nPage\nOverview\n106\nRegulatory Developments\n106\nCurrent Market Conditions\n106\nImpact of Changes in the Interest Rate Environment\n107\nResults of Operations\n110\nConsolidated Results of Operations\n110\nSegment Results of Operations\n112\nSegment Measures\n114\nImpact of Foreign Currency Exchange Rates\n115\nAccounting Policies & Pronouncements\n117\nResults of Operations by Segment\n118\nPGIM\n118\nRetirement Strategies\n122\nGroup Insurance\n130\nIndividual Life\n131\nInternational Businesses\n134\nCorporate and Other\n137\nDivested and Run-off Businesses\n138\nClosed Block Division\n139\nIncome Taxes\n140\nGeneral Account Investments\n140\nValuation of Assets and Liabilities\n160\nLiquidity and Capital Resources\n162\nRatings\n171\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) addresses the consolidated financial condition of Prudential Financial, Inc. (“Prudential,” “Prudential Financial,” “PFI,” or “the Company”) as of September 30, 2025, compared with December 31, 2024, and its consolidated results of operations for the three and nine months ended September 30, 2025 and 2024. You should read the following analysis of our consolidated financial condition and results of operations in conjunction with the MD&A, the “Risk Factors” section, and the audited Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, as well as the statements under “Forward-Looking Statements,” and the Unaudited Interim Consolidated Financial Statements included elsewhere in this Quarterly Report on Form 10-Q.\n105\nTable of Contents\nOverview\nPrudential Financial, a financial services leader with approximately $1.612 trillion of assets under management as of September 30, 2025, has operations primarily in the United States of America (“U.S.”), Asia, Europe and Latin America. Through our subsidiaries and affiliates, we offer a wide array of financial products and services, including life insurance, annuities, retirement solutions, mutual funds and investment management. We offer these products and services to individual and institutional customers through one of the largest distribution networks in the financial services industry.\nOur principal operations consist of PGIM (our global investment management business), our U.S. Businesses (consisting of our Retirement Strategies, Group Insurance and Individual Life businesses), our International Businesses, the Closed Block division, and our Corporate and Other operations. The Closed Block division is accounted for as a divested business that is reported separately from the Divested and Run-off Businesses that are included in Corporate and Other. Divested and Run-off Businesses consist of businesses that have been, or will be, sold or exited, including businesses that have been placed in wind-down status that do not qualify for “discontinued operations” accounting treatment under generally accepted accounting principles in the United States of America (“U.S. GAAP”). Our Corporate and Other operations include corporate items and initiatives that are not allocated to business segments as well as the Divested and Run-off Businesses described above.\nEffective in the first quarter of 2025, consistent with changes to the Company’s internal management structure, our International Businesses are reflected as a single operating and reportable segment, which is how the chief operating decision maker (“CODM”) now assesses its performance and allocates resources. Prior to the first quarter of 2025, our International Businesses consisted of the Life Planner and Gibraltar Life and Other operating segments, each of which was a reportable segment under U.S. GAAP. The change has been applied retrospectively and did not have any impact on the Company’s Unaudited Interim Consolidated Financial Statements contained herein or to any previously issued financial statements.\nWe attribute financing costs to each segment based on the amount of financing used by each segment, excluding financing costs associated with corporate debt, which are reflected in our Corporate and Other operations. The net investment income of each segment includes earnings on the amount of capital that management believes is necessary to support the risks of that segment.\nManagement expects that results will continue to benefit from our mutually-reinforcing business system, which includes a mix of businesses that complement each other to provide competitive advantages, earnings diversification and capital benefits from a balanced risk profile. We believe we are well-positioned to tap into market opportunities to meet the evolving needs of our clients and society at large. Our mix of high-quality protection, retirement and investment management businesses enables us to offer solutions that cover a broad range of financial needs and to engage with our clients through multiple channels.\nAs part of our continuous improvement process, we are working to become a leaner and more agile company by simplifying our management structure, empowering our employees with faster decision-making processes and investing in technology and data platforms. We expect these actions will create operating efficiencies, and provide reinvestment capacity to build capabilities, realize additional efficiencies, strengthen our competitiveness and fuel future growth. \nRegulatory Developments\nInterest Maintenance Reserves\nIn August 2025, the National Association of Insurance Commissioners (“NAIC”) extended the temporary statutory accounting treatment of net negative interest maintenance reserves (“IMR”) through December 31, 2026. This provision, which was set to expire on December 31, 2025, permits an insurer to admit net negative IMR up to 10% of their adjusted statutory surplus, provided such insurer’s risk-based capital (“RBC”) ratio remains above 300% of its Authorized Control Level RBC.\nH.R.1 — One Big Beautiful Bill Act (the “Tax Act of 2025”)\nSee Note 14 to the Unaudited Interim Consolidated Financial Statements for information about tax law changes included in the Tax Act of 2025. \nCurrent Market Conditions\nThe imposition of tariffs and retaliatory actions, as we have seen this year, could result in, among other things, rising interest rates, significant equity market declines, stagnant economic growth and high inflation, which could adversely impact our liquidity and capital positions, cash flows, results of operations, and financial position. For example, the combination of \n106\nTable of Contents\nstagnant economic growth and high inflation would increase investment risk, including the underperformance of investments in more leveraged companies or companies exposed to weaker consumers. Also, the statutory capital of certain of our insurance subsidiaries could be negatively affected by such things as increased reserve requirements, which could be caused by equity market declines, and asymmetrical and non-economic statutory accounting impacts from rising rates. As we navigate through the current environment, we may take actions consistent with our risk and capital frameworks, as necessary, to preserve our liquidity and capital positions.\nImpact of Changes in the Interest Rate Environment\nAs a global financial services company, market interest rates are a key driver of our liquidity and capital positions, cash flows, results of operations and financial position. Changes in interest rates can affect these in several ways, including favorable or adverse impacts to:\n•\ninvestment-related activity, including: investment income returns, net investment spread results, new money rates, mortgage loan prepayments and bond redemptions;\n•\nthe valuation of fixed income investments and derivative instruments;\n•\ncollateral posting requirements, hedging costs and other risk mitigation activities;\n•\ncustomer account values and assets under management, including their impacts on fee-related income;\n•\ninsurance reserve levels, including market risk benefits (“MRBs”), and market experience true-ups;\n•\npolicyholder behavior, including surrender or withdrawal activity;\n•\nproduct offerings, design features, crediting rates and sales mix; and\n•\nthe fair value of, and possible impairments on, intangible assets such as goodwill.\nFor additional information regarding interest rate risks, see “Risk Factors—Market Risk” included in our Annual Report on Form 10-K for the year ended December 31, 2024.\nSee below for a discussion of the current interest rate environment and its impact to net investment spread in our U.S. and Japanese operations along with the composition of their insurance liabilities and policyholder account balances.\nU.S. Operations excluding the Closed Block Division\n \nWhile interest rates in the U.S. have experienced a sustained period of historically low levels since the financial crisis of 2007, rates began to increase in 2022 and have continued to sustain higher levels through the first nine months of 2025, and our average reinvestment yield is generally now exceeding our current average portfolio yield.\nIn order to manage the impacts that changes in interest rates have on our net investment spread, we employ a proactive asset/liability management program, which includes strategic asset allocation and hedging strategies within a disciplined risk management framework. These strategies seek to match the liability characteristics of our products, and to closely approximate the interest rate sensitivity of the assets with the estimated interest rate sensitivity of the product liabilities. Our asset/liability management program also helps manage duration gaps, currency and other risks between assets and liabilities through the use of derivatives. We adjust this dynamic process as products change, as customer behavior changes and as changes in the market environment occur. As a result, our asset/liability management process has permitted us to manage the interest rate risk associated with our products through several market cycles. Our interest rate exposure is also mitigated by our business mix, which includes lines of business for which fee-based and insurance underwriting earnings play a more prominent role in product profitability. We also regularly examine our product offerings and their profitability. As a result, we may reprice certain products and discontinue sales of other products that do not meet our profit expectations.\nThe p\nortion of the general account supporting our U.S. operations has approximatel\ny $229 billion of fixed maturity securities and commercial mortgage loans (based on net carrying value) as of September 30, 2025, with an average portfolio yield of approximately 5.0%.\n For this portion of the general account attributable to these operations, we estimate annual principal payments and prepayments that we would be required to reinvest to be approximat\nely 7.2% of th\ne fixed maturity security and commercial mortgage loan portfolios through 2026.\nIncluded in \nthe $229 billion of fixed maturity securities and commercial mortgage loans are approximately $191 billion that are subject to call or redemption features at the issuer’s option and have a weighted average interest rate of approximately 5%. Of this $191 billion, approximately 53% contain provisions for prepa\nyment premiums. Future operating results will be impacted by (i) the reinves\ntment of scheduled payments or prepayments (not subject to a prepayment fee) at different rates compared to the current portfolio yield, including in some cases at rates below those guaranteed under our insurance contracts, \n107\nTable of Contents\nand (ii) our utilization of other asset/liability management strategies, as described above, in order to maintain favorable net investment spread. \nThe following table sets forth the insurance liabilities and policyholder account balances of our U.S. operations excluding the Closed Block Division, b\ny type, for the date indicated:\nAs of\nSeptember 30, 2025\n(in billions)\nLong-duration insurance products with fixed and guaranteed terms\n$\n213 \nContracts with adjustable crediting rates subject to guaranteed minimums\n37 \nParticipating contracts where investment income risk ultimately accrues to contractholders\n1 \nTotal\n$\n251 \nThe $213 billion above relates to long-duration products such as group annuities, structured settlements and other insurance products that have fixed and guaranteed terms. We seek to manage the impact of changes in interest rates on these contracts through asset/liability management, as discussed above. \nThe $37 billion above relates to contracts with crediting rates that may be adjusted over the life of the contract, subject to guaranteed minimums. Although we may have the ability to lower crediting rates for those contracts above guaranteed minimums, our willingness to do so may be limited by competitive pressures. For additional information regarding contracts with adjustable crediting rates subject to guaranteed minimums, see Note 10 to the Unaudited Interim Consolidated Financial Statements.\nThe remaining $1 billion of\n insurance liabilities and policyholder account balances in these operations relates to participating contracts for which the\n investment income risk is expected to ultimately accrue to contractholders. The crediting rates for these contracts are periodically adjusted based on the return earned on the related assets.\nClosed Block Division\nSubstantially all of the $47 billion of general account investments in the Closed Block division support obligations and liabilities relating to the Closed Block policies only. See Note 13 to the Unaudited Interim Consolidated Financial Statements for additional information regarding the Closed Block.\nJapanese Operations\nJapan has experienced a low interest rate environment for many years, during which the Bank of Japan’s monetary policy has resulted in even lower and, at times, negative yields for certain tenors of government bonds; however, recent actions by the Bank of Japan have resulted in an increase in interest rates in 2024 and through the first nine months of 2025.\nIn order to manage, to the extent possible, the impact that the current interest rate environment has on our net investment spread, our Japanese operations employ a proactive asset/liability management program. We continue to purchase long-term bonds with tenors of 10 years or greater. We also regularly examine our product offerings and their profitability. As a result, we may reprice certain products, adjust commissions for certain products and discontinue sales of other products that do not meet our profit expectations. Additionally, our diverse product portfolio in terms of currency mix and premium payment structure allows us to further manage any impacts from changes in the interest rate environment. For additional information regarding sales within these operations, see “—International Businesses—Sales Results,” below.\nThe portion of the general account supporting our Japanese operations has approximately $144 billion of fixed maturity securities and commercial mortgage loans (based on net carrying value) as of September 30, 2025, with an average portfolio yield of approximately 3.1%. Our Japanese operations have continued to invest in U.S. dollar (“USD”)-denominated assets supporting our USD-denominated product portfolio, which has now driven average reinvestment rates to exceed current average portfolio rates. For this portion of the general account attributable to these operations, we estimate annual principal payments and prepayments that we would be required to reinvest to be approximately 6.6% of the fixed maturity security and commercial mortgage loan portfolios through 2026. \nIncluded in the $144 billion of fixed maturity securities and commercial mortgage loans are approximately $13 billion that are subject to call or redemption features at the issuer’s option and have a weighted average interest rate of approximately 4%. \n108\nTable of Contents\nOf this $13 billion, approximately 7% contain provisions for prepayment premiums. Future operating results will be impacted by (i) the reinvestment of scheduled payments or prepayments (not subject to a prepayment fee) at different rates compared to the current portfolio yield, including in some cases at rates below those guaranteed under our insurance contracts, and (ii) our utilization of other asset/liability management strategies, as described above, in order to maintain favorable net investment spread. \nThe following table sets forth the insurance liabilities and policyholder account balances of our Japanese operations, by type, for the date indicated:\nAs of \nSeptember 30, 2025\n \n(in billions)\nInsurance products with fixed and guaranteed terms\n$\n108 \nContracts with a market value adjustment if canceled before maturity\n41 \nContracts with adjustable crediting rates subject to guaranteed minimums\n9 \nTotal\n$\n158 \nThe \n$108 billion primarily consists of long-duration insurance products that have fixed and guaranteed terms for which underlying assets may have to be reinvested at interest rates that are lower than current portfolio yields. The remaining insurance liabilities and policyholder account balances include $41 billion related to contracts that impose a market value adjustment i\nf the contracts are canceled before \nmaturity and $9 billion rela\nted to contracts with crediting rates that may be adjusted over the life of the contract, subject to guaranteed minimums. Most of the current crediting rates on these contracts, however, are at or near contractual minimums. Although we have the ability in some cases to lower crediting rates for those contracts that are above guaranteed minimum crediting rates, the majority of t\nhis business has interest crediting rates that are determined by formula. See Note 10 to the Unaudited Interim Consolidated Financial Statements for additional information regarding crediting rates on policyholder account balances.\n109\nTable of Contents\nResults of Operations\nConsolidated Results of Operations\nThe following section provides a comparative discussion of our consolidated results of operations on a U.S. GAAP basis for the periods indicated.\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\nREVENUES\nPremiums\n$\n9,213 \n$\n13,045 \n$\n23,195 \n$\n36,402 \nPolicy charges and fee income\n1,133 \n1,111 \n3,539 \n3,252 \nNet investment income\n5,528 \n5,055 \n15,884 \n14,668 \nAsset management and service fees\n996 \n984 \n2,962 \n2,984 \nOther income (loss)\n1,720 \n1,285 \n3,412 \n3,214 \nRealized investment gains (losses), net\n(1,026)\n(1,844)\n(3,455)\n(2,318)\nChange in value of market risk benefits, net of related hedging gains (losses)\n324 \n(146)\n(453)\n(320)\nTotal revenues\n17,888 \n19,490 \n45,084 \n57,882 \nBENEFITS AND EXPENSES\nPolicyholders’ benefits\n10,132 \n14,027 \n26,453 \n39,485 \nChange in estimates of liability for future policy benefits\n296 \n180 \n71 \n(13)\nInterest credited to policyholders’ account balances\n1,582 \n863 \n3,545 \n3,248 \nDividends to policyholders\n416 \n189 \n820 \n655 \nAmortization of deferred policy acquisition costs\n403 \n367 \n1,217 \n1,117 \nGeneral and administrative expenses\n3,277 \n3,311 \n9,536 \n10,032 \nTotal benefits and expenses\n16,106 \n18,937 \n41,642 \n54,524 \nINCOME (LOSS) BEFORE INCOME TAXES AND EQUITY IN EARNINGS OF JOINT VENTURES AND OTHER OPERATING ENTITIES\n1,782 \n553 \n3,442 \n3,358 \nTotal income tax expense (benefit)\n382 \n140 \n784 \n693 \nINCOME (LOSS) BEFORE EQUITY IN EARNINGS OF JOINT VENTURES AND OTHER OPERATING ENTITIES\n1,400 \n413 \n2,658 \n2,665 \nEquity in earnings of joint ventures and other operating entities, net of taxes\n83 \n38 \n133 \n108 \nNET INCOME (LOSS)\n1,483 \n451 \n2,791 \n2,773 \nLess: Income (loss) attributable to noncontrolling interests and redeemable noncontrolling interests\n52 \n3 \n120 \n(11)\nNET INCOME (LOSS) ATTRIBUTABLE TO PRUDENTIAL FINANCIAL, INC.\n$\n1,431 \n$\n448 \n$\n2,671 \n$\n2,784 \nThree Month Comparison. \n“Net income (loss) attributable to Prudential Financial, Inc.” for the third quarter of 2025 compared to the third quarter of \n2024\n increased $983 million, inclusive of a $242 million unfavorable variance from income taxes, primarily driven by the increase in pre-tax earnings, as described below. \nOn a pre-tax basis, “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” increased $1,229 million, reflecting the following notable items:\n“Total revenues” decreased $1,602 million, primarily due to the following:\n•\n“Premiums” — $3,832 million unfavorable variance, primarily reflecting lower pension risk transfer premiums due to lower sales in the current period, with corresponding offsets in “policyholders’ benefits,” as discussed below.\nPartially offset by: \n•\n“Realized investment gains (losses), net” — $818 million favorable variance, primarily reflecting the change in the fair value of embedded derivatives related to our Funds Withheld portfolios, which are offset by changes in the value of the investments in the Funds Withheld portfolios that are primarily recorded in “Other income (loss)” or through “Other comprehensive income,” as well as lower write-downs on, and lower losses from the sales of, fixed income securities. These variances were partially offset by unfavorable derivative results excluding the change in the fair value \n110\nTable of Contents\nof embedded derivatives related to our Funds Withheld portfolios, as described above. See “—General Account Investments—Realized Investment Gains and Losses” for additional information;\n•\n“Net investment income” — $473 million favorable variance, primarily reflecting business growth, higher reinvestment rates and higher income from non-coupon investments. See “—General Account Investments—Investment Results” for additional information;\n•\n“Change in value of market risk benefits, net of related hedging gains (losses)” — $470 million favorable variance, primarily reflecting favorable equity market performance; and\n•\n“Other income (loss)” — $435 million favorable variance, primarily reflecting favorable changes in the market value of equity and fixed income securities designated as trading, including on assets supporting experience-rated contractholder liabilities, which are fully offset in “Interest credited to policyholders’ account balances” as discussed below.\n“Total benefits and expenses” decreased $2,831 million, primarily due to the following:\n•\n“Policyholders’ benefits” — $3,895 million favorable variance, primarily reflecting lower pension risk transfer premiums, as discussed above.\nPartially offset by:\n•\n“Interest credited to policyholders’ account balances” — $719 million unfavorable variance, primarily reflecting the impact from the favorable changes in assets supporting experience-rated contractholder liabilities, as described above, and business growth; and\n•\n“Dividends to policyholders” — $227 million unfavorable variance, primarily reflecting favorable changes in cumulative earnings in the Closed Block division, largely corresponding to “Realized investment gains (losses), net” above. See “—Closed Block Division” for additional information.\nNine Month Comparison. \n“Net income (loss) attributable to Prudential Financial, Inc.” for the first nine months of 2025 compared to the first nine months of \n2024\n decreased $113 million, inclusive of a $91 million unfavorable variance from income taxes, primarily driven by the impact of certain tax rate changes in the current period, and the increase in pre-tax earnings, as described below. See “—Income Taxes” for additional information.\nOn a pre-tax basis, “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” increased $84 million, reflecting the following notable items:\n“Total revenues” decreased $12,798 million, primarily due to the following:\n•\n“Premiums” — $13,207 million unfavorable variance, primarily reflecting lower pension risk transfer premiums due to lower sales in the current period, with corresponding offsets in “Policyholders’ benefits,” as discussed below; and\n•\n“Realized investment gains (losses), net” — $1,137 million unfavorable variance, primarily reflecting unfavorable derivative results, including losses in the current period from product-related hedge positions and embedded derivatives, as well as from foreign currency hedges, partially offset by lower losses from the sales of fixed income securities. See “—General Account Investments—Realized Investment Gains and Losses” for additional information.\nPartially offset by:\n•\n“Net investment income” — $1,216 million favorable variance, primarily reflecting business growth, higher reinvestment rates and higher income from non-coupon investments. See “—General Account Investments—Investment Results” for additional information.\n“Total benefits and expenses” decreased $12,882 million, primarily due to the following:\n•\n“Policyholders’ benefits” — $13,032 million favorable variance, primarily reflecting lower pension risk transfer premiums, as discussed above; and\n•\n“General and administrative expenses” — $496 million favorable variance, net of deferrals, primarily reflecting lower operating expenses, partially offset by higher variable expenses supporting business growth.\n111\nTable of Contents\nPartially offset by:\n•\n“Interest credited to policyholders’ account balances” — $297 million unfavorable variance, primarily reflecting business growth.\nSegment Results of Operations\n \nWe analyze the performance of our segments and Corporate and Other operations using a measure of segment profitability called adjusted operating income. See “—Segment Measures” below for a discussion of adjusted operating income and its use as a measure of segment operating performance.\nAnnual Reviews and Update of Assumptions and Other Refinements\nDuring the second quarter of each year, we perform an annual comprehensive review of the assumptions used for estimating future premiums, benefits, and other cash flows, including reviews related to mortality, morbidity, lapse, surrender, and other contractholder behavior assumptions, and economic assumptions, including expected future rates of returns on investments. The Company generally looks to relevant Company experience as the primary basis for these assumptions; however, if relevant Company experience is not available or does not have sufficient credibility, the Company may look to experience of similar blocks of business, either elsewhere within the Company or within the industry. As part of this review, we may update these assumptions and make refinements to our models based upon emerging experience, future expectations and other data, including any observable market data we feel is indicative of a long-term trend. These assumptions are generally reviewed annually unless a material change in our own experience or in industry experience made available to us is observed in an interim period that we feel is also indicative of a long-term trend. Generally, we do not expect trends to change significantly in the short-term and, to the extent these trends may change, we expect such changes to be gradual over the long-term. The impact on our results of operations of changes in these assumptions can be offsetting and we are unable to predict their movement or offsetting impact over time.\nShown below are the impacts on our adjusted operating income from updates of actuarial assumptions and other refinements as discussed above. The information below is presented by each segment and Corporate and Other operations and includes a reconciliation of these impacts to the impacts within income (loss) before income taxes and equity in earnings of joint ventures and other operating entities.\nNine Months Ended\nSeptember 30,\n2025\n2024\n(in millions)\nFavorable (unfavorable) impact to adjusted operating income before income taxes by segment:\nU.S. Businesses:\nRetirement Strategies\n$\n(113)\n$\n140 \nGroup Insurance\n11 \n25 \nIndividual Life\n58 \n(98)\nTotal U.S. Businesses\n(44)\n67 \nInternational Businesses\n(2)\n(55)\nCorporate and Other\n0 \n(6)\nTotal segment favorable (unfavorable) impact to adjusted operating income before income taxes\n(46)\n6 \nReconciling items:\nRealized investment gains (losses), net, and related charges and adjustments\n146 \n831 \nChange in value of market risk benefits, net of related hedging gains (losses)\n(263)\n(88)\nDivested and Run-off Businesses:\nClosed Block division\n0 \n0 \nOther Divested and Run-off Businesses\n(7)\n110 \nFavorable (unfavorable) impact to consolidated income (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n(170)\n$\n859 \n112\nTable of Contents\nShown below are the adjusted operating income contributions of each segment and Corporate and Other operations for the periods indicated and a reconciliation of this segment measure of performance to “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as presented in the Unaudited Interim Consolidated Statements of Operations. \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nAdjusted operating income before income taxes by segment:\nPGIM\n$\n244 \n$\n241 \n$\n629 \n$\n616 \nU.S. Businesses:\nRetirement Strategies(1)\n966 \n898 \n2,564 \n2,768 \nGroup Insurance\n90 \n82 \n304 \n248 \nIndividual Life\n93 \n60 \n167 \n(148)\nTotal U.S. Businesses(1)\n1,149 \n1,040 \n3,035 \n2,868 \nInternational Businesses\n881 \n766 \n2,490 \n2,364 \nCorporate and Other\n(327)\n(487)\n(1,022)\n(1,293)\nTotal segment adjusted operating income before income taxes(1)\n1,947 \n1,560 \n5,132 \n4,555 \nReconciling items:\nRealized investment gains (losses), net, and related charges and adjustments(1)(2)\n(574)\n(737)\n(1,336)\n(625)\nChange in value of market risk benefits, net of related hedging gains (losses)\n324 \n(146)\n(453)\n(320)\nMarket experience updates\n(36)\n(127)\n45 \n(112)\nDivested and Run-off Businesses(3):\nClosed Block division\n10 \n2 \n(30)\n(61)\nOther Divested and Run-off Businesses\n123 \n47 \n84 \n50 \nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests(4)\n(11)\n(43)\n(26)\n(113)\nOther adjustments(5)\n(1)\n(3)\n26 \n(16)\nConsolidated income (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n1,782 \n$\n553 \n$\n3,442 \n$\n3,358 \n__________\n(1)\nThe amounts for the three and nine months ended September 30, 2024 reflect the correction of an error related to indexed variable and fixed annuity products within the Retirement Strategies segment. See “—Retirement Strategies” for additional information. Prior period amounts have been updated to conform to current period presentation.\n(2)\nSee “\n—\nGeneral Account Investments” and Note 19 to the Unaudited Interim Consolidated Financial Statements for additional information.\n(3)\nRepresents the contribution to income (loss) of Divested and Run-off Businesses that have been or will be sold or exited, including businesses that have been placed in wind-down, but did not qualify for “discontinued operations” accounting treatment under U.S. GAAP. See “—Divested and Run-off Businesses” for additional information.\n(4)\nEquity in earnings of joint ventures and other operating entities is included in adjusted operating income but excluded from “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as it is reflected on an after-tax U.S. GAAP basis as a separate line in the Unaudited Interim Consolidated Statements of Operations. Earnings attributable to noncontrolling interests are excluded from adjusted operating income but included in “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” as they are reflected on a U.S. GAAP basis as a separate line in the Unaudited Interim Consolidated Statements of Operations. Earnings attributable to noncontrolling interests represents the portion of earnings from consolidated entities that relates to the equity interests of minority investors.\n(5)\nIncludes certain components of consideration for business acquisitions, which are recognized as compensation expense over the requisite service periods.\nSegment results for the period presented above reflect the following:\nPGIM.\n Results for both the \nthird quarter and the first \nnine\n months\n of 2025 increased in comparison to the prior year periods, primarily reflecting higher net asset management fees and higher net service, distribution and other revenues, driven by a gain on sale of our asset management business in Taiwan, partially offset by higher expenses, primarily reflecting charges resulting from a business reorganization. Results for\n \nthe \nthird quarter\n of 2025 also reflected higher net other related revenues.\n113\nTable of Contents\nRetireme\nnt Strategies.\n Results for \nthe third quarter of 2025 increased in comparison to the prior year period, primarily driven by \nhigher net investment spread results, partially offset by higher expenses, less favorable reserve experience and lower net fee income. Results for the first nine months of 2025 decreased in comparison to the prior year period, \ninclusive of an unfavorable comparative net impact from our annual reviews and update of assumptions and other refinements. Excluding this item, results \nincreased, primarily driven by higher net investment spread results, partially offset by higher expenses and lower net fee income.\nGroup Insurance.\n Results for the third quarter of 2025 \nincreased \nin comparison to the prior year period, primarily driven by \nhigher underwriting results, partially offset by higher expenses. \nResults for the first nine months of 2025 increased in comparison to the prior year period, inclusive of a less favorable comparative net impact from our annual reviews and update of assumptions and other refinements. Excluding this item, results for the first nine months of 2025 increased, primarily driven by higher underwriting results, partially offset by higher expenses. \nIndividual Life.\n Results for the third quarter of 2025 increased in comparison to the prior year period, primarily driven by higher underwriting results, partially offset by lower net investment spread results. Results for the first nine months of 2025 increased in comparison to the prior year period, inclusive of a favorable comparative net impact from our annual reviews and update of assumptions and other refinements. Excluding this item, results for the first nine months of 2025 increased, primarily driven by higher underwriting results, partially offset by lower net investment spread results.\nInternational Businesses\n. Results for the third quarter of 2025 increased in comparison to the prior year period, inclusive of an unfavorable comparative net impact from foreign currency exchange rates. Excluding this item, results for the third quarter of 2025 increased, primarily driven by higher net investment spread results and higher underwriting results. Results for the first nine months of 2025 increased, inclusive of an unfavorable comparative net impact from foreign currency exchange rates and a favorable comparative net impact from our annual reviews and update of assumptions and other refinements. Excluding these items, results for the first nine months of 2025 increased, primarily driven by higher net investment spread results and higher underwriting results, partially offset by higher expenses.\nCorporate and Other\n. Results for both the third quarter and the first nine months of 2025 reflected decreased losses in comparison to the prior year periods, primarily driven by lower net charges from other corporate activities. \nClosed Block Division.\n Results for both the third quarter and the first nine months of 2025 increased in comparison to the prior year periods, driven by higher net investment activity results, partially offset by changes in the policyholder dividend obligation.\nSegment Measures\nAdjusted Operating Income. \nIn managing our business, we analyze our segments’ operating performance using “adjusted operating income.” Adjusted operating income does not equate to “Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities” or “Net income (loss)” as determined in accordance with U.S. GAAP but is the measure of segment profit or loss we use to evaluate segment performance and allocate resources and, consistent with authoritative guidance, is our measure of segment performance. The adjustments to derive adjusted operating income are important to an understanding of our overall results of operations. Adjusted operating income is not a substitute for income determined in accordance with U.S. GAAP, and our definition of adjusted operating income may differ from that used by other companies; however, we believe that the presentation of adjusted operating income as we measure it for management purposes enhances the understanding of our results of operations by highlighting the results from ongoing operations and the underlying profitability of our businesses.\nSee Note 19 to the Unaudited Interim Consolidated Financial Statements for additional information regarding the presentation of segment results and our definition of adjusted operating income.\nAnnualized New Business Premiums. \nIn managing our Individual Life, Group Insurance and International Businesses segments, we analyze annualized new business premiums, which do not correspond to revenues under U.S. GAAP. Annualized new business premiums measure the current sales performance of the business, while revenues primarily reflect the renewal persistency of policies written in prior years and net investment income, in addition to current sales. Annualized new business premiums include 10% of first year premiums or deposits from single-payment products in our Individual Life and International Businesses segments. No other adjustments are made for limited-payment contracts.\n114\nTable of Contents\nThe amount of annualized new business premiums for any given period can be significantly impacted by several factors, including but not limited to: addition of new products, discontinuation of existing products, changes in credited interest rates for certain products and other product modifications, changes in premium rates, changes in tax laws, changes in regulations or changes in the competitive environment. Sales volume may increase or decrease prior to certain of these changes becoming effective, and then fluctuate in the other direction following such changes.\nAssets Under Management.\n In managing our PGIM segment, we analyze assets under management (which do not correspond directly to U.S. GAAP assets) because the principal source of revenues is fees based on assets under management. Assets under management represent the fair market value or account value of assets that we manage directly for institutional clients, retail clients, and for our general account, as well as assets invested in our products that are managed by third-party managers.\nAccount Values. \nIn managing our Retirement Strategies segment, we analyze account values, which do not correspond directly to U.S. GAAP assets. Net additions (withdrawals) in our Institutional Retirement Strategies business and sales (redemptions) in our Individual Retirement Strategies business do not correspond to revenues under U.S. GAAP but are used as a relevant measure of business activity.\nImpact of Foreign Currency Exchange Rates\nForeign currency exchange rate movements and related hedging strategies\n \nAs a U.S.-based company with significant business operations outside the U.S., particularly in Japan, we are subject to foreign currency exchange rate movements that could impact our USD-equivalent shareholder return on equity. We seek to mitigate this impact through various hedging strategies, including holding USD-denominated assets in certain of our foreign subsidiaries.\nIn order to reduce equity volatility from foreign currency exchange rate movements, we primarily utilize a yen hedging strategy that calibrates the hedge level to preserve the relative contribution of our yen-based business to the Company’s overall return on equity on a leverage neutral basis. We implement this hedging strategy utilizing a variety of instruments, including USD-denominated assets and dual currency and synthetic dual currency investments held locally in our Japanese insurance subsidiaries. The total hedge level may vary based on our periodic assessment of the relative contribution of our yen-based business to the Company’s overall return on equity.\nThe table below presents the aggregate amount of instruments that serve to hedge the impact of foreign currency exchange movements on our USD-equivalent shareholder return on equity from our Japanese insurance subsidiaries as of the dates indicated.\nSeptember 30,\n2025\nDecember 31,\n2024\n \n(in billions)\nForeign currency hedging instruments:\nUSD-denominated assets associated with yen-based entities(1)\n$\n7.7 \n$\n6.1 \nDual currency and synthetic dual currency investments(2)\n0.3 \n0.3 \nTotal foreign currency hedges\n$\n8.0 \n$\n6.4 \n__________\n(1)\nIncludes USD-denominated fixed maturities at amortized cost plus any related accrued investment income, as well as USD notional amount of foreign currency derivative contracts outstanding. Note this amount represents only those USD assets serving to hedge the impact of foreign currency volatility on equity. Separate from this program, our Japanese operations also have $88.4 billion and $83.2 billion as of September 30, 2025 and December 31, 2024, respectively, of USD-denominated assets supporting USD-denominated liabilities related to USD-denominated products.\n(2)\nDual currency and synthetic dual currency investments are held by our yen-based entities in the form of fixed maturities and loans with a yen-denominated principal component and USD-denominated interest income. The amounts shown represent the present value of future USD-denominated cash flows.\nThe USD-denominated investments that hedge the impact of foreign currency exchange rate movements on USD-equivalent shareholder return on equity from our Japanese insurance operations are reported within yen-based entities and, as a result, foreign currency exchange rate movements will impact their value reported within our yen-based Japanese insurance entities. We seek to mitigate the risk that future unfavorable foreign currency exchange rate movements will decrease the value of these USD-denominated investments reported within our yen-based Japanese insurance entities, and therefore negatively impact their equity and regulatory solvency margins, by having our Japanese insurance operations enter into currency hedging \n115\nTable of Contents\ntransactions with a subsidiary of Prudential Financial. These hedging strategies have the economic effect of moving the change in value of these USD-denominated investments due to foreign currency exchange rate movements from our Japanese yen-based entities to our USD-based entities.\nThese USD-denominated investments also pay a coupon which is generally higher than what a similar yen-denominated investment would pay. The incremental impact of this higher yield on our USD-denominated investments, as well as our dual currency and synthetic dual currency investments, will vary over time, and is dependent on the duration of the underlying investments as well as interest rate environments in both the U.S. and Japan at the time of the investments.\nImpact of intercompany foreign currency exchange rate arrangements on segment results of operations\n \nThe financial results of our International Businesses and PGIM reflect the impact of intercompany arrangements with our Corporate and Other operations pursuant to which these segments’ non-USD-denominated earnings are translated at fixed currency exchange rates that are predetermined during the third quarter of the prior year using forward currency exchange rates. Results of our Corporate and Other operations include differences between the translation adjustments recorded by the segments at the fixed currency exchange rate versus the actual average rate during the period.\nIn addition, specific to our International Businesses where we hedge certain currencies utilizing forward currency contracts with third parties, the results of our Corporate and Other operations also include the impact of any gains or losses recorded from these contracts that settled during the period, which include the impact of any over or under hedging of actual earnings that differ from projected earnings.\n \nThe table below presents, for the periods indicated, the increase (decrease) to revenues and adjusted operating income for our International Businesses, PGIM and Corporate and Other operations, reflecting the impact of these intercompany arrangements.\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nSegment impacts of intercompany arrangements:\nInternational Businesses\n$\n(7)\n$\n(9)\n$\n(6)\n$\n(3)\nPGIM\n1 \n1 \n0 \n1 \nImpact of intercompany arrangements(1)\n(6)\n(8)\n(6)\n(2)\nCorporate and Other:\nImpact of intercompany arrangements(1)\n6 \n8 \n6 \n2 \nSettlement gains (losses) on forward currency contracts(2)\n(5)\n(4)\n(4)\n(13)\nNet benefit (detriment) to Corporate and Other\n1 \n4 \n2 \n(11)\nNet impact on consolidated revenues and adjusted operating income\n$\n(5)\n$\n(4)\n$\n(4)\n$\n(13)\n__________ \n(1)\nRepresents the difference between non-USD-denominated earnings translated on the basis of weighted average monthly currency exchange rates versus fixed currency exchange rates determined in connection with the foreign currency income hedging program.\n(2)\nAs of both September 30, 2025 and 2024, the total notional amount of these forward currency contracts within our Corporate and Other operations was $0.8 billion.\nImpact of products denominated in non-local currencies on U.S. GAAP earnings\n \nWhile our international insurance operations offer products denominated in local currency, several also offer products denominated in non-local currencies. This is most notable in our Japanese operations, which currently offer primarily USD-denominated products, but have also historically offered Australian dollar (“AUD”)-denominated products. The non-local currency-denominated insurance liabilities related to these products are supported by investments denominated in corresponding currencies, including a significant portion designated as available-for-sale. While the impact from foreign currency exchange rate movements on these non-local currency-denominated assets and liabilities is economically matched, differences in the accounting for changes in the value of these assets and liabilities due to changes in foreign currency exchange rate movements have historically resulted in volatility in U.S. GAAP earnings.\n116\nTable of Contents\nAs a result, we implemented a structure in certain of our Japanese operations that disaggregated the USD- and AUD-denominated businesses into separate divisions, each with its own functional currency that aligns with the underlying products and investments. The result of this alignment was to reduce differences in the accounting for changes in the value of these assets and liabilities that arise due to changes in foreign currency exchange rate movements. For the USD- and AUD-denominated assets that were transferred under this structure, the net cumulative unrealized investment gains associated with foreign exchange remeasurement that were recorded in “Accumulated other comprehensive income (loss)” (“AOCI”) totaled $1.0 billion and $1.1 billion as of September 30, 2025 and December 31, 2024, respectively, and will be recognized in earnings within “Realized investment gains (losses), net” over time as these assets mature or are sold. Absent the sale of any of these assets prior to their stated maturity, approximately 1% of the $1.0 billion balance as of September 30, 2025 will be recognized throughout the remainder of 2025, approximately 5% will be recognized in 2026, and the remaining balance will be recognized from 2027 through 2051.\nHighly inflationary economy\nEnterprise Group, our strategic investment in Ghana, has historically utilized the Ghanaian cedi as its functional currency given it is the currency of the primary economic environment in which the entity operates. In the fourth quarter of 2023, Ghana experienced a cumulative inflation rate that exceeded 100% over a 3-year period. As a result, Ghana’s economy was deemed to be highly inflationary, resulting in reporting changes effective January 1, 2024. Under U.S. GAAP, the financial statements of a foreign entity in a highly inflationary economy are to be remeasured as if its functional currency (formerly the Ghanaian cedi) is the reporting currency of its parent reporting entity (the USD) on a prospective basis. While this changed how the results of Enterprise Group were remeasured and/or translated into USD, the impact to our financial statements was not material nor is it expected to have a material impact to our financial statements in future periods given the relative size of the investment.\nAccounting Policies & Pronouncements\nApplication of Critical Accounting Estimates\nThe preparation of financial statements in conformity with U.S. GAAP requires the application of accounting policies that often involve a significant degree of judgment. Management, on an ongoing basis, reviews the estimates and assumptions used in the preparation of the Company’s financial statements. If management determines that modifications to assumptions and estimates are appropriate given current facts and circumstances, the Company’s results of operations and financial position as reported in the Unaudited Interim Consolidated Financial Statements could change significantly.\nManagement believes the accounting policies relating to the following areas are most dependent on the application of estimates and assumptions and require management’s most difficult, subjective, or complex judgments:\n•\nInsurance liabilities;\n•\nGoodwill;\n•\nValuation of investments including derivatives, measurement of allowance for credit losses, and recognition of other-than-temporary impairments (“OTTI”);\n•\nPension and other postretirement benefits;\n•\nTaxes on income; and\n•\nReserves for contingencies, including reserves for losses in connection with unresolved legal matters.\nMarket Performance - Equity and Interest Rate Assumptions\nThe liability for future policy benefits for certain of our universal life type products includes quarterly adjustments for the impact of changes to our estimate of future rates of returns on investments to reflect actual fund performance and market conditions. A portion of the returns on investments for our variable life contracts are dependent upon the total rate of return on assets held in separate account investment options. This rate of return influences the fees we earn and expected claims to be paid on variable life contracts, as well as other sources of profit. Returns that are higher than our expectations for a given period produce higher than expected account balances, which increase the future fees we expect to earn on variable life contracts and decrease expected claims to be paid on variable life contracts. The opposite occurs when returns are lower than our expectations. \nThe weighted average rate of return assumptions used in developing estimated market returns consider many factors specific to each product type, including asset durations, asset allocations and other factors. With regard to equity market assumptions, the near-term future rate of return assumption used in evaluating liabilities for future policy benefits for certain of \n117\nTable of Contents\nour products, primarily our domestic and international variable life insurance products, is generally updated each quarter and is derived using a reversion to the mean approach, a common industry practice. Under this approach, we consider historical equity returns and adjust projected equity returns over an initial future period of five years (the “near-term”) so that equity returns converge to the long-term expected rate of return. If the near-term projected future rate of return is greater than our near-term maximum future rate of return of 15.0%, we use our maximum future rate of return. If the near-term projected future rate of return is lower than our near-term minimum future rate of return of 0%, we use our minimum future rate of return. As of September 30, 2025, our domestic variable life insurance businesses assume an 8.0% long-term equity expected rate of return and a 2.2% near-term mean reversion equity expected rate of return, and our international variable life insurance business assumes a 5.5% long-term equity expected rate of return and a 0.4% near-term mean reversion equity expected rate of return.\nWith regard to interest rate assumptions used in evaluating liabilities for future policy benefits for certain of our products, we update the long-term and near-term future rates used to project fixed income returns annually and quarterly, respectively. As a result of our 2025 annual reviews and update of assumptions and other refinements, we kept our long-term expectation of the 10-year U.S. Treasury rate unchanged and continue to grade to a rate of 3.5% over ten years, and increased our long-term expectation of the 10-year Japanese Government Bond yield by 25 basis points and now grade to a rate of 1.5% over ten years. As part of our quarterly market experience updates, we update our near-term projections of interest rates to reflect changes in current rates.\nFor further discussion of impacts that could result from changes in these key estimates and assumptions, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Accounting Policies and Pronouncements—Application of Critical Accounting Estimates” in our Annual Report on Form 10-K for the year ended December 31, 2024.\nAdoption of New Accounting Pronouncements\nSee Note 2 to the Unaudited Interim Consolidated Financial Statements for accounting pronouncements issued but not yet adopted and newly adopted accounting pronouncements.\nResults of Operations by Segment\nPGIM\nOperating Results\nThe following table sets forth PGIM’s operating results for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nOperating results(1):\nRevenues\n$\n1,095 \n$\n1,021 \n$\n3,123 \n$\n2,974 \nExpenses\n851 \n780 \n2,494 \n2,358 \nAdjusted operating income\n244 \n241 \n629 \n616 \nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests\n23 \n11 \n75 \n29 \nOther adjustments(2)\n(1)\n(3)\n26 \n(16)\nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n266 \n$\n249 \n$\n730 \n$\n629 \n__________\n(1)\nCertain of PGIM’s investment activities are based in currencies other than the USD and are therefore subject to foreign currency exchange rate risk. The financial results of PGIM include the impact of an intercompany arrangement with our Corporate and Other operations designed to mitigate the impact of exchange rate changes on PGIM’s USD-equivalent earnings. For additional information regarding this intercompany arrangement, see “—Results of Operations—Impact of Foreign Currency Exchange Rates,” above.\n(2)\nIncludes certain components of consideration for business acquisitions, which are recognized as compensation expense over the requisite service periods.\n118\nTable of Contents\nAdjusted Operating Income\nThree Month Comparison. \nAdjusted operating income increased $3 million, primarily reflecting higher net asset management fees, higher net service, distribution and other revenues driven by a gain on the sale of our asset management business in Taiwan, and higher net other related revenues. These impacts were largely offset by higher operating expenses, primarily reflecting charges resulting from a business reorganization. \nNine Month Comparison. \nAdjusted operating income increased $13 million, primarily reflecting higher net asset management fees and higher net service, distribution and other revenues driven by a gain on the sale of our asset management business in Taiwan. These impacts were partially offset by higher operating expenses, primarily reflecting charges resulting from a business reorganization, and lower net other related revenues.\nRevenues and Expenses\nThe following table sets forth PGIM’s revenues, presented on a basis consistent with the table above under “—Operating Results,” by type:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nRevenues by type:\nAsset management fees by source:\nInstitutional - Third Party(1)\n$\n395 \n$\n373 \n$\n1,169 \n$\n1,106 \nRetail - Third Party(1)\n231 \n221 \n675 \n637 \nAffiliated(1)(2)\n218 \n209 \n653 \n611 \nTotal asset management fees\n844 \n803 \n2,497 \n2,354 \nOther related revenues by source:\nIncentive fees\n8 \n20 \n42 \n80 \nTransaction fees\n4 \n5 \n16 \n19 \nSeed and co-investments\n39 \n37 \n73 \n108 \nCommercial mortgage(3)\n42 \n28 \n82 \n47 \nTotal other related revenues\n93 \n90 \n213 \n254 \nService, distribution and other revenues\n158 \n128 \n413 \n366 \nTotal revenues\n$\n1,095 \n$\n1,021 \n$\n3,123 \n$\n2,974 \n__________\n(1)\nPrior period amounts have been updated to conform to current period presentation.\n(2)\nIncludes revenues from the Company’s general account assets, as well as certain separate account assets of the Company’s insurance and retirement businesses managed by PGIM.\n(3)\nIncludes mortgage origination revenues from our commercial mortgage origination and servicing business.\nThree Month Comparison. \nRevenues increased $74 million. Asset management fees increased, \nprimarily reflecting higher average assets under management driven by the impact of equity market and fixed income appreciation and net inflows. Service, distribution and other revenues increased, primarily reflecting the gain on sale of our asset management business in Taiwan and higher revenues from certain consolidated funds (which were fully offset by higher expenses related to noncontrolling interests in these funds). Other related revenues increased, primarily reflecting higher commercial mortgage origination revenues driven by higher loan production, largely offset by lower incentive fees driven by less favorable investment performance.\nExpenses increased $71 million, primarily reflecting higher operating expenses, driven by charges resulting from a business reorganization, and higher compensation expenses, primarily due to business growth. Also contributing to the increase were higher variable expenses corresponding to higher net fee-based earnings, and higher revenues from certain consolidated funds, as described above.\n119\nTable of Contents\nNine\n Month Comparison.\n \nRevenues increased $149 million. \nAsset management fees increased, \nprimarily reflecting higher average assets under management driven by the impact of equity market and fixed income appreciation, net inflows and strong investment performance. Service, distribution and other revenues increased, primarily reflecting the gain on sale of our asset management business in Taiwan and higher revenues from certain consolidated funds (which were fully offset by higher expenses related to noncontrolling interests in these funds). These variances were partially offset by lower other related revenues, primarily reflecting lower incentive fees and lower seed and co-investments earnings, driven by less favorable investment performance, partially offset by higher commercial mortgage origination revenues driven by higher loan production.\nExpenses increased $136 million, primarily reflecting higher operating expenses, including charges resulting from a business reorganization, and higher compensation expenses, primarily due to business growth, partially offset by decreases related to certain long-term employee compensation plans. Also contributing to the increase were higher variable expenses corresponding to higher net fee-based earnings, and higher revenues from certain consolidated funds, as described above.\nAssets Under Management\nThe following table sets forth assets under management by asset class as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\n \n(in billions)\nAssets Under Management(1) (at fair value):\nPublic equity\n$\n227.7 \n$\n215.7 \n$\n213.7 \nPublic fixed income\n901.9 \n832.2 \n863.4 \nReal estate\n133.6 \n127.2 \n131.8 \nPrivate credit and other alternatives\n126.6 \n118.0 \n119.2 \nMulti-asset\n80.2 \n82.1 \n71.8 \nTotal PGIM assets under management\n$\n1,470.0 \n$\n1,375.2 \n$\n1,399.9 \nAssets under management within other reporting segments(2)\n142.0 \n137.2 \n158.0 \nTotal PFI assets under management\n$\n1,612.0 \n$\n1,512.4 \n$\n1,557.9 \n__________\n(1)\n“Public equity” represents stock ownership interest in a corporation or partnership (excluding hedge funds) or real estate investment trust. “Public fixed income” represents debt instruments that pay interest and usually have a maturity (excluding mortgages). “Real estate” includes direct real estate equity and real estate mortgages. “Private credit and other alternatives” includes private credit, private equity, hedge funds and other alternative strategies. “Multi-asset” includes funds or products that invest in more than one asset class, balancing equity and fixed income funds and target date funds.\n(2)\nPrimarily includes assets related to certain insurance and retirement products in our U.S. Businesses and Corporate and Other operations, and certain general account assets in our International Businesses. These assets are not directly managed by PGIM, but rather are invested in non-proprietary funds or are managed by either the divisions themselves or by our Chief Investment Officer Organization.\nThe following table sets forth assets under management by source as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\n \n(in billions)\nAssets Under Management (at fair value):\nInstitutional - Third Party(1)\n$\n654.9 \n$\n601.1 \n$\n610.3 \nRetail - Third Party(1)\n265.2 \n244.9 \n245.1 \nAffiliated(1)(2)\n549.9 \n529.2 \n544.5 \nTotal PGIM assets under management\n$\n1,470.0 \n$\n1,375.2 \n$\n1,399.9 \nAssets under management within other reporting segments(3)\n142.0 \n137.2 \n158.0 \nTotal PFI assets under management\n$\n1,612.0 \n$\n1,512.4 \n$\n1,557.9 \n__________\n(1)\nPrior period amounts have been updated to conform to current period presentation.\n(2)\nIncludes the Company’s general account assets, as well as certain separate account assets of the Company’s insurance and retirement businesses managed by PGIM.\n120\nTable of Contents\n(3)\nPrimarily includes assets related to certain insurance and retirement products in our U.S. Businesses and Corporate and Other operations, and certain general account assets in our International Businesses. These assets are not directly managed by PGIM, but rather are invested in non-proprietary funds or are managed by either the divisions themselves or by our Chief Investment Officer Organization.\nThe following table sets forth the component changes in PGIM’s assets under management for the periods indicated:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\nTwelve\nMonths\nEnded\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n \n(in billions)\nBeginning assets under management\n$\n1,440.7 \n$\n1,328.1 \n$\n1,375.2 \n$\n1,298.1 \n$\n1,399.9 \nInstitutional third-party flows(1)\n0.3 \n(2.2)\n10.5 \n19.5 \n12.7 \nRetail third-party flows\n0.3 \n1.3 \n(2.7)\n1.2 \n(2.5)\nTotal third-party flows(1)\n0.6 \n(0.9)\n7.8 \n20.7 \n10.2 \nAffiliated flows(1)(2)\n1.8 \n6.5 \n2.3 \n15.6 \n11.3 \nTotal net flows(1)\n2.4 \n5.6 \n10.1 \n36.3 \n21.5 \nRealizations and distributions(1)(3)\n(4.6)\n(2.4)\n(11.2)\n(7.1)\n(14.0)\nMarket appreciation (depreciation)(4)\n38.0 \n64.8 \n96.5 \n88.2 \n68.9 \nForeign exchange rate impact\n(1.5)\n8.9 \n7.0 \n(1.1)\n(1.3)\nNet money market activity and other increases (decreases)\n(5.0)\n(5.1)\n(7.6)\n(14.5)\n(5.0)\nEnding assets under management\n$\n1,470.0 \n$\n1,399.9 \n$\n1,470.0 \n$\n1,399.9 \n$\n1,470.0 \n__________\n(1)\nPrior period amounts have been updated to conform to current period presentation.\n(2)\nRepresents assets that PGIM manages for the benefit of other reporting segments within the Company. Additions and withdrawals of these assets are attributable to third-party product inflows and outflows in other reporting segments.\n(3)\nRealizations reflect proceeds from the disposition or monetization of assets from closed end funds and from collateralized loan obligations. Distributions reflect income and dividend distributions related to certain closed and open ended private alternative funds and collateralized loan obligations.\n(4)\nIncludes income reinvestment, where applicable.\nPGIM’s assets under management as of September 30, 2025 increased $70 billion in comparison to the prior year quarter, primarily driven by equity market and fixed income appreciation, net inflows and strong investment performance. PGIM’s assets under management as of September 30, 2025 increased $95 billion in comparison to the prior year end, primarily driven by fixed income and equity market appreciation, net inflows and favorable foreign exchange rate impacts.\nPrivate Capital Deployment\nPrivate capital deployment is indicative of the pace and magnitude of capital that is invested and will result in future revenues that may include management fees, transaction fees, incentive fees and servicing revenues, as well as future costs to manage these assets. \nPrivate capital deployment represents the gross value of private capital invested in real estate debt and equity, and private credit and equity asset classes. Assets under management resulting from private capital deployment are primarily included in “Real estate” and “Private credit and other alternatives” in the “—Assets Under Management— by asset class table” above. As of September 30, 2025, these asset classes increased $15.0 billion compared to December 31, 2024,\n primarily reflecting private capital net inflows, market appreciation and favorable foreign exchange rate impacts, partially offset by realizations and distributions.\nPrivate capital deployment includes PGIM’s real estate agency debt business, which consists of agency commercial mortgage loans that are originated and sold to third-party investors. PGIM continues to service these loans; however, they are not included in assets under management.\n121\nTable of Contents\nThe following table sets forth PGIM’s private capital deployed by asset class for the periods indicated:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n \n(in billions)\nPrivate capital deployed:\nReal estate debt and equity\n$\n7.5 \n$\n7.4 \n$\n18.6 \n$\n14.9 \nPrivate credit and equity(1)\n6.8 \n4.9 \n18.1 \n15.9 \nTotal private capital deployed(1)\n$\n14.3 \n$\n12.3 \n$\n36.7 \n$\n30.8 \n__________\n(1)\nPrior period amounts have been updated to conform to current period presentation.\nSeed and Co-Investments\nAs of September 30, 2025 and December 31, 2024, PGIM had approximately $1,370 million and $1,079 million of seed investments and $396 million and $415 million of co-investments at carrying value, respectively, primarily consisting of public fixed income, public equity, real estate investments, and private credit and other alternatives.\nRetirement Strategies\nOperating Results \nThe following table sets forth Retirement Strategies’ operating results for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nOperating results(1):\nRevenues:\nInstitutional Retirement Strategies\n$\n5,754 \n$\n9,473 \n$\n12,366 \n$\n25,052 \nIndividual Retirement Strategies\n1,429 \n1,318 \n4,088 \n3,793 \nTotal revenues\n7,183 \n10,791 \n16,454 \n28,845 \nBenefits and expenses:\nInstitutional Retirement Strategies\n5,274 \n9,035 \n11,078 \n23,623 \nIndividual Retirement Strategies\n943 \n858 \n2,812 \n2,454 \nTotal benefits and expenses\n6,217 \n9,893 \n13,890 \n26,077 \nAdjusted operating income:\nInstitutional Retirement Strategies\n480 \n438 \n1,288 \n1,429 \nIndividual Retirement Strategies\n486 \n460 \n1,276 \n1,339 \nTotal adjusted operating income\n966 \n898 \n2,564 \n2,768 \nRealized investment gains (losses), net, and related charges and adjustments\n(352)\n(302)\n(882)\n(170)\nChange in value of market risk benefits, net of related hedging gains (losses)\n320 \n(145)\n(466)\n(331)\nMarket experience updates\n(3)\n0 \n(10)\n0 \nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests\n0 \n(1)\n2 \n0 \nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n931 \n$\n450 \n$\n1,208 \n$\n2,267 \n__________\n(1)\nThe amounts for the three and nine months ended September 30, 2024 reflect the correction of an error related to indexed variable and fixed annuity products within the Individual Retirement Strategies business. See below for additional information.\n122\nTable of Contents\nAs previously disclosed in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024, during the fourth quarter of 2024, the Company identified an immaterial error in the application of adjusted operating income, which resulted in an overstatement thereof for indexed variable and fixed annuity products within the Retirement Strategies segment in the first three quarters of 2024. As a result, the Company voluntarily revised its historical adjusted operating income for the relevant periods, resulting in a decrease in pre-tax adjusted operating income of $68 million and $149 million for the three and nine months ended September 30, 2024, respectively.\nOur Individual Retirement Strategies business includes both fixed and variable annuities that may include optional guaranteed living benefit riders (e.g., guaranteed minimum income benefits (“GMIB”), guaranteed minimum accumulation benefits (“GMAB”), guaranteed minimum withdrawal benefits (“GMWB”) and guaranteed minimum income and withdrawal benefits (“GMIWB”)), and/or optional death benefit riders (e.g., guaranteed minimum death benefits (“GMDB”)). We also offer fixed annuities that provide a guarantee of principal and interest credited at rates we determine (subject to certain contractual minimums) or at rates based upon the performance of an index (subject to caps or participation rates), as well as indexed variable annuities that provide several index crediting strategies and varying levels of downside protection at predetermined levels and durations. The results of our business are generally included in adjusted operating income, with exceptions related to certain guarantees, as discussed below.\nUnder U.S. GAAP, our guaranteed living and death benefit riders on variable annuities (e.g., GMAB, GMIB, GMWB, GMIWB and GMDB) are accounted for as MRBs and reported at fair value. For purposes of measuring segment performance, adjusted operating income excludes the changes in fair value of MRBs and instead reflects the performance of these riders in net income, net of related hedges, in “Change in value of market risk benefits, net of related hedging gains (losses),” except for the portion of the change attributable to changes in the Company’s NPR which is recorded in OCI.\nUnder U.S. GAAP, policyholder liabilities associated with our fixed and variable indexed annuity products are recorded in “Policyholders’ account balances,” and include both the contract value that has accrued to the benefit of the policyholder and the fair value of embedded derivative instruments associated with the index-linked features for these products. The change in the liability for these products is measured utilizing a valuation methodology required under U.S GAAP and includes the fair value of all index credits for the current term and future projected renewals of the policy. For the purpose of measuring segment performance, however, adjusted operating income reflects only the change in the liability associated with the current term elected by the policyholder, which is the component of the liability the Company hedges based on current contractual index-crediting terms, and which is offset by the change in the value of the corresponding hedge assets. Adjusted operating income excludes the change in the liability associated with all future projected renewals, which the Company does not hedge, consistent with the Company and policyholder optionality that exists at renewal.\nAdjusted Operating Income\nThree Month Comparison\n. Adjusted operating income from our Institutional Retirement Strategies business increased $42 million, primarily driven by higher net investment spread results reflecting higher income from non-coupon investments and an increase in account values due to business growth, partially offset by lower income from\n \nderivatives. This variance was partially offset by less favorable underwriting results and higher operating expenses.\nAdjusted operating income from our Individual Retirement Strategies business increased $26 million primarily driven by higher net investment spread results due to growth in indexed variable and fixed annuities and higher income from non-coupon investments, partially offset by the impact of lower short-term interest rates. This variance was partially offset by lower fee income, net of distribution expenses, due to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets and higher amortization costs. \nNine Month Comparison\n. Adjusted operating income from our Institutional Retirement Strategies business decreased $141 million, including an unfavorable comparative net impact from our annual reviews and update of assumptions and other refinements. Results for 2025 included a $32 million net charge from this update, while results for 2024 included a net benefit of $132 million. Excluding this item, adjusted operating income increased $23 million, primarily driven by higher net investment spread results reflecting higher income from non-coupon investments and an increase in account values due to business growth, partially offset by lower income from\n \nderivatives. Also contributing to the variance was higher fee income due to business growth of longevity reinsurance transactions, partially offset by higher operating expenses. \nAdjusted operating income from our Individual Retirement Strategies business decreased $63 million, including an unfavorable comparative net impact from our annual reviews and update of assumptions and other refinements. Results for 2025 included a net charge of $81 million, mainly due to the establishment of reserves for certain fixed annuity products, while the results for the second quarter of 2024 included a net benefit of $8 million. Excluding this item, adjusted operating income \n123\nTable of Contents\nincreased $26 million, primarily reflecting higher net investment spread results due to growth in indexed variable and fixed annuities and higher income from non-coupon investments, partially offset by the impact of lower short-term interest rates. This variance was partially offset by lower fee income, net of distribution expenses,\n \ndue to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets and higher amortization costs. \nRevenues, Benefits and Expenses\nThree Month Comparison\n. Revenues from our Institutional Retirement Strategies business decreased $3,719 million, primarily reflecting lower pension risk transfer premiums due to lower sales in the current quarter, with corresponding offsets in policyholders’ benefits, as discussed below.\nBenefits and expenses of our Institutional Retirement Strategies business decreased $3,761 million, primarily driven by a decrease in policyholders’ benefits, including changes in reserves, related to the lower pension risk transfer premiums discussed above\n.\nRevenues from our Individual Retirement Strategies business increased $111 million, primarily driven by higher net investment income due to growth in indexed variable and fixed annuities and higher income from non-coupon investments. This variance was partially offset by lower asset management and service fees, as well as lower policy charges and fee income due to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets. Also contributing to the variance was lower other income driven by the impact of less favorable short-term interest rates on collateral posted to counterparties.\nBenefits and expenses of our Individual Retirement Strategies business increased $85 million, primarily driven by higher interest credited to policyholders’ account balances and higher amortizations costs reflecting business growth, partially offset by lower general and administrative expenses, net of capitalization.\nNine Month Comparison\n. Revenues from our Institutional Retirement Strategies business decreased $12,686 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, revenues decreased $13,074 million primarily reflecting lower pension risk transfer premiums due to the absence of significant sales that occurred in the prior year period, with corresponding offsets in policyholders’ benefits, as discussed below.\nBenefits and expenses of our Institutional Retirement Strategies business decreased $12,545 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, benefits and expenses decreased $13,097 million, primarily driven by a decrease in policyholders’ benefits, including changes in reserves, related to the lower pension risk transfer premiums discussed above\n.\nRevenues from our Individual Retirement Strategies business increased $295 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, revenues increased $287 million primarily driven by higher net investment income from growth in indexed variable and fixed annuities and higher income from non-coupon investments. This variance was partially offset by lower asset management and service fees, as well as lower policy charges and fee income due to lower average separate account values driven by net outflows from the run-off of the traditional variable annuity block, partially offset by favorable equity markets. Also contributing to the variance was lower other income driven by the impact of less favorable short-term interest rates on collateral posted to counterparties.\nBenefits and expenses of our Individual Retirement Strategies business increased $358 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, benefits and expenses increased $261 million, primarily driven by higher interest credited to policyholders’ account balances and higher amortization costs reflecting business growth, partially offset by lower general and administrative expenses, net of capitalization.\nAccount Values\nInstitutional Retirement Strategies. \nAccount values are a significant driver of our operating results and are primarily driven by net additions (withdrawals) and the impact of market changes. The investment income and interest we credit to policyholders on our spread-based products varies with the level of general account values. The income we earn on most of our fee-based products varies with the level of fee-based account values as many policy fees are determined by these values. \n124\nTable of Contents\nThe following tables set forth account value information of Institutional Retirement Strategies’ products for the periods indicated. Account values include both internally- and externally-managed client balances as the total balances drive revenue for the Institutional Retirement Strategies business. For additional information regarding internally-managed balances, see “—PGIM.”\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nTwelve\nMonths\nEnded\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n(in millions)\nTotal Institutional Retirement Strategies:\nBeginning total account value, gross(1)\n$\n307,306 \n$\n274,128 \n$\n288,202 \n$\n267,654 \n$\n287,829 \nAdditions(2)\n6,353 \n11,081 \n22,258 \n26,082 \n32,507 \nWithdrawals and benefits\n(6,460)\n(6,619)\n(18,627)\n(19,200)\n(24,754)\nChange in market value, interest credited and interest income\n3,521 \n4,476 \n8,680 \n9,050 \n10,220 \nOther(3)\n(3,206)\n4,763 \n7,001 \n4,243 \n1,712 \nEnding total account value, gross\n307,514 \n287,829 \n307,514 \n287,829 \n307,514 \nReinsurance ceded\n(8,911)\n(9,062)\n(8,911)\n(9,062)\n(8,911)\nEnding total account value, net\n$\n298,603 \n$\n278,767 \n$\n298,603 \n$\n278,767 \n$\n298,603 \nAmounts included in “Ending account value, net” above:\nInvestment-only stable value wraps\n$\n61,777 \n$\n62,189 \nInternational reinsurance(4)\n124,795 \n108,927 \nGroup annuities and other products\n112,031 \n107,651 \nTotal\n$\n298,603 \n$\n278,767 \nAdditions by product(2): \nInvestment-only stable value wraps\n$\n501 \n$\n453 \n$\n2,456 \n$\n1,105 \n$\n3,365 \nInternational reinsurance\n1,475 \n2,801 \n11,979 \n4,002 \n17,954 \nGroup annuities and other products\n4,377 \n7,827 \n7,823 \n20,975 \n11,188 \nTotal\n$\n6,353 \n$\n11,081 \n$\n22,258 \n$\n26,082 \n$\n32,507 \n__________\n(1)\nBeginning total account values, net of reinsurance ceded, were $298,407 million and $264,999 million for the three months ended September 30, 2025 and 2024, respectively, $279,191 million and $258,417 million for the nine months ended September 30, 2025 and 2024, respectively, and $278,767 million for the twelve months ended September 30, 2025.\n(2)\nAdditions primarily include: group annuities and funded pension reinsurance calculated based on premiums received; longevity reinsurance contracts calculated as the present value of future projected benefits; investment-only stable value contracts calculated as the fair value of customers’ funds held in a client-owned trust; and funding agreements issued calculated based on premiums received.\n(3)\n“Other” activity includes the effect of foreign exchange rate changes associated with our British pound sterling denominated reinsurance business and changes in asset balances for externally-managed accounts. For the three months ended September 30, 2025 and 2024, “Other” activity also includes $940 million in receipts offset by $767 million in payments, and $865 million in receipts offset by $736 million in payments, respectively, and for the nine months ended September 30, 2025 and 2024, includes $2,991 million in receipts offset by $2,849 million in payments and $2,548 million in receipts offset by $2,587 million in payments, respectively, related to funding agreements backed by commercial paper that typically have maturities of less than 90 days. \n(4)\nRepresents notional amounts based on present value of future benefits under international reinsurance contracts.\nThe increase in Institutional Retirement Strategies net account values for the three months ended September 30, 2025 reflects interest credited on customer funds and an increase in the market values of assets, largely offset by the negative impact of foreign exchange rate changes and net withdrawals and benefits.\nThe increase in Institutional Retirement Strategies net account values for the nine and twelve months ended September 30, 2025 reflects interest credited on customer funds and an increase in the market values of assets, net additions primarily driven by longevity reinsurance transactions and the positive impact of foreign exchange rate changes.\n125\nTable of Contents\nIndividual Retirement Strategies. \nAccount values are a significant driver of our operating results. Since most fees are determined by the level of separate account assets, fee income varies primarily based on the level of account values. Account values are driven by net flows from new business sales, surrenders, withdrawals and benefit payments, policy charges and the impact of positive or negative market value changes. \nThe following tables set forth account value information of Individual Retirement Strategies’ products for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\nTwelve\nMonths\nEnded\nSeptember 30,\n2025\n2024\n2025\n2024\n2025\n(in millions)\nTotal Individual Retirement Strategies:\nBeginning total account value, gross(1)\n$\n142,592 \n$\n135,375 \n$\n138,639 \n$\n129,708 \n$\n140,845 \nSales\n3,381 \n3,624 \n10,003 \n10,424 \n13,646 \nFull surrenders and death benefits\n(3,154)\n(2,861)\n(8,655)\n(8,215)\n(11,533)\nSales, net of full surrenders and death benefits\n227 \n763 \n1,348 \n2,209 \n2,113 \nPartial withdrawals and other benefit payments\n(1,291)\n(1,221)\n(3,967)\n(3,732)\n(5,415)\nNet flows\n(1,064)\n(458)\n(2,619)\n(1,523)\n(3,302)\nChange in market value, interest credited and other activity\n6,655 \n6,478 \n13,179 \n14,307 \n12,180 \nPolicy charges\n(520)\n(550)\n(1,536)\n(1,647)\n(2,060)\nEnding total account value, gross\n147,663 \n140,845 \n147,663 \n140,845 \n147,663 \nReinsurance ceded\n(11,391)\n(12,020)\n(11,391)\n(12,020)\n(11,391)\nEnding total account value, net\n$\n136,272 \n$\n128,825 \n$\n136,272 \n$\n128,825 \n$\n136,272 \nAmounts included in “Ending account value, net” above:\nFlexGuard suite(2)\n$\n40,160 \n$\n28,317 \nVariable annuities(3)\n82,586 \n90,950 \nFixed annuities\n13,526 \n9,558 \nTotal\n$\n136,272 \n$\n128,825 \nSales by product:\nFlexGuard suite(2)\n$\n1,803 \n$\n2,244 \n$\n5,855 \n$\n6,190 \n$\n8,368 \nVariable annuities(3)\n46 \n34 \n127 \n117 \n201 \nFixed annuities\n1,532 \n1,346 \n4,021 \n4,117 \n5,077 \nTotal\n$\n3,381 \n$\n3,624 \n$\n10,003 \n$\n10,424 \n$\n13,646 \n__________\n(1)\nBeginning total account values, net, were $131,519 million and $123,899 million for the three months ended September 30, 2025 and 2024, respectively, $127,120 million and $117,911 million for the nine months ended September 30, 2025 and 2024, respectively, and $128,825 million for the twelve months ended September 30, 2025.\n(2)\nIncludes Prudential FlexGuard and FlexGuard Income index variable annuities.\n(3)\nIncludes Prudential Premier Investment, MyRock and other variable contracts with and without guaranteed minimum income and withdrawal benefits. \nIndividual Retirement Strategies sales, net of full surrenders and death benefits, for the three and nine months ended September 30, 2025 decreased in comparison to the prior year period driven by higher full surrenders and lower sales of indexed variable annuities products.\nThe increases in Individual Retirement Strategies net account values for the three months, nine month and twelve months ended September 30, 2025 primarily reflect market value appreciation. Net flows decreased across all periods, driven by net outflows from the run-off of the traditional variable annuity block, partially offset by net indexed variable and fixed annuity inflows.\n126\nTable of Contents\nRisks and Risk Mitigants\nThe following is a summary of certain risks associated with Individual Retirement Strategies’ products, certain strategies in mitigating those risks including any updates to those strategies since the previous year-end, and the related financial results. \nFixed Annuity Risks and Risk Mitigants. \nThe primary risk exposure of our fixed annuity products relates to investment risks we bear for providing customers a minimum guaranteed interest rate or an index-linked interest rate required to be credited to the customer’s account value, which include interest rate fluctuations and/or sustained periods of low interest rates, and credit risk related to the underlying investments. We manage these risk exposures primarily through our investment strategies, inclusive of derivatives, and product design features, which include credit rate resetting subject to the minimum guaranteed interest rate as well as surrender charges applied during the early years of the contract that help to provide protection for premature withdrawals. In addition, a portion of our fixed products has a market value adjustment provision that affords protection of lapse in the case of rising interest rates. We also manage these risk exposures through external reinsurance for certain of our fixed annuity products. For additional information regarding our external reinsurance agreements, see Note 12 to the Unaudited Interim Consolidated Financial Statements. \nIndexed Variable Annuity Risks and Risk Mitigants. \nThe primary risk exposure of our indexed variable annuity products relates to the investment risks we bear in order to credit to the customer’s account balance the required crediting rate based on the performance of the elected indices at the end of each term. We manage this risk primarily through our investment strategies, inclusive of derivatives, and product design features, which include credit rate resetting subject to contractual minimums as well as surrender charges applied during the early years of the contract that help to provide protection for premature withdrawals. In addition, our indexed variable annuity strategies have an interim value provision that provides some protection from lapse in the case of rising interest rates.\nVariable Annuity Risks and Risk Mitigants. \nThe primary risk exposures of our variable annuity contracts relate to actual deviations from, or changes to, the assumptions used in the original pricing of these products, including capital markets assumptions such as equity market returns, interest rates and market volatility, along with actuarial assumptions such as contractholder mortality, the timing and amount of annuitization and withdrawals, and contract lapses. For these risk exposures, achievement of our expected returns is subject to the risk that actual experience will differ from the assumptions used in the original pricing of these products. We manage our exposure to certain risks driven by fluctuations in capital markets primarily through a combination of (i) Product Design Features, and (ii) our Asset Liability Management Strategy, as discussed below. We also manage these risk exposures through external reinsurance for certain of our variable annuity products. For additional information regarding our external reinsurance agreements, see Note 12 to the Unaudited Interim Consolidated Financial Statements.\ni.\nProduct Design Features:\nA portion of the variable annuity contracts that we offered include an automatic rebalancing feature, also referred to as an asset transfer feature. This feature is implemented at the contract level, and transfers assets between certain variable investment sub-accounts selected by the annuity contractholder and, depending on the benefit feature, a fixed-rate account in the general account or a bond fund sub-account within the separate accounts. The objective of the automatic rebalancing feature is to reduce our exposure to equity market risk and market volatility. Other product design features we utilize include, among others, asset allocation restrictions, minimum issuance age requirements and certain limitations on the amount of purchase payments, as well as a required minimum allocation to our general account for certain of our products. In addition, there is diversity in our fee arrangements, as certain fees are primarily based on the benefit guarantee amount, the contractholder account value and/or premiums, which helps preserve certain revenue streams when market fluctuations cause account values to decline.\nii.\nAsset Liability Management (“ALM”) Strategy (including fixed income instruments and derivatives):\nWe employ an ALM strategy that utilizes a combination of both traditional fixed income instruments and derivatives to meet expected liabilities associated with our annuity guarantees that under U.S. GAAP are considered MRBs. The MRB liability that we hedge consists of expected living and death benefit claims under various market conditions, which are managed using fixed income instruments, derivatives, or a combination thereof. For our PDI variable annuity, we utilize fixed income instruments to meet expected liabilities. For the portion of our ALM strategy executed with derivatives, we enter into a range of exchange-traded and over-the-counter (“OTC”) equity, interest rate and credit derivatives, including, but not limited to: equity and treasury futures; total return, credit default and interest rate swaps; and options including equity options, swaptions, and floors and caps. The intent of this strategy is to more efficiently manage the capital and liquidity associated with these products while continuing to mitigate fluctuations in net income due to movements in capital markets. To achieve this, we periodically \n127\nTable of Contents\nreview and recalibrate the ALM strategy by optimizing the mix of derivatives and fixed income instruments to achieve expected outcomes.\nUnder our ALM strategy, we expect differences in the U.S. GAAP net income impact between the changes in value of the fixed income instruments (either designated as available-for-sale or designated as trading) and derivatives as compared to the changes in the MRB liability these assets support. These differences can be primarily attribut\ned to two \ndistinct areas:\n•\nDifferent accounting treatment between liabilities and assets supporting those liabilities\n. \nUnder U.S. GAAP, changes in the fair value of the derivative instruments and fixed income instruments designated as trading, and MRBs, excluding the changes in the Company’s non-performance risk (“NPR”) spreads, are immediately reflected in net income, while changes in the fair value of fixed income instruments that are designated as available-for-sale are recorded as unrealized gains (losses) in other comprehensive income.\n•\nGeneral hedge results. \nFor the derivative portion of the ALM strategy, the net hedging impact (the extent to which the changes in value of the hedging instruments offset the change in value of the portion of the MRBs we are hedging) may be impacted by a number of factors, including: cash flow timing differences between our hedging instruments and the corresponding portion of the MRBs we are hedging, basis differences attributable to actual underlying contractholder funds to be hedged versus hedgeable indices, rebalancing costs related to dynamic rebalancing of hedging instruments as markets move, certain elements of the MRBs that may not be hedged (including certain actuarial assumptions), and implied and realized market volatility on the hedge positions relative to the portion of the MRBs we seek to hedge.\nProduct Specific Risks and Risk Mitigants\nAs noted above, the risks associated with our \nIndividual Retirement Strategies’ \nproducts are mitigated through product design features, including automatic rebalancing, as well as through our ALM strategy and external reinsurance. The following table sets forth the risk management profile of our living benefit guarantees and guaranteed minimum death benefit (“GMDB”) features as of the periods indicated:\nSeptember 30, 2025\nDecember 31, 2024\nSeptember 30, 2024\nAccount\nValue\n% of\nTotal\nAccount\nValue\n% of\nTotal\nAccount\nValue\n% of\nTotal\n($ in millions)\nLiving benefit/GMDB features(1):\nBoth ALM strategy and automatic rebalancing(2)(3)\n$\n62,371 \n48 \n%\n$\n64,856 \n52 \n%\n$\n68,928 \n54 \n%\nALM strategy only(3)\n1,714 \n1 \n%\n1,782 \n1 \n%\n1,901 \n1 \n%\nAutomatic rebalancing only\n64 \n0 \n%\n77 \n0 \n%\n77 \n0 \n%\nExternal reinsurance(4)\n10,028 \n8 \n%\n10,665 \n9 \n%\n11,597 \n9 \n%\nPDI\n1,283 \n1 \n%\n1,342 \n1 \n%\n1,456 \n1 \n%\nOther products\n1,536 \n1 \n%\n1,553 \n1 \n%\n1,603 \n1 \n%\nTotal living benefit/GMDB features\n76,996 \n80,275 \n85,562 \nGMDB features and other(5)\n54,065 \n41 \n%\n45,338 \n36 \n%\n43,231 \n34 \n%\nTotal variable annuity account value, gross\n$\n131,061 \n$\n125,613 \n$\n128,793 \n__________\n(1)\nAll contracts with living benefit guarantees also contain GMDB features, which cover the same insured contract.\n(2)\nContracts with living benefits that are included in our ALM strategy and that have an automatic rebalancing feature.\n(3)\nExcludes retained PDI which is presented separately within this table.\n(4)\nRepresents contracts subject to reinsurance transactions with external counterparties. Includes approximately $8 billion of account values in relation to the PDI reinsurance transaction,\n \nand certain Highest Daily Lifetime Income (“HDI”) v.3.0 business for the period April 1, 2015 through December 31, 2016. The HDI contracts with living benefits also have an automatic rebalancing feature. See Note 12 to the Unaudited Interim Consolidated Financial Statements for additional information. \n(5)\nIncludes Prudential FlexGuard, FlexGuard Income and other variable contracts that have a GMDB feature and do not have an automatic rebalancing feature.\n128\nTable of Contents\nResults Excluded from Adjusted Operating Income\nThe following table provides the net\n impact to the Unaudited \nInterim Consolidated Statements of Operations from the portion of Retirement Strategies’ results excluded from adjusted operating income:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)(1)\nResults excluded from adjusted operating income:\nChange in MRBs, excluding changes in the NPR adjustment(2)\n$\n842 \n$\n(499)\n$\n637 \n$\n1,297 \nChange in the value of the non-MRB liabilities, excluding changes in the NPR adjustment(3)(4)\n(169)\n(252)\n(397)\n682 \nChange in the NPR adjustment, excluding changes recognized in OCI\n(73)\n(5)\n(13)\n(70)\nChange in the fair value of hedge assets(5)\n(561)\n347 \n(1,081)\n(1,625)\nOther(6)\n(16)\n(58)\n(79)\n(215)\nTotal Individual Retirement Strategies results excluded from adjusted operating income\n23 \n(467)\n(933)\n69 \nTotal Institutional Retirement Strategies results excluded from adjusted operating income\n(58)\n19 \n(423)\n(570)\nTotal results excluded from adjusted operating income\n$\n(35)\n$\n(448)\n$\n(1,356)\n$\n(501)\n__________\n(1)\nPositive amounts represent income; negative amounts represent a loss.\n(2)\nAlso excludes related hedging gains (losses), which are included within this table in “Change in the fair value of hedge assets.”\n(3)\nThe amounts for the three and nine months ended September 30, 2024 reflect the correction of an error related to indexed variable and fixed annuity products within the Individual Retirement Strategies business. See above for additional information.\n(4)\nRepresents the change in the liability for our fixed and variable indexed annuities, including the fair value of embedded derivative instruments associated with those products, which is measured utilizing a valuation methodology required under U.S. GAAP. The total GAAP liability includes the fair value of all index credits for the current term and all future projected renewals of the policy; however, only changes in the liability associated with the current term elected by the policyholder are included in adjusted operating income, while changes in the liability associated with all future projected renewals of the policy are excluded from adjusted operating income.\n(5)\nRepresents the change in fair value of the derivatives utilized to hedge potential claims associated with our variable annuity living and death benefit guarantees.\n(6)\nIncludes the changes in duration swaps, deferred policy acquisition costs (“DAC”) amortization, trading gains or losses, and other activity.\nFor the three months ended September 30, 2025, the loss of $35 million was primarily driven by the impact of interest rate changes and credit spreads tightening, as well as a realized loss related to a pension risk transfer transaction, partially offset by the net impact of favorable equity market performance on MRBs and other liabilities, net of hedging.\nFor the nine months ended September 30, 2025, the loss of $1,356 million was primarily driven by the net impact of interest rate changes on MRBs and other liabilities, net of hedging, an unfavorable impact from our annual reviews and update of assumptions and other refinements, and losses on foreign currency hedges. These variances were partially offset by the impact of favorable equity market performance.\n129\nTable of Contents\nGroup Insurance\nOperating Results\nThe following table sets forth Group Insurance’s operating results and benefits and administrative expense ratios for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n($ in millions)\nOperating results:\nRevenues\n$\n1,694 \n$\n1,643 \n$\n5,129 \n$\n4,863 \nBenefits and expenses\n1,604 \n1,561 \n4,825 \n4,615 \nAdjusted operating income\n90 \n82 \n304 \n248 \nRealized investment gains (losses), net, and related charges and adjustments\n4 \n(18)\n(45)\n(48)\nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n94 \n$\n64 \n$\n259 \n$\n200 \nBenefits ratios(1)(2)(3):\nGroup life\n84.1 \n%\n85.0 \n%\n84.6 \n%\n86.8 \n%\nGroup disability\n79.7 \n%\n78.9 \n%\n73.4 \n%\n71.4 \n%\nTotal Group Insurance\n82.8 \n%\n83.4 \n%\n81.5 \n%\n82.5 \n%\nAdministrative\n \nexpense ratios(2)(4)(5):\nGroup life\n10.5 \n%\n10.5 \n%\n10.9 \n%\n11.1 \n%\nGroup disability\n24.0 \n%\n24.7 \n%\n24.9 \n%\n24.3 \n%\nTotal Group Insurance\n14.2 \n%\n14.2 \n%\n14.7 \n%\n14.7 \n%\n__________ \n(1)\nRatio of policyholder benefits to earned premiums plus policy charges and fee income.\n(2)\nThe benefits and administrative expense ratios are measures used to evaluate profitability and efficiency.\n(3)\nBenefit ratios reflect the impact of our annual reviews and update of assumptions and other refinements. Excluding these impacts, the group life, group disability and total Group Insurance benefit ratios were 84.8%, 73.6% and 81.7% for the nine months ended September 30, 2025, respectively, and 86.8%, 73.5% and 83.1% for the nine months ended September 30, 2024, respectively.\n(4)\nRatio of operating and variable expenses (excluding commissions) to net premiums plus policy charges and fee income, excluding third-party administrator pass-through fees and expenses.\n(5)\nPrior period ratios have been updated to conform to current period presentation.\nAdjusted Operating Income\nThree Month Comparison\n. Adjusted operating income increased $8 million, primarily reflecting higher underwriting results in our group life business driven by more favorable mortality experience on non-experience-rated contracts. This variance was partially offset by higher operating and variable expenses, largely supporting business growth. \nNine Month Comparison. \nAdjusted operating income increased $56 million, including a less favorable comparative net impact from our annual reviews and update of assumptions and other refinements. Results for 2025 and 2024 included net benefits from this update of $11 million and $25 million, respectively. Excluding this item, adjusted operating income increased $70 million, primarily reflecting higher underwriting results in our group life business, driven by more favorable mortality experience on non-experience-rated contracts and a positive impact from a reserve refinement for certain experience-rated contracts. Also contributing to the increase were higher underwriting results in our group disability business driven by more favorable claims experience on long-term disability contracts. These favorable variances were partially offset by higher variable and operating expenses, largely supporting business growth. \nRevenues, Benefits and Expenses\nThree Month Comparison. \nRevenues increased $51 million primarily reflecting higher premiums and policy charges and fee income, driven by business growth in both our group disability and group life businesses.\n130\nTable of Contents\nBenefits and expenses increased $43 million. The increase primarily reflected higher policyholders’ benefits and changes in reserves, as well as higher general and administrative expenses, both largely driven by business growth, partially offset by more favorable mortality experience on non-experience-rated contracts in our group life business.\nNine Month Comparison. \nRevenues increased $266 million primarily reflecting higher premiums and policy charges and fee income, driven by business growth in both our group life and group disability businesses, as well as a positive impact from a reserve refinement for certain experience-rated contracts.\nBenefits and expenses increased $210 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, benefits and expenses increased $196 million. The increase primarily reflected higher policyholders’ benefits and changes in reserves, as well as higher general and administrative expenses, both largely driven by business growth, partially offset by more favorable mortality experience on non-experience-rated contracts in our group life business and more favorable claims experience on long-term disability contracts.\nSales Results\n \nThe following table sets forth Group Insurance’s annualized new business premiums, as defined under “—Segment Measures” above, for the periods indicated:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nAnnualized new business premiums(1):\nGroup life\n$\n36 \n$\n35 \n$\n296 \n$\n251 \nGroup disability\n42 \n28 \n259 \n236 \nTotal\n$\n78 \n$\n63 \n$\n555 \n$\n487 \n__________ \n(1)\nAmounts exclude new premiums resulting from rate changes on existing policies, from additional coverage under our Servicemembers’ Group Life Insurance contract and from excess premiums on group universal life insurance that build cash value but do not purchase face amounts.\nTotal annualized new business premiums for the three months ended September 30, 2025 increased $15 million compared to the prior year period, primarily driven by higher sales in the National and Premier market segments in our group disability business.\nTotal annualized new business premiums for the nine months ended September 30, 2025 increased $68 million compared to the prior year period, primarily driven by higher sales in the Premier market segment in both our group life and group disability businesses. This increase was partially offset by lower sales in the Association market segment in our group life business, and lower sales in the National market segment in our group disability business, including lower supplemental health product sales, primarily reflecting the absence of outsized sales which occurred in the prior year period.\nIndividual Life\nBusiness Update\n•\nIn August 2024, the Company entered into an agreement with Wilton Re to reinsure certain guaranteed universal life policies issued by Pruco Life and PLNJ. These policies represented approximately 40% of the Company’s remaining statutory reserves on its in-force guaranteed universal life block of business, following the close of the reinsurance transaction with Somerset Re in the first quarter of 2024. The transaction was completed in December 2024 with an effective date of October 1, 2024. These two external reinsurance agreements reduced, in aggregate, the Company’s previously established statutory reserves on its in-force guaranteed universal life block of business by approximately 60%. See Note 12 to the Unaudited Interim Consolidated Financial Statements for additional information regarding these transactions.\n131\nTable of Contents\nOperating Results\nThe following table sets forth Individual Life’s operating results for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nOperating results:\nRevenues\n$\n1,565 \n$\n1,546 \n$\n4,573 \n$\n4,655 \nBenefits and expenses\n1,472 \n1,486 \n4,406 \n4,803 \nAdjusted operating income\n93 \n60 \n167 \n(148)\nRealized investment gains (losses), net, and related charges and adjustments\n(179)\n(494)\n(282)\n(587)\nMarket experience updates\n(25)\n(86)\n(15)\n(155)\nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n(111)\n$\n(520)\n$\n(130)\n$\n(890)\nAdjusted Operating Income\nThree Month Comparison.\n Adjusted operating income increased $33 million, primarily driven by higher underwriting results reflecting the ongoing favorable impact from the reinsurance transaction with Wilton Re. This variance was partially offset by lower net investment spread results reflecting the absence of income from assets related to the reinsurance transaction with Wilton Re, partially offset by lower financing costs resulting from the reinsurance transactions discussed above as well as the consolidation of our internal captive reinsurance arrangements in the fourth quarter of 2024, and lower losses from derivatives.\nNine Month Comparison.\n Adjusted operating income increased $315 million, including a favorable comparative net impact from our annual reviews and update of assumptions and other refinements. Results for 2025 included a net benefit of $58 million driven by impacts related to assumptions for mortality, policyholder behavior and other reserve refinements, while 2024 included a net charge of $98 million driven by unfavorable impacts related to assumptions for policyholder behavior. Excluding this item, adjusted operating income increased $159 million, primarily driven by higher underwriting results reflecting the ongoing favorable impact from the reinsurance transaction with Wilton Re, partially offset by unfavorable mortality experience in the current period. Also contributing to the increase were lower expenses reflecting the absence of costs associated with the closing of the reinsurance transaction with Somerset Re in the first quarter of 2024. These variances were partially offset by lower net investment spread results, reflecting the absence of income from assets related to the reinsurance transaction with Wilton Re, and lower income from non-coupon investments, partially offset by lower financing costs resulting from the reinsurance transactions discussed above as well as the consolidation of our internal captive reinsurance arrangements in the fourth quarter of 2024, and lower losses from derivatives.\nRevenues, Benefits and Expenses\nThree Month Comparison\n. Revenues increased $19 million, primarily driven by higher policy charges and fee income due to business growth and favorable equity market performance. This variance was partially offset by lower investment results, reflecting the absence of income from assets related to the reinsurance transaction with Wilton Re, partially offset by lower losses from derivatives.\nBenefits and expenses decreased $14 million, primarily driven by favorable changes in estimates of the liability for future policy benefits and lower interest credited on policyholders’ account balances as a result of the reinsurance transaction with Wilton Re. These variances were partially offset by higher policyholders’ benefits, including changes in reserves, driven by less favorable mortality experience in the current quarter, partially offset by the impact from the reinsurance transaction with Wilton Re.\nNine Month Comparison\n. Revenues decreased $82 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, revenues decreased $113 million, primarily driven by lower investment results reflecting the absence of income from assets related to the reinsurance transaction with Wilton Re. This variance was \n132\nTable of Contents\npartially offset by higher policy charges and fee income due to business growth and favorable equity market performance, and lower losses from derivatives.\nBenefits and expenses decreased $397 million. Excluding the impact of our annual reviews and update of assumptions and other refinements, as discussed above, benefits and expenses decreased $272 million, primarily driven by lower policyholders’ benefits, including changes in reserves, lower interest credited on policyholders’ account balances, and lower interest expense as a result of the reinsurance transaction with Wilton Re. Also contributing to the decrease were lower general and administrative expenses due to the absence of costs associated with the closing of the reinsurance transaction with Somerset Re in the first quarter of 2024.\nSales Results\nThe following table sets forth Individual Life’s annualized new business premiums, as defined under “—Results of Operations—Segment Measures” above, by distribution channel and product, for the periods indicated:\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nPrudential\nAdvisors\nThird-\nParty\nTotal\nPrudential\nAdvisors\nThird-\nParty\nTotal\n(in millions)\nVariable Life\n$\n44 \n$\n142 \n$\n186 \n$\n37 \n$\n120 \n$\n157 \nTerm Life\n4 \n33 \n37 \n5 \n29 \n34 \nUniversal Life\n0 \n30 \n30 \n1 \n18 \n19 \nTotal\n$\n48 \n$\n205 \n$\n253 \n$\n43 \n$\n167 \n$\n210 \nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nPrudential\nAdvisors\nThird-\nParty\nTotal\nPrudential\nAdvisors\nThird-\nParty\nTotal\n(in millions)\nVariable Life\n$\n115 \n$\n385 \n$\n500 \n$\n105 \n$\n315 \n$\n420 \nTerm Life\n12 \n96 \n108 \n14 \n85 \n99 \nUniversal Life\n2 \n76 \n78 \n3 \n58 \n61 \nTotal\n$\n129 \n$\n557 \n$\n686 \n$\n122 \n$\n458 \n$\n580 \nTotal annualized new business premiums for the three and nine months ended September 30, 2025 increased $43 million and $106 million, respectively, primarily reflecting higher third-party sales across all products.\n133\nTable of Contents\nInternational Businesses\n \nBusiness Updates\n•\nEffective in the first quarter of 2025, consistent with changes to the Company’s internal management structure, our International Businesses are reflected as a single operating and reportable segment, which is how the CODM now assesses its performance and allocates resources. Prior to the first quarter of 2025, our International Businesses consisted of the Life Planner and Gibraltar Life and Other operating segments, each of which was a reportable segment under U.S. GAAP. The change has been applied retrospectively and did not have any impact on the Company’s Unaudited Interim Consolidated Financial Statements contained herein or to any previously issued financial statements.\n•\nIn December 2024, the Company entered into an agreement with Prismic Life Reinsurance International, Ltd. (“Prismic Re International”), a wholly-owned subsidiary of Prismic, to reinsure approximately $7 billion of reserves for certain USD-denominated Japanese whole life policies originated by the Company’s Japanese affiliates. The transaction was completed in March 2025 with an effective date of March 1, 2025. See Note 12 to the Unaudited Interim Consolidated Financial Statements for additional information.\nOperating Results\n \nThe results of our International Businesses’ operations are translated on the basis of weighted average monthly exchange rates, inclusive of the effects of the intercompany arrangement discussed in “—Results of Operations—Impact of Foreign Currency Exchange Rates” above. To provide a better understanding of operating performance within the International Businesses, where indicated below, we have analyzed our results of operations excluding the effect of the year-over-year change in foreign currency exchange rates. Our results of operations, excluding the effect of foreign currency fluctuations, were derived by translating foreign currencies to USD at uniform exchange rates for all periods presented, including for constant dollar information discussed below. For our Japan operations, we used an exchange rate of 143 yen per USD. In addition, for constant dollar information discussed below, activity denominated in USD is generally reported based on the amounts as transacted in USD. Annualized new business premiums presented on a constant exchange rate basis in the “Sales Results” section below reflect translation based on these same uniform exchange rates.\n \nThe following table sets forth the International Businesses’ operating results for the periods indicated:\n \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nOperating results:\nRevenues\n$\n4,595 \n$\n4,417 \n$\n13,732 \n$\n13,642 \nBenefits and expenses\n3,714 \n3,651 \n11,242 \n11,278 \nAdjusted operating income\n881 \n766 \n2,490 \n2,364 \nRealized investment gains (losses), net, and related charges and adjustments\n103 \n350 \n250 \n312 \nChange in value of market risk benefits, net of related hedging gains (losses)\n4 \n(1)\n13 \n11 \nMarket experience updates\n(9)\n(44)\n66 \n37 \nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests\n(53)\n(44)\n(124)\n(93)\nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n926 \n$\n1,027 \n$\n2,695 \n$\n2,631 \n134\nTable of Contents\nAdjusted Operating Income\nThree Month Comparison. \nAdjusted operating income increased $115 million, including an unfavorable comparative net impact of $1 million from currency fluctuations. Excluding this item, adjusted operating income increased $116 million, primarily reflecting higher net investment spread results, primarily driven by higher income from non-coupon investments, lower losses from derivatives and portfolio growth in Brazil. Also contributing to the increase were higher underwriting results, driven by business growth in Brazil and growth in both variable and investment products in Japan. These variances were partially offset by higher operating and variable expenses, primarily driven by business growth.\nNine Month Comparison. \nAdjusted operating income increased $126 million, including an unfavorable comparative net impact of $18 million from currency fluctuations. Both periods also include the impact of our annual reviews and update of assumptions and other refinements, which resulted in a net charge of $2 million in 2025, compared to a net charge of $55 million in 2024.\nExcluding these items, adjusted operating income increased $91 million, primarily reflecting higher net investment spread results, primarily driven by higher income from non-coupon investments, lower losses from derivatives and portfolio growth in Brazil. Also contributing to the increase were higher underwriting results, driven by business growth in Brazil and growth in both variable and investment products in Japan, and higher earnings from joint ventures and other operating entities. These variances were partially offset by higher variable and operating expenses, primarily driven by business growth, and lower surrender charges.\nRevenues, Benefits and Expenses\nThree Month Comparison. \nRevenues increased $178 million, including a favorable comparative net impact of $16 million from currency fluctuations. Excluding this item, revenues increased $162 million, primarily reflecting higher income from non-coupon investments, and higher earnings from joint ventures and other operating entities. Net investment income increased, driven by growth in both variable and investment products in Japan and higher reinvestment rates. Also contributing to the increase were lower losses from derivatives. Lower premiums attributable to the decline of traditional life insurance business in force in Japan were partially offset by business growth in Brazil.\nBenefits and expenses increased $63 million, including an unfavorable comparative net impact of $17 million from currency fluctuations. Excluding this item, benefits and expenses increased $46 million, primarily reflecting higher interest credited to policyholders’ account balances, reflecting growth in both variable and investment products in Japan, and higher general and administrative expenses, primarily driven by business growth. These variances were partially offset by lower policyholders’ benefits, including changes in reserves, due to the decline of traditional life insurance business in force in Japan.\nNine Month Comparison. \nRevenues increased $90 million, including an unfavorable comparative net impact of $19 million from currency fluctuations and an unfavorable comparative net impact of $207 million from our annual reviews and update of assumptions and other refinements. Excluding these items, revenues increased $316 million, primarily reflecting higher income from non-coupon investments, and higher earnings from joint ventures and other operating entities. Net investment income increased, driven by growth in both variable and investment products in Japan and higher reinvestment rates. Also contributing to the increase were lower losses from derivatives. Lower premiums attributable to the decline of traditional life insurance business in force in Japan were partially offset by a\n \nlower impact from ceded reinsurance in the current period and business growth in Brazil.\nBenefits and expenses decreased $36 million, including a favorable comparative net impact of $1 million from currency fluctuations and a favorable comparative net impact of $260 million from our annual reviews and update of assumptions and other refinements. Excluding these items, benefits and expenses increased $225 million, primarily reflecting higher interest credited to policyholders’ account balances, reflecting growth in both variable and investment products in Japan, and higher general and administrative expenses, primarily driven by business growth. These variances were partially offset by favorable changes in estimates of the liability for future policy benefits,\n \nand lower policyholders’ benefits, including changes in reserves, due to the decline of traditional life insurance business in force in Japan, as discussed above, partially offset by a\n \nlower impact from ceded reinsurance in the current period.\n135\nTable of Contents\nSales Results\nThe following table sets forth annualized new business premiums, as defined under “—Results of Operations—Segment Measures” above, on an actual and constant exchange rate basis for the periods indicated:\n \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n \n(in millions)\nAnnualized new business premiums:\nOn an actual exchange rate basis\n$\n555 \n$\n588 \n$\n1,672 \n$\n1,624 \nOn a constant exchange rate basis\n$\n553 \n$\n588 \n$\n1,680 \n$\n1,617 \nThe amount of annualized new business premiums and the sales mix, in terms of types and currency denomination of products, for any given period can be significantly impacted by several factors, including but not limited to: the addition of new products, discontinuation of existing products, changes in credited interest rates for certain products and other product modifications, changes in premium rates, changes in interest rates or fluctuations in currency markets, changes in tax laws, changes in life insurance regulations or changes in the competitive environment. Sales volume may increase or decrease prior to certain of these changes becoming effective and then fluctuate in the other direction following such changes.\nOur diverse product portfolio in Japan, in terms of currency mix and premium payment structure, allows us to adapt to changing market and competitive dynamics, including from a low interest rate environment. We regularly examine our product offerings and their related profitability and reprice or discontinue sales of certain products that do not meet our profit expectations. The impact of these actions, coupled with the introduction of certain new products, has generally resulted in higher sales of products denominated in USD relative to products denominated in other currencies; however, more recently we have experienced an increase in sales of our yen-denominated product offerings as a result of growing demand for these products.\nThe table below presents annualized new business premiums on a constant exchange rate basis, by product category and distribution channel, for the periods indicated:\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nLife\nAccident\n&\nHealth\nRetirement\n(1)\nInvestment \nContracts\n(2)\nTotal\nLife\nAccident\n&\nHealth\nRetirement\n(1)\nInvestment \nContracts\n(2)\nTotal\n \n(in millions)\nLife Planner\n$\n94 \n$\n23 \n$\n64 \n$\n46 \n$\n227 \n$\n85 \n$\n18 \n$\n63 \n$\n42 \n$\n208 \nLife Consultants\n25 \n4 \n26 \n84 \n139 \n28 \n5 \n19 \n85 \n137 \nBanks\n26 \n2 \n0 \n78 \n106 \n36 \n3 \n1 \n105 \n145 \nIndependent Agency and Other\n29 \n5 \n21 \n26 \n81 \n21 \n4 \n26 \n47 \n98 \nTotal\n$\n174 \n$\n34 \n$\n111 \n$\n234 \n$\n553 \n$\n170 \n$\n30 \n$\n109 \n$\n279 \n$\n588 \n__________\n(1)\nIncludes retirement income, endowment and savings variable life.\n(2)\nIncludes single-payment market value adjusted investment contracts, single-payment whole life products and recurring-payment annuity products.\nThree Month Comparison\n. Annualized new business premiums, on a constant exchange rate basis, decreased $35 million. Bank channel sales decreased $39 million, primarily reflecting lower investment contract and life product sales. Independent Agency and Other sales decreased $17 million, primarily reflecting lower investment contract and retirement product sales, partially offset by higher life products sales. Life Planner sales increased $19 million, primarily reflecting higher life and investment contract products sales in Japan, and higher life product sales in Brazil. Life Consultant sales increased $2 million, primarily reflecting higher retirement product sales, partially offset by lower life products sales.\n136\nTable of Contents\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nLife\nAccident\n&\nHealth\nRetirement\n(1)\nInvestment \nContracts\n(2)\nTotal\nLife\nAccident\n&\nHealth\nRetirement\n(1)\nInvestment \nContracts\n(2)\nTotal\n \n(in millions)\nLife Planner\n$\n283 \n$\n62 \n$\n201 \n$\n160 \n$\n706 \n$\n256 \n$\n51 \n$\n204 \n$\n129 \n$\n640 \nLife Consultants\n68 \n13 \n65 \n276 \n422 \n78 \n13 \n44 \n230 \n365 \nBanks\n75 \n6 \n0 \n213 \n294 \n108 \n9 \n1 \n231 \n349 \nIndependent Agency and Other\n90 \n17 \n65 \n86 \n258 \n61 \n12 \n71 \n119 \n263 \nTotal\n$\n516 \n$\n98 \n$\n331 \n$\n735 \n$\n1,680 \n$\n503 \n$\n85 \n$\n320 \n$\n709 \n$\n1,617 \n__________\n(1)\nIncludes retirement income, endowment and savings variable life.\n(2)\nIncludes single-payment market value adjusted investment contracts, single-payment whole life products and recurring-payment annuity products.\nNine Month Comparison\n. Annualized new business premiums, on a constant exchange rate basis, increased $63 million. Life Planner sales increased $66 million, primarily driven by higher investment contract and life product sales in Japan, and higher life product sales in Brazil. Life Consultant sales increased $57 million, primarily reflecting higher investment contract and retirement product sales, partially offset by lower life product sales. Bank channel sales decreased $55 million, primarily reflecting lower life and investment contract product sales. Independent Agency and Other sales decreased $5 million, primarily reflecting lower investment contract sales, partially offset by higher life product sales. \nCorporate and Other\nOperating Results\nCorporate and Other includes corporate operations, after allocations to our business segments, and Divested and Run-off Businesses other than those that qualify for “discontinued operations” accounting treatment under U.S. GAAP. The following table sets forth Corporate and Other’s operating results for the periods indicated:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nOperating results:\nInvestment income\n$\n58 \n$\n50 \n$\n180 \n$\n143 \nInterest expense on debt\n(223)\n(213)\n(697)\n(631)\nPension and employee benefits\n95 \n94 \n304 \n285 \nOther corporate activities\n(257)\n(418)\n(809)\n(1,090)\nAdjusted operating income\n(327)\n(487)\n(1,022)\n(1,293)\nRealized investment gains (losses), net, and related charges and adjustments\n(150)\n(273)\n(377)\n(132)\nMarket experience updates\n1 \n3 \n4 \n6 \nDivested and Run-off Businesses\n123 \n47 \n84 \n50 \nEquity in earnings of joint ventures and other operating entities and earnings attributable to noncontrolling interests\n19 \n(9)\n21 \n(49)\nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n(334)\n$\n(719)\n$\n(1,290)\n$\n(1,418)\n137\nTable of Contents\nThree Month Comparison\n. The loss from Corporate and Other operations, on an adjusted operating income basis, decreased $160 million. Net charges from other corporate activities were lower by $161 million, primarily driven by lower net costs related to corporate initiatives, favorable foreign exchange remeasurement impacts and lower expenses related to an update of internal expense allocations. Investment income results increased $8 million, primarily driven by higher income from non-coupon investments. Interest expense on debt increased $10 million, largely reflecting the absence of income offsets from the termination of an affiliated financing agreement resulting from the reinsurance transactions in Individual Life in 2024.\nNine Month Comparison\n. The loss from Corporate and Other operations, on an adjusted operating income basis, decreased $271 million, primarily driven by lower net charges from other corporate activities of $281 million reflecting lower net costs related to corporate initiatives and long-term compensation plans, lower expenses related to an update of internal expense allocations, and favorable exchange rate impacts. Investment income results increased $37 million, primarily driven by higher income from non-coupon investments. Pension and employee benefits results were favorable by $19 million, primarily reflecting higher earnings from our pension and post-retirement plans from higher expected returns on plan assets and lower service costs. Interest expense on debt increased $66 million, largely reflecting the absence of income offsets from the termination of an affiliated financing agreement resulting from the reinsurance transactions in Individual Life in 2024.\nDivested and Run-off Businesses\nDivested and Run-off Businesses Included in Corporate and Other\nIncome from our Divested and Run-off Businesses includes results from several businesses that have been or will be sold or exited, including businesses that have been placed in wind down status that do not qualify for “discontinued operations” accounting treatment under U.S. GAAP. The results of these Divested and Run-off Businesses are reflected in our Corporate and Other operations but are excluded from adjusted operating income. A summary of the results of the Divested and Run-off Businesses reflected in our Corporate and Other operations is as follows for the periods indicated:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n(in millions)\nLong-Term Care\n$\n126 \n$\n104 \n$\n172 \n$\n390 \nOther\n(3)\n(57)\n(88)\n(340)\nTotal Divested and Run-off Businesses income (loss) excluded from adjusted operating income\n$\n123 \n$\n47 \n$\n84 \n$\n50 \nLong-Term Care\nThree Month Comparison\n.\n Results increased $22 million compared to the prior year period, \nprimarily reflecting more favorable impacts from changes in the market value of equity securities, higher income from non-coupon investments, and lower general and administrative expenses. These variances were partially offset by unfavorable impacts from changes in the market value of derivatives used for duration management and higher net realized investment losses from sales of fixed income securities. \nNine\n \nMonth Comparison\n. Results decreased $218 million, including an unfavorable comparative net impact from our annual reviews and update of assumptions and other refinements. Results for 2025 included a $7 million net \ncharge from these updates, while results for\n 2024 included a $111 million net \nbenefit from these updates. \nExcluding this item, results decreased $100 million compared to the prior year period, \nprimarily reflecting less favorable impacts from changes in the market value of equity securities, more unfavorable impacts from changes in the market value of derivatives used for duration management, and higher net realized investment losses from sales of fixed income securities and credit impairments. These variances were partially offset by higher income from non-coupon investments.\nOther Divested and Run-off Businesses\nResults for the third quarter of 2025 increased $54 million, primarily reflecting less unfavorable results related to Assurance IQ and favorable results related to the Full Service Retirement business. Results for the first nine months of 2025 increased $252 million, primarily reflecting the absence of impairments and charges related to management’s decisions to exit \n138\nTable of Contents\nAssurance IQ and PGIM Wadhwani LLP (and their subsequent classifications as divested businesses in the first and second quarters of 2024, respectively), as well as favorable results related to the Full Service Retirement business.\nClosed Block Division\n \nThe Closed Block division includes certain in-force traditional domestic participating life insurance and annuity products and assets that are used for the payment of benefits and policyholder dividends on these policies (collectively the “Closed Block”), as well as certain related assets and liabilities. We no longer offer these traditional domestic participating policies. See Note 13 to the Unaudited Interim Consolidated Financial Statements for additional information.\n \nEach year, the Board of Directors of The Prudential Insurance Company of America (“PICA”) determines the dividends payable on participating policies for the following year based on the experience of the Closed Block, including investment income, net realized and unrealized investment gains (losses), mortality experience and other factors. Although the Closed Block experience for dividend action decisions is based upon statutory results, at the time the Closed Block was established, we developed, as required by U.S. GAAP, an actuarial calculation of the timing of the maximum future earnings from the policies included in the Closed Block. Actual cumulative earnings, as required by U.S. GAAP, reflect the recognition of realized investment gains and losses in the current period, as well as changes in assets and related liabilities that support the Closed Block policies. If actual cumulative earnings in any given period are greater than the cumulative earnings we expected, we record this excess as a policyholder dividend obligation. Additionally, any accumulated net unrealized investment gains that have arisen subsequent to the establishment of the Closed Block are reflected as a policyholder dividend obligation, with a corresponding amount reported in AOCI, while any accumulated net unrealized investment losses are reflected as a reduction of the policyholder dividend obligation, to the extent the overall policyholder dividend obligation is otherwise positive.\nWe will subsequently pay this excess to Closed Block policyholders as an additional dividend unless it is otherwise offset by future Closed Block performance that is less favorable than we originally expected. The policyholder dividends we charge to expense within the Closed Block division will include any change in our policyholder dividend obligation that we recognize for the excess of actual cumulative earnings in any given period over the cumulative earnings we expected in addition to the actual policyholder dividends declared by the Board of Directors of PICA. If actual cumulative earnings fall below expected cumulative earnings in future periods, earnings volatility in the Closed Block division, which is primarily due to changes in investment results, may not be offset by changes in the cumulative earnings policyholder dividend obligation. For a discussion of the Closed Block division’s realized investment gains (losses), net, see “—General Account Investments.”\nAs of September 30, 2025, the excess of actual cumulative earnings over the expected cumulative earnings was $1,762 million, which was recorded as a policyholder dividend obligation. Actual cumulative earnings, as required by U.S. GAAP, reflect the recognition of realized investment gains and losses in the current period, as well as changes in assets and related liabilities that support the Closed Block policies. As of September 30, 2025, net unrealized investment losses have arisen subsequent to the establishment of the Closed Block due to the impacts of higher interest rates on the market value of fixed maturities available-for-sale. The impact of these net unrealized investment losses has been reflected as a decrease to the policyholder dividend obligation of $1,099 million at September 30, 2025, with a corresponding amount reported in AOCI.\n \nOperating Results\n \nThe following table sets forth the Closed Block division’s results for the periods indicated:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nU.S. GAAP results:\nRevenues\n$\n1,058 \n$\n817 \n$\n2,825 \n$\n2,590 \nBenefits and expenses\n1,048 \n815 \n2,855 \n2,651 \nIncome (loss) before income taxes and equity in earnings of joint ventures and other operating entities\n$\n10 \n$\n2 \n$\n(30)\n$\n(61)\n139\nTable of Contents\nIncome (loss) Before Income Taxes and Equity in Earnings of Joint Ventures and Other Operating Entities\nThree Month Comparison\n. Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities increased $8 million. Net investment activity results increased, primarily reflecting lower realized investment losses from the sale of fixed income securities and favorable changes in the market value of derivatives. As a result of these and other factors, a $33 million increase in the policyholder dividend obligation was recorded in the third quarter of 2025, compared to a $157 million reduction in the third quarter of 2024.\nNine Month Comparison\n. Income (loss) before income taxes and equity in earnings of joint ventures and other operating entities increased $31 million. Net investment activity results increased, primarily reflecting lower realized investment losses from the sale of fixed income securities, partially offset by unfavorable changes in the market value of derivatives. This variance was partially offset by lower other income driven by less favorable changes in the market value of equity securities. As a result of these and other factors, a $334 million reduction in the policyholder dividend obligation was recorded in the first nine months of 2025, compared to a $403 million reduction in the first nine months of 2024.\nRevenues, Benefits and Expenses\nThree Month Comparison\n. Revenues increased $241 million, primarily driven by lower realized investment losses, as discussed above.\nBenefits and expenses increased $233 million, primarily driven by an increase in dividends to policyholders, reflecting an increase in the policyholder dividend obligation due to changes in cumulative earnings and other factors, as discussed above.\nNine Month Comparison\n. Revenues increased $235 million, primarily driven by lower realized investment losses, partially offset by lower other income, as discussed above.\nBenefits and expenses increased $204 million, primarily driven by an increase in dividends to policyholders, reflecting a lower reduction in the policyholder dividend obligation due to changes in cumulative earnings and other factors, as discussed above.\nIncome Taxes\n \nFor information regarding income taxes, see Note 14 to the Unaudited Interim Consolidated Financial Statements.\nGeneral Account Investments\n \nPortfolio Composition\n \nOur investment portfolio consists of public and private fixed maturity securities, commercial mortgage and other loans, policy loans and non-coupon investments, which include equity securities and other invested assets such as limited partnerships and limited liability companies (“LPs/LLCs”), real estate held through direct ownership, derivative instruments and seed money investments in separate accounts. The composition of our general account reflects, within the discipline provided by our risk management approach, our need for competitive results and the selection of diverse investment alternatives available primarily through our PGIM segment. The size of our portfolio enables us to invest in asset classes that may be unavailable to the typical investor.\nA portion of our general account investments supports customer liabilities reinsured under coinsurance with funds withheld and modified coinsurance arrangements. With these reinsurance arrangements, we retain legal ownership of the assets (collectively, the “Funds Withheld”) which remain on our Unaudited Interim Consolidated Statements of Financial Position, while the economic benefits and investment risk associated with the Funds Withheld assets ultimately inure to the reinsurer. The composition of the Funds Withheld assets is subject to investment guidelines specific to the reinsurance treaties, which may differ from the investment guidelines we set for our general account, excluding Funds Withheld. See Note 12 to the Unaudited Interim Consolidated Financial Statements for additional information regarding our material reinsurance agreements.\n \nThe following tables set forth the composition of our general account investment portfolio apportioned between PFI excluding the Closed Block division and Funds Withheld, the Closed Block division, and Funds Withheld, as of the dates indicated:\n \n140\nTable of Contents\n \nSeptember 30, 2025\n \nPFI Excluding\nClosed Block Division and Funds Withheld\nClosed Block\nDivision\nFunds Withheld\nTotal\n \n($ in millions)\nFixed maturities:\nPublic, available-for-sale, at fair value\n$\n219,560 \n54.8 \n%\n$\n19,151 \n$\n4,310 \n$\n243,021 \nPrivate, available-for-sale, at fair value\n78,914 \n19.7 \n10,232 \n2,738 \n91,884 \nFixed maturities, trading, at fair value \n4,928 \n1.2 \n613 \n8,906 \n14,447 \nAssets supporting experience-rated contractholder liabilities, at fair value\n4,648 \n1.2 \n0 \n0 \n4,648 \nEquity securities, at fair value\n6,778 \n1.7 \n1,544 \n0 \n8,322 \nCommercial mortgage and other loans, at book value, net of allowance\n55,829 \n13.9 \n7,648 \n263 \n63,740 \nPolicy loans, at outstanding balance\n6,701 \n1.7 \n3,250 \n0 \n9,951 \nOther invested assets, net of allowance(1)\n17,471 \n4.3 \n4,636 \n1,885 \n23,992 \nShort-term investments, net of allowance\n5,980 \n1.5 \n259 \n7 \n6,246 \nTotal general account investments\n400,809 \n100.0 \n%\n47,333 \n18,109 \n466,251 \nInvested assets of other entities and operations(2)\n5,857 \n0 \n0\n5,857 \nTotal investments\n$\n406,666 \n$\n47,333 \n$\n18,109 \n$\n472,108 \n \nDecember 31, 2024\n \nPFI Excluding\nClosed Block Division and Funds Withheld\nClosed Block\nDivision\nFunds Withheld\nTotal\n \n($ in millions)\nFixed maturities:\nPublic, available-for-sale, at fair value\n$\n206,078 \n54.9 \n%\n$\n19,103 \n$\n4,837 \n$\n230,018 \nPrivate, available-for-sale, at fair value\n68,759 \n18.3 \n9,625 \n2,795 \n81,179 \nFixed maturities, trading, at fair value\n4,068 \n1.1 \n647 \n7,732 \n12,447 \nAssets supporting experience-rated contractholder liabilities, at fair value\n3,707 \n1.0 \n0 \n0 \n3,707 \nEquity securities, at fair value\n7,254 \n1.9 \n1,642 \n0 \n8,896 \nCommercial mortgage and other loans, at book value, net of allowance\n53,987 \n14.4 \n7,652 \n233 \n61,872 \nPolicy loans, at outstanding balance\n6,447 \n1.7 \n3,348 \n0 \n9,795 \nOther invested assets, net of allowance(1)\n16,781 \n4.4 \n4,929 \n1,867 \n23,577 \nShort-term investments, net of allowance\n8,493 \n2.3 \n520 \n43 \n9,056 \nTotal general account investments\n375,574 \n100.0 \n%\n47,466 \n17,507 \n440,547 \nInvested assets of other entities and operations(2)\n4,233 \n0 \n0\n4,233 \nTotal investments\n$\n379,807 \n$\n47,466 \n$\n17,507 \n$\n444,780 \n__________\n(1)    Other invested assets consists of investments in LPs/LLCs, investment real estate held through direct ownership, derivative instruments and other miscellaneous investments. For additional information regarding these investments, see “—Other Invested Assets” below.\n(2)\nIncludes invested assets of our investment management and derivative operations. Excludes assets of our investment management operations that are managed for third parties and those assets classified as “Separate account assets” on our Unaudited Interim Consolidated Statements of Financial Position. For additional information regarding these investments, see “—Invested Assets of Other Entities and Operations” below.\nThe increase in general account investments attributable to PFI excluding the Closed Block division and Funds Withheld in the first nine months of 2025 was primarily due to net business inflows, the translation impact of the U.S. dollar weakening against the yen, and a net decrease in U.S. interest rates, partially offset by assets transferred due to the Prismic Re International transaction and an increase in Japan interest rates. For information regarding the methodology used in determining the fair value of our fixed maturities, see Note 6 to the Unaudited Interim Consolidated Financial Statements.\n \n141\nTable of Contents\nAs of September 30, 2025 and December 31, 2024, 40% and 42%, respectively, of our general account investments attributable to PFI excluding the Closed Block division and Funds Withheld related to our Japanese insurance operations. The following table sets forth the composition of the investments of our Japanese insurance operations’ general account, as of the dates indicated:\nSeptember 30, 2025\nDecember 31, 2024\nJapanese Insurance Operations\n(in millions)\nFixed maturities:\nPublic, available-for-sale, at fair value\n$\n105,600 \n$\n102,904 \nPrivate, available-for-sale, at fair value\n21,881 \n21,603 \nFixed maturities, trading, at fair value \n482 \n461 \nAssets supporting experience-rated contractholder liabilities, at fair value\n4,648 \n3,707 \nEquity securities, at fair value\n1,979 \n1,845 \nCommercial mortgage and other loans, at book value, net of allowance\n14,902 \n16,137 \nPolicy loans, at outstanding balance\n2,762 \n2,608 \nOther invested assets(1)\n6,393 \n6,588 \nShort-term investments, net of allowance\n2,161 \n2,324 \nTotal Japanese general account investments\n$\n160,808 \n$\n158,177 \n__________ \n(1)\nOther invested assets consists of investments in LPs/LLCs, investment real estate held through direct ownership, derivative instruments and other miscellaneous investments.\nThe increase in general account investments related to our Japanese insurance operations in the first nine months of 2025 was primarily due to translation impact of the U.S. dollar weakening against the yen, net business inflows, partially offset by the Prismic Re International transaction and an increase in Japan interest rates.\nAs of September 30, 2025, our Japanese insurance operations had $93.8 billion, at carrying value, of investments denominated in U.S. dollars, including $1.3 billion that were hedged to yen through third-party derivative contracts and $85.2 billion that support liabilities denominated in U.S. dollars, with the remainder constituting part of the hedging of foreign currency exchange rate exposure to U.S. dollar-equivalent equity. As of December 31, 2024, our Japanese insurance operations had $88.1 billion, at carrying value, of investments denominated in U.S. dollars, including $1.0 billion that were hedged to yen through third-party derivative contracts and $80.5 billion that support liabilities denominated in U.S. dollars, with the remainder constituting part of the hedging of foreign currency exchange rate exposure of U.S. dollar-equivalent equity. The $5.7 billion increase in the carrying value of U.S. dollar-denominated investments from December 31, 2024 was primarily attributable to portfolio growth as a result of net business inflows and a net decrease in U.S. interest rates, partially offset by the Prismic Re International transaction.\nOur\n Japanese insurance operations had $2.0 billion\n \nand $2.5 billion, at carrying value, of investments denominated in Australian dollars that support liabilities denominated in Australian dollars as of September 30, 2025 and December 31, 2024, respectively. The $0.5 billion decrease in the carrying value of Australian dollar-denominated investments from December 31, 2024 was primarily attributable to run-off of the portfolio. For additional information regarding U.S. and Australian dollar investments held in our Japanese insurance operations and a discussion of our yen hedging strategy, see “Results of Operations by Segment—Impact of Foreign Currency Exchange Rates” above.\nInvestment Results\n \nThe following tables set forth the investment results of our general account apportioned between PFI excluding the Closed Block division and Funds Withheld, the Closed Block division and Funds Withheld, for the periods indicated. The yields are based on net investment income as reported under U.S. GAAP and as such do not include certain interest-related items, such as settlements of duration management swaps which are included in “Realized investment gains (losses), net.” \n142\nTable of Contents\nThree Months Ended September 30, 2025\nPFI Excluding Closed Block Division, Funds Withheld and Japanese Insurance Operations\nJapanese Insurance Operations\nPFI Excluding Closed Block Division and Funds Withheld\nClosed Block Division\nFunds Withheld\nTotal(5)\nYield(1)\nAmount\nYield(1)\nAmount\nYield(1)\nAmount\nAmount\nAmount\nAmount\n($ in millions)\nFixed maturities(2)\n5.32 \n%\n$\n2,324 \n3.17 \n%\n$\n1,141 \n4.34 \n%\n$\n3,465 \n$\n361 \n$\n195 \n$\n4,021 \nAssets supporting experience-rated contractholder liabilities\n0.00 \n0 \n1.11 \n13 \n1.11 \n13 \n0 \n0 \n13 \nEquity securities \n2.40 \n25 \n2.12 \n10 \n2.31 \n35 \n6 \n0 \n41 \nCommercial mortgage and other loans\n4.81 \n478 \n3.79 \n144 \n4.53 \n622 \n84 \n5 \n711 \nPolicy loans\n4.97 \n49 \n3.77 \n25 \n4.47 \n74 \n49 \n(1)\n122 \nShort-term investments and cash equivalents\n5.87 \n166 \n4.27 \n42 \n5.46 \n208 \n9 \n0 \n217 \nGross investment income\n5.19 \n3,042 \n3.19 \n1,375 \n4.34 \n4,417 \n509 \n199 \n5,125 \nInvestment expenses\n(0.17)\n(209)\n(0.12)\n(89)\n(0.15)\n(298)\n(60)\n(1)\n(359)\nInvestment income after investment expenses\n5.02 \n%\n2,833 \n3.07 \n%\n1,286 \n4.19 \n%\n4,119 \n449 \n198 \n4,766 \nOther invested assets(3)\n265 \n198 \n463 \n79 \n166 \n708 \nInvestment results of other entities and operations(4)\n54 \n0 \n54 \n0 \n0 \n54 \nTotal net investment income\n$\n3,152 \n$\n1,484 \n$\n4,636 \n$\n528 \n$\n364 \n$\n5,528 \nThree Months Ended September 30, 2024\nPFI Excluding Closed Block Division, Funds Withheld and Japanese Insurance Operations\nJapanese Insurance Operations\nPFI Excluding Closed Block Division and Funds Withheld\nClosed Block Division\nFunds Withheld\nTotal(5)\nYield(1)\nAmount\nYield(1)\nAmount\nYield(1)\nAmount\nAmount\nAmount\nAmount\n($ in millions)\nFixed maturities(2)\n5.26 \n%\n$\n2,183 \n3.18 \n%\n$\n1,115 \n4.30 \n%\n$\n3,298 \n$\n373 \n$\n200 \n$\n3,871 \nAssets supporting experience-rated contractholder liabilities\n0.00 \n0 \n1.11 \n10 \n1.11 \n10 \n0 \n0 \n10 \nEquity securities \n2.81 \n22 \n1.90 \n6 \n2.55 \n28 \n8 \n0 \n36 \nCommercial mortgage and other loans\n4.59 \n411 \n3.71 \n153 \n4.31 \n564 \n79 \n3 \n646 \nPolicy loans\n5.31 \n51 \n3.71 \n24 \n4.66 \n75 \n53 \n(1)\n127 \nShort-term investments and cash equivalents\n6.02 \n217 \n5.25 \n35 \n5.92 \n252 \n15 \n2 \n269 \nGross investment income\n5.15 \n2,884 \n3.21 \n1,343 \n4.32 \n4,227 \n528 \n204 \n4,959 \nInvestment expenses\n(0.15)\n(183)\n(0.13)\n(90)\n(0.14)\n(273)\n(73)\n(1)\n(347)\nInvestment income after investment expenses\n5.00 \n%\n2,701 \n3.08 \n%\n1,253 \n4.18 \n%\n3,954 \n455 \n203 \n4,612 \nOther invested assets(3)\n122 \n121 \n243 \n49 \n134 \n426 \nInvestment results of other entities and operations(4)\n17 \n0 \n17 \n0 \n0 \n17 \nTotal net investment income\n$\n2,840 \n$\n1,374 \n$\n4,214 \n$\n504 \n$\n337 \n$\n5,055 \n__________\n(1)\nFor interim periods, yields are annualized. The denominator in the yield percentage is based on quarterly average carrying values for all asset types except for fixed maturities which are based on amortized cost, net of allowance. Amounts for fixed maturities, short-term investments and cash equivalents are also netted for securities lending activity (i.e., income netted for rebate expenses and asset values netted for securities lending liabilities). A yield is not presented for other invested assets as it is not considered a meaningful measure of investment performance. Yields exclude investment income and assets related to other invested assets. Prior periods have been updated to reflect the correction of an error.\n(2)\nIncludes fixed maturity securities classified as available-for-sale and excludes fixed maturity securities classified as trading, which are included in other invested assets.\n143\nTable of Contents\n(3)\nOther invested assets consists of investments in LPs/LLCs, investment real estate held through direct ownership, derivative instruments, fixed maturities classified as trading and other miscellaneous investments.\n(4)\nIncludes net investment income of our investment management operations.\n(5)\nThe total yield was 4.21% and 4.11% for the three months ended September 30, 2025 and 2024, respectively. \nThree Month Comparison. \nThe increase in investment income after investment expenses yield attributable to our general account investments excluding the Closed Block division, Funds Withheld and the Japanese insurance operations’ portfolio for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, was primarily the result of higher fixed income reinvestment rates.\nThe decrease in investment income after investment expenses yield attributable to the Japanese insurance operations’ portfolio for the three months ended September 30, 2025, compared to the three months ended\n \nSeptember 30, 2024, was primarily the result of lower fixed income reinvestment rates.\nBoth the U.S. dollar-denominated and Australian dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts provide a yield that is substantially higher than the yield on comparable yen-denominated fixed maturities. The average amortized cost of U.S. dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts was $72.2 billion and $69.2 billion for the three months ended September 30, 2025 and 2024, respectively. The majority of U.S. dollar-denominated fixed maturities support liabilities that are denominated in U.S. dollars. The average amortized cost of Australian dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts was $1.9 billion and $2.8 billion for the three months ended\n \nSeptember 30, 2025 and 2024, respectively. The majority of Australian dollar-denominated fixed maturities support liabilities that are denominated in Australian dollars. For additional information regarding U.S. and Australian dollar investments held in our Japanese insurance operations, see “—Results of Operations by Segment—Impact of Foreign Currency Exchange Rates” above.\nNine Months Ended September 30, 2025\nPFI Excluding Closed Block Division, Funds Withheld and Japanese Insurance Operations\nJapanese Insurance Operations\nPFI Excluding Closed Block Division and Funds Withheld\nClosed Block Division\nFunds Withheld\nTotal(5)\nYield(1)\nAmount\nYield(1)\nAmount\nYield(1)\nAmount\nAmount\nAmount\nAmount\n($ in millions)\nFixed maturities(2)\n5.45 \n%\n$\n6,841 \n3.19 \n%\n$\n3,343 \n4.41 \n%\n$\n10,184 \n$\n1,085 \n$\n581 \n$\n11,850 \nAssets supporting experience-rated contractholder liabilities\n0.00 \n0 \n1.17 \n36 \n1.17 \n36 \n0 \n0 \n36 \nEquity securities \n2.05 \n73 \n2.97 \n40 \n2.30 \n113 \n21 \n0 \n134 \nCommercial mortgage and other loans\n4.79 \n1,379 \n3.82 \n440 \n4.51 \n1,819 \n252 \n15 \n2,086 \nPolicy loans\n5.08 \n145 \n3.81 \n76 \n4.56 \n221 \n151 \n(3)\n369 \nShort-term investments and cash equivalents\n5.40 \n517 \n4.42 \n123 \n5.18 \n640 \n34 \n2 \n676 \nGross investment income\n5.25 \n8,955 \n3.23 \n4,058 \n4.39 \n13,013 \n1,543 \n595 \n15,151 \nInvestment expenses\n(0.18)\n(614)\n(0.13)\n(260)\n(0.16)\n(874)\n(183)\n(2)\n(1,059)\nInvestment income after investment expenses\n5.07 \n%\n8,341 \n3.10 \n%\n3,798 \n4.23 \n%\n12,139 \n1,360 \n593 \n14,092 \nOther invested assets(3)\n550 \n459 \n1,009 \n172 \n476 \n1,657 \nInvestment results of other entities and operations(4)\n135 \n0 \n135 \n0 \n0 \n135 \nTotal net investment income\n$\n9,026 \n$\n4,257 \n$\n13,283 \n$\n1,532 \n$\n1,069 \n$\n15,884 \n144\nTable of Contents\nNine Months Ended September 30, 2024\nPFI Excluding Closed Block Division, Funds Withheld and Japanese Insurance Operations\nJapanese Insurance Operations\nPFI Excluding Closed Block Division and Funds Withheld\nClosed Block Division\nFunds Withheld\nTotal(5)\nYield(1)\nAmount\nYield(1)\nAmount\nYield(1)\nAmount\nAmount\nAmount\nAmount\n($ in millions)\nFixed maturities(2)\n5.27 \n%\n$\n6,313 \n3.10 \n%\n$\n3,235 \n4.25 \n%\n$\n9,548 \n$\n1,119 \n$\n627 \n$\n11,294 \nAssets supporting experience-rated contractholder liabilities\n0.00 \n0 \n1.10 \n28 \n1.10 \n28 \n0 \n0 \n28 \nEquity securities \n3.04 \n76 \n3.06 \n33 \n3.04 \n109 \n25 \n0 \n134 \nCommercial mortgage and other loans\n4.57 \n1,168 \n3.78 \n478 \n4.31 \n1,646 \n242 \n8 \n1,896 \nPolicy loans\n5.12 \n146 \n3.76 \n73 \n4.57 \n219 \n153 \n(3)\n369 \nShort-term investments and cash equivalents\n6.47 \n651 \n5.88 \n92 \n6.40 \n743 \n57 \n9 \n809 \nGross investment income\n5.18 \n8,354 \n3.17 \n3,939 \n4.32 \n12,293 \n1,596 \n641 \n14,530 \nInvestment expenses\n(0.18)\n(560)\n(0.12)\n(246)\n(0.14)\n(806)\n(221)\n(2)\n(1,029)\nInvestment income after investment expenses\n5.00 \n%\n7,794 \n3.05 \n%\n3,693 \n4.18 \n%\n11,487 \n1,375 \n639 \n13,501 \nOther invested assets(3)\n384 \n347 \n731 \n152 \n293 \n1,176 \nInvestment results of other entities and operations(4)\n(9)\n0 \n(9)\n0 \n0 \n(9)\nTotal net investment income\n$\n8,169 \n$\n4,040 \n$\n12,209 \n$\n1,527 \n$\n932 \n$\n14,668 \n__________\n(1)\nFor interim periods, yields are annualized. The denominator in the yield percentage is based on quarterly average carrying values for all asset types except for fixed maturities which are based on amortized cost, net of allowance. Amounts for fixed maturities, short-term investments and cash equivalents are also netted for securities lending activity (i.e., income netted for rebate expenses and asset values netted for securities lending liabilities). A yield is not presented for other invested assets as it is not considered a meaningful measure of investment performance. Yields exclude investment income and assets related to other invested assets. Prior periods have been updated to reflect the correction of an error.\n(2)\nIncludes fixed maturity securities classified as available-for-sale and excludes fixed maturity securities classified as trading, which are included in other invested assets.\n(3)\nOther invested assets consists of investments in LPs/LLCs, investment real estate held through direct ownership, derivative instruments, fixed maturities classified as trading and other miscellaneous investments.\n(4)\nIncludes net investment income of our investment management operations.\n(5)\nThe total yield was 4.24% and 4.12% for the nine months ended September 30, 2025 and 2024, respectively. \nNine Month Comparison. \nThe increase in investment income after investment expenses yield attributable to our general account investments excluding the Closed Block division, Funds Withheld and the Japanese insurance operations’ portfolio for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, was primarily the result of higher fixed income reinvestment rates.\nThe increase in investment income after investment expenses yield attributable to the Japanese insurance operations’ portfolio for the nine months ended September 30, 2025, compared to the nine months ended\n \nSeptember 30, 2024, was primarily the result of higher fixed income reinvestment rates.\nBoth the U.S. dollar-denominated and Australian dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts provide a yield that is substantially higher than the yield on comparable yen-denominated fixed maturities. The average amortized cost of U.S. dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts was $70.9 billion and $68.8 billion for the nine months ended September 30, 2025 and 2024, respectively. The majority of U.S. dollar-denominated fixed maturities support liabilities that are denominated in U.S. dollars. The average amortized cost of Australian dollar-denominated fixed maturities that are not hedged to yen through third-party derivative contracts was $2.1 billion and $3.4 billion for the nine months ended\n \nSeptember 30, 2025 and 2024, respectively. The majority of Australian dollar-denominated fixed maturities support liabilities that are denominated in Australian dollars. For additional information regarding U.S. and Australian dollar investments held in our Japanese insurance operations, see “—Results of Operations by Segment—Impact of Foreign Currency Exchange Rates” above.\n145\nTable of Contents\nRealized Investment Gains and Losses\nThe following table sets forth “Realized investment gains (losses), net” of our general account apportioned between PFI excluding the Closed Block division and Funds Withheld, the Closed Block division and Funds Withheld, by investment type for the periods indicated:\n146\nTable of Contents\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(in millions)\nPFI excluding Closed Block Division and Funds Withheld(4):\nRealized investment gains (losses), net: \n(Addition to) release of allowance for credit losses on fixed maturities\n$\n(55)\n$\n(54)\n$\n45 \n$\n(65)\nWrite-downs on fixed maturities(1)\n(14)\n(440)\n(165)\n(449)\nNet gains (losses) on sales and maturities\n(41)\n(32)\n(28)\n(292)\nFixed maturity securities(2)\n(110)\n(526)\n(148)\n(806)\n(Addition to) release of allowance for credit losses on loans\n36 \n(27)\n54 \n(121)\nWrite-downs on mortgage and other loans\n(88)\n(15)\n(221)\n(15)\nNet gains (losses) on sales and maturities\n(9)\n0 \n(8)\n0 \nCommercial mortgage and other loans\n(61)\n(42)\n(175)\n(136)\nDerivatives\n(316)\n107 \n(1,753)\n139 \nOTTI losses on other invested assets recognized in earnings\n0 \n(9)\n(12)\n(16)\nOther net gains (losses)\n45 \n35 \n65 \n116 \nOther\n45 \n26 \n53 \n100 \nSubtotal\n(442)\n(435)\n(2,023)\n(703)\nInvestment results of other entities and operations(3)\n6 \n(5)\n4 \n1 \nTotal — PFI excluding Closed Block Division and Funds Withheld\n$\n(436)\n$\n(440)\n$\n(2,019)\n$\n(702)\nClosed Block Division:\nRealized investment gains (losses), net:\n(Addition to) release of allowance for credit losses on fixed maturities\n$\n(7)\n$\n(13)\n$\n4 \n$\n(35)\nWrite-downs on fixed maturities(1)\n0 \n0 \n(16)\n0 \nNet gains (losses) on sales and maturities\n(11)\n(204)\n(68)\n(447)\nFixed maturity securities(2)\n(18)\n(217)\n(80)\n(482)\n(Addition to) release of allowance for credit losses on loans\n21 \n(11)\n24 \n(22)\nWrite-downs on mortgage loans\n(31)\n0 \n(64)\n0 \nNet gains (losses) on sales and maturities\n(5)\n0 \n(5)\n0 \nCommercial mortgage and other loans\n(15)\n(11)\n(45)\n(22)\nDerivatives\n35 \n(5)\n(142)\n(28)\nOther net gains (losses)\n1 \n0 \n15 \n0 \nOther\n1 \n0 \n15 \n0 \nSubtotal — Closed Block Division\n$\n3 \n$\n(233)\n$\n(252)\n$\n(532)\nFunds Withheld(4):\nRealized investment gains (losses), net:\n(Addition to) release of allowance for credit losses on fixed maturities\n$\n3 \n$\n0 \n$\n(1)\n$\n0 \nWrite-downs on fixed maturities(1)\n(2)\n0 \n(11)\n0 \nNet gains (losses) on sales and maturities\n(99)\n(92)\n(188)\n(261)\nFixed maturity securities(2)\n(98)\n(92)\n(200)\n(261)\nCommercial mortgage and other loans\n0 \n0 \n0 \n0 \nDerivatives\n(242)\n(831)\n(400)\n(259)\nOther net gains (losses)\n(253)\n(248)\n(584)\n(564)\nOther\n(253)\n(248)\n(584)\n(564)\nSubtotal — Funds Withheld(4)\n$\n(593)\n$\n(1,171)\n$\n(1,184)\n$\n(1,084)\nPFI realized investment gains (losses), net\n$\n(1,026)\n$\n(1,844)\n$\n(3,455)\n$\n(2,318)\n147\nTable of Contents\n_________\n(1)\nAmounts represent write-downs of credit adverse securities and securities actively marketed for sale.\n(2)\nIncludes fixed maturity securities classified as available-for-sale and excludes fixed maturity securities classified as trading.\n(3)\nIncludes “realized investment gains (losses), net” of our investment management operations.\n(4)\nPrior period amounts have been updated to conform to current period presentation.\nThe following analysis reflects realized gains (losses) attributable to PFI excluding Closed Block Division and Funds Withheld.\nThree Month Comparison\n. Net losses on sales and maturities of fixed maturity securities were $41 million for the third quarter of 2025 primarily driven by net losses on sales in a higher interest rate environment, partially offset by the impact of foreign currency exchange rate movements on U.S. dollar-denominated securities that matured or were sold within our International Businesses. Net losses on sales and maturities of fixed maturity securities were $32 million for the third quarter of 2024 primarily driven by net losses on sales in a higher interest rate environment, partially offset by the impact of foreign currency exchange rate movements on U.S. dollar-denominated securities that matured or were sold within our International Businesses.\nNet realized losses on derivative instruments of $316 million for the third quarter of 2025 primarily included:\n•\n$416 million of net losses on embedded derivatives and product-related hedge positions. \nPartially offsetting these losses were:\n•\n$102 million of gains on foreign currency hedges primarily due to U.S. dollar appreciation versus foreign currencies;\n•\n$39 million of gains on Synthetic Guarantees; and\n•\n$26 million of gains on credit default swaps due to credit spreads tightening.\nNet realized gains on derivative instruments of $107 million for the third quarter of 2024 primarily included: \n•\n$554 million of gains on interest rate derivatives due to decreases in swap and U.S. Treasury rates; \n•\n$28 million of gains on credit default swaps due to credit spreads tightening; and\n•\n$25 million of gains on Synthetic Guarantees.\nPartially offsetting these gains were:\n•\n$495 million of net losses on product-related embedded derivatives and related hedge positions; and\n•\n$109 million of losses on foreign currency hedges primarily due to U.S. dollar depreciation versus foreign currencies.\nFor a discussion of living benefit guarantees and related hedge positions in our \nIndividual Retirement Strategies business\n, see “—Results of Operations by Segment—\nRetirement Strategies\n” above. \nNine Month Comparison\n. \nNet losses on sales and maturities of fixed maturity securities were $28 million for the first nine months of 2025 primarily driven by net losses on sales in a higher interest rate environment, partially offset by net gains on assets transferred upon execution of the reinsurance transaction with Prismic Re International and the impact of foreign currency exchange rate movements on U.S. dollar-denominated securities that matured or were sold within our International Businesses. Net losses on sales and maturities of fixed maturity securities were $292 million for the first nine months of 2024 primarily driven by net losses on sales in a higher interest rate environment, partially offset by the impact of foreign currency exchange rate movements on U.S. dollar-denominated securities that matured or were sold within our International Businesses.\nNet realized losses on derivative instruments of $1,753 million for the first nine months of 2025 primarily included:\n•\n$1,033 million of net losses on product-related hedge positions and related embedded derivatives including those unfavorably impacted by the annual review and update of assumptions and other refinements within Individual Life; and\n•\n$693 million of losses on foreign currency hedges primarily due to U.S. dollar depreciation versus foreign currencies.\nNet realized gains on derivative instruments of $139 million for the first nine months of 2024 primarily included: \n•\n$272 million of net gains on product-related hedge positions and related embedded derivatives;\n148\nTable of Contents\n•\n$77 million of gains on credit default swaps due to credit spread tightening; \n•\n$76 million of gains on Synthetic Guarantees; and\n•\n$41 million of gains on foreign currency hedges primarily due to U.S. dollar appreciation versus the Brazilian real.\nPartially offsetting these gains were:\n•\n$359 million of losses on interest rate derivatives due to increases in U.S. Treasury and Japanese yen swap rates.\nFor a discussion of living benefit guarantees and related hedge positions in our \nIndividual Retirement Strategies business\n, see “—Results of Operations by Segment—\nRetirement Strategies\n” above. \nCredit Losses\nThe level of credit losses generally reflects current and expected economic conditions and is expected to increase when economic conditions worsen and to decrease when economic conditions improve. Historically, the causes of credit losses have been specific to each individual issuer and have not directly resulted in credit losses to other securities within the same industry or geographic region. We may also realize additional credit and interest rate-related losses through sales of investments pursuant to our credit risk and portfolio management objectives.\nWe maintain separate monitoring processes for public and private fixed maturities and create watch lists to highlight securities that require special scrutiny and management. For private placements, our credit and portfolio management processes help ensure prudent controls over valuation and management. We have separate pricing and authorization processes to establish “checks and balances” for new investments. We apply consistent standards of credit analysis and due diligence for all transactions, whether they originate through our own in-house staff or through agents. Our regional offices closely monitor the portfolios in their regions. We set all valuation standards centrally, and we assess the fair value of all investments quarterly. Our public and private fixed maturity investment managers formally review all public and private fixed maturity holdings on a quarterly basis and more frequently when necessary to identify potential credit deterioration whether due to ratings downgrades, unexpected price variances and/or company or industry-specific concerns. \nFor LPs/LLCs accounted for using the equity method and for wholly-owned investment real estate, the carrying value of these investments is written down or impaired to fair value when a decline in value is considered to be other-than-temporary. For additional information regarding our OTTI policies, see Note 2 to the Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024. \nGeneral Account Investments of PFI excluding Closed Block Division and Funds Withheld\nIn the following sections, we provide details about our investment portfolio, excluding investments held in the Closed Block division and the Funds Withheld portfolios. We believe the details of the composition of our investment portfolio excluding Closed Block division and Funds Withheld are most relevant to an understanding of our operations that are pertinent to investors in Prudential Financial, Inc. because (1) substantially all Closed Block division assets support obligations and liabilities relating to the Closed Block policies where the economics inure to those participating policies and not to shareholders of the Company’s Common Stock and (2) the Funds Withheld assets support liabilities relating to reinsurance agreements where the economic benefits and associated investment risk of the Funds Withheld ultimately inure to the reinsurer. See Notes 12 and 13 to the Unaudited Interim Consolidated Financial Statements for additional information regarding our material reinsurance agreements and the Closed Block division, respectively.\nFixed Maturity Securities\n \nIn the following sections, we provide details about our fixed maturity securities portfolio, which excludes fixed maturity securities classified as assets supporting experience-rated contractholder liabilities and securities classified as trading. \n149\nTable of Contents\n    \nFixed Maturity Securities by Industry\n \nThe following table sets forth the composition of our fixed maturity, available-for-sale portfolio by industry category and the associated gross unrealized gains and losses, as well as the allowance for credit losses (“ACL”), as of the dates indicated:\n \n \nSeptember 30, 2025\nDecember 31, 2024\nIndustry(1)\nAmortized\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nACL\nFair\nValue\nAmortized\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nACL\nFair\nValue\n \n(in millions)\nCorporate securities:\nFinance\n$\n47,351 \n$\n816 \n$\n2,555 \n$\n2 \n$\n45,610 \n$\n43,697 \n$\n470 \n$\n3,614 \n$\n4 \n$\n40,549 \nConsumer non-cyclical\n33,115 \n684 \n2,687 \n6 \n31,106 \n31,721 \n420 \n3,504 \n33 \n28,604 \nUtility\n31,540 \n797 \n2,343 \n23 \n29,971 \n28,984 \n421 \n2,991 \n18 \n26,396 \nCapital goods\n21,277 \n604 \n1,029 \n13 \n20,839 \n19,444 \n242 \n1,561 \n37 \n18,088 \nConsumer cyclical\n12,774 \n370 \n462 \n100 \n12,582 \n11,955 \n198 \n674 \n81 \n11,398 \nForeign agencies\n1,786 \n28 \n123 \n0 \n1,691 \n1,838 \n26 \n168 \n0 \n1,696 \nEnergy\n13,232 \n335 \n637 \n14 \n12,916 \n12,310 \n159 \n894 \n19 \n11,556 \nCommunications\n6,579 \n226 \n416 \n22 \n6,367 \n6,872 \n169 \n568 \n63 \n6,410 \nBasic industry\n7,961 \n224 \n442 \n20 \n7,723 \n7,651 \n96 \n619 \n0 \n7,128 \nTransportation\n12,607 \n398 \n723 \n0 \n12,282 \n11,783 \n177 \n1,002 \n0 \n10,958 \nTechnology\n6,566 \n174 \n285 \n24 \n6,431 \n5,554 \n84 \n408 \n14 \n5,216 \nIndustrial other\n5,099 \n46 \n804 \n4 \n4,337 \n4,750 \n30 \n881 \n5 \n3,894 \nTotal corporate securities\n199,887 \n4,702 \n12,506 \n228 \n191,855 \n186,559 \n2,492 \n16,884 \n274 \n171,893 \nForeign government(2)\n66,092 \n857 \n11,780 \n0 \n55,169 \n62,880 \n1,828 \n7,801 \n0 \n56,907 \nResidential mortgage-backed(3)\n4,120 \n34 \n159 \n0 \n3,995 \n2,468 \n14 \n214 \n0 \n2,268 \nAsset-backed\n16,558 \n173 \n39 \n1 \n16,691 \n14,664 \n201 \n40 \n0 \n14,825 \nCommercial mortgage-backed\n7,041 \n70 \n208 \n0 \n6,903 \n6,185 \n22 \n344 \n0 \n5,863 \nU.S. Government\n22,292 \n697 \n4,176 \n0 \n18,813 \n21,451 \n584 \n4,499 \n0 \n17,536 \nState & Municipal\n5,421 \n134 \n507 \n0 \n5,048 \n5,965 \n129 \n549 \n0 \n5,545 \nTotal fixed maturities, available-for-sale\n$\n321,411 \n$\n6,667 \n$\n29,375 \n$\n229 \n$\n298,474 \n$\n300,172 \n$\n5,270 \n$\n30,331 \n$\n274 \n$\n274,837 \n__________ \n(1)\nInvestment data has been classified based on standard industry categorizations for domestic public holdings and similar classifications by industry for all other holdings. \n(2)\nAs of September 30, 2025 and December 31, 2024, based on amortized cost, 89% and 90% represent Japanese government bonds held by our Japanese insurance operations, respectively. No other individual country represented more than 6% and more than 5% of the balance as of September 30, 2025 and December 31, 2024, respectively.\n(3)\nAs of September 30, 2025 and December 31, 2024, based on amortized cost, 96% and 93%\n \nwere rated A or higher, respectively.\nThe decrease in net unrealized losses from December 31, 2024 to September 30, 2025 was primarily due to the net impact of decreases in U.S. interest rates, partially offset by increases in Japan interest rates.\n150\nTable of Contents\nFixed Maturity Securities Credit Quality\n \nThe Securities Valuation Office (“SVO”) of the National Association of Insurance Commissioners (“NAIC”) evaluates the investments of insurers for statutory reporting purposes and assigns fixed maturity securities to one of six categories called “NAIC Designations.” In general, NAIC Designations of “1” highest quality, or “2” high quality, include fixed maturities considered investment grade, which include securities rated Baa3 or higher by Moody’s Investor Service, Inc. (“Moody’s”) or BBB- or higher by Standard & Poor’s Rating Services (“S&P”). NAIC Designations of “3” through “6” generally include fixed maturities referred to as below investment grade, which include securities rated Ba1 or lower by Moody’s and BB+ or lower by S&P. The NAIC Designations for commercial mortgage-backed securities and non-agency residential mortgage-backed securities, including our asset-backed securities collateralized by sub-prime mortgages, are based on security level expected losses as modeled by an independent third party (engaged by the NAIC) and the statutory carrying value of the security, including any purchase discounts or impairment charges previously recognized.\nAs a result of time lags between the funding of investments, the finalization of legal documents, and the completion of the SVO filing process, the fixed maturity portfolio includes certain securities that have not yet been designated by the SVO as of each balance sheet date. Pending receipt of SVO designations, the categorization of these securities by NAIC Designation is based on the expected ratings indicated by internal analysis.\nRatings assigned by nationally recognized rating agencies include S&P, Moody’s, Fitch Ratings Inc. (“Fitch”) and Morningstar, Inc. (“Morningstar”). Low issue composite rating uses ratings from the major credit rating agencies or, if these are not available, an equivalent internal rating. For securities where the ratings assigned are not equivalent, the second lowest rating is utilized.\nInvestments of our international insurance companies are not subject to NAIC guidelines. Investments of our Japanese insurance operations are regulated locally by the Financial Services Agency (“FSA”), an agency of the Japanese government. The FSA has its own investment quality criteria and risk control standards. Our Japanese insurance companies comply with the FSA’s credit quality review and risk monitoring guidelines. The credit quality ratings of the investments of our Japanese insurance companies are based on ratings assigned by nationally recognized credit rating agencies, including Moody’s and S&P, or rating equivalents based on ratings assigned by Japanese credit rating agencies.\nThe following table sets forth our fixed maturity, available-for-sale portfolio by NAIC Designation or equivalent rating, as of the dates indicated:\nSeptember 30, 2025\nDecember 31, 2024\nNAIC Designation(1) (2)\nAmortized\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses(3)\nACL\nFair\nValue\nAmortized\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses(3)\nACL\nFair\nValue\n \n(in millions)\n1\n$\n208,147 \n$\n3,414 \n$\n23,670 \n$\n0 \n$\n187,891 \n$\n195,449 \n$\n3,669 \n$\n22,081 \n$\n0 \n$\n177,037 \n2\n94,150 \n2,661 \n4,899 \n0 \n91,912 \n87,400 \n1,287 \n7,197 \n0 \n81,490 \nSubtotal High or Highest Quality Securities(4)\n302,297 \n6,075 \n28,569 \n0 \n279,803 \n282,849 \n4,956 \n29,278 \n0 \n258,527 \n3\n13,155 \n424 \n695 \n0 \n12,884 \n11,290 \n174 \n856 \n0 \n10,608 \n4\n4,082 \n95 \n63 \n20 \n4,094 \n3,910 \n63 \n131 \n28 \n3,814 \n5\n1,407 \n40 \n38 \n82 \n1,327 \n1,490 \n46 \n46 \n36 \n1,454 \n6\n470 \n33 \n10 \n127 \n366 \n633 \n31 \n20 \n210 \n434 \nSubtotal Other Securities(5) (6)\n19,114 \n592 \n806 \n229 \n18,671 \n17,323 \n314 \n1,053 \n274 \n16,310 \nTotal fixed maturities, available-for-sale\n$\n321,411 \n$\n6,667 \n$\n29,375 \n$\n229 \n$\n298,474 \n$\n300,172 \n$\n5,270 \n$\n30,331 \n$\n274 \n$\n274,837 \n__________ \n(1)\nReflects equivalent ratings for investments of the international insurance operations. \n151\nTable of Contents\n(2)\nAs of September 30, 2025 and December 31, 2024, $1,159 securities with amortized cost of $7,063 million (fair value, $7,054 million) and 803 securities with amortized cost of $4,147 million (fair value, $3,840 million), respectively, have been categorized based on expected NAIC Designations pending receipt of SVO ratings.\n(3)\nAs of September 30, 2025, includes gross unrealized losses of $611 million on public fixed maturities and $195 million on private fixed maturities considered to be other than high or highest quality and, as of December 31, 2024, includes gross unrealized losses of $625 million on public fixed maturities and $428 million on private fixed maturities considered to be other than high or highest quality.\n(4)\nOn an amortized cost basis, as of September 30, 2025, includes $233,446 million of public fixed maturities and $68,851 million of private fixed maturities and, as of December 31, 2024, includes $219,914 million of public fixed maturities and $62,935 million of private fixed maturities. \n(5)\nOn an amortized cost basis, as of September 30, 2025, includes $7,600 million of public fixed maturities and $11,514 million of private fixed maturities and, as of December 31, 2024, includes $6,706 million of public fixed maturities and $10,617 million of private fixed maturities.\n(6)\nOn an amortized cost basis, as of September 30, 2025, securities considered below investment grade based on low issue composite ratings total $16,039 million, or 5% of the total fixed maturities, and include securities considered high or highest quality by the NAIC based on the rules described above.\nAsset-Backed and Commercial Mortgage-Backed Securities \nThe following table sets forth the amortized cost and fair value of asset-backed and commercial mortgage-backed securities within our fixed maturity, available-for-sale portfolio by credit quality, as of the dates indicated:\nSeptember 30, 2025\nDecember 31, 2024\nAsset-Backed\nSecurities(2)\nCommercial Mortgage-Backed Securities\nAsset-Backed \nSecurities(2)\nCommercial Mortgage-Backed Securities\nLow Issue Composite Rating(1)\nAmortized Cost\nFair\nValue\nAmortized Cost\nFair \nValue\nAmortized Cost\nFair\nValue\nAmortized Cost\nFair\nValue\n(in millions)\nAAA\n$\n7,686 \n$\n7,729 \n$\n5,534 \n$\n5,512 \n$\n7,548 \n$\n7,624 \n$\n4,905 \n$\n4,735 \nAA\n6,265 \n6,279 \n1,499 \n1,383 \n4,836 \n4,863 \n1,271 \n1,119 \nA\n1,773 \n1,790 \n1 \n1 \n1,790 \n1,795 \n1 \n1 \nBBB\n701 \n712 \n0 \n0 \n363 \n367 \n0 \n0 \nBB and below\n133 \n181 \n7 \n7 \n127 \n176 \n8 \n8 \nTotal(3)\n$\n16,558 \n$\n16,691 \n$\n7,041 \n$\n6,903 \n$\n14,664 \n$\n14,825 \n$\n6,185 \n$\n5,863 \n__________ \n(1)\nThe table above provides ratings as assigned by nationally recognized rating agencies as of September 30, 2025 and December 31, 2024, including S&P, Moody’s, Fitch and Morningstar. \n(2)\nIncludes credit-tranched securities collateralized by loan obligations (“CLOs”), home equity loans, auto loans, education loans and other asset types.\n(3)\nExcludes fixed maturity securities classified as “Assets supporting experience-rated contractholder liabilities” and “Fixed maturities, trading.”\nIncluded in “Asset-backed securities” above are investments in CLOs. The following table sets forth information pertaining to these investments in CLOs within our fixed maturity, available-for-sale portfolio, as of the dates indicated:\nSeptember 30, 2025\nDecember 31, 2024\nCollateralized Loan Obligations\nLow Issue Composite Rating(1)\nAmortized Cost\nFair Value\nAmortized Cost\nFair Value\n(in millions)\nAAA\n$\n5,533 \n$\n5,553 \n$\n5,811 \n$\n5,883 \nAA\n4,684 \n4,697 \n3,937 \n3,970 \nA\n36 \n36 \n13 \n13 \nBBB\n24 \n25 \n14 \n14 \nBB and below\n18 \n18 \n11 \n11 \nTotal(2)(3)\n$\n10,295 \n$\n10,329 \n$\n9,786 \n$\n9,891 \n \n__________ \n(1)\nThe table above provides ratings as assigned by nationally recognized rating agencies as of September 30, 2025 and December 31, 2024, including S&P, Moody’s, Fitch and Morningstar.\n(2)\nThere was no allowance for credit losses as of both September 30, 2025 and December 31, 2024. \n(3)\nExcludes fixed maturity securities classified as “Assets supporting experience-rated contractholder liabilities” and “Fixed maturities, trading.”\nAssets Supporting Experience-Rated Contractholder Liabilities\n \nFor information regarding the composition of “Assets supporting experience-rated contractholder liabilities,” see Note 3 to the Unaudited Interim Consolidated Financial Statements.\n152\nTable of Contents\nCommercial Mortgage and Other Loans\n \nInvestment Mix\nThe following table sets forth the composition of our commercial mortgage and other loans portfolio, as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\n \n(in millions)\nCommercial mortgage and agricultural property loans\n$\n54,765 \n$\n53,384 \nResidential mortgage loans\n692 \n19 \nUncollateralized loans\n296 \n595 \nOther collateralized loans\n491 \n457 \nTotal recorded investment gross of allowance(1)\n56,244 \n54,455 \nAllowance for credit losses\n(415)\n(468)\nTotal commercial mortgage and other loans, net\n$\n55,829 \n$\n53,987 \n __________\n(1)\nAs a percentage of recorded investment gross of allowance, 99% of these assets were current as of both September 30, 2025 and December 31, 2024.\nWe originate commercial mortgage and agricultural property loans using a dedicated sales and underwriting staff through our various regional offices in the U.S. and international offices primarily in London and Tokyo. All loans are underwritten consistently to our standards using a proprietary quality rating system that has been developed from our industry experience in real estate and mortgage lending.\nResidential mortgage loans primarily include fixed-rate, amortizing mortgage loans on rental properties owned by borrowers with FICO scores typically considered prime or above.\nUncollateralized loans primarily represent corporate loans and unsecured consumer loans.\nOther collateralized loans include mezzanine real estate debt investments and consumer loans.\nComposition of Commercial Mortgage and Agricultural Property Loans\n \nOur commercial mortgage and agricultural property loan portfolio strategy emphasizes diversification by property type and geographic location. The following tables set forth the breakdown of the gross carrying values of commercial mortgage and agricultural property loans by geographic region and property type, as of the dates indicated:\n153\nTable of Contents\n \nSeptember 30, 2025\nDecember 31, 2024\n \nGross\nCarrying\nValue\n% of\nTotal\nGross\nCarrying\nValue\n% of\nTotal\n \n($ in millions)\nCommercial mortgage and agricultural property loans by region:\nU.S. Regions(1):\nPacific\n$\n18,590 \n33.9 \n%\n$\n18,683 \n35.0 \n%\nSouth Atlantic\n9,215 \n16.8 \n8,643 \n16.2 \nMiddle Atlantic\n6,534 \n11.9 \n6,192 \n11.6 \nEast North Central\n3,667 \n6.7 \n3,090 \n5.8 \nWest South Central\n5,053 \n9.2 \n5,428 \n10.2 \nMountain\n2,856 \n5.2 \n2,845 \n5.3 \nNew England\n1,360 \n2.5 \n1,205 \n2.3 \nWest North Central\n500 \n0.9 \n520 \n1.0 \nEast South Central\n1,249 \n2.3 \n1,122 \n2.1 \nSubtotal-U.S.\n49,024 \n89.4 \n47,728 \n89.5 \nEurope\n3,590 \n6.6 \n3,505 \n6.5 \nMexico\n913 \n1.7 \n913 \n1.7 \nAsia\n712 \n1.3 \n688 \n1.3 \nOther\n526 \n1.0 \n550 \n1.0 \nTotal commercial mortgage and agricultural property loans\n$\n54,765 \n100.0 \n%\n$\n53,384 \n100.0 \n%\n__________\n(1)\nRegions as defined by the United States Census Bureau.\n \nSeptember 30, 2025\nDecember 31, 2024\n \nGross\nCarrying\nValue\n% of\nTotal\nGross\nCarrying\nValue\n% of\nTotal\n \n($ in millions)\nCommercial mortgage and agricultural property loans by property type:\nIndustrial\n$\n15,569 \n28.4 \n%\n$\n15,314 \n28.7 \n%\nRetail\n4,760 \n8.7 \n4,547 \n8.5 \nOffice\n5,738 \n10.5 \n6,587 \n12.3 \nApartments/Multi-Family\n16,395 \n29.9 \n15,066 \n28.2 \nAgricultural properties\n6,776 \n12.4 \n6,497 \n12.2 \nHospitality\n1,490 \n2.7 \n1,603 \n3.0 \nSelf-Storage(1)\n1,890 \n3.5 \n1,858 \n3.5 \nHealth Care Senior Living(1)\n1,644 \n3.0 \n1,635 \n3.1 \nOther(1)\n503 \n0.9 \n277 \n0.5 \nTotal commercial mortgage and agricultural property loans\n$\n54,765 \n100.0 \n%\n$\n53,384 \n100.0 \n%\n__________\n(1)\nPrior period amounts have been updated to conform to current period presentation.\nLoan-to-value and debt service coverage ratios are measures commonly used to assess the quality of commercial mortgage and agricultural property loans. The loan-to-value ratio compares the amount of the loan to the fair value of the underlying property collateralizing the loan and is commonly expressed as a percentage. A loan-to-value ratio less than 100% indicates an excess of collateral value over the loan amount. Loan-to-value ratios greater than 100% indicate that the loan amount exceeds the collateral value. The debt service coverage ratio compares a property’s net operating income to its debt service payments. Debt service coverage ratios less than 1.0 times indicate that property operations do not generate enough income to cover the loan’s current debt payments. A debt service coverage ratio greater than 1.0 times indicates an excess of net operating income over the debt service payments.\n154\nTable of Contents\nAs of September 30, 2025, our commercial mortgage and agricultural property loans had a weighted-average debt service coverage ratio of 2.33 times and a weighted-average loan-to-value ratio of 58%. For those commercial mortgage and agricultural property loans that were originated in 2025, the weighted-average debt service coverage ratio was 1.55 times, and the weighted-average loan-to-value ratio was 60%.\n \nThe values utilized in calculating these loan-to-value ratios are developed as part of our periodic reviews of the commercial mortgage and agricultural property loan portfolio, which include internal evaluations of the underlying collateral values. Our periodic reviews also include a credit quality re-rating process, whereby we update the internal quality ratings originally assigned at underwriting based on the proprietary quality rating system mentioned above. As discussed below, the internal credit quality rating is a key input in determining our allowance for credit losses. \nAs of September 30, 2025, 95% of our commercial mortgage, agricultural property and residential mortgage loans were fixed rate loans.\nFor loans with collateral under construction, renovation or lease-up, projected stabilized values and net operating income are used in the calculation of the loan-to-value and debt service coverage ratios. Our commercial mortgage and agricultural property loan portfolio included $2.4 billion and $1.8 billion of such loans as of September 30, 2025 and December 31, 2024, respectively. All else being equal, these loans are inherently riskier than those collateralized by properties that have already stabilized. As of both September 30, 2025 and December 31, 2024, there were less than $1 million of allowances related to these loans. In addition, these unstabilized loans are included in the calculation of our portfolio reserve, as discussed below. \nThe following table sets forth the gross carrying value of our commercial mortgage and agricultural property loans by loan-to-value and debt service coverage ratios, as of the date indicated: \n \nSeptember 30, 2025\n \nDebt Service Coverage Ratio\n \n>\n 1.2x\n1.0x\nto\n< 1.2x\n< 1.0x\nTotal\nCommercial Mortgage\nand Agricultural\nProperty\nLoans\nLoan-to-Value Ratio\n(in millions)\n0%-59.99%\n$\n27,646 \n$\n901 \n$\n483 \n$\n29,030 \n60%-69.99%\n14,498 \n827 \n205 \n15,530 \n70%-79.99%\n4,568 \n374 \n334 \n5,276 \n80% or greater\n2,948 \n598 \n1,383 \n4,929 \nTotal commercial mortgage and agricultural property loans\n$\n49,660 \n$\n2,700 \n$\n2,405 \n$\n54,765 \n \n155\nTable of Contents\nThe following table sets forth the breakdown of our commercial mortgage and agricultural property loans by year of origination, as of the date indicated:\nSeptember 30, 2025\nGross\nCarrying\nValue\n% of\nTotal\nYear of Origination\n($ in millions)\n2025\n$\n5,407 \n9.9 \n%\n2024\n7,411 \n13.4 \n2023\n5,473 \n10.0 \n2022\n4,155 \n7.6 \n2021\n6,840 \n12.5 \n2020\n3,102 \n5.7 \n2019\n5,373 \n9.8 \n2018 & Prior\n16,789 \n30.7 \nRevolving Loans\n215 \n0.4 \nTotal commercial mortgage and agricultural property loans\n$\n54,765 \n100.0 \n%\nResidential Mortgage Loans \nResidential mortgage loans primarily include fixed-rate, amortizing mortgage loans on rental properties owned by borrowers with FICO scores typically considered prime or above. The primary credit quality indicator is whether a loan is performing or nonperforming. The Company defines nonperforming residential mortgage loans as those that are 90 days or more past due and/or in nonaccrual status.\nAll of the loans are currently performing.\nCommercial Mortgage and Other Loans Quality\n \nThe commercial mortgage and other loans portfolio is monitored on an ongoing basis. If certain criteria are met, loans are assigned to either of the following “watch list” categories: \n(1) “Closely Monitored,” which includes a variety of considerations, such as when loan metrics fall below acceptable levels, the borrower is not cooperative or has requested a material modification, or the portfolio manager has directed a change in category; or\n \n(2) “Not in Good Standing,” which includes loans in default or with a high probability of loss of principal, such as when the loan is in the process of foreclosure or the borrower is in bankruptcy. \nOur workout and special servicing professionals manage the loans on the watch list.\nThe current expected credit loss (“CECL”) allowance represents the Company’s best estimate of expected credit losses over the remaining life of the assets. The determination of the allowance considers historical credit loss experience, current conditions, and reasonable and supportable forecasts. The allowance is calculated separately for commercial mortgage loans, agricultural mortgage loans, residential mortgage loans, uncollateralized loans and other collateralized loans. \nFor commercial mortgage and agricultural property loans, the allowance is calculated using an internally developed CECL model. \nKey inputs to the CECL model include unpaid principal balances, internal credit ratings, annual expected loss factors, average lives of the loans adjusted for prepayment considerations, current and historical interest rate assumptions and other factors influencing the Company’s view of the current stage of the economic cycle and future economic conditions. Subjective considerations include a review of whether historical loss experience is representative of current market conditions and the Company’s view of the credit cycle. Model assumptions and factors are reviewed and updated as appropriate. \n156\nTable of Contents\nWhen individual loans no longer have the credit risk characteristics of the commercial or agricultural mortgage loan pools, they are removed from the pools and are evaluated individually for an allowance. The allowance is determined based on the outstanding loan balance less the present value of expected future cash flows discounted at the loan’s effective interest rate or the fair value of the collateral if the loan is collateral dependent. \nFor residential mortgage loans, the CECL calculation pools together loans that share similar risk characteristics. The estimated lifetime loss of the pool is calculated from the risk profiles of the loans, including borrower credit score, loan-to-value ratio, property type, and several key attributes of the loan and property including: loan type, loan age, loan performance history, and current performing or nonperforming status. Estimated lifetime loss rates are calculated by weighting projected losses in multiple economic scenarios based on the Company’s view of the current stage of the economic cycle and future economic conditions. The scenario losses are calibrated to industry historical experience of defaults, loss severities, and prepayment rates in multiple economic cycles, reflective of similar loan characteristics.\nThe CECL allowance for other collateralized and uncollateralized loans carried at amortized cost is determined based on probability of default and loss given default assumptions by sector, credit quality and average lives of the loans. \nThe following table sets forth the change in allowance for credit losses for our commercial mortgage and other loans portfolios, as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\n \n(in millions)\nAllowance, beginning of year\n$\n468 \n$\n372 \nAddition to (release of) allowance for credit losses\n137 \n207 \nWrite-downs charged against the allowance\n(191)\n(107)\nOther\n1 \n(4)\nAllowance, end of period\n$\n415 \n$\n468 \n \nThe allowance for credit losses as of September 30, 2025 decreased in comparison to December 31, 2024 primarily related to write-downs against loan-specific reserves within agricultural property loans and commercial mortgage loans in the retail sector, partially offset by an increase in loan-specific reserves within the retail sector.\nEquity Securities\n \nThe equity securities portfolio consists principally of investments in common and preferred stock of publicly-traded companies, as well as mutual fund shares. The following table sets forth the composition of our equity securities portfolio and the associated gross unrealized gains and losses, as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\n \nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nFair\nValue\nCost\nGross\nUnrealized\nGains\nGross\nUnrealized\nLosses\nFair\nValue\n \n(in millions)\nMutual funds\n$\n975 \n$\n1,209 \n$\n2 \n$\n2,182 \n$\n903 \n$\n1,010 \n$\n9 \n$\n1,904 \nOther common stocks\n3,769 \n820 \n81 \n4,508 \n4,728 \n684 \n122 \n5,290 \nNon-redeemable preferred stocks\n71 \n36 \n19 \n88 \n43 \n36 \n19 \n60 \nTotal equity securities, at fair value\n$\n4,815 \n$\n2,065 \n$\n102 \n$\n6,778 \n$\n5,674 \n$\n1,730 \n$\n150 \n$\n7,254 \nThe net change in unrealized gains (losses) from equity securities still held at period end, recorded within “Other income (loss),” was $314 million and $169 million during the three months ended September 30, 2025 and 2024, respectively, and $355 million and $525 million during the nine months ended September 30, 2025 and 2024, respectively.\n157\nTable of Contents\nOther Invested Assets\n \nThe following table sets forth the composition of “Other invested assets,” as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\n(in millions)\nLPs/LLCs:\nEquity method:\nPrivate equity\n$\n7,885 \n$\n7,535 \nHedge funds\n2,226 \n2,339 \nReal estate-related\n1,593 \n1,586 \nSubtotal equity method\n11,704 \n11,460 \nFair value:\nPrivate equity\n619 \n728 \nHedge funds\n1,197 \n1,308 \nReal estate-related\n433 \n423 \nSubtotal fair value\n2,249 \n2,459 \nTotal LPs/LLCs\n13,953 \n13,919 \nReal estate held through direct ownership(1)\n1,520 \n1,426 \nTotal alternative assets\n15,473 \n15,345 \nCredit-like instruments(2)\n985 \n933 \nDerivative instruments\n76 \n(438)\nOther(3)\n937 \n941 \nTotal other invested assets\n$\n17,471 \n$\n16,781 \nThe following table presents a reconciliation of “Total alternative assets” included in the table above to the “Total alternative assets of operating businesses”:\nSeptember 30, 2025\nDecember 31, 2024\n(in millions)\nTotal alternative assets\n$\n15,473 \n$\n15,345 \nLess: Divested Businesses(4)\n(893)\n(799)\nLess: Interests held by unaffiliated investors(5)\n(1,288)\n(1,209)\nTotal alternative assets of operating businesses\n$\n13,292 \n$\n13,337 \n__________ \n(1)\nAs of September 30, 2025 and December 31, 2024, real estate held through direct ownership had mortgage debt \nof $228 million\n and $185 million, respectively.\n(2)\nIncludes structured debt investments in feeder funds that are consolidated, resulting in the Company reporting the consolidated feeder funds’ proportionate share of the net assets of the master fund within “Other invested assets.”\n(3)\nPrimarily includes equity investments accounted for under the measurement alternative, tax advantaged investments, leveraged leases and member and activity stock held in the Federal Home Loan Bank of New York. For additional information regarding our holdings in the Federal Home Loan Bank of New York, see Note 18 to the Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\n(4)\nAs of September 30, 2025 and December 31, 2024, interests held by Divested Businesses include private equity of $577 million and $520 million, hedge funds of $153 million and $117 million, real estate-related of $159 million and $156 million and real estate held through direct ownership of $4 million and $6 million, respectively.\n(5)\nAs of September 30, 2025 and December 31, 2024, interests held by unaffiliated investors that have been consolidated into the Consolidated Statements of Financial Position include real estate held through direct ownership of $819 million and $741 million, hedge funds of $162 million\n \nand $177 million and real estate-related of $307 million and $291 million, respectively.\n158\nTable of Contents\nInvested Assets of Other Entities and Operations\n“Invested Assets of Other Entities and Operations” presented below includes investments held outside the general account and primarily represents investments associated with our investment management operations and derivative operations. Our derivative operations act on behalf of affiliates primarily to manage interest rate, foreign currency, credit and equity exposures. Assets within our investment management operations that are managed for third parties and those assets classified as “Separate account assets” on our Unaudited Interim Consolidated Statements of Financial Position are not included.\nSeptember 30, 2025\nDecember 31, 2024\n \n(in millions)\nFixed maturities:\nPublic, available-for-sale, at fair value(1)\n$\n223 \n$\n368 \nPrivate, available-for-sale, at fair value\n286 \n5 \nFixed maturities, trading, at fair value(1)\n128 \n83 \nEquity securities, at fair value \n472 \n521 \nCommercial mortgage and other loans, at book value(2)\n1,073 \n469 \nOther invested assets\n3,673 \n2,774 \nShort-term investments\n2 \n13 \nTotal investments\n$\n5,857 \n$\n4,233 \n__________ \n(1)\nAs of September 30, 2025 and December 31, 2024, balances include investments in CLOs with fair value of $132 million and $224 million, respectively.\n(2)\nBook value is generally based on unpaid principal balance, net of any allowance for credit losses, or at fair value when the fair value option has been elected.\nFixed Maturities, Trading \n“Fixed maturities, trading, at fair value” is primarily related to assets associated with consolidated VIEs for which the Company is the investment manager. The assets of the consolidated VIEs are generally offset by liabilities for which the fair value option has been elected. For additional information regarding these consolidated VIEs, see Note 4 to the Unaudited Interim Consolidated Financial Statements.\nCommercial Mortgage and Other Loans\n \nOur investment management operations include our commercial mortgage operations, which provide mortgage origination, investment management and servicing for our general account, institutional clients, the Federal Housing Administration and government-sponsored entities such as Fannie Mae and Freddie Mac.\nThe mortgage loans of our commercial mortgage operations are included in “Commercial mortgage and other loans.” Derivatives and other hedging instruments related to our commercial mortgage operations are primarily included in “Other invested assets.” \nOther Invested Assets\n \n“Other invested assets” primarily includes assets of our derivative operations used to manage interest rate, foreign currency, credit, and equity exposures. \nFurthermore, other invested assets include strategic investments made as part of our investment management operations. We make these strategic investments in real estate, as well as fixed income, public equity and real estate securities, including controlling interests. Certain of these investments are made primarily for purposes of co-investment in our managed funds and structured products. Other strategic investments are made with the intention to sell or syndicate to investors, including our general account, or for placement in funds and structured products that we offer and manage (seed investments). As part of our investment management operations, we also make loans to our managed funds that are secured by equity commitments from investors or assets of the funds. “Other invested assets” also includes certain assets in consolidated investment funds where the Company is deemed to exercise control over the funds.\n159\nTable of Contents\nValuation of Assets and Liabilities\n \nFair Value of Assets and Liabilities\n \nThe authoritative guidance related to fair value measurement establishes a framework that includes a three-level hierarchy used to classify the inputs used in measuring fair value. The level in the hierarchy within which the fair value falls is determined based on the lowest level input that is significant to the measurement. The fair values of assets and liabilities classified as Level 3 include at least one significant unobservable input in the measurement. See Note 6 to the Unaudited Interim Consolidated Financial Statements for an additional description of the valuation hierarchy levels as well as for the balances of assets and liabilities measured at fair value on a recurring basis by hierarchy level presented on a consolidated basis.\nThe table below presents the balances of assets and liabilities measured at fair value on a recurring basis, as of the dates indicated, and the portion of such assets and liabilities that are classified in Level 3 of the valuation hierarchy. The table also provides details about these assets and liabilities excluding those held in the Closed Block division and Funds Withheld portfolios. We believe the amounts excluding the Closed Block division and Funds Withheld are most relevant to an understanding of our operations that are pertinent to investors in Prudential Financial, Inc. because (1) substantially all Closed Block division assets support obligations and liabilities relating to the Closed Block policies where the economics inure to those participating policies and not to shareholders of the Company’s Common Stock and (2) the Funds Withheld assets support liabilities relating to reinsurance agreements where the economic benefits and associated investment risk of the Funds Withheld assets ultimately inure to the reinsurer. See Notes 12 and 13 to the Unaudited Interim Consolidated Financial Statements for additional information regarding our material reinsurance agreements and the Closed Block, respectively. \n \nAs of September 30, 2025\n \nPFI excluding Closed Block Division and Funds Withheld\nClosed Block\nDivision\nFunds Withheld\n \nTotal at\nFair Value\nTotal\nLevel 3(1)\nTotal at\nFair Value\nTotal\nLevel 3(1)\nTotal at\nFair Value\nTotal\nLevel 3(1)\n \n(in millions)\nFixed maturities, available-for-sale\n$\n298,983 \n$\n9,424 \n$\n29,383 \n$\n998 \n$\n7,048 \n$\n628 \nAssets supporting experience-rated contractholder liabilities:\nFixed maturities\n928 \n0 \n0 \n0 \n0 \n0 \nEquity securities\n3,720 \n0 \n0 \n0 \n0 \n0 \nAll other(2)\n0 \n0 \n0 \n0 \n0 \n0 \nSubtotal\n4,648 \n0 \n0 \n0 \n0 \n0 \nMarket risk benefit assets\n2,252 \n2,252 \n0 \n0 \n0 \n0 \nFixed maturities, trading\n5,055 \n841 \n613 \n19 \n8,907 \n1,797 \nEquity securities\n7,250 \n587 \n1,544 \n44 \n0 \n0 \nCommercial mortgage and other loans\n1,073 \n0 \n0 \n0 \n263 \n263 \nOther invested assets(3)\n3,099 \n1,010 \n2 \n2 \n18 \n0 \nShort-term investments\n5,485 \n20 \n178 \n11 \n7 \n0 \nCash equivalents\n9,366 \n0 \n293 \n0 \n289 \n0 \nReinsurance recoverables and deposit receivables\n(51)\n0 \n0 \n0 \n541 \n353 \nSeparate account assets\n170,975 \n239 \n0 \n0 \n0 \n0 \nTotal assets\n$\n508,135 \n$\n14,373 \n$\n32,013 \n$\n1,074 \n$\n17,073 \n$\n3,041 \nMarket risk benefit liabilities\n$\n4,771 \n$\n4,771 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \nPolicyholders’ account balances\n17,956 \n17,956 \n0 \n0 \n0 \n0 \nReinsurance and funds withheld payables\n(18)\n0 \n0 \n0 \n126 \n0 \nOther liabilities(3)\n5,462 \n0 \n0 \n0 \n3 \n0 \nNotes issued by consolidated variable interest entities (“VIEs”)\n313 \n313 \n0 \n0 \n0 \n0 \nTotal liabilities\n$\n28,484 \n$\n23,040 \n$\n0 \n$\n0 \n$\n129 \n$\n0 \n160\nTable of Contents\n \nAs of December 31, 2024\n \nPFI excluding Closed Block Division and Funds Withheld\nClosed Block\nDivision\nFunds Withheld\n \nTotal at\nFair Value\nTotal\nLevel 3(1)\nTotal at\nFair Value\nTotal\nLevel 3(1)\nTotal at\nFair Value\nTotal\nLevel 3(1)\n \n(in millions)\nFixed maturities, available-for-sale\n$\n275,210 \n$\n6,712 \n$\n28,728 \n$\n914 \n$\n7,632 \n$\n551 \nAssets supporting experience-rated contractholder liabilities:\nFixed maturities\n826 \n0 \n0 \n0 \n0 \n0 \nEquity securities\n2,881 \n0 \n0 \n0 \n0 \n0 \nAll other(2)\n0 \n0 \n0 \n0 \n0 \n0 \nSubtotal\n3,707 \n0 \n0 \n0 \n0 \n0 \nMarket risk benefit assets\n2,331 \n2,331 \n0 \n0 \n0 \n0 \nFixed maturities, trading\n4,151 \n467 \n647 \n15 \n7,732 \n1,504 \nEquity securities\n7,776 \n479 \n1,641 \n39 \n0 \n0 \nCommercial mortgage and other loans\n469 \n0 \n0 \n0 \n233 \n233 \nOther invested assets(3)\n2,526 \n952 \n2 \n1 \n25 \n0 \nShort-term investments\n8,091 \n383 \n460 \n76 \n44 \n2 \nCash equivalents\n10,144 \n0 \n346 \n0 \n201 \n0 \nReinsurance recoverables and deposit receivables\n(75)\n0 \n0 \n0 \n924 \n613 \nSeparate account assets\n166,672 \n232 \n0 \n0 \n0 \n0 \nTotal assets\n$\n481,002 \n$\n11,556 \n$\n31,824 \n$\n1,045 \n$\n16,791 \n$\n2,903 \nMarket risk benefit liabilities\n$\n4,455 \n$\n4,455 \n$\n0 \n$\n0 \n$\n0 \n$\n0 \nPolicyholders’ account balances\n12,746 \n12,746 \n0 \n0 \n0 \n0 \nReinsurance and funds withheld payables\n(27)\n0 \n0 \n0 \n(91)\n0 \nOther liabilities(3)\n4,749 \n1 \n0 \n0 \n2 \n0 \nNotes issued by consolidated variable interest entities (“VIEs”)\n60 \n60 \n0 \n0 \n0 \n0 \nTotal liabilities\n$\n21,983 \n$\n17,262 \n$\n0 \n$\n0 \n$\n(89)\n$\n0 \n__________\n(1)\nLevel 3 assets expressed as a percentage of total assets measured at fair value on a recurring basis for PFI excluding the Closed Block division and Funds Withheld, the Closed Block division and Funds Withheld totaled 2.8%, 3.4%, and 17.8%, respectively, as of September 30, 2025, and 2.4%, 3.3%, and 17.3%, respectively, as of December 31, 2024.\n(2)\n“All other” represents cash equivalents and short-term investments.\n(3)\n“Other invested assets” and “Other liabilities” primarily include derivatives. The amounts include the impact of netting subject to master netting agreements.\nThe determination of fair value, which for certain assets and liabilities is dependent on the application of estimates and assumptions, can have a significant impact on our results of operations and may require the application of a greater degree of judgment depending on market conditions, as the ability to value assets and liabilities can be significantly impacted by a decrease in market activity or a lack of transactions executed in an orderly manner. \nFixed maturity securities included in Level 3 in our fair value hierarchy are generally priced based on internally-developed valuations or indicative broker quotes. For certain private fixed maturity and equity securities, the internal valuation models use significant unobservable inputs and, accordingly, such securities are included in Level 3 in our fair value hierarchy. Level 3 fixed maturity securities for PFI excluding the Closed Block division and Funds Withheld included approximately $1,851 million of public fixed maturities as of September 30, 2025, with values primarily based on indicative broker quotes, and approximately $10,837 million of private fixed maturities, with values primarily based on internally-developed models. Significant unobservable inputs used in their valuation included: issue specific spread adjustments, material non-public financial information, management judgment, estimation of future earnings and cash flows, default rate assumptions, liquidity assumptions and indicative quotes from market makers. Separate account assets included in Level 3 in our fair value hierarchy primarily include corporate securities and commercial mortgage loans.\n161\nTable of Contents\nContracts or contract features reported in “Market risk benefit assets” and “Market risk benefit liabilities” and embedded derivatives reported in “Policyholders’ account balances” that are included in Level 3 of our fair value hierarchy represent general account assets and liabilities pertaining to living benefit features of the Company’s variable annuity contracts and the index-linked interest credited features on certain life and annuity products. “Market risk benefit assets” and “Market risk benefit liabilities” are carried at fair value with changes in fair value included in “Change in value of market risk benefits, net of related hedging gains (losses)” except for the portion of the change attributable to changes in the Company’s NPR that is recorded in OCI. Embedded derivatives included in “Policyholders’ account balances” are carried at fair value with changes in fair value included in “Realized investment gains (losses), net.” These assets and liabilities are valued using internally-developed models that require significant estimates and assumptions developed by management. Changes in these estimates and assumptions can have a significant impact on the results of our operations. For additional information, see Note 6 to the Unaudited Interim Consolidated Financial Statements. \n \nFor additional information regarding the valuation techniques and the key estimates and assumptions used in our determination of fair value, see Note 6 to the Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\n \nLiquidity and Capital Resources\n \nOverview\n \nLiquidity refers to the ability to generate sufficient cash resources to meet the payment obligations of the Company. Capital refers to the long-term financial resources available to support the operations of our businesses, fund business growth, and provide a cushion to withstand adverse circumstances. Our ability to generate and maintain sufficient liquidity and capital depends on the profitability of our businesses, general economic conditions and our access to the capital markets and the alternate sources of liquidity and capital described herein. \nEffective and prudent liquidity and capital management is a priority across the Company. Management monitors the liquidity of Prudential Financial and its subsidiaries on a daily basis and projects borrowing and capital needs over a multi-year time horizon. We use a Risk Appetite Framework (“RAF”) to ensure that all risks taken across the Company align with our capacity and willingness to take those risks. The RAF provides a dynamic assessment of capital and liquidity stress impacts and is intended to ensure that sufficient resources are available to absorb those impacts. We believe that our capital and liquidity resources are sufficient to satisfy the capital and liquidity requirements of Prudential Financial and its subsidiaries. \nOur businesses are subject to comprehensive regulation and supervision by domestic and international regulators. These regulations currently include requirements (many of which are the subject of ongoing rule-making) relating to capital and liquidity management. For information regarding these regulatory initiatives and their potential impact on us, see “Business—Regulation” and “Risk Factors” included in our Annual Report on Form 10-K for the year ended December 31, 2024.\nFrom the beginning of 2025 through the date of this report, we took the following significant actions that have impacted, or are expected to impact, our liquidity and capital positions:\n•\nIn March, we issued $750 million of 5.200% senior unsecured notes. We intend to use these proceeds for general corporate purposes, which may include refinancing medium-term notes maturing through 2026.\n•\nIn March, we entered into a reinsurance agreement with Prismic Re International, a wholly-owned subsidiary of Prismic, to reinsure approximately $7 billion of reserves for certain USD-denominated Japanese whole life policies originated by our Japanese insurance subsidiaries. We also made an additional equity investment in Prismic of approximately $100 million to maintain our equity interest at approximately 20 percent. The value of the reinsurance transaction is estimated to be $400 million, which includes a release of capital, ceding commission, taxes, and the net present value of future income, of which a portion was used to fund the equity investment in Prismic, with the remaining amount to be released over time.\n•\nIn May, we redeemed $1.0 billion of 5.375% junior subordinated notes due 2045.\n•\nIn July, we repaid $350 million of 8.300% fixed-rate surplus notes due July 2025.\n162\nTable of Contents\nCapital\n \nThe primary components of the Company’s capitalization consist of equity and outstanding capital debt, including junior subordinated debt. As shown in the table below, as of September 30, 2025, the Company had $49.2 billion in capital, all of which was available to support the aggregate capital requirements of its businesses and its Corporate and Other operations. Based on our assessment of these businesses and operations, we believe this level of capital is consistent with our ratings targets.\n \nSeptember 30, 2025\nDecember 31, 2024\n \n(in millions)\nEquity(1)\n$\n35,269 \n$\n34,583 \nJunior subordinated debt (including hybrid securities)\n7,595 \n7,588 \nOther capital debt\n6,374 \n6,237 \nTotal capital\n$\n49,238 \n$\n48,408 \n__________ \n(1)\nAmounts attributable to Prudential Financial, excluding AOCI.\nWe manage PICA, The Prudential Life Insurance Company, Ltd. (“Prudential of Japan”), The Gibraltar Life Insurance Co., Ltd. (“Gibraltar Life”), and other significant insurance subsidiaries to regulatory capital levels consistent with our “AA” ratings targets. We utilize the risk-based capital (“RBC”) ratio as a primary measure of the capital adequacy of our domestic insurance subsidiaries and the solvency margin ratio as a primary measure of the capital adequacy of our Japanese insurance subsidiaries.\n \nRBC ratio calculations are intended to assist insurance regulators in measuring an insurer’s solvency and ability to pay future claims. The reporting of RBC measures is not intended for the purpose of ranking any insurance company or for use in connection with any marketing, advertising or promotional activities, but is available to the public.\nPICA’s RBC ratio as of December 31, 2024, its most recent statutory fiscal year-end and RBC reporting date, was 409%. PICA’s RBC ratio is calculated on a consolidated basis and included Pruco Life Insurance Company (“Pruco Life”), Pruco Life Insurance Company of New Jersey (“PLNJ”), which is a subsidiary of Pruco Life, and Prudential Legacy Insurance Company of New Jersey (“PLIC”). \nSimilar to the RBC ratios that are employed by U.S. insurance regulators, regulatory authorities in the international jurisdictions in which we operate generally establish some form of minimum solvency margin requirements for insurance companies based on local statutory accounting practices. These solvency margins are a primary measure of the capital adequacy of our international insurance operations. Maintenance of our solvency margins at certain levels is also important to our competitive positioning, as in certain jurisdictions, such as Japan, these solvency margins are required to be disclosed to the public and therefore impact the public perception of an insurer’s financial strength.\nThe table below presents the solvency margin ratios of our most significant international insurance subsidiaries as of June 30, 2025, the most recent date for which this information is available.\nRatio\nPrudential of Japan consolidated(1)\n781 \n%\nGibraltar Life consolidated(2)\n968 \n%\n__________ \n(1)\nIncludes Prudential Trust Co., Ltd., a subsidiary of Prudential of Japan.\n(2)\nIncludes Prudential Gibraltar Financial Life Insurance Co., Ltd. (“PGFL”), a subsidiary of Gibraltar Life.\nAll of our domestic and significant international insurance subsidiaries have capital levels that substantially exceed the minimum level required by applicable insurance regulations. The statutory capital of our insurance companies and our overall capital flexibility could be impacted by, among other things, market conditions and changes in insurance reserves, including those stemming from updates to our actuarial assumptions. Our regulatory capital levels also may be affected in the future by changes to the applicable regulations, proposals for which are currently under consideration by both domestic and international insurance regulators. The FSA has developed a new market-based alternative to the solvency margin ratio framework called the Economic Solvency Ratio (“ESR”) that will apply to our Japanese insurance subsidiaries. The ESR framework became effective April 1, 2025, with disclosure under the new framework required beginning in 2026. For additional information \n163\nTable of Contents\nregarding the calculation of RBC and solvency margin ratios, as well as regulatory minimums, see Note 20 to the Consolidated Financial Statements included in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024.\nCaptive Reinsurance Companies\n \nSee “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources—Capital—Captive Reinsurance Companies” included in our Annual Report on Form 10-K for the year ended December 31, 2024, for a discussion of our use of captive reinsurance companies.\n \n    \nShareholder Distributions\n \nShare Repurchase Program and Shareholder Dividends\nIn December 2024, Prudential Financial’s Board of Directors authorized the Company to repurchase, at management’s discretion, up to $1.0 billion of its outstanding Common Stock during the period from January 1, 2025 through December 31, 2025. In general, the timing and amount of share repurchases are determined by management based on market conditions and other considerations, including compliance with applicable laws and any increased capital needs of our businesses due to, among other things, credit migration and losses in our investment portfolio, changes in regulatory capital requirements and opportunities for growth and acquisitions. Repurchases may be executed in the open market, through derivative, accelerated repurchase and other negotiated transactions and through plans designed to comply with Rule 10b5-1(c) under the Securities Exchange Act of 1934, as amended. \nThe following table sets forth information about declarations of Common Stock dividends, as well as repurchases of shares of Prudential Financial’s Common Stock, for the nine months ended September 30, 2025:\n \n \nDividend Amount\nShares Repurchased\nThree months ended:\nPer Share\nAggregate\nShares\nTotal Cost\n \n(in millions, except per share data)\nMarch 31, 2025\n$\n1.35 \n$\n486 \n2.2 \n$\n250 \nJune 30, 2025\n$\n1.35 \n$\n485 \n2.4 \n$\n250 \nSeptember 30, 2025\n$\n1.35 \n$\n481 \n2.4 \n$\n250 \nLiquidity\n \nLiquidity management and stress testing are performed on a legal entity basis as the ability to transfer funds between subsidiaries is limited due in part to regulatory restrictions. Liquidity needs are determined through daily and quarterly cash flow forecasting at the holding company and within our operating subsidiaries. We seek to maintain a minimum balance of highly liquid assets to ensure that adequate liquidity is available at Prudential Financial to cover fixed expenses in the event that we experience reduced cash flows from our operating subsidiaries at a time when access to capital markets is also not available.\n \nWe seek to mitigate the risk of having limited or no access to financing due to stressed market conditions by generally pre-funding debt in advance of maturity. We mitigate the refinancing risk associated with our debt that is used to fund operating needs by matching the term of debt with the assets financed. To ensure adequate liquidity in stress scenarios, stress testing is performed for our major operating subsidiaries. We seek to further mitigate liquidity risk by maintaining our access to alternative sources of liquidity, as discussed below. \nLiquidity of Prudential Financial\n \nThe principal sources of funds available to Prudential Financial, the parent holding company, are dividends, returns of capital and loans from subsidiaries, and proceeds from debt issuances and certain stock-based compensation activity. These sources of funds may be supplemented by Prudential Financial’s access to the capital markets as well as the “—Alternative Sources of Liquidity” described below.\n \nThe primary uses of funds at Prudential Financial include servicing debt, making capital contributions and loans to subsidiaries, making acquisitions, paying declared shareholder dividends and repurchasing outstanding shares of Common Stock executed under authority from the Board.\n \n164\nTable of Contents\nAs of September 30, 2025, Prudential Financial had highly liquid assets with a carrying value totaling $4,772 million, a decrease of $1,492 million from December 31, 2024. Highly liquid assets predominantly include cash, short-term investments, U.S. Treasury securities, obligations of other U.S. government authorities and agencies, and/or foreign government bonds. We maintain an intercompany liquidity account that is designed to optimize the use of cash by facilitating the lending and borrowing of funds between Prudential Financial and its subsidiaries on a daily basis. Excluding the net borrowings from this intercompany liquidity account, Prudential Financial had highly liquid assets of $3,867 million as of September 30, 2025, a decrease of $774 million from December 31, 2024.\n \nThe following table sets forth Prudential Financial’s principal sources and uses of highly liquid assets, excluding net borrowings from our intercompany liquidity account, for the periods indicated:\n \nNine Months Ended September 30,\n \n2025\n2024\n(in millions)\nHighly Liquid Assets, beginning of period\n$\n4,641 \n$\n4,095 \nDividends and/or returns of capital from subsidiaries(1)\n1,532 \n2,072 \nAffiliated (borrowings)/loans - (capital activities)(2)\n0 \n702 \nCapital contributions to subsidiaries(3)\n(67)\n(162)\nTotal Business Capital Activity(4)\n1,465 \n2,612 \nShare repurchases(5)\n(746)\n(746)\nCommon Stock dividends(6)\n(1,451)\n(1,424)\nTotal Share Repurchases, Dividends and Business Disposition Activity\n(2,197)\n(2,170)\nProceeds from the issuance of debt(7)\n984 \n1,044 \nRepayments of debt\n(1,008)\n(511)\nTotal Debt Activity\n(24)\n533 \nNet interest expense\n(944)\n(805)\nAffiliated (borrowings)/loans - (operating activities)(8)\n543 \n(572)\nTax cash flows(4)\n(28)\n197 \nOther corporate cash flows(4)\n227 \n193 \nShare issuances for employee stock purchases and other(4)\n184 \n265 \nTotal Other Activity\n(18)\n(722)\nNet increase/(decrease) in highly liquid assets\n(774)\n253 \nHighly Liquid Assets, end of period\n$\n3,867 \n$\n4,348 \n__________\n \n(1)\n2025 includes $575 million from international insurance subsidiaries, $500 million from Individual Life insurance captives, $300 million from PICA, $147 million from PGIM subsidiaries, and $10 million from other subsidiaries. 2024 includes $800 million from a holding company, funded by one of our captive insurance subsidiaries, inclusive of proceeds associated with the reinsurance of a portion of the Company’s guaranteed universal life policies, $650 million from PICA, $568 million from international subsidiaries, $46 million from PGIM subsidiaries and $8 million from other subsidiaries.\n(2)\nRepresents loans to and from subsidiaries made for capital management purposes. 2024 includes $502 million from international insurance subsidiaries and $200 million from captive reinsurance subsidiaries. \n(3)\n2025 includes capital contributions of $61 million to other subsidiaries and $6 million to PICA. 2024 includes capital contributions of $74 million to PGIM subsidiaries (which is completely offset in “Affiliated (borrowings)/loans - (operating activities)” within this table), $49 million to other subsidiaries and $39 million to international insurance subsidiaries.\n(4)\n“Total Business Capital Activity” for 2025 includes segment inflows of $1,552 million from U.S. Businesses, $1,020 million from International Businesses, $353 million from PGIM, and outflows of $1,460 million to Corporate and Other operations. 2024 includes segment inflows of $2,954 million from U.S. Businesses, $1,417 million from International Businesses, $332 million from PGIM, and outflows of $2,091 million to Corporate and Other operations. In addition, Corporate and Other operations had net inflows of $383 million and $655 million for 2025 and 2024, respectively, from “Tax cash flows,” “Other corporate cash flows” and “Share issuances for employee stock purchases and other,” as shown within this table. In addition, $347 million of PICA's dividend capacity was used to fund the July 2025 maturity of the PICA surplus note.\n(5)\nExcludes cash payments made on trades that settled in the subsequent period.\n(6)\nIncludes cash payments made on dividends declared in prior periods.\n(7)\nIncludes $243 million and $55 million of proceeds from the issuance of retail medium-term notes that were used exclusively to purchase funding agreements from PICA in 2025 and 2024, respectively. \n(8)\nRepresents loans to and from subsidiaries to support business operating needs.\n165\nTable of Contents\nDividends and Returns of Capital from Subsidiaries\n \nDomestic insurance subsidiaries.\n During the first nine months of 2025, Prudential Financial received dividends of $300 million from PICA. In addition to paying Common Stock dividends, our domestic insurance operations may return capital to Prudential Financial by other means, such as affiliated lending, and reinsurance with Bermuda-based affiliates. In the first quarter of 2025, Prudential Financial received a return of capital of $500 million from a holding company funded by a domestic captive insurance subsidiary.\nInternational insurance subsidiaries\n. During the first nine months of 2025, Prudential Financial received dividends of $575 million from its international insurance subsidiaries. In addition to paying Common Stock dividends, our international insurance operations may return capital to Prudential Financial by other means, such as the repayment of preferred stock obligations held by Prudential Financial or other affiliates, affiliated lending, affiliated derivatives and reinsurance with U.S.- and Bermuda-based affiliates.\nOther subsidiaries.\n During the first nine months of 2025, Prudential Financial received dividends of $147 million from PGIM subsidiaries and $10 million from other subsidiaries.\nRestriction on dividends and returns of capital from subsidiaries. \nOur insurance companies are subject to limitations on the payment of dividends and other transfers of funds to Prudential Financial and other affiliates under applicable insurance law and regulation. Further, market conditions could negatively impact capital positions of our insurance companies, which could further restrict their ability to pay dividends. More generally, the payment of dividends by any of our subsidiaries is subject to declaration by their Board of Directors and can be affected by market conditions and other factors. \n \nWith respect to our domestic insurance subsidiaries, PICA is permitted to pay ordinary dividends based on calculations specified under New Jersey insurance law, subject to prior notification to the New Jersey Department of Banking and Insurance (“NJDOBI”). Any distributions above this amount in any twelve-month period are considered to be “extraordinary” dividends, and the approval of the NJDOBI is required prior to payment. The laws regulating dividends of the states where our other domestic insurance companies are domiciled are similar, but not identical, to those of New Jersey.\nCapital redeployment from our international insurance subsidiaries is subject to local regulatory requirements in the international jurisdictions in which they operate. Our most significant international insurance subsidiaries, Prudential of Japan and Gibraltar Life, are permitted to pay Common Stock dividends based on calculations specified by Japanese insurance business law. Dividends in excess of these amounts and other forms of capital distribution may require the prior approval of the FSA. The regulatory fiscal year end for both Prudential of Japan and Gibraltar Life is March 31, after which time the Common Stock dividend amount permitted to be paid without prior approval from the FSA can be determined.\nThe ability of our PGIM subsidiaries and the majority of our other operating subsidiaries to pay dividends is largely unrestricted from a regulatory standpoint.\nSee Note 20 to the Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2024, for information regarding specific dividend restrictions.\n    \nLiquidity of Insurance Subsidiaries\n \nWe manage the liquidity of our insurance operations to ensure stable, reliable and cost-effective sources of cash flows to meet all of our obligations. Liquidity within each of our insurance subsidiaries is provided by a variety of sources, including portfolios of liquid assets. The investment portfolios of our subsidiaries are integral to the overall liquidity of our insurance operations. We segment our investment portfolios and employ an asset/liability management approach specific to the requirements of each of our product lines. This enhances the discipline applied in managing the liquidity, as well as the interest rate and credit risk profiles, of each portfolio in a manner consistent with the unique characteristics of the product liabilities.\nLiquidity is measured against internally-developed benchmarks that take into account the characteristics of both the asset portfolio and the liabilities that they support. We consider attributes of the various categories of liquid assets (for example, type of asset and credit quality) in calculating internal liquidity measures to evaluate our insurance operations’ liquidity under various stress scenarios, including company-specific and market-wide events. We continue to believe that cash generated by ongoing operations and the profile of our assets provide sufficient liquidity under reasonably foreseeable stress scenarios for each of our insurance subsidiaries.\n \n166\nTable of Contents\nThe principal sources of liquidity for our insurance subsidiaries are premiums, investment and fee income, investment maturities, sales of investments, and sales associated with our insurance and annuity operations, as well as internal and external borrowings. The principal uses of liquidity include benefits, claims and dividends paid to policyholders, and payments to policyholders and contractholders in connection with surrenders, withdrawals and net policy loan activity. Other uses of liquidity may include commissions, general and administrative expenses, purchases of investments, the payment of dividends to the parent holding company, hedging and reinsurance activity and payments in connection with financing activities.\n \nThe following table sets forth the fair value of certain of our domestic insurance operations’ portfolio of liquid assets, as of the dates indicated: \n \n \nSeptember 30, 2025\n \n \nPrudential\nInsurance(1)\nPLIC\nPruco Life\nTotal\nDecember 31, 2024\n \n(in billions)\nCash and short-term investments\n$\n7.3 \n$\n0.7 \n$\n2.5 \n$\n10.5 \n$\n12.5 \nFixed maturity investments(2):\nHigh or highest quality\n127.5 \n26.8 \n47.5 \n201.8 \n180.3 \nOther than high or highest quality\n8.0 \n2.3 \n3.0 \n13.3 \n12.1 \nSubtotal\n135.5 \n29.1 \n50.5 \n215.1 \n192.4 \nPublic equity securities, at fair value\n1.0 \n1.5 \n1.4 \n3.9 \n5.4 \nTotal\n$\n143.8 \n$\n31.3 \n$\n54.4 \n$\n229.5 \n$\n210.3 \n__________ \n(1)\nRepresents legal entity view and as such includes both domestic and international activity.\n(2)\nCredit quality is based on NAIC or equivalent rating.\n \nThe following table sets forth the fair value of our international insurance operations’ portfolio of liquid assets, as of the dates indicated:\n \n \nSeptember 30, 2025\n \n \nPrudential\nof Japan\nGibraltar\nLife(1)\nAll\nOther(2)\nTotal\nDecember 31, 2024\n \n(in billions)\nCash and short-term investments\n$\n0.7 \n$\n4.8 \n$\n3.1 \n$\n8.6 \n$\n7.4 \nFixed maturity investments(3):\nHigh or highest quality(4)\n26.6 \n49.9 \n26.2 \n102.7 \n102.6 \nOther than high or highest quality\n0.4 \n0.4 \n3.8 \n4.6 \n3.6 \nSubtotal\n27.0 \n50.3 \n30.0 \n107.3 \n106.2 \nPublic equity securities\n3.9 \n0.9 \n0.4 \n5.2 \n4.2 \nTotal\n$\n31.6 \n$\n56.0 \n$\n33.5 \n$\n121.1 \n$\n117.8 \n__________ \n(1)\nIncludes PGFL.\n(2)\nRepresents our international insurance operations, excluding Japan.\n(3)\nCredit quality is based on NAIC or equivalent rating. \n(4)\nAs of September 30, 2025, $60.8 billion, or 59%, were invested in government or government agency bonds.\nLiquidity associated with other activities\n \nHedging activities associated with Individual Retirement Strategies\n \nFor the portion of our \nIndividual Retirement Strategies\n’ ALM strategy executed through hedging, we enter into a range of exchange-traded, cleared and other OTC equity and interest rate derivatives in order to hedge certain capital market risks related to more severe market conditions. For a full discussion of our \nIndividual Retirement Strategies\n’ risk management strategy, see “—Results of Operations by Segment—\nRetirement Strategies\n.” This portion of our \nIndividual Retirement Strategies\n’ ALM strategy requires access to liquidity to meet payment obligations relating to these derivatives, such as payments for periodic \n167\nTable of Contents\nsettlements, purchases, maturities and terminations. These liquidity needs can vary materially due to, among other items, changes in interest rates, equity markets, mortality and policyholder behavior. \n \nThe hedging portion of our \nIndividual Retirement Strategies\n’ ALM strategy may also result in derivative related collateral postings to (when we are in a net post position) or from (when we are in a net receive position) counterparties. The net collateral position depends on changes in interest rates and equity markets related to the amount of the exposures hedged. Depending on market conditions, the collateral posting requirements can result in material liquidity needs when we are in a net post position. \nForeign exchange hedging activities\n \nWe employ various hedging strategies to manage potential exposure to foreign currency exchange rate movements, particularly those associated with the yen. Our overall yen hedging strategy calibrates the hedge level to preserve the relative contribution of our yen-based business to the Company’s overall return on equity on a leverage neutral basis.\nWe hold both internal and external hedges primarily to hedge our USD-equivalent equity. These hedges also mitigate volatility in the solvency margins of yen-based subsidiaries resulting from changes in the market value of their USD-denominated investments hedging our USD-equivalent equity attributable to changes in the yen-USD exchange rate.\nFor additional information regarding our hedging strategy, see “—Results of Operations—Impact of Foreign Currency Exchange Rates.”\nCash settlements from these hedging activities result in cash flows between subsidiaries of Prudential Financial and either international-based subsidiaries or external parties. The cash flows are dependent on changes in foreign currency exchange rates and the notional amount of the exposures hedged. For example, a significant yen depreciation over an extended period of time could result in net cash inflows, while a significant yen appreciation could result in net cash outflows. The following tables set forth information about net cash settlements and the net asset or liability resulting from these hedging activities related to the yen and other currencies for the periods indicated:\nNine Months Ended\nSeptember 30,\nCash Settlements Received (Paid):\n2025\n2024\n(in millions)\nInternal Hedges(1)\n$\n218 \n$\n395 \nExternal Hedges(2)\n207 \n(23)\nTotal Cash Settlements\n$\n425 \n$\n372 \nAssets (Liabilities):\nSeptember 30, 2025\nDecember 31, 2024\n(in millions)\nInternal Hedges(1)\n$\n747 \n$\n968 \nExternal Hedges(3)\n54 \n341 \nTotal Assets (Liabilities)(4)\n$\n801 \n$\n1,309 \n__________\n(1)\nRepresents internal transactions between international-based and U.S.-based entities. Amounts noted are from the U.S.-based entities’ perspectives.\n(2)\nIncludes non-yen related cash settlements received (paid) of ($4) million, primarily denominated in Brazilian real, Australian dollar and Chilean peso, and ($13) million, primarily denominated in Brazilian real, Chilean peso and Australian dollar for the nine months ended September 30, 2025 and 2024, respectively.\n(3)\nIncludes non-yen related assets (liabilities) of ($48) million, primarily denominated in Brazilian real, Chilean peso and Australian dollar as of September 30, 2025 and $91 million, primarily denominated in Brazilian real, Chilean peso and Australian dollar, as of December 31, 2024.\n(4)\nAs of September 30, 2025, approximately $176 million, $138 million, $152 million and $335 million of the net market values are scheduled to settle in 2025, 2026, 2027, and thereafter, respectively. The net market value of the assets (liabilities) will vary with changing market conditions to the extent there are no corresponding offsetting positions.\nPGIM operations\n \nThe principal sources of liquidity for our fee-based PGIM businesses include cash flows from asset management, commercial mortgage origination and servicing activities, and internal and external funding facilities. The principal uses of liquidity for our fee-based PGIM businesses include general and administrative expenses, facilitating our commercial mortgage loan business, funding needs of our seed and co-investment portfolio and distributions of dividends and returns of capital to \n168\nTable of Contents\nPrudential Financial. The primary liquidity risks for our fee-based PGIM businesses relate to their profitability, which is impacted by market conditions, our investment management performance and client redemptions. We believe the cash flows from our fee-based PGIM businesses are adequate to satisfy the current liquidity requirements of these operations, as well as requirements that could arise under reasonably foreseeable stress scenarios, which are monitored through the use of internal measures.\n \nThe principal sources of liquidity for our seed and co-investments held in our PGIM businesses are cash flows from investments, cash flows from our fee-based businesses, as described above, borrowing lines from internal sources, including Prudential Financial and Prudential Funding, LLC (“Prudential Funding”), a wholly-owned subsidiary of PICA, and external sources, including PGIM’s limited-recourse credit facility. The principal uses of liquidity for our seed and co-investments include making investments to support business growth and paying interest expense from the internal and external borrowings used to fund those investments. The primary liquidity risks include the inability to sell assets in a timely manner, declines in the value of assets and credit defaults. \nThere have been no material changes to the liquidity position of our PGIM operations since December 31, 2024.\n \nAlternative Sources of Liquidity\n \nIn addition to asset-based financing as discussed below, Prudential Financial and certain subsidiaries have access to other sources of liquidity, including syndicated, unsecured committed credit facilities, membership in the Federal Home Loan Bank of New York, a funding agreement facility with Farmer Mac, commercial paper programs and contingent financing facilities in the form of facility agreements. For additional information regarding these sources of liquidity, see Note 15 to the Unaudited Interim Consolidated Financial Statements contained herein and Note 18 to the Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2024. \n \nAsset-based Financing\n \nWe conduct asset-based or secured financing within our insurance and other subsidiaries, including transactions such as securities lending, committed and uncommitted repurchase agreements and mortgage dollar rolls, to earn spread income, to borrow funds, or to facilitate trading activity. These programs are primarily driven by portfolio holdings of securities that are lendable based on counterparty demand for these securities in the marketplace. The collateral received in connection with these programs is primarily used to purchase securities in the short-term spread portfolios of our insurance entities. Investments held in the short-term spread portfolios include cash and cash equivalents, short-term investments (primarily corporate bonds), mortgage loans and fixed maturities (primarily collateralized loan obligations and other structured securities), with a weighted average life at time of purchase by the short-term portfolios of four years or less. Floating rate assets comprise the majority of our short-term spread portfolio. These short-term portfolios are subject to specific investment policy statements, which among other things, do not allow for significant asset/liability interest rate duration mismatch.\n \nThe following table sets forth our liabilities under asset-based or secured financing programs as of the dates indicated:\n \nSeptember 30, 2025\nDecember 31, 2024\nPFI\nExcluding\nClosed Block\nDivision\nClosed\nBlock\nDivision\nConsolidated\nPFI\nExcluding\nClosed Block\nDivision\nClosed\nBlock\nDivision\nConsolidated\n \n($ in millions)\nSecurities sold under agreements to repurchase\n$\n7,124 \n$\n2,813 \n$\n9,937 \n$\n4,779 \n$\n2,017 \n$\n6,796 \nCash collateral for loaned securities\n8,228 \n369 \n8,597 \n8,315 \n1,306 \n9,621 \nSecurities sold but not yet purchased\n0 \n0 \n0 \n0 \n0 \n0 \nTotal(1)(2)\n$\n15,352 \n$\n3,182 \n$\n18,534 \n$\n13,094 \n$\n3,323 \n$\n16,417 \nPortion of above securities that may be returned to the Company overnight requiring immediate return of the cash collateral\n$\n13,204 \n$\n2,630 \n$\n15,834 \n$\n12,325 \n$\n3,220 \n$\n15,545 \nWeighted average maturity, in days(3)\n8 \n1 \n5 \n4 \n__________ \n(1)\nThe daily average outstanding balance for the three and three and nine months ended September 30, 2025 was $15,146 million and $14,481 million, respectively, for PFI excluding the Closed Block division, and $3,302 million and $3,399 million, respectively, for the Closed Block division.\n(2)\nIncludes utilization of external funding facilities for PGIM’s commercial mortgage origination business.\n(3)\nExcludes securities that may be returned to the Company overnight.\n169\nTable of Contents\nAs of September 30, 2025, our domestic insurance entities had assets eligible for the asset-based or secured financing programs of $100.8 billion, of which $17.8 billion were on loan. Taking into account market conditions and outstanding loan balances as of September 30, 2025, we believe approximately $14.0 billion of the remaining eligible assets are readily lendable, including approximately $11.6 billion relating to PFI excluding the Closed Block division, of which $4.0 billion relates to certain separate accounts and may only be used for financing activities related to those accounts, and the remaining $2.3 billion relating to the Closed Block division.\nFinancing Activities\n \nAs of September 30, 2025, total short-term and long-term debt of the Company on a consolidated basis was $20.2 billion, an increase of $43 million from December 31, 2024. The following table sets forth total consolidated borrowings of the Company as of the dates indicated. We may, from time to time, seek to redeem or repurchase our outstanding debt securities through open market purchases, individually negotiated transactions or otherwise. Any such actions will depend on prevailing market conditions, our liquidity position, and other factors.\n \n \nSeptember 30, 2025\nDecember 31, 2024\nBorrowings:\nPrudential\nFinancial\nSubsidiaries\nConsolidated\nPrudential\nFinancial\nSubsidiaries\nConsolidated\n \n(in millions)\nGeneral obligation short-term debt:\nCommercial paper\n$\n25 \n$\n849 \n$\n874 \n$\n25 \n$\n496 \n$\n521 \nCurrent portion of long-term debt\n512 \n0 \n512 \n0 \n347 \n347 \nSubtotal\n537 \n849 \n1,386 \n25 \n843 \n868 \nGeneral obligation long-term debt:\nSenior debt\n10,719 \n0 \n10,719 \n10,245 \n0 \n10,245 \nJunior subordinated debt\n7,553 \n42 \n7,595 \n8,548 \n39 \n8,587 \nSurplus notes(1)\n0 \n0 \n0 \n0 \n0 \n0 \nSubtotal\n18,272 \n42 \n18,314 \n18,793 \n39 \n18,832 \nTotal general obligations\n18,809 \n891 \n19,700 \n18,818 \n882 \n19,700 \nLimited and non-recourse borrowings(2):\nShort-term debt\n0 \n0 \n0 \n0 \n0 \n0 \nCurrent portion of long-term debt\n0 \n0 \n0 \n0 \n85 \n85 \nLong-term debt\n0 \n483 \n483 \n0 \n355 \n355 \nTotal limited and non-recourse borrowings\n0 \n483 \n483 \n0 \n440 \n440 \nTotal borrowings\n$\n18,809 \n$\n1,374 \n$\n20,183 \n$\n18,818 \n$\n1,322 \n$\n20,140 \n__________ \n(1)\nAmounts are net of assets under set-off arrangements of $15,412 million and $14,748 million as of September 30, 2025 and December 31, 2024, respectively. Amounts include credit-linked note structures used to finance Guideline AXXX reserves for business reinsured to Somerset Re in March 2024.\n(2)\nLimited and non-recourse borrowing primarily represents mortgage debt of our subsidiaries that has recourse only to real estate investment property of $228 million and $185 million as of September 30, 2025 and December 31, 2024, respectively, and a draw on a credit facility that has recourse only to collateral pledged by the Company of $255 million as of both September 30, 2025 and December 31, 2024.\nAs of September 30, 2025, and December 31, 2024, the Company was in compliance with all debt covenants related to the borrowings in the table above. For additional information regarding the Company’s short- and long-term debt obligations, see Note 15 to the Unaudited Interim Consolidated Financial Statements contained herein and Note 18 to the Consolidated Financial Statements included in our Annual Report on Form 10-K for the year ended December 31, 2024. \nPrudential Financial’s consolidated borrowings increased $43 million from December 31, 2024. In March 2025, the Company issued $750 million in aggregate principal amount of 5.200% medium-term notes due in March 2035. In May 2025, the company redeemed, in full, $1.0 billion in aggregate principal amount of 5.375% junior subordinated notes due in 2045.\n170\nTable of Contents\nTerm and Universal Life Reserve Financing\nWe use captive reinsurance subsidiaries to finance the portion of the statutory reserves required to be held by our domestic life insurance companies under Regulation XXX and Guideline AXXX that we consider to be non-economic. The financing arrangements involve the reinsurance of term and universal life business to our captive reinsurers and the issuance of surplus notes by those captives that are treated as capital for statutory purposes. These surplus notes are subordinated to policyholder obligations, and the payment of principal and interest on the surplus notes can only be made with prior insurance regulatory approval.\n \nWe have entered into agreements with external counterparties providing for the issuance of surplus notes by our captive reinsurers in return for the receipt of credit-linked notes (“Credit-Linked Note Structures”). As of both September 30, 2025 and December 31,2024, we had Credit-Linked Note Structures with an aggregate issuance capacity of $8,000 million to support Regulation XXX reserves, of which $7,560 million was outstanding and matures in 2044. These amounts exclude credit-linked note structures used to finance Guideline AXXX reserves for business reinsured to Somerset Re in March 2024. Under the agreements, the captive receives in exchange for the surplus notes one or more credit-linked notes issued by a special-purpose affiliate of the Company with an aggregate principal amount equal to the surplus notes outstanding. The captive holds the credit-linked notes as assets supporting Regulation XXX or Guideline AXXX non-economic reserves, as applicable. For additional information regarding our Credit-Linked Note Structures, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources—Financing Activities” in our Annual Report on Form 10-K for the year ended December 31, 2024.\n \nAs of September 30, 2025, we also had outstanding an aggregate of $200 million of debt issued for the purpose of financing Regulation XXX non-economic reserves. In addition, as of September 30, 2025, for purposes of financing Guideline AXXX non-economic reserves, one captive had $3,982 million of surplus notes outstanding that were issued to affiliates. \nThe Company introduced updated versions of its individual life products in conjunction with the requirement to adopt principle-based reserving by January 1, 2020. These updated products are currently priced to support the principle-based statutory reserve level without the need for reserve financing. \nOff-Balance Sheet Arrangements\n \nSee additional information regarding off-balance sheet arrangements in Note 15 and other commitments in Note 21 to the Unaudited Interim Consolidated Financial Statements.\nWe do not have retained or contingent interests in assets transferred to unconsolidated entities, or variable interests in unconsolidated entities or other similar transactions, arrangements or relationships that serve as credit, liquidity or market risk support, that we believe are reasonably likely to have a material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or our access to or requirements for capital resources. In addition, we do not have relationships with any unconsolidated entities that are contractually limited to narrow activities that facilitate our transfer of or access to associated assets.\n \nRatings\nSee “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Ratings” in our Annual Report on Form 10-K for the year ended December 31, 2024, for a discussion of our financial strength and credit ratings and their impact on our business. \nThere have been no significant changes or actions in ratings or ratings outlooks for the Company that have occurred since the filing of our Form 10-K for the year ended December 31, 2024.\n    \n171\nTable of Contents"
}