{
  "item1": "December 18, 2001, Prudential Insurance Company America (“PICA”) converted mutual life insurance company owned its policyholders stock life insurance company became wholly-owned subsidiary Prudential Financial. demutualization carried out under PICA’s Plan Reorganization, which required us establish operate regulatory mechanism known “Closed Block.” Closed Block includes certain in-force participating insurance annuity products corresponding assets used payment benefits policyholders’ dividends these products, well certain related assets liabilities. principal operations consist PGIM (our global investment management business), U.S. Businesses (consisting Retirement Strategies, Group Insurance Individual Life businesses), International Businesses, Closed Block division Corporate Other operations.",
  "item7": "former insurance operations Argentina, Prudential Argentina (“POA”), historically utilized Argentine peso its functional currency given currency primary economic environment which entity operated. During 2018, Argentina experienced cumulative inflation rate exceeded 100% over 3-year period. result, Argentina’s economy deemed highly inflationary, resulting reporting changes effective July 1, 2018. Under U.S.",
  "item2": "analyze performance segments Corporate Other operations using measure segment profitability called adjusted operating income. See “—Segment Measures” below discussion adjusted operating income its use measure segment operating performance. Annual Reviews Update Assumptions Other Refinements During second quarter each year, perform annual comprehensive review assumptions used estimating future premiums, benefits, other cash flows, including reviews related mortality, morbidity, lapse, surrender, other contractholder behavior assumptions, economic assumptions, including expected future rates returns investments. Company generally looks relevant Company experience primary basis these assumptions; however, if relevant Company experience not available does not sufficient credibility, Company may look experience similar blocks business, either elsewhere within Company within industry."
}