{
  "source_file": "psx-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nUnless otherwise indicated, the “company,” “we,” “our,” “us” and “Phillips 66” are used in this report to refer to the businesses of Phillips 66 and its consolidated subsidiaries.\nManagement’s Discussion and Analysis is the company’s analysis of its financial performance, financial condition and significant trends that may affect future performance.  It should be read in conjunction with the consolidated financial statements and notes included elsewhere in this report.  It contains forward-looking statements including, without limitation, statements relating to the company’s plans, strategies, objectives, expectations and intentions that are made pursuant to the “safe harbor” provisions of the Private Securities Litigation Reform Act of 1995.  The words “anticipate,” “estimate,” “believe,” “budget,” “continue,” “could,” “intend,” “may,” “plan,” “potential,” “predict,” “seek,” “should,” “will,” “would,” “expect,” “objective,” “projection,” “forecast,” “goal,” “guidance,” “outlook,” “effort,” “target,” “priorities” and similar expressions often identify forward-looking statements, but the absence of these words does not mean a statement is not forward-looking.  The forward-looking statements made in this Quarterly Report on Form 10-Q are based on events or circumstances as of the date on which the statements are made.  The company does not undertake to update, revise or correct any of the forward-looking information included in this Quarterly Report on Form 10-Q to reflect events or circumstances after the date of this Quarterly Report on Form 10-Q or to reflect new information or the occurrence of unanticipated events unless required to do so pursuant to applicable law.  Readers are cautioned that such forward-looking statements should be read in conjunction with the company’s disclosures under the heading: “CAUTIONARY STATEMENT FOR THE PURPOSES OF THE ‘SAFE HARBOR’ PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995.” \nThe term “earnings” as used in Management’s Discussion and Analysis refers to net income attributable to Phillips 66.  The terms “results,” “before-tax income” or “before-tax loss” as used in Management’s Discussion and Analysis refer to income (loss) before income taxes. \nEXECUTIVE OVERVIEW AND BUSINESS ENVIRONMENT \nPhillips 66 is uniquely positioned as a leading integrated downstream energy provider operating with Midstream, Chemicals, Refining, Marketing and Specialties (M&S) and Renewable Fuels segments.  At September 30, 2025, we had total assets of $76.1 billion.\n \nOur common stock trades on the New York Stock Exchange under the symbol PSX.\nExecutive Overview\nIn the third quarter of 2025, we reported earnings of $133 million and cash provided by operating activities of $1.2 billion.  During the quarter, we received $838 million from net debt borrowings, funded capital expenditures and investments of $541 million, paid $484 million of dividends to our common stockholders and repurchased $267 million of common stock.  We ended the third quarter of 2025 with $2 billion of cash and cash equivalents including cash classified within assets held for sale, and $5.2 billion of total committed capacity available under our credit facilities.   \nStrategic Priorities Update\nIn January 2025, we announced the next phase of priorities along with financial and operational initiatives through year-end 2027.  With these targets, the company is continuing to focus on creating shareholder value; driving disciplined growth and returns; and maintaining financial strength and flexibility.  We are focused on operational and cost reduction targets intended to drive world-class operations across our portfolio, while maintaining emphasis on growing our Midstream and Chemicals businesses. \n41\nTable of Contents\n•\nShareholder Returns\n – We believe shareholder value is enhanced through, among other things, a secure, competitive and growing dividend, complemented by share repurchases.  Our financial target aims to return greater than 50% of net cash provided by operating activities to shareholders through share repurchases and dividends.  The amount and timing of future dividend payments and the level and timing of future share repurchases is subject to the discretion of, and approval by, our Board of Directors and will depend on various factors including our share price, results of operations, financial condition and cash required for future business plans.  \n•\nIn April, July, and October 2025, our Board of Directors declared quarterly cash dividends of $1.20 per common share, reflecting our commitment to a secure, competitive and growing dividend.\n•\nWorld-Class Operations\n – We are focused on achieving operational excellence by optimizing utilization rates and product yield at our refineries through reliable and safe operations, which will enable us to capture the value available in the market in terms of prices and margins.  With our new targets, we remain focused on a competitive cost structure and plan to enhance Refining segment returns and increase our utilization rates by focusing on low-capital, higher-return projects that increase asset reliability and improve market capture.  \n•\nWe continue to focus on Refining performance, targeting an annual clean product yield of greater than 86%, crude oil capacity utilization rates higher than industry average and continuing to improve our competitive cost structure.\n•\nDisciplined Growth and Returns\n – A disciplined capital allocation process ensures we invest in projects that are expected to generate competitive returns.  Our strategy remains focused on growing our Midstream and Chemicals businesses.  Within our Midstream segment, we are primarily focused on maximizing the value of our fully integrated natural gas liquids (NGL) wellhead-to-market value chain.  \n•\nDuring 2025, we funded capital expenditures and investments of $1.6 billion and completed a Midstream acquisition of $2.2 billion.  This growth was achieved in part through $2.0 billion in proceeds from asset dispositions, including $1.2 billion from the sale of our 49% interest in Coop Mineraloel AG (Coop) and $853 million from DCP Midstream, LP’s (DCP LP) 25% ownership in Gulf Coast Express Pipeline LLC (GCX).  Also, in May 2025, we entered into a definitive agreement to divest 65% of our equity interest in our Germany and Austria retail marketing business (Germany and Austria Marketing) for expected cash proceeds of approximately $1.6 billion (1.5 billion Euros), subject to purchase price adjustments.  We expect to complete the Germany and Austria Marketing transaction in the fourth quarter of 2025, subject to customary closing conditions.  See Note 7—Investments, Loans and Long-Term Receivables, in the Notes to Consolidated Financial Statements for additional information on the investment dispositions.  See Note 23—Assets Held for Sale, in the Notes to Consolidated Financial Statements for additional information.  \n•\nWe will continue to evaluate future opportunities to rationalize our asset portfolio.  We budgeted $2.1 billion for 2025 capital expenditures and investments, exclusive of acquisitions and our share of capital spending by equity affiliates.  This includes $1.1 billion of growth capital, primarily in our Midstream segment and additional capital related to consolidation of WRB as of October 1, 2025.  See Note 3—Business Combinations, in the Notes to Consolidated Financial Statements for additional information.  \n•\nWe continued expansion of our Midstream NGL wellhead-to-market platform through acquiring all issued and outstanding equity interests in each of EPIC Y-Grade GP, LLC and EPIC Y-Grade, LP (collectively referred to herein as Coastal Bend), together with their respective subsidiaries, which own various long haul natural gas liquids pipelines, fractionation facilities and distribution systems.  See Note 3—Business Combinations, in the Notes to Consolidated Financial Statements for additional information.\n•\nOur financial targets through 2027 reflect our plans to organically grow our Midstream and Chemicals businesses, as well as maintain total annual capital expenditures and investments of approximately $2.5 billion, including capital related to consolidation of WRB as of October 1, 2025.\n42\nTable of Contents\n•\nFinancial Strength and Flexibility\n – We use a variety of funding sources to support our liquidity requirements, including cash from operations, debt and proceeds from dispositions.  Our focus remains on protecting the stable cash generation from the Midstream and M&S businesses while balancing continued portfolio optimization.  \n•\nWe are targeting reductions of total debt to $17 billion and to lower our debt to capital ratio.\n \n43\nTable of Contents\nBusiness Environment\nOur Midstream segment includes our Transportation and natural gas liquids (NGL) businesses.  Our Transportation business contains fee-based operations not directly exposed to commodity price risk.  Our NGL business, including DCP Midstream Class A Segment, DCP Sand Hills Pipeline, LLC (DCP Sand Hills) and DCP Southern Hills Pipeline, LLC (DCP Southern Hills), contains both fee-based operations and operations directly impacted by NGL and natural gas prices.  The weighted-average NGL price was $0.60 per gallon during the third quarter of 2025, compared with $0.64 per gallon during the third quarter of 2024.  The Henry Hub natural gas price was $3.03 per million British thermal units (MMBtu) during the third quarter of 2025, compared with $2.09 per MMBtu during the third quarter of 2024.  The decrease in NGL prices was primarily due to increased supply, while the improvement in natural gas prices was due to increased liquified natural gas exports as U.S. export infrastructure increases.\nOur Chemicals segment consists of our 50% equity investment in Chevron Phillips Chemical Company LLC (CPChem).  The chemicals and plastics industry is mainly a commodity-based industry where the margins for key products are based on supply and demand, as well as cost factors.  The benchmark high-density polyethylene chain margin was 7.6 cents per pound in the third quarter of 2025, compared with 23.7 cents per pound in the third quarter of 2024.  The decrease was mainly due to higher ethane prices and industry oversupply driven by capacity additions.\nOur Refining segment results are driven by several factors, including market crack spreads, refinery throughput, feedstock costs, product yields, turnaround activity and other operating costs.  Market crack spreads are used as indicators of refining margins and measure the difference between market prices for refined petroleum products and crude oil.  The composite 3:2:1 market crack spread for our business increased to an average of $23.64 per barrel during the third quarter of 2025, from an average of $16.50 per barrel during the third quarter of 2024.  The increase in the composite market crack spread was primarily driven by stronger year on year petroleum diesel demand, supported by low seasonal inventories.  The price of U.S. benchmark crude oil, West Texas Intermediate (WTI) at Cushing, Oklahoma, decreased to an average of $65.03 per barrel during the third quarter of 2025, from an average of $75.19 per barrel during the third quarter of 2024, primarily due to increasing supply.\nResults for our M&S segment depend largely on marketing fuel and lubricant margins and sales volumes of our refined products.  While marketing fuel and lubricant margins are primarily driven by market factors, largely determined by the relationship between supply and demand, marketing fuel margins, in particular, are influenced by trends in spot prices and, where applicable, retail prices for refined products in the regions and countries where we operate.\nOur Renewable Fuels segment consists of the operations and assets of the Rodeo Renewable Energy Complex (Rodeo Complex) as well as the global activities to procure renewable feedstocks, manage certain regulatory credits, and market renewable fuels.  Results for our Renewable Fuels segment are impacted by several factors, including the market price of renewable fuels, feedstock costs, throughput, operating costs and the value of certain regulatory credits, as well as other market factors, largely determined by the relationship between supply and demand. \n44\nTable of Contents\nRESULTS OF OPERATIONS\nUnless otherwise indicated, discussion of results for the three and nine months ended September 30, 2025, is based on a comparison with the corresponding period of 2024.\nConsolidated Results\nA summary of income (loss) before income taxes by business segment with a reconciliation to net income attributable to Phillips 66 follows:\n \nMillions of Dollars\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \n2025\n \n2024 \nMidstream\n$\n697\n \n644 \n2,179\n \n1,965 \nChemicals\n176\n \n342 \n309\n \n769 \nRefining\n(518)\n(108)\n(1,096)\n410 \nMarketing and Specialties\n251\n \n(22)\n2,104\n \n759 \nRenewable Fuels\n(43)\n(116)\n(361)\n(226)\nCorporate and Other\n(364)\n(327)\n(1,168)\n(989)\nIncome before income taxes\n199\n \n413 \n1,967\n \n2,688 \nIncome tax expense\n32\n \n44 \n366\n \n538 \nNet income\n167\n \n369 \n1,601\n \n2,150 \nLess: net income attributable to noncontrolling interests\n34\n \n23 \n104\n \n41 \nNet income attributable to Phillips 66\n$\n133\n \n346 \n1,497\n \n2,109 \nNet income attributable to Phillips 66 in the third quarter of 2025 was $133 million, compared with $346 million in the third quarter of 2024.  Net income attributable to Phillips 66 for the nine months ended September 30, 2025, was $1.5 billion, compared with $2.1 billion for the nine months ended September 30, 2024.  \nThe decrease in net income attributable to Phillips 66 in the third quarter of 2025 was due to a before-tax impairment of $948 million on our equity investment in WRB Refining LP (WRB), accelerated depreciation for the Los Angeles Refinery, and lower equity earnings from CPChem.  These decreases were partially offset by improved realized refining margins, primarily driven by higher market crack spreads, lower legal accruals related to litigation with Propel Fuels, Inc. (Propel Fuels) recorded in the M&S segment and higher refining volumes. \nThe decrease in net income attributable to Phillips 66 for the nine months ended September 30, 2025, was due to a before-tax impairment of $948 million on our equity investment in WRB, accelerated depreciation for the Los Angeles Refinery, and lower equity earnings from CPChem and WRB.  These decreases were partially offset by a before-tax gain of $1 billion associated with the sale of our investment in Coop recognized in January 2025 in the M&S segment, lower legal accruals related to litigation with Propel Fuels and before-tax impairments recognized in 2024 related to certain crude oil processing and logistics assets in California and certain Midstream gathering and processing assets in Texas. \nSee Note 2—Restructuring for additional information regarding our plans to cease operations and begin idling the facilities at our Los Angeles Refinery, Note 7—Investments, Loans and Long-Term Receivables for additional information regarding the impairment of our equity investment in WRB and sale of our investment in Coop, Note 9—Impairments for additional information on 2024 impairments and Note 13—Contingencies and Commitments for additional information on ongoing litigation with Propel Fuels, in the Notes to Consolidated Financial Statements. \nSee the “Segment Results” section for additional information on our segment results.\n45\nTable of Contents\nStatement of Income Analysis\nSales and other operating revenues\n decreased 3% and 10% for the three and nine months ended September 30, 2025, respectively.  \nPurchased crude oil and products\n decreased 6% and 12% for the three and nine months ended September 30, 2025, respectively.  The decreases in both line items for the three and nine months ended September 30, 2025, were due to lower prices for crude oil, NGL, and refined petroleum products, partially offset by higher volumes. \nEquity in earnings of affiliates\n decreased 39% and 59% for the three and nine months ended September 30, 2025, respectively.  The decreases for both periods of 2025 were primarily attributable to lower equity earnings from CPChem, as well as lower equity earnings from sales of ownership interests in Coop and GCX which were both sold in January 2025.  The decrease for the three months ended September 30, 2025, was partially offset by improved WRB equity earnings, as a result of improved margins and utilization.  The decrease for the nine months ended September 30, 2025, was additionally impacted by lower equity earnings from WRB, as a result of decreased margins, and lower equity earnings from the sale of our ownership interest in Rockies Express Pipeline LLC (REX) in 2024.  See Note 7—Investments, Loans and Long-Term Receivables, in the Notes to Consolidated Financial Statements for additional information regarding the sales of ownership interests in 2025.  See the Chemicals segment analysis in the “Segment Results” section for additional information regarding CPChem.  \nNet gain on dispositions\n increased $766 million for the nine months ended September 30, 2025, primarily due to a before-tax gain of $1 billion associated with the sale of our investment in Coop in January 2025, recognized in the M&S segment.  This gain was partially offset by the absence of a before-tax gain of $238 million recognized in the Midstream segment in the second quarter of 2024 associated with the sale of our ownership interest in REX, as well as an unrealized loss of $74 million on foreign currency forward contracts entered into in connection with the pending divestiture of Germany and Austria Marketing.  See Note 7—Investments, Loans and Long-Term Receivables for additional information regarding the sale of Coop and Note 23—Assets Held for Sale for additional information on the Germany and Austria Marketing pending divestiture, in the Notes to Consolidated Financial Statements. \nOther income\n increased $32 million and $72 million for the three and nine months ended September 30, 2025, respectively.  The increases for both periods of 2025 were primarily due to the recognition of Clean Fuel Production credits starting in 2025.  The increase for the nine months ended September 30, 2025, was partially offset by changes in the fair value of our investment in NOVONIX, as well as decreased interest income.   \nOperating expenses\n increased $196 million for the nine months ended September 30, 2025, primarily due to environmental expenses related to future groundwater mitigation plans at the Los Angeles Refinery, costs associated with the acquisition of Coastal Bend in April 2025, as well as higher compensation and utility expenses. \nSelling, general and administrative expenses\n decreased 34% and 18% for the three and nine months ended September 30, 2025, respectively, primarily due to lower legal accruals related to litigation with Propel Fuels.  See Note 13—Contingencies and Commitments for additional information on ongoing litigation with Propel Fuels.\nDepreciation and amortization\n increased 52% and 58% for the three and nine months ended September 30, 2025, respectively, primarily due to accelerated depreciation for the Los Angeles Refinery, as well as additional depreciation from the acquisition of Coastal Bend in April 2025.  See Note 2—Restructuring for information regarding our plans to cease operations and begin idling the facilities at our Los Angeles Refinery and Note 3—Business Combinations for information regarding the Coastal Bend acquisition, in the Notes to Consolidated Financial Statements.\nImpairments\n increased $922 million and $562 million for the three and nine months ended September 30, 2025, respectively.  The increases for both periods of 2025 were due to the before-tax impairment of $948 million recognized in the third quarter of 2025 related to our equity investment in WRB.  The increase for the nine months ended September 30, 2025, was partially offset by a before-tax impairment of $163 million recognized in the first quarter of 2024 related to certain crude oil processing and logistics assets in California and a before-tax impairment of $224 million recognized in the second quarter of 2024 related to certain Midstream gathering and processing assets in Texas.  See Note 7—Investments, Loans and Long-Term Receivables for additional information regarding the impairment of our equity investment in WRB and Note 9—Impairments, in the Notes to Consolidated Financial Statements for additional information. \nTaxes other than income taxes\n increased $168 million and $405 million for the three and nine months ended September 30, 2025, respectively.  The increases for both periods in 2025 were primarily driven by the expiration of the Biodiesel Blender Tax Credit as of December 31, 2024.  The increase for the nine months ended September 30, 2025, was also impacted by an increase in tariffs and customs duties. \nInterest and debt expense\n increased 13% and 8% for the three and nine months ended September 30, 2025, respectively, primarily due to higher average debt balances.\nIncome tax expense\n decreased 27% and 32% for the three and nine months ended September 30, 2025, respectively, primarily due to lower income before income taxes.  See Note 21—Income Taxes, in the Notes to Consolidated Financial Statements for information regarding our effective income tax rates.\nNet income attributable to noncontrolling interests\n increased $63 million for the nine months ended September 30, 2025, due to improved results from DCP LP driven by before-tax impairments recognized in 2024 related to certain DCP LP gathering and processing assets in Texas, as well as impacts from the gain on sale of DCP LP’s equity investment in GCX in January 2025.  See Note 7—Investments, Loans and Long-Term Receivables and Note 9—Impairments, in the Notes to Consolidated Financial Statements for additional information.\n46\nTable of Contents\nSegment Results\nMidstream\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \n2025\n \n2024 \nMillions of Dollars\nIncome Before Income Taxes\nTransportation\n$\n194\n \n254 \n679\n \n1,045 \nNGL\n503\n \n390 \n1,500\n \n920 \nTotal Midstream\n$\n697\n \n644 \n2,179\n \n1,965 \n \nThousands of Barrels Daily\nTransportation Volumes\nPipelines*\n3,111\n \n3,006 \n3,033\n \n3,015 \nTerminals\n3,127\n \n3,049 \n3,047\n \n3,128 \nOperating Statistics\nWellhead Volume (billion cubic feet per day)**\n4.3\n \n4.3 \n4.2\n \n4.4 \nNGL production**\n483\n \n439 \n459\n \n431 \nPipeline Throughput–Y-Grade to Market***\n999\n \n762 \n887\n \n752 \nNGL fractionated\n930\n \n728 \n854\n \n717 \n* Pipelines represent the sum of volumes transported through each separately tariffed consolidated pipeline segment, excluding NGL’s pipelines.\n*\n* Includes 100% of DCP Midstream Class A Segment.\n*** Represents volumes delivered to fractionation market hubs, including Mont Belvieu, Sweeny and Conway.  Includes 100% of DCP Midstream Class A Segment and Phillips 66’s direct interest in DCP Sand Hills and DCP Southern Hills.\nThe Midstream segment provides crude oil and refined petroleum product transportation, terminaling and processing services; NGL production, transportation, storage, fractionation, processing, marketing and export services; natural gas gathering, compressing, treating, processing, storage, transportation and marketing services; and condensate recovery.  \nResults from our Midstream segment increased $53 million and $214 million for the three and nine months ended September 30, 2025, respectively. \nResults from our Transportation business decreased $60 million and $366 million for the three and nine months ended September 30, 2025, respectively.  The decreases for both periods of 2025 were primarily due to the retirement of a rail rack at the Los Angeles Refinery and lower equity earnings primarily from Dakota Access, LLC.  Additionally, the decrease in the nine months ended September 30, 2025, was impacted by the sale of our ownership interest in REX in the second quarter of 2024.\nResults from our NGL business increased $113 million and $580 million for the three and nine months ended September 30, 2025, respectively.  The increase in the three months ended September 30, 2025, is primarily due to results from the Coastal Bend operations, increased gathering and processing volumes and improved export margins.  The increase in the nine months ended September 30, 2025, is primarily related to a before-tax impairment charge associated with certain gathering and processing assets in Texas recognized in 2024, results from the Coastal Bend operations, and a before-tax gain from the sale of DCP LP’s ownership interest in GCX in January 2025.  In addition, the nine months ended September 30, 2025, reflected improved export margins and fewer weather-related impacts.\nSee the “Executive Overview and Business Environment” section for information on market factors impacting this quarter’s results.  See Note 7—Investments, Loans and Long-Term Receivables, in the Notes to Consolidated Financial Statements for additional information regarding the sales of ownership interests in 2025.\n47\nTable of Contents\nChemicals\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \n2025\n \n2024 \nMillions of Dollars\nIncome Before Income Taxes\n$\n176\n \n342 \n309\n \n769 \n \n \nMillions of Pounds\nCPChem Externally Marketed Sales Volumes*\n6,572\n \n6,264 \n18,831\n \n18,384 \n* Represents 100% of CPChem’s outside sales of produced petrochemical products, as well as commission sales from equity affiliates.\nOlefins and Polyolefins Capacity Utilization (percent)\n104\n \n%\n98 \n98\n \n97 \nThe Chemicals segment consists of our 50% interest in CPChem, which we account for under the equity method.  CPChem uses NGL and other feedstocks to produce petrochemicals.  These products are then marketed and sold or used as feedstocks to produce plastics and other chemicals.  CPChem produces and markets ethylene and other olefin products.  Ethylene produced is primarily consumed within CPChem for the production of polyethylene, normal alpha olefins and polyethylene pipe.  CPChem manufactures and/or markets aromatics and styrenics products, such as benzene, cyclohexane, styrene and polystyrene, as well as manufactures and/or markets a variety of specialty chemical products.  Unless otherwise noted, amounts referenced below reflect our net 50% interest in CPChem.\nResults from the Chemicals segment decreased $166 million and $460 million for the three and nine months ended September 30, 2025, respectively, primarily due to decreased polyethylene margins, mostly driven by lower sales prices.   \nSee the “Executive Overview and Business Environment” section for information on market factors impacting CPChem’s results.\n48\nTable of Contents\nRefining\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \n2025\n \n2024 \nMillions of Dollars\nIncome (Loss) Before Income Taxes\nAtlantic Basin/Europe\n$\n250\n \n(61)\n100\n \n32 \nGulf Coast\n119\n \n(102)\n(113)\n60 \nCentral Corridor\n(580)\n308 \n(238)\n764 \nWest Coast\n(307)\n(253)\n(845)\n(446)\nWorldwide\n$\n(518)\n(108)\n(1,096)\n410 \nDollars Per Barrel\nIncome (Loss) Before Income Taxes\nAtlantic Basin/Europe\n$\n4.94\n \n(1.27)\n0.72\n \n0.22 \nGulf Coast\n2.19\n \n(2.10)\n(0.79)\n0.41 \nCentral Corridor\n(20.61)\n11.38 \n(2.82)\n9.47 \nWest Coast\n(15.06)\n(11.51)\n(13.28)\n(6.64)\nWorldwide\n(3.38)\n(0.74)\n(2.55)\n0.93 \nRealized Refining Margins*\nAtlantic Basin/Europe\n$\n11.94\n \n5.87 \n9.24\n \n7.88 \nGulf Coast\n8.74\n \n6.39 \n7.61\n \n8.38 \nCentral Corridor\n15.82\n \n14.19 \n13.35\n \n13.18 \nWest Coast\n12.31\n \n4.34 \n11.17\n \n9.34 \nWorldwide\n12.15\n \n8.31 \n10.27\n \n9.77 \n* See the “Non-GAAP Reconciliations” section for a reconciliation of this non-GAAP measure to the most directly comparable measure under generally accepted accounting principles in the United States (GAAP), income (loss) before income taxes per barrel.\nOn September 9, 2025, we entered into a definitive agreement to acquire the remaining 50% ownership interest in WRB  from subsidiaries of Cenovus Energy Inc.  The transaction closed on October 1, 2025, for total cash consideration of $1.3 billion, subject to post-closing adjustments.  See Note 3—Business Combinations, in the Notes to Consolidated Financial Statements for additional information.\nIn October 2024, we announced our intention to cease operations and begin idling the facilities at our Los Angeles Refinery in the fourth quarter of 2025.  In the third quarter of 2025, we began the permitting processes for new uses at the Los Angeles Refinery.  See Note 2—Restructuring, in the Notes to Consolidated Financial Statements for additional information.  In early 2024, we ceased crude operations at the San Francisco Refinery as part of the conversion of the refinery into the Rodeo Complex.\n49\nTable of Contents\nThousands of Barrels Daily\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\nOperating Statistics\n2025\n2024 \n2025\n \n2024 \nRefining operations*\nAtlantic Basin/Europe\nCrude oil capacity\n537\n \n537 \n537\n \n537 \nCrude oil processed\n534\n \n498 \n471\n \n499 \nCapacity utilization (percent)\n99\n \n%\n93 \n88\n \n93 \nRefinery production\n552\n \n524 \n511\n \n534 \nGulf Coast\nCrude oil capacity\n529\n \n529 \n529\n \n529 \nCrude oil processed\n528\n \n473 \n469\n \n484 \nCapacity utilization (percent)\n100\n \n%\n89 \n89\n \n92 \nRefinery production\n597\n \n538 \n529\n \n545 \nCentral Corridor\nCrude oil capacity\n531\n \n531 \n531\n \n531 \nCrude oil processed\n549\n \n533 \n540\n \n528 \nCapacity utilization (percent)\n103\n \n%\n100 \n102\n \n99 \nRefinery production\n571\n \n554 \n561\n \n548 \nWest Coast\nCrude oil capacity\n244\n \n244 \n244\n \n244 \nCrude oil processed\n214\n \n230 \n225\n \n234 \nCapacity utilization (percent)\n88\n \n%\n94 \n92\n \n96 \nRefinery production\n219\n \n237 \n230\n \n243 \nWorldwide\nCrude oil capacity\n1,841\n \n1,841 \n1,841\n \n1,841 \nCrude oil processed\n1,825\n \n1,734 \n1,705\n \n1,745 \nCapacity utilization (percent)\n99\n \n%\n94 \n93\n \n95 \nRefinery production\n1,939\n \n1,853 \n1,831\n \n1,870 \n  * Includes our share of equity affiliates.\nThe Refining segment refines crude oil and other feedstocks into petroleum products, such as gasoline and distillates, including aviation fuels, at 11 refineries in the United States and Europe.\nResults from our Refining segment decreased $410 million and $1,506 million for the three and nine months ended September 30, 2025, respectively.  The decrease in the three months ended September 30, 2025, was primarily driven by a before-tax impairment of $948 million related to our equity investment in WRB and accelerated depreciation for the Los Angeles Refinery, partially offset by improved realized margins and higher volumes.  The increase in realized margins was primarily due to higher market crack spreads, partially offset by lower product differentials and unfavorable inventory hedging impacts.  The decrease in the nine months ended September 30, 2025, was primarily driven by a before-tax impairment of $948 million related to our equity investment in WRB and accelerated depreciation for the Los Angeles Refinery.\n50\nTable of Contents\nOur worldwide refining crude oil capacity utilization rate was 99% and 93% for the three and nine months ended September 30, 2025, respectively, compared with 94% and 95% in the three and nine months ended September 30, 2024, respectively.  The increase for the three months ended September 30, 2025, was primarily due to fewer weather-related impacts, as well as lower turnaround activity.  The decrease for the nine months ended September 30, 2025, was primarily due to higher turnaround activity.  \nSee the “Executive Overview and Business Environment” section for information on market factors impacting this quarter’s results.\n51\nTable of Contents\nMarketing and Specialties\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n2025\n \n2024 \n2025\n \n2024 \nMillions of Dollars\nIncome (Loss) Before Income Taxes\n$\n251\n \n(22)\n2,104\n \n759 \n \nDollars Per Barrel\nIncome (Loss) Before Income Taxes\nU.S.\n$\n0.18\n \n(1.43)\n1.08\n \n0.37 \nInternational\n4.55\n \n5.07 \n14.66\n \n4.36 \nRealized Marketing Fuel Margins*\nU.S.\n$\n2.04\n \n2.45 \n2.10\n \n1.92 \nInternational\n5.37\n \n6.19 \n5.76\n \n5.65 \n* See the “Non-GAAP Reconciliations” section for a reconciliation of this non-GAAP measure to the most directly comparable GAAP measure, income before income taxes per barrel. \nDollars Per Gallon\nU.S. Average Wholesale Prices*\nGasoline\n$\n2.51\n \n2.69 \n2.52\n \n2.72 \nDistillates\n2.77\n \n2.68 \n2.64\n \n2.76 \n* On third-party branded petroleum product sales, excluding excise taxes.\nThousands of Barrels Daily\nMarketing Refined Product Sales\nGasoline\n1,340\n \n1,253 \n1,279\n \n1,279 \nDistillates\n993\n \n990 \n957\n \n989 \nOther\n42\n \n51 \n50\n \n50 \n2,375\n \n2,294 \n2,286\n \n2,318 \nThe M&S segment purchases for resale and markets refined products, mainly in the United States and Europe.  In addition, this segment includes the manufacturing and marketing of base oils and lubricants. \nResults from the M&S segment increased $273 million and $1,345 million for the three and nine months ended September 30, 2025, respectively.  The increases for both periods of 2025 were due to an accrual of $605 million recorded during the third quarter of 2024 related to litigation with Propel Fuels, compared with an accrual of $241 million recorded during the third quarter of 2025 related to the same matter.  The increase in the three months ended September 30, 2025, was partially offset by lower U.S. marketing fuel margins.  The increase in the nine months ended September 30, 2025, was additionally impacted by a before-tax gain of $1 billion associated with the sale of our investment in Coop, higher U.S. and international marketing fuel margins, partially offset by a before-tax aggregate unrealized loss on foreign currency forward contracts entered into in connection with the Germany and Austria Marketing pending divestiture.  \nSee Note 7—Investments, Loans and Long-Term Receivables for additional information regarding the sale of Coop, Note 13—Contingencies and Commitments for additional information regarding the Propel Fuels litigation and Note 23—Assets Held for Sale for additional information related to the Germany and Austria Marketing pending divestiture, in the Notes to Consolidated Financial Statements.\n52\nTable of Contents\nSee the “Executive Overview and Business Environment” section for information on marketing fuel margins and other market factors impacting this quarter’s results.\n53\nTable of Contents\nRenewable Fuels\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n2025\n \n2024 \n2025\n \n2024 \nMillions of Dollars\nLoss Before Income Taxes\n$\n(43)\n(116)\n(361)\n(226)\nThousands of Barrels Daily\nOperating Statistics\nTotal Renewable Fuels Produced\n36\n \n44 \n40\n \n28 \nTotal Renewable Fuel Sales\n63\n \n70 \n66\n \n50 \nMarket Indicators\nChicago Board of Trade (CBOT) soybean oil (dollars per pound)\n$\n0.53\n \n0.43 \n0.49\n \n0.45 \nCalifornia Low-Carbon Fuel Standard (LCFS) carbon credit (dollars per metric ton)\n53.40\n \n53.89 \n57.34\n \n56.53 \nCalifornia Air Resource Board (CARB) ultra-low-sulfur diesel (ULSD) - San Francisco (dollars per gallon) \n2.55\n \n2.39 \n2.50\n \n2.56 \nBiodiesel Renewable Identification Number (RIN) (dollars per RIN)\n1.13\n \n0.60 \n1.00\n \n0.56 \nThe Renewable Fuels segment processes renewable feedstocks into renewable products at the Rodeo Complex and at our Humber Refinery.  In addition, this segment includes the global activities to procure renewable feedstocks, manage certain regulatory credits and market renewable fuels.  \nResults from the Renewable Fuels segment increased $73 million and decreased $135 million for the three and nine months ended September 30, 2025, respectively.  The increase in the three months ended September 30, 2025, was primarily due to improved margins driven by optimized feedstock volumes and higher international credits, partially offset by unfavorable inventory impacts.  The decrease in the nine months ended September 30, 2025, was primarily driven by decreased margins as a result of increased feedstock volumes, unfavorable inventory impacts, partially offset by increased credit production.\nSee the “Executive Overview and Business Environment” section for information on market factors impacting this quarter’s results.\n54\nTable of Contents\nCorporate and Other\n \nMillions of Dollars\n \nThree Months Ended \nSeptember 30\nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \n2025\n \n2024\nLoss Before Income Taxes\nNet interest expense\n$\n(225)\n(191)\n(642)\n(577)\nCorporate overhead and other\n(145)\n(136)\n(515)\n(410)\nNOVONIX\n6\n \n— \n(11)\n(2)\nTotal Corporate and Other\n$\n(364)\n(327)\n(1,168)\n(989)\nNet interest expense consists of interest and financing expense, net of interest income and capitalized interest.  Corporate overhead and other includes general and administrative expenses, technology costs, environmental costs associated with sites no longer in operation, foreign currency transaction gains and losses and other costs not directly associated with an operating segment.  Corporate and Other also includes the change in the fair value of our investment in NOVONIX.  See Note 15—Fair Value Measurements, in the Notes to Consolidated Financial Statements for additional information regarding our investment in NOVONIX. \nNet interest expense increased $34 million and $65 million for the three and nine months ended September 30, 2025, respectively, primarily due to higher average debt balances.\nCorporate overhead and other costs increased $105 million for the nine months ended September 30, 2025, primarily due to higher depreciation expense associated with information technology assets as well as higher advisory fees recorded during the second quarter of 2025 related to proxy solicitation services. \n55\nTable of Contents\nCAPITAL RESOURCES AND LIQUIDITY\nFinancial Indicators\nMillions of Dollars,\nExcept as Indicated\nSeptember 30\n2025\nDecember 31\n2024\nCash and cash equivalents*\n$\n1,845\n \n1,738 \nShort-term debt\n2,587\n \n1,831 \nTotal debt\n21,755\n \n20,062 \nTotal equity\n28,077\n \n28,463 \nPercent of total debt to capital**\n44%\n41\nPercent of floating-rate debt to total debt\n9%\n9\n* Excludes $105 million of “Cash and cash equivalents” included in “Assets held for sale” on our consolidated statement of income as of September 30, 2025.\n** Capital includes total debt and total equity.\nTo meet our short- and long-term liquidity requirements, we use a variety of funding sources but rely primarily on cash generated from operating activities and debt financing.  During the first nine months of 2025, we generated $2.2 billion of cash from operations.  We received proceeds from asset dispositions of $2 billion and received $2 billion from net debt borrowings.  We funded capital expenditures and investments of $1.6 billion and an acquisition of $2.2 billion, net of cash acquired.  Additionally, we paid $933 million to repurchase shares of our common stock and paid $1.4 billion of dividends to our common stockholders.  During the first nine months of 2025, cash and cash equivalents, including cash classified within assets held for sale, increased by $212 million.  At this time, we believe that our cash on hand, as well as the sources of liquidity described herein, will be sufficient to fund our obligations over the short- and long-term. \nSignificant Sources of Capital\nOperating Activities\nDuring the first nine months of 2025, cash generated by operating activities was $2.2 billion, compared with $3 billion for the first nine months of 2024.  \nThe decrease was primarily due to unfavorable working capital impacts. \nOur short- and long-term operating cash flows are highly dependent upon refining and marketing margins, NGL prices and chemicals margins.  Prices and margins in our industry are typically volatile and are driven by market conditions over which we have little or no control.  Absent other mitigating factors, as these prices and margins fluctuate, we would expect a corresponding change in our operating cash flows. \nThe level and quality of output from our refineries also impacts our cash flows.  Factors such as operating efficiency, maintenance turnarounds, market conditions, feedstock availability and weather conditions can affect output.  We actively manage the operations of our refineries, and any variability in their operations typically has not been as significant to cash flows as that caused by fluctuations in margins and prices.  \nEquity Affiliate Operating Distributions\nOur operating cash flows are also impacted by distribution decisions made by our equity affiliates.  During the first nine months of 2025, cash from operations included aggregate distributions of $783 million from our equity affiliates, while cash from operations during the first nine months of 2024 included aggregate distributions of $1,045 million from our equity affiliates.  We cannot control the amount of future dividends from equity affiliates; therefore, future dividend payments by these equity affiliates are not assured.\n56\nTable of Contents\nDebt Issuances\nOn September 18, 2025, Phillips 66 Company, a wholly owned subsidiary of Phillips 66, issued $2 billion aggregate principal amount of junior subordinated notes that are fully and unconditionally guaranteed by Phillips 66.  The junior subordinated notes issuance consisted of: \n•\n$1 billion aggregate principal amount of 5.875% Series A Junior Subordinated Notes due 2056 (Series A 2056 Notes).\n•\n$1 billion aggregate principal amount of 6.200% Series B Junior Subordinated Notes due 2056 (Series B 2056 Notes). \nInterest on the Series A 2056 Notes and Series B 2056 Notes is payable semi-annually in arrears on March 15 and September 15 of each year, commencing on March 15, 2026.  The Series A 2056 Notes will bear interest at 5.875% per year until March 15, 2031.  The interest rate will reset every five years beginning on March 15, 2031, to equal the then-current five-year U.S. Treasury rate plus a spread of 2.283%, provided that the interest rate will not reset below 5.875%.  The Series B 2056 Notes will bear interest at 6.200% per year until March 15, 2036.  The interest rate will reset every five years beginning on March 15, 2036, to equal the then-current five-year U.S. Treasury rate plus a spread of 2.166%, provided that the interest rate will not reset below 6.200%.  We may defer interest payments on the Series A 2056 Notes and Series B 2056 Notes on one or more occasions for up to 10 consecutive years per deferral period.  If interest payments on the Series A 2056 Notes or Series B 2056 Notes are deferred, we may not, subject to certain limited exceptions, declare or pay any dividends or distributions, or redeem, purchase, acquire, or make a liquidation payment on any of our capital stock during the deferral period.  Also, during the deferral period, we may not (i) pay any principal of, or interest or premium, if any, on or repay, repurchase or redeem any debt securities of Phillips 66 or Phillips 66 Company that rank equally with, or junior to, the Series A 2056 Notes and Series B 2056 Notes, respectively, in right of payment or (ii) make any payments with respect to any guarantee by Phillips 66 or Phillips 66 Company of indebtedness if the guarantee ranks equally with or junior to the Series A 2056 Notes or Series B 2056 Notes, respectively, in right of payment.\nOn September 11, 2024, Phillips 66 Company, a wholly owned subsidiary of Phillips 66, issued $1.8 billion aggregate principal amount of senior unsecured notes that are fully and unconditionally guaranteed by Phillips 66.  The senior unsecured notes issuance consisted of: \n•\n$600 million aggregate principal amount of 5.250% Senior Notes due 2031 (Additional 2031 Notes).\n•\n$600 million aggregate principal amount of 4.950% Senior Notes due 2035 (2035 Notes).\n•\n$600 million aggregate principal amount of 5.500% Senior Notes due 2055 (2055 Notes).\nInterest on the Additional 2031 Notes is payable semi-annually on June 15 and December 15 of each year and commenced on December 15, 2024.  Interest on the 2035 Notes and 2055 Notes is payable semi-annually on March 15 and September 15 of each year and commenced on March 15, 2025.  \nOn February 28, 2024, Phillips 66 Company, a wholly owned subsidiary of Phillips 66, issued $1.5 billion aggregate principal amount of senior unsecured notes that are fully and unconditionally guaranteed by Phillips 66.  The senior unsecured notes issuance consisted of: \n•\n$600 million aggregate principal amount of 5.250% Senior Notes due 2031 (2031 Notes).\n•\n$400 million aggregate principal amount of 5.300% Senior Notes due 2033 (Additional 2033 Notes).\n•\n$500 million aggregate principal amount of 5.650% Senior Notes due 2054 (2054 Notes).\nInterest on the 2031 Notes and 2054 Notes is payable semi-annually on June 15 and December 15 of each year and commenced on June 15, 2024.  Interest on the Additional 2033 Notes is payable semi-annually on June 30 and December 30 of each year and commenced on June 30, 2024.  \nDischarge of Senior Notes\nOn September 20, 2024, we extinguished (i) the remaining $441 million outstanding principal amount of Phillips 66 Company’s 3.605% Senior Notes due February 2025 (2025 P66 Co Notes), and (ii) the remaining $650 million outstanding principal amount of Phillips 66’s 3.850% Senior Notes due April 2025 (the 2025 PSX Notes, and together with the 2025 P66 Co Notes, the Discharged Notes), whereby we irrevocably transferred a total of $1,100 million in \n57\nTable of Contents\ngovernment obligations to the trustee of the 2025 P66 Co Notes and the 2025 PSX Notes.  The cash paid to purchase the government obligations is included within investing cash flows on our consolidated statement of cash flows.  These government obligations yielded sufficient principal and interest over their remaining term to permit the trustee to satisfy the remaining principal and interest due on the Discharged Notes on the applicable maturity dates.  On September 20, 2024, Phillips 66 and Phillips 66 Company ceased to be the primary obligors under the Discharged Notes.  The transfer of the government obligations to the trustee was accounted for as a transfer of financial assets.  If the trustee was unable to apply the government obligations to fund the remaining principal and interest payments on the Discharged Notes, then the Company’s obligations under the Indenture with respect to the Discharged Notes would have been revived and reinstated.  We deemed the likelihood of such event to be remote with no impact to the legal isolation of the assets.  Accordingly, the Discharged Notes and the government obligations were derecognized on our balance sheet at December 31, 2024.  For the three and nine months ended September 30, 2024, we recognized an immaterial gain on the extinguishment of this debt.\nAccounts Receivable Securitization\nOn September 30, 2024, Phillips 66 Company entered into a 364-day, $500 million accounts receivable securitization facility (the Receivables Securitization Facility).  Under the Receivables Securitization Facility, Phillips 66 Company sells or contributes on an ongoing basis, certain of its receivables, together with related security and interests in the proceeds thereof, to its wholly owned subsidiary, Phillips 66 Receivables LLC (P66 Receivables), a consolidated and bankruptcy-remote special purpose entity created for the sole purpose of transacting under the Receivables Securitization Facility.  On April 1, 2025, Phillips 66 Company amended the Receivables Securitization Facility to, among other things, increase the maximum size of the Receivables Securitization Facility from $500 million to $1 billion.  On September 29, 2025, Phillips 66 Company amended the Receivables Securitization Facility to, among other things, increase the maximum size of the Receivables Securitization Facility from $1 billion to $1.25 billion and extend the term of the facility through September 28, 2026.  Under the amended Receivables Securitization Facility, P66 Receivables may borrow and incur indebtedness from, and/or sell certain accounts receivable in an amount not to exceed $1.25 billion in the aggregate, and will secure its obligations with a pledge of undivided interests in such accounts receivable, together with related security and interests in the proceeds thereof, to PNC Bank, National Association, as Administrative Agent, for the benefit of the secured parties thereunder.  Accounts outstanding under the Receivables Securitization Facility accrue interest at an adjusted term Secured Overnight Financing Rate (SOFR) plus the applicable margin.  In all instances, Phillips 66 Company retains the servicing of the accounts receivable transferred.\nSales of accounts receivable under the Receivables Securitization Facility meet the sale criteria under ASC 860, Transfers and Servicing and are derecognized from the consolidated balance sheet.  P66 Receivables guarantees payment, in full, for accounts receivable sold to the purchasers.  For the three months ended September 30, 2025, we sold $160 million of accounts receivable for cash proceeds under the Receivables Securitization Facility.  For the nine months ended September 30, 2025, we sold $593 million in accounts receivable in exchange for cash proceeds of $290 million, and a $303 million reduction in our borrowings under the Receivables Securitization Facility was recognized as a non-cash financing transaction.  We recognized immaterial charges associated with the transfer of financial assets, which are included as a component within the line item “Selling, general and administrative expense” on our consolidated statement of income during the three and nine months ended September 30, 2025.  \nAt September 30, 2025, we had utilized $160 million of the $1.25 billion capacity on our Receivable Securitization Facility from sold accounts receivable not yet remitted to the Administrative Agent.  We had no outstanding borrowings under the Receivable Securitization Facility at September 30, 2025.  At December 31, 2024, we had utilized the full $500 million capacity of our Receivables Securitization Facility from $125 million of sold accounts receivable not yet remitted to the Administrative Agent and $375 million of outstanding borrowings.  The outstanding borrowings at December 31, 2024, were secured by approximately $4.6 billion of accounts receivable held by P66 Receivables at December 31, 2024, which are included within the “Accounts and notes receivable” line item on our consolidated balance sheet.\n58\nTable of Contents\nCredit Facilities and Commercial Paper\nPhillips 66 and Phillips 66 Company\nOn January 13, 2025, we entered into a $200 million uncommitted credit facility (the 2025 Uncommitted Facility) with Phillips 66 Company as the borrower and Phillips 66 as the guarantor.  The 2025 Uncommitted Facility contains covenants and events of default customary for unsecured uncommitted facilities.  The 2025 Uncommitted Facility has no commitment fees or compensating balance requirements.  Outstanding borrowings under the 2025 Uncommitted Facility bear interest at a rate of either (a) the adjusted term SOFR plus the applicable margin, (b) the adjusted daily simple SOFR plus the applicable margin or (c) the base rate, in each case plus the applicable margin.  Each borrowing matures six months from the date of such borrowing.  We may at any time prepay outstanding borrowings, in whole or in part, without premium or penalty.  At September 30, 2025, $200 million of borrowings were outstanding under the 2025 Uncommitted Facility.\nOn June 25, 2024, we entered into a $400 million uncommitted credit facility (the 2024 Uncommitted Facility) with Phillips 66 Company as the borrower and Phillips 66 as the guarantor.  The 2024 Uncommitted Facility contains covenants and events of default customary for unsecured uncommitted facilities.  The 2024 Uncommitted Facility has no commitment fees or compensating balance requirements.  Outstanding borrowings under the 2024 Uncommitted Facility bear interest at a rate of either (a) the adjusted term SOFR, (b) the adjusted daily simple SOFR or (c) the reference rate, in each case plus the applicable margin.  Each borrowing matures six months from the date of such borrowing.  We may at any time prepay outstanding borrowings, in whole or in part, without premium or penalty.  At September 30, 2025, and December 31, 2024, $400 million of borrowings were outstanding under the 2024 Uncommitted Facility.\nOn February 28, 2024, we entered into a new $5 billion revolving credit agreement (the Facility) with Phillips 66 Company as the borrower and Phillips 66 as the guarantor and a scheduled maturity date of February 28, 2029.  The Facility replaced our previous $5 billion revolving credit facility dated as of June 23, 2022, with Phillips 66 Company as the borrower and Phillips 66 as the guarantor, and the previous revolving credit facility was terminated.  The Facility contains customary covenants similar to the previous revolving credit facility, including a maximum consolidated net debt-to-capitalization ratio of 65% as of the last day of each fiscal quarter.  The Facility has customary events of default, such as nonpayment of principal when due; nonpayment of interest, fees or other amounts after grace periods; and violation of covenants. We may at any time prepay outstanding borrowings under the Facility, in whole or in part, without premium or penalty.  We have the option to increase the overall capacity to $6 billion, subject to certain conditions.  We also have the option to extend the scheduled maturity of the Facility for up to two additional one-year terms, subject to, among other things, the consent of the lenders holding the majority of the commitments and of each lender extending its commitment.  Outstanding borrowings under the Facility bear interest at either: (a) the adjusted term SOFR (as described in the Facility) in effect from time to time plus the applicable margin; or (b) the reference rate (as described in the Facility) plus the applicable margin.  The pricing levels for the commitment fee and interest-rate margins are determined based on the ratings in effect for our senior unsecured long-term debt from time to time.  At September 30, 2025, and December 31, 2024, no amount had been drawn under the Facility.\nPhillips 66 also has a $5 billion uncommitted commercial paper program for short-term working capital needs that is supported by the Facility.  Commercial paper maturities are contractually limited to less than one year.  At September 30, 2025, we had $897 million borrowings outstanding under this program, while at December 31, 2024, $435 million of commercial paper had been issued under this program.\nDCP Midstream Class A Segment\nOn March 15, 2024, DCP LP terminated its $1.4 billion credit facility and its accounts receivable securitization facility that previously provided for up to $350 million of borrowing capacity.  In conjunction with the termination of these facilities, DCP LP repaid $25 million in borrowings outstanding under its $1.4 billion credit facility and $350 million of borrowings outstanding under its accounts receivable securitization facility during the three months ended March 31, 2024.\nTotal Committed Capacity Available\nAt September 30, 2025, and December 31, 2024, we had approximately $5.2 billion and $4.6 billion, respectively, of total committed capacity available under the credit facilities described above. \n59\nTable of Contents\nPending Marketing Divestiture \nOn May 15, 2025, we entered into a definitive agreement to divest 65% of our equity interest in Germany and Austria Marketing for expected pre-tax cash proceeds of approximately $1.6 billion (1.5 billion Euros), subject to purchase price adjustments for working capital and certain long-term liabilities on the closing date.  We will retain a 35% non-operating equity interest in Germany and Austria Marketing through a joint venture, which will be formed prior to the closing of the transaction.  We expect to close this transaction in the fourth quarter of 2025, subject to customary closing conditions.  See Note 23—Assets Held for Sale in the Notes to Consolidated Financial Statements for additional information.\nInvestment Dispositions\nOn January 31, 2025, we sold our 49% ownership interest in Coop and settled the foreign currency forward contracts entered into in connection with the asset sale.  We received cash proceeds of $1.2 billion, consisting of a sales price of $1.15 billion and a final dividend relating to financial year 2024 of $92 million from Coop that was paid on January 30, 2025.\nOn January 30, 2025, DCP LP sold its 25% ownership interest in GCX for cash proceeds of $853 million.\nSee Note 7—Investments, Loans and Long-Term Receivables, in the Notes to Consolidated Financial Statements for additional information regarding investment dispositions. \nAvailability of Debt Financing\nIn September 2025, Moody’s Ratings announced a long-term credit rating change for the company to Baa1 from A3 and affirmed the P-2 rating assigned to the company’s commercial paper program.  The outlook has been changed to stable from negative.  Standard & Poor’s currently rates the company’s long-term debt at BBB+ with a stable outlook and commercial paper at A-2.  Both agencies’ ratings are considered investment grade.  Failure to maintain investment grade ratings could prohibit us from accessing the commercial paper market.  However, a rating downgrade by one or both rating agencies would not trigger an automatic default under any of our corporate debt and we would expect to maintain access to funds under our existing liquidity facilities. \n60\nTable of Contents\nOff-Balance Sheet Arrangements \nLease Residual Value Guarantees\nUnder the operating lease agreement on our headquarters facility in Houston, Texas, we had the option at the end of the existing lease term to request to renew the lease, purchase the facility or assist the lessor in marketing it for resale.  In September 2025, we amended and extended the lease term to September 2030.  Under the new operating lease agreement, we have a residual value guarantee with a maximum potential future exposure of $404 million at September 30, 2025.  We also have residual value guarantees associated with railcar, airplane and truck leases with maximum potential future exposures totaling $174 million.  These leases have remaining terms of one to ten years.\nDakota Access, LLC (Dakota Access) and Energy Transfer Crude Oil Company, LLC (ETCO)\nIn 2020, the trial court presiding over litigation brought by the Standing Rock Sioux Tribe (the Tribe) ordered the U.S. Army Corps of Engineers (USACE) to prepare an Environmental Impact Statement (EIS) addressing an easement under Lake Oahe in North Dakota.  The trial court later vacated the easement.  Although the easement is vacated, the USACE has no plans to stop pipeline operations while it proceeds with the EIS, and the Tribe’s request for a shutdown was denied in May 2021.  In June 2021, the trial court dismissed the litigation entirely.  Once the EIS is completed, new litigation or challenges may be filed.  \nIn February 2022, the U.S. Supreme Court (the Supreme Court) denied Dakota Access’ writ of certiorari requesting the Supreme Court to review the trial court’s decision to order the EIS and vacate the easement.  Therefore, the requirement to prepare the EIS stood.  Also in February 2022, the Tribe withdrew as a cooperating agency, causing the USACE to halt the EIS process while the USACE engaged with the Tribe on their reasons for withdrawing. \nThe draft EIS process resumed in August 2022, and in September 2023, the USACE published its draft EIS for public comment.  The USACE identified five potential outcomes but did not indicate which one it preferred.  The options comprise two “no action” alternatives where the USACE would deny an easement to Dakota Access and require it to shut down the pipeline and either remove the pipe from under Lake Oahe or allow the pipeline to be abandoned-in-place under the lake.  The USACE also identified three “action” alternatives; two of them contemplate that the USACE would reissue the easement to Dakota Access under essentially the same terms as in 2017 with either the same or a larger volume of oil allowed through the pipeline, while the third alternative would require decommissioning of the current pipeline and construction of a new line 39 miles upstream from the current location. \nThe public comment period concluded on December 13, 2023.  The USACE plans to review the comments and issue its final EIS in early 2026.  The Record of Decision will follow within 30 to 60 days after the issuance of the final EIS.  The final EIS must be completed before the USACE can reauthorize the easement for the pipeline.  If reauthorization occurs, new litigation challenging the reauthorization may be filed.\nIn October 2024, the Tribe filed another lawsuit against the USACE in federal district court in Washington, D.C., again challenging USACE’s allowance of pipeline operations while the EIS process proceeds.  In this lawsuit, the Tribe purports to introduce new evidence regarding the pipeline’s proximity to a reservoir and attempts to relitigate arguments about the need for injunctive relief to support its position that the Supreme Court should halt pipeline operations.  A consortium of 13 states has joined Dakota Access as intervenors.  The consortium argues that the pipeline reduces pollution compared to other modes of transportation and that Dakota Access is integral to the health of regional energy and agriculture markets.  The Tribe’s prior request for a shutdown was denied in May 2021.  This latest lawsuit seeking a shutdown does not change the current deadline for the issuance of the final EIS.  Motions to dismiss the latest lawsuit were filed by USACE, Dakota Access and Intervenors and opposed by the Tribe.  On March 19, 2025, the Tribe filed a notice in support of its latest lawsuit, indicating three additional facts for the district court to consider when making its ruling on the lawsuit.  These facts relate to events regarding Energy Transfer LP’s conduct and third-party actions against it.  Subsequently, the Court dismissed this lawsuit, finding that the Tribe’s lawsuit was premature and cannot be refiled until after a final EIS is issued.  \nDakota Access and ETCO have guaranteed repayment of senior unsecured notes issued by a wholly owned subsidiary of Dakota Access.  On April 1, 2024, Dakota Access’ wholly owned subsidiary repaid $1 billion aggregate principal amount of its outstanding senior notes upon maturity.  We funded our 25% share of the repayment, or $250 million, with a capital contribution of $171 million in March 2024, and $79 million of distributions we elected not to receive from Dakota \n61\nTable of Contents\nAccess in the first quarter of 2024.  At September 30, 2025, the aggregate principal amount outstanding of Dakota Access’ senior unsecured notes was $850 million.\nIn addition, Phillips 66 Partners LP (Phillips 66 Partners), a wholly owned subsidiary of Phillips 66, and its co-venturers in Dakota Access also provided a Contingent Equity Contribution Undertaking (CECU) in conjunction with the notes offering.  Under the CECU, the co-venturers may be severally required to make proportionate equity contributions to Dakota Access if there is an unfavorable final judgment in the above-mentioned ongoing litigation.  At September 30, 2025, our 25% share of the maximum potential equity contributions under the CECU was approximately $215 million.  If the pipeline is required to cease operations, it may have a material adverse effect on our results of operations and cash flows.  Should operations cease and Dakota Access and ETCO not have sufficient funds to pay its expenses, we also could be required to support our 25% share of the ongoing expenses, including scheduled interest payments on the notes of approximately $10 million annually, in addition to the potential obligations under the CECU at September 30, 2025.   \nSee Note 7—Investments, Loans and Long-Term Receivables for additional information regarding our investments in Dakota Access and ETCO and Note 12—Guarantees for additional information regarding our guarantees, in the Notes to Consolidated Financial Statements. \n62\nTable of Contents\nCapital Requirements\nCapital Expenditures and Investments\nFor information about our capital expenditures and investments, see the “Capital Spending” section below.\nDebt Financing\nOur debt balance at September 30, 2025, and December 31, 2024, was $21.8 billion and $20.1 billion, respectively.  Our total debt-to-capital ratio was 44% and 41% at September 30, 2025, and December 31, 2024, respectively. \nOn June 27, 2025, DCP LP early redeemed the outstanding $525 million of its 5.375% Senior Notes due July 2025, with an aggregate principal amount of $825 million.\nOn February 18, 2025, upon maturity, Phillips 66 Partners repaid its 3.605% Senior Notes due February 2025, with an aggregate principal amount of $59 million.  \nMidstream Acquisition\nDuring the second quarter of 2025, we completed the Coastal Bend acquisition, for total consideration of $2.2 billion, net of cash acquired.  This acquisition was funded with cash and borrowings under our short-term liquidity facilities.  See Note 3—Business Combinations, in the Notes to Consolidated Financial Statements for additional information. \nSubsequent Refining Acquisition \nOn September 9, 2025, we entered into a definitive agreement to acquire the remaining 50% ownership interest in WRB from subsidiaries of Cenovus Energy Inc.  The transaction closed on October 1, 2025, for total cash consideration of $1.3 billion, subject to post-closing adjustments.  This acquisition was funded with cash and borrowings under our short-term liquidity facilities.\nDividends\nOn April 21, 2025, our Board of Directors declared a quarterly cash dividend of $1.20 per common share.  This dividend was paid on June 2, 2025, to shareholders of record as of the close of business on May 19, 2025.  On July 10, 2025, our Board of Directors declared a quarterly cash dividend of $1.20 per common share.  This dividend was paid on September 2, 2025, to shareholders of record as of the close of business on August 19, 2025.  On October 8, 2025, our Board of Directors declared a quarterly cash dividend of $1.20 per common share.  This dividend is payable on December 1, 2025, to shareholders of record as of the close of business on November 17, 2025.\nShare Repurchases \nSince July 2012, our Board of Directors has authorized an aggregate of $25 billion of repurchases of our outstanding common stock under our share repurchase program.  Our share repurchase authorizations do not expire.  Any future share repurchases will be made at the discretion of management and will depend on various factors including our share price, results of operations, financial condition and cash required for future business plans.  For the nine months ended September 30, 2025, we repurchased 8 million shares at an aggregate cost of approximately $0.9 billion.  Since July 2012, we have repurchased 246 million shares under our share repurchase program at an aggregate cost of $22.4 billion.  Shares of stock repurchased are held as treasury shares.  \nEmployee Benefit Plan Contributions\nDuring the nine months ended September 30, 2025, we contributed $157 million to our U.S. pension and other postretirement benefit plans and $4 million to our international pension plans.  We currently expect to make additional contributions of approximately $8 million to our U.S. pension and other postretirement benefit plans and approximately $2 million to our international pension plans during the remainder of 2025.  \n63\nTable of Contents\nCapital Spending\n \nMillions of Dollars\n \nNine Months Ended \nSeptember 30\n \n2025\n \n2024 \nCapital Expenditures and Investments*\nMidstream\n$\n947\n \n523 \nChemicals\n—\n \n— \nRefining\n469\n \n386 \nMarketing and Specialties\n75\n \n53 \nRenewable Fuels\n33\n \n357 \nCorporate and Other\n27\n \n34 \nTotal Capital Expenditures and Investments\n$\n1,551\n \n1,353 \nSelected Equity Affiliates\n**\nCPChem\n609\n \n579 \nWRB\n99\n \n83 \n$\n708\n \n662 \n    * Excludes, Acquisitions net of cash acquired.\n    ** Our share of joint ventures’ capital spending. \nMidstream\n \nDuring the first nine months of 2025, capital spending in our Midstream segment was $947 million and included:\n•\nContinued development and completion of a second Dos Picos gas plant, further expanding our operations in the Permian Basin.\n•\nGathering and processing projects to further align our wellhead-to-market strategy. \n•\nSpending associated with other reliability and maintenance projects in our Transportation and NGL businesses.\nChemicals\nDuring the first nine months of 2025, on a 100% basis, CPChem’s capital expenditures and investments were $1,218 million.  Capital spending was primarily for the development of petrochemical projects on the U.S. Gulf Coast and in the Middle East, as well as sustaining, debottlenecking and optimization projects on existing assets.  CPChem’s capital program was self-funded, and we expect CPChem to continue self-funding its capital program for the remainder of 2025. \n64\nTable of Contents\nRefining\nCapital spending for the Refining segment during the first nine months of 2025 was $469 million.  Major capital activities included spend to improve reliability at our refineries and installation of facilities to improve market capture, product value and utilization; such as our recently completed Sweeny Crude Flex project. \nMarketing and Specialties\nCapital spending for the M&S segment during the first nine months of 2025 was $75 million, primarily for the continued development and enhancement of retail sites in Europe, marketing-related information technology enhancements, spend associated with marketing and commercial fleet fueling businesses on the U.S. West Coast and reliability and maintenance projects for our Specialties business.\nRenewable Fuels\nCapital spending for the Renewable Fuels segment during the first nine months of 2025 was $33 million.  The capital spending was focused on increasing reliability, debottlenecking opportunities and improving feed flexibility on existing assets. \nCorporate and Other\nCapital spending for Corporate and Other during the first nine months of 2025 was $27 million, primarily related to information technology.\n65\nTable of Contents\nContingencies\nA number of lawsuits involving a variety of claims that arose in the ordinary course of business have been filed against us or are subject to indemnifications provided by us.  We also may be required to remove or mitigate the effects on the environment of the placement, storage, disposal or release of certain chemical, mineral and petroleum substances at various active and inactive sites.  We regularly assess the need for financial recognition or disclosure of these contingencies.  In the case of all known contingencies (other than those related to income taxes), we accrue a liability when the loss is probable and the amount is reasonably estimable.  If a range of amounts can be reasonably estimated and no amount within the range is a better estimate than any other amount, then the minimum of the range is accrued.  We do not reduce these liabilities for potential insurance or third-party recoveries.  If applicable, we accrue receivables for probable insurance or other third-party recoveries.  In the case of income tax-related contingencies, we use a cumulative probability-weighted loss accrual in cases where sustaining a tax position is uncertain.\nOther than with respect to the legal matters described herein, based on currently available information, we believe it is remote that future costs related to known contingent liability exposures will exceed current accruals by an amount that would have a material adverse impact on our consolidated financial statements.  As we learn new facts concerning contingencies, we reassess our position both with respect to accrued liabilities and other potential exposures.  Estimates particularly sensitive to future changes include contingent liabilities recorded for environmental remediation, tax and legal matters.  Estimated future environmental remediation costs are subject to change due to such factors as the uncertain magnitude of cleanup costs, the unknown time and extent of such remedial actions that may be required, and the determination of our liability in proportion to that of other potentially responsible parties.  Estimated future costs related to tax and legal matters are subject to change as events evolve and as additional information becomes available during the administrative and litigation processes.\nLegal and Tax Matters\nOur legal and tax matters are handled by our legal and tax organizations, respectively.  These organizations apply their knowledge, experience and professional judgment to the specific characteristics of our cases and uncertain tax positions.  We employ a litigation management process to manage and monitor legal proceedings.  Our process facilitates the early evaluation and quantification of potential exposures in individual cases and enables the tracking of those cases that have been scheduled for trial and/or mediation.  Based on professional judgment and experience in using these litigation management tools and available information about current developments in all our cases, our legal organization regularly assesses the adequacy of current accruals and determines if adjustment of existing accruals, or establishment of new accruals, is required.  In the case of income tax-related contingencies, we monitor tax legislation and court decisions, the status of tax audits and the statute of limitations within which a taxing authority can assert a liability.\n66\nTable of Contents\nPropel Fuels Litigation\nIn late 2017, as part of Phillips 66 Company’s evaluation of various opportunities in the renewable fuels business, Phillips 66 Company engaged with Propel Fuels, Inc. (Propel Fuels), a California company that distributes E85 and other alternative fuels through fueling kiosks.  Ultimately, the parties were not able to reach an agreement, and negotiations were terminated in August 2018.  On February 17, 2022, Propel Fuels filed a lawsuit in the Superior Court of California, \nCounty of Alameda (the Propel Court), alleging that Phillips 66 Company misappropriated trade secrets related to Propel Fuels’ renewable fuels business during and after due diligence.  \nOn October 16, 2024, a jury returned a verdict against Phillips 66 Company for $604.9 million in compensatory damages and issued a willfulness finding.  Based on the willfulness finding, Propel Fuels asked the Propel Court to award $1.2 billion in exemplary damages, and Phillips 66 Company filed a brief in opposition to that request.  A hearing on exemplary damages was held on March 4, 2025.  On August 5, 2025, the Propel Court entered a final judgment against Phillips 66 Company in the amount of $833 million.  The judgment includes the $604.9 million jury verdict, $195 million of exemplary damages, and $33.3 million of pre-judgment interest at 7%.  Post-judgment interest of 10% is accruing from the date of the final judgment.  On August 25, 2025, Phillips 66 Company filed three post-trial motions requesting that the Propel Court render judgment in favor of Phillips 66 Company, grant a new trial, and/or reduce the damages award.  On October 20, 2025, the Propel Court denied Phillips 66 Company’s motions.  On October 24, 2025, Propel Fuels filed additional motions with the Propel Court seeking attorney’s fees and costs.  Phillips 66 will file its opposition and once the record on this issue is complete, the Propel Court will rule on these motions.  Phillips 66 Company denies any wrongdoing and intends to vigorously defend its position.  As a result of the August 2025 final judgment and the October 2024 jury verdict, our recorded accruals totaled  $846 million and  $604.9 million  which are included within the “Selling, general and administrative expenses” line on our consolidated statement of income for the periods ending September 30, 2025 and 2024, respectively, and are reported in the M&S segment.  \nThe accrued amounts are reflected as “Other liabilities and deferred credits” on our consolidated balance sheet as of September 30, 2025, and December 31, 2024, respectively.  However, it is reasonably possible that the estimate of the loss could change based on the progression of the case, including the appeal\ns process.  If information were to become available that would allow us to reasonably estimate a range of potential exposure in an amount higher or lower than the amount already accrued, we would adjust our accrued liabilities accordingly.  While Phillips 66 Company believes the jury verdict is not legally or factually supported and intends to pursue post-judgment remedies and file an appeal, there can be no assurances that such defense efforts will be successful.  Until the final resolution of this matter, we may be exposed to losses in excess of the amount recorded, and such amounts may have a material adverse effect on our financial position.\nEnvironmental\nLike other companies in our industry, we are subject to numerous international, federal, state and local environmental laws and regulations.  For a discussion of the most significant international and federal environmental laws and regulations to which we are subject, see the “Environmental” section in Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2024 Annual Report on Form 10-K.\nWe are required to purchase Renewable Identification Numbers (RINs) in the open market to satisfy the portion of our obligation under the Renewable Fuel Standard (RFS) that is not fulfilled by blending renewable fuels into the motor fuels we produce.  For the nine months ended September 30, 2025, we were able to fully satisfy our obligations under the RFS through producing and blending renewable fuels into the motor fuel we produce.  For the nine months ended September 30, 2024, we incurred expenses of $23 million associated with our obligation to purchase RINs in the open market to comply with the RFS for our wholly owned refineries.  These expenses are included within the “Purchased crude oil and products” line item on our consolidated statement of income.  Our jointly owned refineries also incurred expenses associated with the purchase of RINs in the open market, of which our share was $280 million and $180 million for the nine months ended September 30, 2025 and 2024, respectively.  These expenses are included within the “Equity in earnings of affiliates” line item on our consolidated statement of income.  The amount of these expenses and fluctuations between periods is primarily driven by the market price of RINs, refinery and renewable fuels production, blending activities and renewable volume obligation requirements.\n67\nTable of Contents\nWe occasionally receive requests for information or notices of potential liability from the Environmental Protection Agency (EPA) and state environmental agencies alleging that we are a potentially responsible party under the Federal Comprehensive Environmental Response, Compensation and Liability Act (CERCLA) or an equivalent state statute.  On occasion, we also have been made a party to cost recovery litigation by those agencies or by private parties.  These requests, notices and lawsuits assert potential liability for remediation costs at various sites that typically are not owned by us, but allegedly contain wastes attributable to our past operations.  At June 30, 2025, we reported that we had been notified of potential liability under CERCLA and comparable state laws at 17 sites within the United States and Puerto Rico.  There were no changes reported during the third quarter of 2025, thus, leaving 17 unresolved sites with potential liability at September 30, 2025.  \nNotwithstanding any of the foregoing, and as with other companies engaged in similar businesses, environmental costs and liabilities are inherent concerns in certain of our operations and products, and there can be no assurance that those costs and liabilities will not be material.  However, we currently do not expect any material adverse effect on our results of operations or financial position as a result of compliance with current environmental laws and regulations.\nClimate Change\nThere has been a broad range of proposed or promulgated state, national and international laws focusing on greenhouse gas (GHG) emissions reduction, including various regulations proposed or issued by the EPA.  These proposed or promulgated laws apply or could apply in states and/or countries where we have interests or may have interests in the future.  Laws regulating GHG emissions continue to evolve, and while it is not possible to accurately estimate either a timetable for implementation or our future compliance costs relating to implementation, such laws potentially could have a material impact on our results of operations and financial condition as a result of increasing costs of compliance, lengthening project implementation and agency reviews or reducing demand for certain hydrocarbon products.  \nFor examples of legislation and regulation or precursors for possible regulation that do or could affect our operations, see the “Climate Change” section in Management’s Discussion and Analysis of Financial Condition and Results of Operations in our 2024 Annual Report on Form 10-K.\nWe consider and take into account anticipated future GHG emissions in designing and developing major facilities and projects, and we implement energy efficiency initiatives to reduce GHG emissions.  Data on our GHG emissions, legal requirements regulating such emissions and the possible physical effects of climate change on our coastal assets are incorporated into our planning, investment and risk management decision-making.  We are working to continuously improve operational and energy efficiency through resource and energy conservation efforts throughout our operations.\n68\nTable of Contents\nGUARANTOR FINANCIAL INFORMATION \nWe have various cross guarantees between Phillips 66 and its wholly owned subsidiary Phillips 66 Company (together, the Obligor Group) with respect to publicly held debt securities.  Phillips 66 conducts substantially all of its operations through subsidiaries, including Phillips 66 Company, and those subsidiaries generate substantially all of its operating income and cash flow.  Phillips 66 has fully and unconditionally guaranteed the payment obligations of Phillips 66 Company with respect to its publicly held debt securities.  In addition, Phillips 66 Company has fully and unconditionally guaranteed the payment obligations of Phillips 66 with respect to its publicly held debt securities.  All guarantees are full and unconditional.  At September 30, 2025, $16.4 billion of publicly held debt securities has been guaranteed by the Obligor Group.\nSummarized financial information of the Obligor Group is presented on a combined basis.  Intercompany transactions among the members of the Obligor Group have been eliminated.  The financial information of non-guarantor subsidiaries has been excluded from the summarized financial information.  Significant intercompany transactions and receivable/payable balances between the Obligor Group and non-guarantor subsidiaries are presented separately in the summarized financial information.\n69\nTable of Contents\nThe summarized results of operations for the nine months ended September 30, 2025, and the summarized financial position at September 30, 2025, and December 31, 2024, for the Obligor Group on a combined basis were:\nSummarized Combined Statement of Loss\nMillions of Dollars\nNine Months Ended September 30, 2025\nSales and other operating revenues\n$\n71,822\n \nRevenues and other income—non-guarantor subsidiaries\n7,936\n \nPurchased crude oil and products—third parties\n42,018\n \nPurchased crude oil and products—related parties\n12,340\n \nPurchased crude oil and products—non-guarantor subsidiaries\n19,605\n \nLoss before income taxes\n(2,453)\nNet loss\n(1,926)\nSummarized Combined Balance Sheet\nMillions of Dollars\nSeptember 30\n2025\nDecember 31 \n2024\nAccounts and notes receivable—third parties\n$\n768\n \n1,229 \nAccounts and notes receivable—related parties\n1,309\n \n1,422 \nDue from non-guarantor subsidiaries, current\n2,173\n \n3,102 \nTotal current assets*\n11,375\n \n10,228 \nInvestments and long-term receivables \n9,770\n \n10,640 \nNet properties, plants and equipment\n11,144\n \n12,186 \nGoodwill\n906\n \n1,047 \nDue from non-guarantor subsidiaries, noncurrent\n326\n \n1,171 \nOther assets associated with non-guarantor subsidiaries\n1,057\n \n1,306 \nTotal noncurrent assets\n25,648\n \n28,380 \nTotal assets\n37,023\n \n38,608 \nDue to non-guarantor subsidiaries, current\n$\n5,583\n \n5,398 \nTotal current liabilities\n15,618\n \n14,236 \nLong-term debt\n15,911\n \n14,969 \nDue to non-guarantor subsidiaries, noncurrent \n8,560\n \n8,319 \nTotal noncurrent liabilities\n31,382\n \n29,640 \nTotal liabilities\n47,000\n \n43,876 \nTotal equity\n(9,977)\n(5,268)\nTotal liabilities and equity\n37,023\n \n38,608 \n* Includes goodwill and intangibles held in Assets held for sale related to the Germany and Austria Marketing pending divestiture, see Note 23—Assets Held for Sale, in the Notes to Consolidated Financial Statements for additional information. \n70\nTable of Contents\nNON-GAAP RECONCILIATIONS\nRefining\nOur realized refining margins measure the difference between (a) sales and other operating revenues derived from the sale of petroleum products manufactured at our refineries and (b) costs of feedstocks, primarily crude oil, used to produce the petroleum products.  The realized refining margins are adjusted to include our proportional share of our joint venture refineries’ realized margins, as well as to exclude those items that are not representative of the underlying operating performance of a period, which we call “special items.”  The realized refining margins are converted to a per-barrel basis by dividing them by total refinery processed inputs (primarily crude oil) measured on a barrel basis, including our share of inputs processed by our joint venture refineries.  Our realized refining margin per barrel is intended to be comparable with industry refining margins, which are known as “crack spreads.”  As discussed in “Executive Overview and Business Environment—Business Environment,” industry crack spreads measure the difference between market prices for refined petroleum products and crude oil.  We believe realized refining margin per barrel calculated on a similar basis as industry crack spreads provides a useful measure of how well we performed relative to benchmark industry refining margins.\nThe GAAP performance measure most directly comparable to realized refining margin per barrel is the Refining segment’s “income (loss) before income taxes per barrel.”  Realized refining margin per barrel excludes items that are typically included in a manufacturer’s gross margin, such as depreciation and operating expenses and other items used to determine income (loss) before income taxes, such as general and administrative expenses.  It also includes our proportional share of joint venture refineries’ realized refining margins and excludes special items.  Because realized refining margin per barrel is calculated in this manner, and because realized refining margin per barrel may be defined differently by other companies in our industry, it has limitations as an analytical tool.  Following are reconciliations of income (loss) before income taxes to realized refining margins:\n71\nTable of Contents\nMillions of Dollars, Except as Indicated\nRealized Refining Margins\nAtlantic Basin/\nEurope\nGulf\nCoast\nCentral\nCorridor\nWest\nCoast\nWorldwide\nThree Months Ended September 30, 2025\nIncome (loss) before income taxes\n$\n250\n \n119\n \n(580)\n(307)\n(518)\nPlus:\nTaxes other than income taxes\n17\n \n26\n \n26\n \n21\n \n90\n \nDepreciation, amortization and impairments\n56\n \n66\n \n992\n \n281\n \n1,395\n \nSelling, general and administrative expenses\n7\n \n7\n \n18\n \n8\n \n40\n \nOperating expenses\n249\n \n256\n \n162\n \n242\n \n909\n \nEquity in (earnings) losses of affiliates\n2\n \n—\n \n(33)\n—\n \n(31)\nOther segment (income) expense, net\n(1)\n—\n \n1\n \n7\n \n7\n \nProportional share of refining gross margins contributed by equity affiliates\n24\n \n—\n \n238\n \n—\n \n262\n \nRealized refining margins\n$\n604\n \n474\n \n824\n \n252\n \n2,154\n \nTotal processed inputs (\nthousands of barrels\n)\n50,624\n \n54,239\n \n28,113\n \n20,403\n \n153,379\n \nAdjusted total processed inputs (\nthousands of barrels\n)*\n50,624\n \n54,239\n \n52,127\n \n20,403\n \n177,393\n \nIncome (loss) before income taxes per barrel (\ndollars per \n   barrel\n)**\n$\n4.94\n \n2.19\n \n(20.61)\n(15.06)\n(3.38)\nRealized refining margins (\ndollars per barrel\n)***\n11.94\n \n8.74\n \n15.82\n \n12.31\n \n12.15\n \nThree Months Ended September 30, 2024\nIncome (loss) before income taxes\n$\n(61)\n(102)\n308 \n(253)\n(108)\nPlus:\nTaxes other than income taxes\n24 \n26 \n27 \n23 \n100 \nDepreciation, amortization and impairments\n53 \n69 \n41 \n67 \n230 \nSelling, general and administrative expenses\n14 \n8 \n27 \n11 \n60 \nOperating expenses\n253 \n304 \n124 \n241 \n922 \nEquity in (earnings) losses of affiliates\n2 \n(1)\n11 \n— \n12 \nOther segment (income) expense, net\n(25)\n6 \n8 \n7 \n(4)\nProportional share of refining gross margins contributed by equity affiliates\n21 \n— \n172 \n— \n193 \nRealized refining margins\n$\n281 \n310 \n718 \n96 \n1,405 \nTotal processed inputs (\nthousands of barrels\n)\n47,819 \n48,609 \n27,025 \n21,987 \n145,440 \nAdjusted total processed inputs (\nthousands of barrels\n)*\n47,819 \n48,609 \n50,536 \n21,987 \n168,951 \nIncome (loss) before income taxes per barrel (\ndollars per barrel\n)**\n$\n(1.27)\n(2.10)\n11.38 \n(11.51)\n(0.74)\nRealized refining margins (\ndollars per barrel\n)***\n5.87 \n6.39 \n14.19 \n4.34 \n8.31 \n    * Adjusted total processed inputs include our proportional share of processed inputs of an equity affiliate.\n  ** Income (loss) before income taxes divided by total processed inputs. \n*** Realized refining margins per barrel, as presented, are calculated using the underlying realized refining margin amounts, in dollars, divided by adjusted total processed inputs, in barrels.  As such, recalculated per barrel amounts using the rounded margins and barrels presented may differ from the presented per barrel amounts. \n72\nTable of Contents\nMillions of Dollars, Except as Indicated\nRealized Refining Margins\nAtlantic Basin/\nEurope\nGulf\nCoast\nCentral \nCorridor\nWest\nCoast\nWorldwide\nNine Months Ended September 30, 2025\nIncome (loss) before income taxes\n$\n100\n \n(113)\n(238)\n(845)\n(1,096)\nPlus:\nTaxes other than income taxes\n59\n \n85\n \n77\n \n73\n \n294\n \nDepreciation, amortization and impairments\n165\n \n205\n \n1,077\n \n851\n \n2,298\n \nSelling, general and administrative expenses\n21\n \n21\n \n54\n \n22\n \n118\n \nOperating expenses\n903\n \n894\n \n456\n \n578\n \n2,831\n \nEquity in losses of affiliates\n6\n \n—\n \n70\n \n—\n \n76\n \nOther segment (income) expense, net\n(40)\n1\n \n(39)\n33\n \n(45)\nProportional share of refining gross margins contributed by equity affiliates\n67\n \n—\n \n570\n \n—\n \n637\n \nRealized refining margins\n$\n1,281\n \n1,093\n \n2,027\n \n712\n \n5,113\n \nTotal processed inputs (\nthousands of barrels\n)\n138,610\n \n143,556\n \n83,992\n \n63,679\n \n429,837\n \nAdjusted total processed inputs (\nthousands of barrels\n)*\n138,610\n \n143,556\n \n151,879\n \n63,679\n \n497,724\n \nIncome (loss) before income taxes per barrel (\ndollars per barrel\n)**\n$\n0.72\n \n(0.79)\n(2.82)\n(13.28)\n(2.55)\nRealized refining margins (\ndollars per barrel\n)***\n9.24\n \n7.61\n \n13.35\n \n11.17\n \n10.27\n \nNine Months Ended September 30, 2024\nIncome (loss) before income taxes\n$\n32 \n60 \n764 \n(446)\n410 \nPlus:\nTaxes other than income taxes\n63 \n83 \n77 \n72 \n295 \nDepreciation, amortization and impairments\n156 \n195 \n129 \n267 \n747 \nSelling, general and administrative expenses\n29 \n23 \n76 \n21 \n149 \nOperating expenses\n768 \n874 \n409 \n708 \n2,759 \nEquity in (earnings) losses of affiliates\n5 \n(2)\n(132)\n— \n(129)\nOther segment (income) expense, net\n6 \n8 \n(54)\n5 \n(35)\nProportional share of refining gross margins contributed by equity affiliates\n86 \n— \n698 \n— \n784 \nSpecial items:\nLegal settlement\n— \n(7)\n— \n— \n(7)\nRealized refining margins\n$\n1,145 \n1,234 \n1,967 \n627 \n4,973 \nTotal processed inputs (\nthousands of barrels\n)\n145,275 \n147,305 \n80,677 \n67,179 \n440,436 \nAdjusted total processed inputs (\nthousands of barrels\n)*\n145,275 \n147,305 \n149,253 \n67,179 \n509,012 \nIncome (loss) before income taxes per barrel (\ndollars per barrel\n)**\n$\n0.22 \n0.41 \n9.47 \n(6.64)\n0.93 \nRealized refining margins (\ndollars per barrel\n)***\n7.88 \n8.38 \n13.18 \n9.33 \n9.77 \n    * Adjusted total processed inputs include our proportional share of processed inputs of an equity affiliate.\n  ** Income (loss) before income taxes divided by total processed inputs. \n*** Realized refining margins per barrel, as presented, are calculated using the underlying realized refining margin amounts, in dollars, divided by adjusted total processed inputs, in barrels.  As such, recalculated per barrel amounts using the rounded margins and barrels presented may differ from the presented per barrel amounts. \n73\nTable of Contents\nMarketing\nOur realized marketing fuel margins measure the difference between (a) sales and other operating revenues derived from the sale of fuels in our M&S segment and (b) costs of those fuels.  The realized marketing fuel margins are adjusted to exclude those items that are not representative of the underlying operating performance of a period, which we call “special items.”  The realized marketing fuel margins are converted to a per-barrel basis by dividing them by sales volumes measured on a barrel basis.  We believe realized marketing fuel margin per barrel demonstrates the value uplift our marketing operations provide by optimizing the placement and ultimate sale of our facilities’ fuel production. \nWithin the M&S segment, the GAAP performance measure most directly comparable to realized marketing fuel margin per barrel is the marketing business’ “income before income taxes per barrel.”  Realized marketing fuel margin per barrel excludes items that are typically included in gross margin, such as depreciation and operating expenses, and other items used to determine income before income taxes, such as general and administrative expenses.  Because realized marketing fuel margin per barrel excludes these items, and because realized marketing fuel margin per barrel may be defined differently by other companies in our industry, it has limitations as an analytical tool.  Following are reconciliations of income before income taxes to realized marketing fuel margins:\nMillions of Dollars, Except as Indicated\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nU.S.\nInternational\nU.S.\nInternational\nRealized Marketing Fuel Margins\nIncome (loss) before income taxes\n$\n34\n \n155\n \n(262)\n143 \nPlus:\nDepreciation and amortization\n11\n \n5\n \n9 \n20 \nSelling, general and administrative expenses\n460\n \n63\n \n823 \n64 \nEquity in earnings of affiliates\n(13)\n(1)\n(10)\n(30)\nOther operating revenues*\n(129)\n(9)\n(127)\n(11)\nOther expense, net\n13\n \n—\n \n14 \n2 \nSpecial items:\nNet gain on asset disposition\n—\n \n(15)\n—\n \n—\n \nMarketing margins\n376\n \n198\n \n447 \n188 \nLess: margin for nonfuel related sales\n—\n \n15\n \n— \n14 \nRealized marketing fuel margins\n$\n376\n \n183\n \n447 \n174 \nTotal fuel sales volumes (\nthousands of barrels\n)\n184,435\n \n34,035\n \n182,823 \n28,207 \nIncome (loss) before income taxes per barrel (\ndollars per barrel\n)\n$\n0.18\n \n4.55\n \n(1.43)\n5.07 \nRealized marketing fuel margins (\ndollars per barrel\n)**\n2.04\n \n5.37\n \n2.45\n6.19 \n* Includes other nonfuel revenues.\n** Realized marketing fuel margins per barrel, as presented, are calculated using the underlying realized marketing fuel margin amounts, in dollars, divided by sales volumes, in barrels.  As such, recalculated per barrel amounts using the rounded margins and barrels presented may differ from the presented per barrel amounts.\n74\nTable of Contents\nMillions of Dollars, Except as Indicated\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nU.S.\nInternational\nU.S.\nInternational\nRealized Marketing Fuel Margins\nIncome before income taxes\n$\n574\n \n1,328\n \n203 \n369 \nPlus:\nDepreciation and amortization\n36\n \n20\n \n28 \n56 \nSelling, general and administrative expenses\n865\n \n200\n \n1,226 \n191 \nEquity in earnings of affiliates\n(31)\n(10)\n(24)\n(83)\nOther operating revenues*\n(355)\n(29)\n(358)\n(26)\nOther expense, net\n34\n \n3\n \n39 \n15 \nSpecial items:\nNet gain on asset dispositions\n—\n \n(943)\n— \n— \nLegal settlement\n—\n \n—\n \n(59)\n— \nMarketing margins\n1,123\n \n569\n \n1,055 \n522 \nLess: margin for nonfuel related sales\n—\n \n47\n \n— \n43 \nRealized marketing fuel margins\n$\n1,123\n \n522\n \n1,055 \n479 \nTotal fuel sales volumes (\nthousands of barrels\n)\n533,525\n \n90,606\n \n550,490 \n84,690 \nIncome before income taxes per barrel (\ndollars per barrel\n)\n$\n1.08\n \n14.66\n \n0.37 \n4.36 \nRealized marketing fuel margins (\ndollars per barrel\n)**\n2.10\n \n5.76\n \n1.92 \n5.66 \n* Includes other nonfuel revenues.\n  ** Realized marketing fuel margins per barrel, as presented, are calculated using the underlying realized marketing fuel margin amounts, in dollars, divided by sales volumes, in barrels.  As such, recalculated per barrel amounts using the rounded margins and barrels presented may differ from the presented per barrel amounts.\n75\nTable of Contents\nCAUTIONARY STATEMENT FOR THE PURPOSES OF THE “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nThis report includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the Act).  You can normally identify our forward-looking statements by the words “anticipate,” “estimate,” “believe,” “budget,” “continue,” “could,” “intend,” “may,” “plan,” “potential,” “predict,” “seek,” “should,” “will,” “would,” “expect,” “objective,” “projection,” “forecast,” “goal,” “guidance,” “outlook,” “effort,” “target,” “priorities” and similar expressions that convey the prospective nature of events or outcomes, but the absence of such words does not mean a statement is not forward-looking.\nWe based these forward-looking statements on our current expectations, estimates and projections about us, our operations, our joint ventures and entities in which we have equity interests, as well as the industries in which we and they operate and our sustainability-related plans and goals.  We caution you not to place undue reliance on these forward-looking statements, which speak only as of the date of this report, as they are not guarantees of future performance and involve assumptions that, while made in good faith, may prove to be incorrect and involve risks and uncertainties we cannot predict.  In addition, we based many of these forward-looking statements on assumptions about future events that may prove to be inaccurate.  Accordingly, our actual outcomes and results may differ materially from what we have expressed or forecasted in any forward-looking statement.  Our sustainability-related goals are not guarantees or promises and may change.  Statements regarding our goals are not guarantees or promises that they will be met.  The information included in, and any issues identified as material for purposes of, our sustainability reports shall not be considered material for U.S. Securities and Exchange Commission reporting purposes.  Factors that could cause actual results to differ materially from those in our forward-looking statements include: \n•\nFluctuations in market conditions and demand impacting the prices of NGL, crude oil, refined petroleum products, renewable fuels, renewable feedstocks and natural gas prices and changes in refined product, marketing and petrochemical margins.\n•\nChanges in governmental policies relating to NGL, crude oil, natural gas, refined petroleum or renewable fuels products pricing, regulation or taxation, including exports.\n•\nCapacity constraints in, or other limitations on, the pipelines, storage and fractionation facilities to which we deliver natural gas or NGL and the availability of alternative markets and arrangements for our natural gas and NGL.\n•\nActions taken by Organization of the Petroleum Exporting Countries (OPEC) and non-OPEC oil producing countries impacting crude oil production and correspondingly, commodity prices.\n•\nUnexpected changes in costs or technical requirements for constructing, modifying or operating our facilities or transporting our products.\n•\nUnexpected technological or commercial difficulties in manufacturing, refining or transporting our products, including chemical products.\n•\nChanges in the cost or availability of adequate and reliable transportation for our NGL, crude oil, natural gas and refined petroleum and renewable fuels products.\n•\nThe level and success of producers’ drilling plans and the amount and quality of production volumes around our midstream assets.\n•\nOur ability to timely obtain or maintain permits, including those necessary for capital projects.\n•\nOur ability to comply with government regulations or make capital expenditures required to maintain compliance.\n•\nOur ability to realize sustained savings and cost reductions from the company’s business transformation initiatives.\n•\nChanges to government policies relating to renewable fuels, climate change and GHG emissions that adversely affect programs like the renewable fuel standards program, low carbon fuel standards and tax credits for biofuels.\n•\nDomestic and international economic and political developments including armed hostilities, such as the war in Eastern Europe, instability in the financial services and banking sector, excess inflation, expropriation of assets and changes in fiscal policy, including interest rates.\n76\nTable of Contents\n•\nThe impact on commercial activity and demand for our products from any widespread public health crisis, as well as the extent and duration of recovery of economies and demand for our products following any such crisis.\n•\nFailure to complete definitive agreements and feasibility studies for, and to complete construction of, announced and future capital projects on time and within budget.\n•\nOur ability to successfully complete, or any material delay in the completion of, any asset dispositions, acquisitions, shutdowns or conversions that we may pursue, including the receipt of any necessary regulatory approvals or permits related to such action. \n•\nPotential disruption or interruption of our operations or those of our joint ventures due to litigation or governmental or regulatory action. \n•\nDamage to our facilities due to accidents, weather and climate events, civil unrest, insurrections, political events, terrorism or cyberattacks.\n•\nOur sustainability goals, including reducing our GHG emissions intensity, developing and protecting new technologies and commercializing lower-carbon opportunities.\n•\nFailure of new products and services to achieve market acceptance.\n•\nInternational monetary conditions and exchange controls.\n•\nSubstantial investments required, or reduced demand for products, as a result of existing or future environmental rules and regulations, including GHG emissions reductions and reduced consumer demand for refined petroleum products.\n•\nLiability resulting from pending or future litigation or other legal proceedings.\n•\nLiability for remedial actions, including removal and reclamation obligations under environmental regulations.\n•\nChanges in tax, environmental and other laws and regulations (including alternative energy mandates) applicable to our business.\n•\nEconomic, political and regulatory conditions domestically and internationally, including imposition of tariffs or other tax incentives or disincentives.\n•\nPolitical and societal concerns about climate change that could result in changes to our business or operations or increase expenditures, including litigation-related expenses.\n•\nChanges in estimates or projections used to assess fair value of intangible assets, goodwill and properties, plants and equipment and/or strategic decisions or other developments with respect to our asset portfolio that cause impairment charges.\n•\nLimited access to capital or significantly higher cost of capital related to changes to our credit profile or illiquidity or uncertainty in the domestic or international financial markets.\n•\nThe creditworthiness of our customers and the counterparties to our transactions, including the impact of bankruptcies. \n•\nCybersecurity incidents or other disruptions that compromise our information and expose us to liability.\n•\nThe operation, financing and distribution decisions of our joint ventures that we do not control.\n•\nThe potential impact of activist shareholder actions or tactics. \n•\nThe factors generally described in Item 1A.—Risk Factors in our 2024 Annual Report on Form 10-K.\n77\nTable of Contents"
}