{
  "source_file": "pwr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nGeneral\nThe following discussion and analysis of the financial condition and results of operations of Quanta Services, Inc. (together with its subsidiaries, Quanta, we, us or our) should be read in conjunction with our condensed consolidated financial statements and related notes included elsewhere in this Quarterly Report and with our 2024 Annual Report, which was filed with the SEC on February 20, 2025 and is available on the SEC’s website at \nwww.sec.gov\n and on our website at \nwww.quantaservices.com\n. The discussion below contains forward-looking statements that are based upon our current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from these expectations due to inaccurate assumptions and known or unknown risks and uncertainties, including those identified in \nCautionary Statement About Forward-Looking Statements and Information\n above, in Item 1A. \nRisk Factors \nof Part II of this Quarterly Report and in Item 1A. \nRisk Factors\n in Part I of our 2024 Annual Report.\nDuring the three months ended March 31, 2025, our Chief Executive Officer reevaluated how performance of the business is assessed and how resources are allocated, which resulted in a change in the reporting of management’s internal financial information. As a result, beginning with the three months ended March 31, 2025, we began reporting the results of our two operating segments, which are also our two reportable segments: (1) Electric Infrastructure Solutions (Electric) and (2) Underground Utility and Infrastructure Solutions (Underground and Infrastructure). The Electric segment consists of the historical Electric Power Infrastructure Solutions and the Renewable Energy Infrastructure Solutions segments. In conjunction with this change, certain prior period amounts have been recast to conform to this new segment reporting structure.\nOverview \nOur 2025 results reflect increased demand for our services, as consolidated revenues and operating income increased as compared to 2024, with increased revenues and operating income in both our Electric and Underground and Infrastructure segments. \nWith respect to our Electric segment, utilities are continuing to invest significant capital in their electric power delivery systems through multi-year grid modernization and reliability programs, as well as system upgrades and hardening programs in response to recurring severe weather events. We have also experienced high demand for new and expanded transmission, substation and distribution infrastructure needed to reliably transport power. In particular, we continue to experience strong demand from our utility customers, which we believe is driven by increasing demand for electricity associated with, among other things, data centers and other technology-related dynamics, domestic manufacturing reshoring initiatives and overall electrification trends. Our acquisition of Cupertino Electric Inc. (CEI) during 2024 also resulted in increased demand for our critical path electrical design and installation solutions from the technology and data center industry, as well as our utility scale solar and battery storage solutions. The cost-effectiveness of solar, wind energy and battery storage, combined with a meaningful increase in current and forecasted electricity demand is continuing to drive demand for renewable generation and related infrastructure (e.g., high-voltage electric transmission and substation infrastructure and battery storage), as well as interconnection services necessary to connect and transmit renewable-generated electricity to existing electric power delivery systems. Despite these positive longer-term trends, in the past, supply chain challenges, policy and regulatory uncertainty and other factors have resulted in project delays and increased project costs and could negatively impact future periods.\nWith respect to our Underground and Infrastructure segment, we continue to believe the market for our industrial solutions and gas utility and pipeline integrity services remains solid given the recurring critical-path maintenance requirements and regulated spend dedicated to modernizing systems, reducing methane emissions, ensuring environmental compliance and improving safety and reliability. However, revenues associated with large pipeline projects have fluctuated in recent years, and we anticipate that revenues associated with these projects will continue to fluctuate. Additionally, our acquisition of Dynamic Systems (DSI), LLC (Dynamic Systems) during the three months ended September 30, 2025 expanded our capabilities and solutions related to turnkey mechanical, plumbing and process infrastructure solutions. We see strong demand for these services by data center, manufacturing, semiconductor and other large load facilities and believe there are also opportunities to provide these services to other core end markets. \nDuring the nine months ended September 30, 2025, increased revenues and operating income contributed to $1.10 billion of net cash provided by operating activities, which was a 19% decrease compared to the nine months ended September 30, 2024. This cash provided by operating activities, along with borrowings under our credit facility and commercial paper program and issuance of senior notes described below, allowed us to execute our business plan, including the strategic acquisitions of certain businesses and investments in unconsolidated affiliates, for which we utilized $1.93 billion of cash; repurchases of $134.6 million of common stock, and payments of $45.4 million in dividends associated with our common stock. Additionally, as of September 30, 2025, available commitments under our senior credit facility, combined with our cash and cash equivalents, totaled $3.34 billion.\n 33 \n \nIn August 2025, we issued $1.50 billion aggregate principal amount of senior notes and received net proceeds of $1.48 billion, net of the original issue discount, underwriting discounts and deferred financing costs, and used the proceeds to repay certain outstanding borrowings. Our debt financing arrangements are more fully described in Note 8 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report.\nWe expect the strong demand for our services will continue. Our remaining performance obligations and backlog were $20.97 billion and $39.17 billion as of September 30, 2025, representing increases of 25.1% and 13.4% relative to December 31, 2024. For a reconciliation of backlog to remaining performance obligations, the most comparable financial measure prepared in conformity with generally accepted accounting principles in the United States (GAAP), see \nNon-GAAP Financial Measures\n below. \nSignificant Factors Impacting Results\nOur revenues, profit, margins and other results of operations can be influenced by a variety of factors in any given period, including those described in Item 1. \nBusiness \nand Item 1A. \nRisk Factors\n of Part I in our 2024 Annual Report, and those factors have caused fluctuations in our results in the past and are expected to cause fluctuations in our results in the future. Additional information with respect to certain of those factors is provided below.\nSeasonality. \nTypically, our revenues are lowest in the first quarter of the year because cold, snowy or wet conditions can create challenging working environments that are more costly for our customers or cause delays on projects. In addition, infrastructure projects often do not begin in a meaningful way until our customers finalize their capital budgets, which typically occurs during the first quarter. Second quarter revenues are typically higher than those in the first quarter, as some projects begin, but continued cold and wet weather can often impact productivity. Third and fourth quarter revenues are typically the highest of the year, as a greater number of projects are underway and operating conditions, including weather, are normally more accommodating. During the fourth quarter projects are often completed and customers often seek to spend their capital budgets before year end. However, the holiday season and inclement weather can sometimes cause delays during the fourth quarter, reducing revenues and increasing costs. These seasonal impacts are typical for our U.S. operations, but seasonality for our international operations may differ. For example, revenues for certain projects in Canada are typically higher in the first quarter because projects are often accelerated in order to complete work while the ground is frozen and prior to the break up, or seasonal thaw, as productivity is adversely affected by wet ground conditions during warmer months. \nWeather, natural disasters and emergencies.\n The results of our business in a given period can be impacted by adverse weather conditions, severe weather events, natural disasters or other emergencies, which include, among other things, heavy or prolonged snowfall or rainfall, hurricanes, tropical storms, tornadoes, floods, blizzards, extreme temperatures, wildfires, post-wildfire floods and debris flows, pandemics and earthquakes. Climate change has the potential to increase the frequency and extremity of severe weather events. These conditions and events can negatively impact our financial results due to, among other things, the termination, deferral or delay of projects, reduced productivity and exposure to significant liabilities due to failure of electrical power or other infrastructure on which we have performed services. However, severe weather events can also increase our emergency restoration services, which typically yield higher margins due in part to higher equipment utilization and absorption of fixed costs. \nDemand for services\n. We perform the majority of our services under existing contracts, including MSAs and similar agreements pursuant to which our customers are not committed to specific volumes of our services. Therefore our volume of business can be positively or negatively affected by fluctuations in the amount of work our customers assign us in a given period, which may vary by geographic region. Examples of items that may cause demand for our services to fluctuate materially from quarter to quarter include: the financial condition of our customers, their capital spending and their access to and cost of capital; acceleration of any projects or programs by customers (e.g., modernization or hardening programs); economic and political conditions on a regional, national or global scale, including availability of renewable energy tax credits; interest rates; governmental regulations affecting the sourcing and costs of materials and equipment; other changes in U.S. and global trade relationships (e.g., tariffs, taxes); and project deferrals and cancellations. \nRevenue mix and impact on margins.\n The mix of revenues based on the types of services we provide in a given period will impact margins, as certain industries and services provide higher-margin opportunities. Our larger or more complex projects typically include, among others, transmission projects with higher voltage capacities; pipeline projects with larger-diameter throughput capacities; large-scale renewable generation projects; complex data center projects; and projects with increased engineering, design or construction complexities, more difficult terrain or geographical requirements, or longer distance requirements. These projects typically yield opportunities for higher margins than our recurring services under MSAs described above, as we assume a greater degree of performance risk and there is greater utilization of our resources for longer construction timeframes. However, larger projects are subject to additional risk of regulatory delay and cyclicality. Project schedules also fluctuate, particularly in connection with larger, more complex or longer-term projects, which can affect the \n 34 \n \namount of work performed in a given period. Furthermore, smaller or less complex projects typically have a greater number of companies competing for them, and competitors at times may more aggressively pursue available work. A greater percentage of smaller scale or less complex work also could negatively impact margins due to the inefficiency of transitioning between a greater number of smaller projects versus continuous production on fewer larger projects. As a result, at times we may choose to maintain a portion of our workforce and equipment in an underutilized capacity to ensure we are strategically positioned to deliver on larger projects when they move forward.\nProject variability and performance.\n Margins for a single project may fluctuate period to period due to changes in the volume or type of work performed, the pricing structure under the project contract or job productivity. Additionally, our productivity and performance on a project can vary period to period based on a number of factors, including unexpected project difficulties or site conditions (including in connection with difficult geographic characteristics); project location, including locations with challenging operating conditions; whether the work is on an open or encumbered right of way; inclement weather or severe weather events; environmental restrictions or regulatory delays; protests, public activism, other political activity or legal challenges related to a project; and the performance of third parties. Moreover, we currently generate a significant portion of our revenues under fixed price contracts, and fixed price contracts are more common in connection with our larger and more complex projects that typically involve greater performance risk. Under these contracts, we assume risks related to project estimates and execution, and project revenues can vary, sometimes substantially, from our original projections due to a variety of factors, including the additional complexity, timing uncertainty or extended bidding, regulatory and permitting processes associated with these projects. These variations can result in a reduction in expected profit, the incurrence of losses on a project or the issuance of change orders and/or assertion of contract claims against customers. See \nContract Estimates and Changes in Estimates \nin Note 3 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report.\nSubcontract work and provision of materials.\n Work that is subcontracted to other service providers generally yields lower margins, and therefore an increase in subcontract work in a given period can decrease operating margins. In recent years, we have subcontracted approximately 20% of our work to other service providers. Additionally, under certain contracts, including contracts for engineering, procurement and construction services, we agree to procure all or part of the required materials. While we attempt to structure our agreements with customers and suppliers to account for the impact of increased materials procurement requirements or fluctuations in the cost of materials we procure, our margins may be lower on projects where we furnish a significant amount of materials, as our markup on materials is generally lower than our markup on labor costs, and in a given period an increase in the percentage of work with greater materials procurement requirements may decrease our overall margins, including in some cases our assuming price risk. Furthermore, fluctuations in the price or availability of materials, equipment and consumables that we or our customers utilize could impact costs to complete projects. \n 35 \n \nResults of Operations\nConsolidated Results\nThree months ended September 30, 2025 compared to the three months ended September 30, 2024\nThe following table sets forth selected statements of operations data, such data as a percentage of revenues for the periods indicated, as well as the dollar and percentage change from the prior period (dollars in thousands). \nThree Months Ended September 30,\nChange\n2025\n2024\n$\n%\nRevenues\n$\n7,631,408 \n100.0 \n%\n$\n6,493,167 \n100.0 \n%\n$\n1,138,241 \n17.5 \n%\nCost of services \n6,414,974 \n84.1 \n5,480,597 \n84.4 \n934,377 \n17.0 \n%\nGross profit\n1,216,434 \n15.9 \n1,012,570 \n15.6 \n203,864 \n20.1 \n%\nEquity in earnings of integral unconsolidated affiliates\n13,731 \n0.2 \n14,015 \n0.2 \n(284)\n(2.0)\n%\nSelling, general and administrative expenses\n(572,950)\n(7.5)\n(483,878)\n(7.5)\n(89,072)\n18.4 \n%\nAmortization of intangible assets\n(133,195)\n(1.7)\n(110,422)\n(1.7)\n(22,773)\n20.6 \n%\nChange in fair value of contingent consideration liabilities\n(6,803)\n(0.1)\n(1,124)\n— \n(5,679)\n505.2 \n%\nOperating income\n517,217 \n6.8 \n431,161 \n6.6 \n86,056 \n20.0 \n%\nInterest and other financing expenses\n(71,806)\n(0.9)\n(59,950)\n(0.9)\n(11,856)\n19.8 \n%\nInterest income\n3,722 \n— \n7,237 \n0.1 \n(3,515)\n(48.6)\n%\nOther income, net\n13,311 \n0.2 \n2,994 \n0.1 \n10,317 \n344.6 \n%\nIncome before income taxes\n462,444 \n6.1 \n381,442 \n5.9 \n81,002 \n21.2 \n%\nProvision for income taxes\n119,605 \n1.6 \n82,421 \n1.3 \n37,184 \n45.1 \n%\nNet income\n342,839 \n4.5 \n299,021 \n4.6 \n43,818 \n14.7 \n%\nLess: Net income attributable to non-controlling interests\n3,419 \n0.1 \n5,836 \n0.1 \n(2,417)\n(41.4)\n%\nNet income attributable to common stock\n$\n339,420 \n4.4 \n%\n$\n293,185 \n4.5 \n%\n$\n46,235 \n15.8 \n%\nRevenues.\n Revenues increased due to a $938.1 million increase in revenues from our Electric segment and a $200.1 million increase in revenues from our Underground and Infrastructure segment. See \nSegment Results \nbelow for additional information and discussion related to segment revenues.\nCost of services.\n Costs of services primarily includes wages, benefits, subcontractor costs, materials, equipment, and other direct and indirect costs, including related depreciation. The increase in cost of services generally correlates to the increase in revenues.\nSelling, general and administrative expenses. \nThe increase was primarily attributable to $45.3 million related to recently acquired businesses and a $24.9 million increase in acquisition and integration costs.\nAmortization of intangible assets.\n The increase was related to incremental amortization expense associated with acquisitions since September 2024, primarily the acquisition of Dynamic Systems.\nOperating income.\n Operating income was positively impacted by a $127.8 million increase in operating income for our Electric segment and a $28.3 million increase in operating income for our Underground and Infrastructure segment, partially offset by a $70.0 million increase in corporate and non-allocated costs, which includes amortization expense. Results for each of our business segments and our corporate and non-allocated costs are discussed in \nSegment Results\n below. \nInterest and other financing expenses.\n The majority of the increase resulted from higher levels of principal on fixed rate debt balances as compared to the three months ended September 30, 2024. This increase resulted primarily from the issuance of $1.50 billion of aggregate principal amount of senior notes in August 2025 and $1.25 billion of aggregate principal amount of senior notes in August 2024, partially offset by the repayment of $500 million principal amount of senior notes in October 2024. \nProvision for income taxes\n. The effective income tax rates for the three months ended September 30, 2025 and 2024 were 25.9% and 21.6%. The higher effective tax rate for the three months ended September 30, 2025 was primarily due to a lower tax benefit from vested equity incentive awards. The impact was $14.3 million less benefit in the three months ended September 30, 2025 compared to the same period in the prior year.\n 36 \n \nComprehensive income attributable to common stock.\n See Statements of Comprehensive Income in Item 1. \nFinancial Statements \nof Part I of this Quarterly Report. Comprehensive income attributable to common stock increased by $1.3 million in the three months ended September 30, 2025 as compared to the three months ended September 30, 2024. The change in comprehensive income was primarily due to a $43.8 million increase in net income, offset by a $44.9 million decrease in foreign currency translation adjustments. The predominant functional currencies for our operations outside the U.S. are Canadian and Australian dollars. Foreign currency translation adjustment losses for the three months ended September 30, 2025 primarily resulted from the strengthening of the U.S. dollar against the Canadian dollar as of September 30, 2025 when compared to June 30, 2025.\nNine months ended September 30, 2025 compared to the nine months ended September 30, 2024\nThe following table sets forth selected statements of operations data, such data as a percentage of revenues for the periods indicated, as well as the dollar and percentage change from the prior period (dollars in thousands):\nNine Months Ended September 30,\nChange\n2025\n2024\n$\n%\nRevenues\n$\n20,637,749 \n100.0 \n%\n$\n17,119,373 \n100.0 \n%\n$\n3,518,376 \n20.6 \n%\nCost of services\n17,579,704 \n85.2 \n14,671,978 \n85.7 \n2,907,726 \n19.8 \n%\nGross profit\n3,058,045 \n14.8 \n2,447,395 \n14.3 \n610,650 \n25.0 \n%\nEquity in earnings of integral unconsolidated affiliates\n41,104 \n0.2 \n34,935 \n0.2 \n6,169 \n17.7 \n%\nSelling, general and administrative expenses\n(1,595,271)\n(7.7)\n(1,318,574)\n(7.7)\n(276,697)\n21.0 \n%\nAmortization of intangible assets\n(355,935)\n(1.7)\n(267,147)\n(1.6)\n(88,788)\n33.2 \n%\nChange in fair value of contingent consideration liabilities\n(21,363)\n(0.1)\n(2,864)\n— \n(18,499)\n645.9 \n%\nOperating income\n1,126,580 \n5.5 \n893,745 \n5.2 \n232,835 \n26.1 \n%\nInterest and other financing expenses\n(185,697)\n(0.9)\n(146,343)\n(0.9)\n(39,354)\n26.9 \n%\nInterest income\n11,345 \n0.1 \n18,817 \n0.1 \n(7,472)\n(39.7)\n%\nOther income, net\n17,688 \n— \n29,493 \n0.2 \n(11,805)\n(40.0)\n%\nIncome before income taxes\n969,916 \n4.7 \n795,712 \n4.6 \n174,204 \n21.9 \n%\nProvision for income taxes\n244,585 \n1.2 \n178,716 \n1.0 \n65,869 \n36.9 \n%\nNet income\n725,331 \n3.5 \n616,996 \n3.6 \n108,335 \n17.6 \n%\nLess: Net income attributable to non-controlling interests\n12,403 \n— \n17,292 \n0.1 \n(4,889)\n(28.3)\n%\nNet income attributable to common stock\n$\n712,928 \n3.5 \n%\n$\n599,704 \n3.5 \n%\n$\n113,224 \n18.9 \n%\nRevenues.\n Revenues increased due to a $2.94 billion increase in revenues from our Electric segment and a $575.8 million increase in revenues from our Underground and Infrastructure segment. See \nSegment Results \nbelow for additional information and discussion related to segment revenues.\nCost of services.\n Costs of services primarily includes wages, benefits, subcontractor costs, materials, equipment, and other direct and indirect costs, including related depreciation. The increase in cost of services generally correlates to the increase in revenues.\nSelling, general and administrative expenses.\n The increase was primarily attributable to $157.7 million related to recently acquired businesses and a $44.8 million increase in acquisition and integration costs. Also contributing to the increase was a $23.0 million increase in compensation expense, largely associated with increased incentive compensation due to increased levels of profitability.\nAmortization of intangible asse\nts. The increase was related to incremental amortization expense associated with acquisitions, primarily the acquisitions of Dynamic Systems and CEI.\nOperating income.\n Operating income was positively impacted by a $359.2 million increase in operating income for our Electric segment and a $67.3 million increase in operating income for our Underground and Infrastructure segment, partially offset by a $193.7 million increase in corporate and non-allocated costs, which includes amortization expense. Results for each of our business segments and corporate and non-allocated costs are discussed in \nSegment Results\n below. \n 37 \n \nInterest and other financing expenses.\n The majority of the increase resulted from higher levels of principal on fixed rate debt balances as compared to the nine months ended September 30, 2024. This increase resulted primarily from the issuance of $1.50 billion of aggregate principal amount of senior notes in August 2025 and $1.25 billion of aggregate principal amount of senior notes in August 2024, partially offset by the repayment of $500 million principal amount of senior notes in October 2024. \nOther income (expense), net.\n The decrease was primarily attributable to $16.4 million recognized in the nine months ended September 30, 2024 that resulted from the equity in earnings and a gain from the sale of an investment in a non-integral unconsolidated affiliate, $5.0 million of which was attributable to a non-controlling interest, as further described in Note 6 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report. \nProvision for income taxes.\n The effective income tax rates for the nine months ended September 30, 2025 and 2024 were 25.2% and 22.5%. The higher effective tax rate for the nine months ended September 30, 2025 was primarily due to a lower tax benefit from equity incentive awards. The impact was $22.0 million less benefit in the nine months ended September 30, 2025 compared to the same period in the prior year.\nComprehensive income attributable to common stock.\n See Statements of Comprehensive Income in Item 1. \nFinancial Statements \nof Part I of this Quarterly Report. Comprehensive income attributable to common stock increased by $182.1 million in the nine months ended September 30, 2025 as compared to the nine months ended September 30, 2024, primarily due to a $108.3 million increase in net income and a $68.4 million increase in foreign currency translation adjustments. The predominant functional currencies for our operations outside the U.S. are Canadian and Australian dollars. Foreign currency translation gains primarily resulted from the weakening of the U.S. dollar against both the Canadian and Australian dollars as of September 30, 2025 when compared to December 31, 2024.\n \nSegment Results\nReportable segment information, including revenues and operating income by type of work, is gathered from each of our operating companies. Classification of our operating company revenues by type of work for segment reporting purposes can at times require judgment on the part of management. Integrated operations and common administrative support for operating companies require that certain allocations be made to determine segment profitability, including allocations of corporate shared and indirect operating costs, as well as general and administrative costs. Certain corporate costs are not allocated, including corporate facility costs; non-allocated corporate salaries, benefits and incentive compensation; acquisition and integration costs; non-cash stock-based compensation; amortization related to intangible assets; asset impairments related to goodwill and intangible assets; and change in fair value of contingent consideration liabilities.\nThree months ended September 30, 2025 compared to the three months ended September 30, 2024 \nThe following table sets forth segment revenues, segment operating income (loss) and operating margins for the periods indicated, as well as the dollar and percentage change from the prior period (dollars in thousands), with certain of our segment results of operations recast to conform to our current segment reporting structure as described above:\nThree Months Ended September 30,\nChange\n2025\n2024\n$\n%\nRevenues\n:\nElectric\n$\n6,172,019 \n80.9 \n%\n$\n5,233,887 \n80.6 \n%\n$\n938,132 \n17.9 \n%\nUnderground and Infrastructure\n1,459,389 \n19.1 \n1,259,280 \n19.4 \n200,109 \n15.9 \n%\nConsolidated revenues\n$\n7,631,408 \n100.0 \n%\n$\n6,493,167 \n100.0 \n%\n$\n1,138,241 \n17.5 \n%\nOperating income (loss):\n \n \n \n \nElectric\n$\n703,839 \n11.4 \n%\n$\n576,014 \n11.0 \n%\n$\n127,825 \n22.2 \n%\nUnderground and Infrastructure\n122,216 \n8.4 \n%\n93,956 \n7.5 \n%\n28,260 \n30.1 \n%\nCorporate and Non-Allocated Costs\n(308,838)\n(4.0)\n%\n(238,809)\n(3.7)\n%\n(70,029)\n29.3 \n%\nConsolidated operating income\n$\n517,217 \n6.8 \n%\n$\n431,161 \n6.6 \n%\n$\n86,056 \n20.0 \n%\n 38 \n \nElectric Segment Results\nRevenues\n. The increase in revenues for the three months ended September 30, 2025 was primarily due to increased demand for our services, as well as approximately $170 million in revenues attributable to acquired businesses. \nOperating Income\n. The increase in operating income for the three months ended September 30, 2025 was primarily due to the increase in revenues. The increase in operating margin for the three months ended September 30, 2025 was primarily due to the increase in revenues and the overall mix of work performed in the period. \nUnderground and Infrastructure Segment Results\nRevenues\n. The increase in revenues for the three months ended September 30, 2025 was primarily due to approximately $320 million in revenues attributable to acquired businesses, partially offset by lower revenues from large pipeline projects in Canada.\nOperating Income\n. The increase in operating income for the three months ended September 30, 2025 was primarily due to increased revenues. The increase in operating margin for the three months ended September 30, 2025 was primarily due to the overall mix of work performed in the period.\nCorporate and Non-Allocated Costs\nThe increase in corporate and non-allocated costs during the three months ended September 30, 2025 was primarily due to a $22.8 million increase in intangible asset amortization expense associated with recent acquisitions, primarily Dynamic Systems, and an $18.1 million increase in acquisition and integration costs. Also contributing to the increase was a $13.7 million increase in compensation expense, which was primarily attributable to increased salaries and non-cash stock compensation expense in support of business growth, and a $5.7 million increase in expense related to change in fair value of contingent consideration liabilities.\nNine months ended September 30, 2025 compared to the nine months ended September 30, 2024 \nThe following table sets forth segment revenues, segment operating income (loss) and operating margins for the periods indicated, as well as the dollar and percentage change from the prior period (dollars in thousands):\nNine Months Ended September 30,\nChange\n2025\n2024\n$\n%\nRevenues\n:\nElectric\n$\n16,574,484 \n80.3 \n%\n$\n13,631,891 \n79.6 \n%\n$\n2,942,593 \n21.6 \n%\nUnderground and Infrastructure \n4,063,265 \n19.7 \n3,487,482 \n20.4 \n575,783 \n16.5 \n%\nConsolidated revenues\n$\n20,637,749 \n100.0 \n%\n$\n17,119,373 \n100.0 \n%\n$\n3,518,376 \n20.6 \n%\nOperating income (loss):\n \n \nElectric\n$\n1,664,623 \n10.0 \n%\n$\n1,305,466 \n9.6 \n%\n$\n359,157 \n27.5 \n%\nUnderground and Infrastructure \n289,786 \n7.1 \n%\n222,437 \n6.4 \n%\n67,349 \n30.3 \n%\nCorporate and Non-Allocated Costs\n(827,829)\n(4.0)\n%\n(634,158)\n(3.7)\n%\n(193,671)\n30.5 \n%\nConsolidated operating income\n$\n1,126,580 \n5.5 \n%\n$\n893,745 \n5.2 \n%\n$\n232,835 \n26.1 \n%\nElectric Segment Results\nRevenues\n. The increase in revenues for the nine months ended September 30, 2025 was primarily due to approximately $1.71 billion in revenues attributable to acquired businesses, as well as increased demand for our services. \nOperating Income\n. The increase in operating income for the nine months ended September 30, 2025 was primarily due to the increase in revenues. The increase in operating margin for the nine months ended September 30, 2025 was primarily due to the overall mix of work performed in the period. Operating margin for the nine months ended September 30, 2024 was also negatively impacted by decreased operating income margins on various solar projects in the United States that were the result of decreased productivity. \nUnderground and Infrastructure Segment Results\nRevenues\n. The increase in revenues for the nine months ended September 30, 2025 was primarily due to approximately $520 million in revenues attributable to acquired businesses as well as increased demand for our services.\n 39 \n \nOperating Income.\n The increase in operating income and operating margin for the nine months ended September 30, 2025 was primarily due to increased revenues, which contributed to higher levels of fixed cost absorption, as well as the overall mix of work performed during the period. Additionally, the operating margin for the nine months ended September 30, 2024 was also negatively impacted by an $11.9 million loss related to the disposition of a non-core business. \nThe industrial project that impacted operating income and margin for the three months ended June 30, 2025 has experienced scope growth and resulting cost increases, for which we believe the customer is primarily responsible. Discussions with the customer and assessments are currently ongoing with respect to the scope changes, including the related cost and schedule impacts. \nCorporate and Non-Allocated Costs\nThe increase in corporate and non-allocated costs during the nine months ended September 30, 2025 was primarily due to an $88.8 million increase in intangible asset amortization and a $37.1 million increase in compensation expense, which was attributable to increased salaries, incentive compensation and non-cash stock compensation expense in support of business growth and, with respect to incentive compensation, increased levels of profitability. Also contributing to the increase was a $29.6 million increase in acquisition and integration costs and a $18.5 million increase in expense related to change in fair value of contingent consideration liabilities.\nNon-GAAP Financial Measures\nEBITDA and Adjusted EBITDA\nEBITDA and adjusted EBITDA, financial measures not recognized under GAAP, when used in connection with net income attributable to common stock, are intended to provide useful information to investors and analysts as they evaluate our performance. EBITDA is defined as earnings before interest and other financing expenses, taxes, depreciation and amortization, and adjusted EBITDA is defined as EBITDA adjusted for certain other items as described below. These measures should not be considered as an alternative to net income attributable to common stock or other financial measures of performance that are derived in accordance with GAAP. Management believes that the exclusion of these items from net income attributable to common stock enables us and our investors to more effectively evaluate our operations period over period and to identify operating trends that might not be apparent due to, among other reasons, the variable nature of these items period over period. In addition, management believes these measures may be useful for investors in comparing our operating results with other companies that may be viewed as our peers.\nAs to certain of the items below, (i) non-cash stock-based compensation expense varies from period to period due to acquisition activity, changes in the estimated fair value of performance-based awards, forfeiture rates, accelerated vesting and amounts granted; (ii) acquisition and integration costs vary from period to period depending on the level and complexity of our acquisition activity; (iii) equity in (earnings) losses of non-integral unconsolidated affiliates varies from period to period depending on the activity and financial performance of such affiliates, the operations of which are not operationally integral to us; (iv) gains and losses on the sale of investments and businesses vary from period to period depending on activity; and (v) change in fair value of contingent consideration liabilities varies from period to period depending on the performance in post-acquisition periods of certain acquired businesses and the effect of present value accretion on fair value calculations. Because EBITDA and adjusted EBITDA, as defined, exclude some, but not all, items that affect net income attributable to common stock, such measures may not be comparable to similarly titled measures of other companies. The most comparable GAAP \n 40 \n \nfinancial measure, net income attributable to common stock, and information reconciling the GAAP and non-GAAP financial measures, are included below. The following table shows dollars in thousands:\nThree Months Ended\nNine Months Ended\nSeptember 30,\nSeptember 30,\n \n2025\n2024\n2025\n2024\nNet income attributable to common stock (GAAP as reported)\n$\n339,420 \n$\n293,185 \n$\n712,928 \n$\n599,704 \nInterest and other financing expenses\n71,806 \n59,950 \n185,697 \n146,343 \nInterest income\n(3,722)\n(7,237)\n(11,345)\n(18,817)\nProvision for income taxes\n119,605 \n82,421 \n244,585 \n178,716 \nDepreciation expense\n103,875 \n89,979 \n300,714 \n262,525 \nAmortization of intangible assets\n133,195 \n110,422 \n355,935 \n267,147 \nInterest, income taxes, depreciation and amortization included in equity in earnings of integral unconsolidated affiliates\n8,668 \n5,384 \n21,408 \n15,608 \nEBITDA\n772,847 \n634,104 \n1,809,922 \n1,451,226 \nNon-cash stock-based compensation\n46,899 \n38,234 \n129,121 \n110,815 \nAcquisition and integration costs\n (1)\n31,903 \n7,053 \n70,277 \n25,461 \nEquity in losses (earnings) of non-integral unconsolidated affiliates\n80 \n1,662 \n497 \n(1,413)\n(Gain)/loss on sale of investments and business \n(2)\n(205)\n662 \n(205)\n4,370 \nIncrease in fair value of contingent consideration liabilities\n6,803 \n1,124 \n21,363 \n2,864 \nAdjusted EBITDA\n$\n858,327 \n$\n682,839 \n$\n2,030,975 \n$\n1,593,323 \n(1)\n The amounts for the three and nine months ended September 30, 2025 include $6.7 million and $15.2 million that, pursuant to an acquisition purchase agreement, were or will be withheld from the sellers’ proceeds, to be paid to certain employees upon satisfaction of post-closing service obligations.\n(2) \nThe amount for the nine months ended September 30, 2024 is a loss of $11.9 million on the disposition of a non-core business, partially offset by a gain of $7.5 million as a result of the sale of a non-integral equity method investment.\nRemaining Performance Obligations and Backlog\nA performance obligation is a promise in a contract with a customer to transfer a distinct good or service. Our remaining performance obligations represent management’s estimate of consolidated revenues that are expected to be realized from the remaining portion of firm orders under fixed price contracts not yet completed or for which work has not yet begun, which includes estimated revenues attributable to consolidated joint ventures and variable interest entities, revenues from funded and unfunded portions of government contracts to the extent they are reasonably expected to be realized, and revenues from change orders and claims to the extent management believes they will be earned and are probable of collection.\nWe have also historically disclosed our backlog, a measure commonly used in our industry but not recognized under GAAP. We believe this measure enables management to more effectively forecast our future capital needs and results and better identify future operating trends that may not otherwise be apparent. We believe this measure is also useful for investors in forecasting our future results and comparing us to our competitors. Our remaining performance obligations are a component of backlog, which also includes estimated orders under MSAs, including estimated renewals, and certain non-fixed price contracts. Our methodology for determining backlog may not be comparable to the methodologies used by other companies.\nAs of September 30, 2025 and December 31, 2024, MSAs accounted for 38% and 38% of our estimated 12-month backlog and 43% and 48% of our total backlog. Generally, our customers are not contractually committed to specific volumes of services under our MSAs, and most of our contracts can be terminated on short notice even if we are not in default. We determine the estimated backlog for these MSAs using recurring historical trends, factoring in seasonal demand and projected customer needs based upon ongoing communications. In addition, many of our MSAs are subject to renewal, and these potential renewals are considered in determining estimated backlog. As a result, estimates for remaining performance obligations and backlog are subject to change based on, among other things, project accelerations; project cancellations or delays, including but not limited to those caused by commercial issues, regulatory requirements, natural disasters, emergencies and adverse weather conditions; and final acceptance of change orders by customers. These factors can cause revenues to be realized in periods and at levels that are different than originally projected.\n 41 \n \nThe following table reconciles total remaining performance obligations to our backlog (a non-GAAP financial measure) by reportable segment along with estimates of amounts expected to be realized within 12 months (in thousands):\n \nSeptember 30, 2025\nDecember 31, 2024\n12 Month\nTotal\n12 Month\nTotal\nElectric\nRemaining performance obligations\n$\n12,124,623 \n$\n19,088,111 \n$\n10,297,410 \n$\n15,654,028 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n6,722,325 \n13,555,822 \n6,198,603 \n12,973,779 \nBacklog\n$\n18,846,948 \n$\n32,643,933 \n$\n16,496,013 \n$\n28,627,807 \nUnderground and Infrastructure\nRemaining performance obligations\n$\n1,325,214 \n$\n1,884,648 \n$\n953,983 \n$\n1,104,609 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n2,137,865 \n4,645,458 \n2,321,941 \n4,806,408 \nBacklog\n$\n3,463,079 \n$\n6,530,106 \n$\n3,275,924 \n$\n5,911,017 \nTotal\nRemaining performance obligations\n$\n13,449,837 \n$\n20,972,759 \n$\n11,251,393 \n$\n16,758,637 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n8,860,190 \n18,201,280 \n8,520,544 \n17,780,187 \nBacklog\n$\n22,310,027 \n$\n39,174,039 \n$\n19,771,937 \n$\n34,538,824 \nThe increases in both remaining performance obligations and backlog from December 31, 2024 to September 30, 2025 were partially due to the impact of acquisitions that occurred in the nine months ended September 30, 2025, as well as new project awards with existing customers.\nLiquidity and Capital Resources\nOverview\nWe plan to fund our working capital, capital expenditures, debt service, dividends and other cash requirements with our current available liquidity and cash from operations, which could be affected by general economic, financial, competitive, legislative, regulatory, business and other factors, many of which are beyond our control. Management monitors financial markets and national and global economic conditions for factors that may affect our liquidity and capital resources. \nOur capital deployment priorities that require the use of cash include: (i) working capital to fund ongoing operating needs, (ii) capital expenditures to meet anticipated demand for our services, (iii) acquisitions and investments to facilitate the long-term growth and sustainability of our business, and (iv) return of capital to stockholders, including through the payment of dividends and repurchases of our outstanding common stoc\nk\n. \nCash Requirements and Capital Allocation\nDuring the nine months ended September 30, 2025, we completed the acquisition of five businesses in which a portion of the consideration, net of cash acquired, consisted of $1.78 billion in cash paid on the respective acquisition dates, funded with a combination of cash and cash equivalents, borrowings under our debt financing arrangements and proceeds from the issuance of senior notes. For additional information regarding our recent acquisitions, refer to Note 5 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report.\nDuring the nine months ended September 30, 2025, there were no material changes outside the ordinary course of business in the specified contractual obligations or changes to our capital allocation priorities as set forth in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations in Part II of the 2024 Annual Report. \nWe anticipate that our future cash flows from operating activities, cash and cash equivalents on hand, existing borrowing capacity under our senior credit facility and commercial paper program and ability to access capital markets for additional capital will provide sufficient funds to enable us to meet our cash requirements for the next twelve months and over the longer term.\n 42 \n \n \nSignificant Sources of Cash\n Cash flow from operating activities is primarily influenced by demand for our services and operating margins but is also influenced by the timing of working capital needs associated with the various types of services that we provide. Our working capital needs may increase when we commence large volumes of work under circumstances where project costs are required to be paid before the associated receivables are billed and collected. Working capital needs are generally higher during the summer and fall due to increased demand for our services when favorable weather conditions exist in many of our operating regions. Conversely, working capital assets are typically converted to cash during the winter. These seasonal trends can be offset by changes in project timing due to delays or accelerations and other economic factors that may affect customer spending, including market conditions or the impact of certain unforeseen events (e.g., regulatory and other actions that impact the supply chain for certain materials). Additionally, operating cash flows may be negatively impacted as a result of unpaid and delayed change orders and claims. Changes in project timing due to delays or accelerations and other economic, regulatory, market and political factors that may affect customer spending could also impact cash flow from operating activities. Further information with respect to our cash flow from operating activities is set forth below and in Note 15 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report\n.\nOur available commitments under our senior credit facility and cash and cash equivalents as of September 30, 2025 were as follows (in thousands):\nSeptember 30, 2025\nTotal capacity available for revolving loans, credit support for commercial paper program and letters of credit\n$\n2,800,000 \nLess:\nLetters of credit outstanding\n65,615 \nAvailable commitments for revolving loans, credit support for commercial paper notes and letters of credit\n2,734,385 \nPlus:\nCash and cash equivalents \n(1)\n610,387 \nTotal \n$\n3,344,772 \n(1)\n     Further information with respect to our cash and cash equivalents is set forth below and in Note 14 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report. This amount includes $287.4 million in jurisdictions outside of the U.S., principally in Australia. There are currently no legal or economic restrictions that would materially impede our ability to repatriate such cash.\nIn July 2025, we extended the maturity date for revolving loans under the credit agreement for our senior credit facility from July 31, 2029 to July 31, 2030. In August 2025, we issued $1.50 billion aggregate principal amount of senior notes and received net proceeds of $1.48 billion, net of the original issue discount, underwriting discounts and deferred financing costs, and used the proceeds to repay certain borrowings that were utilized to acquire Dynamic Systems. For additional information regarding the issuance of the senior notes, see Note 8 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report.\nWe consider our investment policies related to cash and cash equivalents to be conservative, as we maintain a diverse portfolio of what we believe to be high-quality cash and cash equivalent investments with short-term maturities. Additionally, subject to the conditions specified in the credit agreement for our senior credit facility, we have the option to increase the capacity of our senior credit facility, in the form of an increase in the revolving commitments, term loans or a combination thereof, from time to time, upon receipt of additional commitments from new or existing lenders by up to an additional (i) $400.0 million plus (ii) additional amounts so long as the Incremental Leverage Ratio Requirement (as defined in the credit agreement) is satisfied at the time of such increase. The Incremental Leverage Ratio Requirement requires, among other things, after giving pro forma effect to such increase and the use of proceeds therefrom, compliance with the credit agreement’s financial covenants as of the most recent fiscal quarter end for which financial statements were required to be delivered. Further information with respect to our debt obligations is set forth in Note 8 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report\n. \n 43 \n \nWe may seek to access the capital markets from time to time to raise additional capital, increase liquidity as we deem necessary, refinance or extend the term of our existing indebtedness, fund acquisitions or otherwise fund our capital needs. While our financial strategy and consistent performance have allowed us to maintain investment grade ratings, our ability to access capital markets in the future depends on a number of factors, including our financial performance and financial position, our credit ratings, industry conditions, general economic conditions, our backlog, capital expenditure commitments, market conditions and market perceptions of us and our industry. In July 2025, Moody’s revised its outlook on our Baa3 investment grade ratings from stable to positive.\nSources and Uses of Cash, Cash Equivalents and Restricted Cash During the Nine Months Ended September 30, 2025 and 2024\nIn summary, our cash flows for each period were as follows (in thousands):\n \nNine Months Ended\n \nSeptember 30,\n2025\n2024\nNet cash provided by operating activities \n$\n1,102,405 \n$\n1,369,181 \nNet cash used in investing activities \n$\n(2,285,686)\n$\n(2,127,148)\nNet cash provided by financing activities \n$\n1,031,409 \n$\n227,427 \nOperating Activities\nNet cash provided by operating activities of $1.10 billion and $1.37 billion in the nine months ended September 30, 2025 and 2024 primarily reflected earnings adjusted for non-cash items and cash provided and used by the main components of working capital: “Accounts and notes receivable,” “Contract assets,” “Prepaid expenses and other current assets,” “Accounts payable and accrued expenses,” and “Contract liabilities.” \nDays sales outstanding (DSO) represents the average number of days it takes revenues to be converted into cash, which management believes is an important metric for assessing liquidity. A decrease in DSO has a favorable impact on cash flow from operating activities, while an increase in DSO has a negative impact on cash flow from operating activities. DSO is calculated by using the sum of current accounts receivable, net of allowance (which includes retainage and unbilled balances), plus contract assets, less contract liabilities, and divided by average revenues per day during the quarter. DSO as of September 30, 2025 was 66 days, which was slightly higher than DSO of 65 days as of September 30, 2024 and lower than our five-year historical average DSO of 75 days. Negatively impacting DSO and cash flow from operating activities for both the nine months ended September 30, 2025 and 2024 were unapproved change orders and claims included in contract assets from the large renewable transmission project in Canada further described in Note 3 of the Notes to Condensed Consolidated Financial Statements in Item 1. \nFinancial Statements\n of Part I of this Quarterly Report. \nInvesting Activities\nNet cash used in investing activities in the nine months ended September 30, 2025 included $1.78 billion related to acquisitions, $415.6 million of capital expenditures and $149.2 million of cash paid primarily for an integral equity method investment. Partially offsetting these items were $39.4 million of proceeds from the sale of, and insurance settlements related to, property and equipment,\nNet cash used in investing activities in the nine months ended September 30, 2024 included $1.72 billion related to acquisitions, $457.1 million of capital expenditures and $72.6 million cash paid primarily for non-integral equity method investments. Partially offsetting these items were $67.2 million of proceeds from the sale of, and insurance settlements related to, property and equipment; $31.2 million of proceeds from the disposition of a non-core business and $29.2 million of proceeds from the sale of a non-integral equity investment.\nOur industry is capital intensive, and we expect substantial capital expenditures and commitments for equipment purchases and equipment lease and rental arrangements to be needed for the foreseeable future in order to meet anticipated demand for our services. In addition, we expect to continue to pursue strategic acquisitions and investments, although we cannot predict the timing or amount of the cash needed for these initiatives. We also have various other capital commitments that are detailed in \nCash Requirements and Capital Allocation\n above and in Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and Capital Resources\n of Part I of our 2024 Annual Report.\n 44 \n \nFinancing Activities\nIn August 2025, we issued $1.50 billion aggregate principal amount of senior notes and received net proceeds of $1.49 billion, net of the original issue discount and underwriting discounts, and used the proceeds to repay certain borrowings that were utilized to acquire Dynamic Systems. Net cash provided by financing activities in the nine months ended September 30, 2025 included $51.2 million of net repayments under our senior credit facility and commercial paper program. Financing costs paid directly by us during the nine months ended September 30, 2025 were $4.9 million, which primarily related to the August 2025 issuance of senior notes. Net cash provided by financing activities in the nine months ended September 30, 2025 also included $134.6 million of repurchases of common stock, $102.6 million of payments for contingent consideration liabilities, $97.6 million of payments to satisfy tax withholding obligations associated with stock-based compensation and $45.4 million for the payment of dividends. \nIn July 2024, we entered into, and borrowed the full amount available under, a $400.0 million 90-day term loan facility outside of our senior credit facility and utilized these borrowings, together with $1.20 billion of borrowings under our commercial paper program and cash on hand, to finance the acquisition of CEI, as well as pay certain related costs and expenses and fund certain working capital requirements. On August 9, 2024, we received net proceeds from the issuance of senior notes of $1.24 billion, including $2.8 million of deferred financing costs paid of accrued by us, but net of the original issue discount and underwriting discounts and used the proceeds to repay certain borrowings utilized to acquire CEI, including the full amount of the short-term term loan. Net cash provided by financing activities in the nine months ended September 30, 2024 included $791.0 million of net repayments under our senior credit facility and commercial paper program. Financing costs paid directly by us during the nine months ended September 30, 2024 were $7.6 million, which related to the August 2024 issuance of senior notes, the short-term term loan and an amendment of our senior credit facility. Net cash provided by financing activities in the nine months ended September 30, 2024 was also partially offset by $140.6 million of payments to satisfy tax withholding obligations associated with stock-based compensation and the payment of $40.8 million of dividends.\nWe expect to continue to utilize cash for similar financing activities in the future, including repayments of our outstanding debt, payment of cash dividends and repurchases of our common stock and/or debt securities. \nCritical Accounting Estimates \nThe discussion and analysis of our financial condition and results of operations are based on our condensed consolidated financial statements, which have been prepared in accordance with GAAP. Certain information and footnote disclosures, normally included in annual financial statements prepared in accordance with GAAP, have been condensed or omitted pursuant to those rules and regulations. The preparation of these condensed consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities known to exist as of the date the condensed consolidated financial statements are published and the reported amounts of revenues and expenses recognized during the periods presented. We review all significant estimates affecting our condensed consolidated financial statements on a recurring basis and record the effect of any necessary adjustments prior to their publication. Judgments and estimates are based on our beliefs and assumptions derived from information available at the time such judgments and estimates are made. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of financial statements. There can be no assurance that actual results will not differ from those estimates. Management has reviewed its development and selection of critical accounting estimates with the audit committee of our Board of Directors. Our accounting policies are primarily described in Notes 2 and 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of the 2024 Annual Report and should be read in conjunction with the accounting policies identified in Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n of Part II of our 2024 Annual Report, which we believe affect our more significant estimates."
}