{
  "source_file": "pwr-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBusiness\nOVERVIEW \nQuanta Services, Inc. (together with its subsidiaries, “Quanta,” “we,” “us” or “our”) is a leading provider of comprehensive infrastructure solutions for the electric and gas utility, renewable energy, technology, communications, pipeline and energy industries in the United States, Canada, Australia and select other international markets. We provide engineering, procurement, construction, upgrade and repair and maintenance services for infrastructure within each of these industries, including electric power transmission and distribution networks; substation facilities; wind and solar generation and transmission and battery storage facilities; electrical systems for data center, commercial and industrial facilities; communications and cable multi-system operator networks; gas utility systems; pipeline transmission systems and facilities; and downstream industrial facilities. Our operations are decentralized and labor-intensive, and we rely on craft skilled labor personnel and experienced operators to successfully manage our day-to-day business. We also have an experienced management team, both at the executive and regional levels and within our subsidiaries, which we refer to as operating companies. We operate a fleet of owned and leased trucks and trailers, support vehicles and specialty construction equipment, as well as various proprietary technologies that enhance our service offerings. We have a large and diverse customer base, including many of the leading companies in the utility, renewable energy, technology, communications, industrial and energy delivery markets.\nThe performance of our business generally depends on our ability to obtain contracts with customers and to effectively deliver the services provided under those contracts. Our services are typically provided pursuant to master service agreements (MSAs), repair and maintenance contracts and fixed price and non-fixed price construction and engineering contracts. We offer comprehensive and diverse solutions on a broad geographic scale and have a solid base of long-standing customer relationships in each of the industries we serve. We believe our reputation for safety leadership, responsiveness and performance, geographic reach, comprehensive service offerings and financial strength have resulted in strong relationships with numerous customers, and we endeavor to develop and maintain strategic alliances and preferred service provider status with our customers. \nWe believe that our business strategies, along with our safety culture and financial resources, differentiate us from our competition and position us to benefit from future programmatic and capital spending by our customers. Our strategies include delivering and continuing to expand our portfolio of infrastructure solutions to existing and potential customers, developing our technological and training capabilities, remaining committed to the safety of our employees, and maintaining an entrepreneurial culture throughout our organization. We believe executing on these strategies places us in the position to capitalize on opportunities and trends in the industries we serve and expand our operations to select new markets. \nSEGMENTS\nWe report our results under three reportable segments: Electric Power Infrastructure Solutions (Electric Power), Renewable Energy Infrastructure Solutions (Renewable Energy) and Underground Utility and Infrastructure Solutions (Underground and Infrastructure). Our entrepreneurial business model allows multiple operating companies to serve the same or similar customers and to provide a range of services across end user markets. Reportable segment information, including revenues and operating income by type of work, is gathered from each operating company. Classification of operating company revenues by type of work for segment reporting purposes can require judgment on the part of management. Beginning in the three months ending March 31, 2025, our Chief Executive Officer reevaluated how he assesses performance and allocates resources, which resulted in a change in the reporting of management’s internal financial information. As a result, we will begin reporting the results of our two operating segments, which will also be our two reportable segments: (1) Electric Infrastructure Solutions and (2) Underground Utility and Infrastructure Solutions. The Electric Infrastructure Solutions segment will consist of the historical Electric Power and Renewable Energy segments. \nWe operate primarily in the United States; however, we derived approximately 8.7%, 14.2% and 15.7% of our revenues from foreign operations, primarily in Canada and Australia, during the years ended December 31, 2024, 2023 and 2022. \nElectric Power \nServices\nOur Electric Power segment provides comprehensive services primarily for the electric power and also for the communications markets. We believe our collaborative, customer-focused, and solutions-based approach, combined with our significant capabilities and scale, differentiate us in the marketplace. Services performed generally include: \n•\ndesign, procurement, new construction, upgrade and repair and maintenance services for electric power transmission and distribution infrastructure, both overhead and underground, and substation facilities, along with other \n4\nengineering and technical services, including services that support the implementation of upgrades by utilities to modernize and harden the electric power grid in order to ensure its safety and enhance reliability and to accommodate increased residential and commercial use of electric vehicles (EVs); \n•\nemergency restoration services, including the repair of infrastructure damaged by fires and inclement weather; \n•\nenergized installation, maintenance and upgrade of electric power infrastructure utilizing our bare hand and hot stick methods and our robotic arm techniques;\n•\ninstallation of “smart grid” technologies on electric power networks;\n•\ndesign and installation of electrical systems for data center, commercial and industrial facilities;\n•\ndesign and construction services to wireline and wireless communications companies, cable multi-system operators and other customers within the communications industry (including services in connection with 5G wireless deployment);\n•\ndesign, installation, maintenance and repair services related to commercial and industrial wiring; and\n•\naviation services primarily for the utility industry, including transportation of line workers, pole and tower setting, and wire stringing, as well as certain emergency aerial firefighting services.\nThis segment also includes (i) the majority of the financial results of our advanced training facility and our postsecondary educational institution, which specializes in pre-apprenticeship training, apprenticeship training and specialized utility task training for electric workers, as well as training for the gas distribution and communications industries; (ii) our portion of earnings of our unconsolidated integral affiliates, which includes, among others, our 50% equity interest in LUMA Energy, LLC (LUMA), a joint venture that was selected to operate, maintain, and modernize the approximately 18,000-mile electric transmission and distribution system in Puerto Rico; and (iii) financial results associated with our power transformer and circuit breaker manufacturing operations.\nBusiness Environment\nWith respect to our electric power service offerings, utilities are continuing to invest significant capital in their gas- powered and renewable generation systems, as well as their electric power delivery systems, particularly transmission, substation and distribution infrastructure, through multi-year, multi-billion dollar grid modernization and reliability programs. We also expect demand for electricity in North America to continue to grow, including through electrification trends (e.g., EV adoption) and increased demand for data center infrastructure and manufacturing facilities, and believe that certain segments of the North American electric power grid are not adequate to efficiently supply this future demand. To accommodate this growth, we expect continued demand for new or expanded transmission, substation and distribution infrastructure to reliably transport power to meet demand driven by electrification, data centers and manufacturing reshoring, and the modification and reengineering of existing infrastructure with increasing penetration of renewable generation and battery storage. In order to reliably and efficiently deliver power and in preparation for emerging technologies, such as EVs, utilities are also integrating smart grid technologies into distribution systems to improve grid management and create efficiencies. A number of utilities also continue to implement system upgrades and hardening programs in response to recurring severe weather events. For example, utilities throughout the United States are executing storm hardening programs to make their systems more resilient to hurricanes and other severe weather events, and there are significant system resiliency initiatives underway in California and other regions in the United States that are designed to prevent and manage the impact of wildfires. Utilities are also executing significant initiatives to underground critical infrastructure, including additional underground transmission and distribution initiatives by utilities in California, underground transmission projects in the northeast United States and underground distribution circuits along the U.S. coastlines.\nAdditionally, the technology industry is investing significant capital in the build out of data centers in order to expand cloud-based services and develop artificial intelligence (AI) training and inference. As mentioned above, these facilities consume significant electricity and are a meaningful driver of increasing load demand throughout our service geographies. Given this significant demand and resulting impact on the electric power grid, we believe we are well positioned to provide turnkey infrastructure solutions, such as critical path low-voltage electrical infrastructure solutions inside data centers, including advanced manufactured, modular solutions, as well as the high-voltage substation, transformers and transmission interconnection infrastructure connecting the facility to the power grid. \nWith respect to our communications service offerings, which are focused on the North American market, consumer and commercial demand for communication and data-intensive, high-bandwidth wireline and wireless services and applications are driving significant investment in infrastructure and the deployment of new technologies. In particular, we believe there are opportunities to provide fiber and other services in and around data centers, and to interconnect data centers. Communications providers are utilizing fifth generation wireless (5G) infrastructure to support fixed wireless access, which is driving additional \n5\nfiber capacity requirements for consumer and commercial applications. Additionally, legislative and regulatory initiatives, including the Broadband Equity Access and Deployment (BEAD) Program and the Infrastructure Investment and Jobs Act (IIJA), have dedicated billions of dollars of funding to support broadband service to underserved markets.\nRenewable Energy \nServices\nOur Renewable Energy segment provides comprehensive infrastructure solutions to customers that are involved in the renewable energy industry. Like our Electric Power operations, as an industry leader in the renewable energy space, we believe our collaborative, customer-focused, solutions based approach coupled with our significant capabilities and scale differentiates us in the marketplace. Services performed generally include: \n•\nengineering, procurement, new construction, repowering and repair and maintenance services for renewable generation facilities, such as utility-scale wind, solar and hydropower generation facilities and battery storage facilities; and\n•\nengineering and construction services for substations and switchyards, transmission and other electrical infrastructure needed to interconnect and transmit electricity from renewable energy generation and battery storage facilities.\nBusiness Environment\nWith respect to these services, we believe there is increasing demand for electricity due to, among other things, increased electrification trends and data center and other technology and manufacturing infrastructure construction, as well as certain regulatory requirements, consumer and investor preferences and state and federal policies. Importantly, increased adoption and technological advancements and efficiencies have resulted in wind and solar energy providing some of the lowest levelized costs of energy in the marketplace. When coupled with consumer preferences for clean energy, demand for renewable generation and related infrastructure has increased and is expected to result in sizeable, long-term investments, including meaningful repowering and modernization of existing assets. To that end, renewable energy developers are expected to continue to make significant investments in wind and solar projects, as well as energy storage projects. Utilities have increased the percentage of renewable electricity bought through power purchase agreements (PPAs) with renewable energy developers, and by investing directly in renewable generation facilities, which could expand significantly over time as they increase supply to meet load growth expectations and pursue clean energy strategies and emissions-reduction initiatives. Also, a growing number of corporate enterprises, particularly technology companies, are entering into PPAs with renewable energy developers to source renewable electricity to supply power directly to their facilities, as well as achieve their own carbon-reduction initiatives. Increased battery storage is also being constructed to enhance grid resiliency, balance load and integrate renewable energy. These dynamics necessitate the development and construction of related infrastructure, including high-voltage electric transmission and substation infrastructure, that is necessary to interconnect and transmit electricity from new renewable energy generation facilities into the existing electric power grid. \nAdditionally, we believe various legislative and policy objectives throughout North America support these industry and market trends. For example, the Inflation Reduction Act of 2022 (IRA) includes, among other things, favorable provisions targeting increases in utility-scale wind, solar and energy storage capacity and increased domestic manufacturing capacity and availability of products and components for these projects, that could reduce supply chain risks in the future. Further, many states in the United States, several provinces in Canada and states in Australia have renewable portfolio standards and targets that are supporting and driving the development of renewable and other low-carbon forms of energy production. To the extent these legislative and policy objectives continue to be supported, we expect they will create incremental demand for our renewable energy solutions. \nUnderground and Infrastructure\nServices\nOur Underground and Infrastructure segment provides comprehensive infrastructure solutions to customers involved in the transportation, distribution, storage, development and processing of natural gas, oil and other products. Services performed generally include: \n•\ndesign, engineering, procurement, new construction, upgrade and repair and maintenance services for natural gas systems for gas utility customers; \n•\npipeline protection, integrity testing, rehabilitation and replacement services; \n6\n•\ncatalyst replacement services, high-pressure and critical-path turnaround services, instrumentation and electrical services, piping, fabrication and storage tank services for the midstream and downstream industrial energy markets, as well as specialty cleaning and environmental solutions for the industrial energy and petrochemical markets;\n•\nengineering and construction services for pipeline systems, storage systems and compressor and pump stations and the fabrication of pipeline support systems and related structures and facilities;\n•\ntrenching, directional boring and mechanized welding services related to the services described above; and\n•\nengineering, construction and maintenance services for energy transition and carbon-reduction related projects, such as alternative fuel facilities, carbon capture systems and hydrogen facilities.\nBusiness Environment\nWith respect to these services, we are focused on specialty services and industries that we believe are driven by regulated utility spending; regulation, replacement and rehabilitation of aging infrastructure; and safety and environmental initiatives, including gas utility services, pipeline integrity and transmission services and downstream industrial services. We believe this strategic decision provides a greater level of business sustainability and predictability and helps to offset the cyclicality of larger pipeline projects described below. Natural gas utilities have implemented multi-decade modernization programs to replace aging cast iron, bare steel and plastic system infrastructure with modern materials for safety, reliability and environmental purposes, and regulatory measures have increased the frequency and stringency of pipeline integrity testing requirements that require our customers to test, inspect, repair, maintain and replace pipeline infrastructure to ensure that it operates in a safe, reliable and environmentally conscious manner. Further, permitting challenges associated with construction of new pipelines can make existing pipeline infrastructure more valuable, motivating owners to extend the useful life of existing pipeline assets through integrity initiatives. Additionally, with respect to our downstream industrial services, including our high-pressure and critical-path turnaround services, as well as our capabilities with respect to instrumentation and electrical services, piping, fabrication and storage tanks services, and other industrial services, we are focused on processing facilities located along the U.S. Gulf Coast region, which we believe should have certain long-term strategic advantages due to their proximity to competitively priced and abundant hydrocarbon resources. \nOur revenues related to larger pipeline services have fluctuated in recent years. For example, revenues associated with larger U.S. pipeline projects have declined significantly as the pipeline and related infrastructure development necessary to support U.S. shale formations has largely been completed in the near term and as a result of a more challenging permitting and regulatory environment. Revenues associated with large pipeline projects decreased in 2024, as compared to 2022 and 2023, and we anticipate that revenues associated with these projects will continue to fluctuate. Despite these fluctuations and cyclicality, we continue to selectively pursue larger pipeline project opportunities to the extent they satisfy our margin and risk profiles. Additionally, the significant increase in demand for electric power is resulting in an increase in planning for new natural gas generation facilities and a delay in the retirement of existing facilities, which could increase the demand for natural gas and require additional pipeline and related infrastructure construction, as well as pipeline integrity services.\nWe also believe that customers in this segment are implementing strategies to reduce carbon emissions produced from their operations, which are providing incremental opportunities for our services and could include building or repurposing pipeline infrastructure, including the development of infrastructure for blending hydrogen into natural gas flow and carbon capture projects. To the extent these technologies gain wider adoption, we believe our customer relationships and capabilities position us well to capitalize on future opportunities. Furthermore, the favorable characteristics of natural gas could also position North America as a leading competitor in the global LNG export market, which could provide additional opportunities for our pipeline service offerings. \nGENERAL\nRecent Acquisitions\nOn July 17, 2024, Quanta completed the acquisition of Cupertino Electric, Inc. (CEI), which provides electrical infrastructure solutions, including engineering, procurement, project management, construction and modularization services, to the technology, renewable energy and infrastructure and commercial industries. CEI is located in the United States, and its results have been included in the Electric Power and Renewable Energy segments since the acquisition date. During the year ended December 31, 2024, we also acquired seven additional businesses located in the United States, including: a business that provides specialty environmental solutions to utility, industrial and petrochemical companies (primarily included in the Underground and Infrastructure segment); a business that specializes in testing, manufacturing and distributing safety equipment and supplies (primarily included in the Electric Power and Renewable Energy segments); a business that specializes in electrical infrastructure services for substations, data centers and governmental entities (primarily included in the Electric Power segment); a business that manufactures transmission and distribution equipment for the electric utility industry (primarily included in the Electric Power and Renewable Energy segments); a business that provides services and equipment \n7\nrelated to aerial telecommunications infrastructure and networks (primarily included in the Electric Power segment); a business that provides services related to fiber optic networks (primarily included in the Electric Power segment); and a business that specializes in designing, manufacturing, and distributing liquid-filled power transformers primarily for electrical companies and utilities (primarily included in the Electric Power and Renewable Energy segments). \nDuring the year ended December 31, 2023, we acquired five businesses located in the United States, including: a business that provides services related to high-voltage transmission lines, overhead and underground distribution, emergency restoration and industrial and commercial wiring and lighting (primarily included in the Electric Power segment); a business that procures parts, assembles kits for sale, manages logistics and installs solar tracking equipment for utility and development customers (primarily included in the Renewable Energy segment); a business that provides concrete construction services (primarily included in the Electric Power and Renewable Energy segments); a business specializing in power studies, maintenance testing and commissioning primarily for utility and commercial customers (included in the Electric Power segment) and a business that manufactures power transformers for the electric utility, renewable energy, municipal power and industrial markets (included in the Electric Power and Renewable Energy segments). \nSubsequent to December 31, 2024, we acquired two businesses, one located in the United States that specializes in civil solutions, including site clearing, earthwork, soil stabilization and infrastructure development (which will be primarily included in the Underground and Infrastructure segment), and one located in Australia that specializes in electrical engineering and the design and manufacturing of industrial technology solutions including control systems (which will primarily be included in the Electric Power and Underground and Infrastructure segments).\nThe results of operations of acquired businesses have been included in our consolidated financial statements since their respective acquisition dates. These acquisitions are further described in Note 6 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report.\nWe believe potential acquisition and investment opportunities exist in our industries and adjacent industries. We believe our business model, strong customer relationships and employee-centric culture are attractive to potential acquisition targets. While the attractiveness of certain acquisition targets may be diminished in the short term by increased interest rates, regulatory conditions and market volatility, we continue to evaluate opportunities that are expected to, among other things, broaden our customer base, expand our geographic area of operations and grow and diversify our portfolio of products and services.\nCustomer Relationships\nWe have a large and diverse customer base, including many of the leading companies in the industries we serve, and we have developed strong strategic alliances with numerous customers and strive to develop and maintain our status as a preferred solutions provider to our customers. For the year ended December 31, 2024, our largest customer accounted for 6% of our consolidated revenues and our ten largest customers accounted for 31% of our consolidated revenues. Representative customers include:\nl\nAmerican Electric Power Company, Inc.\nl\nLower Colorado River Authority\nl\nAvangrid, Inc. \nl\nNational Grid plc\nl\nBerkshire Hathaway, Inc.\nl\nNextEra Energy, Inc.\nl\nCenterPoint Energy, Inc.\nl\nPattern Energy\nl\nClearway Renew LLC \nl\nPG&E Corporation\nl\nComcast Corporation\nl\nPuget Sound Energy, Inc.\nl\nDuke Energy Corporation\nl\nRWE AG\nl\nEDF Renewables\nl\nSantos Limited \nl\nEngie IR Holdings LLC\nl\nSempra Energy\nl\nEntergy Corporation\nl\nThe Southern Company\nl\nEnterprise Products Partners L.P.\nl\nTC Energy Corporation\nl\nExelon Corporation\nl\nVesper Energy Development LLC\nl\nFirstEnergy Corp.\nl\nXcel Energy Inc.\nl\nInvenergy LLC\nOur customers include utilities, power developer, technology, communications, and energy delivery companies, as well as governmental entities. We have estimated revenues by customer type as a percentage of total revenues below. Such estimates \n8\nare based on management judgment and assumptions and are provided to show perceived trends in our customer types and should be considered directional in nature.\nYear Ended December 31,\n2024\n2023\n2022\nUtility and Power\n74 \n%\n75 \n%\n75 \n%\nEnergy and Other\n17 \n19 \n19 \nTechnology, Manufacturing and Communications\n9 \n6 \n6 \nTotal revenues\n100 \n%\n100 \n%\n100 \n%\nThe customer types set forth in the table above are described in further detail as follows:\n•\nUtility and Power - Customers that are electric and gas utility companies, as well as power developers; \n•\nEnergy and Other - Customers that own refineries or petrochemical plants and customers that own and/or operate pipelines for the delivery of hydrocarbons, and other non-utility and power customers and non-technology, manufacturing and communications customers to which we provide solutions; and\n•\nTechnology, Manufacturing and Communications - Customers that own and/or operate assets supporting delivery of data, communications and digital services (such as hyperscaler, data center colocation) and customers who own or operate commercial or industrial manufacturing facilities, as well as telecommunication customers.\nWe believe utility, power developer, technology, communications, and energy delivery company customers provide us with growth opportunities due to their programmatic and long-term capital programs and/or the longer-term trends and transitions associated with these industries. We are a preferred service provider for many of our customers, which generally means we have met minimum standards for a specific category of service, maintained a high level of performance and agreed to certain payment terms and negotiated rates. We strive to maintain our preferred status as we believe it provides us an advantage in the award of future work for the applicable customer. Furthermore, many of our strategic relationships with customers take the form of strategic alliance or long-term maintenance agreements, which typically extend for an initial term and may include renewal options to extend the initial term. Strategic alliance agreements also generally state an intention to work together over a period of time and/or on specific types of projects, and many provide us with preferential bidding procedures. We have also developed manufacturing capabilities designed to provide us with the capability to produce certain critical project components, including power transformers, that are needed for our customers’ projects.\nAlthough we have an integrated marketing and business development strategy, management at each of our operating companies is primarily responsible for developing and maintaining successful long-term relationships with customers. Our operating company management teams build upon existing customer relationships to secure additional projects and increase revenues. Many of these customer relationships are long-standing and are maintained through a partnering approach with centralized account management, which includes project evaluation and consulting, quality performance, performance measurement and direct customer contact. Additionally, operating company management focuses on pursuing growth opportunities with prospective customers. We also encourage operating company management to cross-sell services of our other operating companies to their customers and coordinate with our other operating companies to pursue projects, especially those that are larger and more complex. We believe our ability to provide services that cover a broad spectrum of our customers’ needs and requirements is a significant differentiator. Our corporate-level business development and regional management groups support these activities by promoting and marketing our services for existing and prospective large accounts, as well as projects that are capable of utilizing services from multiple operating companies.\nCompetition and Market Demand \nThe industries and geographic markets in which we operate are highly competitive, and several of our competitors are large companies that have significant financial, technical and marketing resources. In addition, there are relatively few barriers to entry into some of the industries in which we operate and, as a result, organizations that have adequate financial resources and access to technical expertise may become a competitor. Furthermore, companies that we engage as subcontractors, including pursuant to certain regulatory and customer requirements, may develop the expertise necessary to compete with us with respect to the award of prime contracts from our customers. \nA significant portion of our revenues is currently derived from unit price or fixed price agreements, and price is often an important factor in the award of such agreements. Accordingly, we could be underbid by our competitors. However, customers often consider other factors in choosing a service provider, including technical expertise and experience, breadth of solutions offerings, safety ratings, financial and operational resources, geographic presence, industry reputation and dependability, which we expect to benefit larger service providers such as us. In addition, competition may lessen as industry resources, such as labor supplies, approach capacity. There can be no assurance, however, that our competitors will not develop the expertise, \n9\nexperience and resources to provide services that are superior in both price and quality to our services, or that we will be able to maintain or enhance our competitive position. The in-house service organizations of our existing or prospective customers employ personnel who perform some of the same types of services we provide. Although these companies currently outsource a significant portion of these services, there can be no assurance that they will continue to do so in the future or that they will not acquire additional in-house capabilities.\nFor further information regarding the effects of competition on our business and trends in market demand affecting our business, see \nRisks Related to Operating Our Business \nand \nRisks Related to Our Industries \nin Item 1A. \nRisk Factors\n in Part I\n \nof this Annual Report and \nResults of Operations \nin Item 7. \nManagement\n’\ns Discussion and Analysis of Financial Condition \nin Part II of this Annual Report.\nMaterial Resources\nEquipment\nWe depend on the availability of a wide range of equipment to perform our services and operate a fleet of owned and leased trucks and trailers, as well as support vehicles and specialty construction and support equipment, such as bucket trucks, digger derricks, sidebooms, dozers, backhoes, excavators, trenchers, generators, boring machines, cranes, robotic arms and helicopters. As of December 31, 2024, the total size of the fleet was approximately 77,000 units. A number of factors that we may not be able to predict or control could result in increased costs for, or delays in delivery of, this equipment, including supply chain and other logistical challenges, as well as global trade relationships and other general market and political conditions that could impact production, delivery or pricing of such equipment (e.g., inflation, interest rates, recessionary economic conditions). Additionally, our ability to efficiently allocate equipment, including our vehicle fleet, across our operating companies may impact our ability to perform services and the profitability of our operations. As such, we have invested, and continue to invest, significant resources and management attention to the utilization of our equipment.\nProject Materials\nWe and our customers depend on the availability of certain materials for construction, upgrade and repair and maintenance of their infrastructure, including, among other things, steel, copper, aluminum, and components for electrical projects (e.g., power transformers, circuit breakers, wire) and renewable energy projects (e.g., solar panels, wind turbine blades). While our customers are typically responsible for supplying most or all of the materials required for the services we perform on their projects, pursuant to certain of our contracts, including contacts for our comprehensive engineering, procurement and construction (EPC) services, we are required to procure all or part of the materials needed for a project. As we continue to expand our EPC services, customers are increasingly requesting that we be responsible for procuring materials, and this trend is expected to continue to increase. \nAdditionally, we have invested in domestic manufacturing capabilities for certain critical transmission and power generation components, including high- and low-voltage power transformers. We believe continuing to develop these capabilities can help alleviate certain of our customers’ supply chain constraints and improve and control project timelines, as well as potentially reduce exposure to changes in global trade relationships around such components. \nFor further information regarding certain risks associated with sources and availability of project materials and components, see \nRegulation\n below and \nRisks Related to Operating Our Business \nin Item 1A. \nRisk Factors \nin Part I\n \nof this Annual Report.\nSeasonality and Cyclicality\nTypically, our revenues and results of operations can be subject to seasonal and other variations. These variations are influenced by, among other things, weather, customer spending patterns, bidding seasons, receipt of required regulatory approvals, permits and rights of way, project timing and schedules, and holidays. Our revenues are generally lowest in the first quarter of the year because cold, snowy or wet conditions can create challenging working environments that are more costly for our customers or cause delays on projects. In addition, infrastructure projects often do not begin in a meaningful way until our customers finalize their capital budgets, which typically occurs during the first quarter. Second quarter revenues are typically higher than those in the first quarter, as some projects begin, but continued cold and wet weather can often impact productivity. Third quarter and fourth quarter revenues are typically the highest of the year, as a greater number of projects are underway and operating conditions, including weather, are normally more accommodating. During the fourth quarter, projects are often completed and customers often seek to spend their capital budgets before year end. However, the holiday season and inclement weather can sometimes cause delays during the fourth quarter, reducing revenues and increasing costs. These seasonal impacts are typical for our U.S. operations, but seasonality for our international operations may differ.\n10\nRegulation\nCompliance with numerous regulations has a material effect on our operations. Our operations are subject to various federal, state, local and international laws and regulations, including:\n•\nlicensing, permitting and inspection requirements applicable to contractors and engineers;\n•\nregulations relating to worker safety (e.g., Occupational Safety and Health Administration regulations) and environmental protection;\n•\npermitting and inspection requirements applicable to construction projects;\n•\nwage and hour regulations (e.g., Fair Labor Standards Act) and regulations associated with our collective bargaining agreements and unionized workforce;\n•\nregulations relating to sourcing and transportation of equipment and materials, including licensing and permitting requirements; \n•\nregulations regarding engagement of suppliers and subcontractors that meet diversity-ownership or disadvantaged-business requirements;\n•\nregulations relating to aviation activities;\n•\nbuilding and electrical codes; \n•\napplicable U.S. and non-U.S. anti-corruption regulations; \n•\nimmigration regulations applicable to U.S. and cross-border employment; and\n•\nspecial bidding, procurement, cybersecurity and other requirements on government projects, as well as obtaining and maintaining security clearance required for certain government projects.\nWe believe that we are in compliance with all material licensing and regulatory requirements that are necessary to conduct our operations. Our failure to comply with applicable regulations could result in substantial fines or revocation of certain of our operating licenses, as well as give rise to termination or cancellation rights under our contracts or disqualify us from future bidding opportunities. We are also subject to numerous federal, state, local and international environmental laws and regulations governing our operations, including the handling, transportation and disposal of non-hazardous and hazardous substances and wastes, as well as emissions and other discharges into the environment, including discharges to air, surface water, groundwater and soil. We also are subject to laws and regulations that impose liability and cleanup responsibility for releases of hazardous substances into the environment. Under certain of these laws and regulations, liability can be imposed for cleanup of previously owned or operated properties or currently owned properties at which hazardous substances or wastes were discharged or disposed of by a former owner or operator, regardless of whether we directly caused the contamination or violated any law at the time of discharge or disposal. The presence of contamination from such substances or wastes could also interfere with ongoing operations or adversely affect our ability to sell or lease the property or use it as collateral for financing. In addition, we could be held liable for significant penalties and damages under certain environmental laws and regulations or be subject to revocation of certain licenses or permits, which could materially and adversely affect our business, results of operations and cash flows. Our contracts with customers may also impose liability on us for environmental issues that arise through the performance of our services. As a result, from time to time, we incur, and expect to continue to incur, costs and obligations to remain in compliance with applicable environmental laws and regulations, to correct environmental noncompliance matters and for remediation at or relating to certain of our properties. We believe that we are in substantial compliance with our environmental obligations and that any such obligations will not have a material adverse effect on our business or financial performance.\nThe overall regulatory environment also creates both challenges and opportunities for our business. In recent years, certain of our projects and certain customer spending in our industries have been negatively impacted by regulatory and permitting delays, as well as private legal challenges related to regulatory requirements, particularly with respect to large transmission and pipeline projects. Any tariffs, duties, taxes, assessments, or other limitations on the availability or sourcing of materials or components for our customers’ projects can also increase costs for customers and create variability of project timing. For example, regulatory, legislative or executive action with respect to regional and global trade relationships have impacted, and may impact in the future, the supply chain for certain components required for our customers’ projects (e.g., solar panels). For further information regarding the effects of regulation on our business, see \nRisks Related to Operating Our Business \nand \nRisks Related Regulation and Compliance \nin Item 1A. \nRisk Factors \nin Part I of this Annual Report.\nConversely, we believe that there are also several existing, pending or proposed legislative or regulatory actions that may alleviate certain regulatory and permitting issues and positively impact long-term demand, particularly in connection with electric power infrastructure and renewable energy spending. For example, regulatory changes affecting siting and right-of-way processes could potentially accelerate construction for transmission projects, and state and federal reliability standards are creating incentives for both electrical and pipeline system investment and maintenance. Additionally, certain legislation, such as \n11\nthe IRA and the IIJA, as well as other policy and economic incentives and overall public sentiment, are designed to support and encourage renewable projects that can potentially increase demand for our services over the long term.\nHuman Capital Resources\nWe believe our employees are our most important assets, and we focus significant attention and resources on attracting, developing and retaining talented and experienced individuals. We believe our industry-leading training and safety programs are a strength and competitive differentiator with not only our current and potential employees, but with our customers, which have high safety standards and are increasing the amount of their outsourced infrastructure services. Our operations are decentralized and labor-intensive, and we rely on craft skilled labor personnel and experienced operators to successfully manage our day-to-day business, as well as corporate management and professional personnel to coordinate and help execute our business strategies, \nallocate capital and coordinate equipment usage, and facilitate certain centralized administrative services\n.\nEmployee Profile\nAs of December 31, 2024, we had approximately 58,400 employees, consisting of approximately 11,500 salaried employees, including, among others, executive officers, professional and administrative staff, project managers and engineers, job superintendents and field personnel, and approximately 46,900 hourly employees, the number of which fluctuates depending upon the number and size of the projects that are ongoing and planned at any particular time. Additionally, approximately 32% of our employees as of December 31, 2024 were covered by collective bargaining agreements, which require the payment of specified wages, the observance of certain workplace rules and the payment of certain amounts to multiemployer pension plans and employee benefit trusts. These collective bargaining agreements have varying terms and expiration dates, and the majority contain provisions that prohibit work stoppages or strikes, even during specified negotiation periods relating to agreement renewals, and provide for binding arbitration dispute resolution in the event of prolonged disagreement. As of December 31, 2024, we had approximately 53,400 U.S. employees and approximately 5,000 non-U.S. employees, with the majority of our non-U.S. employees based in Canada.\nEmployee Health and Safety \nPerformance of our services requires the use of heavy equipment and exposure to inherently hazardous conditions. In response to these inherent hazards and as part of our commitment to the safety of our employees, customers and third parties, our corporate and operating company management personnel have established safety programs, policies and procedures and ongoing training requirements for our employees and have also developed and implemented critical safety equipment and innovations. For example, on our project sites we have implemented emergency response plans, personal voltage detectors, first aid training and automated external defibrillators, which have helped save the lives of our employees and bystanders. We have also continued to invest significant resources in our safety programs and training facilities, including the Quanta Advanced Training Center, located in Texas, and our safety monitoring tools, including fleet management software. Our operating companies also develop and share best practices for safety policies and practices, and we have an established program for onboarding newly acquired companies and working with them to augment their existing safety practices as necessary. We are also subject to, and must comply with, extensive regulations relating to worker health and safety, including the regulations of the Occupational Safety and Health Administration.\nEmployee Recruiting, Development and Training\nOur success depends on our ability to attract, develop and retain highly qualified employees, including craft skilled labor, project management, engineers, architects, designers, management and professional and administrative employees.\nCraft Skilled Labor.\n We continue to address the longer-term need for additional labor resources in our markets, as our customers continue to seek additional specialized labor resources to address an aging utility workforce and longer-term labor availability issues, increasing pressure to reduce costs and improve reliability, and increasing duration and complexity of their capital programs. We believe these trends will continue, possibly to such a degree that demand for labor resources will outpace supply. Furthermore, the increased demand for our services based on favorable dynamics in certain of our industries can create shortages of qualified labor. In order to take advantage of available opportunities and successfully implement our long-term strategy, we must be able to employ, train and retain the necessary skilled personnel. As a result, we are taking proactive steps to develop our workforce, including through strategic relationships with universities, the military and unions and the expansion and development of our training facilities and postsecondary educational institution. For example, we own and operate Northwest Lineman College, a postsecondary educational institution that provides training programs for the electric power infrastructure, communications and underground utility and infrastructure industries and specializes in pre-apprenticeship training, apprenticeship training and specialized utility task training for electric workers. We also continue to invest in our education and training capabilities at the Quanta Advanced Training Center and other dedicated training facilities, which provide programs for, among other things, beginning linemen, energized electric power services, telecommunications services, \n12\nindustrial services, lead and cable splicing, directional drilling, gas distribution services and pipeline integrity training. These training facilities allow us to provide classroom and on-the-job training programs and allow us to train employees in a controlled environment without the challenges of limited structure access and other constraints.\nAdditionally, we have entered into strategic relationships with universities, the military and unions in order to attract potential employees and develop our workforce. For example, our operating companies performing more sophisticated and technical jobs utilize, when applicable, training programs provided by the International Brotherhood of Electrical Workers/National Electrical Contractors Associations (IBEW/NECA) Apprenticeship Program, training programs sponsored by the four trade unions administered by the Pipe Line Contractors Association (PLCA), apprenticeship training programs sponsored by the Canadian Union of Skilled Workers (CUSW) or our equivalent programs. Certain of our operating companies have also established apprenticeship training programs approved by the U.S. Department of Labor that prescribe equivalent training requirements for employees who are not otherwise subject to the requirements of the IBEW/NECA Apprenticeship Program. In addition, the Laborers International Union of North America, the International Brotherhood of Teamsters, the United Association of Plumbers and Pipefitters and the International Union of Operating Engineers have training programs specifically designed for developing and improving the skills of their members who work in the pipeline construction industry. Our operating companies also share best practices for training and educational programs. Although we believe these and other initiatives will help address workforce needs, meeting our customers’ demand for labor resources could prove challenging. For additional information on the risks associated with labor resources in our industries, see \nRisks Related to Operating Our Business \nin Item 1A. \nRisk Factors \nin Part I of this Annual Report.\nManagement and Professional Personnel.\n Due to our decentralized operating structure, significant decision-making authority resides with management at our operating companies, and our corporate management and professional and administrative personnel are relied upon to allocate capital and communicate, coordinate and help execute our business strategies. We are focused on our ability to attract and retain qualified employees for these important positions, as we rely on them \nto successfully manage our decentralized operations and grow and expand our business. \nWe have also implemented enterprise-wide talent development and succession planning programs designed to identify and develop future and/or replacement candidates for key positions. For example, we have developed and administer a succession program with respect to our executive officers and senior operating company personnel, which is reviewed and/or overseen by our Board of Directors (Board). \nCompensation and Benefits \nOur compensation programs are generally designed to align employee compensation with market practices and our performance, as well as provide the proper incentives to attract, retain and motivate employees. With respect to our executive officers, operating company management, other senior leadership and corporate employees, compensation programs consist of both fixed and variable components. The fixed portion is generally set based on consideration of various market factors, with variable compensation designed to reward employees based on company financial and operational performance. We also grant stock-based compensation broadly throughout our organization, including to management and key operations personnel at the majority of our operating companies, which we believe is a key component of our compensation programs that helps to align incentives throughout our decentralized organization. We also enter into employment agreements with our executive officers and certain other key personnel. \nWe provide additional benefits to our employees. For example, we provide health, welfare and benefit plans for most employees who are not covered by collective bargaining agreements, and we maintain a 401(k) plan pursuant to which eligible U.S. employees who are not provided retirement benefits through a collective bargaining agreement may make contributions through payroll deductions and to which we make certain matching contributions.\nEthics and Compliance\nAll of our employees are subject to Quanta’s Code of Conduct, which addresses compliance with applicable laws and Quanta’s policies concerning, among other things, general business ethics, competition, anti-corruption and bribery, environmental protection, conflicts of interest, harassment and discrimination, data security and privacy, and insider trading. Quanta’s Code of Conduct also informs employees and third parties (such as suppliers, subcontractors and members of the public) about the resources and confidential reporting mechanisms available to detect, prevent and report unethical and illegal conduct, and our Chief Compliance Officer communicates directly with our Board about actual and alleged violations of the law or the Code of Conduct. Training with respect to Quanta’s Code of Conduct and other policies and procedures is conducted as part of our comprehensive ethics and compliance training program.\nClimate Change-Related Impacts\nOur management considers climate-related risks and opportunities in connection with its long-term strategic planning and enterprise risk management process, which are overseen by our Board. While the overall impact on our operations continues to \n13\nevolve, various aspects of climate change, as well as market and societal concerns about the future impact of climate change, have resulted and are expected to continue to result in operational opportunities and challenges. These opportunities and challenges arise from the physical risks associated with changes in climate, as well as technological advances, market developments and additional regulatory and compliance costs.\nChanges in climate have caused, and are expected to continue to cause, among other things, increasing temperatures, rising sea levels and changes to meteorological and hydrological patterns, as well as impacts to the frequency and intensity of wildfires, hurricanes, floods, droughts, winter storms and other storms and severe weather-related events and natural disasters. Our operating results can be significantly influenced by the climates in which we operate and severe weather events, and these changes have and could continue to significantly impact our future operating results. A greater amount of rainfall, snow, ice or other less accommodating weather conditions, as well as an increase in severe weather events and natural disasters, reduces our productivity and causes delays and cancellations of our ongoing projects. For example, hurricanes and tropical storms in the U.S. Gulf Coast region have impacted our ability to perform industrial services operations during certain periods. However, an increase in certain of these events, such as hurricanes, tropical storms, wildfires, blizzards and ice storms, also creates opportunities for us to perform a greater amount of emergency restoration services and, as described above, can increase customer spending on modernization, grid hardening and other infrastructure improvements (e.g., fire hardening programs and storm hardening programs). The timing and impact of these events is difficult to predict and can vary from period to period, and our emergency restoration services attributable to these events have fluctuated significantly in the last several years. Additionally, changes in climate could result in more accommodating weather patterns for greater periods of time in certain areas, which may enable us to increase our productivity in those areas.\nPhysical risks associated with changes in climate have also increased hazards associated with certain of our operations, which in turn has increased the potential for liability and increased the costs associated with such operations. For example, severe drought and high wind speeds have significantly increased the risk of wildfires throughout our operating locations, which in turn has exposed us and other contractors to increased risk of liability, particularly as these events can be started by electrical power and other infrastructure on which we have performed services. Given the potentially significant liabilities associated with these events, to the extent we are deemed liable or are otherwise responsible for damages or other amounts associated with a wildfire event, it could have a material adverse impact on our business. Furthermore, these climate conditions have also resulted in increased costs for wildfire-related third-party insurance and reduced the amount of insurance carriers are willing to make available to us under such policies. \nClimate change has also caused, and is expected to continue to cause, changes in the markets in which we operate. For example, many utility customers are transitioning toward more sustainable sources of power generation, such as renewables (e.g., wind and solar) coupled with battery storage technology, and are replacing aging, less efficient infrastructure, and there has been an increased electrification of consumer goods (e.g., EVs), which is expected to provide continued additional demand for new and expanded electric power infrastructure and reengineering of existing electric power infrastructure. We believe these market dynamics and technological advances provide significant opportunities for us, including increased demand for our renewable energy infrastructure services, as well as our portfolio of electric power infrastructure services. \nThe focus on climate change has also impacted markets within our Underground and Infrastructure segment. Certain services within this segment have experienced challenges, and could continue to experience challenges. For example, concerns about the impact of certain large pipeline projects on the environment, among other things, have contributed to significant delays and cancellations of certain projects in recent years, and as a result of this and other reasons, we have decreased our strategic focus on these service offerings. Furthermore, a potential for longer-term decline in demand for fossil fuels or refined products as a result of climate change concerns and/or regulation could further negatively impact these projects or negatively impact demand for our midstream and industrial services operations. However, we believe there are climate change-related opportunities for certain services in this segment, as described above. We also believe that meeting the increased demand for electricity will require the continued operation and development of certain legacy energy resources, including natural gas as a transition fuel, and therefore have strategically focused on expanding our natural gas utility services in recent years.\nLastly, new legislation or regulation related to climate change could increase our costs. Most significantly, we maintain a large fleet of vehicles and a significant amount of construction machinery, and the costs associated with them could significantly increase as a result of regulations related to greenhouse gas emissions from such sources or regulations that result in an increase in fuel prices. Additionally, the SEC and the State of California have adopted new rules relating to the disclosure of a range of climate-related risks. While these new rules are currently subject to litigation and the timing of implementation and finalization of such rules is uncertain, we are continuing to assess these rules and regulations and at this time we cannot predict the costs of implementation or any potential adverse impacts resulting from the rules. To the extent these rules are implemented, we or our customers could incur increased costs related to the assessment and disclosure of climate-related risks. In addition, enhanced climate disclosure requirements could accelerate the trend of certain stakeholders and lenders restricting or seeking more stringent conditions with respect to their investments in certain carbon intensive sectors, which could further impact our customers and demand for our services. \n14\nFor additional information regarding the risks and opportunities described above, see \nRisks Related to Operating Our Business \nin Item 1A. \nRisk Factors \nin Part I\n \nof this Annual Report.\nRisk Management and Insurance\nWe are insured for, among other things, employer’s liability, workers’ compensation, auto liability, aviation and general liability claims. We manage and maintain a portion of our risk through retentions and/or high deductibles and indirectly through our wholly-owned captive insurance company. The captive insurance company reimburses all claims up to the amount of the applicable deductible of our third-party insurance programs, as well as certain additional exposure related to the general and auto liability programs, which together, in certain circumstances, can be up to \n$50.0 million\n per occurrence. As a supplement to our high-deductible primary insurance and captive programs, we maintain insurance with excess insurance carriers for potential losses that exceed the amount of our deductible and captive insurance obligations. We renew our insurance policies on an annual basis, and therefore deductibles, captive reinsurance amounts, and levels of insurance coverage may change in future periods. \nFor additional information regarding our insurance and the risks associated with insurance coverage, see Note 16 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data \nand \nRisks Related to Operating Our Business \nin Item 1A. \nRisk Factors \nin Part I of this Annual Report.\nWebsite Access and Other Information\nOur website address is \nwww.quantaservices.com\n. Interested parties may obtain free electronic copies of our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to these reports in the \nInvestors / SEC Filings\n section of our website or through the website of the SEC at \nwww.sec.gov\n. These reports are available on our website as soon as reasonably practicable after we electronically file them with, or furnish them to, the SEC. We will also make available to any stockholder, without charge, copies of our Annual Report on Form 10-K as filed with the SEC. For copies of this or any other Quanta publication, stockholders may submit a request in writing to Quanta Services, Inc., Attn: Corporate Secretary, 2727 North Loop West, Houston, Texas 77008, or by phone at (713) 629-7600. \nInvestors and others should note that we announce material financial information and make other public disclosures of information regarding Quanta through SEC filings, press releases, public conference calls, and our website. We also utilize social media to communicate this information, and it is possible that the information we post on social media could be deemed material. Accordingly, we encourage investors, the media and others interested in our company to follow Quanta, and review the information we post, on the social media channels listed on our website in the \nInvestors / Social Media\n section.\nThis Annual Report, our website and our social media channels contain information provided by other sources that we believe is reliable. We cannot provide assurance that the information obtained from other sources is accurate or complete. No information on our website or our social media channels is incorporated by reference herein.",
  "item7": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nGeneral\nThe following discussion and analysis of the financial condition and results of operations of Quanta Services, Inc. (together with its subsidiaries, Quanta, we, us or our) should be read in conjunction with our consolidated financial statements and related notes in Item 8. \nFinancial Statements and Supplementary Data \nin Part II of this Annual Report. The discussion below contains forward-looking statements that are based upon our current expectations and are subject to uncertainty and changes in circumstances. Actual results may differ materially from these expectations due to inaccurate assumptions and known or unknown risks and uncertainties, including those identified in \nCautionary Statement About Forward-Looking Statements and Information\n above and in Item 1A. \nRisk Factors \nin Part I of this Annual Report. \nThe discussion summarizing the significant factors which affected the results of operations and financial condition for the year ended December 31, 2023, including the changes in results of operations between the years ended December 31, 2023 and 2022, can be found in Part II, Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations \nof our Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 22, 2024. \nOverview \nOur 2024 results reflect increased demand for our services, as consolidated revenues and operating income increased as compared to 2023, primarily due to increased revenues and operating income for our Renewable Energy Infrastructure Solutions (Renewable Energy) and Electric Power Infrastructure Solutions (Electric Power) segments. \nWith respect to our Electric Power segment, utilities are continuing to invest significant capital in their electric power delivery systems through multi-year grid modernization and reliability programs, as well as system upgrades and hardening programs in response to recurring severe weather events. We have also experienced high demand for new and expanded transmission, substation and distribution infrastructure needed to reliably transport power. In particular, we continue to experience strong demand from our utility customers, which we believe is driven by increasing demand for electricity associated with, among other things, data centers and other technology-related dynamics, domestic manufacturing reshoring initiatives and overall electrification trends. Our acquisition of Cupertino Electric, Inc. (CEI) during 2024 also resulted in increased services for our critical path electrical design and installation solutions from the technology and data center industry.\nWith respect to our Renewable Energy segment, the cost-effectiveness of solar, wind energy and battery storage, combined with a meaningful increase in current and forecasted electricity demand, is continuing to drive demand for renewable generation and related infrastructure (e.g., high-voltage electric transmission, substation infrastructure and battery storage), as well as interconnection services necessary to connect and transmit renewable-generated electricity to existing electric power delivery systems. Despite these positive longer-term trends, in prior periods supply chain challenges, policy and regulatory uncertainty and other factors have resulted in project delays. For example, shortages of, and increased costs for, materials necessary for certain projects, particularly sourcing restrictions related to solar panels necessary for the utility-scale solar industry and delays in availability of power transformers impacting the electric power and renewable energy industries impacted certain prior periods. \nWith respect to our Underground Utility and Infrastructure Solutions (Underground and Infrastructure) segment, during 2024, operating income margin was negatively impacted by cost absorption pressures across our gas operations in the United States due to reduced demand and project delays for our industrial operations along the U.S. Gulf Coast due to Hurricanes Beryl and Francine. We continue to believe the market for our industrial solutions and gas utility and pipeline integrity services remains solid given the recurring critical-path maintenance requirements and regulated spend dedicated to modernizing systems, reducing methane emissions, ensuring environmental compliance and improving safety and reliability. However, revenues associated with large pipeline projects decreased in 2024 as compared to 2023 and 2022, and we anticipate that revenues associated with these projects will continue to fluctuate. \nDuring 2024, increased revenues and operating income contributed to $2.08 billion of net cash provided by operating activities, a 32.1% increase compared to 2023, which allowed us to execute our business plan, including the strategic acquisition of certain businesses, for which we utilized $1.75 billion of cash, net of cash acquired, and the payment of $54.2 million in dividends associated with our common stock. Additionally, as of December 31, 2024, available commitments under our senior credit facility, combined with our cash and cash equivalents, totaled $3.35 billion.\nAdditionally, we entered into certain debt financing arrangements in connection with our acquisition of CEI, and on October 1, 2024, we repaid the $500.0 million aggregate principal amount of our 0.95% senior notes, which were issued in 2021. These debt financing arrangements are more fully described in Note 10 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report.\n43\nWe expect the strong demand for our services will continue. Our remaining performance obligations and backlog were $16.76 billion and $34.54 billion as of December 31, 2024, representing increases of 20.6%, and 14.7% relative to December 31, 2023. For a reconciliation of backlog to remaining performance obligations, the most comparable financial measure prepared in conformity with generally accepted accounting principles in the United States (GAAP), see \nNon-GAAP Financial Measures\n below. \nFor additional information regarding our overall business environment, see \nOverview \nin Part I, Item 1. \nBusiness \nof this Annual Report. \nSignificant Factors Impacting Results\nOur revenues, profit, margins and other results of operations can be influenced by a variety of factors in any given period, including those described in Item 1. \nBusiness \nand Item 1A. \nRisk Factors \nof Part I of this Annual Report, and those factors have caused fluctuations in our results in the past and are expected to cause fluctuations in our results in the future. Additional information with respect to certain of those factors is provided below.\nSeasonality. \nTypically, our revenues are lowest in the first quarter of the year because cold, snowy or wet conditions can create challenging working environments that are more costly for our customers or cause delays on projects. In addition, infrastructure projects often do not begin in a meaningful way until our customers finalize their capital budgets, which typically occurs during the first quarter. Second quarter revenues are typically higher than those in the first quarter, as some projects begin, but continued cold and wet weather can often impact productivity. Third quarter and fourth quarter revenues are typically the highest of the year, as a greater number of projects are underway and operating conditions, including weather, are normally more accommodating. During the fourth quarter, projects are often completed and customers often seek to spend their capital budgets before year end. However, the holiday season and inclement weather can sometimes cause delays during the fourth quarter, reducing revenues and increasing costs. These seasonal impacts are typical for our U.S. operations, but seasonality for our international operations may differ. For example, revenues for certain projects in Canada are typically higher in the first quarter because projects are often accelerated in order to complete work while the ground is frozen and prior to the break up, or seasonal thaw, as productivity is adversely affected by wet ground conditions during warmer months. \nWeather, natural disasters and emergencies.\n The results of our business in a given period can be impacted by adverse weather conditions, severe weather events, natural disasters or other emergencies, which include, among other things, heavy or prolonged snowfall or rainfall, hurricanes, tropical storms, tornadoes, floods, blizzards, extreme temperatures, wildfires, post-wildfire floods and debris flows, pandemics and earthquakes. Climate change has the potential to increase the frequency and extremity of severe weather events. These conditions and events can negatively impact our financial results due to, among other things, the termination, deferral or delay of projects, reduced productivity and exposure to significant liabilities due to failure of electrical power or other infrastructure on which we have performed services. However, severe weather events can also increase our emergency restoration services, which typically yield higher margins due in part to higher equipment utilization and absorption of fixed costs. \nDemand for services\n. We perform the majority of our services under existing contracts, including MSAs and similar agreements pursuant to which our customers are not committed to specific volumes of our services. Therefore our volume of business can be positively or negatively affected by fluctuations in the amount of work our customers assign us in a given period, which may vary by geographic region. Examples of items that may cause demand for our services to fluctuate materially from quarter to quarter include: the financial condition of our customers, their capital spending and their access to and cost of capital; acceleration of any projects or programs by customers (e.g., modernization or hardening programs); economic and political conditions on a regional, national or global scale, including availability of renewable energy tax credits; interest rates; governmental regulations affecting the sourcing and costs of materials and equipment; other changes in U.S. and global trade relationships (e.g., tariffs, taxes); and project deferrals and cancellations. \nRevenue mix and impact on margins.\n The mix of revenues based on the types of services we provide in a given period will impact margins, as certain industries and services provide higher-margin opportunities. Our larger or more complex projects typically include, among others, transmission projects with higher voltage capacities; pipeline projects with larger-diameter throughput capacities; large-scale renewable generation projects; complex data center projects; and projects with increased engineering, design or construction complexities, more difficult terrain or geographical requirements, or longer distance requirements. These projects typically yield opportunities for higher margins than our recurring services under MSAs described above, as we assume a greater degree of performance risk and there is greater utilization of our resources for longer construction timeframes. However, larger projects are subject to additional risk of regulatory delay and cyclicality. Project schedules also fluctuate, particularly in connection with larger, more complex or longer-term projects, which can affect the amount of work performed in a given period. Furthermore, smaller or less complex projects typically have a greater number of companies competing for them, and competitors at times may more aggressively pursue available work. A greater percentage of smaller scale or less complex work also could negatively impact margins due to the inefficiency of transitioning between a \n44\ngreater number of smaller projects versus continuous production on fewer larger projects. As a result, at times we may choose to maintain a portion of our workforce and equipment in an underutilized capacity to ensure we are strategically positioned to deliver on larger projects when they move forward.\nProject variability and performance.\n Margins for a single project may fluctuate period to period due to changes in the volume or type of work performed, the pricing structure under the project contract or job productivity. Additionally, our productivity and performance on a project can vary period to period based on a number of factors, including unexpected project difficulties or site conditions (including in connection with difficult geographic characteristics); project location, including locations with challenging operating conditions; whether the work is on an open or encumbered right of way; inclement weather or severe weather events; environmental restrictions or regulatory delays; protests, public activism, other political activity or legal challenges related to a project; and the performance of third parties. Moreover, we currently generate a significant portion of our revenues under fixed price contracts, and fixed price contracts are more common in connection with our larger and more complex projects that typically involve greater performance risk. Under these contracts, we assume risks related to project estimates and execution, and project revenues can vary, sometimes substantially, from our original projections due to a variety of factors, including the additional complexity, timing uncertainty or extended bidding, regulatory and permitting processes associated with these projects. These variations can result in a reduction in expected profit, the incurrence of losses on a project or the issuance of change orders and/or assertion of contract claims against customers. See \nContract Estimates and Changes in Estimates \nin Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report.\nSubcontract work and provision of materials.\n Work that is subcontracted to other service providers generally yields lower margins, and therefore an increase in subcontract work in a given period can decrease operating margins. In recent years, we have subcontracted approximately 20% of our work to other service providers. Additionally, under certain contracts, including contracts for engineering, procurement and construction services, we agree to procure all or part of the required materials. While we attempt to structure our agreements with customers and suppliers to account for the impact of increased materials procurement requirements or fluctuations in the cost of materials we procure, our margins may be lower on projects where we furnish a significant amount of materials, as our markup on materials is generally lower than our markup on labor costs, and in a given period an increase in the percentage of work with greater materials procurement requirements may decrease our overall margins, including in some cases our assuming price risk. Furthermore, fluctuations in the price or availability of materials, equipment and consumables that we or our customers utilize could impact costs to complete projects. \n45\nResults of Operations\nConsolidated Results\nThe following table sets forth selected statements of operations data, such data as a percentage of revenues for the years indicated, as well as the dollar and percentage change from the prior year (dollars in thousands). \n \nYear Ended December 31,\nChange\n \n2024\n2023\n$\n%\nRevenues\n$\n23,672,795 \n100.0 \n%\n$\n20,882,206 \n100.0 \n%\n$\n2,790,589 \n13.4 \n%\nCost of services\n20,162,034 \n85.2 \n17,945,120 \n85.9 \n2,216,914 \n12.4 \n%\nGross profit\n3,510,761 \n14.8 \n2,937,086 \n14.1 \n573,675 \n19.5 \n%\nEquity in earnings of integral unconsolidated affiliates\n50,484 \n0.2 \n41,609 \n0.2 \n8,875 \n21.3 \n%\nSelling, general and administrative expenses\n(1,824,754)\n(7.7)\n(1,555,137)\n(7.4)\n(269,617)\n17.3 \n%\nAmortization of intangible assets\n(382,959)\n(1.6)\n(289,014)\n(1.5)\n(93,945)\n32.5 \n%\nChange in fair value of contingent consideration liabilities\n(7,064)\n— \n(6,568)\n— \n(496)\n7.6 \n%\nOperating income\n1,346,468 \n5.7 \n1,127,976 \n5.4 \n218,492 \n19.4 \n%\nInterest and other financing expenses\n(202,687)\n(0.9)\n(186,913)\n(1.0)\n(15,774)\n8.4 \n%\nInterest income\n32,404 \n0.1 \n10,830 \n0.1 \n21,574 \n199.2 \n%\nOther income, net\n35,845 \n0.2 \n18,063 \n0.1 \n17,782 \n98.4 \n%\nIncome before income taxes\n1,212,030 \n5.1 \n969,956 \n4.6 \n242,074 \n25.0 \n%\nProvision for income taxes\n284,747 \n1.2 \n219,267 \n1.0 \n65,480 \n29.9 \n%\nNet income\n927,283 \n3.9 \n750,689 \n3.6 \n176,594 \n23.5 \n%\nLess: Net income attributable to non-controlling interests\n22,459 \n0.1 \n6,000 \n— \n16,459 \n274.3 \n%\nNet income attributable to common stock\n$\n904,824 \n3.8 \n%\n$\n744,689 \n3.6 \n%\n$\n160,135 \n21.5 \n%\nRevenues.\n Revenues increased due to a $1.68 billion increase in revenues from our Renewable Energy segment and a $1.47 billion increase in revenues from our Electric Power segment, partially offset by a $354.6 million decrease in revenues from our Underground and Infrastructure segment. See \nSegment Results \nbelow for additional information and discussion related to segment revenues.\nCost of services.\n Costs of services primarily includes wages, benefits, subcontractor costs, materials, equipment, and other direct and indirect costs, including related depreciation. The increase in cost of services generally correlates to the increase in revenues.\nSelling, general and administrative expenses.\n The increase was primarily attributable to a $165.6 million increase related to recently acquired businesses; a $46.0 million increase in compensation expense, largely associated with increased salaries and non-cash stock compensation expense due primarily to an increase in the number of employees to support business growth; a $21.1 million increase in travel and related expenses to support business growth; and $18.5 million of foreign currency translation losses in connection with our substantial liquidation from Latin American operations.\nAmortization of intangible assets.\n The increase was related to incremental amortization expense associated with recent acquisitions, including CEI.\nOperating income.\n Operating income was positively impacted by a $278.2 million increase in operating income for our Electric Power segment and a $189.9 million increase in operating income for our Renewable Energy segment, partially offset by a $112.9 million decrease in operating income for our Underground and Infrastructure segment and a $136.7 million increase in corporate and non-allocated costs, which includes amortization expense. Results for each of our business segments and corporate and non-allocated costs are discussed in \nSegment Results\n below.\nInterest and other financing expenses.\n Approximately half of the increase resulted from higher principal balances and lease financing transactions as compared to the year ended December 31, 2023.\nInterest income\n. Approximately half of the increase resulted from higher interest-bearing cash and cash equivalent balances as compared to the year ended December 31, 2023.\n46\nOther income, net\n. The increase was primarily attributable to a gain of $12.6 million resulting from the sale of an investment in a non-integral unconsolidated affiliate, $5.0 million of which was attributable to a non-controlling interest, as further described in Note 8 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report. \nProvision for income taxes\n. The effective income tax rates for the years ended December 31, 2024 and 2023 were 23.5% and 22.6%, respectively. The tax rate for the year ended December 31, 2024 benefited from a $55.1 million benefit due to equity incentive awards vesting at a higher fair market value than their grant date fair market value, compared to a $35.0 million benefit in the year ended December 31, 2023. Additionally, the 2024 tax rate was positively impacted by ongoing entity rationalization and restructuring efforts. These efforts resulted in a $10.2 million deferred tax benefit and the release of a $4.6 million valuation allowance during the year ended December 31, 2024. The tax rate for the year ended December 31, 2023 was favorably impacted by the realization of the loss on our investment in Starry Group Holdings, Inc. for tax purposes, and the corresponding release of the valuation allowance initially recorded during the year ended December 31, 2022. The components of our provision for income taxes including changes in our valuation allowance are quantified and described in more detail in Note 12 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report.\nNet income attributable to non-controlling interests. \nThe increase in net income attributable to non-controlling interests is primarily related to increased activity on certain joint ventures and the $5.0 million gain on the sale of the investment in a non-integral equity unconsolidated affiliate recorded during the year ended December 31, 2024 as described above.\nComprehensive income.\n See Statements of Comprehensive Income in Item 8. \nFinancial Statements and Supplementary Data \nin Part II of this Annual Report. Comprehensive income increased by $42.6 million in 2024 as compared to 2023, primarily due to a $176.6 million increase in net income and $18.5 million of foreign currency translation losses recognized to net income in connection with our substantial liquidation from Latin American operations. These increases in comprehensive income were partially offset by a $134.7 million foreign currency translation adjustment loss and the $16.5 million increase in comprehensive income attributable to non-controlling interests described above. The predominant functional currencies for our operations outside the U.S. are Canadian and Australian dollars. Foreign currency translation adjustment loss in the year ended December 31, 2024 primarily resulted from the strengthening of the U.S. dollar against both the Canadian and Australian dollars as of December 31, 2024 when compared to December 31, 2023.\nSegment Results\nThrough December 31, 2024, we reported our results under three reportable segments: Electric Power, Renewable Energy and Underground and Infrastructure. Reportable segment information, including revenues and operating income by type of work, is gathered from each of our operating companies. Classification of our operating company revenues by type of work for segment reporting purposes can at times require judgment on the part of management. Integrated operations and common administrative support for operating companies require that certain allocations be made to determine segment profitability, including allocations of corporate shared and indirect operating costs, as well as general and administrative costs. Certain corporate costs are not allocated, including corporate facility costs; non-allocated corporate salaries, benefits and incentive compensation; acquisition and integration costs; non-cash stock-based compensation; amortization related to intangible assets; asset impairments related to goodwill and intangible assets; and change in fair value of contingent consideration liabilities.\n47\nThe following table sets forth segment revenues, segment operating income (loss) and operating margins for the periods indicated, as well as the dollar and percentage change from the prior period (dollars in thousands):\n \nYear Ended December 31,\nChange\n \n2024\n2023\n$\n%\nRevenues\n:\n \n \n \n \n \nElectric Power\n$\n11,166,495 \n47.2 \n%\n$\n9,696,897 \n46.5 \n%\n$\n1,469,598 \n15.2 \n%\nRenewable Energy\n7,845,884 \n33.1 \n6,170,301 \n29.5 \n1,675,583 \n27.2 \n%\nUnderground and Infrastructure\n4,660,416 \n19.7 \n5,015,008 \n24.0 \n(354,592)\n(7.1)\n%\nConsolidated revenues\n$\n23,672,795 \n100.0 \n%\n$\n20,882,206 \n100.0 \n%\n$\n2,790,589 \n13.4 \n%\nOperating income (loss):\n \n \n \n \nElectric Power\n$\n1,291,580 \n11.6 \n%\n$\n1,013,350 \n10.5 \n%\n$\n278,230 \n27.5 \n%\nRenewable Energy\n667,112 \n8.5 \n%\n477,208 \n7.7 \n%\n189,904 \n39.8 \n%\nUnderground and Infrastructure\n265,030 \n5.7 \n%\n377,977 \n7.5 \n%\n(112,947)\n(29.9)\n%\nCorporate and Non-Allocated Costs\n(877,254)\n(3.7)\n%\n(740,559)\n(3.5)\n%\n(136,695)\n18.5 \n%\nConsolidated operating income\n$\n1,346,468 \n5.7 \n%\n$\n1,127,976 \n5.4 \n%\n$\n218,492 \n19.4 \n%\nElectric Power Segment Results\nRevenues. \nThe increase in revenues for the year ended December 31, 2024 was primarily due to approximately $1.22 billion in revenues attributable to acquired businesses in 2024 and the rising demand for our services. \nOperating Income. \nThe increase in operating income and operating margin for the year ended December 31, 2024 was primarily due to the increase in revenues and change in the overall mix of work, including an increase in higher margin emergency restoration services. \nRenewable Energy Segment Results\nRevenues. \nThe increase in revenues for the year ended December 31, 2024 was primarily due to increased demand for generation and transmission services for renewable generation projects, as well as approximately $320 million in revenues attributable to acquired businesses. \nOperating Income. \nThe increase in operating income was primarily due to the increase in revenues during the year ended December 31, 2024. The increase in operating margin was primarily attributable to improved performance on transmission and generation projects, partially offset by increased costs on two solar projects in the United States. \nUnderground and Infrastructure Segment Results\nRevenues. \nThe decrease in revenues for the year ended December 31, 2024 was primarily due to lower revenues from large pipeline projects. This decrease was partially offset by approximately $215 million in revenues attributable to an acquired business. \nOperating Income. \nThe decrease in operating income and operating margin for the year ended December 31, 2024 was primarily due to decreased revenues and overall mix of work performed during the period, which contributed to lower levels of fixed cost absorption, and an $11.9 million loss recorded during the year ended related to the disposition of a non-core business.\nCorporate and Non-Allocated Costs\nThe increase in corporate and non-allocated costs during the year ended December 31, 2024 was primarily due to a $93.9 million increase in intangible asset amortization expense associated with recent acquisitions, including CEI, and a $36.0 million increase in compensation expense, which was primarily attributable to increased non-cash stock compensation and salary expense in support of business growth and associated with acquisitions.\nChange in Reportable Segments\nBeginning in the three months ending March 31, 2025, our Chief Executive Officer reevaluated how he assesses performance and allocates resources, which resulted in a change in the reporting of management’s internal financial information. As a result, we will begin reporting the results of our two operating segments, which will also be our two reportable segments: (1) Electric Infrastructure Solutions and (2) Underground Utility and Infrastructure Solutions. The Electric Infrastructure Solutions segment will consist of the historical Electric Power and Renewable Energy segments.\n48\nNon-GAAP Financial Measures\nEBITDA and Adjusted EBITDA\nEBITDA and adjusted EBITDA, financial measures not recognized under GAAP, when used in connection with net income attributable to common stock, are intended to provide useful information to investors and analysts as they evaluate our performance. EBITDA is defined as earnings before interest and other financing expenses, taxes, depreciation and amortization, and adjusted EBITDA is defined as EBITDA adjusted for certain other items as described below. These measures should not be considered as an alternative to net income attributable to common stock or other financial measures of performance that are derived in accordance with GAAP. Management believes that the exclusion of these items from net income attributable to common stock enables us and our investors to more effectively evaluate our operations period over period and to identify operating trends that might not be apparent due to, among other reasons, the variable nature of these items period over period. In addition, management believes these measures may be useful for investors in comparing our operating results with other companies that may be viewed as our peers. \nAs to certain of the items below, (i) non-cash stock-based compensation expense varies from period to period due to acquisition activity, changes in the estimated fair value of performance-based awards, forfeiture rates, accelerated vesting and amounts granted; (ii) acquisition and integration costs vary from period to period depending on the level and complexity of our acquisition activity; (iii) equity in (earnings) losses of non-integral unconsolidated affiliates varies from period to period depending on the activity and financial performance of such affiliates, the operations of which are not operationally integral to us; (iv) gains and losses on the sale of investments and businesses, and foreign currency translation losses recognized from substantial liquidation of certain foreign operations vary from period to period depending on activity; and (v) change in fair value of contingent consideration liabilities varies from period to period depending on the performance in post-acquisition periods of certain acquired businesses and the effect of present value accretion on fair value calculations. Because EBITDA and adjusted EBITDA, as defined, exclude some, but not all, items that affect net income attributable to common stock, such measures may not be comparable to similarly titled measures of other companies. The most comparable GAAP financial measure, net income attributable to common stock, and information reconciling the GAAP and non-GAAP financial measures, are included below. The following table shows dollars in thousands.\nYear Ended\nDecember 31,\n \n2024\n2023\nNet income attributable to common stock (GAAP as reported) \n$\n904,824 \n$\n744,689 \nInterest and other financing expenses\n202,687 \n186,913 \nInterest income\n(32,404)\n(10,830)\nProvision for income taxes\n284,747 \n219,267 \nDepreciation expense\n359,363 \n324,786 \nAmortization of intangible assets\n382,959 \n289,014 \nInterest, income taxes, depreciation and amortization included in equity in earnings of integral unconsolidated affiliates\n21,114 \n19,936 \nEBITDA \n2,123,290 \n1,773,775 \nNon-cash stock-based compensation\n150,526 \n126,762 \nAcquisition and integration costs \n29,994 \n42,837 \nEquity in earnings of non-integral unconsolidated affiliates\n(2,649)\n(1,263)\nLoss on disposition of business (gain on sale of investment), net \n(1)\n4,370 \n(1,496)\nForeign currency translation losses \n(2)\n18,531 \n— \nChange in fair value of contingent consideration liabilities\n7,064 \n6,568 \nAdjusted EBITDA\n$\n2,331,126 \n$\n1,947,183 \n(1)\n    \nThe amount for the year ended December 31, 2024 is a loss of $11.9 million on the disposition of a non-core business, partially offset by a gain of $7.5 million as a result of the sale of a non-integral equity method investment. \n(2)\n    \nThe amount for the year ended December 31, 2024 is foreign currency translation losses in connection with our substantial liquidation from Latin American operations. \nRemaining Performance Obligations and Backlog\nA performance obligation is a promise in a contract with a customer to transfer a distinct good or service. Our remaining performance obligations represent management’s estimate of consolidated revenues that are expected to be realized from the \n49\nremaining portion of firm orders under fixed price contracts not yet completed or for which work has not yet begun, which includes estimated revenues attributable to consolidated joint ventures and variable interest entities, revenues from funded and unfunded portions of government contracts to the extent they are reasonably expected to be realized, and revenues from change orders and claims to the extent management believes they will be earned and are probable of collection.\nWe have also historically disclosed our backlog, a measure commonly used in our industry but not recognized under GAAP. We believe this measure enables management to more effectively forecast our future capital needs and results and better identify future operating trends that may not otherwise be apparent. We believe this measure is also useful for investors in forecasting our future results and comparing us to our competitors. Our remaining performance obligations are a component of backlog, which also includes estimated orders under MSAs, including estimated renewals, and certain non-fixed price contracts. Our methodology for determining backlog may not be comparable to the methodologies used by other companies.\nAs of December 31, 2024 and 2023, MSAs accounted for 38% and 45% of our estimated 12-month backlog and 48% and 55% of our total backlog. Generally, our customers are not contractually committed to specific volumes of services under our MSAs, and most of our contracts can be terminated on short notice even if we are not in default. We determine the estimated backlog for these MSAs using recurring historical trends, factoring in seasonal demand and projected customer needs based upon ongoing communications. In addition, many of our MSAs are subject to renewal, and these potential renewals are considered in determining estimated backlog. As a result, estimates for remaining performance obligations and backlog are subject to change based on, among other things, project accelerations; project cancellations or delays, including but not limited to those caused by commercial issues, regulatory requirements, natural disasters, emergencies and adverse weather conditions; and final acceptance of change orders by customers. These factors can cause revenues to be realized in periods and at levels that are different than originally projected.\nThe following table reconciles total remaining performance obligations to our backlog (a non-GAAP financial measure) by reportable segment, along with estimates of amounts expected to be realized within 12 months (in thousands):\nDecember 31, 2024\nDecember 31, 2023\n12 Month\nTotal\n12 Month\nTotal\nElectric Power\nRemaining performance obligations\n$\n4,250,978 \n$\n7,320,481 \n$\n2,762,608 \n$\n4,505,830 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n5,907,359 \n12,583,574 \n5,597,732 \n10,995,198 \nBacklog\n$\n10,158,337 \n$\n19,904,055 \n$\n8,360,340 \n$\n15,501,028 \nRenewable Energy\nRemaining performance obligations\n$\n6,046,432 \n$\n8,333,547 \n$\n5,512,159 \n$\n8,005,368 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n291,244 \n390,205 \n118,770 \n119,634 \nBacklog\n$\n6,337,676 \n$\n8,723,752 \n$\n5,630,929 \n$\n8,125,002 \nUnderground and Infrastructure \nRemaining performance obligations\n$\n953,983 \n$\n1,104,609 \n$\n1,017,227 \n$\n1,383,057 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n2,321,941 \n4,806,408 \n2,222,451 \n5,099,332 \nBacklog\n$\n3,275,924 \n$\n5,911,017 \n$\n3,239,678 \n$\n6,482,389 \nTotal\nRemaining performance obligations\n$\n11,251,393 \n$\n16,758,637 \n$\n9,291,994 \n$\n13,894,255 \nEstimated orders under MSAs and short-term, non-fixed price contracts\n8,520,544 \n17,780,187 \n7,938,953 \n16,214,164 \nBacklog\n$\n19,771,937 \n$\n34,538,824 \n$\n17,230,947 \n$\n30,108,419 \nThe increases in both remaining performance obligations and backlog from December 31, 2023 to December 31, 2024 were partially due to the impact of acquisitions that occurred in the year ended December 31, 2024, as well as increased new project awards with existing customers.\n50\nLiquidity and Capital Resources\nOverview\nWe plan to fund our working capital, capital expenditures, debt service, dividends and other cash requirements with our current available liquidity and cash from operations, which could be affected by general economic, financial, competitive, legislative, regulatory, business and other factors, many of which are beyond our control. Management monitors financial markets and national and global economic conditions for factors that may affect our liquidity and capital resources. \nAs set forth below, we have various short-term and long-term cash requirements and capital allocation priorities, and we intend to fund these requirements primarily with cash flow from operating activities, as well as debt financing as needed.\nCash Requirements and Capital Allocation\nCash Requirements. \nThe following table summarizes, as of December 31, 2024, our cash requirements from contractual obligations that are due within the twelve months subsequent to December 31, 2024 and thereafter, excluding certain amounts discussed below (in thousands):\nDue in 2025\nDue Thereafter\nTotal\nLong-term debt, including current portion - principal \n$\n51,039 \n$\n3,984,274 \n$\n4,035,313 \nLong-term debt - cash interest \n(1)\n137,538 \n886,285 \n1,023,823 \nOperating lease obligations \n(2)\n107,468 \n247,365 \n354,833 \nFinance lease obligations \n(2)\n13,225 \n41,826 \n55,051 \nShort-term lease obligations\n27,345 \n— \n27,345 \nEquipment purchase commitments \n(3)\n68,797 \n25,036 \n93,833 \nOther purchase commitments \n(4)\n117,730 \n36,267 \n153,997 \nCapital commitment related to investments in unconsolidated affiliates\n (5)\n19,667 \n48,936 \n68,603 \nTotal cash requirements from contractual obligations\n$\n542,809 \n$\n5,269,989 \n$\n5,812,798 \n(1)\n    \nAmounts represent cash interest and other financing expenses associated primarily with our senior notes. Interest payments related to our senior credit facility and commercial paper program are not included due to their variable interest rates. With respect to this variable rate debt, assuming the principal amount outstanding and interest rate in effect as of December 31, 2024 remained the same, the annual cash interest expense would be approximately \n$42.1 million\n related to the term loan payable until October 8, 2026, the maturity date of the term loan, and \n$1.1 million\n related to the revolving loans payable until July 31, 2029, the maturity date of our senior credit facility. \n(2)    \nAmounts represent undiscounted operating and finance lease obligations as of December 31, 2024. The corresponding amounts recorded on our December 31, 2024 consolidated balance sheet represent the present value of these amounts.\n(3)    \nAmounts represent capital committed for the purchase of equipment. We expect that some of these orders will be assigned to third-party leasing companies and made available to us under certain of our master equipment lease agreements.\n(4)    \nAmounts represent other purchase commitments not reflected in our consolidated balance sheet, primarily for inventory and general and administrative services, including information technology services.\n(5)    \nAmounts represen\nt estimates of capital commitments for investments in unconsolidated affiliates, including $45.0 million\n related to a limited partnership interest in a \nfund that targets investments in certain portfolio companies that operate businesses related to the transition to a reduced-carbon economy.\nExcluded from the table above are firm purchase commitments for materials and certain subcontractor costs in the normal course of business that primarily support direct project costs on existing contractual arrangements with our customers. These firm purchase commitments are not reflected in our consolidated balance sheet and are not expected to impact future liquidity as amounts are anticipated to be included in customer billings. As of December 31, 2024, these commitments are estimated to represent approximately 10% of our annual cost of services, with the substantial majority of the commitments payable in the year ending December 31, 2025. Also excluded from the table above and not reflected in our consolidated balance sheet are our commitments to purchase certain production tax credits as described in more detail in Note 16 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report. \nContingent Obligations\n. We have various contingent obligations that could require the use of cash or impact the collection of cash in future periods; however, we are unable to accurately predict the timing and estimate the amount of such contingent obligations as of December 31, 2024. These contingent obligations generally include, among other things: \n•\ncontingent consideration liabilities, which are described further in Note 6 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report;\n \n51\n•\nundistributed earnings of foreign subsidiaries and unrecognized tax benefits, which are described further in Note 12 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report;\n•\ncollective bargaining agreements and multiemployer pension plan liabilities, as well as liabilities related to our deferred compensation and other employee benefit plans, which are described further in Notes 15 and 16 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report; and\n•\nobligations relating to our joint ventures, lawsuits and other legal proceedings, uncollectible accounts receivable, insurance liabilities, obligations relating to letters of credit, bonds and parent guarantees, obligations relating to employment agreements, indemnities and assumed liabilities, and residual value guarantees, which are described further in Notes 4, 10, 11 and 16 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report\n.\nCapital Allocation\n. Our capital deployment priorities that require the use of cash include: (i) working capital to fund ongoing operating needs, (ii) capital expenditures to meet anticipated demand for our services, (iii) acquisitions and investments to facilitate the long-term growth and sustainability of our business, and (iv) return of capital to stockholders, including through the payment of dividends and repurchases of our outstanding common stock. Our industry is capital intensive, and we expect substantial capital expenditures and commitments for equipment purchases and equipment lease and rental arrangements to be needed into the foreseeable future in order to meet anticipated demand for our services. We expect capital expenditures for property and equipment purchases for the year ended December 31, 2025 to be approximately $500 million to $550 million. We also expect to continue to allocate significant capital to strategic acquisitions and investments, as well as to pay dividends and to repurchase our outstanding common stock and/or debt securities. \nDuring 2024, we completed the acquisition of eight businesses in which a portion of the consideration, net of cash acquired, consisted of $1.75 billion in cash funded partially with a combination of cash and cash equivalents, borrowings from our commercial paper program and certain other financing transactions as described in \nFinancing Activities\n below. \nSubsequent to December 31, 2024, we completed the acquisitions of two businesses in which a portion of the consideration consisted of $374.9 million in cash paid on each respective acquisition date funded with a combination of cash and cash equivalents and borrowings from our commercial paper program. For additional information regarding our recent acquisitions, refer to Note 6 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report.\nWe anticipate that our future cash flows from operating activities, cash and cash equivalents on hand, existing borrowing capacity under our senior credit facility and commercial paper program and ability to access capital markets for additional capital will provide sufficient funds to enable us to meet our cash requirements for the next twelve months and over the longer term. \nSignificant Sources of Cash\nCash flow from operating activities is primarily influenced by demand for our services and operating margins but is also influenced by the timing of working capital needs associated with the various types of services that we provide. Our working capital needs may increase when we commence large volumes of work under circumstances where project costs are required to be paid before the associated receivables are billed and collected. Working capital needs are generally higher during the summer and fall due to increased demand for our services when favorable weather conditions exist in many of our operating regions. Conversely, working capital assets are typically converted to cash during the winter. These seasonal trends can be offset by changes in project timing due to delays or accelerations and other economic factors that may affect customer spending, including market conditions or the impact of certain unforeseen events (e.g., regulatory and other actions that impact the supply chain for certain materials). Additionally, operating cash flows may be negatively impacted as a result of unpaid and delayed change orders and claims. Changes in project timing due to delays or accelerations and other economic, regulatory, market and political factors that may affect customer spending could also impact cash flow from operating activities. Further information with respect to our cash flow from operating activities is set forth below and in Note 18 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report\n.\n52\nOur available commitments under our senior credit facility and cash and cash equivalents as of December 31, 2024 were as follows (in thousands):\nDecember 31, 2024\nTotal capacity available for revolving loans, credit support for commercial paper program and letters of credit\n$\n2,800,000 \nLess:\nBorrowings of revolving loans \n22,945 \nLetters of credit outstanding\n167,401 \nAvailable commitments for revolving loans, credit support for commercial paper program and letters of credit\n2,609,654 \nPlus:\nCash and cash equivalents \n(1)\n741,960 \nTotal available commitments under senior credit facility and cash and cash equivalents\n$\n3,351,614 \n(1)    \nFurther information with respect to our cash and cash equivalents is set forth below and in Note 17 of the Notes to Consolidated Financial Statements in Item 8. Financial Statements and Supplementary Data in Part II of this Annual Report. This amount includes $259.8 million in jurisdictions outside of the U.S., principally in Australia. There are currently no legal or economic restrictions that would materially impede our ability to repatriate such cash. \nOn July 31, 2024, we amended our senior credit facility to, among other things, (i) increase the aggregate commitments for revolving loans from $2.64 billion to $2.80 billion and (ii) extend the maturity date for revolving loans under the senior credit facility from October 8, 2026 to July 31, 2029. In August 2024, we issued $1.25 billion aggregate principal amount of senior notes and received net proceeds of $1.24 billion and used the proceeds to repay certain borrowings that were utilized to acquire CEI. For additional information regarding the amendment to our senior credit facility and the issuance of the senior notes, see Note 10 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report. \nWe consider our investment policies related to cash and cash equivalents to be conservative, as we maintain a diverse portfolio of what we believe to be high-quality cash and cash equivalent investments with short-term maturities. Additionally, subject to the conditions specified in the credit agreement for our senior credit facility, we have the option to increase the capacity of our senior credit facility, in the form of an increase in the revolving commitments, term loans or a combination thereof, from time to time, upon receipt of additional commitments from new or existing lenders by up to an additional (i) $400.0 million plus (ii) additional amounts so long as the Incremental Leverage Ratio Requirement (as defined in the credit agreement) is satisfied at the time of such increase. The Incremental Leverage Ratio Requirement requires, among other things, after giving pro forma effect to such increase and the use of proceeds therefrom, compliance with the credit agreement’s financial covenants as of the most recent fiscal quarter end for which financial statements were required to be delivered. Further information with respect to our debt obligations is set forth in Note 10 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report\n. \nWe may seek to access the capital markets from time to time to raise additional capital, increase liquidity as we deem necessary, refinance or extend the term of our existing indebtedness, fund acquisitions or otherwise fund our capital needs. While our financial strategy and consistent performance have allowed us to maintain investment grade ratings, our ability to access capital markets in the future depends on a number of factors, including our financial performance and financial position, our credit ratings, industry conditions, general economic conditions, our backlog, capital expenditure commitments, market conditions and market perceptions of us and our industry. \nSources and Uses of Cash, Cash Equivalents and Restricted Cash During the Years Ended December 31, 2024 and 2023\nIn summary, our cash flows for each period were as follows (in thousands):\n \nYear Ended December 31,\n \n2024\n2023\nNet cash provided by operating activities\n$\n2,081,196 \n$\n1,575,952 \nNet cash used in investing activities\n$\n(2,294,319)\n$\n(989,650)\nNet cash (used in) provided by financing activities\n$\n(305,636)\n$\n268,500 \n53\nOperating Activities\nNet cash provided by operating activities of $2.08 billion and $1.58 billion in 2024 and 2023 primarily reflected earnings adjusted for non-cash items and cash provided and used by the main components of working capital: “Accounts and notes receivable,” “Contract assets,” “Accounts payable and accrued expenses,” and “Contract liabilities.” Net cash provided by operating activities during the year ended December 31, 2023 was negatively impacted by incremental working capital requirements and the timing of the associated billings related to the large renewable transmission project in Canada as discussed further in Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report. \nDays sales outstanding (DSO) represents the average number of days it takes revenues to be converted into cash, which management believes is an important metric for assessing liquidity. A decrease in DSO has a favorable impact on cash flow from operating activities, while an increase in DSO has a negative impact on cash flow from operating activities. DSO is calculated by using the sum of current accounts receivable, net of allowance (which includes retainage and unbilled balances), plus contract assets less contract liabilities, and divided by average revenues per day during the quarter. DSO at December 31, 2024 was 59 days, which was lower than DSO of 68 days at December 31, 2023 and lower than our five-year historical average DSO of 79 days. This decrease in DSO as compared to December 31, 2023 was partially due to increased revenues, an increase in contract liabilities and a decrease in contract assets related to favorable billing terms on certain large projects. Negatively impacting DSO and cash flow from operating activities for both the years ended December 31, 2024 and 2023 were unapproved change orders and claims included in contract assets from the aforementioned large renewable transmission project in Canada. Also negatively impacting cash flow from operating activities for 2023 was our prepayment of amounts to suppliers for certain project materials that require a long lead time. \nInvesting Activities\nNet cash used in investing activities in the year ended 2024 included $1.75 billion related to acquisitions, $604.1 million of capital expenditures and $81.9 million cash paid primarily for non-integral equity method investments. Partially offsetting these items were $77.6 million of proceeds from the sale of, and insurance settlements related to, property and equipment; $31.4 million of proceeds from the disposition of a non-core business; and $29.2 million of proceeds from the sale of a non-integral equity investment. \nNet cash used in investing activities in 2023 included $651.6 million related to acquisitions and $434.8 million of capital expenditures. Partially offsetting these items were $69.3 million of proceeds from the sale of, and insurance settlements related to, property and equipment and $42.3 million of proceeds from the sale of certain non-integral equity investments.\nOur industry is capital intensive, and we expect substantial capital expenditures and commitments for equipment purchases and equipment lease and rental arrangements to be needed for the foreseeable future in order to meet anticipated demand for our services. In addition, we expect to continue to pursue strategic acquisitions and investments, although we cannot predict the timing or amount of the cash needed for these initiatives. We also have various other capital commitments that are detailed in \nCash Requirements and Capital Allocation\n above. \nFinancing Activities\nIn July 2024, we entered into, and borrowed the full amount available under, a $400.0 million 90-day term loan facility outside of our senior credit facility and utilized these borrowings, together with $1.20 billion of borrowings under our commercial paper program and cash on hand, to finance the acquisition of CEI, as well as pay certain related costs and expenses and fund certain working capital requirements. On August 9, 2024, we received net proceeds from the issuance of senior notes of $1.24 billion, net of the original issue discount and underwriting discounts, and used the proceeds to repay certain borrowings utilized to acquire CEI, including the full amount of the short-term term loan. Net cash provided by financing activities in the year ended December 31, 2024 included $830.8 million of net repayments under our senior credit facility and commercial paper program. Additionally, on October 1, 2024, we repaid the $500.0 million aggregate principal amount of 0.95% senior notes due October 2024. Financing costs paid directly by us during the year ended December 31, 2024 were $7.6 million, which related to the August 2024 issuance of senior notes, the short-term term loan and the amendment of our senior credit facility. Net cash used in financing activities in the year ended December 31, 2024 also included $155.6 million of payments to satisfy tax withholding obligations associated with stock-based compensation and the payment of $54.2 million of dividends. \nNet cash provided by financing activities in the year ended December 31, 2023 included $408.7 million of net borrowings under our senior credit facility and commercial paper program, partially offset by $119.8 million of payments to satisfy tax withholding obligations associated with stock-based compensation and $47.8 million of dividends.\nWe expect to continue to utilize cash for similar financing activities in the future, including repayments of our outstanding debt, payment of cash dividends and repurchases of our common stock and/or debt securities. \n54\nCritical Accounting Estimates\nThe discussion and analysis of our financial condition and results of operations are based on our consolidated financial statements, which have been prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities known to exist as of the date the consolidated financial statements are published and the reported amounts of revenues and expenses recognized during the periods presented. We review all significant estimates affecting our consolidated financial statements on a recurring basis and record the effect of any necessary adjustments prior to their publication. Judgments and estimates are based on our beliefs and assumptions derived from information available at the time such judgments and estimates are made. Uncertainties with respect to such estimates and assumptions are inherent in the preparation of financial statements. There can be no assurance that actual results will not differ from those estimates. Management has reviewed its development and selection of critical accounting estimates with the Audit Committee of our Board of Directors. Our accounting policies are primarily described in Notes 2 and 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report and should be read in conjunction with the accounting policies identified below that we believe affect our more significant estimates used in the preparation of our consolidated financial statements. \nRevenue Recognition \n-\n Contract Estimates and Changes in Estimates\nRefer to \nContract Estimates and Changes in Estimates\n in Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of a variety of factors that can cause changes in estimates and how changes in estimates on certain contracts may result in the issuance of change orders or claims under contracts for our projects. The quantitative impacts of changes in change orders and claims are also included therein.\nDue to the significant judgments utilized in the revenue and cost estimation process, if subsequent actual results and/or updated assumptions or estimates were to change from those utilized as of December 31, 2024, it could result in a material impact to our results of operations. As described in Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report, under fixed price contracts, as well as unit-price contracts with more than an insignificant amount of partially completed units, revenue is recognized as performance obligations are satisfied over time, with the percentage of completion generally measured as the percentage of costs incurred to total estimated costs for such performance obligation. Approximately 60.0% of our revenues recognized during the year ended December 31, 2024 were associated with this revenue recognition method. Refer to \nContract Estimates and Changes in Estimates\n in Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of the impacts in changes in estimates on revenue and gross profit during the years ended December 31, 2024, 2023 and 2022. \nCollectability of Accounts Receivable and Contract Assets\nRefer to \nAccounts Receivable, Allowance for Credit Losses and Concentrations of Credit Risk \nin Note 4 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of how we determine our allowance for credit losses, which is based on an estimate of expected credit losses for financial instruments, primarily accounts receivable (including unbilled receivables) and contract assets, as well as activity in the allowance for credit losses.\nShould anticipated collections fail to materialize, or if future economic conditions deteriorate, we could experience an increase in our allowance for credit losses. If our historical loss ratio had been 5 basis points higher or lower as of December 31, 2024, our provision for credit loss would have increased or decreased $2.9 million during the year ended December 31, 2024. \nAcquisitions\nContingent Consideration. \nRefer to \nContingent Consideration\n in Note 6 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of how contingent consideration liabilities are determined and the related assumptions and uncertainties utilized for our estimates, as well as the balances and account activity. The maximum amount payable related to these liabilities is also included therein.\nValuation of Long-Lived Assets.\n Refer to Notes 2 and 6 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of valuation of long-lived assets related to acquisitions (other intangible assets and property, plant and equipment), including assumptions and uncertainties related to our estimates, as well as amounts related to recent acquisitions. If we determine there is a change in the \n55\nvaluation of long-lived assets during the measurement period, the change in estimate would result in a change in the amount of goodwill. \nGoodwill, Other Intangible Assets and Property, Plant and Equipment\nIn connection with our annual goodwill assessments in 2024 and 2023, management performed a qualitative impairment assessment of our reporting units, which indicated that the fair value of our reporting units was greater than their carrying value including goodwill. Accordingly, a quantitative goodwill impairment test was not required, and no goodwill impairment was recognized in 2024 or 2023. Additionally, there were no material impairments related to other intangible assets or property, plant equipment in 2024 or 2023. Changes in facts and circumstances, judgments and assumptions used to determine these fair values, including with respect to market conditions and the economy, could result in impairment charges in the future that could be material to our financial statements. \nInsurance \nRefer to Notes 2 and 16 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of our insurance coverage, accounting policies related to insurance, accruals and related recoveries, as well as uncertainties of the related estimates. Our estimates of insurance liabilities related to employer’s liability, workers’ compensation, auto liability and general liability require us to make assumptions related to potential losses regarding our determination of amounts considered probable and estimable. We, along with our third-party actuary and third-party administrator, consider a number of factors when estimating our retained liability, including claims experience, demographic factors, severity factors and other actuarial assumptions. We periodically review our estimates and assumptions with our third-party actuary to assist us in determining the adequacy of our retained liability. As of December 31, 2024, the amount accrued for employer’s liability, workers’ compensation, auto liability and general liability totaled $373.6 million.\nAlthough we believe that we have reasonably estimated our insurance liability, it is possible that actual results could differ from recorded retained liabilities. Our insurance liability is based on a reasonable estimate provided by our third-party actuaries based on a statistical model that considers the cumulative probability distribution of all possible loss estimates.\nIncome Taxes \nRefer to Notes 2 and 12 of the Notes to Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n in Part II of this Annual Report for a description of our accounting policies related to income taxes, the identification and measurement of deferred tax assets and liabilities, the measurement of valuation allowances on deferred tax assets, benefits from uncertain tax positions and the amount of unrecognized tax benefits that are reasonably possible of being adjusted within 12 months due to the expiration of a statute of limitations and/or resolution of examinations with taxing authorities. \nThe evaluation of the recoverability of the deferred tax asset requires us to weigh all positive and negative evidence, including projected future taxable income and whether we will be able to utilize state and foreign net operating loss carryforwards, to determine whether it is more likely than not that all or some portion of the deferred tax assets will not be realized. Revisions to our forecasts, declining macroeconomic conditions or other factors could result in changes to our assessment of the realization of these deferred income tax assets.\nThe evaluation of uncertain tax positions involves significant estimates and judgments. Although we believe that our estimates and judgments are reasonable, we are occasionally challenged by various taxing authorities regarding the amount of taxes due. To the extent we prevail in matters for which a liability has been established, are required to pay amounts in excess of the established liability or experience a change in judgment, the change in the liability could increase or decrease income tax expense in the period of such determination.",
  "item2": null
}