{
  "source_file": "pypl-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2:  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, including statements that involve expectations, plans, or intentions (such as those relating to future business, future results of operations or financial condition, new or planned features or services, mergers or acquisitions, or management strategies). These forward-looking statements can be identified by words such as “may,” “will,” “would,” “should,” “could,” “expect,” “anticipate,” “believe,” “estimate,” “intend,” “continue,” “strategy,” “future,” “opportunity,” “plan,” “project,” “forecast,” and other similar expressions. These forward-looking statements involve risks and uncertainties that could cause our actual results and financial condition to differ materially from those expressed or implied in our forward-looking statements. Such risks and uncertainties include, among others, those discussed in Part I, Item 1A, Risk Factors in our Annual Report on Form 10-K for the year ended December 31, 2024 (the “2024 Form 10-K”), as supplemented in the risk factors set forth below in Part II, Item 1A, Risk Factors, of this Form 10-Q, as well as in our unaudited condensed consolidated financial statements, related notes, and the other information appearing in this report and our other filings with the Securities and Exchange Commission. We do not intend, and undertake no obligation except as required by law, to update any of our forward-looking statements after the date of this report to reflect actual results, new information, or future events or circumstances. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. You should read the following “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in conjunction with the unaudited condensed consolidated financial statements and the related notes that appear in this report. Unless otherwise expressly stated or the context otherwise requires, references to “we,” “our,” “us,” “the Company,” and “PayPal” refer to PayPal Holdings, Inc. and its consolidated subsidiaries.\nBUSINESS ENVIRONMENT \nTHE COMPANY\nAt PayPal, our mission is to revolutionize commerce globally. Our products are designed to enable digital payments and simplify commerce experiences for consumers and merchants to make selling, shopping, and sending and receiving money simple, personalized, and secure, online or offline, including mobile. Our two-sided platform serves millions of consumers and merchants worldwide. \nRegulatory environment\nWe operate globally and in a rapidly evolving regulatory environment characterized by a heightened focus by regulators globally on all aspects of the payments industry, including anti-money laundering, countering terrorist financing, privacy, cybersecurity, and consumer protection. The laws and regulations applicable to us, including those enacted prior to the advent of digital payments, continue to evolve through legislative and regulatory action and judicial interpretation. New or changing laws and regulations, including changes to their interpretation and implementation, as well as increased penalties and enforcement actions related to non-compliance, could have a material adverse impact on our business, results of operations, and financial condition. We monitor these areas closely and are focused on designing compliant solutions for our customers.\nCybersecurity and information security\nCybersecurity and information security risks for global payments and technology companies like us have increased significantly in recent years. Although we have developed systems and processes designed to protect the data we manage, prevent data loss and other security incidents, and enable us to effectively respond to known and potential risks, and expect to continue to expend significant resources to bolster these protections, we have experienced and expect to continue to experience cybersecurity incidents and remain subject to these risks. There can be no assurance that our security measures will provide sufficient protection or security to prevent breaches or attacks. For additional information regarding our cybersecurity and information security risks, see Part I, Item 1A, Risk Factors in our 2024 Form 10-K, as supplemented and, to the extent inconsistent, superseded below (if applicable) in Part II, Item 1A, Risk Factors of this Form 10-Q. \nMACROECONOMIC ENVIRONMENT\nA deterioration in macroeconomic conditions resulting from uncertainties and effects from tariffs, higher inflation rates, international conflicts, and higher interest rates could continue to increase the risk of lower consumer spending, merchant and consumer bankruptcy, insolvency, business failure, higher credit losses, foreign exchange fluctuations, or other business interruption, which may adversely impact our business. We are unable to reasonably estimate the total potential impact on our financial results that may ultimately result from such changes in the macroeconomic environment.\n49\nTable of Contents\nOVERVIEW OF RESULTS OF OPERATIONS\nThe following table provides a summary of our condensed consolidated financial results for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended September 30,\nPercent Increase/(Decrease)\nNine Months Ended September 30,\nPercent Increase/(Decrease)\n2025\n2024\n2025\n2024\n(In millions, except percentages and per share data)\nNet revenues\n$\n8,417 \n$\n7,847 \n7 \n%\n$\n24,496 \n$\n23,431 \n5 \n%\nOperating expenses\n6,897 \n6,456 \n7 \n%\n19,942 \n19,547 \n2 \n%\nOperating income\n1,520 \n1,391 \n9 \n%\n4,554 \n3,884 \n17 \n%\nOperating margin\n18 \n%\n18 \n%\n**\n19 \n%\n17 \n%\n**\nOther income (expense), net\n13 \n(80)\n116 \n%\n111 \n35 \n217 \n%\nIncome tax expense\n285 \n301 \n(5)\n%\n869 \n893 \n(3)\n%\nEffective tax rate\n19 \n%\n23 \n%\n**\n19 \n%\n23 \n%\n**\nNet income (loss)\n$\n1,248 \n$\n1,010 \n24 \n%\n$\n3,796 \n$\n3,026 \n25 \n%\nNet income (loss) per diluted share\n$\n1.30 \n$\n0.99 \n32 \n%\n$\n3.88 \n$\n2.89 \n34 \n%\nNet cash provided by operating activities\n$\n1,974 \n$\n1,614 \n22 \n%\n$\n4,032 \n$\n5,056 \n(20)\n%\nAll amounts in tables are rounded to the nearest million, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided.\n** Not meaningful. \nTHREE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024 \nNet revenues increased $570 million, or 7%, in the three months ended September 30, 2025 compared to the same period of the prior year driven primarily by growth in total payment volume (“TPV”) of 8% and an increase in interest and fee revenue earned on our loans receivable portfolio. \nTotal operating expenses increased $441 million, or 7%, in the three months ended September 30, 2025 compared to the same period of the prior year due primarily to an increase in transaction expense and transaction and credit losses.\nOperating income increased $129 million, or 9%, in the three months ended September 30, 2025 compared to the same period of the prior year due to the increase in net revenues partially offset by the increase in operating expenses. Our operating margin remained consistent at 18% for both the three months ended September 30, 2025 and 2024 reflecting the positive impact of a lower transaction expense growth rate offset by a higher transaction and credit losses growth rate.\nNet income increased $238 million, or 24%, in the three months ended September 30, 2025 compared to the same period of the prior year due to the previously discussed increase in operating income of $129 million and an increase in other income (expense), net of $93 million.\nNINE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024\nNet revenues increased $1.1 billion, or 5%, in the nine months ended September 30, 2025 compared to the same period of the prior year driven primarily by growth in TPV of 6% and an increase in interest and fee revenue earned on our loans receivable portfolio. \nTotal operating expenses increased $395 million, or 2%, in the nine months ended September 30, 2025 compared to the same period of the prior year due primarily to an increase in transaction and credit losses and sales and marketing expense partially offset by a decline in restructuring and other expenses.\nOperating income increased $670 million, or 17%, in the nine months ended September 30, 2025 compared to the same period of the prior year due to the increase in net revenues partially offset by the increase in operating expenses. Our operating margin was 19% and 17% in the nine months ended September 30, 2025 and 2024, respectively, reflecting the positive impact of a lower transaction expense growth rate.\n50\nTable of Contents\nNet income increased $770 million, or 25%, in the nine months ended September 30, 2025 compared to the same period of the prior year due to the previously discussed increase in operating income of $670 million and an increase of $76 million in other income (expense), net. \nIMPACT OF FOREIGN EXCHANGE RATES\nWe have significant international operations that are denominated in foreign currencies, primarily the British pound, Euro, Australian dollar, and Canadian dollar, subjecting us to foreign exchange risk which may adversely impact our financial results. The strengthening or weakening of the United States (“U.S.”) dollar versus foreign currencies in which we conduct our international operations impacts the translation of our net revenues and expenses generated in these foreign currencies into the U.S. dollar. We generated approximately 44% and 43% of our net revenues from customers domiciled outside of the U.S. in the three and nine months ended September 30, 2025, respectively. We generated approximately 42% of our net revenues from customers domiciled outside of the U.S. in both the three and nine months ended September 30, 2024. Because we generate substantial net revenues internationally, we are subject to the risks of doing business outside of the U.S. See Part I, Item 1A, Risk Factors in our 2024 Form 10-K, as supplemented and, to the extent inconsistent, superseded (if applicable) below in Part II, Item 1A, Risk Factors of this Form 10-Q.\nWe calculate the year-over-year impact of foreign exchange rate movements on our business using prior period foreign exchange rates applied to current period transactional currency amounts. While changes in foreign exchange rates affect our reported results, we have a foreign currency exposure management program in which we use foreign exchange contracts, designated as cash flow hedges, intended to reduce the impact on earnings from foreign exchange rate movements. Gains and losses from these foreign exchange contracts are recognized as a component of transaction revenues or operating expenses (as applicable) in the same period the forecasted transactions impact earnings.\nIn the three and nine months ended September 30, 2025, year-over-year foreign exchange rate movements relative to the U.S. dollar had the following impact on our reported results:\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\n(In millions)\nFavorable impact to net revenues (exclusive of hedging impact)\n$\n134 \n$\n141 \nHedging impact\n(49)\n(84)\nFavorable impact to net revenues \n85 \n57 \nUnfavorable impact to operating expenses\n(69)\n(67)\nNet favorable (unfavorable) impact to operating income\n$\n16 \n$\n(10)\nWhile we enter into foreign exchange contracts to help reduce the impact on earnings from foreign exchange rate movements, it is impossible to eliminate the total effects of this exposure.\nPrior to 2025, we used foreign exchange contracts, designated as net investment hedges, to reduce the foreign exchange risk related to our investment in certain foreign subsidiaries. Gains and losses associated with these instruments will remain in accumulated other comprehensive income (loss) until the underlying foreign subsidiaries are sold or substantially liquidated.\nGiven that we also have foreign exchange risk on our assets and liabilities denominated in currencies other than the functional currency of our subsidiaries, we have an additional balance sheet foreign currency exposure management program in which we use foreign exchange contracts to help offset the impact of foreign exchange rate movements on our assets and liabilities. The foreign exchange gains and losses on our assets and liabilities are recorded in other income (expense), net, and are offset by the gains and losses on the foreign exchange contracts. These foreign exchange contracts reduce, but do not entirely eliminate, the impact of foreign exchange rate movements on our assets and liabilities.\nAdditionally, in connection with transactions occurring in multiple currencies on our payments platform, we generally set our foreign exchange rates daily and may face financial exposure if we incorrectly set our foreign exchange rates or as a result of fluctuations in foreign exchange rates between the times that we set our foreign exchange rates and when transactions occur. While we have processes in place to mitigate these risks, it is impossible to eliminate the total effects of any possible exposure associated with setting foreign exchange rates on our payments platform. \n51\nTable of Contents\nKEY METRICS AND FINANCIAL RESULTS\nKEY METRICS\nTPV, number of payment transactions, active accounts, and number of payment transactions per active account are key non-financial performance metrics (“key metrics”) that management uses to measure the scale of our platform and the relevance of our products and services to our customers, and are defined as follows:\n•\nTPV\n \nis the value of payments, net of payment reversals, successfully completed on our payments platform or enabled by PayPal via a partner payment solution, not including gateway-exclusive transactions. \n•\nNumber of payment transactions\n \nis the total number of payments, net of payment reversals, successfully completed on our payments platform or enabled by PayPal via a partner payment solution, not including gateway-exclusive transactions. \n•\nAn\n \nactive account\n is an account registered directly with PayPal or a platform access partner that has completed a transaction on our platform, not including gateway-exclusive transactions, within the past 12 months. A platform access partner is a third party whose customers are provided access to PayPal’s platform or services through such third-party’s login credentials, including individuals and entities that utilize Hyperwallet’s payout capabilities. A user may register on our platform to access different products and may register more than one account to access a product. Accordingly, a user may have more than one active account. The number of active accounts provides management with additional perspective on the overall scale of our platform, but may not have a direct relationship to our operating results.\n•\nNumber of payment transactions per active account\n \nreflects the total number of payment transactions within the previous 12-month period, divided by active accounts at the end of the period. The number of payment transactions per active account provides management with insight into the average number of times an account engages in payments activity on our payments platform in a given period. The number of times a consumer account or a merchant account transacts on our platform may vary significantly from the average number of payment transactions per active account.\nAs our transaction revenue growth is typically correlated with TPV growth and the number of payment transactions completed on our payments platform, management uses these metrics to gain insights into the scale and strength of our payments platform, the engagement level of our customers, and underlying activity and trends which may be indicators of current and future performance. We present these key metrics to enhance investors’ evaluation of the performance of our business and operating results.\nOur key metrics are calculated using internal company data based on the activity we measure on our payments platform and compiled from multiple systems, including systems that are internally developed or acquired through business combinations. While the measurement of our key metrics is based on what we believe to be reasonable methodologies and estimates, there are inherent challenges and limitations in measuring our key metrics globally at scale. The methodologies used to calculate our key metrics require significant judgment. We regularly review our processes for calculating these key metrics, and from time to time we may make adjustments to improve the accuracy or relevance of our metrics. For example, we continuously apply models, processes, and practices designed to detect and prevent fraudulent account creation on our platforms, and work to improve and enhance those capabilities. When we detect a significant volume of illegitimate activity, we generally remove the activity identified from our key metrics. Although such adjustments may impact key metrics reported in prior periods, we generally do not update previously reported key metrics to reflect these subsequent adjustments unless the retrospective impact of process improvements or enhancements is determined by management to be material.\n52\nTable of Contents\nNET REVENUES\nOur revenues are classified into the following two categories:\n•\nTransaction revenues\n:\n Net transaction fees charged to merchants and consumers on a transaction basis based on the TPV completed on our payments platform. Growth in TPV is directly impacted by the number of payment transactions that we enable on our payments platform. We generate additional revenue from merchants and consumers: on transactions where we perform currency conversion, when we enable cross-border transactions (i.e., transactions where the merchant and consumer are in different countries), to facilitate the instant transfer of funds for our customers from their PayPal or Venmo account to their bank account or debit card, to facilitate the purchase and sale of cryptocurrencies, as contractual compensation from sellers that violate our contractual terms (for example, through fraud or counterfeiting), and other miscellaneous fees.\n•\nRevenues from other value added services\n: \nNet revenues derived primarily from revenue earned through partnerships, referral fees, subscription fees, gateway fees, and other services we provide to our consumers and merchants. We also earn revenues from interest and fees earned on our portfolio of loans receivable, and interest earned on certain assets underlying customer balances.\nNet revenue analysis\nThe components of our net revenues for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\n53\nTable of Contents\nTransaction revenues\nTransaction revenues increased $455 million, or 6%, and $725 million, or 3%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in the three months ended September 30, 2025 was driven primarily by an increase of approximately $390 million in revenue from PayPal and Venmo products and services, which was largely driven by growth in TPV and number of payment transactions, and an increase in revenue from Braintree products and services of approximately $115 million predominantly attributable to growth in TPV despite a decline in the number of payment transactions over the same period. The increase in the nine months ended September 30, 2025 was primarily attributable to an increase of approximately $1.0 billion in revenue from PayPal and Venmo products and services, which was largely driven by growth in TPV and number of payment transactions, partially offset by a decline in revenue from Braintree products and services of approximately $140 million resulting from a reduction in number of payment transactions. The increase in TPV for Braintree products and services despite a decline in the number of payment transactions is due to our strategic shift as we focus on profitable growth. Transaction revenues in the three and nine months ended September 30, 2025 were also impacted by an unfavorable impact from hedging activities.\nAs a result of our stronger focus on profitable growth and ongoing negotiations with merchants, we experienced lower volume and transaction revenue from our Braintree offerings in the first half of 2025. As noted above, in the third quarter of 2025, revenue and TPV from Braintree offerings grew year-over-year. In the fourth quarter of 2025, we expect volume from our Braintree offerings to continue to grow.\nThe graphs below present the respective key metrics (in millions) for the three and nine months ended September 30, 2025 and 2024:\n*Reflects active accounts at the end of the applicable period.\nNumber of payment transactions\n54\nTable of Contents\nTPV\nThe following table provides a summary of related metrics:\nThree Months Ended September 30,\nPercent Increase/(Decrease)\nNine Months Ended September 30,\nPercent Increase/(Decrease)\n2025\n2024\n2025\n2024\nNumber of payment transactions per active account\n57.6 \n61.4 \n(6)\n%\n57.6 \n61.4 \n(6)\n%\nPercent of cross-border TPV\n(1)\n12 \n%\n12 \n%\n**\n12 \n%\n12 \n%\n**\n(1) \nCross-border TPV occurs primarily between two PayPal accounts in different countries and includes transactions initiated through our Xoom product.\n** Not meaningful.\nWe had active accounts of 438 million and 432 million as of September 30, 2025 and 2024, respectively, an increase of 1%. Our total number of payment transactions was 6.3 billion and 6.6 billion for the three months ended September 30, 2025 and 2024, respectively, a decrease of 5%. Our total number of payment transactions was 18.6 billion for the nine months ended September 30, 2025, compared to 19.7 billion in the nine months ended September 30, 2024, a decrease of 6%. TPV was $458 billion and $423 billion for the three months ended September 30, 2025 and 2024, respectively, an increase of 8%. TPV was $1.3 trillion for the nine months ended September 30, 2025 compared to $1.2 trillion in the nine months ended September 30, 2024, an increase of 6%.\nTransaction revenues growth was lower than the growth in TPV in the three and nine months ended September 30, 2025 compared to the same periods in the prior year due primarily to changes in product mix and unfavorable impact from foreign exchange hedging activities.\nRevenues from other value added services\nRevenues from other value added services increased $115 million, or 15%, and $340 million, or 16%, in the three and nine months ended September 30, 2025 compared to the same periods in the prior year due primarily to an increase of approximately $65 million and $220 million, respectively, in interest and fee revenue earned from our loans receivable portfolios as well as an increase of approximately $50 million and $100 million, respectively, from revenue earned from an independent chartered financial institution (“partner institution”). Revenue from the partner institution is earned primarily through revenue share associated with our U.S. revolving consumer credit product and PayPal and Venmo branded credit cards. \n55\nTable of Contents\nOPERATING EXPENSES\nThe following table summarizes our operating expenses and related metrics we use to assess the trends in each:\nThree Months Ended September 30,\nPercent Increase/(Decrease)\nNine Months Ended September 30,\nPercent Increase/(Decrease)\n2025\n2024\n2025\n2024\n(In millions, except percentages)\nTransaction expense \n$\n4,063 \n$\n3,841 \n6 \n%\n$\n11,735 \n$\n11,700 \n— \n%\nTransaction and credit losses\n483 \n352 \n37 \n%\n1,330 \n1,008 \n32 \n%\nCustomer support and operations\n447 \n427 \n5 \n%\n1,258 \n1,317 \n(4)\n%\nSales and marketing\n521 \n508 \n3 \n%\n1,592 \n1,375 \n16 \n%\nTechnology and development\n801 \n746 \n7 \n%\n2,299 \n2,206 \n4 \n%\nGeneral and administrative\n513 \n519 \n(1)\n%\n1,477 \n1,553 \n(5)\n%\nRestructuring and other\n69 \n63 \n10 \n%\n251 \n388 \n(35)\n%\nTotal operating expenses\n$\n6,897 \n$\n6,456 \n7 \n%\n$\n19,942 \n$\n19,547 \n2 \n%\nTransaction expense rate\n(1)\n0.89 \n%\n0.91 \n%\n**\n0.89 \n%\n0.94 \n%\n**\nTransaction and credit loss rate\n(2)\n0.11 \n%\n0.08 \n%\n**\n0.10 \n%\n0.08 \n%\n**\n (1) \nTransaction expense rate is calculated by dividing transaction expense by TPV. \n (2) \nTransaction and credit loss rate is calculated by dividing transaction and credit losses by TPV. \n ** Not meaningful.\nTransaction expense\nTransaction expense for the three and nine months ended September 30, 2025 and 2024 was as follows (in millions):\nTransaction expense increased $222 million, or 6%, and stayed relatively consistent, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in transaction expense for the three and nine months ended September 30, 2025 was primarily attributable to the increase in TPV of 8% and 6%, respectively, partially offset by favorable changes in merchant mix to lower cost merchants within our Braintree products and services. The decline in transaction expense rate for the three and nine months ended September 30, 2025 compared to the same periods of the prior year was primarily attributable to a lower proportion of TPV from Braintree products and services and changes in merchant mix.\nOur transaction expense rate is impacted by changes in product mix, merchant mix, regional mix, funding mix, and fees paid to payment processors and other financial institutions. The cost of funding a transaction with a credit or debit card is generally higher than the cost of funding a transaction from a bank or through internal sources such as a PayPal or Venmo account balance or our consumer credit products. The cost of funding a transaction is also impacted by the geographic region or country in which a transaction occurs, as we generally pay lower rates for transactions funded with credit or debit cards outside the U.S. For the three months ended September 30, 2025 and 2024, approximately 38% and 37%, respectively, of TPV was generated outside of the U.S. For the nine months ended September 30, 2025 and 2024, approximately 37% and 36%, respectively, of TPV was generated outside of the U.S.\n56\nTable of Contents\nTransaction and credit losses\nThe components of our transaction and credit losses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nTransaction and credit losses increased $131 million, or 37%, and $322 million, or 32%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. \nTransaction losses increased $133 million, or 50%, and $275 million, or 35%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. Transaction loss rate (transaction losses divided by TPV) was 0.09% and 0.08% for the three and nine months ended September 30, 2025, respectively, compared to 0.06% for both the three and nine months ended September 30, 2024. The increase in transaction losses and the associated transaction loss rate in the three and nine months ended September 30, 2025 compared to the same periods of the prior year was primarily due to an increase in losses driven by fraud incidents from our PayPal products and services. \nCredit losses decreased $2 million and increased $47 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods of the prior year. The components of credit losses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n(3)\n2024\n2025\n(3)\n2024\nNet charge-offs\n(1)\n$\n90 \n$\n81 \n$\n243 \n$\n295 \nReserve build (release)\n(2)\n(4)\n7 \n29 \n(70)\nCredit losses\n$\n86 \n$\n88 \n$\n272 \n$\n225 \n(1) \nNet charge-offs includes principal charge-offs partially offset by recoveries for consumer and merchant receivables. \n(2) \nReserve build (release) represents change in allowance for principal receivables excluding foreign currency remeasurement. \n(3) \nIncludes the reversal of allowance associated with reclassification of certain loans receivable to held for sale.\nCredit losses in the three and nine months ended September 30, 2025 were primarily attributable to loan originations during the period, partially offset by the reclassification of certain loans to held for sale. Credit losses in the three and nine months ended September 30, 2024 were attributable to loan originations during the period partially offset by improvement in the credit quality of loans outstanding. \n57\nTable of Contents\nConsumer loan portfolio\nWe have entered into forward flow arrangements with third-party investors to sell certain loans receivable portfolios. As of September 30, 2025 and 2024, loans and interest receivable, held for sale was $1.4 billion and $471 million, respectively. In third quarter of 2025, we reclassified $574 million of U.S. consumer short-term, non-interest bearing installment loans to held for sale.\nThe consumer loans and interest receivable balance as of September 30, 2025 and 2024 was $5.2 billion and $5.1 billion, respectively, net of participation interest sold, representing an increase of 1%. The increase was driven primarily by growth of our installment credit products in the U.S. and Japan of approximately $225 million and $190 million, respectively, and an increase in our revolving credit product in the United Kingdom (“U.K.”) of approximately $160 million. The consumer loans and interest receivable balance was also impacted by the reclassification of our U.S. short-term, non-interest bearing installment loans to held for sale in the third quarter of 2025. \nThe following table provides information regarding the credit quality of our consumer loans and interest receivable balance: \nSeptember 30,\n2025\n2024\nPercent of consumer loans and interest receivable current\n96.3 \n%\n95.9 \n%\nPercent of consumer loans and interest receivable > 90 days outstanding\n(1)\n1.5 \n%\n1.7 \n%\nNet charge-off rate\n(2)\n4.5 \n%\n4.6 \n%\n(1) \nRepresents percentage of balances which are 90 days past the billing date or contractual repayment date, as applicable.\n(2) \nNet charge-off rate is the annualized ratio of net credit losses during the three months ended September 30, 2025 and 2024, excluding fraud losses, on consumer loans as a percentage of the average daily amount of consumer loans and interest receivable balance during the same period.\nIn response to changing portfolio performance and macroeconomic environment, we continue to monitor risk and evaluate and modify our acceptable risk parameters. Modifications to the acceptable risk parameters did not have a material impact on our consumer loans for the three and nine months ended September 30, 2025.\nMerchant loan portfolio\nWe offer access to merchant finance products for certain small and medium-sized businesses, which we refer to as our merchant finance offerings. Total merchant loans, advances, and interest and fees receivable outstanding, net of participation interest sold, as of September 30, 2025 and 2024 was $1.7 billion and $1.4 billion, respectively, reflecting an increase of 28%. The increase was due primarily to growth in our PayPal Business Loans product in the U.S. of approximately $250 million and growth in our PayPal Working Capital product portfolio, primarily from Germany, the U.S., and the U.K., of approximately $130 million.\nThe following table provides information regarding the credit quality of our merchant loans, advances, and interest and fees receivable balance:\nSeptember 30,\n2025\n2024\nPercent of merchant loans, advances, and interest and fees receivable current\n90.2 \n%\n91.3 \n%\nPercent of merchant loans, advances, and interest and fees receivable > 90 days outstanding\n(1)\n3.5 \n%\n2.8 \n%\nNet charge-off rate\n(2)\n7.3 \n%\n8.3 \n%\n(1) \nRepresents percentage of balances which are 90 days past the original expected or contractual repayment period, as applicable.\n(2) \nNet charge-off rate is the annualized ratio of net credit losses during the three months ended September 30, 2025 and 2024, excluding fraud losses, on merchant loans and advances as a percentage of the average daily amount of merchant loans, advances, and interest and fees receivable balance during the same period.\nIn response to changing portfolio performance and macroeconomic environment, we continue to monitor risk and evaluate and modify our acceptable risk parameters. Modifications to the acceptable risk parameters did not have a material impact on our merchant loans for the three and nine months ended September 30, 2025.\nFor additional information, see “Note 11—Loans and Interest Receivable” in the notes to the condensed consolidated financial statements in Part I, Item 1 of this Form 10-Q.\n58\nTable of Contents\nCustomer support and operations \nCustomer support and operations expenses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nCustomer support and operations expenses increased $20 million, or 5%, and decreased $59 million, or 4%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in the three months ended September 30, 2025 was due primarily to an increase in other operating charges, partially offset by a decline in employee-related costs and software expenses. The decrease in the nine months ended September 30, 2025 was primarily attributable to a decline in employee-related costs and software expenses, partially offset by an increase in other operating charges. \nSales and marketing\nSales and marketing expenses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nSales and marketing expenses increased $13 million, or 3%, and $217 million, or 16%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The increase in the three months ended September 30, 2025 was due primarily to higher spend on marketing and brand advertising, including our Venmo Everything advertising campaign, partially offset by lower costs associated with Honey rewards programs. The increase in the nine months ended September 30, 2025 was primarily due to higher spend of approximately $265 million on marketing and brand advertising, including our PayPal Everywhere and Venmo Everything advertising campaigns, partially offset by lower employee-related costs and lower costs associated with Honey rewards programs.\n59\nTable of Contents\nTechnology and development\nTechnology and development expenses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nTechnology and development expenses increased $55 million, or 7%, and $93 million, or 4%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year due primarily to increases in contractor and consultant costs, costs from cloud computing services utilized in delivering our products and services, and software maintenance costs. Technology and development expenses in the nine months ended September 30, 2025 were also impacted by an increase in employee-related costs, partially offset by a decline in depreciation and amortization expense.\nGeneral and administrative\nGeneral and administrative expenses for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nGeneral and administrative expenses decreased $6 million, or 1%, and $76 million, or 5%, in the three and nine months ended September 30, 2025 compared to the same periods of the prior year. The decrease in the three months ended September 30, 2025 was due primarily to a decline in employee-related costs, partially offset by an increase in indirect tax expense. The decrease in the nine months ended September 30, 2025 was primarily attributable to declines in employee-related costs, indirect tax expense, and contingency reserve compared to the prior period, partially offset by increases in professional services expense and costs associated with enterprise software services.\n60\nTable of Contents\nRestructuring and other\nRestructuring and other for the three and nine months ended September 30, 2025 and 2024 were as follows (in millions):\nRestructuring and other increased $6 million and decreased $137 million in the three and nine months ended September 30, 2025, respectively, compared to the same periods of the prior year.\nDuring the second quarter of 2025, management undertook a large-scale initiative (the “Q2 2025 Plan”) to reengineer our existing technology infrastructure to improve scalability, reduce network latency, decrease operational costs, and optimize our workforce. The Q2 2025 Plan is a transformative unified program designed to streamline operations and includes exiting certain data centers to migrate to more efficient cloud-based solutions. The plan is expected to be executed over a period of 18 to 42 months with the workforce component to be substantially completed in 2027 and the technology infrastructure component to be substantially completed in 2028. The associated restructuring charges during the three and nine months ended September 30, 2025 were de minimis and $96 million and included employee severance and benefits costs. \nIn connection with this restructuring, we expect to incur employee severance and benefits costs of approximately $90 million to $100 million, asset impairment and accelerated depreciation charges of approximately $40 million to $60 million, and other restructuring costs of approximately $110 million to $140 million over the term of the Q2 2025 Plan. Other restructuring costs relate to process re-engineering and one-time migration to cloud solutions and consist of contractor costs, consulting fees, and prepaid software and maintenance costs without future economic benefit. We expect annualized cost savings of approximately $280 million associated with the impacted workforce, including stock-based compensation, and operational costs for our technology infrastructure. We expect that we will begin to realize these cost savings upon the completion of the components of the Q2 2025 Plan, and also expect to reinvest a portion of the reduction in annual costs to drive business priorities. The timing of activities, cost, and savings estimates continue to be developed and are subject to change.\nDuring the first quarter of 2025, management initiated a workforce reduction to ensure compliance with a new regulation impacting operations in an international market. The associated restructuring charges during the nine months ended September 30, 2025 were $36 million and included employee severance and benefits costs, which were completed in the third quarter of 2025. We do not anticipate cost savings in conjunction with this reduction.\nFor information on the associated restructuring liabilities, see “Note 17—Restructuring and Other” in the notes to the condensed consolidated financial statements in Part I, Item 1 of this Form 10-Q.\nDuring the first quarter of 2024, management initiated a global workforce reduction intended to streamline operations, focus resources on core strategic priorities, and improve our cost structure. The associated restructuring charges during the three and nine months ended September 30, 2024 were $36 million and $294 million, respectively, and included employee severance and benefits costs and stock-based compensation expense, which were substantially completed in the fourth quarter of 2024. \nDuring the three and nine months ended September 30, 2025, approximately $70 million and $122 million, respectively, of losses were recorded in restructuring and other, which included net loss on sale of loans and interest receivable previously held for sale and fair value adjustments to measure loans and interest receivable, held for sale, at the lower of cost or fair value. During the three and nine months ended September 30, 2024, approximately $28 million and $92 million, respectively, of losses were recorded in restructuring and other, which included net loss on sale of loans and interest receivable previously held for sale and fair value adjustments to measure loans and interest receivable, held for sale, at the lower of cost or fair value.\n61\nTable of Contents\nOther income (expense), net\nOther income (expense), net increased $93 million and $76 million in the three and nine months ended September 30, 2025 compared to the same periods of the prior year due primarily to net gains on strategic investments in the current periods compared to net losses and impairments in the prior periods, which contributed increases of approximately $180 million and $295 million, respectively, partially offset by declines in interest income of approximately $65 million and $115 million, respectively, resulting from lower average cash and investment balances year-over-year and lower interest rates. The nine months ended September 30, 2025 was also unfavorably impacted by foreign exchange losses in the current period compared to foreign exchange gains in the prior period and an increase in interest expense due to incremental expense from the March 2025 and May 2024 debt issuances. \nIncome tax expense\nOur effective income tax rate was 19% and 23% for the three months ended September 30, 2025 and 2024, respectively. The decrease in our effective tax rate for the three months ended September 30, 2025 compared to the same period of the prior year was due primarily to the impact of foreign income taxed at different rates, partially offset by discrete tax adjustments. \nOur effective income tax rate was 19% and 23% for the nine months ended September 30, 2025 and 2024, respectively. The decrease in our effective income tax rate for the nine months ended September 30, 2025 compared to the same period of the prior year was due primarily to discrete tax adjustments including tax effects of stock-based compensation, partially offset by the impact of foreign income taxed at different rates.\nLIQUIDITY AND CAPITAL RESOURCES\nWe require liquidity and access to capital to fund our global operations, including our customer protection programs, credit products, capital expenditures, investments in our business, potential acquisitions and strategic investments, stock repurchases and dividend payments, working capital, and other cash needs. We believe that our existing cash, cash equivalents, and investments, cash expected to be generated from operations, and our expected access to capital markets, together with potential external funding through third-party sources, will be sufficient to meet our cash requirements within the next 12 months and beyond.\nSOURCES OF LIQUIDITY\nCash, cash equivalents, and investments\nThe following table summarizes our cash, cash equivalents, and investments as of September 30, 2025 and December 31, 2024:\nSeptember 30, 2025\nDecember 31, 2024\n(In millions)\nCash, cash equivalents, and investments\n(1),(2)\n$\n12,759 \n$\n13,947 \n(1) \nExcludes assets related to funds receivable and customer accounts of $38.7 billion and $37.7 billion at September 30, 2025 and December 31, 2024, respectively.\n(2) \nExcludes total restricted cash of nil and $1 million\n \nat September 30, 2025 and December 31, 2024, respectively, and strategic investments of $1.6 billion at both September 30, 2025 and December 31, 2024.\nCash, cash equivalents, and investments held by our foreign subsidiaries were $7.1 billion and $8.5 billion at September 30, 2025 and December 31, 2024, or 56% and 61% of our total cash, cash equivalents, and investments as of those respective dates. At December 31, 2024, all of our cash, cash equivalents, and investments held by foreign subsidiaries were subject to U.S. taxation under Subpart F, Global Intangible Low Taxed Income or the one-time transition tax under the Tax Cuts and Jobs Act of 2017. Subsequent repatriations to the U.S. will not be taxable from a U.S. federal tax perspective except for any tax on foreign exchange gains and losses; however, they may be subject to state income or foreign withholding tax. \nA significant aspect of our global cash management activities involves meeting our customers’ requirements to access their cash while simultaneously meeting our regulatory financial ratio commitments in various jurisdictions. Our global cash balances are required not only to provide operational liquidity to our businesses, but also to support our global regulatory requirements across our regulated subsidiaries. Accordingly, not all of our cash is available for general corporate purposes. \n62\nTable of Contents\nCash flows\nThe following table summarizes our condensed consolidated statements of cash flows:\nNine Months Ended September 30,\n2025\n2024\n(In millions)\nNet cash provided by (used in):\nOperating activities\n$\n4,032 \n$\n5,056 \nInvesting activities\n1,095 \n(768)\nFinancing activities\n(4,009)\n(4,691)\nEffect of exchange rates on cash, cash equivalents, and restricted cash\n245 \n103 \nNet change in cash, cash equivalents, and restricted cash\n$\n1,363 \n$\n(300)\nOperating activities\nNet cash provided by operating activities declined $1.0 billion in the nine months ended September 30, 2025 compared to the same period of the prior year due primarily to changes in working capital of approximately $920 million driven primarily by a decline in current liabilities and an increase in actual cash transaction losses incurred during the period, an increase of approximately $870 million in originations of loans and interest receivable held for sale, net of sales and repayments, and an impact of approximately $300 million from net gains on strategic investments, partially offset by an increase of approximately $320 million in transaction and credit losses, and a decrease of $210 million in the accretion of discounts on investments, net of amortization premiums.\nIn both the nine months ended September 30, 2025 and 2024, cash paid for income taxes, net was $1.0 billion.\nInvesting activities \nNet cash provided by investing activities increased $1.9 billion in the nine months ended September 30, 2025 compared to the same period of the prior year due primarily to an increase of approximately $2.7 billion in maturities and sales, net of purchases of investments, and an increase of approximately $700 million in principal repayments of loans receivable, net of purchases and originations, partially offset by changes related to funds receivable of approximately $1.4 billion.\nFinancing activities\nNet cash used in financing activities decreased $682 million in the nine months ended September 30, 2025 compared to the same period of the prior year due primarily to cash inflows of approximately $1.4 billion from changes related to funds payable and amounts due to customers partially offset by a decline of approximately $850 million in borrowings under financing arrangements, net of repayments.\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash \nForeign currency exchange rates had a positive impact of $245 million and $103 million on cash, cash equivalents, and restricted cash for the nine months ended September 30, 2025 and 2024, respectively. The positive impact on cash, cash equivalents, and restricted cash in the nine months ended September 30, 2025 was due primarily to favorable fluctuations in the exchange rate of the U.S. dollar to the British pound and, to a lesser extent, the Euro and Australian dollar. The positive impact on cash, cash equivalents, and restricted cash in the nine months ended September 30, 2024 was due primarily to the favorable impact of fluctuations in the exchange rate of the U.S. dollar to the British pound. \nAvailable credit and debt\nIn March 2025, we issued fixed rate and floating rate notes with varying maturity dates for an aggregate principal amount of $1.5 billion. Proceeds from the issuance of these Notes may be used for general corporate purposes, which may include funding the repayment or redemption of outstanding debt, share repurchases, ongoing operations, capital expenditures, and possible acquisitions of businesses, assets, or strategic investments. As of September 30, 2025, we had an aggregate principal amount of $10.9 billion in debt outstanding with varying maturity dates. \n63\nTable of Contents\nOther than as described above, there were no significant changes to the available credit and debt disclosed in our 2024 Form 10‑K. For additional information, see “Note 12—Debt” in the notes to the condensed consolidated financial statements in Part I, Item 1 of this Form 10-Q.\nDepending on market conditions, we may from time to time issue debt, including in private or public offerings, to fund our operating activities, finance acquisitions, make strategic investments, repurchase shares under our stock repurchase program, or reduce our cost of capital.\nCredit ratings\nAs of September 30, 2025, we continue to be rated investment grade by Standard and Poor’s Financial Services, LLC, Fitch Ratings, Inc., and Moody’s Investors Services, Inc. We expect that these credit rating agencies will continue to monitor our performance, including our capital structure and results of operations. Our goal is to be rated investment grade, but as circumstances change, there are factors that could result in our credit ratings being downgraded or put on a watch list for possible downgrading. If that were to occur, it could increase our borrowing rates, including the interest rate on borrowings under our credit agreements. \nCURRENT AND FUTURE CASH REQUIREMENTS\nOur material cash requirements include funds to support current and potential: operating activities, credit products, customer protection programs, stock repurchases, dividend payments, strategic investments, acquisitions, other commitments, capital expenditures, and other future obligations.\nCredit products\nGrowth in our portfolio of loans receivable increases our liquidity needs and any inability to meet those liquidity needs could adversely affect our business. We continue to evaluate partnerships and third-party sources of funding for our credit products. \nThe Luxembourg Commission de Surveillance du Secteur Financier (the “CSSF”) has agreed that PayPal’s management may designate up to 50% of European customer balances held in our Luxembourg banking subsidiary to fund European, U.K., and U.S. credit activities. As of September 30, 2025 and December 31, 2024, the cumulative amount approved by PayPal to be designated to fund credit activities was $2.0 billion as of those respective dates and represented approximately 26% of European customer balances made available for our corporate use as of those respective dates, as determined by applying financial regulations maintained by the CSSF. We may periodically seek to change the designation of amounts of European customer balances for our credit activities, as we deem necessary, based on utilization of the approved funds and anticipated credit funding requirements. Under certain exceptional circumstances, corporate liquidity could be called upon to meet our obligations related to our European customer balances.\nWe have entered into forward flow arrangements with third-party investors to sell certain loans receivable portfolios. In the third quarter of 2025, we entered into an arrangement with a third-party which has a duration of two years and up to $7.0 billion of loans receivable sales over the term. During the nine months ended September 30, 2025 and 2024, we had net proceeds of $18.2 billion and $14.7 billion, respectively, from loans and interest receivable sold. See “Note 11—Loans and Interest Receivable” in the notes to the condensed consolidated financial statements included in Part I, Item 1 of this Form 10-Q for additional information.\nWhile our objective is to expand the availability of our credit products with capital from external sources, there can be no assurance that we will be successful in achieving that goal. \nCustomer protection programs\nThe risk of losses from our customer protection programs are specific to individual consumers, merchants, and transactions, and may also be impacted by regional variations in, and changes or modifications to, the programs, including as a result of changes in regulatory requirements. For the periods presented in these condensed consolidated financial statements included in this report, our transaction loss rate ranged between 0.06% and 0.09% of TPV. Historical loss rates may not be indicative of future results.\n64\nTable of Contents\nCapital return program\nStock repurchases \nDuring the nine months ended September 30, 2025, we repurchased approximately $4.5 billion of our common stock in the open market under our stock repurchase program authorized in June 2022. As of September 30, 2025, a total of approximately $355 million and $15.0 billion remained available for future repurchases of our common stock under our June 2022 and February 2025 stock repurchase programs, respectively. \nImplementation of dividend program\nOn October 28, 2025, we announced that our Board of Directors approved the initiation of a quarterly cash dividend program and declared a cash dividend of $0.14 per share on our common stock, totaling approximately $130 million. The dividend will be payable on December 10, 2025, to stockholders of record of our common stock as of the close of business on November 19, 2025. Dividend payments in future quarters will be subject to and contingent upon market conditions and approval by our Board of Directors in its sole discretion.\nOther considerations\nOur liquidity, access to capital, and borrowing costs could be adversely impacted by declines in our credit rating, our financial performance, and global credit market conditions, as well as a broad range of other factors. In addition, our liquidity, access to capital, and borrowing costs could also be negatively impacted by the outcome of any of the legal or regulatory proceedings to which we are a party. See Part I, Item 1A, Risk Factors of our 2024 Form 10-K, as supplemented and, to the extent inconsistent, superseded below in Part II, Item 1A, Risk Factors of this Form 10-Q, as well as “Note 13—Commitments and Contingencies” in the notes to the condensed consolidated financial statements included in Part I, Item 1 of this Form 10-Q for additional discussion of these and other risks that our business faces.\n65\nTable of Contents"
}