{
  "source_file": "q-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThe following discussion and analysis provides information that management believes is relevant to an assessment and understanding of Qnity’s financial condition and results of operations. Management’s discussion and analysis of financial condition and results of operations is provided as a supplement to, and should be read in conjunction with, the unaudited interim Combined Financial Statements and related notes thereto included elsewhere in this Quarterly Report and the audited Financial Statements and related notes thereto included in the Information Statement, dated October 15, 2025,  filed as Exhibit 99.1 to Qnity’s Current Report on Form 8-K filed with the Securities and Exchange Commission (the “SEC”) on October 15, 2025 (the “Information Statement”) to enhance the understanding of the Company’s operations and present business environment. Certain amounts may not foot due to rounding. This discussion and analysis contains forward-looking statements and involves numerous risks and uncertainties, including, but not limited to, those discussed in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” in this Quarterly Report, as well as in “Risk Factors” in the Information Statement. Carefully read the information under “Cautionary Note Regarding Forward-Looking Statements” in this Quarterly Report. Qnity assumes no obligation to update any of these forward-looking statements except as required by law. Actual results may differ materially from those contained in any forward-looking statements.\nOVERVIEW\nWe are a global leader in materials and solutions for semiconductor and electronics industries. We empower our customers’ technology roadmaps to enable advancements in megatrends such as artificial intelligence (\"AI\"), advanced computing and advanced connectivity. We partner with leading semiconductor and advanced device manufacturers to address complex challenges and develop solutions that facilitate next-generation technological innovations. With over 50 years of experience in systems engineering and material science, a global manufacturing footprint, and major application labs across the world, we are well-positioned to capitalize on emerging opportunities across various sectors including transportation, data centers, consumer and personal electronics and aerospace and defense.\nWe are organized into two operating segments:\n•\nSemiconductor Technologies: \nOur Semiconductor Technologies segment provides a portfolio of innovative materials and solutions utilized across multiple stages of the semiconductor manufacturing process. These advanced materials are qualified into customers’ roadmaps, designed to improve chip performance, enhance yield, and enable leading-edge node technology. \n•\nInterconnect Solutions: \nOur Interconnect Solutions segment offers a comprehensive range of best-in-class material solutions that address the evolving complexities of signal integrity, thermal and power management and advanced packaging. These solutions are integral for advanced electronics hardware, including complex printed circuit boards and advanced semiconductor packaging.  \nOur broad portfolio of solutions and materials across both Semiconductor Technologies and Interconnect Solutions segments positions us as a comprehensive solutions provider for our customers. We are often the partner of choice due to our strong innovation capabilities and extensive materials and engineering expertise. In a fast-paced electronics industry, our customers’ needs are highly performance-driven and our long-standing relationships and strong renewal rates demonstrate our commitment to delivering excellence in a demanding market.\nMacroeconomic Environment\nRecent and continuing developments in U.S. and foreign policy related to trade, such as the imposition of new or increased tariffs on product imports from certain countries have heightened global trade tensions and sparked significant uncertainty in macroeconomic and geopolitical environments, particularly with respect to China. The nature of our global business exposes us to risks associated with trade conflicts between the U.S. and its trading partners, including about the ultimate extent and duration of the tariffs, responsive actions from other countries and the resulting impacts, including on general economic conditions and on our financial condition, liquidity, or results of operations. As a result, we may face a reduction in the demand for, and in the competitiveness of, our products, particularly from local or domestically sourced competition, harm to our relationships with our customers, and decreased profitability, which have the potential to adversely affect our business, financial condition and results of operations.  \nRecent Developments \nTransition to Stand-Alone Company\n \nOn May 22, 2024, DuPont de Nemours, Inc. (“DuPont” or “Parent”), of which we have historically been a part, announced its plan to separate its Electronics business, which included its semiconductor technologies and interconnect solutions businesses, from the other businesses of DuPont (the “Separation\"). On November 1, 2025 (the “Separation and Distribution Date”), the \n29\nTable of Contents\nSeparation was completed through a tax-free pro rata distribution of all of the then issued and outstanding shares of our common stock to DuPont stockholders at a ratio of one share of our common stock for every two shares of DuPont’s common stock held at the close of business on the record date of October 22, 2025 (the “Distribution”).\n \n \nRelationship with DuPont \nHistorically, we have relied on DuPont to manage certain aspects of our operations and provide us with certain services, the costs of which have historically been either allocated or directly billed to us. Historical costs for such services may not necessarily reflect the actual expenses we would have incurred, or will incur, as an independent company. In connection with the Separation, we and/or certain of our subsidiaries entered into the Separation Agreement and certain other agreements with DuPont and/or certain of its subsidiaries as of the Separation and Distribution Date, including, but not limited to, the Tax Matters Agreement, the Employee Matters Agreement, the Transition Services Agreement (as defined below), the Intellectual Property Cross-License Agreement, the Transitional House Marks Trademark License Agreement, the Ex-Station Lease (\"ESL\") Cost Sharing Agreement (as defined below) and certain other intellectual property-related, real estate-related, confidentiality-related, regulatory-related and commercial agreements. DuPont will not provide us with ongoing assistance other than the transition and other services described in these agreements. These services do not include every service that we have received from DuPont in the past, and DuPont is only obligated to provide the transition services for limited periods following the Separation. Following the cessation of the Transition Services Agreement, we will need to provide internally or obtain from unaffiliated third parties the services we will no longer receive from DuPont. The cost of replacing such services may vary from the historical costs directly allocated to us. \nStand-Alone Company Expenses\nAs a result of the Separation, we are required to operate as an independent company. Under the Transition Services Agreement with DuPont, dated as of the Separation and Distribution Date (the \"Transition Services Agreement\"), we are receiving certain services, including informational technology services, from DuPont. As we transition from those services, we will incur additional expenditures. We currently estimate it will cost approximately $180 million in one-time costs, incurred over two years, to establish stand-alone informational technology systems, not including the cost of maintenance or employee-related expenditures.\nIn addition, we are incurring costs related to expanding, internally or through third parties, our functional capabilities such as information technology, finance, human resources, legal, tax, facilities, branding, government relations and insurance. We are subject to the requirements of the federal and state securities laws and stock exchange requirements and have established, or are in the process of establishing, additional procedures and practices as a stand-alone public company. As a result, we will incur incremental costs including, but not limited to, costs relating to external reporting, internal audit, treasury, investor relations, board of directors and officers and stock administration. \nCost Sharing Arrangements\nUnder the ESL Cost Sharing Agreement, dated as of August 28, 2025, by and between FCC Acquisition Corporation, a Delaware corporation, and DuPont (the \"ESL Cost Sharing Agreement\"), DuPont and Qnity will be responsible for 60% and 40%, respectively, of certain costs and expenses that exceed the net revenues received by DuPont from certain third parties at the Experimental Station facility (\"Experimental Station\"). As a result, we may have to pay certain additional costs, including in the event that certain portions of Experimental Station not occupied by us, DuPont or their respective subsidiaries as of the Separation become vacant and DuPont does not lease such portions to a new tenant for rental rates that are at least equal to the current rental rates. Because DuPont will operate the Experimental Station following the Separation, such costs will be beyond our control, and our obligation to bear such costs may negatively impact our business, results of operations, financial condition and cash flows. \nCertain Indemnification Obligations to DuPont\nIn connection with the Separation, we have been contractually allocated, and will directly pay or indemnify DuPont for, the Applicable Qnity Percentage of certain liabilities, including funding obligations of DuPont under the Memorandum of Understanding (\"MOU\"), legacy PFAS liabilities and liabilities related to businesses and operations of DuPont that were previously discontinued or divested. The Applicable Qnity Percentage is equal to the trailing twelve month Pro Forma Operating EBITDA attributable to the Qnity business and assets (measured at the time of the distribution, but prior to giving effect to the distribution) divided by the trailing twelve month Pro Forma Operating EBITDA (measured at the time of the distribution, but prior to giving effect to the distribution) of DuPont, multiplied by 100. For purposes of the following discussion, we have assumed the Applicable Qnity Percentage is 44% and determined all amounts in accordance with the applicable provisions of the Separation Agreement (including adjustments therein related to estimated income tax benefits arising from the liabilities allocated to us).\n30\nTable of Contents\nLiabilities under the Memorandum of Understanding \nAs of September 30, 2025, DuPont has borne Qualified Spend of approximately $665 million and has recorded an indemnification liability for probable and reasonably estimable future Qualified Spend of $216 million. Accordingly, we expect to record an indemnification liability for such probable and reasonably estimable future Qualified Spend of $75 million. \nWe will directly contribute or indemnify DuPont for, the Applicable Qnity Percentage of DuPont’s funding obligations in respect of an MOU Escrow Account established by DuPont, Corteva, Inc. (\"Corteva\") and The Chemours Company (\"Chemours\") to support and manage potential future eligible PFAS costs.   \nNew Jersey\nOn August 3, 2025, DuPont, together with Chemours and Corteva and its subsidiary EIDP Inc. (formerly known as E. I. du Pont de Nemours and Company) (“EIDP”), agreed to a proposed Judicial Consent Order (the “Consent Order”) with the State of New Jersey to resolve outstanding claims by the State of New Jersey pending against the companies related to legacy use of a wide variety of substances of concern for an aggregate cash payment to the State of New Jersey of $875 million, payable over a period of 25 years. The first of the scheduled annual payments will be due within 30 days of the date the Judicial Consent Order is entered by the Court, but no earlier than January 31, 2026.     \nContingent upon the Settlement being approved by the Court, DuPont and Corteva will purchase Chemours’ interest in future, if any, insurance proceeds related to PFAS claims. DuPont and Corteva will make the purchase by contributing a total of $150 million into an escrow fund (the “NJ Insurance Escrow”) to be applied to Chemours’ share of the Settlement. In exchange, Chemours shall assign to DuPont and Corteva its rights to $150 million of PFAS-related insurance proceeds plus a fee equal to the lesser of (a) $35 million, or (b) $3 million plus interest (at prime minus 2%) on the unrecovered fraction of $150 million, until Chemours’ share of insurance recoveries fully recoups the purchase price.\nThe obligations of DuPont set forth in this section relating to the Settlement, including the cash payments, any remediation obligations (and related liabilities), and the establishment and maintenance of the reserve fund, and the purchase of Chemours’ interest in future insurance proceeds related to PFAS claims, in each case constitute, liabilities contractually allocated between us and DuPont based their respective Applicable Percentage. Accordingly, we will indemnify DuPont, or remit directly to the relevant third party, the amount owed in respect of our share of such liabilities.  \nAs of September 30, 2025, DuPont recorded a pre-tax charge of $177 million related to the proposed Consent Order, we estimate our contractually allocated portion of the recorded pre-tax charge will be approximately $66 million. Additionally, DuPont recorded interest accretion of $4 million during the three and nine months ended September 30, 2025, resulting in a liability of $181 million as of September 30, 2025. We estimate our contractually allocated portion of this accreted interest will be approximately $2 million.  We will share in the ongoing costs of maintaining a reserve fund in the event the remedial funding source for a site has been exhausted and the party responsible is not otherwise performing the required remediation.  \nWe estimate our contractually allocated cash contribution in respect of the NJ Insurance Escrow will be $47 million. We will also receive the Applicable Qnity Percentage of any insurance proceeds related to PFAS claims recovered. \nOther\nAs of September 30, 2025, DuPont has recorded liabilities related to business and operations, historical activities of DuPont, including environmental liabilities, and its present and former subsidiaries, for which we estimate our contractually allocated portion to be $38 million.   \n \n \n31\nTable of Contents\nRESULTS OF OPERATIONS\nSummary of Sales Results\nThree Months Ended\n September 30,\nNine Months Ended \nSeptember 30,\nIn millions\n2025\n2024\n2025\n2024\nNet sales\n$\n1,276 \n$\n1,148 \n$\n3,564 \n$\n3,234 \nThe following table summarizes sales variances by segment and geographic region from the prior year:\nSales Variances by Segment and Geographic Region\nPercentage change from prior year\nThree Months Ended September 30, 2025\nNine Months Ended September 30, 2025\nLocal Price\n & Product Mix\nCurrency\nVolume\nPortfolio & Other\nTotal\nLocal Price\n & Product Mix\nCurrency\nVolume\nPortfolio & Other\nTotal\nSemiconductor Technologies\n(1)\n%\n— \n%\n9 \n%\n— \n%\n8 \n%\n(1)\n%\n— \n%\n9 \n%\n— \n%\n8 \n%\nInterconnect Solutions\n(1)\n1 \n15 \n— \n15 \n(2)\n— \n15 \n— \n13 \nTotal\n(1)\n%\n1 \n%\n11 \n%\n— \n%\n11 \n%\n(2)\n%\n— \n%\n12 \n%\n— \n%\n10 \n%\nAmericas\n(2)\n%\n— \n%\n21 \n%\n— \n%\n19 \n%\n(1)\n%\n— \n%\n16 \n%\n— \n%\n15 \n%\nEMEA \n1\n1 \n3 \n18 \n— \n22 \n— \n1 \n7 \n— \n8 \nAsia Pacific\n(1)\n1 \n9 \n— \n9 \n(1)\n— \n11 \n— \n10 \nTotal\n(1)\n%\n1 \n%\n11 \n%\n— \n%\n11 \n%\n(2)\n%\n— \n%\n12 \n%\n— \n%\n10 \n%\n1.\nEurope, Middle East and Africa.\nWe reported net sales for the three months ended September 30, 2025 of $1.3 billion, up 11% from $1.1 billion for the three months ended September 30, 2024, due to an 11% increase in volume and a 1% favorable currency impact partially offset by a 1% decrease in local price and product mix. The volume increase was attributable to both Interconnect Solutions (up 15%) and Semiconductor Technologies (up 9%). Contributing to the volume increase was an approximate $40 million benefit from order timing related to system cut-over activities in advance of the Separation. The favorable currency impact was attributable to Interconnect Solutions (up 1%) while the currency impact of Semiconductor Technologies remained flat. Local price and product mix declined in both Interconnect Solutions (down 1%) and Semiconductor Technologies (down 1%).\nNet sales for the nine months ended September 30, 2025 were $3.6 billion, up 10% from $3.2 billion for the nine months ended September 30, 2024, due to a 12% increase in volume partially offset by a 2% decrease in local price and product mix. The increase in volume was attributable to both Interconnect Solutions (up 15%) and Semiconductor Technologies (up 9%). Contributing to the volume increase was an approximate $40 million benefit from order timing related to system cut-over activities in advance of the Separation. Local price and product mix declined in both Interconnect Solutions (down 2%) and Semiconductor Technologies (down 1%).\nCost of Sales\nCost of sales were $701 million for the three months ended September 30, 2025, up 15% from $609 million for the three months ended September 30, 2024 primarily due to increased volume of 10% as well as increases in input costs of 4% and unfavorable currency impacts of 1%.  \nCost of sales as a percentage of net sales for the three months ended September 30, 2025 was 55% as compared to 53% for the three months ended September 30, 2024. \nCost of sales were $1.9 billion for the nine months ended September 30, 2025, up 9% from $1.8 billion for the nine months ended September 30, 2024 due to increased volume of 9%.\nCost of sales as a percentage of net sales remained flat at 54% for the nine months ended September 30, 2025 and 2024.  \nResearch and Development (\"R&D\") Expenses\nR&D expense was $92 million for the three months ended September 30, 2025, up from $81 million for the three months ended September 30, 2024. R&D expense as a percentage of net sales was consistent period over period at 7% for each of the three months ended September 30, 2025 and 2024. \nR&D expense was $264 million for the nine months ended September 30, 2025, up from $230 million for the nine months ended September 30, 2024. R&D expense as a percentage of net sales was consistent period over period at 7% for each of the nine months ended September 30, 2025 and 2024.\n32\nTable of Contents\nSelling, General and Administrative (\"SG&A\") Expenses\nSG&A expenses were $159 million in the third quarter of 2025, up slightly from $156 million in the third quarter of 2024. SG&A expenses as a percentage of net sales decreased period over period at 12% and 14% for the three months ended September 30, 2025 and 2024, respectively. \nFor the first nine months of 2025, SG&A expenses were $453 million, down from $461 million in the first nine months of 2024. SG&A expenses as a percentage of net sales remained relatively consistent at 13% and 14% for the nine months ended September 30, 2025 and 2024, respectively. The decrease for the nine months ended September 30, 2025 as compared with the same period of the prior year was primarily due to decrease in legal expenses partially offset by higher employee related costs.\nAmortization of Intangibles\nAmortization of intangibles was $51 million in the third quarter of 2025, down from $57 million in the third quarter of 2024. In the first nine months of 2025, amortization of intangibles was $156 million, down from $177 million in the same period of the prior year. The decrease for the three and nine months ended September 30, 2025 as compared with the same periods of the prior year was primarily due to the absence of amortization from fully amortized assets.\nRestructuring and Asset Related Charges - Net\nRestructuring and asset related charges - net were $1 million in the third quarter of 2025, down from $4 million of charges in the third quarter of 2024. In the first nine months of 2025, restructuring and asset related charges - net were $20 million, up from $7 million of charges in the same period last year. The activity for the three and nine months ended September 30, 2025 and 2024  related to nonrecurring charges in connection with DuPont-approved restructuring programs. See Note 4 to the unaudited interim Combined Financial Statements for additional information.\nEquity in Earnings of Nonconsolidated Affiliates\nOur share of the earnings of nonconsolidated affiliates was $15 million in the third quarter of 2025, up from $10 million in the third quarter of 2024. In the first nine months of 2025, our share of earnings of nonconsolidated affiliates was $37 million, up from $33 million in the first nine months of 2024. The increase for each of the three and nine month periods is due to higher earnings in the underlying nonconsolidated affiliates. See Note 10 to the unaudited interim Combined Financial Statements for additional information.\nOther Income (Expense) - Net\nOther income (expense) - net includes a variety of income and expense items such as gain or loss on sale of assets and foreign exchange gains or losses. Other income (expense) - net remained flat at $1 million of expense in the three months ended September 30, 2025, and 2024.\nIn the first nine months of 2025, Other income (expense) - net was an expense of $3 million, as compared to $9 million of income in the first nine months of 2024. The nine months ended September 30, 2025 included $4 million net foreign exchange loss, as compared to $3 million net foreign exchange gain for the nine months ended September 30, 2024. See Note 6 to the unaudited interim Combined Financial Statements for additional information.\nInterest Expense \nInterest expense was $14 million for the three and nine months ended September 30, 2025. There was no interest expense for the three and nine months ended September 30, 2024. The increase in interest expense in 2025 was driven by interest associated with the Notes (as defined herein). See Note 12 to the unaudited interim Combined Financial Statements for additional information.\nProvision for Income Taxes \nOur effective tax rate fluctuates based, among other factors, on where income is earned and the level of income relative to tax attributes. For the nine months ended September 30, 2025, the effective tax rate was 19.8%, compared with 22.4% for the nine months ended September 30, 2024. The lower effective tax rate for the first nine months of 2025 in comparison to the first nine months of 2024 resulted from a combination of certain discrete tax expenses incurred in 2024, including the settlement of an international tax audit, offset by changes to the geographic mix of earnings in 2025, including the impacts of the OECD's Global Anti-Base Erosion rules under Pillar Two in jurisdictions in which we operate. \n33\nTable of Contents\nSEGMENT RESULTS\nOur measure of profit/loss for segment reporting purposes is Operating EBITDA as this is the manner in which our CODM assesses performance and allocates resources. We define Operating EBITDA as earnings (i.e., “Income (loss) before income taxes\") before interest, depreciation, amortization, non-operating pension / other post-employment benefits (“OPEB”) / charges, and foreign exchange gains / losses, indirect legacy costs, and adjusted for significant items.\nSEMICONDUCTOR TECHNOLOGIES \nThe Semiconductor Technologies segment provides a portfolio of innovative materials and solutions utilized across multiple stages of the semiconductor manufacturing process. These advanced materials are specified into customers’ roadmaps, designed to improve chip performance, enhance yield, and enable leading-edge node technology\n. \nSemiconductor Technologies\nThree Months Ended\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nNet sales\n$\n693 \n$\n640 \n$\n1,981 \n$\n1,834 \nOperating EBITDA\n$\n240 \n$\n232 \n$\n713 \n$\n638 \nEquity in earnings of nonconsolidated affiliates\n$\n14 \n$\n10 \n$\n38 \n$\n34 \nSemiconductor Technologies\nThree Months Ended\nNine Months Ended\nPercentage change from prior year\nSeptember 30, 2025\nSeptember 30, 2025\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(1)\n%\n(1)\n%\nCurrency\n— \n— \nVolume\n9 \n9 \nPortfolio & other\n— \n— \nTotal\n8 \n%\n8 \n%\nSemiconductor Technologies net sales were $693 million for the three months ended September 30, 2025, up 8% as compared to $640 million for the three months ended September 30, 2024. Net sales increased primarily due to a 9% increase in volume slightly offset by a 1% decrease in local price and product mix. The increase in sales volume was due to ongoing end-market demand strength due to content gains in advanced nodes, share gains, and improved customer utilization rates including AI driven applications. Additionally, there was an approximate $25 million benefit from order timing related to system cut-over activities in advance of the Separation. \nOperating EBITDA was $240 million for the three months ended September 30, 2025, up 3% as compared to $232 million for the three months ended September 30, 2024, primarily due to volume growth partially offset by currency and selective growth investments to improve both R&D and supply chain capabilities.\nSemiconductor Technologies net sales were $1,981 million for the nine months ended September 30, 2025, up 8% as compared to $1,834 million for the nine months ended September 30, 2024. Net sales increased primarily due to a 9% increase in volume slightly offset by a 1% decrease in local price and product mix. The increase in sales volume was due to ongoing end-market demand strength due to content gains in advanced nodes, share gains, and improved customer utilization rates including AI driven applications. Additionally, there was an approximate $25 million benefit from order timing related to system cut-over activities in advance of the Separation. \nOperating EBITDA was $713 million for the nine months ended September 30, 2025, up 12% as compared to $638 million for the nine months ended September 30, 2024, primarily due to volume growth partially offset by growth investments.\n34\nTable of Contents\nINTERCONNECT SOLUTIONS \nThe Interconnect Solutions segment is a leading provider of materials and solutions that address the evolving complexities of signal integrity, thermal and power management and advanced packaging. These solutions are integral for advanced electronics hardware, including advanced semiconductor packaging. high density and high-layer-count printed circuit boards and high-performance electronics assemblies.\nInterconnect Solutions\nThree Months Ended\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nSeptember 30, 2025\nSeptember 30, 2024\nNet sales\n$\n583 \n$\n508 \n$\n1,583 \n$\n1,400 \nOperating EBITDA\n$\n152 \n$\n135 \n$\n403 \n$\n331 \nEquity in earnings (losses) of nonconsolidated affiliates\n$\n1 \n$\n— \n$\n(1)\n$\n(1)\nInterconnect Solutions\nThree Months Ended\nNine Months Ended\nPercentage change from prior year\nSeptember 30, 2025\nSeptember 30, 2025\nChange in Net Sales from Prior Period due to:\nLocal price & product mix\n(1)\n%\n(2)\n%\nCurrency\n1 \n— \nVolume\n15 \n15 \nPortfolio & other\n— \n— \nTotal\n15 \n%\n13 \n%\nInterconnect Solutions net sales were $583 million for the three months ended September 30, 2025, up 15% from $508 million for the three months ended September 30, 2024. Net sales increased primarily due to a 15% increase in volume and a 1% favorable currency impact slightly offset by a 1% decrease in local price and product mix. The increase in sales volume was due to continued demand strength from AI driven technology ramps in addition to growth from other industrial end-markets such as aerospace, defense and automotive. Additionally, there was an approximately $15 million benefit from order timing related to system cut-over activities in advance of the Separation. The favorable currency impact is primarily driven by the Japanese yen, euro, and Taiwanese dollar.\nOperating EBITDA was $152 million for the three months ended September 30, 2025, up 13% as compared to $135 million for the three months ended September 30, 2024, primarily due to an increase in sales volume partially offset by selective growth investments.\nInterconnect Solutions net sales were $1,583 million for the nine months ended September 30, 2025, up 13% from $1,400 million for the nine months ended September 30, 2024. Net sales increased primarily due to a 15% increase in volume slightly offset by a 2% decrease in local price and product mix. The increase in sales volume was due to continued demand strength from AI driven technology ramps in addition to growth from other industrial end-markets such as aerospace, defense and automotive. Additionally, there was an approximately $15 million benefit from order timing related to system cut-over activities in advance of the Separation. \nOperating EBITDA was $403 million for the nine months ended September 30, 2025, up 22% compared to $331 million for the nine months ended September 30, 2024, primarily due to an increase in sales volume and productivity partially offset by selective growth investments.\n \n35\nTable of Contents\nCHANGES IN FINANCIAL CONDITION \nLiquidity & Capital Resources\nHistorically, the Electronics business, as managed by DuPont, has generated positive cash flows from operations. A majority of such cash flows was transferred to DuPont in connection with our participation in DuPont’s cash pooling arrangements to manage liquidity and fund operations, the effect of which is presented as net parent investment in our unaudited interim Combined Financial Statements. Our cash and cash equivalents as of September 30, 2025 reflected on the unaudited interim Combined Balance Sheets represent cash on hand at certain foreign entities as a result of local requirements.\nUpon Separation, we ceased participation in DuPont cash pooling arrangements and our cash and cash equivalents will be held and used solely for our own operations. Our capital structure, long-term commitments and sources of liquidity will change meaningfully from our historical practices. \nWe believe our existing cash and cash flows generated from operations and indebtedness incurred in conjunction with the Separation discussed in detail below and anticipated domestic cash and cash equivalents we will retain at the completion of the Separation will be responsive to the needs of our current and planned operations for at least the next 12 months. We believe we will meet longer-term expected future cash requirements and obligations through a combination of our cash flow from operations, indebtedness incurred in conjunction with the Separation and issuances of equity securities or debt offerings, as needed. \nCash flows from operating, investing and financing activities are provided in the tables that follow. Individual amounts in the unaudited interim Combined Statements of Cash Flows exclude the effect of exchange rate impacts on cash and cash equivalents, which are presented separately in the cash flows. Thus, the amounts presented in the following operating, investing and financing activities tables reflect changes in balances from period to period adjusted for these effects.\nSummary of Cash Flows\nOur cash flows from operating, investing and financing activities, as reflected in the unaudited interim Combined Statements of Cash Flows, are summarized in the following table. \nCash Flow Summary\nNine Months Ended\nIn millions\nSeptember 30, 2025\nSeptember 30, 2024\nCash provided by (used for):\nOperating activities\n$\n782 \n$\n775 \nInvesting activities\n$\n(214)\n$\n(133)\nFinancing activities\n$\n(616)\n$\n(624)\nEffect of exchange rate changes on cash and cash equivalents\n$\n10 \n$\n(2)\nCash Flows from Operating Activities \nIn the first nine months of 2025, cash provided by operating activities was $782 million, compared with $775 million in the same period last year.\n \nThe increase in cash provided by operating activities is primarily due to higher earnings, partially offset by an increase in net cash used for working capital. Changes in working capital were primarily driven by higher trade receivables from increased sales and higher inventory based on volume growth, partially offset by higher accounts payable resulting from purchases to support higher volumes.\nThe table below reflects net working capital:\nNet Working Capital\nSeptember 30, 2025\nDecember 31, 2024\nIn millions (except ratio)\nCurrent assets\n$\n1,621 \n$\n1,483 \nCurrent liabilities\n910 \n839 \nNet working capital\n$\n711 \n$\n644 \nCurrent ratio\n1.78:1\n1.77:1\n36\nTable of Contents\nCash Flows from Investing Activities \nIn the first nine months of 2025, cash used for investing activities was $214 million, compared with $133 million in the first nine months of 2024.\n \nThe increase in cash used for investing activities is attributable to higher capital expenditures.\nCash Flows from Financing Activities \nIn the first nine months of 2025, cash used for financing activities was $616 million compared with $624 million in the same period last year. The decrease in cash used for financing activities is primarily attributable to cash proceeds from the issuance of long-term debt, partially offset by a decrease in net transfers (to) from Parent and payments for debt issuance costs.\nMaterial Cash Requirements\nIn the normal course of business, we enter into contracts and commitments that oblige us to make payments in the future. Information regarding our obligations under lease, debt, commitments and pensions and are provided in Note 6, Note 12, Note 13 and Note 15, respectively, in the unaudited Combined Financial Statements for the three and nine months ended September 30, 2025 and 2024.\nAs a result of the Separation, as discussed in the section entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations— Stand-Alone Company Expenses”, we will incur costs related to operating as a stand-alone public company and our costs under the Separation Agreements including certain cost sharing arrangements as well as indemnification obligations. While these costs are expected to be significant and we are not able to predict the full extent or timing of our future obligations, we expect the generation of cash from operations and the ability to access the debt capital markets and other sources of liquidity will continue to provide sufficient liquidity and financial flexibility to meet our obligations, and those of our subsidiaries, as they come due. \nDebt \nWe have historically relied, via DuPont, on cash from operating activities and access to the debt capital markets and other sources of liquidity to fund our operations. \nAs of October 31, 2025 we have incurred indebtedness in an aggregate principal amount of $4.1 billion. We believe that our financing arrangements, future cash from operations, and access to capital markets will provide adequate resources to fund our future cash flow needs. On August 15, 2025, we issued $1 billion aggregate principal amount of 5.750% senior secured notes due 2032 (the \"Senior Secured Notes\") and $750 million aggregate principal amount of 6.250% senior unsecured notes due 2033 (the \"Senior Unsecured Notes\" and, together with the Senior Secured Notes, the \"Notes\"). \nOn October 31, 2025 we entered into (a) the Senior Secured Revolving Facility in the aggregate committed amount of $1.25 billion (up to $100 million of the Senior Secured Revolving Facility will be available for the issuance of letters of credit), and (b) the Senior Secured Term Loan Facility in the aggregate principal amount of $2.35 billion. The Senior Secured Revolving Facility was not utilized at the consummation of the Separation, other than with respect to the issuance of letters of credit. The Notes and the Senior Secured Credit Facilities include various customary covenants including those relating to debt incurrence, liens, restricted payments, assets sales, and transactions with affiliates, changes in control, and mergers or sales of all or substantially all of our assets. See Note 12 to the unaudited interim Combined Financial Statements for additional information. \nWe expect to rely on cash from our own operating activities, borrowings available under our Senior Secured Revolving Facility, and access to the capital markets to fund our operations. The servicing of this debt will be supported, in part, by cash flows from our existing operations. The cost and availability of debt financing will be influenced by our future credit ratings and market conditions.\nDividends\nOn November 12, 2025, the Company announced that its Board of Directors declared a quarterly dividend of $0.06 per share payable on December 15, 2025, to stockholders of record on November 28, 2025.\nRecently Issued Accounting Pronouncements \nFor a discussion of recently issued accounting pronouncements, see Note 2 to the unaudited interim Combined Financial Statements.\nCritical Accounting Estimates \nThere have been no material changes in our critical accounting estimates from those disclosed under the heading \"Critical Accounting Estimates\" in our Information Statement, dated October 15, 2025, filed as Exhibit 99.1 to our Current Report on Form 8-K filed with the SEC on October 15, 2025.\n37\nTable of Contents"
}