{
  "source_file": "qcom-20250629.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis\n \ninformation should be read in conjunction with the condensed consolidated financial statements and the notes thereto included in “Part I, Item 1” of this Quarterly Report and with “Management’s Discussion and Analysis of Financial Condition and Results of Operations” for the fiscal year ended September 29, 2024 contained in our 2024 Annual Report on Form 10-K. \nThis Quarterly Report (including but not limited to this section titled Management’s Discussion and Analysis of Financial Condition and Results of Operations) contains forward-looking statements. Words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “seeks,” “estimates,” “may,” “will,” “would” and similar expressions or variations of such words are intended to identify forward-looking statements, but are not the exclusive means of identifying forward-looking statements in this Quarterly Report. Additionally, statements concerning future matters such as our future business, prospects, results of operations or financial condition; research and development or technology investments; new or enhanced products, services or technologies; emerging industries or business models; design wins or product launches; industry, market or technology trends, dynamics or transitions; our expectations regarding future demand or supply conditions; strategic investments or acquisitions, and the anticipated timing or benefits thereof; legal or regulatory matters, including the expected impacts of recently enacted or pending tax or other regulatory changes; U.S./China trade or national security tensions; vertical integration by our customers; competition; annual effective tax rates; and other statements regarding matters that are not historical are also forward-looking statements. \nAlthough forward-looking statements in this Quarterly Report reflect our good faith judgment, such statements can only be based on facts and factors currently known by us. Consequently, forward-looking statements are inherently subject to risks and uncertainties and actual results and outcomes may differ materially from the results and outcomes discussed in or anticipated by the forward-looking statements. Factors that could cause or contribute to such differences in results and outcomes include without limitation those discussed under the heading “Risk Factors” below, as well as those discussed elsewhere in this Quarterly Report\n. Readers are ur\nged not to place undue reliance on these forward-looking statements, which speak only as of the date of this Quarterly Report. We undertake no obligation to revise or update any forward-looking statements in order to reflect any event or circumstance that may arise after the date of this Quarterly Report. Readers are urged to carefully review and consider the various disclosures made in this Quarterly Report, which attempt to advise interested parties of the risks and factors that may affect our business, financial condition, results of operations and prospects.\nThird Quarter Fiscal 2025 Overview\nRevenues for the third quarter of fiscal 2025 were $10.4 billion, an increase of 10% compared to the year ago quarter, with net income of $2.7 billion, an increase of 25% compared to the year ago quarter. Key items from the third quarter of fiscal 2025 included: \n•\nQCT revenues increased by 11% in the third quarter of fiscal 2025 compared to the year ago quarter due to higher handsets, IoT and automotive revenues.\n•\nQTL revenues increased by 4% in the third quarter of fiscal 2025 compared to the year ago quarter, primarily due to an increase in estimated sales of 3G/4G/5G-based multimode products.\nOur Business and Operating Segments\nWe develop and commercialize foundational technologies and products used in mobile devices and other wireless products. We derive revenues principally from sales of integrated circuit products and licensing our intellectual property, including patents and other rights.\nWe are organized on the basis of products and services and have three reportable segments. We conduct business primarily through our QCT (Qualcomm CDMA Technologies) semiconductor business and our QTL (Qualcomm Technology Licensing) licensing business. Our QSI (Qualcomm Strategic Initiatives) reportable segment makes strategic investments. We also have nonreportable segments, including QGOV (Qualcomm Government Technologies) and our Data Center business (formerly referred to as our cloud computing processing initiative).\nOur reportable segments are operated by QUALCOMM Incorporated and its direct and indirect subsidiaries. Substantially all of our products and services businesses, including QCT, and substantially all of our engineering and research and development functions are operated by Qualcomm Technologies, Inc. (QTI), a wholly-owned subsidiary of QUALCOMM Incorporated, and QTI’s subsidiaries. QTL is operated by QUALCOMM Incorporated, which owns the vast majority of our patent portfolio. Neither QTI nor any of its subsidiaries has any right, power or authority to grant any licenses or other rights under or to any patents owned by QUALCOMM Incorporated.\n17\nSeasonality. \nMany of our products and much of our intellectual property are incorporated into consumer wireless devices, which are subject to seasonality and other fluctuations in demand. Our revenues have historically fluctuated based on consumer demand for devices, as well as on the timing of customer/licensee device launches and/or innovation cycles (such as the transition to the next generation of wireless technologies). This has resulted in fluctuations in QCT revenues in advance of and during device launches incorporating our products (for example, certain major handset OEMs accelerated their premium-tier device launches into the first quarter of fiscal 2025) and in QTL revenues when licensees’ sales occur. These trends may or may not continue in the future. Further, the trends for QTL have been, and may in the future be, impacted by disputes and/or resolutions with licensees and/or governmental investigations or proceedings.\nResults of Operations\nRevenues (in millions)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nEquipment and services\n$\n8,893 \n$\n7,993 \n$\n900 \n$\n28,193 \n$\n24,259 \n$\n3,934 \nLicensing\n1,472 \n1,400 \n72 \n4,820 \n4,459 \n361 \n$\n10,365 \n$\n9,393 \n$\n972 \n$\n33,013 \n$\n28,718 \n$\n4,295 \nThird\n \nquarter 2025 vs. 2024\nThe increase in revenues in the third quarter of fiscal 2025 was primarily due to:\n+    \n$898 million in higher equipment and services revenues from our QCT segment\nFirst nine months\n \n2025 vs. 2024\nThe increase in revenues in the first nine months of fiscal 2025 was primarily due to:\n+    \n$3.9 billion in higher equipment and services revenues from our QCT segment\n+    \n$143 million in licensing revenues resulting from a settlement of a licensing dispute in the second quarter of fiscal 2025, which was not allocated to our segment results\n+    \n$121 million in higher licensing revenues from our QTL segment\nCosts and Expenses (in millions, except percentages)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nCost of revenues \n$\n4,606 \n$\n4,174 \n$\n432 \n$\n14,704 \n$\n12,593 \n$\n2,111 \nGross margin\n56\n%\n56\n%\n55\n%\n56\n%\nThird quarter 2025 vs. 2024\nGross margin percentage remained approximately flat in the third quarter of fiscal 2025. \nFirst nine months\n \n2025 vs. 2024\nGross margin percentage decreased in the first nine months of fiscal 2025 primarily due to a decrease in the proportion of total revenues related to QTL licensing revenues (which have a higher margin contribution).\n18\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nResearch and development\n$\n2,226 \n$\n2,259 \n$\n(33)\n$\n6,672 \n$\n6,591 \n$\n81 \n% of revenues\n21\n%\n24\n%\n20\n%\n23\n%\nThird quarter 2025 vs. 2024\nThe decrease in research and development expenses in the third quarter of fiscal 2025 was primarily due to:\n-    \n$83 million decrease driven by lower costs related to the development of wireless and integrated circuit technologies (including investments in key growth and diversification opportunities), primarily driven by $189 million in higher non-recurring engineering cost reimbursements for product-related development work, partially offset by higher employee-related costs \n+    \n$35 million increase in expenses driven by the revaluation of our deferred compensation obligation (which resulted in a corresponding increase in net gains on deferred compensation plan assets within investment and other income, net due to the revaluation of the related assets)\nFirst nine months 2025 vs. 2024\nThe increase in research and development expenses in the first nine months of fiscal 2025 was primarily due to a $132 million increase in share-based compensation expense. Our costs related to the development of wireless and integrated circuit technologies (including investments in key growth and diversification opportunities) remained approximately flat, primarily driven by $288 million in higher non-recurring engineering cost reimbursements for product-related development work, partially offset by an increase in employee-related costs.\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nSelling, general and administrative\n$\n771 \n$\n664 \n$\n107 \n$\n2,200 \n$\n1,998 \n$\n202 \n% of revenues\n7\n%\n7\n%\n7\n%\n7\n%\nThird quarter and first nine months 2025 vs. 2024\nThe increase in selling, general and administrative expenses in the third quarter and first nine months of fiscal 2025 was primarily due to an increase in sales and marketing expenses.\n19\nInterest Expense and Investment and Other Income, Net (in millions)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nInterest expense\n$\n168 \n$\n168 \n$\n— \n$\n493 \n$\n517 \n$\n(24)\nInvestment and other income, net\nInterest and dividend income\n$\n160 \n$\n182 \n$\n(22)\n$\n495 \n$\n490 \n$\n5 \nNet gains on marketable securities\n204 \n8 \n196 \n241 \n16 \n225 \nNet gains on other investments\n5 \n10 \n(5)\n30 \n170 \n(140)\nNet gains on deferred compensation plan assets\n84 \n26 \n58 \n65 \n153 \n(88)\nImpairment losses on other investments\n(52)\n(5)\n(47)\n(93)\n(66)\n(27)\nOther\n(43)\n5 \n(48)\n10 \n5 \n5 \n$\n358 \n$\n226 \n$\n132 \n$\n748 \n$\n768 \n$\n(20)\nNet gains on marketable securities in the third quarter and first nine months of fiscal 2025 was primarily driven by the initial public offerings of certain QSI equity investments.\nNet gains on other investments in the first nine months of fiscal 2024 was primarily driven by certain of our QSI non-marketable equity investments.\nIncome Tax Expense (in millions, except percentages)\nThe following table summarizes the primary factors that caused our income tax provision to differ from the expected income tax provision at the U.S. federal statutory rate:\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nJune 29,\n2025\nJune 23,\n2024\nExpected income tax provision at federal statutory tax rate\n$\n620 \n$\n479 \n$\n2,035 \n$\n1,625 \nBenefit from foreign-derived intangible income (FDII) deduction, excluding the impact of capitalizing research and development expenditures\n(150)\n(130)\n(547)\n(439)\nBenefit from FDII deduction related to capitalizing research and development expenditures\n(119)\n(94)\n(382)\n(417)\nBenefit related to the federal research and development tax credit\n(67)\n(61)\n(186)\n(195)\nExcess tax benefit associated with share-based awards\n(21)\n(89)\n(98)\n(141)\nForeign currency (gain) loss related to foreign withholding tax receivable\n(123)\n55 \n42 \n57 \nOther\n146 \n11 \n170 \n55 \n     Income tax expense\n$\n286 \n$\n171 \n$\n1,034 \n$\n545 \nEffective tax rate\n10\n%\n8\n%\n11\n%\n7\n%\nFor the third quarter of fiscal 2025, we estimate our annual effective income tax rate to be 11% for fiscal 2025, which is lower than the U.S. federal statutory rate. Additional information regarding our annual effective income tax rate and income tax expense is provided in this Quarterly Report in “Notes to Condensed Consolidated Statements, Note 3. Income Taxes.”\nOn July 4, 2025, tax reform legislation included in the One Big Beautiful Bill Act (OBBB) was enacted in the United States. The impact of the OBBB is excluded from our estimated annual effective tax rate and provision for income taxes for the third quarter of fiscal 2025 as it is a nonrecognized subsequent event. The OBBB includes significant corporate tax reforms, including the permanent reinstatement of deducting domestic research and development expenditures as incurred beginning in fiscal 2026 (under prior law such expenditures were capitalized and amortized over five years). We expect this change will have a favorable effect on our cash flows from operations due to significantly lower cash tax payments. \n20\nHowever, we expect it will adversely affect our total provision for income taxes and results of operations, as these expenditures will no longer result in a deferred tax asset that is established at the statutory rate of 21% rather than the current effective tax rate of 13% after considering the FDII deduction. The legislation also modifies international tax provisions, including changes to the FDII regime. Specifically, it renames FDII as Foreign-Derived Deduction Eligible Income (FDDEI), maintains the current FDDEI effective tax rate of 13% through fiscal 2026 and adjusts the FDDEI effective tax rate to a permanent 14% rate in fiscal 2027 (compared to 16% under prior law). \nWhile we continue to evaluate the impact of these tax law changes, we may be subject to the corporate alternative minimum tax of 15% beginning in fiscal 2026, and we are assessing our ability to realize our existing deferred tax assets. As such, our future provision for income taxes and results of operations may be adversely affected (potentially materially).\nDiscontinued Operations (in millions)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nDiscontinued operations, net of income taxes\n$\n— \n$\n21 \n$\n(21)\n$\n— \n$\n27 \n$\n(27)\nDiscontinued operations in the third quarter and first nine months of fiscal 2024 are related to the Non-Arriver businesses. Information regarding the Non-Arriver businesses is provided in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 2. Composition of Certain Financial Statement Items - Discontinued Operations.”\nSegment Results\nThe following should be read in conjunction with our financial results for the third quarter of fiscal 2025 for each reportable segment included in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 6. Segment Information.”\nQCT Segment (in millions, except percentages)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nRevenues\nHandsets\n$\n6,328 \n$\n5,899 \n$\n429\n$\n20,831 \n$\n18,766 \n$\n2,065\nAutomotive\n984 \n811 \n173\n2,904 \n2,012 \n892\nIoT (internet of things)\n1,681 \n1,359 \n322\n4,811 \n3,740 \n1,071\nTotal revenues (1)\n$\n8,993 \n$\n8,069 \n$\n924\n$\n28,546 \n$\n24,518 \n$\n4,028\nEBT (2)\n$\n2,671 \n$\n2,181 \n$\n490\n$\n8,774 \n$\n7,062 \n$\n1,712\nEBT as a % of revenues\n30\n%\n27\n%\n3 points\n31\n%\n29\n%\n2 points\n(1) Descriptions of our three QCT revenue streams can be found in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 2. Composition of Certain Financial Statement Items.”\n(2) Earnings (loss) before income taxes.\nSubstantially all of QCT’s revenues consist of equipment and services revenues, which were $8.8 billion and $7.9 billion in the third quarter of fiscal 2025 and 2024, respectively, and $28.0 billion and $24.1 billion in the first nine months of fiscal 2025 and 2024, respectively. QCT revenues mostly relate to sales of our Snapdragon platforms (which include processors and modems), stand-alone Mobile Data Modems, radio frequency transceiver, power management and wireless connectivity integrated chipsets as well as sales of RFFE products. \nThird quarter 2025 vs. 2024\nThe increase in QCT revenues in the third quarter of fiscal 2025 was primarily due to:\n+    \nhigher handsets revenues, primarily due to $387 million in higher revenues per chipset primarily driven by higher average selling prices and favorable mix toward premium-tier Snapdragon platforms\n+    \nhigher IoT revenues, primarily due to higher shipments primarily across edge networking, industrial and consumer products\n+    \nhigher automotive revenues, primarily driven by an increase in shipments from new vehicle launches with our Snapdragon digital cockpit products\nQCT EBT as a percentage of revenues increased in the third quarter of fiscal 2025 primarily due to higher revenues.\n21\nGross margin percentage remained approximately flat in the third quarter of fiscal 2025, primarily driven by higher product costs, partially offset by higher average selling prices. \nFirst nine months 2025 vs. 2024\nThe increase in QCT revenues in the first nine months of fiscal 2025 was primarily due to:\n+    \nhigher handsets revenues, primarily due to $1.3 billion in higher revenues per chipset (primarily driven by higher average selling prices) and $810 million in higher chipset shipments by certain major OEMs, both of which benefited from an increase in demand in premium-tier Snapdragon platforms\n+    \nhigher IoT revenues, primarily due to higher shipments across edge networking, consumer and industrial products\n+    \nhigher automotive revenues, primarily driven by an increase in shipments from new vehicle launches with our Snapdragon digital cockpit products\nQCT EBT as a percentage of revenues increased in the first nine months of fiscal 2025 primarily due to higher revenues.\nGross margin percentage remained approximately flat in the first nine months of fiscal 2025, primarily driven by higher product costs, partially offset by higher average selling prices. \nQTL Segment (in millions, except percentages)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nLicensing revenues\n$\n1,318 \n$\n1,273 \n$\n45 \n$\n4,172 \n$\n4,051 \n$\n121 \nEBT\n942 \n894 \n48 \n3,028 \n2,907 \n121 \nEBT as a % of revenues\n71\n%\n70\n%\n1 point\n73\n%\n72\n%\n1 point\nDuring the second quarter of fiscal 2025, we executed final agreements for new long-term licenses with two key Chinese OEMs (for which the initial terms had expired) and entered into comprehensive 4G and 5G license agreements with Transsion (a growing, China-headquartered OEM that sells primarily in developing regions). As a result of our agreements with Transsion, all outstanding litigation between the parties has been dismissed. Beginning in the second quarter of fiscal 2025, QTL revenues did not include royalties from Huawei, whose license agreement has expired.\nThird quarter and first nine months 2025 vs. 2024\nThe increase in QTL licensing revenues in the third quarter and first nine months of fiscal 2025 was primarily due to an increase in estimated sales of 3G/4G/5G-based multimode products.\nQTL EBT as a percentage of revenues increased in the third quarter and first nine months of fiscal 2025 primarily due to higher revenues.\nQSI Segment (in millions)\nThree Months Ended\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nJune 29,\n2025\nJune 23,\n2024\nChange\nEquipment and services revenues\n$\n— \n$\n2 \n$\n(2)\n$\n— \n$\n18 \n$\n(18)\nEBT\n149 \n14 \n135 \n179 \n121 \n58 \nThird quarter and first nine months 2025 vs. 2024 \nQSI EBT increased in the third quarter of fiscal 2025 primarily due to higher net gains on marketable securities resulting from the initial public offerings of certain of our equity investments.\nQSI EBT increased in the first nine months of fiscal 2025 primarily due to higher net gains on marketable securities resulting from the initial public offerings of certain of our equity investments, partially offset by lower net gains on certain of our non-marketable equity investments.\nLooking Forward\nWe believe that 5G combined with high-performance, low-power computing and on-device artificial intelligence will continue to drive adoption of certain technologies that are already commonly used in smartphones by industries and applications beyond mobile handsets, such as automotive and IoT. We believe it is important that we remain a leader in 5G technology development, standardization, intellectual property creation and licensing, and a leading developer and supplier of 5G integrated circuit products in order to sustain and grow our business long-term. \n22\nAs we look forward to the next several quarters:\n•\nWe continue to monitor the recent changes in global trade policy, including tariffs and related trade actions announced by the U.S., China and other countries. The degree to which such tariffs and other related actions impact our business, financial condition and results of operations will depend on future developments, which are uncertain. Changes to global trade policies may negatively impact demand, pricing and cost for our products and technologies, and contribute to the inherent uncertainties in estimating future customer demand, which may result in increased excess or obsolete inventory or reserve charges, negatively impacting our results of operations and cash flows. See “Risk Factors” in this Quarterly Report, including the Risk Factor titled “\nWe operate in the highly cyclical semiconductor industry, which is subject to significant downturns. We are also susceptible to declines in global, regional and local economic conditions generally. Our stock price and financial results are subject to substantial quarterly and annual fluctuations due to these dynamics, among others.\n”\n•\nWe expect transitions to new generations of leading process technology nodes to continue to drive product cost increases from certain of our key semiconductor wafer suppliers.\n•\nWe expect continued intense competition, including from vertical integration by certain of our customers. In particular, Apple began utilizing its own modem (rather than our products) in its recently released smartphone and we expect that Apple will increasingly use its own modem products, rather than our products, in its future devices, which will have a significant negative impact on our QCT revenues, results of operations and cash flows.\n•\nCurrent U.S./China trade relations and/or national security protection policies may negatively impact our business, growth prospects and results of operations. See “Risk Factors” in this Quarterly Report, including the Risk Factor titled “\nA significant portion of our business is concentrated in China, and the risks of such concentration are exacerbated by U.S./China trade and national security tensions.\n” \nWe are also involved in certain legal proceedings, including those described in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 5. Commitments and Contingencies.” Litigation is inherently uncertain, and, while we intend to continue to vigorously defend ourselves in such matters, the unfavorable resolution of one or more of these matters could have a material adverse effect on our business, results of operations, financial condition or cash flows.\nIn addition to the foregoing business and market-based matters, we continue to devote resources to working with and educating participants in the wireless industry and governments as to the benefits of our licensing programs and our extensive technology investments in promoting a highly competitive and innovative wireless industry. However, we expect that certain companies may be dissatisfied with the need to pay reasonable royalties for the use of our technologies and not welcome the success of our licensing programs in enabling new, highly cost-effective competitors to their products. Accordingly, such companies and/or governments or regulators may continue to challenge our business model in various forums throughout the world.\nFurther discussion of risks related to our business is provided in the section titled “Risk Factors” included in this Quarterly Report.\n23\nLiquidity and Capital Resources\nOur principal sources of liquidity are our existing cash, cash equivalents and marketable securities (including restricted cash), cash generated from operations and cash provided by our debt programs. The following tables present selected financial information related to our liquidity at June 29, 2025 and September 29, 2024 and for the first nine months of fiscal 2025 and 2024 (in millions):\nJune 29,\n2025\nSeptember 29,\n2024\nChange\nCash, cash equivalents and marketable securities (including restricted cash)\nCash and cash equivalents \n$\n5,448 \n$\n7,849 \n$\n(2,401)\nRestricted cash (1)\n2,323 \n— \n2,323 \nMarketable securities\n4,563 \n5,451 \n(888)\n$\n12,334 \n$\n13,300 \n$\n(966)\nDebt (2)\n$\n14,788 \n$\n14,634 \n$\n154 \n(1) In connection with the pending acquisition of Alphawave, we agreed to restrict the use of approximately $2.3 billion of cash to be held for purposes of satisfying payment of the consideration to effect the acquisition. Additional information regarding our pending acquisition of Alphawave is provided in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 8. Acquisitions.”\n(2) Includes our issued debt reported as long-term and short-term debt. As of June 29, 2025 and September 29, 2024, our credit facility was undrawn, and we had no commercial paper outstanding.\nNine Months Ended\nJune 29,\n2025\nJune 23,\n2024\nChange\nNet cash provided by operating activities\n$\n10,016 \n$\n9,555 \n$\n461 \nNet cash used by investing activities\n(329)\n(3,238)\n2,909 \nNet cash used by financing activities\n(9,760)\n(7,070)\n(2,690)\nCash, cash equivalents and marketable securities (including restricted cash). \nThe net decrease in cash, cash equivalents and marketable securities (including restricted cash) for the first nine months of fiscal 2025 was primarily due to $6.3 billion in payments to repurchase 41 million shares of our common stock, $2.8 billion in cash dividends paid, $1.4 billion repayment of unsecured fixed-rate notes that matured in May 2025, $878 million in payments of tax withholdings related to the vesting of share-based awards, $785 million in capital expenditures and $711 million in cash paid for acquisitions and other investments, partially offset by net cash provided by operating activities and the issuance of $1.5 billion of unsecured fixed-rate notes.\nDuring the first nine months of fiscal 2025, income taxes paid were in excess of our provision, negatively impacting net cash provided by operating activities. This was driven primarily by our installment payment for a one-time U.S. repatriation tax accrued in fiscal 2018 of $530 million and the adverse impact of the requirement to capitalize and amortize research and development expenditures for federal income tax purposes. The OBBB includes significant corporate tax reforms, including the permanent reinstatement of deducting domestic research and development expenditures as incurred beginning in fiscal 2026 (under prior law such expenditures were capitalized and amortized over five years). We expect this change will have a favorable effect on our cash flows from operations due to significantly lower cash tax payments beginning in fiscal 2026.\nNet changes in our operating assets and liabilities for the first nine months of fiscal 2025 negatively impacted our operating cash flows primarily from a decrease in payroll, benefit and other liabilities, partially offset by a decrease in accounts receivable and other assets. The decrease in payroll, benefits and other liabilities and accounts receivable was primarily due to an increase in the portion of customer incentive amounts recorded as a reduction to accounts receivable. The decrease in other assets was primarily driven by utilization of prior advanced supply agreement payments.\nDebt. \nDuring the third quarter of fiscal 2025, we repaid $1.4 billion of unsecured fixed-rate notes that matured in May 2025. In May 2025, we also issued\n \n$1.5 billion of\n \nunsecured fixed-rate notes, consisting of $500 million of 4.50% notes, $400 million of 4.75% notes and $600 million of 5.00% notes (collectively, May 2025 Notes) that mature on May 20, 2030, May 20, 2032 and May 20, 2035, respectively. The net proceeds from the May 2025 Notes will be used for general corporate purposes. We also entered into interest rate swaps which are designated as fair value hedges and allow us to effectively convert all of our fixed-rate payments due under the May 2025 Notes into floating-rate payments. Additional information regarding our debt is provided in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 2. Composition of Certain Financial Statement Items.” \n24\nCapital Return Program. \nOur stock repurchase program is subject to periodic evaluations to determine when and if repurchases are in the best interests of our stockholders, and we may accelerate, suspend, delay or discontinue repurchases at any time. Our stock repurchases in the first nine months of fiscal 2025 have increased compared to the prior year, and we expect our stock repurchases to remain at an increased level compared to the prior year through the remainder of fiscal 2025. We currently intend to continue to use cash dividends as a means of returning capital to stockholders, subject to capital availability and our view that cash dividends are in the best interests of our stockholders, among other factors. Additional information regarding our capital returns is provided in this Quarterly Report in “Notes to Condensed Consolidated Financial Statements, Note 4. Capital Stock.”\nAdditional Capital Requirements. \nExpected working and other capital requirements are described in our 2024 Annual Report on Form 10-K in “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.” At June 29, 2025, other than for the changes disclosed in the “Notes to Condensed Consolidated Financial Statements”, “Looking Forward” and “Liquidity and Capital Resources” in this Quarterly Report, there have been no other material changes to our expected working and other capital requirements described in our 2024 Annual Report on Form 10-K.\nFurther, regulatory authorities in certain jurisdictions have investigated our business practices and instituted proceedings against us and they or other regulatory authorities may do so in the future. Additionally, certain of our direct and indirect customers and licensees have pursued, and they or others may in the future pursue, litigation, arbitration or other strategies against us related to our business. Unfavorable resolutions of one or more of these matters have had and could in the future have a material adverse effect on our business, revenues, results of operations, financial condition and cash flows. See “Risk Factors” in this Quarterly Report. \nWe believe, based on our current business plan and the facts and factors known by us, our cash, cash equivalents and marketable securities, our expected cash flow generated from operations and our expected financing activities will satisfy our working and other capital requirements for at least the next 12 months and thereafter for the foreseeable future. See “Risk Factors” in this Quarterly Report.\nRecent Accounting Guidance\nInformation regarding recent accounting guidance and the impact of such guidance on our condensed consolidated financial statements is provided in this Quarterly Report in the “Notes to Condensed Consolidated Financial Statements, Note 1. Basis of Presentation and Significant Accounting Policies Update.”"
}