{
  "source_file": "rcl-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nCautionary Note Concerning Forward-Looking Statements\nThe discussion under this caption \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and elsewhere in this Quarterly Report on Form 10-Q includes \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. All statements other than statements of historical fact, including statements regarding our expectations for future periods, business and industry prospects or future results of operations or financial position, made in this Quarterly Report on Form 10-Q are forward-looking. Words such as \"anticipate,\" \"believe,\" \"considering,\" \"could,\" \"driving,\" \"estimate,\" \"expect,\" \"goal,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"seek,\" \"should,\" \"will,\" \"would,\" and similar expressions are intended to further identify any of these forward-looking statements. Forward-looking statements reflect management's current expectations, but they are based on judgments and are inherently uncertain. Furthermore, they are subject to risks, uncertainties and other factors that could cause our actual results, performance or achievements to differ materially from the future results, performance or achievements expressed or implied in those forward-looking statements. Examples of these risks, uncertainties and other factors include, but are not limited to, those discussed in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 and, in particular, the risks discussed under the caption \"Risk Factors\" in Part I, Item 1A therein.\nAll forward-looking statements made in this Quarterly Report on Form 10-Q speak only as of the date of this filing. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise. \nOverview\nThe discussion and analysis of our financial condition and results of operations is organized to present the following:\n•\na review of our financial presentation, including discussion of certain operational and financial metrics we utilize to assist us in managing our business;\n•\na discussion of our results of operations for the quarter and nine months ended September 30, 2025, compared to the same period in 2024; and\n•\na discussion of our liquidity and capital resources, including our future capital and material cash requirements and potential funding sources. \n22\nCritical Accounting Policies and Estimates\nFor a discussion of our critical accounting policies and estimates, refer to Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations \nwithin our Annual Report on Form 10-K for the year ended December 31, 2024.\nSeasonality\nOur revenues are seasonal based on demand for cruises. Demand has historically been strongest for cruises during the Northern Hemisphere’s summer months and holidays. In order to mitigate the impact of the winter weather in the Northern Hemisphere and to capitalize on the summer season in the Southern Hemisphere, our brands have historically focused on deployment to the Caribbean, Asia and Australia during that period. \nFinancial Presentation\nDescription of Certain Line Items\nRevenues\nOur revenues are comprised of the following:\n•\nPassenger ticket revenues\n, which consist of revenue recognized from the sale of passenger tickets and the sale of air\n \ntransportation to and from our ships; and\n•\nOnboard and other revenues\n, which consist primarily of revenues from the sale of goods and/or services onboard our\n \nships not included in passenger ticket prices, casino operations, cancellation fees, sales of vacation protection insurance, pre- and post-cruise tours and fees for operating certain port facilities. \nOnboard and other revenues\n also include revenues we receive from independent third-party concessionaires that pay us a\n \npercentage of their revenues in exchange for the right to provide selected goods and/or services onboard our ships, as well as revenues received for procurement and management related services we perform on behalf of our unconsolidated affiliates. \nCruise Operating Expenses\n \nOur cruise operating expenses are comprised of the following:\n•\nCommissions, transportation and other expenses\n, which consist of those costs directly associated with passenger ticket\n \nrevenues, including travel advisor commissions, air and other transportation expenses, port costs that vary with passenger head counts and related credit card fees;\n•\nOnboard and other expenses\n, which consist of the direct costs associated with onboard and other revenues, including\n \nthe costs of products sold onboard our ships, vacation protection insurance premiums, costs associated with pre- and post-cruise tours and related credit card fees, as well as the minimal costs associated with concession revenues, as the costs are mostly incurred by third-party concessionaires, and costs incurred for the procurement and management related services we perform on behalf of our unconsolidated affiliates;\n•\nPayroll and related expenses\n, which consist of costs for shipboard personnel (costs associated with our shoreside personnel are included in \nMarketing, selling and administrative expenses\n);\n•\nFood expenses\n, which include food costs for both guests and crew;\n•\nFuel expenses\n, which include fuel and related delivery, storage and emission consumable costs and the financial impact of fuel swap\n \nagreements; and\n•\nOther operating expenses\n, which consist primarily of operating costs such as repairs and maintenance, port costs that do not vary with passenger head counts, vessel related insurance, entertainment and gains and/or losses related to the sale of our ships, if any. \nWe do not allocate payroll and related expenses, food expenses, fuel expenses or other operating expenses to the expense categories attributable to passenger ticket revenues or onboard and other revenues since they are incurred to provide the total cruise vacation experience.\n23\nSelected Operational and Financial Metrics\nWe utilize a variety of operational and financial metrics which are defined below to evaluate our performance and financial condition. As discussed in more detail herein, certain of these metrics are non-GAAP financial measures. These non-GAAP financial measures are provided along with the related GAAP financial measures as we believe they provide useful information to investors as a supplement to our consolidated financial statements, which are prepared and presented in accordance with GAAP. The presentation of non-GAAP financial information is not intended to be considered in isolation or as a substitute for, or superior to, the financial information prepared and presented in accordance with GAAP.\nAdjusted Earnings per Share (\"Adjusted EPS\") \nis a non-GAAP measure that\n \nrepresents Adjusted Net Income attributable to Royal Caribbean Cruises Ltd. (as defined below) divided by weighted average shares outstanding or by diluted weighted average shares outstanding, as applicable. We believe that this non-GAAP measure is meaningful when assessing our performance on a comparative basis.\nAdjusted EBITDA\n is a non-GAAP measure that represents EBITDA (as defined below) excluding certain items that we believe adjusting for is meaningful whe\nn assessing our profitability on a comparative basis. For the periods presented\n, these items included (i) other expense (income), (ii) equity investment impairment, recovery of losses, and other, (iii) restructuring charges and other initiative expenses, and (iv) impairment losses. \nA reconciliation of Net Income attributable to Royal Caribbean Cruises Ltd. to Adjusted EBITDA is provided below under Results of Operations.\nAdjusted Gross Margin\n represents Gross Margin, adjusted for payroll and related, food, fuel, other operating, and depreciation and amortization expense. Gross Margin is calculated pursuant to GAAP as total revenues less total cruise operating expenses, and depreciation and amortization.\nAdjusted Net Income attributable to Royal Caribbean Cruises Ltd. \nis a non-GAAP measure that represents Net Income attributable to Royal Caribbean Cruises Ltd., excluding certain items that we believe adjusting for is meaningful when assessing our performance on a comparative basis. For the periods presented, these items included (i) loss on extinguishment of debt and inducement expense, (ii) the amortization of the Silversea intangible assets resulting from the Silversea acquisition, (iii) restructuring charges and other initiative expenses, (iv) equity investments impairment, recovery of losses, and other, (v) impairment losses, (vi) gain on sale of noncontrolling interest, and (vii) tax on the sale of PortMiami noncontrolling interest. A reconciliation of Net Income attributable to Royal Caribbean Cruises Ltd. to Adjusted Net Income attributable to Royal Caribbean Cruises Ltd. is provided below under Results of Operations.\nAdjusted Operating Income \nrepresents operating income including income from equity investments and income taxes but excluding certain items for which we believe adjusting for is meaningful when assessing our operating performance on a comparative basis. We use this non-GAAP measure to calculate ROIC (as defined below). \nAvailable Passenger Cruise Days\n (\n“APCD”\n) is our measurement of capacity and represents double occupancy per cabin multiplied by the number of cruise days for the period, which excludes canceled cruise days and cabins not available for sale. We use this measure to perform capacity and rate analysis to identify our main non-capacity drivers that cause our cruise revenue and expenses to vary.\nConstant Currency is a significant measure for our revenues and expenses, which are denominated in currencies other than the U.S. Dollar. Because our reporting currency is the U.S. Dollar, the value of these revenues and expenses in U.S. Dollar will be affected by changes in currency exchange rates. Although such changes in local currency prices are just one of many elements impacting our revenues and expenses, it can be an important element. For this reason, we also monitor our revenues and expenses in \"Constant Currency\" - i.e., as if the current period's currency exchange rates had remained constant with the comparable prior period's rates. For the 2025 period presented, we calculate \"Constant Currency\" by applying the average for 2024 period exchange rates for each of the corresponding months, so as to calculate what the results would have been had exchange rates been the same throughout both periods. We do not make predictions about future exchange rates and use current exchange rates for calculations of future periods. It should be emphasized that the use of Constant Currency is primarily used by us for comparing short-term changes and/or projections. Over the longer term, changes in guest sourcing and shifting the amount of purchases between currencies can significantly change the impact of the purely currency-based fluctuations.\nEBITDA \nis a non-GAAP measure that represents Net Income attributable to Royal Caribbean Cruises Ltd. excluding (i) interest income; (ii) interest expense, net of interest capitalized; (iii) depreciation and amortization expenses; and (iv) income tax expense. We believe that this non-GAAP measure is meaningful when assessing our operating performance on a comparative basis. A reconciliation of Net \nIncome attributable to Royal Caribbean Cruises Ltd. t\no EBITDA is provided below under Results of Operations.\nGross Cruise Costs \nrepresent the sum of total cruise operating expenses plus marketing, selling and administrative expenses.\n24\nGross Margin Yields \nrepresent Gross Margin per APCD.\nInvested Capital \nrepresents the most recent five-quarter average of total debt (i.e., Current portion of long-term debt plus Long-term debt) plus the most recent five-quarter average of Total shareholders' equity. We use this measure to calculate ROIC (as defined below).\nNet Cruise Costs \nand \nNet C\nruise Costs Excluding Fuel\n are non-GAAP measures that represent Gross Cruise Costs excluding commissions, transportation and other expenses, and onboard and other expenses and, in the case of Net Cruise Costs Excluding Fuel, fuel expenses (each of which is described above under the Description of Certain Line Items heading). In measuring our ability to control costs in a manner that positively impacts net income, we believe changes in Net Cruise Costs and Net Cruise Costs Excluding Fuel to be the most relevant indicators of our performance. \nA reconciliation of Gross Cruise Costs to Net Cruise Costs and Net Cruise Costs Excluding Fuel is provided below under Results of Operations.\n For the periods presented, Net Cruise Costs and Net Cruise Costs Excluding Fuel excludes\n (i) restructuring charges and other initiative expenses, and (ii) impairment losses\n.\nNet Yields\n represent Adjusted Gross Margin per APCD. We utilize Adjusted Gross Margin and Net Yields to manage our business on a day-to-day basis as we believe that they are the most relevant measures of our pricing performance because they reflect the cruise revenues earned by us net of our most significant variable costs, which are commissions, transportation and other expenses, and onboard and other expenses.\nOccupancy (\"Load factor\")\n, in accordance with cruise vacation industry practice, is calculated by dividing Passenger Cruise Days (as defined below) by APCD. A percentage in excess of 100% indicates that three or more passengers occupied some cabins.\nPassenger Cruise Days (\"PCD\")\n represent the number of passengers carried for the period multiplied by the number of days of their respective cruises.\nPerfecta Program\n refers to the multi-year Adjusted EPS and ROIC goals we are seeking to achieve by end of 2027. Under our Perfecta Program, we are targeting 20% compound annual growth rate in Adjusted EPS compared to 2024 and ROIC of 17% or higher by the end of 2027.\nReturn on Invested Capital (\"ROIC\")\n represents Adjusted Operating Income divided by Invested Capital. We believe ROIC is a meaningful measure because it quantifies how efficiently we generated operating income relative to the capital we have invested in the business.\nThe use of certain significant n\non-GAAP measures, such as Net Yields, Net Cruise Costs and Net Cruise Costs Excluding Fuel, allows us to perform capacity and rate analysis to separate the impact of known capacity changes from other less predictable changes which affect our business. We believe these non-GAAP measures provide expanded insight to measure revenue and cost performance in addition to the standard GAAP based financial measures. There are no specific rules or regulations for determining non-GAAP measures, and as such, they may not be comparable to other companies within the industry.\n25\nResults of Operations\n \nSummary\nNet Income attributable to Royal Caribbean Cruises Ltd. and Adjusted Net Income attributable to Royal Caribbean Cruises Ltd. for the third quarter of 2025 was $1.6 billion, respectively, compared to Net Income and Adjusted Net Income of $1.1 billion and $1.4 billion, respectively, for the third quarter of 2024.\nNet Income attributable to Royal Caribbean Cruises Ltd. and Adjusted Net Income attributable to Royal Caribbean Cruises Ltd. for the nine months ended September 30, 2025 was $3.5 billion, respectively, compared to Net Income and Adjusted Net Income of $2.3 billion and $2.8 billion, respectively, for the nine months ended September 30, 2024.\n Significant items for the quarter and nine months ended September 30, 2025 include:\n•\nTotal revenues increased $253 million and $952 million for the quarter and nine months ended September 30, 2025 as compared to the same periods in 2024. The increase was primarily due to an increase in capacity, ticket prices and onboard spending in 2025, compared to same period in 2024.\n•\nTotal cruise operating expenses, increased $88 million and $241 million for the quarter and nine months ended September 30, 2025 as compared to the same periods in 2024. The increase was primarily due to an increase in capacity in 2025 compared to the same periods in 2024.\n•\nIn February 2025, TUI Cruises, our 50% joint venture, took delivery of \nMein Schiff Relax\n.\n•\nIn March 2025, we completed a privately negotiated exchange with certain holders of 6.00% Convertible Senior Notes due 2025. The holders exchanged approximately $213 million in aggregate principal amount for approximately 3 million shares of common stock and $214 million in cash, including accrued interest.\n•\nIn May 2025, we amended our two revolving credit facilities, bringing our aggregate revolving credit capacity to $6.4 billion, and extended the termination date of one of the revolving credit facilities from October 2026 to October 2030.\n•\nIn July 2025, we took delivery of \nStar of the Seas.\n•\nIn July 2025, we closed on our acquisition of the Port of Costa Maya and adjacent land in Mahahual, Mexico. The final purchase price was $294 million.\n•\nIn August 2025, the remaining $106 million of our 6.00% Convertible Senior Notes matured. The notes and accrued interest were settled using a combination of $109 million in cash, and the issuance of approximately 1.8 million shares of common stock.\nFor further information regarding the debt transactions discussed above, refer to Note 7\n. Debt \nto our consolidated financial statements under Item 1. \nFinancial Statements\n. \n26\nOperating results for the quarters and nine months ended September 30, 2025 compared to the same periods in 2024 are shown in the following tables (in millions, except per share data):\n \nQuarter Ended September 30,\n \n2025\n2024\n% of Total\nRevenues\n% of Total\nRevenues\nPassenger ticket revenues\n$\n3,637 \n70.8 \n%\n$\n3,471 \n71.0 \n%\nOnboard and other revenues\n1,502 \n29.2 \n%\n1,415 \n29.0 \n%\nTotal revenues\n5,139 \n100.0 \n%\n4,886 \n100.0 \n%\nCruise operating expenses:\nCommissions, transportation and other\n696 \n13.5 \n%\n688 \n14.1 \n%\nOnboard and other\n312 \n6.1 \n%\n289 \n5.9 \n%\nPayroll and related\n342 \n6.7 \n%\n328 \n6.7 \n%\nFood\n264 \n5.1 \n%\n251 \n5.1 \n%\nFuel\n297 \n5.8 \n%\n290 \n5.9 \n%\nOther operating\n569 \n11.1 \n%\n545 \n11.2 \n%\nTotal cruise operating expenses\n2,479 \n48.2 \n%\n2,391 \n48.9 \n%\nMarketing, selling and administrative expenses\n522 \n10.2 \n%\n451 \n9.2 \n%\nDepreciation and amortization expenses\n435 \n8.5 \n%\n410 \n8.4 \n%\nOperating Income\n1,702 \n33.1 \n%\n1,634 \n33.4 \n%\nOther income (expense):\nInterest income\n3 \n0.1 \n%\n4 \n0.1 \n%\nInterest expense, net of interest capitalized\n(248)\n(4.8)\n%\n(603)\n(12.3)\n%\nEquity investment income\n158 \n3.1 \n%\n106 \n2.2 \n%\nOther expense\n(36)\n(0.7)\n%\n(26)\n(0.5)\n%\n(123)\n(2.4)\n%\n(519)\n(10.6)\n%\nNet Income\n1,579 \n30.7 \n%\n1,115 \n22.8 \n%\nLess: Net Income attributable to noncontrolling interest\n4 \n0.1 \n%\n4 \n0.1 \n%\nNet Income attributable to Royal Caribbean Cruises Ltd.\n$\n1,575 \n30.6 \n%\n$\n1,111 \n22.7 \n%\nDiluted Earnings per Share\n$\n5.74 \n$\n4.21 \n27\nNine Months Ended September 30,\n2025\n2024\n% of Total\nRevenues\n% of Total\nRevenues\nPassenger ticket revenues\n$\n9,579 \n70.0 \n%\n$\n8,900 \n69.9 \n%\nOnboard and other revenues\n4,097 \n30.0 \n%\n3,824 \n30.1 \n%\nTotal revenues\n13,676 \n100.0 \n%\n12,724 \n100.0 \n%\nCruise operating expenses:\nCommissions, transportation and other\n1,823 \n13.3 \n%\n1,758 \n13.8 \n%\nOnboard and other\n775 \n5.7 \n%\n726 \n5.7 \n%\nPayroll and related\n1,010 \n7.4 \n%\n959 \n7.5 \n%\nFood\n750 \n5.5 \n%\n697 \n5.5 \n%\nFuel\n854 \n6.2 \n%\n876 \n6.9 \n%\nOther operating\n1,630 \n11.9 \n%\n1,584 \n12.4 \n%\nTotal cruise operating expenses\n6,841 \n50.0 \n%\n6,600 \n51.9 \n%\nMarketing, selling and administrative expenses\n1,593 \n11.6 \n%\n1,452 \n11.4 \n%\nDepreciation and amortization expenses\n1,265 \n9.2 \n%\n1,190 \n9.4 \n%\nOperating Income \n3,977 \n29.1 \n%\n3,482 \n27.4 \n%\nOther income (expense):\nInterest income\n17 \n0.1 \n%\n13 \n0.1 \n%\nInterest expense, net of interest capitalized\n(725)\n(5.3)\n%\n(1,324)\n(10.4)\n%\nEquity investment income\n313 \n2.3 \n%\n203 \n1.6 \n%\nOther expense\n(54)\n(0.4)\n%\n(37)\n(0.3)\n%\n(448)\n(3.3)\n%\n(1,145)\n(9.0)\n%\nNet Income\n3,529 \n25.8 \n%\n2,337 \n18.4 \n%\nLess: Net Income attributable to noncontrolling interest\n15 \n0.1 \n%\n12 \n0.1 \n%\nNet Income attributable to Royal Caribbean Cruises Ltd.\n$\n3,514 \n25.7 \n%\n$\n2,325 \n18.3 \n%\nDiluted Earnings per Share\n$\n12.83 \n$\n8.91 \n28\nWe reported Net Income attributable to Royal Caribbean Cruises Ltd., Adjusted Net Income attributable to Royal Caribbean Cruises Ltd., Earning per Share and Adjusted Earnings per Share as shown in the following table (in millions, except per share data. Certain amounts may not add due to use of rounded numbers):\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nNet Income attributable to Royal Caribbean Cruises Ltd.\n$\n1,575 \n$\n1,111 \n$\n3,514 \n$\n2,325 \nLoss on extinguishment of debt and inducement expense (1)\n— \n323 \n10 \n456 \nAmortization of Silversea intangible assets resulting from the Silversea acquisition (2)\n2 \n2 \n5 \n5 \nRestructuring charges and other initiative expenses (3)\n1 \n2 \n7 \n5 \nEquity investments impairment, recovery of losses, and other\n— \n— \n(1)\n— \nImpairment losses (4)\n— \n— \n— \n6 \nGain on sale of noncontrolling interest (5)\n— \n— \n(11)\n— \nPortMiami tax on sale of noncontrolling interest (6)\n— \n(3)\n— \n(3)\nAdjusted Net Income attributable to Royal Caribbean Cruises Ltd.\n$\n1,577 \n$\n1,435 \n$\n3,523 \n$\n2,794 \nBasic:\n \n \nEarnings per Share \n$\n5.79 \n$\n4.22 \n$\n12.97 \n$\n8.98 \nAdjusted Earnings per Share \n$\n5.80 \n$\n5.46 \n$\n13.01 \n$\n10.79 \nDiluted:\nEarnings per Share (7)\n$\n5.74 \n$\n4.21 \n$\n12.83 \n$\n8.91 \nAdjusted Earnings per Share (8)\n$\n5.75 \n$\n5.20 \n$\n12.83 \n$\n10.16 \nWeighted-Average Shares Outstanding:\nBasic\n272 \n263 \n271 \n259 \nDiluted\n274 \n264 \n275 \n280 \n(1)\nFor 2025 and for 2024, includes $10 million and $119 million, respectively, of inducement expense related to the partial settlement of our 6.00% convertible notes due 2025. These amounts are included in \nInterest expense, net of interest capitalized\n within our consolidated statements of comprehensive income (loss).\n \nRefer to Note 7\n. Debt\n to our consolidated financial statements under Item 1. \nFinancial Statements\n for further information.\n(2)\nRepresents the amortization of the Silversea intangible assets resulting from the 2018 Silversea acquisition.\n(3)\nThese amounts are included in \nMarketing, selling and administrative expenses\n within our consolidated statements of comprehensive income (loss).\n(4)\nFor 2024, represents property and equipment impairment charges related to certain construction in progress assets which we determined would no longer be completed. These amounts are included in \nOther operating\n within our consolidated statements of comprehensive income (loss).\n(5)\nRepresents gain on sale of noncontrolling interest of Floating Docks and Grand Bahama Shipyard. These amounts are included in \nOther income\n within our consolidated statements of comprehensive income (loss).\n(6)\nFor 2024, represents adjustments to tax impacts on the 2023 PortMiami sale of noncontrolling interest. These amounts are included in \nOther expense\n in our consolidated statements of comprehensive income (loss).\n(7)\nDiluted EPS includes the add-back of dilutive inducement and interest expense related to our convertible notes of $16 million and $169 million for the nine months ended September 30, 2025, and 2024, respectively. Refer to Note 4\n. Earnings Per Share\n to our consolidated financial statements under Item 1. \nFinancial Statements\n for further information.\n29\n(8)\nAdjusted Diluted EPS includes the add-back of dilutive interest expense related to our convertible notes of $6 million for the nine months ended September 30, 2025, and $13 million and $51 million for the quarter and nine months ended September 30, 2024, respectively.\nSelected statistical information is shown in the following table:\n \nQuarter Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nPassengers Carried\n2,466,039 \n2,310,220 \n6,961,768 \n6,404,844 \nPassenger Cruise Days\n15,356,271 \n14,785,828 \n43,402,497 \n41,165,985 \nAPCD\n13,698,886 \n13,316,981 \n39,299,263 \n37,836,007 \nOccupancy\n112.1 \n%\n111.0 \n%\n110.4 \n%\n108.8 \n%\nEBITDA, Adjusted EBITDA and Adjusted EBITDA Margin were calculated as follows (in millions, except APCD and per APCD data. Certain amounts may not add due to use of rounded numbers; reported EBITDA, Adjusted EBITDA, and per APCD and Margin amounts are calculated from the underlying dollar amounts):\nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nNet Income attributable to Royal Caribbean Cruises Ltd.\n$\n1,575 \n$\n1,111 \n$\n3,514 \n$\n2,325 \nInterest income\n(3)\n(4)\n(17)\n(13)\nInterest expense, net of interest capitalized\n248 \n603 \n725 \n1,324 \nDepreciation and amortization expenses\n435 \n410 \n1,265 \n1,190 \nIncome tax expense (1)\n34 \n23 \n67 \n46 \nEBITDA\n2,289 \n2,143 \n5,553 \n4,872 \nOther expense (income) (2)\n2 \n3 \n(13)\n(9)\nEquity investments impairment, recovery of losses, and other\n— \n— \n(1)\n— \nRestructuring charges and other initiative expenses (3)\n1 \n2 \n7 \n5 \nImpairment losses (4)\n— \n— \n— \n6 \nAdjusted EBITDA\n$\n2,293 \n$\n2,148 \n$\n5,545 \n$\n4,874 \nTotal revenues\n$\n5,139 \n$\n4,886 \n$\n13,676 \n$\n12,724 \nAPCD\n13,698,886 \n13,316,981 \n39,299,263 \n37,836,007 \nNet Income attributable to Royal Caribbean Cruises Ltd. per APCD\n$\n114.94 \n$\n83.37 \n$\n89.42 \n$\n61.44 \nAdjusted EBITDA per APCD\n$\n167.35 \n$\n161.25 \n$\n141.09 \n$\n128.81 \nAdjusted EBITDA Margin\n44.6 \n%\n44.0 \n%\n40.5 \n%\n38.3 \n%\n(1)\nThese amounts are included in \nOther expense\n within our consolidated statements of comprehensive income (loss).\n(2)\nRepresents net non-operating expense (income). The amount excludes income tax expense, included in the EBITDA calculation above.\n(3)\nThese amounts are included in \nMarketing, selling and administrative expenses\n within our consolidated statements of comprehensive income (loss).\n30\n(4)\nFor 2024, represents property and equipment impairment charges related to certain construction in progress assets. These amounts are included in \nOther operating\n within our consolidated statements of comprehensive income (loss).\nGross Margin Yields and Net Yields were calculated by dividing Gross Margin and Adjusted Gross Margin by APCD as follows (in millions, except APCD and Yields. Certain amounts may not add due to use of rounded numbers; reported Adjusted Gross Margin and Yields are calculated from the underlying dollar amounts):\nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nTotal revenue\n$\n5,139 \n$\n4,886 \n$\n13,676 \n$\n12,724 \nLess:\nCruise operating expenses\n2,479 \n2,391 \n6,841 \n6,600 \nDepreciation and amortization expenses\n435 \n410 \n1,265 \n1,190 \nGross Margin\n2,225 \n2,085 \n5,570 \n4,934 \nAdd:\nPayroll and related\n342 \n328 \n1,010 \n959 \nFood\n264 \n251 \n750 \n697 \nFuel\n297 \n290 \n854 \n876 \nOther operating\n569 \n545 \n1,630 \n1,584 \nDepreciation and amortization expenses\n435 \n410 \n1,265 \n1,190 \nAdjusted Gross Margin\n$\n4,131 \n$\n3,909 \n$\n11,077 \n$\n10,240 \nAPCD\n13,698,886 \n13,316,981 \n39,299,263 \n37,836,007 \nGross Margin Yields\n$\n162.39 \n$\n156.52 \n$\n141.73 \n$\n130.39 \nNet Yields\n$\n301.58 \n$\n293.46 \n$\n281.87 \n$\n270.63 \n31\nGross Cruise Costs, Net Cruise Costs and Net Cruise Costs excluding Fuel were calculated as follows (in millions, except APCD and costs per APCD. Certain amounts may not add due to use of rounded numbers; reported Gross Cruise Costs, Net Cruise Costs, Net Cruise Costs excluding Fuel, and per APCD amounts are calculated from the underlying dollar amounts):\nQuarter Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nTotal cruise operating expenses\n$\n2,479 \n$\n2,391 \n$\n6,841 \n$\n6,600 \nMarketing, selling and administrative expenses\n522 \n451 \n1,593 \n1,452 \nGross Cruise Costs\n3,001 \n2,842 \n8,434 \n8,052 \nLess:\nCommissions, transportation and other\n696 \n688 \n1,823 \n1,758 \nOnboard and other\n312 \n289 \n775 \n726 \nNet Cruise Costs including other costs\n1,993 \n1,865 \n5,836 \n5,568 \nLess:\nRestructuring charges and other initiative expenses (1)\n1 \n2 \n7 \n5 \nImpairment losses (2)\n— \n— \n— \n6 \nNet Cruise Costs\n1,992 \n1,863 \n5,829 \n5,557 \nLess:\nFuel\n297 \n290 \n854 \n876 \nNet Cruise Costs Excluding Fuel\n$\n1,695 \n$\n1,573 \n$\n4,976 \n$\n4,681 \nAPCD\n13,698,886 \n13,316,981 \n39,299,263 \n37,836,007 \nGross Cruise Costs per APCD\n$\n219.09 \n$\n213.42 \n$\n214.61 \n$\n212.82 \nNet Cruise Costs per APCD\n$\n145.44 \n$\n139.87 \n148.33\n$\n146.88 \nNet Cruise Costs Excluding Fuel per APCD\n$\n123.75 \n$\n118.12 \n$\n126.61 \n$\n123.73 \n(1)\nThese amounts are included in \nMarketing, selling and administrative expenses\n within our consolidated statements of comprehensive income (loss).\n(2)\nFor 2024, represents property and equipment impairment charges related to certain construction in progress assets. This amount is included in \nOther operating\n within our consolidated statements of comprehensive income (loss).\n32\nQuarter Ended September 30, 2025 Compared to Quarter Ended September 30, 2024\nIn this section, references to 2025 refer to the quarter ended September 30, 2025 and references to 2024 refer to the quarter ended September 30, 2024. \nRevenues\nTotal revenues\n for 2025 increased $253 million to $5.1 billion from $4.9 billion in 2024. \nPassenger ticket revenues\n comprised 70.8% of our 2025 total revenues. \nPassenger ticket revenues \nfor 2025 increased by $166 million, or 4.8% to $3.6 billion from $3.5 billion in 2024. The increase was primarily due to:\n•\n$100 million driven by 2.9% capacity growth as a result of the addition of \nStar of the Seas \n(which began revenue sailings in August 2025)\n \nand addition of \nUtopia of the Seas\n (which began revenue sailings in July 2024) compared to the same period in 2024, and\n•\n$66 million driven by yield growth as a result of higher load factors and higher pricing on both existing ships and new ships in 2025 compared to the same period in 2024.\nThe remaining 29.2% of 2025 total revenues was comprised of \nOnboard and other revenues\n, which increased $87 million, or 6.2% to $1.5 billion in 2025 from $1.4 billion in 2024. The increase was primarily due to: \n•\n$47 million driven by yield growth as a result of higher load factors and higher pricing on both existing ships and new ships in 2025 compared to the same period in 2024; and\n•\n$41 million driven by 2.9% capacity growth as a result of the addition of \nStar of the Seas \ncompared to the same period in 2024.\nCruise Operating Expenses\nTotal \nCruise operating expenses\n for 2025 increased $88 million to $2.5 billion from $2.4 billion in 2024. The increase was primarily due to the 2.9% increase in capacity noted above which increased cruise operating expenses by $69 million in 2025 compared to the same period in 2024.\nMarketing, Selling and Administrative Expenses\nMarketing, selling and administrative expenses\n for 2025 increased $71 million, or 15.8%, to $522 million from $451 million in 2024. The increase was primarily due to an increase in payroll and benefits expense driven by an increase in headcount, and higher spending on marketing in 2025 compared to the same period in 2024.\nOther Income (Expense)\nInterest expense, net of interest capitalized\n for 2025 decreased $355 million, to $248 million from $603 million in 2024. The decrease was primarily due to loss on extinguishment of debt and inducement expense of $323 million in 2024 that did not recur during the same period in 2025.\nEquity investment incom\ne for 2025 increased $52 million, to $158 million from $106 million in 2024. The increase in income was primarily due to an increase in income from TUI Cruises, one of our equity investments.\nOther comprehensive income (loss)\nOther comprehensive (loss) \nwas\n \n$(9) million\n \nin 2025\n compared to a loss of $(99) million for the same period in \n2024\n. The decrease on loss of $90 million was primarily due to \nLoss on cash flow derivative hedges\n of $(5) million in \n2025 \ncompared to loss of $(95) million in \n2024, \nmostly as a result of a significant increase in the fair value of our fuel swaps in \n2025\n compared to \n2024\n.\n33\nNine Months Ended September 30, 2025\n Compared to \nNine Months Ended September 30, 2024\nIn this section, references to 2025 refer to the nine months ended September 30, 2025 and references to 2024 refer to the nine months ended September 30, 2024. \nRevenues\nTotal revenues for 2025 increased $1.0 billion to $13.7 billion from $12.7 billion in 2024. \nPassenger ticket revenues\n comprised 70.0% of our 2025 total revenues. \nPassenger ticket revenues \nfor 2025 increased by $0.7 billion, or 7.6% to $9.6 billion from $8.9 billion in 2024. The increase was primarily due to:\n•\nan increase of $344 million driven by 3.9% capacity growth as a result of the addition of \nStar of the Seas\n during the third quarter of 2025, and nine months of operations of \nUtopia of the Seas\n and \nSilver Ray \ncompared to the same period in 2024; and \n•\nan increase of $335 million driven by yield growth as a result of higher load factors and higher pricing on both existing ships and new ships in 2025 compared to the same period in 2024.\nThe remaining 30.0% of 2025 total revenues was comprised of \nOnboard and other revenues\n, which increased $273 million, or 7.1% to $4.1 billion in 2025 from $3.8 billion in 2024. The increase was primarily due to: \n•\na $148 million increase driven by a 3.9% capacity growth as a result of the additions of new ships noted above compared to the same period in 2024; and\n•\na $125 million increase driven by yield growth as a result of higher load factors and higher pricing on both existing ships and new ships in 2025 compared to the same period in 2024. \nCruise Operating Expenses\nTotal \nCruise operating expenses\n for 2025 increased $241 million to $6.8 billion from $6.6 billion in 2024. The increase was primarily due to the increase in capacity noted above. \nMarketing, Selling and Administrative Expenses\nMarketing, selling and administrative expenses\n for 2025 increased $141 million, or 10%, to $1.6 billion from $1.5 billion in 2024. This increase primarily relates to an increase in payroll and benefits expense driven by increased headcount in 2025 compared to the same period in 2024. \nDepreciation and Amortization Expenses\n \nDepreciation and amortization expenses\n for 2025 increased $75 million, or 6.3%, to $1.3 billion from $1.2 billion in 2024. The increase was primarily due to the addition of \nStar of the Seas \nin\n \n2025 and nine months of depreciation of \nUtopia of the Seas\n and \nSilver Ray \ncompared to the same period in 2024.\nOther Income (Expense)\nInterest expense, net of interest capitalized\n for 2025 decreased $599 million, to $0.7 billion from $1.3 billion in 2024. The decrease was primarily due to the $456 million loss on extinguishment of debt and inducement expense in 2024 compared to an immaterial amount during the same period in 2025. The remaining decrease was due to the refinancing of certain indebtedness at lower rates compared to the same period in 2024.\nEquity investment incom\ne for 2025 increased $110 million, to $313 million from $203 million in 2024. The increase in income was primarily due to an increase in income from TUI Cruises, one of our equity investments.\nOther comprehensive income (loss)\nOther comprehensive income \nwas\n \n$274 million\n \nin 2025\n compared to \nOther comprehensive loss\n of \n$(79) million\n for the same period in \n2024\n. The increase of \n$353 million in income\n was primarily due to a g\nain on cash flow derivative hedges\n of \n$304 million\n in \n2025 \ncompared to loss on cash flow derivative hedges of \n$(82) million in 2024\n, mostly as a result of a significant increase in the fair value of our FX forward swaps in \n2025\n compared to \n2024\n.\n34\nFuture Application of Accounting Standards\nRefer to Note 2\n. Summary of Significant Accounting Policies\n to our consolidated financial statements under Item 1. \nFinancial Statements\n. \nLiquidity and Capital Resources\nSources and Uses of Cash\nCash flow generated from operations provides us with a significant source of liquidity. \nNet cash provided by operating activities \nwas $4.8 billion and $3.8 billion for the nine months ended September 30, 2025, and 2024, respectively. Cash flows from operating activities increased $1.0 billion primarily driven by an increase in operating income.\nNet cash used in investing activities\n was $3.5 billion for the nine months ended September 30, 2025, compared to $2.8 billion for the same period in 2024. The increase of $0.7 billion in \nCash flows used in investing activities\n was primarily attributable to capital expenditures related to the delivery of \nStar of the Seas \nand the acquisition of the Port of Costa Maya\n \nin 2025 compared to the delivery of \nUtopia of the Seas\n and \nSilver Ray\n in 2024.\nNet cash used in financing activities \nwas\n \n$1.3 billion for the nine months ended September 30, 2025, compared to $1.1 billion for the same period in 2024. The change of $0.2 billion was primarily attributable to a net decrease in repayment of debt of $0.7 billion and a decrease of $288 million of premium on repayments of debt, offset by $655 million repurchase of common stock and $552 million dividend payment in 2025 compared to the same period in 2024.\nFuture Capital Commitments\nCapital Expenditures\nOur future capital commitments consist primarily of new ship orders. As of September 30, 2025, the dates that the ships on order by our Global and Partner Brands are expected to be delivered, and their approximate berths are as follows:\nShip\nShipyard\nExpected delivery\nApproximate\nBerths\nRoyal Caribbean —\n \n \nOasis-class:\n \n \nUnnamed\nChantiers de l'Atlantique\n2nd Quarter 2028\n5,700\nIcon-class:\nLegend of the Seas\nMeyer Turku Oy\n2nd Quarter 2026\n5,600\nUnnamed\nMeyer Turku Oy\n3rd Quarter 2027\n5,600\nCelebrity Cruises —\nEdge-class:\nCelebrity Xcel\nChantiers de l'Atlantique\n4th Quarter 2025\n3,250\nCelebrity Xcite\nChantiers de l'Atlantique\n4th Quarter 2028\n3,250\nMein Schiff  —\nMein Schiff Flow\nFincantieri\n2nd Quarter 2026\n4,100\nUnnamed\nFincantieri\n1st Quarter 2031\n4,100\nUnnamed\nFincantieri\n4th Quarter 2032\n4,100\nTotal Berths\n35,700\nOur future capital commitments consist primarily of new ship orders. As of September 30, 2025, the aggregate expected cost of our ships on order presented in the table above, excluding any ships on order by our Partner Brands, was $9.7 billion, of which we had deposited $1.0 billion. Approximately 60.0% of the aggregate cost was exposed to fluctuations in the Euro exchange rate at September 30, 2025. Refer to \nNote 9. Commitments and Contingencies \nand Note 12\n. Fair Value Measurements and Derivative Instruments \nto our consolidated financial statements under Item 1. \nFinancial Statements\n for further information.\nAs of September 30, 2025, we anticipate overall 2025 capital expenditures of approximately $5 billion, primarily related to our existing ships on order, and land-based destination initiatives. This amount does not include any ships on order by our Partner Brands. \n35\nMaterial Cash Requirements\nAs of September 30, 2025, our material cash requirements were as follows (in millions):\nRemainder of\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal\nOperating Activities:\nInterest on debt(1)\n$\n229 \n$\n934 \n$\n793 \n$\n620 \n$\n526 \n$\n1,876 \n$\n4,978 \nOther(2)\n107 \n370 \n179 \n140 \n127 \n1,099 \n2,022 \nInvesting Activities:\nShip purchase obligations(3)\n939 \n2,030 \n1,989 \n2,708 \n— \n— \n7,666 \nTotal\n$\n1,275 \n$\n3,334 \n$\n2,961 \n$\n3,468 \n$\n653 \n$\n2,975 \n$\n14,666 \n(1)\nLong-term debt obligations mature at various dates through fiscal year 2042 and bear interest at fixed and variable rates. Interest on variable-rate debt is calculated based on forecasted debt balances, including the impact of interest rate swap agreements, using the applicable rate at September 30, 2025. Debt denominated in other currencies is calculated based on the applicable exchange rate at September 30, 2025. \n(2)\nAmounts primarily represent future commitments with remaining terms in excess of one year to pay for our usage of certain port facilities, marine consumables, services and maintenance contracts.\n(3)\nAmounts are based on contractual installment and delivery dates for our ships on order. Included in these figures are $6.7 billion in final contractual installments, which have committed financing with sovereign guarantees covering approximately 80% of the cost of the ships on order for our Global Brands. Amounts do not include potential obligations which remain subject to cancellation at our sole discretion or any agreements entered for ships on order that remain contingent upon completion of conditions precedent.\nRefer to Note 7\n. Debt \nto our consolidated financial statements under Item 1. \nFinancial Statements\n for maturities related to debt.\nRefer to Note 8\n. Leases \nto our consolidated financial statements under Item 1. \nFinancial Statements\n for maturities related to lease liabilities.\nRefer to \nFunding Needs and Sources \nfor discussion on the planned funding of the above material cash requirements. \nAs a normal part of our business, depending on market conditions, pricing and our overall growth strategy, we continuously consider opportunities to enter into contracts for the building of additional ships. We may also consider the sale of ships or the purchase of existing ships. We continuously consider potential acquisitions and strategic alliances. If any of these were to occur, they would be financed through the incurrence of additional indebtedness, the issuance of additional shares of equity securities or through cash flows from operations. \nOff-Balance Sheet Arrangements\nRefer to Note 6\n. Investments and Other Assets \nto our consolidated financial statements under Item 1. \nFinancial Statements \nfor ownership restrictions related to TUI Cruises.\nRefer to Note 3\n. Revenue \nto our consolidated financial statements under Item 1. \nFinancial Statements \nfor credit card processor agreements for export credit agency guarantees.\nRefer to Note 9\n. Commitments and Contingencies\n to our consolidated financial statements under Item 1. \nFinancial Statements \nfor other agreements.\nAs of September 30, 2025, other than the items described above, we are not party to any other off-balance sheet arrangements, including guarantee contracts, retained or contingent interest, certain derivative instruments and variable interest entities, that either have, or are reasonably likely to have, a current or future material effect on our financial position.\n36\nFunding Needs and Sources\nWe have significant contractual obligations of which our debt service obligations and the capital expenditures associated with our ship purchases represent our largest funding needs. As of September 30, 2025, we had $8.8 billion of committed financing for our ships on order. \nAs of September 30, 2025, our obligations due through September 30, 2026 primarily consisted of $3.1 billion related to debt maturities, $936 million related to interest on debt and $2.9 billion related to progress payments on our ship orders and, based on the expected delivery date, the final installments payable due upon the delivery of\n Celebrity Xcel \nand\n Legend of the Seas\n. W\ne have historically relied on a combination of cash flows provided by operations, draw-downs under our available credit facilities, the incurrence of additional debt and/or the refinancing of our existing debt and the issuance of additional shares of equity securities to fund our obligations.\nAs of September 30, 2025, we had liquidity of $6.8 billion, including cash and cash equivalents of $0.4 billion, and $6.4 billion of undrawn revolving credit facility capacity.\nIf any person acquires ownership of more than 50% of our common stock or, subject to certain exceptions, during any 24-month period, a majority of our Board of Directors is no longer comprised of individuals who were members of our Board of Directors on the first day of such period, we may be obligated to prepay indebtedness outstanding under our credit facilities, which we may be unable to replace on similar terms. Our public debt securities also contain change of control provisions that would be triggered by a third-party acquisition of greater than 50% of our common stock coupled with a ratings downgrade. If this were to occur, it would have an adverse impact on our liquidity and operations.\nBased on our assumptions and estimates and our financial condition, we believe that we have sufficient financial resources to fund our obligations for at least the next twelve months from the issuance of these financial statements. However, there is no assurance that our assumptions and estimates are accurate as there is inherent uncertainty in our ability to predict future liquidity requirements.\nDebt Covenants\nOur export credit facilities and our non-export credit facilities, and certain of our credit card processing agreements contain covenants that require us, among other things, to maintain a fixed charge coverage ratio, and limit our net debt-to-capital ratio. As of September 30, 2025, we were in compliance with our financial covenants and we estimate that we will be in compliance for at least the next twelve months.\nDividends \nThe declaration of dividends shall at all times be subject to the final determination of our Board of Directors that a dividend is prudent at that time in consideration of the needs of the business. During the quarter ended September 30, 2025, our Board of Directors declared a cash dividend on our common stock of $1.00 per share, which was paid in October 2025. \n37"
}