{
  "item1": "Regeneron Genetics Center LLC (RGC ), wholly owned subsidiary Regeneron Pharmaceuticals, Inc., leverages de-identified clinical, genomic, other types molecular data properly consented human volunteers around world identify medically relevant associations blinded fashion designed preserve patient's privacy while uncovering unique characteristics health wellness. objective RGC expand use human genetics discovering validating genetic factors cause influence range diseases where there major unmet medical needs, prospect improving drug discovery development process advance innovation clinical care design. RGC undertaking multiple collaborative approaches study design implementation, including large population-based efforts engage study participants more discrete disease specific founder populations data strategic phenotypes interest. RGC utilizes laboratory automation innovative approaches cloud computing achieve high-quality throughput, attaining nearly 3 million samples sequenced date.",
  "item7": "Research development expenses included stock-based compensation expense $543.8 million $488.7 million 2024 2023, respectively. There numerous uncertainties associated drug development, including uncertainties related safety efficacy data each phase drug development, uncertainties related enrollment performance clinical trials, changes regulatory requirements, changes competitive landscape affecting product candidate, other risks uncertainties described Part I, Item 1A. \"Risk Factors.\" There also variability duration costs necessary develop product candidate, potential opportunities and/or uncertainties related future indications studied, estimated cost scope projects. lengthy process seeking FDA other applicable approvals, subsequent compliance applicable statutes regulations, require expenditure substantial resources.",
  "item2": "commercial success products product candidates subject significant competition - Marketed Products.\" addition, if independent not-for-profit patient assistance funds provide copay assistance unable support eligible patients, will likely continued negative impact patient affordability resulting lower utilization higher-cost anti-VEGF agents. Collaboration Revenue Sanofi Collaboration Revenue Regeneron's share profits Reimbursement manufacturing commercial supplies Total Sanofi collaboration revenue Corresponding costs incurred Company connection such manufacturing recorded within Cost collaboration contract manufacturing Global net product sales Dupixent Kevzara recorded Sanofi, Sanofi share profits such sales. Regeneron's share profits connection commercialization Dupixent Kevzara summarized below: Dupixent Kevzara net product sales Regeneron's share collaboration profits connection commercialization antibodies Reimbursement development expenses incurred Sanofi accordance Regeneron's payment obligation Regeneron's share profits Regeneron's share profits percentage Dupixent Kevzara net product sales See \"Collaboration, License, Other Agreements - Sanofi\" above additional details contingent reimbursement obligation increase share profits three nine months ended September 30, 2025, compared same periods 2024, driven higher profits associated increase Dupixent sales. Bayer Collaboration Revenue Regeneron's share profits Reimbursement manufacturing commercial supplies Total Bayer collaboration revenue Corresponding costs incurred Company connection such manufacturing recorded within Cost collaboration contract manufacturing Bayer records net product sales EYLEA 8 mg EYLEA outside United States, Bayer share profits such sales."
}