{
  "source_file": "regn-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nThis Annual Report on Form 10-K contains forward-looking statements that involve risks and uncertainties relating to future events and the future performance of Regeneron Pharmaceuticals, Inc. (where applicable, together with its subsidiaries, \"Regeneron,\" \"Company,\" \"we,\" \"us,\" and \"our\"), and actual events or results may differ materially from these forward-looking statements. Words such as \"anticipate,\" \"expect,\" \"intend,\" \"plan,\" \"believe,\" \"seek,\" \"estimate,\" variations of such words, and similar expressions are intended to identify such forward-looking statements, although not all forward-looking statements contain these identifying words. These statements concern, and these risks and uncertainties include, among others: \n•\nthe nature, timing, and possible success and therapeutic applications of products marketed or otherwise commercialized by Regeneron and/or its collaborators or licensees (collectively, \"Regeneron's Products\") and product candidates being developed by Regeneron and/or its collaborators or licensees (collectively, \"Regeneron's Product Candidates\") and research and clinical programs now underway or planned, including without limitation those discussed or referenced in this report, Regeneron's and its collaborators' earlier-stage programs, and the use of human genetics in Regeneron's research programs; \n•\nthe likelihood and timing of achieving any of our anticipated development milestones referenced in this report; \n•\nsafety issues resulting from the administration of Regeneron's Products and Regeneron's Product Candidates in patients, including serious complications or side effects in connection with the use of Regeneron's Products and Regeneron's Product Candidates in clinical trials; \n•\nthe likelihood, timing, and scope of possible regulatory approval and commercial launch of Regeneron's Product Candidates and new indications for Regeneron's Products, including without limitation those discussed or referenced in this report; \n•\nthe extent to which the results from the research and development programs conducted by us and/or our collaborators may be replicated in other studies and/or lead to advancement of product candidates to clinical trials, therapeutic applications, or regulatory approval; \n•\nongoing regulatory obligations and oversight impacting Regeneron's Products, research and clinical programs, and business, including those relating to patient privacy; \n•\ndeterminations by regulatory and administrative governmental authorities which may delay or restrict our ability to continue to develop or commercialize Regeneron's Products and Regeneron's Product Candidates; \n•\ncompeting drugs and product candidates that may be superior to, or more cost effective than, Regeneron's Products and Regeneron's Product Candidates (including biosimilar versions of Regeneron's Products);\n•\nuncertainty of the utilization, market acceptance, and commercial success of Regeneron's Products and Regeneron's Product Candidates and the impact of studies (whether conducted by Regeneron or others and whether mandated or voluntary) or recommendations and guidelines from governmental authorities and other third parties on the commercial success of Regeneron's Products and Regeneron's Product Candidates; \n•\nour ability to manufacture and manage supply chains for multiple products and product candidates; \n•\nthe ability of our collaborators, suppliers, or other third parties (as applicable) to perform manufacturing, filling, finishing, packaging, labeling, distribution, and other steps related to Regeneron's Products and Regeneron's Product Candidates; \n•\nthe availability and extent of reimbursement of Regeneron's Products from third-party payors, including private payor healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid; \n•\ncoverage and reimbursement determinations by such payors and new policies and procedures adopted by such payors;\n•\nchanges in laws, regulations, and policies affecting the healthcare industry;\n•\nthe costs of developing, producing, and selling products or unanticipated expenses;\n•\nour ability to meet any of our financial projections or guidance, including without limitation capital expenditures, and changes to the assumptions underlying those projections or guidance; \n•\nthe potential for any license or collaboration agreement, including our agreements with Sanofi and Bayer (or their respective affiliated companies, as applicable), to be cancelled or terminated; \n•\nthe impact of public health outbreaks, epidemics, or pandemics on our business; and \n•\nrisks associated with litigation and other proceedings and government investigations relating to the Company and/or its operations (including without limitation those described in Note 16 to our Consolidated Financial Statements included in this report), risks associated with intellectual property of other parties and pending or future litigation relating thereto (including without limitation the patent litigation and other related proceedings described further in Note 16 to our Consolidated Financial Statements included in this report), the ultimate outcome of any such proceedings and investigations, and the impact any of the foregoing may have on our business, prospects, operating results, and financial condition. \nThese statements are made based on management's current beliefs and judgment, and the reader is cautioned not to rely on any such statements. In evaluating such statements, shareholders and potential investors should specifically consider the various \n2\nTable of \nContents\nfactors identified under Part I, Item 1A. \"Risk Factors,\" which could cause actual events and results to differ materially from those indicated by such forward-looking statements. We do not undertake any obligation to update (publicly or otherwise) any forward-looking statement, whether as a result of new information, future events, or otherwise.\nGeneral\nRegeneron Pharmaceuticals, Inc. is a fully integrated biotechnology company that invents, develops, manufactures, and commercializes medicines for people with serious diseases. Our products and product candidates in development are designed to help patients with eye diseases, allergic and inflammatory diseases, cancer, cardiovascular and metabolic diseases, neurological diseases, hematologic conditions, infectious diseases, and rare diseases. \nOur core business strategy is to maintain a strong foundation in scientific research and drug development using our proprietary technologies, and to build on that foundation with our clinical development, manufacturing, and commercial capabilities. Our objective is to continue to advance as an integrated, multi-product biotechnology company that provides patients and medical professionals with important medicines for preventing and treating human diseases.\nSelected financial information is summarized as follows:\nYear Ended December 31,\n(In millions, except per share data)\n2024\n2023\n2022\nRevenues\n$\n14,202.0 \n$\n13,117.2 \n$\n12,172.9 \nNet income\n$\n4,412.6 \n$\n3,953.6 \n$\n4,338.4 \nNet income per share - diluted\n$\n38.34 \n$\n34.77 \n$\n38.22 \nFor purposes of this report, references to our products encompass products commercialized by us and/or our collaborators or licensees and references to our product candidates encompass product candidates in development by us and/or our collaborators or licensees (in the case of collaborated or licensed products or product candidates under the terms of the applicable collaboration or license agreements), unless otherwise stated or required by the context.\nProducts\nProducts that have received marketing approval are summarized in the table below. Certain products have also received marketing approval in countries outside the United States, European Union (\"EU\"), or Japan.\nProduct\nDisease\nTerritory\nU.S.\nEU\nJapan\nEYLEA HD\n®\n (aflibercept) Injection 8 mg\n(a)\nWet age-related macular degeneration (\"wAMD\")\na\na\na\nDiabetic macular edema (\"DME\")\na\na\na\nDiabetic retinopathy (\"DR\")\na\nEYLEA\n®\n (aflibercept) Injection\n(a)\nwAMD\na\na\na\nDME\na\na\na\nDR\na\nMacular edema following retinal vein occlusion (\"RVO\"), which includes macular edema following central retinal vein occlusion (\"CRVO\") and macular edema following branch retinal vein occlusion (\"BRVO\")\na\na\na\nMyopic choroidal neovascularization (\"mCNV\")\na\na\nNeovascular glaucoma (\"NVG\")\na\nRetinopathy of prematurity (\"ROP\")\na\na\na\nDupixent\n®\n (dupilumab) Injection\n(b)\nAtopic dermatitis (in adults, adolescents, and pediatrics aged 6 months and older)\na\na\na\nAsthma (in adults and adolescents)\na\na\na\n3\nTable of \nContents\nProduct \n(continued)\nDisease\nTerritory\nU.S.\nEU\nJapan\nDupixent (dupilumab) Injection\n(b)\n \n(continued)\nAsthma (in pediatrics 6–11 years of age)\na\na\nChronic rhinosinusitis with nasal polyposis (\"CRSwNP\") (in adults)\na\na\na\nCRSwNP (in adolescents)\na\nChronic obstructive pulmonary disease (\"COPD\")\na\na\nEosinophilic esophagitis (\"EoE\") (in adults, adolescents, and pediatrics aged 1 year and older)\na\na\nPrurigo nodularis\na\na\na\nChronic spontaneous urticaria (\"CSU\") (in adults and adolescents)\na\nLibtayo\n®\n (cemiplimab) Injection\nMetastatic or locally advanced first-line non-small cell lung cancer (\"NSCLC\")\na\na\nMetastatic or locally advanced first-line NSCLC (in combination with chemotherapy)\na\na\nMetastatic or locally advanced basal cell carcinoma (\"BCC\")\na\na\nMetastatic or locally advanced cutaneous squamous cell carcinoma (\"CSCC\")\na\na\nMetastatic or recurrent second-line cervical cancer\na\na\nPraluent\n®\n (alirocumab) Injection\n(c)\nLDL-lowering in heterozygous familial hypercholesterolemia (\"HeFH\") or clinical atherosclerotic cardiovascular disease (\"ASCVD\")\na\na\nHeFH in pediatrics and adolescents (8–17 years of age)\na\na\nCardiovascular risk reduction in patients with established cardiovascular disease\na\na\nHomozygous familial hypercholesterolemia (\"HoFH\")\na\nKevzara\n®\n (sarilumab) Injection\n(b)\nRheumatoid arthritis (\"RA\")\na\na\na\nPolymyalgia rheumatica (\"PMR\")\na\na\nPolyarticular juvenile idiopathic arthritis (\"pJIA\") \na\na\nREGEN-COV\n®(d)\nCOVID-19\na\na\nEvkeeza\n®\n (evinacumab) Injection\n(e)\nHoFH (in adults, adolescents, and pediatrics)\na\na\na\nOrdspono\n™\n (odronextamab)\nFollicular lymphoma (\"FL\") \na\nDiffuse large B-cell lymphoma (\"DLBCL\")\na\nInmazeb\n®\n (atoltivimab, maftivimab, and odesivimab) Injection\nInfection caused by \nZaire ebolavirus\n \na\nVeopoz\n®\n (pozelimab) Injection\nCD55-deficient protein-losing enteropathy (\"CHAPLE\") (in adults, adolescents, and pediatrics aged 1 year and older) \na\n4\nTable of \nContents\nProduct \n(continued)\nDisease\nTerritory\nU.S.\nEU\nJapan\nARCALYST\n®\n (rilonacept) Injection\n(f)\nCryopyrin-associated periodic syndromes (\"CAPS\"), including familial cold auto-inflammatory syndrome (\"FCAS\") and Muckle-Wells syndrome (\"MWS\") (in adults and adolescents)\na\nDeficiency of interleukin-1 receptor antagonist (\"DIRA\") (in adults, adolescents, and pediatrics)\na\nRecurrent pericarditis (in adults and adolescents)\na\nZALTRAP\n®\n \n(ziv-aflibercept) Injection for Intravenous Infusion\n(g)\nMetastatic colorectal cancer (\"mCRC\")\na\na\na\nNote: Refer to table below (net product sales of Regeneron-discovered products) for information regarding whether net product sales for a particular product are recorded by us or others. In addition, unless otherwise noted, products in the table above are generally approved for use in adults in the above-referenced diseases.\n(a)\n In collaboration with Bayer outside the United States. Aflibercept 8 mg is known as EYLEA HD in the United States and EYLEA 8 mg in other countries. \n(b)\n In collaboration with Sanofi\n(c)\n The Company is solely responsible for the development and commercialization of Praluent in the United States and Sanofi is responsible for the development and commercialization of Praluent outside the United States.\n(d)\n In collaboration with Roche. Product is known as REGEN-COV in the United States and Ronapreve\n™\n in other countries. \n(e)\n The Company is solely responsible for the development and commercialization of Evkeeza in the United States and Ultragenyx is responsible for the development and commercialization of Evkeeza outside the United States.\n(f)\n \nKiniksa is solely responsible for the development and commercialization of ARCALYST.\n(g)\n Sanofi is solely responsible for the development and commercialization of ZALTRAP.\n5\nTable of \nContents\nThe table below includes net product sales of Regeneron-discovered products. Such net product sales are recorded by us or others, as further described in the footnotes to the table. We believe the information in the table is useful to investors as it demonstrates our pipeline productivity and our ability to innovate, discover, and develop new products, and bring those products to market either alone or based on contractual arrangements with other parties, which has a direct impact on our results of operations and financial condition. The table also shows the degree to which we, a collaborator, and/or a licensee is currently commercializing the products discovered by Regeneron. In addition, this information allows management and investors to assess the commercial trends and developments impacting Regeneron-discovered products. In arrangements where our collaborator or licensee is currently commercializing such products and is recording net product sales as a result, the net product sales shown in the table also are an important metric for management's review and assessment of (i) the revenues we record for our share of profits and/or royalties from such sales and (ii) the impact of our obligation to supply commercial product to certain of these collaborators or licensees.\nYear Ended December 31,\n2024\n2023\n2022\n(In millions)\nU.S.\nROW\n(g)\nTotal\nU.S.\nROW\nTotal\nU.S.\nROW\nTotal\nEYLEA HD and EYLEA\n(a)\n$\n5,968.2 \n$\n3,576.8 \n$\n9,545.0 \n$\n5,885.4 \n$\n3,495.2 \n$\n9,380.6 \n$\n6,264.6 \n$\n3,382.8 \n$\n9,647.4 \nDupixent\n(b)\n$\n10,398.7 \n$\n3,749.3 \n$\n14,148.0 \n$\n8,855.6 \n$\n2,732.5 \n$\n11,588.1 \n$\n6,668.0 \n$\n2,013.2 \n$\n8,681.2 \nLibtayo\n(c)\n$\n787.3 \n$\n429.5 \n$\n1,216.8 \n$\n538.8 \n$\n330.0 \n$\n868.8 \n$\n374.5 \n$\n203.5 \n$\n578.0 \nPraluent\n(d)\n$\n241.7 \n$\n523.3 \n$\n765.0 \n$\n182.4 \n$\n456.5 \n$\n638.9 \n$\n130.0 \n$\n337.4 \n$\n467.4 \nKevzara\n(b)\n$\n270.2 \n$\n188.5 \n$\n458.7 \n$\n214.7 \n$\n171.2 \n$\n385.9 \n$\n199.7 \n$\n158.3 \n$\n358.0 \nREGEN-COV\n(e)\n$\n— \n$\n3.5 \n$\n3.5 \n$\n— \n$\n618.8 \n$\n618.8 \n$\n— \n$\n1,769.6 \n$\n1,769.6 \nOther products\n(f)\n$\n202.9 \n$\n86.5 \n$\n289.4 \n$\n150.5 \n$\n67.4 \n$\n217.9 \n$\n56.1 \n$\n69.1 \n$\n125.2 \n(a)\n We record net product sales of EYLEA HD and EYLEA in the United States, and Bayer records net product sales outside the United States. We record our share of profits in connection with sales outside the United States within Collaboration revenue; refer to Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results of Operations - Revenues - Bayer Collaboration Revenue\" for such amounts.\n(b)\n Sanofi records global net product sales of Dupixent and Kevzara, and we record our share of profits in connection with global sales of such products within Collaboration revenue. Refer to Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results of Operations - Revenues - Sanofi Collaboration Revenue\" for such amounts.\n(c)\n We record global net product sales of Libtayo and pay Sanofi a royalty on such sales. Prior to July 1, 2022, Sanofi recorded net product sales of Libtayo outside the United States. Included in this line item for the years ended December 31, 2023 and 2022 is approximately $6 million and $34 million, respectively, of net product sales recorded by Sanofi in connection with sales in certain markets outside the United States (Sanofi recorded net product sales in such markets during a transition period).\n(d)\n We record net product sales of Praluent in the United States. Sanofi records net product sales of Praluent outside the United States and pays us a royalty on such sales, which is recorded within Other revenue.\n(e)\n Roche records net product sales outside the United States and we record our share of gross profits from sales, which is recorded within Collaboration revenue. Refer to Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations -Results of Operations - Revenues - Roche Collaboration Revenue\" for such amounts.\n(f)\n Included in this line item are products which are sold by us and others. Refer to Part II, Item 7. \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Results of Operations - Revenues\" for a complete listing of net product sales recorded by us. Not included in this line item are net product sales of ARCALYST, which are recorded by Kiniksa.\n(g)\n Rest of world (\"ROW\")\nPrograms in Clinical Development\nProduct candidates in Phase 2 and Phase 3 clinical development, which are being developed by us and/or our collaborators, are summarized in the table below. \nThere are numerous uncertainties associated with drug development, including uncertainties related to safety and efficacy data from each phase of drug development (including any post-approval studies), uncertainties related to the enrollment and performance of clinical trials, changes in regulatory requirements, changes to drug pricing and reimbursement regulations and requirements, and changes in the competitive landscape affecting a product candidate. The planning, execution, and results of our clinical programs are significant factors that can affect our operating and financial results.\nRefer to Part I, Item 1A. \"Risk Factors\" for a description of risks and uncertainties that may affect our clinical programs. Any of such risks and uncertainties may, among other matters, negatively impact the development timelines set forth in the table below.\n6\nTable of \nContents\nClinical Program\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nOphthalmology\nEYLEA HD (aflibercept) 8 mg\n(a)\n–RVO\n–Two-year data for wAMD and DME (U.S.)\n–Pre-filled syringe (U.S.)\n–Approved by European Commission (\"EC\") and Japan's Ministry of Health, Labour and Welfare (\"MHLW\") for wAMD and DME\n–Pre-filled syringe approved by European Medicines Agency (\"EMA\")\n–Presented positive three-year data from extension study of Phase 3 DME trial at American Academy of Ophthalmology (\"AAO\") Annual Meeting\n–Reported that Phase 3 QUASAR trial in RVO met its primary endpoint\n–U.S. Food and Drug Administration (\"FDA\") decision on supplemental Biologics License Application (\"sBLA\") with two-year data for wAMD and DME (target action date of April 20, 2025)\n–FDA decision for pre-filled syringe (mid-2025)\n–Submit sBLA for RVO (first quarter 2025)\n–Submit sBLA for every 4-week dosing regimen (first quarter 2025)\nPozelimab\n(f) \n(REGN3918)\nAntibody to C5\n–Geographic atrophy, cemdisiran combination\n(l)\nImmunology & Inflammation\nDupixent (dupilumab)\n(b)\nAntibody to IL-4R alpha subunit\n–Ulcerative colitis\n–Asthma in pediatrics (2–5 years of age)\n–Bullous pemphigoid\n(c)\n–CSU\n–Chronic pruritus of unknown origin (\"CPUO\")\n–Lichen simplex chronicus\n–COPD with type 2 inflammatory phenotype (Japan) \n–CSU in adults and adolescents (U.S. and EU)\n–Bullous pemphigoid (U.S.)\n –Approved by FDA for CRSwNP in adolescents\n–Approved by FDA and EC for EoE in pediatrics (1–11 years of age)\n–EMA's Committee for Medicinal Products for Human Use (\"CHMP\") adopted positive opinion for EoE in pediatrics (1–11 years of age)\n –Results from Phase 3 trial in pediatrics (1–11 years of age) with EoE published in \nNew England Journal of Medicine \n(\"\nNEJM\n\")\n–MHLW decision on regulatory submission for COPD (first half 2025)\n–FDA decision on sBLA (target action date of April 18, 2025) and EC decision on regulatory submission (first half 2025) for CSU in adults and adolescents\n–FDA decision on sBLA for bullous pemphigoid (second half 2025)\n–Submit regulatory application in the EU for bullous pemphigoid (first half 2025)\n7\nTable of \nContents\nClinical Program \n(continued)\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nDupixent (dupilumab)\n(b) \n(continued)\n–Approved by MHLW for CSU in adults and adolescents\n–Reported that second Phase 3 trial in CSU in biologic-naïve patients met its primary and key secondary endpoints\n–Approved by FDA, EC, and National Medical Products Administration (\"NMPA\") in China for uncontrolled COPD and an eosinophilic phenotype\n–Reported that Phase 3 NOTUS trial in COPD with evidence of type 2 inflammation met its primary and key secondary endpoints; results presented at 2024 American Thoracic Society International Conference and published in \nNEJM\n–Reported that Phase 3 trial in bullous pemphigoid met its primary and all key secondary endpoints \n–Reported that first Phase 3 trial in CPUO did not achieve statistical significance in its primary itch responder endpoint\nKevzara (sarilumab)\n(b)\nAntibody to IL-6R\n–Systemic juvenile idiopathic arthritis (\"sJIA\") (pivotal study)\n–Approved by FDA and EC for pJIA\n–Approved by EC for PMR\n8\nTable of \nContents\nClinical Program \n(continued)\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nItepekimab\n(b) \n(REGN3500)\nAntibody to IL-33\n–Non-cystic fibrosis bronchiectasis (\"NCFB\")\n–Chronic rhinosinusitis without nasal polyposis (\"CRSsNP\")\n–COPD\n(e)\n–Report results from Phase 3 study in COPD (second half 2025)\n–Initiate additional Phase 3 studies (first half 2025)\nREGN5713-5715\nMulti-antibody therapy to Bet v 1\n–Birch allergy\nREGN1908-1909\n(f)\nMulti-antibody therapy to Fel d 1\n–Cat allergy\nSolid Organ Oncology\nLibtayo (cemiplimab)\n(g)\nAntibody to PD-1\n–Neoadjuvant CSCC\n–First-line NSCLC, BNT116\n(i)\n combination\n–Neoadjuvant NSCLC\n–Neoadjuvant hepatocellular carcinoma (\"HCC\")\n–Adjuvant CSCC\n–Early-stage CSCC (intralesional)\n–First-line NSCLC, monotherapy and chemotherapy combination (Japan)\n–Presented positive five-year survival data from Phase 3 NSCLC monotherapy trial at IASLC 2024 World Conference on Lung Cancer\n–Reported positive interim data from Phase 3 study in adjuvant CSCC\n–MHLW decision on regulatory submission for NSCLC, monotherapy and chemotherapy combination (second half 2025)\n–Submit sBLA for adjuvant CSCC (first half 2025)\nFianlimab\n(f) \n(REGN3767)\nAntibody to LAG-3 \n–First-line advanced NSCLC (Phase 2/3)\n–Perioperative NSCLC\n–Perioperative melanoma\n–First-line metastatic melanoma\n(e)\n–Adjuvant melanoma\n–Presented positive two-year data from Phase 1 trial (in combination with Libtayo) in advanced melanoma at European Society for Medical Oncology (\"ESMO\") Annual Meeting\n–Initiate Phase 2 study (in combination with Libtayo) in first-line metastatic head and neck squamous cell carcinoma (2025)\n–Report results from Phase 3 study versus pembrolizumab in first-line metastatic melanoma (second half 2025)\n–Report initial data from Phase 2/3 study in first-line advanced NSCLC (first half 2025)\nVidutolimod\nImmune activator targeting TLR9\n–Company discontinued Phase 2 study due to drug supply\nUbamatamab\n(f) \n(REGN4018)\nBispecific antibody targeting MUC16 and CD3\n–Platinum-resistant ovarian cancer\n–Report additional data from study in platinum-resistant ovarian cancer (2025)\n9\nTable of \nContents\nClinical Program \n(continued)\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nNezastomig (REGN5678)\nBispecific antibody targeting PSMA and CD28\n–Prostate cancer\n–Report additional data from study in prostate cancer (2025)\nREGN7075\nBispecific antibody targeting EGFR and CD28\n–Solid tumors\n–Presented positive results from dose escalation portion of Phase 1/2 trial (in combination with Libtayo) in advanced solid tumors at American Society of Clinical Oncology (\"ASCO\") 2024 Annual Meeting\n–Report additional data from study in solid tumors (2025)\nDavutamig (REGN5093)\nBispecific antibody targeting two distinct MET epitopes\n–MET-altered advanced NSCLC\nHematology\nPozelimab\n(f) \n(REGN3918)\nAntibody to C5\n–Myasthenia gravis, cemdisiran combination\n(c)(l)\n–Paroxysmal nocturnal hemoglobinuria (\"PNH\"), cemdisiran combination\n(c)(l)\n–Presented positive updated data from Phase 3 trial (in combination with cemdisiran) in PNH at American Society of Hematology (\"ASH\") Annual Meeting \n–Report results from Phase 3 cemdisiran combination study in myasthenia gravis (second half 2025)\nOrdspono (odronextamab)\nBispecific antibody targeting CD20 and CD3\n–B-cell non-Hodgkin lymphoma\n (\"B-NHL\") (pivotal study)\n–FL\n(e)\n \n–DLBCL\n(e)\n–FL (U.S.)\n–FDA issued Complete Response Letters (\"CRLs\") for BLA for relapsed/refractory FL and DLBCL due to enrollment status of confirmatory Phase 3 trials; subsequently resubmitted BLA for FL\n–Approved by EC for relapsed/refractory FL and DLBCL\n–Presented new and updated data for several B-NHL subtypes across earlier lines of treatment at ASH Annual Meeting \n–FDA decision on BLA for relapsed/refractory FL (second half 2025)\n10\nTable of \nContents\nClinical Program \n(continued)\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nLinvoseltamab\n(f) \n(REGN5458)\nBispecific antibody targeting BCMA and CD3\n–Multiple myeloma (pivotal study)\n(c)(e)\n–Earlier (pre-malignant) multiple myeloma\n–Monoclonal gammopathy of undetermined significance (\"MGUS\")\n–Light chain amyloidosis (\"ALA\")\n–Multiple myeloma\n(c)(e)\n–Relapsed/refractory multiple myeloma (U.S. and EU)\n–Resubmitted BLA for relapsed/refractory multiple myeloma following resolution of third-party manufacturing issues\n–Presented 14-month median follow-up data from pivotal Phase 1/2 trial in multiple myeloma at European Hematology Association (\"EHA\") Congress 2024 and published these data in \nJournal of Clinical Oncology\n–FDA decision on BLA (mid-2025) and EC decision on regulatory application (first half 2025) for relapsed/refractory multiple myeloma\nNexiguran ziclumeran (Nex-z, NTLA-2001)\n(j)\nTTR gene knockout using CRISPR/Cas9\n–Transthyretin amyloidosis with cardiomyopathy (\"ATTR-CM\")\n(c)\n–Hereditary transthyretin amyloidosis with polyneuropathy (\"ATTRv-PN\")\n(c)(m)\nREGN9933\nAntibody to Factor XI\n–Thrombosis\n–Reported positive results from Phase 2 trial in thrombosis\n–Initiate Phase 3 program (2025)\nREGN7508\nAntibody to Factor XI\n–Thrombosis\n–Reported positive results from Phase 2 trial in thrombosis\n–Initiate Phase 3 program (2025)\nREGN7257\nAntibody to IL2Rg\n–Aplastic anemia\nREGN7999\nAntibody to TMPRSS6\n–Iron overload in beta-thalassemia\nInternal Medicine/Genetic Medicines\nGaretosmab\n(f) \n(REGN2477)\nAntibody to Activin A\n–Fibrodysplasia ossificans progressiva \n(\"FOP\")\n(c)(d)(e)\n–Report results from Phase 3 study in FOP (second half 2025)\nTrevogrumab\n(f)\n (REGN1033)\nAntibody to myostatin (GDF8)\n–Obesity\n(n)\n–Completed enrollment in Phase 2 study in obesity\n–Report results from Phase 2 study in obesity (second half 2025)\n11\nTable of \nContents\nClinical Program \n(continued)\nPhase 2\nPhase 3\nRegulatory\nReview\n(h)\n2024 and 2025\nEvents to Date\nSelect Upcoming\nMilestones\nMibavademab\n(f)(o) \n(REGN4461)\nAgonist antibody to leptin receptor (\"LEPR\")\n–Generalized lipodystrophy\n(d)(e)\nREGN5381\nAgonist antibody to NPR1\n–Heart failure\nREGN7544\nAntagonist antibody to NPR1\n–Postural orthostatic tachycardia syndrome (\"POTS\")\nRapirosiran (ALN-HSD)\n(k)\nRNAi therapeutic targeting HSD17B13\n–Metabolic dysfunction-associated steatohepatitis (\"MASH\")\nDB-OTO\nAAV-based gene therapy\n–Hearing deficit due to variants of the otoferlin gene\n(c)(m)\n (Phase 1/2)\n–Presented updated data from Phase 1/2 trial at American Society of Gene and Cell Therapy (\"ASGCT\") annual conference\n–Report additional data from Phase 1/2 study (mid-2025)\nNote: For purposes of the table above, a program is classified in Phase 2 or 3 clinical development after recruitment for the corresponding study or studies has commenced.\n(a)\n In collaboration with Bayer outside the United States\n(b)\n In collaboration with Sanofi\n(c)\n FDA granted Orphan Drug designation\n(d)\n FDA granted Breakthrough Therapy designation\n(e)\n FDA granted Fast Track designation\n(f)\n Sanofi did not opt-in to or elected not to continue to co-develop the product candidate. Under the terms of our agreement, Sanofi is entitled to receive royalties on sales of the product, if any.\n(g)\n \nStudied as monotherapy and in combination with other antibodies and treatments\n(h)\n Information in this column captures submissions to U.S., EU, and Japan regulatory authorities\n(i)\n BioNTech's BNT116 is an mRNA cancer vaccine.\n(j)\n In collaboration with Intellia\n(k)\n Alnylam elected to opt-out of the product candidate. Under the terms of our agreement, Alnylam is entitled to receive royalties on sales of the product, if any.\n(l)\n Under the terms of our license agreement for cemdisiran, Alnylam is entitled to receive royalties on sales (if any), as well as sales milestones.\n(m)\n FDA granted Regenerative Medicine Advanced Therapy (\"RMAT\") designation\n(n)\n Studied in combination with semaglutide with and without garetosmab\n(o)\n A Phase 2 study, sponsored by Eli Lilly, is also ongoing and testing the combination of tirzepatide and mibavademab compared with tirzepatide alone in patients with obesity.\n12\nTable of \nContents\nAdditional Information - Clinical Development Programs\nLinvoseltamab\nIn August 2024, the FDA issued a CRL for the BLA for linvoseltamab in relapsed/refractory multiple myeloma that has progressed after at least three prior therapies. The sole approvability issue identified related to findings from a pre-approval inspection at a third-party fill/finish manufacturer. In January 2025, the Company resubmitted the BLA following resolution of third-party manufacturing issues, and an FDA decision on the BLA is anticipated by mid-2025.\nDupixent\nIn September 2024, the Company and Sanofi announced that the first Phase 3 trial (Study A) of Dupixent in adults with uncontrolled and severe CPUO did not achieve statistical significance in its primary itch responder endpoint (despite favorable numerical improvements), but showed nominally significant improvements in all other itch endpoints. The Dupixent Phase 3 program in CPUO consists of Study A and Study B. Study B recently initiated as a subsequent pivotal trial.\nSelect Early-Stage Clinical Development Updates\nIn 2024, a Phase 1 study of linvoseltamab, in combination with dupilumab, in severe food allergy was initiated.\nIn 2024, a Phase 1 combination cohort of nezastomig and REGN4336 (bispecific antibody targeting PSMA and CD3) in metastatic castration-resistant prostate cancer was initiated.\nDescriptions of Marketed Products Studied in Additional Indications and Product Candidates in Late-Stage Clinical Development \nEYLEA HD (aflibercept) 8 mg\nEYLEA HD is a soluble fusion protein that acts as a vascular endothelial growth factor (\"VEGF\") inhibitor. Through a novel formulation, it is designed to deliver a concentrated dose of aflibercept to block VEGF-A and PLGF and inhibit the growth of new blood vessels and decrease vascular permeability to treat various retinal diseases, including wAMD, DME, and DR.\nDupixent (dupilumab)\nDupixent is a fully human monoclonal antibody that inhibits signaling of the IL-4 and IL-13 pathways, and is not an immunosuppressant. IL-4 and IL-13 are key and central drivers of the type 2 inflammation that play a major role in atopic dermatitis, asthma, CRSwNP, COPD, EoE, prurigo nodularis, CSU, and potentially other chronic allergic and inflammatory diseases.\nKevzara (sarilumab)\nKevzara is a fully human monoclonal antibody that binds specifically to the IL-6 receptor and inhibits IL-6-mediated signaling. IL-6 is an immune system protein produced in increased quantities in patients with RA and has been associated with disease activity, joint destruction, and other systemic problems.\nItepekimab\nItepekimab is an investigational, fully human monoclonal antibody that inhibits IL-33, a protein that is believed to play a key role in lung inflammation in COPD.\nREGN5713-5715\nREGN5713-5715 is an investigational combination of two fully human monoclonal antibodies designed to treat allergic inflammatory conditions caused by the allergen Bet v 1, which is the main allergen responsible for birch pollen allergies. Birch pollen allergy is one of the most common causes of seasonal allergies that occur in the spring, and is also believed to trigger \"oral allergy syndrome\" food reactions to related allergens found in nuts and fruits such as apples, pears, and cherries.\nREGN1908-1909\nREGN1908-1909 is an investigational combination of two fully human monoclonal antibodies that is designed to specifically bind and block the Fel d 1 allergen, thus preventing it from binding and triggering the endogenous antibodies that cause allergies (i.e., immunoglobulin E antibodies). Cat allergy is primarily caused by exposure to Fel d 1, the major allergen in cat dander produced by all cats.\n13\nTable of \nContents\nLibtayo (cemiplimab)\nLibtayo is a fully human monoclonal antibody targeting the immune checkpoint receptor PD-1 on T-cells. The PD-1/PD-L1 immune checkpoint pathway is a well-known mechanism by which cancers evade immune destruction. Regeneron is studying Libtayo as monotherapy and in combination with either conventional or novel therapeutic approaches in various solid tumors and blood cancers. It is also being studied in combination with proprietary anti-cancer assets of other companies. Libtayo has also been approved by regulatory authorities in a number of cancer indications, including advanced NSCLC, BCC, CSCC, and cervical cancer.\nFianlimab\nFianlimab is an investigational, fully human monoclonal antibody targeting the immune checkpoint receptor LAG-3 on T-cells. In melanoma and NSCLC, LAG-3 expression in the tumor microenvironment may be associated with therapeutic resistance to PD-1 inhibitors. Fianlimab is being investigated in combination with Libtayo to determine whether concurrent blockade of LAG-3 and PD-1 can help overcome this resistance and release the brakes on T-cell activation.\nPozelimab\nPozelimab is a fully human monoclonal antibody designed to block complement factor C5 in order to treat diseases mediated by abnormal complement pathway activity, and is approved by the FDA for CHAPLE. Pozelimab is being studied in investigational combinations with an investigational small interfering RNA (\"siRNA\") therapy, cemdisiran, in PNH, myasthenia gravis, and geographic atrophy.\nOrdspono (odronextamab)\nOdronextamab is a bispecific monoclonal antibody designed to bridge CD20 on cancer cells with CD3-expressing T cells to facilitate local T-cell activation and cancer-cell killing. We are studying odronextamab in several types of B-cell non-Hodgkin lymphoma.\nLinvoseltamab\nLinvoseltamab is an investigational bispecific monoclonal antibody designed to bind to CD3 while also binding and bridging T-cells to the BCMA protein on multiple myeloma cells. We are studying whether linvoseltamab may help to activate T-cells via their CD3 receptors and trigger targeted, T-cell mediated killing of multiple myeloma. We are also studying linvoseltamab in precursor conditions to multiple myeloma, including high-risk MGUS and high-risk smoldering myeloma.\nNex-z\nNex-z is an investigational CRISPR-based therapy to be systemically delivered to edit genes inside the human body and is being studied as a treatment for ATTR amyloidosis. ATTR amyloidosis is a progressive and fatal disorder resulting from deposition of insoluble amyloid fibrils into multiple organs and tissues leading to systemic failure. Delivered with \nin vivo\n technology, nex-z offers the possibility of halting and reversing the disease by driving a deep, consistent, and potentially lifelong reduction in transthyretin (\"TTR\") protein after a single dose.\nGaretosmab\nGaretosmab is an investigational, fully human monoclonal antibody that binds to and neutralizes Activin A, which drives the abnormal bone formation that is the main pathology of the ultra-rare genetic disorder FOP. This abnormal bone formation in soft tissue outside of the normal skeleton, a process known as heterotopic ossification, leads to loss of mobility and premature death in FOP patients. Garetosmab is being investigated to determine whether it can help reduce and/or prevent the formation of heterotopic bone lesions by neutralizing the Activin A protein.\nMibavademab\nMibavademab is an investigational, fully human monoclonal antibody that binds to and activates the leptin receptor, which modulates the control of food intake, energy expenditure, and glucose/lipid metabolism. We are studying mibavademab as a potential treatment for generalized lipodystrophy.\nOther Programs\nOur preclinical research programs include the areas of oncology/immuno-oncology, angiogenesis, ophthalmology, metabolic and related diseases, muscle diseases and disorders, inflammation and immune diseases, bone and cartilage, pain and neurobiology, auditory conditions, enzyme replacement therapy, cardiovascular diseases, infectious diseases, and diseases related to aging. These preclinical research programs include both rare diseases and those involving broader populations.\n14\nTable of \nContents\nResearch and Development Technologies\nMany proteins that play an important role in biology and disease are secreted by cells or located on the cell surface. Moreover, cells communicate through secreted factors and surface molecules. Our scientists have developed two different technologies to make protein therapeutics that potently and specifically block, activate, or inhibit the action of specific cell surface or secreted molecules. The first technology fuses receptor components to the constant region of an antibody molecule to make a class of drugs we call \"Traps.\" EYLEA HD, EYLEA, ZALTRAP, and ARCALYST are drugs generated using our Trap technology. \nVelociSuite\n®\n is our second technology platform, which is used for discovering, developing, and producing fully human antibodies that can address both secreted and cell-surface targets. We also leverage \nVelociSuite\n \nto produce new classes of bispecific antibodies. Additionally, we use genetic medicine platforms as complementary approaches to these core technologies to potentially treat or cure diseases.\nVelociSuite \nVelociSuite\n consists of \nVelocImmune\n®\n,\n VelociGene\n®\n,\n VelociMouse\n®\n,\n VelociMab\n®\n, \nVeloci-Bi\n®\n, \nVelociT\n®\n,\n VelociHum\n®\n, and other related technologies. The \nVelocImmune\n mouse platform is utilized to produce fully human antibodies. \nVelocImmune\n was generated by leveraging our \nVelociGene\n technology (see below), in a process in which six megabases of mouse immunoglobulin gene loci were replaced, or \"humanized,\" with corresponding human immunoglobulin gene loci. \nVelocImmune\n mice can be used efficiently to generate fully human antibodies to targets of therapeutic interest. \nVelocImmune\n and our entire \nVelociSuite\n offer the potential to increase the speed and efficiency through which human antibody therapeutics may be discovered and validated, thereby improving the overall efficiency of our early-stage drug development activities. We are utilizing the \nVelocImmune\n technology to produce our next generation of therapeutic antibody drug candidates for preclinical and clinical development.\nOur \nVelociGene\n platform allows custom and precise manipulation of very large sequences of DNA to produce highly customized alterations of a specified target gene, or genes, and accelerates the production of knock-out and transgenic expression models. In producing knock-out models, a color or fluorescent marker may be substituted in place of the actual gene sequence, allowing for high-resolution visualization of precisely where the gene is active in the body during normal body functioning as well as in disease processes. For the optimization of preclinical development and pharmacology programs, \nVelociGene\n offers the opportunity to humanize targets by replacing the mouse gene with the human homolog or variants thereof. Thus, \nVelociGene\n allows scientists to rapidly identify the physical and biological effects of deleting or over-expressing the target gene, as well as to characterize and test potential therapeutic molecules.\nOur \nVelociMouse\n technology platform allows for the direct and immediate generation of genetically altered mice from embryonic stem cells (\"ES cells\"), thereby avoiding the lengthy process involved in generating and breeding knockout mice from chimeras. Mice generated through this method are normal and healthy and exhibit a 100% germ-line transmission. Furthermore, mice developed using our \nVelociMouse\n technology are suitable for direct phenotyping or other studies. \nWe have also developed our \nVelociMab\n platform for the rapid screening of antibodies and rapid generation of expression cell lines for our Traps and our \nVelocImmune\n human antibodies.\nWe have utilized our \nVelociSuite \ntechnologies to develop a class of potential drug candidates, known as bispecific antibodies. \nVeloci-Bi\n allows for the generation of full-length bispecific antibodies similar to native antibodies that are amenable to production by standard antibody manufacturing techniques, and are likely to have favorable antibody-like pharmacokinetic properties. In the area of immunotherapies in oncology, we are exploring the use of bispecific antibodies that target tumor antigens and the CD3 receptor on T-cells to harness the oncolytic properties of T-cells. We are exploring additional indications and applications for our bispecific technologies, including CD28 and 4-1BB costimulatory bispecifics. We are also exploring a variety of alternative antibody formats (Altibodies\n™\n) that can bring binding partners together in restrained geometries.\nThe \nVelociT\n mouse extends our research and drug discovery capabilities into cell-mediated immunity and therapeutic T-cell receptors (\"TCRs\") for oncology and other indications. \nVelociT\n was developed by using our \nVelociGene\n technology to humanize genes encoding TCRα and TCRβ variable sequences, CD4 and CD8 co-receptors, β2m, and class-I and -II major histocompatibility complexes. As a result, \nVelociT\n mice can be utilized to produce fully human TCRs, providing for customized modeling of T-cell function in different diseases and a powerful platform for the discovery of unique TCR-based therapies. We are also able to produce antibodies that recognize intracellular peptides bound in the groove of human leukocyte antigen (\"HLA\"), enabling the targeting of intracellular proteins in cancer cells.\nVelociHum\n is our immunodeficient mouse platform that can be used to accurately test human therapeutics against human immune cells and to study human tumor models. Through genetic humanizations, \nVelociHum\n mice have been optimized to allow for better development of human immune cells \nin vivo\n, as well as to allow for engraftment of primary patient-derived tumors that do not take in other commercially available mice.\n15\nTable of \nContents\nRegeneron Genetics Center\n®\n \nRegeneron Genetics Center LLC (RGC\n®\n), a wholly owned subsidiary of Regeneron Pharmaceuticals, Inc., leverages de-identified clinical, genomic, and other types of molecular data from properly consented human volunteers from around the world to identify medically relevant associations in a blinded fashion designed to preserve a patient's privacy while uncovering the unique characteristics of their health and wellness. The objective of RGC is to expand the use of human genetics for discovering and validating genetic factors that cause or influence a range of diseases where there are major unmet medical needs, with the prospect of improving the drug discovery and development process and to advance innovation in clinical care design. RGC is undertaking multiple collaborative approaches to study design and implementation, including large population-based efforts that engage study participants to more discrete disease specific and founder populations with data on strategic phenotypes of interest. RGC utilizes laboratory automation and innovative approaches to cloud computing to achieve high-quality throughput, attaining nearly 3 million samples sequenced to date.\nIn January 2025, it was announced that RGC was selected by UK Biobank consortium members to complete proteomic assay data generation for the recently announced UK Biobank Pharma Proteomics Project.\nIn January 2025, RGC entered into an agreement with Truveta Inc. pursuant to which RGC will sequence exomes and conduct genotyping and imputation of up to ten million de-identified consented volunteers using biospecimens provided by Truveta health system members across the United States. \nIn addition, central to the ongoing work of RGC is the portfolio of collaborations with over 150 academic and clinical collaborators around the world, including the University of Colorado, Geisinger Health System, Mayo Clinic, University of Pennsylvania, UCLA Medical Center, UK Biobank, University of Oxford, and the University of Cambridge. These collaborations provide access to biological samples and associated phenotype data from properly consented patient volunteers for purposes of genomic research. RGC undertakes genetic sequencing of these samples to create a unique resource of de-identified genetic data and associated phenotype data for research. Furthermore, RGC has deployed bulk RNA sequencing, whole genome sequencing, and an O-LINK proteomic assay to complement whole exome sequencing and genotyping. In addition, RGC leverages organoid models, siRNA, and CRISPR knockout models to validate genetic associations that lead to new therapeutic targets. RGC continues to publish results from its research efforts in journals and publications in partnership with its collaborators to advance the field of genomics.\nThese efforts at RGC have led to the identification of more than 30 novel genetic targets. Through our Regeneron Genetics Medicines initiative, we are currently advancing these targets using either our \nVelociSuite\n technologies or other technologies, such as siRNA gene silencing, genome editing, and targeted viral-based gene delivery and expression. See the \"Collaboration, License, and Other Agreements\" section below for descriptions of our collaborations with Alnylam Pharmaceuticals, Inc. and Intellia Therapeutics, Inc.\nCollaboration, License, and Other Agreements\nSanofi\nWe are collaborating with Sanofi on the global development and commercialization of Dupixent, Kevzara, and itepekimab (the \"Antibody Collaboration\"). Under the terms of the Antibody Collaboration, Sanofi is generally responsible for funding 80% to 100% of agreed-upon development costs. We are obligated to reimburse Sanofi for 30% to 50% of worldwide development expenses that were funded by Sanofi based on our share of collaboration profits; however, we are only required to apply 20% of our share of profits from the collaboration each calendar quarter to reimburse Sanofi for these development expenses. As of December 31, 2024, the total amount of our contingent reimbursement obligation (i.e., \"development balance\") to Sanofi in connection with such development expenses was approximately $1.635 billion. \nUnder our collaboration agreement, Sanofi records product sales for commercialized products, and Regeneron has the right to co-commercialize such products on a country-by-country basis. We co-commercialize Dupixent in the United States and in certain countries outside the United States. We supply certain commercial bulk product to Sanofi. We and Sanofi equally share profits from sales within the United States, and share profits outside the United States on a sliding scale based on sales starting at 65% (Sanofi)/35% (us) and ending at 55% (Sanofi)/45% (us). \n16\nTable of \nContents\nBayer \nWe and Bayer are parties to a license and collaboration agreement for the global development and commercialization of EYLEA 8 mg and EYLEA outside the United States. Agreed-upon development expenses incurred by the Company and Bayer are generally shared equally. Bayer is responsible for commercialization activities outside the United States, and the companies share equally in profits from such sales.\nWe are obligated to reimburse Bayer for 50% of the development costs that it has incurred under the agreement from our share of the collaboration profits. The reimbursement payment in any quarter will equal 5% of the then outstanding repayment obligation, but never more than our share of the collaboration profits in the quarter unless we elect to reimburse Bayer at a faster rate. \nWithin the United States, we retain exclusive commercialization rights and are entitled to all profits from such sales.\nAlnylam\nIn 2019, we and Alnylam entered into a collaboration to discover, develop, and commercialize RNAi therapeutics for a broad range of diseases by addressing therapeutic disease targets expressed in the eye and central nervous system (\"CNS\"), in addition to a select number of targets expressed in the liver. For each program, we provide Alnylam with a specified amount of funding at program initiation and at lead candidate designation. During 2023, we paid a $100.0 million development milestone to Alnylam (in connection with a CNS program) and Alnylam is eligible to receive an additional $100.0 million clinical proof-of-principle milestone in connection with an eye program. \nUnder the terms of the collaboration, the parties perform discovery research until designation of lead candidates. Following designation of a lead candidate, the parties may further advance such lead candidate under either a co-development/co-commercialization collaboration agreement (\"Co-Co Collaboration Agreement\") or a license agreement structure. The initial target nomination and discovery period of five years has been automatically extended until the earlier of seven years from the effective date of the collaboration or the achievement of certain milestones (the \"Research Term\"). In addition, we have an option to extend the Research Term for an additional five-year period for a research extension fee of $300.0 million.\nFor CNS programs and liver programs, under a Co-Co Collaboration Agreement, the party designated as the lead party will lead development and commercialization of the program and the parties will split profits and share costs equally, subject to certain co-funding opt-outs at specified clinical trial phases or under other conditions. \nUnder a license agreement, the lead party is designated as the licensee and has the right to develop and commercialize the collaboration product under such program. The licensee will be responsible for its own costs and expenses incurred. The licensee will pay to the licensor certain development and/or commercialization milestone payments, as well as certain tiered royalty payments to the licensor based on the aggregate annual net sales of the collaboration product.\nWe have entered into various license agreements with Alnylam, with us as the licensee, including for cemdisiran as a monotherapy and for a combination consisting of cemdisiran and pozelimab.\nDuring the second quarter of 2024, we elected to no longer co-develop ALN-APP pursuant to a Co-Co Collaboration Agreement; as a result, Alnylam retains the right to develop and commercialize such product and we will receive a royalty on sales (if any). \nIntellia\nWe and Intellia Therapeutics, Inc. are parties to a license and collaboration agreement to advance CRISPR/Cas9 gene-editing technology for \nin vivo\n therapeutic development. Nex-z, which is in clinical development, is subject to a co-development and co-commercialization arrangement pursuant to which Intellia will lead development and commercialization activities and the parties share an agreed-upon percentage of development expenses and profits (if commercialized). In addition, we also have non-exclusive rights to independently develop and commercialize \nex vivo\n gene edited products.\nIn September 2023, we expanded the license and collaboration agreement to develop additional \nin vivo\n CRISPR-based gene editing therapies focused on neurological and muscular diseases. Intellia will lead the design of the editing methodology, we will lead the design of the targeted viral vector delivery approach, and the parties share costs equally. Each company will have the opportunity to lead potential development and commercialization of product candidates for one target, and the company that is not leading development and commercialization will have the option to enter into a co-development and co-commercialization agreement for the target.\nIn addition, in October 2023, we elected to extend the period for selecting targets under the license and collaboration agreement for an additional two years until April 2026; as a result, we made a $30.0 million extension payment to Intellia.\n17\nTable of \nContents\nIn March 2024, Intellia elected to opt-out of further development activities pursuant to the Factor IX co-development and co-commercialization agreement; as a result, we retain the right to develop and commercialize products directed to Factor IX (which is currently in Phase 1 clinical development), and Intellia will be entitled to receive milestone payments and royalties on sales (if any). \nDecibel \nIn 2017, we entered into an agreement with Decibel Therapeutics, Inc. to discover and develop new potential therapeutics to protect, repair and restore hearing (including DB-OTO, which is currently in clinical development, and preclinical programs for GJB2-related and stereocilin-related hearing loss). \nIn 2023, we acquired Decibel by paying $101.3 million in cash (or $4.00 per share of Decibel common stock). In addition, Decibel shareholders received one non-tradeable contingent value right (\"CVR\") per share of Decibel common stock, entitling them to receive up to an additional $3.50 per share in cash upon achievement of certain development milestones for DB-OTO within specified time periods. During 2024, the first and second (final) development milestones contemplated by the CVRs were achieved. As a result, we have paid an aggregate amount of $97.1 million, which was the maximum amount that holders of the CVRs were entitled to receive (including the payment in respect of the second development milestone made in 2025). \n2seventy bio\nIn 2018, we entered into a collaboration agreement with bluebird bio, Inc. (which subsequently spun out 2seventy bio, Inc. in 2021) to research, develop, and commercialize novel cell therapy approaches to address cancer.\nIn April 2024, we acquired full development and commercialization rights to 2seventy bio's oncology and autoimmune preclinical and clinical stage cell therapy pipeline. Under the terms of the agreement, we made a $5.0 million up-front payment, and have assumed ongoing program, infrastructure, and personnel costs related to the product candidates acquired. We are obligated to pay 2seventy bio a regulatory milestone upon the first major market approval of the first approved product; and, with respect to any approved product, a low single-digit percent royalty on sales. In addition, we separately entered into sublease agreements for a portion of 2seventy bio's facilities.\nManufacturing\nWe currently manufacture bulk drug materials and products at our manufacturing facilities in Rensselaer, New York and Limerick, Ireland. These facilities consist of owned and leased manufacturing, office, laboratory, and warehouse space. In addition, we have constructed a fill/finish facility in Rensselaer, New York that is undergoing process validation as required by regulatory authorities.\nWe currently have approximately 100,000 liters of cell culture capacity at our Rensselaer facility and approximately 120,000 liters of cell culture capacity at our Limerick facility. Each of these facilities is approved by the FDA and certain other regulatory agencies to manufacture our bulk drug materials and products. \nCertain bulk drug materials and products are also manufactured by our collaborators, and certain raw materials or products necessary for the manufacture and formulation of our products and product candidates are provided by single-source unaffiliated third-party suppliers. In addition, we rely on our collaborators or third parties to perform packaging, filling, finishing, labeling, distribution, laboratory testing, and other services related to the manufacture of our products and product candidates. See Part I, Item 1A. \"Risk Factors - Risks Related to Manufacturing and Supply\" for further information.\nAmong the conditions for marketing approval of a new drug or biologic product is the requirement that the prospective manufacturer's quality control and manufacturing procedures conform to the good manufacturing practice (\"GMP\") regulations of the health authority. In complying with standards set forth in these regulations, manufacturers must continue to expend time, money, and effort in the areas of production and quality control to ensure full technical compliance. Manufacturing establishments, both foreign and domestic, are also subject to inspections by or under the authority of the FDA and by other national, federal, state, and local agencies. \nCommercial \nOur medicines are marketed through our commercial group, which includes experienced professionals in the fields of marketing, sales, professional education, patient education, reimbursement and market access, trade and distribution, commercial operations, commercial analytics, and market research.\n18\nTable of \nContents\nIn the United States, we sell our marketed products primarily to wholesalers and specialty distributors that serve pharmacies, hospitals, government agencies, physicians, and other healthcare providers. We had sales to two customers (Besse Medical, a subsidiary of Cencora, Inc., and McKesson Corporation) that each accounted for more than 10% of total gross product revenue for the year ended December 31, 2024. On a combined basis, our product sales to these customers accounted for 74% of our total gross product revenue for the year ended December 31, 2024. We promote approved medicines to healthcare professionals via our team of field employees, as well as medical journals, medical exhibitions, distribution of literature and samples, and online channels. In addition, we advertise certain products directly to consumers and maintain websites with information about our medicines. The commercial group also evaluates opportunities for our targets and product candidates and prepares for market launches of new medicines.\nWe have established certain commercial capabilities outside the United States in connection with co-commercializing Dupixent in accordance with our Sanofi collaboration and with obtaining the rights, in 2022, to commercialize Libtayo outside the United States.\nCompetition\nWe face substantial competition from pharmaceutical and biotechnology companies. Our ability to compete depends, to a great extent, on how fast we can develop safe and effective product candidates, complete clinical testing and approval processes, and supply commercial quantities of the product to the market. Competition among products approved for sale is based on efficacy, safety, reliability, ease of administration, dosing frequency, availability, price, patent and other intellectual property position, and other factors.  \nMarketed Products\nThe table below provides an overview of the current competitive landscape for key products marketed by us and/or our collaborators in such products' currently approved indications. The table below is provided for illustrative purposes only and is not exhaustive. For additional information regarding the substantial competition these marketed products face, including potential future competition from product candidates in clinical development, see also Part I, Item 1A. \"Risk Factors - Risks Related to Commercialization of Our Marketed Products, Product Candidates, and New Indications for Our Marketed Products - \nThe commercial success of our products and product candidates is subject to significant competition.\n\"\nMarketed Product\nCompetitor Product\nCompetitor\nIndication\nTerritory\n(a)\nEYLEA HD and EYLEA\n(b)\nPavblu\n® \n(aflibercept-ayyh) (biosimilar referencing EYLEA)\nAmgen Inc.\nwAMD, DME, macular edema following RVO (including CRVO and BRVO), and DR\nUnited States\nVabysmo\n™\n (faricimab-svoa)\nGenentech/Roche\nwAMD, DME, and macular edema following RVO\nUnited States, EU, Japan\nAvastin\n®\n (bevacizumab) (off-label and repackaged)\nGenentech/Roche\nwAMD, DME, and macular edema following RVO\nUnited States, EU, Japan\nLucentis\n® \n(ranibizumab injection)\nNovartis AG and Genentech/Roche\nwAMD, DME, macular edema following RVO (including CRVO and BRVO), DR, mCNV, and ROP\nUnited States, EU, Japan\nByooviz\n™\n (ranibizumab-nuna) (biosimilar referencing Lucentis)\nSamsung Bioepis Co., Ltd. and Biogen Inc.\nwAMD, DME, macular edema following RVO (including CRVO and BRVO), DR, and mCNV\nUnited States, EU\nXimluci\n®\n (ranibizumab) (biosimilar referencing Lucentis)\nXbrane Biopharma AB and STADA Arzneimittel AG\nwAMD, DME, macular edema following RVO (including CRVO and BRVO), DR, and CNV\nEU\n19\nTable of \nContents\nMarketed Product \n(continued)\nCompetitor Product\nCompetitor\nIndication\nTerritory\n(a)\nEYLEA HD and EYLEA \n(continued)\nCimerli\n™\n (ranibizumab-eqrn) (biosimilar referencing Lucentis)\nFormycon AG, Bioeq AG, Sandoz, and Teva Ltd.\nwAMD, DME, macular edema following RVO (including CRVO and BRVO), DR, and mCNV\nUnited States, EU\nSusvimo\n®\n (ranibizumab ocular implant) \nGenentech/Roche\nwAMD, DME\nUnited States\nBeovu\n®\n (brolucizumab) Injection\nNovartis AG\nwAMD, DME\nUnited States, EU, Japan\nOzurdex\n®\n (dexamethasone intravitreal implant) \nAllergan/AbbVie Inc.\nDME, RVO\nUnited States, EU\nIluvien\n®\n (fluocinolone acetonide intravitreal implant)\nAlimera Sciences, Inc.\nDME\nUnited States, EU\nDupixent\nEbglyss\n®\n (lebrikizumab)\nAlmirall S.A., Eli Lilly and Company\nModerate-to-severe atopic dermatitis\nUnited States, EU, Japan\nRinvoq\n®\n (upadacitinib)\nAbbVie\nModerate-to-severe atopic dermatitis\nUnited States, EU, Japan\nNemluvio\n®\n/Mitchga\n® \n(nemolizumab)\nGalderma; Maruho Co., Ltd./Chugai Pharmaceutical Co., Ltd.\nModerate-to-severe atopic dermatitis, pruritus associated with atopic dermatitis, prurigo nodularis\nUnited States, Japan\nAdbry\n™\n/Adtralza\n®\n (tralokinumab)\nLEO Pharma Inc.\nModerate-to-severe atopic dermatitis\nUnited States, EU, Japan\nCibinqo\n®\n (abrocitinib)\nPfizer\nModerate-to-severe atopic dermatitis\nUnited States, EU, Japan\nTezspire\n™\n (tezepelumab-ekko)\nAstraZeneca/Amgen\nAsthma\nUnited States, EU, Japan\nFasenra\n® \n(benralizumab)\nAstraZeneca\nAsthma\nUnited States, EU, Japan\nNucala\n® \n(mepolizumab)\nGlaxoSmithKline (\"GSK\")\nAsthma, nasal polyps\nUnited States, EU, Japan\nXolair\n® \n(omalizumab)\nRoche/Novartis\nAsthma, nasal polyps, CSU\nUnited States, EU, Japan\nLibtayo\nKeytruda\n®\n (pembrolizumab)\nMerck & Co., Inc.\nVarious cancers\nUnited States, EU, Japan\nOpdivo\n®\n (nivolumab)\nBristol-Myers Squibb\nVarious cancers\nUnited States, EU, Japan\nTecentriq\n®\n (atezolizumab)\nRoche\nVarious cancers\nUnited States, EU, Japan\nImfinzi\n®\n (durvalumab)\nAstraZeneca\nVarious cancers\nUnited States, EU, Japan\nBavencio\n®\n (avelumab)\nPfizer/Merck KGaA\nVarious cancers\nUnited States, EU, Japan\nJemperli\n®\n (dostarlimab)\nGSK\nVarious cancers\nUnited States, EU\nUnloxcyt™ (cosibelimab)\nCheckpoint Therapeutics, Inc.\nCSCC\nUnited States\n(a)\n This table focuses on products that have received marketing approval in one or more of the specified indications in the United States, EU, and/or Japan. Certain products listed in this table have also received marketing approval in countries outside the United States, EU, and Japan.\n(b)\n In addition to the products listed in this table, certain other biosimilar products referencing EYLEA have received marketing approval in the United States, EU, and/or Japan but have not yet launched in such jurisdictions. The timing of any launch of these biosimilar products will depend on, among other factors, the outcome of the pending patent litigation proceedings described in Note 16 to our Consolidated Financial Statements and the expiration of the patents protecting EYLEA (including those set forth under \"Patents, Trademarks, and Trade Secrets\" below).\n20\nTable of \nContents\nProduct Candidates\nOur late-stage and earlier-stage clinical candidates (including those being developed in collaboration with our collaborators) face competition from many pharmaceutical and biotechnology companies. For example, we are aware of other pharmaceutical and biotechnology companies actively engaged in the research and development of antibody-based products against targets that are also the targets of our early- and late-stage product candidates. These companies are using various technologies in competition with our \nVelocImmune\n technology and our other antibody generation technologies, including their own antibody generation technologies and other approaches such as RNAi, chimeric antigen receptor T cell (CAR-T cell), and gene therapy technologies. We are also aware of other companies developing or marketing small molecules that may compete with our antibody product candidates in various indications, if such product candidates obtain regulatory approval in those indications.\nFor additional information regarding our product candidates (including those being developed in collaboration with our collaborators) and the substantial competition they face, see also Part I, Item 1A. \"Risk Factors - Risks Related to Commercialization of Our Marketed Products, Product Candidates, and New Indications for Our Marketed Products - \nThe commercial success of our products and product candidates is subject to significant competition\n.\" \nOther Areas\nMany pharmaceutical and biotechnology companies are attempting to discover new therapeutics for indications in which we invest substantial time and resources. In these and related areas, intellectual property rights have been sought and certain rights have been granted to competitors and potential competitors of ours, and we may be at a substantial competitive disadvantage in such areas as a result of, among other things, our inferior intellectual property position or lack of experience, trained personnel, and expertise. A number of corporate and academic competitors are involved in the discovery and development of novel therapeutics that are the focus of other research or development programs we are now conducting. Some of these competitors are currently conducting advanced preclinical and clinical research programs in these areas. These and other competitors also may have established substantial intellectual property and other competitive advantages.\nIf any of these or other competitors announces a successful clinical study involving a product that may be competitive with one of our product candidates or the grant of marketing approval by a regulatory agency for a competitive product, such developments may have an adverse effect on our business, operating results, financial condition, cash flows, or future prospects.\nWe also compete with academic institutions, governmental agencies, and other public or private research organizations, which conduct research, seek patent and other intellectual property protection, and establish collaborative arrangements for the development and marketing of products that would provide royalties or other consideration for use of their technology. These institutions have become more active in seeking patent and other intellectual property protection and licensing arrangements to collect royalties or other consideration for use of the technology they have developed. Products developed in this manner may compete directly with products we develop. We also compete with others in acquiring technology from these institutions, agencies, and organizations.\nPatents, Trademarks, and Trade Secrets\nWe rely on a combination of intellectual property laws, including patent, trademark, copyright, trade secret, and domain name protection laws, as well as confidentiality and license agreements, to protect our intellectual property and proprietary rights.\nOur success depends, in part, on our ability to obtain patents, maintain trade secret protection, and operate without infringing on the proprietary rights of third parties (see Part I, Item 1A. \"Risk Factors - Risks Related to Intellectual Property and Market Exclusivity - \nWe may be restricted in our development, manufacturing, and/or commercialization activities by patents or other proprietary rights of others, and could be subject to awards of damages if we are found to have infringed such patents or rights\n\"; and Note 16 to our Consolidated Financial Statements). Our policy is to file patent applications to protect technology, inventions, and improvements that we consider important to our business and operations. We hold an ownership interest in a number of issued patents in the United States and other countries with respect to our products and technologies. In addition, we hold an ownership interest in thousands of patent applications in the United States and other countries. \nOur patent portfolio includes granted patents and pending patent applications covering our \nVelociSuite\n technologies, including our \nVelocImmune\n mouse platform which produces fully human antibodies. Our remaining issued patents covering these technologies will expire between 2025 and 2032. However, we continue to file patent applications directed to improvements to these technology platforms.\nOur patent portfolio also includes issued patents and pending applications relating to commercialized products and our product candidates in clinical development. These patents cover, among other things, proteins, DNA and RNA molecules, manufacturing patents, method of use patents, and pharmaceutical compositions and formulations. \n21\nTable of \nContents\nThe following table describes our U.S. patents, European patents (\"EP\"), and Japanese patents (\"JP\") that are of particular relevance to key products marketed or otherwise commercialized by us and/or our collaborators. The noted expiration dates include any patent term adjustments, and certain of these patents may also be entitled to term extensions. We continue to pursue additional patents and patent term extensions in the United States and other jurisdictions covering various aspects of our products that may, if issued, extend exclusivity beyond the expiration of the patents listed in the table below. One or more patents with the same or earlier expiry date may fall under the same \"general subject matter class\" for certain products and may not be separately listed. We also own various patents with claims relating to methods of making, formulating, and/or using the active molecules contained within our key products, but that do not cover indications, methods of use or processes currently approved by regulatory agencies or used by us and/or our collaborators. Such patents are not listed in the following table.\nProduct\nMolecule\nTerritory\nPatent No.\nGeneral Subject Matter Class\nExpiration\nEYLEA HD\naflibercept (8 mg)\nUS\n11,066,458\nFormulation\nJune 14, 2027\nUS\n11,084,865\nFormulation\nJune 14, 2027\nUS\n11,103,552\nFormulation\nMay 15, 2039\nUS\n10,828,345\nMethods of Treatment\nJanuary 11, 2032\nUS\n12,168,036\nMethods of Treatment\nMay 15, 2039\nJP\n7,235,770\nFormulation\nMay 10, 2039\nEYLEA\n(a)\naflibercept (2 mg)\nUS\n8,092,803\nFormulation\nJune 21, 2027\nUS\n11,066,458\nFormulation\nJune 14, 2027\nUS\n11,084,865\nFormulation\nJune 14, 2027\nUS\n11,732,024\nFormulation\nJune 14, 2027\nUS\n10,828,345\nMethods of Treatment\nJanuary 11, 2032\nUS\n11,559,564\nMethods of Treatment\nJanuary 11, 2032\nUS\n11,707,506\nMethods of Treatment\nJanuary 11, 2032\nUS\n11,730,794\nMethods of Treatment\nJanuary 11, 2032\nEP\n1183353\nComposition of Matter (Supplementary Protection Certificate)\n(May 23, 2025)\n(b)\n/(November 23, 2025)\n(c)\nEP\n2364691\nFormulation\nJune 14, 2027\nEP\n2944306\nFormulation\nJune 14, 2027\n(b)\nEP\n2944306\nFormulation (Supplementary Protection Certificate)\n(May 25, 2028)\n(b)\nJP\n5,216,002\nFormulation\nFebruary 27, 2028 – October 1, 2029\n(d)\nDupixent\ndupilumab\nUS\n7,608,693\nComposition of Matter\nMarch 28, 2031\n(e)\nUS\n8,735,095\nComposition of Matter\nOctober 2, 2027\nUS\n8,945,559\nFormulation\nOctober 17, 2032\nUS\n9,238,692\nFormulation\nOctober 5, 2031\nUS\n10,435,473\nFormulation\nOctober 5, 2031\nUS\n11,059,896\nFormulation\nOctober 5, 2031\nUS\n11,926,670\nFormulation\nOctober 5, 2031\nUS\n8,075,887\nMethods of Treatment\nApril 17, 2028\nUS\n8,337,839\nMethods of Treatment\nOctober 2, 2027\nUS\n9,290,574\nMethods of Treatment\nJuly 10, 2034\nUS\n9,574,004\nMethods of Treatment\nDecember 22, 2033\nUS\n10,066,017\nMethods of Treatment\nJanuary 21, 2036\nUS\n11,421,036\nMethods of Treatment\nJuly 10, 2034\nUS\n10,137,193\nMethods of Treatment\nMarch 18, 2036\nUS\n10,485,844\nMethods of Treatment\nSeptember 21, 2037\nUS\n10,059,771\nMethods of Treatment\nJune 20, 2034\nUS\n11,214,621\nMethods of Treatment\nJanuary 21, 2036\n22\nTable of \nContents\nProduct \n(continued)\nMolecule\nTerritory\nPatent No.\nGeneral Subject Matter Class\nExpiration\nDupixent \n(continued)\nUS\n11,167,004\nMethods of Treatment\nSeptember 21, 2037\nUS\n11,034,768\nMethods of Treatment\nMarch 28, 2039\nUS\n11,292,847\nMethods of Treatment\nMay 10, 2039\nUS\n11,845,800\nMethods of Treatment\nDecember 22, 2033\nUS\n12,090,201\nMethods of Treatment\nFebruary 3, 2043\nEP\n2356151\nComposition of Matter\nOctober 27, 2029\n(b)\nEP\n2356151\nComposition of Matter (Supplementary Protection Certificate)\n(September 28, 2032)\n(b\n)/(March 28, 2033)\n(c)\nEP\n3715372\nComposition of Matter\nOctober 27, 2029\nEP\n3010539\nMethods of Treatment\nJune 20, 2034\nEP\n2888281\nMethods of Treatment\nAugust 20, 2033\nEP\n3064511\nMethods of Treatment\nOctober 27, 2029\nEP\n3107575\nMethods of Treatment\nFebruary 20, 2035\nEP\n3019191\nMethods of Treatment\nJuly 10, 2034\nEP\n3703818\nMethods of Treatment\nOctober 29, 2038\nEP\n4011915\nMethods of Treatment\nAugust 20, 2033\nEP\n3515465\nMethods of Treatment\nSeptember 21, 2037\nEP\n3889181\nMethods of Treatment\nSeptember 4, 2033\nEP\n3973987\nMethods of Treatment\nFebruary 20, 2035\nEP\n2624865\nFormulation\nOctober 5, 2031\nEP\n3354280\nFormulation\nOctober 5, 2031\nJP\n5,291,802\nComposition of Matter\nOctober 27, 2029 – October 27, 2034\n(d)\nJP\n5,844,772\nComposition of Matter\nOctober 27, 2029 – February 22, 2034\nJP\n5,918,246\nFormulation\nOctober 5, 2031 – September 14, 2035\n(d)\nJP\n6,231,605\nFormulation\nOctober 5, 2031 – March 3, 2034\nJP\n6,306,588\nMethods of Treatment\nAugust 20, 2033 – August 29, 2034\n(d)\nJP\n6,353,838\nMethods of Treatment\nSeptember 4, 2033\nJP\n6,673,840\nMethods of Treatment\nFebruary 20, 2035\nJP\n6,463,351\nMethods of Treatment\nJune 20, 2034 – September 2, 2035\n(d)\nJP\n6,640,977\nMethods of Treatment\nJune 20, 2034 – September 6, 2034\nJP\n6,861,630\nMethods of Treatment\nNovember 13, 2035\nJP\n6,893,265\nMethods of Treatment\nFebruary 20, 2035\nJP\n7,164,530\nMethods of Treatment\nSeptember 21, 2037\nJP\n7,216,122\nMethods of Treatment\nNovember 13, 2035\nJP\n7,216,157\nMethods of Treatment\nAugust 20, 2033\nJP\n7,256,231\nMethods of Treatment\nSeptember 4, 2033\nJP\n7,315,545\nMethods of Treatment\nOctober 29, 2038\nJP\n7,343,547\nMethods of Treatment\nFebruary 20, 2035\nLibtayo\ncemiplimab\nUS\n9,987,500\nComposition of Matter\nSeptember 18, 2035\nUS\n10,737,113\nComposition of Matter\nApril 10, 2035\nUS\n11,603,407\nFormulation\nMarch 21, 2038\n23\nTable of \nContents\nProduct \n(continued)\nMolecule\nTerritory\nPatent No.\nGeneral Subject Matter Class\nExpiration\nLibtayo \n(continued)\nUS\n10,457,725\nMethods of Treatment\nMay 12, 2037\nUS\n11,292,842\nMethods of Treatment\nJuly 18, 2038\nUS\n11,505,600\nMethods of Treatment\nJuly 2, 2038\nUS\n11,926,668\nMethods of Treatment\nFebruary 20, 2038\nEP\n3097119\nComposition of Matter\nJanuary 23, 2035\nEP\n3606504\nFormulation\nMarch 23, 2038\nEP\n3455258\nMethods of Treatment\nMay 12, 2037\nEP\n3932951\nMethods of Treatment\nMay 12, 2037\nJP\n6,425,730\nComposition of Matter\nJanuary 23, 2035 – March 15, 2039\n(d)\nJP\n6,711,883\nComposition of Matter\nJanuary 23, 2035 – August 13, 2037\n(d)\nJP\n7,174,009\nComposition of Matter\nJanuary 23, 2035 – March 9, 2035\n(d)\nJP\n7,229,171\nFormulation\nMarch 23, 2038\nJP\n7,240,512\nMethods of Treatment\nMay 25, 2041\n(a)\n See Note 16 to our Consolidated Financial Statements for information regarding \ninter partes\n review and post-grant review petitions filed in the U.S. Patent and Trademark Office and patent infringement proceedings relating to EYLEA.\n(b)\n Supplementary protection certificates (\"SPCs\") are pending or have been granted in various European countries, extending the original patent terms in those countries, where granted, to the applicable dates indicated in parentheses.\n(c)\n SPC term extensions are pending or have been granted in various European countries based on the completion of a pediatric investigation program, extending the term of the SPC in those countries, where granted, an additional 6 months to the applicable dates indicated in parentheses.\n(d)\n The patent term extension (\"PTE\") system in Japan allows for a patent to be extended more than once provided the later approval is directed to a different indication from that of the previous approval. This may result in multiple PTE approvals for a given patent, each with its own expiration date. In this table, date ranges are shown for the expiration of Japanese patents for which multiple PTEs have been granted, with the later date indicating the latest expiring PTE for the corresponding patent.\n(e)\n \nA patent term extension has been granted by the U.S. Patent and Trademark Office, extending the original patent term (October 2, 2027), insofar as it covers Dupixent, to March 28, 2031.\nIn addition to our patent portfolio, in the United States and certain other countries, our competitive position may be enhanced due to the availability of market exclusivity under relevant law (for additional information regarding market exclusivity, see Part I, Item 1A. \"Risk Factors - Risks Related to Intellectual Property and Market Exclusivity - \nLoss or limitation of patent rights, and regulatory pathways for biosimilar competition, have in the past reduced and could reduce in the future the duration of market exclusivity for our products\n\"). The effect of expiration of a patent relating to a particular product also depends upon other factors, such as the nature of the market and the position of the product in it, the growth of the market, the complexities and economics of the process for manufacture of the active ingredient of the product, and the requirements of new drug provisions of the Federal Food, Drug and Cosmetic Act or similar laws and regulations in other countries.\nWe also are the nonexclusive licensee of a number of additional patents and patent applications. These include a license agreement with Bristol-Myers Squibb, E. R. Squibb & Sons, L.L.C., and Ono Pharmaceutical Co., Ltd. to obtain a license under certain patents owned and/or exclusively licensed by one or more of these parties that includes the right to develop and sell Libtayo. Under the agreement, we paid royalties of 8.0% on worldwide sales of Libtayo through December 31, 2023, and are obligated to pay royalties of 2.5% from January 1, 2024 through December 31, 2026. \nPatent law relating to the patentability and scope of claims in the biotechnology field is evolving and our patent rights are subject to this additional uncertainty. The degree of patent protection that will be afforded to our products in the United States and other important commercial markets is uncertain and is dependent upon the scope of protection decided upon by the patent offices, courts, and governments in these countries. There is no certainty that our existing patents or others, if obtained, will provide us protection from competition or provide commercial benefit. \nOthers may independently develop similar products or processes to those developed by us, duplicate any of our products or processes or, if patents are issued to us, design around any products and processes covered by our patents. We expect to continue, when appropriate, to file product and process applications with respect to our inventions. However, we may not file any such \n24\nTable of \nContents\napplications or, if filed, the patents may not be issued. Patents issued to or licensed by us may be infringed by the products or processes of others.\nWe seek to file and maintain trademarks around the world based on commercial activities in most jurisdictions where we have, or desire to have, a business presence for a particular product or service. Trademark protection varies in accordance with local law, and continues in some countries as long as the trademark is used and in other countries as long as the trademark is registered. Trademark registrations generally are for fixed but renewable terms.\nDefense and enforcement of our intellectual property rights is expensive and time consuming, even if the outcome is favorable to us. It is possible that patents issued or licensed to us will be successfully challenged, that a court may find that we are infringing validly issued patents of third parties, or that we may have to alter or discontinue the development of our products or pay licensing fees to take into account patent rights of third parties (see Part I, Item 1A. \"Risk Factors - Risks Related to Intellectual Property and Market Exclusivity - \nWe may be restricted in our development, manufacturing, and/or commercialization activities by patents or other proprietary rights of others, and could be subject to awards of damages if we are found to have infringed such patents or rights\n\"; and Note 16 to our Consolidated Financial Statements).\nGovernment Regulation\nRegulation by government authorities in the United States and other countries is a significant factor in the research, development, manufacture, and marketing of our products and our product candidates. A summary of the primary areas of government regulation that are relevant to our business is provided below. For a description of material regulatory risks we face, also refer to Part I, Item 1A. \"Risk Factors.\"\nPreclinical Requirements\nThe activities required before a product candidate may be marketed in the United States or elsewhere begin with preclinical tests. Preclinical tests include laboratory evaluations of, among other things, product chemistry and formulation and toxicological and pharmacological studies in animal species to assess the toxicity and dosing of the product candidate. In the United States, certain preclinical trials must comply with the FDA's Good Laboratory Practice requirements (\"GLPs\") and the U.S. Department of Agriculture's Animal Welfare Act. The results of these studies must be submitted to the FDA or the relevant regulatory authority outside the United States as part of an IND or other clinical trial application (as applicable), which must be reviewed by the FDA or the relevant government authority before proposed clinical testing can begin in the applicable country or jurisdiction. In the United States, unless the FDA raises concerns, the IND becomes effective 30 days following its receipt by the FDA, and the clinical trial proposed in the IND may begin. The FDA or other regulatory authorities may ask for additional data in order to begin a clinical trial. Rules that are equivalent in scope but which vary in application apply in other countries.\n25\nTable of \nContents\nProduct Approval\nAll of our product candidates require regulatory approval by relevant government authorities before they can be commercialized. In particular, human therapeutic products are subject to rigorous preclinical and clinical trials and other pre-market approval requirements by the FDA, European Medicines Agency (\"EMA\"), and regulatory authorities of other countries. The structure and substance of the FDA and other countries' pharmaceutical regulatory practices may evolve over time. The ultimate outcome and impact of such developments cannot be predicted.\nClinical trials involve the administration of a drug to healthy human volunteers or to patients under the supervision of a qualified investigator. The conduct of clinical trials is subject to extensive regulation, including compliance with the FDA's bioresearch monitoring regulations and Good Clinical Practice requirements (\"GCPs\"), which establish standards for recruiting for, conducting, recording data from, and reporting the results of, clinical trials, and are intended to assure that the data and reported results are credible, representative, and accurate, and that the rights, safety, and well-being of study participants are protected. Clinical trials must be conducted under protocols that detail the study objectives, parameters for monitoring safety, and the efficacy criteria, if any, to be evaluated. In addition, each clinical trial must be reviewed and approved by, and conducted under the auspices of, an Institutional Review Board (\"IRB\") for each clinical site within the United States or, where applicable, an Ethics Committee and/or the competent authority for clinical sites outside the United States. Companies sponsoring the clinical trials, investigators, and IRBs/Ethics Committees also must comply with, as applicable, regulations and guidelines for obtaining informed consent from the study patients, following the protocol and investigational plan, adequately monitoring the clinical trial, and timely reporting of adverse events. Foreign studies conducted under an IND must meet the same requirements that apply to studies being conducted in the United States. Data from a foreign study not conducted under an IND may be submitted in support of a BLA if the study was conducted in accordance with GCPs and the FDA is able to validate the data. The sponsor of a clinical trial or the sponsor's designated responsible party may be required to register certain information about the trial and disclose certain results on government or independent registry websites, such as clinicaltrials.gov.\nTypically, clinical testing involves a three-phase process, which may overlap or be subdivided in some cases. Phase 1 trials are usually conducted with a small number of healthy volunteers to determine the early safety profile, metabolism, and pharmacological actions of the product candidate, the side effects associated with increasing doses, and, if possible, to gain early evidence of effectiveness. Although Phase 1 trials are typically conducted in healthy human subjects, in some instances, the trial subjects are patients with the targeted disease or condition. Phase 2 clinical trials are conducted with a relatively small sample of the intended patient population to provide enough data to evaluate the preliminary safety, tolerability, and efficacy of different potential doses of the product candidate. Phase 3 clinical trials are larger trials conducted with patients with the target disease or disorder intended to gather additional information about dosage, safety, and effectiveness necessary to evaluate the drug's overall risk-benefit profile. Phase 3 data often form the core basis on which the FDA and comparable foreign regulatory authorities evaluate a product candidate's safety and effectiveness when considering the product application for regulatory approval. If concerns arise about the safety of the product candidate, the FDA or other regulatory authorities can stop clinical trials by placing them on a \"clinical hold\" pending receipt of additional data, which can result in a delay or termination of a clinical development program. The sponsoring company, the FDA or other regulatory authorities, or the IRB or Ethics Committee and competent authority may suspend or terminate a clinical trial at any time on various grounds, including a finding that the patients are being exposed to an unacceptable health risk.\nThe results of the preclinical and clinical testing of a biologic product candidate are then submitted to the FDA in the form of a BLA for evaluation to determine whether the product candidate may be approved for commercial sale under the Public Health Service Act. When a BLA is submitted, the FDA makes an initial determination as to whether the application is sufficiently complete to be accepted for review. If the application is not, the FDA may refuse to accept the BLA for filing and request additional information. A refusal to file, which requires resubmission of the BLA with the requested additional information, delays review of the application. If the application is accepted for review, the FDA reviews the application to determine, among other things, whether a product is safe and effective for its intended use and whether the manufacturing controls are adequate to assure and preserve the product's identity, strength, quality, and purity. \nFDA performance goals generally provide for action on a BLA within 10 months of the 60-day filing date (or within 12 months of the BLA submission). That deadline can be extended by FDA under certain circumstances, including by the FDA's requests for additional information. The targeted action date can be 6 months after the 60-day filing date (or 8 months after BLA submission) for product candidates that are granted priority review designation because they are intended to treat serious or life-threatening conditions and demonstrate the potential to address unmet medical needs. The FDA has other programs to expedite development and review of product candidates that address serious or life-threatening conditions.\nFor some BLAs, the FDA may convene an advisory committee to seek insights and recommendations on issues relevant to approval of the application. Although the FDA is not bound by the recommendation of an advisory committee, the agency considers such recommendations carefully when making decisions. Before approving a new drug or biologic product, the FDA \n26\nTable of \nContents\nalso requires that the facilities at which the product will be manufactured or advanced through the supply chain be in compliance with current Good Manufacturing Practices, or cGMP, requirements and regulations governing, among other things, the manufacture, shipment, and storage of the product. The FDA will typically inspect such facilities for compliance with these requirements and regulations prior to approving a BLA. The FDA also can audit the sponsor of the BLA to determine if the clinical studies were conducted in compliance with current GCPs. After review of a BLA, the FDA may grant marketing approval, request additional information, or issue a CRL outlining the deficiencies in the submission. The CRL may require additional testing or information, including additional preclinical or clinical data, for the FDA to reconsider the application. Even if such additional information and data are submitted, the FDA may decide that the BLA still does not meet the standards for approval. Data from clinical trials are not always conclusive and the FDA may interpret data differently than the sponsor. If FDA grants approval, an approval letter authorizes commercial marketing of the product candidate with specific prescribing information for specific indications.\nAny approval required by the FDA for any of our product candidates may not be obtained on a timely basis, or at all. The designation of a clinical trial as being of a particular phase is not necessarily indicative that such a trial will be sufficient to satisfy the parameters of a particular phase, and a clinical trial may contain elements of more than one phase notwithstanding the designation of the trial as being of a particular phase. The results of preclinical studies or early-stage clinical trials may not predict long-term safety or efficacy of our compounds when they are tested or used more broadly in humans. Additionally, as a condition of approval, the FDA may impose restrictions that could affect the commercial prospects of a product and increase our costs, such as a Risk Evaluation and Mitigation Strategy (\"REMS\") to mitigate certain specific safety risks, and/or post-approval commitments or requirements to conduct additional clinical trials or non-clinical studies or to conduct surveillance programs to monitor the product's effects.\nApproval of a product candidate by comparable regulatory authorities in countries outside the United States is generally required prior to commencement of marketing of the product in those countries. The approval procedure varies among countries and may involve different or additional testing, and the time required to obtain such approval may differ from that required for FDA approval. Approval by a regulatory authority in one jurisdiction does not guarantee approval by comparable regulatory authorities in other jurisdictions. In the European Economic Area (\"EEA\") (which is comprised of 27 Member States of the EU plus Norway, Iceland, and Liechtenstein), medicinal products can only be commercialized after a related Marketing Authorization has been granted. Marketing authorization for biologics must be obtained through a centralized procedure, which allows a company to submit a single application to the EMA. If a related positive opinion is provided by the EMA, the EC will grant a centralized marketing authorization that is valid in the EEA.\nIn many jurisdictions, pediatric data or an approved Pediatric Investigation Plan (\"PIP\"), or a waiver of such studies, is required to have been approved by regulatory authorities prior to submission of a marketing application. In some EU countries, we may also be required to have an approved PIP before we can begin enrolling pediatric patients in a clinical trial. In the United States, under the Pediatric Research Equity Act (\"PREA\"), certain applications for approval must include an assessment, generally based on clinical study data, of the safety and effectiveness of the subject product in relevant pediatric populations, unless a waiver or deferral is granted. However, a pediatric study plan is not required for orphan products and the timing of the submission is subject to negotiation with FDA, but such plan cannot be submitted later than submission of a BLA.\nVarious federal, state, and foreign statutes and regulations also govern or influence the research, manufacture, safety, labeling, storage, record keeping, marketing, transport, and other aspects of developing and commercializing pharmaceutical product candidates. The lengthy process of seeking these approvals and the compliance with applicable statutes and regulations require the expenditure of substantial resources. Any failure by us or our collaborators or licensees to obtain, or any delay in obtaining, regulatory approvals could adversely affect the manufacturing or marketing of our products and our ability to receive product or royalty revenue. \nFor additional information regarding U.S. and foreign regulatory approval processes and requirements, see Part I, Item 1A. \"Risk Factors - Risks Related to Maintaining Approval of Our Marketed Products and the Development and Obtaining Approval of Our Product Candidates and New Indications for Our Marketed Products - \nObtaining and maintaining regulatory approval for drug products is costly, time-consuming, and highly uncertain. If we or our collaborators do not maintain regulatory approval for our marketed products, and obtain regulatory approval for our product candidates or new indications for our marketed products, we will not be able to market or sell them, which would materially and negatively impact our business, prospects, operating results, and financial condition.\n\"\nPost-Approval Regulation\nThe FDA and comparable regulatory authorities in other jurisdictions may also require us to conduct additional clinical trials or to make certain changes related to a product after granting approval of the product. The FDA has the explicit authority to require postmarketing studies (also referred to as post-approval or Phase 4 studies) and labeling changes based on new safety information, and may impose and enforce a REMS at the time of approval or after the product is on the market. Post-approval modifications to \n27\nTable of \nContents\nthe drug, such as changes in indications, labeling, or manufacturing processes or facilities, may require a sponsor to develop additional data or conduct additional preclinical studies or clinical trials, to be submitted in a new or supplemental BLA, which would require FDA approval. \nFollowing approval, the FDA and comparable regulatory authorities outside the United States regulate the marketing and promotion of our products, which must comply with the Food, Drug, and Cosmetic Act and applicable FDA regulations and standards thereunder and equivalent foreign laws. The review of promotional activities by the FDA and comparable regulatory authorities outside the United States includes, but is not limited to, healthcare provider-directed and direct-to-consumer advertising, communications regarding unapproved uses, industry-sponsored scientific and educational activities, promotional activities involving the Internet, and sales representatives' communications. FDA and comparable foreign regulatory authorities' regulations impose restrictions on manufacturers' communications regarding unapproved uses, but under certain conditions manufacturers may engage in non-promotional, balanced, scientific communication regarding such use. Failure to comply with applicable FDA and comparable foreign regulatory authorities' requirements and restrictions in this area may subject a company to adverse publicity and enforcement action by the FDA, the Department of Justice, or the Office of the Inspector General of the Department of Health and Human Services, as well as state authorities and comparable regulatory authorities outside the United States. This could subject a company to a range of penalties that could have a significant commercial impact, including civil and criminal fines and agreements that materially restrict the manner in which a company promotes or distributes a drug. See Part I, Item 1A. \"Risk Factors - Other Regulatory and Litigation Risks - \nOur business activities have been, and may in the future be, challenged under U.S. federal or state and foreign healthcare laws, which may subject us to civil or criminal proceedings, investigations, or penalties\n.\"\nAdverse-event reporting and submission of periodic reports are required following marketing approval. The FDA requires BLA holders to employ a system for obtaining and reviewing safety information, adverse events, and product complaints associated with each drug and to submit safety reports to the FDA, with expedited reporting timelines in certain situations. Based on new safety information after approval, the FDA can, among other things, mandate product labeling changes, require new post-marketing studies, impose or modify a risk evaluation and mitigation strategy for the product, or suspend or withdraw approval of the product. We may be subject to audits by the FDA and other regulatory authorities to ensure that we are complying with the applicable requirements. Rules that are equivalent in scope but which vary in application apply in countries outside the United States in which we conduct clinical trials.\nThe holder of an EU marketing authorization for a medicinal product must also comply with the EU's pharmacovigilance legislation. This includes requirements to conduct pharmacovigilance, or the assessment and monitoring of the safety of medicinal products. Marketing authorization holders are required to maintain a Pharmacovigilance System Master File (\"PSMF\"), which supports and documents the compliance of the marketing authorization holder with the requirements of EU pharmacovigilance legislation. Marketing authorization holders are also required to have a Qualified Person for Pharmacovigilance (\"QPPV\"), who, among other things, maintains the PSMF. A QPPV must reside in the EEA and must also prepare pharmacovigilance reports, respond to potential requests from competent authorities concerning pharmacovigilance on a 24-hour basis, and provide competent authorities with any other information that may be relevant to the safety of the medicinal product in accordance with Good Pharmacovigilance Practices. \nThe EC can also require marketing authorization holders to conduct post-authorization safety and/or efficacy studies. A post-authorization safety study (\"PASS\") is a study that is carried out after a medicinal product has been authorized to obtain further information on a medicinal product's safety, or to measure the effectiveness of risk-management measures. Such studies may be clinical trials or non-interventional studies. A post-authorization efficacy study (\"PAES\") is a study that is carried out for complementing available efficacy data in the light of well-reasoned scientific uncertainties on aspects of the evidence of benefits that is to be or only can be addressed post-authorization. The EC may, in particular, impose a PASS and/or PAES on marketing authorization holders when a marketing authorization is granted upon conditions. The EC may grant conditional marketing authorizations in the interest of public health, when there is less comprehensive clinical data available than would be required, if the EC considers that the benefit of immediate availability may outweigh the risk that the absence of the required clinical data poses.\nIn addition, we and our third-party suppliers are required to maintain compliance with cGMP, and are subject to inspections by the FDA or comparable regulatory authorities in other jurisdictions to confirm such compliance. Changes of suppliers or modifications of methods of manufacturing may require amending our application(s) to the FDA or such comparable foreign regulatory authorities and acceptance of the change by the FDA or such comparable foreign regulatory authorities prior to release of product(s). FDA regulations also require investigation and correction of any deviations from cGMP and impose reporting and documentation requirements upon us and our third-party suppliers. Prescription drug manufacturers in the U.S. must comply with applicable provisions of the Drug Supply Chain Security Act and provide and receive product tracing information, maintain appropriate licenses, ensure they only work with other properly licensed entities, and have procedures in place to identify and \n28\nTable of \nContents\nproperly handle suspect and illegitimate products. We may also be subject to state regulations related to the manufacturing and distribution of our products.\nFailure to comply with these laws, regulations, and conditions of product approval may lead the FDA and comparable regulatory authorities in other jurisdictions to take regulatory action or seek sanctions, including fines, issuance of warning letters, civil penalties, injunctions, suspension of manufacturing operations, operating restrictions, withdrawal of FDA approval of a product, seizure or recall of products, and criminal prosecution.\nPricing and Reimbursement\nSales in the United States of our marketed products are dependent, in large part, on the availability and extent of reimbursement from third-party payors, including private payor healthcare and insurance programs, health maintenance organizations, pharmacy benefit management companies, and government programs such as Medicare and Medicaid. Sales of our marketed products in other countries are dependent, in large part, on coverage and reimbursement mechanisms and programs administered by health authorities in those countries. See Part I, Item 1A. \"Risk Factors - Risks Related to Commercialization of Our Marketed Products, Product Candidates, and New Indications for Our Marketed Products - \nChanges to product reimbursement and coverage policies and practices may materially harm our business, prospects, operating results, and financial condition.\n\"\nWe participate in, and have certain price reporting obligations to, the Medicaid Drug Rebate program, state Medicaid supplemental rebate program(s), and other governmental pricing programs. We also have obligations to report the average sales price for certain drugs to the Medicare program. Under the Medicaid Drug Rebate program, we are required to pay a rebate to each state Medicaid program for our covered outpatient drugs that are dispensed to Medicaid beneficiaries and paid for by a state Medicaid program as a condition of having federal funds being made available for our drugs under Medicaid and Part B of the Medicare program.\nMedicaid is a joint federal and state program that is administered by the states for low-income and disabled beneficiaries. Medicaid rebates are based on pricing data reported by us on a monthly and quarterly basis to the Centers for Medicare & Medicaid Services (\"CMS\"), the federal agency that administers the Medicaid and Medicare programs. These data include the average manufacturer price and, in the case of innovator products, the best price for each drug which, in general, represents the lowest price available from the manufacturer to any entity in the U.S. in any pricing structure, calculated to include all sales and associated rebates, discounts, and other price concessions. The amount of the rebate is adjusted upward if the average manufacturer price increases more than inflation (measured by reference to the Consumer Price Index - Urban). Effective January 1, 2024, the rebate is no longer capped at 100% of the average manufacturer price and, as a result, the rebate liability of manufacturers could increase.\nIf we become aware that our Medicaid reporting for a prior quarter was incorrect, or has changed as a result of recalculation of the pricing data, we are obligated to resubmit the corrected data for up to three years after those data originally were due, which revisions could affect our rebate liability for prior quarters. If we fail to pay the required rebate amount or report pricing data on a timely basis, we may be subject to civil monetary penalties and/or termination of our Medicaid Drug Rebate program agreement, in which case federal payments may not be available under Medicaid or Medicare Part B for our covered outpatient drugs. For additional information regarding risks related to our price reporting and rebate payment obligations, see Part I, Item 1A. \"Risk Factors - Other Regulatory and Litigation Risks - \nIf we fail to comply with our reporting and payment obligations under the Medicaid Drug Rebate program or other governmental pricing programs, we could be subject to additional reimbursement requirements, penalties, sanctions and fines, which could have a material adverse effect on our business, financial condition, results of operations, and future prospects\n.\"\nMedicare is a federal program that is administered by the federal government that covers individuals age 65 and over or that are disabled as well as those with certain health conditions. Medicare Part B generally covers drugs that must be administered by physicians or other healthcare practitioners; are provided in connection with certain durable medical equipment; or are certain oral anti-cancer drugs and certain oral immunosuppressive drugs. Medicare Part B pays for such drugs under a payment methodology based on the average sales price of the drugs. Manufacturers, including us, are required to report average sales price information to CMS on a quarterly basis. The manufacturer-submitted information may be used by CMS to calculate Medicare payment rates. Manufacturers must pay refunds to Medicare for single-source drugs or biological products, or biosimilar biological products, reimbursed under Medicare Part B and packaged in single-dose containers or single-use packages for units of discarded drug reimbursed by Medicare Part B in excess of 10% of total allowed charges under Medicare Part B for that drug. Manufacturers that fail to pay refunds could be subject to civil monetary penalties. Further, the Inflation Reduction Act (\"IRA\") has established a Medicare Part B inflation rebate scheme under which, generally speaking, manufacturers owe rebates if the average sales price of a Part B drug increases faster than the pace of inflation. Failure to timely pay a Part B inflation rebate is subject to a civil monetary penalty. \n29\nTable of \nContents\nThe IRA also created a drug price negotiation program requiring the government to set prices for select high-expenditure drugs covered under Medicare Parts B and D. Starting in 2023 and 2026, the government is authorized to select Part D and Part B drugs, respectively, for inclusion in the drug price negotiation program, with established prices to go into effect for selected Part D drugs in 2026 and for selected Part B drugs in 2028, in each case absent certain disqualifying events. Failure to comply with requirements under the drug price negotiation program is subject to an excise tax and a civil monetary penalty. This or any other legislative change could impact the market conditions for our products. See Part I, Item 1A. \"Risk Factors - Risks Related to Commercialization of Our Marketed Products, Product Candidates, and New Indications for Our Marketed Products - \nChanges to product reimbursement and coverage policies and practices may materially harm our business, prospects, operating results, and financial condition.\n\"\nCivil monetary penalties can be applied if we are found to have knowingly submitted any false pricing or other information to the government, if we are found to have made a misrepresentation in the reporting of our average sales price, or if we fail to submit the required data on a timely basis. Such conduct also could be grounds for CMS to terminate our Medicaid drug rebate agreement, in which case federal payments may not be available under Medicaid or Medicare Part B for our covered outpatient drugs.\nFederal law requires that any company that participates in the Medicaid Drug Rebate program also participate in the Public Health Service's 340B drug pricing program (the \"340B program\") in order for federal funds to be available for the manufacturer's drugs under Medicaid and Medicare Part B. The 340B program, which is administered by the Health Resources and Services Administration (\"HRSA\"), requires participating manufacturers to agree to charge statutorily defined covered entities no more than the 340B \"ceiling price\" for the manufacturer's covered outpatient drugs. Covered entities include hospitals that serve a disproportionate share of financially needy patients, community health clinics, and other entities that receive certain types of grants under the Public Health Service Act. The federal Patient Protection and Affordable Care Act (the \"PPACA\") expanded the list of covered entities to include certain free-standing cancer hospitals, critical access hospitals, rural referral centers, and sole community hospitals, but exempts \"orphan drugs\" from the ceiling price requirements for these covered entities. The 340B ceiling price is calculated using a statutory formula, which is based on the average manufacturer price and Medicaid rebate amount for the covered outpatient drug as calculated under the Medicaid Drug Rebate program. In general, products subject to Medicaid price reporting and rebate liability are also subject to the 340B ceiling price calculation and discount requirement.\nHRSA issued a final regulation regarding the calculation of the 340B ceiling price and the imposition of civil monetary penalties on manufacturers that knowingly and intentionally overcharge covered entities. If we are found to have knowingly and intentionally charged 340B covered entities more than the statutorily mandated ceiling price, we could be subject to significant civil monetary penalties and/or such failure also could be grounds for HRSA to terminate our agreement to participate in the 340B program, in which case our covered outpatient drugs would no longer be eligible for federal payment under Medicaid or Medicare Part B. Moreover, HRSA has established an administrative dispute resolution (\"ADR\") process for claims by covered entities that a manufacturer has engaged in overcharging, and by manufacturers that a covered entity violated the prohibitions against diversion or duplicate discounts. Such claims are to be resolved through an ADR panel of government officials rendering a decision that could be appealed only in federal court. An ADR proceeding could subject us to onerous procedural requirements and could result in additional liability. HRSA has also implemented a price reporting system under which we are required to report our 340B ceiling prices to HRSA on a quarterly basis, which then publishes those prices to 340B covered entities.\nIn order to be eligible to have our products paid for with federal funds under the Medicaid and Medicare Part B programs and purchased by certain federal agencies and grantees, we participate in the U.S. Department of Veterans Affairs (\"VA\") Federal Supply Schedule (\"FSS\") pricing program. FSS participation is required for our products to be purchased by the VA, Department of Defense (\"DoD\"), Coast Guard, and Public Health Service (\"PHS\"). Prices for innovator drugs purchased by the VA, DoD, Coast Guard, and PHS are subject to a cap (known as the \"Federal Ceiling Price\") equal to 76% of the annual non-federal average manufacturer price (\"non-FAMP\") minus, if applicable, an additional discount. The additional discount applies if non-FAMP increases more than inflation (measured by reference to the Consumer Price Index - Urban). We also participate in the Tricare Retail Pharmacy Program, under which we pay quarterly rebates to DoD for prescriptions of our innovator drugs dispensed to Tricare beneficiaries through Tricare Retail network pharmacies. The governing statute provides for civil monetary penalties for failure to provide information timely or for knowing submission of false information to the government.\nMedicare Part D provides coverage to enrolled Medicare patients for self-administered drugs (i.e., drugs that are not administered by a physician). Medicare Part D is administered by private prescription drug plans approved by the U.S. government and, subject to detailed program rules and government oversight, each drug plan establishes its own Medicare Part D formulary for prescription drug coverage and pricing, which the drug plan may modify from time to time. The prescription drug plans negotiate pricing with manufacturers and pharmacies, and may condition formulary placement on the availability of manufacturer discounts. In addition, manufacturers, including us, are required to provide to CMS a 70% discount on brand name prescription drugs utilized by Medicare Part D beneficiaries when those beneficiaries are in the coverage gap phase of the Part D benefit design. The IRA includes a sunset provision with respect to the coverage gap discount program starting in 2025 and replaces it \n30\nTable of \nContents\nwith a new manufacturer discount program. In addition, the IRA has established a Medicare Part D inflation rebate scheme under which, generally speaking, manufacturers will owe additional rebates if the average manufacturer price of a Part D drug increases faster than the pace of inflation. Failure to timely pay a Part D inflation rebate or otherwise comply with obligations under the Medicare Part D inflation rebate scheme is subject to a civil monetary penalty.\nPrivate payor healthcare and insurance providers, health maintenance organizations, and pharmacy benefit managers in the United States are adopting more aggressive utilization management techniques and are increasingly requiring significant discounts and rebates from manufacturers as a condition to including products on formulary with favorable coverage and copayment/coinsurance. These payors may not cover or adequately reimburse for use of our products or may do so at levels that disadvantage them relative to competitive products. \nOutside the United States, within the EU, our products are paid for by a variety of payors, with governments being the primary source of payment. Government health authorities in the EU determine or influence reimbursement of products, and set prices or otherwise regulate pricing. Negotiating prices with governmental authorities can delay commercialization of our products. Governments may use a variety of cost-containment measures to control the cost of products, including price cuts, mandatory rebates, value-based pricing, and reference pricing (i.e., referencing prices in other countries or prices of competitive products and using those reference prices to set a price). Budgetary pressures in many EU countries are continuing to cause governments to consider or implement various cost-containment measures, such as price freezes, increased price cuts and rebates, and expanded generic substitution and patient cost-sharing.\nOther Regulatory Requirements\nWe are subject to healthcare \"fraud and abuse\" laws, such as the federal civil False Claims Act, the anti-kickback provisions of the federal Social Security Act, and other state and federal laws and regulations. Federal and state anti-kickback laws prohibit, among other things, payments or other remuneration to induce or reward someone to purchase, prescribe, endorse, or recommend a product that is reimbursed under federal or state healthcare programs. Federal false claims laws prohibit any person from knowingly presenting, or causing to be presented, a false claim for payment of government funds, or knowingly making, or causing to be made, a false statement to get a false claim paid. See Part I, Item 1A. \"Risk Factors - Other Regulatory and Litigation Risks - \nOur business activities have been, and may in the future be, challenged under U.S. federal or state and foreign healthcare laws, which may subject us to civil or criminal proceedings, investigations, or penalties\n.\"\nWe are subject to the Foreign Corrupt Practices Act, or FCPA, and similar anti-bribery or anti-corruption laws, regulations or rules of other countries in which we operate, including the U.K. Bribery Act. See Part I, Item 1A. \"Risk Factors - Other Regulatory and Litigation Risks - \nRisks from the improper conduct of employees, agents, contractors, or collaborators could adversely affect our reputation and our business, prospects, operating results, and financial condition\n.\"\nWe are subject to privacy and data protection laws in the United States and abroad, including health privacy laws, data breach notification laws, consumer protection laws, data localization laws, biometric privacy laws, and genetic privacy laws. \nIn the United States, there are numerous federal and state laws and regulations governing data privacy of personal data and the collection, use, disclosure, and protection of health data, genetic data, consumer data, and children's data. At the federal level, most U.S. healthcare providers, including research institutions from which we or our collaborators obtain clinical trial data, are subject to privacy and security regulations promulgated under the Health Insurance Portability and Accountability Act of 1996, the Health Information Technology for Economic and Clinical Health Act, and their implementing regulations (collectively, \"HIPAA\"). While Regeneron is not directly subject to HIPAA, other than potentially with respect to providing certain employee benefits, we could be subject to criminal penalties if we, our affiliates, or our agents knowingly receive protected health information in a manner that is not permitted under HIPAA. The Federal Trade Commission (\"FTC\") also sets expectations for taking appropriate steps to safeguard consumers' personal information and for providing a level of privacy or security commensurate to promises made to individuals. Failure to meet these FTC standards may constitute unfair or deceptive acts or practices in violation of Section 5 of the FTC Act. The FTC also has the power to enforce the Health Breach Notification Rule, which imposes notification obligations on companies for breaches of certain health information contained in personal health records. Enforcement by the FTC under the FTC Act and Health Breach Notification Rule can result in civil penalties or enforcement actions. In addition, at the state level, many state consumer privacy laws recently went into effect and many other consumer privacy laws are expected to go into effect in the near future. These laws include certain transparency and other requirements to protect personal data and grant residents with certain rights regarding their personal data. These laws and regulations are constantly evolving and may impose limitations on our business activities.\nOutside the United States, our activities subject us to additional data protection authority oversight and require us to comply with stringent local and regional data privacy laws. Such laws include the EU's General Data Protection Regulations (\"GDPR\"), which has a wide range of compliance obligations relating to the processing and protection of personal data. Violations of the GDPR carry significant financial penalties for noncompliance. The GDPR also confers a private right of action on data subjects and \n31\nTable of \nContents\nconsumer associations to file complaints with data protection authorities, seek judicial remedies, and obtain compensation for damages resulting from violations of the GDPR. Many other jurisdictions outside the United States have adopted and continue to adopt varying privacy and data protection legislation, the continued emergence of which has increased the costs and complexity of compliance. \nIn addition to the foregoing, our present business is, and our future business may be, subject to regulation under the United States Atomic Energy Act, the Clean Air Act, the Clean Water Act, the Comprehensive Environmental Response, Compensation and Liability Act, the National Environmental Policy Act, the Toxic Substances Control Act, the Resource Conservation and Recovery Act, national restrictions, and other current and potential future local, state, federal, and foreign regulations.\nBusiness Segments\nWe manage our business as one segment which includes all activities related to the discovery, development, and commercialization of medicines for serious diseases. For financial information related to our one segment, see our Consolidated Financial Statements and related notes. \nHuman Capital Resources\nWe compete in the highly competitive biotechnology and pharmaceuticals industries. Attracting, developing, and retaining skilled and experienced employees in research and development, manufacturing, sales and marketing, and other positions is crucial to our ability to compete effectively. Our ability to recruit and retain such employees depends on a number of factors, including our corporate culture and work environment, informed by our values and behaviors (which we call \"The Regeneron Way\") and our philosophy of \"Doing Well by Doing Good\"; talent development and career opportunities; and compensation and benefits.\nIntegrity is a core value at Regeneron. Both the Company and each of our employees have a responsibility to act ethically and with integrity at all times. Our Code of Business Conduct and Ethics brings together Regeneron's key policy principles and establishes the Company's expectations for all of our employees to act in accordance with applicable laws, rules, and regulations. \nEmployee Profile\nAs of December 31, 2024, we had 15,106 full-time employees, consisting of 11,914 employed in the United States, 2,168 employed in Ireland, and 1,024 employed in other countries (primarily in the United Kingdom, Japan, and Germany). Of these employees, 2,562 were within our research and preclinical development organization, 2,151 were within our global clinical development and regulatory affairs organization, and 6,846 were within our industrial operations and product supply organization. Company-wide, nearly 1,700 of our full-time employees hold a Ph.D. and/or M.D. We also supplement our workforce with independent contractors, contingent workers, and temporary workers, as needed. None of our employees are represented by a labor union, and our management considers its relations with our employees to be good.\nCulture and Development\nOur employees represent a broad range of backgrounds, just like the people who take our medicines, and bring a wide array of perspectives and experiences that have helped us achieve our leadership position in the biotechnology and pharmaceuticals industries and the global marketplace. Our strategy is rooted in the understanding that a better workplace drives better science and that better science drives a better world. We believe that by fostering an inclusive culture and bringing diverse voices and perspectives to the discourse, we improve our ability to fulfill our mission to repeatedly bring important medicines to patients with serious diseases. We empower employee-led cross-functional resource groups, functional/site-level councils, and other interest groups, who connect around a common passion to build a culture of inclusion and collaboration. In recent years, we have expanded our mentoring program and inclusive leadership workshops for senior leaders and new managers, focusing on our diverse talent base to increase leadership skills, connection, and visibility of underrepresented talent.\nWhile we are proud of our workforce diversity representation shown in the table below, we seek to continuously improve in this area. In early 2021, we launched a global strategy to advance diversity, focused on creating a better workplace, better science, and better world; and implemented a new governance model that includes councils comprised of senior leaders who provide oversight and guidance on our diversity efforts and support the execution of our strategy. In order to better understand our employees' perspectives, we also measure inclusion and belonging as part of our annual employee engagement survey. Our board of directors and/or an appropriate committee thereof receives a detailed update on our efforts at least once a year and continues to monitor our progress.\n32\nTable of \nContents\n2024 Workforce Diversity Representation\n*\nFemale Representation (Global)\n50.0%\nPeople of Color Representation (U.S. Only)\n**\n31.6%\n*\n Based on full-time employees as of December 31, 2024\n**\n Represents the percentage of our full-time employees in the United States that self-identified as belonging to a racial or ethnic minority group. The denominator used in this calculation includes employees who did not disclose information related to their race or ethnicity. Excluding those that did not disclose such information, the percentage shown in this table would be 35.5%.\nExternally, we support diversity efforts in our community, including by supporting young scientific talent in underrepresented communities. For example, as part of our $100 million, 10-year commitment to support the Regeneron Science Talent Search (\"STS\"), we allocate $3.1 million annually to fund the Society for Science’s science, technology, engineering, and math (\"STEM\") outreach and equity programs. We have also been the title sponsor of the Regeneron International Science and Engineering Fair (\"ISEF\") since 2019 and made an additional $34 million, 5-year commitment to this program in 2023. Also in 2023, the Together for CHANGE\nTM\n (\"Changing Healthcare for People of African Ancestry through InterNational Genomics & Equity\") initiative was launched by a coalition of Meharry Medical College, the Regeneron Genetics Center, AstraZeneca, Novo Nordisk, and Roche to improve health outcomes for people of African ancestry and enhance their representation in STEM careers. Among our other efforts, we have developed a STEM pilot program with post-primary-school and high-school students in the New York State Capital Region and Limerick, Ireland that aspires to build long-term relationships with students from disadvantaged socio-economic groups, to encourage and support them in their studies, to inspire them to attend college, and, ultimately, to build a deeper more diverse talent pipeline. We also continue to take steps to further integrate diversity considerations into the design and selection of sites for our clinical studies to make sure they reflect the diversity of patients with the diseases under investigation.\nEmployee Wellness, Health, and Safety\nThe wellbeing of our employees is a primary focus as we believe that the most productive people are those who are at their best, both physically and mentally. We provide several programs related to employee health and wellness, including onsite amenities and programs such as meditation and prayer rooms and fitness centers. We also prioritize mental health initiatives and have taken further action to reduce or remove barriers to quality mental healthcare for our employees and their family members. In addition, we provide support for work-life balance through flex-time, remote working arrangements, child and elder care, and paid parental leave, among others.\nOccupational health and safety is critical to our success. We are committed to meeting or exceeding all environmental, health, safety (\"EHS\") and security regulations and have a range of programs, policies, and procedures to ensure the safety of all people who come to work at Regeneron. In addition, our 2025 global responsibility goals include a commitment to focus on workplace injury prevention in our drive toward zero incidents.\nEmployee Growth and Development\nWe invest significant resources to develop talent with the right capabilities to deliver the growth and innovation needed to support our continued success. Our Talent department is dedicated to promoting individual, leader, team, and organizational development through a number of tools and services. We offer a variety of professional development courses for our employees and support employee continuing education, including through educational reimbursement and tuition forgiveness programs. In addition, we continue to invest in our current and future leaders through a number of leadership development courses and programs and feedback and coaching opportunities. In 2024, nearly 30% of job openings were filled by existing employees who were seeking career development opportunities.\nEmployee Engagement\nWe believe engaging our employees, from their first day and throughout their career, is key to fostering new ideas and driving commitment and productivity. We communicate frequently and transparently with our employees through a variety of communication methods, including video and written communications, company forums and town halls, annual engagement surveys, and pulse surveys.\nWe are also committed to fostering employee volunteerism to reach our 2025 global responsibility goal of driving employee volunteer levels above national standards. Employees are encouraged and empowered to support organizations and causes that are important to them including through, among other things, our matching gift program, volunteer-time-off policy, and our annual company-wide service event, \nDay for Doing Good\n. In 2024, over 7,800 employees volunteered approximately 45,400 hours, \n33\nTable of \nContents\nincluding approximately 49% of our employees who volunteered nearly 27,400 hours to approximately 220 nonprofits during our \nDay for Doing Good\n. Additionally, through our Matching Gift Program, we matched approximately $2.3 million in employee contributions in 2024, supporting over 2,300 charities. In 2024, we were named to the Civic 50 of most community-minded companies in the United States for the eighth consecutive year.\nThe success of our employee engagement efforts is demonstrated by our employee retention rate of 94% in 2024, as well as the fact that 88% of our employees who responded to our annual engagement survey said Regeneron is a great place to work. Additionally, we have placed in the top five for the past 14 years in \nScience\n magazine’s annual \"Top Employers Survey\" of the global biotechnology and pharmaceutical industry.\nCompensation and Benefits\nWe are committed to rewarding and supporting our employees in order to continue to attract and retain top talent. We believe this commitment supports our core strategy of creating and advancing a high-quality product pipeline and delivering medicines to people in need. Employee engagement, commitment, and achievements are key drivers of pipeline success and therefore our long-term performance. The primary underpinning of our pay philosophy is to award stock-based pay to all eligible employees to ensure that when we deliver for patients and for shareholders, everyone shares in the upside growth. Our practice, therefore, has been to award initial stock-based grants to all new hires, in addition to our comprehensive annual stock-based compensation program. Total employee compensation packages (which vary by country and region) include market-competitive pay (with the opportunity to receive above-market rewards), broad-based grants of stock-based awards, comprehensive healthcare benefits, parental leave, child and elder care support, retirement savings options, and matching contributions in connection with employee savings plans. \nCorporate Information\nWe make available free of charge on or through our Internet website (\nhttp://www.regeneron.com\n) our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and, if applicable, amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission (\"SEC\"). \nInvestors and other interested parties should note that we use our media and investor relations website (\nhttp://investor.regeneron.com\n) and our social media channels to publish important information about Regeneron, including information that may be deemed material to investors. We encourage investors and other interested parties to review the information we may publish through our media and investor relations website and the social media channels listed on our media and investor relations website, in addition to our SEC filings, press releases, conference calls, and webcasts.\nThe information contained on our websites and social media channels is not included as a part of, or incorporated by reference into, this report.",
  "item7": "Item 7. Management's Discussion and Analysis of Financial Condition and Results and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and related notes included elsewhere in this report. Refer to Part II, Item 7 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023 (filed with the SEC on February 5, 2024) for additional discussion of our financial condition and results of operations for the year ended December 31, 2022, as well as our financial condition and results of operations for the year ended December 31, 2023 compared to the year ended December 31, 2022.\nOverview\nRegeneron Pharmaceuticals, Inc. is a fully integrated biotechnology company that invents, develops, manufactures, and commercializes medicines for people with serious diseases. Our research and development efforts have led to numerous approved products that have received marketing approval and approximately 40 product candidates in clinical development (including a number of marketed products for which we are investigating additional indications), most of which were homegrown in our laboratories.\nOur ability to generate profits and to generate positive cash flow from operations over the next several years depends significantly on the success in commercializing EYLEA HD, EYLEA, and Dupixent. We expect to continue to incur substantial expenses related to our research and development activities, and our research and development activities and related costs which are not reimbursed by collaborators are expected to expand and require additional resources. We also expect to incur substantial costs related to the commercialization of our marketed products. Our financial results may fluctuate from quarter to quarter and will depend on, among other factors, the net sales of our products; the scope and progress of our research and development efforts; the timing of certain expenses; the continuation of our collaborations, in particular with Sanofi and Bayer, including our share of collaboration profits from sales of commercialized products and the amount of reimbursement of our research and development expenses that we receive from collaborators; and the amount of income tax expense we incur, which is partly dependent on the profits or losses we earn in each of the countries in which we operate. There is uncertainty surrounding whether or when new products or new indications for marketed products will receive regulatory approval or, if any such approval is received, whether we will be able to successfully commercialize such products and whether or when they may become profitable.\n70\nTable of \nContents\nCritical Accounting Estimates\nThe preparation of financial statements in accordance with accounting principles generally accepted in the United States of America (\"GAAP\") requires management to make estimates and assumptions that affect reported amounts and related disclosures in the financial statements. Critical accounting estimates are those estimates made in accordance with GAAP that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our results of operations or financial condition.\nManagement believes the current assumptions used to estimate amounts reflected in our Consolidated Financial Statements are appropriate. However, if actual experience differs from the assumptions used in estimating amounts reflected in our Consolidated Financial Statements, the resulting changes could have a material adverse effect on our results of operations, and, in certain situations, could have a material adverse effect on our liquidity and financial condition. The critical accounting estimates that impact our Consolidated Financial Statements are described below.  \nProduct Revenue\nWe recognize revenue from product sales at a point in time when our customer is deemed to have obtained control of the product, which generally occurs upon receipt or acceptance by our customer. The amount of revenue we recognize from product sales may vary due to rebates, chargebacks, and discounts provided under governmental and other programs, distribution-related fees, and other sales-related deductions. In order to determine the transaction price, we estimate, utilizing the expected value method, the amount of variable consideration to which we will be entitled. This estimate is based upon contracts with customers, healthcare providers, payors and government agencies, statutorily-defined discounts applicable to government-funded programs, historical experience, estimated payor mix, and other relevant factors. Calculating these provisions involves estimates and judgments. We review our estimates of rebates, chargebacks, and other applicable provisions each period and record any necessary adjustments in the current period's net product sales. Refer to the \"Results of Operations - Revenues - Net Product Sales\" section below for further details regarding our provisions, and credits/payments, for sales-related deductions.\nCollaborative Arrangements \nWe have entered into various collaborative arrangements to research, develop, manufacture, and commercialize products and/or product candidates. Our collaboration agreements may require us to deliver various rights, services, and/or goods across the entire life cycle of a product or product candidate. In agreements involving multiple goods or services promised to be transferred to our collaborator, we assess, at the inception of the contract, whether each promise represents a separate obligation (i.e., is \"distinct\"), or whether such promises should be combined as a single unit of account. When we have a combined unit of account which includes a license and providing research and development services to our collaborator, recognition of up-front payments and development milestones earned from our collaborator is deferred (as a liability) and recognized over the development period (i.e., over time) typically using an input method on the basis of our research and development costs incurred relative to the total expected cost which determines the extent of our progress toward completion. We review our estimates each period and make revisions to such estimates as necessary. Due to the variability in the scope of activities and length of time necessary to develop a drug product, potential delays in development programs, changes to development plans and budgets as programs progress, including if we and our collaborators decide to expand or contract our clinical plans for a drug candidate in various disease indications, and uncertainty in the ultimate requirements to obtain governmental approval for commercialization, revisions to our estimates are likely to occur periodically, potentially resulting in material changes to amounts recognized. \nIf our collaborator performs research and development work or commercialization-related activities and the parties share the related costs, we also recognize, as expense (e.g., research and development expense or selling, general and administrative expense, as applicable) in the period when our collaborator incurs such expenses, the portion of the collaborator's expenses that we are obligated to reimburse. Our collaborators provide us with estimated expenses for the most recent fiscal quarter. The estimates are revised, if necessary, in subsequent periods if actual expenses differ from those estimates.\nUnder certain of the Company's collaboration agreements, product sales and cost of sales may be recorded by the Company's collaborators as they are deemed to be the principal in the transaction. In arrangements where we:\n•\nsupply commercial product to our collaborator, we may be reimbursed for our manufacturing costs as commercial product is shipped to the collaborator (however, recognition of such cost reimbursements may be deferred until the product is sold by our collaborator to third-party customers); \n•\nshare in any profits or losses arising from the commercialization of such products, we record our share of the variable consideration, representing net product sales less cost of goods sold and shared commercialization and other expenses, in the period in which such underlying sales occur and costs are incurred by the collaborator; \n•\nreceive royalties and/or sales-based milestone payments from our collaborator, we recognize such amounts in the period earned.\n71\nTable of \nContents\nOur collaborators provide us with estimates of product sales and our share of profits or losses, as applicable, for each quarter. The estimates are revised, if necessary, in subsequent periods if our actual share of profits or losses differ from those estimates.  \nStock-based Compensation\nWe recognize stock-based compensation expense for equity grants under our long-term incentive plans to employees and non-employee members of our board of directors (as applicable) based on the grant-date fair value of those awards. The grant-date fair value of an award is generally recognized as compensation expense over the award's requisite service period. Stock-based compensation expense also includes an estimate, which is made at the time of grant, of the number of awards that are expected to be forfeited. The forfeiture rate estimate is calculated by considering both historical forfeiture experience and an estimate of expected future forfeitures for currently outstanding unvested awards.\n \nThis estimate is reviewed at least annually and revised, if necessary, in subsequent periods if actual forfeitures differ from those estimates. The assumptions used in computing the fair value of equity awards reflect our best estimates but involve uncertainties related to market and other conditions, many of which are outside our control. Changes in any of these assumptions may materially affect the fair value of awards granted and the amount of stock-based compensation recognized in future periods. \nWe use the Black-Scholes model to compute the estimated fair value of stock option awards. Using this model, fair value is calculated based on assumptions with respect to (i) expected volatility of our Common Stock price, (ii) the periods of time over which employees and members of our board of directors are expected to hold their options prior to exercise (expected lives), (iii) expected dividend yield on our Common Stock, and (iv) risk-free interest rates, which are based on quoted U.S. Treasury rates for securities with maturities approximating the options' expected lives. Expected volatility is estimated based on actual movements in our stock price over the most recent historical periods equivalent to the options' expected lives. Expected lives are principally based on our historical exercise experience with previously issued employee and board of director option grants. \nWe use a Monte Carlo simulation to compute the estimated fair value of performance-based restricted stock units that are subject to vesting based on the Company's attainment of pre-established criteria that include a market condition. \nFor performance-based restricted stock units that contain a performance condition, we recognize stock-based compensation expense if and when we determine that it is probable the performance condition will be achieved (based on the number of shares expected to be vested and issued). We reassess the probability of achievement at each reporting period and adjust compensation cost, as necessary. If there are any changes in our probability assessment, we recognize a cumulative catch-up adjustment in the period of the change in estimate, with the remaining unrecognized expense recognized prospectively over the remaining requisite service period. If we subsequently determine that the performance criteria are not met or are not expected to be met, any amounts previously recognized as compensation expense are reversed in the period when such determination is made.\nSee Note 13 to our Consolidated Financial Statements for stock-based compensation expense and related assumptions used in determining the fair value of our awards.\nIncome Taxes\nWe recognize deferred tax assets and liabilities for the expected future tax consequences of events that have been included in the financial statements or tax returns, including deferred tax assets and liabilities for expected amounts of global intangible low-taxed income (\"GILTI\") inclusions. Deferred tax assets and liabilities are determined as the difference between the tax basis of assets and liabilities and their respective financial reporting amounts (\"temporary differences\") at enacted tax rates in effect for the years in which the differences are expected to reverse. A valuation allowance is established for deferred tax assets for which it is more likely than not that some portion or all of the deferred tax assets will not be realized. We periodically re-assess the need for a valuation allowance against our deferred tax assets based on all available evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies, results of recent operations, and our historical earnings experience by taxing jurisdiction. Significant judgment is required in making this assessment. \nWe recognize the financial statement effects of a tax position when our assessment is that there is more than a 50% probability that the position will be sustained upon examination by a taxing authority based upon its technical merits. Uncertain tax positions are recorded based upon certain recognition and measurement criteria. Significant judgment is required in making this assessment, and, therefore, we re-evaluate uncertain tax positions and consider various factors, including, but not limited to, changes in tax law, the measurement of tax positions taken or expected to be taken in tax returns, the effective settlement of matters subject to audit, information obtained during in-process audit activities, and changes in facts or circumstances related to a tax position. We adjust the amount of the liability to reflect any subsequent changes in the relevant facts and circumstances surrounding the uncertain tax positions. \n72\nTable of \nContents\nInventories\nWe capitalize inventory costs associated with our products prior to regulatory approval when, based on management's judgment, future commercialization is considered probable and future economic benefit is expected to be realized; otherwise, such costs are expensed. The determination to capitalize inventory costs is based on various factors, including status and expectations of the regulatory approval process, any known safety or efficacy concerns, potential labeling restrictions, and any other impediments to obtaining regulatory approval. \nWe periodically analyze our inventory levels to identify inventory that may expire prior to expected sale or has a cost basis in excess of its estimated realizable value. In addition, our products are subject to strict quality control and monitoring which we perform throughout the manufacturing process. If certain batches or units of product no longer meet quality specifications or become obsolete due to expiration, we record a charge to write down such inventory to its estimated realizable value. \nAcquisitions\nWe make certain judgments to determine whether a transaction should be accounted for as a business combination or as an asset acquisition. \nIn a business combination, the acquisition method of accounting generally requires that the assets acquired and liabilities assumed be recorded as of the date of the acquisition at their respective fair values. There can be significant judgment involved in determining the estimated fair values of such assets and liabilities. Amounts allocated to acquired in-process research and development are capitalized as indefinite-lived intangible assets. Any excess of the purchase price (consideration transferred) over the fair values of net assets acquired is recorded as goodwill. Contingent consideration obligations are recorded at fair value as of the acquisition date and remeasured each subsequent reporting period until the contingencies have been resolved. The fair value of contingent consideration liabilities is determined using inputs that may include the probability of achieving certain milestones and estimated discount rates.\nIf it is determined that the assets acquired do not meet the definition of a business, or if substantially all of the fair value of the assets acquired are concentrated in a single identifiable asset, then the transaction is accounted for as an asset acquisition rather than a business combination. In an asset acquisition, assets acquired are recorded at cost, goodwill is not recorded, and acquired in-process research and development with no alternative future use is charged to expense.\nIntangible Assets\nIntangible assets acquired in a business combination are recorded at fair value, while intangible assets acquired in connection with an asset acquisition are recorded at cost. \nPayments to acquire intangible assets in an asset acquisition may include up-front payments and contingent consideration. With regard to contingent consideration in an asset acquisition, the Company recognizes regulatory milestones upon achievement, royalties in the period in which the underlying sales occur, and sales-based milestones when the milestone is deemed probable by the Company of being achieved. If contingent consideration is recognized subsequent to the acquisition date in an asset acquisition, the amount of such consideration is recorded as an addition to the cost basis of the intangible asset with a cumulative catch-up adjustment for amortization expense as if the additional amount of consideration had been accrued from the outset of the acquisition.\nIndefinite-lived intangible assets are subject to impairment testing until completion or abandonment of the associated research and development efforts. Definite-lived intangible assets are amortized over the estimated useful lives of the assets based on the pattern in which the economic benefits of the intangible assets are consumed; if that pattern cannot be reliably determined, a straight-line basis is used.\nIntangible assets are reviewed for recoverability whenever events or changes in circumstances (e.g., changes in economic, regulatory, or legal conditions) indicate that the carrying amount of the asset may not be recoverable. If an indicator of impairment exists, we compare the projected undiscounted cash flows to be generated by the asset to the intangible asset's carrying amount. If the projected undiscounted cash flows of the intangible asset are less than the carrying amount, the intangible asset is written down to its fair value in the period in which the impairment occurs.\nContingencies\nWe accrue, based on management's judgment, for an estimated loss when the potential loss from claims or legal proceedings is considered probable and the amount can be reasonably estimated. As additional information becomes available, or, based on specific events such as the outcome of litigation or settlement of claims, we reassess the potential liability related to pending claims and litigation, and may change our estimates. \n73\nTable of \nContents\nResults of Operations\n \nNet Income\nYear Ended December 31,\n(In millions, except per share data)\n2024\n2023\n2022\nRevenues\n$\n14,202.0 \n$\n13,117.2 \n$\n12,172.9 \nOperating expenses\n10,211.3 \n9,070.1 \n7,434.0 \nIncome from operations\n3,990.7 \n4,047.1 \n4,738.9 \nOther income (expense)\n789.2 \n152.2 \n119.9 \nIncome before income taxes\n4,779.9 \n4,199.3 \n4,858.8 \nIncome tax expense\n367.3 \n245.7 \n520.4 \nNet income\n$\n4,412.6 \n$\n3,953.6 \n$\n4,338.4 \nNet income per share - diluted\n$\n38.34 \n$\n34.77 \n$\n38.22 \nRevenues\nYear Ended December 31,\n$ Change\n(In millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet product sales:\nEYLEA HD - U.S.\n$\n1,201.1 \n$\n165.8 \n$\n— \n$\n1,035.3 \n$\n165.8 \nEYLEA - U.S.\n4,767.1 \n5,719.6 \n6,264.6 \n(952.5)\n(545.0)\nTotal EYLEA HD and EYLEA - U.S.\n5,968.2 \n5,885.4 \n6,264.6 \n82.8 \n(379.2)\nLibtayo - U.S.\n787.3 \n538.8 \n374.5 \n248.5 \n164.3 \nLibtayo - ROW\n(a)\n429.5 \n324.3 \n73.0 \n105.2 \n251.3 \nTotal Libtayo - Global\n1,216.8 \n863.1 \n447.5 \n353.7 \n415.6 \nPraluent - U.S.\n241.7 \n182.4 \n130.0 \n59.3 \n52.4 \nEvkeeza - U.S.\n125.7 \n77.3 \n48.6 \n48.4 \n28.7 \nInmazeb - U.S.\n76.8 \n69.8 \n3.0 \n7.0 \n66.8 \nTotal net product sales\n$\n7,629.2 \n$\n7,078.0 \n$\n6,893.7 \n$\n551.2 \n$\n184.3 \nCollaboration revenue:\nSanofi\n$\n4,531.4 \n$\n3,799.5 \n$\n2,855.7 \n$\n731.9 \n$\n943.8 \nBayer\n1,499.0 \n1,487.5 \n1,430.7 \n11.5 \n56.8 \nRoche\n1.4 \n211.0 \n627.3 \n(209.6)\n(416.3)\nOther\n26.0 \n5.1 \n0.4 \n20.9 \n4.7 \nOther revenue\n515.0 \n536.1 \n365.1 \n(21.1)\n171.0 \nTotal revenues\n$\n14,202.0 \n$\n13,117.2 \n$\n12,172.9 \n$\n1,084.8 \n$\n944.3 \n(a)\n Effective July 1, 2022, we obtained the exclusive right to develop, commercialize, and manufacture Libtayo worldwide under an Amended and Restated Immuno-oncology License and Collaboration Agreement with Sanofi (\"A&R IO LCA\") and, as a result, we began recording net product sales of Libtayo outside the United States as of such date.\nNet Product Sales\nTotal EYLEA HD and EYLEA net product sales in the U.S. increased in 2024 compared to 2023. EYLEA HD was approved by the FDA in August 2023 and net product sales in 2024 were driven by the transition of patients from other anti-VEGF products, including EYLEA, as well as new patients naïve to anti-VEGF therapy. Net product sales of EYLEA HD and EYLEA in 2024 were adversely impacted by a lower net selling price compared to 2023. \n74\nTable of \nContents\nTotal EYLEA HD and EYLEA net product sales for the fourth quarter of 2024 were favorably impacted by approximately $85 million as a result of higher wholesaler inventory levels for EYLEA, partially offset by lower wholesaler inventory levels for EYLEA HD, at the end of the fourth quarter of 2024 compared to the end of the third quarter of 2024.\nRevenue from product sales is recorded net of applicable provisions for rebates, chargebacks, and discounts; distribution-related fees; and other sales-related deductions. The following table summarizes the provisions, and credits/payments, for sales-related deductions:\n(In millions)\nRebates, Chargebacks,\nand Discounts\nDistribution-\nRelated Fees\nOther Sales-\nRelated Deductions\nTotal\nBalance as of December 31, 2021\n$\n214.6 \n$\n80.0 \n$\n67.6 \n$\n362.2 \nProvisions\n1,537.3 \n431.1 \n141.1 \n2,109.5 \nCredits/payments\n(1,398.0)\n(399.7)\n(127.2)\n(1,924.9)\nBalance as of December 31, 2022\n353.9 \n111.4 \n81.5 \n546.8 \nProvisions\n2,074.5 \n439.2 \n155.3 \n2,669.0 \nCredits/payments\n(1,972.7)\n(388.3)\n(157.5)\n(2,518.5)\nBalance as of December 31, 2023\n455.7 \n162.3 \n79.3 \n697.3 \nProvisions\n2,447.3 \n462.7 \n143.0 \n3,053.0 \nCredits/payments\n(2,363.9)\n(497.2)\n(128.8)\n(2,989.9)\nBalance as of December 31, 2024\n$\n539.1 \n$\n127.8 \n$\n93.5 \n$\n760.4 \nSanofi Collaboration Revenue\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nAntibody:\n \nRegeneron's share of profits\n$\n3,923.5 \n$\n3,136.5 \n$\n2,082.0 \nSales-based milestones earned\n— \n50.0 \n100.0 \nReimbursement for manufacturing of commercial supplies\n(a)\n607.9 \n613.0 \n633.7 \nOther\n— \n— \n28.7 \nTotal Antibody\n4,531.4 \n3,799.5 \n2,844.4 \nTotal Immuno-oncology\n(b)\n— \n— \n11.3 \nTotal Sanofi collaboration revenue\n$\n4,531.4 \n$\n3,799.5 \n$\n2,855.7 \n(a)\n Corresponding costs incurred by the Company in connection with such manufacturing is recorded within Cost of collaboration and contract manufacturing.\n(b)\n As the A&R IO LCA became effective July 1, 2022, the six months ended June 30, 2022 was the last period in which Sanofi collaboration revenue was recognized in connection with the Immuno-oncology collaboration.\nAntibody\nGlobal net product sales of Dupixent and Kevzara are recorded by Sanofi, and we and Sanofi share profits on such sales.\n75\nTable of \nContents\nRegeneron's share of profits in connection with the commercialization of Dupixent and Kevzara is summarized below:\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nDupixent and Kevzara net product sales\n$\n14,606.7 \n$\n11,974.0 \n$\n9,039.2 \nRegeneron's share of collaboration profits in connection with commercialization of antibodies\n4,527.2 \n3,596.3 \n2,405.5 \nReimbursement of development expenses incurred by Sanofi in accordance with Regeneron's payment obligation\n(a)\n(603.7)\n(459.8)\n(266.6)\nOne-time payment in connection with amendment to the Antibody License and Collaboration Agreement\n— \n—\n(56.9)\nRegeneron's share of profits\n$\n3,923.5 \n$\n3,136.5 \n$\n2,082.0 \nRegeneron's share of profits as a percentage of Dupixent and Kevzara net product sales\n27%\n26%\n23%\n(a) \nSee \"Liquidity and Capital Resources - Additional Funding Requirements\" below for additional details on our contingent reimbursement obligation.\nThe increase in our share of profits during the year ended December 31, 2024, compared to 2023, was driven by higher profits associated with Dupixent sales.\nDuring the year ended December 31, 2023, we earned the final $50.0 million sales-based milestone from Sanofi upon aggregate annual sales of antibodies outside the United States exceeding $3.0 billion on a rolling twelve-month basis.\nBayer Collaboration Revenue\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nRegeneron's share of profits\n$\n1,403.3 \n$\n1,376.4 \n$\n1,317.4 \nReimbursement for manufacturing of ex-U.S. commercial supplies\n(a)\n95.7 \n111.1 \n91.4 \nOne-time payment in connection with change in Japan arrangement\n(b)\n— \n— \n21.9 \nTotal Bayer collaboration revenue\n$\n1,499.0 \n$\n1,487.5 \n$\n1,430.7 \n(a)\n Corresponding costs incurred by the Company in connection with such manufacturing is recorded within Cost of collaboration and contract manufacturing.\n(b)\n Effective January 1, 2022, the Company and Bayer commenced sharing equally in profits based on sales from Bayer to its distributor in Japan. Previously, the Company received from Bayer a tiered percentage of sales based on sales by Bayer's distributor in Japan.\nBayer records net product sales of EYLEA 8 mg and EYLEA outside the United States. Regeneron's share of profits in connection with commercialization of EYLEA 8 mg and EYLEA outside the United States is summarized below: \nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nEYLEA 8 mg and EYLEA net product sales outside the United States \n$\n3,576.8 \n$\n3,495.2 \n$\n3,382.8 \nRegeneron's share of collaboration profit from sales outside the United States\n$\n1,469.7 \n$\n1,436.1 \n$\n1,375.1 \nReimbursement of development expenses incurred by Bayer in accordance with Regeneron's payment obligation\n(a)\n \n(66.4)\n(59.7)\n(57.7)\nRegeneron's share of profits\n$\n1,403.3 \n$\n1,376.4 \n$\n1,317.4 \nRegeneron's share of profits as a percentage of EYLEA 8 mg and EYLEA net product sales outside the United States\n39%\n39%\n39%\n(a)\n See \"Liquidity and Capital Resources - Additional Funding Requirements\" below for additional details on our contingent reimbursement obligation.\n76\nTable of \nContents\nRoche Collaboration Revenue\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nRegeneron's share of profits\n$\n1.4 \n$\n224.3 \n$\n627.3 \nOther\n— \n(13.3)\n— \nTotal Roche collaboration revenue \n$\n1.4 \n$\n211.0 \n$\n627.3 \nRoche distributes and records net product sales of Ronapreve outside the United States, and the parties share gross profits from sales based on a pre-specified formula. Net product sales of Ronapreve outside the United States declined as a result of new variants of the SARS-CoV-2 virus emerging that are not susceptible to the treatment.\nOther Revenue \nOther revenue in 2024 and 2023 included $328.6 million and $247.6 million, respectively, of royalties and share of profits earned in connection with license agreements.\nOperating Expenses\nYear Ended December 31,\nChange\n(In millions, except headcount data)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nResearch and development\n(a)\n$\n5,132.0 \n$\n4,439.0 \n$\n3,592.5 \n$\n693.0 \n$\n846.5 \nAcquired in-process research and development\n101.0 \n186.1 \n255.1 \n(85.1)\n(69.0)\nSelling, general, and administrative\n(a)\n2,954.4 \n2,631.3 \n2,115.9 \n323.1 \n515.4 \nCost of goods sold\n1,087.3 \n932.1 \n800.0 \n155.2 \n132.1 \nCost of collaboration and contract manufacturing\n(b)\n883.2 \n883.7 \n760.4 \n(0.5)\n123.3 \nOther operating expense (income), net\n53.4 \n(2.1)\n(89.9)\n55.5 \n87.8 \nTotal operating expenses\n$\n10,211.3 \n$\n9,070.1 \n$\n7,434.0 \n$\n1,141.2 \n$\n1,636.1 \nAverage headcount\n14,383 \n12,698 \n11,115 \n1,685 \n1,583 \n(a)\n Includes costs incurred net of any cost reimbursements from collaborators\n(b)\n Includes costs incurred in connection with manufacturing drug supplies for collaborators and others\nOperating expenses in 2024 and 2023 included a total of $982.8 million and $885.0 million, respectively, of stock-based compensation expense related to equity awards granted under our long-term incentive plans. As of December 31, 2024, unrecognized stock-based compensation expense related to unvested stock options and unvested restricted stock (including performance-based restricted stock units) was $626.7 million and $1.271 billion, respectively. We expect to recognize this stock-based compensation expense related to stock options and restricted stock over a weighted-average period of 1.9 years.\n77\nTable of \nContents\nResearch and Development Expenses\nThe following table summarizes our direct research and development expenses by clinical development program and other significant categories of research and development expenses. Direct research and development expenses are comprised primarily of costs paid to third parties for clinical and product development activities, including costs related to preclinical research activities, clinical trials, and the portion of research and development expenses incurred by our collaborators that we are obligated to reimburse. Indirect research and development expenses have not been allocated directly to each program, and primarily consist of costs to compensate personnel, overhead and infrastructure costs to maintain our facilities, and other costs related to activities that benefit multiple projects. Clinical manufacturing costs primarily consist of costs to manufacture bulk drug product for clinical development purposes as well as related drug filling, packaging, and labeling costs. Clinical manufacturing costs also include pre-launch commercial supplies which did not meet the criteria to be capitalized as inventory (see \"Critical Accounting Estimates - Inventories\" above). The table below also includes reimbursements of research and development expenses by collaborators, as when we are entitled to reimbursement of all or a portion of such expenses that we incur under a collaboration, we record those reimbursable amounts in the period in which such costs are incurred.\nYear Ended December 31,\n$ Change\n(In millions)\n2024\n2023\n*\n2022\n*\n2024 vs. 2023\n2023 vs. 2022\nDirect research and development expenses:\nFianlimab\n$\n215.5 \n$\n112.2 \n$\n43.4 \n$\n103.3 \n$\n68.8 \nLinvoseltamab\n141.9 \n78.7 \n45.5 \n63.2 \n33.2 \nOrdspono (odronextamab)\n129.4 \n96.3 \n66.0 \n33.1 \n30.3 \nDupixent (dupilumab)\n128.8 \n168.0 \n156.5 \n(39.2)\n11.5 \nEYLEA HD (aflibercept) 8 mg\n98.3 \n96.2 \n67.9 \n2.1 \n28.3 \nItepekimab\n96.2 \n70.3 \n26.5 \n25.9 \n43.8 \nPozelimab\n79.4 \n60.2 \n72.4 \n19.2 \n(12.2)\nLibtayo (cemiplimab)\n79.1 \n105.3 \n138.0 \n(26.2)\n(32.7)\nOther product candidates in clinical development and other research programs\n620.2 \n508.4 \n426.7 \n111.8 \n81.7 \nTotal direct research and development expenses\n1,588.8 \n1,295.6 \n1,042.9 \n293.2 \n252.7 \nIndirect research and development expenses:\nPayroll and benefits\n1,681.7 \n1,537.0 \n1,195.5 \n144.7 \n341.5 \nLab supplies and other research and development costs\n241.5 \n210.6 \n181.0 \n30.9 \n29.6 \nOccupancy and other operating costs\n614.9 \n518.2 \n508.5 \n96.7 \n9.7 \nTotal indirect research and development expenses\n2,538.1 \n2,265.8 \n1,885.0 \n272.3 \n380.8 \nClinical manufacturing costs\n1,195.9 \n1,053.9 \n938.3 \n142.0 \n115.6 \nReimbursement of research and development expenses by collaborators\n(190.8)\n(176.3)\n(273.7)\n(14.5)\n97.4 \nTotal research and development expenses\n$\n5,132.0 \n$\n4,439.0 \n$\n3,592.5 \n$\n693.0 \n$\n846.5 \n*\n Certain prior year amounts have been reclassified to conform to the current year's presentation.\n \n78\nTable of \nContents\nResearch and development expenses included stock-based compensation expense of $543.8 million and $488.7 million in 2024 and 2023, respectively. \nThere are numerous uncertainties associated with drug development, including uncertainties related to safety and efficacy data from each phase of drug development, uncertainties related to the enrollment and performance of clinical trials, changes in regulatory requirements, changes in the competitive landscape affecting a product candidate, and other risks and uncertainties described in Part I, Item 1A. \"Risk Factors.\" There is also variability in the duration and costs necessary to develop a product candidate, potential opportunities and/or uncertainties related to future indications to be studied, and the estimated cost and scope of the projects. The lengthy process of seeking FDA and other applicable approvals, and subsequent compliance with applicable statutes and regulations, require the expenditure of substantial resources. Any failure by us to obtain, or delay in obtaining, regulatory approvals could materially adversely affect our business. We are unable to reasonably estimate if our product candidates in clinical development will generate material product revenues and net cash inflows.\nAcquired In-process Research and Development (\"IPR&D\") Expenses\nAcquired IPR&D expense in 2024 included a $45.0 million development milestone in connection with our collaboration agreement with Sonoma Biotherapeutics, Inc. \nAcquired IPR&D expense in 2023 included a $100.0 million development milestone in connection with our collaboration agreement with Alnylam Pharmaceuticals, Inc., a $45.0 million up-front payment in connection with our collaboration agreement with Sonoma, and a $30.0 million charge to extend the period for selecting targets under our collaboration agreement with Intellia Therapeutics, Inc.\nSelling, General, and Administrative Expenses\nSelling, general, and administrative expenses increased in 2024, compared to 2023, due to higher commercialization-related expenses to support our launch of EYLEA HD and higher headcount and headcount-related costs partly related to our international commercial expansion. Selling, general, and administrative expenses also included stock-based compensation expense of $355.0 million and $307.1 million in 2024 and 2023, respectively.\nCost of Goods Sold \nCost of goods sold increased in 2024, compared to 2023, primarily due to higher start-up costs for our Rensselaer, New York fill/finish facility.\nOther Operating Expense (Income)\nOther operating expense (income), net, in 2024 reflected a charge of $53.4 million related to the increase in the estimated fair value of the contingent consideration liability recognized in connection with our 2023 acquisition of Decibel Therapeutics, Inc.\n79\nTable of \nContents\nOther Income (Expense)\nOther income (expense) consists of the following:\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nUnrealized gains (losses) on equity securities, net\n$\n117.7 \n$\n(237.8)\n$\n(39.8)\nInterest income\n711.4 \n495.9 \n160.1 \nForeign currency (losses) gains, net\n(0.5)\n(12.9)\n50.2 \nOther\n15.8 \n(20.0)\n8.8 \nOther income (expense), net\n844.4 \n225.2 \n179.3 \nInterest expense\n(55.2)\n(73.0)\n(59.4)\nTotal other income (expense)\n$\n789.2 \n$\n152.2 \n$\n119.9 \nIncome Taxes\nYear Ended December 31,\n(In millions, except effective tax rate)\n2024\n2023\n2022\nIncome tax expense\n$\n367.3\n$\n245.7 \n$\n520.4\nEffective tax rate\n7.7%\n5.9%\n10.7%\nOur effective tax rate for 2024 and 2023 was positively impacted, compared to the U.S. federal statutory rate, primarily by stock-based compensation, income earned in foreign jurisdictions with tax rates lower than the U.S. federal statutory rate, and federal tax credits for research activities.\nCertain countries in which we have operations, including Ireland, have adopted legislation influenced by the Organization for Economic Co-operation and Development (\"OECD\") Global Anti-Base Erosion Model Rules (\"Pillar Two\") framework, including a minimum tax rate of 15%. The adoption of the Pillar Two framework did not have a material impact on our effective tax rate for the year ended December 31, 2024. It is uncertain whether the United States will enact legislation to adopt the Pillar Two framework. We continue to evaluate additional guidance released by the OECD, along with the pending legislative adoption by additional countries.\n80\nTable of \nContents\nLiquidity and Capital Resources\nOur financial condition is summarized as follows:\nAs of December 31,\n(In millions)\n2024\n2023\n$ Change\nFinancial assets:\nCash and cash equivalents\n$\n2,488.2 \n$\n2,730.0 \n$\n(241.8)\nMarketable securities - current \n6,524.3 \n8,114.8 \n(1,590.5)\nMarketable securities - noncurrent\n8,900.1 \n5,396.5 \n3,503.6 \n$\n17,912.6 \n$\n16,241.3 \n$\n1,671.3 \nWorking capital:\nCurrent assets\n$\n18,660.9 \n$\n19,479.2 \n$\n(818.3)\nCurrent liabilities\n3,944.3 \n3,423.4 \n520.9 \n$\n14,716.6 \n$\n16,055.8 \n$\n(1,339.2)\nBorrowings and finance lease liabilities:\nLong-term debt\n$\n1,984.4 \n$\n1,982.9 \n$\n1.5 \nFinance lease liabilities\n$\n720.0 \n$\n720.0 \n$\n— \nAs of December 31, 2024, we also had borrowing availability of $750.0 million under a revolving credit facility (see further description under \"\nCredit Facility\n\" below).\nSources and Uses of Cash for the Years Ended December 31, 2024, 2023, and 2022 \nYear Ended December 31,\n$ Change\n(In millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nCash flows provided by operating activities\n$\n4,420.5 \n$\n4,594.0 \n$\n5,014.9 \n$\n(173.5)\n$\n(420.9)\nCash flows used in investing activities\n$\n(2,468.1)\n$\n(3,185.1)\n$\n(3,784.6)\n$\n717.0 \n$\n599.5 \nCash flows used in financing activities\n$\n(2,200.5)\n$\n(1,790.1)\n$\n(1,009.0)\n$\n(410.4)\n$\n(781.1)\nCash Flows from Investing Activities\nCapital expenditures in 2024 included costs incurred in connection with the expansion of our research, preclinical manufacturing, and support facilities at our Tarrytown, New York corporate headquarters, as well as costs associated with the expansion of our manufacturing facilities in Rensselaer, New York (including the fill/finish facility). In addition, in September 2024, we acquired an approximate 1,000,000 square foot facility in Saratoga Springs, New York. We expect to incur capital expenditures of $850 million to $975 million in 2025, including in connection with the continued expansion of our facilities in Tarrytown, New York. We expect continued significant capital expenditures over the next several years related to this expansion.\nPayments for the Libtayo intangible asset of $125.7 million, $207.8 million, and $1.027 billion in 2024, 2023, and 2022, respectively, related to our acquisition (including contingent consideration paid) of the exclusive right to develop, commercialize, and manufacture Libtayo worldwide. \nAcquisitions, net of cash acquired, of $54.9 million and $230.3 million in 2023 and 2022 was related to our acquisitions of Decibel Therapeutics, Inc. and Checkmate Pharmaceuticals, Inc., respectively.\nCash Flows from Financing Activities\nProceeds from issuances of Common Stock, in connection with exercises of employee stock options, were $1.465 billion during 2024, compared to $1.146 billion during 2023 and $1.520 billion during 2022. In addition, payments in connection with Common Stock tendered for employee tax obligations were $1.029 billion during 2024, compared to $700.6 million during 2023 and $445.7 million during 2022. For information related to repurchases of Common Stock, see \"\nShare Repurchase Programs\n\" section below.\n81\nTable of \nContents\nCredit Facility\nThe Company is party to an agreement with a syndicate of lenders (the \"Credit Agreement\") which provides for a $750.0 million senior unsecured five-year revolving credit facility (the \"Credit Facility\"). The Credit Agreement includes an option for the Company to elect to increase the commitments under the Credit Facility and/or to enter into one or more tranches of term loans in the aggregate principal amount of up to $500.0 million, subject to the consent of the lenders providing the additional commitments or term loans, as applicable, and certain other conditions. The Credit Agreement also provides a $50.0 million sublimit for letters of credit. \nAs set forth in the Credit Agreement, we have the option to amend the Credit Agreement to establish environmental, social, and governance targets which will be used to adjust pricing under the Credit Facility, subject to parameters to be provided in the Credit Agreement.\nProceeds of the loans under the Credit Facility may be used to finance working capital needs, and for general corporate or other lawful purposes, of Regeneron and its subsidiaries. Regeneron Pharmaceuticals, Inc. has guaranteed all obligations under the Credit Facility. The Credit Agreement includes an option for us to elect to extend the maturity date of the Credit Facility beyond December 2027, subject to the consent of the extending lenders and certain other conditions. Amounts borrowed under the Credit Facility may be prepaid, and the commitments under the Credit Facility may be terminated, at any time without premium or penalty. \nWe had no borrowings outstanding under the Credit Facility as of December 31, 2024. \nThe Credit Agreement contains operating covenants and a maximum total leverage ratio financial covenant. We were in compliance with all covenants of the Credit Agreement as of December 31, 2024.\nShare Repurchase Programs\nIn November 2021, our board of directors authorized a share repurchase program to repurchase up to $3.0 billion of our Common Stock. As of June 30, 2023, the Company had repurchased the entire $3.0 billion of its Common Stock it was authorized to repurchase under the program.\nIn January 2023, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. As of September 30, 2024, the Company had repurchased the entire $3.0 billion of its Common Stock it was authorized to repurchase under the program.\nIn April 2024, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. The share repurchase program permits the Company to make repurchases through a variety of methods, including open-market transactions (including pursuant to a trading plan adopted in accordance with Rule 10b5-1 of the Exchange Act), privately negotiated transactions, accelerated share repurchases, block trades, and other transactions in compliance with Rule 10b-18 of the Exchange Act. Repurchases may be made from time to time at management's discretion, and the timing and amount of any such repurchases will be determined based on share price, market conditions, legal requirements, and other relevant factors. The program has no time limit and can be discontinued at any time. There can be no assurance as to the timing or number of shares of any repurchases in the future. \nThe table below summarizes the shares of our Common Stock that we repurchased and the cost of such shares, which were recorded as Treasury Stock.\nYear Ended December 31,\n(In millions)\n2024\n2023\n2022\nNumber of shares \n2.8 \n2.9 \n3.3 \nTotal cost of shares \n$\n2,613.9 \n$\n2,214.6 \n$\n2,099.8 \nAs of December 31, 2024, $1.917 billion remained available for share repurchases under the April 2024 program.\nIn February 2025, our board of directors authorized a share repurchase program to repurchase up to an additional $3.0 billion of our Common Stock. The share repurchase program was approved under terms substantially similar to the repurchase programs described above.\n82\nTable of \nContents\nDividend \nIn February 2025, our board of directors declared our first quarterly cash dividend, in the amount of $0.88 per share on our Common Stock and Class A Stock. The cash dividend will be payable on March 20, 2025 to shareholders of record as of February 20, 2025.\nWe currently intend to continue to pay a quarterly cash dividend on our outstanding Common Stock and Class A Stock. Amounts and timing of any future cash dividends are subject to authorization by our board of directors in its sole discretion, after taking into consideration our financial condition and other relevant factors described under \"\nThere can be no assurance that we will continue to repurchase shares of our Common Stock or continue to declare cash dividends\n\" in Part I, Item 1A. \"Risk Factors.\" \nTarrytown, New York Corporate Headquarters Lease\nWe lease laboratory and office facilities for our corporate headquarters in Tarrytown, New York (the \"Facility\") under the Third Amended and Restated Lease and Remedies Agreement (the \"Lease\") with BA Leasing BSC, LLC, an affiliate of Banc of America Leasing & Capital, LLC (\"BAL\"), as lessor, and the Third Amended and Restated Participation Agreement (the \"Participation Agreement\") with Bank of America, N.A., as administrative agent, and a syndicate of lenders (collectively with BAL, the \"Participants\"), as rent assignees. The Lease, Participation Agreement, and certain related agreements provide for $720.0 million of lease financing (previously advanced by the Participants in March 2017 in connection with the acquisition by BAL of the Facility and our lease of the Facility from BAL), which matures when the term of the Lease expires in March 2027, at which time all amounts outstanding thereunder will become payable in full. We have the option to further extend the maturity date of the Participation Agreement and the term of the Lease for an additional five-year period, subject to the consent of the Participants and certain other conditions. We also have the option to (a) purchase the Facility by paying an amount equal to the outstanding principal amount of the Participants' advances under the Participation Agreement, all accrued and unpaid yield thereon, and all other outstanding amounts under the Participation Agreement, Lease, and certain related documents or (b) sell the Facility to a third party on behalf of BAL.\nPursuant to the Lease, we pay all maintenance, insurance, taxes, and other costs arising out of the use of the Facility. We are also required to make monthly payments of basic rent to satisfy the yield payable to the Participants on their outstanding advances under the Participation Agreement. Such advances accrue yield at a variable rate per annum based on the one-month forward-looking Secured Overnight Financing Rate (\"SOFR\") term rate, plus a spread adjustment, plus an applicable margin that varies with our debt rating and total leverage ratio.\nThe Lease is classified as a finance lease as we have the option to purchase the Facility under terms that make it reasonably certain to be exercised. The agreements governing the Lease financing contain financial and operating covenants. Such financial covenants and certain of the operating covenants are substantially similar to the covenants set forth in our Credit Agreement. We were in compliance with all such covenants as of December 31, 2024.\nAdditional Funding Requirements\nThe amount required to fund operations will depend on various factors, including the potential regulatory approval and commercialization of our product candidates and the timing thereof and the extent and cost of our research and development programs. We believe that our existing capital resources, borrowing availability under the Credit Facility, funds generated by anticipated product sales, and funding for reimbursement of research and development costs that we are entitled to receive under our collaboration agreements, will enable us to meet our anticipated operating needs for the foreseeable future.\nWe expect to continue to incur significant costs in connection with our research and development activities (including preclinical and clinical programs). The amount of funding that will be required for our clinical programs depends upon the results of our research and preclinical programs and early-stage clinical trials, regulatory requirements, the duration and results of clinical trials underway and of additional clinical trials that we decide to initiate, and the various factors that affect the cost of each trial, including the size of trials, fees charged for services provided by clinical trial investigators and other third parties, the costs for manufacturing the product candidate for use in the trials, and other expenses. \nWe also anticipate continuing to incur substantial commercialization costs for our marketed products. Commercialization costs over the next few years will depend on, among other things, the market potential for product candidates, whether commercialization costs are shared with a collaborator, and regulatory approval of additional product candidates.\nWe expect that expenses related to the filing, prosecution, defense, and enforcement of patents and other intellectual property will be substantial. \nLiabilities for unrecognized tax benefits totaled $1.314 billion as of December 31, 2024. Due to their nature, there is a high degree of uncertainty regarding the period and amounts of potential future cash settlement with tax authorities. We expect the IRS to \n83\nTable of \nContents\nconclude its examination of our 2017 and 2018 federal income tax returns within the next twelve months, and, as a result, we may be required to make a payment of approximately $120 million. See Note 15 to our Consolidated Financial Statements.\nWe enter into collaboration and licensing agreements that may require us to pay (i) amounts contingent upon the occurrence of various future events (e.g., upon the achievement of various development and commercial milestones), which, in the aggregate, could be significant, and/or (ii) royalties calculated based on a percentage of net product sales. The specific timing of these contingent payments cannot be predicted. See Note 3 to our Consolidated Financial Statements.\nAs described in Part I, Item 1. \"Collaboration, License, and Other Agreements,\" under our collaborations with Sanofi and Bayer, we and our collaborator share profits in connection with commercialization of drug products. If the applicable collaboration is profitable, we have contingent contractual obligations to reimburse Sanofi and Bayer for a defined percentage (generally 50%) of agreed-upon development expenses funded by Sanofi and Bayer (i.e., \"development balance\"). These reimbursements are deducted each quarter, in accordance with a formula, from our share of the collaboration profits otherwise payable to us, unless, in the case of Bayer, we elect to reimburse these expenses at a faster rate. As of December 31, 2024, our contingent reimbursement obligation to Sanofi in connection with the companies' Antibody Collaboration was approximately $1.635 billion and our contingent reimbursement obligation to Bayer was approximately $315 million. Therefore, we continue to expect that a portion of our share of profits from sales under our collaborations with Sanofi and Bayer will be used to reimburse our collaborators for these obligations.\nFuture Impact of Recently Issued Accounting Standards\nSee Note 1 to our Consolidated Financial Statements for a description of recently issued accounting standards.",
  "item2": null
}