{
  "source_file": "rf-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINTRODUCTION\nThe following discussion and analysis is part of Regions Financial Corporation’s (“Regions” or the “Company”) Quarterly Report on Form 10-Q filed with the SEC and should be read in conjunction with the consolidated financial statements and the related notes that appear in Part I, Item 1 of this report. In addition, this discussion and analysis updates Regions’ Annual Report on Form 10-K for the year ended December 31, 2024, which was previously filed with the SEC. This financial information is presented to aid in understanding Regions’ financial position and results of operations and should be read together with the financial information contained in  Regions’ Annual Report on Form 10-K. See Note 1 \"Basis of Presentation\" and Note 13 \"Recent Accounting Pronouncements\" to those consolidated financial statements for further detail. The emphasis of this discussion will be on the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 for the consolidated statements of income. For the consolidated balance sheets, the emphasis of this discussion will be on the balances as of September 30, 2025 compared to December 31, 2024.\nThis discussion and analysis contains statements that may be considered “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. See pages 6 through 8 for additional information regarding forward-looking statements.\nCORPORATE PROFILE\nRegions is a financial holding company headquartered in Birmingham, Alabama operating in the South, Midwest and Texas. In addition, Regions operates several offices delivering specialty capabilities in New York, Washington D.C., Chicago, Salt Lake City, and other locations nationwide. Regions provides financial solutions for a wide range of clients including retail and mortgage banking services, commercial banking services and wealth and investment services. Further, Regions and its subsidiaries deliver other specialty capabilities including merger and acquisition advisory services, capital markets solutions, home improvement lending, investment advisory services, equipment financing for commercial clients and small business customers, low income housing tax credit corporate fund syndication and asset management, financing to CRA-qualified customers, investment and insurance products, broker-dealer services to commercial clients, and others.\nRegions conducts its banking operations through Regions Bank, an Alabama state-chartered commercial bank that is a member of the Federal Reserve System. At September 30, 2025, Regions operated 1,248 total branch outlets. Regions carries out its strategies and derives its profitability from three reportable business segments: Corporate Bank, Consumer Bank, and Wealth Management, with the remainder in Other. See Note 11 \"Business Segment Information\" to the consolidated financial statements for more information regarding Regions’ segment reporting structure. \nRegions’ business strategy is focused on providing a competitive mix of products and services, delivering quality customer service, and continuing to develop and optimize distribution channels that include a branch distribution network with offices in convenient locations, as well as electronic and mobile banking.\nRegions’ profitability, like that of many other financial institutions, is dependent on its ability to generate revenue from net interest income as well as non-interest income sources. Net interest income is primarily the difference between the interest income Regions receives on interest-earning assets, such as loans, leases, investment securities and cash balances held at the Federal Reserve Bank, and the interest expense Regions pays on interest-bearing liabilities, principally deposits and borrowings. Regions’ net interest income is impacted by the size and mix of its balance sheet components and the interest rate spread between interest earned on its assets and interest paid on its liabilities. Non-interest income includes fees from service charges on deposit accounts, card and ATM fees, mortgage servicing and secondary marketing, investment management and trust activities, capital markets and other customer services which Regions provides. Results of operations are also affected by the provision for credit losses and non-interest expenses such as salaries and employee benefits, equipment and software expenses, occupancy, professional, legal and regulatory expenses, FDIC insurance assessments, and other operating expenses, as well as income taxes.\nEconomic conditions, competition, new legislation and related rules impacting regulation of the financial services industry and the monetary and fiscal policies of the Federal government significantly affect most, if not all, financial institutions, including Regions. Lending and deposit activities and fee income generation are influenced by levels of business spending and investment, consumer income, consumer spending and savings, capital market activities, and competition among financial institutions, as well as customer preferences, interest rate conditions, inflation and prevailing market rates on competing products in Regions’ market areas.\nTHIRD QUARTER OVERVIEW\nEconomic Environment in Regions' Banking Markets\n \nRegions utilized its internal September baseline forecast to calculate the ACL as of September 30, 2025. Refer to the Baseline economic forecast discussion in the \"Allowance\" section for further detail. \n51\nTable of Contents\n \nThird Quarter Results\nRegions reported net income available to common shareholders of $548 million or $0.61 per diluted share in the third quarter of 2025 compared to net income available to common shareholders of $446 million or $0.49 per diluted share in the third quarter of 2024. \nNet interest income (taxable-equivalent basis) totaled $1.3 billion in the third quarter of 2025, which increased $39 million compared to the third quarter of 2024. The net interest margin (taxable-equivalent basis) was 3.59 percent in the third quarter of 2025, reflecting a 5 basis point increase from the same period in 2024. The increases in net interest income and margin were driven by the replacement of fixed-rate loans and debt securities in a higher interest rate environment, lower funding costs and hedge performance improvements as short-term interest rates declined. Refer to the related discussion below Table 17 \"Consolidated Average Daily Balances and Yield/Rate Analysis\" for further detail.\nThe provision for credit losses totaled $105 million in the third quarter of 2025 compared to $113 million in the third quarter of 2024. Net charge-offs totaled $135 million, or 0.55 percent of average loans, in the third quarter of 2025, compared to $117 million, or 0.48 percent in the third quarter of 2024. This increase reflected charge-offs that were already reserved for related to previously identified portfolios of interest. The allowance as a percent of total loans, net, decreased slightly to 1.78 percent at September 30, 2025, compared to 1.79 percent at December 31, 2024. Refer to the \"Allowance for Credit Losses\" section for further detail. \nNon-interest income was $659 million in the third quarter of 2025 compared to $572 million in the third quarter of 2024 primarily driven by a decline in securities losses associated with less repositioning activity in the third quarter of 2025 compared to 2024. Additionally, most categories of non-interest income increased, including capital markets income, other miscellaneous income, investment management and trust fee income, and investment services income. See Table 22 \"Non-Interest Income\" for further details. \nNon-interest expense was $1.1 billion in the third quarter of 2025 which increased $34 million compared to the third quarter of 2024. The increase was primarily driven by an increase in salaries and benefits, professional, legal and regulatory expenses, and other miscellaneous expenses. These were partially offset by a decline in Visa class B shares expense. See Table 23 \"Non-Interest Expense\" for further details.\nRegions' effective tax rate was 19.7 percent in the third quarter of 2025 compared to 19.4 percent in the third quarter of 2024. See the \"Income Taxes\" section for further details.\nCapital\nRegions and Regions Bank are required to comply with regulatory capital requirements established by Federal and State banking agencies, which include quantitative requirements including the CET1 ratio. At September 30, 2025, Regions’ CET1 ratio was estimated to be 10.9 percent. For additional information on Regions' regulatory capital requirements see the \"Regulatory Requirements\" section.\nRegions participates in supervisory stress testing conducted by the Federal Reserve and its SCB is currently floored at 2.5 percent. See Note 6 \"Shareholders' Equity and Accumulated Other Comprehensive Income (Loss)\" to the consolidated financial statements for further details.\nThe Board has authorized the repurchase of up to $2.5 billion of the Company's common stock through the fourth quarter of 2025. See Note 6 \"Shareholders' Equity and Accumulated Other Comprehensive Income (Loss)\" for more information.\nBALANCE SHEET ANALYSIS\nThe following sections provide expanded discussion of significant changes in certain line items in asset, liability, and shareholders' equity categories. \nCASH AND CASH EQUIVALENTS\nCash and cash equivalents increased approximately $1.4 billion from December 31, 2024 to September 30, 2025 primarily due to an increase in deposits and, to a lesser degree, a decrease in loans. These changes were partially offset by securities purchases, a decline in borrowings and the redemption of Series D preferred stock. See the \"Debt Securities\", \"Loans\" \"Deposits\", \"Borrowings\", and \"Liquidity\" sections for more information.\n52\nTable of Contents\n \nDEBT SECURITIES\n The following table details the carrying values of debt securities, including both held to maturity and available for sale:\nTable 1—Debt Securities \nSeptember 30, 2025\nDecember 31, 2024\n \n(In millions)\nU.S. Treasury securities\n$\n2,266 \n$\n2,003 \nFederal agency securities\n610 \n444 \nObligations of states and political subdivisions\n2 \n2 \nMortgage-backed securities:\nResidential agency\n24,079 \n22,865 \nCommercial agency\n5,151 \n4,597 \nCommercial non-agency\n83 \n82 \nCorporate and other debt securities\n464 \n658 \n$\n32,655 \n$\n30,651 \nDebt securities, which comprise approximately 23 percent of earning assets, are an important tool used to manage interest rate sensitivity and provide a primary source of liquidity for the Company, as much of the portfolio is highly liquid. Additionally, some of the debt securities portfolio is eligible to be used as collateral for funding of various types of borrowings. See the \"Liquidity\" section for more information on these arrangements.  Also see the \"Market Risk-Interest Rate Risk\" section for more information. See also Note 3 \"Debt Securities\" for additional information.\nDebt securities held to maturity constituted approximately 18 percent of the debt securities portfolio at September 30, 2025. In the first half of 2025, the Company reclassified debt securities with an amortized cost, excluding items recognized in OCI, of $2.0 billion from available for sale into held to maturity to reduce the volatility in AOCI in preparation for expected, upcoming changes to regulatory guidance as discussed in the \"Regulatory Requirements\" section. \nDebt securities available for sale constituted approximately 82 percent of the debt securities portfolio at September 30, 2025. Regions maintains a highly-rated debt securities portfolio consisting primarily of agency MBS. Regions’ investment policy emphasizes credit quality and liquidity. \nDebt securities increased $2.0 billion from December 31, 2024 to September 30, 2025 due to the purchase of approximately $1.0 billion of residential agency MBS debt securities in the second quarter of 2025, lower market interest rates and tighter spreads resulting in lower unrealized holding losses, and AOCI amortization. Of note, the Company executed debt securities repositionings in the first and third quarters of 2025 involving the sale of shorter-duration commercial and residential agency MBS and replacement with residential agency MBS with favorable prepayment profiles. In total, the Company sold approximately $1.0 billion of debt securities available for sale and realized approximately $50 million in pre-tax losses. The intent was to maintain the debt securities portfolio duration that would otherwise shorten naturally while efficiently deploying capital. Proceeds from the sales were reinvested at higher market yields. \nThe average life of the debt securities portfolio at September 30, 2025 was estimated to be 5.9 years, with a duration of approximately 4.0 years, inclusive of fair value hedges (see Table 19). These metrics compare with an estimated average life of 6.1 years and a duration of approximately 4.5 years for the portfolio at December 31, 2024.\nLOANS HELD FOR SALE\nThe following table presents Regions’ loans held for sale by type:\nTable 2—Loans Held for Sale \nSeptember 30, 2025\nDecember 31, 2024\n(In millions)\nCommercial\n$\n304 \n$\n372 \nResidential first mortgage\n253 \n222 \nConsumer and other performing\n4 \n— \nNon-performing\n12 \n— \n$\n573 \n$\n594 \nCommercial loans held for sale include commercial mortgage loans originated for sale to third parties and commercial loans originally recorded as held for investment when management has the intent to sell. Levels of commercial loans held for sale fluctuate based on timing of sale to third parties. The levels of residential first mortgage loans held for sale that are part of the Company's mortgage originations fluctuate depending on the timing of origination and sale to third parties. \n53\nTable of Contents\n \nLOANS\nGENERAL\nLoans, net of unearned income, represented 69 percent of interest-earning assets as of September 30, 2025. The following table presents the distribution of Regions' loan portfolio by segment and class, net of unearned income:\nTable 3—Loan Portfolio \nSeptember 30, 2025\nDecember 31, 2024\n \n(In millions, net of unearned income)\nCommercial and industrial\n$\n49,234 \n$\n49,671 \nCommercial real estate mortgage—owner-occupied\n4,835 \n4,841 \nCommercial real estate construction—owner-occupied\n285 \n333 \nTotal commercial\n54,354 \n54,845 \nCommercial investor real estate mortgage\n7,122 \n6,567 \nCommercial investor real estate construction\n1,948 \n2,143 \nTotal investor real estate\n9,070 \n8,710 \nResidential first mortgage\n19,881 \n20,094 \nHome equity lines\n3,209 \n3,150 \nHome equity loans\n2,340 \n2,390 \nConsumer credit card\n1,437 \n1,445 \nOther consumer\n(1)\n5,834 \n6,093 \nTotal consumer\n32,701 \n33,172 \n$\n96,125 \n$\n96,727 \n_____\n(1)  Starting in 2025, other consumer loans also includes exit portfolios, which were previously presented separately. The portfolio consists primarily of indirect auto loans, and presentation of prior periods has been conformed accordingly.\nPORTFOLIO CHARACTERISTICS\n Loans, net of unearned income, decreased $602 million from year-end 2024 due to a decline in commercial loans and declines across most consumer loans as discussed below. These declines were partially offset by an increase in investor real estate loans. Regions manages loan growth with a focus on risk management and risk-adjusted return on capital. \nThe following sections describe the composition of the portfolio segments and classes disclosed in Table 3, explain changes in balances from year-end 2024 and highlight the related risk characteristics. Regions believes that its loan portfolio is well diversified by product, client, and geography throughout its footprint. However, the loan portfolio may be exposed to certain concentrations of credit risk which exist in relation to individual borrowers or groups of borrowers, certain types of collateral, certain types of industries, and certain loan products. See Note 4 \"Loans and the Allowance for Credit Losses\" to the consolidated financial statements for additional discussion. \nCommercial\nOver half of the Company’s total loans are included in the commercial portfolio segment. These balances are spread across numerous industries, as noted in Table 4. The Company manages the related risks to this portfolio by setting certain lending limits for each significant industry. \nThe commercial portfolio segment includes commercial and industrial loans for use in customers' normal business operations to finance working capital needs, equipment purchases, expansion projects and acquisitions. Regions' commercial and industrial loans generally mature within a five-year period with applicable amortization based on the underlying collateral or financing purpose. Typical loan structures consist of revolving and non-revolving lines of credit, amortizing term loans, guidance facilities, and single-pay loans, further tailored to meet the specific needs of the customer. These loans frequently have a covenant package combination inclusive of applicable debt service coverage, leverage, and liquidity measurements.\nUnderwriting of commercial and industrial loans includes the assessment of the financial performance and profile, management experience and capability, industry position and outlook, the applicability of the transactional structure, as well as the repayment enhancement provided by collateral, guarantees, and ownership or sponsorship. Any forward view of operating performance is tested against applicable stressors that may include revenue decline, margin compression, and interest rate hikes. \nCommercial and industrial loans decreased $437 million since year-end 2024 due to loans refinanced off the Company's balance sheet through the debt capital markets and loan utilization rates remaining below historic levels. In the nine months ended September 30, 2025, the decline in commercial and industrial loans was broad-based as shown in Table 4.\nThe commercial portfolio also includes owner-occupied commercial real estate mortgage loans to operating businesses, which are loans for long-term financing on real estate assets, and are repaid by cash generated by business operations. Owner-occupied commercial real estate construction loans are made to commercial businesses for the development of land or \n54\nTable of Contents\n \nconstruction of a building where the repayment is derived from revenues generated from the business of the borrower. These owner-occupied real estate and real estate construction loans generally mature within a 10 year period and with amortization periods reflecting the longer life of the underlying collateral. Typical structure is an amortizing term loan, though construction loans are short-term, monitored, non-revolving draw facilities. These loans frequently have a covenant package combination consistent with the underwriting of commercial loans, inclusive of applicable debt service coverage, leverage, and liquidity measurements.\nUnderwriting for owner-occupied real estate and real estate construction loans is consistent with the underwriting of commercial loans, with particular attention to the enhancement provided by the underlying real estate collateral. \nReal estate appraisals, for both commercial and IRE loans, are performed in accordance with regulatory guidelines. In some cases, reports from automated valuation services are used or internal evaluations are performed. An appraisal is ordered and reviewed prior to loan closing, and a new appraisal or evaluation is generally ordered when market conditions indicate a potential decline in the value of the collateral, or when the loan is either modified, renewed, or deteriorates to a certain level of credit weaknesses. \nInvestor Real Estate\nLoans for real estate development are repaid through cash flows related to the operation, sale or refinance of the property. This portfolio segment includes extensions of credit to real estate developers or investors where repayment is dependent on the sale of real estate or income generated from the real estate collateral. A portion of Regions’ IRE portfolio segment consists of loans secured by residential product types (land, single-family and condominium loans) within Regions’ markets. Additionally, this category includes loans made to finance income-producing properties such as apartment buildings, office and industrial buildings, and retail shopping centers. Total IRE loans increased $360 million in comparison to year-end 2024 balances due to increases in fundings to previously approved projects and new term loans for apartments, data centers and industrial properties. \nIRE loans generally mature within a three-to-seven-year period and consist of full, partial, and non-recourse guarantee structures. Typical term loan structures include annually testing operating covenants that require loan rebalancing based on minimum debt service coverage, debt yield, and/or LTV tests. Construction and land development loans generally mature in 12 to 24 months for acquisition and development, to 42 to 60 months for construction and contain full or partial recourse guarantee structures with 12 to 24 month extension options or roll-to-permanent financing options that often result in term loans. \nUnderwriting on IRE properties is based on the economic viability of the project with significant consideration given to the creditworthiness and experience of the sponsor, who is responsible for managing the property. The Company generally requires that the owner, who provides the capital to purchase the property, infuse their equity prior to any advances. Re-margining requirements (e.g., required equity infusions upon a decline in value or cash flow of the collateral) are often included in the loan agreement along with required guarantees of the sponsor.\n55\nTable of Contents\n \nThe following tables provide detail of Regions' commercial and IRE lending balances in selected industries.\nTable 4—Commercial and Investor Real Estate Industry Exposure\nSeptember 30, 2025\nDecember 31, 2024 \n(3)\nLoans\nUnfunded Commitments\nTotal Exposure\nPercent of Balance\nLoans\nUnfunded Commitments\nTotal Exposure\nPercent of Balance\n(In millions)\nCommercial:\nAdministrative, support, waste and repair\n$\n1,121 \n$\n782 \n$\n1,903 \n1.8 \n%\n$\n1,306 \n$\n751 \n$2,057\n2.0 \n%\nAgriculture\n194 \n117 \n311 \n0.2 \n%\n211 \n142 \n353\n0.3 \n%\nEducational services\n3,094 \n726 \n3,820 \n3.6 \n%\n3,229 \n875 \n4,104\n4.0 \n%\nEnergy \n1,484 \n3,883 \n5,367 \n5.1 \n%\n1,322 \n3,484 \n4,806\n4.7 \n%\nFinancial services \n8,191 \n9,688 \n17,879 \n16.9 \n%\n8,463 \n9,308 \n17,771\n17.4 \n%\nGovernment and public sector\n3,253 \n515 \n3,768 \n3.6 \n%\n3,121 \n437 \n3,558\n3.5 \n%\nHealthcare\n3,170 \n2,500 \n5,670 \n5.4 \n%\n3,338 \n2,480 \n5,818\n5.7 \n%\nInformation\n1,983 \n1,114 \n3,097 \n2.9 \n%\n2,186 \n1,115 \n3,301\n3.2 \n%\nManufacturing \n5,063 \n5,104 \n10,167 \n9.6 \n%\n5,037 \n5,138 \n10,175\n9.9 \n%\nProfessional, scientific and technical services \n1,823 \n1,766 \n3,589 \n3.4 \n%\n1,970 \n1,736 \n3,706\n3.6 \n%\nReal estate\n (1)\n9,043 \n9,417 \n18,460 \n17.4 \n%\n8,857 \n9,110 \n17,967\n17.6 \n%\nReligious, leisure, personal and non-profit services\n1,724 \n981 \n2,705 \n2.6 \n%\n1,579 \n852 \n2,431\n2.4 \n%\nRestaurant, accommodation and lodging\n1,250 \n362 \n1,612 \n1.5 \n%\n1,285 \n216 \n1,501\n1.5 \n%\nRetail trade\n2,478 \n2,063 \n4,541 \n4.3 \n%\n2,604 \n1,908 \n4,512\n4.4 \n%\nTransportation and warehousing\n3,464 \n1,982 \n5,446 \n5.1 \n%\n3,655 \n1,645 \n5,300\n5.2 \n%\nUtilities\n2,193 \n4,000 \n6,193 \n5.9 \n%\n2,329 \n3,223 \n5,552\n5.4 \n%\nWholesale goods\n4,524 \n3,508 \n8,032 \n7.6 \n%\n4,232 \n3,371 \n7,603\n7.4 \n%\nOther \n(2)\n302 \n2,993 \n3,295 \n3.1 \n%\n121 \n1,677 \n1,798\n1.8 \n%\nTotal commercial\n$\n54,354 \n$\n51,501 \n$\n105,855 \n100.0 \n%\n$\n54,845 \n$\n47,468 \n$102,313\n100.0 \n%\nInvestor real estate:\nHotel\n$\n149 \n$\n11 \n$\n160 \n1.3 \n%\n$\n188 \n$\n18 \n$206\n1.8 \n%\nIndustrial\n1,068 \n222 \n1,290 \n10.8 \n%\n808 \n160 \n968\n8.5 \n%\nLand\n107 \n11 \n118 \n1.0 \n%\n74 \n49 \n123\n1.1 \n%\nMulti-family\n4,246 \n1,118 \n5,364 \n44.8 \n%\n3,834 \n1,417 \n5,251\n46.2 \n%\nOffice\n1,135 \n70 \n1,205 \n10.1 \n%\n1,325 \n34 \n1,359\n12.0 \n%\nRetail\n221 \n69 \n290 \n2.4 \n%\n314 \n2 \n316\n2.8 \n%\nSingle-family/condo\n726 \n490 \n1,216 \n10.2 \n%\n668 \n467 \n1,135\n10.0 \n%\nData center\n87 \n71 \n158 \n1.3 \n%\n215 \n32 \n247\n2.2 \n%\nSelf storage\n38 \n6 \n44 \n0.4 \n%\n16 \n1 \n17\n0.1 \n%\nOther \n(2)\n1,293 \n838 \n2,131 \n17.7 \n%\n1,268 \n482 \n1,750\n15.3 \n%\nTotal investor real estate\n$\n9,070 \n$\n2,906 \n$\n11,976 \n100 \n%\n$\n8,710 \n$\n2,662 \n$11,372\n100 \n%\n_______\n(1)\n\"Real estate\" includes REITs, which are unsecured commercial and industrial products that are real estate related. This portfolio is well diversified, generally has low leverage with strong access to liquidity, and the REITs included in this portfolio are primarily investment or near investment grade.\n(2)\n\"Other\" contains balances related to non-classifiable and invalid business industry codes offset by payments in process and fee accounts that are not available at the loan level. \n(3)\nAs customers' businesses evolve (e.g. up or down the vertical manufacturing chain), Regions may need to change the assigned business industry code used to define the customer relationship. When these changes occur, Regions does not recast the customer history for prior periods into the new classification because the business industry code used in the prior period was deemed appropriate. As a result, year over year changes may be impacted.\n56\nTable of Contents\n \nThe Company's total non-owner-occupied commercial real estate lending consists of both unsecured commercial and industrial loans that are real estate related (including REITs) and investor real estate loans and are considered to be well diversified across property types. The following tables provide detail of these loans: \nTable 5— Unsecured Commercial Real Estate and Investor Real Estate Exposure\nSeptember 30, 2025\nDecember 31, 2024\nLoan Balance\nPercent of Total \n(1)\nLoan Balance\nPercent of Total \n(1)\n(In millions)\nResidential homebuilders\n$\n1,331 \n8.4 \n%\n$\n1,081 \n7.1 \n%\nApartments \n4,867 \n30.7 \n%\n4,371 \n28.6 \n%\nIndustrial\n2,485 \n15.6 \n%\n2,287 \n15.0 \n%\nData center\n363 \n2.3 \n%\n332 \n2.2 \n%\nDiversified\n1,741 \n11.0 \n%\n1,740 \n11.4 \n%\nBusiness offices \n1,120 \n7.1 \n%\n1,473 \n9.6 \n%\nResidential land\n65 \n0.4 \n%\n55 \n0.4 \n%\nRetail\n1,146 \n7.2 \n%\n1,458 \n9.5 \n%\nHealthcare \n1,249 \n7.9 \n%\n1,129 \n7.4 \n%\nHotel\n732 \n4.6 \n%\n785 \n5.1 \n%\nCommercial land\n42 \n0.3 \n%\n19 \n0.1 \n%\nSelf Storage\n258 \n1.6 \n%\n296 \n1.9 \n%\nOther\n460 \n2.9 \n%\n260 \n1.7 \n%\nTotal \n(2)\n$\n15,859 \n100.0 \n%\n$\n15,286 \n100.0 \n%\n_______\n(1)\nAmounts calculated based on whole dollar values.\n(2)\nOwner-occupied commercial real estate is not included as the principal source of repayment is individual businesses, which more closely aligns with the commercial portfolio credit performance. \nPortfolios that are experiencing higher risk due to conditions such as inflationary pressures, higher interest rates, and adverse underlying market fundamentals (identified as portfolios of interest) include business offices and trucking (included within transportation and warehousing) at September 30, 2025 within Table 4 above. Recent and potential future interest rate cuts should ease pressure on borrowers across the entire loan portfolio. \nThe business offices portfolio remains a portfolio of interest due to low occupancy rates and reductions in net effective rents. The office portfolio totaled $1.1 billion and represented 1.2 percent of total loans at September 30, 2025. The office portfolio included non-performing loans of $113 million and had associated charge-offs of $51 million in the nine months ended September 30, 2025. Approximately 91 percent of the office portfolio was secured, with approximately 62 percent of secured balances located in the South region of the U.S, of which 80 percent were Class A properties. Approximately 55 percent of the office portfolio will mature in the next 12 months. Additionally, the IRE office portfolio had a weighted-average LTV of approximately 67 percent at September 30, 2025, based upon appraisal at origination or most recent received, and a stressed weighted-average LTV of approximately 88 percent as of October 6, 2025, based upon GreenStreet's Commercial Property Price Index. No new loan originations are being contemplated in this portfolio.\nThe trucking portfolio remains a portfolio of interest as trucking companies have been working through one of the most prolonged downturns in the U.S. domestic freight market. The industry has experienced marginal improvement in 2025; however, freight demand remains soft and tariff policies may reduce demand further. The trucking portfolio totaled $1.3 billion and represented 1.3 percent of total loans at September 30, 2025. The trucking portfolio included non-performing loans of $117 million and had associated charge-offs of $52 million in the nine months ended September 30, 2025. New originations in the sector have been curtailed and those that occur are secured.\nResidential First Mortgage\nResidential first mortgage loans represent loans to consumers to finance a residence. These loans are typically financed over a 15 to 30 year term and, in most cases, are extended to borrowers to finance their primary residence. Total residential first mortgage loans decreased $213 million in comparison to year-end 2024 balances as payoffs and paydowns outpaced production.\nHome Equity Lines\nHome equity lines are secured by a first or second mortgage on the borrower's residence and allow customers to borrow against the equity in their homes. Substantially all of this portfolio was originated through Regions' branch network. \n57\nTable of Contents\n \nBeginning in December 2016, new home equity lines of credit have a 10-year draw period and a 20-year repayment term. During the 10-year draw period customers do not have an interest-only payment option, except on a very limited basis. From May 2009 to December 2016, home equity lines of credit had a 10-year draw period and a 10-year repayment term. Prior to May 2009, the predominant structure was a 20-year draw period with a balloon payment upon maturity. The term “balloon payment” means there are no principal payments required until the balloon payment is due for interest-only lines of credit.\nThe following table presents information regarding the future principal payment reset dates for the Company's home equity lines of credit as of September 30, 2025. The balances presented are based on maturity date for lines with a balloon payment and draw period expiration date for lines that convert to a repayment period.\nTable 6—Home Equity Lines of Credit - Future Principal Payment Resets\nFirst Lien\n% of Total\nSecond Lien\n% of Total\nTotal\n(Dollars in millions)\n2025\n$\n20 \n0.62 \n%\n$\n21 \n0.65 \n%\n$\n41 \n2026\n87 \n2.71 \n%\n91 \n2.82 \n%\n178 \n2027\n229 \n7.13 \n%\n194 \n6.06 \n%\n423 \n2028\n225 \n7.00 \n%\n143 \n4.46 \n%\n368 \n2029\n99 \n3.09 \n%\n68 \n2.13 \n%\n167 \n2030-2034\n560 \n17.45 \n%\n995 \n31.00 \n%\n1,555 \n2035-2039\n133 \n4.16 \n%\n234 \n7.28 \n%\n367 \nThereafter\n9 \n0.28 \n%\n7 \n0.22 \n%\n16 \nRevolving Loans Converted to Amortizing\n54 \n1.69 \n%\n40 \n1.25 \n%\n94 \nTotal\n$\n1,416 \n44.13 \n%\n$\n1,793 \n55.87 \n%\n$\n3,209 \nHome Equity Loans\nHome equity loans are also secured by a first or second mortgage on the borrower's residence, are primarily originated as amortizing loans, and allow customers to borrow against the equity in their homes. Substantially all of this portfolio was originated through Regions’ branch network.\nConsumer Credit Quality Data\nThe Company calculates an estimate of the current value of property secured as collateral for both residential first mortgage and home equity lending products (“current LTV”). The estimate is based on home price indices compiled by a third party that is updated typically every three months. The third party data indicates trends for MSAs. Regions uses the third party valuation trends from the MSAs in the Company's footprint in its estimate. The trend data is applied to the loan portfolios taking into account the age of the most recent valuation and geographic area.\nThe following table presents current LTV data for components of the residential first mortgage, home equity lines and home equity loans classes of the consumer portfolio segment. Current LTV data for some loans in the portfolio is not available due to mergers and systems integrations. The amounts in the table represent the entire loan balance. For purposes of the table below, if the loan balance exceeds the current estimated collateral the entire balance is included in the “Above 100%” category, regardless of the amount of collateral available to partially offset the shortfall. \nTable 7—Estimated Current Loan to Value Ranges\n \nSeptember 30, 2025\nResidential\nFirst Mortgage\nHome Equity Lines of Credit\nHome Equity Loans\n \n1st Lien\n2nd Lien\n1st Lien\n2nd Lien\n \n(In millions)\nEstimated current LTV:\nAbove 100%\n$\n69 \n$\n— \n$\n— \n$\n1 \n$\n1 \nAbove 80% - 100%\n1,848 \n1 \n6 \n7 \n13 \n80% and below\n17,751 \n1,403 \n1,775 \n1,776 \n540 \nData not available\n213 \n12 \n12 \n2 \n— \n$\n19,881 \n$\n1,416 \n$\n1,793 \n$\n1,786 \n$\n554 \n58\nTable of Contents\n \n \nDecember 31, 2024\nResidential\nFirst Mortgage\nHome Equity Lines of Credit\nHome Equity Loans\n \n1st Lien\n2nd Lien\n1st Lien\n2nd Lien\n \n(In millions)\nEstimated current LTV:\n`\nAbove 100%\n$\n63 \n$\n2 \n$\n— \n$\n1 \n$\n— \nAbove 80% - 100%\n1,799 \n2 \n3 \n9 \n11 \n80% and below\n17,898 \n1,430 \n1,687 \n1,883 \n484 \nData not available\n334 \n14 \n12 \n2 \n— \n$\n20,094 \n$\n1,448 \n$\n1,702 \n$\n1,895 \n$\n495 \nConsumer Credit Card\nConsumer credit card lending represents primarily open-ended variable interest rate consumer credit card loans. \nOther Consumer\nOther consumer loans primarily include indirect and direct consumer loans, overdrafts and other revolving loans. Other consumer loans decreased $259 million from year-end 2024 driven by a decline in consumer home improvement lending production.\nRegions considers factors such as periodic updates of FICO scores, accrual status, days past due status, unemployment rates, home prices, and geography as credit quality indicators for the consumer loan portfolio. FICO scores are obtained at origination and refreshed FICO scores are obtained by the Company quarterly for most consumer loans. For more information on credit quality indicators refer to Note 4 \"Loans and the Allowance for Credit Losses\". \nALLOWANCE\nThe allowance represents management's best estimate of expected losses over the life of the loan and credit commitment portfolios and consists of two components: the allowance for loan losses and the reserve for unfunded credit commitments. Unfunded credit commitments includes items such as letters of credit, financial guarantees and binding unfunded loan commitments. The allowance totaled $1.7 billion at both September 30, 2025 and December 31, 2024.\nDetails regarding the allowance and net charge-offs, including an analysis of activity in the three and nine months ended September 30, 2025 and 2024, are included below:\nTable 8—Allowance for Credit Losses\nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n2025\n2024\n \n(Dollars in millions)\nBeginning allowance for loan losses \n$\n1,612 \n$\n1,621 \n$\n1,613 \n$\n1,576 \nLoans charged-off:\nCommercial and industrial\n57 \n70 \n184 \n192 \nCommercial real estate mortgage—owner-occupied\n1 \n1 \n3 \n2 \nCommercial investor real estate mortgage\n34 \n12 \n58 \n17 \nResidential first mortgage\n1 \n— \n2 \n1 \nHome equity lines\n— \n1 \n1 \n3 \nConsumer credit card\n16 \n16 \n50 \n47 \nOther consumer\n51 \n43 \n140 \n145 \n160 \n143 \n438 \n407 \nRecoveries of loans previously charged-off:\nCommercial and industrial\n10 \n15 \n31 \n31 \nCommercial real estate mortgage—owner-occupied\n1 \n— \n1 \n1 \nCommercial real estate construction—owner-occupied\n— \n— \n1 \n1 \nCommercial investor real estate mortgage\n2 \n— \n2 \n2 \nResidential first mortgage\n— \n1 \n1 \n3 \nHome equity lines\n1 \n1 \n3 \n5 \nConsumer credit card\n2 \n3 \n7 \n6 \nOther consumer\n9 \n6 \n21 \n19 \n25 \n26 \n67 \n68 \n59\nTable of Contents\n \nThree Months Ended September 30\nNine Months Ended September 30\n2025\n2024\n2025\n2024\nNet charge-offs (recoveries):\nCommercial and industrial\n47 \n55 \n153 \n161 \nCommercial real estate mortgage—owner-occupied\n— \n1 \n2 \n1 \nCommercial real estate construction—owner-occupied\n— \n— \n(1)\n(1)\nCommercial investor real estate mortgage\n32 \n12 \n56 \n15 \nResidential first mortgage\n1 \n(1)\n1 \n(2)\nHome equity lines\n(1)\n— \n(2)\n(2)\nConsumer credit card\n14 \n13 \n43 \n41 \nOther consumer\n42 \n37 \n119 \n126 \n135 \n117 \n371 \n339 \nProvision for loan losses\n104 \n103 \n339 \n370 \nEnding allowance for loan losses\n1,581 \n1,607 \n1,581 \n1,607 \nBeginning reserve for unfunded credit commitments \n131 \n111 \n116 \n124 \nProvision for (benefit from) unfunded credit losses\n1 \n10 \n16 \n(3)\nEnding reserve for unfunded credit commitments\n132 \n121 \n132 \n121 \nEnding allowance for credit losses\n$\n1,713 \n$\n1,728 \n$\n1,713 \n$\n1,728 \nLoans, net of unearned income, outstanding at end of period\n$\n96,125 \n$\n96,789 \n$\n96,125 \n$\n96,789 \nAverage loans, net of unearned income, outstanding for the period\n$\n96,647 \n$\n97,040 \n$\n96,284 \n$\n97,246 \nNet loan charge-offs (recoveries) as a % of average loans, annualized \n(1)\n:\nCommercial and industrial\n0.37 \n%\n0.44 \n%\n0.41 \n%\n0.43 \n%\nCommercial real estate mortgage—owner-occupied\n0.04 \n%\n0.09 \n%\n0.06 \n%\n0.03 \n%\nCommercial real estate construction—owner-occupied\n(0.01)\n%\n(0.01)\n%\n(0.31)\n%\n(0.24)\n%\nTotal commercial\n0.34 \n%\n0.41 \n%\n0.38 \n%\n0.39 \n%\nCommercial investor real estate mortgage\n1.82 \n%\n0.71 \n%\n1.11 \n%\n0.30 \n%\nCommercial investor real estate construction\n— \n%\n(0.01)\n%\n— \n%\n— \n%\nTotal investor real estate\n1.41 \n%\n0.52 \n%\n0.84 \n%\n0.22 \n%\nResidential first mortgage\n0.01 \n%\n(0.01)\n%\n— \n%\n(0.01)\n%\nHome equity lines\n(0.12)\n%\n(0.08)\n%\n(0.07)\n%\n(0.10)\n%\nHome equity loans\n(0.01)\n%\n(0.01)\n%\n(0.01)\n%\n(0.02)\n%\nConsumer credit card\n3.94 \n%\n3.84 \n%\n4.12 \n%\n4.07 \n%\nOther consumer\n2.83 \n%\n2.37 \n%\n2.67 \n%\n2.70 \n%\nTotal consumer\n0.67 \n%\n0.58 \n%\n0.65 \n%\n0.65 \n%\nTotal\n0.55 \n%\n0.48 \n%\n0.52 \n%\n0.47 \n%\nRatios \n(1)\n:\nAllowance for credit losses at end of period to loans, net of unearned income \n1.78 \n%\n1.79 \n%\n1.78 \n%\n1.79 \n%\nAllowance for credit losses at end of period to non-performing loans, excluding loans held for sale\n226 \n%\n210 \n%\n226 \n%\n210 \n%\n_______\n(1)\nAmounts have been calculated using whole dollar values.\n Net charge-offs increased $18 million and $32 million for the three and nine months ended September 30, 2025, compared to the same periods in 2024, respectively. Economic trends such as interest rates, unemployment, volatility in commodity prices, collateral valuations and inflationary pressure will impact the future levels of net charge-offs and may result in volatility of certain credit metrics for the remainder of 2025 and beyond. \nRegions' quarterly allowance estimation process utilizes loss forecasting models for pooled loans, specific reserves for significant individually evaluated non-performing loans, and qualitative adjustments for items not captured by the models including specific adjustments and general imprecision. Key inputs to Regions' loss forecasting models include, but are not limited to, loan risk ratings (commercial and investor real estate loans), maturity date, days past due and FICO scores (consumer loans), collateral values securing loans, and Regions' internally prepared baseline economic forecast. Changes in any of these factors, assumptions, or the availability of new information, could require the allowance to be adjusted in future periods, perhaps materially. Outputs from the loss forecasting models, in combination with Regions' qualitative framework and other analyses, inform management in its estimation of Regions' expected credit losses to ensure the overall allowance estimate is appropriate from both a bottom-up and top-down perspective. Actual losses could vary, perhaps materially, from management’s estimates. See Note 1 \"Summary of Significant Accounting Policies\" in the Annual Report on Form 10-K for the year ended December 31, 2024 for more information.\n60\nTable of Contents\n \nBaseline economic forecast\nIn deriving any forecast, Regions benchmarks its internal forecast with external forecasts and external data available. Regions' September 2025 baseline forecast reflected deterioration across some key variables as compared to the June baseline forecast, which resulted in an increase in the allowance. \nThe September baseline forecast anticipates real GDP growth of 1.8 percent for 2025 and 2026, with real private domestic demand expected to rise by 2.2 percent in 2025. The quarterly growth pattern over the coming quarters is expected to be somewhat less volatile compared to the first half of 2025. Recent upward revisions to GDP growth and real private domestic demand reflect stronger business investment and consumer spending.\nCorporate profits show moderate gains and, despite a slight narrowing of profit margins, they remain well above historical averages, indicating that most firms have been able to absorb higher tariff costs without immediately passing them on to consumers. While profit margins are currently elevated, as margins compress companies may face tougher decisions regarding pricing and cost management. However, recent tax code changes could provide some buffer against higher tariff costs. \nJob growth has clearly slowed, but the extent and drivers remain somewhat uncertain as challenges persist with data collection and measurement from monthly employment reports. However, labor supply, particularly among the foreign-born workforce, appears to be a significant factor. While a slower pace of economic growth, combined with heightened attention to operational efficiency and cost control, have contributed to the demand for labor, the reduction in labor supply may be having an equally significant, if not greater, effect on overall job growth.\nInflation data at the retail level has revealed uneven tariff pass-through into final goods prices, with August CPI data showing the largest year-over-year increase in core goods prices since May 2023 and the largest increase in prices for motor vehicles since December 2024. As expected, the FOMC cut the Fed funds rate by 25 basis points during the third quarter of 2025, and by another 25 basis points subsequent to quarter-end on October 29, 2025. Additional incoming labor market and inflation data will determine the extent of further cuts in 2025.\nSubsequent to the end of the third quarter of 2025, Congress had not reached an agreement on government funding, resulting in a shutdown of Federal Government operations. While the shutdown did not impact Regions’ September 2025 baseline forecast, the remaining uncertainty of its duration and resolution creates challenges for any future forecast. \nThe risks to the baseline forecast are weighted to the downside. Current prevailing economic uncertainty and the potential for further disruption could likely influence future levels of the allowance.\nTable 9 below reflects a range of macroeconomic factors utilized in the baseline economic forecast over the two-year R&S forecast period as of September 30, 2025. The unemployment rate is the most significant macroeconomic factor among the allowance models and as of the June 2025 baseline forecast was expected to remain relatively consistent over the forecast period. \nTable 9—Macroeconomic Factors in the Forecast\n \nPre-R&S Period\nBaseline R&S Forecast\nSeptember 30, 2025\n3Q2025\n4Q2025\n1Q2026\n2Q2026\n3Q2026\n4Q2026\n1Q2027\n2Q2027\n3Q2027\nUnemployment rate\n4.3 \n%\n4.4 \n%\n4.4 \n%\n4.4 \n%\n4.4 \n%\n4.4 \n%\n4.3 \n%\n4.3 \n%\n4.3 \n%\nReal GDP, annualized % change\n1.4 \n%\n1.2 \n%\n1.7 \n%\n1.9 \n%\n1.9 \n%\n2.1 \n%\n1.9 \n%\n2.0 \n%\n1.9 \n%\nHPI, year-over-year % change\n0.8 \n%\n(0.6)\n%\n(1.5)\n%\n(1.4)\n%\n(0.8)\n%\n0.6 \n%\n2.2 \n%\n2.9 \n%\n3.3 \n%\nCPI, year-over-year % change\n2.9 \n%\n3.0 \n%\n2.9 \n%\n3.2 \n%\n3.0 \n%\n2.7 \n%\n2.6 \n%\n2.5 \n%\n2.4 \n%\nPortfolio, credit metrics, and specific reserves\nThe loan portfolio composition is evaluated each quarter and changes to the composition can influence modeled allowance results.\nCredit metrics are monitored throughout each quarter and are a key consideration in the allowance process. In the third quarter of 2025, overall asset quality improved. Commercial and investor real estate criticized balances decreased approximately $926 million from $4.6 billion in the second quarter to $3.7 billion in the third quarter of 2025. The decrease was due primarily to upgrades and significant payoffs during the quarter, which were fairly widespread across numerous industry portfolios. Non-performing loans, excluding held for sale, decreased approximately $18 million from $776 million in the second quarter to $758 million in the third quarter of 2025. See Table 11 for more details regarding non-performing assets. While the ratio of net charge-offs to average loans increased 8 basis points for the third quarter of 2025 compared to the second quarter of 2025, the majority of business services charge-offs related to previously identified portfolios of interest for which specific reserves had already been established. The combination of credit quality improvements and specific reserve changes drove a net decrease in the allowance during the third quarter.\n61\nTable of Contents\n \nQualitative adjustments\nWhile it is the intent of Regions' quantitative allowance methodologies to reflect all risk factors, including incremental risk in portfolios identified as under stress, any estimate involves assumptions and uncertainties resulting in some level of imprecision. Regions' qualitative framework has a general imprecision component which is meant to acknowledge that model and forecast errors are inherent in any modeling estimate. In the third quarter of 2025, the general imprecision component increased due to uncertainty related to the government shutdown and continued elevated economic uncertainty partially offset by general model imprecision improvements.  \nThe qualitative framework also has specific adjustment components which are reserves meant to capture specific issues or events that management believes are not adequately captured in the model outcomes. Qualitative adjustments for the third quarter of 2025 were reduced slightly from the second quarter of 2025 levels due to improvements in previously identified portfolios of interest. \nThe combined results from general imprecision and specific qualitative adjustments slightly increased the allowance during the third quarter.\nOverall allowance\nBased upon the factors discussed above, the September 30, 2025 allowance decreased $30 million compared to the second quarter of 2025 due primarily to improvement in commercial and investor real estate criticized loans, a decline in non-performing loans, and continued resolutions of loans within previously identified portfolios of interest, partially offset by a decline in the economic forecast. \n \nAllocation of the allowance by portfolio segment and class is summarized as follows:\nTable 10—Allowance Allocation \n \nSeptember 30, 2025\nDecember 31, 2024\n \nLoan Balance\nAllowance Allocation\nAllowance to Loans %\n(1)\nLoan Balance\nAllowance Allocation\nAllowance to Loans %\n(1)\n \n(Dollars in millions)\nCommercial and industrial\n$\n49,234 \n$\n774 \n1.57 \n%\n$\n49,671 \n$\n717 \n1.44 \n%\nCommercial real estate mortgage—owner-occupied\n4,835 \n106 \n2.18 \n%\n4,841 \n108 \n2.22 \n%\nCommercial real estate construction—owner-occupied\n285 \n8 \n2.81 \n%\n333 \n9 \n2.75 \n%\nTotal commercial\n54,354 \n888 \n1.63 \n%\n54,845 \n834 \n1.52 \n%\nCommercial investor real estate mortgage\n7,122 \n140 \n1.97 \n%\n6,567 \n216 \n3.29 \n%\nCommercial investor real estate construction\n1,948 \n25 \n1.28 \n%\n2,143 \n31 \n1.47 \n%\nTotal investor real estate\n9,070 \n165 \n1.82 \n%\n8,710 \n247 \n2.84 \n%\nResidential first mortgage\n19,881 \n113 \n0.57 \n%\n20,094 \n106 \n0.53 \n%\nHome equity lines\n3,209 \n94 \n2.92 \n%\n3,150 \n86 \n2.73 \n%\nHome equity loans\n2,340 \n29 \n1.25 \n%\n2,390 \n27 \n1.12 \n%\nConsumer credit card\n1,437 \n121 \n8.41 \n%\n1,445 \n122 \n8.44 \n%\nOther consumer\n5,834 \n303 \n5.20 \n%\n6,093 \n307 \n5.05 \n%\nTotal consumer\n32,701 \n660 \n2.02 \n%\n33,172 \n648 \n1.95 \n%\nTotal\n$\n96,125 \n$\n1,713 \n1.78 \n%\n$\n96,727 \n$\n1,729 \n1.79 \n%\n_____\n(1)\nAmounts have been calculated using whole dollar values.\n62\nTable of Contents\n \nNON-PERFORMING ASSETS\nThe following table presents non-performing assets as of September 30, 2025 and December 31, 2024:\nTable 11—Non-Performing Assets\nSeptember 30, 2025\nDecember 31, 2024\n \n(Dollars in millions)\nNon-performing loans:\nCommercial and industrial\n$\n524 \n$\n408 \nCommercial real estate mortgage—owner-occupied\n41 \n37 \nCommercial real estate construction—owner-occupied\n1 \n5 \nTotal commercial\n566 \n450 \nCommercial investor real estate mortgage\n137 \n423 \nTotal investor real estate\n137 \n423 \nResidential first mortgage\n24 \n23 \nHome equity lines\n24 \n26 \nHome equity loans\n7 \n6 \nTotal consumer\n55 \n55 \nTotal non-performing loans, excluding loans held for sale\n758 \n928 \nNon-performing loans held for sale\n12 \n— \nTotal non-performing loans\n(1)\n770 \n928 \nForeclosed properties\n18 \n14 \nTotal non-performing assets\n(1)\n$\n788 \n$\n942 \nAccruing loans 90+ days past due:\nCommercial and industrial\n$\n4 \n$\n7 \nCommercial real estate mortgage—owner-occupied\n2 \n1 \nTotal commercial\n6 \n8 \nResidential first mortgage\n(2)\n84 \n88 \nHome equity lines\n14 \n16 \nHome equity loans\n7 \n7 \nConsumer credit card\n20 \n20 \nOther consumer\n23 \n27 \nTotal consumer\n148 \n158 \nTotal accruing loans 90+ days past due\n$\n154 \n$\n166 \nNon-performing loans\n(1)\n to loans and non-performing loans held for sale\n0.80 \n%\n0.96 \n%\nNon-performing loans, excluding loans held for sale\n(1) \nto loans\n0.79 \n%\n0.96 \n%\nNon-performing assets\n(1)\n to loans, foreclosed properties and non-performing loans held for sale\n0.82 \n%\n0.97 \n%\n_________\n(1)\nExcludes accruing loans 90+ days past due.\n(2)\nExcludes residential first mortgage loans that are 100% guaranteed by the FHA and all guaranteed loans sold to Ginnie Mae where Regions has the right but not the obligation to repurchase. Total 90+ days or more past due guaranteed loans excluded were $48 million at September 30, 2025 and $55 million at December 31, 2024. \nNon-performing loans (excluding loans held for sale) at September 30, 2025 decreased $170 million as compared to year-end 2024 levels primarily due to reductions in the business offices, healthcare and apartments portfolios, which were partially offset by an increase in the manufacturing portfolio. The same economic trends that impact net charge-offs, as discussed above, will impact the future level of non-performing loans. Circumstances related to individually large credits could also result in volatility.\n63\nTable of Contents\n \nThe following tables provide an analysis of non-accrual loans (excluding loans held for sale) by portfolio segment: \nTable 12— Analysis of Non-Accrual Loans\n \nNon-Accrual Loans, Excluding Loans Held for Sale for the Nine Months Ended September 30, 2025\n \nCommercial\nInvestor\nReal Estate\nConsumer\n(1)\nTotal\n \n(In millions)\nBalance at beginning of period\n$\n450 \n$\n423 \n$\n55 \n$\n928 \nAdditions\n492 \n47 \n— \n539 \nNet payments/other activity\n(156)\n(192)\n— \n(348)\nReturn to accrual\n(16)\n— \n— \n(16)\nCharge-offs on non-accrual loans\n(2)\n(179)\n(58)\n— \n(237)\nTransfers to held for sale\n(3)\n(22)\n(17)\n— \n(39)\nNet loan sales\n(3)\n(66)\n— \n(69)\nBalance at end of period\n$\n566 \n$\n137 \n$\n55 \n$\n758 \n \nNon-Accrual Loans, Excluding Loans Held for Sale for the Nine Months Ended September 30, 2024\n \nCommercial\nInvestor\nReal Estate\nConsumer\n(1)\nTotal\n \n(In millions)\nBalance at beginning of period\n$\n515 \n$\n233 \n$\n57 \n$\n805 \nAdditions\n485 \n164 \n— \n649 \nNet payments/other activity\n(280)\n(92)\n(2)\n(374)\nReturn to accrual\n(21)\n— \n— \n(21)\nCharge-offs on non-accrual loans\n(2)\n(187)\n(17)\n— \n(204)\nTransfers to held for sale\n(3)\n(9)\n(1)\n— \n(10)\nNet loan sales\n(24)\n— \n— \n(24)\nBalance at end of period\n$\n479 \n$\n287 \n$\n55 \n$\n821 \n________\n(1)\nAll net activity within the consumer portfolio segment other than sales and transfers to held for sale (including related charge-offs) is included as a single net number within the net payments/other activity line.\n(2)\nIncludes charge-offs on loans on non-accrual status and charge-offs taken upon sale and transfer of non-accrual loans to held for sale.\n(3)\nTransfers to held for sale are shown net of charge-offs recorded upon transfer.\nGOODWILL\nGoodwill totaled $5.7 billion at both September 30, 2025 and December 31, 2024. Refer to Note 1 \"Summary of Significant Accounting Policies\" and Note 9 \"Goodwill and Other Intangible Assets\" to the consolidated financial statements included in the Annual Report on Form 10-K for the year ended December 31, 2024 for the methodologies and assumptions used in the goodwill impairment analysis. \nDEPOSITS\nRegions competes with other banking and financial services companies for a share of the deposit market. Regions’ ability to compete in the deposit market depends heavily on the pricing of its deposits and how effectively the Company meets customers’ needs. Regions employs various means to meet those needs and enhance competitiveness, such as providing a high level of customer service, competitive pricing and convenient branch locations for its customers. Regions also serves customers through providing centralized, high-quality banking services through the Company's digital channels and contact center.\n64\nTable of Contents\n \nDeposits are Regions’ primary source of funds, providing funding for over 90 percent of average earning assets at both September 30, 2025 and December 31, 2024. The following table summarizes deposits by category and by segment:\nTable 13—Deposits by Category and by Segment\nSeptember 30, 2025\nDecember 31, 2024\n \n(In millions)\nNon-interest-bearing deposits\n$\n39,768 \n$\n39,138 \nInterest-bearing checking\n24,669 \n25,079 \nSavings\n11,944 \n12,022 \nMoney market—domestic\n39,051 \n35,644 \nTime deposits\n14,902 \n15,720 \n$\n130,334 \n$\n127,603 \nConsumer Bank segment\n$\n79,689 \n$\n78,637 \nCorporate Bank segment\n40,415 \n38,361 \nWealth Management segment\n7,654 \n7,736 \nOther\n(1)\n2,576 \n2,869 \n$\n130,334 \n$\n127,603 \n____\n(1)   Other deposits represent non-customer balances primarily consisting of wholesale funding (for example, selected deposits and brokered time deposits). Other deposits include brokered deposits totaling $1.8 billion at  September 30, 2025 and $2.2 billion at December 31, 2024.\nTotal deposits at September 30, 2025 increased approximately $2.7 billion compared to year-end 2024 levels driven primarily by growth in money market and, to a lesser degree, non-interest-bearing deposits from growth in corporate and consumer deposits. The increase in deposits reflects customer growth and preference for liquidity as there remains some uncertainty in the economic environment. The mix of non-interest-bearing deposits remained stable at approximately 31 percent of total deposits at both September 30, 2025 and December 31, 2024. Regions' deposits are granular and diversified including insured and collateralized deposits, with consumer deposits making up more than 60 percent of the total deposit base at both September 30, 2025 and December 31, 2024. \nSee the \"Liquidity\" and \"Market Risk-Interest Rate Risk\" sections for further discussion on liquidity and interest rates.\nBORROWED FUNDS\nShort-Term Borrowings\nShort-term borrowings, which primarily consist of FHLB advances, were $1.3 billion at September 30, 2025 and $500 million at December 31, 2024. The levels of these borrowings can fluctuate depending on the Company's funding needs and the sources utilized.\nShort-term secured borrowings, such as securities sold under agreements to repurchase and FHLB advances, are a portion of Regions' funding strategy. See the \"Liquidity\" section for further detail of Regions' borrowing capacity with the FHLB.\nTable 14—Long-Term Borrowings\nSeptember 30, 2025\nDecember 31, 2024\n(In millions)\nRegions Financial Corporation (Parent):\n2.25% senior notes due May 2025\n$\n— \n$\n749 \n1.80% senior notes due August 2028\n648 \n647 \n5.722% senior notes due June 2030\n(1)\n747 \n746 \n5.502% senior notes due September 2035\n(2)\n995 \n994 \n6.75% subordinated debentures due November 2025\n150 \n151 \n7.375% subordinated notes due December 2037\n298 \n299 \nValuation adjustments on hedged long-term debt\n(51)\n(91)\n2,787 \n3,495 \nRegions Bank:\nFHLB advances\n1,500 \n2,000 \n6.45% subordinated notes due June 2037\n497 \n496 \nOther long-term debt\n1 \n2 \n1,998 \n2,498 \nTotal consolidated\n$\n4,785 \n$\n5,993 \n____\n(1) On June 6, 2029, the Notes will bear floating rate interest equal to Compounded SOFR plus 1.49%.\n(2) On September 6, 2034, the Notes will bear floating rate interest equal to Compounded SOFR plus 2.06%.\n65\nTable of Contents\n \nLong-term borrowings decreased by approximately $1.2 billion from year-end 2024 due to the maturity of the Company's 2.25% senior notes in the second quarter of 2025 and a $500 million decrease in FHLB advances in the third quarter of 2025.\nFunding from the FHLB and Federal Reserve Bank is secured by pledged assets, primarily certain loan portfolios which are also subject to blanket lien arrangements with the FHLB and Federal Reserve Bank. As of September 30, 2025, Regions' blanket lien arrangements with these entities covered a total loan balance of approximately $93.4 billion and included loans from various loan portfolios. However, borrowing capacity with the FHLB and Federal Reserve Bank is contingent on a subset of the blanket lien portfolios which are eligible and pledged according to the parameters for each counterparty.\nREGULATORY REQUIREMENTS \nCAPITAL RULES\nRegions and Regions Bank are required to comply with regulatory capital requirements established by Federal and State banking agencies. These regulatory capital requirements involve quantitative measures of the Company's assets, liabilities and selected off-balance sheet items, and also qualitative judgments by the regulators. Failure to meet minimum capital requirements can subject the Company to a series of increasingly restrictive regulatory actions. Under the Basel III Rules, Regions is designated as a standardized approach bank. Regions is a \"Category IV\" institution under the Federal Reserve's Tailoring Rules. \nFederal banking agencies allowed a phase-in of the impact of CECL on regulatory capital. At December 31, 2021, the add-back to regulatory capital was calculated as the impact of initial adoption, adjusted for 25 percent of subsequent changes in the allowance. The amount was phased-in over a three-year period beginning in 2022 and concluded in the first quarter of 2025. At December 31, 2024, the net impact of the add-back on CET1 was approximately $102 million or approximately 8 basis points.\nRegions participates in supervisory stress testing conducted by the Federal Reserve and its SCB is currently floored at 2.5 percent. See Note 6 \"Shareholders' Equity and Accumulated Other Comprehensive Income\" to the consolidated financial statements for further details regarding CCAR results.\nThe following table summarizes the applicable holding company and bank regulatory requirements: \nTable 15—Regulatory Capital Requirements\nSeptember 30, 2025 Ratio\n(1)\nDecember 31, 2024 Ratio\nMinimum Requirement\nMinimum Requirement plus SCB\n (2)\nTo Be Well\nCapitalized\nCommon equity Tier 1 capital:\nRegions Financial Corporation\n10.86 \n%\n10.80 \n%\n4.50 \n%\n7.00 \n%\nN/A\nRegions Bank\n11.66 \n11.32 \n4.50 \n7.00 \n6.50 \n%\nTier 1 capital:\nRegions Financial Corporation\n11.95 \n%\n12.17 \n%\n6.00 \n%\n8.50 \n%\n6.00 \n%\nRegions Bank\n11.66 \n11.32 \n6.00 \n8.50 \n8.00 \nTotal capital:\nRegions Financial Corporation\n13.84 \n%\n14.06 \n%\n8.00 \n%\n10.50 \n%\n10.00 \n%\nRegions Bank\n13.31 \n12.97 \n8.00 \n10.50 \n10.00 \nLeverage capital:\nRegions Financial Corporation\n9.68 \n%\n9.88 \n%\n4.00 \n%\n4.00 \n%\nN/A\nRegions Bank\n9.46 \n9.21 \n4.00 \n4.00 \n5.00 \n___\n(1) The current quarter Basel III CET1 capital, Tier 1 capital, Total capital, and Leverage capital ratios are estimated.\n(2) Reflects Regions' SCB of 2.5 percent. SCB does not apply to leverage capital ratios.\n In the third quarter of 2023, proposals were issued by the U.S federal banking regulators that, if adopted, would impact the Company related to long-term debt requirements and U.S. implementation of capital requirements under Basel IV rules, more recently referred to as the Basel III \"Endgame\". The Company continues to monitor developments around the proposals and evaluate their potential impact. Additional discussion of the Basel III Rules, their applicability to Regions, recent proposals and final rules issued by the federal banking agencies and recent laws enacted that impact regulatory requirements is included in the \"Supervision and Regulation\" subsection of the \"Business\" section in Regions’ Annual Report on Form 10-K for the year ended December 31, 2024.\nLIQUIDITY\nRegions maintains a robust liquidity management framework designed to effectively manage liquidity risk in accordance with sound risk management principals and regulatory expectations. The framework establishes sustainable processes and tools to effectively identify, measure, mitigate, monitor, and report liquidity risks beginning with Regions’ Liquidity Management Policy and the Liquidity Risk Appetite Statements approved by the Board. Processes within the liquidity management \n66\nTable of Contents\n \nframework include, but are not limited to, liquidity risk governance, cash management, liquidity stress testing, liquidity risk limits, contingency funding plans, and collateral management. While the framework is designed to comply with liquidity regulations, the processes are further tailored to be commensurate with Regions’ operating model and risk profile.\n See the \"Liquidity\" section for more information. Also, see the “Supervision and Regulation—Liquidity Requirements” subsection of the “Business” section and the \"Risk Factors\" section in the 2024 Annual Report on Form 10-K for additional information.\nRATINGS\n    Table 16 \"Credit Ratings\" reflects the debt ratings information of Regions Financial Corporation and Regions Bank by S&P, Moody’s, Fitch and DBRS.\nTable 16—Credit Ratings\n \nAs of September 30, 2025\n \nS&P\nMoody’s\nFitch\nDBRS \n(1)\nRegions Financial Corporation\nSenior unsecured debt\nBBB+\nBaa1\nA-\nA\nSubordinated debt\nBBB\nBaa1\nBBB+\nWR\nRegions Bank\nShort-term \nA-2\nP-1\nF1\nR-1M\nLong-term bank deposits \nN/A\nA1\nA\nAH\nSenior unsecured debt\nA-\nBaa1\nA-\nAH\nSubordinated debt\nBBB+\nBaa1\nBBB+\nA\nOutlook\nStable\nStable\nStable\nPositive\n____\n(1)    As of March 31, 2024, DBRS withdrew their rating on Regions Financial Corporation's subordinated debt.\nOn September 8, 2025, DBRS affirmed the Company's senior unsecured debt rating and revised its outlook to positive from stable citing Regions strong deposit franchise and market share in the Southeastern region.\nIn general, ratings agencies base their ratings on many quantitative and qualitative factors, including capital adequacy, liquidity, asset quality, business mix, probability of government support, and level and quality of earnings. Any downgrade in credit ratings by one or more ratings agencies may impact Regions in several ways, including, but not limited to, Regions’ access to the capital markets or short-term funding, borrowing cost and capacity, collateral requirements, and acceptability of its letters of credit, thereby potentially adversely impacting Regions’ financial condition and liquidity. See “Risk Factors” for more information.\nA security rating is not a recommendation to buy, sell or hold securities, and the ratings are subject to revision or withdrawal at any time by the assigning rating agency. Each rating should be evaluated independently of any other rating. Additional information on the credit rating ranking within the overall classification system is located on the website of each credit rating agency.\nSHAREHOLDERS' AND TOTAL EQUITY\nShareholders’ equity was $19.0 billion at September 30, 2025 as compared to $17.9 billion at December 31, 2024. During the nine months ended September 30, 2025, net income increased shareholders' equity by $1.6 billion, cash dividends on common stock reduced shareholders' equity by $685 million, and cash dividends on preferred stock reduced shareholders' equity by $71 million. Changes in OCI increased shareholders' equity by $1.3 billion, primarily due to available for sale securities and derivative instruments as a result of changes in market interest rates during the nine months ended September 30, 2025. During the second quarter of 2025, the Company redeemed all of the outstanding shares of its Series D preferred stock, which decreased shareholders' equity by $350 million. Common stock repurchased during the nine months ended September 30, 2025 decreased shareholders' equity by $637 million. These shares were immediately retired upon repurchase and therefore were not included in treasury stock. \nTotal equity included noncontrolling interest of $46 million and $31 million at September 30, 2025 and December 31, 2024, respectively. The noncontrolling interest represents the unowned portion of a low income housing tax credit fund syndication, of which Regions held the majority interest at September 30, 2025 and December 31, 2024.\nSubsequent to September 30, 2025, the Company purchased 8.0 million shares for approximately $195 million through November 3, 2025. These shares were immediately retired upon repurchase and therefore were not included in treasury stock.\nSee Note 6 \"Shareholders' Equity and Accumulated Other Comprehensive Income (Loss)\" section for additional information.\n67\nTable of Contents\n \nTable 17 \"Consolidated Average Daily Balances and Yield/Rate Analysis\" presents a detail of net interest income (on a taxable-equivalent basis), the net interest margin, and the net interest spread.\nTable 17—Consolidated Average Daily Balances and Yield/Rate Analysis\nThree Months Ended September 30\n2025\n2024\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\n (1)\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate \n (1)\n(Dollars in millions; yields on taxable-equivalent basis)\nAssets\nEarning assets:\nFederal funds sold and securities purchased under agreements to resell\n$\n— \n$\n— \n— \n%\n$\n1 \n$\n— \n5.44 \n%\nDebt securities \n(2)(3)\n33,223 \n293 \n3.53 \n32,252 \n241 \n2.98 \nLoans held for sale\n662 \n9 \n5.52 \n642 \n11 \n6.56 \nLoans, net of unearned income \n(4)(5)\n96,647 \n1,398 \n5.70 \n97,040 \n1,475 \n6.02 \nInterest-bearing deposits in other banks\n8,316 \n94 \n4.51 \n6,682 \n92 \n5.52 \nOther earning assets\n1,519 \n14 \n3.63 \n1,456 \n13 \n3.58 \nTotal earning assets\n140,367 \n1,808 \n5.09 \n138,073 \n1,832 \n5.26 \nUnrealized gains/(losses) on securities available for sale, net \n(2)\n(1,001)\n(2,213)\nAllowance for loan losses\n(1,616)\n(1,629)\nCash and due from banks\n2,892 \n2,822 \nOther non-earning assets\n18,447 \n17,614 \n$\n159,089 \n$\n154,667 \nLiabilities and Shareholders’ Equity\nInterest-bearing liabilities:\nSavings\n$\n12,046 \n4 \n0.13 \n$\n12,183 \n4 \n0.13 \nInterest-bearing checking\n24,274 \n86 \n1.41 \n23,599 \n98 \n1.64 \nMoney market\n38,593 \n234 \n2.40 \n35,051 \n247 \n2.80 \nTime deposits\n15,124 \n132 \n3.45 \n15,427 \n158 \n4.09 \nTotal interest-bearing deposits \n(6)\n90,037 \n456 \n2.01 \n86,260 \n507 \n2.34 \nFederal funds purchased and securities sold under agreements to repurchase\n48 \n— \n4.36 \n22 \n— \n4.40 \nOther short-term borrowings\n696 \n8 \n4.49 \n641 \n10 \n5.42 \nLong-term borrowings\n5,527 \n75 \n5.39 \n5,351 \n85 \n6.28 \nTotal interest-bearing liabilities\n96,308 \n539 \n2.22 \n92,274 \n602 \n2.59 \nNon-interest-bearing deposits \n(6)\n39,538 \n— \n— \n39,690 \n— \n— \nTotal funding sources\n135,846 \n539 \n1.57 \n131,964 \n602 \n1.81 \nNet interest spread \n(2)\n2.87 \n2.67 \nOther liabilities\n4,515 \n4,623 \nShareholders’ equity\n18,688 \n18,047 \nNoncontrolling interest\n40 \n33 \n$\n159,089 \n$\n154,667 \nNet interest income /margin on a taxable-equivalent basis \n(7)\n$\n1,269 \n3.59 \n%\n$\n1,230 \n3.54 \n%\n_______  \n(1)\nAmounts have been calculated using whole dollar values and the prevailing interest accrual methodology.\n(2)\nDebt securities are included on an amortized cost basis with yield and net interest margin calculated accordingly. \n(3)\nInterest income on debt securities includes hedging income of $7 million and $3 million for the three months ended September 30, 2025 and 2024, respectively.\n(4)\nLoans, net of unearned income include non-accrual loans for all periods presented.\n(5)\nInterest income on loans, net of unearned income, includes hedging expense of $65 million and $110 million for the three months ended September 30, 2025 and 2024, respectively. Interest income on loans, net of unearned income, also includes net loan fees of $31 million and $36 million for the three months ended September 30, 2025 and 2024 , respectively.\n(6)\nTotal deposit costs may be calculated by dividing total interest expense on deposits by the sum of interest-bearing deposits and non-interest-bearing deposits and equaled 1.39% and 1.60% for the three months ended  September 30, 2025 and 2024,  respectively.\n(7)\nThe computation of taxable-equivalent net interest income is based on the statutory federal income tax rate of 21%, adjusted for applicable state income taxes net of the related federal tax benefit.\n68\nTable of Contents\n \n \nNine Months Ended September 30\n \n2025\n2024\n \nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\n(1)\nAverage\nBalance\nIncome/\nExpense\nYield/\nRate\n(1)\n \n(Dollars in millions; yields on taxable-equivalent basis)\nAssets\nEarning assets:\nFederal funds sold and securities purchased under agreements to resell\n$\n1 \n$\n— \n4.42 \n%\n$\n1 \n$\n— \n5.44 \n%\nDebt securities\n (2)(3)\n32,798 \n845 \n3.44 \n31,800 \n669 \n2.80 \nLoans held for sale\n535 \n26 \n6.50 \n557 \n28 \n6.61 \nLoans, net of unearned income \n(4)(5)\n96,284 \n4,141 \n5.70 \n97,246 \n4,353 \n5.94 \nInterest-bearing deposits in other banks\n8,529 \n285 \n4.48 \n5,868 \n246 \n5.61 \nOther earning assets\n1,490 \n44 \n3.92 \n1,414 \n47 \n4.47 \nTotal earning assets\n139,637 \n5,341 \n5.08 \n136,886 \n5,343 \n5.19 \nUnrealized gains/(losses) on securities available for sale, net\n (2)\n(1,352)\n(2,838)\nAllowance for loan losses\n(1,628)\n(1,615)\nCash and due from banks\n2,914 \n2,694 \nOther non-earning assets\n18,417 \n17,871 \n$\n157,988 \n$\n152,998 \nLiabilities and Shareholders’ Equity\nInterest-bearing liabilities:\nSavings\n$\n12,174 \n12 \n0.13 \n$\n12,437 \n12 \n0.13 \nInterest-bearing checking\n24,722 \n263 \n1.42 \n24,100 \n303 \n1.68 \nMoney market\n37,213 \n658 \n2.37 \n34,358 \n713 \n2.77 \nTime deposits\n15,416 \n412 \n3.57 \n15,386 \n476 \n4.13 \nTotal interest-bearing deposits \n(6)\n89,525 \n1,345 \n2.01 \n86,281 \n1,504 \n2.33 \nFederal funds purchased and securities sold under agreements to repurchase\n56 \n1 \n4.39 \n13 \n— \n4.83 \nOther short-term borrowings\n346 \n12 \n4.52 \n560 \n24 \n5.47 \nLong-term borrowings\n5,728 \n237 \n5.47 \n3,790 \n190 \n6.63 \nTotal interest-bearing liabilities\n95,655 \n1,595 \n2.23 \n90,644 \n1,718 \n2.53 \nNon-interest-bearing deposits\n(6)\n39,384 \n— \n— \n40,375 \n— \n— \nTotal funding sources\n135,039 \n1,595 \n1.58 \n131,019 \n1,718 \n1.75 \n Net interest spread\n (2)\n2.85 \n2.66 \nOther liabilities\n4,523 \n4,647 \nShareholders’ equity\n18,390 \n17,295 \nNoncontrolling interest \n36 \n37 \n$\n157,988 \n$\n152,998 \nNet interest income/margin on a taxable-equivalent basis \n(7)\n$\n3,746 \n3.59 \n%\n$\n3,625 \n3.54 \n%\n_______  \n(1)\nAmounts have been calculated using whole dollar values and the prevailing interest accrual methodology.\n(2)\nDebt securities are included on an amortized cost basis with yield and net interest margin calculated accordingly. \n(3)\nInterest income on debt securities includes hedging income of $15 million and $7 million for the nine months ended September 30, 2025 and 2024, respectively.\n(4)\nLoans, net of unearned income include non-accrual loans for all periods presented.\n(5)\nInterest income on loans, net of unearned income, includes hedging expense of $192 million and $343 million for the nine months ended September 30, 2025 and 2024, respectively. Interest income on loans, net of unearned income, also includes net loan fees of $92 million and $105 million for the nine months ended September 30, 2025 and 2024 , respectively.\n(6)\nTotal deposit costs may be calculated by dividing total interest expense on deposits by the sum of interest-bearing deposits and non-interest-bearing deposits and equaled 1.39% and 1.58%  for the nine months ended September 30, 2025 and 2024,  respectively.\n(7)\nThe computation of taxable-equivalent net interest income is based on the statutory federal income tax rate of 21%, adjusted for applicable state income taxes net of the related federal tax benefit.\nNet interest income is Regions’ principal source of income and is one of the most important elements of Regions’ ability to meet its overall performance goals. Both net interest income and net interest margin are influenced by both long-term and short-term market interest rates.\nNet interest income (taxable-equivalent basis) and net interest margin increased in both the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 due primarily to the benefits of new fixed-rate asset originations and reinvestments in the high rate environment as well as the benefits from securities repositioning activities completed in late 2024 and the first and third quarters of 2025. Net interest income and net interest margin are well protected from the reduction in short-term interest rates with floating-rate asset yield declines being offset by hedging benefits and lower \n69\nTable of Contents\n \nfunding costs. Growth in deposit balances also improved the funding mix. Net interest margin continued to be negatively impacted by higher cash balances (see the \"Cash and Cash Equivalents\" section for related discussion).\nMARKET RISK—INTEREST RATE RISK \nRegions’ primary market risk is interest rate risk. This includes uncertainty with respect to absolute interest rate levels as well as relative interest rate levels, which are impacted by both the shape and the slope of the various yield curves that affect the financial products and services that the Company offers. As its primary tool to analyze this risk, Regions measures the change in its net interest income in various interest rate scenarios compared to a base case scenario. Net interest income sensitivity to market rate movements is a useful short-term indicator of Regions’ interest rate risk.\nIn addition to net interest income simulations, Regions also utilizes an EVE analysis as a measurement tool to estimate risk exposure over a longer-term horizon. EVE measures the extent to which the economic value of assets, liabilities and derivative instruments may change in response to fluctuations in interest rates. Importantly, EVE values only the current balance sheet, excluding the growth assumptions used in net interest income sensitivity analyses. Additionally, the results are highly dependent on assumptions for products with embedded prepay optionality and indeterminate maturities. The uncertainty surrounding important assumptions used in EVE analysis may limit its efficacy.\nSensitivity Measurement\n—Financial simulation models are Regions’ primary tools used to measure interest rate exposure. Using a wide range of sophisticated simulation techniques provides management with extensive information on the potential impact to net interest income caused by changes in interest rates. Models are structured to simulate cash flows and accrual characteristics of Regions’ balance sheet. Assumptions are made about the direction and magnitude of interest rate movements, the slope of the yield curve, and the changing composition of the balance sheet that results from both strategic plans and customer behavior. Among the assumptions are expectations of balance sheet growth and composition, the pricing and maturity characteristics of existing business and the characteristics of future business. Interest rate-related risks are expressly considered, such as pricing spreads, the pricing of deposit accounts, prepayments and other option risks. Regions considers these factors, as well as the degree of certainty or uncertainty surrounding their future behavior.\nThe primary objective of asset/liability management at Regions is to coordinate balance sheet composition with interest rate risk management to sustain reasonable and stable net interest income throughout various interest rate cycles. In computing interest rate sensitivity, Regions compares a set of alternative interest rate scenarios to the results of a base case scenario derived using “market forward rates.” The set of alternative interest rate scenarios includes instantaneous parallel rate shifts of various magnitudes. In addition to parallel rate shifts, multiple curve steepening and flattening scenarios are contemplated. Regions includes simulations of gradual interest rate movements phased in over a six-month period that may more realistically mimic the speed of potential interest rate changes.\nExposure to Interest Rate Movements\n—Regions' balance sheet is naturally asset sensitive, with net interest income  increasing with higher interest rates, and decreasing with lower interest rates. This is the result of approximately half of the loan portfolio floating contractually with market rate indices, and funding from a large, mostly stable retail deposit portfolio.  Importantly, the stability and rate sensitivity of Regions' deposit portfolio has been proven over multiple interest rate cycles. With this natural balance sheet profile, the ability to utilize discretionary asset duration strategies within the investment portfolio and through derivative hedges is critical in mitigating the Bank’s naturally asset sensitive position. \nAs of September 30, 2025, Regions evidenced a mostly balanced, or \"neutral\" asset/liability position, with asset and liability duration of approximately 2.6 years, using historically-informed approximations. While the debt securities portfolio has been recorded on the balance sheet at an unrealized loss, deposit value increases more than offset this loss during a rising rate cycle. The additional value of deposits in a higher rate environment is realized in the form of lower-cost funding when compared with wholesale sources. While a balance sheet analysis, particularly EVE analysis, does contemplate the economic value of deposits, the estimated fair value of deposits is equal to their carrying value for certain financial statement footnote disclosures, consistent with industry practices. See Note 10 \"Fair Value Measurements\" to the consolidated financial statements for additional information.\nRecently, pay-fixed fair value hedges and debt securities transfers from available for sale to held to maturity classification have been used to reduce AOCI volatility associated with unrealized securities gains and losses. Inclusive of these activities, the total debt securities portfolio duration is 4.0 years, the available for sale securities portfolio duration is 3.6 years, and the held to maturity securities portfolio duration is 6.0 years. As pay-fixed fair value hedges are further utilized to manage AOCI volatility, receive-fixed cash flow hedges may be entered into as an offset to preserve the interest rate sensitivity of Regions' entire balance sheet.  \nAs of September 30, 2025, Regions' net interest income profile was mostly neutral to both gradual and instantaneous parallel yield curve shifts as compared to the base case for the 12-month measurement horizon ending September 2026. The estimated exposure associated with the rising and falling rate scenarios in Table 18 below reflects the combined impacts of movements in short-term and long-term interest rates. An increase or reduction in short-term interest rates (such as the Federal Funds rate, the interest rate on reserve balances, and SOFR) will drive the yield on assets and liabilities contractually tied to \n70\nTable of Contents\n \nsuch rates higher or lower. In either scenario, it is expected that changes in funding costs and balance sheet hedging income will offset the change in asset yields, resulting in little change to net interest income.\nNet interest income remains exposed to intermediate and long-term yield curve tenors. In the current higher interest rate environment, the exposure to fixed-rate asset turnover represents a tailwind to net interest income growth. Elevated, or increasing intermediate and long-term interest rates (such as intermediate to longer-term U.S. Treasuries, swaps and mortgage rates) will drive yields higher on certain fixed-rate, newly originated or renewed loans, and increase prospective yields on certain investment portfolio purchases. The opposite is true in an environment where intermediate and long-term interest rates fall.  Additionally, shifts in the long end of the yield curve will impact securities prepayments and alter the amount of discount accretion and premium amortization in any given period.\nThe interest rate sensitivity analysis presented below in Table 18 is informed by a variety of assumptions and estimates regarding the progression of the balance sheet in both the baseline scenario as well as the scenarios of instantaneous and gradual shifts in the yield curve. Though there are many assumptions which affect the estimates for net interest income, those pertaining to deposit pricing, deposit mix and overall balance sheet composition are particularly impactful. Given the uncertainties associated with monetary policy on industry liquidity levels and the cost of that liquidity, management evaluates the impacts from these key assumptions through sensitivity analysis. Sensitivity calculations are hypothetical and should not be considered predictive of future results.\nThe Company’s baseline balance sheet assumptions include management's best estimate for balance sheet changes in the coming 12 months. A reduction in deposit balances of $1 billion when compared to the base case estimate would reduce net interest income by $17 million over 12 months in the parallel, instantaneous +100 basis point scenario in  Table 18. Conversely, if an additional $1 billion are added, a positive benefit of $17 million would be expected over 12 months in the parallel, instantaneous +100 basis point scenario in Table 18.\nIn rising rate scenarios only, management assumes that the mix of deposits will change versus the base case as informed by analyses of prior rate cycles. Currently, however, much of the anticipated mix shift has already occurred or is expected to occur within the baseline scenario, mitigating the amount of additional remixing in higher rate scenarios. The magnitude of the remixing shift is rate dependent and equates to an approximate $1.2 billion shift from non-interest bearing deposits into time deposits over 12 months in the parallel, instantaneous +100 basis point scenario in Table 18. Furthermore, over the 12 month horizon, an increase of $1 billion in deposit remixing would decrease net interest income by approximately $21 million, and a decrease of $1 billion in deposit remixing would increase net interest income by $21 million in the parallel, instantaneous +100 basis point scenario.\nThe interest-bearing deposit beta is calibrated using the experience from prior rate cycles and is dynamic across both interest rate level and time. The parallel, instantaneous +100 basis point and -100 basis point shock scenarios in Table 18 both incorporate an incremental beta between 35 and 40 percent when compared to the base case scenario. Incremental deposit pricing outperformance or underperformance of 5 percent in a parallel, instantaneous 100 basis point shock would increase or decrease net interest income by approximately $46 million.\nThe table below summarizes Regions' positioning over the next 12 months in various parallel yield curve shifts (i.e., all yield curve tenors move by the same magnitude). The scenarios are inclusive of all interest rate hedging activities. More information regarding hedges is disclosed in Table 19 and its accompanying description.  \nTable 18—Interest Rate Sensitivity \nEstimated Annual Change\nin Net Interest Income\nSeptember 30, 2025\n(1)(2)\n \n(In millions)\nGradual Change in Interest Rates\n+ 200 basis points\n$\n103 \n+ 100 basis points\n51 \n - 100 basis points\n(55)\n - 200 basis points\n(93)\nInstantaneous Change in Interest Rates\n+ 200 basis points\n$\n57 \n+ 100 basis points\n36 \n- 100 basis points\n(48)\n - 200 basis points\n(67)\n________\n(1)\nDisclosed interest rate sensitivity levels represent the 12-month forward looking net interest income changes as compared to market forward rate cases and include expected balance sheet growth and remixing.\n(2)\nActive hedges, including forward starting hedges, are included in the sensitivity analysis to the extent that they fall within the measurement horizon.\n71\nTable of Contents\n \nWhile not depicted in the table above, interest rate movements may also have an impact on the value of Regions’ securities portfolio, which can directly impact the carrying value of shareholders’ equity. \nDerivatives\n—Regions uses financial derivative instruments for management of interest rate sensitivity. ALCO, which consists of members of Regions’ senior management team, in its oversight role for the management of interest rate sensitivity, approves the use of derivatives in balance sheet hedging strategies. Derivatives are also used to offset the risks associated with customer derivatives, which include interest rate, credit, and foreign exchange risks. The most common derivatives Regions employs are forward rate contracts, forward sale commitments, futures contracts, interest rate swaps, interest rate options (caps, floors and collars), and contracts with a combination of these instruments. \nForward rate contracts are commitments to buy or sell financial instruments at a future date at a specified price or yield. Futures contracts subject Regions to market risk associated with changes in interest rates. Because futures contracts are cash settled daily, there is minimal credit risk associated with futures. Interest rate swaps are contractual agreements typically entered into to exchange fixed for variable (or vice versa) streams of interest payments. The notional principal is not exchanged but is used as a reference for the size of interest settlements. Interest rate options are contracts that allow the buyer to purchase or sell a financial instrument at a predetermined price and time. Forward sale commitments are contractual obligations to sell market instruments at a future date for an already agreed-upon price. Foreign currency contracts involve the exchange of one currency for another on a specified date and at a specified rate. These contracts are executed on behalf of the Company's customers and are used by customers to manage fluctuations in foreign exchange rates. The Company is subject to the credit risk that another party will fail to perform.\nRegions has made use of interest rate swaps and options in balance sheet hedging strategies to effectively convert a portion of its fixed-rate funding position to a variable-rate position, to effectively convert a portion of its fixed-rate debt securities available for sale portfolio to a variable-rate position, and to effectively convert a portion of its floating-rate loan portfolios to fixed-rate. Regions also uses derivatives to economically manage interest rate and pricing risk associated with its mortgage origination business. In the period of time that elapses between the origination and sale of mortgage loans, changes in interest rates have the potential to cause a decline in the value of the loans in this held-for-sale portfolio. Futures contracts and forward sale commitments are used to protect the value of the loan pipeline and loans held for sale from changes in interest rates and pricing. \nThe following table presents additional information about hedging interest rate derivatives used by Regions to manage interest rate risk:\nTable 19—Hedging Derivatives by Interest Rate Risk Management Strategy\nSeptember 30, 2025\nNotional\nAmount\nWeighted-Average \nMaturity (Years)\nReceive Rate\nPay Rate\n(Dollars in millions)\nDerivatives in cash flow hedging relationships:\nReceive fixed/pay variable swaps - floating-rate loans\n(1)(2)(3)\n$\n36,418 \n3.5 \n3.2 \n%\n3.9 \n%\n   Interest rate options\n(4)\n2,000 \n2.8 \nDerivatives in fair value hedging relationships:\nReceive variable/pay fixed swaps - debt securities available for sale\n(1)(2)(3)\n5,133 \n6.3 \n4.2 \n%\n3.7 \n%\nReceive fixed/pay variable swaps - borrowings\n(3)\n2,400 \n5.6 \n2.9 \n%\n3.7 \n%\nTotal derivatives designated as hedging instruments\n$\n45,951 \n_________\n(1)\nFloating rates represent the most recent fixing for active derivatives and the first forward fixing for future starting derivatives.  \n(2)\nIncludes forward starting notional with maturity relative to current quarter-end. For more information on notional by year, see Table 20.\n(3)\nAll floating rates are SOFR based and may include SOFR conversion spread. \n(4)\nInterest rate options have an average cap strike of 6.22% and a floor of 1.86%. \nIn the third quarter of 2025, the Company added $2.5 billion in forward-starting receive fixed swaps with a receive rate of 3.7 percent, which will become active in January 2028 and mature in January 2033, to reduce net interest margin volatility associated with floating rate loans.     \nThe Company also added $670 million in pay-fixed swaps with a pay rate of 3.4 percent, which became active in the third quarter of 2025 and mature in 2032 to reduce AOCI volatility in the available for sale securities portfolio. As an offset to the interest rate risk associated with these pay-fixed fair value hedges, the Company added $670 million in receive-fixed interest rate swaps (floating rate loan hedges) with a receive rate of 3.3 percent, which became active in the third quarter of 2025 and mature in September 2032. \nAdditionally, the Company added approximately $710 million in primarily forward-starting pay fixed interest rate swaps (hedges of debt securities available for sale) with an average pay rate of 3.7 percent, which have an average start date in 2028 and an average maturity in 2032, to reduce AOCI volatility associated with securities reinvestment. \n72\nTable of Contents\n \nThe following table presents the average asset hedge notional amounts that are active during each of the remaining quarterly and annual periods. \nTable 20—Schedule of Notional for Asset Hedging Derivatives\nAverage Active Notional Amount \n(1)\nQuarters Ended\nYears Ended\n9/30/2025\n12/31/2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2033\n2034\n(In millions)\nAsset Hedging Relationships:\nReceive fixed/pay variable swaps\n$\n21,693 \n$\n22,168 \n$\n22,127 \n$\n20,915 \n$\n18,871 \n$\n13,959 \n$\n13,273 \n$\n8,307 \n$\n3,935 \n$\n364 \n$\n217 \nReceive variable/pay fixed swaps\n3,781 \n4,340 \n4,421 \n4,456 \n4,113 \n4,035 \n4,302 \n4,195 \n2,275 \n789 \n311 \nNet receive fixed/pay variable swaps\n$\n17,912 \n$\n17,828 \n$\n17,706 \n$\n16,459 \n$\n14,758 \n$\n9,924 \n$\n8,971 \n$\n4,112 \n$\n1,660 \n$\n(425)\n$\n(94)\nInterest rate options\n$\n2,000 \n$\n2,000 \n$\n2,000 \n$\n2,000 \n$\n999 \n$\n1 \n$\n— \n$\n— \n$\n— \n$\n— \n$\n— \n_________\n(1)\nActive hedges, including forward-starting hedges, are included in the sensitivity levels disclosed in Table 18 to the extent that they fall within the measurement horizon.\nRegions manages the credit risk of these instruments in much the same way as it manages credit risk of the loan portfolios by establishing credit limits for each counterparty and through collateral agreements for dealer transactions. For non-dealer transactions, the need for collateral is evaluated on an individual transaction basis and is primarily dependent on the financial strength of the counterparty. Credit risk is also reduced significantly by entering into legally enforceable master netting agreements. When there is more than one transaction with a counterparty and there is a legally enforceable master netting agreement in place, the exposure represents the net of the gain and loss positions with and collateral received from and/or posted to that counterparty. Most hedging interest rate swap derivatives traded by Regions are subject to mandatory clearing. The counterparty risk for cleared trades effectively moves from the executing broker to the clearinghouse allowing Regions to benefit from the risk mitigation controls in place at the respective clearinghouse. See the “Credit Risk” section in the 2024 Annual Report on Form 10-K for more information on the management of credit risk.\nRegions also uses derivatives to meet the needs of its customers. Interest rate swaps, interest rate options and foreign exchange forwards are the most common derivatives sold to customers. Other derivative instruments with similar characteristics are used to hedge market risk and minimize volatility associated with this portfolio. Instruments used to service customers are held in the trading account, with changes in value recorded in the consolidated statements of income.\nThe primary objective of Regions’ hedging strategies is to mitigate the impact of interest rate changes, from an economic perspective, on net interest income and other financing income and the net present value of its balance sheet. The overall effectiveness of these hedging strategies is subject to market conditions, the quality of Regions’ execution, the accuracy of its valuation assumptions, counterparty credit risk and changes in interest rates. \nSee Note 9 \"Derivative Financial Instruments and Hedging Activities\" to the consolidated financial statements for a tabular summary of Regions’ year-end derivatives positions and further discussion.\nRegions accounts for residential MSRs at fair market value with any changes to fair value being recorded within mortgage income. Regions also accounts for non-DUS agency commercial MSRs at fair market value with changes to fair value recorded within capital markets income. Regions enters into derivative transactions to economically mitigate the impact of market value fluctuations related to MSRs at fair market value. Derivative instruments entered into in the future could be materially different from the current risk profile of Regions’ current portfolio.\nLIQUIDITY \nLiquidity is an important factor in the financial condition of Regions and affects Regions’ ability to meet the needs of the Company and its customers. Regions’ goal in liquidity management is to maintain diverse liquidity sources and reserves sufficient to satisfy the cash flow requirements of depositors and borrowers, under normal and stressed conditions. Accordingly, Regions maintains a variety of liquidity sources to fund its obligations, as further described below. See also Note 12 \"Commitments, Contingencies and Guarantees\" to the consolidated financial statements for additional discussion of the Company’s funding requirements. Furthermore, Regions performs specific procedures, including scenario analyses and stress testing to evaluate and maintain appropriate levels of available liquidity in alignment with liquidity risk. \n Regions' operation of its business provides a generally balanced liquidity base which is comprised of customer assets, consisting principally of loans, and funding provided by customer deposits and borrowed funds. Maturities in the loan portfolio provide a steady flow of funds, and are supplemented by Regions' deposit base. \n73\nTable of Contents\n \nCash reserves, liquid assets and secured borrowing capabilities aid in the management of liquidity in normal and stressed conditions, and/or meeting the need of contingent events such as obligations related to potential litigation. As part of its normal management practice, Regions maintains collateral and operational readiness to utilize secured funding sources such as the FHLB and the Federal Reserve Bank on a same-day basis (subject to any practical constraints affecting these market participants). While the securities portfolio is a primary source of liquidity, the secured borrowing capabilities, in addition to cash reserves on hand, assist in alleviating the Company's need to sell securities for funding purposes. Liquidity needs can also be met by borrowing funds in national money markets, though Regions does maintain limits on short-term unsecured funding due to the volatility that can affect such markets. \nThe following table summarizes the Company's available sources of liquidity as of September 30, 2025:\nTable 21—Liquidity Sources\nAvailability as of September 30, 2025\n(In billions)\nCash at the Federal Reserve Bank\n(1)\n$\n9.0 \nUnencumbered investment securities\n(2)\n26.2\nFHLB borrowing availability\n10.2\nFederal Reserve Bank borrowing availability through the discount window\n23.1\nTotal liquidity sources\n$\n68.5 \n____\n(1)  Includes small in transit items that may not yet be reflected in the Federal Reserve Bank master account closing balance. \n(2)  Unencumbered investment securities comprise securities that are eligible as collateral for secured transactions through market channels or are eligible to be pledged to the FHLB, the Federal Reserve discount window, or the Standing Repo Facility.\nThe balance with the Federal Reserve Bank is the primary component of the balance sheet line item “interest-bearing deposits in other banks.” At September 30, 2025, Regions had approximately $9.0 billion in cash on deposit with the Federal Reserve Bank and other depository institutions, an increase from approximately $7.8 billion at December 31, 2024. Refer to the \"Cash and Cash Equivalents\" section for more information.\nThe securities portfolio also serves as a primary source and storehouse of liquidity. Proceeds from maturities and principal and interest payments of securities provide a continual flow of funds available for cash needs (see Note 3 \"Debt Securities\" to the consolidated financial statements). Furthermore, the highly liquid nature of the available for sale securities portfolio (for example, the agency guaranteed MBS portfolio) can be readily used as a source of cash through various secured borrowing arrangements. Regions' securities portfolio consists of residential and commercial agency MBS, U.S. Treasury securities, federal agency securities, and corporate and other debt. In evaluating the liquidity within the securities portfolio, unencumbered investment securities are primarily comprised of U.S Treasury securities and residential and commercial agency MBS. Unencumbered investment securities also includes certain corporate bonds considered to be highly liquid and other securities.\nRegions’ financing arrangement with the FHLB adds additional flexibility in managing the Company's liquidity position. As of September 30, 2025, Regions had $1.3 billion in short-term FHLB borrowings, $1.5 billion in long-term FHLB borrowings, and had borrowing capacity as shown in Table 21. FHLB borrowing capacity was determined based on eligible securities and loan amounts, as of September 30, 2025, that were pledged as collateral for future borrowing capacity. Additionally, investment in FHLB stock is required in relation to the level of outstanding borrowings. The FHLB has been and is expected to continue to be a reliable and economical source of funding.\nRegions has additional borrowing availability with the Federal Reserve Bank through the discount window as shown in Table 21. Federal Reserve Bank borrowing capacity is determined based on eligible loan amounts that were pledged as collateral for future borrowing capacity. Also through the Federal Reserve Bank, Regions is an eligible Standing Repo Facility counterparty, which supplements Regions' available channels for monetizing unencumbered securities.\nRegions maintains a shelf registration statement with the SEC that can be utilized by Regions to issue various debt and/or equity securities. Additionally, Regions' Board has authorized Regions Bank to issue up to $10 billion in aggregate principal amount of bank notes outstanding at any one time. Refer to Note 11 \"Borrowed Funds\" to the consolidated financial statements in the 2024 Annual Report on Form 10-K for additional information. \nRegions may, from time to time, consider opportunistically retiring outstanding issued securities, including subordinated debt in privately negotiated or open market transactions for cash or common shares. Regulatory approval would be required for retirement of some instruments. See Note 6 \"Shareholders' Equity and Accumulated Other Comprehensive Income (Loss)\" to the consolidated financial statements for additional information. \nRegions' liquidity policy requires the holding company to maintain cash sufficient to cover the greater of (1) 18 months of debt service and other cash needs or (2) a minimum cash balance of $500 million. Cash and cash equivalents at the holding company exceeded minimums and totaled $1.0 billion at September 30, 2025. Overall liquidity risk limits are established by the \n74\nTable of Contents\n \nBoard through its Risk Appetite Statement and Liquidity Policy. The Company's Board, LROC and ALCO regularly review compliance with the established limits.\nINFORMATION SECURITY RISK\nRefer to Part 1 Item1C. \nCybersecurity\n in the Annual Report on Form 10-K for the year ended December 31, 2024 for further discussion of Regions' risk identification and assessment, risk management and governance of information security risk.\nPROVISION FOR CREDIT LOSSES\nThe provision for credit losses is used to maintain the allowance for loan losses and the reserve for unfunded credit losses at a level that management determines is appropriate to absorb expected credit losses over the contractual life of the loan and credit commitment portfolio at the balance sheet date. In the third quarter of 2025 and nine months ended September 30, 2025, the net charge-offs exceeded provision by $30 million and $16 million, respectively. In the third quarter of 2024, the net charge offs exceeded provision by $4 million and in the nine months ended September 30, 2024, the provision exceeded net charge-offs by $28 million. Refer to the \"Allowance\" section for further detail.\nNON-INTEREST INCOME\nTable 22—Non-Interest Income \n \nThree Months Ended September 30\nQuarter-to-Date Change 9/30/2025 vs. 9/30/2024\n \n2025\n2024\nAmount\nPercent\n \n(Dollars in millions)\nService charges on deposit accounts\n$\n160 \n$\n158 \n$\n2 \n1.3 \n%\nCard and ATM fees\n122 \n118 \n4 \n3.4 \n%\nInvestment management and trust fee income\n91 \n85 \n6 \n7.1 \n%\nCapital markets income\n104 \n92 \n12 \n13.0 \n%\nMortgage income\n38 \n36 \n2 \n5.6 \n%\nInvestment services fee income\n48 \n43 \n5 \n11.6 \n%\nCommercial credit fee income\n28 \n28 \n— \n— \n%\nBank-owned life insurance\n25 \n28 \n(3)\n(10.7)\n%\nMarket value adjustments on employee benefit assets\n12 \n13 \n(1)\n(7.7)\n%\nSecurities gains (losses), net\n(27)\n(78)\n51 \n65.4 \n%\nOther miscellaneous income\n58 \n49 \n9 \n18.4 \n%\n$\n659 \n$\n572 \n$\n87 \n15.2 \n%\n \nNine Months Ended September 30\nYear-to-Date Change 9/30/2025 vs. 9/30/2024\n \n2025\n2024\nAmount\nPercent\n(Dollars in millions)\nService charges on deposit accounts \n$\n472 \n$\n457 \n$\n15 \n3.3 \n%\nCard and ATM fees\n364 \n354 \n10 \n2.8 \n%\nInvestment management and trust fee income\n267 \n249 \n18 \n7.2 \n%\nCapital markets income\n267 \n251 \n16 \n6.4 \n%\nMortgage income\n126 \n111 \n15 \n13.5 \n%\nInvestment services fee income\n134 \n120 \n14 \n11.7 \n%\nCommercial credit fee income\n84 \n83 \n1 \n1.2 \n%\nBank-owned life insurance\n72 \n81 \n(9)\n(11.1)\n%\nMarket valuation adjustments on employee benefit assets\n25 \n30 \n(5)\n(16.7)\n%\nSecurities gains (losses), net\n(53)\n(178)\n125 \n70.2 \n%\nOther miscellaneous income\n137 \n122 \n15 \n12.3 \n%\n$\n1,895 \n$\n1,680 \n$\n215 \n12.8 \n%\nService Charges on Deposit Accounts\nService charges on deposit accounts include overdraft fees, treasury management fees and other customer transaction-related service charges. Service charges increased in both the third quarter and nine months ended September 30, 2025,  compared to the same periods in 2024, driven primarily by an increase in fees from treasury management services and overdraft fees.\nOn October 25, 2023, the Federal Reserve issued a proposal for public comment that, if finalized, would lower the maximum interchange fee that a large debit card issuer can receive for a debit card transaction. Under the proposed rule the \n75\nTable of Contents\n \nmaximum interchange fee would be subject to adjustments every other year based upon issuer cost data. The Company is continuing to monitor and evaluate the potential impact.\nOn December 12, 2024, the CFPB adopted a final rule that caps overdraft fees in line with a benchmark fee of $5 or an amount that covers an institution's costs and losses using a standard set forth in the rules. Alternatively, an institution can charge higher overdraft fees by complying with the standard regulatory requirements governing other loans, including credit cards. The final rule is currently scheduled to take effect on October 1, 2025. However, under the presidential memorandum entitled “Regulatory Freeze Pending Review,” rules with future effective dates may be re-evaluated. Therefore, though the Company will continue to monitor and evaluate potential impact, the nature and timing of future developments that may potentially impact this or other CFPB rules and proposals cannot be predicted. \nCapital Markets Income\nCapital markets income primarily relates to capital raising activities that include real estate placement, securities underwriting and placement, loan syndication, as well as foreign exchange, derivatives, merger and acquisition and other advisory services. Capital markets income increased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024, driven primarily by higher loan syndication revenue and commercial swap income. The third quarter of 2025 also benefited from higher merger and acquisition fees whereas these fees declined for the nine months ended September 30, 2025, compared to the same period in 2024, due to economic uncertainty in the first quarter of 2025 impacting the timing of transactions. The overall increases in both periods were partially offset by declines in real estate transactions.\nMortgage Income\nMortgage income is generated through the origination and servicing of residential mortgage loans for long-term investors and sales of residential mortgage loans in the secondary market. The increase in mortgage income for the nine months ended September 30, 2025 compared to the same period in 2024 was due primarily to favorable mortgage servicing rights valuation adjustments. The increase was partially offset by negative pipeline valuation adjustments. \nInvestment Services Fee Income\nInvestment services fee income represents income earned from investment advisory services. Investment services fee income increased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 due primarily to strong advisor production.\nBank-owned Life Insurance\nBank-owned life insurance income primarily represents income earned from the appreciation of the cash surrender value of insurance contracts held and the proceeds of insurance benefits. Bank-owned life insurance income decreased during the nine months ended September 30, 2025 compared to the same period in 2024 driven primarily by decreased insurance claim income.\nMarket Value Adjustments on Employee Benefit Assets\nMarket value adjustments on employee benefit assets are the reflection of market value variations related to assets held for certain employee benefits. The adjustments are offset in salaries and benefits and other non-interest expense.\nSecurities Gains (Losses), Net\nNet securities gains (losses) primarily result from the Company's asset/liability and capital management processes. In both 2025 and 2024, the Company executed debt securities repositionings by selling debt securities and reinvesting the proceeds at higher current market yields. See Table 1 \"Debt Securities\" for more information. \nOther Miscellaneous Income\nOther miscellaneous income includes net revenue from affordable housing, valuation adjustments to equity investments, fees from safe deposit boxes, check fees and other miscellaneous income. Net revenue from affordable housing includes actual gains and losses resulting from the sale of affordable housing investments, cash distributions from the investments and any related impairment charges. Other miscellaneous income increased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to increases in commercial leasing income. Other miscellaneous income for the nine months ended September 30, 2025 also benefitted from improvements in valuation adjustments on certain equity investments. \n76\nTable of Contents\n \nNON-INTEREST EXPENSE\nTable 23—Non-Interest Expense \n \nThree Months Ended September 30\nQuarter-to-Date Change 9/30/2025 vs. 9/30/2024\n \n2025\n2024\nAmount\nPercent\n \n(Dollars in millions)\nSalaries and employee benefits\n$\n671 \n$\n645 \n$\n26 \n4.0 \n%\nEquipment and software expense\n106 \n101 \n5 \n5.0 \n%\nNet occupancy expense\n72 \n69 \n3 \n4.3 \n%\nOutside services\n42 \n41 \n1 \n2.4 \n%\nMarketing\n28 \n28 \n— \n— \n%\nProfessional, legal and regulatory expenses\n30 \n21 \n9 \n42.9 \n%\nCredit/checkcard expenses\n15 \n14 \n1 \n7.1 \n%\nFDIC insurance assessments\n15 \n17 \n(2)\n(11.8)\n%\nVisa class B shares expense\n8 \n17 \n(9)\n(52.9)\n%\nOperational losses\n18 \n19 \n(1)\n(5.3)\n%\nBranch consolidation, property and equipment charges\n(5)\n— \n(5)\nNM\nOther miscellaneous expenses\n103 \n97 \n6 \n6.2 \n%\n$\n1,103 \n$\n1,069 \n$\n34 \n3.2 \n%\n \nNine Months Ended September 30\nYear-to-Date Change 9/30/2025 vs. 9/30/2024\n \n2025\n2024\nAmount\nPercent\n \n(Dollars in millions)\nSalaries and employee benefits\n$\n1,954 \n$\n1,912 \n$\n42 \n2.2 \n%\nEquipment and software expense\n309 \n302 \n7 \n2.3 \n%\nNet occupancy expense\n214 \n211 \n3 \n1.4 \n%\nOutside services\n121 \n120 \n1 \n0.8 \n%\nMarketing\n84 \n82 \n2 \n2.4 \n%\nProfessional, legal and regulatory expenses\n81 \n74 \n7 \n9.5 \n%\nCredit/checkcard expenses\n46 \n43 \n3 \n7.0 \n%\nFDIC insurance assessments\n55 \n89 \n(34)\n(38.2)\n%\nVisa class B shares expense\n19 \n26 \n(7)\n(26.9)\n%\nOperational losses\n44 \n79 \n(35)\n(44.3)\n%\nBranch consolidation, property and equipment charges\n(5)\n2 \n(7)\n(350.0)\n%\nOther miscellaneous expenses\n293 \n264 \n29 \n11.0 \n%\n$\n3,215 \n$\n3,204 \n$\n11 \n0.3 \n%\nSalaries and Employee Benefits\nSalaries and employee benefits consist of salaries, incentive compensation, long-term incentives, payroll taxes, and other employee benefits such as 401(k), pension, and medical, life and disability insurance, as well as, expenses from liabilities held for employee benefit purposes. Salaries and employee benefits increased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to higher base salaries from annual merit increases, higher production-based incentives, and increases in other benefits expense which was driven by higher medical expenses due to inflation. Also included in salaries and employee benefits expense are market valuations on employee benefits liabilities (mostly offset in non-interest revenue as shown in Table 22) which contributed to the increase in the third quarter of 2025 compared to 2024. Lastly, both the third quarter and nine months ended September 30, 2024, salaries and employee benefits expense benefitted from a decline in severance expense. Full-time equivalent headcount slightly increased to 19,675 at September 30, 2025 from 19,560 at September 30, 2024.\nProfessional, legal and regulatory expenses\nProfessional, legal, and regulatory expenses consist of amounts related to legal, consulting, other professional fees and regulatory charges. Professional, legal, and regulatory expenses increased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 primarily due to an increase in professional fees associated with core systems modernization. \nFDIC Insurance Assessments\nFDIC insurance assessments decreased in the nine months ended September 30, 2025 compared to the same periods in 2024 primarily resulting from updates to the special assessment which was initially recorded in 2023 due to bank failures. In the nine months ended September 30, 2024, the Company increased the special assessment accrual by $18 million based upon \n77\nTable of Contents\n \nrevised loss estimates related to the failures, which compares to a release in the special assessment of $3 million in nine months ended 2025. Contributing to the overall decrease was a reduction of the base assessment primarily due to higher unsecured debt, lower concentration risk, and improved credit metrics.\nVisa Class B shares Expense\nVisa class B shares expense is associated with previously sold shares. The Visa class B shares have restrictions tied to finalization of certain covered litigation. Visa class B shares expense decreased in the third quarter and nine months ended September 30, 2025 compared to the same periods in 2024 due to a lower escrow funding expense for the Company's proportionate share related to the ongoing covered litigation which totaled $5 million in the third quarter of 2025 compared to $14 million in the third quarter of 2024.\nOperational Losses\nOperational losses include losses related to fraud, execution, delivery and process management, and damage to physical assets. Operational losses decreased in the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to improvements in check fraud during the first nine months of 2025 as a result of effective countermeasures.\nBranch consolidation, property and equipment charges\nBranch consolidation, property and equipment charges include valuation adjustments related to owned branches when the decision to close them is made. Accelerated depreciation and lease write-off charges are recorded for leased branches through and at the actual branch close date. Branch consolidation, property and equipment charges also include costs related to occupancy optimization initiatives. Branch consolidation, property and equipment charges in the third quarter and nine months ended September 30, 2025 include a gain recognized on the disposition of a property in the third quarter of 2025.\nOther Miscellaneous Expenses\nOther miscellaneous expenses include expenses related to communications, postage, supplies, certain credit-related costs, foreclosed property expenses, mortgage repurchase costs, and other costs (benefits) related to employee benefit plans. Other miscellaneous expenses increased the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a contingent reserve release in the second quarter of 2024 related to a prior acquisition, which did not repeat.\nINCOME TAXES\nThe Company’s income tax expense for the three months ended September 30, 2025 was $139 million compared to $118 million for the three months ended September 30, 2024, resulting in effective tax rates of 19.7 percent and 19.4 percent, respectively. The Company’s income tax expense for the nine months ended September 30, 2025 was $413 million compared to $338 million for the nine months ended September 30, 2024, resulting in effective tax rates of 20.3 percent and 19.9 percent, respectively. \nThe effective tax rate is affected by many factors including, but not limited to, the level of pre-tax income, the mix of income between various tax jurisdictions with differing tax rates, enacted tax legislation, net tax benefits related to affordable housing investments, bank-owned life insurance income, tax-exempt interest and nondeductible expenses. In addition, the effective tax rate is affected by items that may occur in any given period but are not consistent from period-to-period, such as the termination of certain leveraged leases, share-based payments, valuation allowance changes and changes to UTBs. Accordingly, the comparability of the effective tax rate between periods may be impacted.\nAt September 30, 2025, the Company reported a net deferred tax asset of $254 million compared to $775 million at December 31, 2024. The decrease in the net deferred tax position primarily reflects the deferred tax effects associated with decreases in unrealized losses on securities available for sale and derivative instruments recognized during the period.\nOn July 4, 2025, the One Big Beautiful Bill Act passed into law. The Company has assessed the impacts of the statute to the consolidated financial statements and expects that such impacts will be immaterial.\n78\nTable of Contents"
}