{
  "source_file": "rjf-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nINDEX\n \nPAGE\nFactors affecting “forward-looking statements”\n50\nIntroduction\n50\nExecutive overview\n51\nReconciliation of non-GAAP financial measures to GAAP financial measures\n54\nNet interest analysis\n57\nResults of operations\nPrivate Client Group\n63\nCapital Markets\n67\nAsset Management\n68\nBank\n71\nOther\n73\nStatement of financial condition analysis\n74\nLiquidity and capital resources\n74\nRegulatory\n81\nCritical accounting estimates\n82\nAccounting standards update\n83\nRisk management\n83\n49\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nFACTORS AFFECTING “FORWARD-LOOKING STATEMENTS”\nCertain statements made in this Quarterly Report on Form 10-Q may constitute “forward-looking statements” under the Private Securities Litigation Reform Act of 1995.  Forward-looking statements include information concerning future strategic objectives, business prospects, anticipated savings, financial results (including expenses, earnings, liquidity, cash flow and capital expenditures), industry or market conditions (including changes in interest rates, inflation, and international trade policies), demand for and pricing of our products (including cash sweep and deposit offerings), anticipated timing and benefits of our acquisitions, and our level of success integrating acquired businesses, anticipated results of litigation, regulatory developments, and general economic conditions. In addition, words such as “believes,” “expects,” “anticipates,” “intends,” “plans,” “estimates,” “projects,” and future or conditional verbs such as “will,” “may,” “could,” “should,” and “would,” as well as any other statement that necessarily depends on future events, are intended to identify forward-looking statements.  Forward-looking statements are not guarantees, and they involve risks, uncertainties and assumptions.  Although we make such statements based on assumptions that we believe to be reasonable, there can be no assurance that actual results will not differ materially from those expressed in the forward-looking statements.  We caution investors not to rely unduly on any forward-looking statements and urge you to carefully consider the risks described in our filings with the Securities and Exchange Commission (the “SEC”) from time to time, including our most recent Annual Report on Form 10-K, subsequent Quarterly Report on Form 10-Q, and Current Reports on Form 8-K, which are available at www.raymondjames.com and the SEC’s website at www.sec.gov.  We expressly disclaim any obligation to update any forward-looking statement in the event it later turns out to be inaccurate, whether as a result of new information, future events, or otherwise.\nINTRODUCTION\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is intended to help the reader understand the results of our operations and financial condition.  This MD&A is provided as a supplement to, and should be read in conjunction with, our condensed consolidated financial statements and accompanying notes to condensed consolidated financial statements.  Where “NM” is used in various percentage change computations, the computed percentage change has been determined to be not meaningful.\nWe operate as a financial holding company and bank holding company.  Results in the businesses in which we operate are highly correlated to general economic conditions and, more specifically, to the direction of the U.S. equity and fixed income markets, changes in interest rates, market volatility, corporate and mortgage lending markets and commercial and residential credit trends.  Overall market conditions, economic, political and regulatory trends, and industry competition are among the factors which could affect us and which are unpredictable and beyond our control.  These factors affect the financial decisions made by market participants, including investors, borrowers, and competitors, impacting their level of participation in the financial markets.  These factors also impact the level of investment banking activity and asset valuations, which ultimately affect our business results.\n50\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nEXECUTIVE OVERVIEW\nSummary results of operations\n \nThree months ended June 30,\nNine months ended June 30,\n$ in millions, except per share amounts\n2025\n2024\n% change\n2025\n2024\n% change\nNet revenues\n$\n3,398\n \n$\n3,228 \n5 \n%\n$\n10,338\n \n$\n9,359 \n10 \n%\nCompensation, commissions and benefits expense\n$\n2,202\n \n$\n2,090 \n5 \n%\n$\n6,678\n \n$\n6,054 \n10 \n%\nNon-compensation expenses\n$\n633\n \n$\n494 \n28 \n%\n$\n1,677\n \n$\n1,422 \n18 \n%\nPre-tax income\n$\n563\n \n$\n644 \n(13)\n%\n$\n1,983\n \n$\n1,883 \n5 \n%\nNet income available to common shareholders\n$\n435\n \n$\n491 \n(11)\n%\n$\n1,527\n \n$\n1,462 \n4 \n%\nEarnings per common share – basic\n$\n2.16\n \n$\n2.37 \n(9)\n%\n$\n7.51\n \n$\n7.02 \n7 \n%\nEarnings per common share – diluted\n$\n2.12\n \n$\n2.31 \n(8)\n%\n$\n7.35\n \n$\n6.85 \n7 \n%\nNon-GAAP measures:\nAdjusted net income available to common shareholders\n (1)\n$\n449\n \n$\n508 \n(12)\n%\n$\n1,570\n \n$\n1,516 \n4 \n%\nAdjusted earnings per common share - diluted\n (1)\n$\n2.18\n \n$\n2.39 \n(9)\n%\n$\n7.55\n \n$\n7.10 \n6 \n%\nThree months ended June 30,\nNine months ended June 30,\nOther selected financial highlights\n2025\n2024\n2025\n2024\nPre-tax margin\n16.6\n \n%\n20.0 \n%\n19.2\n \n%\n20.1 \n%\nAdjusted pre-tax margin \n(1)\n17.1\n \n%\n20.7 \n%\n19.7\n \n%\n20.9 \n%\nReturn on common equity\n14.3\n \n%\n17.8 \n%\n17.1\n \n%\n18.2 \n%\nAdjusted return on common equity\n (1)\n14.8\n \n%\n18.4 \n%\n17.5\n \n%\n18.8 \n%\nReturn on tangible common equity\n (1)\n16.7\n \n%\n21.2 \n%\n19.9\n \n%\n21.8 \n%\nAdjusted return on tangible common equity\n (1)\n17.2\n \n%\n21.9 \n%\n20.5\n \n%\n22.5 \n%\nCompensation ratio\n64.8\n \n%\n64.7 \n%\n64.6\n \n%\n64.7 \n%\nAdjusted compensation ratio\n (1)\n64.5\n \n%\n64.4 \n%\n64.4\n \n%\n64.3 \n%\nEffective income tax rate\n22.6\n \n%\n23.6 \n%\n22.8\n \n%\n22.1 \n%\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nFor our fiscal third quarter of 2025, we generated net revenues of $3.40 billion, an increase of 5% compared with the prior-year quarter, while pre-tax income of $563 million decreased 13% compared with the prior-year quarter.  Our net income available to common shareholders was $435 million and our earnings per diluted share were $2.12, reflecting a decrease from the prior-year quarter levels of 11% and 8%, respectively.  Our annualized return on common equity (“ROCE”) for the quarter was 14.3%, compared with 17.8% for the prior-year quarter, and our annualized return on tangible common equity (“ROTCE”)\n \nwas 16.7%\n(1)\n, compared with 21.2%\n(1)\n for the prior-year quarter.  The results for the quarter were adversely impacted by a $58 million increase in expense associated with the settlement of a legal matter related to bond underwritings for a specific issuer sold to institutional investors between 2013 and 2015.\nExcluding the impact of $14 million of expenses, net of their tax effect, related to acquisitions completed in prior years, such as compensation expenses related to retention awards and amortization of identifiable intangible assets, our adjusted net income available to common shareholders was $449 million\n(1) \nfor the three months ended June 30, 2025, a decrease of 12% compared with adjusted net income available to common shareholders for the prior-year quarter.  Our adjusted earnings per diluted share were $2.18\n(1)\n, a decrease of 9% compared with the prior-year quarter.\n \n Adjusted annualized ROCE for the quarter was 14.8%\n(1)\n and adjusted annualized ROTCE\n \nwas 17.2%\n(1) \ncompared with adjusted annualized ROCE of 18.4%\n(1)\n and adjusted annualized ROTCE of 21.9%\n(1)\n for the prior-year quarter.\n(1)\nThese are non-GAAP financial measures.  Please see the “Reconciliation of non-GAAP financial measures to GAAP financial measures” in this MD&A for a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures, and for other important disclosures.\n51\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe increase in net revenues compared with the prior-year quarter was primarily due to higher asset management and related administrative fees largely the result of higher PCG client assets in fee-based accounts.  The increase in PCG client assets in fee-based accounts was primarily due to market appreciation and net new assets to the firm since the prior-year period.  Investment banking revenues increased 16% compared with the prior-year quarter primarily due to an increase in mergers & acquisition and advisory revenues, as well as increased underwriting revenues, although uncertain market conditions for transaction closings adversely impacted both periods.  Brokerage revenues also increased compared with the prior-year quarter.  Offsetting these increases was a decrease in combined net interest income and RJBDP fees from third‑party banks due to lower short-term interest rates and lower average RJBDP balances swept to third-party banks compared with the prior-year quarter, which more than offset a favorable impact from growth in average interest-earning assets.  \nCompensation, commissions and benefits expense increased 5%, resulting from an increase in compensable revenues, annual salary increases, and an increase in compensation costs to support our growth.  Our compensation ratio, or the ratio of compensation, commissions and benefits expense to net revenues, was 64.8%, and excluding acquisition-related compensation expenses, our adjusted compensation ratio was 64.5%\n(1)\n, both remaining relatively unchanged compared with the prior-year quarter.  \nNon-compensation expenses increased 28%, primarily due to higher provisions for legal and regulatory matters as the current quarter included the aforementioned $58 million expense increase related to the settlement of a legal matter.  Non-compensation expenses also increased due to a bank loan provision for credit losses of $15 million for the current quarter compared with a benefit of $10 million for the prior-year quarter, higher communications and information processing expenses resulting from continued investments in technology to benefit our advisors and their clients and to support our growth, and higher investment sub-advisory fees resulting from growth in assets under management in sub-advised programs.\nOur effective income tax rate was 22.6% for our fiscal third quarter of 2025, a decrease compared with the 23.6% effective income tax rate for the prior-year quarter, primarily due to higher non-taxable valuation gains on our corporate-owned life insurance policies recognized in the current quarter compared with the prior-year quarter.\nAs of June 30, 2025, our tier 1 leverage ratio was 13.1% and total capital ratio was 24.2% both well above regulatory capital requirements.  We also continue to have substantial liquidity with $2.35 billion of RJF corporate cash\n(2)\n as of June 30, 2025.  During the three months ended June 30, 2025, we repurchased 3.3 million shares of our common stock for $451 million at an average price of $137 per share under the Board of Directors’ common stock repurchase authorization, leaving $749 million available under the authorization as of June 30, 2025.  We believe our capital and liquidity levels allow us to invest in growth across our businesses and continue to be opportunistic in our deployment of capital.\n(1)\nThese are non-GAAP financial measures.  Please see the “Reconciliation of non-GAAP financial measures to GAAP financial measures” in this MD&A for a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures, and for other important disclosures.\n(2)\nThis amount includes cash on hand at the parent, as well as parent cash loaned to RJ&A, which RJ&A has invested on behalf of RJF in cash and cash equivalents or otherwise deployed in its normal business activities.  For additional information, please see the “Liquidity and capital resources - Sources of liquidity” section in this MD&A.\n52\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nFor the nine months ended June 30, 2025, we generated net revenues of $10.34 billion, an increase of 10% compared with the prior-year period, and pre-tax income of $1.98 billion, an increase of 5%.  Our net income available to common shareholders of $1.53 billion was 4% higher than the prior-year period and our earnings per diluted share were $7.35, reflecting a 7% increase.  Our annualized ROCE was 17.1%, down from 18.2% for the prior-year period, and our annualized ROTCE was 19.9%\n(1)\n, compared with 21.8%\n(1)\n for the prior-year period.  \nExcluding the impact of $43 million of expenses, net of their tax effect, related to acquisitions completed in prior years, adjusted net income available to common shareholders for the nine months ended June 30, 2025 was $1.57 billion\n(1)\n, an increase of 4% compared with adjusted net income available to common shareholders for the prior-year period.  Our adjusted earnings per diluted share were $7.55\n(1)\n, an increase of 6% compared with the prior-year period.\n \n Adjusted annualized ROCE was 17.5%\n(1)\n, compared with 18.8%\n(1)\n for the prior-year period, and adjusted annualized ROTCE\n \nwas 20.5%\n(1)\n, compared with 22.5%\n(1)\n for the prior-year period.\nThe increase in net revenues compared with the prior-year period was primarily due to higher asset management and related administrative fees, largely the result of higher PCG client assets in fee-based accounts at the beginning of each of the current-year quarterly billing periods compared with the prior-year billing periods.  The increase in PCG client assets in fee-based accounts resulted from net market appreciation and net new assets to the firm since the prior-year period.  Investment banking revenues also increased significantly compared with the prior-year period primarily due to more favorable market conditions at the beginning of our fiscal 2025.  Brokerage revenues also increased compared with the prior-year period largely due to an increase in client activity in both our PCG and Capital Markets segments.  Offsetting these increases was a decrease in combined net interest income and RJBDP fees from third‑party banks, due to lower short-term interest rates compared with the prior-year period and, to a lesser extent, lower RJBDP balances swept to third-party banks, which more than offset a favorable impact from growth in average interest-earning assets. \nCompensation, commissions and benefits expense increased 10%, primarily due to an increase in compensable revenues, an increase in compensation costs to support our growth, and annual salary increases.  Our compensation ratio was 64.6%, and excluding acquisition-related compensation expenses, our adjusted compensation ratio was 64.4%\n(1)\n, both remaining relatively unchanged compared with the prior-year period.\nNon-compensation expenses increased 18%, primarily due to higher legal and regulatory matters expenses as the current-year period included a net provision expense for legal and regulatory matters, including a $58 million expense increase associated with the aforementioned settlement of a legal matter while the prior-year period reflected a net reserve release.  Non-compensation expenses also increased due to higher communications and information processing expenses resulting from continued investments in technology to benefit our advisors and their clients and to support our growth, higher investment sub-advisory fees resulting from growth in assets under management in sub-advised programs, and higher business development expenses.  \nOur effective income tax rate was 22.8% for the nine months ended June 30, 2025, an increase from 22.1% for the prior-year period, primarily due to lower non-taxable valuation gains on our corporate-owned life insurance policies recognized in the current-year period compared with the prior-year period. \nDuring the nine months ended June 30, 2025, we repurchased 5.3 million shares of our common stock for $751 million at an average price of $141 per share under the Board of Directors’ common stock repurchase authorization.\n \n(1)\nROTCE, adjusted net income available to common shareholders, adjusted earnings per diluted share, adjusted annualized ROCE, adjusted annualized ROTCE, and adjusted compensation ratio are non-GAAP financial measures.  Please see the “Reconciliation of non-GAAP financial measures to GAAP financial measures” in this MD&A for a reconciliation of these non-GAAP financial measures to the most directly comparable GAAP measures, and for other important disclosures.\n53\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES TO GAAP FINANCIAL MEASURES\nWe utilize certain non-GAAP financial measures as additional measures to aid in, and enhance, the understanding of our financial results and related measures.  These non-GAAP financial measures have been separately identified in this document.  We believe certain of these non-GAAP financial measures provide useful information to management and investors by excluding certain material items that may not be indicative of our core operating results.  We utilize these non-GAAP financial measures in assessing the financial performance of the business, as they facilitate a comparison of current- and prior-period results.  We believe that ROTCE is meaningful to investors as it facilitates comparisons of our results to the results of other companies.\n \nIn the following tables, the tax effect of non-GAAP adjustments reflects the statutory rate associated with each non-GAAP item.  These non-GAAP financial measures should be considered in addition to, and not as a substitute for, measures of financial performance prepared in accordance with GAAP.  In addition, our non-GAAP financial measures may not be comparable to similarly titled non-GAAP financial measures of other companies.  The following tables provide a reconciliation of non-GAAP financial measures to the most directly comparable GAAP measures.\nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n2025\n2024\nNet income available to common shareholders\n$\n435\n \n$\n491 \n$\n1,527\n \n$\n1,462 \nNon-GAAP adjustments\n:\nExpenses related to acquisitions:\nCompensation, commissions and benefits\n — Acquisition-related retention\n9\n \n11 \n25\n \n33 \nCommunications and information processing\n—\n \n— \n—\n \n1 \nProfessional fees\n \n—\n \n1 \n2\n \n3 \nOther:\nAmortization of identifiable intangible assets \n10\n \n11 \n31\n \n33 \nAll other acquisition-related expenses\n \n—\n \n— \n—\n \n2 \nTotal “Other” expense\n10\n \n11 \n31\n \n35 \nTotal pre-tax impact of non-GAAP adjustments related to acquisitions\n19\n \n23 \n58\n \n72 \nTax effect of non-GAAP adjustments\n(5)\n(6)\n(15)\n(18)\nTotal non-GAAP adjustments, net of tax \n14\n \n17 \n43\n \n54 \nAdjusted net income available to common shareholders \n$\n449\n \n$\n508 \n$\n1,570\n \n$\n1,516 \nPre-tax income\n$\n563\n \n$\n644 \n$\n1,983\n \n$\n1,883 \nPre-tax impact of non-GAAP adjustments (as detailed above)\n19\n \n23 \n58\n \n72 \nAdjusted pre-tax income \n$\n582\n \n$\n667 \n$\n2,041\n \n$\n1,955 \nCompensation, commissions and benefits expense\n$\n2,202\n \n$\n2,090 \n$\n6,678\n \n$\n6,054 \nLess: Acquisition-related retention (as detailed above)\n9\n \n11 \n25\n \n33 \nAdjusted compensation, commissions and benefits expense \n$\n2,193\n \n$\n2,079 \n$\n6,653\n \n$\n6,021 \n54\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThree months ended June 30,\nNine months ended June 30,\n$ in millions, except per share amounts\n2025\n2024\n2025\n2024\nPre-tax margin\n16.6\n \n%\n20.0 \n%\n19.2\n \n%\n20.1 \n%\nLess the impact of non-GAAP adjustments on pre-tax margin\n:\nExpenses related to acquisitions:\nCompensation, commissions and benefits\n — Acquisition-related retention\n0.3\n \n%\n0.3 \n%\n0.2\n \n%\n0.4 \n%\nCommunications and information processing\n—\n \n%\n— \n%\n—\n \n%\n— \n%\nProfessional fees\n \n—\n \n%\n— \n%\n—\n \n%\n— \n%\nOther:\nAmortization of identifiable intangible assets\n0.2\n \n%\n0.4 \n%\n0.3\n \n%\n0.4 \n%\nAll other acquisition-related expenses\n—\n \n%\n— \n%\n—\n \n%\n— \n%\nTotal “Other” expense\n0.2\n \n%\n0.4 \n%\n0.3\n \n%\n0.4 \n%\nTotal pre-tax impact of non-GAAP adjustments related to acquisitions\n0.5\n \n%\n0.7 \n%\n0.5\n \n%\n0.8 \n%\nAdjusted pre-tax margin\n17.1\n \n%\n20.7 \n%\n19.7\n \n%\n20.9 \n%\nTotal compensation ratio\n64.8\n \n%\n64.7 \n%\n64.6\n \n%\n64.7 \n%\nLess the impact of non-GAAP adjustments on compensation ratio\n:\nAcquisition-related retention\n0.3\n \n%\n0.3 \n%\n0.2\n \n%\n0.4 \n%\nAdjusted total compensation ratio\n64.5\n \n%\n64.4 \n%\n64.4\n \n%\n64.3 \n%\nDiluted earnings per common share\n$\n2.12\n \n$\n2.31 \n$\n7.35\n \n$\n6.85 \nImpact of non-GAAP adjustments on diluted earnings per common share:\nExpenses related to acquisitions:\nCompensation, commissions and benefits\n — Acquisition-related retention\n0.04\n \n0.05 \n0.12\n \n0.15 \nCommunications and information processing\n—\n \n— \n—\n \n— \nProfessional fees\n—\n \n0.01 \n0.01\n \n0.01 \nOther:\nAmortization of identifiable intangible assets \n0.04\n \n0.05 \n0.14\n \n0.16 \nAll other acquisition-related expenses\n—\n \n— \n—\n \n0.01 \nTotal “Other” expense\n0.04\n \n0.05 \n0.14\n \n0.17 \nTotal pre-tax impact of non-GAAP adjustments related to acquisitions\n0.08\n \n0.11 \n0.27\n \n0.33 \nTax effect of non-GAAP adjustments\n(0.02)\n(0.03)\n(0.07)\n(0.08)\nTotal non-GAAP adjustments, net of tax\n0.06\n \n0.08 \n0.20\n \n0.25 \nAdjusted diluted earnings per common share\n$\n2.18\n \n$\n2.39 \n$\n7.55\n \n$\n7.10 \n55\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n2025\n2024\nAverage common equity\n$\n12,157\n \n$\n11,012 \n$\n11,938\n \n$\n10,717 \nImpact of non-GAAP adjustments on average common equity\n:\nExpenses related to acquisitions:\nCompensation, commissions and benefits\n — Acquisition-related retention\n5\n \n5 \n12\n \n17 \nCommunications and information processing\n—\n \n— \n—\n \n— \nProfessional fees\n—\n \n1 \n1\n \n2 \nOther:\nAmortization of identifiable intangible assets \n5\n \n5 \n16\n \n16 \nAll other acquisition-related expenses\n—\n \n— \n—\n \n1 \nTotal “Other” expense\n5\n \n5 \n16\n \n17 \nTotal pre-tax impact of non-GAAP adjustments related to acquisitions\n10\n \n11 \n29\n \n36 \nTax effect of non-GAAP adjustments\n(3)\n(3)\n(7)\n(9)\nTotal non-GAAP adjustments, net of tax\n7\n \n8 \n22\n \n27 \nAdjusted average common equity\n$\n12,164\n \n$\n11,020 \n$\n11,960\n \n$\n10,744 \nAverage common equity\n$\n12,157\n \n$\n11,012 \n$\n11,938\n \n$\n10,717 \nLess\n:\nAverage goodwill and identifiable intangible assets, net\n1,858\n \n1,889 \n1,865\n \n1,898 \nAverage deferred tax liabilities related to goodwill and identifiable intangible assets, net\n(142)\n(135)\n(140)\n(133)\nAverage tangible common equity\n$\n10,441\n \n$\n9,258 \n$\n10,213\n \n$\n8,952 \nImpact of non-GAAP adjustments on average tangible common equity:\nExpenses related to acquisitions:\nCompensation, commissions and benefits\n — Acquisition-related retention\n5\n \n5 \n12\n \n17 \nCommunications and information processing\n—\n \n— \n—\n \n— \nProfessional fees\n—\n \n1 \n1\n \n2 \nOther:\nAmortization of identifiable intangible assets \n5\n \n5 \n16\n \n16 \nAll other acquisition-related expenses\n—\n \n— \n—\n \n1 \nTotal “Other” expense\n5\n \n5 \n16\n \n17 \nTotal pre-tax impact of non-GAAP adjustments related to acquisitions\n10\n \n11 \n29\n \n36 \nTax effect of non-GAAP adjustments\n(3)\n(3)\n(7)\n(9)\nTotal non-GAAP adjustments, net of tax\n7\n \n8 \n22\n \n27 \nAdjusted average tangible common equity\n$\n10,448\n \n$\n9,266 \n$\n10,235\n \n$\n8,979 \nReturn on common equity\n14.3\n \n%\n17.8 \n%\n17.1\n \n%\n18.2 \n%\nAdjusted return on common equity\n14.8\n \n%\n18.4 \n%\n17.5\n \n%\n18.8 \n%\nReturn on tangible common equity\n16.7\n \n%\n21.2 \n%\n19.9\n \n%\n21.8 \n%\nAdjusted return on tangible common equity\n17.2\n \n%\n21.9 \n%\n20.5\n \n%\n22.5 \n%\n56\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nDiluted earnings per common share is computed by dividing net income available to common shareholders (less allocation of earnings and dividends to participating securities) by diluted weighted-average common shares outstanding for each respective period or, in the case of adjusted diluted earnings per common share, computed by dividing adjusted net income available to common shareholders (less allocation of earnings and dividends to participating securities) by diluted weighted-average common shares outstanding for each respective period. \nPre-tax margin is computed by dividing pre-tax income by net revenues for each respective period or, in the case of adjusted pre-tax margin, computed by dividing adjusted pre-tax income by net revenues for each respective period. \nTotal compensation ratio is computed by dividing compensation, commissions and benefits expense by net revenues for each respective period.  Adjusted total compensation ratio is computed by dividing adjusted compensation, commissions and benefits expense by net revenues for each respective period.\nTangible common equity is computed by subtracting goodwill and identifiable intangible assets, net, along with the associated deferred tax liabilities, from total common equity attributable to RJF.  Average common equity is computed by adding the total common equity attributable to RJF as of the date indicated to the prior quarter-end total, and dividing by two, or in the case of average tangible common equity, computed by adding tangible common equity as of the date indicated to the prior quarter-end total, and dividing by two.  Average common equity for the year-to-date period is computed by adding the total common equity attributable to RJF as of each quarter-end date during the indicated year-to-date period to the beginning of year total, and dividing by four, or in the case of average tangible common equity, computed by adding tangible common equity as of each quarter-end date during the indicated year-to-date period to the beginning of year total, and dividing by four.  Adjusted average common equity is computed by adjusting for the impact on average common equity of the non-GAAP adjustments, as applicable for each respective period.  Adjusted average tangible common equity is computed by adjusting for the impact on average tangible common equity of the non-GAAP adjustments, as applicable for each respective period.\nROCE is computed by dividing annualized net income available to common shareholders for the period indicated by average common equity for each respective period or, in the case of ROTCE, computed by dividing annualized net income available to common shareholders by average tangible common equity for each respective period.  Adjusted ROCE is computed by dividing annualized adjusted net income available to common shareholders by adjusted average common equity for each respective period, or in the case of adjusted ROTCE, computed by dividing annualized adjusted net income available to common shareholders by adjusted average tangible common equity for each respective period. \nNET INTEREST ANALYSIS\nThe Fed funds target rate began our fiscal 2024 at a range of 5.25% to 5.50% where it remained throughout most of our fiscal 2024.  In late September 2024, the Fed decreased the Fed funds target rate by 50 basis points, followed by two additional 25‑basis-point reductions during fiscal 2025 to end the current-year period at a range of 4.25% to 4.50%.  The Fed has indicated that it intends to closely monitor market conditions to determine whether it will consider making additional adjustments to short-term interest rates during the remainder of our fiscal 2025.  The following table details the Fed’s short-term interest rate activity since the beginning of our fiscal year 2024.\nRJF fiscal quarter ended\nEffective date of interest rate action\nIncrease/(decrease)\nin interest rates\n(in basis points)\nFed funds target rate\nSeptember 30, 2023\nJuly 27, 2023\n25\n5.25% - 5.50%\nSeptember 30, 2024\nSeptember 19, 2024\n(50)\n4.75% - 5.00%\nDecember 31, 2024\nNovember 8, 2024\n(25)\n4.50% - 4.75%\nDecember 31, 2024\nDecember 19, 2024\n(25)\n4.25% - 4.50%\nGiven the relationship between our interest-sensitive assets and liabilities (primarily held in our PCG, Bank, and Other segments) and the nature of fees we earn from third-party banks on client cash balances swept to such banks as part of the RJBDP (included in account and service fees), our financial results are sensitive to changes in interest rates.  Increases in short-term interest rates have historically resulted in an increase in our net earnings, and we expect decreases in short-term interest rates to generally reduce our net earnings, although there may be offsetting favorable impacts.  As it relates to our net interest income, the magnitude of the effect of a decrease in interest rates depends on a number of factors impacting balances, asset yields, and the cost of funding.  The magnitude of the impact to our net interest margin depends on the yields on interest-earning assets relative to the cost of interest-bearing liabilities, including deposit rates paid to clients on their cash balances.  \n57\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nDecreases in short-term interest rates generally result in a decrease to our RJBDP fees earned from third-party banks, although the magnitude of the impact may also be impacted by demand for cash balances by third-party banks and the rate paid to clients on their cash sweep balances.  Rates paid to clients on their cash balances are generally impacted by the level of short-term interest rates, as well as competitive industry dynamics and the demand for client cash.  Additionally, any future changes to regulatory rules or interpretations governing the fees the firm earns on cash sweep balances could also impact the rates we pay to clients on cash balances.  In recent fiscal years, we have sought to continue to meet client demand for higher yields on cash balances, without sacrificing the benefits of FDIC insurance on such balances, by introducing new deposit products leveraging our bank subsidiaries or through initiatives offered within the RJBDP.  Such programs include our ESP introduced to our clients in fiscal 2023 where such deposits are held by Raymond James Bank, offer enhanced rates, and offer FDIC coverage of up to $50 million for certain accounts, as well as initiatives offered from time to time within the RJBDP program which may offer enhanced rates to clients on certain balances within the program.  These programs, while meeting client needs and diversifying our funding sources, have a higher relative cost than other alternatives therefore reducing our net interest margin and yields on RJBDP balances.\nRefer to the discussion of our net interest income within the “Management’s Discussion and Analysis - Results of Operations” of our PCG, Bank, and Other segments, where applicable.  Also refer to “Management’s Discussion and Analysis - Results of Operations - Private Client Group - Clients’ domestic cash sweep balances” for further information on the RJBDP.\nNet interest income and RJBDP fees from third-party banks\n \nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nNet interest income\n$\n546\n \n$\n523 \n4 \n%\n$\n1,596\n \n$\n1,598 \n— \n%\nRJBDP fees from third-party banks\n110\n \n149 \n(26)\n%\n384\n \n461 \n(17)\n%\nNet interest income and RJBDP fees from third-party banks\n$\n656\n \n$\n672 \n(2)\n%\n$\n1,980\n \n$\n2,059 \n(4)\n%\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nCombined net interest income and RJBDP fees from third-party banks was $656 million and $672 million for the three months ended June 30, 2025 and 2024, respectively.  The 2% decline compared with the prior-year quarter was primarily due to lower short-term interest rates and lower average RJBDP balances swept to third-party banks, which more than offset favorable impacts from growth in average interest-earning assets and a slight increase in net interest margin.\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nCombined net interest income and RJBDP fees from third-party banks was $1.98 billion and $2.06 billion for the nine months ended June 30, 2025 and 2024, respectively. The 4% decline compared with the prior-year period was primarily due to lower short-term interest rates and, to a lesser extent, lower average RJBDP balances swept to third-party banks, which more than offset a favorable impact from growth in average interest-earning assets.\n58\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe following table presents our consolidated average interest-earning asset and interest-bearing liability balances, interest income and expense and the related rates.\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\n \nThree months ended June 30,\n \n2025\n2024\n$ in millions\nAverage\ndaily\nbalance\nInterest\nAnnualized \naverage \nrate\nAverage\ndaily\nbalance\nInterest\nAnnualized \naverage \nrate\nInterest-earning assets:\n \n \n \n \n \nBank segment:\nCash and cash equivalents\n$\n5,598\n$\n59\n4.24\n \n%\n$\n5,318\n$\n72\n5.38 \n%\nAvailable-for-sale securities\n7,980\n45\n2.27\n \n%\n9,791\n55\n2.28 \n%\nLoans held for sale and investment: \n(1) (2)\nLoans held for investment:\nSBL\n18,100\n \n276\n \n6.04\n \n%\n15,029 \n269 \n7.10 \n%\nC&I loans\n10,418\n \n172\n \n6.53\n \n%\n9,935 \n194 \n7.70 \n%\nCRE loans\n7,764\n \n126\n \n6.42\n \n%\n7,465 \n142 \n7.52 \n%\nREIT loans\n1,712\n \n30\n \n7.04\n \n%\n1,731 \n34 \n7.71 \n%\nResidential mortgage loans\n9,934\n \n98\n \n3.96\n \n%\n9,173 \n83 \n3.66 \n%\nTax-exempt loans \n(3)\n1,266\n \n9\n \n3.39\n \n%\n1,439 \n10 \n3.34 \n%\nLoans held for sale\n255\n \n4\n \n6.98\n \n%\n234 \n4 \n7.77 \n%\nTotal loans held for sale and investment\n49,449\n \n715\n \n5.76\n \n%\n45,006 \n736 \n6.51 \n%\nAll other interest-earning assets\n231\n \n4\n \n5.27\n \n%\n227 \n4 \n5.95 \n%\nInterest-earning assets — Bank segment\n$\n63,258\n \n$\n823\n \n5.18\n \n%\n$\n60,342 \n$\n867 \n5.72 \n%\nAll other segments:\nCash and cash equivalents\n$\n4,152\n \n$\n44\n \n4.24\n \n%\n$\n3,311 \n$\n49 \n5.99 \n%\nAssets segregated for regulatory purposes and restricted cash\n3,628\n \n36\n \n3.95\n \n%\n3,624 \n46 \n5.08 \n%\nTrading assets — debt securities\n1,335\n \n19\n \n5.73\n \n%\n1,425 \n20 \n5.83 \n%\nBrokerage client receivables\n2,427\n \n42\n \n6.97\n \n%\n2,370 \n48 \n8.13 \n%\nAll other interest-earning assets\n2,535\n \n26\n \n3.93\n \n%\n2,426 \n27 \n4.24 \n%\nInterest-earning assets — all other segments\n$\n14,077\n \n$\n167\n \n4.72\n \n%\n$\n13,156 \n$\n190 \n5.78 \n%\nTotal interest-earning assets\n$\n77,335\n \n$\n990\n \n5.10\n \n%\n$\n73,498 \n$\n1,057 \n5.73 \n%\nInterest-bearing liabilities:\n \n \nBank segment:\nBank deposits:\nMoney market and savings accounts\n$\n33,814\n \n$\n146\n \n1.73\n \n%\n$\n31,232 \n$\n173 \n2.24 \n%\nInterest-bearing demand deposits\n21,246\n \n213\n \n4.03\n \n%\n20,261 \n250 \n4.95 \n%\nCertificates of deposit\n1,763\n \n19\n \n4.34\n \n%\n2,491 \n30 \n4.81 \n%\nTotal bank deposits \n(4)\n56,823\n \n378\n \n2.67\n \n%\n53,984 \n453 \n3.38 \n%\nFHLB advances and all other interest-bearing liabilities\n847\n \n5\n \n2.79\n \n%\n1,189 \n8 \n2.90 \n%\nInterest-bearing liabilities — Bank segment\n$\n57,670\n \n$\n383\n \n2.67\n \n%\n$\n55,173 \n$\n461 \n3.37 \n%\nAll other segments:\nTrading liabilities — debt securities\n$\n818\n \n$\n11\n \n5.35\n \n%\n$\n862 \n$\n11 \n5.22 \n%\nBrokerage client payables\n4,882\n \n15\n \n1.24\n \n%\n4,558 \n22 \n1.93 \n%\nSenior notes payable\n2,040\n \n23\n \n4.50\n \n%\n2,039 \n23 \n4.50 \n%\nAll other interest-bearing liabilities \n(4)\n1,272\n \n12\n \n3.83\n \n%\n1,522 \n17 \n4.42 \n%\nInterest-bearing liabilities — all other segments\n$\n9,012\n \n$\n61\n \n2.72\n \n%\n$\n8,981 \n$\n73 \n3.25 \n%\nTotal interest-bearing liabilities\n$\n66,682\n \n$\n444\n \n2.68\n \n%\n$\n64,154 \n$\n534 \n3.35 \n%\nFirmwide net interest income\n$\n546\n \n$\n523 \nNet interest margin (net yield on interest-earning assets)\nBank segment\n2.74\n \n%\n2.64 \n%\nFirmwide\n2.83\n \n%\n2.86 \n%\n(1)\nLoans are presented net of unamortized purchase discounts or premiums, unearned income, deferred origination fees and costs, and charge-offs.\n(2)\nNonaccrual loans are included in the average loan balances.  Any payments received for corporate nonaccrual loans are applied entirely to principal.  Interest income on residential mortgage nonaccrual loans is recognized on a cash basis.\n(3)\nThe average rate on tax-exempt loans in the preceding table is presented on a taxable-equivalent basis utilizing the applicable federal statutory rates for each of the periods presented. \n(4)\nThe average balance, interest expense, and average rate for “Total bank deposits” included amounts associated with affiliate deposits.  Such amounts are eliminated in consolidation and are offset in “All other interest-bearing liabilities” under “All other segments.”\n59\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nIncreases and decreases in interest income and interest expense result from changes in average balances (volume) of interest-earning assets and interest-bearing liabilities, as well as changes in average interest rates.  The following table shows the effect that these factors had on the interest earned on our interest-earning assets and the interest incurred on our interest-bearing liabilities.  The effect of changes in volume is determined by multiplying the change in volume by the previous period’s average rate.  Similarly, the effect of rate changes is calculated by multiplying the change in average rate by the previous period’s volume.  Changes attributable to both volume and rate have been allocated proportionately.\nThree months ended June 30,\n2025 compared to 2024\n \nIncrease/(decrease) due to\n$ in millions\nVolume\nRate\nTotal\nInterest-earning assets:\nInterest income\nBank segment:\n \n \n \nCash and cash equivalents\n$\n3\n \n$\n(16)\n$\n(13)\nAvailable-for-sale securities\n(10)\n—\n \n(10)\nLoans held for sale and investment:\nLoans held for investment:\nSBL\n47\n \n(40)\n7\n \nC&I loans\n8\n \n(30)\n(22)\nCRE loans\n6\n \n(22)\n(16)\nREIT loans\n—\n \n(4)\n(4)\nResidential mortgage loans\n8\n \n7\n \n15\n \nTax-exempt loans\n(1)\n—\n \n(1)\nLoans held for sale\n—\n \n—\n \n—\n \nTotal loans held for sale and investment\n68\n \n(89)\n(21)\nAll other interest-earning assets\n—\n \n—\n \n—\n \nInterest-earning assets — Bank segment\n$\n61\n \n$\n(105)\n$\n(44)\nAll other segments:\nCash and cash equivalents\n$\n9\n \n$\n(14)\n$\n(5)\nAssets segregated for regulatory purposes and restricted cash\n—\n \n(10)\n(10)\nTrading assets — debt securities\n(1)\n—\n \n(1)\nBrokerage client receivables\n1\n \n(7)\n(6)\nAll other interest-earning assets\n1\n \n(2)\n(1)\nInterest-earning assets — all other segments\n$\n10\n \n$\n(33)\n$\n(23)\nTotal interest-earning assets\n$\n71\n \n$\n(138)\n$\n(67)\n \n \n \nInterest-bearing liabilities:\nInterest expense\nBank segment:\nBank deposits:\nMoney market and savings accounts\n$\n13\n \n$\n(40)\n$\n(27)\nInterest-bearing demand deposits\n11\n \n(48)\n(37)\nCertificates of deposit\n(8)\n(3)\n(11)\nTotal bank deposits\n16\n \n(91)\n(75)\nFHLB advances and all other interest-bearing liabilities\n(3)\n—\n \n(3)\nInterest-bearing liabilities — Bank segment\n$\n13\n \n$\n(91)\n$\n(78)\nAll other segments:\nTrading liabilities — debt securities\n$\n—\n \n$\n—\n \n$\n—\n \nBrokerage client payables\n2\n \n(9)\n(7)\nSenior notes payable\n—\n \n—\n \n—\n \nAll other interest-bearing liabilities\n(3)\n(2)\n(5)\nInterest-bearing liabilities — all other segments\n$\n(1)\n$\n(11)\n$\n(12)\nTotal interest-bearing liabilities\n$\n12\n \n$\n(102)\n$\n(90)\nChange in firmwide net interest income\n$\n59\n \n$\n(36)\n$\n23\n \n60\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\n \nNine months ended June 30,\n \n2025\n2024\n$ in millions\nAverage\ndaily\nbalance\nInterest\nAnnualized \naverage \nrate\nAverage\ndaily\nbalance\nInterest\nAnnualized \naverage \nrate\nInterest-earning assets:\nBank segment:\nCash and cash equivalents\n$\n5,960\n$\n197\n4.40\n \n%\n$\n5,699\n$\n232\n5.40 \n%\nAvailable-for-sale securities\n8,363\n142\n2.27\n \n%\n10,069\n167\n2.22 \n%\nLoans held for sale and investment: \n(1) (2)\nLoans held for investment:\nSBL\n17,229\n \n806\n \n6.17\n \n%\n14,721 \n798 \n7.12 \n%\nC&I loans\n10,305\n \n518\n \n6.64\n \n%\n10,265 \n597 \n7.64 \n%\nCRE loans\n7,668\n \n385\n \n6.62\n \n%\n7,365 \n423 \n7.55 \n%\nREIT loans\n1,692\n \n91\n \n7.13\n \n%\n1,704 \n100 \n7.71 \n%\nResidential mortgage loans\n9,733\n \n285\n \n3.90\n \n%\n8,972 \n240 \n3.57 \n%\nTax-exempt loans \n(3)\n1,283\n \n26\n \n3.37\n \n%\n1,443 \n29 \n3.28 \n%\nLoans held for sale\n232\n \n12\n \n6.96\n \n%\n180 \n10 \n8.15 \n%\nTotal loans held for sale and investment\n48,142\n \n2,123\n \n5.85\n \n%\n44,650 \n2,197 \n6.50 \n%\nAll other interest-earning assets\n237\n \n10\n \n5.39\n \n%\n235 \n11 \n6.10 \n%\nInterest-earning assets — Bank segment\n$\n62,702\n \n$\n2,472\n \n5.23\n \n%\n$\n60,653 \n$\n2,607 \n5.68 \n%\nAll other segments:\nCash and cash equivalents\n$\n4,076\n \n$\n134\n \n4.40\n \n%\n$\n3,292 \n$\n149 \n6.04 \n%\nAssets segregated for regulatory purposes and restricted cash\n3,571\n \n114\n \n4.24\n \n%\n3,634 \n140 \n5.15 \n%\nTrading assets — debt securities\n1,387\n \n57\n \n5.47\n \n%\n1,251 \n54 \n5.80 \n%\nBrokerage client receivables\n2,402\n \n128\n \n7.15\n \n%\n2,266 \n140 \n8.22 \n%\nAll other interest-earning assets\n2,531\n \n75\n \n3.88\n \n%\n2,265 \n69 \n3.89 \n%\nInterest-earning assets — all other segments\n$\n13,967\n \n$\n508\n \n4.84\n \n%\n$\n12,708 \n$\n552 \n5.77 \n%\nTotal interest-earning assets\n$\n76,669\n \n$\n2,980\n \n5.16\n \n%\n$\n73,361 \n$\n3,159 \n5.70 \n%\nInterest-bearing liabilities:\nBank segment:\nBank deposits:\nMoney market and savings accounts\n$\n33,088\n \n$\n458\n \n1.85\n \n%\n$\n31,459 \n$\n497 \n2.11 \n%\nInterest-bearing demand deposits\n21,013\n \n650\n \n4.14\n \n%\n20,206 \n747 \n4.94 \n%\nCertificates of deposit\n2,094\n \n71\n \n4.52\n \n%\n2,642 \n92 \n4.64 \n%\nTotal bank deposits \n(4)\n56,195\n \n1,179\n \n2.81\n \n%\n54,307 \n1,336 \n3.29 \n%\nFHLB advances and all other interest-bearing liabilities\n1,001\n \n20\n \n2.72\n \n%\n1,201 \n26 \n2.92 \n%\nInterest-bearing liabilities — Bank segment\n$\n57,196\n \n$\n1,199\n \n2.81\n \n%\n$\n55,508 \n$\n1,362 \n3.28 \n%\nAll other segments:\nTrading liabilities — debt securities\n$\n834\n \n$\n32\n \n5.17\n \n%\n$\n806 \n$\n33 \n5.46 \n%\nBrokerage client payables\n4,794\n \n52\n \n1.44\n \n%\n4,688 \n63 \n1.78 \n%\nSenior notes payable\n2,040\n \n69\n \n4.50\n \n%\n2,039 \n69 \n4.50 \n%\nAll other interest-bearing liabilities \n(4)\n1,182\n \n32\n \n3.62\n \n%\n1,134 \n34 \n4.00 \n%\nInterest-bearing liabilities — all other segments\n$\n8,850\n \n$\n185\n \n2.79\n \n%\n$\n8,667 \n$\n199 \n3.05 \n%\nTotal interest-bearing liabilities\n$\n66,046\n \n$\n1,384\n \n2.81\n \n%\n$\n64,175 \n$\n1,561 \n3.25 \n%\nFirmwide net interest income\n$\n1,596\n \n$\n1,598 \nNet interest margin (net yield on interest-earning assets)\nBank segment\n2.67\n \n%\n2.68 \n%\nFirmwide\n2.78\n \n%\n2.91 \n%\n(1)\nLoans are presented net of unamortized discounts, unearned income, deferred loan fees and costs, and charge-offs.\n(2)\nNonaccrual loans are included in the average loan balances.  Any payments received for corporate nonaccrual loans are applied entirely to principal.  Interest income on residential mortgage nonaccrual loans is recognized on a cash basis.\n(3)\nThe average rate on tax-exempt loans in the preceding table is presented on a taxable-equivalent basis utilizing the applicable federal statutory rates for each of the years presented.\n(4)\nThe average balance, interest expense, and average rate for “Total bank deposits” included amounts associated with affiliate deposits.  Such amounts are eliminated in consolidation and are offset in “All other interest-bearing liabilities” under “All other segments.”\n61\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nIncreases and decreases in interest income and interest expense result from changes in average balances (volume) of interest-earning assets and interest-bearing liabilities, as well as changes in average interest rates.  The following table shows the effect that these factors had on the interest earned on our interest-earning assets and the interest incurred on our interest-bearing liabilities.  The effect of changes in volume is determined by multiplying the change in volume by the previous period’s average yield/cost.  Similarly, the effect of rate changes is calculated by multiplying the change in average yield/cost by the previous period’s volume.  Changes attributable to both volume and rate have been allocated proportionately.\nNine months ended June 30,\n2025 compared to 2024\n \nIncrease/(decrease) due to\n$ in millions\nVolume\nRate\nTotal\nInterest-earning assets:\nInterest income\nBank segment:\nCash and cash equivalents\n$\n10\n \n$\n(45)\n$\n(35)\nAvailable-for-sale securities\n(29)\n4\n \n(25)\nLoans held for sale and investment:\nLoans held for investment:\nSBL\n113\n \n(105)\n8\n \nC&I loans\n2\n \n(81)\n(79)\nCRE loans\n15\n \n(53)\n(38)\nREIT loans\n(1)\n(8)\n(9)\nResidential mortgage loans\n21\n \n24\n \n45\n \nTax-exempt loans\n(4)\n1\n \n(3)\nLoans held for sale\n4\n \n(2)\n2\n \nTotal loans held for sale and investment\n150\n \n(224)\n(74)\nAll other interest-earning assets\n—\n \n(1)\n(1)\nInterest-earning assets — Bank segment\n$\n131\n \n$\n(266)\n$\n(135)\nAll other segments:\nCash and cash equivalents\n$\n26\n \n$\n(41)\n$\n(15)\nAssets segregated for regulatory purposes and restricted cash\n(2)\n(24)\n(26)\nTrading assets — debt securities\n6\n \n(3)\n3\n \nBrokerage client receivables\n6\n \n(18)\n(12)\nAll other interest-earning assets\n6\n \n—\n \n6\n \nInterest-earning assets — all other segments\n$\n42\n \n$\n(86)\n$\n(44)\nTotal interest-earning assets\n$\n173\n \n$\n(352)\n$\n(179)\nInterest-bearing liabilities:\nInterest expense\nBank segment:\nBank deposits:\nMoney market and savings accounts\n$\n23\n \n$\n(62)\n$\n(39)\nInterest-bearing demand deposits\n28\n \n(125)\n(97)\nCertificates of deposit\n(19)\n(2)\n(21)\nTotal bank deposits\n32\n \n(189)\n(157)\nFHLB advances and all other interest-bearing liabilities\n(4)\n(2)\n(6)\nInterest-bearing liabilities — Bank segment\n$\n28\n \n$\n(191)\n$\n(163)\nAll other segments:\nTrading liabilities — debt securities\n$\n1\n \n$\n(2)\n$\n(1)\nBrokerage client payables\n1\n \n(12)\n(11)\nSenior notes payable\n—\n \n—\n \n—\n \nAll other interest-bearing liabilities\n1\n \n(3)\n(2)\nInterest-bearing liabilities — all other segments\n$\n3\n \n$\n(17)\n$\n(14)\nTotal interest-bearing liabilities\n$\n31\n \n$\n(208)\n$\n(177)\nChange in firmwide net interest income\n$\n142\n \n$\n(144)\n$\n(2)\n62\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\n \nRESULTS OF OPERATIONS – PRIVATE CLIENT GROUP\nFor an overview of our PCG segment operations, as well as a description of the key factors impacting our PCG results of operations, refer to the information presented in “Item 1 - Business” and “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K.\nOperating results\n \nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\n \n \n \nAsset management and related administrative fees\n$\n1,462\n \n$\n1,364 \n7 \n%\n$\n4,395\n \n$\n3,838 \n15 \n%\nBrokerage revenues:\nMutual and other fund products\n146\n \n142 \n3 \n%\n450\n \n419 \n7 \n%\nInsurance and annuity products\n129\n \n130 \n(1)\n%\n364\n \n382 \n(5)\n%\nEquities, ETFs and fixed income products\n145\n \n137 \n6 \n%\n458\n \n397 \n15 \n%\nTotal brokerage revenues\n420\n \n409 \n3 \n%\n1,272\n \n1,198 \n6 \n%\nAccount and service fees:\nMutual fund and annuity service fees\n126\n \n118 \n7 \n%\n382\n \n339 \n13 \n%\nRJBDP fees:\nBank segment\n193\n \n198 \n(3)\n%\n563\n \n627 \n(10)\n%\nThird-party banks\n110\n \n149 \n(26)\n%\n384\n \n461 \n(17)\n%\nClient account and other fees\n72\n \n66 \n9 \n%\n208\n \n195 \n7 \n%\nTotal account and service fees\n501\n \n531 \n(6)\n%\n1,537\n \n1,622 \n(5)\n%\nInvestment banking\n9\n \n10 \n(10)\n%\n26\n \n29 \n(10)\n%\nInterest income \n(1)\n114\n \n121 \n(6)\n%\n350\n \n361 \n(3)\n%\nAll other\n5\n \n13 \n(62)\n%\n16\n \n23 \n(30)\n%\nTotal revenues\n2,511\n \n2,448 \n3 \n%\n7,596\n \n7,071 \n7 \n%\nInterest expense\n(23)\n(32)\n(28)\n%\n(74)\n(88)\n(16)\n%\nNet revenues\n2,488\n \n2,416 \n3 \n%\n7,522\n \n6,983 \n8 \n%\nNon-interest expenses:\n \n \n \n \nFinancial advisor compensation and benefits\n1,414\n \n1,327 \n7 \n%\n4,238\n \n3,790 \n12 \n%\nAdministrative compensation and benefits\n389\n \n389 \n— \n%\n1,195\n \n1,159 \n3 \n%\nTotal compensation, commissions and benefits\n1,803\n \n1,716 \n5 \n%\n5,433\n \n4,949 \n10 \n%\nNon-compensation expenses:\nCommunications and information processing\n119\n \n106 \n12 \n%\n347\n \n303 \n15 \n%\nOccupancy and equipment\n58\n \n57 \n2 \n%\n169\n \n168 \n1 \n%\nBusiness development\n48\n \n49 \n(2)\n%\n130\n \n126 \n3 \n%\nProfessional fees\n16\n \n16 \n— \n%\n47\n \n47 \n— \n%\nAll other\n33\n \n31 \n6 \n%\n92\n \n66 \n39 \n%\nTotal non-compensation expenses\n274\n \n259 \n6 \n%\n785\n \n710 \n11 \n%\nTotal non-interest expenses\n2,077\n \n1,975 \n5 \n%\n6,218\n \n5,659 \n10 \n%\nPre-tax income\n$\n411\n \n$\n441 \n(7)\n%\n$\n1,304\n \n$\n1,324 \n(2)\n%\n(1)\nEffective October 1, 2024, we updated our methodology for allocating interest income on certain cash balances to our segments, resulting in a reallocation of interest income from the Other segment to the PCG segment.  Prior-period segment results have not been conformed to the current-period presentation. \n63\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nSelected key metrics\nPCG client asset balances\nAs of\n$ in billions\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nJune 30,\n2024\nAssets under administration (“AUA”)\n$\n1,574.2\n \n$\n1,475.5 \n$\n1,491.8 \n$\n1,507.0 \n$\n1,415.7 \nAssets in fee-based accounts \n(1)\n$\n943.9\n \n$\n872.8 \n$\n876.6 \n$\n875.2 \n$\n820.6 \nPercent of AUA in fee-based accounts\n60.0\n \n%\n59.2 \n%\n58.8 \n%\n58.1 \n%\n58.0 \n%\n(1)\nA portion of our “Assets in fee-based accounts” is invested in “managed programs” overseen by our Asset Management segment, specifically our Asset Management Services division of RJ&A (“AMS”).  These assets are included in our financial assets under management as disclosed in the “Selected key metrics” section of our “Management’s Discussion and Analysis - Results of Operations - Asset Management.”\nAs of June 30, 2025, March 31, 2025, and June 30, 2024 PCG AUA included assets associated with firms affiliated with us through our RIA and custody services (“RCS”) division of $201.6 billion, $185.6 billion, and $167.2 billion, respectively, of which $173.9 billion, $158.5 billion, and $140.6 billion, respectively, were assets in fee-based accounts.  Based on the nature of the services provided to such firms, revenues related to these assets in the PCG segment are included in “Account and service fees.”  The growth in RCS client assets over time is partially due to transfers into RCS from our other financial advisor channels.  We may continue to experience transfers to our RCS division; however, consistent with our experience in recent fiscal years, we would not expect these financial advisor transfers to significantly impact our results of operations. \nDomestic PCG net new assets \nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n2025\n2024\nDomestic PCG net new assets \n(1)\n$\n11,651\n \n$\n16,517 \n$\n34,501\n \n$\n47,740 \nDomestic PCG net new assets growth - annualized\n (2)\n3.4\n \n%\n5.2 \n%\n3.3\n \n%\n5.8 \n%\n(1)\nDomestic PCG net new assets represents domestic PCG client inflows, including dividends and interest, less domestic PCG client outflows, including commissions, advisory fees, and other fees.\n(2)\nThe Domestic PCG net new asset growth - annualized percentage is based on the beginning Domestic PCG AUA balance for the indicated period. \nPCG AUA and PCG assets in fee-based accounts as of June 30, 2025 increased 7% and 8%, respectively, compared with March 31, 2025, and increased 11% and 15%, respectively, compared with June 30, 2024 due to market-driven appreciation and net new assets, reflecting the favorable impact of our advisor recruiting and retention.  PCG assets in fee-based accounts continued to be a significant percentage of overall PCG AUA due to many clients’ preference for fee-based alternatives versus transaction-based accounts and, as a result, a significant portion of our PCG revenues is directly impacted by market movements.\nFee-based accounts within our PCG segment are comprised of a wide array of products and programs that we offer our clients.  The majority of assets in fee-based accounts within our PCG segment are invested in programs for which our financial advisors provide investment advisory services, either on a discretionary or non-discretionary basis.  Administrative services for such accounts (e.g., record-keeping) are generally performed by our Asset Management segment and, as a result, a portion of the related revenue is shared with the Asset Management segment.\nWe also offer our clients fee-based accounts that are invested in “Managed programs” overseen by AMS, which is part of our Asset Management segment.  Fee-billable assets invested in managed programs are included in both “Assets in fee-based accounts” in the preceding table and “Financial assets under management” in the Asset Management segment.  Revenues related to managed programs are shared by our PCG and Asset Management segments.  The Asset Management segment receives a higher portion of the revenues related to accounts invested in managed programs, as compared to the portion received for non-managed programs, as it is performing portfolio management services in addition to administrative services.\nThe vast majority of the revenues we earn from fee-based accounts are recorded in “Asset management and related administrative fees” on our Condensed Consolidated Statements of Income and Comprehensive Income.  Fees received from such accounts are based on the value of client assets in fee-based accounts and vary based on the specific account types in which the client invests and the level of assets in the client relationship.  As fees for the majority of such accounts are billed based on balances as of the beginning of the quarter, revenues from fee-based accounts may not be immediately affected by changes in asset values, but rather the impacts are seen in the following quarter.  \n64\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nClients’ domestic cash sweep balances and ESP balances\nAs of\n$ in millions\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nJune 30,\n2024\nRJBDP:\nBank segment\n$\n26,635\n \n$\n25,783 \n$\n23,946 \n$\n23,978 \n$\n23,371 \nThird-party banks\n13,878\n \n16,813 \n20,341 \n18,226 \n17,325 \nSubtotal RJBDP\n40,513\n \n42,596 \n44,287 \n42,204 \n40,696 \nClient Interest Program (“CIP”)\n1,640\n \n1,656 \n1,664 \n1,653 \n1,713 \nTotal clients’ domestic cash sweep balances\n42,153\n \n44,252 \n45,951 \n43,857 \n42,409 \nESP\n13,027\n \n13,507 \n13,785 \n14,018 \n14,039 \nTotal clients’ domestic cash sweep and ESP balances\n$\n55,180\n \n$\n57,759 \n$\n59,736 \n$\n57,875 \n$\n56,448 \n \nThree months ended June 30,\nNine months ended June 30,\n2025\n2024\n2025\n2024\nAverage yield on RJBDP - third-party banks\n2.96\n \n%\n3.41 \n%\n3.03\n \n%\n3.55 \n%\nA portion of our domestic clients’ cash is included in the RJBDP, a multi-bank sweep program in which clients’ cash deposits in their brokerage accounts are swept into interest-bearing deposit accounts at either of our bank subsidiaries, which are included in our Bank segment, or various third-party banks.  Balances swept to third-party banks are not reflected on our Condensed Consolidated Statements of Financial Condition.  Our PCG segment earns servicing fees for the administrative services we provide related to our clients’ deposits that are swept to banks as part of the RJBDP.  These servicing fees are variable in nature and fluctuate based on client cash balances in the program, as well as the level of short-term interest rates and the interest paid to clients on balances in the RJBDP.  Under our intersegment policies, the PCG segment receives from our Bank segment the greater of a base servicing fee or a net yield equivalent to the average yield that the firm would otherwise receive from third-party banks in the RJBDP.  In the current interest-rate environment the PCG segment RJBDP fee revenues are derived from the yield from third-party banks in the program and the Bank segment RJBDP servicing costs reflect such market rate for the deposits.  The fees that the PCG segment earns from the Bank segment, as well as the servicing costs incurred on the deposits in the Bank segment, are eliminated in consolidation.  See “Management’s Discussion and Analysis - Net interest analysis” for further information regarding factors impacting the servicing fees we receive related to the RJBDP, as well as the interest paid to clients on their cash balances.\nThe “Average yield on RJBDP - third-party banks” in the preceding table is computed by dividing annualized RJBDP fees from third-party banks, which are net of the interest expense paid to clients by the third-party banks, by the average daily RJBDP balances at third-party banks.  The average yield on RJBDP - third-party banks for the three and nine months ended June 30, 2025 decreased from the corresponding prior-year periods largely as a result of decreases in the Fed’s short-term benchmark interest rate.  For the nine-month period, the decrease also reflected the impact of growth in RJBDP balances offering enhanced rates to clients which reduced the yield earned from third-party banks on such balances.  See “Management’s Discussion and Analysis - Net interest analysis” for further information. \nTotal clients’ domestic cash sweep and ESP balances decreased 4% compared with March 31, 2025, primarily due to seasonal declines related to client tax payments as well as quarterly asset management fee billings.  PCG segment results can be impacted by not only changes in the level of client cash balances, but also by the allocation of client cash balances between the RJBDP, the CIP, and the ESP, as the PCG segment may earn different amounts from each of these client cash destinations, depending on multiple factors.\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nNet revenues of $2.49 billion increased 3%, while pre-tax income of $411 million decreased 7%.\nAsset management and related administrative fees increased $98 million, or 7%, primarily due to higher assets in fee-based accounts at the beginning of the current quarter compared with the prior-year quarter resulting from market-driven appreciation and net new assets, due to the favorable impact of our advisor recruiting and retention.\nBrokerage revenues increased $11 million, or 3%, primarily due to higher client activity in the current quarter.\n65\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nAccount and service fees decreased $30 million, or 6%, primarily due to a decrease in RJBDP fees.  RJBDP fees paid to PCG from third-party banks and our Bank segment decreased despite an increase in average RJBDP balances, primarily driven by a reduction in the average RJBDP third-party bank yield.  RJBDP fees from third-party banks decreased by a greater amount than RJBDP fees from our Bank segment as average balances swept to third-party banks declined due to a higher allocation of balances to our Bank segment.  Partially offsetting the overall decline in total RJBDP fees, mutual fund service fees increased primarily due to higher average mutual fund assets.\nCompensation-related expenses increased $87 million, or 5%, primarily due to higher commission expense resulting from higher compensable revenues, including asset management and related administrative fees and brokerage revenues, as well as an increase in compensation costs to support our growth and annual salary increases.\nNon-compensation expenses increased $15 million, or 6%, primarily due to higher communications and information processing expenses, largely due to investments in technology to support our growth. \nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nNet revenues of $7.52 billion increased 8%, while pre-tax income of $1.3 billion decreased 2%.\nAsset management and related administrative fees increased $557 million, or 15%, primarily due to higher assets in fee-based accounts at the beginning of each of the current-year billing periods compared with the prior-year periods resulting from market-driven appreciation and net new assets, due to the favorable impact of our advisor recruiting and retention.\nBrokerage revenues increased $74 million, or 6%, primarily due to higher client activity in the current-year period.\nAccount and service fees decreased $85 million, or 5%, primarily due to a decrease in RJBDP fees.  RJBDP fees paid to PCG from third-party banks and our Bank segment decreased primarily due to a decrease in the average RJBDP third-party bank yield.  RJBDP fees from third-party banks decreased by a greater amount than RJBDP fees from our Bank segment as average balances swept to third-party banks declined due to a higher allocation of balances to our Bank segment.  These decreases were partially offset by higher average RJBDP balances.  Partially offsetting the decline in total RJBDP fees, mutual fund service fees increased primarily due to higher average mutual fund assets.\nCompensation-related expenses increased $484 million, or 10%, primarily due to higher commission expense resulting from higher compensable revenues, including asset management and related administrative fees and brokerage revenues, as well as an increase in compensation costs to support our growth and annual salary increases.\nNon-compensation expenses increased $75 million, or 11%, primarily due to higher communications and information processing expenses, largely due to investments in technology to support our growth, and higher expenses related to legal and regulatory matters as the prior-year period reflected a net reserve release which did not reoccur in the current-year period.\n66\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nRESULTS OF OPERATIONS – CAPITAL MARKETS\nFor an overview of our Capital Markets segment operations, as well as a description of the key factors impacting our Capital Markets results of operations, refer to the information presented in “Item 1 - Business” and “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K.\nOperating results\n \nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\n \n \nBrokerage revenues:\n \n \nFixed income\n$\n97\n \n$\n86 \n13 \n%\n$\n298\n \n$\n276 \n8 \n%\nEquity\n41\n \n35 \n17 \n%\n127\n \n107 \n19 \n%\nTotal brokerage revenues\n138\n \n121 \n14 \n%\n425\n \n383 \n11 \n%\nInvestment banking:\nMerger & acquisition and advisory \n105\n \n91 \n15 \n%\n460\n \n316 \n46 \n%\nEquity underwriting \n38\n \n33 \n15 \n%\n104\n \n82 \n27 \n%\nDebt underwriting\n60\n \n49 \n22 \n%\n163\n \n116 \n41 \n%\nTotal investment banking\n203\n \n173 \n17 \n%\n727\n \n514 \n41 \n%\nInterest income\n27\n \n32 \n(16)\n%\n84\n \n81 \n4 \n%\nAffordable housing investments business revenues\n33\n \n30 \n10 \n%\n82\n \n75 \n9 \n%\nAll other\n4\n \n4 \n— \n%\n13\n \n12 \n8 \n%\nTotal revenues\n405\n \n360 \n13 \n%\n1,331\n \n1,065 \n25 \n%\nInterest expense\n(24)\n(30)\n(20)\n%\n(74)\n(76)\n(3)\n%\nNet revenues\n381\n \n330 \n15 \n%\n1,257\n \n989 \n27 \n%\nNon-interest expenses:\n \n \nCompensation, commissions and benefits\n262\n \n243 \n8 \n%\n825\n \n721 \n14 \n%\nNon-compensation expenses:\nCommunications and information processing\n32\n \n28 \n14 \n%\n92\n \n85 \n8 \n%\nOccupancy and equipment\n12\n \n12 \n— \n%\n35\n \n35 \n— \n%\nBusiness development\n19\n \n14 \n36 \n%\n56\n \n45 \n24 \n%\nProfessional fees\n16\n \n17 \n(6)\n%\n36\n \n42 \n(14)\n%\nAll other\n94\n \n30 \n213 \n%\n157\n \n89 \n76 \n%\nTotal non-compensation expenses\n173\n \n101 \n71 \n%\n376\n \n296 \n27 \n%\nTotal non-interest expenses\n435\n \n344 \n26 \n%\n1,201\n \n1,017 \n18 \n%\nPre-tax income/(loss)\n$\n(54)\n$\n(14)\n(286)\n%\n$\n56\n \n$\n(28)\nNM\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nNet revenues of $381 million increased 15%, while the segment pre-tax loss was $54 million, compared with a pre-tax loss of $14 million for the prior-year quarter.\nInvestment banking revenues increased $30 million, or 17%, due to increases in mergers & acquisition and advisory revenues, debt underwriting revenues and, to a lesser extent, equity underwriting revenues.\nBrokerage revenues increased $17 million, or 14%, due to higher client activity in fixed income and equity products.\nCompensation-related expenses increased $19 million, or 8%, primarily due to the increase in revenues.\nNon-compensation expenses increased $72 million, or 71%, primarily due to the aforementioned $58 million reserve increase in the current quarter associated with the settlement of a legal matter, as well as higher business development expenses and communications and information processing expenses largely to support our growth.\n67\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nNet revenues of $1.26 billion increased 27% and pre-tax income was $56 million, compared with a pre-tax loss of $28 million for the prior-year period.\nInvestment banking revenues increased $213 million, or 41%, primarily due to more favorable market conditions and larger transactions during the current-year period.\nBrokerage revenues increased $42 million, or 11%, primarily due to an increase in both fixed income and equity securities.\nCompensation-related expenses increased $104 million, or 14%, primarily due to the increase in revenues.\nNon-compensation expenses increased $80 million, or 27%, primarily due to the aforementioned $58 million reserve increase in the current quarter, as well as higher business development expenses and communications and information processing expenses largely to support our growth, partially offset by lower professional fees.\nRESULTS OF OPERATIONS – ASSET MANAGEMENT\nFor an overview of our Asset Management segment operations as well as a description of the key factors impacting our Asset Management results of operations, refer to the information presented in “Item 1 - Business” and “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K.\nOperating results\n \nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\n \n \nAsset management and related administrative fees:\nManaged programs\n$\n189\n \n$\n171 \n11 \n%\n$\n565\n \n$\n484 \n17 \n%\nAdministration and other\n91\n \n83 \n10 \n%\n275\n \n236 \n17 \n%\nTotal asset management and related administrative fees\n280\n \n254 \n10 \n%\n840\n \n720 \n17 \n%\nAccount and service fees\n5\n \n5 \n— \n%\n17\n \n16 \n6 \n%\nAll other\n6\n \n6 \n— \n%\n17\n \n16 \n6 \n%\nNet revenues\n291\n \n265 \n10 \n%\n874\n \n752 \n16 \n%\nNon-interest expenses:\n \n \n \n \nCompensation, commissions and benefits\n54\n \n56 \n(4)\n%\n169\n \n167 \n1 \n%\nNon-compensation expenses:\nCommunications and information processing\n20\n \n16 \n25 \n%\n56\n \n47 \n19 \n%\nInvestment sub-advisory fees\n54\n \n47 \n15 \n%\n159\n \n129 \n23 \n%\nAll other\n38\n \n34 \n12 \n%\n119\n \n104 \n14 \n%\nTotal non-compensation expenses\n112\n \n97 \n15 \n%\n334\n \n280 \n19 \n%\nTotal non-interest expenses\n166\n \n153 \n8 \n%\n503\n \n447 \n13 \n%\nPre-tax income\n$\n125\n \n$\n112 \n12 \n%\n$\n371\n \n$\n305 \n22 \n%\n68\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nSelected key metrics\nManaged programs\nManagement fees recorded in our Asset Management segment are generally calculated as a percentage of the value of our fee-billable financial assets under management (“AUM”).  These AUM include the portion of fee-based AUA in our PCG segment that is invested in programs overseen by AMS, as well as retail accounts managed on behalf of third-party institutions, institutional accounts and proprietary mutual funds managed by Raymond James Investment Management.\nRevenues related to fee-based AUA in our PCG segment are shared by the PCG and Asset Management segments, the amount of which depends on whether or not clients are invested in assets that are in managed programs overseen by our Asset Management segment and the administrative services provided (see our “Management’s Discussion and Analysis - Results of Operations - Private Client Group” for additional information).  Our AUM in AMS are impacted by market fluctuations and net inflows or outflows of assets, including transfers between fee-based accounts and transaction-based accounts within our PCG segment.\nRevenues earned by Raymond James Investment Management for retail accounts managed on behalf of third-party institutions, institutional accounts, and our proprietary mutual funds are recorded entirely in the Asset Management segment.  Our AUM in Raymond James Investment Management are impacted by market and investment performance and net inflows or outflows of assets.\nFees for our managed programs are generally collected quarterly.  Approximately 75% of these fees are based on balances as of the beginning of the quarter (primarily in AMS), approximately 15% are based on balances as of the end of the quarter, and approximately 10% are based on average daily balances throughout the quarter.\nFinancial assets under management\n$ in billions\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nJune 30,\n2024\nAMS \n(1)\n$\n198.0\n \n$\n183.3 \n$\n181.9 \n$\n182.7 \n$\n170.5 \nRaymond James Investment Management\n80.6\n \n76.6 \n76.7 \n76.8 \n72.5 \nSubtotal financial assets under management\n278.6\n \n259.9 \n258.6 \n259.5 \n243.0 \nLess: Assets managed for affiliated entities \n(2)\n(15.4)\n(14.9)\n(14.7)\n(14.7)\n(13.7)\nTotal financial assets under management\n$\n263.2\n \n$\n245.0 \n$\n243.9 \n$\n244.8 \n$\n229.3 \n(1)\nRepresents the portion of our PCG segment fee-based AUA (as disclosed in “Assets in fee-based accounts” in the “Selected key metrics - PCG client asset balances” section of our “Management’s Discussion and Analysis - Results of Operations - Private Client Group”) that is invested in managed programs overseen by AMS.\n(2)\nRepresents the portion of the AMS AUM that is managed by Raymond James Investment Management and, as a result, is included in both AMS and Raymond James Investment Management in the preceding table.  This amount is removed in the calculation of “Total financial assets under management.”\nActivity (including activity in assets managed for affiliated entities)\nThree months ended June 30,\nNine months ended June 30,\n$ in billions\n2025\n2024\n2025\n2024\nFinancial assets under management at beginning of period\n$\n259.9\n \n$\n240.1 \n$\n259.5\n \n$\n207.9 \nRaymond James Investment Management:\nNet outflows\n—\n \n(1.5)\n(0.6)\n(3.7)\nTransfer of Charles Stanley Asset Management \n(1)\n—\n \n— \n1.4\n \n— \nTotal Raymond James Investment Management\n—\n \n(1.5)\n0.8\n \n(3.7)\nAMS - net inflows\n2.1\n \n4.2 \n6.9\n \n8.4 \nNet market appreciation in asset values\n16.6\n \n0.2 \n11.4\n \n30.4 \nFinancial assets under management at end of period\n$\n278.6\n \n$\n243.0 \n$\n278.6\n \n$\n243.0 \n(1)\nThe transfer was effective as of October 1, 2024.\n69\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nAMS \nSee “Management’s Discussion and Analysis - Results of Operations - Private Client Group” for further information about our retail client assets, including those fee-based assets invested in programs managed by AMS.\nRaymond James Investment Management\nThe following table presents Raymond James Investment Management’s AUM by objective, excluding assets for which it does not exercise discretion, as well as the approximate average client fee rate earned on such assets.\nAs of June 30, 2025\n$ in billions\nAUM\nAverage fee rate\nEquity\n$\n21.7\n \n0.56\n \n%\nFixed income\n47.8\n \n0.20\n \n%\nBalanced\n11.1\n \n0.33\n \n%\nTotal financial assets under management\n$\n80.6\n \n0.31\n \n%\nNon-discretionary asset-based programs\nThe following table includes assets held in certain non-discretionary asset-based programs for which the Asset Management segment does not exercise discretion but provides other services such as administrative support (including for affiliated entities) and investment advice.  The vast majority of these assets are also included in our PCG segment fee-based AUA (as disclosed in “Assets in fee-based accounts” in the “Selected key metrics - PCG client asset balances” section of our “Management’s Discussion and Analysis - Results of Operations - Private Client Group”).  Administrative fees associated with these programs are predominantly based on balances at the beginning of the quarter.  \n$ in billions\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nJune 30,\n2024\nTotal assets\n$\n547.8\n \n$\n505.3 \n$\n509.8 \n$\n506.2 \n$\n474.7 \nRaymond James Trust\nThe following table includes assets held in asset-based programs in Raymond James Trust, N.A. (including those managed for affiliated entities).\n$ in billions\nJune 30,\n2025\nMarch 31,\n2025\nDecember 31,\n2024\nSeptember 30,\n2024\nJune 30,\n2024\nTotal assets\n$\n11.2\n \n$\n10.6 \n$\n10.7 \n$\n10.6 \n$\n10.0 \nFees earned on trust services are primarily reported within “Asset management and related administrative fees” on the Condensed Consolidated Statements of Income and Comprehensive Income. \n70\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nNet revenues of $291 million increased 10% and pre-tax income of $125 million increased 12%.\nAsset management and related administrative fees increased $26 million, or 10%, driven by higher financial assets under management and assets in non-discretionary asset-based programs at AMS, primarily due to market-driven appreciation in asset values and net inflows to PCG fee-based accounts.  \nNon-compensation expenses increased $15 million, or 15%, largely due to higher investment sub-advisory fees resulting from the increase in assets under management in sub-advised programs, as well as higher communications and information processing expenses.\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nNet revenues of $874 million increased 16% and pre-tax income of $371 million increased 22%.\nAsset management and related administrative fees increased $120 million, or 17%, primarily driven by higher financial assets under management and assets in non-discretionary asset-based programs at AMS, primarily due to market-driven appreciation in asset values and net inflows to PCG fee-based accounts.\nNon-compensation expenses increased $54 million, or 19%, largely due to higher investment sub-advisory fees, resulting from the increase in assets under management in sub-advised programs, as well as higher communications and information processing expenses.\nRESULTS OF OPERATIONS – BANK\nFor an overview of our Bank segment operations, as well as a description of the key factors impacting our Bank segment results of operations, refer to the information presented in “Item 1 - Business” and “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K.\nOperating results\nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\n \n \nInterest income\n$\n823\n \n$\n867 \n(5)\n%\n$\n2,472\n \n$\n2,607 \n(5)\n%\nInterest expense\n(383)\n(461)\n(17)\n%\n(1,199)\n(1,362)\n(12)\n%\nNet interest income\n440\n \n406 \n8 \n%\n1,273\n \n1,245 \n2 \n%\nAll other\n18\n \n12 \n50 \n%\n44\n \n38 \n16 \n%\nNet revenues\n458\n \n418 \n10 \n%\n1,317\n \n1,283 \n3 \n%\nNon-interest expenses:\n \n \n \n \nCompensation and benefits\n47\n \n45 \n4 \n%\n138\n \n136 \n1 \n%\nNon-compensation expenses:\nBank loan provision for credit losses\n15\n \n(10)\nNM\n31\n \n23 \n35 \n%\nRJBDP fees to PCG\n193\n \n198 \n(3)\n%\n563\n \n627 \n(10)\n%\nAll other\n80\n \n70 \n14 \n%\n227\n \n215 \n6 \n%\nTotal non-compensation expenses\n288\n \n258 \n12 \n%\n821\n \n865 \n(5)\n%\nTotal non-interest expenses\n335\n \n303 \n11 \n%\n959\n \n1,001 \n(4)\n%\nPre-tax income\n$\n123\n \n$\n115 \n7 \n%\n$\n358\n \n$\n282 \n27 \n%\n71\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nNet revenues of $458 million increased 10% and pre-tax income of $123 million increased 7%. \nNet interest income increased $34 million, or 8%, primarily due to the impact of higher average interest-earning assets, particularly securities-based loans, partially offset by the impact of the decrease in short-term interest rates.  The Bank segment net interest margin increased to 2.74% from 2.64% for the prior-year quarter.\nThe bank loan provision for credit losses was $15 million for the current quarter compared with a benefit of $10 million for the prior-year quarter.  The bank loan provision for credit losses for the current quarter primarily reflected the impacts of a weaker economic outlook for the C&I loan portfolio, loan downgrades, and specific reserves.  The bank loan benefit for credit losses for the prior-year quarter primarily reflected the positive impacts of net loan repayments, sales, and improved loan grades on the C&I loan portfolio, and an improvement in forecasted home prices on the residential mortgage portfolio, partially offset by the impact of loan downgrades in our CRE portfolio.\nNon-compensation expenses, excluding the bank loan provision for credit losses, increased $5 million, or 2%, primarily due to higher expenses related to our growth, partially offset by a decrease of $5 million, or 3%, in RJBDP fees paid to PCG.  These Bank segment fees and the related revenues earned by the PCG segment are eliminated in consolidation (see “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Private Client Group” for further information about these servicing fees).\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nNet revenues of $1.32 billion increased 3% and pre-tax income of $358 million increased 27%.\nNet interest income increased $28 million, or 2%, primarily due to the impact of higher average interest-earning assets, particularly securities-based loans, partially offset by the impact of lower short-term interest rates.  The Bank segment net interest margin decreased slightly to 2.67% from 2.68% for the prior-year period.\nThe bank loan provision for credit losses was $31 million for the current-year period, compared with $23 million for the prior-year period.  The bank loan provision for credit losses for the current-year period primarily reflected the impacts of loan downgrades, charge-offs in our C&I and CRE loan portfolios, and specific reserves.  The bank loan provision for credit losses for the prior-year period primarily reflected the impacts of loan growth, specific reserves, loan downgrades, and charge-offs in our C&I and CRE loan portfolios, partially offset by the favorable impacts of an improved economic forecast, loan repayments, and loan sales.\nNon-compensation expenses, excluding the bank loan provision for credit losses, decreased $52 million, or 6%, primarily due to a decrease of $64 million, or 10%, in RJBDP fees paid to PCG, partially offset by higher expenses related to our growth.  These Bank segment fees and the related revenues earned by the PCG segment are eliminated in consolidation.  \n72\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nRESULTS OF OPERATIONS – OTHER\nThis segment includes interest income on certain RJF corporate cash balances, our private equity investments, which predominantly consist of investments in third-party funds, certain other corporate investing activity, and certain corporate overhead costs of RJF that are not allocated to other segments, including the interest costs on our public debt, certain provisions for legal and regulatory matters, and certain acquisition-related expenses.  For an overview of our Other segment operations, refer to the information presented in “Item 1 - Business” and “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our 2024 Form 10-K.\nOperating results\nThree months ended June 30,\nNine months ended June 30,\n$ in millions\n2025\n2024\n% change\n2025\n2024\n% change\nRevenues:\nInterest income \n(1)\n$\n34\n \n$\n47 \n(28)\n%\n$\n102\n \n$\n140 \n(27)\n%\nAll other\n—\n \n6 \n(100)\n%\n7\n \n6 \n17 \n%\nTotal revenues\n34\n \n53 \n(36)\n%\n109\n \n146 \n(25)\n%\nInterest expense\n(25)\n(25)\n— \n%\n(75)\n(75)\n— \n%\nNet revenues\n9\n \n28 \n(68)\n%\n34\n \n71 \n(52)\n%\nNon-interest expenses:\nCompensation and benefits\n36\n \n29 \n24 \n%\n112\n \n78 \n44 \n%\nAll other\n15\n \n9 \n67 \n%\n28\n \n(7)\nNM\nTotal non-interest expenses\n51\n \n38 \n34 \n%\n140\n \n71 \n97 \n%\nPre-tax loss\n$\n(42)\n$\n(10)\n(320)\n%\n$\n(106)\n$\n— \nNM\n(1)\nEffective October 1, 2024, we updated our methodology for allocating interest income on certain cash balances to our segments, resulting in a reallocation of interest income from the Other segment to the PCG segment.  Prior-period segment results have not been conformed to the current-period presentation.  \nQuarter ended June 30, 2025 compared with the quarter ended June 30, 2024\nPre-tax loss was $42 million, compared with a pre-tax loss of $10 million for the prior-year quarter.\nNet revenues decreased $19 million due to a decrease in interest income which reflected the impact of a decrease in short-term interest rates and, to a lesser extent, lower gains from certain investments in the current-year period.\nNon-interest expenses increased $13 million, primarily due to higher compensation costs, professional fees, and communications and information processing expenses in the current-year period.\nNine months ended June 30, 2025 compared with the nine months ended June 30, 2024\nPre-tax loss was $106 million, compared with breakeven results for the prior-year period.\nNet revenues decreased $37 million due to a decrease in interest income which reflected the impact of a decrease in short-term interest rates.\nNon-interest expenses increased $69 million, or 97%, as the prior-year period reflected a net reserve release related to legal and regulatory matters which did not reoccur in the current-year period, as well as higher compensation costs, professional fees, and communications and information processing expenses in the current-year period partially due to investments in our growth.\n73\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nSTATEMENT OF FINANCIAL CONDITION ANALYSIS\nThe assets on our Condensed Consolidated Statements of Financial Condition consisted primarily of cash and cash equivalents, assets segregated for regulatory purposes and restricted cash (primarily segregated for the benefit of clients), receivables, including bank loans, financial instruments held either for trading purposes or as investments, goodwill and identifiable intangible assets, and other assets.  A significant portion of our assets were liquid in nature providing us with flexibility in financing our business.\nTotal assets of $84.82 billion as of June 30, 2025 were $1.8 billion, or 2%, higher than our total assets as of September 30, 2024.  Banks loans, net increased $3.8 billion, primarily due to continued growth in securities-based loans.  Assets segregated for regulatory purposes and restricted cash balances increased $420 million primarily due to an increase in client cash balances in our broker-dealer subsidiaries.  Brokerage client receivables, net, collateralized agreements, and loans to financial advisors, net also increased $206 million, $192 million, and $174 million, respectively.  These increases were partially offset by a $1.8 billion decrease in cash and cash equivalents primarily due to net investments in bank loans, common stock repurchases, and dividends paid on our common stock during the period, partially offset by net income, an increase in bank deposits, and net maturities of available-for-sale securities during the period.  The net maturities of available-for-sale securities also contributed to a $1.1 billion decrease in our total assets.   \nAs of June 30, 2025, our total liabilities of $72.55 billion were $1.2 billion, or 2%, higher than our total liabilities as of September 30, 2024, largely due to a $1.2 billion increase in bank deposits.  Brokerage client payables also increased $390 million due to an increase in client cash balances.  These increases were partially offset by a $200 million decrease in other borrowings due to the maturity and repayment of certain FHLB borrowings.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity and capital are essential to our business.  The primary goal of our liquidity management activities is to ensure adequate funding and liquidity to conduct our business over a range of economic and market environments, including times of broader industry or market liquidity stress events.  In times of market stress or uncertainty, we generally maintain higher levels of liquidity to ensure we have adequate funding to support our business and meet our clients’ needs.  We seek to manage capital levels to support execution of our business strategy, provide financial strength to our subsidiaries, and maintain sustained access to the capital markets, while at the same time meeting our regulatory capital requirements and conservative internal management targets.\nLiquidity and capital resources are provided primarily through our business operations and financing activities.  Our businesses generate substantially all of their own liquidity and funding needs.  We have a contingency funding plan which would guide our actions if one or more of our businesses were to experience disruptions from normal funding and liquidity sources.  These actions include reallocating client cash balances in the RJBDP from third-party banks to our bank subsidiaries thereby bringing those deposits onto our Condensed Consolidated Statements of Financial Condition, increasing our FHLB borrowings or borrowing from the Federal Reserve’s discount window at our bank subsidiaries, accessing committed and uncommitted lines of credit at the parent or certain operating subsidiaries, or accessing capital markets.\nWe also have the ability to create additional sources of funding by developing new products to meet the financial needs of our clients, such as the ESP deposit offering and, from time to time, offering enhanced rates on certain RJBDP deposits.  With each of our deposit offerings, we work to obtain sufficient liquidity to support our business operations while also maintaining a high level of FDIC insurance coverage for our clients.  \nOur financing activities could also include bank borrowings, collateralized financing arrangements, or additional capital raising activities under our “universal” shelf registration statement.  We believe our existing assets, most of which can be readily monetized, together with funds generated from operations and available from committed and uncommitted financing facilities, provide adequate funds for continuing operations at current levels of activity in the short-term.  We also believe that we will be able to continue to meet our long-term funding and liquidity requirements due to our strong financial position and ability to access capital from financial markets.\n74\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nLiquidity and capital management\nSenior management establishes our liquidity and capital management frameworks.  Our liquidity and capital management frameworks are overseen by our Asset and Liability Committee, a senior management committee that develops and executes strategies and policies to manage our liquidity risk and interest rate risk, as well as provides oversight over the firm’s investments.  Our liquidity management framework is designed to ensure we have a sufficient amount of funding, even when funding markets experience stress.  We manage the maturities and diversity of our funding across products and seek to maintain a diversified funding profile with an appropriate tenor, taking into consideration the characteristics and liquidity profile of our assets (e.g., the maturities of our available-for-sale securities portfolio).  The liquidity management framework includes senior management’s review of short- and long-term cash flow forecasts, monitoring of the availability of alternative sources of financing, and daily monitoring of liquidity in our significant subsidiaries.  Our decisions on the allocation of resources to our business units consider, among other factors, projected profitability, cash flow, risk, future liquidity needs, and required capital levels.  Our treasury department assists in evaluating, monitoring and controlling the impact that our business activities have on our financial condition and liquidity, and also maintains our relationships with various lenders.  The objective of our liquidity management framework is to support the successful execution of our business strategies while ensuring ongoing and sufficient funding and liquidity. \nOur capital planning and capital risk management processes are governed by the Capital Planning Committee (“CPC”), a senior management committee that provides oversight on our capital planning and ensures that our strategic planning and risk management processes are integrated into the capital planning process.  The CPC meets at least quarterly to review key metrics related to the firm’s capital, such as debt structure and capital ratios; to analyze potential and emerging risks to capital; to oversee our annual firmwide capital stress test; and to propose capital actions to the Board of Directors, such as declaring dividends, repurchasing securities, and raising capital.  To ensure that we have sufficient capital to absorb unanticipated losses, the firm adheres to capital risk appetite statements and tolerances set in excess of regulatory minimums, which are established by the CPC and approved by the Board of Directors.  We conduct enterprise-wide capital stress testing to ensure that we maintain adequate capital to adhere to our established tolerances under multiple scenarios, including a stressed scenario. \nCapital structure\nCommon equity (i.e., common stock, additional paid-in capital, and retained earnings) is the primary component of our capital structure.  Common equity allows for the absorption of losses on an ongoing basis and for the conservation of resources during stress periods, as we have discretion on the amount and timing of dividends and other capital actions.  Information about our common equity is included in the Condensed Consolidated Statements of Financial Condition, the Condensed Consolidated Statements of Changes in Shareholders’ Equity, and Note 17 of this Form 10-Q.\nUnder regulatory capital rules applicable to us as a bank holding company that has made an election to be a financial holding company, we are required to maintain minimum leverage ratios (defined as tier 1 capital divided by adjusted average assets), as well as minimum ratios of tier 1 capital, CET1 capital, and total capital to risk-weighted assets.  These capital ratios incorporate quantitative measures of our assets, liabilities, and certain off-balance sheet items as calculated under the regulatory capital rules and are subject to qualitative judgments by the regulators about components, risk-weightings, and other factors.  We calculate these ratios in order to assess compliance with both regulatory requirements and internal capital policies.  In order to maintain our ability to take certain capital actions, including dividends and common equity repurchases, and to make bonus payments, we must hold a capital conservation buffer above our minimum risk-based capital requirements.  See Note 21 for further information about our regulatory capital and related capital ratios.\nWe have classified all of our investments in debt securities as available-for-sale and have not classified any of our investments in debt securities as held-to-maturity.  Accordingly, we account for our available-for-sale securities at fair value at each reporting date, with unrealized gains and losses, net of tax, included in AOCI.  Current Basel III rules permit us to make an election to exclude most components of AOCI when calculating CET1 capital, tier 1 capital, and total capital.  We have elected the AOCI opt-out for regulatory capital purposes and therefore exclude certain elements of AOCI, including gains/losses on our available-for-sale portfolio, from our capital calculations.\n75\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe following table presents the components of RJF’s regulatory capital used to calculate the aforementioned regulatory capital ratios.\n$ in millions\nJune 30, 2025\nSeptember 30, 2024\nCommon equity tier 1 capital/Tier 1 capital\nCommon stock and related additional paid-in capital\n$\n3,205\n \n$\n3,253 \nRetained earnings\n13,104\n \n11,894 \nTreasury stock\n(3,691)\n(3,051)\nAccumulated other comprehensive loss\n(438)\n(502)\nLess: Goodwill and identifiable intangible assets, net of related deferred tax liabilities\n(1,717)\n(1,748)\nOther adjustments\n419\n \n461 \nCommon equity tier 1 capital\n10,882\n \n10,307 \nPreferred stock\n79\n \n79 \nLess: Tier 1 capital deductions\n(4)\n(3)\nTier 1 capital\n10,957\n \n10,383 \nTier 2 capital\nQualifying subordinated debt\n79\n \n99 \nQualifying allowances for credit losses\n539\n \n519 \nTier 2 capital\n618\n \n618 \nTotal capital\n$\n11,575\n \n$\n11,001 \nThe following table presents RJF’s risk-weighted assets by exposure type used to calculate the aforementioned regulatory capital ratios.  \n$ in millions\nJune 30, 2025\nSeptember 30, 2024\nCredit risk-weighted assets:\nOn-balance sheet assets:\nCorporate exposures\n$\n20,541\n \n$\n19,118 \nExposures to sovereign and government-sponsored entities \n(1)\n1,380\n \n1,611 \nExposures to depository institutions, foreign banks, and credit unions\n2,058\n \n2,009 \nExposures to public-sector entities\n615\n \n621 \nResidential mortgage exposures\n5,034\n \n4,760 \nStatutory multi-family mortgage exposures\n211\n \n213 \nHigh volatility commercial real estate exposures\n47\n \n83 \nPast due loans\n345\n \n284 \nEquity exposures\n563\n \n706 \nSecuritization exposures \n121\n \n134 \nOther assets\n9,932\n \n9,894 \nOff-balance sheet:\nStandby letters of credit\n102\n \n83 \nCommitments with original maturity of one year or less\n147\n \n181 \nCommitments with original maturity greater than one year\n2,872\n \n2,415 \nOver-the-counter derivatives\n331\n \n284 \nOther off-balance sheet items\n789\n \n429 \nTotal credit risk-weighted assets\n45,088\n \n42,825 \nMarket risk-weighted assets\n2,756\n \n2,800 \nTotal standardized risk-weighted assets\n$\n47,844\n \n$\n45,625 \n(1)\nExposure is predominantly to the U.S. government and its agencies.\nCash flows\nCash and cash equivalents (excluding amounts segregated for regulatory purposes and restricted cash) of $9.20 billion at June 30, 2025 decreased $1.80 billion compared with September 30, 2024.  The decrease in cash and cash equivalents primarily resulted from net investments in bank loans, common stock repurchases, dividends paid on our common stock, the repayment of certain FHLB borrowings, and net loans provided to financial advisors during the period.  These decreases were partially offset by net income, net maturities of available-for-sale securities, and an increase in bank deposits during the period.\n76\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nSources of liquidity\nApproximately $2.35 billion of our total June 30, 2025 cash and cash equivalents was RJF corporate cash, which included the cash held at the parent company, as well as cash it loaned to RJ&A.  As of June 30, 2025, RJF had loaned $1.56 billion to RJ&A (such amount is included in the RJ&A cash balance in the following table), which RJ&A has invested on behalf of RJF in cash and cash equivalents or otherwise deployed in its normal business activities.\nThe following table presents our holdings of cash and cash equivalents.\n$ in millions\nJune 30, 2025\nRJF\n$\n814 \nTriState Capital Bank\n2,795 \nRJ&A\n2,175 \nRaymond James Bank\n1,885 \nRJ Ltd.\n553 \nRaymond James Capital Services, LLC\n144 \nRaymond James Wealth Management Limited \n(1)\n140 \nRaymond James Trust Company of New Hampshire\n133 \nRaymond James Financial Services, Inc.\n124 \nRaymond James Investment Management\n111 \nOther subsidiaries\n321 \nTotal cash and cash equivalents\n$\n9,195\n \n \n(1)\nEffective July 1, 2025, Charles Stanley & Co. Limited changed its legal name to Raymond James Wealth Management Limited (“RJWM”).  \nRJF maintained depository accounts at Raymond James Bank and TriState Capital Bank totaling $299 million as of June 30, 2025.  The portion of this total that was available on demand without restrictions, which amounted to $267 million as of June 30, 2025, is reflected in the RJF cash balance and excluded from Raymond James Bank’s cash balance in the preceding table.\nA large portion of the cash and cash equivalents balances at our non-U.S. subsidiaries, including RJ Ltd. and RJWM, was held to meet regulatory requirements and was not available for use by the parent as of June 30, 2025.\nIn addition to the cash balances described, we have various other potential sources of cash available to the parent company from subsidiaries, as described in the following section.\nLiquidity available from subsidiaries\nLiquidity is principally available to RJF from RJ&A and Raymond James Bank.\nCertain of our broker-dealer subsidiaries are subject to the requirements of the Uniform Net Capital Rule (Rule 15c3-1) under the Securities and Exchange Act of 1934.  As a member firm of the Financial Industry Regulatory Authority (“FINRA”), RJ&A is subject to FINRA’s capital requirements, which are substantially the same as Rule 15c3-1.  Rule 15c3-1 provides for an “alternative net capital requirement,” which RJ&A has elected.  Regulations require that minimum net capital, as defined, be equal to the greater of $1.5 million or 2% of aggregate debit items arising from client balances.  In addition, covenants in RJ&A’s committed financing arrangements require its net capital to be a minimum of 10% of aggregate debit items.  At June 30, 2025, RJ&A significantly exceeded the minimum regulatory requirements, the covenants in its financing arrangements pertaining to net capital, as well as its internally-targeted net capital tolerances.  FINRA may impose certain restrictions, such as restricting withdrawals of equity capital, if a member firm were to fall below a certain threshold or fail to meet minimum net capital requirements which may result in RJ&A limiting dividends it would otherwise remit to RJF.  We evaluate regulatory requirements, loan covenants and certain internal tolerances when determining the amount of liquidity available to RJF from RJ&A.\nOur bank subsidiaries may pay dividends to RJF without prior approval of their regulators as long as the dividends do not exceed the sum of their current calendar year and the previous two calendar years’ retained net income, and they maintain their targeted regulatory capital ratios, among other restrictions.  Dividends paid to RJF from our bank subsidiaries may be limited to the extent that capital is needed to support balance sheet growth or as part of our liquidity and capital management activities. \n77\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nIf necessary, RJF can also access additional liquidity, largely without regulatory preapproval, from certain other subsidiaries that generally do not serve as regular sources of dividend distributions to the parent.\nBorrowings and financing arrangements\nFinancing arrangements\nWe have various financing arrangements in place with third-party lenders that allow us the flexibility to borrow funds on a secured or unsecured basis to meet our liquidity needs.  We generally utilize these financing arrangements to finance a portion of our fixed income trading instruments held by RJ&A or for cash management purposes.  Our ability to borrow under these arrangements is dependent upon compliance with the conditions in our various loan agreements and, in the case of secured borrowings, collateral eligibility requirements.  \nAs of June 30, 2025, RJF and RJ&A had the ability to borrow under our $750 million Credit Facility, a committed unsecured line of credit.  We had no such borrowings outstanding under this facility as of June 30, 2025.  See Note 14 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding our Credit Facility. \nIn addition to our Credit Facility, we have various uncommitted financing arrangements with third-party lenders, which are in the form of secured lines of credit, secured bilateral repurchase agreements, or unsecured lines of credit.  Our uncommitted secured financing arrangements generally require us to post collateral in excess of the amount borrowed and are generally collateralized by RJ&A-owned securities or by securities that we have received as collateral under reverse repurchase agreements (i.e., securities purchased under agreements to resell).  As of June 30, 2025, we had outstanding borrowings under two uncommitted secured borrowing arrangements out of a total of 13 uncommitted financing arrangements (eight uncommitted secured and five uncommitted unsecured). However, lenders are generally under no contractual obligation to lend to us under uncommitted credit facilities.  See Notes 6 and 14 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding these borrowings.\nOur borrowings on uncommitted secured financing arrangements, which were in the form of repurchase agreements in RJ&A, were included in “Collateralized financings” on our Condensed Consolidated Statements of Financial Condition.  The average daily balance outstanding during the five most recent quarters, the maximum month-end balance outstanding during the quarter and the period-end balances for repurchase agreements and reverse repurchase agreements are detailed in the following table.\n \nRepurchase transactions\nReverse repurchase transactions\nFor the quarter ended:\n($ in millions)\nAverage daily \nbalance \noutstanding\nMaximum month-end \nbalance outstanding \nduring the quarter\nEnd of period \nbalance \noutstanding\nAverage daily \nbalance \noutstanding\nMaximum month-end \nbalance outstanding \nduring the quarter\nEnd of period \nbalance \noutstanding\nJune 30, 2025\n$\n273\n \n$\n315\n \n$\n228\n \n$\n211\n \n$\n210\n \n$\n210\n \nMarch 31, 2025\n$\n273 \n$\n299 \n$\n205 \n$\n268 \n$\n305 \n$\n215 \nDecember 31, 2024\n$\n344 \n$\n345 \n$\n307 \n$\n318 \n$\n330 \n$\n267 \nSeptember 30, 2024\n$\n344 \n$\n402 \n$\n402 \n$\n337 \n$\n413 \n$\n413 \nJune 30, 2024\n$\n407 \n$\n374 \n$\n110 \n$\n349 \n$\n311 \n$\n181 \nOther borrowings and collateralized financings\nWe had $750 million in FHLB borrowings outstanding at June 30, 2025, comprised of floating-rate and fixed-rate advances.  The interest rates on our floating-rate advances are based on SOFR.  We use interest rate swaps to manage the risk of increases in interest rates associated with our floating-rate FHLB advances by converting the balances subject to variable interest rates to a fixed interest rate.  \nWe pledge certain of our bank loans and available-for-sale securities with the FHLB as security for both the repayment of certain borrowings and to secure capacity for additional borrowings as needed.  As of June 30, 2025, we had $9.38 billion in immediate credit available from the FHLB based on the collateral pledged.  With the pledge of incremental collateral, we could further increase credit available to us from the FHLB.  See Notes 6 and 14 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding bank loans and available-for-sale securities pledged with the FHLB and for additional information on our FHLB borrowings, including the related maturities and interest rates. \n78\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nAs member banks, our bank subsidiaries have access to the Federal Reserve’s discount window and may have access to other lending programs that may be established by the Federal Reserve in unusual and exigent circumstances.  As of June 30, 2025, our bank subsidiaries had pledged certain bank loans with the Federal Reserve and had $7.2 billion in immediate credit available from the FRB based on collateral pledged.  Subsequent to June 30, 2025, we have continued to pledge incremental collateral, further increasing our credit available to us from the FRB.  See Note 6 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding our assets pledged with the FRB. \nA portion of our fixed income transactions are cleared through a third-party clearing organization, which provides financing for the purchase of trading instruments to support such transactions.  The amount of financing is based on the amount of trading inventory financed, as well as any deposits held at the clearing organization.  Amounts outstanding under this financing arrangement are collateralized by a portion of our trading inventory and accrue interest based on market rates.  While we had borrowings outstanding as of June 30, 2025, the clearing organization is under no contractual obligation to lend to us under this arrangement.\nAt June 30, 2025, we had subordinated notes due May 2030 outstanding, with an aggregate principal amount of $98 million.  In July 2025, we notified holders of the subordinated notes of our intent to redeem all such notes on August 15, 2025 (the “Redemption Date”), pursuant to the applicable indenture provisions.  The subordinated notes will be redeemed at 100% of their principal amount, plus accrued and unpaid interest to, but excluding, the Redemption Date for a total of $100 million.  We have the ability to utilize our cash on hand to fund the redemption.  The redemption of the subordinated notes will not have a material impact on results for our fiscal fourth quarter of 2025. See Note 14 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q and Note 16 of our 2024 Form 10-K for additional information regarding these borrowings. \nWe may act as an intermediary between broker-dealers and other financial institutions whereby we borrow securities from one counterparty and then lend them to another counterparty.  Where permitted, we have also loaned securities owned by clients or the firm to broker-dealers and other financial institutions.  We account for each of these types of transactions as collateralized agreements and financings, with the outstanding balance of $655 million as of June 30, 2025 related to the securities loaned included in “Collateralized financings” on our Condensed Consolidated Statements of Financial Condition of this Form 10-Q.  See Note 6 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q and Note 2 of our 2024 Form 10-K for more information on our collateralized agreements and financings.\nSenior notes payable \nAt June 30, 2025, we had aggregate outstanding senior notes payable of $2.04 billion, which, exclusive of any unaccreted premiums or discounts and debt issuance costs, was comprised of $500 million par 4.65% senior notes due April 2030, $800 million par 4.95% senior notes due July 2046, and $750 million par 3.75% senior notes due April 2051.  See Note 17 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K for additional information on our senior notes payable.\n79\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nCredit ratings\nOur issuer, senior long-term debt, and preferred stock credit ratings as of the most current report are detailed in the following table.  \nCredit Rating \nFitch Ratings, Inc.\nMoody’s\nStandard & Poor’s Ratings Services\nIssuer and senior long-term debt:\nRating\nA-\nA3\nA-\nOutlook\nStable\nStable\nStable\nLast rating action\nAffirmed\nAffirmed\nAffirmed\nDate of last rating action\nApril 2025\nMarch 2025\nFebruary 2025\nPreferred stock:\nRating\nBB+\nBaa3 (hyb)\nNot rated\nLast rating action\nAffirmed\nAffirmed\nN/A\nDate of last rating action\nApril 2025\nMarch 2025\nN/A\nOur current credit ratings depend upon a number of factors, including industry dynamics, operating and economic environment, operating results, operating margins, earnings trends and volatility, balance sheet composition, liquidity and liquidity management, capital structure, overall risk management, business diversification and market share, and competitive position in the markets in which we operate.  Deterioration in any of these factors could impact our credit ratings.  Any rating downgrades could increase our costs in the event we were to obtain additional financing.\nShould our credit rating be downgraded prior to a public debt offering, it is probable that we would have to offer a higher rate of interest to bond investors.  A downgrade to below investment grade may make a public debt offering difficult to execute on terms we would consider to be favorable.  A downgrade below investment grade could result in the termination of certain derivative contracts and the counterparties to the derivative instruments could request immediate payment or demand immediate and ongoing overnight collateralization on our derivative instruments in liability positions.  A credit downgrade could damage our reputation and result in certain counterparties limiting their business with us, result in negative comments by analysts, potentially negatively impact investors’ and/or clients’ perception of us, cause clients to withdraw bank deposits that exceed FDIC insurance limits from our bank subsidiaries, and cause a decline in our stock price.  None of our borrowing arrangements contains a condition or event of default related to our credit ratings.  However, a credit downgrade would result in the firm incurring a higher facility fee on the Credit Facility, in addition to triggering a higher interest rate applicable to any borrowings outstanding on that line as of and subsequent to such downgrade.  Conversely, an improvement in RJF’s current credit rating could have a favorable impact on the facility fee, as well as the interest rate applicable to any borrowings on such line.\nOther sources and uses of liquidity\nWe have corporate-owned life insurance policies which are utilized to fund certain non-qualified deferred compensation plans and other employee benefit plans.  Certain of our non-qualified deferred compensation plans and other employee benefit plans are employee-directed (i.e., the participant chooses investment portfolio benchmarks) while others are company-directed.  Of the corporate-owned life insurance policies which fund these plans, certain policies could be used as a source of liquidity for the firm.  Those policies against which we could readily borrow had a cash surrender value of $1.28 billion as of June 30, 2025, comprised of $888 million related to employee-directed plans and $392 million related to company-directed plans, and we were able to borrow up to 90%, or $1.15 billion, of the June 30, 2025 total without restriction.  To effect any such borrowing, the underlying investments would be converted to money market investments, therefore requiring us to take market risk related to the employee-directed plans.  There were no borrowings outstanding against any of these policies as of June 30, 2025.\nOn May 8, 2024, we filed a “universal” shelf registration statement with the SEC pursuant to which we can issue debt, equity and other capital instruments if and when necessary or perceived by us to be opportune.  Subject to certain conditions, this registration statement will be effective through May 8, 2027.\nWe purchase our own common stock from time to time in conjunction with a number of activities, which are described in further detail in Note 17 and “Part II - Item 2 - Unregistered sales of equity securities and use of proceeds” of this Form 10-Q.  In periods where our capital and liquidity position are strong, and subject to our Board of Directors’ common stock repurchase authorization limit, we may purchase higher quantities of our shares on a more consistent basis than we have historically as part of our capital deployment strategies.  \n80\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nAs part of our ongoing operations, we also enter into contractual arrangements that may require future cash payments, including certificates of deposit, lease obligations and other contractual arrangements, such as for software licenses and various services.  See Notes 12 and 13 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q and Notes 14 and 15 of our 2024 Form 10-K for information regarding our lease obligations and certificates of deposit, respectively.  We have entered into investment commitments, lending commitments and other commitments to extend credit for which we are unable to reasonably predict the timing of future payments.  See Note 16 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for further information.\nREGULATORY\nRefer to the discussion of the regulatory environment in which we operate and the impact on our operations of certain rules and regulations in “Item 1 - Business - Regulation” of our 2024 Form 10-K.\nRJF and many of its subsidiaries are each subject to various regulatory capital requirements.  As of June 30, 2025, all of our active regulated domestic and international subsidiaries had net capital in excess of minimum requirements.  In addition, RJF, Raymond James Bank, and TriState Capital Bank were categorized as “well-capitalized” as of June 30, 2025.  The maintenance of certain risk-based and other regulatory capital levels could influence various capital allocation decisions impacting one or more of our businesses.  However, due to the current capital position of RJF and its regulated subsidiaries, we do not anticipate these capital requirements will have a negative impact on our future business activities.  See Note 21 of the Notes to Condensed Consolidated Financial Statements and “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and capital resources - Capital structure” of this Form 10-Q for additional information on regulatory capital requirements.  \nRJF and certain of its subsidiaries are subject to regular reviews and inspections by regulatory authorities and SROs.  In addition, regulatory agencies and SROs institute investigations from time to time into industry practices, among other things.  For example, beginning in August 2024, the SEC’s Division of Enforcement requested information regarding our practices related to cash sweep programs for investment advisory clients and is reportedly conducting similar reviews at other financial institutions.  The firm has been cooperating with this inquiry.  In addition, in August and December 2024, a total of three putative class action lawsuits were filed in federal district court alleging, among other things, that the firm breached its fiduciary duties or agreements with regard to rates paid to clients in our cash sweep programs.  All three cases were subsequently consolidated, but on July 24, 2025, the plaintiff in one of the three lawsuits voluntarily dismissed all of their claims without prejudice.  We intend to vigorously defend against the claims asserted by the remaining named plaintiffs.    \nThe SEC adopted final rules mandating central clearing of cash, repurchase, and reverse repurchase transactions in U.S. Treasuries.  In February 2025, the SEC extended the compliance dates for these rules by one year to December 2026 for cash market transactions and to June 2027 for repurchase and reverse repurchase transactions.  We are actively working to update our business practices to align with the new requirements and do not expect the rule to have a material impact on our financial position.\nIn December 2024, the SEC adopted a final rule amending SEC Rules 15c3-3, the Customer Protection rule, and 15c3-1, the Net Capital rule.  These amendments will require large clearing/carrying broker-dealers, including RJ&A, to compute customer and Proprietary Account of Broker-dealer reserve requirements and make any required reserve account deposits daily rather than the current weekly requirement.  In June 2025, the SEC extended the compliance date for this rule by six months to June 30, 2026.  We are prepared to comply with the rule as of its effective date and do not expect it to have a material impact on our statement of financial position.\nOn July 4, 2025, the One Big Beautiful Bill Act was signed into law, enacting significant changes to the U.S. tax code.  Among its many provisions, those most likely to have an impact on our firm include the restoration of accelerated depreciation provisions (i.e., bonus depreciation), immediate expensing for domestic research and development costs (reversing prior amortization requirements), modifications to certain U.S. international tax provisions enacted under the 2017 Tax Cuts and Jobs Act, a new limitation on charitable contributions whereby deductions will only be permitted for amounts exceeding 1% of taxable income, and the eventual phaseout of certain renewable energy tax credit programs.  The changes to renewable energy programs do not impact tax credits applicable to our existing renewable energy equity investments. The effective dates of these provisions vary, and we are currently evaluating the impact these changes will have on our consolidated financial statements, including the potential effects on our effective tax rate, deferred tax assets and liabilities, and related disclosures. \n81\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nCRITICAL ACCOUNTING ESTIMATES\nThe condensed consolidated financial statements are prepared in accordance with GAAP, which require us to make certain estimates and assumptions that affect the reported amounts of assets and liabilities and the reported amounts of revenues and expenses for the reporting period.  Management has established detailed policies and control procedures intended to ensure the appropriateness of such estimates and assumptions and their consistent application from period to period.  For a description of our significant accounting policies, see Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K.\nDue to their nature, estimates involve judgment based upon available information.  Actual results or amounts could differ from estimates and the difference could have a material impact on the condensed consolidated financial statements.  Therefore, understanding these critical accounting estimates is important in understanding our reported results of operations and financial position.  We believe that of our accounting estimates and assumptions, those described in the following sections involve a high degree of judgment and complexity.\nLoss provisions\nAllowance for credit losses\nWe evaluate certain of our financial assets, including bank loans, to estimate an allowance for credit losses based on expected credit losses over a financial asset’s lifetime.  The remaining life of our financial assets is determined by considering contractual terms and expected prepayments, among other factors.  We use multiple methodologies in estimating an allowance for credit losses and our approaches differ by type of financial asset and the risk characteristics within each financial asset type.  Our estimates are based on ongoing evaluations of our financial assets, the related credit risk characteristics, and the overall economic and environmental conditions affecting the financial assets.  Our process for determining the allowance for credit losses includes a complex analysis of several quantitative and qualitative factors requiring significant management judgment due to matters that are inherently uncertain.  This uncertainty can produce volatility in our allowance for credit losses.  In addition, the allowance for credit losses could be insufficient to cover actual losses.  In such an event, any losses in excess of our allowance would result in a decrease in our net income, as well as a decrease in the level of regulatory capital.  \nWe generally estimate the allowance for credit losses on bank loans using credit risk models which incorporate relevant available information from internal and external sources relating to past events, current conditions, and most notably, reasonable and supportable economic forecasts.  After testing the reasonableness of a variety of economic forecast scenarios, each model is run using a single forecast scenario selected for each model.  Our forecasts incorporate assumptions related to macroeconomic indicators as of June 30, 2025 including, but not limited to, U.S. gross domestic product, equity market indices, unemployment rates, and commercial real estate and residential home price indices.\nTo demonstrate the sensitivity of credit loss estimates on our bank loan portfolio to macroeconomic forecasts, we compared our modeled estimates under the base case economic scenario used to estimate the allowance for credit losses as of June 30, 2025, to what our estimate would have been under a downside case scenario and an upside case scenario, without considering any offsetting effects in the qualitative component of our allowance for credit losses as of June 30, 2025.  As of June 30, 2025, use of the downside case scenario would have resulted in an increase of approximately $185 million in the quantitative portion of our allowance for credit losses on bank loans, while the use of the upside case scenario would have resulted in a reduction of approximately $30 million in the quantitative portion of our allowance for credit losses on bank loans at June 30, 2025.  These hypothetical outcomes reflect the relative sensitivity of the modeled portion of our allowance estimate to macroeconomic forecasted scenarios but do not consider any potential impact qualitative adjustments could have on the allowance for credit losses in such environments.  Qualitative adjustments could either increase or decrease modeled loss estimates calculated using an alternative economic scenario assumption.  Further, such sensitivity calculations do not necessarily reflect the nature and extent of future changes in the related allowance for a number of reasons including: (1) management’s predictions of future economic trends and relationships among the scenarios may differ from actual events; and (2) management’s application of subjective measures to modeled results through the qualitative portion of the allowance for credit losses when appropriate.  The downside case scenario utilized in this hypothetical sensitivity analysis assumes a moderate recession.  To the extent macroeconomic conditions worsen beyond those assumed in this downside case scenario, we could incur provisions for credit losses significantly in excess of those estimated in this analysis. \nSee Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K for information regarding our methodologies and assumptions used in estimating the allowance for credit losses.  See Note 7 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for information regarding our allowance for credit losses related to bank loans as of June 30, 2025.\n82\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nLoss provisions for legal and regulatory matters\nThe recorded amount of liabilities related to legal and regulatory matters is subject to significant management judgment.  For a description of the significant estimates and judgments associated with establishing such accruals, see the “Contingent liabilities” section of Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K.  In addition, refer to Note 16 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for information regarding legal and regulatory matters contingencies as of June 30, 2025.\nACCOUNTING STANDARDS UPDATE\nIn November 2023, the Financial Accounting Standards Board (“FASB”) issued amended guidance related to disclosures for segment reporting (ASU 2023-07).  The amendment requires a public entity to disclose on an annual and interim basis, for each reportable segment, the significant segment expenses that are regularly provided to the chief operating decision maker and included within each reported measure of segment profit or loss.  The guidance also requires a public entity to disclose, for each reportable segment, an amount for other segment items (those not captured as a significant expense) and the reported measure of a segment’s profit or loss.  This new guidance is effective for annual periods beginning in our fiscal 2025 and interim periods beginning in our fiscal first quarter of 2026 with early adoption permitted, although we do not plan to early adopt.  This guidance will be applied on a retrospective basis.  Since this amendment only requires additional disclosures, adoption of this ASU will not have an impact on our financial condition, results of operations, or cash flows.\nIn December 2023, the FASB issued amended guidance related to disclosures for income taxes (ASU 2023-09).  The amendment requires a public entity to enhance its existing annual tabular reconciliation of its statutory income tax rate to its effective tax rate, with certain reconciling items at or above 5% of the applicable statutory income tax rate broken out by nature and/or jurisdiction.  The guidance also requires an entity to disclose income taxes paid (net of refunds received), disaggregated by federal, state, and foreign taxes, and net amounts paid to an individual jurisdiction when they represent 5% or more of the total income taxes paid.  This new guidance is effective for annual periods beginning in our fiscal 2026 with early adoption permitted, although we do not plan to early adopt.  This guidance will be applied on a prospective basis with retrospective application permitted.  Since this amendment only requires additional disclosures, adoption of this ASU will not have an impact on our financial condition, results of operations, or cash flows.\nIn November 2024, the FASB issued amended guidance related to disclosure of disaggregated expenses (ASU 2024-03).  This amendment requires public business entities to provide detailed disclosures in the notes to financial statements disaggregating specific expense categories, including employee compensation, depreciation, and intangible asset amortization, as well as certain other disclosures to provide enhanced transparency into the nature and function of expenses.  This new guidance is effective for annual periods beginning in our fiscal 2028 and interim periods beginning in our fiscal first quarter of 2029 with early adoption permitted, although we do not plan to early adopt.  This guidance will be applied on a prospective basis with retrospective application permitted.  Since this amendment only requires additional disclosures, adoption of this ASU will not have an impact on our financial condition, results of operations, or cash flows.\nRISK MANAGEMENT\nRisks are an inherent part of our business and activities.  Management of risk is critical to our fiscal soundness and profitability.  Our risk management processes are multi-faceted and require communication, judgment, and knowledge of financial products and markets.  We have a formal Enterprise Risk Management (“ERM”) program to assess and review aggregate risks across the firm.  Our management takes an active role in the ERM process, which requires specific administrative and business functions to participate in the identification, assessment, monitoring and control of various risks.\nThe principal risks related to our business activities are market, credit, liquidity, operational, model, and compliance.\nGovernance\nOur Board of Directors, including its Risk Committee and Audit Committee, oversees the firm’s management and mitigation of risk, reinforcing a culture that encourages ethical conduct and risk management throughout the firm.  Senior management communicates and reinforces this culture through three lines of risk management and a number of senior-level management committees.  Our first line of risk management, which includes all of our businesses, owns its risks and is responsible for identifying, mitigating, and escalating risks arising from its day-to-day activities.  The second line of risk management, which includes Compliance and Risk Management, advises our client-facing businesses and other first-line functions in identifying, assessing, and mitigating risk.  The second line of risk management tests and monitors the effectiveness of controls, as deemed necessary, and escalates risks when appropriate to senior management and the Board of Directors.  The third line of risk \n83\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nmanagement, Internal Audit, independently reviews activities conducted by the previous lines of risk management to assess their management and mitigation of risk, providing additional assurance to the Board of Directors and senior management, with a view toward enhancing our oversight, management, and mitigation of risk.  Our legal department provides legal advice and guidance to each of these three lines of risk management.\nMarket risk\nMarket risk is our risk of loss resulting from the impact of changes in market prices on our trading inventory, derivatives, and investment positions.  We have exposure to market risk primarily through our broker-dealer trading operations and our banking operations.  Through our broker-dealer subsidiaries, we trade debt obligations and, to a lesser extent, equity securities and maintain trading inventories to ensure availability of securities to facilitate client transactions.  Inventory levels may fluctuate daily as a result of client demand.  Within our banking operations, we hold investments in an available-for-sale securities portfolio, and from time to time may hold SBA loan securitizations not yet sold.  Our primary market risks relate to interest rates, equity prices, and foreign exchange rates.  Interest rate risk results from changes in levels of interest rates, the volatility of interest rates, mortgage prepayment speeds, and credit spreads.  Equity risk results from changes in prices of equity securities.  Foreign exchange risk results from changes in spot prices, forward prices, and volatility of foreign exchange rates.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Notes 3, 4, and 5 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for fair value and other information regarding our trading inventories, available-for-sale securities, and derivative instruments.\nWe regularly enter into underwriting commitments and, as a result, we may be subject to market risk on any unsold securities issued in the offerings to which we are committed.  Risk exposure is controlled by limiting our participation, the transaction size, or through the syndication process.\nMarket Risk Management is responsible for measuring, monitoring, and reporting market risks associated with the firm’s trading and derivative portfolios.  While Market Risk Management maintains ongoing communication with the revenue-generating business units, it is independent of such units. \nTrading activities\nWe are exposed to market risk, primarily related to interest rate risk, as a result of our trading inventory (primarily comprised of fixed income financial instruments) in our Capital Markets segment.  Changes in the value of our trading inventory may result from fluctuations in interest rates, credit spreads, equity prices, macroeconomic factors, investor expectations or risk appetites, liquidity, as well as dynamic relationships between these factors.  We actively manage interest rate risk arising from our fixed income trading inventory through the use of hedging strategies utilizing U.S. Treasuries, exchange traded funds, futures contracts, liquid spread products, and derivatives.\nWe are also exposed to equity price risk as a result of our capital markets activities.  Our broker-dealer activities are generally client-driven, and we hold equity securities as part of our trading inventory to facilitate such activities, although the amounts are not as significant as our fixed income trading inventory.  \nOur primary method for controlling risks within trading inventories is through the use of dollar-based and exposure-based limits.  A hierarchy of limits exists at multiple levels, including firm, business unit, desk (e.g., for equities, corporate bonds, municipal bonds), product sub-type (e.g., below-investment-grade positions) and issuer concentration.  For derivative positions, which are primarily comprised of interest rate swaps, we have established sensitivity-based and foreign exchange spot limits.  Trading positions and derivatives are monitored against these limits through daily reports that are distributed to senior management.  During volatile markets, we may temporarily reduce limits and/or choose to pare our trading inventories to reduce risk.\nWe monitor Value-at-Risk (“VaR”) for all of our trading portfolios on a daily basis for risk management purposes and as a result of applying the Fed’s Market Risk Rule (“MRR”) for the purpose of calculating our capital ratios.  The MRR, also known as the “Risk-Based Capital Guidelines: Market Risk” rule released by the Fed, the Office of the Comptroller of the Currency and the FDIC, requires us to calculate VaR for all of our trading portfolios, including fixed income, equity, derivatives, and foreign exchange instruments.  VaR is an appropriate statistical technique for estimating potential losses in trading portfolios due to typical adverse market movements over a specified time horizon with a suitable confidence level.  However, there are inherent limitations to utilizing VaR including: historical movements in markets may not accurately predict future market movements; VaR does not take into account the liquidity of individual positions; VaR does not estimate losses over longer time horizons; and extended periods of one-directional markets potentially distort risks within the portfolio.  In addition, should markets become more volatile, actual trading losses may exceed VaR results presented on a single day and might accumulate \n84\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nover a longer time horizon.  As a result, management complements VaR with sensitivity analysis and stress testing and employs additional controls such as a daily review of trading results, review of aged inventory, independent review of pricing, monitoring of concentrations, and review of issuer ratings.\nTo calculate VaR, we use models that incorporate historical simulation.  This approach assumes that historical changes in market conditions, such as in interest rates and equity prices, are representative of future changes.  Simulation is based on daily market data for the previous twelve months.  VaR is reported at a 99% confidence level for a one-day time horizon.  Assuming that future market conditions change as they have in the past twelve months, we would expect to incur losses greater than those predicted by our one-day VaR estimates about once every 100 trading days, or two to three times per year on average.  The VaR model is independently reviewed by our Model Risk Management function.  See “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Model risk” of our 2024 Form 10-K for further information.\nThe modeling of the risk characteristics of trading positions involves a number of assumptions and approximations that management believes to be reasonable.  However, there is no uniform industry methodology for estimating VaR, and different assumptions or approximations could produce materially different VaR estimates.  As a result, VaR results are more reliable when used as indicators of risk levels and trends within a firm than as a basis for inferring differences in risk-taking across firms. \nThe following table sets forth the high, low, period-end and average daily one-day VaR for all of our trading portfolios, including fixed income and equity instruments, and for our derivatives for the periods and dates indicated.\n \nNine months ended June 30, 2025\nPeriod-end VaR\nThree months ended June 30,\nNine months ended June 30,\n$ in millions\nHigh\nLow\nJune 30,\n2025\nSeptember 30,\n2024\n$ in millions\n2025\n2024\n2025\n2024\nDaily VaR\n$\n4\n \n$\n1\n \n$\n3\n \n$\n2 \nAverage daily VaR\n$\n3\n \n$\n2 \n$\n3\n \n$\n2 \nWe perform daily back-testing procedures for our VaR model, as defined by the Fed’s MRR, whereby we compare each day’s projected VaR to its regulatory-defined daily trading losses, which exclude fees, commissions, reserves, net interest income, and intraday trading.  Regulatory-defined daily trading losses are used to evaluate the performance of our VaR model and are not comparable to our actual daily net revenues.  Based on these daily “ex ante” versus “ex post” comparisons, we determine whether the number of times that regulatory-defined daily trading losses exceed VaR is consistent with our expectations at a 99% confidence level.  During the three and nine months ended June 30, 2025, our regulatory-defined daily losses in our trading portfolios exceeded our predicted VaR on two and three occasions, respectively, primarily due to heightened market volatility in early April 2025 driven by economic uncertainties surrounding the potential impacts of changes in international trade policy. \nSeparately, RJF provides additional market risk disclosures to comply with the MRR, including 10-day VaR and 10-day Stressed VaR, which are available on our website at \nhttps://www.raymondjames.com/investor-relations/financial-information/filings-and-reports\n within “Other Reports and Information.”\nBanking operations\nOur Bank segment maintains an interest-earning asset portfolio that is comprised of cash, SBL, C&I loans, CRE loans, REIT loans, residential mortgage loans, and tax-exempt loans, as well as an available-for-sale securities portfolio.  These interest-earning assets are primarily funded by client deposits.  Based on the current asset portfolio, our banking operations are subject to interest rate risk.  We analyze interest rate risk based on forecasted net interest income, which is the net amount of interest received and interest paid, and the net portfolio valuation, both across a range of interest rate scenarios.\nOne of the objectives of our Asset and Liability Committee is to manage the sensitivity of net interest income to changes in market interest rates.  This committee uses several measures to monitor and limit interest rate risk in our banking operations, including scenario analysis and economic value of equity (“EVE”).  We utilize hedging strategies using interest rate swaps in our banking operations as a component of our asset and liability management process.  For additional information regarding this hedging strategy, see Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Notes 5, 13 and 14 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q.  We also manage interest rate risk as part of our liquidity management framework.  See “Item 2 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and capital resources” of this Form 10-Q for additional information.\n85\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nTo ensure that we remain within the tolerances established for net interest income, a sensitivity analysis of net interest income to interest rate conditions is estimated under a variety of scenarios.  We use simulation models and estimation techniques to assess the sensitivity of net interest income to movements in interest rates.  The model estimates the sensitivity by calculating interest income and interest expense in a dynamic balance sheet environment using current repricing, prepayment, and reinvestment of cash flow assumptions over a 12-month time horizon.  Assumptions used in the model include interest rate movement, the slope of the yield curve, and balance sheet composition and growth.  The model also considers interest rate-related risks such as pricing spreads, pricing of client cash accounts, including deposit betas, and prepayments.  Various interest rate scenarios are modeled in order to determine the effect those scenarios may have on net interest income.\nThe following table is an analysis of our banking operations’ estimated net interest income over a 12-month period based on instantaneous shifts in interest rates (expressed in basis points) using our previously described asset/liability model, which assumes a dynamic balance sheet, a weighted-average deposit beta on our interest-bearing deposit accounts without stated maturities of approximately 70% as interest rates rise and approximately 60% as interest rates fall, and that interest rates do not decline below zero.  While not presented, additional rate scenarios are performed, including interest rate ramps and yield curve shifts that may more realistically mimic the speed of potential interest rate movements.  We also perform simulations on time horizons of up to five years to assess longer-term impacts to various interest rate scenarios.  On a quarterly basis, we test expected model results to actual performance.  Additionally, any changes made to key assumptions in the model are documented and approved by the Asset and Liability Committee.\nInstantaneous \nchanges in rate \n(1)\nNet interest income\n($ in millions)\nProjected change in\nnet interest income\n+200\n$1,969\n3%\n+100\n$1,951\n3%\n0\n$1,903\n—%\n-100\n$1,823\n(4)%\n-200\n$1,718\n(10)%\n(1)\nOur 0-basis point scenario was based on interest rates as of June 30, 2025.\nThe preceding table does not include the impacts of an instantaneous change in interest rates on net interest income on assets and liabilities outside of our banking operations or on our RJBDP fees from third-party banks, which are also sensitive to changes in interest rates and are included in “Account and service fees” on our Condensed Consolidated Statements of Income and Comprehensive Income.  Refer to “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Net interest analysis” of this Form 10-Q for additional information on our net interest income.\nWe have classified all of our investments in debt securities in our banking operations as available-for-sale and have not classified any of our investments in debt securities as held-to-maturity.  In our available-for-sale securities portfolio, we hold primarily fixed-rate agency-backed MBS, agency-backed CMOs, and U.S. Treasuries, which are carried at fair value on our Condensed Consolidated Statements of Financial Condition, with changes in the fair value of the portfolio recorded through OCI on our Condensed Consolidated Statements of Income and Comprehensive Income.  As the majority of our available-for-sale securities portfolio is comprised of U.S. government and government agency-backed securities, changes in fair value are primarily driven by changes in interest rates.  At June 30, 2025, our available-for-sale securities portfolio had a fair value of $7.17 billion with a weighted-average yield of 2.24% and a weighted-average life, after factoring in estimated prepayments, of 3.9 years.  To evaluate the interest rate sensitivity of our available-for-sale securities portfolio we also monitor, among other things, effective duration, defined as the approximate percentage change in price for a 100-basis point change in rates.  As of June 30, 2025, the effective duration of our available-for-sale securities portfolio was approximately 3.50, which means that we would expect the market value of our available-for-sale securities portfolio to increase approximately 3.50% for every 100-basis point decline in interest rates and decline approximately 3.50% for every 100-basis point increase in interest rates.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Note 4 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information on our available-for-sale securities portfolio.\nThe Asset and Liability Committee also reviews EVE, which is a point in time analysis of current interest-earning assets and interest-bearing liabilities that incorporates cash flows over their estimated remaining lives, discounted at current rates.  The EVE approach is based on a static balance sheet and provides an indicator of future earnings and capital levels as the changes in EVE indicate the anticipated change in the value of future cash flows.  We monitor sensitivity to changes in EVE utilizing Board of Directors-approved limits.  These limits set a risk tolerance to changing interest rates and assist in determining strategies for mitigating this risk as EVE approaches these limits.  As of June 30, 2025, our EVE analyses were within approved limits.\n86\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe following table shows the maturities of our bank loan portfolio at June 30, 2025, including contractual principal repayments.  Maturities are generally determined based upon contractual terms; however, rollovers or extensions that are included for the purposes of measuring the allowance for credit losses are reflected in maturities in the following table.  This table does not include any estimates of prepayments, which could shorten the average loan lives and cause the actual timing of the loan repayments to differ significantly from those shown in the table.\n \nDue in\n$ in millions\nOne year or less\n> One year - five years\n> Five years - fifteen years\n> Fifteen years\nTotal\nSBL\n$\n18,120 \n$\n364 \n$\n12 \n$\n1 \n$\n18,497\n \nC&I loans\n1,236 \n5,845 \n3,636 \n37 \n10,754\n \nCRE loans\n831 \n5,405 \n1,510 \n31 \n7,777\n \nREIT loans\n552 \n1,183 \n— \n— \n1,735\n \nResidential mortgage loans\n6 \n26 \n145 \n9,799 \n9,976\n \nTax-exempt loans\n64 \n407 \n840 \n— \n1,311\n \nTotal loans held for investment\n20,809 \n13,230 \n6,143 \n9,868 \n50,050\n \nHeld for sale loans\n— \n1 \n77 \n177 \n255\n \nTotal loans held for sale and investment\n$\n20,809\n \n$\n13,231\n \n$\n6,220\n \n$\n10,045\n \n$\n50,305\n \nThe following table shows the distribution of the recorded investment of those bank loans that mature in more than one year between fixed and adjustable interest rate loans at June 30, 2025.\n \nInterest rate type\n$ in millions\nFixed\nAdjustable\nTotal \nSBL\n$\n57 \n$\n320 \n$\n377\n \nC&I loans\n958 \n8,560 \n9,518\n \nCRE loans\n385 \n6,561 \n6,946\n \nREIT loans\n— \n1,183 \n1,183\n \nResidential mortgage loans \n(1)\n213 \n9,757 \n9,970\n \nTax-exempt loans\n1,247 \n— \n1,247\n \nTotal loans held for investment\n2,860 \n26,381 \n29,241\n \nHeld for sale loans\n3 \n252 \n255\n \nTotal loans held for sale and investment\n$\n2,863\n \n$\n26,633\n \n$\n29,496\n \n(1)\nAdjustable rate residential mortgage loans included loans which were still in their fixed-rate period at June 30, 2025\n \nContractual loan terms for SBL, C&I loans, CRE loans, REIT loans, and residential mortgage loans may include an interest rate floor, cap and/or fixed interest rates for a certain period of time, which would impact the timing of the interest rate reset for the respective loan.  See the discussion within the “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk - Risk monitoring process” section of this Form 10-Q for additional information regarding our interest-only residential mortgage loan portfolio.\nOur banking operations are also subject to foreign exchange risk due to our investments in foreign subsidiaries as well as transactions and resulting balances denominated in a currency other than the U.S. dollar (“USD”).  For example, our bank loan portfolio includes loans which are denominated in Canadian dollars (“CAD”), totaling $1.04 billion and $1.23 billion at June 30, 2025 and September 30, 2024, respectively, when converted to the USD using the spot rate at that time.  A majority of such loans are held in a Canadian subsidiary of Raymond James Bank.  Raymond James Bank utilizes short-term, forward foreign exchange contracts to mitigate its foreign exchange risk related to such investment in the Canadian subsidiary.  These derivatives are primarily accounted for as net investment hedges in the condensed consolidated financial statements.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Note 5 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information regarding these derivatives.\nOther sources of foreign exchange risk\nInvestments in non-bank foreign subsidiaries\nAt June 30, 2025, we had foreign exchange risk in our investment in RJ Ltd. of CAD 474 million, and in our investment in our U.K. PCG subsidiary, of £314 million, which were not hedged.  We had other, less significant investments in foreign domiciled subsidiaries, primarily in Europe, which were not hedged; however, we do not believe we had material foreign exchange risk \n87\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\neither individually, or in the aggregate, pertaining to these subsidiaries as of June 30, 2025.  Foreign exchange gains/losses related to our foreign investments are primarily reflected in OCI on our Condensed Consolidated Statements of Income and Comprehensive Income.  See Note 17 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for further information regarding our components of OCI.\nTransactions and resulting balances denominated in a currency other than the USD\nWe are subject to foreign exchange risk due to our holdings of cash and certain other assets and liabilities resulting from transactions denominated in a currency other than the USD.  Any currency-related gains/losses arising from these foreign currency denominated balances are reflected in “Other” revenues on our Condensed Consolidated Statements of Income and Comprehensive Income.  The foreign exchange risk associated with a portion of such transactions and balances denominated in foreign currency are mitigated utilizing short-term, forward foreign exchange contracts.  Such derivatives are not designated hedges and therefore, the related gains/losses are included in “Other” revenues on our Condensed Consolidated Statements of Income and Comprehensive Income.  See Note 5 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for information regarding our derivatives.\nCredit risk\nCredit risk is the risk of loss due to adverse changes in a borrower’s, issuer’s, or counterparty’s ability to meet its financial obligations under contractual or agreed-upon terms.  The nature and amount of credit risk depends on the type of transaction, the structure and duration of that transaction, and the parties involved.  Credit risk is an integral component of the profit assessment of lending and other financing activities.  See further discussion of our credit risk, including how we manage such risk, in “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk” of our 2024 Form 10-K.\nCorporate activities\nWe maintain cash balances with the Fed and with various financial institutions, primarily global systemically important financial institutions, in our normal course of business.  A large portion of such balances are in excess of FDIC insurance limits.  As a result, we may be exposed to the risk that these financial institutions may not return our cash to us in the event that the institution experiences financial distress or ceases its operations.  In order to mitigate our credit risk to such financial institutions, we monitor our exposure with each institution on a daily basis and subject each institution to limits based on various factors including but not limited to financial strength, capitalization levels, liquidity, credit ratings, and market factors to the extent applicable.  \nBrokerage activities\nWe are engaged in various trading and brokerage activities in which our counterparties primarily include broker-dealers, banks, exchanges, clearing organizations, and other financial institutions.  We are exposed to risk that these counterparties may not fulfill their obligations.  In addition, certain commitments, including underwritings, may create exposure to individual issuers and businesses.  The risk of default depends on the creditworthiness of the counterparty and/or the issuer of the instrument.  In addition, we may be subject to concentration risk if we hold large positions in or have large commitments to a single counterparty, borrower, or group of similar counterparties or borrowers (e.g., in the same industry).  We seek to mitigate these risks by imposing and monitoring individual and aggregate position limits within each business segment for each counterparty, conducting regular credit reviews of financial counterparties, reviewing security, derivative, and loan concentrations, holding collateral as security for certain transactions and conducting business through clearing organizations, which may guarantee performance.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Notes 5 and 6 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information about our credit risk mitigation related to derivatives and collateralized agreements. \nOur client activities involve the execution, settlement, and financing of various transactions on behalf of our clients.  Client activities are transacted on either a cash or margin basis.  Credit exposure results from client margin loans, which are monitored daily and are collateralized by the securities in the clients’ accounts.  We monitor exposure to industry sectors and individual securities on a daily basis in connection with our margin lending activities.  We adjust our margin requirements if we believe our risk exposure is not appropriate based on market conditions.  In addition, when clients execute a purchase, we are at some risk that the client will default on their financial obligation associated with the trade.  If this occurs, we may have to liquidate the position at a loss.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K for additional information about our determination of the allowance for credit losses associated with certain of our brokerage lending activities. \n88\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nWe offer loans to financial advisors for recruiting and retention purposes.  We have credit risk and may incur a loss primarily in the event that such borrower is no longer affiliated with us.  See Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K and Note 8 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for further information about our loans to financial advisors.\nBanking operations\nOur Bank segment has a substantial loan portfolio.  Our strategy for credit risk management related to bank loans includes well-defined credit policies, uniform underwriting criteria, and ongoing risk monitoring and review processes for all credit exposures.  The strategy also includes diversification across loan types, geographic locations, industries and clients, regular credit examinations and management reviews of all corporate and tax-exempt loans as well as individual delinquent residential loans.  The credit risk management process also includes periodic independent reviews of the credit risk monitoring process that performs assessments of compliance with credit policies, risk ratings, and other critical credit information.  We seek to identify potential problem loans early, record any necessary risk rating changes and charge-offs promptly, and maintain appropriate reserve levels for expected losses.  We use a credit risk rating system to measure the credit quality of individual corporate and tax-exempt loans and related unfunded lending commitments.  For our SBL and residential mortgage loans, we utilize the credit risk rating system used by bank regulators in measuring the credit quality of each homogeneous class of loans.  In evaluating credit risk, we consider trends in loan performance, historical experience through various economic cycles, industry or client concentrations, the loan portfolio composition and macroeconomic factors (both current and forecasted).  These factors have a potentially negative impact on loan performance and net charge-offs.\nWhile our bank loan portfolio is diversified, a significant downturn in the overall economy, deterioration in real estate values or a significant issue within any sector or sectors where we have a concentration will generally result in large provisions for credit losses and/or charge-offs.  We determine the allowance required for specific loan pools based on relative risk characteristics of the loan portfolio.  On an ongoing basis, we evaluate our methods for determining the allowance for each loan portfolio segment and make enhancements we consider appropriate.  Our allowance for credit losses methodology is described in Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K.  We segregate our bank loan portfolio into six loan portfolio segments, which also serve as classes of financing receivables for purposes of credit analysis.  See “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk” of our 2024 Form 10-K for further information about the risk characteristics relevant to each portfolio segment.\nThe level of charge-off activity is a factor that is considered in evaluating the potential severity of future credit losses.  The following table presents net loan (charge-offs)/recoveries and the annualized percentage of net loan (charge-offs)/recoveries to the average outstanding loan balances by loan portfolio segment.  \n \nThree months ended June 30,\nNine months ended June 30,\n \n2025\n2024\n2025\n2024\n$ in millions\nNet loan \n(charge-off)/recovery\namount\nAnnualized\n% of avg.\noutstanding\nloans\nNet loan \n(charge-off)/recovery\namount\nAnnualized\n% of avg.\noutstanding\nloans\nNet loan \n(charge-off)/recovery\namount\nAnnualized\n% of avg.\noutstanding\nloans\nNet loan \n(charge-off)/recovery\namount\nAnnualized\n% of avg.\noutstanding\nloans\nC&I loans\n$\n(3)\n0.12\n \n%\n$\n(6)\n0.24 \n%\n$\n(15)\n0.19\n \n%\n$\n(35)\n0.45 \n%\nCRE loans\n—\n \n—\n \n%\n(1)\n0.05 \n%\n(7)\n0.12\n \n%\n(8)\n0.14 \n%\nResidential mortgage loans\n—\n \n—\n \n%\n1 \n0.04 \n%\n—\n \n—\n \n%\n1 \n0.09 \n%\nTotal loans held for investment\n$\n(3)\n0.02\n \n%\n$\n(6)\n0.05 \n%\n$\n(22)\n0.06\n \n%\n$\n(42)\n0.13 \n%\n89\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe level of nonperforming assets is another indicator of potential future credit losses.  Nonperforming assets are comprised of both nonperforming loans and other real estate owned.  Nonperforming loans include those loans which have been placed on nonaccrual status and any accruing loans which are 90 days or more past due and in the process of collection.  The following table presents the balance of nonperforming loans, nonperforming assets, and related key credit ratios. \n$ in millions\nJune 30, 2025\nSeptember 30, 2024\nNonperforming loans \n(1)\n$\n214\n \n$\n175 \nNonperforming assets\n$\n214\n \n$\n175 \nNonperforming loans as a % of total loans held for sale and investment\n0.43\n \n%\n0.38 \n%\nAllowance for credit losses as a % of nonperforming loans\n217\n \n%\n261 \n%\nNonperforming assets as a % of Bank segment total assets\n0.34\n \n%\n0.28 \n%\n(1)\nNonperforming loans at June 30, 2025 and September 30, 2024 included $127 million and $89 million, respectively, of loans, which were current pursuant to their contractual terms.\nSee the table summarizing nonaccrual loans by portfolio segment in Note 7 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information.  \nAlthough our nonperforming assets as a percentage of our Bank segment’s assets remained low as of June 30, 2025, any prolonged period of market deterioration could result in an increase in our nonperforming assets, an increase in our allowance for credit losses and/or an increase in net charge-offs in future periods, although the extent would depend on future developments that are highly uncertain.\nSee further explanation of our bank loan portfolio segments, allowance for credit losses, and the credit loss provision in Note 7 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q and “Management’s Discussion and Analysis - Results of Operations - Bank” of this Form 10-Q and Note 2 of the Notes to Consolidated Financial Statements of our 2024 Form 10-K.\nLoan underwriting policies\nOur underwriting policies for the major types of bank loans are described in “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk” of our 2024 Form 10-K.  \nRisk monitoring process\nAnother component of credit risk strategy for our bank loan portfolio is the ongoing risk monitoring and review processes, including our independent loan review process, as well as our processes to manage and limit credit losses arising from loan delinquencies.  There are various other factors included in these processes, depending on the loan portfolio.  There were no significant changes to those processes during the three months ended June 30, 2025.  See further discussion of our risk monitoring process in “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk - Banking activities” of our 2024 Form 10-K.\nSBL and residential mortgage loan portfolios\nSubstantially all collateral securing our SBL portfolio is monitored on a daily basis.  Collateral adjustments, as triggered by our monitoring procedures, are made by the borrower as necessary to ensure our loans are adequately secured, resulting in minimizing our credit risk.\nWe track and review many factors to monitor credit risk in our residential mortgage loan portfolio.  The factors include, but are not limited to: loan performance trends, loan product parameters and qualification requirements, borrower credit scores, level of documentation, loan purpose, geographic concentrations, average loan size, risk rating, and LTV ratios.  See Note 7 of the Notes to the Condensed Consolidated Financial Statements of this Form 10-Q for additional information.\n90\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nThe following table presents a summary of delinquent residential mortgage loans, the vast majority of which are first mortgage loans, which are comprised of loans which are two or more payments past due as well as loans in the process of foreclosure.  \n \nAmount of delinquent residential mortgage loans \nDelinquent residential mortgage loans as a percentage of outstanding residential mortgage loan balances\n$ in millions\n30-89 days\n90 days or more\nTotal\n30-89 days\n90 days or more\nTotal\nJune 30, 2025\n$\n3\n \n$\n10\n \n$\n13\n \n0.03\n \n%\n0.10\n \n%\n0.13\n \n%\nSeptember 30, 2024\n$\n6 \n$\n8 \n$\n14 \n0.07 \n%\n0.08 \n%\n0.15 \n%\nOur June 30, 2025 percentage of over 30 day delinquent residential mortgage loans compares favorably to the national average of 1.91%, as most recently reported by the Fed.\nCredit risk is also managed by diversifying the residential mortgage portfolio.  Most of the loans in our residential loan portfolio are to PCG clients across the U.S.  The following table details the geographic concentrations (top five states) of our one-to-four family residential mortgage loans. \nJune 30, 2025\nLoans outstanding as a % of\ntotal residential mortgage loans held for sale and investment\nLoans outstanding as a % of \ntotal loans held for sale and investment\nCalifornia\n22%\n4%\nFlorida\n18%\n4%\nTexas\n8%\n2%\nNew York\n7%\n1%\nColorado\n4%\n1%\nThe occurrence of a natural disaster or severe weather event in any of these states, for example wildfires in California and hurricanes in Florida, could result in additional credit loss provisions and/or charge-offs on our loans in such states and therefore negatively impact our net income and regulatory capital in any given period. \nLoans where borrowers may be subject to payment increases include adjustable rate mortgage loans with terms that initially require payment of interest only.  Payments may increase significantly when the interest-only period ends and the loan principal begins to amortize.  At June 30, 2025 and September 30, 2024, these loans totaled $2.97 billion and $2.96 billion, respectively, or approximately 30% and 31% of the residential mortgage portfolio, respectively.  The weighted-average number of years before the remainder of the loans, which were still in their interest-only period at June 30, 2025, begins amortizing is five years. \nCorporate and tax-exempt loans\nWe closely monitor economic and other factors that may impact our borrowers and corporate loan portfolio which could impact our provision for credit losses in future periods.  Credit risk in our corporate and tax-exempt loan portfolios is monitored on an individual loan basis for trends in borrower operating performance, payment history, credit ratings, collateral performance, loan covenant compliance, municipality demographics and other factors including industry performance and concentrations, geographic concentrations, and total relationship exposure.  In addition, credit quality trends are monitored by industry to determine if a change in the risk exposure to a certain industry may warrant incremental monitoring or tightening of our underwriting standards during times of market uncertainty.  We also utilize loan sales and other risk mitigation techniques to manage the size and risk profile of our corporate bank loans. \nOur corporate bank loan portfolio does not contain a significant concentration in any single industry.  The following table details the industry concentrations (top five categories) of our corporate bank loans.\nJune 30, 2025\nLoans outstanding as a % of \ntotal corporate bank loans held for sale and investment\nLoans outstanding as a % of \ntotal loans held for sale and investment\nMulti-family\n12%\n5%\nIndustrial warehouse\n10%\n4%\nLoan fund\n9%\n4%\nOffice real estate\n6%\n3%\nSubscription lines\n5%\n2%\n91\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES\nManagement’s Discussion and Analysis\nIndex\nRisks related to our CRE loans, specifically, office real estate loans, continue to be impacted by corporate remote work policies, pressure from the relatively high interest rate environment that persisted throughout most of our fiscal 2024, uncertainty related to tenant lease renewals, and elevated refinancing risk for loans with near-term maturities, among other issues.  As of June 30, 2025, our highest industry concentrations within our CRE portfolio were multi-family, industrial warehouse, and office real estate, and the concentrations of such loans were generally consistent with those for our corporate loan portfolio detailed in the preceding table.  Refer to “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Credit risk - Banking activities” of our 2024 Form 10-K for further information on our CRE loans and a discussion of our risk monitoring process for these loans.  There were no significant changes to those processes during the nine months ended June 30, 2025.  Refer to Note 7 of the Notes to Condensed Consolidated Financial Statements of this Form 10-Q for additional information on our credit metrics related to our CRE loan portfolio. \nLiquidity risk\nSee the section “Management’s Discussion and Analysis of Financial Condition and Results of Operations - Liquidity and capital resources” of this Form 10-Q for information regarding our liquidity and how we manage liquidity risk.\nOperational risk\nOperational risk generally refers to the risk of loss resulting from our operations, including, but not limited to, business disruptions, improper or unauthorized execution and processing of transactions, deficiencies in our technology or financial operating systems and inadequacies or breaches in our control processes, including cybersecurity incidents.  See “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Operational risk” of our 2024 Form 10-K for a discussion of our operational risk and certain of our risk mitigation processes.\nPeriods of severe market volatility can result in a significantly higher level of transactions on specific days, which may present operational challenges from time to time that may result in losses.  These losses can result from, but are not limited to, trade errors, failed transaction settlements, late collateral calls to borrowers and counterparties, or interruptions to our system processing.  We did not incur any significant losses related to such operational challenges during the nine months ended June 30, 2025 or 2024.\nAs more fully described in the discussion of our business technology risks included in various risk factors presented in “Item 1A - Risk Factors” and “Item 1C - Cybersecurity” of our 2024 Form 10-K, despite our implementation of protective measures and endeavoring to modify them as circumstances warrant, our computer systems, software and networks may be vulnerable to human error, natural disasters, power loss, cyber-attacks and other information security breaches, and other events that could have an impact on the security and stability of our operations.\nModel risk\nModel risk refers to the possibility of unintended business outcomes arising from the design, implementation or use of models.  See “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Model risk” of our 2024 Form 10-K for information regarding how we utilize models throughout the firm and how we manage model risk.\nCompliance risk\nCompliance risk is the risk of legal or regulatory sanctions, financial loss, or reputational damage that the firm may suffer from a failure to comply with applicable laws, external standards, or internal requirements.  See “Item 7 - Management’s Discussion and Analysis of Financial Condition and Results of Operations - Risk management - Compliance risk” of our 2024 Form 10-K for information on our compliance risks, including how we manage such risks.\n92\nRAYMOND JAMES FINANCIAL, INC. AND SUBSIDIARIES \nIndex"
}